{"id": "8180140", "contents": "1149 Tucker Carlson - \"Zelensky is using the secret police to extinguish traditional Christianity in Ukraine. How come no one in the US Congress seems to notice this?\" posted 2 days ago by Milward 150 comments award share report block Tucker Carlson @TuckerCarlson • 5d Zelensky is using the secret police to extinguish traditional Christianity in Ukraine. How come no one in the US Congress seems to notice this? (0:00) The Armenian Christian Persecution (9:50) Israel's Role in the Azerbaijan War Against Christians (12:26) The Armenian Prime\n150 comments Sort by Top Top New Worst Old Save mlp67 46 points 2 days ago They don't give a shit. They only care about 2% of the population who donate big money to them. There aren't big money Christian donors. permalink award report block reply HelluvaEngineer 30 points 2 days ago Maybe because there are no Christian central banks? permalink parent award report block reply Hanging_Chad 3 points 2 days ago does the Holy See have a central bank? permalink parent award report block reply HyperboreanGodTwink 3 points 2 days ago The Pope is anti MAGA so who cares permalink parent award report block reply PhilipeNegro 3 points 2 days ago Doesn’t sound very Christian permalink parent award report block reply invalid_data 18 points 2 days ago It has nothing to do with donors and everything to do with who controls Congress...one particular small nation. permalink parent award report block reply mlp67 10 points 2 days ago Same people permalink parent award report block reply ParadigmShift2070 4 points 2 days ago the American Italian public affairs committee permalink parent award report block reply BlackPilledMAGA 1 points 2 days ago We are the donors they are the launderers. permalink parent award report block reply Viewer01 7 points 2 days ago Well, there are but they go to churches like Joel Osteen and hear about muh judeo in their Christianity. Edit: they’re also all boomers, so def asleep on the issue. I figure the Tate bros are going to start funding candidates here soon. permalink parent award report block reply myke 6 points 2 days ago The solution is not \"well we need more Christian donors.\" The solution should be \"the issue is the influence of donation.\" permalink parent award report block reply mlp67 3 points 2 days ago I can agree with that. Outlaw lobbying and PACs permalink parent award report block reply Prussian_Pepe 1 points 2 days ago And who is gonna pass that law? The people who are making dirty money? permalink parent award report block reply mlp67 1 points 2 days ago Yup. Same people who vote on term limits. I know it's hopeless with them. I can think of no solutions at this point. permalink parent award report block reply view 1 more comments... NomadicKrow2 5 points 2 days ago Lindsey will get on it as soon as he's done taking those backshots permalink parent award report block reply load 4 more comments... BerettaStroker 39 points 2 days ago Cause this is what they want, duh, that's why they are ignoring it. If you asked a J who they would rather see extinguished off the face of the earth, Christians or Muslims, they choose Christians. permalink award report block reply Made_in_America 38 points 2 days ago Higher IQs = bigger threat to their global ambitions. They want a world where they can rule unchallenged. Given how sociopathic and genocidal they are as a group, it would be no exaggeration to describe a world ruled by Js as ‘Hell on earth’. permalink parent award report block reply BerettaStroker 18 points 2 days ago It actually goes back to a frothing, seething hatred of the Catholic church \"stealing\" their relics during the Crusades. permalink parent award report block reply Made_in_America 15 points 2 days ago Interesting. Regardless of where it started, for that resentment to carry over millennia, it’s locked into their genes at this point. It’s not a conflict that can be resolved politically. They are hard-wired to destroy us. I suspect that their anti-social tendencies were compounded by the fact that over the millennia their kindest people would have converted to the altruistic appeal of Christianity, leaving behind a growing genetic propensity for bitterness, selfishness and malice as the best tempered peopled left their gene pool to follow Christ. permalink parent award report block reply Viewer01 9 points 2 days ago At this point I support violent reconquest of the holy land just to put an end to this third temple business. permalink parent award report block reply lurkwellmyfriends 5 points 2 days ago I agree with the tone of this theead, but I have quite an issue with the Catholic church, too. Catholic \"charities\" are one of the biggest areas from whence the infinity invaders are trafficked in from. We've got issues all over the map. permalink parent award report block reply BerettaStroker 2 points 2 days ago I'm not Catholic so I don't really care either way, just giving some context to the origination of the hate. permalink parent award report block reply Prussian_Pepe 2 points 2 days ago It's much older than that. The Roman catholic group was infiltrated by them a long time ago. To the point they created their new \"zion\" through their physical \"church\" making it a political kingdom. They have had blood fueds with them since Jesus time. And even 800 years before that when the civil war happened and the Israelites rejected the Judeans and became separate kingdoms permalink parent award report block reply PelosisPuss -19 points 2 days ago Not even close. The answer to that is Muslims. permalink parent award report block reply BerettaStroker 21 points 2 days ago No, it's not. permalink parent award report block reply PelosisPuss 1 points 2 days ago Nah bro. J's hate Muslims way more. Christians are just useful, subservient idiots that submit way easier. permalink parent award report block reply BerettaStroker 2 points 2 days ago Incorrect, though modern day Christians may well be easier to submit. permalink parent award report block reply Wizard_Glick 22 points 2 days ago They were told by their handlers to ignore it... permalink award report block reply JimmyRussler 17 points 2 days ago Paid by their handlers to ignore it. permalink parent award report block reply peterthegreen 21 points 2 days ago Ted Cruz is on the warpath against Tucker for noticing. https://www.newsmax.com/us/ted-cruz-kevin-roberts-tucker-carlson/2025/11/07/id/1233717/ permalink award report block reply DefinitelyNotFed 17 points 2 days ago Tucker has had one of the decade's best redemption arcs. Ted Cruz continues to remain an overweight Israel first greaseball. permalink parent award report block reply BoltCarrierGroup 15 points 2 days ago Ted Cruz has revealed himself as a full Lindsey Graham copy permalink parent award report block reply HyperboreanGodTwink 0 points 2 days ago Let's be fair to both of them, they're both uniquely awful in their own, special, retarded way permalink parent award report block reply stylecouncilor 5 points 2 days ago He is a complete buffoon. permalink parent award report block reply SenorTrumper 5 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply Prof_Smith 15 points 2 days ago History will look back and find that Russia was the good guy in this conflict. permalink award report block reply BerettaStroker 14 points 2 days ago Of course it will, but ask how many people actually knew Zelensky was bombing his own people and killed about 14,000 of them before this bullshit popped off? permalink parent award report block reply PhilipeNegro 10 points 2 days ago I keep trying to tell people, but they won’t listen, even here permalink parent award report block reply Prussian_Pepe 0 points 2 days ago Almost all of us here actually. Its one of the most corrupt countries on earth. And it's scum have been infiltrating the US for decades. permalink parent award report block reply BerettaStroker 0 points 2 days ago Those of us here know it, I rarely have to argue with the the random retard about it anymore but normies still have zero clue. permalink parent award report block reply NoApologyTour 1 points 2 days ago You don’t need the benefit of history. You can see what id happening in real time. Ukraine has been provoking Russia and murdering Russians for the last 10 years. People are deliberately ignoring this, as well as the fact that Zelensky has suspended elections, outlawed political opposition, attacked the church, and stole billions of dollars. The same people that call Trump a dictator (and you a fascist for supporting him) are fawning over Zelensky. permalink parent award report block reply BaronFalcon 0 points 2 days ago Really? How do? Tell me what moral high road Russia has here? I don’t support either side they’re both bad and I’m sick of all the pro commie assholes like you simping for them here. permalink parent award report block reply Prof_Smith 1 points 2 days ago You know that Russia isn’t communist right?  They want to be an empire again.  Just like the United States and Europe. Russia is blowing up the people who are wasting our tax dollars.  Good enough. permalink parent award report block reply Prussian_Pepe 0 points 2 days ago commie assholes like you simping for them here. The Soviet union fell 34 years ago. Russia isn't communist anymore. It's a capitalist society. Why are you repeating cold war idiocy like the MSM? The soviets are gone. \"muh communism\" America is more socialist than modern Russia. Look at the 2000+ government agencies. SNAP ect. all communism. American corporatism is worse than the soviets ever where. Nearly every single problem this country faces is because of a government control, and regulations and authority. permalink parent award report block reply IAmTheScience -12 points 2 days ago No. There is nothing good about Russia. Not now or in the past. Read a history book. Putin and his friends have raped Russia and stolen anything it had of value for themselves. The people have very little chance to succeed and prosper. Human Rights are a joke to them. Two countries can both be bad. For example, in WW2 both Germany and Russia were bad. permalink parent award report block reply SenorTrumper 9 points 2 days ago Thanks for demonstrating how simpleton's think. permalink parent award report block reply Prussian_Pepe 1 points 2 days ago It's like I turned on the MSM, and heard boomer bob tell me about how \"muh russia\" is the bad. permalink parent award report block reply Prof_Smith 1 points 2 days ago Haha.  I think your tampon is leaking. permalink parent award report block reply IAmTheScience 0 points 2 days ago They went from a bunch of raping commies, to poor idiots ruled by gangsters. With zero human rights the whole way. You fuck have no idea what your grandparents fought for. Faggot permalink parent award report block reply Prof_Smith 0 points 2 days ago More bull shit human rights talk from you.   Reddit is back that way you disgusting liberal boot licker-> permalink parent award report block reply view 2 more comments... BoltCarrierGroup -5 points 2 days ago Yes 100% Russia is terrible, Ukraine is worse. Putin is still a communist dictator at heart. He would love to return to pre-1990 ussr if he could. permalink parent award report block reply RedStoneDeepState 1 points 2 days ago Putin isn't a communist dialogue. He is a generic benevolent dictator. permalink parent award report block reply BaronFalcon -1 points 2 days ago Man I can’t believe how many commie simps are here downvoting you. Wtf is happening to this place. permalink parent award report block reply bagel_fragility 12 points 2 days ago because the US congress serves Baal permalink award report block reply Prussian_Pepe 1 points 2 days ago Only the head ones. The lesser (idiot) ones still serve Mammon. Just like the rest of the banker crew. The mass idiots worship Mammon. The elites drink their blood. permalink parent award report block reply TheLeftIsAntiRight 1 points 2 days ago This is all retarded. permalink parent award report block reply LogicalSchizo 8 points 2 days ago Trump made peace in the middle east and that's great. Now he needs to stop giving Ukraine weapons. That war is not our problem. We can use deplomacy to try and end it but we shouldn't be involved militarily. permalink award report block reply Corporis 12 points 2 days ago Peace in the middle east?? Genocidal apartheid israel, a terrorist state, has not stopped bombing civilians in Gaza or civilians in the surrounding nations for even one day! permalink parent award report block reply BoricuaPede 0 points 2 days ago \"Genocide\" is the new \"racist.\" Your crowd has pounded it completely to death. permalink parent award report block reply RedStoneDeepState -12 points 2 days ago There is no such thing as a civilian in Gaza. Every man, woman, and child is an enemy combatant. Israel has refused to do mass slaughter in Gaza, but that should cease - they should mortar Gaza until the cockroaches stop twitching. permalink parent award report block reply SenorTrumper 3 points 2 days ago Hello Jesus Boi, https://i.imgur.com/EYpCfPP.png permalink parent award report block reply RedStoneDeepState -6 points 2 days ago I am Buddhist. permalink parent award report block reply view 5 more comments... Cuck-WTF 7 points 2 days ago It is a function of the U.S. military to crush Christianity in all foreign countries. It's in the civil affairs handbook and it's despicable. permalink award report block reply BaronFalcon 3 points 2 days ago which civil affairs handbook? UN? Army? Got a link? Never heard this before and I cant seem to find any mention in a search. permalink parent award report block reply Cuck-WTF 1 points 2 days ago Army permalink parent award report block reply Treefiddydiddy 7 points 2 days ago if tucker is actually 'controlled opposition' then he's not doing a very good job of it permalink award report block reply PatriotSkorzeny 7 points 2 days ago Haha they do it in the US. 🤡 Nobody cares about foreign countries. permalink award report block reply rebuildingMyself 6 points 2 days ago Got away with canceling elections and sending an entire generation of white boys to their death, so of course this is the next step. permalink award report block reply Wexit-Delecto 5 points 2 days ago That’s crazy! Why would Zelensky, a Slav with a long history of Orthodoxy, do this to his own people? permalink award report block reply SenorTrumper 9 points 2 days ago He's of The Chosen. permalink parent award report block reply Wexit-Delecto 9 points 2 days ago Oh shoot! Not another one doing the same thing they all do! How could this be? permalink parent award report block reply LordKuroTheGreat 5 points 2 days ago Because there is no atrocity too terrible for a neocon to facilitate as long as they personally profit. permalink award report block reply MemeLawd 4 points 2 days ago Congress doesn't care their master isn't Christ its those who killed him. permalink award report block reply Lurkmoore 1 points 2 days ago You killed Him. permalink parent award report block reply DITTOPatriot 3 points 2 days ago Pray for Tucker.  It's to late for JFK, RFK or Charlie . permalink award report block reply BillGateCanSuckIt 3 points 2 days ago Because they are addicted to the adrenochrome that is being produced over there permalink award report block reply Light_HIV_Effect 3 points 2 days ago They don't care about Ukraine. They care about sending military and equipment there so they can deplete our own stockpiles and make tons of money off Lockhead and other contractors stock prices going up when they announce new deals permalink award report block reply JoeBidensDementia1 3 points 2 days ago Because they're all Jewz permalink award report block reply SenorTrumper 2 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply Gnometard 3 points 2 days ago They're part of the communist revolution, they know what's going on but don't even need to feign outrage because they're laughing that people still ask these questions permalink award report block reply Riehlpissed 3 points 2 days ago Because they hate us law abiding tax payers. permalink award report block reply lurkwellmyfriends 2 points 2 days ago Doesn't impact Israel, yet, so it doesn't matter. permalink award report block reply Gayguy420 0 points 2 days ago This really goes both ways.  They’re two different issues.  Stop connecting everything to Israel so that other topics have room to breathe. If every topic you think is important comes up as “I care about this but no one else does because it isn’t Israel” then you’re contributing to the environment where everything is about Israel. permalink parent award report block reply FlyCatcher94 2 points 2 days ago Because the zionists didn’t tell them to care. permalink award report block reply alcowiggles 2 points 2 days ago Evangelical Christians and Protestants are Satanic by Default. permalink award report block reply SenorTrumper 3 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply Califunya 2 points 2 days ago It does not impact the deep states  $$$$ permalink award report block reply Spunas1 2 points 2 days ago Because the Bullhorn belongs to the NWO! 2 choices;   1) Create a bigger Bullhorn\n2) Smash their Bullhorn. permalink award report block reply blueeyephoto 2 points 2 days ago oh they notice. but the paychecks and kickbacks they're getting leads them to not care permalink award report block reply MegoThor 1 points 2 days ago Because they’re paid not to. permalink award report block reply PatPede1 1 points 2 days ago Because religion in communist countries is a lot more complicated than it is in the U.S.  Facts. permalink award report block reply CaptainTrouble 1 points 2 days ago Because Congress is in on it. Congress is owned by the people who own Zekenskyy permalink award report block reply patrioticwinning3 1 points 2 days ago Because it isn't a couple of towel heads attacking pissreal :p permalink award report block reply tuaris 1 points 2 days ago It's none of the United States concern what happens with christains, what happens in a foreign country, and what happens with christains in a foreign country. permalink award report block reply jsphere256 1 points 2 days ago If you attack Judaism, you are attacking Christianity If you defend Christianity, you are attacking Judaism permalink award report block reply greatpumpkin 1 points 2 days ago Their handlers told them not to notice. permalink award report block reply ArnoldF 1 points 2 days ago Most of them wish to extinguish it everywhere. permalink award report block reply hansgruber7 -3 points 2 days ago Go ahead and downvote but Tucker Carlson is not on our side.  Remember when he was best friends with Hunter?  When he weirdly said something got mailed to him and disappeared?  When he didn't report on the laptop or election fraud?  When he convinced Trump to shutdown during Covid?  When he brought that obvious fed plant Fuentes on his show to promote him?  He is a fraud. permalink award report block reply flp999 -4 points 2 days ago Better and more important question: how come no one in Congress, and not Tucker Carlson either, will acknowledge that it’s the U.S., particularly the CIA, that run Ukraine and set every policy in the country? It’s not an anti-Christian thing. It’s an anti all religion thing. It’s the same classic New Man/New Society scheme that’s been run in every totalitarian play since the beginning of the 20th Century. Communism, Fascism, Nazism, Polpotism, etc. Tucker is such an agenda tool with his little misdirection bullshit. Child of the CIA, child of the financial overlords that run the deal and reside in his beloved Socialist country Sweden. permalink award report block reply NoticesBugleOWO -7 points 2 days ago Absolute retardation. Tucker has jumped the shark in his jew-hatred. He is a snake in snake's clothing. Watch this and be informed: https://www.youtube.com/watch?v=nMW7YeaZV1A permalink award report block reply sir_rockness 9 points 2 days ago Ok rabbi permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago OK nazi. permalink parent award report block reply Wexit-Delecto 8 points 2 days ago It’s “Jew hatred” to point out a Jew destroying the Orthodox Church? Aren’t you concerned about the manifest Christian-hating taking place? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago No, it's Jew-hatred to hate Jews. And no one is destroying the Orthodox Church, that's a lie. But you go and believe whatever George Stephanopoulos' sister says because retards like you will believe anything that confirms your bias. permalink parent award report block reply Wexit-Delecto 0 points 2 days ago What is it if Jews hate Whites and Jesus? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago You think ALL Jews hate whites and Jesus, who himself was a Jew??? permalink parent award report block reply view 13 more comments... SenorTrumper 3 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply OlivaireBandaloo 1 points 2 days ago Thank you for saying this. Its time for Christains to wake up. permalink parent award report block reply TheDevilMonkey 0 points 2 days ago Go take a shower rabbi. permalink parent award report block reply NoticesBugleOWO 0 points 2 days ago Watch the video, nazi. permalink parent award report block reply TheDevilMonkey 1 points 5 hours ago Eat shit k ik e. permalink parent award report block reply SenorTrumper 0 points 2 days ago How does it feel being a treasonous snake? Are you even an American? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago I'm more American than you'll ever be, nazi. permalink parent award report block reply SenorTrumper 0 points 2 days ago LOL You treasonous arsehole. permalink parent award report block reply NoticesBugleOWO 0 points 2 days ago Treason for pointing out Cucker Qatarlson is a hack? Sorry faggot, I don't live in the United States of Qatar, nor did I serve in its military. I owe Cucker nothing. permalink parent award report block reply view 4 more comments... possibletower -9 points 2 days ago Fucker Carlson the spook son of a CIA spook. Fuck this sack of shit. https://www.the-independent.com/news/world/americas/us-politics/tucker-carlson-father-cia-tpusa-question-b2850332.html permalink award report block reply Wexit-Delecto 11 points 2 days ago I wonder why all the pro-Israel posters are also so pro-Zelensky? What is it about Zelensky, a Jew who came to be in charge of the Slavic, Christian country of the Ukraine and who uses his authority to kill Slavic males and smash the Orthodox Christian church, that appeals to the Israel-posters? permalink parent award report block reply SenorTrumper 9 points 2 days ago ^America-hating shill spotted.^ permalink parent award report block reply HoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply Thune 1 points 2 days ago Comment removed by community moderators, pending further review. permalink award report block reply LordCommissarYarrick 0 points 2 days ago Comment removed by community filter. permalink award report block reply\nmlp67 46 points 2 days ago They don't give a shit. They only care about 2% of the population who donate big money to them. There aren't big money Christian donors. permalink award report block reply HelluvaEngineer 30 points 2 days ago Maybe because there are no Christian central banks? permalink parent award report block reply Hanging_Chad 3 points 2 days ago does the Holy See have a central bank? permalink parent award report block reply HyperboreanGodTwink 3 points 2 days ago The Pope is anti MAGA so who cares permalink parent award report block reply PhilipeNegro 3 points 2 days ago Doesn’t sound very Christian permalink parent award report block reply invalid_data 18 points 2 days ago It has nothing to do with donors and everything to do with who controls Congress...one particular small nation. permalink parent award report block reply mlp67 10 points 2 days ago Same people permalink parent award report block reply ParadigmShift2070 4 points 2 days ago the American Italian public affairs committee permalink parent award report block reply BlackPilledMAGA 1 points 2 days ago We are the donors they are the launderers. permalink parent award report block reply Viewer01 7 points 2 days ago Well, there are but they go to churches like Joel Osteen and hear about muh judeo in their Christianity. Edit: they’re also all boomers, so def asleep on the issue. I figure the Tate bros are going to start funding candidates here soon. permalink parent award report block reply myke 6 points 2 days ago The solution is not \"well we need more Christian donors.\" The solution should be \"the issue is the influence of donation.\" permalink parent award report block reply mlp67 3 points 2 days ago I can agree with that. Outlaw lobbying and PACs permalink parent award report block reply Prussian_Pepe 1 points 2 days ago And who is gonna pass that law? The people who are making dirty money? permalink parent award report block reply mlp67 1 points 2 days ago Yup. Same people who vote on term limits. I know it's hopeless with them. I can think of no solutions at this point. permalink parent award report block reply view 1 more comments... NomadicKrow2 5 points 2 days ago Lindsey will get on it as soon as he's done taking those backshots permalink parent award report block reply load 4 more comments...\nHelluvaEngineer 30 points 2 days ago Maybe because there are no Christian central banks? permalink parent award report block reply Hanging_Chad 3 points 2 days ago does the Holy See have a central bank? permalink parent award report block reply HyperboreanGodTwink 3 points 2 days ago The Pope is anti MAGA so who cares permalink parent award report block reply PhilipeNegro 3 points 2 days ago Doesn’t sound very Christian permalink parent award report block reply\nHanging_Chad 3 points 2 days ago does the Holy See have a central bank? permalink parent award report block reply HyperboreanGodTwink 3 points 2 days ago The Pope is anti MAGA so who cares permalink parent award report block reply PhilipeNegro 3 points 2 days ago Doesn’t sound very Christian permalink parent award report block reply\nHyperboreanGodTwink 3 points 2 days ago The Pope is anti MAGA so who cares permalink parent award report block reply\nPhilipeNegro 3 points 2 days ago Doesn’t sound very Christian permalink parent award report block reply\ninvalid_data 18 points 2 days ago It has nothing to do with donors and everything to do with who controls Congress...one particular small nation. permalink parent award report block reply mlp67 10 points 2 days ago Same people permalink parent award report block reply ParadigmShift2070 4 points 2 days ago the American Italian public affairs committee permalink parent award report block reply BlackPilledMAGA 1 points 2 days ago We are the donors they are the launderers. permalink parent award report block reply\nmlp67 10 points 2 days ago Same people permalink parent award report block reply\nParadigmShift2070 4 points 2 days ago the American Italian public affairs committee permalink parent award report block reply\nBlackPilledMAGA 1 points 2 days ago We are the donors they are the launderers. permalink parent award report block reply\nViewer01 7 points 2 days ago Well, there are but they go to churches like Joel Osteen and hear about muh judeo in their Christianity. Edit: they’re also all boomers, so def asleep on the issue. I figure the Tate bros are going to start funding candidates here soon. permalink parent award report block reply\nmyke 6 points 2 days ago The solution is not \"well we need more Christian donors.\" The solution should be \"the issue is the influence of donation.\" permalink parent award report block reply mlp67 3 points 2 days ago I can agree with that. Outlaw lobbying and PACs permalink parent award report block reply Prussian_Pepe 1 points 2 days ago And who is gonna pass that law? The people who are making dirty money? permalink parent award report block reply mlp67 1 points 2 days ago Yup. Same people who vote on term limits. I know it's hopeless with them. I can think of no solutions at this point. permalink parent award report block reply view 1 more comments...\nmlp67 3 points 2 days ago I can agree with that. Outlaw lobbying and PACs permalink parent award report block reply Prussian_Pepe 1 points 2 days ago And who is gonna pass that law? The people who are making dirty money? permalink parent award report block reply mlp67 1 points 2 days ago Yup. Same people who vote on term limits. I know it's hopeless with them. I can think of no solutions at this point. permalink parent award report block reply view 1 more comments...\nPrussian_Pepe 1 points 2 days ago And who is gonna pass that law? The people who are making dirty money? permalink parent award report block reply mlp67 1 points 2 days ago Yup. Same people who vote on term limits. I know it's hopeless with them. I can think of no solutions at this point. permalink parent award report block reply view 1 more comments...\nmlp67 1 points 2 days ago Yup. Same people who vote on term limits. I know it's hopeless with them. I can think of no solutions at this point. permalink parent award report block reply view 1 more comments...\nNomadicKrow2 5 points 2 days ago Lindsey will get on it as soon as he's done taking those backshots permalink parent award report block reply\nBerettaStroker 39 points 2 days ago Cause this is what they want, duh, that's why they are ignoring it. If you asked a J who they would rather see extinguished off the face of the earth, Christians or Muslims, they choose Christians. permalink award report block reply Made_in_America 38 points 2 days ago Higher IQs = bigger threat to their global ambitions. They want a world where they can rule unchallenged. Given how sociopathic and genocidal they are as a group, it would be no exaggeration to describe a world ruled by Js as ‘Hell on earth’. permalink parent award report block reply BerettaStroker 18 points 2 days ago It actually goes back to a frothing, seething hatred of the Catholic church \"stealing\" their relics during the Crusades. permalink parent award report block reply Made_in_America 15 points 2 days ago Interesting. Regardless of where it started, for that resentment to carry over millennia, it’s locked into their genes at this point. It’s not a conflict that can be resolved politically. They are hard-wired to destroy us. I suspect that their anti-social tendencies were compounded by the fact that over the millennia their kindest people would have converted to the altruistic appeal of Christianity, leaving behind a growing genetic propensity for bitterness, selfishness and malice as the best tempered peopled left their gene pool to follow Christ. permalink parent award report block reply Viewer01 9 points 2 days ago At this point I support violent reconquest of the holy land just to put an end to this third temple business. permalink parent award report block reply lurkwellmyfriends 5 points 2 days ago I agree with the tone of this theead, but I have quite an issue with the Catholic church, too. Catholic \"charities\" are one of the biggest areas from whence the infinity invaders are trafficked in from. We've got issues all over the map. permalink parent award report block reply BerettaStroker 2 points 2 days ago I'm not Catholic so I don't really care either way, just giving some context to the origination of the hate. permalink parent award report block reply Prussian_Pepe 2 points 2 days ago It's much older than that. The Roman catholic group was infiltrated by them a long time ago. To the point they created their new \"zion\" through their physical \"church\" making it a political kingdom. They have had blood fueds with them since Jesus time. And even 800 years before that when the civil war happened and the Israelites rejected the Judeans and became separate kingdoms permalink parent award report block reply PelosisPuss -19 points 2 days ago Not even close. The answer to that is Muslims. permalink parent award report block reply BerettaStroker 21 points 2 days ago No, it's not. permalink parent award report block reply PelosisPuss 1 points 2 days ago Nah bro. J's hate Muslims way more. Christians are just useful, subservient idiots that submit way easier. permalink parent award report block reply BerettaStroker 2 points 2 days ago Incorrect, though modern day Christians may well be easier to submit. permalink parent award report block reply\nMade_in_America 38 points 2 days ago Higher IQs = bigger threat to their global ambitions. They want a world where they can rule unchallenged. Given how sociopathic and genocidal they are as a group, it would be no exaggeration to describe a world ruled by Js as ‘Hell on earth’. permalink parent award report block reply BerettaStroker 18 points 2 days ago It actually goes back to a frothing, seething hatred of the Catholic church \"stealing\" their relics during the Crusades. permalink parent award report block reply Made_in_America 15 points 2 days ago Interesting. Regardless of where it started, for that resentment to carry over millennia, it’s locked into their genes at this point. It’s not a conflict that can be resolved politically. They are hard-wired to destroy us. I suspect that their anti-social tendencies were compounded by the fact that over the millennia their kindest people would have converted to the altruistic appeal of Christianity, leaving behind a growing genetic propensity for bitterness, selfishness and malice as the best tempered peopled left their gene pool to follow Christ. permalink parent award report block reply Viewer01 9 points 2 days ago At this point I support violent reconquest of the holy land just to put an end to this third temple business. permalink parent award report block reply lurkwellmyfriends 5 points 2 days ago I agree with the tone of this theead, but I have quite an issue with the Catholic church, too. Catholic \"charities\" are one of the biggest areas from whence the infinity invaders are trafficked in from. We've got issues all over the map. permalink parent award report block reply BerettaStroker 2 points 2 days ago I'm not Catholic so I don't really care either way, just giving some context to the origination of the hate. permalink parent award report block reply Prussian_Pepe 2 points 2 days ago It's much older than that. The Roman catholic group was infiltrated by them a long time ago. To the point they created their new \"zion\" through their physical \"church\" making it a political kingdom. They have had blood fueds with them since Jesus time. And even 800 years before that when the civil war happened and the Israelites rejected the Judeans and became separate kingdoms permalink parent award report block reply\nBerettaStroker 18 points 2 days ago It actually goes back to a frothing, seething hatred of the Catholic church \"stealing\" their relics during the Crusades. permalink parent award report block reply Made_in_America 15 points 2 days ago Interesting. Regardless of where it started, for that resentment to carry over millennia, it’s locked into their genes at this point. It’s not a conflict that can be resolved politically. They are hard-wired to destroy us. I suspect that their anti-social tendencies were compounded by the fact that over the millennia their kindest people would have converted to the altruistic appeal of Christianity, leaving behind a growing genetic propensity for bitterness, selfishness and malice as the best tempered peopled left their gene pool to follow Christ. permalink parent award report block reply Viewer01 9 points 2 days ago At this point I support violent reconquest of the holy land just to put an end to this third temple business. permalink parent award report block reply lurkwellmyfriends 5 points 2 days ago I agree with the tone of this theead, but I have quite an issue with the Catholic church, too. Catholic \"charities\" are one of the biggest areas from whence the infinity invaders are trafficked in from. We've got issues all over the map. permalink parent award report block reply BerettaStroker 2 points 2 days ago I'm not Catholic so I don't really care either way, just giving some context to the origination of the hate. permalink parent award report block reply Prussian_Pepe 2 points 2 days ago It's much older than that. The Roman catholic group was infiltrated by them a long time ago. To the point they created their new \"zion\" through their physical \"church\" making it a political kingdom. They have had blood fueds with them since Jesus time. And even 800 years before that when the civil war happened and the Israelites rejected the Judeans and became separate kingdoms permalink parent award report block reply\nMade_in_America 15 points 2 days ago Interesting. Regardless of where it started, for that resentment to carry over millennia, it’s locked into their genes at this point. It’s not a conflict that can be resolved politically. They are hard-wired to destroy us. I suspect that their anti-social tendencies were compounded by the fact that over the millennia their kindest people would have converted to the altruistic appeal of Christianity, leaving behind a growing genetic propensity for bitterness, selfishness and malice as the best tempered peopled left their gene pool to follow Christ. permalink parent award report block reply\nViewer01 9 points 2 days ago At this point I support violent reconquest of the holy land just to put an end to this third temple business. permalink parent award report block reply\nlurkwellmyfriends 5 points 2 days ago I agree with the tone of this theead, but I have quite an issue with the Catholic church, too. Catholic \"charities\" are one of the biggest areas from whence the infinity invaders are trafficked in from. We've got issues all over the map. permalink parent award report block reply BerettaStroker 2 points 2 days ago I'm not Catholic so I don't really care either way, just giving some context to the origination of the hate. permalink parent award report block reply\nBerettaStroker 2 points 2 days ago I'm not Catholic so I don't really care either way, just giving some context to the origination of the hate. permalink parent award report block reply\nPrussian_Pepe 2 points 2 days ago It's much older than that. The Roman catholic group was infiltrated by them a long time ago. To the point they created their new \"zion\" through their physical \"church\" making it a political kingdom. They have had blood fueds with them since Jesus time. And even 800 years before that when the civil war happened and the Israelites rejected the Judeans and became separate kingdoms permalink parent award report block reply\nPelosisPuss -19 points 2 days ago Not even close. The answer to that is Muslims. permalink parent award report block reply BerettaStroker 21 points 2 days ago No, it's not. permalink parent award report block reply PelosisPuss 1 points 2 days ago Nah bro. J's hate Muslims way more. Christians are just useful, subservient idiots that submit way easier. permalink parent award report block reply BerettaStroker 2 points 2 days ago Incorrect, though modern day Christians may well be easier to submit. permalink parent award report block reply\nBerettaStroker 21 points 2 days ago No, it's not. permalink parent award report block reply PelosisPuss 1 points 2 days ago Nah bro. J's hate Muslims way more. Christians are just useful, subservient idiots that submit way easier. permalink parent award report block reply BerettaStroker 2 points 2 days ago Incorrect, though modern day Christians may well be easier to submit. permalink parent award report block reply\nPelosisPuss 1 points 2 days ago Nah bro. J's hate Muslims way more. Christians are just useful, subservient idiots that submit way easier. permalink parent award report block reply BerettaStroker 2 points 2 days ago Incorrect, though modern day Christians may well be easier to submit. permalink parent award report block reply\nBerettaStroker 2 points 2 days ago Incorrect, though modern day Christians may well be easier to submit. permalink parent award report block reply\nWizard_Glick 22 points 2 days ago They were told by their handlers to ignore it... permalink award report block reply JimmyRussler 17 points 2 days ago Paid by their handlers to ignore it. permalink parent award report block reply\nJimmyRussler 17 points 2 days ago Paid by their handlers to ignore it. permalink parent award report block reply\npeterthegreen 21 points 2 days ago Ted Cruz is on the warpath against Tucker for noticing. https://www.newsmax.com/us/ted-cruz-kevin-roberts-tucker-carlson/2025/11/07/id/1233717/ permalink award report block reply DefinitelyNotFed 17 points 2 days ago Tucker has had one of the decade's best redemption arcs. Ted Cruz continues to remain an overweight Israel first greaseball. permalink parent award report block reply BoltCarrierGroup 15 points 2 days ago Ted Cruz has revealed himself as a full Lindsey Graham copy permalink parent award report block reply HyperboreanGodTwink 0 points 2 days ago Let's be fair to both of them, they're both uniquely awful in their own, special, retarded way permalink parent award report block reply stylecouncilor 5 points 2 days ago He is a complete buffoon. permalink parent award report block reply SenorTrumper 5 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply\nDefinitelyNotFed 17 points 2 days ago Tucker has had one of the decade's best redemption arcs. Ted Cruz continues to remain an overweight Israel first greaseball. permalink parent award report block reply BoltCarrierGroup 15 points 2 days ago Ted Cruz has revealed himself as a full Lindsey Graham copy permalink parent award report block reply HyperboreanGodTwink 0 points 2 days ago Let's be fair to both of them, they're both uniquely awful in their own, special, retarded way permalink parent award report block reply\nBoltCarrierGroup 15 points 2 days ago Ted Cruz has revealed himself as a full Lindsey Graham copy permalink parent award report block reply HyperboreanGodTwink 0 points 2 days ago Let's be fair to both of them, they're both uniquely awful in their own, special, retarded way permalink parent award report block reply\nHyperboreanGodTwink 0 points 2 days ago Let's be fair to both of them, they're both uniquely awful in their own, special, retarded way permalink parent award report block reply\nstylecouncilor 5 points 2 days ago He is a complete buffoon. permalink parent award report block reply\nSenorTrumper 5 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply\nProf_Smith 15 points 2 days ago History will look back and find that Russia was the good guy in this conflict. permalink award report block reply BerettaStroker 14 points 2 days ago Of course it will, but ask how many people actually knew Zelensky was bombing his own people and killed about 14,000 of them before this bullshit popped off? permalink parent award report block reply PhilipeNegro 10 points 2 days ago I keep trying to tell people, but they won’t listen, even here permalink parent award report block reply Prussian_Pepe 0 points 2 days ago Almost all of us here actually. Its one of the most corrupt countries on earth. And it's scum have been infiltrating the US for decades. permalink parent award report block reply BerettaStroker 0 points 2 days ago Those of us here know it, I rarely have to argue with the the random retard about it anymore but normies still have zero clue. permalink parent award report block reply NoApologyTour 1 points 2 days ago You don’t need the benefit of history. You can see what id happening in real time. Ukraine has been provoking Russia and murdering Russians for the last 10 years. People are deliberately ignoring this, as well as the fact that Zelensky has suspended elections, outlawed political opposition, attacked the church, and stole billions of dollars. The same people that call Trump a dictator (and you a fascist for supporting him) are fawning over Zelensky. permalink parent award report block reply BaronFalcon 0 points 2 days ago Really? How do? Tell me what moral high road Russia has here? I don’t support either side they’re both bad and I’m sick of all the pro commie assholes like you simping for them here. permalink parent award report block reply Prof_Smith 1 points 2 days ago You know that Russia isn’t communist right?  They want to be an empire again.  Just like the United States and Europe. Russia is blowing up the people who are wasting our tax dollars.  Good enough. permalink parent award report block reply Prussian_Pepe 0 points 2 days ago commie assholes like you simping for them here. The Soviet union fell 34 years ago. Russia isn't communist anymore. It's a capitalist society. Why are you repeating cold war idiocy like the MSM? The soviets are gone. \"muh communism\" America is more socialist than modern Russia. Look at the 2000+ government agencies. SNAP ect. all communism. American corporatism is worse than the soviets ever where. Nearly every single problem this country faces is because of a government control, and regulations and authority. permalink parent award report block reply IAmTheScience -12 points 2 days ago No. There is nothing good about Russia. Not now or in the past. Read a history book. Putin and his friends have raped Russia and stolen anything it had of value for themselves. The people have very little chance to succeed and prosper. Human Rights are a joke to them. Two countries can both be bad. For example, in WW2 both Germany and Russia were bad. permalink parent award report block reply SenorTrumper 9 points 2 days ago Thanks for demonstrating how simpleton's think. permalink parent award report block reply Prussian_Pepe 1 points 2 days ago It's like I turned on the MSM, and heard boomer bob tell me about how \"muh russia\" is the bad. permalink parent award report block reply Prof_Smith 1 points 2 days ago Haha.  I think your tampon is leaking. permalink parent award report block reply IAmTheScience 0 points 2 days ago They went from a bunch of raping commies, to poor idiots ruled by gangsters. With zero human rights the whole way. You fuck have no idea what your grandparents fought for. Faggot permalink parent award report block reply Prof_Smith 0 points 2 days ago More bull shit human rights talk from you.   Reddit is back that way you disgusting liberal boot licker-> permalink parent award report block reply view 2 more comments... BoltCarrierGroup -5 points 2 days ago Yes 100% Russia is terrible, Ukraine is worse. Putin is still a communist dictator at heart. He would love to return to pre-1990 ussr if he could. permalink parent award report block reply RedStoneDeepState 1 points 2 days ago Putin isn't a communist dialogue. He is a generic benevolent dictator. permalink parent award report block reply BaronFalcon -1 points 2 days ago Man I can’t believe how many commie simps are here downvoting you. Wtf is happening to this place. permalink parent award report block reply\nBerettaStroker 14 points 2 days ago Of course it will, but ask how many people actually knew Zelensky was bombing his own people and killed about 14,000 of them before this bullshit popped off? permalink parent award report block reply PhilipeNegro 10 points 2 days ago I keep trying to tell people, but they won’t listen, even here permalink parent award report block reply Prussian_Pepe 0 points 2 days ago Almost all of us here actually. Its one of the most corrupt countries on earth. And it's scum have been infiltrating the US for decades. permalink parent award report block reply BerettaStroker 0 points 2 days ago Those of us here know it, I rarely have to argue with the the random retard about it anymore but normies still have zero clue. permalink parent award report block reply\nPhilipeNegro 10 points 2 days ago I keep trying to tell people, but they won’t listen, even here permalink parent award report block reply\nPrussian_Pepe 0 points 2 days ago Almost all of us here actually. Its one of the most corrupt countries on earth. And it's scum have been infiltrating the US for decades. permalink parent award report block reply BerettaStroker 0 points 2 days ago Those of us here know it, I rarely have to argue with the the random retard about it anymore but normies still have zero clue. permalink parent award report block reply\nBerettaStroker 0 points 2 days ago Those of us here know it, I rarely have to argue with the the random retard about it anymore but normies still have zero clue. permalink parent award report block reply\nNoApologyTour 1 points 2 days ago You don’t need the benefit of history. You can see what id happening in real time. Ukraine has been provoking Russia and murdering Russians for the last 10 years. People are deliberately ignoring this, as well as the fact that Zelensky has suspended elections, outlawed political opposition, attacked the church, and stole billions of dollars. The same people that call Trump a dictator (and you a fascist for supporting him) are fawning over Zelensky. permalink parent award report block reply\nBaronFalcon 0 points 2 days ago Really? How do? Tell me what moral high road Russia has here? I don’t support either side they’re both bad and I’m sick of all the pro commie assholes like you simping for them here. permalink parent award report block reply Prof_Smith 1 points 2 days ago You know that Russia isn’t communist right?  They want to be an empire again.  Just like the United States and Europe. Russia is blowing up the people who are wasting our tax dollars.  Good enough. permalink parent award report block reply Prussian_Pepe 0 points 2 days ago commie assholes like you simping for them here. The Soviet union fell 34 years ago. Russia isn't communist anymore. It's a capitalist society. Why are you repeating cold war idiocy like the MSM? The soviets are gone. \"muh communism\" America is more socialist than modern Russia. Look at the 2000+ government agencies. SNAP ect. all communism. American corporatism is worse than the soviets ever where. Nearly every single problem this country faces is because of a government control, and regulations and authority. permalink parent award report block reply\nProf_Smith 1 points 2 days ago You know that Russia isn’t communist right?  They want to be an empire again.  Just like the United States and Europe. Russia is blowing up the people who are wasting our tax dollars.  Good enough. permalink parent award report block reply\nPrussian_Pepe 0 points 2 days ago commie assholes like you simping for them here. The Soviet union fell 34 years ago. Russia isn't communist anymore. It's a capitalist society. Why are you repeating cold war idiocy like the MSM? The soviets are gone. \"muh communism\" America is more socialist than modern Russia. Look at the 2000+ government agencies. SNAP ect. all communism. American corporatism is worse than the soviets ever where. Nearly every single problem this country faces is because of a government control, and regulations and authority. permalink parent award report block reply\nIAmTheScience -12 points 2 days ago No. There is nothing good about Russia. Not now or in the past. Read a history book. Putin and his friends have raped Russia and stolen anything it had of value for themselves. The people have very little chance to succeed and prosper. Human Rights are a joke to them. Two countries can both be bad. For example, in WW2 both Germany and Russia were bad. permalink parent award report block reply SenorTrumper 9 points 2 days ago Thanks for demonstrating how simpleton's think. permalink parent award report block reply Prussian_Pepe 1 points 2 days ago It's like I turned on the MSM, and heard boomer bob tell me about how \"muh russia\" is the bad. permalink parent award report block reply Prof_Smith 1 points 2 days ago Haha.  I think your tampon is leaking. permalink parent award report block reply IAmTheScience 0 points 2 days ago They went from a bunch of raping commies, to poor idiots ruled by gangsters. With zero human rights the whole way. You fuck have no idea what your grandparents fought for. Faggot permalink parent award report block reply Prof_Smith 0 points 2 days ago More bull shit human rights talk from you.   Reddit is back that way you disgusting liberal boot licker-> permalink parent award report block reply view 2 more comments... BoltCarrierGroup -5 points 2 days ago Yes 100% Russia is terrible, Ukraine is worse. Putin is still a communist dictator at heart. He would love to return to pre-1990 ussr if he could. permalink parent award report block reply RedStoneDeepState 1 points 2 days ago Putin isn't a communist dialogue. He is a generic benevolent dictator. permalink parent award report block reply BaronFalcon -1 points 2 days ago Man I can’t believe how many commie simps are here downvoting you. Wtf is happening to this place. permalink parent award report block reply\nSenorTrumper 9 points 2 days ago Thanks for demonstrating how simpleton's think. permalink parent award report block reply Prussian_Pepe 1 points 2 days ago It's like I turned on the MSM, and heard boomer bob tell me about how \"muh russia\" is the bad. permalink parent award report block reply\nPrussian_Pepe 1 points 2 days ago It's like I turned on the MSM, and heard boomer bob tell me about how \"muh russia\" is the bad. permalink parent award report block reply\nProf_Smith 1 points 2 days ago Haha.  I think your tampon is leaking. permalink parent award report block reply IAmTheScience 0 points 2 days ago They went from a bunch of raping commies, to poor idiots ruled by gangsters. With zero human rights the whole way. You fuck have no idea what your grandparents fought for. Faggot permalink parent award report block reply Prof_Smith 0 points 2 days ago More bull shit human rights talk from you.   Reddit is back that way you disgusting liberal boot licker-> permalink parent award report block reply view 2 more comments...\nIAmTheScience 0 points 2 days ago They went from a bunch of raping commies, to poor idiots ruled by gangsters. With zero human rights the whole way. You fuck have no idea what your grandparents fought for. Faggot permalink parent award report block reply Prof_Smith 0 points 2 days ago More bull shit human rights talk from you.   Reddit is back that way you disgusting liberal boot licker-> permalink parent award report block reply view 2 more comments...\nProf_Smith 0 points 2 days ago More bull shit human rights talk from you.   Reddit is back that way you disgusting liberal boot licker-> permalink parent award report block reply view 2 more comments...\nBoltCarrierGroup -5 points 2 days ago Yes 100% Russia is terrible, Ukraine is worse. Putin is still a communist dictator at heart. He would love to return to pre-1990 ussr if he could. permalink parent award report block reply RedStoneDeepState 1 points 2 days ago Putin isn't a communist dialogue. He is a generic benevolent dictator. permalink parent award report block reply BaronFalcon -1 points 2 days ago Man I can’t believe how many commie simps are here downvoting you. Wtf is happening to this place. permalink parent award report block reply\nRedStoneDeepState 1 points 2 days ago Putin isn't a communist dialogue. He is a generic benevolent dictator. permalink parent award report block reply\nBaronFalcon -1 points 2 days ago Man I can’t believe how many commie simps are here downvoting you. Wtf is happening to this place. permalink parent award report block reply\nbagel_fragility 12 points 2 days ago because the US congress serves Baal permalink award report block reply Prussian_Pepe 1 points 2 days ago Only the head ones. The lesser (idiot) ones still serve Mammon. Just like the rest of the banker crew. The mass idiots worship Mammon. The elites drink their blood. permalink parent award report block reply TheLeftIsAntiRight 1 points 2 days ago This is all retarded. permalink parent award report block reply\nPrussian_Pepe 1 points 2 days ago Only the head ones. The lesser (idiot) ones still serve Mammon. Just like the rest of the banker crew. The mass idiots worship Mammon. The elites drink their blood. permalink parent award report block reply TheLeftIsAntiRight 1 points 2 days ago This is all retarded. permalink parent award report block reply\nTheLeftIsAntiRight 1 points 2 days ago This is all retarded. permalink parent award report block reply\nLogicalSchizo 8 points 2 days ago Trump made peace in the middle east and that's great. Now he needs to stop giving Ukraine weapons. That war is not our problem. We can use deplomacy to try and end it but we shouldn't be involved militarily. permalink award report block reply Corporis 12 points 2 days ago Peace in the middle east?? Genocidal apartheid israel, a terrorist state, has not stopped bombing civilians in Gaza or civilians in the surrounding nations for even one day! permalink parent award report block reply BoricuaPede 0 points 2 days ago \"Genocide\" is the new \"racist.\" Your crowd has pounded it completely to death. permalink parent award report block reply RedStoneDeepState -12 points 2 days ago There is no such thing as a civilian in Gaza. Every man, woman, and child is an enemy combatant. Israel has refused to do mass slaughter in Gaza, but that should cease - they should mortar Gaza until the cockroaches stop twitching. permalink parent award report block reply SenorTrumper 3 points 2 days ago Hello Jesus Boi, https://i.imgur.com/EYpCfPP.png permalink parent award report block reply RedStoneDeepState -6 points 2 days ago I am Buddhist. permalink parent award report block reply view 5 more comments...\nCorporis 12 points 2 days ago Peace in the middle east?? Genocidal apartheid israel, a terrorist state, has not stopped bombing civilians in Gaza or civilians in the surrounding nations for even one day! permalink parent award report block reply BoricuaPede 0 points 2 days ago \"Genocide\" is the new \"racist.\" Your crowd has pounded it completely to death. permalink parent award report block reply RedStoneDeepState -12 points 2 days ago There is no such thing as a civilian in Gaza. Every man, woman, and child is an enemy combatant. Israel has refused to do mass slaughter in Gaza, but that should cease - they should mortar Gaza until the cockroaches stop twitching. permalink parent award report block reply SenorTrumper 3 points 2 days ago Hello Jesus Boi, https://i.imgur.com/EYpCfPP.png permalink parent award report block reply RedStoneDeepState -6 points 2 days ago I am Buddhist. permalink parent award report block reply view 5 more comments...\nBoricuaPede 0 points 2 days ago \"Genocide\" is the new \"racist.\" Your crowd has pounded it completely to death. permalink parent award report block reply\nRedStoneDeepState -12 points 2 days ago There is no such thing as a civilian in Gaza. Every man, woman, and child is an enemy combatant. Israel has refused to do mass slaughter in Gaza, but that should cease - they should mortar Gaza until the cockroaches stop twitching. permalink parent award report block reply SenorTrumper 3 points 2 days ago Hello Jesus Boi, https://i.imgur.com/EYpCfPP.png permalink parent award report block reply RedStoneDeepState -6 points 2 days ago I am Buddhist. permalink parent award report block reply view 5 more comments...\nSenorTrumper 3 points 2 days ago Hello Jesus Boi, https://i.imgur.com/EYpCfPP.png permalink parent award report block reply RedStoneDeepState -6 points 2 days ago I am Buddhist. permalink parent award report block reply view 5 more comments...\nRedStoneDeepState -6 points 2 days ago I am Buddhist. permalink parent award report block reply view 5 more comments...\nCuck-WTF 7 points 2 days ago It is a function of the U.S. military to crush Christianity in all foreign countries. It's in the civil affairs handbook and it's despicable. permalink award report block reply BaronFalcon 3 points 2 days ago which civil affairs handbook? UN? Army? Got a link? Never heard this before and I cant seem to find any mention in a search. permalink parent award report block reply Cuck-WTF 1 points 2 days ago Army permalink parent award report block reply\nBaronFalcon 3 points 2 days ago which civil affairs handbook? UN? Army? Got a link? Never heard this before and I cant seem to find any mention in a search. permalink parent award report block reply Cuck-WTF 1 points 2 days ago Army permalink parent award report block reply\nCuck-WTF 1 points 2 days ago Army permalink parent award report block reply\nTreefiddydiddy 7 points 2 days ago if tucker is actually 'controlled opposition' then he's not doing a very good job of it permalink award report block reply\nPatriotSkorzeny 7 points 2 days ago Haha they do it in the US. 🤡 Nobody cares about foreign countries. permalink award report block reply\nrebuildingMyself 6 points 2 days ago Got away with canceling elections and sending an entire generation of white boys to their death, so of course this is the next step. permalink award report block reply\nWexit-Delecto 5 points 2 days ago That’s crazy! Why would Zelensky, a Slav with a long history of Orthodoxy, do this to his own people? permalink award report block reply SenorTrumper 9 points 2 days ago He's of The Chosen. permalink parent award report block reply Wexit-Delecto 9 points 2 days ago Oh shoot! Not another one doing the same thing they all do! How could this be? permalink parent award report block reply\nSenorTrumper 9 points 2 days ago He's of The Chosen. permalink parent award report block reply Wexit-Delecto 9 points 2 days ago Oh shoot! Not another one doing the same thing they all do! How could this be? permalink parent award report block reply\nWexit-Delecto 9 points 2 days ago Oh shoot! Not another one doing the same thing they all do! How could this be? permalink parent award report block reply\nLordKuroTheGreat 5 points 2 days ago Because there is no atrocity too terrible for a neocon to facilitate as long as they personally profit. permalink award report block reply\nMemeLawd 4 points 2 days ago Congress doesn't care their master isn't Christ its those who killed him. permalink award report block reply Lurkmoore 1 points 2 days ago You killed Him. permalink parent award report block reply\nLurkmoore 1 points 2 days ago You killed Him. permalink parent award report block reply\nDITTOPatriot 3 points 2 days ago Pray for Tucker.  It's to late for JFK, RFK or Charlie . permalink award report block reply\nBillGateCanSuckIt 3 points 2 days ago Because they are addicted to the adrenochrome that is being produced over there permalink award report block reply\nLight_HIV_Effect 3 points 2 days ago They don't care about Ukraine. They care about sending military and equipment there so they can deplete our own stockpiles and make tons of money off Lockhead and other contractors stock prices going up when they announce new deals permalink award report block reply\nJoeBidensDementia1 3 points 2 days ago Because they're all Jewz permalink award report block reply SenorTrumper 2 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply\nSenorTrumper 2 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply\nGnometard 3 points 2 days ago They're part of the communist revolution, they know what's going on but don't even need to feign outrage because they're laughing that people still ask these questions permalink award report block reply\nRiehlpissed 3 points 2 days ago Because they hate us law abiding tax payers. permalink award report block reply\nlurkwellmyfriends 2 points 2 days ago Doesn't impact Israel, yet, so it doesn't matter. permalink award report block reply Gayguy420 0 points 2 days ago This really goes both ways.  They’re two different issues.  Stop connecting everything to Israel so that other topics have room to breathe. If every topic you think is important comes up as “I care about this but no one else does because it isn’t Israel” then you’re contributing to the environment where everything is about Israel. permalink parent award report block reply\nGayguy420 0 points 2 days ago This really goes both ways.  They’re two different issues.  Stop connecting everything to Israel so that other topics have room to breathe. If every topic you think is important comes up as “I care about this but no one else does because it isn’t Israel” then you’re contributing to the environment where everything is about Israel. permalink parent award report block reply\nFlyCatcher94 2 points 2 days ago Because the zionists didn’t tell them to care. permalink award report block reply\nalcowiggles 2 points 2 days ago Evangelical Christians and Protestants are Satanic by Default. permalink award report block reply SenorTrumper 3 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply\nSenorTrumper 3 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply\nCalifunya 2 points 2 days ago It does not impact the deep states  $$$$ permalink award report block reply\nSpunas1 2 points 2 days ago Because the Bullhorn belongs to the NWO! 2 choices;   1) Create a bigger Bullhorn\n2) Smash their Bullhorn. permalink award report block reply\nblueeyephoto 2 points 2 days ago oh they notice. but the paychecks and kickbacks they're getting leads them to not care permalink award report block reply\nMegoThor 1 points 2 days ago Because they’re paid not to. permalink award report block reply\nPatPede1 1 points 2 days ago Because religion in communist countries is a lot more complicated than it is in the U.S.  Facts. permalink award report block reply\nCaptainTrouble 1 points 2 days ago Because Congress is in on it. Congress is owned by the people who own Zekenskyy permalink award report block reply\npatrioticwinning3 1 points 2 days ago Because it isn't a couple of towel heads attacking pissreal :p permalink award report block reply\ntuaris 1 points 2 days ago It's none of the United States concern what happens with christains, what happens in a foreign country, and what happens with christains in a foreign country. permalink award report block reply\njsphere256 1 points 2 days ago If you attack Judaism, you are attacking Christianity If you defend Christianity, you are attacking Judaism permalink award report block reply\ngreatpumpkin 1 points 2 days ago Their handlers told them not to notice. permalink award report block reply\nArnoldF 1 points 2 days ago Most of them wish to extinguish it everywhere. permalink award report block reply\nhansgruber7 -3 points 2 days ago Go ahead and downvote but Tucker Carlson is not on our side.  Remember when he was best friends with Hunter?  When he weirdly said something got mailed to him and disappeared?  When he didn't report on the laptop or election fraud?  When he convinced Trump to shutdown during Covid?  When he brought that obvious fed plant Fuentes on his show to promote him?  He is a fraud. permalink award report block reply\nflp999 -4 points 2 days ago Better and more important question: how come no one in Congress, and not Tucker Carlson either, will acknowledge that it’s the U.S., particularly the CIA, that run Ukraine and set every policy in the country? It’s not an anti-Christian thing. It’s an anti all religion thing. It’s the same classic New Man/New Society scheme that’s been run in every totalitarian play since the beginning of the 20th Century. Communism, Fascism, Nazism, Polpotism, etc. Tucker is such an agenda tool with his little misdirection bullshit. Child of the CIA, child of the financial overlords that run the deal and reside in his beloved Socialist country Sweden. permalink award report block reply\nNoticesBugleOWO -7 points 2 days ago Absolute retardation. Tucker has jumped the shark in his jew-hatred. He is a snake in snake's clothing. Watch this and be informed: https://www.youtube.com/watch?v=nMW7YeaZV1A permalink award report block reply sir_rockness 9 points 2 days ago Ok rabbi permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago OK nazi. permalink parent award report block reply Wexit-Delecto 8 points 2 days ago It’s “Jew hatred” to point out a Jew destroying the Orthodox Church? Aren’t you concerned about the manifest Christian-hating taking place? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago No, it's Jew-hatred to hate Jews. And no one is destroying the Orthodox Church, that's a lie. But you go and believe whatever George Stephanopoulos' sister says because retards like you will believe anything that confirms your bias. permalink parent award report block reply Wexit-Delecto 0 points 2 days ago What is it if Jews hate Whites and Jesus? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago You think ALL Jews hate whites and Jesus, who himself was a Jew??? permalink parent award report block reply view 13 more comments... SenorTrumper 3 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply OlivaireBandaloo 1 points 2 days ago Thank you for saying this. Its time for Christains to wake up. permalink parent award report block reply TheDevilMonkey 0 points 2 days ago Go take a shower rabbi. permalink parent award report block reply NoticesBugleOWO 0 points 2 days ago Watch the video, nazi. permalink parent award report block reply TheDevilMonkey 1 points 5 hours ago Eat shit k ik e. permalink parent award report block reply SenorTrumper 0 points 2 days ago How does it feel being a treasonous snake? Are you even an American? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago I'm more American than you'll ever be, nazi. permalink parent award report block reply SenorTrumper 0 points 2 days ago LOL You treasonous arsehole. permalink parent award report block reply NoticesBugleOWO 0 points 2 days ago Treason for pointing out Cucker Qatarlson is a hack? Sorry faggot, I don't live in the United States of Qatar, nor did I serve in its military. I owe Cucker nothing. permalink parent award report block reply view 4 more comments...\nsir_rockness 9 points 2 days ago Ok rabbi permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago OK nazi. permalink parent award report block reply\nNoticesBugleOWO 1 points 2 days ago OK nazi. permalink parent award report block reply\nWexit-Delecto 8 points 2 days ago It’s “Jew hatred” to point out a Jew destroying the Orthodox Church? Aren’t you concerned about the manifest Christian-hating taking place? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago No, it's Jew-hatred to hate Jews. And no one is destroying the Orthodox Church, that's a lie. But you go and believe whatever George Stephanopoulos' sister says because retards like you will believe anything that confirms your bias. permalink parent award report block reply Wexit-Delecto 0 points 2 days ago What is it if Jews hate Whites and Jesus? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago You think ALL Jews hate whites and Jesus, who himself was a Jew??? permalink parent award report block reply view 13 more comments...\nNoticesBugleOWO 1 points 2 days ago No, it's Jew-hatred to hate Jews. And no one is destroying the Orthodox Church, that's a lie. But you go and believe whatever George Stephanopoulos' sister says because retards like you will believe anything that confirms your bias. permalink parent award report block reply Wexit-Delecto 0 points 2 days ago What is it if Jews hate Whites and Jesus? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago You think ALL Jews hate whites and Jesus, who himself was a Jew??? permalink parent award report block reply view 13 more comments...\nWexit-Delecto 0 points 2 days ago What is it if Jews hate Whites and Jesus? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago You think ALL Jews hate whites and Jesus, who himself was a Jew??? permalink parent award report block reply view 13 more comments...\nNoticesBugleOWO 1 points 2 days ago You think ALL Jews hate whites and Jesus, who himself was a Jew??? permalink parent award report block reply view 13 more comments...\nSenorTrumper 3 points 2 days ago https://i.imgur.com/EYpCfPP.png permalink parent award report block reply OlivaireBandaloo 1 points 2 days ago Thank you for saying this. Its time for Christains to wake up. permalink parent award report block reply\nOlivaireBandaloo 1 points 2 days ago Thank you for saying this. Its time for Christains to wake up. permalink parent award report block reply\nTheDevilMonkey 0 points 2 days ago Go take a shower rabbi. permalink parent award report block reply NoticesBugleOWO 0 points 2 days ago Watch the video, nazi. permalink parent award report block reply TheDevilMonkey 1 points 5 hours ago Eat shit k ik e. permalink parent award report block reply\nNoticesBugleOWO 0 points 2 days ago Watch the video, nazi. permalink parent award report block reply TheDevilMonkey 1 points 5 hours ago Eat shit k ik e. permalink parent award report block reply\nTheDevilMonkey 1 points 5 hours ago Eat shit k ik e. permalink parent award report block reply\nSenorTrumper 0 points 2 days ago How does it feel being a treasonous snake? Are you even an American? permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago I'm more American than you'll ever be, nazi. permalink parent award report block reply SenorTrumper 0 points 2 days ago LOL You treasonous arsehole. permalink parent award report block reply NoticesBugleOWO 0 points 2 days ago Treason for pointing out Cucker Qatarlson is a hack? Sorry faggot, I don't live in the United States of Qatar, nor did I serve in its military. I owe Cucker nothing. permalink parent award report block reply view 4 more comments...\nNoticesBugleOWO 1 points 2 days ago I'm more American than you'll ever be, nazi. permalink parent award report block reply SenorTrumper 0 points 2 days ago LOL You treasonous arsehole. permalink parent award report block reply NoticesBugleOWO 0 points 2 days ago Treason for pointing out Cucker Qatarlson is a hack? Sorry faggot, I don't live in the United States of Qatar, nor did I serve in its military. I owe Cucker nothing. permalink parent award report block reply view 4 more comments...\nSenorTrumper 0 points 2 days ago LOL You treasonous arsehole. permalink parent award report block reply NoticesBugleOWO 0 points 2 days ago Treason for pointing out Cucker Qatarlson is a hack? Sorry faggot, I don't live in the United States of Qatar, nor did I serve in its military. I owe Cucker nothing. permalink parent award report block reply view 4 more comments...\nNoticesBugleOWO 0 points 2 days ago Treason for pointing out Cucker Qatarlson is a hack? Sorry faggot, I don't live in the United States of Qatar, nor did I serve in its military. I owe Cucker nothing. permalink parent award report block reply view 4 more comments...\npossibletower -9 points 2 days ago Fucker Carlson the spook son of a CIA spook. Fuck this sack of shit. https://www.the-independent.com/news/world/americas/us-politics/tucker-carlson-father-cia-tpusa-question-b2850332.html permalink award report block reply Wexit-Delecto 11 points 2 days ago I wonder why all the pro-Israel posters are also so pro-Zelensky? What is it about Zelensky, a Jew who came to be in charge of the Slavic, Christian country of the Ukraine and who uses his authority to kill Slavic males and smash the Orthodox Christian church, that appeals to the Israel-posters? permalink parent award report block reply SenorTrumper 9 points 2 days ago ^America-hating shill spotted.^ permalink parent award report block reply\nWexit-Delecto 11 points 2 days ago I wonder why all the pro-Israel posters are also so pro-Zelensky? What is it about Zelensky, a Jew who came to be in charge of the Slavic, Christian country of the Ukraine and who uses his authority to kill Slavic males and smash the Orthodox Christian church, that appeals to the Israel-posters? permalink parent award report block reply\nSenorTrumper 9 points 2 days ago ^America-hating shill spotted.^ permalink parent award report block reply\nHoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nThune 1 points 2 days ago Comment removed by community moderators, pending further review. permalink award report block reply\nLordCommissarYarrick 0 points 2 days ago Comment removed by community filter. permalink award report block reply"}