{"id": "8180751", "contents": "1624 The Flood of Stunning New Evidence That J6 Was a Fedsurrection Can't Be Ignored (pjmedia.com) posted 2 days ago by Sea_Still 90 comments award share report block The Flood of Stunning New Evidence That J6 Was a Fedsurrection Can't Be Ignored New evidence reveals potential manipulation behind the January 6 Capitol events. pjmedia.com\n90 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style SigourneyPodgorny20 69 points 2 days ago Yes it can and they probably will permalink award report block reply sobriquet 31 points 2 days ago It can, and most certainly will.  Even if it's not, what's gonna happen? Strongly worded letter? Censure? Calling them mean names? permalink parent award report block reply Oldman6541E5 9 points 2 days ago Are you listening to the Alex Jones Channel right now? He's talking about it with General Flynn. permalink parent award report block reply chickeninoven 16 points 2 days ago 🚨💥🚨💥🚨💥FUCKING MASSIVE BREAKING ALERT🚨💥🚨💥🚨💥 permalink parent award report block reply OldGamerGuy79 5 points 2 days ago Wtf? How come all of a sudden I want to go spend money on shit I don’t need? permalink parent award report block reply Nibba2 1 points 2 days ago They pushed Flynn out and blacklisted him. He might tell the truth, but don’t act like because so and so that you like says such and such means it’s going to happen. permalink parent award report block reply BlackPilledMAGA 7 points 2 days ago Pam Blondi ? shakes in boots permalink parent award report block reply sobriquet 4 points 2 days ago I'm a scurred permalink parent award report block reply CmonPeopleGetReal 1 points 2 days ago Scam Blondie permalink parent award report block reply CharlesWilliams 2 points 2 days ago Forcing Nasty Nancy to not seek reelection? permalink parent award report block reply JackRile 2 points 2 days ago The author doesn't know our justice dept very well permalink parent award report block reply NotYourMan 16 points 2 days ago Another conspiracy theory turns out to be true.  Lets go the full way.  Ashley Babbit was killed because Nancy wanted to blame Trump for the murder as part of trying to stick him with the insurrection charge.  The \"riot\" happened because capitol police fired into the crowd and the non-violent protesters panicked.  The doors were opened from the inside to invite the protesters into the capitol building and support the insurrection narrative.  There were no weapons in the protesters; zero; zilch.  There was no organized group but they arrested the proud boys and tried to prove they were running an organized insurrection but that case fell apart quickly.  All DC judges were into the insurrection narrative and supported it even though it was obviously a lie. permalink parent award report block reply MamaLlama2pointOh 1 points 1 day ago Agreed on all points permalink parent award report block reply rebuildingMyself 9 points 2 days ago Too much of the Uniparty narrative depends on at least half the country believing J6 was worse than 911. permalink parent award report block reply sobriquet 8 points 2 days ago It was 911 x 100. permalink parent award report block reply JohnN 5 points 2 days ago (911 x 100)^{The Bataan Death March} permalink parent award report block reply rebuildingMyself 3 points 2 days ago It's when some people did some things X 100! permalink parent award report block reply view 1 more comments... MudDog 1 points 2 days ago Yes it can and they probably will FTFY permalink parent award report block reply MADASHELLNEWS 27 points 2 days ago Fire Todd Blanche and Pam Bondi they will block and obstruct to try and run the clock out. permalink award report block reply 46DindoNuffin 3 points 2 days ago Why would they do that? permalink parent award report block reply Rudy_DankMemer 10 points 2 days ago Fire Todd Blanche and Pam Bondi they will block and obstruct to try and run the clock out. You are not wrong. Why would they do that? Because Blanche is a derp state uniparty faggot and Blondi is feckless cunt. Next question, fren. permalink parent award report block reply Briben 3 points 2 days ago Sad but true. permalink parent award report block reply deleted 1 points 2 days ago Pnw4gotpwd 3 points 2 days ago I liked cupid stunt better. All in the best possible taste permalink parent award report block reply CharlesWilliams 3 points 2 days ago Difference between acrobats and strippers?  Acrobats display cunning stunts. permalink parent award report block reply Nutt_bugget 2 points 2 days ago Difference between a women's track team and a tribe of pygmies?\nA tribe of pygmies is a cunning group of runts. :) permalink parent award report block reply view 1 more comments... Herpawinski 23 points 2 days ago Jesus fucking christ this is like running in a dream and not getting any closer to something. This was one of the worst crimes in American political history. They set people up then persecuted them for doing what they'd tricked them into doing. This is not a crime you can have pardon from. We are not whole until it is rectified. NAIL. SOME. FUCKING. HEADS. TO. THE. WALL. ALREADY!!! permalink award report block reply barefootozark 8 points 2 days ago It is.  Their charade resulted in shooting and killing people. OOPS!! The likely bomber shot J6'ers with rubber bullets the day after planting fake bombs. The fake bomber testified against J6'ers to help imprison them. The FBI stopped investigating the fake bomber, but they had the resources to impeach Trump!! There should be daily public hangings. permalink parent award report block reply dude_bro 3 points 2 days ago Still wonder what Trump meant to show up on J6 and it’ll be “wild.”  Thank God I had some family members tell me it was a bad idea, I was intent to go. permalink parent award report block reply ZacPetkanas 2 points 2 days ago Yeah, me and a coworker were discussing maybe going but we both realized it would probably be a disaster. permalink parent award report block reply Herpawinski 2 points 1 day ago He meant show the legislators inside that the public supported the ones who called for re examining the election before certifying. It was to help give the naysayers inside some fortitude. That's it. Just a regular demonstration. If it worked just to affect the process, yet not even change the  legitimate result, even that would have been \"wild\" in historical terms, however the vote went after reexamining things. permalink parent award report block reply clownworld30330 1 points 2 days ago Well, it was wild. It was exactly what the derp state needed - what they made it be. permalink parent award report block reply AVeryNakedMan 17 points 2 days ago The evidence isn't really new. We knew most of it years ago. What's new is the media is talking about it. permalink award report block reply CharlesWilliams 8 points 2 days ago What’s new is a name on the fake bomb planter. permalink parent award report block reply barefootozark 7 points 2 days ago ... and that the FBI was really close to Kerkhoff days after Jan6 and then the FBI did an about-face and walked away from the facts. permalink parent award report block reply Trump-16-20-24-28-32 3 points 2 days ago Keep in mind... it is new evidence for a lot of people.  And sometimes things we thought happened now has more evidence to back it up. permalink parent award report block reply MAGA1773 11 points 2 days ago A federal agency can not overthrow the federal government. That would be a coup, insurrection and treason. Why do we play these word games? Hunt them down. All of them. permalink award report block reply Leucophylla12 8 points 2 days ago So fucking do something about it permalink award report block reply ZacPetkanas 3 points 2 days ago Well gosh and golly! It seems the statute of limitations has run out. Darn it all!  We’ll get ‘em next time, don’t you worry!  Now, would you like to donate to the RNC? permalink parent award report block reply trumpORbust 7 points 2 days ago At, but it's can, will, and is being ignored, suppressed, and debunked Where the fuck is Dan, Pan, and their cash-cuck. Dan and cash talked such a big game and now such fucking disappointments permalink award report block reply clownworld30330 3 points 2 days ago You’re expected not to notice that you got played. permalink parent award report block reply Cuttinmuffins 6 points 2 days ago Kash, Bongino, And Blondie: Hold my beer. permalink award report block reply WhiskeyGiGi 6 points 2 days ago They absolutely should arrest all of them, but the damage is done. Americans are still going to be afraid to speak out, unfortunately. permalink award report block reply POTUS_DonnieJ 6 points 2 days ago Every members of the J6 Select committee needs to be treated like the traitors they are for knowingly covering up the facts and blatantly and openly lying to the American people. No pardon should cover treason, autopen or otherwise. permalink award report block reply Rucktoe 5 points 2 days ago They ignored the coup that led up to this, it won't even make them sweat ignoring this. permalink award report block reply notsuicidalatall 4 points 2 days ago of fucking course it was, what did that rag Pelosi say, \"Trump will not be president\". permalink award report block reply Clarice357 4 points 2 days ago Wake me when the arrests happen.  Otherwise, this is meaningless. permalink award report block reply SpiderTaxi 4 points 2 days ago Most intelligent people knew this 5 years ago. permalink award report block reply greatpumpkin 4 points 2 days ago They're most certainly going to try to memory-hole it though. permalink award report block reply Dangerous 4 points 2 days ago Sure but the old evidence we have had for years was always good enough too permalink award report block reply HKFan 4 points 2 days ago Tell that to Bondi and Patel permalink award report block reply TheSwampThang 4 points 2 days ago They won't do anything because that means some of their buddies are going to jail for life.  They can't let Ole 'Steve and Claire get thrown under the bus for trying to \"protect America \".  Those are coworkers they personally know, they're really nice in the office. \"There would be a lot of good folk in the FBI that would get caught up if we held the j6 engineers accountable. \" permalink award report block reply OmegaBird 4 points 2 days ago I remember when Trump said he was going to drain the swamp. permalink award report block reply MajJamesMcFarlane 1 points 2 days ago You mean back in 2016 and then spent his whole term putting the swap into power? Good times permalink parent award report block reply Roadpower 4 points 2 days ago Reminder: The \"news\" media is complicit. permalink award report block reply Bicentennial76 3 points 2 days ago And yet it is ignored,  weird permalink award report block reply SubmarineGuy 2 points 2 days ago The only thing I didn't figure out was the FBI involvement. I knew from day one J6 was a Nanzi propaganda production. That has been her Motis Operandi for years. permalink award report block reply Briben 2 points 2 days ago It would be crazy if Capitol P.O. Of Ukrainian decent poses as bmber by night and the next day shoots pepper balls into a crowd to incite a riot, then is a lead court witness against the rioters and then moves on to CIA for her reward.  Has Maidan Coup vibes. permalink award report block reply BecauseYoudBeInJail 2 points 2 days ago Oh darn, that sucks when the suspect shoots herself twice in the back of the head later this week and one of the bullets goes through both her phone and laptop drives. permalink award report block reply ACActual 2 points 2 days ago J6 was planned to be a bloody Insurrection.   Zip Ties left out.  We were funneled into the West Terrace were Cops and as i to Saturday, the J6 Bomber who i also thought was a man.  They tried provoking us to bring guns so they would have an excuse to kill more than 4 of us but also Congressmen and or Senators.  This was the Deep States Operation Valkyrie.  We need Executions and whole lot of Prosecutions permalink award report block reply Spellmonger 1 points 2 days ago Call both Senators and the Representative who are supposed to be reporting to you, and tell them that you know and demand they come home and offer a public apology along with an explanation of why they went along with it. They don't get to second-guess us, no matter who we voted for, if the election was honestly conducted. permalink award report block reply MajorClark 1 points 2 days ago Obama, Biden, Pelosi, Pence and other seditionist/treasonous traitors deserve to be in prison Alligator Alcatraz style. permalink award report block reply ckover9000 1 points 2 days ago \"Can't be ignored\" LOL this is what Ka$h does best! permalink award report block reply Repentnow 1 points 2 days ago Just because some 4chan autist claims to have matched the bomber's gait to some capital cop, is absolutely not \"evidence\". This is a huge problem here. People are presented with some clickfluencer theory which may have some grain of truth to it, but they filter it as absolute truth and then get angry when nobody's doing anything about it. permalink award report block reply Fuck_reddit34 1 points 2 days ago Attack attack attack!!!! permalink award report block reply Goatboy66 1 points 2 days ago Find and watch the Video \" Everything wrong with the Capital Shooting in twenty one minutes or less\".....It was all Staged. permalink award report block reply Returningtogod 1 points 2 days ago Oh - it CAN and it WILL be ignored. permalink award report block reply clownworld30330 1 points 2 days ago One news item does not a flood make. permalink award report block reply SubmarineGuy 1 points 2 days ago I'm happy that Trump pardoned the J6 patriots, but what about the 4 people who committed suicide because of the crashing burden of this horrific procecution ? What is to be done about this shocking injustice? permalink award report block reply KneadThePeople 1 points 2 days ago 13 have yet to be pardoned. Fuck the cops who were “suicided” I care about my J6 Brothers and Sisters who have committed suicide waiting on justice. permalink parent award report block reply friedchicken 1 points 2 days ago What freaks me out is how readily the media towed the line \"insurrection insurrection insurrection\"; an attempt to sway a jury to finding trump guilty of an insurrection and bar him from becoming president again. Unreal; and people pretend like this never happened permalink award report block reply Choppermagic 1 points 2 days ago It was already obvious.  Unless people are actually arrested, nothing will happen and it will continue permalink award report block reply barefootozark 1 points 2 days ago New info on the faux bomber: Kerkhoff served as a training officer in less lethal weapons and had access to training objects, which included dummy pipe bombs. On January 6, Kerkhoff is seen at the Capitol Building firing volleys of less-than-lethal ordnance at protesters. She testified in federal court against people at the Capitol on January 6. The former Capitol Police officer is also a former professional soccer player who suffered a career-ending injury and had surgery that left her with a permanent, mild limp, which shows up in the J6 bomber video released by the FBI. The publication said that Kerkhoff's gait matches the video obtained of her at work at the Capitol. We should be hearing from John Ratcliffe, Director of the CIA, if the bomber will be made available for comment. We should be hearing from Patel and Bongino if they are investigating Kerkhoff in light of this new information. permalink award report block reply Female 1 points 2 days ago Corrupt dishonest News media: challenge accepted permalink award report block reply yepyep 1 points 1 day ago The media will kinda mention of it’s existence but won’t really look at it so they can say they haven’t seen any evidence of it. permalink award report block reply Judiwont 1 points 2 days ago Those people climbing the wall were for a photo op. There was no need to climb the wall. They simply could have walked around and used the stairs. It is comical what they try to push that day... permalink award report block reply Mechanicalmind 1 points 2 days ago Annnnnd nothing will happen. We got sold out on the arrest promises that’s for sure permalink award report block reply IncredibleMrE1 1 points 2 days ago Who did this forensic analysis for The Blaze and what software did he use? permalink award report block reply MegoThor 1 points 2 days ago Can’t, but it will be. Just like Barry’s fake birth certificate. permalink award report block reply Hambonemcgee 1 points 2 days ago But it will be!  Guaranteed! permalink award report block reply Beelzy 1 points 2 days ago Wow, proof of what everyone knew all along.\nNow will something finally happen?..in less than two fucking weeks! permalink award report block reply Bueller 1 points 2 days ago Golly gee - ya think? Blatant psyop right in your face - American citizens noses shoved into absolute lies/shit.  Pelosi and the rest proved themselves truly evil The lesson is in how gullible programmable dishonest and (sad to say) stupid most people are. permalink award report block reply BasedMillennial 1 points 2 days ago It will most definitely be ignored. permalink award report block reply MemeWarsVet 1 points 2 days ago Sure it can. permalink award report block reply Grond999 1 points 2 days ago \"Epstein who\" - Welcome to the \"new transparent FBI\" permalink award report block reply Hangmhigh 1 points 2 days ago We have to deal with this and the globalists using immigration as a weapon to destroy and enslave the western world. permalink award report block reply ManWhoMakesTheMusic 0 points 2 days ago The people involved should be held fully accountable and do prison time if it's determined they negativily impacted the freedom of American's to express themselves politically without violence. permalink award report block reply Corse46 0 points 2 days ago You underestimate the ability to ignore. The media has been ignoring building 7 on 9/11 for 24 years. permalink award report block reply Mhmm2MoreWeeks -1 points 2 days ago Can't be ignored? By Whom? It has, is, and will continue to be ignored. The nation is ruled by Globalist Judges and corrupt Politicians with the Backing of the CIA and all the Armed Forces.  All controlled puppets of the WEF Stakeholders directly/indirectly for the most part. Its a Criminal Empire and its not going away because of Trump. Believe in that. This battle goes for the rest of our lives. permalink award report block reply CommanderComadant 2 points 2 days ago I absolutely believe this to be true. It’s depressing because I just don’t see people waking up to the magnitude & scale of what we’re up against. permalink parent award report block reply Tmntnyc -1 points 2 days ago Wait, I thought J6 was a peaceful protest not an insurrection? Or is it only an \"insilurrection\" now that evidence is coming out it was an inside job? But before that evidence, the right was saying it was a big nothing burger. How can both be true? Was it \"no big deal\" or was it a fake planned insurrection? permalink award report block reply\nSigourneyPodgorny20 69 points 2 days ago Yes it can and they probably will permalink award report block reply sobriquet 31 points 2 days ago It can, and most certainly will.  Even if it's not, what's gonna happen? Strongly worded letter? Censure? Calling them mean names? permalink parent award report block reply Oldman6541E5 9 points 2 days ago Are you listening to the Alex Jones Channel right now? He's talking about it with General Flynn. permalink parent award report block reply chickeninoven 16 points 2 days ago 🚨💥🚨💥🚨💥FUCKING MASSIVE BREAKING ALERT🚨💥🚨💥🚨💥 permalink parent award report block reply OldGamerGuy79 5 points 2 days ago Wtf? How come all of a sudden I want to go spend money on shit I don’t need? permalink parent award report block reply Nibba2 1 points 2 days ago They pushed Flynn out and blacklisted him. He might tell the truth, but don’t act like because so and so that you like says such and such means it’s going to happen. permalink parent award report block reply BlackPilledMAGA 7 points 2 days ago Pam Blondi ? shakes in boots permalink parent award report block reply sobriquet 4 points 2 days ago I'm a scurred permalink parent award report block reply CmonPeopleGetReal 1 points 2 days ago Scam Blondie permalink parent award report block reply CharlesWilliams 2 points 2 days ago Forcing Nasty Nancy to not seek reelection? permalink parent award report block reply JackRile 2 points 2 days ago The author doesn't know our justice dept very well permalink parent award report block reply NotYourMan 16 points 2 days ago Another conspiracy theory turns out to be true.  Lets go the full way.  Ashley Babbit was killed because Nancy wanted to blame Trump for the murder as part of trying to stick him with the insurrection charge.  The \"riot\" happened because capitol police fired into the crowd and the non-violent protesters panicked.  The doors were opened from the inside to invite the protesters into the capitol building and support the insurrection narrative.  There were no weapons in the protesters; zero; zilch.  There was no organized group but they arrested the proud boys and tried to prove they were running an organized insurrection but that case fell apart quickly.  All DC judges were into the insurrection narrative and supported it even though it was obviously a lie. permalink parent award report block reply MamaLlama2pointOh 1 points 1 day ago Agreed on all points permalink parent award report block reply rebuildingMyself 9 points 2 days ago Too much of the Uniparty narrative depends on at least half the country believing J6 was worse than 911. permalink parent award report block reply sobriquet 8 points 2 days ago It was 911 x 100. permalink parent award report block reply JohnN 5 points 2 days ago (911 x 100)^{The Bataan Death March} permalink parent award report block reply rebuildingMyself 3 points 2 days ago It's when some people did some things X 100! permalink parent award report block reply view 1 more comments... MudDog 1 points 2 days ago Yes it can and they probably will FTFY permalink parent award report block reply\nsobriquet 31 points 2 days ago It can, and most certainly will.  Even if it's not, what's gonna happen? Strongly worded letter? Censure? Calling them mean names? permalink parent award report block reply Oldman6541E5 9 points 2 days ago Are you listening to the Alex Jones Channel right now? He's talking about it with General Flynn. permalink parent award report block reply chickeninoven 16 points 2 days ago 🚨💥🚨💥🚨💥FUCKING MASSIVE BREAKING ALERT🚨💥🚨💥🚨💥 permalink parent award report block reply OldGamerGuy79 5 points 2 days ago Wtf? How come all of a sudden I want to go spend money on shit I don’t need? permalink parent award report block reply Nibba2 1 points 2 days ago They pushed Flynn out and blacklisted him. He might tell the truth, but don’t act like because so and so that you like says such and such means it’s going to happen. permalink parent award report block reply BlackPilledMAGA 7 points 2 days ago Pam Blondi ? shakes in boots permalink parent award report block reply sobriquet 4 points 2 days ago I'm a scurred permalink parent award report block reply CmonPeopleGetReal 1 points 2 days ago Scam Blondie permalink parent award report block reply CharlesWilliams 2 points 2 days ago Forcing Nasty Nancy to not seek reelection? permalink parent award report block reply JackRile 2 points 2 days ago The author doesn't know our justice dept very well permalink parent award report block reply\nOldman6541E5 9 points 2 days ago Are you listening to the Alex Jones Channel right now? He's talking about it with General Flynn. permalink parent award report block reply chickeninoven 16 points 2 days ago 🚨💥🚨💥🚨💥FUCKING MASSIVE BREAKING ALERT🚨💥🚨💥🚨💥 permalink parent award report block reply OldGamerGuy79 5 points 2 days ago Wtf? How come all of a sudden I want to go spend money on shit I don’t need? permalink parent award report block reply Nibba2 1 points 2 days ago They pushed Flynn out and blacklisted him. He might tell the truth, but don’t act like because so and so that you like says such and such means it’s going to happen. permalink parent award report block reply\nchickeninoven 16 points 2 days ago 🚨💥🚨💥🚨💥FUCKING MASSIVE BREAKING ALERT🚨💥🚨💥🚨💥 permalink parent award report block reply OldGamerGuy79 5 points 2 days ago Wtf? How come all of a sudden I want to go spend money on shit I don’t need? permalink parent award report block reply\nOldGamerGuy79 5 points 2 days ago Wtf? How come all of a sudden I want to go spend money on shit I don’t need? permalink parent award report block reply\nNibba2 1 points 2 days ago They pushed Flynn out and blacklisted him. He might tell the truth, but don’t act like because so and so that you like says such and such means it’s going to happen. permalink parent award report block reply\nBlackPilledMAGA 7 points 2 days ago Pam Blondi ? shakes in boots permalink parent award report block reply sobriquet 4 points 2 days ago I'm a scurred permalink parent award report block reply CmonPeopleGetReal 1 points 2 days ago Scam Blondie permalink parent award report block reply\nsobriquet 4 points 2 days ago I'm a scurred permalink parent award report block reply\nCmonPeopleGetReal 1 points 2 days ago Scam Blondie permalink parent award report block reply\nCharlesWilliams 2 points 2 days ago Forcing Nasty Nancy to not seek reelection? permalink parent award report block reply\nJackRile 2 points 2 days ago The author doesn't know our justice dept very well permalink parent award report block reply\nNotYourMan 16 points 2 days ago Another conspiracy theory turns out to be true.  Lets go the full way.  Ashley Babbit was killed because Nancy wanted to blame Trump for the murder as part of trying to stick him with the insurrection charge.  The \"riot\" happened because capitol police fired into the crowd and the non-violent protesters panicked.  The doors were opened from the inside to invite the protesters into the capitol building and support the insurrection narrative.  There were no weapons in the protesters; zero; zilch.  There was no organized group but they arrested the proud boys and tried to prove they were running an organized insurrection but that case fell apart quickly.  All DC judges were into the insurrection narrative and supported it even though it was obviously a lie. permalink parent award report block reply MamaLlama2pointOh 1 points 1 day ago Agreed on all points permalink parent award report block reply\nMamaLlama2pointOh 1 points 1 day ago Agreed on all points permalink parent award report block reply\nrebuildingMyself 9 points 2 days ago Too much of the Uniparty narrative depends on at least half the country believing J6 was worse than 911. permalink parent award report block reply sobriquet 8 points 2 days ago It was 911 x 100. permalink parent award report block reply JohnN 5 points 2 days ago (911 x 100)^{The Bataan Death March} permalink parent award report block reply rebuildingMyself 3 points 2 days ago It's when some people did some things X 100! permalink parent award report block reply view 1 more comments...\nsobriquet 8 points 2 days ago It was 911 x 100. permalink parent award report block reply JohnN 5 points 2 days ago (911 x 100)^{The Bataan Death March} permalink parent award report block reply rebuildingMyself 3 points 2 days ago It's when some people did some things X 100! permalink parent award report block reply view 1 more comments...\nJohnN 5 points 2 days ago (911 x 100)^{The Bataan Death March} permalink parent award report block reply rebuildingMyself 3 points 2 days ago It's when some people did some things X 100! permalink parent award report block reply view 1 more comments...\nrebuildingMyself 3 points 2 days ago It's when some people did some things X 100! permalink parent award report block reply view 1 more comments...\nMudDog 1 points 2 days ago Yes it can and they probably will FTFY permalink parent award report block reply\nMADASHELLNEWS 27 points 2 days ago Fire Todd Blanche and Pam Bondi they will block and obstruct to try and run the clock out. permalink award report block reply 46DindoNuffin 3 points 2 days ago Why would they do that? permalink parent award report block reply Rudy_DankMemer 10 points 2 days ago Fire Todd Blanche and Pam Bondi they will block and obstruct to try and run the clock out. You are not wrong. Why would they do that? Because Blanche is a derp state uniparty faggot and Blondi is feckless cunt. Next question, fren. permalink parent award report block reply Briben 3 points 2 days ago Sad but true. permalink parent award report block reply deleted 1 points 2 days ago Pnw4gotpwd 3 points 2 days ago I liked cupid stunt better. All in the best possible taste permalink parent award report block reply CharlesWilliams 3 points 2 days ago Difference between acrobats and strippers?  Acrobats display cunning stunts. permalink parent award report block reply Nutt_bugget 2 points 2 days ago Difference between a women's track team and a tribe of pygmies?\nA tribe of pygmies is a cunning group of runts. :) permalink parent award report block reply view 1 more comments...\n46DindoNuffin 3 points 2 days ago Why would they do that? permalink parent award report block reply Rudy_DankMemer 10 points 2 days ago Fire Todd Blanche and Pam Bondi they will block and obstruct to try and run the clock out. You are not wrong. Why would they do that? Because Blanche is a derp state uniparty faggot and Blondi is feckless cunt. Next question, fren. permalink parent award report block reply Briben 3 points 2 days ago Sad but true. permalink parent award report block reply\nRudy_DankMemer 10 points 2 days ago Fire Todd Blanche and Pam Bondi they will block and obstruct to try and run the clock out. You are not wrong. Why would they do that? Because Blanche is a derp state uniparty faggot and Blondi is feckless cunt. Next question, fren. permalink parent award report block reply Briben 3 points 2 days ago Sad but true. permalink parent award report block reply\nBriben 3 points 2 days ago Sad but true. permalink parent award report block reply\ndeleted 1 points 2 days ago Pnw4gotpwd 3 points 2 days ago I liked cupid stunt better. All in the best possible taste permalink parent award report block reply CharlesWilliams 3 points 2 days ago Difference between acrobats and strippers?  Acrobats display cunning stunts. permalink parent award report block reply Nutt_bugget 2 points 2 days ago Difference between a women's track team and a tribe of pygmies?\nA tribe of pygmies is a cunning group of runts. :) permalink parent award report block reply view 1 more comments...\nPnw4gotpwd 3 points 2 days ago I liked cupid stunt better. All in the best possible taste permalink parent award report block reply CharlesWilliams 3 points 2 days ago Difference between acrobats and strippers?  Acrobats display cunning stunts. permalink parent award report block reply Nutt_bugget 2 points 2 days ago Difference between a women's track team and a tribe of pygmies?\nA tribe of pygmies is a cunning group of runts. :) permalink parent award report block reply view 1 more comments...\nCharlesWilliams 3 points 2 days ago Difference between acrobats and strippers?  Acrobats display cunning stunts. permalink parent award report block reply Nutt_bugget 2 points 2 days ago Difference between a women's track team and a tribe of pygmies?\nA tribe of pygmies is a cunning group of runts. :) permalink parent award report block reply view 1 more comments...\nNutt_bugget 2 points 2 days ago Difference between a women's track team and a tribe of pygmies?\nA tribe of pygmies is a cunning group of runts. :) permalink parent award report block reply view 1 more comments...\nHerpawinski 23 points 2 days ago Jesus fucking christ this is like running in a dream and not getting any closer to something. This was one of the worst crimes in American political history. They set people up then persecuted them for doing what they'd tricked them into doing. This is not a crime you can have pardon from. We are not whole until it is rectified. NAIL. SOME. FUCKING. HEADS. TO. THE. WALL. ALREADY!!! permalink award report block reply barefootozark 8 points 2 days ago It is.  Their charade resulted in shooting and killing people. OOPS!! The likely bomber shot J6'ers with rubber bullets the day after planting fake bombs. The fake bomber testified against J6'ers to help imprison them. The FBI stopped investigating the fake bomber, but they had the resources to impeach Trump!! There should be daily public hangings. permalink parent award report block reply dude_bro 3 points 2 days ago Still wonder what Trump meant to show up on J6 and it’ll be “wild.”  Thank God I had some family members tell me it was a bad idea, I was intent to go. permalink parent award report block reply ZacPetkanas 2 points 2 days ago Yeah, me and a coworker were discussing maybe going but we both realized it would probably be a disaster. permalink parent award report block reply Herpawinski 2 points 1 day ago He meant show the legislators inside that the public supported the ones who called for re examining the election before certifying. It was to help give the naysayers inside some fortitude. That's it. Just a regular demonstration. If it worked just to affect the process, yet not even change the  legitimate result, even that would have been \"wild\" in historical terms, however the vote went after reexamining things. permalink parent award report block reply clownworld30330 1 points 2 days ago Well, it was wild. It was exactly what the derp state needed - what they made it be. permalink parent award report block reply\nbarefootozark 8 points 2 days ago It is.  Their charade resulted in shooting and killing people. OOPS!! The likely bomber shot J6'ers with rubber bullets the day after planting fake bombs. The fake bomber testified against J6'ers to help imprison them. The FBI stopped investigating the fake bomber, but they had the resources to impeach Trump!! There should be daily public hangings. permalink parent award report block reply\ndude_bro 3 points 2 days ago Still wonder what Trump meant to show up on J6 and it’ll be “wild.”  Thank God I had some family members tell me it was a bad idea, I was intent to go. permalink parent award report block reply ZacPetkanas 2 points 2 days ago Yeah, me and a coworker were discussing maybe going but we both realized it would probably be a disaster. permalink parent award report block reply Herpawinski 2 points 1 day ago He meant show the legislators inside that the public supported the ones who called for re examining the election before certifying. It was to help give the naysayers inside some fortitude. That's it. Just a regular demonstration. If it worked just to affect the process, yet not even change the  legitimate result, even that would have been \"wild\" in historical terms, however the vote went after reexamining things. permalink parent award report block reply clownworld30330 1 points 2 days ago Well, it was wild. It was exactly what the derp state needed - what they made it be. permalink parent award report block reply\nZacPetkanas 2 points 2 days ago Yeah, me and a coworker were discussing maybe going but we both realized it would probably be a disaster. permalink parent award report block reply\nHerpawinski 2 points 1 day ago He meant show the legislators inside that the public supported the ones who called for re examining the election before certifying. It was to help give the naysayers inside some fortitude. That's it. Just a regular demonstration. If it worked just to affect the process, yet not even change the  legitimate result, even that would have been \"wild\" in historical terms, however the vote went after reexamining things. permalink parent award report block reply\nclownworld30330 1 points 2 days ago Well, it was wild. It was exactly what the derp state needed - what they made it be. permalink parent award report block reply\nAVeryNakedMan 17 points 2 days ago The evidence isn't really new. We knew most of it years ago. What's new is the media is talking about it. permalink award report block reply CharlesWilliams 8 points 2 days ago What’s new is a name on the fake bomb planter. permalink parent award report block reply barefootozark 7 points 2 days ago ... and that the FBI was really close to Kerkhoff days after Jan6 and then the FBI did an about-face and walked away from the facts. permalink parent award report block reply Trump-16-20-24-28-32 3 points 2 days ago Keep in mind... it is new evidence for a lot of people.  And sometimes things we thought happened now has more evidence to back it up. permalink parent award report block reply\nCharlesWilliams 8 points 2 days ago What’s new is a name on the fake bomb planter. permalink parent award report block reply barefootozark 7 points 2 days ago ... and that the FBI was really close to Kerkhoff days after Jan6 and then the FBI did an about-face and walked away from the facts. permalink parent award report block reply\nbarefootozark 7 points 2 days ago ... and that the FBI was really close to Kerkhoff days after Jan6 and then the FBI did an about-face and walked away from the facts. permalink parent award report block reply\nTrump-16-20-24-28-32 3 points 2 days ago Keep in mind... it is new evidence for a lot of people.  And sometimes things we thought happened now has more evidence to back it up. permalink parent award report block reply\nMAGA1773 11 points 2 days ago A federal agency can not overthrow the federal government. That would be a coup, insurrection and treason. Why do we play these word games? Hunt them down. All of them. permalink award report block reply\nLeucophylla12 8 points 2 days ago So fucking do something about it permalink award report block reply ZacPetkanas 3 points 2 days ago Well gosh and golly! It seems the statute of limitations has run out. Darn it all!  We’ll get ‘em next time, don’t you worry!  Now, would you like to donate to the RNC? permalink parent award report block reply\nZacPetkanas 3 points 2 days ago Well gosh and golly! It seems the statute of limitations has run out. Darn it all!  We’ll get ‘em next time, don’t you worry!  Now, would you like to donate to the RNC? permalink parent award report block reply\ntrumpORbust 7 points 2 days ago At, but it's can, will, and is being ignored, suppressed, and debunked Where the fuck is Dan, Pan, and their cash-cuck. Dan and cash talked such a big game and now such fucking disappointments permalink award report block reply clownworld30330 3 points 2 days ago You’re expected not to notice that you got played. permalink parent award report block reply\nclownworld30330 3 points 2 days ago You’re expected not to notice that you got played. permalink parent award report block reply\nCuttinmuffins 6 points 2 days ago Kash, Bongino, And Blondie: Hold my beer. permalink award report block reply\nWhiskeyGiGi 6 points 2 days ago They absolutely should arrest all of them, but the damage is done. Americans are still going to be afraid to speak out, unfortunately. permalink award report block reply\nPOTUS_DonnieJ 6 points 2 days ago Every members of the J6 Select committee needs to be treated like the traitors they are for knowingly covering up the facts and blatantly and openly lying to the American people. No pardon should cover treason, autopen or otherwise. permalink award report block reply\nRucktoe 5 points 2 days ago They ignored the coup that led up to this, it won't even make them sweat ignoring this. permalink award report block reply\nnotsuicidalatall 4 points 2 days ago of fucking course it was, what did that rag Pelosi say, \"Trump will not be president\". permalink award report block reply\nClarice357 4 points 2 days ago Wake me when the arrests happen.  Otherwise, this is meaningless. permalink award report block reply\nSpiderTaxi 4 points 2 days ago Most intelligent people knew this 5 years ago. permalink award report block reply\ngreatpumpkin 4 points 2 days ago They're most certainly going to try to memory-hole it though. permalink award report block reply\nDangerous 4 points 2 days ago Sure but the old evidence we have had for years was always good enough too permalink award report block reply\nHKFan 4 points 2 days ago Tell that to Bondi and Patel permalink award report block reply\nTheSwampThang 4 points 2 days ago They won't do anything because that means some of their buddies are going to jail for life.  They can't let Ole 'Steve and Claire get thrown under the bus for trying to \"protect America \".  Those are coworkers they personally know, they're really nice in the office. \"There would be a lot of good folk in the FBI that would get caught up if we held the j6 engineers accountable. \" permalink award report block reply\nOmegaBird 4 points 2 days ago I remember when Trump said he was going to drain the swamp. permalink award report block reply MajJamesMcFarlane 1 points 2 days ago You mean back in 2016 and then spent his whole term putting the swap into power? Good times permalink parent award report block reply\nMajJamesMcFarlane 1 points 2 days ago You mean back in 2016 and then spent his whole term putting the swap into power? Good times permalink parent award report block reply\nRoadpower 4 points 2 days ago Reminder: The \"news\" media is complicit. permalink award report block reply\nBicentennial76 3 points 2 days ago And yet it is ignored,  weird permalink award report block reply\nSubmarineGuy 2 points 2 days ago The only thing I didn't figure out was the FBI involvement. I knew from day one J6 was a Nanzi propaganda production. That has been her Motis Operandi for years. permalink award report block reply\nBriben 2 points 2 days ago It would be crazy if Capitol P.O. Of Ukrainian decent poses as bmber by night and the next day shoots pepper balls into a crowd to incite a riot, then is a lead court witness against the rioters and then moves on to CIA for her reward.  Has Maidan Coup vibes. permalink award report block reply\nBecauseYoudBeInJail 2 points 2 days ago Oh darn, that sucks when the suspect shoots herself twice in the back of the head later this week and one of the bullets goes through both her phone and laptop drives. permalink award report block reply\nACActual 2 points 2 days ago J6 was planned to be a bloody Insurrection.   Zip Ties left out.  We were funneled into the West Terrace were Cops and as i to Saturday, the J6 Bomber who i also thought was a man.  They tried provoking us to bring guns so they would have an excuse to kill more than 4 of us but also Congressmen and or Senators.  This was the Deep States Operation Valkyrie.  We need Executions and whole lot of Prosecutions permalink award report block reply\nSpellmonger 1 points 2 days ago Call both Senators and the Representative who are supposed to be reporting to you, and tell them that you know and demand they come home and offer a public apology along with an explanation of why they went along with it. They don't get to second-guess us, no matter who we voted for, if the election was honestly conducted. permalink award report block reply\nMajorClark 1 points 2 days ago Obama, Biden, Pelosi, Pence and other seditionist/treasonous traitors deserve to be in prison Alligator Alcatraz style. permalink award report block reply\nckover9000 1 points 2 days ago \"Can't be ignored\" LOL this is what Ka$h does best! permalink award report block reply\nRepentnow 1 points 2 days ago Just because some 4chan autist claims to have matched the bomber's gait to some capital cop, is absolutely not \"evidence\". This is a huge problem here. People are presented with some clickfluencer theory which may have some grain of truth to it, but they filter it as absolute truth and then get angry when nobody's doing anything about it. permalink award report block reply\nFuck_reddit34 1 points 2 days ago Attack attack attack!!!! permalink award report block reply\nGoatboy66 1 points 2 days ago Find and watch the Video \" Everything wrong with the Capital Shooting in twenty one minutes or less\".....It was all Staged. permalink award report block reply\nReturningtogod 1 points 2 days ago Oh - it CAN and it WILL be ignored. permalink award report block reply\nclownworld30330 1 points 2 days ago One news item does not a flood make. permalink award report block reply\nSubmarineGuy 1 points 2 days ago I'm happy that Trump pardoned the J6 patriots, but what about the 4 people who committed suicide because of the crashing burden of this horrific procecution ? What is to be done about this shocking injustice? permalink award report block reply KneadThePeople 1 points 2 days ago 13 have yet to be pardoned. Fuck the cops who were “suicided” I care about my J6 Brothers and Sisters who have committed suicide waiting on justice. permalink parent award report block reply\nKneadThePeople 1 points 2 days ago 13 have yet to be pardoned. Fuck the cops who were “suicided” I care about my J6 Brothers and Sisters who have committed suicide waiting on justice. permalink parent award report block reply\nfriedchicken 1 points 2 days ago What freaks me out is how readily the media towed the line \"insurrection insurrection insurrection\"; an attempt to sway a jury to finding trump guilty of an insurrection and bar him from becoming president again. Unreal; and people pretend like this never happened permalink award report block reply\nChoppermagic 1 points 2 days ago It was already obvious.  Unless people are actually arrested, nothing will happen and it will continue permalink award report block reply\nbarefootozark 1 points 2 days ago New info on the faux bomber: Kerkhoff served as a training officer in less lethal weapons and had access to training objects, which included dummy pipe bombs. On January 6, Kerkhoff is seen at the Capitol Building firing volleys of less-than-lethal ordnance at protesters. She testified in federal court against people at the Capitol on January 6. The former Capitol Police officer is also a former professional soccer player who suffered a career-ending injury and had surgery that left her with a permanent, mild limp, which shows up in the J6 bomber video released by the FBI. The publication said that Kerkhoff's gait matches the video obtained of her at work at the Capitol. We should be hearing from John Ratcliffe, Director of the CIA, if the bomber will be made available for comment. We should be hearing from Patel and Bongino if they are investigating Kerkhoff in light of this new information. permalink award report block reply\nFemale 1 points 2 days ago Corrupt dishonest News media: challenge accepted permalink award report block reply\nyepyep 1 points 1 day ago The media will kinda mention of it’s existence but won’t really look at it so they can say they haven’t seen any evidence of it. permalink award report block reply\nJudiwont 1 points 2 days ago Those people climbing the wall were for a photo op. There was no need to climb the wall. They simply could have walked around and used the stairs. It is comical what they try to push that day... permalink award report block reply\nMechanicalmind 1 points 2 days ago Annnnnd nothing will happen. We got sold out on the arrest promises that’s for sure permalink award report block reply\nIncredibleMrE1 1 points 2 days ago Who did this forensic analysis for The Blaze and what software did he use? permalink award report block reply\nMegoThor 1 points 2 days ago Can’t, but it will be. Just like Barry’s fake birth certificate. permalink award report block reply\nHambonemcgee 1 points 2 days ago But it will be!  Guaranteed! permalink award report block reply\nBeelzy 1 points 2 days ago Wow, proof of what everyone knew all along.\nNow will something finally happen?..in less than two fucking weeks! permalink award report block reply\nBueller 1 points 2 days ago Golly gee - ya think? Blatant psyop right in your face - American citizens noses shoved into absolute lies/shit.  Pelosi and the rest proved themselves truly evil The lesson is in how gullible programmable dishonest and (sad to say) stupid most people are. permalink award report block reply\nBasedMillennial 1 points 2 days ago It will most definitely be ignored. permalink award report block reply\nMemeWarsVet 1 points 2 days ago Sure it can. permalink award report block reply\nGrond999 1 points 2 days ago \"Epstein who\" - Welcome to the \"new transparent FBI\" permalink award report block reply\nHangmhigh 1 points 2 days ago We have to deal with this and the globalists using immigration as a weapon to destroy and enslave the western world. permalink award report block reply\nManWhoMakesTheMusic 0 points 2 days ago The people involved should be held fully accountable and do prison time if it's determined they negativily impacted the freedom of American's to express themselves politically without violence. permalink award report block reply\nCorse46 0 points 2 days ago You underestimate the ability to ignore. The media has been ignoring building 7 on 9/11 for 24 years. permalink award report block reply\nMhmm2MoreWeeks -1 points 2 days ago Can't be ignored? By Whom? It has, is, and will continue to be ignored. The nation is ruled by Globalist Judges and corrupt Politicians with the Backing of the CIA and all the Armed Forces.  All controlled puppets of the WEF Stakeholders directly/indirectly for the most part. Its a Criminal Empire and its not going away because of Trump. Believe in that. This battle goes for the rest of our lives. permalink award report block reply CommanderComadant 2 points 2 days ago I absolutely believe this to be true. It’s depressing because I just don’t see people waking up to the magnitude & scale of what we’re up against. permalink parent award report block reply\nCommanderComadant 2 points 2 days ago I absolutely believe this to be true. It’s depressing because I just don’t see people waking up to the magnitude & scale of what we’re up against. permalink parent award report block reply\nTmntnyc -1 points 2 days ago Wait, I thought J6 was a peaceful protest not an insurrection? Or is it only an \"insilurrection\" now that evidence is coming out it was an inside job? But before that evidence, the right was saying it was a big nothing burger. How can both be true? Was it \"no big deal\" or was it a fake planned insurrection? permalink award report block reply"}