{"id": "8181221", "contents": "1450 He's correct posted 2 days ago by CounterStrike 154 comments award share download report block\n154 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Deplorable_Yankee 140 points 2 days ago I wonder if he is one of us 😂 permalink award report block reply texas4ever 100 points 2 days ago Many of us came from leftist homes but saw how the world really works. permalink parent award report block reply Noxide 39 points 2 days ago True, but the stakes are high with him. He'd have to speak through his actions more than his words if he wants the people's trust. permalink parent award report block reply texas4ever 3 points 2 days ago That standard applies to everyone, judge them by their fruits. permalink parent award report block reply America_No_1 19 points 2 days ago I was liberal in the classical sense until Ron Paul red pilled me.  Then came Ron Paul with a bigger teeth, Trump. permalink parent award report block reply Seldom_Seen_Kid 19 points 2 days ago I’ll throw H. Ross Perot into that mix. Voted for him in the primary. permalink parent award report block reply AndanteAndante 9 points 2 days ago I voted for him in the election and actually voted for Clinton. I was young and principled and didn't understand how things work... permalink parent award report block reply view 1 more comments... Build_Back_Bankrupt 9 points 2 days ago I was in about 5th grade when Ross ran, but I remember thinking we needed a business guy like that, I knew nothing about politics at the time, but he seemed presidential to me. I thought Bush Sr. was boring and mean and Dukakis just looked dumb. permalink parent award report block reply view 1 more comments... Overkillengine 7 points 2 days ago Everyone should have listened to him when he described the giant sucking noise of NAFTA decades ago. permalink parent award report block reply view 1 more comments... Build_Back_Bankrupt 4 points 2 days ago Yep, that's when I started paying more attention to who the establishment did not want. permalink parent award report block reply Remember_the_Alamo 1 points 2 days ago That is a great way of putting it! permalink parent award report block reply Standingoak 0 points 2 days ago Ron is an ideologue , Trump is a pragmatic realist with high ideals , a plan , a team and higher IQ. permalink parent award report block reply snoopy3210 17 points 2 days ago Exactly: Steven Miller permalink parent award report block reply _Sully_ 8 points 2 days ago My Dad was a communist. permalink parent award report block reply anotherthing 2 points 1 day ago My dad's a lifelong Democrat. He's actually changed his opinions on things to fit the Democrat current talking points. He actually stopped going to church when the pastor said they needed to pray for Bush and guide him after 9/11. He used to be fairly conservative when he was younger, but he's moved left because the Democrats did. permalink parent award report block reply glow-operator-2-0 2 points 1 day ago Politics aren't sports teams. They're part of your culture. Sounds like he has neither, so it gets dictated to him. permalink parent award report block reply _Sully_ 2 points 1 day ago Sounds like my Dad. permalink parent award report block reply MyDadLikedBiden 2 points 2 days ago Mine wasn’t, but… permalink parent award report block reply Overkillengine 4 points 2 days ago Yup. My mom is a certified DNC-bot with a broken man-picker. I refuse to enable the pattern. permalink parent award report block reply MAGALADON9 4 points 2 days ago My mom calls me a nazi all the time. And one day... It became true.... Jk jk ....? permalink parent award report block reply Viewer01 56 points 2 days ago I keep saying it but Gen Z going to do some wild shit. 1/3 of them didn’t even make it out the womb the fight to kill them was so bad. Then they had to grow up in immense faggotry taught by feminist teachers who actually hated them for existing. Only to hit college age and find out they’ve been wholly disenfranchised. Can’t even get into schools because they’re white men. Further they look at their females and the whores in sodom and gamorah would blush at them. Then. You get Zionists saying shit like this. https://x.com/marionawfal/status/1987958442389369250?s=46 permalink parent award report block reply GatoradeJeb 27 points 2 days ago The biggest humiliation is seeing as a White man how bad the dating pool prospects are for us as most young White woman are race traitor scum who racemix/mudshark. I live in the south in a very red state and almost every young White woman is with a worthless wetback or jogger. This is genocide by replacement permalink parent award report block reply MJPalazzolo 12 points 2 days ago This is typical and predictable female vindictive behavior. You toss them, they'll 'show you'. permalink parent award report block reply BillyBobBrewer 8 points 2 days ago Fuck em. One you go black we don't want you back. permalink parent award report block reply view 1 more comments... MAGALADON9 5 points 2 days ago The average black American is 22-25% non black mostly white admixture. Obama looks \"black\" but when he traveled to Kenya the film shows laughing kids and the translation says \"look a white man comes to africa\" -- that's how white they see our standard of black. This is erasure of blackness.  They take the skrags and fatties and slowly they fade into this lighter and lighter coffee. If I was black it'd piss me off permalink parent award report block reply view 3 more comments... bigfatnagger 2 points 2 days ago Wtf seriously? That's weird but that generation grew up being told white men are the root of all evil so I guess maybe it's not all that weird. permalink parent award report block reply GatoradeJeb 1 points 1 day ago Its very depressing. It exploded after the blm insurrection. Hollywood showing White woman with jogger in all tv/ads also brainwashed them permalink parent award report block reply Sgt_Hulka 3 points 2 days ago I hate that worm. I wish I could put a propeller on that skullcap. permalink parent award report block reply Viewer01 0 points 2 days ago You don’t hate him enough. https://patriots.win/p/1ARK9irmOn permalink parent award report block reply AmarilloArmadillo 1 points 2 days ago Is his hat getting bigger? permalink parent award report block reply axiy 18 points 2 days ago He's a 24 year old man, of course he's one of us. He and his peers who've followed every rule have been utterly fucked by legal immigration. That will radicalize anyone. permalink parent award report block reply brutustyberius 14 points 2 days ago It’s a trap. permalink parent award report block reply ThisTrainHasNoBrakes 13 points 2 days ago This is my take.  Mom was no longer useful so they have to keep the family business going. permalink parent award report block reply CantStumpIWin 7 points 2 days ago So you think they told him to lie on a podcast and they’re giving him money now? permalink parent award report block reply ThisTrainHasNoBrakes 10 points 2 days ago I think we should stop elevating people and making them into news when they come from shit political families.  Why would we care what a random 24 year old says?  Nikki lost relevancy and now the next gen coming in?  and same week they are trying to make Pelosi’s daughter a thing?  Too fishy.  Ignore. permalink parent award report block reply view 2 more comments... bigfatnagger 1 points 2 days ago Yeah that's a good take I think permalink parent award report block reply MAGABOND 4 points 2 days ago No doubt. He could be you.😉 permalink parent award report block reply load 9 more comments... Dangerous 51 points 2 days ago who is British Nuh-uh Funny how he can be so based when his mother is so cringe permalink award report block reply magapatriot_pa 21 points 2 days ago \"British Man\" permalink parent award report block reply Easzq8 4 points 2 days ago Welsh choirboy permalink parent award report block reply Formerlurker92 17 points 2 days ago He's British becausehe stepped off the boat legally, but you're an invader despite being here for 4 generations permalink parent award report block reply Easzq8 3 points 2 days ago Thems Moors is Spanish now permalink parent award report block reply CommanderOfCheese 5 points 2 days ago \"SPAIN WAS A MUSLIM COUNTRY UNTIL CHRISTIANS GENOCIDED THEM!\" Lol before then Spain was Christian until Muslims genocided them. permalink parent award report block reply SHILL_DETECTOR 4 points 2 days ago women are inferior mentally and survival instinct wise...and common sense... permalink parent award report block reply MaoHadOnly1Testicle 2 points 1 day ago Maybe her being so cringe is what made him so based? We hear about RINOs in the headlines, he had to live with one. permalink parent award report block reply Smurfection 1 points 2 days ago Susan Rice's son was the president of the College Republicans at Harvard and regularly listened to Rush Limbaugh on the radio while he was there. permalink parent award report block reply Bullet3250 47 points 2 days ago Absolutely nothing wrong with going to ZERO IMMIGRATION LEVELS...   We had that standard for Decades... and it works well over time. permalink award report block reply Easzq8 8 points 2 days ago Negative preferable permalink parent award report block reply anotherrandomname 6 points 2 days ago It's just common sense immigration control. Indefinite halt on immigration until we return to pre-1965 demographic norms. permalink parent award report block reply dres3 31 points 2 days ago Can we get him instead of the mom?? permalink award report block reply DickTick PRO 25 points 2 days ago Based af permalink award report block reply Patrick_Bateman 15 points 2 days ago strident Republican stance msm 😂 He basically calls establishment Republicans cucks and they still try to brand him. permalink parent award report block reply ParadigmShift2070 7 points 2 days ago What's his stance on Israel permalink parent award report block reply Patrick_Bateman 4 points 2 days ago I'd be willing to wager it's not what you're afraid of, but I don't know for sure. permalink parent award report block reply TrumpLandslide20201 21 points 2 days ago Doesn't sound like a Republican to me sounds like MAGA permalink award report block reply DelendaEstMarxismo 7 points 2 days ago Those positions are historically not extreme at all. Only after decades of treasonous \"leadership\" has the idea been cemented that we're required to be the world's daycare and piggy bank. permalink parent award report block reply Citizen_Bob 13 points 2 days ago Wait, \"Hasan\" isn't a US citizen? Are you fucking kidding me? That ghoul who supports child mutilation and calls for violence against American citizens? WHAT THE FUCK? DEPORT HIS ASS permalink award report block reply Kraken_V_Algorithm 5 points 2 days ago He was naturalized in 2020.  Somehow it seems he still retains his British citizenship though. permalink parent award report block reply Citizen_Bob 6 points 2 days ago strip his citizenship and kick him the FUCK out permalink parent award report block reply RolandDelacroix 11 points 2 days ago Sounds unfathomably Based. permalink award report block reply CounterStrike OP 11 points 2 days ago https://www.dailymail.co.uk/news/article-15276471/Nikki-Haleys-son-ban-legal-immigration.html permalink award report block reply AuPhalanx 8 points 2 days ago Based! permalink award report block reply preferredfault 8 points 2 days ago Don't care. Don't need undercover Rino's trying to pretend their politics are different in order to try to get their foot in the door of politics. There's no way this boy says anything without his parents approval and scheming in the background. permalink award report block reply AmericanJawa 16 points 2 days ago There's no way this boy says anything without his parents approval and scheming in the background. You know this...how? permalink parent award report block reply clownworld30330 9 points 2 days ago The article is a puff piece, complete with a picture of the kid’s abs. That’s all you need. It’s engineered. They should be attacking him, but they’re not. It’s 2025. How long have you been watching the media do what it does? They’re prepping him to run for office. permalink parent award report block reply Major_Nutt 2 points 2 days ago Projection probably. No one thinks a 24 year old simply parrots what their parents say. A 14 year old, yeah. But not a whole-ass adult with 95% formed prefrontal cortex. permalink parent award report block reply MAGABOND 2 points 2 days ago Because it makes him sound smart, in his own stupid mind. Because we all see through his bullshit. Not the kid, but the dude you commented to. permalink parent award report block reply Aquamine-Amarine 4 points 2 days ago You do know that children love to rebel against their parents, right? They'll be even more pissed off if their parents try to tell them what to do or say! permalink parent award report block reply Tardigrade 5 points 2 days ago ONE reason why I don't like to see people here say they're happy to let libs abort their kids. permalink parent award report block reply heightnoise -2 points 2 days ago Anyone here who says that, or wants to put people in woodchippers feet first, is disgusting to me. permalink parent award report block reply Major_Nutt 3 points 2 days ago You have a problem with pedophiles getting fed to woodchippers? permalink parent award report block reply view 5 more comments... Briben 2 points 2 days ago Really?-“'My friend group from high school, all graduated, great degrees from great schools. It's been a year and a half, and not one of them has a job — not one,' he said, adding, 'I'm angry at that, because I'm having to try and help my friends get jobs when their parents got jobs immediately — not just after graduating college, but out of high school,' he said.” permalink parent award report block reply Roadpower 1 points 2 days ago The H1-B awards show. permalink parent award report block reply HockeyMom4Trump 8 points 2 days ago The younger generation is so BASED! Thanks to the leftist lunatics, these youngsters know! And thanks, Charlie Kirk. RIP permalink award report block reply Saltish 7 points 2 days ago Reminder: Nikki Haley advocated for importing one million Gaza \"refugees\" into the United States. Never forget that. permalink award report block reply ConfusedAngryArmed 6 points 2 days ago I keep saying it, we're in for a wild 10 years. It's not just Gen Z that feels this way, a lot of millennials do too, and Gen Alpha will likely continue this trend. permalink award report block reply LabTech 5 points 2 days ago I can't imagine it's easy to be Haley's son, especially the humiliation he must've felt after it became known that she was basically banging every man in her office that wasn't her husband while he was out on duty, then using the same husband as a feather in her cap during her campaigns. Sons cleave more to their fathers, so I'm sure he's in no rush to recant his statements. Still, actions speak louder than words, and the next generation's already being primed to enter the halls of power; he's one to watch to see if he's legit, or just another psyop. permalink award report block reply vongregormench 4 points 2 days ago First off, why do republicans think this is a bad position, and second, she’s not responsible for her adult son’s opinions. It has no bearing on her candidacy. I think her son is probably the better candidate from what little I know of him. permalink award report block reply MatterThatMetals 4 points 2 days ago Smart kid permalink award report block reply entwickelnden 4 points 2 days ago based, he knows the destruction his mother's ideology bring. permalink award report block reply SanityGumby 4 points 2 days ago I’m beginning to think all of the children these RINOs had truly despise them. permalink award report block reply bootsy_two_scoops 4 points 2 days ago “Nooo your grandmother came from India!” She should have stayed there <chad.jpg> permalink award report block reply Mikespenis123 3 points 2 days ago Nikki the Poo was part of the assassination plot, prove me wrong... permalink award report block reply NoMoreShinesBilly 3 points 2 days ago strident?  to expect that all illegal aliens be deported? permalink award report block reply CarolinaDreadd 3 points 2 days ago My man🫡 permalink award report block reply djentropyhardcore 3 points 2 days ago Based.  He's cute too. permalink award report block reply SenorTrumper -1 points 2 days ago ^Fake and gay comment.^ permalink parent award report block reply paramour 3 points 2 days ago Based. permalink award report block reply DrVSGGEOTUSPhD 3 points 2 days ago Based....haley? permalink award report block reply thp2034 2 points 2 days ago HA! I like him! 👍😎 permalink award report block reply bemac 2 points 2 days ago Good South Carolina boy. permalink award report block reply ghettometal 2 points 2 days ago the golems are repositoning or shape shifting. Where's the news? permalink award report block reply AerialRush 2 points 2 days ago Blows up her reputation? He literally saved them from being deported along with her idiotic America-last policies. He's a true American son. permalink award report block reply Pnw4gotpwd 2 points 2 days ago At least she raised him right! permalink award report block reply Smurfection 2 points 2 days ago How did she get such a good son? permalink award report block reply bigfatnagger 2 points 2 days ago He sounds based permalink award report block reply Emperorvoid 2 points 2 days ago The only correct way to rebel against old guard Bushite RINO Republicans is to go MAGA! permalink award report block reply MAGALADON9 2 points 2 days ago Ok my fellow slightly jelly frenz He sounds good, sure, and we normally hop on anyone who has strident opinions like his as fans but we are kinda slow with him. Is it like how every male singer women liked back in school was \"probably gay\" ... im just saying it would be great if what he is saying is true. And his \"summer Chad heartthrob\" looks would help marketing maga to young girls. His parents were both political figures maybe he is setting up a potential future and is laying groundwork.  Then again maybe he is a secret deep state asset. We seem cool with Sidney Sweeny but besides shooting some guns she hasn't said much, she wears a star of David necklace (but is apparently not jewish) but who knows what her deal is but when she doesn't answer a question on a GQ interview we are all gushing like simps - \"ohhhh so brave,  she just looked at that bitch and didn't give her what she wanted... how cool...\"   calm down boys. She hasn't said shit, but this kid with two politician parents says a ton yet we are giving him side eye. Sorry... just struck a nerve. People don't know how hard it is to be an extremely attractive guy.  [Sniffles...]  it's just hard... we get so much hate from fat dorks and just generic ugly people. permalink award report block reply guywholikesDjtof2024 2 points 1 day ago Barron Trump v2! permalink award report block reply GrizzlyT55 2 points 2 days ago I wonder what his screen name is on pdw? permalink award report block reply EastTexasMadLad 2 points 2 days ago Sounds like a smart man to me permalink award report block reply GreyKnight 2 points 2 days ago Why are we “giving aid” by which I mean theft of our money that was traced for the sole purpose that it could be given away simply so some people could skim off the top…? permalink award report block reply Stanwyk74 2 points 2 days ago The daughter looks like winnie cooper permalink award report block reply Krampus5150 2 points 2 days ago I had to scroll back up and look haha. Sure as shit does. permalink parent award report block reply FuckRedditMAGAMAGA 2 points 2 days ago Huh. Check out her son in law. permalink award report block reply SenorTrumper 2 points 2 days ago Link? permalink parent award report block reply ListenToSavage 1 points 2 days ago Good Clemson football player. Nothing wrong with that. permalink parent award report block reply Arriveria 1 points 2 days ago He is an Indian permalink award report block reply NADSAQ 1 points 2 days ago Nikki Haley has a legacy? permalink award report block reply tholinz 1 points 2 days ago Nikki Haley has kids? permalink award report block reply SweetBeef 1 points 2 days ago LOL I forgot she existed permalink award report block reply Getelectedordietryin 1 points 2 days ago We gotta save him permalink award report block reply AmerikaUberAlles 1 points 2 days ago *ban all non-white legal immigration (fixed it) permalink award report block reply PepePinochet 1 points 2 days ago Uh. Based? permalink award report block reply PleaseHonk 1 points 2 days ago 💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯 permalink award report block reply BlackToof_Grin 1 points 2 days ago Never herd of unHerd. But thanks. Best, Toofy - 🐸 permalink award report block reply DITTOPatriot 1 points 2 days ago Groyper, wonder what his thoughts are on the blue flag? permalink award report block reply lul_cheto 1 points 2 days ago Wolf in sheep's clothing. permalink award report block reply deleted 1 points 2 days ago sod_off_shotgun 3 points 2 days ago I thought she is a street shitter permalink parent award report block reply Greenspikefrog 1 points 2 days ago Based permalink award report block reply AwShitHereWeGoAgain 1 points 2 days ago She's a cunt.  Glad he's breaking ranks. permalink award report block reply ColonelKlink 1 points 2 days ago No more until we fix the problems all the illegal ones caused and deport them all. This is going to take a long time.  Then, if we decide to let more in, they have to be the best and the brightest. Not people who fake degrees and scam everyone. permalink award report block reply hansgruber7 1 points 2 days ago She named her son Nalin? permalink award report block reply KernalMustard 2 points 2 days ago Nalin Hayley is a one letter off a porn title. permalink parent award report block reply SenorTrumper 2 points 2 days ago ?i? permalink parent award report block reply Easzq8 0 points 2 days ago Based. permalink award report block reply America_No_1 0 points 2 days ago <starwars_moar_gif.jpeg> permalink award report block reply SERP-SERP -3 points 2 days ago Someone has been watching Nick Fuentes. permalink award report block reply Rakkasan91b 13 points 2 days ago You don't have to listen to Fuentes to have these opinions on immigration. permalink parent award report block reply berserkerbarrage 5 points 2 days ago He's a faggot who voted for Kamala Harris? I didn't get that from his comments. permalink parent award report block reply MasterChief08 0 points 2 days ago Fuentes is friends with Destiny and likely gay. There's other right wingers who are ethnic nationalists permalink parent award report block reply YT45 0 points 2 days ago Fuentes is gayer than Bill Mitchell. permalink parent award report block reply\nDeplorable_Yankee 140 points 2 days ago I wonder if he is one of us 😂 permalink award report block reply texas4ever 100 points 2 days ago Many of us came from leftist homes but saw how the world really works. permalink parent award report block reply Noxide 39 points 2 days ago True, but the stakes are high with him. He'd have to speak through his actions more than his words if he wants the people's trust. permalink parent award report block reply texas4ever 3 points 2 days ago That standard applies to everyone, judge them by their fruits. permalink parent award report block reply America_No_1 19 points 2 days ago I was liberal in the classical sense until Ron Paul red pilled me.  Then came Ron Paul with a bigger teeth, Trump. permalink parent award report block reply Seldom_Seen_Kid 19 points 2 days ago I’ll throw H. Ross Perot into that mix. Voted for him in the primary. permalink parent award report block reply AndanteAndante 9 points 2 days ago I voted for him in the election and actually voted for Clinton. I was young and principled and didn't understand how things work... permalink parent award report block reply view 1 more comments... Build_Back_Bankrupt 9 points 2 days ago I was in about 5th grade when Ross ran, but I remember thinking we needed a business guy like that, I knew nothing about politics at the time, but he seemed presidential to me. I thought Bush Sr. was boring and mean and Dukakis just looked dumb. permalink parent award report block reply view 1 more comments... Overkillengine 7 points 2 days ago Everyone should have listened to him when he described the giant sucking noise of NAFTA decades ago. permalink parent award report block reply view 1 more comments... Build_Back_Bankrupt 4 points 2 days ago Yep, that's when I started paying more attention to who the establishment did not want. permalink parent award report block reply Remember_the_Alamo 1 points 2 days ago That is a great way of putting it! permalink parent award report block reply Standingoak 0 points 2 days ago Ron is an ideologue , Trump is a pragmatic realist with high ideals , a plan , a team and higher IQ. permalink parent award report block reply snoopy3210 17 points 2 days ago Exactly: Steven Miller permalink parent award report block reply _Sully_ 8 points 2 days ago My Dad was a communist. permalink parent award report block reply anotherthing 2 points 1 day ago My dad's a lifelong Democrat. He's actually changed his opinions on things to fit the Democrat current talking points. He actually stopped going to church when the pastor said they needed to pray for Bush and guide him after 9/11. He used to be fairly conservative when he was younger, but he's moved left because the Democrats did. permalink parent award report block reply glow-operator-2-0 2 points 1 day ago Politics aren't sports teams. They're part of your culture. Sounds like he has neither, so it gets dictated to him. permalink parent award report block reply _Sully_ 2 points 1 day ago Sounds like my Dad. permalink parent award report block reply MyDadLikedBiden 2 points 2 days ago Mine wasn’t, but… permalink parent award report block reply Overkillengine 4 points 2 days ago Yup. My mom is a certified DNC-bot with a broken man-picker. I refuse to enable the pattern. permalink parent award report block reply MAGALADON9 4 points 2 days ago My mom calls me a nazi all the time. And one day... It became true.... Jk jk ....? permalink parent award report block reply Viewer01 56 points 2 days ago I keep saying it but Gen Z going to do some wild shit. 1/3 of them didn’t even make it out the womb the fight to kill them was so bad. Then they had to grow up in immense faggotry taught by feminist teachers who actually hated them for existing. Only to hit college age and find out they’ve been wholly disenfranchised. Can’t even get into schools because they’re white men. Further they look at their females and the whores in sodom and gamorah would blush at them. Then. You get Zionists saying shit like this. https://x.com/marionawfal/status/1987958442389369250?s=46 permalink parent award report block reply GatoradeJeb 27 points 2 days ago The biggest humiliation is seeing as a White man how bad the dating pool prospects are for us as most young White woman are race traitor scum who racemix/mudshark. I live in the south in a very red state and almost every young White woman is with a worthless wetback or jogger. This is genocide by replacement permalink parent award report block reply MJPalazzolo 12 points 2 days ago This is typical and predictable female vindictive behavior. You toss them, they'll 'show you'. permalink parent award report block reply BillyBobBrewer 8 points 2 days ago Fuck em. One you go black we don't want you back. permalink parent award report block reply view 1 more comments... MAGALADON9 5 points 2 days ago The average black American is 22-25% non black mostly white admixture. Obama looks \"black\" but when he traveled to Kenya the film shows laughing kids and the translation says \"look a white man comes to africa\" -- that's how white they see our standard of black. This is erasure of blackness.  They take the skrags and fatties and slowly they fade into this lighter and lighter coffee. If I was black it'd piss me off permalink parent award report block reply view 3 more comments... bigfatnagger 2 points 2 days ago Wtf seriously? That's weird but that generation grew up being told white men are the root of all evil so I guess maybe it's not all that weird. permalink parent award report block reply GatoradeJeb 1 points 1 day ago Its very depressing. It exploded after the blm insurrection. Hollywood showing White woman with jogger in all tv/ads also brainwashed them permalink parent award report block reply Sgt_Hulka 3 points 2 days ago I hate that worm. I wish I could put a propeller on that skullcap. permalink parent award report block reply Viewer01 0 points 2 days ago You don’t hate him enough. https://patriots.win/p/1ARK9irmOn permalink parent award report block reply AmarilloArmadillo 1 points 2 days ago Is his hat getting bigger? permalink parent award report block reply axiy 18 points 2 days ago He's a 24 year old man, of course he's one of us. He and his peers who've followed every rule have been utterly fucked by legal immigration. That will radicalize anyone. permalink parent award report block reply brutustyberius 14 points 2 days ago It’s a trap. permalink parent award report block reply ThisTrainHasNoBrakes 13 points 2 days ago This is my take.  Mom was no longer useful so they have to keep the family business going. permalink parent award report block reply CantStumpIWin 7 points 2 days ago So you think they told him to lie on a podcast and they’re giving him money now? permalink parent award report block reply ThisTrainHasNoBrakes 10 points 2 days ago I think we should stop elevating people and making them into news when they come from shit political families.  Why would we care what a random 24 year old says?  Nikki lost relevancy and now the next gen coming in?  and same week they are trying to make Pelosi’s daughter a thing?  Too fishy.  Ignore. permalink parent award report block reply view 2 more comments... bigfatnagger 1 points 2 days ago Yeah that's a good take I think permalink parent award report block reply MAGABOND 4 points 2 days ago No doubt. He could be you.😉 permalink parent award report block reply load 9 more comments...\ntexas4ever 100 points 2 days ago Many of us came from leftist homes but saw how the world really works. permalink parent award report block reply Noxide 39 points 2 days ago True, but the stakes are high with him. He'd have to speak through his actions more than his words if he wants the people's trust. permalink parent award report block reply texas4ever 3 points 2 days ago That standard applies to everyone, judge them by their fruits. permalink parent award report block reply America_No_1 19 points 2 days ago I was liberal in the classical sense until Ron Paul red pilled me.  Then came Ron Paul with a bigger teeth, Trump. permalink parent award report block reply Seldom_Seen_Kid 19 points 2 days ago I’ll throw H. Ross Perot into that mix. Voted for him in the primary. permalink parent award report block reply AndanteAndante 9 points 2 days ago I voted for him in the election and actually voted for Clinton. I was young and principled and didn't understand how things work... permalink parent award report block reply view 1 more comments... Build_Back_Bankrupt 9 points 2 days ago I was in about 5th grade when Ross ran, but I remember thinking we needed a business guy like that, I knew nothing about politics at the time, but he seemed presidential to me. I thought Bush Sr. was boring and mean and Dukakis just looked dumb. permalink parent award report block reply view 1 more comments... Overkillengine 7 points 2 days ago Everyone should have listened to him when he described the giant sucking noise of NAFTA decades ago. permalink parent award report block reply view 1 more comments... Build_Back_Bankrupt 4 points 2 days ago Yep, that's when I started paying more attention to who the establishment did not want. permalink parent award report block reply Remember_the_Alamo 1 points 2 days ago That is a great way of putting it! permalink parent award report block reply Standingoak 0 points 2 days ago Ron is an ideologue , Trump is a pragmatic realist with high ideals , a plan , a team and higher IQ. permalink parent award report block reply snoopy3210 17 points 2 days ago Exactly: Steven Miller permalink parent award report block reply _Sully_ 8 points 2 days ago My Dad was a communist. permalink parent award report block reply anotherthing 2 points 1 day ago My dad's a lifelong Democrat. He's actually changed his opinions on things to fit the Democrat current talking points. He actually stopped going to church when the pastor said they needed to pray for Bush and guide him after 9/11. He used to be fairly conservative when he was younger, but he's moved left because the Democrats did. permalink parent award report block reply glow-operator-2-0 2 points 1 day ago Politics aren't sports teams. They're part of your culture. Sounds like he has neither, so it gets dictated to him. permalink parent award report block reply _Sully_ 2 points 1 day ago Sounds like my Dad. permalink parent award report block reply MyDadLikedBiden 2 points 2 days ago Mine wasn’t, but… permalink parent award report block reply Overkillengine 4 points 2 days ago Yup. My mom is a certified DNC-bot with a broken man-picker. I refuse to enable the pattern. permalink parent award report block reply MAGALADON9 4 points 2 days ago My mom calls me a nazi all the time. And one day... It became true.... Jk jk ....? permalink parent award report block reply\nNoxide 39 points 2 days ago True, but the stakes are high with him. He'd have to speak through his actions more than his words if he wants the people's trust. permalink parent award report block reply texas4ever 3 points 2 days ago That standard applies to everyone, judge them by their fruits. permalink parent award report block reply\ntexas4ever 3 points 2 days ago That standard applies to everyone, judge them by their fruits. permalink parent award report block reply\nAmerica_No_1 19 points 2 days ago I was liberal in the classical sense until Ron Paul red pilled me.  Then came Ron Paul with a bigger teeth, Trump. permalink parent award report block reply Seldom_Seen_Kid 19 points 2 days ago I’ll throw H. Ross Perot into that mix. Voted for him in the primary. permalink parent award report block reply AndanteAndante 9 points 2 days ago I voted for him in the election and actually voted for Clinton. I was young and principled and didn't understand how things work... permalink parent award report block reply view 1 more comments... Build_Back_Bankrupt 9 points 2 days ago I was in about 5th grade when Ross ran, but I remember thinking we needed a business guy like that, I knew nothing about politics at the time, but he seemed presidential to me. I thought Bush Sr. was boring and mean and Dukakis just looked dumb. permalink parent award report block reply view 1 more comments... Overkillengine 7 points 2 days ago Everyone should have listened to him when he described the giant sucking noise of NAFTA decades ago. permalink parent award report block reply view 1 more comments... Build_Back_Bankrupt 4 points 2 days ago Yep, that's when I started paying more attention to who the establishment did not want. permalink parent award report block reply Remember_the_Alamo 1 points 2 days ago That is a great way of putting it! permalink parent award report block reply Standingoak 0 points 2 days ago Ron is an ideologue , Trump is a pragmatic realist with high ideals , a plan , a team and higher IQ. permalink parent award report block reply\nSeldom_Seen_Kid 19 points 2 days ago I’ll throw H. Ross Perot into that mix. Voted for him in the primary. permalink parent award report block reply AndanteAndante 9 points 2 days ago I voted for him in the election and actually voted for Clinton. I was young and principled and didn't understand how things work... permalink parent award report block reply view 1 more comments... Build_Back_Bankrupt 9 points 2 days ago I was in about 5th grade when Ross ran, but I remember thinking we needed a business guy like that, I knew nothing about politics at the time, but he seemed presidential to me. I thought Bush Sr. was boring and mean and Dukakis just looked dumb. permalink parent award report block reply view 1 more comments... Overkillengine 7 points 2 days ago Everyone should have listened to him when he described the giant sucking noise of NAFTA decades ago. permalink parent award report block reply view 1 more comments...\nAndanteAndante 9 points 2 days ago I voted for him in the election and actually voted for Clinton. I was young and principled and didn't understand how things work... permalink parent award report block reply view 1 more comments...\nBuild_Back_Bankrupt 9 points 2 days ago I was in about 5th grade when Ross ran, but I remember thinking we needed a business guy like that, I knew nothing about politics at the time, but he seemed presidential to me. I thought Bush Sr. was boring and mean and Dukakis just looked dumb. permalink parent award report block reply view 1 more comments...\nOverkillengine 7 points 2 days ago Everyone should have listened to him when he described the giant sucking noise of NAFTA decades ago. permalink parent award report block reply view 1 more comments...\nBuild_Back_Bankrupt 4 points 2 days ago Yep, that's when I started paying more attention to who the establishment did not want. permalink parent award report block reply\nRemember_the_Alamo 1 points 2 days ago That is a great way of putting it! permalink parent award report block reply\nStandingoak 0 points 2 days ago Ron is an ideologue , Trump is a pragmatic realist with high ideals , a plan , a team and higher IQ. permalink parent award report block reply\nsnoopy3210 17 points 2 days ago Exactly: Steven Miller permalink parent award report block reply\n_Sully_ 8 points 2 days ago My Dad was a communist. permalink parent award report block reply anotherthing 2 points 1 day ago My dad's a lifelong Democrat. He's actually changed his opinions on things to fit the Democrat current talking points. He actually stopped going to church when the pastor said they needed to pray for Bush and guide him after 9/11. He used to be fairly conservative when he was younger, but he's moved left because the Democrats did. permalink parent award report block reply glow-operator-2-0 2 points 1 day ago Politics aren't sports teams. They're part of your culture. Sounds like he has neither, so it gets dictated to him. permalink parent award report block reply _Sully_ 2 points 1 day ago Sounds like my Dad. permalink parent award report block reply MyDadLikedBiden 2 points 2 days ago Mine wasn’t, but… permalink parent award report block reply\nanotherthing 2 points 1 day ago My dad's a lifelong Democrat. He's actually changed his opinions on things to fit the Democrat current talking points. He actually stopped going to church when the pastor said they needed to pray for Bush and guide him after 9/11. He used to be fairly conservative when he was younger, but he's moved left because the Democrats did. permalink parent award report block reply glow-operator-2-0 2 points 1 day ago Politics aren't sports teams. They're part of your culture. Sounds like he has neither, so it gets dictated to him. permalink parent award report block reply _Sully_ 2 points 1 day ago Sounds like my Dad. permalink parent award report block reply\nglow-operator-2-0 2 points 1 day ago Politics aren't sports teams. They're part of your culture. Sounds like he has neither, so it gets dictated to him. permalink parent award report block reply\n_Sully_ 2 points 1 day ago Sounds like my Dad. permalink parent award report block reply\nMyDadLikedBiden 2 points 2 days ago Mine wasn’t, but… permalink parent award report block reply\nOverkillengine 4 points 2 days ago Yup. My mom is a certified DNC-bot with a broken man-picker. I refuse to enable the pattern. permalink parent award report block reply MAGALADON9 4 points 2 days ago My mom calls me a nazi all the time. And one day... It became true.... Jk jk ....? permalink parent award report block reply\nMAGALADON9 4 points 2 days ago My mom calls me a nazi all the time. And one day... It became true.... Jk jk ....? permalink parent award report block reply\nViewer01 56 points 2 days ago I keep saying it but Gen Z going to do some wild shit. 1/3 of them didn’t even make it out the womb the fight to kill them was so bad. Then they had to grow up in immense faggotry taught by feminist teachers who actually hated them for existing. Only to hit college age and find out they’ve been wholly disenfranchised. Can’t even get into schools because they’re white men. Further they look at their females and the whores in sodom and gamorah would blush at them. Then. You get Zionists saying shit like this. https://x.com/marionawfal/status/1987958442389369250?s=46 permalink parent award report block reply GatoradeJeb 27 points 2 days ago The biggest humiliation is seeing as a White man how bad the dating pool prospects are for us as most young White woman are race traitor scum who racemix/mudshark. I live in the south in a very red state and almost every young White woman is with a worthless wetback or jogger. This is genocide by replacement permalink parent award report block reply MJPalazzolo 12 points 2 days ago This is typical and predictable female vindictive behavior. You toss them, they'll 'show you'. permalink parent award report block reply BillyBobBrewer 8 points 2 days ago Fuck em. One you go black we don't want you back. permalink parent award report block reply view 1 more comments... MAGALADON9 5 points 2 days ago The average black American is 22-25% non black mostly white admixture. Obama looks \"black\" but when he traveled to Kenya the film shows laughing kids and the translation says \"look a white man comes to africa\" -- that's how white they see our standard of black. This is erasure of blackness.  They take the skrags and fatties and slowly they fade into this lighter and lighter coffee. If I was black it'd piss me off permalink parent award report block reply view 3 more comments... bigfatnagger 2 points 2 days ago Wtf seriously? That's weird but that generation grew up being told white men are the root of all evil so I guess maybe it's not all that weird. permalink parent award report block reply GatoradeJeb 1 points 1 day ago Its very depressing. It exploded after the blm insurrection. Hollywood showing White woman with jogger in all tv/ads also brainwashed them permalink parent award report block reply Sgt_Hulka 3 points 2 days ago I hate that worm. I wish I could put a propeller on that skullcap. permalink parent award report block reply Viewer01 0 points 2 days ago You don’t hate him enough. https://patriots.win/p/1ARK9irmOn permalink parent award report block reply AmarilloArmadillo 1 points 2 days ago Is his hat getting bigger? permalink parent award report block reply\nGatoradeJeb 27 points 2 days ago The biggest humiliation is seeing as a White man how bad the dating pool prospects are for us as most young White woman are race traitor scum who racemix/mudshark. I live in the south in a very red state and almost every young White woman is with a worthless wetback or jogger. This is genocide by replacement permalink parent award report block reply MJPalazzolo 12 points 2 days ago This is typical and predictable female vindictive behavior. You toss them, they'll 'show you'. permalink parent award report block reply BillyBobBrewer 8 points 2 days ago Fuck em. One you go black we don't want you back. permalink parent award report block reply view 1 more comments... MAGALADON9 5 points 2 days ago The average black American is 22-25% non black mostly white admixture. Obama looks \"black\" but when he traveled to Kenya the film shows laughing kids and the translation says \"look a white man comes to africa\" -- that's how white they see our standard of black. This is erasure of blackness.  They take the skrags and fatties and slowly they fade into this lighter and lighter coffee. If I was black it'd piss me off permalink parent award report block reply view 3 more comments... bigfatnagger 2 points 2 days ago Wtf seriously? That's weird but that generation grew up being told white men are the root of all evil so I guess maybe it's not all that weird. permalink parent award report block reply GatoradeJeb 1 points 1 day ago Its very depressing. It exploded after the blm insurrection. Hollywood showing White woman with jogger in all tv/ads also brainwashed them permalink parent award report block reply\nMJPalazzolo 12 points 2 days ago This is typical and predictable female vindictive behavior. You toss them, they'll 'show you'. permalink parent award report block reply BillyBobBrewer 8 points 2 days ago Fuck em. One you go black we don't want you back. permalink parent award report block reply view 1 more comments... MAGALADON9 5 points 2 days ago The average black American is 22-25% non black mostly white admixture. Obama looks \"black\" but when he traveled to Kenya the film shows laughing kids and the translation says \"look a white man comes to africa\" -- that's how white they see our standard of black. This is erasure of blackness.  They take the skrags and fatties and slowly they fade into this lighter and lighter coffee. If I was black it'd piss me off permalink parent award report block reply view 3 more comments...\nBillyBobBrewer 8 points 2 days ago Fuck em. One you go black we don't want you back. permalink parent award report block reply view 1 more comments...\nMAGALADON9 5 points 2 days ago The average black American is 22-25% non black mostly white admixture. Obama looks \"black\" but when he traveled to Kenya the film shows laughing kids and the translation says \"look a white man comes to africa\" -- that's how white they see our standard of black. This is erasure of blackness.  They take the skrags and fatties and slowly they fade into this lighter and lighter coffee. If I was black it'd piss me off permalink parent award report block reply view 3 more comments...\nbigfatnagger 2 points 2 days ago Wtf seriously? That's weird but that generation grew up being told white men are the root of all evil so I guess maybe it's not all that weird. permalink parent award report block reply GatoradeJeb 1 points 1 day ago Its very depressing. It exploded after the blm insurrection. Hollywood showing White woman with jogger in all tv/ads also brainwashed them permalink parent award report block reply\nGatoradeJeb 1 points 1 day ago Its very depressing. It exploded after the blm insurrection. Hollywood showing White woman with jogger in all tv/ads also brainwashed them permalink parent award report block reply\nSgt_Hulka 3 points 2 days ago I hate that worm. I wish I could put a propeller on that skullcap. permalink parent award report block reply Viewer01 0 points 2 days ago You don’t hate him enough. https://patriots.win/p/1ARK9irmOn permalink parent award report block reply\nViewer01 0 points 2 days ago You don’t hate him enough. https://patriots.win/p/1ARK9irmOn permalink parent award report block reply\nAmarilloArmadillo 1 points 2 days ago Is his hat getting bigger? permalink parent award report block reply\naxiy 18 points 2 days ago He's a 24 year old man, of course he's one of us. He and his peers who've followed every rule have been utterly fucked by legal immigration. That will radicalize anyone. permalink parent award report block reply\nbrutustyberius 14 points 2 days ago It’s a trap. permalink parent award report block reply ThisTrainHasNoBrakes 13 points 2 days ago This is my take.  Mom was no longer useful so they have to keep the family business going. permalink parent award report block reply CantStumpIWin 7 points 2 days ago So you think they told him to lie on a podcast and they’re giving him money now? permalink parent award report block reply ThisTrainHasNoBrakes 10 points 2 days ago I think we should stop elevating people and making them into news when they come from shit political families.  Why would we care what a random 24 year old says?  Nikki lost relevancy and now the next gen coming in?  and same week they are trying to make Pelosi’s daughter a thing?  Too fishy.  Ignore. permalink parent award report block reply view 2 more comments... bigfatnagger 1 points 2 days ago Yeah that's a good take I think permalink parent award report block reply\nThisTrainHasNoBrakes 13 points 2 days ago This is my take.  Mom was no longer useful so they have to keep the family business going. permalink parent award report block reply CantStumpIWin 7 points 2 days ago So you think they told him to lie on a podcast and they’re giving him money now? permalink parent award report block reply ThisTrainHasNoBrakes 10 points 2 days ago I think we should stop elevating people and making them into news when they come from shit political families.  Why would we care what a random 24 year old says?  Nikki lost relevancy and now the next gen coming in?  and same week they are trying to make Pelosi’s daughter a thing?  Too fishy.  Ignore. permalink parent award report block reply view 2 more comments...\nCantStumpIWin 7 points 2 days ago So you think they told him to lie on a podcast and they’re giving him money now? permalink parent award report block reply ThisTrainHasNoBrakes 10 points 2 days ago I think we should stop elevating people and making them into news when they come from shit political families.  Why would we care what a random 24 year old says?  Nikki lost relevancy and now the next gen coming in?  and same week they are trying to make Pelosi’s daughter a thing?  Too fishy.  Ignore. permalink parent award report block reply view 2 more comments...\nThisTrainHasNoBrakes 10 points 2 days ago I think we should stop elevating people and making them into news when they come from shit political families.  Why would we care what a random 24 year old says?  Nikki lost relevancy and now the next gen coming in?  and same week they are trying to make Pelosi’s daughter a thing?  Too fishy.  Ignore. permalink parent award report block reply view 2 more comments...\nbigfatnagger 1 points 2 days ago Yeah that's a good take I think permalink parent award report block reply\nMAGABOND 4 points 2 days ago No doubt. He could be you.😉 permalink parent award report block reply\nDangerous 51 points 2 days ago who is British Nuh-uh Funny how he can be so based when his mother is so cringe permalink award report block reply magapatriot_pa 21 points 2 days ago \"British Man\" permalink parent award report block reply Easzq8 4 points 2 days ago Welsh choirboy permalink parent award report block reply Formerlurker92 17 points 2 days ago He's British becausehe stepped off the boat legally, but you're an invader despite being here for 4 generations permalink parent award report block reply Easzq8 3 points 2 days ago Thems Moors is Spanish now permalink parent award report block reply CommanderOfCheese 5 points 2 days ago \"SPAIN WAS A MUSLIM COUNTRY UNTIL CHRISTIANS GENOCIDED THEM!\" Lol before then Spain was Christian until Muslims genocided them. permalink parent award report block reply SHILL_DETECTOR 4 points 2 days ago women are inferior mentally and survival instinct wise...and common sense... permalink parent award report block reply MaoHadOnly1Testicle 2 points 1 day ago Maybe her being so cringe is what made him so based? We hear about RINOs in the headlines, he had to live with one. permalink parent award report block reply Smurfection 1 points 2 days ago Susan Rice's son was the president of the College Republicans at Harvard and regularly listened to Rush Limbaugh on the radio while he was there. permalink parent award report block reply\nmagapatriot_pa 21 points 2 days ago \"British Man\" permalink parent award report block reply Easzq8 4 points 2 days ago Welsh choirboy permalink parent award report block reply\nEaszq8 4 points 2 days ago Welsh choirboy permalink parent award report block reply\nFormerlurker92 17 points 2 days ago He's British becausehe stepped off the boat legally, but you're an invader despite being here for 4 generations permalink parent award report block reply Easzq8 3 points 2 days ago Thems Moors is Spanish now permalink parent award report block reply CommanderOfCheese 5 points 2 days ago \"SPAIN WAS A MUSLIM COUNTRY UNTIL CHRISTIANS GENOCIDED THEM!\" Lol before then Spain was Christian until Muslims genocided them. permalink parent award report block reply\nEaszq8 3 points 2 days ago Thems Moors is Spanish now permalink parent award report block reply CommanderOfCheese 5 points 2 days ago \"SPAIN WAS A MUSLIM COUNTRY UNTIL CHRISTIANS GENOCIDED THEM!\" Lol before then Spain was Christian until Muslims genocided them. permalink parent award report block reply\nCommanderOfCheese 5 points 2 days ago \"SPAIN WAS A MUSLIM COUNTRY UNTIL CHRISTIANS GENOCIDED THEM!\" Lol before then Spain was Christian until Muslims genocided them. permalink parent award report block reply\nSHILL_DETECTOR 4 points 2 days ago women are inferior mentally and survival instinct wise...and common sense... permalink parent award report block reply\nMaoHadOnly1Testicle 2 points 1 day ago Maybe her being so cringe is what made him so based? We hear about RINOs in the headlines, he had to live with one. permalink parent award report block reply\nSmurfection 1 points 2 days ago Susan Rice's son was the president of the College Republicans at Harvard and regularly listened to Rush Limbaugh on the radio while he was there. permalink parent award report block reply\nBullet3250 47 points 2 days ago Absolutely nothing wrong with going to ZERO IMMIGRATION LEVELS...   We had that standard for Decades... and it works well over time. permalink award report block reply Easzq8 8 points 2 days ago Negative preferable permalink parent award report block reply anotherrandomname 6 points 2 days ago It's just common sense immigration control. Indefinite halt on immigration until we return to pre-1965 demographic norms. permalink parent award report block reply\nEaszq8 8 points 2 days ago Negative preferable permalink parent award report block reply\nanotherrandomname 6 points 2 days ago It's just common sense immigration control. Indefinite halt on immigration until we return to pre-1965 demographic norms. permalink parent award report block reply\ndres3 31 points 2 days ago Can we get him instead of the mom?? permalink award report block reply\nDickTick PRO 25 points 2 days ago Based af permalink award report block reply Patrick_Bateman 15 points 2 days ago strident Republican stance msm 😂 He basically calls establishment Republicans cucks and they still try to brand him. permalink parent award report block reply ParadigmShift2070 7 points 2 days ago What's his stance on Israel permalink parent award report block reply Patrick_Bateman 4 points 2 days ago I'd be willing to wager it's not what you're afraid of, but I don't know for sure. permalink parent award report block reply\nPatrick_Bateman 15 points 2 days ago strident Republican stance msm 😂 He basically calls establishment Republicans cucks and they still try to brand him. permalink parent award report block reply ParadigmShift2070 7 points 2 days ago What's his stance on Israel permalink parent award report block reply Patrick_Bateman 4 points 2 days ago I'd be willing to wager it's not what you're afraid of, but I don't know for sure. permalink parent award report block reply\nParadigmShift2070 7 points 2 days ago What's his stance on Israel permalink parent award report block reply Patrick_Bateman 4 points 2 days ago I'd be willing to wager it's not what you're afraid of, but I don't know for sure. permalink parent award report block reply\nPatrick_Bateman 4 points 2 days ago I'd be willing to wager it's not what you're afraid of, but I don't know for sure. permalink parent award report block reply\nTrumpLandslide20201 21 points 2 days ago Doesn't sound like a Republican to me sounds like MAGA permalink award report block reply DelendaEstMarxismo 7 points 2 days ago Those positions are historically not extreme at all. Only after decades of treasonous \"leadership\" has the idea been cemented that we're required to be the world's daycare and piggy bank. permalink parent award report block reply\nDelendaEstMarxismo 7 points 2 days ago Those positions are historically not extreme at all. Only after decades of treasonous \"leadership\" has the idea been cemented that we're required to be the world's daycare and piggy bank. permalink parent award report block reply\nCitizen_Bob 13 points 2 days ago Wait, \"Hasan\" isn't a US citizen? Are you fucking kidding me? That ghoul who supports child mutilation and calls for violence against American citizens? WHAT THE FUCK? DEPORT HIS ASS permalink award report block reply Kraken_V_Algorithm 5 points 2 days ago He was naturalized in 2020.  Somehow it seems he still retains his British citizenship though. permalink parent award report block reply Citizen_Bob 6 points 2 days ago strip his citizenship and kick him the FUCK out permalink parent award report block reply\nKraken_V_Algorithm 5 points 2 days ago He was naturalized in 2020.  Somehow it seems he still retains his British citizenship though. permalink parent award report block reply Citizen_Bob 6 points 2 days ago strip his citizenship and kick him the FUCK out permalink parent award report block reply\nCitizen_Bob 6 points 2 days ago strip his citizenship and kick him the FUCK out permalink parent award report block reply\nRolandDelacroix 11 points 2 days ago Sounds unfathomably Based. permalink award report block reply\nCounterStrike OP 11 points 2 days ago https://www.dailymail.co.uk/news/article-15276471/Nikki-Haleys-son-ban-legal-immigration.html permalink award report block reply\nAuPhalanx 8 points 2 days ago Based! permalink award report block reply\npreferredfault 8 points 2 days ago Don't care. Don't need undercover Rino's trying to pretend their politics are different in order to try to get their foot in the door of politics. There's no way this boy says anything without his parents approval and scheming in the background. permalink award report block reply AmericanJawa 16 points 2 days ago There's no way this boy says anything without his parents approval and scheming in the background. You know this...how? permalink parent award report block reply clownworld30330 9 points 2 days ago The article is a puff piece, complete with a picture of the kid’s abs. That’s all you need. It’s engineered. They should be attacking him, but they’re not. It’s 2025. How long have you been watching the media do what it does? They’re prepping him to run for office. permalink parent award report block reply Major_Nutt 2 points 2 days ago Projection probably. No one thinks a 24 year old simply parrots what their parents say. A 14 year old, yeah. But not a whole-ass adult with 95% formed prefrontal cortex. permalink parent award report block reply MAGABOND 2 points 2 days ago Because it makes him sound smart, in his own stupid mind. Because we all see through his bullshit. Not the kid, but the dude you commented to. permalink parent award report block reply Aquamine-Amarine 4 points 2 days ago You do know that children love to rebel against their parents, right? They'll be even more pissed off if their parents try to tell them what to do or say! permalink parent award report block reply Tardigrade 5 points 2 days ago ONE reason why I don't like to see people here say they're happy to let libs abort their kids. permalink parent award report block reply heightnoise -2 points 2 days ago Anyone here who says that, or wants to put people in woodchippers feet first, is disgusting to me. permalink parent award report block reply Major_Nutt 3 points 2 days ago You have a problem with pedophiles getting fed to woodchippers? permalink parent award report block reply view 5 more comments... Briben 2 points 2 days ago Really?-“'My friend group from high school, all graduated, great degrees from great schools. It's been a year and a half, and not one of them has a job — not one,' he said, adding, 'I'm angry at that, because I'm having to try and help my friends get jobs when their parents got jobs immediately — not just after graduating college, but out of high school,' he said.” permalink parent award report block reply Roadpower 1 points 2 days ago The H1-B awards show. permalink parent award report block reply\nAmericanJawa 16 points 2 days ago There's no way this boy says anything without his parents approval and scheming in the background. You know this...how? permalink parent award report block reply clownworld30330 9 points 2 days ago The article is a puff piece, complete with a picture of the kid’s abs. That’s all you need. It’s engineered. They should be attacking him, but they’re not. It’s 2025. How long have you been watching the media do what it does? They’re prepping him to run for office. permalink parent award report block reply Major_Nutt 2 points 2 days ago Projection probably. No one thinks a 24 year old simply parrots what their parents say. A 14 year old, yeah. But not a whole-ass adult with 95% formed prefrontal cortex. permalink parent award report block reply MAGABOND 2 points 2 days ago Because it makes him sound smart, in his own stupid mind. Because we all see through his bullshit. Not the kid, but the dude you commented to. permalink parent award report block reply\nclownworld30330 9 points 2 days ago The article is a puff piece, complete with a picture of the kid’s abs. That’s all you need. It’s engineered. They should be attacking him, but they’re not. It’s 2025. How long have you been watching the media do what it does? They’re prepping him to run for office. permalink parent award report block reply\nMajor_Nutt 2 points 2 days ago Projection probably. No one thinks a 24 year old simply parrots what their parents say. A 14 year old, yeah. But not a whole-ass adult with 95% formed prefrontal cortex. permalink parent award report block reply\nMAGABOND 2 points 2 days ago Because it makes him sound smart, in his own stupid mind. Because we all see through his bullshit. Not the kid, but the dude you commented to. permalink parent award report block reply\nAquamine-Amarine 4 points 2 days ago You do know that children love to rebel against their parents, right? They'll be even more pissed off if their parents try to tell them what to do or say! permalink parent award report block reply Tardigrade 5 points 2 days ago ONE reason why I don't like to see people here say they're happy to let libs abort their kids. permalink parent award report block reply heightnoise -2 points 2 days ago Anyone here who says that, or wants to put people in woodchippers feet first, is disgusting to me. permalink parent award report block reply Major_Nutt 3 points 2 days ago You have a problem with pedophiles getting fed to woodchippers? permalink parent award report block reply view 5 more comments...\nTardigrade 5 points 2 days ago ONE reason why I don't like to see people here say they're happy to let libs abort their kids. permalink parent award report block reply heightnoise -2 points 2 days ago Anyone here who says that, or wants to put people in woodchippers feet first, is disgusting to me. permalink parent award report block reply Major_Nutt 3 points 2 days ago You have a problem with pedophiles getting fed to woodchippers? permalink parent award report block reply view 5 more comments...\nheightnoise -2 points 2 days ago Anyone here who says that, or wants to put people in woodchippers feet first, is disgusting to me. permalink parent award report block reply Major_Nutt 3 points 2 days ago You have a problem with pedophiles getting fed to woodchippers? permalink parent award report block reply view 5 more comments...\nMajor_Nutt 3 points 2 days ago You have a problem with pedophiles getting fed to woodchippers? permalink parent award report block reply view 5 more comments...\nBriben 2 points 2 days ago Really?-“'My friend group from high school, all graduated, great degrees from great schools. It's been a year and a half, and not one of them has a job — not one,' he said, adding, 'I'm angry at that, because I'm having to try and help my friends get jobs when their parents got jobs immediately — not just after graduating college, but out of high school,' he said.” permalink parent award report block reply Roadpower 1 points 2 days ago The H1-B awards show. permalink parent award report block reply\nRoadpower 1 points 2 days ago The H1-B awards show. permalink parent award report block reply\nHockeyMom4Trump 8 points 2 days ago The younger generation is so BASED! Thanks to the leftist lunatics, these youngsters know! And thanks, Charlie Kirk. RIP permalink award report block reply\nSaltish 7 points 2 days ago Reminder: Nikki Haley advocated for importing one million Gaza \"refugees\" into the United States. Never forget that. permalink award report block reply\nConfusedAngryArmed 6 points 2 days ago I keep saying it, we're in for a wild 10 years. It's not just Gen Z that feels this way, a lot of millennials do too, and Gen Alpha will likely continue this trend. permalink award report block reply\nLabTech 5 points 2 days ago I can't imagine it's easy to be Haley's son, especially the humiliation he must've felt after it became known that she was basically banging every man in her office that wasn't her husband while he was out on duty, then using the same husband as a feather in her cap during her campaigns. Sons cleave more to their fathers, so I'm sure he's in no rush to recant his statements. Still, actions speak louder than words, and the next generation's already being primed to enter the halls of power; he's one to watch to see if he's legit, or just another psyop. permalink award report block reply\nvongregormench 4 points 2 days ago First off, why do republicans think this is a bad position, and second, she’s not responsible for her adult son’s opinions. It has no bearing on her candidacy. I think her son is probably the better candidate from what little I know of him. permalink award report block reply\nMatterThatMetals 4 points 2 days ago Smart kid permalink award report block reply\nentwickelnden 4 points 2 days ago based, he knows the destruction his mother's ideology bring. permalink award report block reply\nSanityGumby 4 points 2 days ago I’m beginning to think all of the children these RINOs had truly despise them. permalink award report block reply\nbootsy_two_scoops 4 points 2 days ago “Nooo your grandmother came from India!” She should have stayed there <chad.jpg> permalink award report block reply\nMikespenis123 3 points 2 days ago Nikki the Poo was part of the assassination plot, prove me wrong... permalink award report block reply\nNoMoreShinesBilly 3 points 2 days ago strident?  to expect that all illegal aliens be deported? permalink award report block reply\nCarolinaDreadd 3 points 2 days ago My man🫡 permalink award report block reply\ndjentropyhardcore 3 points 2 days ago Based.  He's cute too. permalink award report block reply SenorTrumper -1 points 2 days ago ^Fake and gay comment.^ permalink parent award report block reply\nSenorTrumper -1 points 2 days ago ^Fake and gay comment.^ permalink parent award report block reply\nparamour 3 points 2 days ago Based. permalink award report block reply\nDrVSGGEOTUSPhD 3 points 2 days ago Based....haley? permalink award report block reply\nthp2034 2 points 2 days ago HA! I like him! 👍😎 permalink award report block reply\nbemac 2 points 2 days ago Good South Carolina boy. permalink award report block reply\nghettometal 2 points 2 days ago the golems are repositoning or shape shifting. Where's the news? permalink award report block reply\nAerialRush 2 points 2 days ago Blows up her reputation? He literally saved them from being deported along with her idiotic America-last policies. He's a true American son. permalink award report block reply\nPnw4gotpwd 2 points 2 days ago At least she raised him right! permalink award report block reply\nSmurfection 2 points 2 days ago How did she get such a good son? permalink award report block reply\nbigfatnagger 2 points 2 days ago He sounds based permalink award report block reply\nEmperorvoid 2 points 2 days ago The only correct way to rebel against old guard Bushite RINO Republicans is to go MAGA! permalink award report block reply\nMAGALADON9 2 points 2 days ago Ok my fellow slightly jelly frenz He sounds good, sure, and we normally hop on anyone who has strident opinions like his as fans but we are kinda slow with him. Is it like how every male singer women liked back in school was \"probably gay\" ... im just saying it would be great if what he is saying is true. And his \"summer Chad heartthrob\" looks would help marketing maga to young girls. His parents were both political figures maybe he is setting up a potential future and is laying groundwork.  Then again maybe he is a secret deep state asset. We seem cool with Sidney Sweeny but besides shooting some guns she hasn't said much, she wears a star of David necklace (but is apparently not jewish) but who knows what her deal is but when she doesn't answer a question on a GQ interview we are all gushing like simps - \"ohhhh so brave,  she just looked at that bitch and didn't give her what she wanted... how cool...\"   calm down boys. She hasn't said shit, but this kid with two politician parents says a ton yet we are giving him side eye. Sorry... just struck a nerve. People don't know how hard it is to be an extremely attractive guy.  [Sniffles...]  it's just hard... we get so much hate from fat dorks and just generic ugly people. permalink award report block reply\nguywholikesDjtof2024 2 points 1 day ago Barron Trump v2! permalink award report block reply\nGrizzlyT55 2 points 2 days ago I wonder what his screen name is on pdw? permalink award report block reply\nEastTexasMadLad 2 points 2 days ago Sounds like a smart man to me permalink award report block reply\nGreyKnight 2 points 2 days ago Why are we “giving aid” by which I mean theft of our money that was traced for the sole purpose that it could be given away simply so some people could skim off the top…? permalink award report block reply\nStanwyk74 2 points 2 days ago The daughter looks like winnie cooper permalink award report block reply Krampus5150 2 points 2 days ago I had to scroll back up and look haha. Sure as shit does. permalink parent award report block reply\nKrampus5150 2 points 2 days ago I had to scroll back up and look haha. Sure as shit does. permalink parent award report block reply\nFuckRedditMAGAMAGA 2 points 2 days ago Huh. Check out her son in law. permalink award report block reply SenorTrumper 2 points 2 days ago Link? permalink parent award report block reply ListenToSavage 1 points 2 days ago Good Clemson football player. Nothing wrong with that. permalink parent award report block reply\nSenorTrumper 2 points 2 days ago Link? permalink parent award report block reply\nListenToSavage 1 points 2 days ago Good Clemson football player. Nothing wrong with that. permalink parent award report block reply\nArriveria 1 points 2 days ago He is an Indian permalink award report block reply\nNADSAQ 1 points 2 days ago Nikki Haley has a legacy? permalink award report block reply\ntholinz 1 points 2 days ago Nikki Haley has kids? permalink award report block reply\nSweetBeef 1 points 2 days ago LOL I forgot she existed permalink award report block reply\nGetelectedordietryin 1 points 2 days ago We gotta save him permalink award report block reply\nAmerikaUberAlles 1 points 2 days ago *ban all non-white legal immigration (fixed it) permalink award report block reply\nPepePinochet 1 points 2 days ago Uh. Based? permalink award report block reply\nPleaseHonk 1 points 2 days ago 💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯 permalink award report block reply\nBlackToof_Grin 1 points 2 days ago Never herd of unHerd. But thanks. Best, Toofy - 🐸 permalink award report block reply\nDITTOPatriot 1 points 2 days ago Groyper, wonder what his thoughts are on the blue flag? permalink award report block reply\nlul_cheto 1 points 2 days ago Wolf in sheep's clothing. permalink award report block reply\ndeleted 1 points 2 days ago sod_off_shotgun 3 points 2 days ago I thought she is a street shitter permalink parent award report block reply\nsod_off_shotgun 3 points 2 days ago I thought she is a street shitter permalink parent award report block reply\nGreenspikefrog 1 points 2 days ago Based permalink award report block reply\nAwShitHereWeGoAgain 1 points 2 days ago She's a cunt.  Glad he's breaking ranks. permalink award report block reply\nColonelKlink 1 points 2 days ago No more until we fix the problems all the illegal ones caused and deport them all. This is going to take a long time.  Then, if we decide to let more in, they have to be the best and the brightest. Not people who fake degrees and scam everyone. permalink award report block reply\nhansgruber7 1 points 2 days ago She named her son Nalin? permalink award report block reply KernalMustard 2 points 2 days ago Nalin Hayley is a one letter off a porn title. permalink parent award report block reply SenorTrumper 2 points 2 days ago ?i? permalink parent award report block reply\nKernalMustard 2 points 2 days ago Nalin Hayley is a one letter off a porn title. permalink parent award report block reply SenorTrumper 2 points 2 days ago ?i? permalink parent award report block reply\nSenorTrumper 2 points 2 days ago ?i? permalink parent award report block reply\nEaszq8 0 points 2 days ago Based. permalink award report block reply\nAmerica_No_1 0 points 2 days ago <starwars_moar_gif.jpeg> permalink award report block reply\nSERP-SERP -3 points 2 days ago Someone has been watching Nick Fuentes. permalink award report block reply Rakkasan91b 13 points 2 days ago You don't have to listen to Fuentes to have these opinions on immigration. permalink parent award report block reply berserkerbarrage 5 points 2 days ago He's a faggot who voted for Kamala Harris? I didn't get that from his comments. permalink parent award report block reply MasterChief08 0 points 2 days ago Fuentes is friends with Destiny and likely gay. There's other right wingers who are ethnic nationalists permalink parent award report block reply YT45 0 points 2 days ago Fuentes is gayer than Bill Mitchell. permalink parent award report block reply\nRakkasan91b 13 points 2 days ago You don't have to listen to Fuentes to have these opinions on immigration. permalink parent award report block reply\nberserkerbarrage 5 points 2 days ago He's a faggot who voted for Kamala Harris? I didn't get that from his comments. permalink parent award report block reply\nMasterChief08 0 points 2 days ago Fuentes is friends with Destiny and likely gay. There's other right wingers who are ethnic nationalists permalink parent award report block reply YT45 0 points 2 days ago Fuentes is gayer than Bill Mitchell. permalink parent award report block reply\nYT45 0 points 2 days ago Fuentes is gayer than Bill Mitchell. permalink parent award report block reply"}