{"id": "8181086", "contents": "1154 Senate Braces for Adam Schiff’s Indictment (pjmedia.com) posted 2 days ago by Trick 96 comments award share report block Senate Braces for Adam Schiff’s Indictment Senate prepares for Adam Schiff's possible indictment over serious mortgage fraud allegations. pjmedia.com\n96 comments Sort by Top Top New Worst Old Save Around the Web Salt Lake City's Hair Growth Method Breaks All Records! HaloGrow BeauHD 76 points 2 days ago They aren't going after him for raping little boys, so I don't see what the big deal is! permalink award report block reply bill_in_texas 37 points 2 days ago I doubt there are any living victims to testify against him.  Didn't Ed Buck finally get put away for killing one of his victims? permalink parent award report block reply HunterBidensPC 17 points 2 days ago Is an Anthony Bourdain dead because of him? permalink parent award report block reply stevethefish76 7 points 2 days ago Yes. At the Standard Hotel. The little black boy never woke up after he was done with him, freaked out, and Bourdaine was witness to the aftermath/cleanup. permalink parent award report block reply Tacitus1963 5 points 2 days ago Then, as the story goes, he made the mistake of bringing it to the West Hollywood police many of whom are probably gay like Schitt or bi and would cover for him. permalink parent award report block reply JohnBarronGalt 4 points 2 days ago At least one permalink parent award report block reply Tacitus1963 3 points 2 days ago That's what I have seen repeatedly online over the years since Bourdain's \"suicide.\" permalink parent award report block reply that_sound 10 points 2 days ago Didn't Ed Buck finally get put away for killing one of his victims? Ed Buck got put away for killing TWO of his victims, but would have gotten away with both had he not nearly killed another. The first murder (that we know about) by meth overdose on July 27, 2017 was covered up as an accidental OD by authorities (thanks Adam Schiff). The family of the African-American victim Gemmel Moore warned Los Angeles County District Attorney Jackie Lacey that any further deaths would be her responsibility. On January 7, 2019, another African-American man, Timothy Michael Dean was found dead similar to how Moore was found (meth overdose). Because this was the second death, you can guess what happened. NOTHING! (thanks Adam Schiff)! Then on September 11, 2019 Buck caused the overdose of another African-American man by meth OD, but this one survived. The families of the deceased and a coalition of civil rights organizations forced the hands of authorities (Buck was seemingly exclusively killing blacks). Buck was arrested 6 days later, and eventually charged with and convicted of causing the deaths of Moore and Dean, and in 2022 sentenced to 30 years. He is 71 years old. permalink parent award report block reply Meatsuit 2 points 1 day ago Thank you for summarizing.   (only thing missing is link) No place like PDW! permalink parent award report block reply UH69MAGA 10 points 2 days ago Sounds like the Hillary Hit List don't it permalink parent award report block reply SedimentTrap 6 points 2 days ago yes. permalink parent award report block reply ProtestantPatriot777 13 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply 2scoops2peachmints 8 points 2 days ago Those in power don’t care about that stuff but start fucking with the banks money and you’ve got serious problems. permalink parent award report block reply throttlejohnson 4 points 2 days ago they are obviously worried about him squeeling like a pig permalink parent award report block reply Chickapede 4 points 2 days ago that's a purty little mouth he got there. permalink parent award report block reply MatterThatMetals 1 points 2 days ago Yet* permalink parent award report block reply Hikedelics 1 points 2 days ago Wouldn’t it be great if they had him, and everyone else, thinking this was all about a little mortgage fraud only to get into the court room and get asked about the Standard Hotel. permalink parent award report block reply load 1 more comments... MythArcana 43 points 2 days ago And which Obama/Biden judge in Virginia will land this case? Place your bets, lads!  💵 permalink award report block reply BigBallsMike 5 points 2 days ago CohenBergSteinWitz permalink parent award report block reply SurveilThis 2 points 2 days ago They are handling the prosecution, defense, judge and jury. permalink parent award report block reply UCantStumpTheTrump -4 points 2 days ago Lmao, can't help yourself from dooming huh? Let's have a federal grand jury indict you with felony crimes and see what kind of tune you'll be singing permalink parent award report block reply KernalMustard 0 points 2 days ago You're fucking blind. Open your eyes i stead of drinking the kool-aid. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago No response to my point, just insults. Retard faggot doomer permalink parent award report block reply fluffykitten 28 points 2 days ago Every serious crime is now being reduced to basically exaggerating on a credit application. Guess that's easier to prove than insurrection. permalink award report block reply midgetpornrocks 32 points 2 days ago Al Capone was indicted for tax evasion. permalink parent award report block reply SedimentTrap 7 points 2 days ago b/c (((they))) didn't like the competition permalink parent award report block reply FatigueIsReal 3 points 2 days ago Organized crime leaders in 1920's Chicago were 31% Italian, 29% Irish, 20% Jewish, and 12% African American. Why can't the Irish, black, or other Italian gangs be the cause? Why are only the jews considered? Sincere question. permalink parent award report block reply PresidentAutopen 4 points 2 days ago Do Italians, Irish or blacks control the US State Department or force us to invade countries? permalink parent award report block reply view 2 more comments... SedimentTrap 1 points 2 days ago it was for the laughs, mostly permalink parent award report block reply view 5 more comments... YT45 1 points 2 days ago Because some people see JOOOOOOZ!!!!!! everywhere. permalink parent award report block reply bill_in_texas 10 points 2 days ago He got a pardon for his insurrection activities. permalink parent award report block reply N0rds 8 points 2 days ago All those autopen pardons are null and void.... permalink parent award report block reply bill_in_texas 4 points 2 days ago The onus is on Trump's administration to prove the autopen pardons aren't valid, and that will have to be proven in courts, most of whom, at least in the D.C. area, are in the tank for leftists. permalink parent award report block reply 2scoops2peachmints 2 points 2 days ago They should be but for some reason Trump and the administration doesn’t want to do hard stuff it seems. permalink parent award report block reply Viewer01 1 points 2 days ago They got Capone on his taxes. permalink parent award report block reply Sea_Still 17 points 2 days ago That fucker should have been arrested years ago permalink award report block reply Mortal_Wombat 4 points 2 days ago Right?! I hope they nail his ass to the wall...but we all know how this is going to go. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago How is this going to go? You think ALL of the Deep State goons that the Trump DOJ is indicting are going to skate? Pretty bold prediction permalink parent award report block reply Mortal_Wombat 1 points 1 day ago I'm not criticizing Trumps efforts dicknose. But the deepstate didn't get deep by letting their ilk get indicted and prosecuted. They have many ways of altering outcomes of cases in their favor. And there isn't anything they wouldn't be willing to do. So sorry not sorry for being slightly pessimistic about a sitting senator getting sent to prison. permalink parent award report block reply Mortal_Wombat 1 points 1 day ago And nice strawman too faggot. Did I say ALL the indictments will skate? I'm speaking solely of a sitting senator. That's a pretty BOLD statement. permalink parent award report block reply MajorClark 14 points 2 days ago What happened at the Standard Hotel.  Schiff called Valerie Jarrett & they spoke for 45 min.  Shortly after a big yellow drum was seen rolling out of pedophile Schiffs room with a lid attached.   What happened to the little black child?   Schiff deserves to hang. permalink award report block reply Chickensaurus 10 points 2 days ago I'm bracing for nothing of any substance to be done. permalink award report block reply booblitchutz 8 points 2 days ago Seriously, he'll just run out the clock on the Trump administration and be free of it. permalink parent award report block reply 46DindoNuffin 8 points 2 days ago \"Blumenthal warned that prosecuting Schiff would \"tear down the rule of law that protects them and all Americans.\"  Do these hypocrites ever get tired of lying?  After they desperately tried to put Trump and hundreds of followers in jail, and the current DOJ is weaponized?  I think that Obama started that train rolling. permalink award report block reply UCantStumpTheTrump 1 points 2 days ago Lol exactly, these people hold our side to standards that they could never live up to. Keep the indictments coming!! permalink parent award report block reply Cuttinmuffins 7 points 2 days ago Mortgage fraud. Wtaf. permalink award report block reply UCantStumpTheTrump 4 points 2 days ago Easy to prove, and provides for severe penalties up to 30 years per count (look at Letitia James' indictment) permalink parent award report block reply Nibba2 3 points 2 days ago Doesn’t sound like she’s getting stuck with anything either. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago What do you mean? She was indicted by a federal grand jury. If that happened to you, would you just shrug it off like no big deal? permalink parent award report block reply Nibba2 1 points 2 days ago Come back and let me know when anything happens. permalink parent award report block reply view 1 more comments... moxieprox 6 points 2 days ago Of all the shit he pulled, it's about mortgage fraud. The same with Leticia James, it's about how she filled out some real estate forms. Why don't they get to the meat, set an example, and charge these bastards with treason? permalink award report block reply Insatiable 6 points 2 days ago I've 'braced' enough, thanks permalink award report block reply Smooth 5 points 2 days ago Wake me when it actually happens permalink award report block reply YodaBannon 4 points 2 days ago lol permalink award report block reply heavyD 4 points 2 days ago Do a midnight raid, pack his ass to gitmo and claim he fled the country. Stretch that neck to match the meme's. permalink award report block reply For_All_Mankind 4 points 2 days ago If they don’t care about Dems threatening to shoot children in the head, why would they care about mortgage fraud? permalink award report block reply GallowsTime 3 points 2 days ago Like Barry, on his hands and knees, waiting for Big Mike. permalink award report block reply Wizard_Glick 3 points 2 days ago It's not illegal when the left does it... permalink award report block reply barwhack 3 points 2 days ago They should try pardoning each other again. Use that autopen; it worked so well last time... permalink award report block reply Bramage 2 points 2 days ago Adamis a complete faggot piece of shit...this the best they got??? permalink award report block reply MusicToMyEars 2 points 2 days ago Nancy Pelosi will be picked as his replacement? Kamala? Newsome wouldn’t name himself, would he? permalink award report block reply LibsRcrazy 2 points 2 days ago Schiff diddles little black boys permalink award report block reply Live_free_or_die_55 2 points 2 days ago Rope for pencil neck!!! permalink award report block reply oyabaskly 2 points 2 days ago \"I'm gonna come\" permalink award report block reply TearsAficionado 2 points 2 days ago Can't wait til Boasberg is selected as presiding judge over Shiff's indictment. It'll be BREAKING and SHOCKING. permalink award report block reply h203h 2 points 2 days ago Arrest that piece of shit pencil needle dick shifty shit schifttt permalink award report block reply Cowboy888 2 points 2 days ago Bubba and his boyz can't wait to get ahold of Schiffty. permalink award report block reply Sunnybats2 1 points 2 days ago How many do this same.SCAM? permalink award report block reply Luckycoz 1 points 2 days ago When you’re guilty of murder but get arrested for public urination. permalink award report block reply Znut55 1 points 2 days ago If they're preparing for it they must feel it's highly likely and they are all but admitting they know he will be found guilty. permalink award report block reply Fuckwit2023 1 points 2 days ago Hang that faggot. permalink award report block reply brutustyberius 1 points 2 days ago Seriously? Who gives a shit but him? permalink award report block reply FamburgerHelper 1 points 2 days ago been bracing for this for years, how much longer must we brace? permalink award report block reply surfdad64 1 points 2 days ago 2 weeks permalink award report block reply trumpdagoat 1 points 2 days ago C’mon! Big money, no Whammies…STOP! Oh, look at that — a chopper ride to GITMO and a free spin. LFG! permalink award report block reply keeman 1 points 2 days ago What is there to prepare for?  He's just one of 100 senators.  Hell, there are probably 20 of them in Israel kissing a rock right now. permalink award report block reply Your-personal-FBI 1 points 2 days ago Watch Newsom appoint himself as the new Senator permalink award report block reply moscowjade 1 points 2 days ago two more weeks! permalink award report block reply OldGloryUnfurled 1 points 2 days ago Im tired of hearing about the build up. Just fuckin do it or dont. permalink award report block reply N7fury 0 points 2 days ago Oh really? I was just told in another thread that there are zero indictments and the Trump admin isn't doing anything. Which is it? permalink award report block reply brutustyberius 1 points 2 days ago There are zero indictments. permalink parent award report block reply N7fury 0 points 2 days ago Oh really? Comey, Bolton, and James are fake indictments is that what youre getting at? permalink parent award report block reply KernalMustard 2 points 2 days ago Jaywalking charges that amount to a slap on the wrist. Go for the jugular. Tear the throat out of the swamp/deep state. Kill the fucking Dragon!!! permalink parent award report block reply new_guy2 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nBeauHD 76 points 2 days ago They aren't going after him for raping little boys, so I don't see what the big deal is! permalink award report block reply bill_in_texas 37 points 2 days ago I doubt there are any living victims to testify against him.  Didn't Ed Buck finally get put away for killing one of his victims? permalink parent award report block reply HunterBidensPC 17 points 2 days ago Is an Anthony Bourdain dead because of him? permalink parent award report block reply stevethefish76 7 points 2 days ago Yes. At the Standard Hotel. The little black boy never woke up after he was done with him, freaked out, and Bourdaine was witness to the aftermath/cleanup. permalink parent award report block reply Tacitus1963 5 points 2 days ago Then, as the story goes, he made the mistake of bringing it to the West Hollywood police many of whom are probably gay like Schitt or bi and would cover for him. permalink parent award report block reply JohnBarronGalt 4 points 2 days ago At least one permalink parent award report block reply Tacitus1963 3 points 2 days ago That's what I have seen repeatedly online over the years since Bourdain's \"suicide.\" permalink parent award report block reply that_sound 10 points 2 days ago Didn't Ed Buck finally get put away for killing one of his victims? Ed Buck got put away for killing TWO of his victims, but would have gotten away with both had he not nearly killed another. The first murder (that we know about) by meth overdose on July 27, 2017 was covered up as an accidental OD by authorities (thanks Adam Schiff). The family of the African-American victim Gemmel Moore warned Los Angeles County District Attorney Jackie Lacey that any further deaths would be her responsibility. On January 7, 2019, another African-American man, Timothy Michael Dean was found dead similar to how Moore was found (meth overdose). Because this was the second death, you can guess what happened. NOTHING! (thanks Adam Schiff)! Then on September 11, 2019 Buck caused the overdose of another African-American man by meth OD, but this one survived. The families of the deceased and a coalition of civil rights organizations forced the hands of authorities (Buck was seemingly exclusively killing blacks). Buck was arrested 6 days later, and eventually charged with and convicted of causing the deaths of Moore and Dean, and in 2022 sentenced to 30 years. He is 71 years old. permalink parent award report block reply Meatsuit 2 points 1 day ago Thank you for summarizing.   (only thing missing is link) No place like PDW! permalink parent award report block reply UH69MAGA 10 points 2 days ago Sounds like the Hillary Hit List don't it permalink parent award report block reply SedimentTrap 6 points 2 days ago yes. permalink parent award report block reply ProtestantPatriot777 13 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply 2scoops2peachmints 8 points 2 days ago Those in power don’t care about that stuff but start fucking with the banks money and you’ve got serious problems. permalink parent award report block reply throttlejohnson 4 points 2 days ago they are obviously worried about him squeeling like a pig permalink parent award report block reply Chickapede 4 points 2 days ago that's a purty little mouth he got there. permalink parent award report block reply MatterThatMetals 1 points 2 days ago Yet* permalink parent award report block reply Hikedelics 1 points 2 days ago Wouldn’t it be great if they had him, and everyone else, thinking this was all about a little mortgage fraud only to get into the court room and get asked about the Standard Hotel. permalink parent award report block reply load 1 more comments...\nbill_in_texas 37 points 2 days ago I doubt there are any living victims to testify against him.  Didn't Ed Buck finally get put away for killing one of his victims? permalink parent award report block reply HunterBidensPC 17 points 2 days ago Is an Anthony Bourdain dead because of him? permalink parent award report block reply stevethefish76 7 points 2 days ago Yes. At the Standard Hotel. The little black boy never woke up after he was done with him, freaked out, and Bourdaine was witness to the aftermath/cleanup. permalink parent award report block reply Tacitus1963 5 points 2 days ago Then, as the story goes, he made the mistake of bringing it to the West Hollywood police many of whom are probably gay like Schitt or bi and would cover for him. permalink parent award report block reply JohnBarronGalt 4 points 2 days ago At least one permalink parent award report block reply Tacitus1963 3 points 2 days ago That's what I have seen repeatedly online over the years since Bourdain's \"suicide.\" permalink parent award report block reply that_sound 10 points 2 days ago Didn't Ed Buck finally get put away for killing one of his victims? Ed Buck got put away for killing TWO of his victims, but would have gotten away with both had he not nearly killed another. The first murder (that we know about) by meth overdose on July 27, 2017 was covered up as an accidental OD by authorities (thanks Adam Schiff). The family of the African-American victim Gemmel Moore warned Los Angeles County District Attorney Jackie Lacey that any further deaths would be her responsibility. On January 7, 2019, another African-American man, Timothy Michael Dean was found dead similar to how Moore was found (meth overdose). Because this was the second death, you can guess what happened. NOTHING! (thanks Adam Schiff)! Then on September 11, 2019 Buck caused the overdose of another African-American man by meth OD, but this one survived. The families of the deceased and a coalition of civil rights organizations forced the hands of authorities (Buck was seemingly exclusively killing blacks). Buck was arrested 6 days later, and eventually charged with and convicted of causing the deaths of Moore and Dean, and in 2022 sentenced to 30 years. He is 71 years old. permalink parent award report block reply Meatsuit 2 points 1 day ago Thank you for summarizing.   (only thing missing is link) No place like PDW! permalink parent award report block reply UH69MAGA 10 points 2 days ago Sounds like the Hillary Hit List don't it permalink parent award report block reply SedimentTrap 6 points 2 days ago yes. permalink parent award report block reply ProtestantPatriot777 13 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nHunterBidensPC 17 points 2 days ago Is an Anthony Bourdain dead because of him? permalink parent award report block reply stevethefish76 7 points 2 days ago Yes. At the Standard Hotel. The little black boy never woke up after he was done with him, freaked out, and Bourdaine was witness to the aftermath/cleanup. permalink parent award report block reply Tacitus1963 5 points 2 days ago Then, as the story goes, he made the mistake of bringing it to the West Hollywood police many of whom are probably gay like Schitt or bi and would cover for him. permalink parent award report block reply JohnBarronGalt 4 points 2 days ago At least one permalink parent award report block reply Tacitus1963 3 points 2 days ago That's what I have seen repeatedly online over the years since Bourdain's \"suicide.\" permalink parent award report block reply\nstevethefish76 7 points 2 days ago Yes. At the Standard Hotel. The little black boy never woke up after he was done with him, freaked out, and Bourdaine was witness to the aftermath/cleanup. permalink parent award report block reply Tacitus1963 5 points 2 days ago Then, as the story goes, he made the mistake of bringing it to the West Hollywood police many of whom are probably gay like Schitt or bi and would cover for him. permalink parent award report block reply\nTacitus1963 5 points 2 days ago Then, as the story goes, he made the mistake of bringing it to the West Hollywood police many of whom are probably gay like Schitt or bi and would cover for him. permalink parent award report block reply\nJohnBarronGalt 4 points 2 days ago At least one permalink parent award report block reply\nTacitus1963 3 points 2 days ago That's what I have seen repeatedly online over the years since Bourdain's \"suicide.\" permalink parent award report block reply\nthat_sound 10 points 2 days ago Didn't Ed Buck finally get put away for killing one of his victims? Ed Buck got put away for killing TWO of his victims, but would have gotten away with both had he not nearly killed another. The first murder (that we know about) by meth overdose on July 27, 2017 was covered up as an accidental OD by authorities (thanks Adam Schiff). The family of the African-American victim Gemmel Moore warned Los Angeles County District Attorney Jackie Lacey that any further deaths would be her responsibility. On January 7, 2019, another African-American man, Timothy Michael Dean was found dead similar to how Moore was found (meth overdose). Because this was the second death, you can guess what happened. NOTHING! (thanks Adam Schiff)! Then on September 11, 2019 Buck caused the overdose of another African-American man by meth OD, but this one survived. The families of the deceased and a coalition of civil rights organizations forced the hands of authorities (Buck was seemingly exclusively killing blacks). Buck was arrested 6 days later, and eventually charged with and convicted of causing the deaths of Moore and Dean, and in 2022 sentenced to 30 years. He is 71 years old. permalink parent award report block reply Meatsuit 2 points 1 day ago Thank you for summarizing.   (only thing missing is link) No place like PDW! permalink parent award report block reply\nMeatsuit 2 points 1 day ago Thank you for summarizing.   (only thing missing is link) No place like PDW! permalink parent award report block reply\nUH69MAGA 10 points 2 days ago Sounds like the Hillary Hit List don't it permalink parent award report block reply\nSedimentTrap 6 points 2 days ago yes. permalink parent award report block reply\nProtestantPatriot777 13 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\n2scoops2peachmints 8 points 2 days ago Those in power don’t care about that stuff but start fucking with the banks money and you’ve got serious problems. permalink parent award report block reply\nthrottlejohnson 4 points 2 days ago they are obviously worried about him squeeling like a pig permalink parent award report block reply Chickapede 4 points 2 days ago that's a purty little mouth he got there. permalink parent award report block reply\nChickapede 4 points 2 days ago that's a purty little mouth he got there. permalink parent award report block reply\nMatterThatMetals 1 points 2 days ago Yet* permalink parent award report block reply\nHikedelics 1 points 2 days ago Wouldn’t it be great if they had him, and everyone else, thinking this was all about a little mortgage fraud only to get into the court room and get asked about the Standard Hotel. permalink parent award report block reply\nMythArcana 43 points 2 days ago And which Obama/Biden judge in Virginia will land this case? Place your bets, lads!  💵 permalink award report block reply BigBallsMike 5 points 2 days ago CohenBergSteinWitz permalink parent award report block reply SurveilThis 2 points 2 days ago They are handling the prosecution, defense, judge and jury. permalink parent award report block reply UCantStumpTheTrump -4 points 2 days ago Lmao, can't help yourself from dooming huh? Let's have a federal grand jury indict you with felony crimes and see what kind of tune you'll be singing permalink parent award report block reply KernalMustard 0 points 2 days ago You're fucking blind. Open your eyes i stead of drinking the kool-aid. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago No response to my point, just insults. Retard faggot doomer permalink parent award report block reply\nBigBallsMike 5 points 2 days ago CohenBergSteinWitz permalink parent award report block reply SurveilThis 2 points 2 days ago They are handling the prosecution, defense, judge and jury. permalink parent award report block reply\nSurveilThis 2 points 2 days ago They are handling the prosecution, defense, judge and jury. permalink parent award report block reply\nUCantStumpTheTrump -4 points 2 days ago Lmao, can't help yourself from dooming huh? Let's have a federal grand jury indict you with felony crimes and see what kind of tune you'll be singing permalink parent award report block reply KernalMustard 0 points 2 days ago You're fucking blind. Open your eyes i stead of drinking the kool-aid. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago No response to my point, just insults. Retard faggot doomer permalink parent award report block reply\nKernalMustard 0 points 2 days ago You're fucking blind. Open your eyes i stead of drinking the kool-aid. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago No response to my point, just insults. Retard faggot doomer permalink parent award report block reply\nUCantStumpTheTrump 1 points 2 days ago No response to my point, just insults. Retard faggot doomer permalink parent award report block reply\nfluffykitten 28 points 2 days ago Every serious crime is now being reduced to basically exaggerating on a credit application. Guess that's easier to prove than insurrection. permalink award report block reply midgetpornrocks 32 points 2 days ago Al Capone was indicted for tax evasion. permalink parent award report block reply SedimentTrap 7 points 2 days ago b/c (((they))) didn't like the competition permalink parent award report block reply FatigueIsReal 3 points 2 days ago Organized crime leaders in 1920's Chicago were 31% Italian, 29% Irish, 20% Jewish, and 12% African American. Why can't the Irish, black, or other Italian gangs be the cause? Why are only the jews considered? Sincere question. permalink parent award report block reply PresidentAutopen 4 points 2 days ago Do Italians, Irish or blacks control the US State Department or force us to invade countries? permalink parent award report block reply view 2 more comments... SedimentTrap 1 points 2 days ago it was for the laughs, mostly permalink parent award report block reply view 5 more comments... YT45 1 points 2 days ago Because some people see JOOOOOOZ!!!!!! everywhere. permalink parent award report block reply bill_in_texas 10 points 2 days ago He got a pardon for his insurrection activities. permalink parent award report block reply N0rds 8 points 2 days ago All those autopen pardons are null and void.... permalink parent award report block reply bill_in_texas 4 points 2 days ago The onus is on Trump's administration to prove the autopen pardons aren't valid, and that will have to be proven in courts, most of whom, at least in the D.C. area, are in the tank for leftists. permalink parent award report block reply 2scoops2peachmints 2 points 2 days ago They should be but for some reason Trump and the administration doesn’t want to do hard stuff it seems. permalink parent award report block reply Viewer01 1 points 2 days ago They got Capone on his taxes. permalink parent award report block reply\nmidgetpornrocks 32 points 2 days ago Al Capone was indicted for tax evasion. permalink parent award report block reply SedimentTrap 7 points 2 days ago b/c (((they))) didn't like the competition permalink parent award report block reply FatigueIsReal 3 points 2 days ago Organized crime leaders in 1920's Chicago were 31% Italian, 29% Irish, 20% Jewish, and 12% African American. Why can't the Irish, black, or other Italian gangs be the cause? Why are only the jews considered? Sincere question. permalink parent award report block reply PresidentAutopen 4 points 2 days ago Do Italians, Irish or blacks control the US State Department or force us to invade countries? permalink parent award report block reply view 2 more comments... SedimentTrap 1 points 2 days ago it was for the laughs, mostly permalink parent award report block reply view 5 more comments... YT45 1 points 2 days ago Because some people see JOOOOOOZ!!!!!! everywhere. permalink parent award report block reply\nSedimentTrap 7 points 2 days ago b/c (((they))) didn't like the competition permalink parent award report block reply FatigueIsReal 3 points 2 days ago Organized crime leaders in 1920's Chicago were 31% Italian, 29% Irish, 20% Jewish, and 12% African American. Why can't the Irish, black, or other Italian gangs be the cause? Why are only the jews considered? Sincere question. permalink parent award report block reply PresidentAutopen 4 points 2 days ago Do Italians, Irish or blacks control the US State Department or force us to invade countries? permalink parent award report block reply view 2 more comments... SedimentTrap 1 points 2 days ago it was for the laughs, mostly permalink parent award report block reply view 5 more comments... YT45 1 points 2 days ago Because some people see JOOOOOOZ!!!!!! everywhere. permalink parent award report block reply\nFatigueIsReal 3 points 2 days ago Organized crime leaders in 1920's Chicago were 31% Italian, 29% Irish, 20% Jewish, and 12% African American. Why can't the Irish, black, or other Italian gangs be the cause? Why are only the jews considered? Sincere question. permalink parent award report block reply PresidentAutopen 4 points 2 days ago Do Italians, Irish or blacks control the US State Department or force us to invade countries? permalink parent award report block reply view 2 more comments... SedimentTrap 1 points 2 days ago it was for the laughs, mostly permalink parent award report block reply view 5 more comments... YT45 1 points 2 days ago Because some people see JOOOOOOZ!!!!!! everywhere. permalink parent award report block reply\nPresidentAutopen 4 points 2 days ago Do Italians, Irish or blacks control the US State Department or force us to invade countries? permalink parent award report block reply view 2 more comments...\nSedimentTrap 1 points 2 days ago it was for the laughs, mostly permalink parent award report block reply view 5 more comments...\nYT45 1 points 2 days ago Because some people see JOOOOOOZ!!!!!! everywhere. permalink parent award report block reply\nbill_in_texas 10 points 2 days ago He got a pardon for his insurrection activities. permalink parent award report block reply N0rds 8 points 2 days ago All those autopen pardons are null and void.... permalink parent award report block reply bill_in_texas 4 points 2 days ago The onus is on Trump's administration to prove the autopen pardons aren't valid, and that will have to be proven in courts, most of whom, at least in the D.C. area, are in the tank for leftists. permalink parent award report block reply 2scoops2peachmints 2 points 2 days ago They should be but for some reason Trump and the administration doesn’t want to do hard stuff it seems. permalink parent award report block reply\nN0rds 8 points 2 days ago All those autopen pardons are null and void.... permalink parent award report block reply bill_in_texas 4 points 2 days ago The onus is on Trump's administration to prove the autopen pardons aren't valid, and that will have to be proven in courts, most of whom, at least in the D.C. area, are in the tank for leftists. permalink parent award report block reply 2scoops2peachmints 2 points 2 days ago They should be but for some reason Trump and the administration doesn’t want to do hard stuff it seems. permalink parent award report block reply\nbill_in_texas 4 points 2 days ago The onus is on Trump's administration to prove the autopen pardons aren't valid, and that will have to be proven in courts, most of whom, at least in the D.C. area, are in the tank for leftists. permalink parent award report block reply\n2scoops2peachmints 2 points 2 days ago They should be but for some reason Trump and the administration doesn’t want to do hard stuff it seems. permalink parent award report block reply\nViewer01 1 points 2 days ago They got Capone on his taxes. permalink parent award report block reply\nSea_Still 17 points 2 days ago That fucker should have been arrested years ago permalink award report block reply Mortal_Wombat 4 points 2 days ago Right?! I hope they nail his ass to the wall...but we all know how this is going to go. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago How is this going to go? You think ALL of the Deep State goons that the Trump DOJ is indicting are going to skate? Pretty bold prediction permalink parent award report block reply Mortal_Wombat 1 points 1 day ago I'm not criticizing Trumps efforts dicknose. But the deepstate didn't get deep by letting their ilk get indicted and prosecuted. They have many ways of altering outcomes of cases in their favor. And there isn't anything they wouldn't be willing to do. So sorry not sorry for being slightly pessimistic about a sitting senator getting sent to prison. permalink parent award report block reply Mortal_Wombat 1 points 1 day ago And nice strawman too faggot. Did I say ALL the indictments will skate? I'm speaking solely of a sitting senator. That's a pretty BOLD statement. permalink parent award report block reply\nMortal_Wombat 4 points 2 days ago Right?! I hope they nail his ass to the wall...but we all know how this is going to go. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago How is this going to go? You think ALL of the Deep State goons that the Trump DOJ is indicting are going to skate? Pretty bold prediction permalink parent award report block reply Mortal_Wombat 1 points 1 day ago I'm not criticizing Trumps efforts dicknose. But the deepstate didn't get deep by letting their ilk get indicted and prosecuted. They have many ways of altering outcomes of cases in their favor. And there isn't anything they wouldn't be willing to do. So sorry not sorry for being slightly pessimistic about a sitting senator getting sent to prison. permalink parent award report block reply Mortal_Wombat 1 points 1 day ago And nice strawman too faggot. Did I say ALL the indictments will skate? I'm speaking solely of a sitting senator. That's a pretty BOLD statement. permalink parent award report block reply\nUCantStumpTheTrump 1 points 2 days ago How is this going to go? You think ALL of the Deep State goons that the Trump DOJ is indicting are going to skate? Pretty bold prediction permalink parent award report block reply Mortal_Wombat 1 points 1 day ago I'm not criticizing Trumps efforts dicknose. But the deepstate didn't get deep by letting their ilk get indicted and prosecuted. They have many ways of altering outcomes of cases in their favor. And there isn't anything they wouldn't be willing to do. So sorry not sorry for being slightly pessimistic about a sitting senator getting sent to prison. permalink parent award report block reply Mortal_Wombat 1 points 1 day ago And nice strawman too faggot. Did I say ALL the indictments will skate? I'm speaking solely of a sitting senator. That's a pretty BOLD statement. permalink parent award report block reply\nMortal_Wombat 1 points 1 day ago I'm not criticizing Trumps efforts dicknose. But the deepstate didn't get deep by letting their ilk get indicted and prosecuted. They have many ways of altering outcomes of cases in their favor. And there isn't anything they wouldn't be willing to do. So sorry not sorry for being slightly pessimistic about a sitting senator getting sent to prison. permalink parent award report block reply\nMortal_Wombat 1 points 1 day ago And nice strawman too faggot. Did I say ALL the indictments will skate? I'm speaking solely of a sitting senator. That's a pretty BOLD statement. permalink parent award report block reply\nMajorClark 14 points 2 days ago What happened at the Standard Hotel.  Schiff called Valerie Jarrett & they spoke for 45 min.  Shortly after a big yellow drum was seen rolling out of pedophile Schiffs room with a lid attached.   What happened to the little black child?   Schiff deserves to hang. permalink award report block reply\nChickensaurus 10 points 2 days ago I'm bracing for nothing of any substance to be done. permalink award report block reply booblitchutz 8 points 2 days ago Seriously, he'll just run out the clock on the Trump administration and be free of it. permalink parent award report block reply\nbooblitchutz 8 points 2 days ago Seriously, he'll just run out the clock on the Trump administration and be free of it. permalink parent award report block reply\n46DindoNuffin 8 points 2 days ago \"Blumenthal warned that prosecuting Schiff would \"tear down the rule of law that protects them and all Americans.\"  Do these hypocrites ever get tired of lying?  After they desperately tried to put Trump and hundreds of followers in jail, and the current DOJ is weaponized?  I think that Obama started that train rolling. permalink award report block reply UCantStumpTheTrump 1 points 2 days ago Lol exactly, these people hold our side to standards that they could never live up to. Keep the indictments coming!! permalink parent award report block reply\nUCantStumpTheTrump 1 points 2 days ago Lol exactly, these people hold our side to standards that they could never live up to. Keep the indictments coming!! permalink parent award report block reply\nCuttinmuffins 7 points 2 days ago Mortgage fraud. Wtaf. permalink award report block reply UCantStumpTheTrump 4 points 2 days ago Easy to prove, and provides for severe penalties up to 30 years per count (look at Letitia James' indictment) permalink parent award report block reply Nibba2 3 points 2 days ago Doesn’t sound like she’s getting stuck with anything either. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago What do you mean? She was indicted by a federal grand jury. If that happened to you, would you just shrug it off like no big deal? permalink parent award report block reply Nibba2 1 points 2 days ago Come back and let me know when anything happens. permalink parent award report block reply view 1 more comments...\nUCantStumpTheTrump 4 points 2 days ago Easy to prove, and provides for severe penalties up to 30 years per count (look at Letitia James' indictment) permalink parent award report block reply Nibba2 3 points 2 days ago Doesn’t sound like she’s getting stuck with anything either. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago What do you mean? She was indicted by a federal grand jury. If that happened to you, would you just shrug it off like no big deal? permalink parent award report block reply Nibba2 1 points 2 days ago Come back and let me know when anything happens. permalink parent award report block reply view 1 more comments...\nNibba2 3 points 2 days ago Doesn’t sound like she’s getting stuck with anything either. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago What do you mean? She was indicted by a federal grand jury. If that happened to you, would you just shrug it off like no big deal? permalink parent award report block reply Nibba2 1 points 2 days ago Come back and let me know when anything happens. permalink parent award report block reply view 1 more comments...\nUCantStumpTheTrump 1 points 2 days ago What do you mean? She was indicted by a federal grand jury. If that happened to you, would you just shrug it off like no big deal? permalink parent award report block reply Nibba2 1 points 2 days ago Come back and let me know when anything happens. permalink parent award report block reply view 1 more comments...\nNibba2 1 points 2 days ago Come back and let me know when anything happens. permalink parent award report block reply view 1 more comments...\nmoxieprox 6 points 2 days ago Of all the shit he pulled, it's about mortgage fraud. The same with Leticia James, it's about how she filled out some real estate forms. Why don't they get to the meat, set an example, and charge these bastards with treason? permalink award report block reply\nInsatiable 6 points 2 days ago I've 'braced' enough, thanks permalink award report block reply\nSmooth 5 points 2 days ago Wake me when it actually happens permalink award report block reply\nYodaBannon 4 points 2 days ago lol permalink award report block reply\nheavyD 4 points 2 days ago Do a midnight raid, pack his ass to gitmo and claim he fled the country. Stretch that neck to match the meme's. permalink award report block reply\nFor_All_Mankind 4 points 2 days ago If they don’t care about Dems threatening to shoot children in the head, why would they care about mortgage fraud? permalink award report block reply\nGallowsTime 3 points 2 days ago Like Barry, on his hands and knees, waiting for Big Mike. permalink award report block reply\nWizard_Glick 3 points 2 days ago It's not illegal when the left does it... permalink award report block reply\nbarwhack 3 points 2 days ago They should try pardoning each other again. Use that autopen; it worked so well last time... permalink award report block reply\nBramage 2 points 2 days ago Adamis a complete faggot piece of shit...this the best they got??? permalink award report block reply\nMusicToMyEars 2 points 2 days ago Nancy Pelosi will be picked as his replacement? Kamala? Newsome wouldn’t name himself, would he? permalink award report block reply\nLibsRcrazy 2 points 2 days ago Schiff diddles little black boys permalink award report block reply\nLive_free_or_die_55 2 points 2 days ago Rope for pencil neck!!! permalink award report block reply\noyabaskly 2 points 2 days ago \"I'm gonna come\" permalink award report block reply\nTearsAficionado 2 points 2 days ago Can't wait til Boasberg is selected as presiding judge over Shiff's indictment. It'll be BREAKING and SHOCKING. permalink award report block reply\nh203h 2 points 2 days ago Arrest that piece of shit pencil needle dick shifty shit schifttt permalink award report block reply\nCowboy888 2 points 2 days ago Bubba and his boyz can't wait to get ahold of Schiffty. permalink award report block reply\nSunnybats2 1 points 2 days ago How many do this same.SCAM? permalink award report block reply\nLuckycoz 1 points 2 days ago When you’re guilty of murder but get arrested for public urination. permalink award report block reply\nZnut55 1 points 2 days ago If they're preparing for it they must feel it's highly likely and they are all but admitting they know he will be found guilty. permalink award report block reply\nFuckwit2023 1 points 2 days ago Hang that faggot. permalink award report block reply\nbrutustyberius 1 points 2 days ago Seriously? Who gives a shit but him? permalink award report block reply\nFamburgerHelper 1 points 2 days ago been bracing for this for years, how much longer must we brace? permalink award report block reply\nsurfdad64 1 points 2 days ago 2 weeks permalink award report block reply\ntrumpdagoat 1 points 2 days ago C’mon! Big money, no Whammies…STOP! Oh, look at that — a chopper ride to GITMO and a free spin. LFG! permalink award report block reply\nkeeman 1 points 2 days ago What is there to prepare for?  He's just one of 100 senators.  Hell, there are probably 20 of them in Israel kissing a rock right now. permalink award report block reply\nYour-personal-FBI 1 points 2 days ago Watch Newsom appoint himself as the new Senator permalink award report block reply\nmoscowjade 1 points 2 days ago two more weeks! permalink award report block reply\nOldGloryUnfurled 1 points 2 days ago Im tired of hearing about the build up. Just fuckin do it or dont. permalink award report block reply\nN7fury 0 points 2 days ago Oh really? I was just told in another thread that there are zero indictments and the Trump admin isn't doing anything. Which is it? permalink award report block reply brutustyberius 1 points 2 days ago There are zero indictments. permalink parent award report block reply N7fury 0 points 2 days ago Oh really? Comey, Bolton, and James are fake indictments is that what youre getting at? permalink parent award report block reply KernalMustard 2 points 2 days ago Jaywalking charges that amount to a slap on the wrist. Go for the jugular. Tear the throat out of the swamp/deep state. Kill the fucking Dragon!!! permalink parent award report block reply\nbrutustyberius 1 points 2 days ago There are zero indictments. permalink parent award report block reply N7fury 0 points 2 days ago Oh really? Comey, Bolton, and James are fake indictments is that what youre getting at? permalink parent award report block reply KernalMustard 2 points 2 days ago Jaywalking charges that amount to a slap on the wrist. Go for the jugular. Tear the throat out of the swamp/deep state. Kill the fucking Dragon!!! permalink parent award report block reply\nN7fury 0 points 2 days ago Oh really? Comey, Bolton, and James are fake indictments is that what youre getting at? permalink parent award report block reply KernalMustard 2 points 2 days ago Jaywalking charges that amount to a slap on the wrist. Go for the jugular. Tear the throat out of the swamp/deep state. Kill the fucking Dragon!!! permalink parent award report block reply\nKernalMustard 2 points 2 days ago Jaywalking charges that amount to a slap on the wrist. Go for the jugular. Tear the throat out of the swamp/deep state. Kill the fucking Dragon!!! permalink parent award report block reply\nnew_guy2 1 points 2 days ago Comment removed by community moderators. permalink award report block reply"}