{"id": "8181220", "contents": "1344 American Doctor of 40 years explains how Barack Obama allowed insurance companies to steal unlimited amounts of money from taxpayers with the Affordable Care Act posted 2 days ago by Capoditutticapi1 76 comments award share report block Wall Street Apes @WallStreetApes • 2d American Doctor of 40 years explains how Barack Obama allowed insurance companies to steal unlimited amounts of money from taxpayers with the Affordable Care Act “Where do our health insurance costs go up every year? — The reason is, it was designed that way. There's something\n76 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style MathletesFoot 66 points 2 days ago It's a shame the Republicans didn't do anything useful to fight or fix the underlying problem. permalink award report block reply Decepticons-superior 38 points 2 days ago That’s how I became redpilled. I saw the Republicans make all of these promises to fix it when they were in power, but they didn’t even try. I had given up before Trump rode down the escalator in 2015. permalink parent award report block reply SHILL_DETECTOR 15 points 2 days ago they dont even see the bigger picture that our country and people are becoming bankrupt permalink parent award report block reply Transparency 20 points 2 days ago They don't care. permalink parent award report block reply Pederella 15 points 2 days ago It's the plan. Collapse the system in order to replace the system. Cloward-Piven Plan permalink parent award report block reply view 1 more comments... Returningtogod 8 points 2 days ago This 👆 permalink parent award report block reply DeportThemAllForever 3 points 2 days ago They see, they don’t care. permalink parent award report block reply UCantStumpTheTrump 11 points 2 days ago Then when Trump got all the votes ready for repealing ACA, John McStain fucking nuked it. Fuck that faggot traitor, hope he's enjoying Hell permalink parent award report block reply L-Train 5 points 2 days ago Yes, some of us know exactly what you're implying about Lindsey Grahams middle east war crime partner. permalink parent award report block reply Bullet3250 3 points 1 day ago This is what happened....  ONE SENATOR DERAILED OBAMACARE REPEAL. permalink parent award report block reply hansgruber7 21 points 2 days ago Blame McCain. permalink parent award report block reply Mikespenis123 7 points 2 days ago Blame Arizona. permalink parent award report block reply L-Train 2 points 2 days ago 🎵 Blame it on the rain- Millie Vanillie permalink parent award report block reply ZacPetkanas 5 points 2 days ago While true, we’re still waiting to hear any alternatives from the RNC permalink parent award report block reply hansgruber7 7 points 2 days ago You don't need an alternative to a house fire to just put it out.  McCain refused to do that. permalink parent award report block reply ZacPetkanas 4 points 2 days ago Maybe so, but we’ve been promised an alternative plan for years permalink parent award report block reply view 2 more comments... airborne3502 15 points 2 days ago Can't help but think of John McCain's emphatic thumbs down on the \"skinny repeal.\" permalink parent award report block reply IsrorOrca 8 points 2 days ago Because they are getting paid too... Its largely a uniparty. permalink parent award report block reply Smurfection 5 points 2 days ago We tried.  Chief Justice Roberts screwed up the SCOTUS case ruling and then John McCain voted thumbs down out of spite in the bill to repeal it. permalink parent award report block reply load 4 more comments... Decepticons-superior 39 points 2 days ago Same thing with federally backed student loans. Since the government guarantees those loans, colleges can charge whatever they want and fund their little leftist indoctrination camps. permalink award report block reply thelastlast 9 points 2 days ago yuuuuup. permalink parent award report block reply GA_Logic 3 points 2 days ago Yup which is why a cap is a good starting point, but more needs to be done. permalink parent award report block reply ADAM_SCHITT 7 points 2 days ago The government needs to get out of it altogether. Fewer people will go to college but lots of people go that don't need to anyway right now. permalink parent award report block reply tholinz 3 points 2 days ago The cap needs to be super low for federal loans. Like $50k IF THAT. Get the cost of college down so kids can do things like work their way through school again. permalink parent award report block reply zooty 2 points 2 days ago Definitely a business opportunity there. The biggest issue is the accreditation system. Need to work out getting around or supplanting that. permalink parent award report block reply LurkNoMore 1 points 2 days ago I’m doing a masters in Malaysia right now. 2 yrs, 6k total. GI bill housing allowance is 2100/month, and the tuition is covered. permalink parent award report block reply MedicallyReddit 26 points 2 days ago The amount of damage Obanana and his legion of demons caused our country is sickening permalink award report block reply current_horror 22 points 2 days ago They did it on purpose to destroy the system and replace it with communism. And I don’t even blame them because they are communists . The real problem is the traitors who sold us all out to the communists for money. permalink parent award report block reply deleted 6 points 2 days ago UCantStumpTheTrump 3 points 2 days ago They are just meat puppets meant to absorb our votes and then not deliver on anything we want permalink parent award report block reply Bubbahax 4 points 2 days ago The absolute fucktards in this country (of which there are legions) thought that electing the Kenyan fraud would end racial tensions in America.  Of course, McCain didnt give us much of an alternative to vote for. permalink parent award report block reply starjello 21 points 2 days ago Of course. The insurance companies wrote the bill. permalink award report block reply Aquamine-Amarine 20 points 2 days ago And the politicians didn't even read it... gotta pass it in order to know what's in it! permalink parent award report block reply GA_Logic 5 points 2 days ago Most politicians have an understanding in the field of law and they knew what they were doing.  Pure evil. permalink parent award report block reply DeportThemAllForever 3 points 2 days ago They bought health insurance stocks, then passed it. permalink parent award report block reply Trumpchoochoo 12 points 2 days ago Abolish fucking insurance.  The biggest pyramid scheme in history. permalink award report block reply thelastlast 13 points 2 days ago mandatory insurance is illegal.  so is income and property tax.  so is 'telling' us what we can eat and drink.  so is telling us how 'safe' to keep ourselves or else. we've been putting it up our whole lives.  time to start taking it back.  this country deserves better. permalink parent award report block reply IncredibleMrE1 12 points 2 days ago UHC is a perfect example. permalink award report block reply ApprenticeParty 6 points 2 days ago Lots of smaller companies literally praying on poor retards too. permalink parent award report block reply UnstableGoat 12 points 2 days ago Not only that, ACA changed the definition of Medical Loss Ratio from “claims / premiums” to (claims + Quality improvement expenses) / (premiums - taxes, legal, regulatory expenses) So now there’s all these bullshit job programs focused on “quality initiatives” that never actually improve quality and a bunch of paper-pushing functions in legal and compliance because shrug why not, they get counted in the ratio. permalink award report block reply Im_RickSteves_bitch 12 points 2 days ago Some of these people need to be in jail. permalink award report block reply Eatinglue 12 points 2 days ago It was designed to blow up our current system as an excuse to go to single payer, and all the evil and death that comes with it, probably to reduce the population to fight “climate change”. permalink award report block reply pingpongdingdong 8 points 2 days ago so you’re telling me government intervention broke a private enterprise system? who could have ever predicted… permalink award report block reply DeportThemAllForever 2 points 2 days ago It didn’t break it, it rewarded it.  Funded by healthcare industry and they got paid big time. If we repeal it, prices have to go down.  Right now that’s unheard of, prices are up 20% YoY. permalink parent award report block reply America_No_1 7 points 2 days ago The health care plan giants lobbied for this.  What better way to give them more money than to mandate more people needed to be on their plans?  And now they had full control of costs as well.  They are all in bed together with their companies and congress and our socialist commie ex-admins. permalink award report block reply ConsrvspkgNJ 6 points 2 days ago From a 30 year insurance professional specializing in Medicare and Retiree benefits....he is spot on correct. The only problem is, every solution we come up with cuts out the politicians and their grift and there is no way they will ever go with it not to mention one side of Congress is trying to pull us into Single Payor so neither side wants our private sector based solutions. permalink award report block reply cyberwar 5 points 2 days ago curse you McCain permalink award report block reply CovfefeVideo 5 points 2 days ago No one ever goes to jail.  Weird. permalink award report block reply Urinetensions 5 points 2 days ago Ohh! Now the royalty kickbacks to BHO make sense permalink award report block reply Lib_Women_Have_HSV 4 points 2 days ago Everyone pointed this out before it passed permalink award report block reply DITTOPatriot 4 points 2 days ago The legislators and the administration know all of this, including the fact that Pharmacy Benefit Managers (PBMs) are a significant scam. It’s simply that they aren’t interested in doing their jobs because all of these benefits favor Wall Street and their donors. When the administration surrounds itself with Wall Street players, nothing will be done to help Main Street or the working man. Sure, they will feed you a constant diet of red meat and tweets that rotate daily. Enjoy it while they drain the nut sacks of the influential. permalink award report block reply IWI9000 4 points 2 days ago Until they ban vertical integrations across insurer, PBM, pharmacy, provider, GPO, distributor within healthcare and remove the antikick exemptions, it will never get better. permalink award report block reply SpeekFreely 4 points 2 days ago Sounds like a program by the insurance companies themselves./s permalink award report block reply Nibba2 4 points 2 days ago Just like military budget. Use it or lose it. So they blow it on everything at the end of the year. permalink award report block reply Naboth 2 points 2 days ago One of the reasons FSAs should be illegal, or at least have no benefit under the tax code. HSAs, on the other hand, could solve most of the health care problems in the US if they were simplified and the HDHP requirement was removed so that everyone could use them.  Properly structured, you could even use them as an alternative to medicare and medicaid, and eliminate most of the federal deficit as a side effect. Real solutions to the problem exist, but Congress will never let such solutions be implemented.  Because the insurance companies literally own them. permalink parent award report block reply h203h 3 points 2 days ago When is filthy Obama going to hang high and be executed for treason? Enough is enough with these goons getting away while the USA suffered because of these actions. TREASON=DEATH! permalink award report block reply SavingPrivateGrace 3 points 2 days ago When it becomes excessive and unfair it's called Greed.  The medical profession too, not just the health insurance, especially during Covid + vax. permalink award report block reply Tacitus1963 3 points 2 days ago And you can bet your last $, that there are layers of grifting involved so that BHO et al laundered our tax dollars to their private accounts. permalink award report block reply MyNameIsTaxpayer 3 points 2 days ago Thank you for not wearing a stethoscope. permalink award report block reply L-Train 2 points 2 days ago This was the most articulated and honest explanation that we should be teaching in schools. permalink award report block reply AgnesDomini 2 points 2 days ago Absolutely by design, so that government could force people into government-run Healthcare to control us from cradle to grave. permalink award report block reply Giant_Schwartz 2 points 2 days ago If you needed someone to explain this you are a common dolt.  Not pointing my finger at op.  Just a general statement. War in Afghanistan was for pharma access to opioids. ACA was payment to insurance for letting poors have free drugs Poors sell their free drugs on the street or to dealers for way under pharmacy prices. America racked up in an opioid epidemic. Pharma and insurance make record profits It was all planned. They created two more entities to control Americans through. Big oil, big war, big pharma and big insurance. permalink award report block reply Capoditutticapi1 OP 1 points 2 days ago Thanks for furthering the explanation to the common/uncommon dolts with bullet points... Needs to be said and shared often to sink in for many... permalink parent award report block reply Giant_Schwartz 2 points 2 days ago I've been saying on here for years.  Nobody pays attention until someone on TV or the mainstream media agree permalink parent award report block reply utfanx2 2 points 2 days ago Or until you make your own insurance company with beer and hookers. permalink award report block reply Chuj 1 points 2 days ago I remember when the thought was, that Obamacare would be so much cheaper than conventional insurance products, that it would drive them into bankruptcy. What a crock that turned out to be. Big insurance profitted hugely permalink award report block reply Naboth 1 points 2 days ago Nobody who knew basic math ever thought that.  Everyone but the retards knew it was a scam from the beginning. permalink parent award report block reply Chuj 1 points 1 day ago It was seen as a bridge to universal healthcare. A way to force insurance companies out of business. That was the public front. Clearly much went on behind the scenes that the public was not aware of. permalink parent award report block reply thelastlast 1 points 2 days ago it's a little silly that people are anti-Luigi on this site. 'oh they're just fucking an entire nation of people over, causing massive loss, death and misery, a retaliation is way out of proportion.' why?  you need them to try to kill you directly?  when does self-defense kick in?  we all better start thinking about it, the bad guys have learned that parasites dont get punished but predators do, so all the predators are disguising themselves and EATING US ALIVE. permalink award report block reply anotherrandomname 1 points 2 days ago Yep obongocare was always just a massive handout to big insurance, and not even subtle about it either. permalink award report block reply\nMathletesFoot 66 points 2 days ago It's a shame the Republicans didn't do anything useful to fight or fix the underlying problem. permalink award report block reply Decepticons-superior 38 points 2 days ago That’s how I became redpilled. I saw the Republicans make all of these promises to fix it when they were in power, but they didn’t even try. I had given up before Trump rode down the escalator in 2015. permalink parent award report block reply SHILL_DETECTOR 15 points 2 days ago they dont even see the bigger picture that our country and people are becoming bankrupt permalink parent award report block reply Transparency 20 points 2 days ago They don't care. permalink parent award report block reply Pederella 15 points 2 days ago It's the plan. Collapse the system in order to replace the system. Cloward-Piven Plan permalink parent award report block reply view 1 more comments... Returningtogod 8 points 2 days ago This 👆 permalink parent award report block reply DeportThemAllForever 3 points 2 days ago They see, they don’t care. permalink parent award report block reply UCantStumpTheTrump 11 points 2 days ago Then when Trump got all the votes ready for repealing ACA, John McStain fucking nuked it. Fuck that faggot traitor, hope he's enjoying Hell permalink parent award report block reply L-Train 5 points 2 days ago Yes, some of us know exactly what you're implying about Lindsey Grahams middle east war crime partner. permalink parent award report block reply Bullet3250 3 points 1 day ago This is what happened....  ONE SENATOR DERAILED OBAMACARE REPEAL. permalink parent award report block reply hansgruber7 21 points 2 days ago Blame McCain. permalink parent award report block reply Mikespenis123 7 points 2 days ago Blame Arizona. permalink parent award report block reply L-Train 2 points 2 days ago 🎵 Blame it on the rain- Millie Vanillie permalink parent award report block reply ZacPetkanas 5 points 2 days ago While true, we’re still waiting to hear any alternatives from the RNC permalink parent award report block reply hansgruber7 7 points 2 days ago You don't need an alternative to a house fire to just put it out.  McCain refused to do that. permalink parent award report block reply ZacPetkanas 4 points 2 days ago Maybe so, but we’ve been promised an alternative plan for years permalink parent award report block reply view 2 more comments... airborne3502 15 points 2 days ago Can't help but think of John McCain's emphatic thumbs down on the \"skinny repeal.\" permalink parent award report block reply IsrorOrca 8 points 2 days ago Because they are getting paid too... Its largely a uniparty. permalink parent award report block reply Smurfection 5 points 2 days ago We tried.  Chief Justice Roberts screwed up the SCOTUS case ruling and then John McCain voted thumbs down out of spite in the bill to repeal it. permalink parent award report block reply load 4 more comments...\nDecepticons-superior 38 points 2 days ago That’s how I became redpilled. I saw the Republicans make all of these promises to fix it when they were in power, but they didn’t even try. I had given up before Trump rode down the escalator in 2015. permalink parent award report block reply SHILL_DETECTOR 15 points 2 days ago they dont even see the bigger picture that our country and people are becoming bankrupt permalink parent award report block reply Transparency 20 points 2 days ago They don't care. permalink parent award report block reply Pederella 15 points 2 days ago It's the plan. Collapse the system in order to replace the system. Cloward-Piven Plan permalink parent award report block reply view 1 more comments... Returningtogod 8 points 2 days ago This 👆 permalink parent award report block reply DeportThemAllForever 3 points 2 days ago They see, they don’t care. permalink parent award report block reply UCantStumpTheTrump 11 points 2 days ago Then when Trump got all the votes ready for repealing ACA, John McStain fucking nuked it. Fuck that faggot traitor, hope he's enjoying Hell permalink parent award report block reply L-Train 5 points 2 days ago Yes, some of us know exactly what you're implying about Lindsey Grahams middle east war crime partner. permalink parent award report block reply Bullet3250 3 points 1 day ago This is what happened....  ONE SENATOR DERAILED OBAMACARE REPEAL. permalink parent award report block reply\nSHILL_DETECTOR 15 points 2 days ago they dont even see the bigger picture that our country and people are becoming bankrupt permalink parent award report block reply Transparency 20 points 2 days ago They don't care. permalink parent award report block reply Pederella 15 points 2 days ago It's the plan. Collapse the system in order to replace the system. Cloward-Piven Plan permalink parent award report block reply view 1 more comments... Returningtogod 8 points 2 days ago This 👆 permalink parent award report block reply DeportThemAllForever 3 points 2 days ago They see, they don’t care. permalink parent award report block reply\nTransparency 20 points 2 days ago They don't care. permalink parent award report block reply Pederella 15 points 2 days ago It's the plan. Collapse the system in order to replace the system. Cloward-Piven Plan permalink parent award report block reply view 1 more comments... Returningtogod 8 points 2 days ago This 👆 permalink parent award report block reply\nPederella 15 points 2 days ago It's the plan. Collapse the system in order to replace the system. Cloward-Piven Plan permalink parent award report block reply view 1 more comments...\nReturningtogod 8 points 2 days ago This 👆 permalink parent award report block reply\nDeportThemAllForever 3 points 2 days ago They see, they don’t care. permalink parent award report block reply\nUCantStumpTheTrump 11 points 2 days ago Then when Trump got all the votes ready for repealing ACA, John McStain fucking nuked it. Fuck that faggot traitor, hope he's enjoying Hell permalink parent award report block reply L-Train 5 points 2 days ago Yes, some of us know exactly what you're implying about Lindsey Grahams middle east war crime partner. permalink parent award report block reply Bullet3250 3 points 1 day ago This is what happened....  ONE SENATOR DERAILED OBAMACARE REPEAL. permalink parent award report block reply\nL-Train 5 points 2 days ago Yes, some of us know exactly what you're implying about Lindsey Grahams middle east war crime partner. permalink parent award report block reply\nBullet3250 3 points 1 day ago This is what happened....  ONE SENATOR DERAILED OBAMACARE REPEAL. permalink parent award report block reply\nhansgruber7 21 points 2 days ago Blame McCain. permalink parent award report block reply Mikespenis123 7 points 2 days ago Blame Arizona. permalink parent award report block reply L-Train 2 points 2 days ago 🎵 Blame it on the rain- Millie Vanillie permalink parent award report block reply ZacPetkanas 5 points 2 days ago While true, we’re still waiting to hear any alternatives from the RNC permalink parent award report block reply hansgruber7 7 points 2 days ago You don't need an alternative to a house fire to just put it out.  McCain refused to do that. permalink parent award report block reply ZacPetkanas 4 points 2 days ago Maybe so, but we’ve been promised an alternative plan for years permalink parent award report block reply view 2 more comments...\nMikespenis123 7 points 2 days ago Blame Arizona. permalink parent award report block reply L-Train 2 points 2 days ago 🎵 Blame it on the rain- Millie Vanillie permalink parent award report block reply\nL-Train 2 points 2 days ago 🎵 Blame it on the rain- Millie Vanillie permalink parent award report block reply\nZacPetkanas 5 points 2 days ago While true, we’re still waiting to hear any alternatives from the RNC permalink parent award report block reply hansgruber7 7 points 2 days ago You don't need an alternative to a house fire to just put it out.  McCain refused to do that. permalink parent award report block reply ZacPetkanas 4 points 2 days ago Maybe so, but we’ve been promised an alternative plan for years permalink parent award report block reply view 2 more comments...\nhansgruber7 7 points 2 days ago You don't need an alternative to a house fire to just put it out.  McCain refused to do that. permalink parent award report block reply ZacPetkanas 4 points 2 days ago Maybe so, but we’ve been promised an alternative plan for years permalink parent award report block reply view 2 more comments...\nZacPetkanas 4 points 2 days ago Maybe so, but we’ve been promised an alternative plan for years permalink parent award report block reply view 2 more comments...\nairborne3502 15 points 2 days ago Can't help but think of John McCain's emphatic thumbs down on the \"skinny repeal.\" permalink parent award report block reply\nIsrorOrca 8 points 2 days ago Because they are getting paid too... Its largely a uniparty. permalink parent award report block reply\nSmurfection 5 points 2 days ago We tried.  Chief Justice Roberts screwed up the SCOTUS case ruling and then John McCain voted thumbs down out of spite in the bill to repeal it. permalink parent award report block reply\nDecepticons-superior 39 points 2 days ago Same thing with federally backed student loans. Since the government guarantees those loans, colleges can charge whatever they want and fund their little leftist indoctrination camps. permalink award report block reply thelastlast 9 points 2 days ago yuuuuup. permalink parent award report block reply GA_Logic 3 points 2 days ago Yup which is why a cap is a good starting point, but more needs to be done. permalink parent award report block reply ADAM_SCHITT 7 points 2 days ago The government needs to get out of it altogether. Fewer people will go to college but lots of people go that don't need to anyway right now. permalink parent award report block reply tholinz 3 points 2 days ago The cap needs to be super low for federal loans. Like $50k IF THAT. Get the cost of college down so kids can do things like work their way through school again. permalink parent award report block reply zooty 2 points 2 days ago Definitely a business opportunity there. The biggest issue is the accreditation system. Need to work out getting around or supplanting that. permalink parent award report block reply LurkNoMore 1 points 2 days ago I’m doing a masters in Malaysia right now. 2 yrs, 6k total. GI bill housing allowance is 2100/month, and the tuition is covered. permalink parent award report block reply\nthelastlast 9 points 2 days ago yuuuuup. permalink parent award report block reply\nGA_Logic 3 points 2 days ago Yup which is why a cap is a good starting point, but more needs to be done. permalink parent award report block reply ADAM_SCHITT 7 points 2 days ago The government needs to get out of it altogether. Fewer people will go to college but lots of people go that don't need to anyway right now. permalink parent award report block reply tholinz 3 points 2 days ago The cap needs to be super low for federal loans. Like $50k IF THAT. Get the cost of college down so kids can do things like work their way through school again. permalink parent award report block reply zooty 2 points 2 days ago Definitely a business opportunity there. The biggest issue is the accreditation system. Need to work out getting around or supplanting that. permalink parent award report block reply LurkNoMore 1 points 2 days ago I’m doing a masters in Malaysia right now. 2 yrs, 6k total. GI bill housing allowance is 2100/month, and the tuition is covered. permalink parent award report block reply\nADAM_SCHITT 7 points 2 days ago The government needs to get out of it altogether. Fewer people will go to college but lots of people go that don't need to anyway right now. permalink parent award report block reply\ntholinz 3 points 2 days ago The cap needs to be super low for federal loans. Like $50k IF THAT. Get the cost of college down so kids can do things like work their way through school again. permalink parent award report block reply zooty 2 points 2 days ago Definitely a business opportunity there. The biggest issue is the accreditation system. Need to work out getting around or supplanting that. permalink parent award report block reply LurkNoMore 1 points 2 days ago I’m doing a masters in Malaysia right now. 2 yrs, 6k total. GI bill housing allowance is 2100/month, and the tuition is covered. permalink parent award report block reply\nzooty 2 points 2 days ago Definitely a business opportunity there. The biggest issue is the accreditation system. Need to work out getting around or supplanting that. permalink parent award report block reply\nLurkNoMore 1 points 2 days ago I’m doing a masters in Malaysia right now. 2 yrs, 6k total. GI bill housing allowance is 2100/month, and the tuition is covered. permalink parent award report block reply\nMedicallyReddit 26 points 2 days ago The amount of damage Obanana and his legion of demons caused our country is sickening permalink award report block reply current_horror 22 points 2 days ago They did it on purpose to destroy the system and replace it with communism. And I don’t even blame them because they are communists . The real problem is the traitors who sold us all out to the communists for money. permalink parent award report block reply deleted 6 points 2 days ago UCantStumpTheTrump 3 points 2 days ago They are just meat puppets meant to absorb our votes and then not deliver on anything we want permalink parent award report block reply Bubbahax 4 points 2 days ago The absolute fucktards in this country (of which there are legions) thought that electing the Kenyan fraud would end racial tensions in America.  Of course, McCain didnt give us much of an alternative to vote for. permalink parent award report block reply\ncurrent_horror 22 points 2 days ago They did it on purpose to destroy the system and replace it with communism. And I don’t even blame them because they are communists . The real problem is the traitors who sold us all out to the communists for money. permalink parent award report block reply deleted 6 points 2 days ago UCantStumpTheTrump 3 points 2 days ago They are just meat puppets meant to absorb our votes and then not deliver on anything we want permalink parent award report block reply\ndeleted 6 points 2 days ago UCantStumpTheTrump 3 points 2 days ago They are just meat puppets meant to absorb our votes and then not deliver on anything we want permalink parent award report block reply\nUCantStumpTheTrump 3 points 2 days ago They are just meat puppets meant to absorb our votes and then not deliver on anything we want permalink parent award report block reply\nBubbahax 4 points 2 days ago The absolute fucktards in this country (of which there are legions) thought that electing the Kenyan fraud would end racial tensions in America.  Of course, McCain didnt give us much of an alternative to vote for. permalink parent award report block reply\nstarjello 21 points 2 days ago Of course. The insurance companies wrote the bill. permalink award report block reply Aquamine-Amarine 20 points 2 days ago And the politicians didn't even read it... gotta pass it in order to know what's in it! permalink parent award report block reply GA_Logic 5 points 2 days ago Most politicians have an understanding in the field of law and they knew what they were doing.  Pure evil. permalink parent award report block reply DeportThemAllForever 3 points 2 days ago They bought health insurance stocks, then passed it. permalink parent award report block reply\nAquamine-Amarine 20 points 2 days ago And the politicians didn't even read it... gotta pass it in order to know what's in it! permalink parent award report block reply GA_Logic 5 points 2 days ago Most politicians have an understanding in the field of law and they knew what they were doing.  Pure evil. permalink parent award report block reply DeportThemAllForever 3 points 2 days ago They bought health insurance stocks, then passed it. permalink parent award report block reply\nGA_Logic 5 points 2 days ago Most politicians have an understanding in the field of law and they knew what they were doing.  Pure evil. permalink parent award report block reply\nDeportThemAllForever 3 points 2 days ago They bought health insurance stocks, then passed it. permalink parent award report block reply\nTrumpchoochoo 12 points 2 days ago Abolish fucking insurance.  The biggest pyramid scheme in history. permalink award report block reply thelastlast 13 points 2 days ago mandatory insurance is illegal.  so is income and property tax.  so is 'telling' us what we can eat and drink.  so is telling us how 'safe' to keep ourselves or else. we've been putting it up our whole lives.  time to start taking it back.  this country deserves better. permalink parent award report block reply\nthelastlast 13 points 2 days ago mandatory insurance is illegal.  so is income and property tax.  so is 'telling' us what we can eat and drink.  so is telling us how 'safe' to keep ourselves or else. we've been putting it up our whole lives.  time to start taking it back.  this country deserves better. permalink parent award report block reply\nIncredibleMrE1 12 points 2 days ago UHC is a perfect example. permalink award report block reply ApprenticeParty 6 points 2 days ago Lots of smaller companies literally praying on poor retards too. permalink parent award report block reply\nApprenticeParty 6 points 2 days ago Lots of smaller companies literally praying on poor retards too. permalink parent award report block reply\nUnstableGoat 12 points 2 days ago Not only that, ACA changed the definition of Medical Loss Ratio from “claims / premiums” to (claims + Quality improvement expenses) / (premiums - taxes, legal, regulatory expenses) So now there’s all these bullshit job programs focused on “quality initiatives” that never actually improve quality and a bunch of paper-pushing functions in legal and compliance because shrug why not, they get counted in the ratio. permalink award report block reply\nIm_RickSteves_bitch 12 points 2 days ago Some of these people need to be in jail. permalink award report block reply\nEatinglue 12 points 2 days ago It was designed to blow up our current system as an excuse to go to single payer, and all the evil and death that comes with it, probably to reduce the population to fight “climate change”. permalink award report block reply\npingpongdingdong 8 points 2 days ago so you’re telling me government intervention broke a private enterprise system? who could have ever predicted… permalink award report block reply DeportThemAllForever 2 points 2 days ago It didn’t break it, it rewarded it.  Funded by healthcare industry and they got paid big time. If we repeal it, prices have to go down.  Right now that’s unheard of, prices are up 20% YoY. permalink parent award report block reply\nDeportThemAllForever 2 points 2 days ago It didn’t break it, it rewarded it.  Funded by healthcare industry and they got paid big time. If we repeal it, prices have to go down.  Right now that’s unheard of, prices are up 20% YoY. permalink parent award report block reply\nAmerica_No_1 7 points 2 days ago The health care plan giants lobbied for this.  What better way to give them more money than to mandate more people needed to be on their plans?  And now they had full control of costs as well.  They are all in bed together with their companies and congress and our socialist commie ex-admins. permalink award report block reply\nConsrvspkgNJ 6 points 2 days ago From a 30 year insurance professional specializing in Medicare and Retiree benefits....he is spot on correct. The only problem is, every solution we come up with cuts out the politicians and their grift and there is no way they will ever go with it not to mention one side of Congress is trying to pull us into Single Payor so neither side wants our private sector based solutions. permalink award report block reply\ncyberwar 5 points 2 days ago curse you McCain permalink award report block reply\nCovfefeVideo 5 points 2 days ago No one ever goes to jail.  Weird. permalink award report block reply\nUrinetensions 5 points 2 days ago Ohh! Now the royalty kickbacks to BHO make sense permalink award report block reply\nLib_Women_Have_HSV 4 points 2 days ago Everyone pointed this out before it passed permalink award report block reply\nDITTOPatriot 4 points 2 days ago The legislators and the administration know all of this, including the fact that Pharmacy Benefit Managers (PBMs) are a significant scam. It’s simply that they aren’t interested in doing their jobs because all of these benefits favor Wall Street and their donors. When the administration surrounds itself with Wall Street players, nothing will be done to help Main Street or the working man. Sure, they will feed you a constant diet of red meat and tweets that rotate daily. Enjoy it while they drain the nut sacks of the influential. permalink award report block reply\nIWI9000 4 points 2 days ago Until they ban vertical integrations across insurer, PBM, pharmacy, provider, GPO, distributor within healthcare and remove the antikick exemptions, it will never get better. permalink award report block reply\nSpeekFreely 4 points 2 days ago Sounds like a program by the insurance companies themselves./s permalink award report block reply\nNibba2 4 points 2 days ago Just like military budget. Use it or lose it. So they blow it on everything at the end of the year. permalink award report block reply Naboth 2 points 2 days ago One of the reasons FSAs should be illegal, or at least have no benefit under the tax code. HSAs, on the other hand, could solve most of the health care problems in the US if they were simplified and the HDHP requirement was removed so that everyone could use them.  Properly structured, you could even use them as an alternative to medicare and medicaid, and eliminate most of the federal deficit as a side effect. Real solutions to the problem exist, but Congress will never let such solutions be implemented.  Because the insurance companies literally own them. permalink parent award report block reply\nNaboth 2 points 2 days ago One of the reasons FSAs should be illegal, or at least have no benefit under the tax code. HSAs, on the other hand, could solve most of the health care problems in the US if they were simplified and the HDHP requirement was removed so that everyone could use them.  Properly structured, you could even use them as an alternative to medicare and medicaid, and eliminate most of the federal deficit as a side effect. Real solutions to the problem exist, but Congress will never let such solutions be implemented.  Because the insurance companies literally own them. permalink parent award report block reply\nh203h 3 points 2 days ago When is filthy Obama going to hang high and be executed for treason? Enough is enough with these goons getting away while the USA suffered because of these actions. TREASON=DEATH! permalink award report block reply\nSavingPrivateGrace 3 points 2 days ago When it becomes excessive and unfair it's called Greed.  The medical profession too, not just the health insurance, especially during Covid + vax. permalink award report block reply\nTacitus1963 3 points 2 days ago And you can bet your last $, that there are layers of grifting involved so that BHO et al laundered our tax dollars to their private accounts. permalink award report block reply\nMyNameIsTaxpayer 3 points 2 days ago Thank you for not wearing a stethoscope. permalink award report block reply\nL-Train 2 points 2 days ago This was the most articulated and honest explanation that we should be teaching in schools. permalink award report block reply\nAgnesDomini 2 points 2 days ago Absolutely by design, so that government could force people into government-run Healthcare to control us from cradle to grave. permalink award report block reply\nGiant_Schwartz 2 points 2 days ago If you needed someone to explain this you are a common dolt.  Not pointing my finger at op.  Just a general statement. War in Afghanistan was for pharma access to opioids. ACA was payment to insurance for letting poors have free drugs Poors sell their free drugs on the street or to dealers for way under pharmacy prices. America racked up in an opioid epidemic. Pharma and insurance make record profits It was all planned. They created two more entities to control Americans through. Big oil, big war, big pharma and big insurance. permalink award report block reply Capoditutticapi1 OP 1 points 2 days ago Thanks for furthering the explanation to the common/uncommon dolts with bullet points... Needs to be said and shared often to sink in for many... permalink parent award report block reply Giant_Schwartz 2 points 2 days ago I've been saying on here for years.  Nobody pays attention until someone on TV or the mainstream media agree permalink parent award report block reply\nCapoditutticapi1 OP 1 points 2 days ago Thanks for furthering the explanation to the common/uncommon dolts with bullet points... Needs to be said and shared often to sink in for many... permalink parent award report block reply Giant_Schwartz 2 points 2 days ago I've been saying on here for years.  Nobody pays attention until someone on TV or the mainstream media agree permalink parent award report block reply\nGiant_Schwartz 2 points 2 days ago I've been saying on here for years.  Nobody pays attention until someone on TV or the mainstream media agree permalink parent award report block reply\nutfanx2 2 points 2 days ago Or until you make your own insurance company with beer and hookers. permalink award report block reply\nChuj 1 points 2 days ago I remember when the thought was, that Obamacare would be so much cheaper than conventional insurance products, that it would drive them into bankruptcy. What a crock that turned out to be. Big insurance profitted hugely permalink award report block reply Naboth 1 points 2 days ago Nobody who knew basic math ever thought that.  Everyone but the retards knew it was a scam from the beginning. permalink parent award report block reply Chuj 1 points 1 day ago It was seen as a bridge to universal healthcare. A way to force insurance companies out of business. That was the public front. Clearly much went on behind the scenes that the public was not aware of. permalink parent award report block reply\nNaboth 1 points 2 days ago Nobody who knew basic math ever thought that.  Everyone but the retards knew it was a scam from the beginning. permalink parent award report block reply Chuj 1 points 1 day ago It was seen as a bridge to universal healthcare. A way to force insurance companies out of business. That was the public front. Clearly much went on behind the scenes that the public was not aware of. permalink parent award report block reply\nChuj 1 points 1 day ago It was seen as a bridge to universal healthcare. A way to force insurance companies out of business. That was the public front. Clearly much went on behind the scenes that the public was not aware of. permalink parent award report block reply\nthelastlast 1 points 2 days ago it's a little silly that people are anti-Luigi on this site. 'oh they're just fucking an entire nation of people over, causing massive loss, death and misery, a retaliation is way out of proportion.' why?  you need them to try to kill you directly?  when does self-defense kick in?  we all better start thinking about it, the bad guys have learned that parasites dont get punished but predators do, so all the predators are disguising themselves and EATING US ALIVE. permalink award report block reply\nanotherrandomname 1 points 2 days ago Yep obongocare was always just a massive handout to big insurance, and not even subtle about it either. permalink award report block reply"}