{"id": "8182499", "contents": "1343 Arizona Attorney General accepted $200,000 in what seems to be a quid pro quo arrangement, granting the Democratic Attorneys General Association—via its initiative, the States United Democracy Center—prosecutorial authority to target political opponents. posted 1 day ago by blue5707 68 comments award share report block Breanna Morello @BreannaMorello • 2d 🚨MUST READ🚨 New BOMBSHELL claims are being made by attorney Christina Bobb on AZ “fake” electors case. She says it appears the Arizona Attorney General accepted $200,000 in what seems to be a quid pro quo arrangement, granting the Democratic Attorneys General Association—via\n68 comments Sort by Top Top New Worst Old Save Calumet57 58 points 1 day ago Is Arizona fucked up or something?  I only hear about corruption. permalink award report block reply Aggrieved03 53 points 1 day ago Cartel ran permalink parent award report block reply Rock9Head 29 points 1 day ago Cindy McCain helps. permalink parent award report block reply YT45 7 points 1 day ago They own our governor. permalink parent award report block reply Aggrieved03 4 points 1 day ago The CIA owns them so who's controlling your governor? permalink parent award report block reply hnoble444 3 points 1 day ago Cartels, probably. Fontes is filthy, too. They are awful liars and thieves. permalink parent award report block reply YT45 1 points 1 day ago And so on and so forth… permalink parent award report block reply hnoble444 2 points 1 day ago Our governor is a criminal who belongs at GITMO. Bitch. permalink parent award report block reply Aggrieved03 2 points 1 day ago Why hasn’t the current DoJ done anything? permalink parent award report block reply SanityGumby 21 points 1 day ago This is what happens when Californians overwhelm your native population permalink parent award report block reply EDDIT_IS_CUCKED 13 points 1 day ago Cartels, but similar end result. permalink parent award report block reply SanityGumby 3 points 1 day ago How do you think cartels took over permalink parent award report block reply EDDIT_IS_CUCKED 11 points 1 day ago I'm not sure what you're insinuating but it has nothing to do with California. The cartels are Mexican and took control long before Californians started to flee here. Source: been in AZ 46 years. permalink parent award report block reply view 4 more comments... borisborscht 2 points 1 day ago you mean illegals and other undesirables.  The Californians leaving C today are good people permalink parent award report block reply SanityGumby 1 points 16 hours ago The ones that are creating the problem now were the ones coming in 2005-2015 permalink parent award report block reply hnoble444 2 points 1 day ago and New Yorkers. permalink parent award report block reply RealWomenLoveTrump 8 points 1 day ago Yes. Arizonan here. We've been heavily invaded from spics to the south and fucking Californians from the west. This state is slowly getting ground to blue dust. Our senator seats were stolen long ago, we have the McCain machine here like Kentucky has the Lindsay Graham machine. In 2022, Hobbs stole the governorship, we all watched it happen live, like a 2020 repeat. I was so disgusted. The AG, Kris Mayes, is a democrat henchman piece of shit. I hope these allegations are true and she ends up in prison. permalink parent award report block reply That_Which_Lurks 6 points 1 day ago Yes. The government here is beyond corrupt. I moved here in mid 2023 and will probably end up moving out. The people hare are so socially isolationist that you can barely even start a conversation with someone. The drivers are total passive-aggressive shit. The government is corrupt to the core. The only thing that seems to work (and I'm sure there is corruption here too) is the AzDOT. They at least try to keep their roads operational. I ended up getting a cat for friendship and socialization because the actual humans here (for the most part) are all tied up in their religious or social politics and treat 'outsiders' like garbage. And no, I didn't move here from California. I moved from a mid-west state. permalink parent award report block reply Blackmore 2 points 23 hours ago No wonder the election was stolen from her there. permalink parent award report block reply Iremembermypassword 31 points 1 day ago Pam Bondi will surely arrest that one? permalink award report block reply BigMikesChef 19 points 1 day ago 2 weeks or so. It's on her desk. permalink parent award report block reply DJT_MFers1 25 points 1 day ago Republicans go to jail or pay fines and Democrats get re-elected. Until this madness stops it will business as usual. permalink award report block reply Rock9Head 17 points 1 day ago AZ elections are a farce. permalink parent award report block reply SaltyKrakenBalls 11 points 1 day ago A good majority are. We live in fraudulent times. permalink parent award report block reply FightTheSWAMP 10 points 1 day ago Worse. They will get emboldened. They clearly violated many laws, yet face zero consequences despite the other party in power. They obviously do not fear consequences from their party, but now that they know the Republicans will not do anything, why would they not go twice as hard? permalink parent award report block reply truthtoday2022 14 points 1 day ago I used to be young and naïve. i would get excited that we caught these people red-handed , but now when I hear news like this, my first thought is and they will continue to get away with it permalink award report block reply Bicentennial76 6 points 1 day ago Same.  Turns out these are all humiliation rituals meant to break us. permalink parent award report block reply KernalMustard 1 points 1 day ago But Doomers...... Doomers are the people who have awaken before the rest of you all. Think morphpus in the matrix. permalink parent award report block reply Sparks1017 2 points 1 day ago Exactly, like my fav meme says. \"They're doing it again, because you didn't hang them the last time \" permalink parent award report block reply irescreams 9 points 1 day ago She should be arrested for bribery yesterday. The Dem association should be arrested for bribing.  Waiting. permalink award report block reply Michalusmichalus 8 points 1 day ago I knew AZ was fucked when they pressed charges on the auditors for doing a good job. permalink award report block reply Kwdzr 5 points 1 day ago Yep. Voting reformation is my #1 because it solves many of the other issues. permalink parent award report block reply blue5707 OP 8 points 1 day ago IN OTHER NEWS: https://www.foxnews.com/politics/bombshell-video-surfaces-biden-aide-admitting-he-stood-receive-millions-2024-victory permalink award report block reply flp999 6 points 1 day ago $200k? That’s it? These whores go cheap. Is that like $20k per high level goon? Hardly worth committing treason for. Can’t even buy a used car for that much these days. permalink award report block reply NoMaskNoMaster 2 points 1 day ago Hawaii politicians do shit for $5,000. Cheap whores indeed permalink parent award report block reply covok48 1 points 1 day ago They get paid for something they were going to do anyway. permalink parent award report block reply Liberats 4 points 1 day ago I went to check that she was indeed the Cristina Bobb from OAN and I get to Wiki and become enraged. https://en.wikipedia.org/wiki/Christina_Bobb They printed this page of fucking lies and had the audacity to ask for cash at the same time. permalink award report block reply Michalusmichalus 5 points 1 day ago There's a growing number of authors who refuse to allow Wikipedia to have pages on them or their books. They've gotten so bad that in round table discussions, authors discuss who had to go to court against them to prevent them from publishing lies about them, and/ or their books. permalink parent award report block reply Liberats 2 points 1 day ago Another educational source/organisation controlled by left wing activists/liars. permalink parent award report block reply Michalusmichalus 2 points 1 day ago It's really bad. Wikipedia lets people edit authors' book summaries wrong, and locks out the author from correcting the errors. They refuse to use the blurb found on book covers. permalink parent award report block reply JustInTime2_ 3 points 1 day ago We are truly a Banana Republic. permalink award report block reply EBernays 3 points 1 day ago Wake me up when somebody is arrested - without consequences all these \"bombshells\" do is normalize the corruption. permalink award report block reply Toddyoungsvagina 3 points 1 day ago Bombshell two more weeks guys permalink award report block reply Justjayce 3 points 1 day ago Expecting the full force of nothing from the DOJ permalink award report block reply The_Emperor 0 points 1 day ago I mean it takes 12 mo. To build a case, and there is a new bombshell every day!  They're overwhelmed! permalink parent award report block reply Narcan 2 points 1 day ago Nothing will happen. permalink award report block reply pray4peace4 2 points 1 day ago It's past time for firing squads. permalink award report block reply NoMaskNoMaster 2 points 1 day ago \"Attorneys General\" is the stupidest pluralization ever concocted. permalink award report block reply Chickensaurus 2 points 1 day ago Yawn. More illegal shit that won't be dealt with. permalink award report block reply MatterThatMetals 2 points 1 day ago Arizona is one fucked up place. permalink award report block reply covok48 2 points 1 day ago The fact that the DOJ won’t prosecute any of this convinces me that Trump is all talk, little action. Just like his business life. permalink award report block reply brutustyberius 1 points 1 day ago beat it, fool. permalink parent award report block reply patrioticwinning3 2 points 1 day ago Arrest when? permalink award report block reply OG_BACONndEGGs 2 points 1 day ago New Bombshell aka nooone will be arrested. permalink award report block reply fr33d0mTruck 2 points 1 day ago Its a BOMBSHELL guys... permalink award report block reply Krat 3 points 1 day ago Thats keyword for no arrests permalink parent award report block reply SmokeyAF 1 points 22 hours ago Breanna is talented, and has great talents. permalink award report block reply Electrify928 1 points 24 hours ago Arizona is the place a lot of dumb Californians come to to brag about how good California is and how much they want Arizona to be California. All while, not living in California for some.....odd......reason. permalink award report block reply UncleTrumpsBand 1 points 1 day ago Brenna Morello is mommy permalink award report block reply NotYourMan 1 points 1 day ago Seems like enough evidence to arrest somebody.  Lets go! permalink award report block reply BeekeepingPatriot 1 points 1 day ago Mmmm Breanna. permalink award report block reply MyBallsAreRough 1 points 1 day ago ohhhhhhhh a 🚨MUST READ🚨 BOMBSHELL 💥 c-c-c-comboooo permalink award report block reply\nCalumet57 58 points 1 day ago Is Arizona fucked up or something?  I only hear about corruption. permalink award report block reply Aggrieved03 53 points 1 day ago Cartel ran permalink parent award report block reply Rock9Head 29 points 1 day ago Cindy McCain helps. permalink parent award report block reply YT45 7 points 1 day ago They own our governor. permalink parent award report block reply Aggrieved03 4 points 1 day ago The CIA owns them so who's controlling your governor? permalink parent award report block reply hnoble444 3 points 1 day ago Cartels, probably. Fontes is filthy, too. They are awful liars and thieves. permalink parent award report block reply YT45 1 points 1 day ago And so on and so forth… permalink parent award report block reply hnoble444 2 points 1 day ago Our governor is a criminal who belongs at GITMO. Bitch. permalink parent award report block reply Aggrieved03 2 points 1 day ago Why hasn’t the current DoJ done anything? permalink parent award report block reply SanityGumby 21 points 1 day ago This is what happens when Californians overwhelm your native population permalink parent award report block reply EDDIT_IS_CUCKED 13 points 1 day ago Cartels, but similar end result. permalink parent award report block reply SanityGumby 3 points 1 day ago How do you think cartels took over permalink parent award report block reply EDDIT_IS_CUCKED 11 points 1 day ago I'm not sure what you're insinuating but it has nothing to do with California. The cartels are Mexican and took control long before Californians started to flee here. Source: been in AZ 46 years. permalink parent award report block reply view 4 more comments... borisborscht 2 points 1 day ago you mean illegals and other undesirables.  The Californians leaving C today are good people permalink parent award report block reply SanityGumby 1 points 16 hours ago The ones that are creating the problem now were the ones coming in 2005-2015 permalink parent award report block reply hnoble444 2 points 1 day ago and New Yorkers. permalink parent award report block reply RealWomenLoveTrump 8 points 1 day ago Yes. Arizonan here. We've been heavily invaded from spics to the south and fucking Californians from the west. This state is slowly getting ground to blue dust. Our senator seats were stolen long ago, we have the McCain machine here like Kentucky has the Lindsay Graham machine. In 2022, Hobbs stole the governorship, we all watched it happen live, like a 2020 repeat. I was so disgusted. The AG, Kris Mayes, is a democrat henchman piece of shit. I hope these allegations are true and she ends up in prison. permalink parent award report block reply That_Which_Lurks 6 points 1 day ago Yes. The government here is beyond corrupt. I moved here in mid 2023 and will probably end up moving out. The people hare are so socially isolationist that you can barely even start a conversation with someone. The drivers are total passive-aggressive shit. The government is corrupt to the core. The only thing that seems to work (and I'm sure there is corruption here too) is the AzDOT. They at least try to keep their roads operational. I ended up getting a cat for friendship and socialization because the actual humans here (for the most part) are all tied up in their religious or social politics and treat 'outsiders' like garbage. And no, I didn't move here from California. I moved from a mid-west state. permalink parent award report block reply Blackmore 2 points 23 hours ago No wonder the election was stolen from her there. permalink parent award report block reply\nAggrieved03 53 points 1 day ago Cartel ran permalink parent award report block reply Rock9Head 29 points 1 day ago Cindy McCain helps. permalink parent award report block reply YT45 7 points 1 day ago They own our governor. permalink parent award report block reply Aggrieved03 4 points 1 day ago The CIA owns them so who's controlling your governor? permalink parent award report block reply hnoble444 3 points 1 day ago Cartels, probably. Fontes is filthy, too. They are awful liars and thieves. permalink parent award report block reply YT45 1 points 1 day ago And so on and so forth… permalink parent award report block reply hnoble444 2 points 1 day ago Our governor is a criminal who belongs at GITMO. Bitch. permalink parent award report block reply Aggrieved03 2 points 1 day ago Why hasn’t the current DoJ done anything? permalink parent award report block reply\nRock9Head 29 points 1 day ago Cindy McCain helps. permalink parent award report block reply\nYT45 7 points 1 day ago They own our governor. permalink parent award report block reply Aggrieved03 4 points 1 day ago The CIA owns them so who's controlling your governor? permalink parent award report block reply hnoble444 3 points 1 day ago Cartels, probably. Fontes is filthy, too. They are awful liars and thieves. permalink parent award report block reply YT45 1 points 1 day ago And so on and so forth… permalink parent award report block reply hnoble444 2 points 1 day ago Our governor is a criminal who belongs at GITMO. Bitch. permalink parent award report block reply Aggrieved03 2 points 1 day ago Why hasn’t the current DoJ done anything? permalink parent award report block reply\nAggrieved03 4 points 1 day ago The CIA owns them so who's controlling your governor? permalink parent award report block reply hnoble444 3 points 1 day ago Cartels, probably. Fontes is filthy, too. They are awful liars and thieves. permalink parent award report block reply YT45 1 points 1 day ago And so on and so forth… permalink parent award report block reply\nhnoble444 3 points 1 day ago Cartels, probably. Fontes is filthy, too. They are awful liars and thieves. permalink parent award report block reply\nYT45 1 points 1 day ago And so on and so forth… permalink parent award report block reply\nhnoble444 2 points 1 day ago Our governor is a criminal who belongs at GITMO. Bitch. permalink parent award report block reply Aggrieved03 2 points 1 day ago Why hasn’t the current DoJ done anything? permalink parent award report block reply\nAggrieved03 2 points 1 day ago Why hasn’t the current DoJ done anything? permalink parent award report block reply\nSanityGumby 21 points 1 day ago This is what happens when Californians overwhelm your native population permalink parent award report block reply EDDIT_IS_CUCKED 13 points 1 day ago Cartels, but similar end result. permalink parent award report block reply SanityGumby 3 points 1 day ago How do you think cartels took over permalink parent award report block reply EDDIT_IS_CUCKED 11 points 1 day ago I'm not sure what you're insinuating but it has nothing to do with California. The cartels are Mexican and took control long before Californians started to flee here. Source: been in AZ 46 years. permalink parent award report block reply view 4 more comments... borisborscht 2 points 1 day ago you mean illegals and other undesirables.  The Californians leaving C today are good people permalink parent award report block reply SanityGumby 1 points 16 hours ago The ones that are creating the problem now were the ones coming in 2005-2015 permalink parent award report block reply hnoble444 2 points 1 day ago and New Yorkers. permalink parent award report block reply\nEDDIT_IS_CUCKED 13 points 1 day ago Cartels, but similar end result. permalink parent award report block reply SanityGumby 3 points 1 day ago How do you think cartels took over permalink parent award report block reply EDDIT_IS_CUCKED 11 points 1 day ago I'm not sure what you're insinuating but it has nothing to do with California. The cartels are Mexican and took control long before Californians started to flee here. Source: been in AZ 46 years. permalink parent award report block reply view 4 more comments...\nSanityGumby 3 points 1 day ago How do you think cartels took over permalink parent award report block reply EDDIT_IS_CUCKED 11 points 1 day ago I'm not sure what you're insinuating but it has nothing to do with California. The cartels are Mexican and took control long before Californians started to flee here. Source: been in AZ 46 years. permalink parent award report block reply view 4 more comments...\nEDDIT_IS_CUCKED 11 points 1 day ago I'm not sure what you're insinuating but it has nothing to do with California. The cartels are Mexican and took control long before Californians started to flee here. Source: been in AZ 46 years. permalink parent award report block reply view 4 more comments...\nborisborscht 2 points 1 day ago you mean illegals and other undesirables.  The Californians leaving C today are good people permalink parent award report block reply SanityGumby 1 points 16 hours ago The ones that are creating the problem now were the ones coming in 2005-2015 permalink parent award report block reply\nSanityGumby 1 points 16 hours ago The ones that are creating the problem now were the ones coming in 2005-2015 permalink parent award report block reply\nhnoble444 2 points 1 day ago and New Yorkers. permalink parent award report block reply\nRealWomenLoveTrump 8 points 1 day ago Yes. Arizonan here. We've been heavily invaded from spics to the south and fucking Californians from the west. This state is slowly getting ground to blue dust. Our senator seats were stolen long ago, we have the McCain machine here like Kentucky has the Lindsay Graham machine. In 2022, Hobbs stole the governorship, we all watched it happen live, like a 2020 repeat. I was so disgusted. The AG, Kris Mayes, is a democrat henchman piece of shit. I hope these allegations are true and she ends up in prison. permalink parent award report block reply\nThat_Which_Lurks 6 points 1 day ago Yes. The government here is beyond corrupt. I moved here in mid 2023 and will probably end up moving out. The people hare are so socially isolationist that you can barely even start a conversation with someone. The drivers are total passive-aggressive shit. The government is corrupt to the core. The only thing that seems to work (and I'm sure there is corruption here too) is the AzDOT. They at least try to keep their roads operational. I ended up getting a cat for friendship and socialization because the actual humans here (for the most part) are all tied up in their religious or social politics and treat 'outsiders' like garbage. And no, I didn't move here from California. I moved from a mid-west state. permalink parent award report block reply\nBlackmore 2 points 23 hours ago No wonder the election was stolen from her there. permalink parent award report block reply\nIremembermypassword 31 points 1 day ago Pam Bondi will surely arrest that one? permalink award report block reply BigMikesChef 19 points 1 day ago 2 weeks or so. It's on her desk. permalink parent award report block reply\nBigMikesChef 19 points 1 day ago 2 weeks or so. It's on her desk. permalink parent award report block reply\nDJT_MFers1 25 points 1 day ago Republicans go to jail or pay fines and Democrats get re-elected. Until this madness stops it will business as usual. permalink award report block reply Rock9Head 17 points 1 day ago AZ elections are a farce. permalink parent award report block reply SaltyKrakenBalls 11 points 1 day ago A good majority are. We live in fraudulent times. permalink parent award report block reply FightTheSWAMP 10 points 1 day ago Worse. They will get emboldened. They clearly violated many laws, yet face zero consequences despite the other party in power. They obviously do not fear consequences from their party, but now that they know the Republicans will not do anything, why would they not go twice as hard? permalink parent award report block reply\nRock9Head 17 points 1 day ago AZ elections are a farce. permalink parent award report block reply SaltyKrakenBalls 11 points 1 day ago A good majority are. We live in fraudulent times. permalink parent award report block reply\nSaltyKrakenBalls 11 points 1 day ago A good majority are. We live in fraudulent times. permalink parent award report block reply\nFightTheSWAMP 10 points 1 day ago Worse. They will get emboldened. They clearly violated many laws, yet face zero consequences despite the other party in power. They obviously do not fear consequences from their party, but now that they know the Republicans will not do anything, why would they not go twice as hard? permalink parent award report block reply\ntruthtoday2022 14 points 1 day ago I used to be young and naïve. i would get excited that we caught these people red-handed , but now when I hear news like this, my first thought is and they will continue to get away with it permalink award report block reply Bicentennial76 6 points 1 day ago Same.  Turns out these are all humiliation rituals meant to break us. permalink parent award report block reply KernalMustard 1 points 1 day ago But Doomers...... Doomers are the people who have awaken before the rest of you all. Think morphpus in the matrix. permalink parent award report block reply Sparks1017 2 points 1 day ago Exactly, like my fav meme says. \"They're doing it again, because you didn't hang them the last time \" permalink parent award report block reply\nBicentennial76 6 points 1 day ago Same.  Turns out these are all humiliation rituals meant to break us. permalink parent award report block reply KernalMustard 1 points 1 day ago But Doomers...... Doomers are the people who have awaken before the rest of you all. Think morphpus in the matrix. permalink parent award report block reply\nKernalMustard 1 points 1 day ago But Doomers...... Doomers are the people who have awaken before the rest of you all. Think morphpus in the matrix. permalink parent award report block reply\nSparks1017 2 points 1 day ago Exactly, like my fav meme says. \"They're doing it again, because you didn't hang them the last time \" permalink parent award report block reply\nirescreams 9 points 1 day ago She should be arrested for bribery yesterday. The Dem association should be arrested for bribing.  Waiting. permalink award report block reply\nMichalusmichalus 8 points 1 day ago I knew AZ was fucked when they pressed charges on the auditors for doing a good job. permalink award report block reply Kwdzr 5 points 1 day ago Yep. Voting reformation is my #1 because it solves many of the other issues. permalink parent award report block reply\nKwdzr 5 points 1 day ago Yep. Voting reformation is my #1 because it solves many of the other issues. permalink parent award report block reply\nblue5707 OP 8 points 1 day ago IN OTHER NEWS: https://www.foxnews.com/politics/bombshell-video-surfaces-biden-aide-admitting-he-stood-receive-millions-2024-victory permalink award report block reply\nflp999 6 points 1 day ago $200k? That’s it? These whores go cheap. Is that like $20k per high level goon? Hardly worth committing treason for. Can’t even buy a used car for that much these days. permalink award report block reply NoMaskNoMaster 2 points 1 day ago Hawaii politicians do shit for $5,000. Cheap whores indeed permalink parent award report block reply covok48 1 points 1 day ago They get paid for something they were going to do anyway. permalink parent award report block reply\nNoMaskNoMaster 2 points 1 day ago Hawaii politicians do shit for $5,000. Cheap whores indeed permalink parent award report block reply covok48 1 points 1 day ago They get paid for something they were going to do anyway. permalink parent award report block reply\ncovok48 1 points 1 day ago They get paid for something they were going to do anyway. permalink parent award report block reply\nLiberats 4 points 1 day ago I went to check that she was indeed the Cristina Bobb from OAN and I get to Wiki and become enraged. https://en.wikipedia.org/wiki/Christina_Bobb They printed this page of fucking lies and had the audacity to ask for cash at the same time. permalink award report block reply Michalusmichalus 5 points 1 day ago There's a growing number of authors who refuse to allow Wikipedia to have pages on them or their books. They've gotten so bad that in round table discussions, authors discuss who had to go to court against them to prevent them from publishing lies about them, and/ or their books. permalink parent award report block reply Liberats 2 points 1 day ago Another educational source/organisation controlled by left wing activists/liars. permalink parent award report block reply Michalusmichalus 2 points 1 day ago It's really bad. Wikipedia lets people edit authors' book summaries wrong, and locks out the author from correcting the errors. They refuse to use the blurb found on book covers. permalink parent award report block reply\nMichalusmichalus 5 points 1 day ago There's a growing number of authors who refuse to allow Wikipedia to have pages on them or their books. They've gotten so bad that in round table discussions, authors discuss who had to go to court against them to prevent them from publishing lies about them, and/ or their books. permalink parent award report block reply Liberats 2 points 1 day ago Another educational source/organisation controlled by left wing activists/liars. permalink parent award report block reply Michalusmichalus 2 points 1 day ago It's really bad. Wikipedia lets people edit authors' book summaries wrong, and locks out the author from correcting the errors. They refuse to use the blurb found on book covers. permalink parent award report block reply\nLiberats 2 points 1 day ago Another educational source/organisation controlled by left wing activists/liars. permalink parent award report block reply Michalusmichalus 2 points 1 day ago It's really bad. Wikipedia lets people edit authors' book summaries wrong, and locks out the author from correcting the errors. They refuse to use the blurb found on book covers. permalink parent award report block reply\nMichalusmichalus 2 points 1 day ago It's really bad. Wikipedia lets people edit authors' book summaries wrong, and locks out the author from correcting the errors. They refuse to use the blurb found on book covers. permalink parent award report block reply\nJustInTime2_ 3 points 1 day ago We are truly a Banana Republic. permalink award report block reply\nEBernays 3 points 1 day ago Wake me up when somebody is arrested - without consequences all these \"bombshells\" do is normalize the corruption. permalink award report block reply\nToddyoungsvagina 3 points 1 day ago Bombshell two more weeks guys permalink award report block reply\nJustjayce 3 points 1 day ago Expecting the full force of nothing from the DOJ permalink award report block reply The_Emperor 0 points 1 day ago I mean it takes 12 mo. To build a case, and there is a new bombshell every day!  They're overwhelmed! permalink parent award report block reply\nThe_Emperor 0 points 1 day ago I mean it takes 12 mo. To build a case, and there is a new bombshell every day!  They're overwhelmed! permalink parent award report block reply\nNarcan 2 points 1 day ago Nothing will happen. permalink award report block reply\npray4peace4 2 points 1 day ago It's past time for firing squads. permalink award report block reply\nNoMaskNoMaster 2 points 1 day ago \"Attorneys General\" is the stupidest pluralization ever concocted. permalink award report block reply\nChickensaurus 2 points 1 day ago Yawn. More illegal shit that won't be dealt with. permalink award report block reply\nMatterThatMetals 2 points 1 day ago Arizona is one fucked up place. permalink award report block reply\ncovok48 2 points 1 day ago The fact that the DOJ won’t prosecute any of this convinces me that Trump is all talk, little action. Just like his business life. permalink award report block reply brutustyberius 1 points 1 day ago beat it, fool. permalink parent award report block reply\nbrutustyberius 1 points 1 day ago beat it, fool. permalink parent award report block reply\npatrioticwinning3 2 points 1 day ago Arrest when? permalink award report block reply\nOG_BACONndEGGs 2 points 1 day ago New Bombshell aka nooone will be arrested. permalink award report block reply\nfr33d0mTruck 2 points 1 day ago Its a BOMBSHELL guys... permalink award report block reply Krat 3 points 1 day ago Thats keyword for no arrests permalink parent award report block reply\nKrat 3 points 1 day ago Thats keyword for no arrests permalink parent award report block reply\nSmokeyAF 1 points 22 hours ago Breanna is talented, and has great talents. permalink award report block reply\nElectrify928 1 points 24 hours ago Arizona is the place a lot of dumb Californians come to to brag about how good California is and how much they want Arizona to be California. All while, not living in California for some.....odd......reason. permalink award report block reply\nUncleTrumpsBand 1 points 1 day ago Brenna Morello is mommy permalink award report block reply\nNotYourMan 1 points 1 day ago Seems like enough evidence to arrest somebody.  Lets go! permalink award report block reply\nBeekeepingPatriot 1 points 1 day ago Mmmm Breanna. permalink award report block reply\nMyBallsAreRough 1 points 1 day ago ohhhhhhhh a 🚨MUST READ🚨 BOMBSHELL 💥 c-c-c-comboooo permalink award report block reply"}