{"id": "8183347", "contents": "1840 This Is The Way DEPORT posted 1 day ago by TheSonOfGadsden 102 comments award share download report block\n102 comments Sort by Top Top New Worst Old Save rebuildingMyself 59 points 24 hours ago WhyNotBoth.jpg permalink award report block reply Deportthemall23 30 points 24 hours ago Just remember that neither of them would have been elected if we had kept out the Muslims in the first place. There's millions of Muslim terrorists loyal to Al Qaeda in America voting for those people purely because we let them in since Trump was first elected.. most of them under Biden permalink parent award report block reply Than0sIII 13 points 23 hours ago Yeah and it's thanks to idiots like Dubya that the whole notion of \"Islam is a religion of peace\" got pushed because for some reason they didn't want the pendulum to swing that hard against Islam with 9/11.   Even though you had people sounding the alarms repeatedly over shit like the Twelvers. permalink parent award report block reply Dman82 1 points 18 hours ago The bad thing is they say bush is the only president in history with a positive approval rating from democrats Republicans and independents permalink parent award report block reply Viewer01 6 points 24 hours ago Who let them in. Give names. Be specific. permalink parent award report block reply 0111000001100101 11 points 24 hours ago Mayorkas? permalink parent award report block reply Viewer01 7 points 24 hours ago Post his early life. permalink parent award report block reply view 4 more comments... MySidesGoUp 1 points 20 hours ago Immigration attorneys ?  Judges??  Sponsors programs??? NGO’s???? mcmahon gif permalink parent award report block reply Ostia 1 points 24 hours ago Well we just brought one into the White House yesterday. permalink parent award report block reply rebuildingMyself 2 points 23 hours ago That was just accepting the reality that that guy we hate runs that country and it's better to have an open line of communication with that country than play sand wars for Israel once again permalink parent award report block reply view 2 more comments... Hunter77 1 points 22 hours ago There are lots and lots of white liberals voting for them too. This isn't just a muslim issue. permalink parent award report block reply Shih_Tabed 1 points 14 hours ago Comment removed by community moderators. permalink parent award report block reply BeauHD 14 points 24 hours ago My solution is to show them the glories of hello.jpg permalink parent award report block reply tpactionchasethevote 1 points 18 hours ago My immigration policy is the same as Martha's Vineyard. permalink parent award report block reply IncredibleMrE1 16 points 24 hours ago My immigration policy is doing both. permalink award report block reply KungPaoMcChicken 7 points 23 hours ago My immigration policy is to stop Hollywood from presenting Muslims as 100% peaceful and victims in any form of media. permalink parent award report block reply HeavyMetalPatriot 3 points 23 hours ago My immigration policy deports Democrat voters. permalink parent award report block reply ForgottenUsername 1 points 22 hours ago It's curious that Hollywood would do that when in their own country they blow them off the face of the earth permalink parent award report block reply wharfthrowaway 13 points 24 hours ago My immigration policy is deporting all non-citizens and anyone who has voted Democrat since 2020 permalink award report block reply empiretc 7 points 24 hours ago 2008 permalink parent award report block reply starjello 9 points 24 hours ago 1912 permalink parent award report block reply LokiHelmsdeep 5 points 24 hours ago It is extremely hard to believe that roughly HALF of voting Americans vote Democrat, not a good sign for the future of our Country but with Trump as POTUS now and what he's done/is doing, I'm the most optimistic about America's near, mid-term and long-term future as I've ever been, by a lot. permalink parent award report block reply covok48 3 points 22 hours ago It’s “better” than it has been. In the past that half was practically normal White Americans and some blacks. That has been replaced by all the minorities, fags, illegals, feminists, trans, and dye-in-the-wool communists. permalink parent award report block reply Hunter77 2 points 22 hours ago There are still a ton of whites voting Dem too, especially in cities. Not just major cities, either. permalink parent award report block reply Hunter77 2 points 22 hours ago I know an awful lot of Dem voting whites. There are entire neighborhoods of such around here. I don't think it's all fraud. permalink parent award report block reply SimaYi 2 points 18 hours ago White people vote Republican majority overall, 60-40. Non-White is 80-20. White people are not your problem. This is why they open the border and oppose ICE. They want to replace you. Get out of your bubble. permalink parent award report block reply Hunter77 1 points 16 hours ago 40% of whites - and I think it's more than that - is still a fucking large number. Allied with non-whites it's an even bigger number. I have yet to see a serious plan for dealing with half a country opposing us, not even accounting for all the RINO voters and MAGA people who condemn 2/3 of our options. permalink parent award report block reply view 1 more comments... MediaBro 1 points 22 hours ago It's not permalink parent award report block reply KekistaniMemeLord 1 points 19 hours ago no one ever said it was ALL fraud. I would be generous and say lefty voters make like 40 percent of the population max with illegals/VISA holders/ Fraud making up the difference. permalink parent award report block reply view 2 more comments... SimaYi 2 points 19 hours ago It is extremely hard to believe that roughly HALF of voting Americans vote Democrat How is this hard to believe? Only half the country is White. Jews love to show you pictures of White women and say they are the Democrat power base. They aren't in the slightest. It's the literal millions of non-Whites who ONLY vote Democrat. This is why they open the borders. The Democrat Party is the Anti-White Party. When arguing with a White Leftist, it's always about economics or some bullshit. When arguing with a non-White, it's about race every time. You live in a multi-racial democracy, and all politics are identity politics. permalink parent award report block reply ForgottenUsername 1 points 22 hours ago It's actually not that concerning.   Young people always vote that way until they mature.  And the trend is changing where while they still mostly support the left the right is gaining support.  And because of birth rates there are far more older people than young people.  But that gets countered by boomers who don't have the Internet and still believe the MSM. permalink parent award report block reply WilliverTwo 1 points 20 hours ago I never went through a liberal phase as a kid let alone voting Democrat and I was born in 1990. And I grew up in the suburbs of Minneapolis in a single-mom household. I was a month shy of being 18 years old on election day 2008, but I think I would not have voted if it were held after my birthday or if I was born sooner to be 18 years old then. Even without internet access to show me alternative viewpoints, it was pretty obvious to me that Fox News was controlled-opposition \"conservativism\" even when I was a 16 year old kid in the Year 2007, again at the time I had very little to know access to like web forms or spending a lot of time with the internet at home it was mostly public library access. I didn't have many friends growing up and couldn't relate to most kids my age. permalink parent award report block reply HeavyMetalPatriot 1 points 23 hours ago Except the midterms are in grave danger. https://patriots.win/p/1ARK9l81LF/midterms-are-in-grave-danger-tim/c permalink parent award report block reply ForgottenUsername 2 points 22 hours ago Midterms always suck that's why I'm kind of disappointed Trump isn't going harder now while he has full control.  And Congress and his Supreme Court picks are pretty useless.  Every lower court attempting to instruct should be shot down by the supreme court immediately.  And shouldn't action be taken against these corrupt judges? permalink parent award report block reply SimaYi 2 points 18 hours ago He's failed. He's a 1990s Bill Clinton Democrat at his core. He's not willing to do what needs to be done. permalink parent award report block reply Sparks1017 2 points 23 hours ago EVER permalink parent award report block reply projectarcturus1 10 points 24 hours ago Yes. They all have to go back to their own countries. They turn whatever country they go to, into the same shithole they left. permalink award report block reply Viewer01 9 points 24 hours ago The Zionist boomers are fucking clueless what is going on with Gen z right now. Keep on cancelling young folks and anyone critical of Israel and see where that gets us in ‘28. It’s truly bizarre to watch them hate their grand kids this much and throw open the doors for anyone and everyone to come in and get priority. permalink award report block reply LokiHelmsdeep -10 points 24 hours ago Just STFU up already with the Jew shit, y'all faggots ass Nick Fuentes-type losers are nothing's and will never be anything.   Well, tbf some of yall will realize how retarded your worldview is and change, but either way you're Social Media click-rage \"Jews control everything\" nonsence is staright up garbage and has already been fading fast.   I compare it to Flat Earthers and Qannons, same type bullshit. permalink parent award report block reply Viewer01 4 points 23 hours ago …. That’s how they describe themselves? Anyways, when war with Iran breaks out I’m sure you’ll be first in line to die defending gay sex and Israel, right? permalink parent award report block reply flashersenpai 1 points 15 hours ago wtf you are such a god damn moron you left out trans rights you have to die for those too gosh permalink parent award report block reply ICheckThings 3 points 22 hours ago TKD permalink parent award report block reply SimaYi 3 points 18 hours ago Just STFU up already with the Jew shit No. permalink parent award report block reply flashersenpai 1 points 15 hours ago yeeeeeeeee permalink parent award report block reply Major_Nutt 1 points 23 hours ago Piss off Zionist. permalink parent award report block reply flashersenpai 1 points 15 hours ago and has already been fading fast the only thing fading fast is the collective pulse rate of the boomercon zionists permalink parent award report block reply RentFree2020 8 points 24 hours ago There's a third political party that is now immigrants. We have an elephant, a jackass, and now we need to represent them with a pig. Because they fucking hate pigs. permalink award report block reply Philhelm 2 points 23 hours ago I like pigs, and all of the farm animals actually. Fuck Muslims. permalink parent award report block reply MoreGuns 7 points 24 hours ago The U.S easily has 130 - 150 million \"people\" who need a good deporting permalink award report block reply Dman82 1 points 18 hours ago Probably a few more than that sadly permalink parent award report block reply mikejones 1 points 18 hours ago And when deporting doesn't work the other side has a good size army. permalink parent award report block reply Aggrieved03 6 points 24 hours ago My immigration policy would make us a White Christian nation again. permalink award report block reply SimaYi 2 points 18 hours ago The only way that happens is with violence. So, not going to happen. permalink parent award report block reply mikejones 2 points 18 hours ago I was just talking about that tonight at therapy. permalink parent award report block reply Tele_Plus 5 points 23 hours ago The battle against Islam will be a tough one I think because their strategy is to use our own system against us and take over entire cities legally.  It’s insidious because they’ve been doing it in the background for some time now.  How do we stop them?  I think there needs to be some serious restrictions on who can become a  citizen in this country, and who can take public office.  Like in Japan - you can’t just move there.  You need a damn good reason to be there, otherwise after 90 days it’s GTFO. permalink award report block reply mikejones 1 points 18 hours ago The long game is being played and every area is being taken advantage of. It's near impossible to fix cause there's so much dead weight draining the resources non-stop. permalink parent award report block reply LokiHelmsdeep 5 points 24 hours ago Would be nice to deport 50 or so million illegal immigrants and Leftist's, the stuff dreams are made of!!   Reasonably we could deport 20+ million illegal immigrants over the next few years and put 100,000 or so mentally deranged Leftists into Mental Institutions to get the mental healthcare they so desperately need. permalink award report block reply Ostia 2 points 24 hours ago We haven’t even deported a million yet in over a year. permalink parent award report block reply LokiHelmsdeep -1 points 24 hours ago There have been over a half million deportations and over 2 million self deportations....hold on, let me grab my calculator......that equals well over 2.5 million illegal immigrants deported from America and in less than 10 months since Trump's Inaugurated and less than 9 months of having the teams in place to start deportations. permalink parent award report block reply covok48 4 points 22 hours ago ^ This guy is gearing up for his 50 year mortgage. permalink parent award report block reply Ostia 2 points 23 hours ago Neat grading curve you’ve got there to want to try and count how many people we claim have left on their own. How do you think we calculate that? Do they ask if you’re moving home at the Mexico border? Do you submit a letter to the government? Is there a database? Have we been presented any data to verify that? Nope. No. We have not. No there is not. permalink parent award report block reply SimaYi 1 points 18 hours ago Only 85 million to go. permalink parent award report block reply henri_derelicte 3 points 23 hours ago I have to agree with the latter. It won’t be enough to simply stop the flow of third worlders. We have to send people back who are already here, including some of those who are already citizens permalink award report block reply I_Love_45-70_Gov 3 points 23 hours ago My immigration policy is pork. Insane amounts of pork, every fucking day. permalink award report block reply HenkZeilstra 3 points 23 hours ago Start with acknowledging who is running the liberal agenda and NGO's permalink award report block reply Formerlurker92 3 points 24 hours ago I'm with Logan on this one permalink award report block reply jonnyuno 2 points 23 hours ago I want these two to have a baby. permalink award report block reply Antemalagon 2 points 22 hours ago Yup , muslims should be expelled from the country and banned in perpetuity. permalink award report block reply BoughtByBloomberg2 2 points 24 hours ago \"You can't just take away someone's citizenship!!!\" Why not? We gave it to them like it was a formality so why not the other way round? permalink award report block reply dr_gonzo 2 points 20 hours ago From 1776 until 1965 our immigration was QUOTA BASED on a per country level, and it strongly favored Europeans. Very few were allowed from other countries. Then in 1965 Teddy Kennedy and the boys got rid of the quotas and made the priority \"re-uniting families\". Combine that with birthright citizenship and you've got an invitation for illegal immigration. And when you throw in the welfare state that was created that same year, we went from inviting the most industrious and adventurous Europeans that simply wanted a free society to prosper, to 3rd worlders that wanted to shit out kids for handouts. You know, sorta like exactly what happened? So why in the fuck isn't anyone suggesting we go back to the QUOTA BASED system that worked so wonderfully for 200 years? permalink award report block reply Oleander 1 points 19 hours ago It would be considered \"racially insensitive\" to prioritize Europeans again. I hate this world that the last few generations created. Common sense and wisdom completely gone, and we're left to deal with the consequences of third worlders, whores, niggrs, and general moral/trust decay everywhere. Fuck everyone who prioritized these out groups over their own people and their own children's futures and safety, all in the name of looking like a \"good person\" (bullshit). permalink parent award report block reply TooBright 2 points 23 hours ago Any black that wants reparations should receive repatriation immediately. If they can't respect the fortunate position they're in they should get that reality check immediately. permalink award report block reply MySidesGoUp 2 points 20 hours ago To “work” for govt you should be Made in America. Also no dualies… Watch America become GREAT again. permalink award report block reply General_Grievance 1 points 18 hours ago Three words: North Sentinel Island. permalink award report block reply greatpumpkin 1 points 21 hours ago I nominate SoG for AG. permalink award report block reply champdog 1 points 20 hours ago I'd be happy with either policy. permalink award report block reply Nick-Kerr 1 points 18 hours ago My way is whatever policy Martha's Vineyard used permalink award report block reply SimaYi 1 points 19 hours ago It's still cute how White people in America still think that this is their country. You could get away with deporting all these foreigners 50 years ago, but the sad fact is that White Americans, ie. Americans (the proof is that I even have to say this), are now just another interest group in the American economic zone. In 10 years, you'll be a minority in your own country, and you'll watch the collapse of the United States in real time as the borders are opened to the entire world, and the treasury is emptied. You WILL see a President AOC. The fall of the West is coming. It is inevitable. permalink award report block reply mikejones 1 points 18 hours ago I do wonder how long it'll take. It'll be 2029 and 50 trillion in debt soon. How long can it go on for. The few deported might clean up the crime in the short term but it's just new territory for those who remain with more kids becoming criminals every year. Then technology will control your whole life. It'll be like living in China. permalink parent award report block reply Wolfebane84 1 points 20 hours ago My immigration policy is European decent only.  Everyone else, out. permalink award report block reply f_bastiat 1 points 19 hours ago My immigration policy is basically the same as Logan's with the stipulation that they are deported off a cliff and we send our entire arsenal of nukes to turn every Muslim majority country to glass so we don't have to worry about them coming here ever again. permalink award report block reply GuerillaYourDreams 1 points 23 hours ago OUT!!! permalink award report block reply Megaboom2025 1 points 19 hours ago Mine is to convict every politician for treason if they have taken money from AIPAC permalink award report block reply Helly -2 points 23 hours ago There’s no immigration policy radical enough for you guys. It’s getting a bit silly. I remember when it started like yeah let’s deport the criminals now it’s like oh let’s just denaturalized everybody and send them home. Bunch of retards same behavior that Reddit does. permalink award report block reply henri_derelicte 5 points 22 hours ago I hate to speak in such a hyperbole, but the people that make implementing Trump’s policies impossible are going to make the next Hitler inevitable. permalink parent award report block reply Oleander 1 points 19 hours ago nothing hyperbole about it if you ask me permalink parent award report block reply mikejones 1 points 18 hours ago Our own system being used against us when it's for something good. Plus back in the day 13 states. Now 50 states. And the government expected to help hundreds of millions of people around the world. permalink parent award report block reply SaltyArmyChick 1 points 21 hours ago SYBAU permalink parent award report block reply Prandogolio 1 points 23 hours ago Shut up fag permalink parent award report block reply TooBright 1 points 23 hours ago I want my country back. If that makes me retarded then so fucking be it. permalink parent award report block reply Helly 1 points 18 hours ago No makes you retarded is the same gay collectivist ideology from leftists which is infecting your brain permalink parent award report block reply TooBright 1 points 17 hours ago Name calling is the leftist modus operandi. permalink parent award report block reply flashersenpai 1 points 15 hours ago deporting people who are creating racial cartels in your own country is collectivist k permalink parent award report block reply XxxRDTPRNxxX 2 points 23 hours ago Comment removed by community moderators. permalink award report block reply\nrebuildingMyself 59 points 24 hours ago WhyNotBoth.jpg permalink award report block reply Deportthemall23 30 points 24 hours ago Just remember that neither of them would have been elected if we had kept out the Muslims in the first place. There's millions of Muslim terrorists loyal to Al Qaeda in America voting for those people purely because we let them in since Trump was first elected.. most of them under Biden permalink parent award report block reply Than0sIII 13 points 23 hours ago Yeah and it's thanks to idiots like Dubya that the whole notion of \"Islam is a religion of peace\" got pushed because for some reason they didn't want the pendulum to swing that hard against Islam with 9/11.   Even though you had people sounding the alarms repeatedly over shit like the Twelvers. permalink parent award report block reply Dman82 1 points 18 hours ago The bad thing is they say bush is the only president in history with a positive approval rating from democrats Republicans and independents permalink parent award report block reply Viewer01 6 points 24 hours ago Who let them in. Give names. Be specific. permalink parent award report block reply 0111000001100101 11 points 24 hours ago Mayorkas? permalink parent award report block reply Viewer01 7 points 24 hours ago Post his early life. permalink parent award report block reply view 4 more comments... MySidesGoUp 1 points 20 hours ago Immigration attorneys ?  Judges??  Sponsors programs??? NGO’s???? mcmahon gif permalink parent award report block reply Ostia 1 points 24 hours ago Well we just brought one into the White House yesterday. permalink parent award report block reply rebuildingMyself 2 points 23 hours ago That was just accepting the reality that that guy we hate runs that country and it's better to have an open line of communication with that country than play sand wars for Israel once again permalink parent award report block reply view 2 more comments... Hunter77 1 points 22 hours ago There are lots and lots of white liberals voting for them too. This isn't just a muslim issue. permalink parent award report block reply Shih_Tabed 1 points 14 hours ago Comment removed by community moderators. permalink parent award report block reply BeauHD 14 points 24 hours ago My solution is to show them the glories of hello.jpg permalink parent award report block reply tpactionchasethevote 1 points 18 hours ago My immigration policy is the same as Martha's Vineyard. permalink parent award report block reply\nDeportthemall23 30 points 24 hours ago Just remember that neither of them would have been elected if we had kept out the Muslims in the first place. There's millions of Muslim terrorists loyal to Al Qaeda in America voting for those people purely because we let them in since Trump was first elected.. most of them under Biden permalink parent award report block reply Than0sIII 13 points 23 hours ago Yeah and it's thanks to idiots like Dubya that the whole notion of \"Islam is a religion of peace\" got pushed because for some reason they didn't want the pendulum to swing that hard against Islam with 9/11.   Even though you had people sounding the alarms repeatedly over shit like the Twelvers. permalink parent award report block reply Dman82 1 points 18 hours ago The bad thing is they say bush is the only president in history with a positive approval rating from democrats Republicans and independents permalink parent award report block reply Viewer01 6 points 24 hours ago Who let them in. Give names. Be specific. permalink parent award report block reply 0111000001100101 11 points 24 hours ago Mayorkas? permalink parent award report block reply Viewer01 7 points 24 hours ago Post his early life. permalink parent award report block reply view 4 more comments... MySidesGoUp 1 points 20 hours ago Immigration attorneys ?  Judges??  Sponsors programs??? NGO’s???? mcmahon gif permalink parent award report block reply Ostia 1 points 24 hours ago Well we just brought one into the White House yesterday. permalink parent award report block reply rebuildingMyself 2 points 23 hours ago That was just accepting the reality that that guy we hate runs that country and it's better to have an open line of communication with that country than play sand wars for Israel once again permalink parent award report block reply view 2 more comments... Hunter77 1 points 22 hours ago There are lots and lots of white liberals voting for them too. This isn't just a muslim issue. permalink parent award report block reply Shih_Tabed 1 points 14 hours ago Comment removed by community moderators. permalink parent award report block reply\nThan0sIII 13 points 23 hours ago Yeah and it's thanks to idiots like Dubya that the whole notion of \"Islam is a religion of peace\" got pushed because for some reason they didn't want the pendulum to swing that hard against Islam with 9/11.   Even though you had people sounding the alarms repeatedly over shit like the Twelvers. permalink parent award report block reply Dman82 1 points 18 hours ago The bad thing is they say bush is the only president in history with a positive approval rating from democrats Republicans and independents permalink parent award report block reply\nDman82 1 points 18 hours ago The bad thing is they say bush is the only president in history with a positive approval rating from democrats Republicans and independents permalink parent award report block reply\nViewer01 6 points 24 hours ago Who let them in. Give names. Be specific. permalink parent award report block reply 0111000001100101 11 points 24 hours ago Mayorkas? permalink parent award report block reply Viewer01 7 points 24 hours ago Post his early life. permalink parent award report block reply view 4 more comments... MySidesGoUp 1 points 20 hours ago Immigration attorneys ?  Judges??  Sponsors programs??? NGO’s???? mcmahon gif permalink parent award report block reply Ostia 1 points 24 hours ago Well we just brought one into the White House yesterday. permalink parent award report block reply rebuildingMyself 2 points 23 hours ago That was just accepting the reality that that guy we hate runs that country and it's better to have an open line of communication with that country than play sand wars for Israel once again permalink parent award report block reply view 2 more comments...\n0111000001100101 11 points 24 hours ago Mayorkas? permalink parent award report block reply Viewer01 7 points 24 hours ago Post his early life. permalink parent award report block reply view 4 more comments... MySidesGoUp 1 points 20 hours ago Immigration attorneys ?  Judges??  Sponsors programs??? NGO’s???? mcmahon gif permalink parent award report block reply\nViewer01 7 points 24 hours ago Post his early life. permalink parent award report block reply view 4 more comments...\nMySidesGoUp 1 points 20 hours ago Immigration attorneys ?  Judges??  Sponsors programs??? NGO’s???? mcmahon gif permalink parent award report block reply\nOstia 1 points 24 hours ago Well we just brought one into the White House yesterday. permalink parent award report block reply rebuildingMyself 2 points 23 hours ago That was just accepting the reality that that guy we hate runs that country and it's better to have an open line of communication with that country than play sand wars for Israel once again permalink parent award report block reply view 2 more comments...\nrebuildingMyself 2 points 23 hours ago That was just accepting the reality that that guy we hate runs that country and it's better to have an open line of communication with that country than play sand wars for Israel once again permalink parent award report block reply view 2 more comments...\nHunter77 1 points 22 hours ago There are lots and lots of white liberals voting for them too. This isn't just a muslim issue. permalink parent award report block reply\nShih_Tabed 1 points 14 hours ago Comment removed by community moderators. permalink parent award report block reply\nBeauHD 14 points 24 hours ago My solution is to show them the glories of hello.jpg permalink parent award report block reply\ntpactionchasethevote 1 points 18 hours ago My immigration policy is the same as Martha's Vineyard. permalink parent award report block reply\nIncredibleMrE1 16 points 24 hours ago My immigration policy is doing both. permalink award report block reply KungPaoMcChicken 7 points 23 hours ago My immigration policy is to stop Hollywood from presenting Muslims as 100% peaceful and victims in any form of media. permalink parent award report block reply HeavyMetalPatriot 3 points 23 hours ago My immigration policy deports Democrat voters. permalink parent award report block reply ForgottenUsername 1 points 22 hours ago It's curious that Hollywood would do that when in their own country they blow them off the face of the earth permalink parent award report block reply\nKungPaoMcChicken 7 points 23 hours ago My immigration policy is to stop Hollywood from presenting Muslims as 100% peaceful and victims in any form of media. permalink parent award report block reply HeavyMetalPatriot 3 points 23 hours ago My immigration policy deports Democrat voters. permalink parent award report block reply ForgottenUsername 1 points 22 hours ago It's curious that Hollywood would do that when in their own country they blow them off the face of the earth permalink parent award report block reply\nHeavyMetalPatriot 3 points 23 hours ago My immigration policy deports Democrat voters. permalink parent award report block reply\nForgottenUsername 1 points 22 hours ago It's curious that Hollywood would do that when in their own country they blow them off the face of the earth permalink parent award report block reply\nwharfthrowaway 13 points 24 hours ago My immigration policy is deporting all non-citizens and anyone who has voted Democrat since 2020 permalink award report block reply empiretc 7 points 24 hours ago 2008 permalink parent award report block reply starjello 9 points 24 hours ago 1912 permalink parent award report block reply LokiHelmsdeep 5 points 24 hours ago It is extremely hard to believe that roughly HALF of voting Americans vote Democrat, not a good sign for the future of our Country but with Trump as POTUS now and what he's done/is doing, I'm the most optimistic about America's near, mid-term and long-term future as I've ever been, by a lot. permalink parent award report block reply covok48 3 points 22 hours ago It’s “better” than it has been. In the past that half was practically normal White Americans and some blacks. That has been replaced by all the minorities, fags, illegals, feminists, trans, and dye-in-the-wool communists. permalink parent award report block reply Hunter77 2 points 22 hours ago There are still a ton of whites voting Dem too, especially in cities. Not just major cities, either. permalink parent award report block reply Hunter77 2 points 22 hours ago I know an awful lot of Dem voting whites. There are entire neighborhoods of such around here. I don't think it's all fraud. permalink parent award report block reply SimaYi 2 points 18 hours ago White people vote Republican majority overall, 60-40. Non-White is 80-20. White people are not your problem. This is why they open the border and oppose ICE. They want to replace you. Get out of your bubble. permalink parent award report block reply Hunter77 1 points 16 hours ago 40% of whites - and I think it's more than that - is still a fucking large number. Allied with non-whites it's an even bigger number. I have yet to see a serious plan for dealing with half a country opposing us, not even accounting for all the RINO voters and MAGA people who condemn 2/3 of our options. permalink parent award report block reply view 1 more comments... MediaBro 1 points 22 hours ago It's not permalink parent award report block reply KekistaniMemeLord 1 points 19 hours ago no one ever said it was ALL fraud. I would be generous and say lefty voters make like 40 percent of the population max with illegals/VISA holders/ Fraud making up the difference. permalink parent award report block reply view 2 more comments... SimaYi 2 points 19 hours ago It is extremely hard to believe that roughly HALF of voting Americans vote Democrat How is this hard to believe? Only half the country is White. Jews love to show you pictures of White women and say they are the Democrat power base. They aren't in the slightest. It's the literal millions of non-Whites who ONLY vote Democrat. This is why they open the borders. The Democrat Party is the Anti-White Party. When arguing with a White Leftist, it's always about economics or some bullshit. When arguing with a non-White, it's about race every time. You live in a multi-racial democracy, and all politics are identity politics. permalink parent award report block reply ForgottenUsername 1 points 22 hours ago It's actually not that concerning.   Young people always vote that way until they mature.  And the trend is changing where while they still mostly support the left the right is gaining support.  And because of birth rates there are far more older people than young people.  But that gets countered by boomers who don't have the Internet and still believe the MSM. permalink parent award report block reply WilliverTwo 1 points 20 hours ago I never went through a liberal phase as a kid let alone voting Democrat and I was born in 1990. And I grew up in the suburbs of Minneapolis in a single-mom household. I was a month shy of being 18 years old on election day 2008, but I think I would not have voted if it were held after my birthday or if I was born sooner to be 18 years old then. Even without internet access to show me alternative viewpoints, it was pretty obvious to me that Fox News was controlled-opposition \"conservativism\" even when I was a 16 year old kid in the Year 2007, again at the time I had very little to know access to like web forms or spending a lot of time with the internet at home it was mostly public library access. I didn't have many friends growing up and couldn't relate to most kids my age. permalink parent award report block reply HeavyMetalPatriot 1 points 23 hours ago Except the midterms are in grave danger. https://patriots.win/p/1ARK9l81LF/midterms-are-in-grave-danger-tim/c permalink parent award report block reply ForgottenUsername 2 points 22 hours ago Midterms always suck that's why I'm kind of disappointed Trump isn't going harder now while he has full control.  And Congress and his Supreme Court picks are pretty useless.  Every lower court attempting to instruct should be shot down by the supreme court immediately.  And shouldn't action be taken against these corrupt judges? permalink parent award report block reply SimaYi 2 points 18 hours ago He's failed. He's a 1990s Bill Clinton Democrat at his core. He's not willing to do what needs to be done. permalink parent award report block reply Sparks1017 2 points 23 hours ago EVER permalink parent award report block reply\nempiretc 7 points 24 hours ago 2008 permalink parent award report block reply starjello 9 points 24 hours ago 1912 permalink parent award report block reply\nstarjello 9 points 24 hours ago 1912 permalink parent award report block reply\nLokiHelmsdeep 5 points 24 hours ago It is extremely hard to believe that roughly HALF of voting Americans vote Democrat, not a good sign for the future of our Country but with Trump as POTUS now and what he's done/is doing, I'm the most optimistic about America's near, mid-term and long-term future as I've ever been, by a lot. permalink parent award report block reply covok48 3 points 22 hours ago It’s “better” than it has been. In the past that half was practically normal White Americans and some blacks. That has been replaced by all the minorities, fags, illegals, feminists, trans, and dye-in-the-wool communists. permalink parent award report block reply Hunter77 2 points 22 hours ago There are still a ton of whites voting Dem too, especially in cities. Not just major cities, either. permalink parent award report block reply Hunter77 2 points 22 hours ago I know an awful lot of Dem voting whites. There are entire neighborhoods of such around here. I don't think it's all fraud. permalink parent award report block reply SimaYi 2 points 18 hours ago White people vote Republican majority overall, 60-40. Non-White is 80-20. White people are not your problem. This is why they open the border and oppose ICE. They want to replace you. Get out of your bubble. permalink parent award report block reply Hunter77 1 points 16 hours ago 40% of whites - and I think it's more than that - is still a fucking large number. Allied with non-whites it's an even bigger number. I have yet to see a serious plan for dealing with half a country opposing us, not even accounting for all the RINO voters and MAGA people who condemn 2/3 of our options. permalink parent award report block reply view 1 more comments... MediaBro 1 points 22 hours ago It's not permalink parent award report block reply KekistaniMemeLord 1 points 19 hours ago no one ever said it was ALL fraud. I would be generous and say lefty voters make like 40 percent of the population max with illegals/VISA holders/ Fraud making up the difference. permalink parent award report block reply view 2 more comments... SimaYi 2 points 19 hours ago It is extremely hard to believe that roughly HALF of voting Americans vote Democrat How is this hard to believe? Only half the country is White. Jews love to show you pictures of White women and say they are the Democrat power base. They aren't in the slightest. It's the literal millions of non-Whites who ONLY vote Democrat. This is why they open the borders. The Democrat Party is the Anti-White Party. When arguing with a White Leftist, it's always about economics or some bullshit. When arguing with a non-White, it's about race every time. You live in a multi-racial democracy, and all politics are identity politics. permalink parent award report block reply ForgottenUsername 1 points 22 hours ago It's actually not that concerning.   Young people always vote that way until they mature.  And the trend is changing where while they still mostly support the left the right is gaining support.  And because of birth rates there are far more older people than young people.  But that gets countered by boomers who don't have the Internet and still believe the MSM. permalink parent award report block reply WilliverTwo 1 points 20 hours ago I never went through a liberal phase as a kid let alone voting Democrat and I was born in 1990. And I grew up in the suburbs of Minneapolis in a single-mom household. I was a month shy of being 18 years old on election day 2008, but I think I would not have voted if it were held after my birthday or if I was born sooner to be 18 years old then. Even without internet access to show me alternative viewpoints, it was pretty obvious to me that Fox News was controlled-opposition \"conservativism\" even when I was a 16 year old kid in the Year 2007, again at the time I had very little to know access to like web forms or spending a lot of time with the internet at home it was mostly public library access. I didn't have many friends growing up and couldn't relate to most kids my age. permalink parent award report block reply HeavyMetalPatriot 1 points 23 hours ago Except the midterms are in grave danger. https://patriots.win/p/1ARK9l81LF/midterms-are-in-grave-danger-tim/c permalink parent award report block reply ForgottenUsername 2 points 22 hours ago Midterms always suck that's why I'm kind of disappointed Trump isn't going harder now while he has full control.  And Congress and his Supreme Court picks are pretty useless.  Every lower court attempting to instruct should be shot down by the supreme court immediately.  And shouldn't action be taken against these corrupt judges? permalink parent award report block reply SimaYi 2 points 18 hours ago He's failed. He's a 1990s Bill Clinton Democrat at his core. He's not willing to do what needs to be done. permalink parent award report block reply\ncovok48 3 points 22 hours ago It’s “better” than it has been. In the past that half was practically normal White Americans and some blacks. That has been replaced by all the minorities, fags, illegals, feminists, trans, and dye-in-the-wool communists. permalink parent award report block reply Hunter77 2 points 22 hours ago There are still a ton of whites voting Dem too, especially in cities. Not just major cities, either. permalink parent award report block reply\nHunter77 2 points 22 hours ago There are still a ton of whites voting Dem too, especially in cities. Not just major cities, either. permalink parent award report block reply\nHunter77 2 points 22 hours ago I know an awful lot of Dem voting whites. There are entire neighborhoods of such around here. I don't think it's all fraud. permalink parent award report block reply SimaYi 2 points 18 hours ago White people vote Republican majority overall, 60-40. Non-White is 80-20. White people are not your problem. This is why they open the border and oppose ICE. They want to replace you. Get out of your bubble. permalink parent award report block reply Hunter77 1 points 16 hours ago 40% of whites - and I think it's more than that - is still a fucking large number. Allied with non-whites it's an even bigger number. I have yet to see a serious plan for dealing with half a country opposing us, not even accounting for all the RINO voters and MAGA people who condemn 2/3 of our options. permalink parent award report block reply view 1 more comments... MediaBro 1 points 22 hours ago It's not permalink parent award report block reply KekistaniMemeLord 1 points 19 hours ago no one ever said it was ALL fraud. I would be generous and say lefty voters make like 40 percent of the population max with illegals/VISA holders/ Fraud making up the difference. permalink parent award report block reply view 2 more comments...\nSimaYi 2 points 18 hours ago White people vote Republican majority overall, 60-40. Non-White is 80-20. White people are not your problem. This is why they open the border and oppose ICE. They want to replace you. Get out of your bubble. permalink parent award report block reply Hunter77 1 points 16 hours ago 40% of whites - and I think it's more than that - is still a fucking large number. Allied with non-whites it's an even bigger number. I have yet to see a serious plan for dealing with half a country opposing us, not even accounting for all the RINO voters and MAGA people who condemn 2/3 of our options. permalink parent award report block reply view 1 more comments...\nHunter77 1 points 16 hours ago 40% of whites - and I think it's more than that - is still a fucking large number. Allied with non-whites it's an even bigger number. I have yet to see a serious plan for dealing with half a country opposing us, not even accounting for all the RINO voters and MAGA people who condemn 2/3 of our options. permalink parent award report block reply view 1 more comments...\nMediaBro 1 points 22 hours ago It's not permalink parent award report block reply KekistaniMemeLord 1 points 19 hours ago no one ever said it was ALL fraud. I would be generous and say lefty voters make like 40 percent of the population max with illegals/VISA holders/ Fraud making up the difference. permalink parent award report block reply view 2 more comments...\nKekistaniMemeLord 1 points 19 hours ago no one ever said it was ALL fraud. I would be generous and say lefty voters make like 40 percent of the population max with illegals/VISA holders/ Fraud making up the difference. permalink parent award report block reply view 2 more comments...\nSimaYi 2 points 19 hours ago It is extremely hard to believe that roughly HALF of voting Americans vote Democrat How is this hard to believe? Only half the country is White. Jews love to show you pictures of White women and say they are the Democrat power base. They aren't in the slightest. It's the literal millions of non-Whites who ONLY vote Democrat. This is why they open the borders. The Democrat Party is the Anti-White Party. When arguing with a White Leftist, it's always about economics or some bullshit. When arguing with a non-White, it's about race every time. You live in a multi-racial democracy, and all politics are identity politics. permalink parent award report block reply\nForgottenUsername 1 points 22 hours ago It's actually not that concerning.   Young people always vote that way until they mature.  And the trend is changing where while they still mostly support the left the right is gaining support.  And because of birth rates there are far more older people than young people.  But that gets countered by boomers who don't have the Internet and still believe the MSM. permalink parent award report block reply WilliverTwo 1 points 20 hours ago I never went through a liberal phase as a kid let alone voting Democrat and I was born in 1990. And I grew up in the suburbs of Minneapolis in a single-mom household. I was a month shy of being 18 years old on election day 2008, but I think I would not have voted if it were held after my birthday or if I was born sooner to be 18 years old then. Even without internet access to show me alternative viewpoints, it was pretty obvious to me that Fox News was controlled-opposition \"conservativism\" even when I was a 16 year old kid in the Year 2007, again at the time I had very little to know access to like web forms or spending a lot of time with the internet at home it was mostly public library access. I didn't have many friends growing up and couldn't relate to most kids my age. permalink parent award report block reply\nWilliverTwo 1 points 20 hours ago I never went through a liberal phase as a kid let alone voting Democrat and I was born in 1990. And I grew up in the suburbs of Minneapolis in a single-mom household. I was a month shy of being 18 years old on election day 2008, but I think I would not have voted if it were held after my birthday or if I was born sooner to be 18 years old then. Even without internet access to show me alternative viewpoints, it was pretty obvious to me that Fox News was controlled-opposition \"conservativism\" even when I was a 16 year old kid in the Year 2007, again at the time I had very little to know access to like web forms or spending a lot of time with the internet at home it was mostly public library access. I didn't have many friends growing up and couldn't relate to most kids my age. permalink parent award report block reply\nHeavyMetalPatriot 1 points 23 hours ago Except the midterms are in grave danger. https://patriots.win/p/1ARK9l81LF/midterms-are-in-grave-danger-tim/c permalink parent award report block reply ForgottenUsername 2 points 22 hours ago Midterms always suck that's why I'm kind of disappointed Trump isn't going harder now while he has full control.  And Congress and his Supreme Court picks are pretty useless.  Every lower court attempting to instruct should be shot down by the supreme court immediately.  And shouldn't action be taken against these corrupt judges? permalink parent award report block reply SimaYi 2 points 18 hours ago He's failed. He's a 1990s Bill Clinton Democrat at his core. He's not willing to do what needs to be done. permalink parent award report block reply\nForgottenUsername 2 points 22 hours ago Midterms always suck that's why I'm kind of disappointed Trump isn't going harder now while he has full control.  And Congress and his Supreme Court picks are pretty useless.  Every lower court attempting to instruct should be shot down by the supreme court immediately.  And shouldn't action be taken against these corrupt judges? permalink parent award report block reply SimaYi 2 points 18 hours ago He's failed. He's a 1990s Bill Clinton Democrat at his core. He's not willing to do what needs to be done. permalink parent award report block reply\nSimaYi 2 points 18 hours ago He's failed. He's a 1990s Bill Clinton Democrat at his core. He's not willing to do what needs to be done. permalink parent award report block reply\nSparks1017 2 points 23 hours ago EVER permalink parent award report block reply\nprojectarcturus1 10 points 24 hours ago Yes. They all have to go back to their own countries. They turn whatever country they go to, into the same shithole they left. permalink award report block reply\nViewer01 9 points 24 hours ago The Zionist boomers are fucking clueless what is going on with Gen z right now. Keep on cancelling young folks and anyone critical of Israel and see where that gets us in ‘28. It’s truly bizarre to watch them hate their grand kids this much and throw open the doors for anyone and everyone to come in and get priority. permalink award report block reply LokiHelmsdeep -10 points 24 hours ago Just STFU up already with the Jew shit, y'all faggots ass Nick Fuentes-type losers are nothing's and will never be anything.   Well, tbf some of yall will realize how retarded your worldview is and change, but either way you're Social Media click-rage \"Jews control everything\" nonsence is staright up garbage and has already been fading fast.   I compare it to Flat Earthers and Qannons, same type bullshit. permalink parent award report block reply Viewer01 4 points 23 hours ago …. That’s how they describe themselves? Anyways, when war with Iran breaks out I’m sure you’ll be first in line to die defending gay sex and Israel, right? permalink parent award report block reply flashersenpai 1 points 15 hours ago wtf you are such a god damn moron you left out trans rights you have to die for those too gosh permalink parent award report block reply ICheckThings 3 points 22 hours ago TKD permalink parent award report block reply SimaYi 3 points 18 hours ago Just STFU up already with the Jew shit No. permalink parent award report block reply flashersenpai 1 points 15 hours ago yeeeeeeeee permalink parent award report block reply Major_Nutt 1 points 23 hours ago Piss off Zionist. permalink parent award report block reply flashersenpai 1 points 15 hours ago and has already been fading fast the only thing fading fast is the collective pulse rate of the boomercon zionists permalink parent award report block reply\nLokiHelmsdeep -10 points 24 hours ago Just STFU up already with the Jew shit, y'all faggots ass Nick Fuentes-type losers are nothing's and will never be anything.   Well, tbf some of yall will realize how retarded your worldview is and change, but either way you're Social Media click-rage \"Jews control everything\" nonsence is staright up garbage and has already been fading fast.   I compare it to Flat Earthers and Qannons, same type bullshit. permalink parent award report block reply Viewer01 4 points 23 hours ago …. That’s how they describe themselves? Anyways, when war with Iran breaks out I’m sure you’ll be first in line to die defending gay sex and Israel, right? permalink parent award report block reply flashersenpai 1 points 15 hours ago wtf you are such a god damn moron you left out trans rights you have to die for those too gosh permalink parent award report block reply ICheckThings 3 points 22 hours ago TKD permalink parent award report block reply SimaYi 3 points 18 hours ago Just STFU up already with the Jew shit No. permalink parent award report block reply flashersenpai 1 points 15 hours ago yeeeeeeeee permalink parent award report block reply Major_Nutt 1 points 23 hours ago Piss off Zionist. permalink parent award report block reply flashersenpai 1 points 15 hours ago and has already been fading fast the only thing fading fast is the collective pulse rate of the boomercon zionists permalink parent award report block reply\nViewer01 4 points 23 hours ago …. That’s how they describe themselves? Anyways, when war with Iran breaks out I’m sure you’ll be first in line to die defending gay sex and Israel, right? permalink parent award report block reply flashersenpai 1 points 15 hours ago wtf you are such a god damn moron you left out trans rights you have to die for those too gosh permalink parent award report block reply\nflashersenpai 1 points 15 hours ago wtf you are such a god damn moron you left out trans rights you have to die for those too gosh permalink parent award report block reply\nICheckThings 3 points 22 hours ago TKD permalink parent award report block reply\nSimaYi 3 points 18 hours ago Just STFU up already with the Jew shit No. permalink parent award report block reply flashersenpai 1 points 15 hours ago yeeeeeeeee permalink parent award report block reply\nflashersenpai 1 points 15 hours ago yeeeeeeeee permalink parent award report block reply\nMajor_Nutt 1 points 23 hours ago Piss off Zionist. permalink parent award report block reply\nflashersenpai 1 points 15 hours ago and has already been fading fast the only thing fading fast is the collective pulse rate of the boomercon zionists permalink parent award report block reply\nRentFree2020 8 points 24 hours ago There's a third political party that is now immigrants. We have an elephant, a jackass, and now we need to represent them with a pig. Because they fucking hate pigs. permalink award report block reply Philhelm 2 points 23 hours ago I like pigs, and all of the farm animals actually. Fuck Muslims. permalink parent award report block reply\nPhilhelm 2 points 23 hours ago I like pigs, and all of the farm animals actually. Fuck Muslims. permalink parent award report block reply\nMoreGuns 7 points 24 hours ago The U.S easily has 130 - 150 million \"people\" who need a good deporting permalink award report block reply Dman82 1 points 18 hours ago Probably a few more than that sadly permalink parent award report block reply mikejones 1 points 18 hours ago And when deporting doesn't work the other side has a good size army. permalink parent award report block reply\nDman82 1 points 18 hours ago Probably a few more than that sadly permalink parent award report block reply\nmikejones 1 points 18 hours ago And when deporting doesn't work the other side has a good size army. permalink parent award report block reply\nAggrieved03 6 points 24 hours ago My immigration policy would make us a White Christian nation again. permalink award report block reply SimaYi 2 points 18 hours ago The only way that happens is with violence. So, not going to happen. permalink parent award report block reply mikejones 2 points 18 hours ago I was just talking about that tonight at therapy. permalink parent award report block reply\nSimaYi 2 points 18 hours ago The only way that happens is with violence. So, not going to happen. permalink parent award report block reply\nmikejones 2 points 18 hours ago I was just talking about that tonight at therapy. permalink parent award report block reply\nTele_Plus 5 points 23 hours ago The battle against Islam will be a tough one I think because their strategy is to use our own system against us and take over entire cities legally.  It’s insidious because they’ve been doing it in the background for some time now.  How do we stop them?  I think there needs to be some serious restrictions on who can become a  citizen in this country, and who can take public office.  Like in Japan - you can’t just move there.  You need a damn good reason to be there, otherwise after 90 days it’s GTFO. permalink award report block reply mikejones 1 points 18 hours ago The long game is being played and every area is being taken advantage of. It's near impossible to fix cause there's so much dead weight draining the resources non-stop. permalink parent award report block reply\nmikejones 1 points 18 hours ago The long game is being played and every area is being taken advantage of. It's near impossible to fix cause there's so much dead weight draining the resources non-stop. permalink parent award report block reply\nLokiHelmsdeep 5 points 24 hours ago Would be nice to deport 50 or so million illegal immigrants and Leftist's, the stuff dreams are made of!!   Reasonably we could deport 20+ million illegal immigrants over the next few years and put 100,000 or so mentally deranged Leftists into Mental Institutions to get the mental healthcare they so desperately need. permalink award report block reply Ostia 2 points 24 hours ago We haven’t even deported a million yet in over a year. permalink parent award report block reply LokiHelmsdeep -1 points 24 hours ago There have been over a half million deportations and over 2 million self deportations....hold on, let me grab my calculator......that equals well over 2.5 million illegal immigrants deported from America and in less than 10 months since Trump's Inaugurated and less than 9 months of having the teams in place to start deportations. permalink parent award report block reply covok48 4 points 22 hours ago ^ This guy is gearing up for his 50 year mortgage. permalink parent award report block reply Ostia 2 points 23 hours ago Neat grading curve you’ve got there to want to try and count how many people we claim have left on their own. How do you think we calculate that? Do they ask if you’re moving home at the Mexico border? Do you submit a letter to the government? Is there a database? Have we been presented any data to verify that? Nope. No. We have not. No there is not. permalink parent award report block reply SimaYi 1 points 18 hours ago Only 85 million to go. permalink parent award report block reply\nOstia 2 points 24 hours ago We haven’t even deported a million yet in over a year. permalink parent award report block reply LokiHelmsdeep -1 points 24 hours ago There have been over a half million deportations and over 2 million self deportations....hold on, let me grab my calculator......that equals well over 2.5 million illegal immigrants deported from America and in less than 10 months since Trump's Inaugurated and less than 9 months of having the teams in place to start deportations. permalink parent award report block reply covok48 4 points 22 hours ago ^ This guy is gearing up for his 50 year mortgage. permalink parent award report block reply Ostia 2 points 23 hours ago Neat grading curve you’ve got there to want to try and count how many people we claim have left on their own. How do you think we calculate that? Do they ask if you’re moving home at the Mexico border? Do you submit a letter to the government? Is there a database? Have we been presented any data to verify that? Nope. No. We have not. No there is not. permalink parent award report block reply SimaYi 1 points 18 hours ago Only 85 million to go. permalink parent award report block reply\nLokiHelmsdeep -1 points 24 hours ago There have been over a half million deportations and over 2 million self deportations....hold on, let me grab my calculator......that equals well over 2.5 million illegal immigrants deported from America and in less than 10 months since Trump's Inaugurated and less than 9 months of having the teams in place to start deportations. permalink parent award report block reply covok48 4 points 22 hours ago ^ This guy is gearing up for his 50 year mortgage. permalink parent award report block reply Ostia 2 points 23 hours ago Neat grading curve you’ve got there to want to try and count how many people we claim have left on their own. How do you think we calculate that? Do they ask if you’re moving home at the Mexico border? Do you submit a letter to the government? Is there a database? Have we been presented any data to verify that? Nope. No. We have not. No there is not. permalink parent award report block reply SimaYi 1 points 18 hours ago Only 85 million to go. permalink parent award report block reply\ncovok48 4 points 22 hours ago ^ This guy is gearing up for his 50 year mortgage. permalink parent award report block reply\nOstia 2 points 23 hours ago Neat grading curve you’ve got there to want to try and count how many people we claim have left on their own. How do you think we calculate that? Do they ask if you’re moving home at the Mexico border? Do you submit a letter to the government? Is there a database? Have we been presented any data to verify that? Nope. No. We have not. No there is not. permalink parent award report block reply\nSimaYi 1 points 18 hours ago Only 85 million to go. permalink parent award report block reply\nhenri_derelicte 3 points 23 hours ago I have to agree with the latter. It won’t be enough to simply stop the flow of third worlders. We have to send people back who are already here, including some of those who are already citizens permalink award report block reply\nI_Love_45-70_Gov 3 points 23 hours ago My immigration policy is pork. Insane amounts of pork, every fucking day. permalink award report block reply\nHenkZeilstra 3 points 23 hours ago Start with acknowledging who is running the liberal agenda and NGO's permalink award report block reply\nFormerlurker92 3 points 24 hours ago I'm with Logan on this one permalink award report block reply\njonnyuno 2 points 23 hours ago I want these two to have a baby. permalink award report block reply\nAntemalagon 2 points 22 hours ago Yup , muslims should be expelled from the country and banned in perpetuity. permalink award report block reply\nBoughtByBloomberg2 2 points 24 hours ago \"You can't just take away someone's citizenship!!!\" Why not? We gave it to them like it was a formality so why not the other way round? permalink award report block reply\ndr_gonzo 2 points 20 hours ago From 1776 until 1965 our immigration was QUOTA BASED on a per country level, and it strongly favored Europeans. Very few were allowed from other countries. Then in 1965 Teddy Kennedy and the boys got rid of the quotas and made the priority \"re-uniting families\". Combine that with birthright citizenship and you've got an invitation for illegal immigration. And when you throw in the welfare state that was created that same year, we went from inviting the most industrious and adventurous Europeans that simply wanted a free society to prosper, to 3rd worlders that wanted to shit out kids for handouts. You know, sorta like exactly what happened? So why in the fuck isn't anyone suggesting we go back to the QUOTA BASED system that worked so wonderfully for 200 years? permalink award report block reply Oleander 1 points 19 hours ago It would be considered \"racially insensitive\" to prioritize Europeans again. I hate this world that the last few generations created. Common sense and wisdom completely gone, and we're left to deal with the consequences of third worlders, whores, niggrs, and general moral/trust decay everywhere. Fuck everyone who prioritized these out groups over their own people and their own children's futures and safety, all in the name of looking like a \"good person\" (bullshit). permalink parent award report block reply\nOleander 1 points 19 hours ago It would be considered \"racially insensitive\" to prioritize Europeans again. I hate this world that the last few generations created. Common sense and wisdom completely gone, and we're left to deal with the consequences of third worlders, whores, niggrs, and general moral/trust decay everywhere. Fuck everyone who prioritized these out groups over their own people and their own children's futures and safety, all in the name of looking like a \"good person\" (bullshit). permalink parent award report block reply\nTooBright 2 points 23 hours ago Any black that wants reparations should receive repatriation immediately. If they can't respect the fortunate position they're in they should get that reality check immediately. permalink award report block reply\nMySidesGoUp 2 points 20 hours ago To “work” for govt you should be Made in America. Also no dualies… Watch America become GREAT again. permalink award report block reply\nGeneral_Grievance 1 points 18 hours ago Three words: North Sentinel Island. permalink award report block reply\ngreatpumpkin 1 points 21 hours ago I nominate SoG for AG. permalink award report block reply\nchampdog 1 points 20 hours ago I'd be happy with either policy. permalink award report block reply\nNick-Kerr 1 points 18 hours ago My way is whatever policy Martha's Vineyard used permalink award report block reply\nSimaYi 1 points 19 hours ago It's still cute how White people in America still think that this is their country. You could get away with deporting all these foreigners 50 years ago, but the sad fact is that White Americans, ie. Americans (the proof is that I even have to say this), are now just another interest group in the American economic zone. In 10 years, you'll be a minority in your own country, and you'll watch the collapse of the United States in real time as the borders are opened to the entire world, and the treasury is emptied. You WILL see a President AOC. The fall of the West is coming. It is inevitable. permalink award report block reply mikejones 1 points 18 hours ago I do wonder how long it'll take. It'll be 2029 and 50 trillion in debt soon. How long can it go on for. The few deported might clean up the crime in the short term but it's just new territory for those who remain with more kids becoming criminals every year. Then technology will control your whole life. It'll be like living in China. permalink parent award report block reply\nmikejones 1 points 18 hours ago I do wonder how long it'll take. It'll be 2029 and 50 trillion in debt soon. How long can it go on for. The few deported might clean up the crime in the short term but it's just new territory for those who remain with more kids becoming criminals every year. Then technology will control your whole life. It'll be like living in China. permalink parent award report block reply\nWolfebane84 1 points 20 hours ago My immigration policy is European decent only.  Everyone else, out. permalink award report block reply\nf_bastiat 1 points 19 hours ago My immigration policy is basically the same as Logan's with the stipulation that they are deported off a cliff and we send our entire arsenal of nukes to turn every Muslim majority country to glass so we don't have to worry about them coming here ever again. permalink award report block reply\nGuerillaYourDreams 1 points 23 hours ago OUT!!! permalink award report block reply\nMegaboom2025 1 points 19 hours ago Mine is to convict every politician for treason if they have taken money from AIPAC permalink award report block reply\nHelly -2 points 23 hours ago There’s no immigration policy radical enough for you guys. It’s getting a bit silly. I remember when it started like yeah let’s deport the criminals now it’s like oh let’s just denaturalized everybody and send them home. Bunch of retards same behavior that Reddit does. permalink award report block reply henri_derelicte 5 points 22 hours ago I hate to speak in such a hyperbole, but the people that make implementing Trump’s policies impossible are going to make the next Hitler inevitable. permalink parent award report block reply Oleander 1 points 19 hours ago nothing hyperbole about it if you ask me permalink parent award report block reply mikejones 1 points 18 hours ago Our own system being used against us when it's for something good. Plus back in the day 13 states. Now 50 states. And the government expected to help hundreds of millions of people around the world. permalink parent award report block reply SaltyArmyChick 1 points 21 hours ago SYBAU permalink parent award report block reply Prandogolio 1 points 23 hours ago Shut up fag permalink parent award report block reply TooBright 1 points 23 hours ago I want my country back. If that makes me retarded then so fucking be it. permalink parent award report block reply Helly 1 points 18 hours ago No makes you retarded is the same gay collectivist ideology from leftists which is infecting your brain permalink parent award report block reply TooBright 1 points 17 hours ago Name calling is the leftist modus operandi. permalink parent award report block reply flashersenpai 1 points 15 hours ago deporting people who are creating racial cartels in your own country is collectivist k permalink parent award report block reply\nhenri_derelicte 5 points 22 hours ago I hate to speak in such a hyperbole, but the people that make implementing Trump’s policies impossible are going to make the next Hitler inevitable. permalink parent award report block reply Oleander 1 points 19 hours ago nothing hyperbole about it if you ask me permalink parent award report block reply mikejones 1 points 18 hours ago Our own system being used against us when it's for something good. Plus back in the day 13 states. Now 50 states. And the government expected to help hundreds of millions of people around the world. permalink parent award report block reply\nOleander 1 points 19 hours ago nothing hyperbole about it if you ask me permalink parent award report block reply\nmikejones 1 points 18 hours ago Our own system being used against us when it's for something good. Plus back in the day 13 states. Now 50 states. And the government expected to help hundreds of millions of people around the world. permalink parent award report block reply\nSaltyArmyChick 1 points 21 hours ago SYBAU permalink parent award report block reply\nPrandogolio 1 points 23 hours ago Shut up fag permalink parent award report block reply\nTooBright 1 points 23 hours ago I want my country back. If that makes me retarded then so fucking be it. permalink parent award report block reply Helly 1 points 18 hours ago No makes you retarded is the same gay collectivist ideology from leftists which is infecting your brain permalink parent award report block reply TooBright 1 points 17 hours ago Name calling is the leftist modus operandi. permalink parent award report block reply flashersenpai 1 points 15 hours ago deporting people who are creating racial cartels in your own country is collectivist k permalink parent award report block reply\nHelly 1 points 18 hours ago No makes you retarded is the same gay collectivist ideology from leftists which is infecting your brain permalink parent award report block reply TooBright 1 points 17 hours ago Name calling is the leftist modus operandi. permalink parent award report block reply flashersenpai 1 points 15 hours ago deporting people who are creating racial cartels in your own country is collectivist k permalink parent award report block reply\nTooBright 1 points 17 hours ago Name calling is the leftist modus operandi. permalink parent award report block reply\nflashersenpai 1 points 15 hours ago deporting people who are creating racial cartels in your own country is collectivist k permalink parent award report block reply\nXxxRDTPRNxxX 2 points 23 hours ago Comment removed by community moderators. permalink award report block reply"}