{"id": "8183580", "contents": "1737 Katie Hobbs is now being investigated  for bribery, fraud, conspiracy and racketeering. \nThe Chairman of the Joint Legislative Committee has informed Maricopa County's investigator that the Auditor General will assist in the investigation. posted 22 hours ago by Capoditutticapi1 181 comments award share report block 🇺🇸RealRobert🇺🇸 @Real_RobN • 1d Here it is: Katie Hobbs is now being investigated  for bribery, fraud, conspiracy and racketeering. The Chairman of the Joint Legislative Committee has informed Maricopa County's investigator that the Auditor General will assist in the investigation. This comes after The\n181 comments Sort by Top Top New Worst Old Save Ocineaa 136 points 22 hours ago I won't hold my breath. permalink award report block reply shadypollster 51 points 22 hours ago I will, imagine the smell! permalink parent award report block reply RomanCatholicPatriot 15 points 21 hours ago It is a stench of hell, where rotting mackarel carcasses are left to decay in the ancient folds within the birth canal of a wooly mammoth being exposed to the warmth of sunlight in a slowly melting glacier. permalink parent award report block reply crimsonfancy 3 points 17 hours ago ....and stacked up right next to the shithouse door of the mackerel boat.  Chum the rot and even sharks flee the area. permalink parent award report block reply shadypollster 1 points 16 hours ago Do not imagine the smell 😭🤮 permalink parent award report block reply ColonelKlink 4 points 20 hours ago And the beatings. permalink parent award report block reply NotYourMan 22 points 22 hours ago IKR!  Democrats don't go after other democrats because they just keep it under wraps and use the dirt as leverage.  One thing about Kary Lake's law suit was she found lots of evidence of cheating but hey, the judge didn't care about that. permalink parent award report block reply Ostia -14 points 21 hours ago She presented absolutely nothing in court beyond \"we think that this part was done too quickly\" regarding signature verification taking an average of 5 seconds instead of 8. permalink parent award report block reply maverick202 -10 points 20 hours ago Seriously. When will people realize Lake was a flawed candidate? The police union in AZ endorsed Trump for president but they endorsed Gallego for senate in the same election should tell you what was coming. The writing was on the wall. permalink parent award report block reply War_Hamster 33 points 20 hours ago Revisionist electoral history doesn't change the fact that Kari Lake was cheated just as badly as Trump was. permalink parent award report block reply view 1 more comments... That_Which_Lurks 4 points 20 hours ago police union lol You do realize how corrupt the local cops are AZ, yes? permalink parent award report block reply view 1 more comments... Ostia 3 points 20 hours ago The perpetual victim industry is strong with us. permalink parent award report block reply MehNahMehNah 1 points 7 hours ago Just a thought: All candidates are flawed,  some more so than others. They may look good or bad on paper yet they can be decent in action or a disaster. permalink parent award report block reply patrioticwinning3 18 points 22 hours ago 2 more weeks :p permalink parent award report block reply BigMikesChef 13 points 22 hours ago On Pam's desk. permalink parent award report block reply Mitch_WerBell_III 9 points 21 hours ago At Tenagra. permalink parent award report block reply MAGA-Fett 5 points 21 hours ago Top kek permalink parent award report block reply yukondave 3 points 21 hours ago when the walls fell permalink parent award report block reply BigMikesChef 2 points 21 hours ago I meant the one at Pfizer. permalink parent award report block reply yukondave 8 points 21 hours ago Send the angry letter already permalink parent award report block reply nakedjay 2 points 19 hours ago At least 2 more investigations. permalink parent award report block reply CleanUpPhillyTrump24 5 points 20 hours ago When did the Legislature become the Judiciary? Why is law enforcement not part of the equation? Where is the FBI in something this serious and the DOJ? permalink parent award report block reply UncleTrumpsBand 2 points 20 hours ago I did a literal sigh as I read this. Breath expelled. permalink parent award report block reply load 2 more comments... henri_derelicte 87 points 22 hours ago Kari Lake was robbed multiple times. But it’s also worth noting these bribery allegations began back when Biden was still in charge permalink award report block reply Navarroinlegirons 20 points 19 hours ago It started before that. Remember, Hobbs was a nobody Secretary of State, whose only real function is to ensure a well run election. She ran the 2020 debacle in AZ. Her only “success” was stealing an election which got her rewarded with overseeing her own steal against Lake for governor. permalink parent award report block reply MehNahMehNah 2 points 7 hours ago Watch how the race for Georgia's next governor is shaping up. It may be a total shitshow. permalink parent award report block reply MiltonThomasX 1 points 10 hours ago Hobbs meaning = clown.  The circus tent will unravel in Maricopa County. She is a \"Auguste\" clown. Biden is the Tramp. Obama is the \"whiteface\"  learn about the \"clown\" Archetypes.  Meaning of Maricopa. Where it all unravels. https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink parent award report block reply MAGAguitar 54 points 22 hours ago Let the indictments ROLL permalink award report block reply Mr_Rightside 45 points 22 hours ago Katie Hobbs is also being investigated after $339 million \"disappeared\" from the state budget. An Investigation has been launched by Arizona Representatives into $339 Million “disappearing” from the state budget. This comes after Governor Hobbs budget director resigned yesterday. - January 30th, 2025 Source: https://x.com/realAlexKolodin/status/1885057706932818192 permalink parent award report block reply Ostia 18 points 21 hours ago That's not an investigation. That's a letter. permalink parent award report block reply Ikon 11 points 21 hours ago Can it be stern? permalink parent award report block reply Build_Back_Bankrupt 3 points 19 hours ago Yes, but never Howard. permalink parent award report block reply starjello 2 points 17 hours ago Considered a major win around here permalink parent award report block reply DeploraBen 34 points 22 hours ago inb4 \"no intent, no crime\" permalink award report block reply barwhack 24 points 22 hours ago Naw. Just ... nothing happens ... permalink parent award report block reply Strzok 13 points 22 hours ago Yeah this. \"Being investigated\" is the last news we ever hear on hundreds of people committing crimes No closure in any fashion permalink parent award report block reply freebirdie 5 points 21 hours ago It's because our side is so fuck-all stupid that it thinks \"investigated\" and \"charged\" are the same thing. She won't be going to jail anymore than any of the other bad guys we were promised. permalink parent award report block reply KernalMustard 6 points 21 hours ago One thing you dont do is tell someone they are being investigated. permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 7 hours ago ...and shouldn't be brought up at all? permalink parent award report block reply starjello 1 points 17 hours ago Couldn't agree with you more. Although I really don't consider the Q retards from the gay awakening on our side permalink parent award report block reply BeauHD 7 points 21 hours ago She STOLE the elections in AZ, mirroring Gretchen Whitmer. They are worse than Portland. permalink parent award report block reply nakedjay 4 points 19 hours ago \"No competent prosecutor would bring charges\" permalink parent award report block reply brassmule 3 points 21 hours ago No reasonable prosecutor! permalink parent award report block reply chickeninoven 34 points 22 hours ago The original Two More Weeks! permalink award report block reply Patrick_Bateman 7 points 20 hours ago Bro, are you saying you don't trust realrobertn? The word real is literally in his name and his source trustmebro has never been wrong like literally ever. permalink parent award report block reply UncleTrumpsBand 3 points 20 hours ago ™️ permalink parent award report block reply BlackJack1776 22 points 22 hours ago Lemme know when handcuffs are part of the story. Until then, it's all fake and gay. permalink award report block reply Capoditutticapi1 OP 5 points 22 hours ago OK..., I'll have somebody wake you up when it happens... Good luck at the Indian Casino's! permalink parent award report block reply TheJakeFroggy 17 points 22 hours ago Even if this amounted to something and she actually gets consequences, I'll still be fucking mad. We still wouldn't deserve to ever live it down for letting her get away with it for this long. permalink award report block reply YouHadMeAtGaming 9 points 22 hours ago Exactly. Didn’t we already know she was doing illegal shit a long time ago? Like taking money from cartels. How has she been allowed to stay in office. permalink parent award report block reply edxzxz 6 points 22 hours ago You want to be really disgusted? Go look up Alcee Hastings. permalink parent award report block reply YouHadMeAtGaming 4 points 21 hours ago Some days I feel like I can’t be more disgusted than I already have been the last 20 years. But I’m terrified to be proven wrong. permalink parent award report block reply joggin_noggin 3 points 19 hours ago https://www.senate.gov/about/powers-procedures/impeachment/impeachment-hastings.htm The most disgusting thing is that this happened in 1989, and Grassley voted in it. (The Murkowski listed is the father of the cu rre nt Senator). permalink parent award report block reply view 1 more comments... TheJakeFroggy 3 points 21 hours ago I'm at the point where even if (and I mean IF ) the Trump administration were to actually go scorched earth and take down deep staters at large, I would still refuse to celebrate. In fact I'd just scream in frustration about it not having been done yesterday. They obviously won't do it, but even if they do, I don't give a fuck. I feel nothing anymore. I'd still refuse to ever let go of the past, and we still wouldn't deserve to ever live it down for ever letting them destroy our country in the first place. That's not something you can ever mentally let go of even if you stopped it. permalink parent award report block reply MakingArrowsOrange 15 points 22 hours ago \"No reasonable prosecutor would bring such a case.\" permalink award report block reply Capoditutticapi1 OP 7 points 22 hours ago Let's try using an unreasonable Autist SOB to bring the case then... permalink parent award report block reply Build_Back_Bankrupt 2 points 19 hours ago When you hear them say this, it's not an excuse, it's a threat. permalink parent award report block reply Tyscribz 12 points 22 hours ago Finally! She clearly stole the election permalink award report block reply ohwell316 12 points 22 hours ago Certified  it herself permalink parent award report block reply Tyscribz 9 points 22 hours ago \"Conflict of Interest?  Never heard of it. Anyways, I'm in charge now so I can make a deal with the cartels. Good luck everyone else.\" permalink parent award report block reply larrry 11 points 22 hours ago Be a good start how about investigating every cheating democrat that's been elected for the last 25 years, No way either one of our cheating senators were fairly elected permalink award report block reply Capoditutticapi1 OP 7 points 22 hours ago Show me a DemonRat running for a political office and I'll show you a liar, cheater, scumbag, and future white collar career criminal! permalink parent award report block reply ragnarokrobo 6 points 21 hours ago This but also republicans. permalink parent award report block reply crimsonfancy 2 points 16 hours ago I would say \"any\" running for political office...... What person would want the job of politician if not for kickbacks, bribery, criminal immunity? I used to have disdain for highest-level bankers, lawyers, insurance executives...and they're of the same ilk and often aspire to continue their lawless, sociopathic behavior running for office. permalink parent award report block reply _Sully_ 2 points 20 hours ago Did you know that Lyndon Johnson without a shadow of a doubt stole his senate seat? People knew it was a sham but no definitive proof. In 1952 Sam Smithwick, former deputy Sheriff of Jim Wells county, said he had information that would prove it was stolen (LBJ was the senate majority whip by then). He for some reason chose right before he could give that info to hang himself in his prison cell (he was in jail for murder). It didn't really gain steam until 1977 after LBJ's death. Motherfucker was a massive piece of shit. More info if curious: https://en.wikipedia.org/wiki/Box_13_scandal permalink parent award report block reply YT45 1 points 19 hours ago That’s not even the tip of the iceberg of Johnson’s fuckery. permalink parent award report block reply imafarttrustme 1 points 19 hours ago But muh astronaut! Reeeeeeeeees! permalink parent award report block reply MEME-SUPREME 11 points 22 hours ago Good. permalink award report block reply deleted 10 points 21 hours ago Capoditutticapi1 OP 5 points 21 hours ago Username checks out! Nailed it! Federal crimes...\nThe FBI and DOJ prioritize \"fraud for profit\" cases like this, where the goal is extracting funds via deception... permalink parent award report block reply deleted 7 points 21 hours ago Capoditutticapi1 OP 4 points 20 hours ago Hopefully the report data has an archive to match the evidence you saw..., that can be shared, uncovered, or pointed to (where to look) if the FBI and DOJ were interested... permalink parent award report block reply deleted 4 points 20 hours ago view 3 more comments... Ostia -2 points 19 hours ago Trustmebro. permalink parent award report block reply thunderdroid 8 points 19 hours ago This is from June, 2024 and the AZ AG has made no statements since the initial announcement. The only public position on the investigation is that they won't comment on specifics of an active, ongoing investigation. So, hopefully, it's still ongoing but who knows. permalink award report block reply imafarttrustme 3 points 19 hours ago Considering the wrongful AG happens to be best friends with Cartel Katie, she's busy burying evidence while targeting anyone and everyone who voted for Donald Trump. permalink parent award report block reply DrMarcy 1 points 5 hours ago Yes I'm so tired of people treating this like it's brand new information. It's old. Still ongoing but this info is NOT NEW. permalink parent award report block reply NewGoldenAge 8 points 22 hours ago AZ AG is also under investigation for taking 200k from the dems to 'investigate' the 'early electors' (meaning to hunt Trump supporters). But hey! We have voter ID! Doesn't do fuck-all - but yay - we have it! permalink award report block reply tlorsung 8 points 20 hours ago Katie Hobbs is a puppet!   There are dozens more that need Prison time and thousands more supporters need fine and Jail time!   Their Grift needs to end if we are going to have the Greatest country in the world! permalink award report block reply Capoditutticapi1 OP 4 points 20 hours ago Would help if the \"Puppet Handlers\" felt like they were double crossed somehow..., unless they get indicted with her, ...and then whoever gets the first plea deal (turning over substantial evidence against the other for Federal Crimes) WINS! SOMEBODY has to go to jail though... permalink parent award report block reply Opi33 8 points 22 hours ago I'm sure this will amount to literally nothing. permalink award report block reply PatrioticVideo 6 points 22 hours ago It's time to let the duly elected governor, Kari Lake, take over. permalink award report block reply Orlando_Doom -3 points 21 hours ago No thank you. She proved how weak and worthless she was. She doesn't have the spine to be governor and her only experience is in journalism. permalink parent award report block reply KernalMustard 4 points 21 hours ago I learned one thing important in the last 5y. You let your enemies think you given up. That way  they take the heat off you. They clearly wont allow her win political office. What are they afraid of? permalink parent award report block reply throwawayStudent 5 points 22 hours ago No wrong doing! permalink award report block reply iteachfuckinscience 5 points 18 hours ago Kari Lake won Arizona. And then Katie Hobbs took it anyway. permalink award report block reply plateowner2024 5 points 20 hours ago When are they going to investigate payments from Dominion? permalink award report block reply BartzFFV 5 points 22 hours ago Sure she is, and those perp walks in be in another 2 weeks. permalink award report block reply DontTreadOnLego 5 points 22 hours ago Maricrappy county permalink award report block reply Mindcrym 4 points 20 hours ago This cunt should be hanging from an overpass in Tijuana permalink award report block reply Capoditutticapi1 OP 2 points 20 hours ago After being charged and sentenced, between the courthouse and before prison, preferably! permalink parent award report block reply Hikedelics 4 points 18 hours ago This bitch SHOULD have gone to prison for a dozen different things years ago. If accepting bribes from the cartel didn’t put her away, why would taking them from realtors be any different? permalink award report block reply MyNameIsTaxpayer 4 points 20 hours ago Liberalist women are murdering The United States of America. permalink award report block reply awsure 4 points 22 hours ago How about election fraud? permalink award report block reply Capoditutticapi1 OP 2 points 22 hours ago ...included under fraud, probably... permalink parent award report block reply Cuetardian 3 points 21 hours ago It's about damn time for \"Kartel Katie,\" but we'll see if anything actually comes of it. permalink award report block reply Awakened 3 points 18 hours ago Arrest or go fuck yourself. J6ers were already in jail by now. The administration of losers. permalink award report block reply UncleTrumpsBand 3 points 20 hours ago Sigh permalink award report block reply JBlaze056 3 points 21 hours ago The cartel will take care of her one way or another. permalink award report block reply Trump-16-20-24-28-32 3 points 21 hours ago Wait... but I thought it was OK when we do it? --- Kate Hobbs, definitely. permalink award report block reply PoleWatcher 3 points 21 hours ago It's always investigated... it's just dangling a carrot. If it was real it would be an arrest. permalink award report block reply Orlando_Doom 2 points 21 hours ago Exactly. Investigations are just shuffling paper around to make us think they're doing work. Trump was arrested on zero evidence. permalink parent award report block reply MiltonThomasX 3 points 16 hours ago Clown world will unravel where it began. Maricopa County.  Hobbs meaning? = Clown. https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink award report block reply Capoditutticapi1 OP 1 points 16 hours ago Yes... permalink parent award report block reply n0w0y 3 points 21 hours ago To end with no prosecution. They can fill news feeds day after day with investigation announcements and gossip. They couldn’t even fill a days worth of news on actually prosecuting anyone. permalink award report block reply dtrap 2 points 18 hours ago So are we giving that whole election stealing thing a pass? The criminality is exhausting. permalink award report block reply Orlando_Doom 2 points 21 hours ago Arrest her first, investigate after she's behind bars. Republicans are so fucking stupid and worthless. permalink award report block reply Alpha-Kil0 2 points 22 hours ago If they nail this gremlin, Razor's chair spin is going to take him into orbit... permalink award report block reply cyberwar 2 points 22 hours ago lock this cartel puppet up permalink award report block reply Harvestsmiles 2 points 19 hours ago Will she flip, get deleted or just have her paperwork sit on Bondi's desk 🤔 permalink award report block reply SicilianOmega 1 points 17 hours ago There's nothing on Bondi's desk except the make-up she puts on before each TV appearance. permalink parent award report block reply Shitnooo 2 points 16 hours ago Hope Keri Lake sues the crap out of them and wins. permalink award report block reply Siteless_Vagrant 2 points 20 hours ago Bout damned time. permalink award report block reply UltraMagaWA 2 points 21 hours ago Finally permalink award report block reply Brookes 2 points 22 hours ago She’s been getting away with her criminal activities for too long. permalink award report block reply SilentSniper 2 points 21 hours ago ThIS is It GuYs!!! We GOt eM NoW permalink award report block reply MiltonThomasX 2 points 10 hours ago Hobbs meaning = clown. The circus tent will unravel in Maricopa County. She is a \"Auguste\" clown. Biden is the Tramp. Obama is the \"whiteface\" learn about the \"clown\" Archetypes. Meaning of Maricopa. Where it all unravels. https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink award report block reply Wupta PRO 2 points 18 hours ago She’s a total criminal. permalink award report block reply Wehavelawsforareason 2 points 22 hours ago Looks like another indictment that will go no where. I’m tired of this shit permalink award report block reply Capoditutticapi1 OP 0 points 22 hours ago Your crystal ball was \"Made in Chyna!\" permalink parent award report block reply King_Boobus_Toobus 2 points 18 hours ago Shocked I tell you.  Shocked.  To imagine that a woman who stole her own election would also commit other crimes is unthinkable. permalink award report block reply FusionBlack 2 points 22 hours ago The ghost of Tombstone need to rise and ride again. The state has turned into a shit hole. permalink award report block reply Seatacjoe 2 points 21 hours ago Im all about two weeks, but can we at least admit this shit would have been swept under the rug completely had the whore stolen the Presidential election? permalink award report block reply I_Love_45-70_Gov 2 points 20 hours ago She will suck a few tiny knobs and walk away -  No hay problema. permalink award report block reply dres3 2 points 19 hours ago Good luck but it would be funny if it gets Kari Lake 2+ terms. permalink award report block reply Aoikaze2000 2 points 22 hours ago Laches? permalink award report block reply Kolob64 2 points 20 hours ago There have been rumors about this for years.  Interesting if they follow through. permalink award report block reply HunterBidensPC 2 points 20 hours ago Where were all these reporters 5 years ago? James O’K beat you fags to this story and made her spill her drink trying to run away permalink award report block reply Retardloserimsogay 2 points 20 hours ago All these investigations that have started since before I was born all at different times, you'd think every month another person would be going to jail or being fined, but nope... it's almost like they start, and then nothing ever happens. Unless your George Santos of course. permalink award report block reply MiltonThomasX 2 points 20 hours ago She will sing! https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink award report block reply Capoditutticapi1 OP 1 points 19 hours ago Thanks for sharing! permalink parent award report block reply CleanUpPhillyTrump24 2 points 20 hours ago That's great but how about the FBI and DOJ investigate and prosecute Hobbgoblin? permalink award report block reply hairless_ap3 1 points 22 hours ago Should be a slam dunk, right? permalink award report block reply Capoditutticapi1 OP 2 points 22 hours ago Yeah, investigators probably should just STFU and quit posting progress just to be ridiculed..., or... permalink parent award report block reply Treefiddydiddy 1 points 10 hours ago YAY, just 336 more hours to wait permalink award report block reply Liberats 1 points 6 hours ago Yay.\nThings are turning bad for the criminals. permalink award report block reply NewGoldenAge 1 points 22 hours ago If only we had voter ID in AZ. Oh wait we do. FAT FUCKING LOAD OF GOOD ISN'T IT? It's not the mail in ballots, we have voter ID - it's who runs the counting machines. Hobbs did that - oh look she's gov now! It's maaaaaaaagic! permalink award report block reply Orlando_Doom 0 points 21 hours ago And the people of Arizona allowed it to happen. Not a single person died. permalink parent award report block reply NewGoldenAge 2 points 20 hours ago There was quite a dust up actually - that's why the AG started suing everyone in sight who protested. permalink parent award report block reply Cuck-WTF 1 points 21 hours ago Wrist slap? permalink award report block reply BrewSwillis 1 points 21 hours ago Spoiler alert: .................. not gonna happen. permalink award report block reply Schroeder09 1 points 21 hours ago In 8 years maybe they'll have it figured out. permalink award report block reply DefKon1 1 points 21 hours ago 2 more weeks! 🐸👍 permalink award report block reply DrMarcy 1 points 19 hours ago This news is from June of 2024. permalink award report block reply Capoditutticapi1 OP 2 points 18 hours ago The October 2025 budget scandal angle adds a layer, potentially fueling calls for deeper audits (hence the Auditor General reference). Kolodin's Feb 2025 letter might signal renewed legislative pressure. permalink parent award report block reply DrMarcy 2 points 5 hours ago Interesting. permalink parent award report block reply Papa54 1 points 21 hours ago Wasn't this months ago? permalink award report block reply America101 1 points 16 hours ago These guys are always investigated (?) and never will are ever anything happen. They need to get people in office that actually do their job to the fullest. permalink award report block reply UsernameChexOut 1 points 22 hours ago Pam will appear on Fox about it SO HARD!!! permalink award report block reply JoeCubicle 1 points 7 hours ago A ham sandwich can get an investigation. permalink award report block reply Bramage 1 points 20 hours ago Oh no!  An investigation 3 years after this piece SHIT cheated her way to the governorship. permalink award report block reply learntocode 1 points 21 hours ago Gas! Gas! Gas! Gas! permalink award report block reply MAGA-Fett 1 points 21 hours ago Being investigated by “an auditor”?  What a joke. Even an Inspector General would be a joke, this isn’t even that. The FBI needs to investigate. permalink award report block reply SenorTrumper 1 points 18 hours ago FYI https://www.youtube.com/watch?v=9_5kNMX9I_g permalink award report block reply nolefthandshakes 1 points 18 hours ago she will not be arrested. permalink award report block reply Snek_Plissken 1 points 19 hours ago It’s not a real legal investigation so I’m sure she will be found of no wrong doing. permalink award report block reply greatpumpkin 1 points 21 hours ago Two more weeks then? permalink award report block reply I_heart_blastbeats 1 points 12 hours ago If anyone in all the stolen election needs to be hung it's her permalink award report block reply barwhack 1 points 22 hours ago MAN, that was a long 13 days. Just 2 more half-days now. 😮‍💨 permalink award report block reply Capoditutticapi1 OP 2 points 22 hours ago If only we had Columbo on the case, he have it solved in one episode... permalink parent award report block reply barwhack 3 points 21 hours ago I'd like the Equalizer, myself. permalink parent award report block reply x79q3pb 3 points 20 hours ago John Wick, and she just killed his dog... permalink parent award report block reply Capoditutticapi1 OP 2 points 20 hours ago She's probably Russian then too! This will not end well! lol (Interestingly enough I tried to find a Russian connection in Hobbs ancestry for shits n grins, and found deep searches don't have ANY information past her parent's. Known: Katie Hobbs (née Haas), parents Robert & Mary Haas, German-origin surname, Arizona-raised. Unknown publicly: Grandparents and beyond. Doesn't matter but it is odd...) permalink parent award report block reply Scot 1 points 20 hours ago Did they forget she's a democrat and immune to the law? Probably not. permalink award report block reply SevenThunders 1 points 19 hours ago This is very old news.  Who's investigating her?  Certainly not  Pam Bondi.  Arizona should have been turned inside out due to election fraud,  but instead we get nothing.  Cartel Katie will walk. permalink award report block reply Capoditutticapi1 OP 1 points 18 hours ago The October 2025 budget scandal angle adds a layer, potentially fueling calls for deeper audits (hence the Auditor General reference). Kolodin's Feb 2025 letter might signal renewed legislative pressure. permalink parent award report block reply SevenThunders 2 points 18 hours ago I hope you are right,  but I've been a bit discouraged about the shenanigans in Arizona. permalink parent award report block reply nebula72 1 points 18 hours ago Cue up the strongly worded letter. permalink award report block reply thechill 1 points 7 hours ago \"Investigated\" is another word for bullshit permalink award report block reply Alldayeveryday 0 points 21 hours ago 🥱😴 permalink award report block reply RizzlieDoodad 0 points 19 hours ago Ooo a nothingburger permalink award report block reply AwShitHereWeGoAgain 0 points 21 hours ago I've seen this one before.  Nothing will happen. permalink award report block reply jdemarco2014 -1 points 22 hours ago We have a better chance of seeing Hitler revived then seeing a democrat charged with a crime permalink award report block reply Capoditutticapi1 OP 2 points 21 hours ago Can I bet against you on a gambling website with real money..., please! Former Rep. Marvin Pendarvis (SC) Indicted Nov. 5, 2025 (10 counts: wire fraud, identity theft, money laundering); initial appearance Nov. 18, 2025 Rep. Henry Cuellar (TX) Indicted 2024; 2 counts dismissed Aug. 2025; pretrial ongoing... Milwaukee Judge Hannah Dugan (WI) Indicted May 2025; motion to dismiss denied Aug. 2025; new evidence filed Nov. 7, 2025 NY AG Letitia James (NY) Indicted Oct. 9, 2025; not guilty plea Oct. 24; motion to dismiss hearing Dec. 5, 2025, when motion fails the trial begins January 26, 2026 New Orleans Mayor LaToya Cantrell (LA) Indicted Aug. 15, 2025 (superseding: 11 counts wire fraud/obstruction); not guilty plea Sept. 12, trial date June 2026 Rep. LaMonica McIver (NJ) Indicted June 2025; suppression hearing Dec. 2025\nTrial date March 2026 (if proceeds) NYC Comptroller Brad Lander (NY) Indicted June 2025; motion to dismiss ruling Dec. 2025, June 2026 trial if denied. Newark Mayor Ras Baraka (NJ) Arrested May 2025; charges filed June; dismissal motion pending, Trial date TBD 2026 ALL Democrats... Odds are favorable at least one gets charged with a crime and goes to prison... Nope, it won't be in 2 weeks or 2 months, definitely 2026! The gears of justice grind slower then we like for sure... permalink parent award report block reply Ralphusthegreatus 1 points 22 hours ago Comment removed by community moderators. permalink award report block reply\nOcineaa 136 points 22 hours ago I won't hold my breath. permalink award report block reply shadypollster 51 points 22 hours ago I will, imagine the smell! permalink parent award report block reply RomanCatholicPatriot 15 points 21 hours ago It is a stench of hell, where rotting mackarel carcasses are left to decay in the ancient folds within the birth canal of a wooly mammoth being exposed to the warmth of sunlight in a slowly melting glacier. permalink parent award report block reply crimsonfancy 3 points 17 hours ago ....and stacked up right next to the shithouse door of the mackerel boat.  Chum the rot and even sharks flee the area. permalink parent award report block reply shadypollster 1 points 16 hours ago Do not imagine the smell 😭🤮 permalink parent award report block reply ColonelKlink 4 points 20 hours ago And the beatings. permalink parent award report block reply NotYourMan 22 points 22 hours ago IKR!  Democrats don't go after other democrats because they just keep it under wraps and use the dirt as leverage.  One thing about Kary Lake's law suit was she found lots of evidence of cheating but hey, the judge didn't care about that. permalink parent award report block reply Ostia -14 points 21 hours ago She presented absolutely nothing in court beyond \"we think that this part was done too quickly\" regarding signature verification taking an average of 5 seconds instead of 8. permalink parent award report block reply maverick202 -10 points 20 hours ago Seriously. When will people realize Lake was a flawed candidate? The police union in AZ endorsed Trump for president but they endorsed Gallego for senate in the same election should tell you what was coming. The writing was on the wall. permalink parent award report block reply War_Hamster 33 points 20 hours ago Revisionist electoral history doesn't change the fact that Kari Lake was cheated just as badly as Trump was. permalink parent award report block reply view 1 more comments... That_Which_Lurks 4 points 20 hours ago police union lol You do realize how corrupt the local cops are AZ, yes? permalink parent award report block reply view 1 more comments... Ostia 3 points 20 hours ago The perpetual victim industry is strong with us. permalink parent award report block reply MehNahMehNah 1 points 7 hours ago Just a thought: All candidates are flawed,  some more so than others. They may look good or bad on paper yet they can be decent in action or a disaster. permalink parent award report block reply patrioticwinning3 18 points 22 hours ago 2 more weeks :p permalink parent award report block reply BigMikesChef 13 points 22 hours ago On Pam's desk. permalink parent award report block reply Mitch_WerBell_III 9 points 21 hours ago At Tenagra. permalink parent award report block reply MAGA-Fett 5 points 21 hours ago Top kek permalink parent award report block reply yukondave 3 points 21 hours ago when the walls fell permalink parent award report block reply BigMikesChef 2 points 21 hours ago I meant the one at Pfizer. permalink parent award report block reply yukondave 8 points 21 hours ago Send the angry letter already permalink parent award report block reply nakedjay 2 points 19 hours ago At least 2 more investigations. permalink parent award report block reply CleanUpPhillyTrump24 5 points 20 hours ago When did the Legislature become the Judiciary? Why is law enforcement not part of the equation? Where is the FBI in something this serious and the DOJ? permalink parent award report block reply UncleTrumpsBand 2 points 20 hours ago I did a literal sigh as I read this. Breath expelled. permalink parent award report block reply load 2 more comments...\nshadypollster 51 points 22 hours ago I will, imagine the smell! permalink parent award report block reply RomanCatholicPatriot 15 points 21 hours ago It is a stench of hell, where rotting mackarel carcasses are left to decay in the ancient folds within the birth canal of a wooly mammoth being exposed to the warmth of sunlight in a slowly melting glacier. permalink parent award report block reply crimsonfancy 3 points 17 hours ago ....and stacked up right next to the shithouse door of the mackerel boat.  Chum the rot and even sharks flee the area. permalink parent award report block reply shadypollster 1 points 16 hours ago Do not imagine the smell 😭🤮 permalink parent award report block reply ColonelKlink 4 points 20 hours ago And the beatings. permalink parent award report block reply\nRomanCatholicPatriot 15 points 21 hours ago It is a stench of hell, where rotting mackarel carcasses are left to decay in the ancient folds within the birth canal of a wooly mammoth being exposed to the warmth of sunlight in a slowly melting glacier. permalink parent award report block reply crimsonfancy 3 points 17 hours ago ....and stacked up right next to the shithouse door of the mackerel boat.  Chum the rot and even sharks flee the area. permalink parent award report block reply shadypollster 1 points 16 hours ago Do not imagine the smell 😭🤮 permalink parent award report block reply\ncrimsonfancy 3 points 17 hours ago ....and stacked up right next to the shithouse door of the mackerel boat.  Chum the rot and even sharks flee the area. permalink parent award report block reply shadypollster 1 points 16 hours ago Do not imagine the smell 😭🤮 permalink parent award report block reply\nshadypollster 1 points 16 hours ago Do not imagine the smell 😭🤮 permalink parent award report block reply\nColonelKlink 4 points 20 hours ago And the beatings. permalink parent award report block reply\nNotYourMan 22 points 22 hours ago IKR!  Democrats don't go after other democrats because they just keep it under wraps and use the dirt as leverage.  One thing about Kary Lake's law suit was she found lots of evidence of cheating but hey, the judge didn't care about that. permalink parent award report block reply Ostia -14 points 21 hours ago She presented absolutely nothing in court beyond \"we think that this part was done too quickly\" regarding signature verification taking an average of 5 seconds instead of 8. permalink parent award report block reply maverick202 -10 points 20 hours ago Seriously. When will people realize Lake was a flawed candidate? The police union in AZ endorsed Trump for president but they endorsed Gallego for senate in the same election should tell you what was coming. The writing was on the wall. permalink parent award report block reply War_Hamster 33 points 20 hours ago Revisionist electoral history doesn't change the fact that Kari Lake was cheated just as badly as Trump was. permalink parent award report block reply view 1 more comments... That_Which_Lurks 4 points 20 hours ago police union lol You do realize how corrupt the local cops are AZ, yes? permalink parent award report block reply view 1 more comments... Ostia 3 points 20 hours ago The perpetual victim industry is strong with us. permalink parent award report block reply MehNahMehNah 1 points 7 hours ago Just a thought: All candidates are flawed,  some more so than others. They may look good or bad on paper yet they can be decent in action or a disaster. permalink parent award report block reply\nOstia -14 points 21 hours ago She presented absolutely nothing in court beyond \"we think that this part was done too quickly\" regarding signature verification taking an average of 5 seconds instead of 8. permalink parent award report block reply maverick202 -10 points 20 hours ago Seriously. When will people realize Lake was a flawed candidate? The police union in AZ endorsed Trump for president but they endorsed Gallego for senate in the same election should tell you what was coming. The writing was on the wall. permalink parent award report block reply War_Hamster 33 points 20 hours ago Revisionist electoral history doesn't change the fact that Kari Lake was cheated just as badly as Trump was. permalink parent award report block reply view 1 more comments... That_Which_Lurks 4 points 20 hours ago police union lol You do realize how corrupt the local cops are AZ, yes? permalink parent award report block reply view 1 more comments... Ostia 3 points 20 hours ago The perpetual victim industry is strong with us. permalink parent award report block reply MehNahMehNah 1 points 7 hours ago Just a thought: All candidates are flawed,  some more so than others. They may look good or bad on paper yet they can be decent in action or a disaster. permalink parent award report block reply\nmaverick202 -10 points 20 hours ago Seriously. When will people realize Lake was a flawed candidate? The police union in AZ endorsed Trump for president but they endorsed Gallego for senate in the same election should tell you what was coming. The writing was on the wall. permalink parent award report block reply War_Hamster 33 points 20 hours ago Revisionist electoral history doesn't change the fact that Kari Lake was cheated just as badly as Trump was. permalink parent award report block reply view 1 more comments... That_Which_Lurks 4 points 20 hours ago police union lol You do realize how corrupt the local cops are AZ, yes? permalink parent award report block reply view 1 more comments... Ostia 3 points 20 hours ago The perpetual victim industry is strong with us. permalink parent award report block reply MehNahMehNah 1 points 7 hours ago Just a thought: All candidates are flawed,  some more so than others. They may look good or bad on paper yet they can be decent in action or a disaster. permalink parent award report block reply\nWar_Hamster 33 points 20 hours ago Revisionist electoral history doesn't change the fact that Kari Lake was cheated just as badly as Trump was. permalink parent award report block reply view 1 more comments...\nThat_Which_Lurks 4 points 20 hours ago police union lol You do realize how corrupt the local cops are AZ, yes? permalink parent award report block reply view 1 more comments...\nOstia 3 points 20 hours ago The perpetual victim industry is strong with us. permalink parent award report block reply\nMehNahMehNah 1 points 7 hours ago Just a thought: All candidates are flawed,  some more so than others. They may look good or bad on paper yet they can be decent in action or a disaster. permalink parent award report block reply\npatrioticwinning3 18 points 22 hours ago 2 more weeks :p permalink parent award report block reply BigMikesChef 13 points 22 hours ago On Pam's desk. permalink parent award report block reply Mitch_WerBell_III 9 points 21 hours ago At Tenagra. permalink parent award report block reply MAGA-Fett 5 points 21 hours ago Top kek permalink parent award report block reply yukondave 3 points 21 hours ago when the walls fell permalink parent award report block reply BigMikesChef 2 points 21 hours ago I meant the one at Pfizer. permalink parent award report block reply yukondave 8 points 21 hours ago Send the angry letter already permalink parent award report block reply nakedjay 2 points 19 hours ago At least 2 more investigations. permalink parent award report block reply\nBigMikesChef 13 points 22 hours ago On Pam's desk. permalink parent award report block reply Mitch_WerBell_III 9 points 21 hours ago At Tenagra. permalink parent award report block reply MAGA-Fett 5 points 21 hours ago Top kek permalink parent award report block reply yukondave 3 points 21 hours ago when the walls fell permalink parent award report block reply BigMikesChef 2 points 21 hours ago I meant the one at Pfizer. permalink parent award report block reply\nMitch_WerBell_III 9 points 21 hours ago At Tenagra. permalink parent award report block reply MAGA-Fett 5 points 21 hours ago Top kek permalink parent award report block reply yukondave 3 points 21 hours ago when the walls fell permalink parent award report block reply BigMikesChef 2 points 21 hours ago I meant the one at Pfizer. permalink parent award report block reply\nMAGA-Fett 5 points 21 hours ago Top kek permalink parent award report block reply\nyukondave 3 points 21 hours ago when the walls fell permalink parent award report block reply\nBigMikesChef 2 points 21 hours ago I meant the one at Pfizer. permalink parent award report block reply\nyukondave 8 points 21 hours ago Send the angry letter already permalink parent award report block reply\nnakedjay 2 points 19 hours ago At least 2 more investigations. permalink parent award report block reply\nCleanUpPhillyTrump24 5 points 20 hours ago When did the Legislature become the Judiciary? Why is law enforcement not part of the equation? Where is the FBI in something this serious and the DOJ? permalink parent award report block reply\nUncleTrumpsBand 2 points 20 hours ago I did a literal sigh as I read this. Breath expelled. permalink parent award report block reply\nhenri_derelicte 87 points 22 hours ago Kari Lake was robbed multiple times. But it’s also worth noting these bribery allegations began back when Biden was still in charge permalink award report block reply Navarroinlegirons 20 points 19 hours ago It started before that. Remember, Hobbs was a nobody Secretary of State, whose only real function is to ensure a well run election. She ran the 2020 debacle in AZ. Her only “success” was stealing an election which got her rewarded with overseeing her own steal against Lake for governor. permalink parent award report block reply MehNahMehNah 2 points 7 hours ago Watch how the race for Georgia's next governor is shaping up. It may be a total shitshow. permalink parent award report block reply MiltonThomasX 1 points 10 hours ago Hobbs meaning = clown.  The circus tent will unravel in Maricopa County. She is a \"Auguste\" clown. Biden is the Tramp. Obama is the \"whiteface\"  learn about the \"clown\" Archetypes.  Meaning of Maricopa. Where it all unravels. https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink parent award report block reply\nNavarroinlegirons 20 points 19 hours ago It started before that. Remember, Hobbs was a nobody Secretary of State, whose only real function is to ensure a well run election. She ran the 2020 debacle in AZ. Her only “success” was stealing an election which got her rewarded with overseeing her own steal against Lake for governor. permalink parent award report block reply MehNahMehNah 2 points 7 hours ago Watch how the race for Georgia's next governor is shaping up. It may be a total shitshow. permalink parent award report block reply MiltonThomasX 1 points 10 hours ago Hobbs meaning = clown.  The circus tent will unravel in Maricopa County. She is a \"Auguste\" clown. Biden is the Tramp. Obama is the \"whiteface\"  learn about the \"clown\" Archetypes.  Meaning of Maricopa. Where it all unravels. https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink parent award report block reply\nMehNahMehNah 2 points 7 hours ago Watch how the race for Georgia's next governor is shaping up. It may be a total shitshow. permalink parent award report block reply\nMiltonThomasX 1 points 10 hours ago Hobbs meaning = clown.  The circus tent will unravel in Maricopa County. She is a \"Auguste\" clown. Biden is the Tramp. Obama is the \"whiteface\"  learn about the \"clown\" Archetypes.  Meaning of Maricopa. Where it all unravels. https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink parent award report block reply\nMAGAguitar 54 points 22 hours ago Let the indictments ROLL permalink award report block reply Mr_Rightside 45 points 22 hours ago Katie Hobbs is also being investigated after $339 million \"disappeared\" from the state budget. An Investigation has been launched by Arizona Representatives into $339 Million “disappearing” from the state budget. This comes after Governor Hobbs budget director resigned yesterday. - January 30th, 2025 Source: https://x.com/realAlexKolodin/status/1885057706932818192 permalink parent award report block reply Ostia 18 points 21 hours ago That's not an investigation. That's a letter. permalink parent award report block reply Ikon 11 points 21 hours ago Can it be stern? permalink parent award report block reply Build_Back_Bankrupt 3 points 19 hours ago Yes, but never Howard. permalink parent award report block reply starjello 2 points 17 hours ago Considered a major win around here permalink parent award report block reply\nMr_Rightside 45 points 22 hours ago Katie Hobbs is also being investigated after $339 million \"disappeared\" from the state budget. An Investigation has been launched by Arizona Representatives into $339 Million “disappearing” from the state budget. This comes after Governor Hobbs budget director resigned yesterday. - January 30th, 2025 Source: https://x.com/realAlexKolodin/status/1885057706932818192 permalink parent award report block reply Ostia 18 points 21 hours ago That's not an investigation. That's a letter. permalink parent award report block reply Ikon 11 points 21 hours ago Can it be stern? permalink parent award report block reply Build_Back_Bankrupt 3 points 19 hours ago Yes, but never Howard. permalink parent award report block reply starjello 2 points 17 hours ago Considered a major win around here permalink parent award report block reply\nOstia 18 points 21 hours ago That's not an investigation. That's a letter. permalink parent award report block reply Ikon 11 points 21 hours ago Can it be stern? permalink parent award report block reply Build_Back_Bankrupt 3 points 19 hours ago Yes, but never Howard. permalink parent award report block reply starjello 2 points 17 hours ago Considered a major win around here permalink parent award report block reply\nIkon 11 points 21 hours ago Can it be stern? permalink parent award report block reply Build_Back_Bankrupt 3 points 19 hours ago Yes, but never Howard. permalink parent award report block reply\nBuild_Back_Bankrupt 3 points 19 hours ago Yes, but never Howard. permalink parent award report block reply\nstarjello 2 points 17 hours ago Considered a major win around here permalink parent award report block reply\nDeploraBen 34 points 22 hours ago inb4 \"no intent, no crime\" permalink award report block reply barwhack 24 points 22 hours ago Naw. Just ... nothing happens ... permalink parent award report block reply Strzok 13 points 22 hours ago Yeah this. \"Being investigated\" is the last news we ever hear on hundreds of people committing crimes No closure in any fashion permalink parent award report block reply freebirdie 5 points 21 hours ago It's because our side is so fuck-all stupid that it thinks \"investigated\" and \"charged\" are the same thing. She won't be going to jail anymore than any of the other bad guys we were promised. permalink parent award report block reply KernalMustard 6 points 21 hours ago One thing you dont do is tell someone they are being investigated. permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 7 hours ago ...and shouldn't be brought up at all? permalink parent award report block reply starjello 1 points 17 hours ago Couldn't agree with you more. Although I really don't consider the Q retards from the gay awakening on our side permalink parent award report block reply BeauHD 7 points 21 hours ago She STOLE the elections in AZ, mirroring Gretchen Whitmer. They are worse than Portland. permalink parent award report block reply nakedjay 4 points 19 hours ago \"No competent prosecutor would bring charges\" permalink parent award report block reply brassmule 3 points 21 hours ago No reasonable prosecutor! permalink parent award report block reply\nbarwhack 24 points 22 hours ago Naw. Just ... nothing happens ... permalink parent award report block reply Strzok 13 points 22 hours ago Yeah this. \"Being investigated\" is the last news we ever hear on hundreds of people committing crimes No closure in any fashion permalink parent award report block reply freebirdie 5 points 21 hours ago It's because our side is so fuck-all stupid that it thinks \"investigated\" and \"charged\" are the same thing. She won't be going to jail anymore than any of the other bad guys we were promised. permalink parent award report block reply KernalMustard 6 points 21 hours ago One thing you dont do is tell someone they are being investigated. permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 7 hours ago ...and shouldn't be brought up at all? permalink parent award report block reply starjello 1 points 17 hours ago Couldn't agree with you more. Although I really don't consider the Q retards from the gay awakening on our side permalink parent award report block reply\nStrzok 13 points 22 hours ago Yeah this. \"Being investigated\" is the last news we ever hear on hundreds of people committing crimes No closure in any fashion permalink parent award report block reply freebirdie 5 points 21 hours ago It's because our side is so fuck-all stupid that it thinks \"investigated\" and \"charged\" are the same thing. She won't be going to jail anymore than any of the other bad guys we were promised. permalink parent award report block reply KernalMustard 6 points 21 hours ago One thing you dont do is tell someone they are being investigated. permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 7 hours ago ...and shouldn't be brought up at all? permalink parent award report block reply starjello 1 points 17 hours ago Couldn't agree with you more. Although I really don't consider the Q retards from the gay awakening on our side permalink parent award report block reply\nfreebirdie 5 points 21 hours ago It's because our side is so fuck-all stupid that it thinks \"investigated\" and \"charged\" are the same thing. She won't be going to jail anymore than any of the other bad guys we were promised. permalink parent award report block reply KernalMustard 6 points 21 hours ago One thing you dont do is tell someone they are being investigated. permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 7 hours ago ...and shouldn't be brought up at all? permalink parent award report block reply starjello 1 points 17 hours ago Couldn't agree with you more. Although I really don't consider the Q retards from the gay awakening on our side permalink parent award report block reply\nKernalMustard 6 points 21 hours ago One thing you dont do is tell someone they are being investigated. permalink parent award report block reply view 1 more comments...\nMehNahMehNah 1 points 7 hours ago ...and shouldn't be brought up at all? permalink parent award report block reply\nstarjello 1 points 17 hours ago Couldn't agree with you more. Although I really don't consider the Q retards from the gay awakening on our side permalink parent award report block reply\nBeauHD 7 points 21 hours ago She STOLE the elections in AZ, mirroring Gretchen Whitmer. They are worse than Portland. permalink parent award report block reply\nnakedjay 4 points 19 hours ago \"No competent prosecutor would bring charges\" permalink parent award report block reply\nbrassmule 3 points 21 hours ago No reasonable prosecutor! permalink parent award report block reply\nchickeninoven 34 points 22 hours ago The original Two More Weeks! permalink award report block reply Patrick_Bateman 7 points 20 hours ago Bro, are you saying you don't trust realrobertn? The word real is literally in his name and his source trustmebro has never been wrong like literally ever. permalink parent award report block reply UncleTrumpsBand 3 points 20 hours ago ™️ permalink parent award report block reply\nPatrick_Bateman 7 points 20 hours ago Bro, are you saying you don't trust realrobertn? The word real is literally in his name and his source trustmebro has never been wrong like literally ever. permalink parent award report block reply\nUncleTrumpsBand 3 points 20 hours ago ™️ permalink parent award report block reply\nBlackJack1776 22 points 22 hours ago Lemme know when handcuffs are part of the story. Until then, it's all fake and gay. permalink award report block reply Capoditutticapi1 OP 5 points 22 hours ago OK..., I'll have somebody wake you up when it happens... Good luck at the Indian Casino's! permalink parent award report block reply\nCapoditutticapi1 OP 5 points 22 hours ago OK..., I'll have somebody wake you up when it happens... Good luck at the Indian Casino's! permalink parent award report block reply\nTheJakeFroggy 17 points 22 hours ago Even if this amounted to something and she actually gets consequences, I'll still be fucking mad. We still wouldn't deserve to ever live it down for letting her get away with it for this long. permalink award report block reply YouHadMeAtGaming 9 points 22 hours ago Exactly. Didn’t we already know she was doing illegal shit a long time ago? Like taking money from cartels. How has she been allowed to stay in office. permalink parent award report block reply edxzxz 6 points 22 hours ago You want to be really disgusted? Go look up Alcee Hastings. permalink parent award report block reply YouHadMeAtGaming 4 points 21 hours ago Some days I feel like I can’t be more disgusted than I already have been the last 20 years. But I’m terrified to be proven wrong. permalink parent award report block reply joggin_noggin 3 points 19 hours ago https://www.senate.gov/about/powers-procedures/impeachment/impeachment-hastings.htm The most disgusting thing is that this happened in 1989, and Grassley voted in it. (The Murkowski listed is the father of the cu rre nt Senator). permalink parent award report block reply view 1 more comments... TheJakeFroggy 3 points 21 hours ago I'm at the point where even if (and I mean IF ) the Trump administration were to actually go scorched earth and take down deep staters at large, I would still refuse to celebrate. In fact I'd just scream in frustration about it not having been done yesterday. They obviously won't do it, but even if they do, I don't give a fuck. I feel nothing anymore. I'd still refuse to ever let go of the past, and we still wouldn't deserve to ever live it down for ever letting them destroy our country in the first place. That's not something you can ever mentally let go of even if you stopped it. permalink parent award report block reply\nYouHadMeAtGaming 9 points 22 hours ago Exactly. Didn’t we already know she was doing illegal shit a long time ago? Like taking money from cartels. How has she been allowed to stay in office. permalink parent award report block reply edxzxz 6 points 22 hours ago You want to be really disgusted? Go look up Alcee Hastings. permalink parent award report block reply YouHadMeAtGaming 4 points 21 hours ago Some days I feel like I can’t be more disgusted than I already have been the last 20 years. But I’m terrified to be proven wrong. permalink parent award report block reply joggin_noggin 3 points 19 hours ago https://www.senate.gov/about/powers-procedures/impeachment/impeachment-hastings.htm The most disgusting thing is that this happened in 1989, and Grassley voted in it. (The Murkowski listed is the father of the cu rre nt Senator). permalink parent award report block reply view 1 more comments... TheJakeFroggy 3 points 21 hours ago I'm at the point where even if (and I mean IF ) the Trump administration were to actually go scorched earth and take down deep staters at large, I would still refuse to celebrate. In fact I'd just scream in frustration about it not having been done yesterday. They obviously won't do it, but even if they do, I don't give a fuck. I feel nothing anymore. I'd still refuse to ever let go of the past, and we still wouldn't deserve to ever live it down for ever letting them destroy our country in the first place. That's not something you can ever mentally let go of even if you stopped it. permalink parent award report block reply\nedxzxz 6 points 22 hours ago You want to be really disgusted? Go look up Alcee Hastings. permalink parent award report block reply YouHadMeAtGaming 4 points 21 hours ago Some days I feel like I can’t be more disgusted than I already have been the last 20 years. But I’m terrified to be proven wrong. permalink parent award report block reply joggin_noggin 3 points 19 hours ago https://www.senate.gov/about/powers-procedures/impeachment/impeachment-hastings.htm The most disgusting thing is that this happened in 1989, and Grassley voted in it. (The Murkowski listed is the father of the cu rre nt Senator). permalink parent award report block reply view 1 more comments...\nYouHadMeAtGaming 4 points 21 hours ago Some days I feel like I can’t be more disgusted than I already have been the last 20 years. But I’m terrified to be proven wrong. permalink parent award report block reply joggin_noggin 3 points 19 hours ago https://www.senate.gov/about/powers-procedures/impeachment/impeachment-hastings.htm The most disgusting thing is that this happened in 1989, and Grassley voted in it. (The Murkowski listed is the father of the cu rre nt Senator). permalink parent award report block reply view 1 more comments...\njoggin_noggin 3 points 19 hours ago https://www.senate.gov/about/powers-procedures/impeachment/impeachment-hastings.htm The most disgusting thing is that this happened in 1989, and Grassley voted in it. (The Murkowski listed is the father of the cu rre nt Senator). permalink parent award report block reply view 1 more comments...\nTheJakeFroggy 3 points 21 hours ago I'm at the point where even if (and I mean IF ) the Trump administration were to actually go scorched earth and take down deep staters at large, I would still refuse to celebrate. In fact I'd just scream in frustration about it not having been done yesterday. They obviously won't do it, but even if they do, I don't give a fuck. I feel nothing anymore. I'd still refuse to ever let go of the past, and we still wouldn't deserve to ever live it down for ever letting them destroy our country in the first place. That's not something you can ever mentally let go of even if you stopped it. permalink parent award report block reply\nMakingArrowsOrange 15 points 22 hours ago \"No reasonable prosecutor would bring such a case.\" permalink award report block reply Capoditutticapi1 OP 7 points 22 hours ago Let's try using an unreasonable Autist SOB to bring the case then... permalink parent award report block reply Build_Back_Bankrupt 2 points 19 hours ago When you hear them say this, it's not an excuse, it's a threat. permalink parent award report block reply\nCapoditutticapi1 OP 7 points 22 hours ago Let's try using an unreasonable Autist SOB to bring the case then... permalink parent award report block reply Build_Back_Bankrupt 2 points 19 hours ago When you hear them say this, it's not an excuse, it's a threat. permalink parent award report block reply\nBuild_Back_Bankrupt 2 points 19 hours ago When you hear them say this, it's not an excuse, it's a threat. permalink parent award report block reply\nTyscribz 12 points 22 hours ago Finally! She clearly stole the election permalink award report block reply ohwell316 12 points 22 hours ago Certified  it herself permalink parent award report block reply Tyscribz 9 points 22 hours ago \"Conflict of Interest?  Never heard of it. Anyways, I'm in charge now so I can make a deal with the cartels. Good luck everyone else.\" permalink parent award report block reply\nohwell316 12 points 22 hours ago Certified  it herself permalink parent award report block reply Tyscribz 9 points 22 hours ago \"Conflict of Interest?  Never heard of it. Anyways, I'm in charge now so I can make a deal with the cartels. Good luck everyone else.\" permalink parent award report block reply\nTyscribz 9 points 22 hours ago \"Conflict of Interest?  Never heard of it. Anyways, I'm in charge now so I can make a deal with the cartels. Good luck everyone else.\" permalink parent award report block reply\nlarrry 11 points 22 hours ago Be a good start how about investigating every cheating democrat that's been elected for the last 25 years, No way either one of our cheating senators were fairly elected permalink award report block reply Capoditutticapi1 OP 7 points 22 hours ago Show me a DemonRat running for a political office and I'll show you a liar, cheater, scumbag, and future white collar career criminal! permalink parent award report block reply ragnarokrobo 6 points 21 hours ago This but also republicans. permalink parent award report block reply crimsonfancy 2 points 16 hours ago I would say \"any\" running for political office...... What person would want the job of politician if not for kickbacks, bribery, criminal immunity? I used to have disdain for highest-level bankers, lawyers, insurance executives...and they're of the same ilk and often aspire to continue their lawless, sociopathic behavior running for office. permalink parent award report block reply _Sully_ 2 points 20 hours ago Did you know that Lyndon Johnson without a shadow of a doubt stole his senate seat? People knew it was a sham but no definitive proof. In 1952 Sam Smithwick, former deputy Sheriff of Jim Wells county, said he had information that would prove it was stolen (LBJ was the senate majority whip by then). He for some reason chose right before he could give that info to hang himself in his prison cell (he was in jail for murder). It didn't really gain steam until 1977 after LBJ's death. Motherfucker was a massive piece of shit. More info if curious: https://en.wikipedia.org/wiki/Box_13_scandal permalink parent award report block reply YT45 1 points 19 hours ago That’s not even the tip of the iceberg of Johnson’s fuckery. permalink parent award report block reply imafarttrustme 1 points 19 hours ago But muh astronaut! Reeeeeeeeees! permalink parent award report block reply\nCapoditutticapi1 OP 7 points 22 hours ago Show me a DemonRat running for a political office and I'll show you a liar, cheater, scumbag, and future white collar career criminal! permalink parent award report block reply ragnarokrobo 6 points 21 hours ago This but also republicans. permalink parent award report block reply crimsonfancy 2 points 16 hours ago I would say \"any\" running for political office...... What person would want the job of politician if not for kickbacks, bribery, criminal immunity? I used to have disdain for highest-level bankers, lawyers, insurance executives...and they're of the same ilk and often aspire to continue their lawless, sociopathic behavior running for office. permalink parent award report block reply\nragnarokrobo 6 points 21 hours ago This but also republicans. permalink parent award report block reply\ncrimsonfancy 2 points 16 hours ago I would say \"any\" running for political office...... What person would want the job of politician if not for kickbacks, bribery, criminal immunity? I used to have disdain for highest-level bankers, lawyers, insurance executives...and they're of the same ilk and often aspire to continue their lawless, sociopathic behavior running for office. permalink parent award report block reply\n_Sully_ 2 points 20 hours ago Did you know that Lyndon Johnson without a shadow of a doubt stole his senate seat? People knew it was a sham but no definitive proof. In 1952 Sam Smithwick, former deputy Sheriff of Jim Wells county, said he had information that would prove it was stolen (LBJ was the senate majority whip by then). He for some reason chose right before he could give that info to hang himself in his prison cell (he was in jail for murder). It didn't really gain steam until 1977 after LBJ's death. Motherfucker was a massive piece of shit. More info if curious: https://en.wikipedia.org/wiki/Box_13_scandal permalink parent award report block reply YT45 1 points 19 hours ago That’s not even the tip of the iceberg of Johnson’s fuckery. permalink parent award report block reply\nYT45 1 points 19 hours ago That’s not even the tip of the iceberg of Johnson’s fuckery. permalink parent award report block reply\nimafarttrustme 1 points 19 hours ago But muh astronaut! Reeeeeeeeees! permalink parent award report block reply\nMEME-SUPREME 11 points 22 hours ago Good. permalink award report block reply\ndeleted 10 points 21 hours ago Capoditutticapi1 OP 5 points 21 hours ago Username checks out! Nailed it! Federal crimes...\nThe FBI and DOJ prioritize \"fraud for profit\" cases like this, where the goal is extracting funds via deception... permalink parent award report block reply deleted 7 points 21 hours ago Capoditutticapi1 OP 4 points 20 hours ago Hopefully the report data has an archive to match the evidence you saw..., that can be shared, uncovered, or pointed to (where to look) if the FBI and DOJ were interested... permalink parent award report block reply deleted 4 points 20 hours ago view 3 more comments... Ostia -2 points 19 hours ago Trustmebro. permalink parent award report block reply\nCapoditutticapi1 OP 5 points 21 hours ago Username checks out! Nailed it! Federal crimes...\nThe FBI and DOJ prioritize \"fraud for profit\" cases like this, where the goal is extracting funds via deception... permalink parent award report block reply deleted 7 points 21 hours ago Capoditutticapi1 OP 4 points 20 hours ago Hopefully the report data has an archive to match the evidence you saw..., that can be shared, uncovered, or pointed to (where to look) if the FBI and DOJ were interested... permalink parent award report block reply deleted 4 points 20 hours ago view 3 more comments...\ndeleted 7 points 21 hours ago Capoditutticapi1 OP 4 points 20 hours ago Hopefully the report data has an archive to match the evidence you saw..., that can be shared, uncovered, or pointed to (where to look) if the FBI and DOJ were interested... permalink parent award report block reply deleted 4 points 20 hours ago view 3 more comments...\nCapoditutticapi1 OP 4 points 20 hours ago Hopefully the report data has an archive to match the evidence you saw..., that can be shared, uncovered, or pointed to (where to look) if the FBI and DOJ were interested... permalink parent award report block reply deleted 4 points 20 hours ago view 3 more comments...\ndeleted 4 points 20 hours ago view 3 more comments...\nOstia -2 points 19 hours ago Trustmebro. permalink parent award report block reply\nthunderdroid 8 points 19 hours ago This is from June, 2024 and the AZ AG has made no statements since the initial announcement. The only public position on the investigation is that they won't comment on specifics of an active, ongoing investigation. So, hopefully, it's still ongoing but who knows. permalink award report block reply imafarttrustme 3 points 19 hours ago Considering the wrongful AG happens to be best friends with Cartel Katie, she's busy burying evidence while targeting anyone and everyone who voted for Donald Trump. permalink parent award report block reply DrMarcy 1 points 5 hours ago Yes I'm so tired of people treating this like it's brand new information. It's old. Still ongoing but this info is NOT NEW. permalink parent award report block reply\nimafarttrustme 3 points 19 hours ago Considering the wrongful AG happens to be best friends with Cartel Katie, she's busy burying evidence while targeting anyone and everyone who voted for Donald Trump. permalink parent award report block reply\nDrMarcy 1 points 5 hours ago Yes I'm so tired of people treating this like it's brand new information. It's old. Still ongoing but this info is NOT NEW. permalink parent award report block reply\nNewGoldenAge 8 points 22 hours ago AZ AG is also under investigation for taking 200k from the dems to 'investigate' the 'early electors' (meaning to hunt Trump supporters). But hey! We have voter ID! Doesn't do fuck-all - but yay - we have it! permalink award report block reply\ntlorsung 8 points 20 hours ago Katie Hobbs is a puppet!   There are dozens more that need Prison time and thousands more supporters need fine and Jail time!   Their Grift needs to end if we are going to have the Greatest country in the world! permalink award report block reply Capoditutticapi1 OP 4 points 20 hours ago Would help if the \"Puppet Handlers\" felt like they were double crossed somehow..., unless they get indicted with her, ...and then whoever gets the first plea deal (turning over substantial evidence against the other for Federal Crimes) WINS! SOMEBODY has to go to jail though... permalink parent award report block reply\nCapoditutticapi1 OP 4 points 20 hours ago Would help if the \"Puppet Handlers\" felt like they were double crossed somehow..., unless they get indicted with her, ...and then whoever gets the first plea deal (turning over substantial evidence against the other for Federal Crimes) WINS! SOMEBODY has to go to jail though... permalink parent award report block reply\nOpi33 8 points 22 hours ago I'm sure this will amount to literally nothing. permalink award report block reply\nPatrioticVideo 6 points 22 hours ago It's time to let the duly elected governor, Kari Lake, take over. permalink award report block reply Orlando_Doom -3 points 21 hours ago No thank you. She proved how weak and worthless she was. She doesn't have the spine to be governor and her only experience is in journalism. permalink parent award report block reply KernalMustard 4 points 21 hours ago I learned one thing important in the last 5y. You let your enemies think you given up. That way  they take the heat off you. They clearly wont allow her win political office. What are they afraid of? permalink parent award report block reply\nOrlando_Doom -3 points 21 hours ago No thank you. She proved how weak and worthless she was. She doesn't have the spine to be governor and her only experience is in journalism. permalink parent award report block reply KernalMustard 4 points 21 hours ago I learned one thing important in the last 5y. You let your enemies think you given up. That way  they take the heat off you. They clearly wont allow her win political office. What are they afraid of? permalink parent award report block reply\nKernalMustard 4 points 21 hours ago I learned one thing important in the last 5y. You let your enemies think you given up. That way  they take the heat off you. They clearly wont allow her win political office. What are they afraid of? permalink parent award report block reply\nthrowawayStudent 5 points 22 hours ago No wrong doing! permalink award report block reply\niteachfuckinscience 5 points 18 hours ago Kari Lake won Arizona. And then Katie Hobbs took it anyway. permalink award report block reply\nplateowner2024 5 points 20 hours ago When are they going to investigate payments from Dominion? permalink award report block reply\nBartzFFV 5 points 22 hours ago Sure she is, and those perp walks in be in another 2 weeks. permalink award report block reply\nDontTreadOnLego 5 points 22 hours ago Maricrappy county permalink award report block reply\nMindcrym 4 points 20 hours ago This cunt should be hanging from an overpass in Tijuana permalink award report block reply Capoditutticapi1 OP 2 points 20 hours ago After being charged and sentenced, between the courthouse and before prison, preferably! permalink parent award report block reply\nCapoditutticapi1 OP 2 points 20 hours ago After being charged and sentenced, between the courthouse and before prison, preferably! permalink parent award report block reply\nHikedelics 4 points 18 hours ago This bitch SHOULD have gone to prison for a dozen different things years ago. If accepting bribes from the cartel didn’t put her away, why would taking them from realtors be any different? permalink award report block reply\nMyNameIsTaxpayer 4 points 20 hours ago Liberalist women are murdering The United States of America. permalink award report block reply\nawsure 4 points 22 hours ago How about election fraud? permalink award report block reply Capoditutticapi1 OP 2 points 22 hours ago ...included under fraud, probably... permalink parent award report block reply\nCapoditutticapi1 OP 2 points 22 hours ago ...included under fraud, probably... permalink parent award report block reply\nCuetardian 3 points 21 hours ago It's about damn time for \"Kartel Katie,\" but we'll see if anything actually comes of it. permalink award report block reply\nAwakened 3 points 18 hours ago Arrest or go fuck yourself. J6ers were already in jail by now. The administration of losers. permalink award report block reply\nUncleTrumpsBand 3 points 20 hours ago Sigh permalink award report block reply\nJBlaze056 3 points 21 hours ago The cartel will take care of her one way or another. permalink award report block reply\nTrump-16-20-24-28-32 3 points 21 hours ago Wait... but I thought it was OK when we do it? --- Kate Hobbs, definitely. permalink award report block reply\nPoleWatcher 3 points 21 hours ago It's always investigated... it's just dangling a carrot. If it was real it would be an arrest. permalink award report block reply Orlando_Doom 2 points 21 hours ago Exactly. Investigations are just shuffling paper around to make us think they're doing work. Trump was arrested on zero evidence. permalink parent award report block reply\nOrlando_Doom 2 points 21 hours ago Exactly. Investigations are just shuffling paper around to make us think they're doing work. Trump was arrested on zero evidence. permalink parent award report block reply\nMiltonThomasX 3 points 16 hours ago Clown world will unravel where it began. Maricopa County.  Hobbs meaning? = Clown. https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink award report block reply Capoditutticapi1 OP 1 points 16 hours ago Yes... permalink parent award report block reply\nCapoditutticapi1 OP 1 points 16 hours ago Yes... permalink parent award report block reply\nn0w0y 3 points 21 hours ago To end with no prosecution. They can fill news feeds day after day with investigation announcements and gossip. They couldn’t even fill a days worth of news on actually prosecuting anyone. permalink award report block reply\ndtrap 2 points 18 hours ago So are we giving that whole election stealing thing a pass? The criminality is exhausting. permalink award report block reply\nOrlando_Doom 2 points 21 hours ago Arrest her first, investigate after she's behind bars. Republicans are so fucking stupid and worthless. permalink award report block reply\nAlpha-Kil0 2 points 22 hours ago If they nail this gremlin, Razor's chair spin is going to take him into orbit... permalink award report block reply\ncyberwar 2 points 22 hours ago lock this cartel puppet up permalink award report block reply\nHarvestsmiles 2 points 19 hours ago Will she flip, get deleted or just have her paperwork sit on Bondi's desk 🤔 permalink award report block reply SicilianOmega 1 points 17 hours ago There's nothing on Bondi's desk except the make-up she puts on before each TV appearance. permalink parent award report block reply\nSicilianOmega 1 points 17 hours ago There's nothing on Bondi's desk except the make-up she puts on before each TV appearance. permalink parent award report block reply\nShitnooo 2 points 16 hours ago Hope Keri Lake sues the crap out of them and wins. permalink award report block reply\nSiteless_Vagrant 2 points 20 hours ago Bout damned time. permalink award report block reply\nUltraMagaWA 2 points 21 hours ago Finally permalink award report block reply\nBrookes 2 points 22 hours ago She’s been getting away with her criminal activities for too long. permalink award report block reply\nSilentSniper 2 points 21 hours ago ThIS is It GuYs!!! We GOt eM NoW permalink award report block reply\nMiltonThomasX 2 points 10 hours ago Hobbs meaning = clown. The circus tent will unravel in Maricopa County. She is a \"Auguste\" clown. Biden is the Tramp. Obama is the \"whiteface\" learn about the \"clown\" Archetypes. Meaning of Maricopa. Where it all unravels. https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink award report block reply\nWupta PRO 2 points 18 hours ago She’s a total criminal. permalink award report block reply\nWehavelawsforareason 2 points 22 hours ago Looks like another indictment that will go no where. I’m tired of this shit permalink award report block reply Capoditutticapi1 OP 0 points 22 hours ago Your crystal ball was \"Made in Chyna!\" permalink parent award report block reply\nCapoditutticapi1 OP 0 points 22 hours ago Your crystal ball was \"Made in Chyna!\" permalink parent award report block reply\nKing_Boobus_Toobus 2 points 18 hours ago Shocked I tell you.  Shocked.  To imagine that a woman who stole her own election would also commit other crimes is unthinkable. permalink award report block reply\nFusionBlack 2 points 22 hours ago The ghost of Tombstone need to rise and ride again. The state has turned into a shit hole. permalink award report block reply\nSeatacjoe 2 points 21 hours ago Im all about two weeks, but can we at least admit this shit would have been swept under the rug completely had the whore stolen the Presidential election? permalink award report block reply\nI_Love_45-70_Gov 2 points 20 hours ago She will suck a few tiny knobs and walk away -  No hay problema. permalink award report block reply\ndres3 2 points 19 hours ago Good luck but it would be funny if it gets Kari Lake 2+ terms. permalink award report block reply\nAoikaze2000 2 points 22 hours ago Laches? permalink award report block reply\nKolob64 2 points 20 hours ago There have been rumors about this for years.  Interesting if they follow through. permalink award report block reply\nHunterBidensPC 2 points 20 hours ago Where were all these reporters 5 years ago? James O’K beat you fags to this story and made her spill her drink trying to run away permalink award report block reply\nRetardloserimsogay 2 points 20 hours ago All these investigations that have started since before I was born all at different times, you'd think every month another person would be going to jail or being fined, but nope... it's almost like they start, and then nothing ever happens. Unless your George Santos of course. permalink award report block reply\nMiltonThomasX 2 points 20 hours ago She will sing! https://godtype.substack.com/p/katie-hobbs-the-sad-faced-auguste permalink award report block reply Capoditutticapi1 OP 1 points 19 hours ago Thanks for sharing! permalink parent award report block reply\nCapoditutticapi1 OP 1 points 19 hours ago Thanks for sharing! permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 20 hours ago That's great but how about the FBI and DOJ investigate and prosecute Hobbgoblin? permalink award report block reply\nhairless_ap3 1 points 22 hours ago Should be a slam dunk, right? permalink award report block reply Capoditutticapi1 OP 2 points 22 hours ago Yeah, investigators probably should just STFU and quit posting progress just to be ridiculed..., or... permalink parent award report block reply\nCapoditutticapi1 OP 2 points 22 hours ago Yeah, investigators probably should just STFU and quit posting progress just to be ridiculed..., or... permalink parent award report block reply\nTreefiddydiddy 1 points 10 hours ago YAY, just 336 more hours to wait permalink award report block reply\nLiberats 1 points 6 hours ago Yay.\nThings are turning bad for the criminals. permalink award report block reply\nNewGoldenAge 1 points 22 hours ago If only we had voter ID in AZ. Oh wait we do. FAT FUCKING LOAD OF GOOD ISN'T IT? It's not the mail in ballots, we have voter ID - it's who runs the counting machines. Hobbs did that - oh look she's gov now! It's maaaaaaaagic! permalink award report block reply Orlando_Doom 0 points 21 hours ago And the people of Arizona allowed it to happen. Not a single person died. permalink parent award report block reply NewGoldenAge 2 points 20 hours ago There was quite a dust up actually - that's why the AG started suing everyone in sight who protested. permalink parent award report block reply\nOrlando_Doom 0 points 21 hours ago And the people of Arizona allowed it to happen. Not a single person died. permalink parent award report block reply NewGoldenAge 2 points 20 hours ago There was quite a dust up actually - that's why the AG started suing everyone in sight who protested. permalink parent award report block reply\nNewGoldenAge 2 points 20 hours ago There was quite a dust up actually - that's why the AG started suing everyone in sight who protested. permalink parent award report block reply\nCuck-WTF 1 points 21 hours ago Wrist slap? permalink award report block reply\nBrewSwillis 1 points 21 hours ago Spoiler alert: .................. not gonna happen. permalink award report block reply\nSchroeder09 1 points 21 hours ago In 8 years maybe they'll have it figured out. permalink award report block reply\nDefKon1 1 points 21 hours ago 2 more weeks! 🐸👍 permalink award report block reply\nDrMarcy 1 points 19 hours ago This news is from June of 2024. permalink award report block reply Capoditutticapi1 OP 2 points 18 hours ago The October 2025 budget scandal angle adds a layer, potentially fueling calls for deeper audits (hence the Auditor General reference). Kolodin's Feb 2025 letter might signal renewed legislative pressure. permalink parent award report block reply DrMarcy 2 points 5 hours ago Interesting. permalink parent award report block reply\nCapoditutticapi1 OP 2 points 18 hours ago The October 2025 budget scandal angle adds a layer, potentially fueling calls for deeper audits (hence the Auditor General reference). Kolodin's Feb 2025 letter might signal renewed legislative pressure. permalink parent award report block reply DrMarcy 2 points 5 hours ago Interesting. permalink parent award report block reply\nDrMarcy 2 points 5 hours ago Interesting. permalink parent award report block reply\nPapa54 1 points 21 hours ago Wasn't this months ago? permalink award report block reply\nAmerica101 1 points 16 hours ago These guys are always investigated (?) and never will are ever anything happen. They need to get people in office that actually do their job to the fullest. permalink award report block reply\nUsernameChexOut 1 points 22 hours ago Pam will appear on Fox about it SO HARD!!! permalink award report block reply\nJoeCubicle 1 points 7 hours ago A ham sandwich can get an investigation. permalink award report block reply\nBramage 1 points 20 hours ago Oh no!  An investigation 3 years after this piece SHIT cheated her way to the governorship. permalink award report block reply\nlearntocode 1 points 21 hours ago Gas! Gas! Gas! Gas! permalink award report block reply\nMAGA-Fett 1 points 21 hours ago Being investigated by “an auditor”?  What a joke. Even an Inspector General would be a joke, this isn’t even that. The FBI needs to investigate. permalink award report block reply\nSenorTrumper 1 points 18 hours ago FYI https://www.youtube.com/watch?v=9_5kNMX9I_g permalink award report block reply\nnolefthandshakes 1 points 18 hours ago she will not be arrested. permalink award report block reply\nSnek_Plissken 1 points 19 hours ago It’s not a real legal investigation so I’m sure she will be found of no wrong doing. permalink award report block reply\ngreatpumpkin 1 points 21 hours ago Two more weeks then? permalink award report block reply\nI_heart_blastbeats 1 points 12 hours ago If anyone in all the stolen election needs to be hung it's her permalink award report block reply\nbarwhack 1 points 22 hours ago MAN, that was a long 13 days. Just 2 more half-days now. 😮‍💨 permalink award report block reply Capoditutticapi1 OP 2 points 22 hours ago If only we had Columbo on the case, he have it solved in one episode... permalink parent award report block reply barwhack 3 points 21 hours ago I'd like the Equalizer, myself. permalink parent award report block reply x79q3pb 3 points 20 hours ago John Wick, and she just killed his dog... permalink parent award report block reply Capoditutticapi1 OP 2 points 20 hours ago She's probably Russian then too! This will not end well! lol (Interestingly enough I tried to find a Russian connection in Hobbs ancestry for shits n grins, and found deep searches don't have ANY information past her parent's. Known: Katie Hobbs (née Haas), parents Robert & Mary Haas, German-origin surname, Arizona-raised. Unknown publicly: Grandparents and beyond. Doesn't matter but it is odd...) permalink parent award report block reply\nCapoditutticapi1 OP 2 points 22 hours ago If only we had Columbo on the case, he have it solved in one episode... permalink parent award report block reply barwhack 3 points 21 hours ago I'd like the Equalizer, myself. permalink parent award report block reply x79q3pb 3 points 20 hours ago John Wick, and she just killed his dog... permalink parent award report block reply Capoditutticapi1 OP 2 points 20 hours ago She's probably Russian then too! This will not end well! lol (Interestingly enough I tried to find a Russian connection in Hobbs ancestry for shits n grins, and found deep searches don't have ANY information past her parent's. Known: Katie Hobbs (née Haas), parents Robert & Mary Haas, German-origin surname, Arizona-raised. Unknown publicly: Grandparents and beyond. Doesn't matter but it is odd...) permalink parent award report block reply\nbarwhack 3 points 21 hours ago I'd like the Equalizer, myself. permalink parent award report block reply x79q3pb 3 points 20 hours ago John Wick, and she just killed his dog... permalink parent award report block reply Capoditutticapi1 OP 2 points 20 hours ago She's probably Russian then too! This will not end well! lol (Interestingly enough I tried to find a Russian connection in Hobbs ancestry for shits n grins, and found deep searches don't have ANY information past her parent's. Known: Katie Hobbs (née Haas), parents Robert & Mary Haas, German-origin surname, Arizona-raised. Unknown publicly: Grandparents and beyond. Doesn't matter but it is odd...) permalink parent award report block reply\nx79q3pb 3 points 20 hours ago John Wick, and she just killed his dog... permalink parent award report block reply Capoditutticapi1 OP 2 points 20 hours ago She's probably Russian then too! This will not end well! lol (Interestingly enough I tried to find a Russian connection in Hobbs ancestry for shits n grins, and found deep searches don't have ANY information past her parent's. Known: Katie Hobbs (née Haas), parents Robert & Mary Haas, German-origin surname, Arizona-raised. Unknown publicly: Grandparents and beyond. Doesn't matter but it is odd...) permalink parent award report block reply\nCapoditutticapi1 OP 2 points 20 hours ago She's probably Russian then too! This will not end well! lol (Interestingly enough I tried to find a Russian connection in Hobbs ancestry for shits n grins, and found deep searches don't have ANY information past her parent's. Known: Katie Hobbs (née Haas), parents Robert & Mary Haas, German-origin surname, Arizona-raised. Unknown publicly: Grandparents and beyond. Doesn't matter but it is odd...) permalink parent award report block reply\nScot 1 points 20 hours ago Did they forget she's a democrat and immune to the law? Probably not. permalink award report block reply\nSevenThunders 1 points 19 hours ago This is very old news.  Who's investigating her?  Certainly not  Pam Bondi.  Arizona should have been turned inside out due to election fraud,  but instead we get nothing.  Cartel Katie will walk. permalink award report block reply Capoditutticapi1 OP 1 points 18 hours ago The October 2025 budget scandal angle adds a layer, potentially fueling calls for deeper audits (hence the Auditor General reference). Kolodin's Feb 2025 letter might signal renewed legislative pressure. permalink parent award report block reply SevenThunders 2 points 18 hours ago I hope you are right,  but I've been a bit discouraged about the shenanigans in Arizona. permalink parent award report block reply\nCapoditutticapi1 OP 1 points 18 hours ago The October 2025 budget scandal angle adds a layer, potentially fueling calls for deeper audits (hence the Auditor General reference). Kolodin's Feb 2025 letter might signal renewed legislative pressure. permalink parent award report block reply SevenThunders 2 points 18 hours ago I hope you are right,  but I've been a bit discouraged about the shenanigans in Arizona. permalink parent award report block reply\nSevenThunders 2 points 18 hours ago I hope you are right,  but I've been a bit discouraged about the shenanigans in Arizona. permalink parent award report block reply\nnebula72 1 points 18 hours ago Cue up the strongly worded letter. permalink award report block reply\nthechill 1 points 7 hours ago \"Investigated\" is another word for bullshit permalink award report block reply\nAlldayeveryday 0 points 21 hours ago 🥱😴 permalink award report block reply\nRizzlieDoodad 0 points 19 hours ago Ooo a nothingburger permalink award report block reply\nAwShitHereWeGoAgain 0 points 21 hours ago I've seen this one before.  Nothing will happen. permalink award report block reply\njdemarco2014 -1 points 22 hours ago We have a better chance of seeing Hitler revived then seeing a democrat charged with a crime permalink award report block reply Capoditutticapi1 OP 2 points 21 hours ago Can I bet against you on a gambling website with real money..., please! Former Rep. Marvin Pendarvis (SC) Indicted Nov. 5, 2025 (10 counts: wire fraud, identity theft, money laundering); initial appearance Nov. 18, 2025 Rep. Henry Cuellar (TX) Indicted 2024; 2 counts dismissed Aug. 2025; pretrial ongoing... Milwaukee Judge Hannah Dugan (WI) Indicted May 2025; motion to dismiss denied Aug. 2025; new evidence filed Nov. 7, 2025 NY AG Letitia James (NY) Indicted Oct. 9, 2025; not guilty plea Oct. 24; motion to dismiss hearing Dec. 5, 2025, when motion fails the trial begins January 26, 2026 New Orleans Mayor LaToya Cantrell (LA) Indicted Aug. 15, 2025 (superseding: 11 counts wire fraud/obstruction); not guilty plea Sept. 12, trial date June 2026 Rep. LaMonica McIver (NJ) Indicted June 2025; suppression hearing Dec. 2025\nTrial date March 2026 (if proceeds) NYC Comptroller Brad Lander (NY) Indicted June 2025; motion to dismiss ruling Dec. 2025, June 2026 trial if denied. Newark Mayor Ras Baraka (NJ) Arrested May 2025; charges filed June; dismissal motion pending, Trial date TBD 2026 ALL Democrats... Odds are favorable at least one gets charged with a crime and goes to prison... Nope, it won't be in 2 weeks or 2 months, definitely 2026! The gears of justice grind slower then we like for sure... permalink parent award report block reply\nCapoditutticapi1 OP 2 points 21 hours ago Can I bet against you on a gambling website with real money..., please! Former Rep. Marvin Pendarvis (SC) Indicted Nov. 5, 2025 (10 counts: wire fraud, identity theft, money laundering); initial appearance Nov. 18, 2025 Rep. Henry Cuellar (TX) Indicted 2024; 2 counts dismissed Aug. 2025; pretrial ongoing... Milwaukee Judge Hannah Dugan (WI) Indicted May 2025; motion to dismiss denied Aug. 2025; new evidence filed Nov. 7, 2025 NY AG Letitia James (NY) Indicted Oct. 9, 2025; not guilty plea Oct. 24; motion to dismiss hearing Dec. 5, 2025, when motion fails the trial begins January 26, 2026 New Orleans Mayor LaToya Cantrell (LA) Indicted Aug. 15, 2025 (superseding: 11 counts wire fraud/obstruction); not guilty plea Sept. 12, trial date June 2026 Rep. LaMonica McIver (NJ) Indicted June 2025; suppression hearing Dec. 2025\nTrial date March 2026 (if proceeds) NYC Comptroller Brad Lander (NY) Indicted June 2025; motion to dismiss ruling Dec. 2025, June 2026 trial if denied. Newark Mayor Ras Baraka (NJ) Arrested May 2025; charges filed June; dismissal motion pending, Trial date TBD 2026 ALL Democrats... Odds are favorable at least one gets charged with a crime and goes to prison... Nope, it won't be in 2 weeks or 2 months, definitely 2026! The gears of justice grind slower then we like for sure... permalink parent award report block reply\nRalphusthegreatus 1 points 22 hours ago Comment removed by community moderators. permalink award report block reply"}