{"id": "8183921", "contents": "1344 Justice Department finds the North Carolina DMV has been registering illegals to vote in American elections\n\n“Non-citizens were registered to vote without the person understanding or knowing what had happened” because they don’t speak English posted 19 hours ago by Looniz74 PRO 85 comments award share report block Wall Street Apes @WallStreetApes • 19h Justice Department finds the North Carolina DMV has been registering illegals to vote in American elections “Non-citizens were registered to vote without the person understanding or knowing what had happened” because they don’t speak English “Prosecutors are accusing the\n85 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style BOHICA2021 45 points 19 hours ago remember when Barry set all this up on his way out...I do. permalink award report block reply Quixotic 25 points 19 hours ago motor voter (ACORN) happened waaaay before obongo permalink parent award report block reply God-is-good 1 points 4 hours ago I’m sure they will have been voting without their knowledge too. permalink parent award report block reply RocketSprocket 42 points 19 hours ago Time to crack down or lose our country. permalink award report block reply ImYourHuckleberry24 12 points 19 hours ago Too late permalink parent award report block reply MakeFloridaRed 30 points 19 hours ago Guarantee it’s happening in every state too. permalink parent award report block reply zerk0021 12 points 18 hours ago Guarantee it's happening in California. Several years ago when getting a driver's license, the guy at DMV would absolutely not take No as a reply when asked if I wanted to register to vote. Wonder if he's that determined if someone is wearing a MAGA cap. permalink parent award report block reply goldkeyboardwarrior 1 points 15 hours ago The MAGA cap is his sign to remember their name so that guy’s vote goes into the trash and is replaced by a prefilled ballot with the Dems filled out. permalink parent award report block reply QSWO1 1 points 14 hours ago Texas only requires another state ID to get a Texas DL. Goes back 25 years at least. permalink parent award report block reply tired-of-crap 2 points 8 hours ago Yes, Texas needs to create a list of other states untrusted IDS not to accept. permalink parent award report block reply trm17118 2 points 6 hours ago Last year when I went to renew my Texas drivers license I had to show my birth certificate permalink parent award report block reply Formerlurker92 7 points 18 hours ago You're still breathing. If it can get worse, we can make it better too. If you don't believe that, then at least do something cool when you kill yourself permalink parent award report block reply PROCIsAsshoe 2 points 17 hours ago lol excellent reply. but let's be honest, that account is just a demoralization shill aka faggot. permalink parent award report block reply MasterChief08 28 points 19 hours ago This is treason. Fuck the Republicans if they don't arrest people over this. I won't vote and I won't donate unless I start seeing more arrests. The left is literally trying to murder and replace us. Frankly I would rather see these people put in gulags through extrajudicial means than vote for moderation. Put the left in gulags. permalink award report block reply texas4ever 4 points 19 hours ago Sitting it out punishes conservatives though. permalink parent award report block reply MasterChief08 11 points 18 hours ago If Republicans can't even arrest leftists getting illegal immigrants to vote, wtf am I even supporting? Demographics and secure government are all that ultimately matter. Every other issue can be fixed if those 2 things are secure. Gun rights, abortion restrictions, strong economic output, low taxes - all of those things rely on demographic certainty and secure elections. permalink parent award report block reply texas4ever 1 points 14 hours ago What we have now for all the flaws is a million times better than the alternative, that's what. permalink parent award report block reply LiberalTearsMiner 11 points 19 hours ago Not when they steal the elections using registered voters who are illegal who don’t know they’re registered.  Easy to send in mail in votes for those people. permalink parent award report block reply texas4ever 1 points 14 hours ago So somehow sitting it out is the solution? permalink parent award report block reply tired-of-crap 1 points 8 hours ago And honestly if these people are actually legitimately trying to get citizenship at some point in the future they definitely do not want to be registered to vote. It will be assumed that they did the affirmative act When it comes up. permalink parent award report block reply MakeAmericaGreat9 9 points 19 hours ago Not if the conservative faggots do jack shit... Like they always do. permalink parent award report block reply Jack_NC 19 points 19 hours ago NC is flooded with illegals. Millions and millions. There are counties where >70% of the Kindergarten class speaks no English. permalink award report block reply gaijin_ronin 18 points 19 hours ago All the while my city council and mayor floated the idea recently to make us a sanctuary city.  These traitors deserve nothing less than execution. permalink award report block reply gaijin_ronin 5 points 19 hours ago Also our DMV is understaffed and backlogged.  Most of the DMV is filled with typical government worker trash and probably just push the paper work through like drones. permalink parent award report block reply Klown_Kutz 3 points 9 hours ago Funny how when it’s you and me, these same drones make it their mission in life to deny us a license. permalink parent award report block reply gaijin_ronin 1 points 5 hours ago Yep, just like vote counting errors. permalink parent award report block reply tired-of-crap 2 points 8 hours ago In Florida for the most part we basically got rid of all the state employees that did driver's license functions and replaced them with tax collector employees which I don't know whether that is better or worse.  I do know the tax collector employees are supported only by a service fee added to the amount and not the general tax revenue though. permalink parent award report block reply gaijin_ronin 1 points 5 hours ago In NC years ago we had private contracted DMV offices in addition to state run locations.  The contract ended after claims customer service was awful and for \"cost savings for the state. \" Now there are only a couple offices open and appointments are months out for certain needs. We can renew our DL online but only so many times and for all other cases you need the office.   We really need more locations but that means more state employee leeches. permalink parent award report block reply ThorsonTT 15 points 19 hours ago This is what Motor Voter laws were designed to do.  Register everyone, so unscrupulous SoS' could pass that info off to whomever generates all those Democrat votes that appear out of fat air. permalink award report block reply Deplora 9 points 18 hours ago And designed to register them whether they want to be registered or not.  I had direct knowledge of this happening to a foreign student in Pennsylvania over 25 years ago.  She was perfectly fluent in English, went to get a driver's license, had no intention of registering or voting, and made a point of not checking the \"register to vote\" box on the paper form (this was back when it was still an opt-in process; now the person has to check a box on the computer form to opt out of the voter registration process).  She was shocked when she received her new voter registration card in the mail a short time later.  Also a bit scared, because she was afraid somebody would think she'd registered on purpose, and she knew it was illegal. permalink parent award report block reply LostElf 10 points 19 hours ago Hopefully this will make them easier to find and deport. permalink award report block reply PiratePatriot 6 points 19 hours ago in an age of mobile phones and cash becoming scarce - everyone is using cards to pay - tracking mobile phones and where cards are used makes finding people VERY easy and accurate. permalink parent award report block reply Taliesin 2 points 17 hours ago And make it easier to find the fake ballots being cast in their names. permalink parent award report block reply POTUS_DonnieJ 9 points 18 hours ago So every registration has at least one bureaucrat behind it. How about starting to arrest the ones that were directly responsible for signing off on those applications. In theory the feds can start going after those people personally for being negligent in their duties and issuing licenses in violation of federal law. And because they're negligent, they wouldn't be able to hide behind any state immunity or use the state taxpayer funded employee defense fund. Start making life hell for all of those traitors instead of releasing reports and asking for more investigations. permalink award report block reply tired-of-crap 2 points 8 hours ago I guarantee that nearly everyone of these systems have identifier to show who did the transactions. Once they determine that for 1 person go back and look at all their transactions. permalink parent award report block reply PhantomShield72 9 points 18 hours ago Excuse me, I was told this doesn't happen... permalink award report block reply I_Love_45-70_Gov 5 points 18 hours ago Motor Voter. Commies have been pushing this bullshit since the late '80s. permalink award report block reply ingrowntoenail 4 points 19 hours ago But CNN told me this was an unbased lie. permalink award report block reply LogicCircuits 4 points 18 hours ago The thing that never happens, happened AGAIN permalink award report block reply MEME-SUPREME 3 points 19 hours ago Treason. When do the hangings start? permalink award report block reply Liberty49220 4 points 19 hours ago I am SO sick of this!  We need justice. permalink parent award report block reply LiberalTearsMiner 1 points 19 hours ago When we start them, the government isn’t going to save you. permalink parent award report block reply WarriorRock 3 points 18 hours ago Lemme guess..they all vote democrat permalink award report block reply vongregormench 1 points 18 hours ago Ballots are secret so you can never find out. permalink parent award report block reply Looniz74 OP PRO 3 points 19 hours ago https://x.com/WallStreetApes/status/1988399098706489823?s=20 permalink award report block reply KennyUS 2 points 16 hours ago Bet there have been 0 arrests. permalink award report block reply Nick-Kerr 2 points 12 hours ago California already does the same thing... And illegals get driver's licenses... as an added bonus, when you're forced to sign up for Covered California health care or given coverage for free (illegals), you ALSO get signed up to vote. Both the DMV and the Covered California \"exchange\" are now extensions of the Secretary of State for voter registrations. permalink award report block reply Hikedelics 2 points 18 hours ago If this doesn’t result in every person who ever had so much as a keystrokes involvement in a single illegal being registered going to prison, I’ll… I’ll… I’lll… I’ll probably be pretty fucking pissed and still go about my day as I would have otherwise. What the fuck is going on with our country and why can’t we fix it? HOW can we fix it at this point? Living our best lives separate from all this shit isn’t doing the trick. permalink award report block reply Tyrant37 2 points 15 hours ago You can add every blue city to that list. permalink award report block reply ShekelJa 2 points 19 hours ago But they are not personally voting, just some NGO voting for them on their behalf, its totally different! - some retard I'm sure. permalink award report block reply MagaChamp253 2 points 18 hours ago Just drive by any dmv in nc I'm told - there's nothing but latinos in line. I be it'd be comical to drive by in an ICE marked vehicle and watch 75% of the lines just scatter and flee... permalink award report block reply BigMikesChef 2 points 18 hours ago Pam? Pam? ....are you still on Hannity? permalink award report block reply FuckU/Spez 2 points 7 hours ago I'm tired of these headlines... I want to see: \"Justice department arrested 15 people. Including the district chief for registering illegal aliens to vote in American elections\" When is that day coming? Or is it 2 weeks? permalink award report block reply vongregormench 2 points 18 hours ago They didn’t even know they voted, because someone else did with their name. permalink award report block reply MrTexan 1 points 18 hours ago This was the reason they created “motor voter” decades ago. permalink award report block reply HeatherSwanson 1 points 19 hours ago I’m not outraged because this is what’s being done here in California since the motor voter law. Mexican nationals are given licenses and ballots permalink award report block reply mass55th 1 points 16 hours ago That shouldn't surprise anyone. This is the same RAT State officials who let psycho Decarlos Brown out so he could murder Iryna Zarutska. permalink award report block reply cardinaldrones 1 points 14 hours ago They already took Virginia and now the neighboring state is showing symptoms of the Democrat infection. Starting to look like Connecticut pre-1990s permalink award report block reply MySidesGoUp 1 points 19 hours ago But hey man there’s football on this weekend. Why you gotta be a bummer?… permalink award report block reply Michalusmichalus 1 points 17 hours ago You have to put serious effort into not being registered to vote these days. permalink award report block reply KungPaoMcChicken 1 points 17 hours ago You know my Viet ex, she came to Australia with a motorcycle license and she took it into the local office and was told that they would give her a full motorcycle license here. And I kept thinking, do they know that she literally drove mopeds? Like I imagine if she bought a full motorcycle, she would be wrecked trying to ride it. permalink award report block reply AZTrumpette1776 1 points 5 hours ago https://www.justice.gov/crt/national-voter-registration-act-1993-nvra permalink award report block reply MocksFordComma 1 points 16 hours ago Now do California. REAL Americans are probably voting around 65/35 R/D. Democrats have been MASSIVELY cheating for decades. permalink award report block reply brewser724 1 points 19 hours ago Claw them back then... permalink award report block reply tired-of-crap 1 points 8 hours ago Maybe we should just push these departments to stop registering Illegals for driver's licenses at all. permalink award report block reply tholinz 1 points 19 hours ago It's not even about giving these people a voice or whatever, but harvesting their votes permalink award report block reply goatnuts 1 points 2 hours ago Not voter fraud. Election fraud. permalink award report block reply tired-of-crap 1 points 8 hours ago Maybe the state should stop hiring Indian programmers. It is trivial to have logic like \"if not citizen do not present motor voter options\". Trivial to normal programmers, but not necessarily to the cheap Indian ones that don't actually even have the credentials they claim. permalink award report block reply CatalystForChange 1 points 18 hours ago They do it openly here in Commiefornia. Doesn't require any investigation to find it. permalink award report block reply Nomad899 1 points 18 hours ago All DNC i bet and someone will even vote for them as needed to make up the need….from each according to their registration to dnc according to their need permalink award report block reply MajJamesMcFarlane 1 points 16 hours ago I can't wait for absolutely nothing to happen and no one to be prosecuted permalink award report block reply DaayTerkErJerbs 1 points 14 hours ago The whole point of giving illegals licenses was to automatically register illegals to vote. permalink award report block reply NickAtNight 1 points 18 hours ago Anywhere there are democrats ! permalink award report block reply Weeha 1 points 17 hours ago And how many of these illegals they registered show  up on the voters in elections permalink award report block reply Yignuced 1 points 18 hours ago Your 16 year old kids are also registered to vote automatically when they get their licenses. permalink award report block reply infinitysupreme 1 points 7 hours ago Cheat The Vote method no. 375 permalink award report block reply NonyaDB 1 points 18 hours ago That's weird.  They asked me this a couple of years ago when I went to renew my NC license and I told them \"no thank you\" and they didn't mention it again and I certainly haven't gotten any voter junk in the mail. But then again, it's a small rural town where everyone knows each other and it's surrounded by hog farms. Everyone just handles their own business and no one calls law enforcement. Yankees are terrified to set foot anywhere in the entire county and that's a good thing. permalink award report block reply TerrorAndSlaughter 1 points 17 hours ago I bet they don't know that there will be a ballot mailed out, filled out, and turned in for them either. permalink award report block reply Goatboy66 1 points 16 hours ago Throw these POS in prison for Aiding And Abetting/Harboring Illegal Aliens....All Felonies. permalink award report block reply ClarenceBeeks 1 points 17 hours ago Here’s the scam:  this illegal registration creates a ballot. This goes on a long list of ballots known to represent those who generally don’t vote. Like dead people and people who moved away. Then at election time, all those ballots are harvested by activist criminals. That’s how we lose our country despite being a majority. permalink award report block reply ClarenceBeeks 1 points 17 hours ago I’m certain this is what they did in CA and they are replicating now everywhere they get political cover permalink parent award report block reply Formerlurker92 1 points 18 hours ago Stealing votes is grand theft, murder and treason all at the same time and more. Your vote can do more damage in the wrong hands than a tranny with a gun in a school zone. It should be treated as the high crime it is and all those involved need to be shot permalink award report block reply RexCollumSilvarum 1 points 16 hours ago Friendly reminder that voting in elections has ZERO relation with being able to drive an automobile , and that in many US states it is easier to register to vote as an illegal alien who can drive than it is as a US citizen with a disability that prevents you from driving. That is not how voting rights are supposed to be handled. permalink award report block reply Lasheric 1 points 13 hours ago CA did this too, to anyone who signed up for covered California (their healthcare) fraud permalink award report block reply ColonelKlink 1 points 19 hours ago Arrest them and throw them in prison. permalink award report block reply\nBOHICA2021 45 points 19 hours ago remember when Barry set all this up on his way out...I do. permalink award report block reply Quixotic 25 points 19 hours ago motor voter (ACORN) happened waaaay before obongo permalink parent award report block reply God-is-good 1 points 4 hours ago I’m sure they will have been voting without their knowledge too. permalink parent award report block reply\nQuixotic 25 points 19 hours ago motor voter (ACORN) happened waaaay before obongo permalink parent award report block reply God-is-good 1 points 4 hours ago I’m sure they will have been voting without their knowledge too. permalink parent award report block reply\nGod-is-good 1 points 4 hours ago I’m sure they will have been voting without their knowledge too. permalink parent award report block reply\nRocketSprocket 42 points 19 hours ago Time to crack down or lose our country. permalink award report block reply ImYourHuckleberry24 12 points 19 hours ago Too late permalink parent award report block reply MakeFloridaRed 30 points 19 hours ago Guarantee it’s happening in every state too. permalink parent award report block reply zerk0021 12 points 18 hours ago Guarantee it's happening in California. Several years ago when getting a driver's license, the guy at DMV would absolutely not take No as a reply when asked if I wanted to register to vote. Wonder if he's that determined if someone is wearing a MAGA cap. permalink parent award report block reply goldkeyboardwarrior 1 points 15 hours ago The MAGA cap is his sign to remember their name so that guy’s vote goes into the trash and is replaced by a prefilled ballot with the Dems filled out. permalink parent award report block reply QSWO1 1 points 14 hours ago Texas only requires another state ID to get a Texas DL. Goes back 25 years at least. permalink parent award report block reply tired-of-crap 2 points 8 hours ago Yes, Texas needs to create a list of other states untrusted IDS not to accept. permalink parent award report block reply trm17118 2 points 6 hours ago Last year when I went to renew my Texas drivers license I had to show my birth certificate permalink parent award report block reply Formerlurker92 7 points 18 hours ago You're still breathing. If it can get worse, we can make it better too. If you don't believe that, then at least do something cool when you kill yourself permalink parent award report block reply PROCIsAsshoe 2 points 17 hours ago lol excellent reply. but let's be honest, that account is just a demoralization shill aka faggot. permalink parent award report block reply\nImYourHuckleberry24 12 points 19 hours ago Too late permalink parent award report block reply MakeFloridaRed 30 points 19 hours ago Guarantee it’s happening in every state too. permalink parent award report block reply zerk0021 12 points 18 hours ago Guarantee it's happening in California. Several years ago when getting a driver's license, the guy at DMV would absolutely not take No as a reply when asked if I wanted to register to vote. Wonder if he's that determined if someone is wearing a MAGA cap. permalink parent award report block reply goldkeyboardwarrior 1 points 15 hours ago The MAGA cap is his sign to remember their name so that guy’s vote goes into the trash and is replaced by a prefilled ballot with the Dems filled out. permalink parent award report block reply QSWO1 1 points 14 hours ago Texas only requires another state ID to get a Texas DL. Goes back 25 years at least. permalink parent award report block reply tired-of-crap 2 points 8 hours ago Yes, Texas needs to create a list of other states untrusted IDS not to accept. permalink parent award report block reply trm17118 2 points 6 hours ago Last year when I went to renew my Texas drivers license I had to show my birth certificate permalink parent award report block reply Formerlurker92 7 points 18 hours ago You're still breathing. If it can get worse, we can make it better too. If you don't believe that, then at least do something cool when you kill yourself permalink parent award report block reply PROCIsAsshoe 2 points 17 hours ago lol excellent reply. but let's be honest, that account is just a demoralization shill aka faggot. permalink parent award report block reply\nMakeFloridaRed 30 points 19 hours ago Guarantee it’s happening in every state too. permalink parent award report block reply zerk0021 12 points 18 hours ago Guarantee it's happening in California. Several years ago when getting a driver's license, the guy at DMV would absolutely not take No as a reply when asked if I wanted to register to vote. Wonder if he's that determined if someone is wearing a MAGA cap. permalink parent award report block reply goldkeyboardwarrior 1 points 15 hours ago The MAGA cap is his sign to remember their name so that guy’s vote goes into the trash and is replaced by a prefilled ballot with the Dems filled out. permalink parent award report block reply QSWO1 1 points 14 hours ago Texas only requires another state ID to get a Texas DL. Goes back 25 years at least. permalink parent award report block reply tired-of-crap 2 points 8 hours ago Yes, Texas needs to create a list of other states untrusted IDS not to accept. permalink parent award report block reply trm17118 2 points 6 hours ago Last year when I went to renew my Texas drivers license I had to show my birth certificate permalink parent award report block reply\nzerk0021 12 points 18 hours ago Guarantee it's happening in California. Several years ago when getting a driver's license, the guy at DMV would absolutely not take No as a reply when asked if I wanted to register to vote. Wonder if he's that determined if someone is wearing a MAGA cap. permalink parent award report block reply goldkeyboardwarrior 1 points 15 hours ago The MAGA cap is his sign to remember their name so that guy’s vote goes into the trash and is replaced by a prefilled ballot with the Dems filled out. permalink parent award report block reply\ngoldkeyboardwarrior 1 points 15 hours ago The MAGA cap is his sign to remember their name so that guy’s vote goes into the trash and is replaced by a prefilled ballot with the Dems filled out. permalink parent award report block reply\nQSWO1 1 points 14 hours ago Texas only requires another state ID to get a Texas DL. Goes back 25 years at least. permalink parent award report block reply tired-of-crap 2 points 8 hours ago Yes, Texas needs to create a list of other states untrusted IDS not to accept. permalink parent award report block reply trm17118 2 points 6 hours ago Last year when I went to renew my Texas drivers license I had to show my birth certificate permalink parent award report block reply\ntired-of-crap 2 points 8 hours ago Yes, Texas needs to create a list of other states untrusted IDS not to accept. permalink parent award report block reply\ntrm17118 2 points 6 hours ago Last year when I went to renew my Texas drivers license I had to show my birth certificate permalink parent award report block reply\nFormerlurker92 7 points 18 hours ago You're still breathing. If it can get worse, we can make it better too. If you don't believe that, then at least do something cool when you kill yourself permalink parent award report block reply PROCIsAsshoe 2 points 17 hours ago lol excellent reply. but let's be honest, that account is just a demoralization shill aka faggot. permalink parent award report block reply\nPROCIsAsshoe 2 points 17 hours ago lol excellent reply. but let's be honest, that account is just a demoralization shill aka faggot. permalink parent award report block reply\nMasterChief08 28 points 19 hours ago This is treason. Fuck the Republicans if they don't arrest people over this. I won't vote and I won't donate unless I start seeing more arrests. The left is literally trying to murder and replace us. Frankly I would rather see these people put in gulags through extrajudicial means than vote for moderation. Put the left in gulags. permalink award report block reply texas4ever 4 points 19 hours ago Sitting it out punishes conservatives though. permalink parent award report block reply MasterChief08 11 points 18 hours ago If Republicans can't even arrest leftists getting illegal immigrants to vote, wtf am I even supporting? Demographics and secure government are all that ultimately matter. Every other issue can be fixed if those 2 things are secure. Gun rights, abortion restrictions, strong economic output, low taxes - all of those things rely on demographic certainty and secure elections. permalink parent award report block reply texas4ever 1 points 14 hours ago What we have now for all the flaws is a million times better than the alternative, that's what. permalink parent award report block reply LiberalTearsMiner 11 points 19 hours ago Not when they steal the elections using registered voters who are illegal who don’t know they’re registered.  Easy to send in mail in votes for those people. permalink parent award report block reply texas4ever 1 points 14 hours ago So somehow sitting it out is the solution? permalink parent award report block reply tired-of-crap 1 points 8 hours ago And honestly if these people are actually legitimately trying to get citizenship at some point in the future they definitely do not want to be registered to vote. It will be assumed that they did the affirmative act When it comes up. permalink parent award report block reply MakeAmericaGreat9 9 points 19 hours ago Not if the conservative faggots do jack shit... Like they always do. permalink parent award report block reply\ntexas4ever 4 points 19 hours ago Sitting it out punishes conservatives though. permalink parent award report block reply MasterChief08 11 points 18 hours ago If Republicans can't even arrest leftists getting illegal immigrants to vote, wtf am I even supporting? Demographics and secure government are all that ultimately matter. Every other issue can be fixed if those 2 things are secure. Gun rights, abortion restrictions, strong economic output, low taxes - all of those things rely on demographic certainty and secure elections. permalink parent award report block reply texas4ever 1 points 14 hours ago What we have now for all the flaws is a million times better than the alternative, that's what. permalink parent award report block reply LiberalTearsMiner 11 points 19 hours ago Not when they steal the elections using registered voters who are illegal who don’t know they’re registered.  Easy to send in mail in votes for those people. permalink parent award report block reply texas4ever 1 points 14 hours ago So somehow sitting it out is the solution? permalink parent award report block reply tired-of-crap 1 points 8 hours ago And honestly if these people are actually legitimately trying to get citizenship at some point in the future they definitely do not want to be registered to vote. It will be assumed that they did the affirmative act When it comes up. permalink parent award report block reply MakeAmericaGreat9 9 points 19 hours ago Not if the conservative faggots do jack shit... Like they always do. permalink parent award report block reply\nMasterChief08 11 points 18 hours ago If Republicans can't even arrest leftists getting illegal immigrants to vote, wtf am I even supporting? Demographics and secure government are all that ultimately matter. Every other issue can be fixed if those 2 things are secure. Gun rights, abortion restrictions, strong economic output, low taxes - all of those things rely on demographic certainty and secure elections. permalink parent award report block reply texas4ever 1 points 14 hours ago What we have now for all the flaws is a million times better than the alternative, that's what. permalink parent award report block reply\ntexas4ever 1 points 14 hours ago What we have now for all the flaws is a million times better than the alternative, that's what. permalink parent award report block reply\nLiberalTearsMiner 11 points 19 hours ago Not when they steal the elections using registered voters who are illegal who don’t know they’re registered.  Easy to send in mail in votes for those people. permalink parent award report block reply texas4ever 1 points 14 hours ago So somehow sitting it out is the solution? permalink parent award report block reply tired-of-crap 1 points 8 hours ago And honestly if these people are actually legitimately trying to get citizenship at some point in the future they definitely do not want to be registered to vote. It will be assumed that they did the affirmative act When it comes up. permalink parent award report block reply\ntexas4ever 1 points 14 hours ago So somehow sitting it out is the solution? permalink parent award report block reply\ntired-of-crap 1 points 8 hours ago And honestly if these people are actually legitimately trying to get citizenship at some point in the future they definitely do not want to be registered to vote. It will be assumed that they did the affirmative act When it comes up. permalink parent award report block reply\nMakeAmericaGreat9 9 points 19 hours ago Not if the conservative faggots do jack shit... Like they always do. permalink parent award report block reply\nJack_NC 19 points 19 hours ago NC is flooded with illegals. Millions and millions. There are counties where >70% of the Kindergarten class speaks no English. permalink award report block reply\ngaijin_ronin 18 points 19 hours ago All the while my city council and mayor floated the idea recently to make us a sanctuary city.  These traitors deserve nothing less than execution. permalink award report block reply gaijin_ronin 5 points 19 hours ago Also our DMV is understaffed and backlogged.  Most of the DMV is filled with typical government worker trash and probably just push the paper work through like drones. permalink parent award report block reply Klown_Kutz 3 points 9 hours ago Funny how when it’s you and me, these same drones make it their mission in life to deny us a license. permalink parent award report block reply gaijin_ronin 1 points 5 hours ago Yep, just like vote counting errors. permalink parent award report block reply tired-of-crap 2 points 8 hours ago In Florida for the most part we basically got rid of all the state employees that did driver's license functions and replaced them with tax collector employees which I don't know whether that is better or worse.  I do know the tax collector employees are supported only by a service fee added to the amount and not the general tax revenue though. permalink parent award report block reply gaijin_ronin 1 points 5 hours ago In NC years ago we had private contracted DMV offices in addition to state run locations.  The contract ended after claims customer service was awful and for \"cost savings for the state. \" Now there are only a couple offices open and appointments are months out for certain needs. We can renew our DL online but only so many times and for all other cases you need the office.   We really need more locations but that means more state employee leeches. permalink parent award report block reply\ngaijin_ronin 5 points 19 hours ago Also our DMV is understaffed and backlogged.  Most of the DMV is filled with typical government worker trash and probably just push the paper work through like drones. permalink parent award report block reply Klown_Kutz 3 points 9 hours ago Funny how when it’s you and me, these same drones make it their mission in life to deny us a license. permalink parent award report block reply gaijin_ronin 1 points 5 hours ago Yep, just like vote counting errors. permalink parent award report block reply tired-of-crap 2 points 8 hours ago In Florida for the most part we basically got rid of all the state employees that did driver's license functions and replaced them with tax collector employees which I don't know whether that is better or worse.  I do know the tax collector employees are supported only by a service fee added to the amount and not the general tax revenue though. permalink parent award report block reply gaijin_ronin 1 points 5 hours ago In NC years ago we had private contracted DMV offices in addition to state run locations.  The contract ended after claims customer service was awful and for \"cost savings for the state. \" Now there are only a couple offices open and appointments are months out for certain needs. We can renew our DL online but only so many times and for all other cases you need the office.   We really need more locations but that means more state employee leeches. permalink parent award report block reply\nKlown_Kutz 3 points 9 hours ago Funny how when it’s you and me, these same drones make it their mission in life to deny us a license. permalink parent award report block reply gaijin_ronin 1 points 5 hours ago Yep, just like vote counting errors. permalink parent award report block reply\ngaijin_ronin 1 points 5 hours ago Yep, just like vote counting errors. permalink parent award report block reply\ntired-of-crap 2 points 8 hours ago In Florida for the most part we basically got rid of all the state employees that did driver's license functions and replaced them with tax collector employees which I don't know whether that is better or worse.  I do know the tax collector employees are supported only by a service fee added to the amount and not the general tax revenue though. permalink parent award report block reply gaijin_ronin 1 points 5 hours ago In NC years ago we had private contracted DMV offices in addition to state run locations.  The contract ended after claims customer service was awful and for \"cost savings for the state. \" Now there are only a couple offices open and appointments are months out for certain needs. We can renew our DL online but only so many times and for all other cases you need the office.   We really need more locations but that means more state employee leeches. permalink parent award report block reply\ngaijin_ronin 1 points 5 hours ago In NC years ago we had private contracted DMV offices in addition to state run locations.  The contract ended after claims customer service was awful and for \"cost savings for the state. \" Now there are only a couple offices open and appointments are months out for certain needs. We can renew our DL online but only so many times and for all other cases you need the office.   We really need more locations but that means more state employee leeches. permalink parent award report block reply\nThorsonTT 15 points 19 hours ago This is what Motor Voter laws were designed to do.  Register everyone, so unscrupulous SoS' could pass that info off to whomever generates all those Democrat votes that appear out of fat air. permalink award report block reply Deplora 9 points 18 hours ago And designed to register them whether they want to be registered or not.  I had direct knowledge of this happening to a foreign student in Pennsylvania over 25 years ago.  She was perfectly fluent in English, went to get a driver's license, had no intention of registering or voting, and made a point of not checking the \"register to vote\" box on the paper form (this was back when it was still an opt-in process; now the person has to check a box on the computer form to opt out of the voter registration process).  She was shocked when she received her new voter registration card in the mail a short time later.  Also a bit scared, because she was afraid somebody would think she'd registered on purpose, and she knew it was illegal. permalink parent award report block reply\nDeplora 9 points 18 hours ago And designed to register them whether they want to be registered or not.  I had direct knowledge of this happening to a foreign student in Pennsylvania over 25 years ago.  She was perfectly fluent in English, went to get a driver's license, had no intention of registering or voting, and made a point of not checking the \"register to vote\" box on the paper form (this was back when it was still an opt-in process; now the person has to check a box on the computer form to opt out of the voter registration process).  She was shocked when she received her new voter registration card in the mail a short time later.  Also a bit scared, because she was afraid somebody would think she'd registered on purpose, and she knew it was illegal. permalink parent award report block reply\nLostElf 10 points 19 hours ago Hopefully this will make them easier to find and deport. permalink award report block reply PiratePatriot 6 points 19 hours ago in an age of mobile phones and cash becoming scarce - everyone is using cards to pay - tracking mobile phones and where cards are used makes finding people VERY easy and accurate. permalink parent award report block reply Taliesin 2 points 17 hours ago And make it easier to find the fake ballots being cast in their names. permalink parent award report block reply\nPiratePatriot 6 points 19 hours ago in an age of mobile phones and cash becoming scarce - everyone is using cards to pay - tracking mobile phones and where cards are used makes finding people VERY easy and accurate. permalink parent award report block reply\nTaliesin 2 points 17 hours ago And make it easier to find the fake ballots being cast in their names. permalink parent award report block reply\nPOTUS_DonnieJ 9 points 18 hours ago So every registration has at least one bureaucrat behind it. How about starting to arrest the ones that were directly responsible for signing off on those applications. In theory the feds can start going after those people personally for being negligent in their duties and issuing licenses in violation of federal law. And because they're negligent, they wouldn't be able to hide behind any state immunity or use the state taxpayer funded employee defense fund. Start making life hell for all of those traitors instead of releasing reports and asking for more investigations. permalink award report block reply tired-of-crap 2 points 8 hours ago I guarantee that nearly everyone of these systems have identifier to show who did the transactions. Once they determine that for 1 person go back and look at all their transactions. permalink parent award report block reply\ntired-of-crap 2 points 8 hours ago I guarantee that nearly everyone of these systems have identifier to show who did the transactions. Once they determine that for 1 person go back and look at all their transactions. permalink parent award report block reply\nPhantomShield72 9 points 18 hours ago Excuse me, I was told this doesn't happen... permalink award report block reply\nI_Love_45-70_Gov 5 points 18 hours ago Motor Voter. Commies have been pushing this bullshit since the late '80s. permalink award report block reply\ningrowntoenail 4 points 19 hours ago But CNN told me this was an unbased lie. permalink award report block reply\nLogicCircuits 4 points 18 hours ago The thing that never happens, happened AGAIN permalink award report block reply\nMEME-SUPREME 3 points 19 hours ago Treason. When do the hangings start? permalink award report block reply Liberty49220 4 points 19 hours ago I am SO sick of this!  We need justice. permalink parent award report block reply LiberalTearsMiner 1 points 19 hours ago When we start them, the government isn’t going to save you. permalink parent award report block reply\nLiberty49220 4 points 19 hours ago I am SO sick of this!  We need justice. permalink parent award report block reply\nLiberalTearsMiner 1 points 19 hours ago When we start them, the government isn’t going to save you. permalink parent award report block reply\nWarriorRock 3 points 18 hours ago Lemme guess..they all vote democrat permalink award report block reply vongregormench 1 points 18 hours ago Ballots are secret so you can never find out. permalink parent award report block reply\nvongregormench 1 points 18 hours ago Ballots are secret so you can never find out. permalink parent award report block reply\nLooniz74 OP PRO 3 points 19 hours ago https://x.com/WallStreetApes/status/1988399098706489823?s=20 permalink award report block reply\nKennyUS 2 points 16 hours ago Bet there have been 0 arrests. permalink award report block reply\nNick-Kerr 2 points 12 hours ago California already does the same thing... And illegals get driver's licenses... as an added bonus, when you're forced to sign up for Covered California health care or given coverage for free (illegals), you ALSO get signed up to vote. Both the DMV and the Covered California \"exchange\" are now extensions of the Secretary of State for voter registrations. permalink award report block reply\nHikedelics 2 points 18 hours ago If this doesn’t result in every person who ever had so much as a keystrokes involvement in a single illegal being registered going to prison, I’ll… I’ll… I’lll… I’ll probably be pretty fucking pissed and still go about my day as I would have otherwise. What the fuck is going on with our country and why can’t we fix it? HOW can we fix it at this point? Living our best lives separate from all this shit isn’t doing the trick. permalink award report block reply\nTyrant37 2 points 15 hours ago You can add every blue city to that list. permalink award report block reply\nShekelJa 2 points 19 hours ago But they are not personally voting, just some NGO voting for them on their behalf, its totally different! - some retard I'm sure. permalink award report block reply\nMagaChamp253 2 points 18 hours ago Just drive by any dmv in nc I'm told - there's nothing but latinos in line. I be it'd be comical to drive by in an ICE marked vehicle and watch 75% of the lines just scatter and flee... permalink award report block reply\nBigMikesChef 2 points 18 hours ago Pam? Pam? ....are you still on Hannity? permalink award report block reply\nFuckU/Spez 2 points 7 hours ago I'm tired of these headlines... I want to see: \"Justice department arrested 15 people. Including the district chief for registering illegal aliens to vote in American elections\" When is that day coming? Or is it 2 weeks? permalink award report block reply\nvongregormench 2 points 18 hours ago They didn’t even know they voted, because someone else did with their name. permalink award report block reply\nMrTexan 1 points 18 hours ago This was the reason they created “motor voter” decades ago. permalink award report block reply\nHeatherSwanson 1 points 19 hours ago I’m not outraged because this is what’s being done here in California since the motor voter law. Mexican nationals are given licenses and ballots permalink award report block reply\nmass55th 1 points 16 hours ago That shouldn't surprise anyone. This is the same RAT State officials who let psycho Decarlos Brown out so he could murder Iryna Zarutska. permalink award report block reply\ncardinaldrones 1 points 14 hours ago They already took Virginia and now the neighboring state is showing symptoms of the Democrat infection. Starting to look like Connecticut pre-1990s permalink award report block reply\nMySidesGoUp 1 points 19 hours ago But hey man there’s football on this weekend. Why you gotta be a bummer?… permalink award report block reply\nMichalusmichalus 1 points 17 hours ago You have to put serious effort into not being registered to vote these days. permalink award report block reply\nKungPaoMcChicken 1 points 17 hours ago You know my Viet ex, she came to Australia with a motorcycle license and she took it into the local office and was told that they would give her a full motorcycle license here. And I kept thinking, do they know that she literally drove mopeds? Like I imagine if she bought a full motorcycle, she would be wrecked trying to ride it. permalink award report block reply\nAZTrumpette1776 1 points 5 hours ago https://www.justice.gov/crt/national-voter-registration-act-1993-nvra permalink award report block reply\nMocksFordComma 1 points 16 hours ago Now do California. REAL Americans are probably voting around 65/35 R/D. Democrats have been MASSIVELY cheating for decades. permalink award report block reply\nbrewser724 1 points 19 hours ago Claw them back then... permalink award report block reply\ntired-of-crap 1 points 8 hours ago Maybe we should just push these departments to stop registering Illegals for driver's licenses at all. permalink award report block reply\ntholinz 1 points 19 hours ago It's not even about giving these people a voice or whatever, but harvesting their votes permalink award report block reply\ngoatnuts 1 points 2 hours ago Not voter fraud. Election fraud. permalink award report block reply\ntired-of-crap 1 points 8 hours ago Maybe the state should stop hiring Indian programmers. It is trivial to have logic like \"if not citizen do not present motor voter options\". Trivial to normal programmers, but not necessarily to the cheap Indian ones that don't actually even have the credentials they claim. permalink award report block reply\nCatalystForChange 1 points 18 hours ago They do it openly here in Commiefornia. Doesn't require any investigation to find it. permalink award report block reply\nNomad899 1 points 18 hours ago All DNC i bet and someone will even vote for them as needed to make up the need….from each according to their registration to dnc according to their need permalink award report block reply\nMajJamesMcFarlane 1 points 16 hours ago I can't wait for absolutely nothing to happen and no one to be prosecuted permalink award report block reply\nDaayTerkErJerbs 1 points 14 hours ago The whole point of giving illegals licenses was to automatically register illegals to vote. permalink award report block reply\nNickAtNight 1 points 18 hours ago Anywhere there are democrats ! permalink award report block reply\nWeeha 1 points 17 hours ago And how many of these illegals they registered show  up on the voters in elections permalink award report block reply\nYignuced 1 points 18 hours ago Your 16 year old kids are also registered to vote automatically when they get their licenses. permalink award report block reply\ninfinitysupreme 1 points 7 hours ago Cheat The Vote method no. 375 permalink award report block reply\nNonyaDB 1 points 18 hours ago That's weird.  They asked me this a couple of years ago when I went to renew my NC license and I told them \"no thank you\" and they didn't mention it again and I certainly haven't gotten any voter junk in the mail. But then again, it's a small rural town where everyone knows each other and it's surrounded by hog farms. Everyone just handles their own business and no one calls law enforcement. Yankees are terrified to set foot anywhere in the entire county and that's a good thing. permalink award report block reply\nTerrorAndSlaughter 1 points 17 hours ago I bet they don't know that there will be a ballot mailed out, filled out, and turned in for them either. permalink award report block reply\nGoatboy66 1 points 16 hours ago Throw these POS in prison for Aiding And Abetting/Harboring Illegal Aliens....All Felonies. permalink award report block reply\nClarenceBeeks 1 points 17 hours ago Here’s the scam:  this illegal registration creates a ballot. This goes on a long list of ballots known to represent those who generally don’t vote. Like dead people and people who moved away. Then at election time, all those ballots are harvested by activist criminals. That’s how we lose our country despite being a majority. permalink award report block reply ClarenceBeeks 1 points 17 hours ago I’m certain this is what they did in CA and they are replicating now everywhere they get political cover permalink parent award report block reply\nClarenceBeeks 1 points 17 hours ago I’m certain this is what they did in CA and they are replicating now everywhere they get political cover permalink parent award report block reply\nFormerlurker92 1 points 18 hours ago Stealing votes is grand theft, murder and treason all at the same time and more. Your vote can do more damage in the wrong hands than a tranny with a gun in a school zone. It should be treated as the high crime it is and all those involved need to be shot permalink award report block reply\nRexCollumSilvarum 1 points 16 hours ago Friendly reminder that voting in elections has ZERO relation with being able to drive an automobile , and that in many US states it is easier to register to vote as an illegal alien who can drive than it is as a US citizen with a disability that prevents you from driving. That is not how voting rights are supposed to be handled. permalink award report block reply\nLasheric 1 points 13 hours ago CA did this too, to anyone who signed up for covered California (their healthcare) fraud permalink award report block reply\nColonelKlink 1 points 19 hours ago Arrest them and throw them in prison. permalink award report block reply"}