{"id": "8184829", "contents": "405 Anyone have any details on what happened? posted 13 hours ago by KilroyJCNJ 15 comments award share report block Catturd ™ @catturd2 • 13h I’m glad Matt and his family are okay - this all started at my house - same person. Be careful out there. Watch each other’s back. Matt Walsh @MattWalshBlog • 21h Update on this for those who’ve asked. Law enforcement is handling it very diligently. This person made extremely graphic threats against my wife and children. There will be consequences, as I promised. I can probably say more about this case in the days ahead.\n15 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style grassshrimp 27 points 12 hours ago Likely Antifa.  Likely Trans.  I wouldn't bet against it. permalink award report block reply Hikedelics 2 points 7 hours ago Safe bet, but that’s because it’s expected at this point. The 0 hour guy said when the picture gets released it is “going to open many eyes” which sort of implies it is someone unexpected? permalink parent award report block reply Female 21 points 12 hours ago GunShyMartyr retweeted\n⏰0HOUR⏰\n10h\nWe stopped a genuine terrorist who is right now in a cell being interrogated as we post. This terrorist was seen on many cameras over a period of time. This terrorist made dozens of online threats. We tracked him for days. Soon his picture is going to open many eyes permalink award report block reply finnigan 6 points 10 hours ago Who is we?  Cops, investigators, citizen activists? permalink parent award report block reply Female 2 points 9 hours ago If I had to guess I would say that it is X users gun shy martyr and zero hour guessing because it's not being reported yet where I can find out more information permalink parent award report block reply 2FBIAgents1Cup 2 points 2 hours ago My bet is Bill Mitchell...... permalink parent award report block reply MoldyLocksNesMonste 0 points 6 hours ago Soon his picture is going to open many eyes You should know by now none of these predictions ever pan out. permalink parent award report block reply Female 2 points 6 hours ago Yes, it sounds really stupid. None of these people have ever taken an English course, apparently. hopefully they will just lock it up, whoever it is. Just wish that we had a news media because it is probably a horrific story /s permalink parent award report block reply Hammond 13 points 10 hours ago Something terrible happened last Saturday to Catturd and other conservatives but can't talk about it yet. See https://xcancel.com/catturd2/status/1987334451324690530#m and https://xcancel.com/catturd2/status/1987335601952112678#m and https://xcancel.com/0HOUR1__/status/1987338391235756483#m permalink award report block reply God-is-good 7 points 9 hours ago Thank you for sharing this context. Glad to hear everyone is okay. Curious what happened. permalink parent award report block reply Hammond 5 points 8 hours ago You are welcome fren. I'm curious too and will keep an eye out for new info. permalink parent award report block reply Mungo 5 points 10 hours ago God keep them and their families safe. permalink award report block reply deleted 2 points 13 hours ago KilroyJCNJ OP 7 points 13 hours ago Well, that is why I asked… permalink parent award report block reply InfinitesimalOrange 1 points 2 hours ago Both of these two are going to be politically assassinated. Nothing to be done, move along people, let your mouthpieces get slaughtered like dogs while you hum and haw and wring your hands. permalink award report block reply\ngrassshrimp 27 points 12 hours ago Likely Antifa.  Likely Trans.  I wouldn't bet against it. permalink award report block reply Hikedelics 2 points 7 hours ago Safe bet, but that’s because it’s expected at this point. The 0 hour guy said when the picture gets released it is “going to open many eyes” which sort of implies it is someone unexpected? permalink parent award report block reply\nHikedelics 2 points 7 hours ago Safe bet, but that’s because it’s expected at this point. The 0 hour guy said when the picture gets released it is “going to open many eyes” which sort of implies it is someone unexpected? permalink parent award report block reply\nFemale 21 points 12 hours ago GunShyMartyr retweeted\nWe stopped a genuine terrorist who is right now in a cell being interrogated as we post. This terrorist was seen on many cameras over a period of time. This terrorist made dozens of online threats. We tracked him for days. Soon his picture is going to open many eyes permalink award report block reply finnigan 6 points 10 hours ago Who is we?  Cops, investigators, citizen activists? permalink parent award report block reply Female 2 points 9 hours ago If I had to guess I would say that it is X users gun shy martyr and zero hour guessing because it's not being reported yet where I can find out more information permalink parent award report block reply 2FBIAgents1Cup 2 points 2 hours ago My bet is Bill Mitchell...... permalink parent award report block reply MoldyLocksNesMonste 0 points 6 hours ago Soon his picture is going to open many eyes You should know by now none of these predictions ever pan out. permalink parent award report block reply Female 2 points 6 hours ago Yes, it sounds really stupid. None of these people have ever taken an English course, apparently. hopefully they will just lock it up, whoever it is. Just wish that we had a news media because it is probably a horrific story /s permalink parent award report block reply\nfinnigan 6 points 10 hours ago Who is we?  Cops, investigators, citizen activists? permalink parent award report block reply Female 2 points 9 hours ago If I had to guess I would say that it is X users gun shy martyr and zero hour guessing because it's not being reported yet where I can find out more information permalink parent award report block reply\nFemale 2 points 9 hours ago If I had to guess I would say that it is X users gun shy martyr and zero hour guessing because it's not being reported yet where I can find out more information permalink parent award report block reply\n2FBIAgents1Cup 2 points 2 hours ago My bet is Bill Mitchell...... permalink parent award report block reply\nMoldyLocksNesMonste 0 points 6 hours ago Soon his picture is going to open many eyes You should know by now none of these predictions ever pan out. permalink parent award report block reply Female 2 points 6 hours ago Yes, it sounds really stupid. None of these people have ever taken an English course, apparently. hopefully they will just lock it up, whoever it is. Just wish that we had a news media because it is probably a horrific story /s permalink parent award report block reply\nFemale 2 points 6 hours ago Yes, it sounds really stupid. None of these people have ever taken an English course, apparently. hopefully they will just lock it up, whoever it is. Just wish that we had a news media because it is probably a horrific story /s permalink parent award report block reply\nHammond 13 points 10 hours ago Something terrible happened last Saturday to Catturd and other conservatives but can't talk about it yet. See https://xcancel.com/catturd2/status/1987334451324690530#m and https://xcancel.com/catturd2/status/1987335601952112678#m and https://xcancel.com/0HOUR1__/status/1987338391235756483#m permalink award report block reply God-is-good 7 points 9 hours ago Thank you for sharing this context. Glad to hear everyone is okay. Curious what happened. permalink parent award report block reply Hammond 5 points 8 hours ago You are welcome fren. I'm curious too and will keep an eye out for new info. permalink parent award report block reply\nGod-is-good 7 points 9 hours ago Thank you for sharing this context. Glad to hear everyone is okay. Curious what happened. permalink parent award report block reply Hammond 5 points 8 hours ago You are welcome fren. I'm curious too and will keep an eye out for new info. permalink parent award report block reply\nHammond 5 points 8 hours ago You are welcome fren. I'm curious too and will keep an eye out for new info. permalink parent award report block reply\nMungo 5 points 10 hours ago God keep them and their families safe. permalink award report block reply\ndeleted 2 points 13 hours ago KilroyJCNJ OP 7 points 13 hours ago Well, that is why I asked… permalink parent award report block reply\nKilroyJCNJ OP 7 points 13 hours ago Well, that is why I asked… permalink parent award report block reply\nInfinitesimalOrange 1 points 2 hours ago Both of these two are going to be politically assassinated. Nothing to be done, move along people, let your mouthpieces get slaughtered like dogs while you hum and haw and wring your hands. permalink award report block reply"}