{"id": "8184921", "contents": "386 New York is packed with fools! posted 11 hours ago by wst4 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Username56 12 points 11 hours ago Haven’t seen any news about this other than a Facebook post and apparently it was a satire of some sort. Even the pic of the closed supermarket looked suburban and not someplace in Brooklyn. FAKE permalink award report block reply DirtyDiaperJoe 4 points 11 hours ago Not sure this is all fake.  Our newly elected mayor here just did the same thing with a new \"homeless\" shelter.  Conned the city into buying an old juvenile detention center that needs hundreds of millions of dollars in renovations/repairs to be brought up to livable conditions...\nIMO, this is just the Democrats new money laundering apparatus.  Getting the cities to buy old condemned buildings to repurpose or reopen and spending millions of city funds to rehab the buildings. permalink award report block reply Wrexxis780 1 points 5 hours ago This guy is about to become rich as fuck for “no reason” while being mayor permalink award report block reply Spiritof2015 1 points 9 hours ago Is his cousin also his wife? permalink award report block reply booblitchutz 1 points 4 hours ago Sooo, classic communism, then? permalink award report block reply UnknownKaller 1 points 6 hours ago he’s not a communist.  he’s a grifter, and he already knows his clock is ticking… it’s going to be Operation Cashout permalink award report block reply rebuildingMyself 1 points 6 hours ago The Karen/Foreign alliance get what they vote for. I just want them to be forced to live there and deal with it permalink award report block reply jamesm56 1 points 5 hours ago Seems awfully fast. Doubt this is real. permalink award report block reply TGNX 1 points 7 hours ago Every time. permalink award report block reply\nUsername56 12 points 11 hours ago Haven’t seen any news about this other than a Facebook post and apparently it was a satire of some sort. Even the pic of the closed supermarket looked suburban and not someplace in Brooklyn. FAKE permalink award report block reply\nDirtyDiaperJoe 4 points 11 hours ago Not sure this is all fake.  Our newly elected mayor here just did the same thing with a new \"homeless\" shelter.  Conned the city into buying an old juvenile detention center that needs hundreds of millions of dollars in renovations/repairs to be brought up to livable conditions...\nIMO, this is just the Democrats new money laundering apparatus.  Getting the cities to buy old condemned buildings to repurpose or reopen and spending millions of city funds to rehab the buildings. permalink award report block reply\nWrexxis780 1 points 5 hours ago This guy is about to become rich as fuck for “no reason” while being mayor permalink award report block reply\nSpiritof2015 1 points 9 hours ago Is his cousin also his wife? permalink award report block reply\nbooblitchutz 1 points 4 hours ago Sooo, classic communism, then? permalink award report block reply\nUnknownKaller 1 points 6 hours ago he’s not a communist.  he’s a grifter, and he already knows his clock is ticking… it’s going to be Operation Cashout permalink award report block reply\nrebuildingMyself 1 points 6 hours ago The Karen/Foreign alliance get what they vote for. I just want them to be forced to live there and deal with it permalink award report block reply\njamesm56 1 points 5 hours ago Seems awfully fast. Doubt this is real. permalink award report block reply\nTGNX 1 points 7 hours ago Every time. permalink award report block reply"}