{"id": "8184790", "contents": "766 We’re done with the 90-foot Hindu monkey god statues.\nWe’re done with the Diwali greetings.\nWe’re done with the retarded truck drivers.\nWe don’t have anything in common with these people.\nWe’re not backing down on H1Bs. posted 13 hours ago by PiratePatriotParrot 19 comments award share report block BowTiedRanger @BowTiedRanger • 19h We’re done with the 90-foot Hindu monkey god statues. We’re done with the Diwali greetings. We’re done with the retarded truck drivers. We don’t have anything in common with these people. We’re not backing down on H1Bs.\n19 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno SmallestShil 30 points 13 hours ago But trump said they’re not only vital, we need even more of them. From gas-station cashier over middle management, nepotism to the CEO, the American dream is giving everything to stinking jeets while prices increase. permalink award report block reply BoltCarrierGroup 30 points 12 hours ago Went from no jeets in my town to over 75000 in a decade (and it seems like way more) It’s disgusting. They drive up\nAmerican home prices with 3 families in each one, they hate Americans, their kids are all inbred and take up almost all of the resources in schools, plus they smell absolutely terrible. permalink parent award report block reply SmallestShil 21 points 11 hours ago Theres enough of them to airdrop a million into every single country on earth and still be left with over a billion. It’s a bucket filled with so much shit that its spilling and overflowing into every country on earth. I bet you there’s not a single place left not infested by them. permalink parent award report block reply Badfinz_FL 19 points 12 hours ago Need to give the street shitters the boot They are no bueno permalink award report block reply stealthboy 15 points 11 hours ago Immigration has always included assimilation.  This is why things are breaking down now, because nobody is assimilating.  I see it in my own town - complete separate societies now exist with one particular demographic. permalink award report block reply Yggdrasill 7 points 8 hours ago Well open wide then Saar because Trump is turning America into New India. I have your fell for it again awards over on ConPro permalink award report block reply journalist 6 points 9 hours ago Dishonest people, you can not trust them, they will always stab you in the back. permalink award report block reply Side_o_beef_curtains 10 points 9 hours ago They have invaded my area in insane numbers. I have engaged a few in more or less honest conversations about their behavior. In busines they believe \"if you arent cheating you arent trying.\" They try to fuck everyone over. Lie, cheat, outright steal. Refuse to pay what they owe. Absolute 3d world shit. They have nothing but contempt and outright hatred of us. They believe we are stupid and naive to not be constantly screwing everyone, breaking the law, bouncing checks, etc. They really believe we are stupid for letting them in at all. permalink parent award report block reply SteveRogers42 5 points 9 hours ago That statue should get the Georgia Guidestones treatment. permalink award report block reply Wontgoquietly 5 points 8 hours ago You’re going to have to wait for the next administration to solve these problems.  Trump and the GOP Congress have done zero on this front.  Every day is open season on US jobs. permalink award report block reply Spellmonger 3 points 6 hours ago I am still offended by, when, during President Trump's first term, Moodie came to Texas, rented a stadium for a howdy doody Moodie visit, and if I remember correctly, didn't include President Trump. permalink award report block reply Wexit-Delecto 3 points 7 hours ago Legal immigration is still replacement immigration. Ask me how I know. t. a leaf permalink award report block reply CocaineNewsome 3 points 8 hours ago We outsource the manufacturing, we outsource the tech jobs. What's left for america? Bloviating as a service? permalink award report block reply Parhelion12 2 points 6 hours ago One of us needs to run for POTUS. Now. Not later. permalink award report block reply DangerousAmerican76 2 points 6 hours ago Bruh the comments on x from Indians is fucking disgusting permalink award report block reply someguy7738 2 points 5 hours ago If only we actually had any power at all, or even a bit of representation in \"our\" own government. permalink award report block reply SnakePlisken1776 2 points 4 hours ago If the government won’t do anything it doesn’t mean we can’t. It is our duty as Americans to make these invaders leave. Do not collaborate with, hire, sell to, or work with them in any way and disrespect them to their face make life here hell and they will leave. permalink award report block reply Patriot_Rob 1 points 7 hours ago I can't stand these dirty, filthy, scummy dipshits! permalink award report block reply EyesSewnShut 1 points 8 hours ago Comment removed by community moderators. permalink award report block reply\nSmallestShil 30 points 13 hours ago But trump said they’re not only vital, we need even more of them. From gas-station cashier over middle management, nepotism to the CEO, the American dream is giving everything to stinking jeets while prices increase. permalink award report block reply BoltCarrierGroup 30 points 12 hours ago Went from no jeets in my town to over 75000 in a decade (and it seems like way more) It’s disgusting. They drive up\nAmerican home prices with 3 families in each one, they hate Americans, their kids are all inbred and take up almost all of the resources in schools, plus they smell absolutely terrible. permalink parent award report block reply SmallestShil 21 points 11 hours ago Theres enough of them to airdrop a million into every single country on earth and still be left with over a billion. It’s a bucket filled with so much shit that its spilling and overflowing into every country on earth. I bet you there’s not a single place left not infested by them. permalink parent award report block reply\nBoltCarrierGroup 30 points 12 hours ago Went from no jeets in my town to over 75000 in a decade (and it seems like way more) It’s disgusting. They drive up\nSmallestShil 21 points 11 hours ago Theres enough of them to airdrop a million into every single country on earth and still be left with over a billion. It’s a bucket filled with so much shit that its spilling and overflowing into every country on earth. I bet you there’s not a single place left not infested by them. permalink parent award report block reply\nBadfinz_FL 19 points 12 hours ago Need to give the street shitters the boot They are no bueno permalink award report block reply\nstealthboy 15 points 11 hours ago Immigration has always included assimilation.  This is why things are breaking down now, because nobody is assimilating.  I see it in my own town - complete separate societies now exist with one particular demographic. permalink award report block reply\nYggdrasill 7 points 8 hours ago Well open wide then Saar because Trump is turning America into New India. I have your fell for it again awards over on ConPro permalink award report block reply\njournalist 6 points 9 hours ago Dishonest people, you can not trust them, they will always stab you in the back. permalink award report block reply Side_o_beef_curtains 10 points 9 hours ago They have invaded my area in insane numbers. I have engaged a few in more or less honest conversations about their behavior. In busines they believe \"if you arent cheating you arent trying.\" They try to fuck everyone over. Lie, cheat, outright steal. Refuse to pay what they owe. Absolute 3d world shit. They have nothing but contempt and outright hatred of us. They believe we are stupid and naive to not be constantly screwing everyone, breaking the law, bouncing checks, etc. They really believe we are stupid for letting them in at all. permalink parent award report block reply\nSide_o_beef_curtains 10 points 9 hours ago They have invaded my area in insane numbers. I have engaged a few in more or less honest conversations about their behavior. In busines they believe \"if you arent cheating you arent trying.\" They try to fuck everyone over. Lie, cheat, outright steal. Refuse to pay what they owe. Absolute 3d world shit. They have nothing but contempt and outright hatred of us. They believe we are stupid and naive to not be constantly screwing everyone, breaking the law, bouncing checks, etc. They really believe we are stupid for letting them in at all. permalink parent award report block reply\nSteveRogers42 5 points 9 hours ago That statue should get the Georgia Guidestones treatment. permalink award report block reply\nWontgoquietly 5 points 8 hours ago You’re going to have to wait for the next administration to solve these problems.  Trump and the GOP Congress have done zero on this front.  Every day is open season on US jobs. permalink award report block reply\nSpellmonger 3 points 6 hours ago I am still offended by, when, during President Trump's first term, Moodie came to Texas, rented a stadium for a howdy doody Moodie visit, and if I remember correctly, didn't include President Trump. permalink award report block reply\nWexit-Delecto 3 points 7 hours ago Legal immigration is still replacement immigration. Ask me how I know. t. a leaf permalink award report block reply\nCocaineNewsome 3 points 8 hours ago We outsource the manufacturing, we outsource the tech jobs. What's left for america? Bloviating as a service? permalink award report block reply\nParhelion12 2 points 6 hours ago One of us needs to run for POTUS. Now. Not later. permalink award report block reply\nDangerousAmerican76 2 points 6 hours ago Bruh the comments on x from Indians is fucking disgusting permalink award report block reply\nsomeguy7738 2 points 5 hours ago If only we actually had any power at all, or even a bit of representation in \"our\" own government. permalink award report block reply\nSnakePlisken1776 2 points 4 hours ago If the government won’t do anything it doesn’t mean we can’t. It is our duty as Americans to make these invaders leave. Do not collaborate with, hire, sell to, or work with them in any way and disrespect them to their face make life here hell and they will leave. permalink award report block reply\nPatriot_Rob 1 points 7 hours ago I can't stand these dirty, filthy, scummy dipshits! permalink award report block reply\nEyesSewnShut 1 points 8 hours ago Comment removed by community moderators. permalink award report block reply"}