{"id": "8184930", "contents": "248 Good for him posted 12 hours ago by wst4 46 comments award share report block AlphaFox @alphafox • 1d Man eliminates 3 kids breaking into his home, and mother claims this was an excessive use of force - were his actions justified?\n46 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style SmallestShil 37 points 11 hours ago Charge the parents. permalink award report block reply CyanScales 15 points 10 hours ago Sue the mother for harassment. And for a new door/ crime scene cleaner. permalink parent award report block reply chickeninoven 1 points 5 hours ago She should have to scrub the floor clean with her weave. permalink parent award report block reply 16BeatsAOne 15 points 11 hours ago Good luck trying to find the fathers. permalink parent award report block reply Shitsbrokeyo 2 points 6 hours ago They just dropped the seed. It's her fault. permalink parent award report block reply AgnosticTemplar 30 points 11 hours ago \"Dey wuz only tryna rob yall, y'din hava kill dem!\" Blacks will excuse their own for literally anything. The mother should be the one given the death penalty. permalink award report block reply JerryNadlerBeltFund 22 points 10 hours ago Sure. . . At 57 seconds into the video:\n\"the veteran opened fire.  ONE OF THE TEENS FIRED BACK\" Ok, so three teens who dindu nuffin armed thugs broke into a man's apartment and got their just reward. Had they gone in unarmed, they probably would have all given up, crying at the sound of the first shot.   But they escalated the situation and shot back, resulting a shootout that left them all dead. Anyway. permalink parent award report block reply 19American62Woman 13 points 11 hours ago I saw a video of boons being primitive. They asked the grandmother about the horrible behavior. I figured there would be a halfway decent response since she was so old but she stated that their behavior was commendable because of their passion. It’s who they are and I’m taking a hard pass. permalink parent award report block reply sod_off_shotgun 16 points 11 hours ago I'm giving a hard R permalink parent award report block reply SummTingWong 5 points 10 hours ago Dey wuz jus goin doh to doh raisin money foh kwire practice n sheeit. permalink parent award report block reply Wizard_Glick 20 points 11 hours ago You shoot until the threat is eliminated... permalink award report block reply AgnosticTemplar 5 points 10 hours ago Not enough ammo in the US for that, I'm afraid. Rope is reusable, though. permalink parent award report block reply boredrandomguy 20 points 11 hours ago \"my son ONLY tried to rob you...\" That bitch is fucking dumb as fuck.  The world is better off without her or her kids. permalink award report block reply Wrexxis780 4 points 6 hours ago At gunpoint too permalink parent award report block reply hannahb 17 points 11 hours ago Bet they won't do that again permalink award report block reply Justjayce 16 points 11 hours ago Translation....\"my meal tickets are dead and I'm not getting that money anymore!\" permalink award report block reply Meathe 4 points 8 hours ago Oh, that's a dark though.  Probably true, though. permalink parent award report block reply QSWO1 2 points 6 hours ago Oh snap. permalink parent award report block reply Dwoj 9 points 11 hours ago Yes it is justified! He was probably so scared for his life!! permalink award report block reply GeorgeBailey 9 points 10 hours ago I only hope that her other 4 to 6 children will lean from this and stick to shoplifting or drug dealing. Armed robbery is just too dangerous of a profession to get into. permalink award report block reply PlantTrees 7 points 11 hours ago The home invaders/burglars brought guns and broke in .. homeowner acted in self defense and should never have even been charged.  The 'authorities' should have ignored the mother of criminals demanding he be charged because victimizing him twice is wrong... If I were litigious I would say he should sue them and her for putting him through that. permalink award report block reply ElevenMile 5 points 9 hours ago Veteran looks like he can barely walk.  I don't blame him for putting 9 rounds into each sack of shit. permalink award report block reply edxzxz 3 points 8 hours ago I'm 100% fine with this vet defending himself in his home, but 28 rounds fired would require him having more than 2 fully loaded guns or several extra magazines and reloading during the chaos of 3 armed thugs breaking into his home.  Guy had to have been pretty cool under fire.  He should sue the mothers of these thugs for damage to his home and costs of ammo. permalink parent award report block reply Wakenbake 5 points 11 hours ago Thi article has a picture of the \"neighbor\" so maybe the aame one but it doesnt describe breaking entering but a robbey in the front yard? https://www.11alive.com/article/news/local/conyers/conyers-attempted-robbery/85-d344d527-7110-4d98-b06e-d655c76c7ab0 permalink award report block reply Scot 5 points 10 hours ago If she didn't want her EBT tickets to expire, she should have raised them better. permalink award report block reply T471 5 points 10 hours ago yes justified. Charge the parents? Absolutely charge them for child neglect resulting in the death of 2 minors. permalink award report block reply Maga305_47 4 points 11 hours ago Mother of the year. permalink award report block reply JiggsawCalrissian 3 points 11 hours ago Step 1: dont break in to people's homes Let's work on that before deciding if what this man did was too much or too little or just enough permalink award report block reply patriotNati0n 3 points 7 hours ago \"Why did you shoot them with 28 bullets?\" \"Because I ran out\" permalink award report block reply Donsabai 2 points 8 hours ago Get that do-nothing b i o t ch and send her to the pen for life for breeding that filth. Good for the vet! permalink award report block reply Wrexxis780 2 points 6 hours ago the man shot them in self defense and the teens fired back So entirely justified permalink award report block reply 62jawbill 2 points 7 hours ago That fat cunt worthless mother looking for some gibs should be the one in prison. These ferals went after an old man thinking he would be an easy target..parents should have to pay for the door and clean up. permalink award report block reply RedFormanIsPeeved 2 points 6 hours ago I'm wondering why the boys had to go through his house on their way to honors school??  Just asking. permalink award report block reply 73Cuda 2 points 6 hours ago The victim should sue the family for having to deal with the mental anguish that comes with ending 3 lives. permalink award report block reply MyGrandpa4 2 points 5 hours ago Breaking into a home is the 'excessive' here.  Stopping the 'excessive', permanently, is appropriate. permalink award report block reply Lol_Garrus 2 points 10 hours ago AI slop. Says the homeowner was charged then later says he wasn't charged. permalink award report block reply Aggrieved03 1 points 11 hours ago A dozen clips of different incidents edited together to create a bs story. permalink award report block reply chickeninoven 1 points 5 hours ago This is why we have no talent in our country no mo. All the rocket surgeons are getting killed by racist wypipo. permalink award report block reply Fuckommies 1 points 11 minutes ago Too bad he didn’t shoot and kill 30 million of those motherfuckers. permalink award report block reply HumphreyPlowjogger 1 points 10 hours ago Welp, they won’t threaten anyone else. permalink award report block reply Carmen1956 1 points 11 hours ago Don’t bring a knife to a gun fight!  The only way to stop this crime is to defend yourself.  Let me know if there is a fund to donate to this Vet? permalink award report block reply moscowjade 1 points 10 hours ago Same AI slop as the single mom protecting her kid permalink award report block reply reasonablydisturbed 1 points 10 hours ago Pin another medal to this man's chest. permalink award report block reply Hvacguy 1 points 8 hours ago What happened to Georgia's stand your ground law? The guy was out numbered. He used the exact amount of rounds to end the threat. permalink award report block reply\nSmallestShil 37 points 11 hours ago Charge the parents. permalink award report block reply CyanScales 15 points 10 hours ago Sue the mother for harassment. And for a new door/ crime scene cleaner. permalink parent award report block reply chickeninoven 1 points 5 hours ago She should have to scrub the floor clean with her weave. permalink parent award report block reply 16BeatsAOne 15 points 11 hours ago Good luck trying to find the fathers. permalink parent award report block reply Shitsbrokeyo 2 points 6 hours ago They just dropped the seed. It's her fault. permalink parent award report block reply\nCyanScales 15 points 10 hours ago Sue the mother for harassment. And for a new door/ crime scene cleaner. permalink parent award report block reply chickeninoven 1 points 5 hours ago She should have to scrub the floor clean with her weave. permalink parent award report block reply\nchickeninoven 1 points 5 hours ago She should have to scrub the floor clean with her weave. permalink parent award report block reply\n16BeatsAOne 15 points 11 hours ago Good luck trying to find the fathers. permalink parent award report block reply Shitsbrokeyo 2 points 6 hours ago They just dropped the seed. It's her fault. permalink parent award report block reply\nShitsbrokeyo 2 points 6 hours ago They just dropped the seed. It's her fault. permalink parent award report block reply\nAgnosticTemplar 30 points 11 hours ago \"Dey wuz only tryna rob yall, y'din hava kill dem!\" Blacks will excuse their own for literally anything. The mother should be the one given the death penalty. permalink award report block reply JerryNadlerBeltFund 22 points 10 hours ago Sure. . . At 57 seconds into the video:\n\"the veteran opened fire.  ONE OF THE TEENS FIRED BACK\" Ok, so three teens who dindu nuffin armed thugs broke into a man's apartment and got their just reward. Had they gone in unarmed, they probably would have all given up, crying at the sound of the first shot.   But they escalated the situation and shot back, resulting a shootout that left them all dead. Anyway. permalink parent award report block reply 19American62Woman 13 points 11 hours ago I saw a video of boons being primitive. They asked the grandmother about the horrible behavior. I figured there would be a halfway decent response since she was so old but she stated that their behavior was commendable because of their passion. It’s who they are and I’m taking a hard pass. permalink parent award report block reply sod_off_shotgun 16 points 11 hours ago I'm giving a hard R permalink parent award report block reply SummTingWong 5 points 10 hours ago Dey wuz jus goin doh to doh raisin money foh kwire practice n sheeit. permalink parent award report block reply\nJerryNadlerBeltFund 22 points 10 hours ago Sure. . . At 57 seconds into the video:\n\"the veteran opened fire.  ONE OF THE TEENS FIRED BACK\" Ok, so three teens who dindu nuffin armed thugs broke into a man's apartment and got their just reward. Had they gone in unarmed, they probably would have all given up, crying at the sound of the first shot.   But they escalated the situation and shot back, resulting a shootout that left them all dead. Anyway. permalink parent award report block reply\n19American62Woman 13 points 11 hours ago I saw a video of boons being primitive. They asked the grandmother about the horrible behavior. I figured there would be a halfway decent response since she was so old but she stated that their behavior was commendable because of their passion. It’s who they are and I’m taking a hard pass. permalink parent award report block reply sod_off_shotgun 16 points 11 hours ago I'm giving a hard R permalink parent award report block reply\nsod_off_shotgun 16 points 11 hours ago I'm giving a hard R permalink parent award report block reply\nSummTingWong 5 points 10 hours ago Dey wuz jus goin doh to doh raisin money foh kwire practice n sheeit. permalink parent award report block reply\nWizard_Glick 20 points 11 hours ago You shoot until the threat is eliminated... permalink award report block reply AgnosticTemplar 5 points 10 hours ago Not enough ammo in the US for that, I'm afraid. Rope is reusable, though. permalink parent award report block reply\nAgnosticTemplar 5 points 10 hours ago Not enough ammo in the US for that, I'm afraid. Rope is reusable, though. permalink parent award report block reply\nboredrandomguy 20 points 11 hours ago \"my son ONLY tried to rob you...\" That bitch is fucking dumb as fuck.  The world is better off without her or her kids. permalink award report block reply Wrexxis780 4 points 6 hours ago At gunpoint too permalink parent award report block reply\nWrexxis780 4 points 6 hours ago At gunpoint too permalink parent award report block reply\nhannahb 17 points 11 hours ago Bet they won't do that again permalink award report block reply\nJustjayce 16 points 11 hours ago Translation....\"my meal tickets are dead and I'm not getting that money anymore!\" permalink award report block reply Meathe 4 points 8 hours ago Oh, that's a dark though.  Probably true, though. permalink parent award report block reply QSWO1 2 points 6 hours ago Oh snap. permalink parent award report block reply\nMeathe 4 points 8 hours ago Oh, that's a dark though.  Probably true, though. permalink parent award report block reply\nQSWO1 2 points 6 hours ago Oh snap. permalink parent award report block reply\nDwoj 9 points 11 hours ago Yes it is justified! He was probably so scared for his life!! permalink award report block reply\nGeorgeBailey 9 points 10 hours ago I only hope that her other 4 to 6 children will lean from this and stick to shoplifting or drug dealing. Armed robbery is just too dangerous of a profession to get into. permalink award report block reply\nPlantTrees 7 points 11 hours ago The home invaders/burglars brought guns and broke in .. homeowner acted in self defense and should never have even been charged.  The 'authorities' should have ignored the mother of criminals demanding he be charged because victimizing him twice is wrong... If I were litigious I would say he should sue them and her for putting him through that. permalink award report block reply\nElevenMile 5 points 9 hours ago Veteran looks like he can barely walk.  I don't blame him for putting 9 rounds into each sack of shit. permalink award report block reply edxzxz 3 points 8 hours ago I'm 100% fine with this vet defending himself in his home, but 28 rounds fired would require him having more than 2 fully loaded guns or several extra magazines and reloading during the chaos of 3 armed thugs breaking into his home.  Guy had to have been pretty cool under fire.  He should sue the mothers of these thugs for damage to his home and costs of ammo. permalink parent award report block reply\nedxzxz 3 points 8 hours ago I'm 100% fine with this vet defending himself in his home, but 28 rounds fired would require him having more than 2 fully loaded guns or several extra magazines and reloading during the chaos of 3 armed thugs breaking into his home.  Guy had to have been pretty cool under fire.  He should sue the mothers of these thugs for damage to his home and costs of ammo. permalink parent award report block reply\nWakenbake 5 points 11 hours ago Thi article has a picture of the \"neighbor\" so maybe the aame one but it doesnt describe breaking entering but a robbey in the front yard? https://www.11alive.com/article/news/local/conyers/conyers-attempted-robbery/85-d344d527-7110-4d98-b06e-d655c76c7ab0 permalink award report block reply\nScot 5 points 10 hours ago If she didn't want her EBT tickets to expire, she should have raised them better. permalink award report block reply\nT471 5 points 10 hours ago yes justified. Charge the parents? Absolutely charge them for child neglect resulting in the death of 2 minors. permalink award report block reply\nMaga305_47 4 points 11 hours ago Mother of the year. permalink award report block reply\nJiggsawCalrissian 3 points 11 hours ago Step 1: dont break in to people's homes Let's work on that before deciding if what this man did was too much or too little or just enough permalink award report block reply\npatriotNati0n 3 points 7 hours ago \"Why did you shoot them with 28 bullets?\" \"Because I ran out\" permalink award report block reply\nDonsabai 2 points 8 hours ago Get that do-nothing b i o t ch and send her to the pen for life for breeding that filth. Good for the vet! permalink award report block reply\nWrexxis780 2 points 6 hours ago the man shot them in self defense and the teens fired back So entirely justified permalink award report block reply\n62jawbill 2 points 7 hours ago That fat cunt worthless mother looking for some gibs should be the one in prison. These ferals went after an old man thinking he would be an easy target..parents should have to pay for the door and clean up. permalink award report block reply\nRedFormanIsPeeved 2 points 6 hours ago I'm wondering why the boys had to go through his house on their way to honors school??  Just asking. permalink award report block reply\n73Cuda 2 points 6 hours ago The victim should sue the family for having to deal with the mental anguish that comes with ending 3 lives. permalink award report block reply\nMyGrandpa4 2 points 5 hours ago Breaking into a home is the 'excessive' here.  Stopping the 'excessive', permanently, is appropriate. permalink award report block reply\nLol_Garrus 2 points 10 hours ago AI slop. Says the homeowner was charged then later says he wasn't charged. permalink award report block reply\nAggrieved03 1 points 11 hours ago A dozen clips of different incidents edited together to create a bs story. permalink award report block reply\nchickeninoven 1 points 5 hours ago This is why we have no talent in our country no mo. All the rocket surgeons are getting killed by racist wypipo. permalink award report block reply\nFuckommies 1 points 11 minutes ago Too bad he didn’t shoot and kill 30 million of those motherfuckers. permalink award report block reply\nHumphreyPlowjogger 1 points 10 hours ago Welp, they won’t threaten anyone else. permalink award report block reply\nCarmen1956 1 points 11 hours ago Don’t bring a knife to a gun fight!  The only way to stop this crime is to defend yourself.  Let me know if there is a fund to donate to this Vet? permalink award report block reply\nmoscowjade 1 points 10 hours ago Same AI slop as the single mom protecting her kid permalink award report block reply\nreasonablydisturbed 1 points 10 hours ago Pin another medal to this man's chest. permalink award report block reply\nHvacguy 1 points 8 hours ago What happened to Georgia's stand your ground law? The guy was out numbered. He used the exact amount of rounds to end the threat. permalink award report block reply"}