{"id": "8184076", "contents": "1349 Glenn Beck exposes how Muslims are getting around the US Fair Housing Act and making Muslim only communities in America\n‌\nMuslim Developers are creating communities and then they create a monthly fee for all the homes, “75% of the service fee you're paying goes to the masjid posted 22 hours ago by PiratePatriotParrot 144 comments award share report block Wall Street Apes @WallStreetApes • 2d Glenn Beck exposes how Muslims are getting around the US Fair Housing Act and making Muslim only communities in America ‌ Muslim Developers are creating communities and then they create a monthly fee for all the homes, “75% of the service fee you're paying goes to the masjid — so\n144 comments Sort by Top Top New Worst Old Save LogicCircuits 90 points 22 hours ago So a Muslim HOA? permalink award report block reply The_kool_mom 76 points 22 hours ago Like a regular HOA, just more explodey. permalink parent award report block reply madeaprofilejustforu 44 points 22 hours ago And with extra goat fucking. permalink parent award report block reply maltese-poodle 13 points 21 hours ago TRUMP IS IN CHARGE OF THE DOJ. FAIR HOUSING ACT IS FEDERAL LAW. TIME TO ENFORCE IT!!! permalink parent award report block reply Aggrieved03 4 points 21 hours ago How’s the DoJ doing? permalink parent award report block reply view 1 more comments... AlohaSnackbar 11 points 21 hours ago I've seen enough HOA stories to know that it would have the exact same amount of goat-fucking. Less dogs though. permalink parent award report block reply Mortal_Wombat 1 points 15 hours ago The only HOA where it's mandatory to keep farm animals in your residence and occupying areas 🤣 permalink parent award report block reply view 1 more comments... ganachain 2 points 20 hours ago And zero bacon permalink parent award report block reply JustTheNews 1 points 11 hours ago I work for some US born Muslims.  They are good people......... but they do like a good goat fucking.... that's for sure. permalink parent award report block reply Judenfrei -2 points 21 hours ago NOT A SINGLE PERSON DIED AT SANDY HOOK ELEMENTARY SCHOOL! https://www.bitchute.com/video/XP11IBGjRW1R permalink parent award report block reply abstr4ct 27 points 22 hours ago mostly peaceful HOA. permalink parent award report block reply SavingPrivateGrace 14 points 22 hours ago with sharia laws of stoning and beheadings. permalink parent award report block reply abstr4ct 7 points 21 hours ago mostly peaceful beheadings. permalink parent award report block reply Cheesemaker 4 points 21 hours ago I prefer Karenimah not blowing up on me if I broke the HOA. permalink parent award report block reply Aoikaze2000 2 points 21 hours ago Oh, I hear it's a blast. permalink parent award report block reply Deltamyass 12 points 22 hours ago Until they start taxing residents that aren’t Muslim, just like they’re doing to Christians in Muslim countries, if not killing them. permalink parent award report block reply Awan-CIA-Car-Lot 10 points 21 hours ago The jizya tax.  Yep. permalink parent award report block reply TallestSkill 4 points 22 hours ago So it seems... so it seems... permalink parent award report block reply breadbaker 2 points 20 hours ago Tell me that the Uniparty is clawing its way back to center of the GOP, without telling me. Seriously, this whole Moooooslim crap, is just a fucking distraction like abortion, gays, trannies in bathrooms. Focus on the damn economy and tens of millions of illegals and the America Second moment. And then of course, perhaps the premier schlock uniparty dude, Glenn Beck. Seeing him psoted here is a sure sign that Trump will lose like the midterms like every loser republican likes to lose. permalink parent award report block reply GA_Logic 6 points 20 hours ago Muslims are a problem but yes Muslims are the useful idiots of choice that the globohomos use to distract the bigger crimes that they committing at the same time. permalink parent award report block reply Mortal_Wombat 3 points 15 hours ago Like their pedophile rings and 'ol Jeffery Epstein. I wonder how Jizzlaine...er...Ghislaine...is doing in her cushy minimum security Federal Inn Express since she \"revealed\" something (nothing) to \"investigators\". Surely there would have been some kind of movement by now right? What a joke. permalink parent award report block reply BlackPilledMAGA 1 points 21 hours ago There is no way around the fair housing act. permalink parent award report block reply load 1 more comments... PiratePatriotParrot OP 57 points 22 hours ago Full post: \"Glenn Beck exposes how Muslims are getting around the US Fair Housing Act and making Muslim only communities in America\nMuslim Developers are creating communities and then they create a monthly fee for all the homes, “75% of the service fee you're paying goes to the masjid — so your tax goes to the Mosque”\nThey say all potential buyers who see that fee aren’t okay with it, they don’t won’t want their money going to the mosque so no one but Muslims will buy the homes\nThis is fraud. Epic City has already been rebranded into a new development So this is how they do it, this is how Muslims create exclusive Muslim only communities in America\" permalink award report block reply FusionBlack 26 points 21 hours ago These developers should be exposed for what they are. Traitors to the citizens of this country. Most developer/builders are scum. Look at what they have done with the illegal labor they have no shame in using as slaves. This is where I part ways with the administration on how they turn a blind eye on business involved in this and never hold them accountable as it may harm business. Kind of like Chinese students and colleges. Scum. permalink parent award report block reply Aambrick 6 points 21 hours ago I thought it was agreed that most companies with 20 or more employees have some kind of practice that is scummy even if small? Did that change? permalink parent award report block reply FusionBlack 2 points 21 hours ago You are probably correct. permalink parent award report block reply Liars-Burn-In-Hell 2 points 14 hours ago Get to the root. https://api.bitchute.com/video/4B8N0MhegDuy/ permalink parent award report block reply SupFrens 35 points 22 hours ago Jeets are stealing our jobs and homes at a way higher number, why doesn't anybody on the right talk about what the Indian invasion is doing to us? permalink award report block reply MySidesGoUp 23 points 22 hours ago Too busy MI&IGA… permalink parent award report block reply bigdickhangsright 7 points 21 hours ago You know... Candace Owens may have a screw loose but sometimes it takes someone like that to speak the truth that makes people uncomfortable. She's right about the Israeli lobby in the US, so what if she has some hot takes on other topics? permalink parent award report block reply Buce-Nudo 4 points 20 hours ago She's alright on the subject but she's a big softy for islam lately. Suspicious. A lot kf the support she gets is unfortunstely from lefty opportunists trying to take advantage of the chaos they caused by killing Charlie Kirk with their FBI Patriot Front buddies. permalink parent award report block reply MediaBro 3 points 17 hours ago Her husband is good friends with Andrew Tate and so is she. That itself should make you wary of this woman. permalink parent award report block reply MySidesGoUp 1 points 20 hours ago Maybe being black doesn’t help her.  There’s a certain disdain for govt culturally. That might be off putting for the average joe but folks are coming around to it. I like the idea of embracing what we have. We’re not going to be a perfect utopia. But getting away from racial politics is fresh as all American communities are facing the same struggles. permalink parent award report block reply newestofnew 12 points 22 hours ago the ownership class supports it. that's why they launched the hindu jewish conference. because they have each others backs. permalink parent award report block reply DCPower 5 points 20 hours ago Well a group that wants to cut off your head literally and a group that is unhygienic…which do you think people will be more concerned about? permalink parent award report block reply GayPatriotMAGAUncle 5 points 22 hours ago Who gives a fuck? Muslims are bigger threats anyways. Projection much? permalink parent award report block reply BidenShowerDrool 1 points 21 hours ago 5 years ago i may have agreed but today both are as bad as each other in today's environment and pose a very existential threat to the nation, it's culture and it's way of life as it rapidly evaporates as more keep coming in. permalink parent award report block reply logan34 1 points 17 hours ago bigger threat is aipac and how they are opening our borders permalink parent award report block reply Yawnz13 4 points 22 hours ago They do, quit strawmanning. permalink parent award report block reply load 17 more comments... newestofnew 20 points 22 hours ago they modeled it after places like kiryas joel, you know an ethnic enclave where tax dollars go towards religious services and schools. whoops sorry I forgot its not bad or discriminatory when certain ethnicities want their own communities permalink award report block reply NomadicKrow2 12 points 22 hours ago The problem is they have whole fucking countries. permalink parent award report block reply Awan-CIA-Car-Lot 10 points 21 hours ago And they want this country, too permalink parent award report block reply Buce-Nudo 3 points 20 hours ago I want their oil again. Let's bomb these hajis. permalink parent award report block reply Awan-CIA-Car-Lot 4 points 20 hours ago It's pretty good oil, too, unlike Venezuela that yields nothing but sludge. permalink parent award report block reply Smurfection 10 points 21 hours ago When communities like Kiryas Joel move in, their main tactic is buying a single family home, then stuffing in multiple families, taking over the city council, devaluing the property and basically harassing non-Jews until they leave.    They even make fake \"police\" to go around telling non-Jewish women to cover up out of respect. permalink parent award report block reply newestofnew 6 points 21 hours ago correct settler tactics permalink parent award report block reply Hanging_Chad 18 points 22 hours ago masjid = mosque 🕌🤲🏾🕋 permalink award report block reply boredrandomguy 17 points 22 hours ago Texas Governor needs to shut that down ASAP. If it doesn't already exist, a law that no HOA fee/tax whatever goes to any mosque, temple, or church should be made. permalink award report block reply negative_entropy 5 points 22 hours ago it was already shut down I think. beck is reporting on old shit permalink parent award report block reply SaltyTitties4 8 points 21 hours ago What makes you believe it was actually shut down?  Because the news said it? And what does it mean to “shut it down?”  Are the going to force all those Muslims in those communities to move? permalink parent award report block reply BidenShowerDrool 5 points 21 hours ago correct...it quietly re-opens under a new obscure name and it's business as usual. I've been around long enough to know how these operation work. permalink parent award report block reply TwoArizonaPedes 2 points 10 hours ago Then you fight it again. And again. However many times it takes. This is our country, not theirs. permalink parent award report block reply Beardholder 5 points 21 hours ago Nope. Its back up and they are calling it The Meadows now. permalink parent award report block reply MySidesGoUp 11 points 22 hours ago Is Glenn gonna talk about religious exemptions to avoid paying interest on mortgages??? permalink award report block reply TerrorAndSlaughter 11 points 22 hours ago Seems like anyone could do that.  You set up a neighborhood with an HOA.  Then set the bylaws to collect a fee triple what is typical and two thirds of the fee goes to your Church/community center/Jared Taylor Center for White Excellence.  Whatever you set as the center will filter for the kind of people you get.  If someone else moves in, they're still supporting the cause financially. Though that would be if we had the fair application of the law in America.  DNC pet groups can skirt the laws while enemies of the managerial class get the book thrown at them. permalink award report block reply Awan-CIA-Car-Lot 9 points 21 hours ago Jared Taylor Center for White Excellence Perfect!  Lol  😂 👍 permalink parent award report block reply MediaBro 7 points 16 hours ago What about a centre for \"White Kids Who Can't Read Good and Who Wanna Learn to Do Other Stuff Good Too\"? permalink parent award report block reply Trumpy_Bear 9 points 21 hours ago Sounds like an interesting way to do a Christian community. But on the other hand it sounds like behavior that could count as religious discrimination permalink award report block reply expertnoticer 8 points 22 hours ago Sharia Law is coming for every street in every zip code that allows this to continue. permalink award report block reply XpatDemocrat 8 points 22 hours ago Goyim Glen, Israeli operative, showing us that muslims are the real issue. Send tgem all to somalia and chemtrail the whole middle east with pig fat and dog feces permalink award report block reply KernalMustard 2 points 21 hours ago We know. Sheep being led by the nose. permalink parent award report block reply Seeker_17 0 points 15 hours ago Fuck off, muzzie POS permalink parent award report block reply XpatDemocrat 1 points 8 hours ago Comment removed by community filter. permalink parent award report block reply Yawnz13 -1 points 22 hours ago Hey rabbi, what'cha doin? permalink parent award report block reply RogueLeaderX 8 points 22 hours ago Christians should be doing this very thing too! 75% goes to the Church! permalink award report block reply hilboggins 3 points 12 hours ago Except when Christians do it the pastor becomes a millionaire lol permalink parent award report block reply MediaBro 1 points 16 hours ago Honestly, not a bad idea. Start doing it. permalink parent award report block reply madeaprofilejustforu 7 points 22 hours ago Air. Drop. Bacon. permalink award report block reply abstr4ct 7 points 22 hours ago I wonder if the fbi will ruby ridge them? permalink award report block reply Smurfection 6 points 21 hours ago umm, this seems like a major violation of the law.  Religious organizations can't levy fees and taxes on a private home.   An association fee for a community has to have a service or product rendered.  This is a lawsuit waiting to happen. What would happen if they charged a fee to Christians that moved in and so the Christians wanted to have a Christian service at the mosque?  If they're paying a fee, they get to use the facility, right?  If you bar the Christians, then it's religious discrimination. permalink award report block reply BKav 5 points 21 hours ago Let’s be fair.  What non Muslim would want to move into a majority Muslim community even without a monthly fee? permalink award report block reply throwawayStudent 4 points 22 hours ago Christians should do this??? permalink award report block reply SomecatsareMAGA 4 points 21 hours ago I can't believe the US has let this happen. Basically taking over. Build a mosque and they will come. A few years ago one was built in our midsize town. It's so bizarre to watch with our own eyes. Government let it happen. :( permalink award report block reply TwoArizonaPedes 1 points 10 hours ago Who cares what the government does? We're the ones who need to fight this, however many times it takes. permalink parent award report block reply sovereign_citizen 4 points 21 hours ago Muslims don't believe in usury so, like Jews, they have special programs setup that don't charge them interest. Christians need to get wise as serpents to compete. permalink award report block reply TwoArizonaPedes 1 points 10 hours ago Except that they add other fees and complications that are in effect interest. It's all a lie, like everything in Islam. permalink parent award report block reply knnbccb 3 points 14 hours ago Sooner or later you have to Waco them all. It's a hard choice you have to make. Reminder: their kind breeds like rabbits. The longer you procrastinate, the tougher it will be for infidels. permalink award report block reply Beardholder 3 points 21 hours ago Time to ban ISLAM LIKE YESTERDAY permalink award report block reply hilboggins 3 points 12 hours ago From Muslims I've interacted with they seem to be more organized than Christians. Their donations to the masjid is either used to reinvest in their community or partially sent to an international Muslim organizations that help Muslims in need around the world. Usually when Christians donate it's going back into the Church to turn it into a concert venue or the pastor becomes a multi-millionaire... permalink award report block reply Antemalagon 3 points 20 hours ago Expel and ban all muslims from the US. permalink award report block reply Shaffro 3 points 14 hours ago We need to do more deporting. permalink award report block reply genericamerican69 3 points 16 hours ago God damnit permalink award report block reply suckmycorona 2 points 21 hours ago Obviously this is our representatives representing our best interests /s permalink award report block reply NeilNewsNetwork 2 points 16 hours ago All right, so hear me out… We start a community and 75% of the service fee goes to a bacon delivery service. permalink award report block reply cardinaldrones 2 points 18 hours ago So how do we do this for white people?  There’s tons of affordable houses, but they’re all in black areas.  That’s why we have a housing crisis.  When people say the prices of housing is out of reach for the American dream now, they only mean white areas near established suburbs(more population- more demand).  And it’s mostly liberals complaining, yet refusing to live around the people they support so much. permalink award report block reply astralentity 2 points 11 hours ago This is nothing new for us is NY.... we still have that Islamberg near Deposit, just north of where SH-8 and SH-10 meet up with I-86. permalink award report block reply Seeker_17 2 points 15 hours ago Illegal. permalink award report block reply Tacitus1963 2 points 16 hours ago And where is the former jogger-in-chief, Valerie Jarrett, Brennan -all Muslims- in all of this? permalink award report block reply bill_in_texas 2 points 20 hours ago Deed restrictions: Prohibited: ~Parking on the lawn ~Dogs ~Pork products and pigs ~Bibles ~American flags ~any flavor of homo ~any flavor of non Muslims Required: ~goats ~suicide vests ~trucks of peace ~guns stored at the masjid permalink award report block reply BBvarn 2 points 11 hours ago Time for the Negroes to be bussed in. permalink award report block reply ViagraFalls 2 points 22 hours ago All of the shitty brown people can simply use all the thugs and criminals to make others not want to live there. White people don’t have enough thugs and criminals, and also, there will be some do-gooder snitches turning in white protectors to the police. permalink award report block reply fightfightfightx 2 points 21 hours ago illegal but we arent a nation of laws anymore permalink award report block reply Hikedelics 2 points 22 hours ago So all we have to do is set up neighborhoods where the fee goes towards never allowing an HOA to form and the rest to Turning Point USA? Or someone like David Duke? Who or what would an all white, or at least an all Christian + conservative neighborhood send money to in order to keep the filth out? permalink award report block reply Jack_NC 2 points 21 hours ago In other words, return to 1964. permalink parent award report block reply 1777 -2 points 21 hours ago gaaaay permalink parent award report block reply Ryker 2 points 19 hours ago Sounds easy to fix permalink award report block reply Pelosi_Halitosis 1 points 10 hours ago I never wanted to be in an HOA. However, after looking at two types of properties to escape Illinois, restricted and unrestricted. We chose the restricted property, which is basically an HOA. There are some very nice unrestricted properties. However, they're either not easily accessible or you have neighbors that collect junk and live in trailers, or have both. For $350/year we get paved access to our property, which is plowed to the county road, and simple property restrictions. There are no Karen's complaining about colors, fencing, or the mailbox. However, the restrictions dictate what minimum size and type of house can be built, setbacks for outbuildings, etc. Basically, not all HOAs are bad. However, living under a Sharia HOA has to be the most restrictive use of an HOA that could ever happen. I couldn't imagine being fined 25 lashes for sleeping through the call to prayer. permalink award report block reply Goozmania 1 points 13 hours ago Glen beck left the blaze and within 2 weeks, the blaze ended all their comedy shows; Alex stein and normal world. permalink award report block reply bananafone 1 points 19 hours ago Why don't Christians do this? permalink award report block reply LolitaExpressPilot 1 points 21 hours ago Say what you will about George Bluth Sr. but he'd never do this. permalink award report block reply BusterHyman99 1 points 22 hours ago It's not illegal so there's nothing we can do. Except do it ourselves. Create white only community permalink award report block reply Smurfection 8 points 21 hours ago It is illegal.  Are you kidding?  If this was legal don't you think they would be a religious group that would have made a whole town, or a whites only town.  I mean I would dream of having a traditional Catholic city and let me tell ya, traditional Catholics would flock to such a place.  Mormons (not the mainline LDS Mormons) try to pull these sorts of stunts all the time and eventually they all get shut down. Eventually, there will be some sort of dispute that will trigger a lawsuit. permalink parent award report block reply Get_Off_Big_Tech 4 points 21 hours ago Fees go to bacon cheeseburgers at the church. permalink parent award report block reply UltraFrogMan 1 points 14 hours ago Thought they didnt like usury permalink award report block reply Choomguy 4 points 12 hours ago They don’t, but they still pay it on their loans, kinda like this scam.   They just call it something else.  Dishonest frauds… permalink parent award report block reply TwoArizonaPedes 2 points 10 hours ago They have interest, they just call it something else and pretend it isn't interest. It's all a big lie, like everything in Islam. permalink parent award report block reply learntocode 1 points 16 hours ago Bro, the real scandal is they can afford homes?!?!?! permalink award report block reply SenorTrumper 1 points 22 hours ago FYI https://www.youtube.com/watch?v=9_5kNMX9I_g permalink award report block reply Psalm-118_24 1 points 10 hours ago islam=hindu=jino=not good for America. permalink award report block reply utfanx2 1 points 22 hours ago Congrats, you played yourself. permalink award report block reply Dev404 1 points 8 hours ago Make no mistake, they get away with it all because the governments let them. Our government, at all levels, have been guilty of treason for decades. permalink award report block reply finnigan 1 points 10 hours ago Isn't that what Jewish communities like Kiryas Joel are?  Only white Christians can't be special. permalink award report block reply ZacPetkanas 1 points 14 hours ago Shouldn't Glenn be handing out Teddy bears and soccer balls to illegals? permalink award report block reply BirthHole 0 points 10 hours ago Glen, its your buddies in Israel using OUR money to ship those mooslims over here.   You dumb mormon. permalink award report block reply yodayoda 0 points 19 hours ago more crying and whining from my side i see 😭 \"muslims are doing this! muslims are doing that!\" duhhhh... you let them in? 🤷 permalink award report block reply Treefiddydiddy 0 points 13 hours ago maybe if fellow tribe members hart / cellar , lerner spectre , mayorkas etc didn't use USAID cash to bring them all in we wouldn't be in this fucking MESS permalink award report block reply Nate_Higgersalot 0 points 20 hours ago I had no idea this fag was still around. Does he still put Cheeto dust on his face to mock Trump? permalink award report block reply QSWO1 0 points 19 hours ago This fuck stick new this in 2016 when he rolled his face in cheetos. Glen Beck is a wannabe faggot. permalink award report block reply sneak -1 points 20 hours ago That's actually based. Private housing where the owner can choose who lives there? Sounds good. There are some people doing that in Arkansas right now and morons are whining about it. permalink award report block reply drmrboy -1 points 21 hours ago Gee ... I wonder if the current administration will do something about it.  🤓 permalink award report block reply TrumpRideorDie74 -1 points 22 hours ago Fuck Glenn Beck. If your old enough to know, you know. permalink award report block reply YearninNation -1 points 20 hours ago Fuck this fatass faggot permalink award report block reply MathletesFoot -2 points 14 hours ago Trump doesn't care. permalink award report block reply Michalusmichalus 2 points 11 hours ago Trump could build his own community right next to theirs just to piss them off. Bring it to his attention. permalink parent award report block reply\nLogicCircuits 90 points 22 hours ago So a Muslim HOA? permalink award report block reply The_kool_mom 76 points 22 hours ago Like a regular HOA, just more explodey. permalink parent award report block reply madeaprofilejustforu 44 points 22 hours ago And with extra goat fucking. permalink parent award report block reply maltese-poodle 13 points 21 hours ago TRUMP IS IN CHARGE OF THE DOJ. FAIR HOUSING ACT IS FEDERAL LAW. TIME TO ENFORCE IT!!! permalink parent award report block reply Aggrieved03 4 points 21 hours ago How’s the DoJ doing? permalink parent award report block reply view 1 more comments... AlohaSnackbar 11 points 21 hours ago I've seen enough HOA stories to know that it would have the exact same amount of goat-fucking. Less dogs though. permalink parent award report block reply Mortal_Wombat 1 points 15 hours ago The only HOA where it's mandatory to keep farm animals in your residence and occupying areas 🤣 permalink parent award report block reply view 1 more comments... ganachain 2 points 20 hours ago And zero bacon permalink parent award report block reply JustTheNews 1 points 11 hours ago I work for some US born Muslims.  They are good people......... but they do like a good goat fucking.... that's for sure. permalink parent award report block reply Judenfrei -2 points 21 hours ago NOT A SINGLE PERSON DIED AT SANDY HOOK ELEMENTARY SCHOOL! https://www.bitchute.com/video/XP11IBGjRW1R permalink parent award report block reply abstr4ct 27 points 22 hours ago mostly peaceful HOA. permalink parent award report block reply SavingPrivateGrace 14 points 22 hours ago with sharia laws of stoning and beheadings. permalink parent award report block reply abstr4ct 7 points 21 hours ago mostly peaceful beheadings. permalink parent award report block reply Cheesemaker 4 points 21 hours ago I prefer Karenimah not blowing up on me if I broke the HOA. permalink parent award report block reply Aoikaze2000 2 points 21 hours ago Oh, I hear it's a blast. permalink parent award report block reply Deltamyass 12 points 22 hours ago Until they start taxing residents that aren’t Muslim, just like they’re doing to Christians in Muslim countries, if not killing them. permalink parent award report block reply Awan-CIA-Car-Lot 10 points 21 hours ago The jizya tax.  Yep. permalink parent award report block reply TallestSkill 4 points 22 hours ago So it seems... so it seems... permalink parent award report block reply breadbaker 2 points 20 hours ago Tell me that the Uniparty is clawing its way back to center of the GOP, without telling me. Seriously, this whole Moooooslim crap, is just a fucking distraction like abortion, gays, trannies in bathrooms. Focus on the damn economy and tens of millions of illegals and the America Second moment. And then of course, perhaps the premier schlock uniparty dude, Glenn Beck. Seeing him psoted here is a sure sign that Trump will lose like the midterms like every loser republican likes to lose. permalink parent award report block reply GA_Logic 6 points 20 hours ago Muslims are a problem but yes Muslims are the useful idiots of choice that the globohomos use to distract the bigger crimes that they committing at the same time. permalink parent award report block reply Mortal_Wombat 3 points 15 hours ago Like their pedophile rings and 'ol Jeffery Epstein. I wonder how Jizzlaine...er...Ghislaine...is doing in her cushy minimum security Federal Inn Express since she \"revealed\" something (nothing) to \"investigators\". Surely there would have been some kind of movement by now right? What a joke. permalink parent award report block reply BlackPilledMAGA 1 points 21 hours ago There is no way around the fair housing act. permalink parent award report block reply load 1 more comments...\nThe_kool_mom 76 points 22 hours ago Like a regular HOA, just more explodey. permalink parent award report block reply madeaprofilejustforu 44 points 22 hours ago And with extra goat fucking. permalink parent award report block reply maltese-poodle 13 points 21 hours ago TRUMP IS IN CHARGE OF THE DOJ. FAIR HOUSING ACT IS FEDERAL LAW. TIME TO ENFORCE IT!!! permalink parent award report block reply Aggrieved03 4 points 21 hours ago How’s the DoJ doing? permalink parent award report block reply view 1 more comments... AlohaSnackbar 11 points 21 hours ago I've seen enough HOA stories to know that it would have the exact same amount of goat-fucking. Less dogs though. permalink parent award report block reply Mortal_Wombat 1 points 15 hours ago The only HOA where it's mandatory to keep farm animals in your residence and occupying areas 🤣 permalink parent award report block reply view 1 more comments... ganachain 2 points 20 hours ago And zero bacon permalink parent award report block reply JustTheNews 1 points 11 hours ago I work for some US born Muslims.  They are good people......... but they do like a good goat fucking.... that's for sure. permalink parent award report block reply Judenfrei -2 points 21 hours ago NOT A SINGLE PERSON DIED AT SANDY HOOK ELEMENTARY SCHOOL! https://www.bitchute.com/video/XP11IBGjRW1R permalink parent award report block reply abstr4ct 27 points 22 hours ago mostly peaceful HOA. permalink parent award report block reply SavingPrivateGrace 14 points 22 hours ago with sharia laws of stoning and beheadings. permalink parent award report block reply abstr4ct 7 points 21 hours ago mostly peaceful beheadings. permalink parent award report block reply Cheesemaker 4 points 21 hours ago I prefer Karenimah not blowing up on me if I broke the HOA. permalink parent award report block reply Aoikaze2000 2 points 21 hours ago Oh, I hear it's a blast. permalink parent award report block reply\nmadeaprofilejustforu 44 points 22 hours ago And with extra goat fucking. permalink parent award report block reply maltese-poodle 13 points 21 hours ago TRUMP IS IN CHARGE OF THE DOJ. FAIR HOUSING ACT IS FEDERAL LAW. TIME TO ENFORCE IT!!! permalink parent award report block reply Aggrieved03 4 points 21 hours ago How’s the DoJ doing? permalink parent award report block reply view 1 more comments... AlohaSnackbar 11 points 21 hours ago I've seen enough HOA stories to know that it would have the exact same amount of goat-fucking. Less dogs though. permalink parent award report block reply Mortal_Wombat 1 points 15 hours ago The only HOA where it's mandatory to keep farm animals in your residence and occupying areas 🤣 permalink parent award report block reply view 1 more comments... ganachain 2 points 20 hours ago And zero bacon permalink parent award report block reply JustTheNews 1 points 11 hours ago I work for some US born Muslims.  They are good people......... but they do like a good goat fucking.... that's for sure. permalink parent award report block reply Judenfrei -2 points 21 hours ago NOT A SINGLE PERSON DIED AT SANDY HOOK ELEMENTARY SCHOOL! https://www.bitchute.com/video/XP11IBGjRW1R permalink parent award report block reply\nmaltese-poodle 13 points 21 hours ago TRUMP IS IN CHARGE OF THE DOJ. FAIR HOUSING ACT IS FEDERAL LAW. TIME TO ENFORCE IT!!! permalink parent award report block reply Aggrieved03 4 points 21 hours ago How’s the DoJ doing? permalink parent award report block reply view 1 more comments...\nAggrieved03 4 points 21 hours ago How’s the DoJ doing? permalink parent award report block reply view 1 more comments...\nAlohaSnackbar 11 points 21 hours ago I've seen enough HOA stories to know that it would have the exact same amount of goat-fucking. Less dogs though. permalink parent award report block reply Mortal_Wombat 1 points 15 hours ago The only HOA where it's mandatory to keep farm animals in your residence and occupying areas 🤣 permalink parent award report block reply view 1 more comments...\nMortal_Wombat 1 points 15 hours ago The only HOA where it's mandatory to keep farm animals in your residence and occupying areas 🤣 permalink parent award report block reply view 1 more comments...\nganachain 2 points 20 hours ago And zero bacon permalink parent award report block reply\nJustTheNews 1 points 11 hours ago I work for some US born Muslims.  They are good people......... but they do like a good goat fucking.... that's for sure. permalink parent award report block reply\nJudenfrei -2 points 21 hours ago NOT A SINGLE PERSON DIED AT SANDY HOOK ELEMENTARY SCHOOL! https://www.bitchute.com/video/XP11IBGjRW1R permalink parent award report block reply\nabstr4ct 27 points 22 hours ago mostly peaceful HOA. permalink parent award report block reply SavingPrivateGrace 14 points 22 hours ago with sharia laws of stoning and beheadings. permalink parent award report block reply abstr4ct 7 points 21 hours ago mostly peaceful beheadings. permalink parent award report block reply\nSavingPrivateGrace 14 points 22 hours ago with sharia laws of stoning and beheadings. permalink parent award report block reply abstr4ct 7 points 21 hours ago mostly peaceful beheadings. permalink parent award report block reply\nabstr4ct 7 points 21 hours ago mostly peaceful beheadings. permalink parent award report block reply\nCheesemaker 4 points 21 hours ago I prefer Karenimah not blowing up on me if I broke the HOA. permalink parent award report block reply\nAoikaze2000 2 points 21 hours ago Oh, I hear it's a blast. permalink parent award report block reply\nDeltamyass 12 points 22 hours ago Until they start taxing residents that aren’t Muslim, just like they’re doing to Christians in Muslim countries, if not killing them. permalink parent award report block reply Awan-CIA-Car-Lot 10 points 21 hours ago The jizya tax.  Yep. permalink parent award report block reply\nAwan-CIA-Car-Lot 10 points 21 hours ago The jizya tax.  Yep. permalink parent award report block reply\nTallestSkill 4 points 22 hours ago So it seems... so it seems... permalink parent award report block reply\nbreadbaker 2 points 20 hours ago Tell me that the Uniparty is clawing its way back to center of the GOP, without telling me. Seriously, this whole Moooooslim crap, is just a fucking distraction like abortion, gays, trannies in bathrooms. Focus on the damn economy and tens of millions of illegals and the America Second moment. And then of course, perhaps the premier schlock uniparty dude, Glenn Beck. Seeing him psoted here is a sure sign that Trump will lose like the midterms like every loser republican likes to lose. permalink parent award report block reply GA_Logic 6 points 20 hours ago Muslims are a problem but yes Muslims are the useful idiots of choice that the globohomos use to distract the bigger crimes that they committing at the same time. permalink parent award report block reply Mortal_Wombat 3 points 15 hours ago Like their pedophile rings and 'ol Jeffery Epstein. I wonder how Jizzlaine...er...Ghislaine...is doing in her cushy minimum security Federal Inn Express since she \"revealed\" something (nothing) to \"investigators\". Surely there would have been some kind of movement by now right? What a joke. permalink parent award report block reply\nGA_Logic 6 points 20 hours ago Muslims are a problem but yes Muslims are the useful idiots of choice that the globohomos use to distract the bigger crimes that they committing at the same time. permalink parent award report block reply Mortal_Wombat 3 points 15 hours ago Like their pedophile rings and 'ol Jeffery Epstein. I wonder how Jizzlaine...er...Ghislaine...is doing in her cushy minimum security Federal Inn Express since she \"revealed\" something (nothing) to \"investigators\". Surely there would have been some kind of movement by now right? What a joke. permalink parent award report block reply\nMortal_Wombat 3 points 15 hours ago Like their pedophile rings and 'ol Jeffery Epstein. I wonder how Jizzlaine...er...Ghislaine...is doing in her cushy minimum security Federal Inn Express since she \"revealed\" something (nothing) to \"investigators\". Surely there would have been some kind of movement by now right? What a joke. permalink parent award report block reply\nBlackPilledMAGA 1 points 21 hours ago There is no way around the fair housing act. permalink parent award report block reply\nPiratePatriotParrot OP 57 points 22 hours ago Full post: \"Glenn Beck exposes how Muslims are getting around the US Fair Housing Act and making Muslim only communities in America\nThis is fraud. Epic City has already been rebranded into a new development So this is how they do it, this is how Muslims create exclusive Muslim only communities in America\" permalink award report block reply FusionBlack 26 points 21 hours ago These developers should be exposed for what they are. Traitors to the citizens of this country. Most developer/builders are scum. Look at what they have done with the illegal labor they have no shame in using as slaves. This is where I part ways with the administration on how they turn a blind eye on business involved in this and never hold them accountable as it may harm business. Kind of like Chinese students and colleges. Scum. permalink parent award report block reply Aambrick 6 points 21 hours ago I thought it was agreed that most companies with 20 or more employees have some kind of practice that is scummy even if small? Did that change? permalink parent award report block reply FusionBlack 2 points 21 hours ago You are probably correct. permalink parent award report block reply Liars-Burn-In-Hell 2 points 14 hours ago Get to the root. https://api.bitchute.com/video/4B8N0MhegDuy/ permalink parent award report block reply\nFusionBlack 26 points 21 hours ago These developers should be exposed for what they are. Traitors to the citizens of this country. Most developer/builders are scum. Look at what they have done with the illegal labor they have no shame in using as slaves. This is where I part ways with the administration on how they turn a blind eye on business involved in this and never hold them accountable as it may harm business. Kind of like Chinese students and colleges. Scum. permalink parent award report block reply Aambrick 6 points 21 hours ago I thought it was agreed that most companies with 20 or more employees have some kind of practice that is scummy even if small? Did that change? permalink parent award report block reply FusionBlack 2 points 21 hours ago You are probably correct. permalink parent award report block reply\nAambrick 6 points 21 hours ago I thought it was agreed that most companies with 20 or more employees have some kind of practice that is scummy even if small? Did that change? permalink parent award report block reply FusionBlack 2 points 21 hours ago You are probably correct. permalink parent award report block reply\nFusionBlack 2 points 21 hours ago You are probably correct. permalink parent award report block reply\nLiars-Burn-In-Hell 2 points 14 hours ago Get to the root. https://api.bitchute.com/video/4B8N0MhegDuy/ permalink parent award report block reply\nSupFrens 35 points 22 hours ago Jeets are stealing our jobs and homes at a way higher number, why doesn't anybody on the right talk about what the Indian invasion is doing to us? permalink award report block reply MySidesGoUp 23 points 22 hours ago Too busy MI&IGA… permalink parent award report block reply bigdickhangsright 7 points 21 hours ago You know... Candace Owens may have a screw loose but sometimes it takes someone like that to speak the truth that makes people uncomfortable. She's right about the Israeli lobby in the US, so what if she has some hot takes on other topics? permalink parent award report block reply Buce-Nudo 4 points 20 hours ago She's alright on the subject but she's a big softy for islam lately. Suspicious. A lot kf the support she gets is unfortunstely from lefty opportunists trying to take advantage of the chaos they caused by killing Charlie Kirk with their FBI Patriot Front buddies. permalink parent award report block reply MediaBro 3 points 17 hours ago Her husband is good friends with Andrew Tate and so is she. That itself should make you wary of this woman. permalink parent award report block reply MySidesGoUp 1 points 20 hours ago Maybe being black doesn’t help her.  There’s a certain disdain for govt culturally. That might be off putting for the average joe but folks are coming around to it. I like the idea of embracing what we have. We’re not going to be a perfect utopia. But getting away from racial politics is fresh as all American communities are facing the same struggles. permalink parent award report block reply newestofnew 12 points 22 hours ago the ownership class supports it. that's why they launched the hindu jewish conference. because they have each others backs. permalink parent award report block reply DCPower 5 points 20 hours ago Well a group that wants to cut off your head literally and a group that is unhygienic…which do you think people will be more concerned about? permalink parent award report block reply GayPatriotMAGAUncle 5 points 22 hours ago Who gives a fuck? Muslims are bigger threats anyways. Projection much? permalink parent award report block reply BidenShowerDrool 1 points 21 hours ago 5 years ago i may have agreed but today both are as bad as each other in today's environment and pose a very existential threat to the nation, it's culture and it's way of life as it rapidly evaporates as more keep coming in. permalink parent award report block reply logan34 1 points 17 hours ago bigger threat is aipac and how they are opening our borders permalink parent award report block reply Yawnz13 4 points 22 hours ago They do, quit strawmanning. permalink parent award report block reply load 17 more comments...\nMySidesGoUp 23 points 22 hours ago Too busy MI&IGA… permalink parent award report block reply bigdickhangsright 7 points 21 hours ago You know... Candace Owens may have a screw loose but sometimes it takes someone like that to speak the truth that makes people uncomfortable. She's right about the Israeli lobby in the US, so what if she has some hot takes on other topics? permalink parent award report block reply Buce-Nudo 4 points 20 hours ago She's alright on the subject but she's a big softy for islam lately. Suspicious. A lot kf the support she gets is unfortunstely from lefty opportunists trying to take advantage of the chaos they caused by killing Charlie Kirk with their FBI Patriot Front buddies. permalink parent award report block reply MediaBro 3 points 17 hours ago Her husband is good friends with Andrew Tate and so is she. That itself should make you wary of this woman. permalink parent award report block reply MySidesGoUp 1 points 20 hours ago Maybe being black doesn’t help her.  There’s a certain disdain for govt culturally. That might be off putting for the average joe but folks are coming around to it. I like the idea of embracing what we have. We’re not going to be a perfect utopia. But getting away from racial politics is fresh as all American communities are facing the same struggles. permalink parent award report block reply\nbigdickhangsright 7 points 21 hours ago You know... Candace Owens may have a screw loose but sometimes it takes someone like that to speak the truth that makes people uncomfortable. She's right about the Israeli lobby in the US, so what if she has some hot takes on other topics? permalink parent award report block reply Buce-Nudo 4 points 20 hours ago She's alright on the subject but she's a big softy for islam lately. Suspicious. A lot kf the support she gets is unfortunstely from lefty opportunists trying to take advantage of the chaos they caused by killing Charlie Kirk with their FBI Patriot Front buddies. permalink parent award report block reply MediaBro 3 points 17 hours ago Her husband is good friends with Andrew Tate and so is she. That itself should make you wary of this woman. permalink parent award report block reply MySidesGoUp 1 points 20 hours ago Maybe being black doesn’t help her.  There’s a certain disdain for govt culturally. That might be off putting for the average joe but folks are coming around to it. I like the idea of embracing what we have. We’re not going to be a perfect utopia. But getting away from racial politics is fresh as all American communities are facing the same struggles. permalink parent award report block reply\nBuce-Nudo 4 points 20 hours ago She's alright on the subject but she's a big softy for islam lately. Suspicious. A lot kf the support she gets is unfortunstely from lefty opportunists trying to take advantage of the chaos they caused by killing Charlie Kirk with their FBI Patriot Front buddies. permalink parent award report block reply MediaBro 3 points 17 hours ago Her husband is good friends with Andrew Tate and so is she. That itself should make you wary of this woman. permalink parent award report block reply\nMediaBro 3 points 17 hours ago Her husband is good friends with Andrew Tate and so is she. That itself should make you wary of this woman. permalink parent award report block reply\nMySidesGoUp 1 points 20 hours ago Maybe being black doesn’t help her.  There’s a certain disdain for govt culturally. That might be off putting for the average joe but folks are coming around to it. I like the idea of embracing what we have. We’re not going to be a perfect utopia. But getting away from racial politics is fresh as all American communities are facing the same struggles. permalink parent award report block reply\nnewestofnew 12 points 22 hours ago the ownership class supports it. that's why they launched the hindu jewish conference. because they have each others backs. permalink parent award report block reply\nDCPower 5 points 20 hours ago Well a group that wants to cut off your head literally and a group that is unhygienic…which do you think people will be more concerned about? permalink parent award report block reply\nGayPatriotMAGAUncle 5 points 22 hours ago Who gives a fuck? Muslims are bigger threats anyways. Projection much? permalink parent award report block reply BidenShowerDrool 1 points 21 hours ago 5 years ago i may have agreed but today both are as bad as each other in today's environment and pose a very existential threat to the nation, it's culture and it's way of life as it rapidly evaporates as more keep coming in. permalink parent award report block reply logan34 1 points 17 hours ago bigger threat is aipac and how they are opening our borders permalink parent award report block reply\nBidenShowerDrool 1 points 21 hours ago 5 years ago i may have agreed but today both are as bad as each other in today's environment and pose a very existential threat to the nation, it's culture and it's way of life as it rapidly evaporates as more keep coming in. permalink parent award report block reply\nlogan34 1 points 17 hours ago bigger threat is aipac and how they are opening our borders permalink parent award report block reply\nYawnz13 4 points 22 hours ago They do, quit strawmanning. permalink parent award report block reply\nnewestofnew 20 points 22 hours ago they modeled it after places like kiryas joel, you know an ethnic enclave where tax dollars go towards religious services and schools. whoops sorry I forgot its not bad or discriminatory when certain ethnicities want their own communities permalink award report block reply NomadicKrow2 12 points 22 hours ago The problem is they have whole fucking countries. permalink parent award report block reply Awan-CIA-Car-Lot 10 points 21 hours ago And they want this country, too permalink parent award report block reply Buce-Nudo 3 points 20 hours ago I want their oil again. Let's bomb these hajis. permalink parent award report block reply Awan-CIA-Car-Lot 4 points 20 hours ago It's pretty good oil, too, unlike Venezuela that yields nothing but sludge. permalink parent award report block reply Smurfection 10 points 21 hours ago When communities like Kiryas Joel move in, their main tactic is buying a single family home, then stuffing in multiple families, taking over the city council, devaluing the property and basically harassing non-Jews until they leave.    They even make fake \"police\" to go around telling non-Jewish women to cover up out of respect. permalink parent award report block reply newestofnew 6 points 21 hours ago correct settler tactics permalink parent award report block reply\nNomadicKrow2 12 points 22 hours ago The problem is they have whole fucking countries. permalink parent award report block reply Awan-CIA-Car-Lot 10 points 21 hours ago And they want this country, too permalink parent award report block reply Buce-Nudo 3 points 20 hours ago I want their oil again. Let's bomb these hajis. permalink parent award report block reply Awan-CIA-Car-Lot 4 points 20 hours ago It's pretty good oil, too, unlike Venezuela that yields nothing but sludge. permalink parent award report block reply\nAwan-CIA-Car-Lot 10 points 21 hours ago And they want this country, too permalink parent award report block reply Buce-Nudo 3 points 20 hours ago I want their oil again. Let's bomb these hajis. permalink parent award report block reply Awan-CIA-Car-Lot 4 points 20 hours ago It's pretty good oil, too, unlike Venezuela that yields nothing but sludge. permalink parent award report block reply\nBuce-Nudo 3 points 20 hours ago I want their oil again. Let's bomb these hajis. permalink parent award report block reply Awan-CIA-Car-Lot 4 points 20 hours ago It's pretty good oil, too, unlike Venezuela that yields nothing but sludge. permalink parent award report block reply\nAwan-CIA-Car-Lot 4 points 20 hours ago It's pretty good oil, too, unlike Venezuela that yields nothing but sludge. permalink parent award report block reply\nSmurfection 10 points 21 hours ago When communities like Kiryas Joel move in, their main tactic is buying a single family home, then stuffing in multiple families, taking over the city council, devaluing the property and basically harassing non-Jews until they leave.    They even make fake \"police\" to go around telling non-Jewish women to cover up out of respect. permalink parent award report block reply newestofnew 6 points 21 hours ago correct settler tactics permalink parent award report block reply\nnewestofnew 6 points 21 hours ago correct settler tactics permalink parent award report block reply\nHanging_Chad 18 points 22 hours ago masjid = mosque 🕌🤲🏾🕋 permalink award report block reply\nboredrandomguy 17 points 22 hours ago Texas Governor needs to shut that down ASAP. If it doesn't already exist, a law that no HOA fee/tax whatever goes to any mosque, temple, or church should be made. permalink award report block reply negative_entropy 5 points 22 hours ago it was already shut down I think. beck is reporting on old shit permalink parent award report block reply SaltyTitties4 8 points 21 hours ago What makes you believe it was actually shut down?  Because the news said it? And what does it mean to “shut it down?”  Are the going to force all those Muslims in those communities to move? permalink parent award report block reply BidenShowerDrool 5 points 21 hours ago correct...it quietly re-opens under a new obscure name and it's business as usual. I've been around long enough to know how these operation work. permalink parent award report block reply TwoArizonaPedes 2 points 10 hours ago Then you fight it again. And again. However many times it takes. This is our country, not theirs. permalink parent award report block reply Beardholder 5 points 21 hours ago Nope. Its back up and they are calling it The Meadows now. permalink parent award report block reply\nnegative_entropy 5 points 22 hours ago it was already shut down I think. beck is reporting on old shit permalink parent award report block reply SaltyTitties4 8 points 21 hours ago What makes you believe it was actually shut down?  Because the news said it? And what does it mean to “shut it down?”  Are the going to force all those Muslims in those communities to move? permalink parent award report block reply BidenShowerDrool 5 points 21 hours ago correct...it quietly re-opens under a new obscure name and it's business as usual. I've been around long enough to know how these operation work. permalink parent award report block reply TwoArizonaPedes 2 points 10 hours ago Then you fight it again. And again. However many times it takes. This is our country, not theirs. permalink parent award report block reply Beardholder 5 points 21 hours ago Nope. Its back up and they are calling it The Meadows now. permalink parent award report block reply\nSaltyTitties4 8 points 21 hours ago What makes you believe it was actually shut down?  Because the news said it? And what does it mean to “shut it down?”  Are the going to force all those Muslims in those communities to move? permalink parent award report block reply BidenShowerDrool 5 points 21 hours ago correct...it quietly re-opens under a new obscure name and it's business as usual. I've been around long enough to know how these operation work. permalink parent award report block reply TwoArizonaPedes 2 points 10 hours ago Then you fight it again. And again. However many times it takes. This is our country, not theirs. permalink parent award report block reply\nBidenShowerDrool 5 points 21 hours ago correct...it quietly re-opens under a new obscure name and it's business as usual. I've been around long enough to know how these operation work. permalink parent award report block reply TwoArizonaPedes 2 points 10 hours ago Then you fight it again. And again. However many times it takes. This is our country, not theirs. permalink parent award report block reply\nTwoArizonaPedes 2 points 10 hours ago Then you fight it again. And again. However many times it takes. This is our country, not theirs. permalink parent award report block reply\nBeardholder 5 points 21 hours ago Nope. Its back up and they are calling it The Meadows now. permalink parent award report block reply\nMySidesGoUp 11 points 22 hours ago Is Glenn gonna talk about religious exemptions to avoid paying interest on mortgages??? permalink award report block reply\nTerrorAndSlaughter 11 points 22 hours ago Seems like anyone could do that.  You set up a neighborhood with an HOA.  Then set the bylaws to collect a fee triple what is typical and two thirds of the fee goes to your Church/community center/Jared Taylor Center for White Excellence.  Whatever you set as the center will filter for the kind of people you get.  If someone else moves in, they're still supporting the cause financially. Though that would be if we had the fair application of the law in America.  DNC pet groups can skirt the laws while enemies of the managerial class get the book thrown at them. permalink award report block reply Awan-CIA-Car-Lot 9 points 21 hours ago Jared Taylor Center for White Excellence Perfect!  Lol  😂 👍 permalink parent award report block reply MediaBro 7 points 16 hours ago What about a centre for \"White Kids Who Can't Read Good and Who Wanna Learn to Do Other Stuff Good Too\"? permalink parent award report block reply\nAwan-CIA-Car-Lot 9 points 21 hours ago Jared Taylor Center for White Excellence Perfect!  Lol  😂 👍 permalink parent award report block reply MediaBro 7 points 16 hours ago What about a centre for \"White Kids Who Can't Read Good and Who Wanna Learn to Do Other Stuff Good Too\"? permalink parent award report block reply\nMediaBro 7 points 16 hours ago What about a centre for \"White Kids Who Can't Read Good and Who Wanna Learn to Do Other Stuff Good Too\"? permalink parent award report block reply\nTrumpy_Bear 9 points 21 hours ago Sounds like an interesting way to do a Christian community. But on the other hand it sounds like behavior that could count as religious discrimination permalink award report block reply\nexpertnoticer 8 points 22 hours ago Sharia Law is coming for every street in every zip code that allows this to continue. permalink award report block reply\nXpatDemocrat 8 points 22 hours ago Goyim Glen, Israeli operative, showing us that muslims are the real issue. Send tgem all to somalia and chemtrail the whole middle east with pig fat and dog feces permalink award report block reply KernalMustard 2 points 21 hours ago We know. Sheep being led by the nose. permalink parent award report block reply Seeker_17 0 points 15 hours ago Fuck off, muzzie POS permalink parent award report block reply XpatDemocrat 1 points 8 hours ago Comment removed by community filter. permalink parent award report block reply Yawnz13 -1 points 22 hours ago Hey rabbi, what'cha doin? permalink parent award report block reply\nKernalMustard 2 points 21 hours ago We know. Sheep being led by the nose. permalink parent award report block reply\nSeeker_17 0 points 15 hours ago Fuck off, muzzie POS permalink parent award report block reply XpatDemocrat 1 points 8 hours ago Comment removed by community filter. permalink parent award report block reply\nXpatDemocrat 1 points 8 hours ago Comment removed by community filter. permalink parent award report block reply\nYawnz13 -1 points 22 hours ago Hey rabbi, what'cha doin? permalink parent award report block reply\nRogueLeaderX 8 points 22 hours ago Christians should be doing this very thing too! 75% goes to the Church! permalink award report block reply hilboggins 3 points 12 hours ago Except when Christians do it the pastor becomes a millionaire lol permalink parent award report block reply MediaBro 1 points 16 hours ago Honestly, not a bad idea. Start doing it. permalink parent award report block reply\nhilboggins 3 points 12 hours ago Except when Christians do it the pastor becomes a millionaire lol permalink parent award report block reply\nMediaBro 1 points 16 hours ago Honestly, not a bad idea. Start doing it. permalink parent award report block reply\nmadeaprofilejustforu 7 points 22 hours ago Air. Drop. Bacon. permalink award report block reply\nabstr4ct 7 points 22 hours ago I wonder if the fbi will ruby ridge them? permalink award report block reply\nSmurfection 6 points 21 hours ago umm, this seems like a major violation of the law.  Religious organizations can't levy fees and taxes on a private home.   An association fee for a community has to have a service or product rendered.  This is a lawsuit waiting to happen. What would happen if they charged a fee to Christians that moved in and so the Christians wanted to have a Christian service at the mosque?  If they're paying a fee, they get to use the facility, right?  If you bar the Christians, then it's religious discrimination. permalink award report block reply\nBKav 5 points 21 hours ago Let’s be fair.  What non Muslim would want to move into a majority Muslim community even without a monthly fee? permalink award report block reply\nthrowawayStudent 4 points 22 hours ago Christians should do this??? permalink award report block reply\nSomecatsareMAGA 4 points 21 hours ago I can't believe the US has let this happen. Basically taking over. Build a mosque and they will come. A few years ago one was built in our midsize town. It's so bizarre to watch with our own eyes. Government let it happen. :( permalink award report block reply TwoArizonaPedes 1 points 10 hours ago Who cares what the government does? We're the ones who need to fight this, however many times it takes. permalink parent award report block reply\nTwoArizonaPedes 1 points 10 hours ago Who cares what the government does? We're the ones who need to fight this, however many times it takes. permalink parent award report block reply\nsovereign_citizen 4 points 21 hours ago Muslims don't believe in usury so, like Jews, they have special programs setup that don't charge them interest. Christians need to get wise as serpents to compete. permalink award report block reply TwoArizonaPedes 1 points 10 hours ago Except that they add other fees and complications that are in effect interest. It's all a lie, like everything in Islam. permalink parent award report block reply\nTwoArizonaPedes 1 points 10 hours ago Except that they add other fees and complications that are in effect interest. It's all a lie, like everything in Islam. permalink parent award report block reply\nknnbccb 3 points 14 hours ago Sooner or later you have to Waco them all. It's a hard choice you have to make. Reminder: their kind breeds like rabbits. The longer you procrastinate, the tougher it will be for infidels. permalink award report block reply\nBeardholder 3 points 21 hours ago Time to ban ISLAM LIKE YESTERDAY permalink award report block reply\nhilboggins 3 points 12 hours ago From Muslims I've interacted with they seem to be more organized than Christians. Their donations to the masjid is either used to reinvest in their community or partially sent to an international Muslim organizations that help Muslims in need around the world. Usually when Christians donate it's going back into the Church to turn it into a concert venue or the pastor becomes a multi-millionaire... permalink award report block reply\nAntemalagon 3 points 20 hours ago Expel and ban all muslims from the US. permalink award report block reply\nShaffro 3 points 14 hours ago We need to do more deporting. permalink award report block reply\ngenericamerican69 3 points 16 hours ago God damnit permalink award report block reply\nsuckmycorona 2 points 21 hours ago Obviously this is our representatives representing our best interests /s permalink award report block reply\nNeilNewsNetwork 2 points 16 hours ago All right, so hear me out… We start a community and 75% of the service fee goes to a bacon delivery service. permalink award report block reply\ncardinaldrones 2 points 18 hours ago So how do we do this for white people?  There’s tons of affordable houses, but they’re all in black areas.  That’s why we have a housing crisis.  When people say the prices of housing is out of reach for the American dream now, they only mean white areas near established suburbs(more population- more demand).  And it’s mostly liberals complaining, yet refusing to live around the people they support so much. permalink award report block reply\nastralentity 2 points 11 hours ago This is nothing new for us is NY.... we still have that Islamberg near Deposit, just north of where SH-8 and SH-10 meet up with I-86. permalink award report block reply\nSeeker_17 2 points 15 hours ago Illegal. permalink award report block reply\nTacitus1963 2 points 16 hours ago And where is the former jogger-in-chief, Valerie Jarrett, Brennan -all Muslims- in all of this? permalink award report block reply\nbill_in_texas 2 points 20 hours ago Deed restrictions: Prohibited: ~Parking on the lawn ~Dogs ~Pork products and pigs ~Bibles ~American flags ~any flavor of homo ~any flavor of non Muslims Required: ~goats ~suicide vests ~trucks of peace ~guns stored at the masjid permalink award report block reply\nBBvarn 2 points 11 hours ago Time for the Negroes to be bussed in. permalink award report block reply\nViagraFalls 2 points 22 hours ago All of the shitty brown people can simply use all the thugs and criminals to make others not want to live there. White people don’t have enough thugs and criminals, and also, there will be some do-gooder snitches turning in white protectors to the police. permalink award report block reply\nfightfightfightx 2 points 21 hours ago illegal but we arent a nation of laws anymore permalink award report block reply\nHikedelics 2 points 22 hours ago So all we have to do is set up neighborhoods where the fee goes towards never allowing an HOA to form and the rest to Turning Point USA? Or someone like David Duke? Who or what would an all white, or at least an all Christian + conservative neighborhood send money to in order to keep the filth out? permalink award report block reply Jack_NC 2 points 21 hours ago In other words, return to 1964. permalink parent award report block reply 1777 -2 points 21 hours ago gaaaay permalink parent award report block reply\nJack_NC 2 points 21 hours ago In other words, return to 1964. permalink parent award report block reply\n1777 -2 points 21 hours ago gaaaay permalink parent award report block reply\nRyker 2 points 19 hours ago Sounds easy to fix permalink award report block reply\nPelosi_Halitosis 1 points 10 hours ago I never wanted to be in an HOA. However, after looking at two types of properties to escape Illinois, restricted and unrestricted. We chose the restricted property, which is basically an HOA. There are some very nice unrestricted properties. However, they're either not easily accessible or you have neighbors that collect junk and live in trailers, or have both. For $350/year we get paved access to our property, which is plowed to the county road, and simple property restrictions. There are no Karen's complaining about colors, fencing, or the mailbox. However, the restrictions dictate what minimum size and type of house can be built, setbacks for outbuildings, etc. Basically, not all HOAs are bad. However, living under a Sharia HOA has to be the most restrictive use of an HOA that could ever happen. I couldn't imagine being fined 25 lashes for sleeping through the call to prayer. permalink award report block reply\nGoozmania 1 points 13 hours ago Glen beck left the blaze and within 2 weeks, the blaze ended all their comedy shows; Alex stein and normal world. permalink award report block reply\nbananafone 1 points 19 hours ago Why don't Christians do this? permalink award report block reply\nLolitaExpressPilot 1 points 21 hours ago Say what you will about George Bluth Sr. but he'd never do this. permalink award report block reply\nBusterHyman99 1 points 22 hours ago It's not illegal so there's nothing we can do. Except do it ourselves. Create white only community permalink award report block reply Smurfection 8 points 21 hours ago It is illegal.  Are you kidding?  If this was legal don't you think they would be a religious group that would have made a whole town, or a whites only town.  I mean I would dream of having a traditional Catholic city and let me tell ya, traditional Catholics would flock to such a place.  Mormons (not the mainline LDS Mormons) try to pull these sorts of stunts all the time and eventually they all get shut down. Eventually, there will be some sort of dispute that will trigger a lawsuit. permalink parent award report block reply Get_Off_Big_Tech 4 points 21 hours ago Fees go to bacon cheeseburgers at the church. permalink parent award report block reply\nSmurfection 8 points 21 hours ago It is illegal.  Are you kidding?  If this was legal don't you think they would be a religious group that would have made a whole town, or a whites only town.  I mean I would dream of having a traditional Catholic city and let me tell ya, traditional Catholics would flock to such a place.  Mormons (not the mainline LDS Mormons) try to pull these sorts of stunts all the time and eventually they all get shut down. Eventually, there will be some sort of dispute that will trigger a lawsuit. permalink parent award report block reply\nGet_Off_Big_Tech 4 points 21 hours ago Fees go to bacon cheeseburgers at the church. permalink parent award report block reply\nUltraFrogMan 1 points 14 hours ago Thought they didnt like usury permalink award report block reply Choomguy 4 points 12 hours ago They don’t, but they still pay it on their loans, kinda like this scam.   They just call it something else.  Dishonest frauds… permalink parent award report block reply TwoArizonaPedes 2 points 10 hours ago They have interest, they just call it something else and pretend it isn't interest. It's all a big lie, like everything in Islam. permalink parent award report block reply\nChoomguy 4 points 12 hours ago They don’t, but they still pay it on their loans, kinda like this scam.   They just call it something else.  Dishonest frauds… permalink parent award report block reply\nTwoArizonaPedes 2 points 10 hours ago They have interest, they just call it something else and pretend it isn't interest. It's all a big lie, like everything in Islam. permalink parent award report block reply\nlearntocode 1 points 16 hours ago Bro, the real scandal is they can afford homes?!?!?! permalink award report block reply\nSenorTrumper 1 points 22 hours ago FYI https://www.youtube.com/watch?v=9_5kNMX9I_g permalink award report block reply\nPsalm-118_24 1 points 10 hours ago islam=hindu=jino=not good for America. permalink award report block reply\nutfanx2 1 points 22 hours ago Congrats, you played yourself. permalink award report block reply\nDev404 1 points 8 hours ago Make no mistake, they get away with it all because the governments let them. Our government, at all levels, have been guilty of treason for decades. permalink award report block reply\nfinnigan 1 points 10 hours ago Isn't that what Jewish communities like Kiryas Joel are?  Only white Christians can't be special. permalink award report block reply\nZacPetkanas 1 points 14 hours ago Shouldn't Glenn be handing out Teddy bears and soccer balls to illegals? permalink award report block reply\nBirthHole 0 points 10 hours ago Glen, its your buddies in Israel using OUR money to ship those mooslims over here.   You dumb mormon. permalink award report block reply\nyodayoda 0 points 19 hours ago more crying and whining from my side i see 😭 \"muslims are doing this! muslims are doing that!\" duhhhh... you let them in? 🤷 permalink award report block reply\nTreefiddydiddy 0 points 13 hours ago maybe if fellow tribe members hart / cellar , lerner spectre , mayorkas etc didn't use USAID cash to bring them all in we wouldn't be in this fucking MESS permalink award report block reply\nNate_Higgersalot 0 points 20 hours ago I had no idea this fag was still around. Does he still put Cheeto dust on his face to mock Trump? permalink award report block reply\nQSWO1 0 points 19 hours ago This fuck stick new this in 2016 when he rolled his face in cheetos. Glen Beck is a wannabe faggot. permalink award report block reply\nsneak -1 points 20 hours ago That's actually based. Private housing where the owner can choose who lives there? Sounds good. There are some people doing that in Arkansas right now and morons are whining about it. permalink award report block reply\ndrmrboy -1 points 21 hours ago Gee ... I wonder if the current administration will do something about it.  🤓 permalink award report block reply\nTrumpRideorDie74 -1 points 22 hours ago Fuck Glenn Beck. If your old enough to know, you know. permalink award report block reply\nYearninNation -1 points 20 hours ago Fuck this fatass faggot permalink award report block reply\nMathletesFoot -2 points 14 hours ago Trump doesn't care. permalink award report block reply Michalusmichalus 2 points 11 hours ago Trump could build his own community right next to theirs just to piss them off. Bring it to his attention. permalink parent award report block reply\nMichalusmichalus 2 points 11 hours ago Trump could build his own community right next to theirs just to piss them off. Bring it to his attention. permalink parent award report block reply"}