{"id": "8185612", "contents": "311 So Shaniqua, who is unemployed and on welfare with 8 kids wil get $2k per kid and another $2k for herself. \nBut the other family who works full time and both parents make $51k each and actually pay all the tariffs and taxes get nothing. \nWinning!!!....? posted 6 hours ago by Crucible 71 comments award share download report block\n71 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget HeavenlyTrumpets 63 points 6 hours ago Plenty of families making more than $100000 per year are still not doing as well as people think.  (raises hand from experience) permalink award report block reply 38WendysHamSquare79 25 points 6 hours ago Especially in more expensive cities. permalink parent award report block reply NukeTheTroons 23 points 5 hours ago Especially in white neighborhoods… I’m sick of paying a premium just to keep my family safe. permalink parent award report block reply Appeal2Heaven98 9 points 5 hours ago \"If you can't live here, maybe you should not live here.\" -Ben \"Shekel\" Shapiro permalink parent award report block reply SanityGumby 1 points 35 minutes ago Don’t live in expensive places if you don’t have the money for it permalink parent award report block reply MissingTrump 16 points 5 hours ago This is just another welfare boost for the EBT crowd. So fatigued. permalink parent award report block reply Stlpoolguy 5 points 5 hours ago Because we/they are actually paying their way.....    freeloaders deserve shit, no taxes paid...no monies! permalink parent award report block reply SanityGumby 2 points 36 minutes ago Spend your money better permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago That's barely above the median household income of $83,730 (as of 2024). $2,000 seems like nothing at that point, no? I make only $40,000 as an individual, so what do I know? permalink parent award report block reply load 2 more comments... Zskills 25 points 6 hours ago It's just vote buying.  EBT-Americans LOVED Trump for the stimmy checks in 2020. This is midterm propaganda. permalink award report block reply TheThreeSeashells 13 points 5 hours ago And it won't work.  The people they think they're trying to buy will still side with the people who promise them more and more handouts every election cycle, which is, of course, Leftists.  This will just be a waste of money and will likely piss off a lot of MAGA supporters who, once again, are going to get overlooked. If this keeps up, I get the feeling next year's inevitable rallies aren't going to be as positively received nor have the same fun atmosphere as they have in the past.  There's a lot of anger brewing in the MAGA base from being overlooked.  The H1B bullshit isn't helping. permalink parent award report block reply elgordo 4 points 5 hours ago THIS. It has to be done until we are in a place where we have gotten rid of more rinos and secure 2026. If we don't, we lose. We don't have the luxury of doing the \"right thing.\" We need to understand that half the population votes based on bullshit like this. Our enemies know this and have been beating the tar out of us for decades. We need to do these things now, until we get in a better spot where handouts simply won't be needed anymore. permalink parent award report block reply Appeal2Heaven98 2 points 5 hours ago As TheThreeSeashells said above, it probably won't work. The ones getting the EBT benefits are likely voting blue no matter who. I think if anything, it might turn off some on the right. permalink parent award report block reply NukeTheTroons 2 points 5 hours ago That’s why anyone who is a net negative should not have the right to vote. Why wouldn’t they vote for free shit? It’s common sense permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago How about instead of giving away \"free money\" from tariffs, we just focus on making things less expensive at the grocery store? I'm tired of \"free shit.\" permalink parent award report block reply SanityGumby 1 points 34 minutes ago Things are less expensive at the grocery store permalink parent award report block reply edxzxz 20 points 6 hours ago This is retarded.  You're over $36 trillion in debt - pay down the debt, or cut taxes. permalink award report block reply TheThreeSeashells 14 points 5 hours ago cut taxes How about that one.  Everyone benefits and it should have longer term effects as long as they cement those cuts in.  Not some bullshit where they either expire in a year or two or will easily be revoked whenever government wants to screw everyone over again.  And make them meaningful.  Not some 0.10% cut bullshit. permalink parent award report block reply Appeal2Heaven98 3 points 5 hours ago But it's \"free\" money! permalink parent award report block reply Spaceforcedropout -1 points 49 minutes ago Nah, I'm done with giving a shit about our debt ever being paid off. It won't be. Even if Trump made a little dent in it, the next guy would just ramp up spending again. An extra $4,000 cash would keep my family warm, fed and housed all winter while my wife takes some time off work to be with the kids. I'll just take that. permalink parent award report block reply Magma_Biscuit 17 points 6 hours ago If you get a refund check you don’t deserve a 2k stimmi If your on any govt assistance you don’t deserve a stimmi If you work for the govt you don’t deserve a stimmi Only the 50 some odd percent of people that actually pay taxes deserve a stimmi permalink award report block reply S11houette 11 points 5 hours ago Yes But the only thing getting a refund check means is that you overpaid your taxes. permalink parent award report block reply Zskills 7 points 5 hours ago This is true.  Perhaps a better criterion would be \"net taxpayer\" permalink parent award report block reply RocksCanOnlyWait 8 points 5 hours ago Income tax refund is what you overpaid to the government. That shouldn't disqualify you. Agree with the rest. permalink parent award report block reply Magma_Biscuit -3 points 4 hours ago I claim single and 0 dependents and still have to pay at the end of the year, people getting refund checks are mostly due to “credits” that they qualify for which means others have to pay for those credits. It is not because you always pay to much. Just remember, if you qualify for credits and get a refund, other tax payers have to pay for those. Screwed up system really. permalink parent award report block reply mathteach314159 3 points 3 hours ago Most employers will put you in a tax bracket that favors paying more taxes than you will owe. So either you or your employer simply chose a tax rate that is lower than your actual tax bracket, and therefore you owe money at the end of the year. Thats all that means and you can’t infer anything about anyone else based off of your individual experience. I get the feeling you are young and inexperienced with the tax cycle. Also, Its ok for the government to incentivize things like having children, being charitable, etc… permalink parent award report block reply RocksCanOnlyWait 1 points 4 hours ago The income tax paid to the government is based on what you elect to deduct from each paycheck. Most default it to deduct based only on your salary. When you add in other income, such as bank interest, you can owe money. If you didn't account for above standard deductions, then you end up over-paying. The EIC is one of the few handouts on that form. I would be fine with a lower rate and no deductions. permalink parent award report block reply IlhanOmarsFagBrother 1 points 1 hour ago How about if you are in the bottom 50% of earners who don't contribute to federal tax receipts at all anyway, you don't get shit. permalink parent award report block reply Thrilly 9 points 5 hours ago Just give every American a tax credit.  Don't just hand them inflation checks. permalink award report block reply UsedOnlyThrice 2 points 5 hours ago Tax credit wouldn't pay out until 2027. permalink parent award report block reply Datamancer 8 points 6 hours ago Yup.  It makes sense to the establishment since they want that money pumped right back  into the economy (read stock market) and not saved or used to clear debt. Who will do that?  People making less than $100,000. permalink award report block reply chickeninoven 5 points 5 hours ago Walfuckingmart must have a rock hard cock a mile long. permalink parent award report block reply Datamancer 3 points 5 hours ago Yes.  As well as the tobacco companies, breweries, Nike, Sony, and every other retailer - especially Amazon. We will see a record Christmas shopping season and a broad uptick in markets followed by a sell off in January once the heroin wears off. permalink parent award report block reply JoePlumber 8 points 6 hours ago I agree this is bullshit and animalistic. The majority of families making less than 100k are fucking Democrats. permalink award report block reply Zskills 4 points 5 hours ago Less than 30K IE professional welfare recipients voted Kamala.  People between 30k and 100K voted Trump. Overall, people under 100K voted more for Trump. permalink parent award report block reply hoopinfloyd 7 points 5 hours ago Wow starting to fucking hate this admin. When do we get mass deportations? When do we get H1-B revocations? When do we stop funding the low lifes with taxes? When do we get prosecutions? When do we get election integrity? permalink award report block reply TheTelltaleFly 3 points 5 hours ago At this point I half expect him to exclude American citizens from this plan. permalink parent award report block reply stealthboy 1 points 3 hours ago Never.  The uniparty always wins. permalink parent award report block reply Whoopies_tds 5 points 5 hours ago Should be a pre-requisite that if you paid nothing into the system you get nothing back because your a useless POS leech permalink award report block reply General_Specific 5 points 5 hours ago There are actually a lot of hard working citizens who don't pay into the system for different reasons. One being survival. They can't afford to make ends meet if they do and are forced to work \"under the table\". i don't condemn those people. If taxation is theft, which a lot of us agree with, they are simply doing what they can without letting themselves get pickpocketed by govt. permalink parent award report block reply suckmycorona 2 points 5 hours ago And no vote. permalink parent award report block reply PhantomShield72 4 points 5 hours ago I VOTED FOR THIS WHAT THE FUCK IS THIS permalink award report block reply tt777 4 points 5 hours ago This is retarded. permalink award report block reply NdNcenti 4 points 5 hours ago Welp I won’t qualify, but what I will do is buy 2k more in silver, because reasons permalink award report block reply GA_Logic 4 points 6 hours ago Key word is making money aka working. permalink award report block reply shadypollster 4 points 6 hours ago And having valid tax return is my guess. Like the stimmies. We will see soon enough. permalink parent award report block reply MemeWarsVet 4 points 6 hours ago Fuck. This. permalink award report block reply astralentity 3 points 6 hours ago Can it be W2 and not AGI please? permalink award report block reply marriedwitchfarmvote 2 points 2 hours ago This boost is really going to help us! I hope it is real and also comes before the holidays. I was planning to cut back on gifts, because sudden medical bills made everything tight. With 2k I can shore up the savings and feel comfortable going into Christmas. Thank You Santa Trump! permalink award report block reply king_cocoon 2 points 5 hours ago Cool. I'll take yours, then. permalink award report block reply SmartyPants 2 points 5 hours ago Just put it towards paying off our debt.\n~ Signed the American People. permalink award report block reply Aquamine-Amarine 2 points 1 hour ago Anyone on government assistance should be disqualified from getting this. permalink award report block reply utfanx2 2 points 5 hours ago He steals from the poor, and gives to the rich. Stupid bitch! permalink award report block reply RedStoneDeepState 2 points 5 hours ago A family making less than 100k is either living in the trailer park or on welfare. permalink award report block reply The_Yakuza 2 points 2 hours ago Depends where you live. There’s new housing around me starting at 200-250k for 3 bed 2 bath. Not everywhere is 400k plus for a house. My household income is slightly less than 100k and I live pretty comfortably. No trailer parks no welfare. permalink parent award report block reply d4tm4ss 1 points 5 hours ago Is this before or after taxes? permalink award report block reply General_Specific 1 points 5 hours ago Families on public aid should not get the money. That would make no sense. permalink award report block reply WarOfTheFanboys2 1 points 4 hours ago Deported for being an anti-Trump communist permalink award report block reply CommiesBane 1 points 3 hours ago Great, I guess my decent salary, stay at home wife, and nine kids precludes me from the tariff check. permalink award report block reply FUCK_TYLER 1 points 36 minutes ago 😩😩😩😭 permalink award report block reply SanityGumby 1 points 36 minutes ago I see you are retarded permalink award report block reply Crappydatum 1 points 5 hours ago But remember, the people here screaming about H1B think Shaniqua is automagically superior because she's \"American\" permalink award report block reply indigo_truther 1 points 3 hours ago I hate this but probably good branding.  Nobody making less than $100k knows what a tariff is and will now be more likely to support them. permalink award report block reply CALI_MAGA_MAMA 1 points 56 minutes ago This will so much help working class families who make just a little too much to get any help. We're squeezed so hard. 100k is great income unless you live in a big city. permalink award report block reply deleted 1 points 6 hours ago DirtyDiaperJoe 3 points 6 hours ago Agree.  Any kind of rebate/refund to any AMERICANS, who are legal citizens, is fine by me.  What I want to stop, is the squatters getting ANY government benefits or mortgages or any financial help.  I want them to GET THE FUCK OUT. permalink parent award report block reply shadypollster 2 points 6 hours ago Yeah Americans and other natives should be entitled to a basic social safety net for when times are tough. Our blood is being sucked by foreigner SCUM. Our blood is being spilled by EBT SCUM. permalink parent award report block reply DirtyDiaperJoe 0 points 6 hours ago Had to run to Walmart last night for something.  Got out of car, and here comes some Hispanic bitch, with SEVEN fucking kids.  7!  All speaking Spanish.  We're fucked. permalink parent award report block reply HeavenlyTrumpets 1 points 6 hours ago should be under $200k or $250k permalink parent award report block reply\nHeavenlyTrumpets 63 points 6 hours ago Plenty of families making more than $100000 per year are still not doing as well as people think.  (raises hand from experience) permalink award report block reply 38WendysHamSquare79 25 points 6 hours ago Especially in more expensive cities. permalink parent award report block reply NukeTheTroons 23 points 5 hours ago Especially in white neighborhoods… I’m sick of paying a premium just to keep my family safe. permalink parent award report block reply Appeal2Heaven98 9 points 5 hours ago \"If you can't live here, maybe you should not live here.\" -Ben \"Shekel\" Shapiro permalink parent award report block reply SanityGumby 1 points 35 minutes ago Don’t live in expensive places if you don’t have the money for it permalink parent award report block reply MissingTrump 16 points 5 hours ago This is just another welfare boost for the EBT crowd. So fatigued. permalink parent award report block reply Stlpoolguy 5 points 5 hours ago Because we/they are actually paying their way.....    freeloaders deserve shit, no taxes paid...no monies! permalink parent award report block reply SanityGumby 2 points 36 minutes ago Spend your money better permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago That's barely above the median household income of $83,730 (as of 2024). $2,000 seems like nothing at that point, no? I make only $40,000 as an individual, so what do I know? permalink parent award report block reply load 2 more comments...\n38WendysHamSquare79 25 points 6 hours ago Especially in more expensive cities. permalink parent award report block reply NukeTheTroons 23 points 5 hours ago Especially in white neighborhoods… I’m sick of paying a premium just to keep my family safe. permalink parent award report block reply Appeal2Heaven98 9 points 5 hours ago \"If you can't live here, maybe you should not live here.\" -Ben \"Shekel\" Shapiro permalink parent award report block reply SanityGumby 1 points 35 minutes ago Don’t live in expensive places if you don’t have the money for it permalink parent award report block reply\nNukeTheTroons 23 points 5 hours ago Especially in white neighborhoods… I’m sick of paying a premium just to keep my family safe. permalink parent award report block reply\nAppeal2Heaven98 9 points 5 hours ago \"If you can't live here, maybe you should not live here.\" -Ben \"Shekel\" Shapiro permalink parent award report block reply\nSanityGumby 1 points 35 minutes ago Don’t live in expensive places if you don’t have the money for it permalink parent award report block reply\nMissingTrump 16 points 5 hours ago This is just another welfare boost for the EBT crowd. So fatigued. permalink parent award report block reply\nStlpoolguy 5 points 5 hours ago Because we/they are actually paying their way.....    freeloaders deserve shit, no taxes paid...no monies! permalink parent award report block reply\nSanityGumby 2 points 36 minutes ago Spend your money better permalink parent award report block reply\nAppeal2Heaven98 1 points 5 hours ago That's barely above the median household income of $83,730 (as of 2024). $2,000 seems like nothing at that point, no? I make only $40,000 as an individual, so what do I know? permalink parent award report block reply\nZskills 25 points 6 hours ago It's just vote buying.  EBT-Americans LOVED Trump for the stimmy checks in 2020. This is midterm propaganda. permalink award report block reply TheThreeSeashells 13 points 5 hours ago And it won't work.  The people they think they're trying to buy will still side with the people who promise them more and more handouts every election cycle, which is, of course, Leftists.  This will just be a waste of money and will likely piss off a lot of MAGA supporters who, once again, are going to get overlooked. If this keeps up, I get the feeling next year's inevitable rallies aren't going to be as positively received nor have the same fun atmosphere as they have in the past.  There's a lot of anger brewing in the MAGA base from being overlooked.  The H1B bullshit isn't helping. permalink parent award report block reply elgordo 4 points 5 hours ago THIS. It has to be done until we are in a place where we have gotten rid of more rinos and secure 2026. If we don't, we lose. We don't have the luxury of doing the \"right thing.\" We need to understand that half the population votes based on bullshit like this. Our enemies know this and have been beating the tar out of us for decades. We need to do these things now, until we get in a better spot where handouts simply won't be needed anymore. permalink parent award report block reply Appeal2Heaven98 2 points 5 hours ago As TheThreeSeashells said above, it probably won't work. The ones getting the EBT benefits are likely voting blue no matter who. I think if anything, it might turn off some on the right. permalink parent award report block reply NukeTheTroons 2 points 5 hours ago That’s why anyone who is a net negative should not have the right to vote. Why wouldn’t they vote for free shit? It’s common sense permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago How about instead of giving away \"free money\" from tariffs, we just focus on making things less expensive at the grocery store? I'm tired of \"free shit.\" permalink parent award report block reply SanityGumby 1 points 34 minutes ago Things are less expensive at the grocery store permalink parent award report block reply\nTheThreeSeashells 13 points 5 hours ago And it won't work.  The people they think they're trying to buy will still side with the people who promise them more and more handouts every election cycle, which is, of course, Leftists.  This will just be a waste of money and will likely piss off a lot of MAGA supporters who, once again, are going to get overlooked. If this keeps up, I get the feeling next year's inevitable rallies aren't going to be as positively received nor have the same fun atmosphere as they have in the past.  There's a lot of anger brewing in the MAGA base from being overlooked.  The H1B bullshit isn't helping. permalink parent award report block reply\nelgordo 4 points 5 hours ago THIS. It has to be done until we are in a place where we have gotten rid of more rinos and secure 2026. If we don't, we lose. We don't have the luxury of doing the \"right thing.\" We need to understand that half the population votes based on bullshit like this. Our enemies know this and have been beating the tar out of us for decades. We need to do these things now, until we get in a better spot where handouts simply won't be needed anymore. permalink parent award report block reply Appeal2Heaven98 2 points 5 hours ago As TheThreeSeashells said above, it probably won't work. The ones getting the EBT benefits are likely voting blue no matter who. I think if anything, it might turn off some on the right. permalink parent award report block reply\nAppeal2Heaven98 2 points 5 hours ago As TheThreeSeashells said above, it probably won't work. The ones getting the EBT benefits are likely voting blue no matter who. I think if anything, it might turn off some on the right. permalink parent award report block reply\nNukeTheTroons 2 points 5 hours ago That’s why anyone who is a net negative should not have the right to vote. Why wouldn’t they vote for free shit? It’s common sense permalink parent award report block reply\nAppeal2Heaven98 1 points 5 hours ago How about instead of giving away \"free money\" from tariffs, we just focus on making things less expensive at the grocery store? I'm tired of \"free shit.\" permalink parent award report block reply SanityGumby 1 points 34 minutes ago Things are less expensive at the grocery store permalink parent award report block reply\nSanityGumby 1 points 34 minutes ago Things are less expensive at the grocery store permalink parent award report block reply\nedxzxz 20 points 6 hours ago This is retarded.  You're over $36 trillion in debt - pay down the debt, or cut taxes. permalink award report block reply TheThreeSeashells 14 points 5 hours ago cut taxes How about that one.  Everyone benefits and it should have longer term effects as long as they cement those cuts in.  Not some bullshit where they either expire in a year or two or will easily be revoked whenever government wants to screw everyone over again.  And make them meaningful.  Not some 0.10% cut bullshit. permalink parent award report block reply Appeal2Heaven98 3 points 5 hours ago But it's \"free\" money! permalink parent award report block reply Spaceforcedropout -1 points 49 minutes ago Nah, I'm done with giving a shit about our debt ever being paid off. It won't be. Even if Trump made a little dent in it, the next guy would just ramp up spending again. An extra $4,000 cash would keep my family warm, fed and housed all winter while my wife takes some time off work to be with the kids. I'll just take that. permalink parent award report block reply\nTheThreeSeashells 14 points 5 hours ago cut taxes How about that one.  Everyone benefits and it should have longer term effects as long as they cement those cuts in.  Not some bullshit where they either expire in a year or two or will easily be revoked whenever government wants to screw everyone over again.  And make them meaningful.  Not some 0.10% cut bullshit. permalink parent award report block reply\nAppeal2Heaven98 3 points 5 hours ago But it's \"free\" money! permalink parent award report block reply\nSpaceforcedropout -1 points 49 minutes ago Nah, I'm done with giving a shit about our debt ever being paid off. It won't be. Even if Trump made a little dent in it, the next guy would just ramp up spending again. An extra $4,000 cash would keep my family warm, fed and housed all winter while my wife takes some time off work to be with the kids. I'll just take that. permalink parent award report block reply\nMagma_Biscuit 17 points 6 hours ago If you get a refund check you don’t deserve a 2k stimmi If your on any govt assistance you don’t deserve a stimmi If you work for the govt you don’t deserve a stimmi Only the 50 some odd percent of people that actually pay taxes deserve a stimmi permalink award report block reply S11houette 11 points 5 hours ago Yes But the only thing getting a refund check means is that you overpaid your taxes. permalink parent award report block reply Zskills 7 points 5 hours ago This is true.  Perhaps a better criterion would be \"net taxpayer\" permalink parent award report block reply RocksCanOnlyWait 8 points 5 hours ago Income tax refund is what you overpaid to the government. That shouldn't disqualify you. Agree with the rest. permalink parent award report block reply Magma_Biscuit -3 points 4 hours ago I claim single and 0 dependents and still have to pay at the end of the year, people getting refund checks are mostly due to “credits” that they qualify for which means others have to pay for those credits. It is not because you always pay to much. Just remember, if you qualify for credits and get a refund, other tax payers have to pay for those. Screwed up system really. permalink parent award report block reply mathteach314159 3 points 3 hours ago Most employers will put you in a tax bracket that favors paying more taxes than you will owe. So either you or your employer simply chose a tax rate that is lower than your actual tax bracket, and therefore you owe money at the end of the year. Thats all that means and you can’t infer anything about anyone else based off of your individual experience. I get the feeling you are young and inexperienced with the tax cycle. Also, Its ok for the government to incentivize things like having children, being charitable, etc… permalink parent award report block reply RocksCanOnlyWait 1 points 4 hours ago The income tax paid to the government is based on what you elect to deduct from each paycheck. Most default it to deduct based only on your salary. When you add in other income, such as bank interest, you can owe money. If you didn't account for above standard deductions, then you end up over-paying. The EIC is one of the few handouts on that form. I would be fine with a lower rate and no deductions. permalink parent award report block reply IlhanOmarsFagBrother 1 points 1 hour ago How about if you are in the bottom 50% of earners who don't contribute to federal tax receipts at all anyway, you don't get shit. permalink parent award report block reply\nS11houette 11 points 5 hours ago Yes But the only thing getting a refund check means is that you overpaid your taxes. permalink parent award report block reply Zskills 7 points 5 hours ago This is true.  Perhaps a better criterion would be \"net taxpayer\" permalink parent award report block reply\nZskills 7 points 5 hours ago This is true.  Perhaps a better criterion would be \"net taxpayer\" permalink parent award report block reply\nRocksCanOnlyWait 8 points 5 hours ago Income tax refund is what you overpaid to the government. That shouldn't disqualify you. Agree with the rest. permalink parent award report block reply Magma_Biscuit -3 points 4 hours ago I claim single and 0 dependents and still have to pay at the end of the year, people getting refund checks are mostly due to “credits” that they qualify for which means others have to pay for those credits. It is not because you always pay to much. Just remember, if you qualify for credits and get a refund, other tax payers have to pay for those. Screwed up system really. permalink parent award report block reply mathteach314159 3 points 3 hours ago Most employers will put you in a tax bracket that favors paying more taxes than you will owe. So either you or your employer simply chose a tax rate that is lower than your actual tax bracket, and therefore you owe money at the end of the year. Thats all that means and you can’t infer anything about anyone else based off of your individual experience. I get the feeling you are young and inexperienced with the tax cycle. Also, Its ok for the government to incentivize things like having children, being charitable, etc… permalink parent award report block reply RocksCanOnlyWait 1 points 4 hours ago The income tax paid to the government is based on what you elect to deduct from each paycheck. Most default it to deduct based only on your salary. When you add in other income, such as bank interest, you can owe money. If you didn't account for above standard deductions, then you end up over-paying. The EIC is one of the few handouts on that form. I would be fine with a lower rate and no deductions. permalink parent award report block reply\nMagma_Biscuit -3 points 4 hours ago I claim single and 0 dependents and still have to pay at the end of the year, people getting refund checks are mostly due to “credits” that they qualify for which means others have to pay for those credits. It is not because you always pay to much. Just remember, if you qualify for credits and get a refund, other tax payers have to pay for those. Screwed up system really. permalink parent award report block reply mathteach314159 3 points 3 hours ago Most employers will put you in a tax bracket that favors paying more taxes than you will owe. So either you or your employer simply chose a tax rate that is lower than your actual tax bracket, and therefore you owe money at the end of the year. Thats all that means and you can’t infer anything about anyone else based off of your individual experience. I get the feeling you are young and inexperienced with the tax cycle. Also, Its ok for the government to incentivize things like having children, being charitable, etc… permalink parent award report block reply RocksCanOnlyWait 1 points 4 hours ago The income tax paid to the government is based on what you elect to deduct from each paycheck. Most default it to deduct based only on your salary. When you add in other income, such as bank interest, you can owe money. If you didn't account for above standard deductions, then you end up over-paying. The EIC is one of the few handouts on that form. I would be fine with a lower rate and no deductions. permalink parent award report block reply\nmathteach314159 3 points 3 hours ago Most employers will put you in a tax bracket that favors paying more taxes than you will owe. So either you or your employer simply chose a tax rate that is lower than your actual tax bracket, and therefore you owe money at the end of the year. Thats all that means and you can’t infer anything about anyone else based off of your individual experience. I get the feeling you are young and inexperienced with the tax cycle. Also, Its ok for the government to incentivize things like having children, being charitable, etc… permalink parent award report block reply\nRocksCanOnlyWait 1 points 4 hours ago The income tax paid to the government is based on what you elect to deduct from each paycheck. Most default it to deduct based only on your salary. When you add in other income, such as bank interest, you can owe money. If you didn't account for above standard deductions, then you end up over-paying. The EIC is one of the few handouts on that form. I would be fine with a lower rate and no deductions. permalink parent award report block reply\nIlhanOmarsFagBrother 1 points 1 hour ago How about if you are in the bottom 50% of earners who don't contribute to federal tax receipts at all anyway, you don't get shit. permalink parent award report block reply\nThrilly 9 points 5 hours ago Just give every American a tax credit.  Don't just hand them inflation checks. permalink award report block reply UsedOnlyThrice 2 points 5 hours ago Tax credit wouldn't pay out until 2027. permalink parent award report block reply\nUsedOnlyThrice 2 points 5 hours ago Tax credit wouldn't pay out until 2027. permalink parent award report block reply\nDatamancer 8 points 6 hours ago Yup.  It makes sense to the establishment since they want that money pumped right back  into the economy (read stock market) and not saved or used to clear debt. Who will do that?  People making less than $100,000. permalink award report block reply chickeninoven 5 points 5 hours ago Walfuckingmart must have a rock hard cock a mile long. permalink parent award report block reply Datamancer 3 points 5 hours ago Yes.  As well as the tobacco companies, breweries, Nike, Sony, and every other retailer - especially Amazon. We will see a record Christmas shopping season and a broad uptick in markets followed by a sell off in January once the heroin wears off. permalink parent award report block reply\nchickeninoven 5 points 5 hours ago Walfuckingmart must have a rock hard cock a mile long. permalink parent award report block reply Datamancer 3 points 5 hours ago Yes.  As well as the tobacco companies, breweries, Nike, Sony, and every other retailer - especially Amazon. We will see a record Christmas shopping season and a broad uptick in markets followed by a sell off in January once the heroin wears off. permalink parent award report block reply\nDatamancer 3 points 5 hours ago Yes.  As well as the tobacco companies, breweries, Nike, Sony, and every other retailer - especially Amazon. We will see a record Christmas shopping season and a broad uptick in markets followed by a sell off in January once the heroin wears off. permalink parent award report block reply\nJoePlumber 8 points 6 hours ago I agree this is bullshit and animalistic. The majority of families making less than 100k are fucking Democrats. permalink award report block reply Zskills 4 points 5 hours ago Less than 30K IE professional welfare recipients voted Kamala.  People between 30k and 100K voted Trump. Overall, people under 100K voted more for Trump. permalink parent award report block reply\nZskills 4 points 5 hours ago Less than 30K IE professional welfare recipients voted Kamala.  People between 30k and 100K voted Trump. Overall, people under 100K voted more for Trump. permalink parent award report block reply\nhoopinfloyd 7 points 5 hours ago Wow starting to fucking hate this admin. When do we get mass deportations? When do we get H1-B revocations? When do we stop funding the low lifes with taxes? When do we get prosecutions? When do we get election integrity? permalink award report block reply TheTelltaleFly 3 points 5 hours ago At this point I half expect him to exclude American citizens from this plan. permalink parent award report block reply stealthboy 1 points 3 hours ago Never.  The uniparty always wins. permalink parent award report block reply\nTheTelltaleFly 3 points 5 hours ago At this point I half expect him to exclude American citizens from this plan. permalink parent award report block reply\nstealthboy 1 points 3 hours ago Never.  The uniparty always wins. permalink parent award report block reply\nWhoopies_tds 5 points 5 hours ago Should be a pre-requisite that if you paid nothing into the system you get nothing back because your a useless POS leech permalink award report block reply General_Specific 5 points 5 hours ago There are actually a lot of hard working citizens who don't pay into the system for different reasons. One being survival. They can't afford to make ends meet if they do and are forced to work \"under the table\". i don't condemn those people. If taxation is theft, which a lot of us agree with, they are simply doing what they can without letting themselves get pickpocketed by govt. permalink parent award report block reply suckmycorona 2 points 5 hours ago And no vote. permalink parent award report block reply\nGeneral_Specific 5 points 5 hours ago There are actually a lot of hard working citizens who don't pay into the system for different reasons. One being survival. They can't afford to make ends meet if they do and are forced to work \"under the table\". i don't condemn those people. If taxation is theft, which a lot of us agree with, they are simply doing what they can without letting themselves get pickpocketed by govt. permalink parent award report block reply\nsuckmycorona 2 points 5 hours ago And no vote. permalink parent award report block reply\nPhantomShield72 4 points 5 hours ago I VOTED FOR THIS WHAT THE FUCK IS THIS permalink award report block reply\ntt777 4 points 5 hours ago This is retarded. permalink award report block reply\nNdNcenti 4 points 5 hours ago Welp I won’t qualify, but what I will do is buy 2k more in silver, because reasons permalink award report block reply\nGA_Logic 4 points 6 hours ago Key word is making money aka working. permalink award report block reply shadypollster 4 points 6 hours ago And having valid tax return is my guess. Like the stimmies. We will see soon enough. permalink parent award report block reply\nshadypollster 4 points 6 hours ago And having valid tax return is my guess. Like the stimmies. We will see soon enough. permalink parent award report block reply\nMemeWarsVet 4 points 6 hours ago Fuck. This. permalink award report block reply\nastralentity 3 points 6 hours ago Can it be W2 and not AGI please? permalink award report block reply\nmarriedwitchfarmvote 2 points 2 hours ago This boost is really going to help us! I hope it is real and also comes before the holidays. I was planning to cut back on gifts, because sudden medical bills made everything tight. With 2k I can shore up the savings and feel comfortable going into Christmas. Thank You Santa Trump! permalink award report block reply\nking_cocoon 2 points 5 hours ago Cool. I'll take yours, then. permalink award report block reply\nSmartyPants 2 points 5 hours ago Just put it towards paying off our debt.\n~ Signed the American People. permalink award report block reply\nAquamine-Amarine 2 points 1 hour ago Anyone on government assistance should be disqualified from getting this. permalink award report block reply\nutfanx2 2 points 5 hours ago He steals from the poor, and gives to the rich. Stupid bitch! permalink award report block reply\nRedStoneDeepState 2 points 5 hours ago A family making less than 100k is either living in the trailer park or on welfare. permalink award report block reply The_Yakuza 2 points 2 hours ago Depends where you live. There’s new housing around me starting at 200-250k for 3 bed 2 bath. Not everywhere is 400k plus for a house. My household income is slightly less than 100k and I live pretty comfortably. No trailer parks no welfare. permalink parent award report block reply\nThe_Yakuza 2 points 2 hours ago Depends where you live. There’s new housing around me starting at 200-250k for 3 bed 2 bath. Not everywhere is 400k plus for a house. My household income is slightly less than 100k and I live pretty comfortably. No trailer parks no welfare. permalink parent award report block reply\nd4tm4ss 1 points 5 hours ago Is this before or after taxes? permalink award report block reply\nGeneral_Specific 1 points 5 hours ago Families on public aid should not get the money. That would make no sense. permalink award report block reply\nWarOfTheFanboys2 1 points 4 hours ago Deported for being an anti-Trump communist permalink award report block reply\nCommiesBane 1 points 3 hours ago Great, I guess my decent salary, stay at home wife, and nine kids precludes me from the tariff check. permalink award report block reply\nFUCK_TYLER 1 points 36 minutes ago 😩😩😩😭 permalink award report block reply\nSanityGumby 1 points 36 minutes ago I see you are retarded permalink award report block reply\nCrappydatum 1 points 5 hours ago But remember, the people here screaming about H1B think Shaniqua is automagically superior because she's \"American\" permalink award report block reply\nindigo_truther 1 points 3 hours ago I hate this but probably good branding.  Nobody making less than $100k knows what a tariff is and will now be more likely to support them. permalink award report block reply\nCALI_MAGA_MAMA 1 points 56 minutes ago This will so much help working class families who make just a little too much to get any help. We're squeezed so hard. 100k is great income unless you live in a big city. permalink award report block reply\ndeleted 1 points 6 hours ago DirtyDiaperJoe 3 points 6 hours ago Agree.  Any kind of rebate/refund to any AMERICANS, who are legal citizens, is fine by me.  What I want to stop, is the squatters getting ANY government benefits or mortgages or any financial help.  I want them to GET THE FUCK OUT. permalink parent award report block reply shadypollster 2 points 6 hours ago Yeah Americans and other natives should be entitled to a basic social safety net for when times are tough. Our blood is being sucked by foreigner SCUM. Our blood is being spilled by EBT SCUM. permalink parent award report block reply DirtyDiaperJoe 0 points 6 hours ago Had to run to Walmart last night for something.  Got out of car, and here comes some Hispanic bitch, with SEVEN fucking kids.  7!  All speaking Spanish.  We're fucked. permalink parent award report block reply HeavenlyTrumpets 1 points 6 hours ago should be under $200k or $250k permalink parent award report block reply\nDirtyDiaperJoe 3 points 6 hours ago Agree.  Any kind of rebate/refund to any AMERICANS, who are legal citizens, is fine by me.  What I want to stop, is the squatters getting ANY government benefits or mortgages or any financial help.  I want them to GET THE FUCK OUT. permalink parent award report block reply shadypollster 2 points 6 hours ago Yeah Americans and other natives should be entitled to a basic social safety net for when times are tough. Our blood is being sucked by foreigner SCUM. Our blood is being spilled by EBT SCUM. permalink parent award report block reply DirtyDiaperJoe 0 points 6 hours ago Had to run to Walmart last night for something.  Got out of car, and here comes some Hispanic bitch, with SEVEN fucking kids.  7!  All speaking Spanish.  We're fucked. permalink parent award report block reply\nshadypollster 2 points 6 hours ago Yeah Americans and other natives should be entitled to a basic social safety net for when times are tough. Our blood is being sucked by foreigner SCUM. Our blood is being spilled by EBT SCUM. permalink parent award report block reply DirtyDiaperJoe 0 points 6 hours ago Had to run to Walmart last night for something.  Got out of car, and here comes some Hispanic bitch, with SEVEN fucking kids.  7!  All speaking Spanish.  We're fucked. permalink parent award report block reply\nDirtyDiaperJoe 0 points 6 hours ago Had to run to Walmart last night for something.  Got out of car, and here comes some Hispanic bitch, with SEVEN fucking kids.  7!  All speaking Spanish.  We're fucked. permalink parent award report block reply\nHeavenlyTrumpets 1 points 6 hours ago should be under $200k or $250k permalink parent award report block reply"}