{"id": "8185642", "contents": "1339 Cheaper by the Million posted 6 hours ago by austford 115 comments award share download report block\n115 comments Sort by Top Top New Worst Old Save Around the Web Seniors Born 1939-1969 Receive 11 Benefits This Month If They Ask Super Saving Online SHILL_DETECTOR 78 points 6 hours ago they will lie to get jobs also permalink award report block reply Trump4prez 48 points 5 hours ago Remember when you travel abroad and tourists are warned that foreigners will scam u? Because they see Americans as easy marks? What makes u think they have a different mentality when they come as immigrants? permalink parent award report block reply CaptainCuomo 11 points 5 hours ago \"They're just cheaper.\" FALSE The hardcore open borders libertarians at the Cato Institute say that Immigrants offset their cost to America-- by being productive contributing members of society. BUT BUT BUTT But when you look at Cato's math-- they admit it takes THIRTY YEARS to reach the break-even point, where an immigrant contributes more than he TAKES: AI confirms: “The Fiscal Impact of Immigration in the United States” by Alex Nowrasteh, Sarah Eckhardt, and Michael Howard draws heavily on the National Academy of Sciences’ 2017 report, which modeled the long-term fiscal effects of immigrants and found that, over a 30‑year horizon, immigrants contribute more in taxes than they consume in government benefits\" Here's the author of the Cato paper, on a debate stage vs. Dave Smith. It's full of amazing autistic brainfarts from the Cato Libertarian.  And he was cheered on by the autist libertarians in the crowd.     Dave Smith responded with common sense-- which was lost on a crowd with no common sense.  But won the larger audience outside that auditorium. So I found that debate to be a referendum on a certain sort of Libertarian nerd/ as much as the open borders policies which they ushered-in/ during the years of Koch Brothers influence on US politics: permalink parent award report block reply RedStoneDeepState 2 points 4 hours ago But when you look at Cato's math-- they admit it takes THIRTY YEARS to reach the break-even point, where an immigrant contributes more than he TAKES: Including the worst immigrants such as Somalians permalink parent award report block reply darkmodeforgotpass 1 points 2 hours ago I have my doubts that they EVER contribute even a tenth of what they take. permalink parent award report block reply gunteh 6 points 5 hours ago Well, if they have to scam to come to this country (AKA ILLEGAL), then what would you expect from a scammer besides more scams? permalink parent award report block reply mohel 2 points 4 hours ago Their degrees come from prestigious universities permalink parent award report block reply Bigstick7 11 points 5 hours ago Then only hire people like them. permalink parent award report block reply SHILL_DETECTOR 7 points 5 hours ago true, and they do almost no work at all... do not ever hire indians as contractors or contract out work to some jeet farm permalink parent award report block reply KekistanPM 3 points 3 hours ago As detestable as it is to us, it's important to remember that lying, bribing and grifting is baked into many foreign cultures. A relative of mine served in the middle east for a year. He told me that it's all customary for the locals. They would often walk away with anything not bolted to the floor if nobody noticed; and if you did notice they'd blame you for it. If you walked away with something of theirs however, they'd get upset and probably bash your face in. These values are wholly incompatible with ours; but because of greed and malice, they're forced upon us. permalink parent award report block reply keeman 2 points 4 hours ago And the only loyalty to the company they have is the H1B not being easily transferable to another employer.  Basically hiring mercenaries and chaining them to the desk to keep them there. permalink parent award report block reply Zordly 0 points 3 hours ago Dang, I came here to say that permalink parent award report block reply America1stAndOnly 56 points 6 hours ago Not sure what Trump was thinking with that comment of his that Americans can't do the jobs. Really pissed me off though. permalink award report block reply IncredibleMrE1 35 points 6 hours ago Funny how Americans can't do the jobs and training them would be cumbersome, so we need to bring in half a million foreigners from a hostile nation and train them instead. From the same admin that is justifying everything with \"muh national security.\" permalink parent award report block reply gunteh 25 points 5 hours ago Gaslighting is telling someone you're \"tough on immigration\" while also saying \"Americans can't do what these foreigners can\", change my mind... permalink parent award report block reply Madnote1984 7 points 5 hours ago The truth of the matter is, they want dirt cheap labor. There are plenty of competent Americans to do those jobs, but they expect a certain amount of pay. So the solution is to import foreigners who may be somewhat competent, but will work suicide hours for hardly no pay. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago And get their housing and food and schooling subsidized by American taxpayers because, again, they’re working for shit pay. But all that never hits the company’s bottom line so it’s a win win for them. permalink parent award report block reply IncredibleMrE1 4 points 5 hours ago Yup permalink parent award report block reply newestofnew 15 points 5 hours ago its incredible that they think they can psyop people into believing that their children with unrealized potential because of failed and flawed education system are inferior to third worlders so inferior that its not even worth giving them a chance. this is winning messaging? permalink parent award report block reply GatoradeJeb 7 points 5 hours ago Its because he exposed his hatred of White man and his desire to replace us with browns permalink parent award report block reply tt777 4 points 5 hours ago Trump is a business man first. Business concerns will always be first to him. permalink parent award report block reply Wrexxis780 25 points 5 hours ago Unfortunately if he's more concerned about big stock numbers than a dead middle class America... his legacy will be dead. permalink parent award report block reply gunteh -2 points 5 hours ago Trump was given an America on life support, after Biden. He's also dealing with some financial swamp creatures still (Powell comes immediately to mind). With all that said, Trump has the defibrillators on full tilt, and if he can't get America back up on its feet, then we're screwed no matter who's in office next time around. permalink parent award report block reply YouEssAye 11 points 5 hours ago He's also dealing with some financial swamp creatures He's actively campaigning for Lindsey Graham. Can we dispense with this idea that there is any intention to drain the swamp? permalink parent award report block reply view 5 more comments... gunteh 5 points 5 hours ago Yeah, but just because it's legal doesn't make it ethical. If Trump said 50 year mortgages are legal, that doesn't make it ethical to give banks the ability to force people into 50 year mortgages with \"hey, look at your monthly payments now, much cheaper than 30 year mortgages, huh? Wanna go for the lower monthly payment?\" If you've ever been on an 84-month car loan, you'll know the pain of being stuck with that monthly payment for that long. permalink parent award report block reply Awakened 2 points 4 hours ago He should be concerned about impeachment if he loses the midterms. permalink parent award report block reply Megaboom2025 2 points 3 hours ago I think he’s the father in law of Israel first permalink parent award report block reply Long_time_lurker 2 points 4 hours ago It was a word salad but it sounded like he was talking about the original justification, which was that they'd do jobs the companies can't find an American who can do in high end science or whatever. The problem as we've seen is that the program is gamed to death and companies like them for being essentially slave labor that can't quit.  This goes hand-in-hand with being cheaper. So they post stupid job requirements on a message board nobody sees and get their desired candidate, possibly via internal transfer, instead of ever trying to hire American, and they get them for cheap and know they won't quit right away because they cannot. Thus you see some random bigcorp hiring people for $50k who normally make 2-3x that much. permalink parent award report block reply load 6 more comments... bejeavis 44 points 6 hours ago Vivek is dead to this site for saying the exact same thing. Change my mind. permalink award report block reply popcultmember 12 points 4 hours ago And Elon same reason permalink parent award report block reply deleted 10 points 5 hours ago Bigstick7 8 points 5 hours ago Yep I like what Vance says but this part concerns me. I think Desantis should be the next Repub nominy. permalink parent award report block reply TheTelltaleFly 8 points 4 hours ago DeSantis is Israel first. He signed a Florida censorship law in freaking Israel FFS. permalink parent award report block reply SavingPrivateGrace 4 points 4 hours ago Stephen Miller is a natural God gifted MAGA, which neither of them are, was, or ever will be. permalink parent award report block reply gunteh 4 points 5 hours ago The arrow loosed too early or too late both miss the mark. permalink parent award report block reply Ricky_CIA 4 points 4 hours ago Yeah because jeets be jeetin' permalink parent award report block reply MediaBro 2 points 27 minutes ago All Vivek had to say was, \"Hey, American kids have been coddled for too long and we need to change this. Let's reform the H1B visa system and limit the numbers arriving but let's still let in a few. In the meantime, let's set up a 5 yr plan, where we find American kids that are patriotic and love the country and want to be given a chance to prove themselves - let's focus on those kids, give them a chance to prosper and from there, we figure out a way to continue uplifting more American-born kids\" This is how you win both sides. You show love of nation, love of the people you grew up with, love of even the people you think are lazy and love of the people who just want to show they too can work towards something great. But, nope, let's call Americans lazy and too stupid to do jobs in the very fields their own parents and grandparents helped create and set up. permalink parent award report block reply bejeavis 1 points 22 minutes ago Accurate permalink parent award report block reply CommietownUSA 29 points 5 hours ago How to lose the midterms and your legacy in one sentence: permalink award report block reply IncredibleMrE1 22 points 6 hours ago They're also not white. permalink award report block reply tribunabessica 10 points 5 hours ago And never will be. permalink parent award report block reply rebuildingMyself 8 points 5 hours ago Until they commit a violent crime and we need to classify race permalink parent award report block reply Thrilly 17 points 5 hours ago They start by stealing our jobs.  They then import several generations of their families.  Then they breed.  Within 10 years America will turn into a 3rd world shithole permalink award report block reply GatoradeJeb 4 points 5 hours ago Worse they take the White woman for themselves as white woman have been braimwwshed to be race traitors permalink parent award report block reply newuser8 1 points 7 seconds ago White women don't race mix as much as you think. Black men and women race mix the most permalink parent award report block reply 24601 16 points 6 hours ago Serfs are cheaper than slaves because the ruler doesn't need to feed the serf. That's what the Globalists are after.... serfs. permalink award report block reply 0Sum 15 points 6 hours ago And once they've scammed their way into management they discriminate in favor of their own kind. permalink award report block reply deletedandreacted 14 points 6 hours ago They also stink permalink award report block reply Remember_the_Alamo 10 points 5 hours ago And are pushy and rude. permalink parent award report block reply IncredibleMrE1 -5 points 5 hours ago They have a better culture. permalink parent award report block reply Remember_the_Alamo 6 points 4 hours ago Ha!  So that's why they leave? permalink parent award report block reply 5DchessWatch 1 points 3 minutes ago I like my metropolitan areas to be so flooded with livestock that commutes take 3x longer than US where avg commute is already 45min.  Also I like walking into professional offices smeling like cowshits I stepped in permalink parent award report block reply Whozat 12 points 5 hours ago If our grandmothers could build airplanes and battleships for WW2 and learned those jobs in weeks, not years,\nwhy do we need these people? permalink award report block reply bidensmissingbrain -4 points 5 hours ago Because the women of today are not our grandmothers. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago But we’re not at war so the men of today can build airplanes and battleships. permalink parent award report block reply bidensmissingbrain -3 points 3 hours ago And the men of today are not our grandfathers. permalink parent award report block reply SleeperAgentSupreme 11 points 4 hours ago This is why JD Vance will not get my vote in 2028. Trump is doing this because Vance is in his ear and Vance's INDIAN wife is in his ear nagging all day. RIP the movement. When will we actually get a president that cares about America? permalink award report block reply booblitchutz 9 points 5 hours ago They’re not even really cheaper. They are just locked into their job for 6 years (at a minimum). permalink award report block reply MakinBacon 8 points 5 hours ago Beat me to it. Somebody got a bonus for hiring them, virturally everytime, or a cut of their pay. permalink parent award report block reply FRONT_TOWARD_LEFT 4 points 4 hours ago Kickbacks paid back in India are part of the culture. permalink parent award report block reply MakinBacon 5 points 4 hours ago their culture, as are many other things not acceptable in America. permalink parent award report block reply Trumpalorian 9 points 6 hours ago Are they cheaper after you factor in all the Gibs theyll take or damage they'll cause? permalink award report block reply wharfthrowaway 5 points 5 hours ago We pay for the gins and have to live with the crime and filth. The politicians and lobbyists don’t have to deal with it permalink parent award report block reply Remember_the_Alamo 7 points 6 hours ago Immigrants are imitation brand Americans. permalink award report block reply forcedaspiration 6 points 5 hours ago They should hire cheap American kids if the boomers are too greedy, not panjeets. permalink award report block reply TheTelltaleFly 5 points 4 hours ago I work with so many boomers who just refuse to retire. There is no upward mobility because the boomers are occupying all the high-paying positions. Young kids can’t get a job because nobody in the middle has anywhere to go. permalink parent award report block reply forcedaspiration 2 points 2 hours ago They didn't have the heart to shit can the boomers stuck in the fax machine age, so they commit civilizational suicide instead. permalink parent award report block reply BidenSniffsLittleKid 6 points 6 hours ago Somebody should tell Trump permalink award report block reply Aggrieved03 5 points 5 hours ago Republican donors love them! We’re ruled not represented. permalink award report block reply NO_RINOs 4 points 4 hours ago We are definitely NOT being represented by our politicians! Homeschool your kids and prepare for the worst. Have a backup option if the USA falls apart because of our traitorous politicians. permalink parent award report block reply Jehsun 4 points 2 hours ago Trump deserves just as much pushback as elong and Vivek had when they presented this same point.. I can't believe he would actually say what he said.. permalink award report block reply HeavenlyTrumpets 4 points 5 hours ago Also they often don't know what they claim to know. They just learn on the job, while Americans are required to prove what they know. permalink award report block reply bluewhiteandred 3 points 3 hours ago it's just corporate greed, taking advantage of the poors in other countries while slashing wages for Americans permalink award report block reply PillarOfWisdom 3 points 5 hours ago Woah.  If you laugh or agree with this meme, doesn't that make you a doomer? permalink award report block reply Trajano 3 points 5 hours ago This is 100% true. permalink award report block reply TheDevilMonkey 3 points 1 hour ago All the cultists love jeets now. Very sad. Thank you for your attention to this matter. permalink award report block reply aaafirefly123 3 points 4 hours ago I think Trump sees 2 options: Either import cheap labor and keep the businesses here. Or let the businesses outsource to countries with slave labor. For the government, the former is preferable to the later. permalink award report block reply TheTelltaleFly 6 points 4 hours ago What’s the point of having the manufacturing here if they aren’t hiring Americans? Just to pollute our fucking water and invade our schools with their litters of kids who don’t speak English? permalink parent award report block reply aaafirefly123 1 points 3 hours ago Well for the government, the point of keeping the businesses here is to build and maintain manufacturing infrastructure while denying said infrastructure to China. Every business that outsources to China empowers China just a little bit more. permalink parent award report block reply PDWUsername 2 points 5 hours ago They are cheaper per hour because they're willing to work 15 hours a day on the same salary as an American to make enough money to support their family of 10 back home. permalink award report block reply popcultmember 6 points 4 hours ago I dont buy this. I've worked w hundreds of them. They are fake af. Show up right before the boss, leave right after the boss, talk about all the hours they put in, be on cell phone in break room all the time. They definitely don't work harder or contribute more permalink parent award report block reply behemoth887 2 points 55 minutes ago they're not cheaper though, the damage they cause to the environment and the infrastructure in addition to the lower quality of work offsets the lower salary permalink award report block reply NO_RINOs 2 points 4 hours ago Well, I am definitely off the trump train now. We all have to stick up and fight for ourselves. Government nor the politicians will help or protect us. Honestly questioning whether Trump is becoming senile. His handlers told him to insult his base now? Trump clearly loves Israel more than the USA. What happened to no more wars, Donnie boy? You bombed Iran. Peace is supposed to the prize! This is why I am a Ron Paul libertarian. I can take care of myself. Just want to make sure government is neutered so it can't hurt me. permalink award report block reply Eshasta 2 points 50 minutes ago Depends which Iones were looking at. There are millions of inner-city Street rats who aren't talented enough to do anything. If we isolate the black community, I think 40% aren't employed full-time or care to be. We need to eliminate the welfare state first before we assess who's talented or not. permalink award report block reply patrioticwinning3 2 points 48 minutes ago EXACTLY!  WAKE THE FUCK UP TRUMP!!!  THANK YOU FOR YOUR ATTENTION TO THIS MATTER! permalink award report block reply Mhmm2MoreWeeks 1 points 2 hours ago So you mean to tell me the WEF Stakeholder class has no loyalty to God, Race, Nation, State, Community, Faith, Family, or anything other then their own power? Who Knew??? Blame Jews harder Geniuses. Surely that will fix it. /s permalink award report block reply irescreams 1 points 3 hours ago scammers all of them permalink award report block reply Beardholder 1 points 5 hours ago They are not even cheaper. THey are the ones buying all these $500k-$3 million homes here in Dallas. permalink award report block reply FKH2 1 points 4 hours ago They don't get benefits either permalink award report block reply griff 1 points 5 hours ago They also have that Eastern \"slavish\" behavior to leadership. They just do as they are told. permalink award report block reply dixontic 1 points 3 hours ago Cheaply written code is the most expensive. permalink award report block reply RedditIs4Retards 1 points 5 hours ago I always have problems with illegal framers, siding, and sheet rockers. They either destroy my electrical, knock out my boxes so they can repair their framing screw ups and proceed to leave my boxes out, bury boxes and wiring behind sheetrock, and when asked to block and do siding around exterior electrical, \"uhhh I ask heem contrrractor to do\" then proceeds not to ask and leaves it as is. Can't speak English so they don't even make an attempt to communicate so we can work together. permalink award report block reply Senaleb 1 points 5 hours ago Finally, the real sentiment is making it to the top. permalink award report block reply Shmioighan 1 points 5 hours ago Cheaper AND more cooperative/collectivized. permalink award report block reply alucard13mmfmj 1 points 39 minutes ago Thats not even true.. since the quality is crap lol. permalink award report block reply milutza 1 points 1 hour ago As an imigrant, myself, i can confirm. My employers just cared that they could hire me for half pay and replace two people.\nIt's sad as this is not the mentality that made the west successfull... permalink award report block reply rastren 1 points 4 hours ago Full intention has nothing to do with jobs, it's a full on war against the American people to take over the federal government. These people don't care, they will vote for communism and erode societal trust. Trump needs to denaturalize these people and deport them. permalink award report block reply happyfave 1 points 4 hours ago There are smart ones too.  Isn't there like a billion people.. Got to assume there is a few smart ones in there. permalink award report block reply 5DchessWatch 1 points 6 minutes ago CS degree : check Knows javascript: check Call center experience w/ microsoft technical support and/or warranty expiration: check Threw food dyes soon to be banned in the US during holi festival: check Commuted to work with goats and 200 others hanging off the sides of a dump truck: check Threw cowpaddies at friend during pagan worshipful fest: check Ok, Padjeep, you're in permalink award report block reply Wesmacker 1 points 47 minutes ago They are dumber and less talented to be honest permalink award report block reply Formerlurker92 0 points 5 hours ago I support antifa tactics against insoursing companies permalink award report block reply Franklymydear -4 points 5 hours ago I have never seen people get their fucking panties in a bunch so fast….\nLiterally, turning on the very man that has done so much already. You guys truly are pathetic sometimes. You sound like a bunch of women. Get one thing straight. We haven’t done a lot of these manufacturing things for a very long time.\nThe goal here is to get the manufacturing know how back into the American population using temporary labor that will be sent back in 4 to 7 years - we need training. Anyone in business knows that your general American guy out there is a total dumbass -sorry but that’s just the truth. Ever hire a contractor? Most of them don’t know what they’re doing. And yes, I’m talking about the white guys too. It’s evident where we have a shortage of not only skilled tradesmen, but also skilled manufacturing know how. This just fills the gap for a better future for American workers down the road. Stop being so damn myopic permalink award report block reply ChristiansAreIsrael 1 points 4 hours ago \"Anyone in business knows that your general American guy out there is a total dumbass -sorry but that’s just the truth. \" Fuck yourself you jeet average 70 IQ faggot. Pushing yes man politics to enable your filth being further imported. permalink parent award report block reply Franklymydear 0 points 3 hours ago You jeet ? Is that proper grammar where you come from? Or are you too lazy to pay attention to the details of your post? I’m not a jeet. Moron permalink parent award report block reply\nSHILL_DETECTOR 78 points 6 hours ago they will lie to get jobs also permalink award report block reply Trump4prez 48 points 5 hours ago Remember when you travel abroad and tourists are warned that foreigners will scam u? Because they see Americans as easy marks? What makes u think they have a different mentality when they come as immigrants? permalink parent award report block reply CaptainCuomo 11 points 5 hours ago \"They're just cheaper.\" FALSE The hardcore open borders libertarians at the Cato Institute say that Immigrants offset their cost to America-- by being productive contributing members of society. BUT BUT BUTT But when you look at Cato's math-- they admit it takes THIRTY YEARS to reach the break-even point, where an immigrant contributes more than he TAKES: AI confirms: “The Fiscal Impact of Immigration in the United States” by Alex Nowrasteh, Sarah Eckhardt, and Michael Howard draws heavily on the National Academy of Sciences’ 2017 report, which modeled the long-term fiscal effects of immigrants and found that, over a 30‑year horizon, immigrants contribute more in taxes than they consume in government benefits\" Here's the author of the Cato paper, on a debate stage vs. Dave Smith. It's full of amazing autistic brainfarts from the Cato Libertarian.  And he was cheered on by the autist libertarians in the crowd.     Dave Smith responded with common sense-- which was lost on a crowd with no common sense.  But won the larger audience outside that auditorium. So I found that debate to be a referendum on a certain sort of Libertarian nerd/ as much as the open borders policies which they ushered-in/ during the years of Koch Brothers influence on US politics: permalink parent award report block reply RedStoneDeepState 2 points 4 hours ago But when you look at Cato's math-- they admit it takes THIRTY YEARS to reach the break-even point, where an immigrant contributes more than he TAKES: Including the worst immigrants such as Somalians permalink parent award report block reply darkmodeforgotpass 1 points 2 hours ago I have my doubts that they EVER contribute even a tenth of what they take. permalink parent award report block reply gunteh 6 points 5 hours ago Well, if they have to scam to come to this country (AKA ILLEGAL), then what would you expect from a scammer besides more scams? permalink parent award report block reply mohel 2 points 4 hours ago Their degrees come from prestigious universities permalink parent award report block reply Bigstick7 11 points 5 hours ago Then only hire people like them. permalink parent award report block reply SHILL_DETECTOR 7 points 5 hours ago true, and they do almost no work at all... do not ever hire indians as contractors or contract out work to some jeet farm permalink parent award report block reply KekistanPM 3 points 3 hours ago As detestable as it is to us, it's important to remember that lying, bribing and grifting is baked into many foreign cultures. A relative of mine served in the middle east for a year. He told me that it's all customary for the locals. They would often walk away with anything not bolted to the floor if nobody noticed; and if you did notice they'd blame you for it. If you walked away with something of theirs however, they'd get upset and probably bash your face in. These values are wholly incompatible with ours; but because of greed and malice, they're forced upon us. permalink parent award report block reply keeman 2 points 4 hours ago And the only loyalty to the company they have is the H1B not being easily transferable to another employer.  Basically hiring mercenaries and chaining them to the desk to keep them there. permalink parent award report block reply Zordly 0 points 3 hours ago Dang, I came here to say that permalink parent award report block reply\nTrump4prez 48 points 5 hours ago Remember when you travel abroad and tourists are warned that foreigners will scam u? Because they see Americans as easy marks? What makes u think they have a different mentality when they come as immigrants? permalink parent award report block reply CaptainCuomo 11 points 5 hours ago \"They're just cheaper.\" FALSE The hardcore open borders libertarians at the Cato Institute say that Immigrants offset their cost to America-- by being productive contributing members of society. BUT BUT BUTT But when you look at Cato's math-- they admit it takes THIRTY YEARS to reach the break-even point, where an immigrant contributes more than he TAKES: AI confirms: “The Fiscal Impact of Immigration in the United States” by Alex Nowrasteh, Sarah Eckhardt, and Michael Howard draws heavily on the National Academy of Sciences’ 2017 report, which modeled the long-term fiscal effects of immigrants and found that, over a 30‑year horizon, immigrants contribute more in taxes than they consume in government benefits\" Here's the author of the Cato paper, on a debate stage vs. Dave Smith. It's full of amazing autistic brainfarts from the Cato Libertarian.  And he was cheered on by the autist libertarians in the crowd.     Dave Smith responded with common sense-- which was lost on a crowd with no common sense.  But won the larger audience outside that auditorium. So I found that debate to be a referendum on a certain sort of Libertarian nerd/ as much as the open borders policies which they ushered-in/ during the years of Koch Brothers influence on US politics: permalink parent award report block reply RedStoneDeepState 2 points 4 hours ago But when you look at Cato's math-- they admit it takes THIRTY YEARS to reach the break-even point, where an immigrant contributes more than he TAKES: Including the worst immigrants such as Somalians permalink parent award report block reply darkmodeforgotpass 1 points 2 hours ago I have my doubts that they EVER contribute even a tenth of what they take. permalink parent award report block reply gunteh 6 points 5 hours ago Well, if they have to scam to come to this country (AKA ILLEGAL), then what would you expect from a scammer besides more scams? permalink parent award report block reply mohel 2 points 4 hours ago Their degrees come from prestigious universities permalink parent award report block reply\nCaptainCuomo 11 points 5 hours ago \"They're just cheaper.\" FALSE The hardcore open borders libertarians at the Cato Institute say that Immigrants offset their cost to America-- by being productive contributing members of society. BUT BUT BUTT But when you look at Cato's math-- they admit it takes THIRTY YEARS to reach the break-even point, where an immigrant contributes more than he TAKES: AI confirms: “The Fiscal Impact of Immigration in the United States” by Alex Nowrasteh, Sarah Eckhardt, and Michael Howard draws heavily on the National Academy of Sciences’ 2017 report, which modeled the long-term fiscal effects of immigrants and found that, over a 30‑year horizon, immigrants contribute more in taxes than they consume in government benefits\" Here's the author of the Cato paper, on a debate stage vs. Dave Smith. It's full of amazing autistic brainfarts from the Cato Libertarian.  And he was cheered on by the autist libertarians in the crowd.     Dave Smith responded with common sense-- which was lost on a crowd with no common sense.  But won the larger audience outside that auditorium. So I found that debate to be a referendum on a certain sort of Libertarian nerd/ as much as the open borders policies which they ushered-in/ during the years of Koch Brothers influence on US politics: permalink parent award report block reply RedStoneDeepState 2 points 4 hours ago But when you look at Cato's math-- they admit it takes THIRTY YEARS to reach the break-even point, where an immigrant contributes more than he TAKES: Including the worst immigrants such as Somalians permalink parent award report block reply darkmodeforgotpass 1 points 2 hours ago I have my doubts that they EVER contribute even a tenth of what they take. permalink parent award report block reply\nRedStoneDeepState 2 points 4 hours ago But when you look at Cato's math-- they admit it takes THIRTY YEARS to reach the break-even point, where an immigrant contributes more than he TAKES: Including the worst immigrants such as Somalians permalink parent award report block reply darkmodeforgotpass 1 points 2 hours ago I have my doubts that they EVER contribute even a tenth of what they take. permalink parent award report block reply\ndarkmodeforgotpass 1 points 2 hours ago I have my doubts that they EVER contribute even a tenth of what they take. permalink parent award report block reply\ngunteh 6 points 5 hours ago Well, if they have to scam to come to this country (AKA ILLEGAL), then what would you expect from a scammer besides more scams? permalink parent award report block reply\nmohel 2 points 4 hours ago Their degrees come from prestigious universities permalink parent award report block reply\nBigstick7 11 points 5 hours ago Then only hire people like them. permalink parent award report block reply SHILL_DETECTOR 7 points 5 hours ago true, and they do almost no work at all... do not ever hire indians as contractors or contract out work to some jeet farm permalink parent award report block reply\nSHILL_DETECTOR 7 points 5 hours ago true, and they do almost no work at all... do not ever hire indians as contractors or contract out work to some jeet farm permalink parent award report block reply\nKekistanPM 3 points 3 hours ago As detestable as it is to us, it's important to remember that lying, bribing and grifting is baked into many foreign cultures. A relative of mine served in the middle east for a year. He told me that it's all customary for the locals. They would often walk away with anything not bolted to the floor if nobody noticed; and if you did notice they'd blame you for it. If you walked away with something of theirs however, they'd get upset and probably bash your face in. These values are wholly incompatible with ours; but because of greed and malice, they're forced upon us. permalink parent award report block reply\nkeeman 2 points 4 hours ago And the only loyalty to the company they have is the H1B not being easily transferable to another employer.  Basically hiring mercenaries and chaining them to the desk to keep them there. permalink parent award report block reply\nZordly 0 points 3 hours ago Dang, I came here to say that permalink parent award report block reply\nAmerica1stAndOnly 56 points 6 hours ago Not sure what Trump was thinking with that comment of his that Americans can't do the jobs. Really pissed me off though. permalink award report block reply IncredibleMrE1 35 points 6 hours ago Funny how Americans can't do the jobs and training them would be cumbersome, so we need to bring in half a million foreigners from a hostile nation and train them instead. From the same admin that is justifying everything with \"muh national security.\" permalink parent award report block reply gunteh 25 points 5 hours ago Gaslighting is telling someone you're \"tough on immigration\" while also saying \"Americans can't do what these foreigners can\", change my mind... permalink parent award report block reply Madnote1984 7 points 5 hours ago The truth of the matter is, they want dirt cheap labor. There are plenty of competent Americans to do those jobs, but they expect a certain amount of pay. So the solution is to import foreigners who may be somewhat competent, but will work suicide hours for hardly no pay. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago And get their housing and food and schooling subsidized by American taxpayers because, again, they’re working for shit pay. But all that never hits the company’s bottom line so it’s a win win for them. permalink parent award report block reply IncredibleMrE1 4 points 5 hours ago Yup permalink parent award report block reply newestofnew 15 points 5 hours ago its incredible that they think they can psyop people into believing that their children with unrealized potential because of failed and flawed education system are inferior to third worlders so inferior that its not even worth giving them a chance. this is winning messaging? permalink parent award report block reply GatoradeJeb 7 points 5 hours ago Its because he exposed his hatred of White man and his desire to replace us with browns permalink parent award report block reply tt777 4 points 5 hours ago Trump is a business man first. Business concerns will always be first to him. permalink parent award report block reply Wrexxis780 25 points 5 hours ago Unfortunately if he's more concerned about big stock numbers than a dead middle class America... his legacy will be dead. permalink parent award report block reply gunteh -2 points 5 hours ago Trump was given an America on life support, after Biden. He's also dealing with some financial swamp creatures still (Powell comes immediately to mind). With all that said, Trump has the defibrillators on full tilt, and if he can't get America back up on its feet, then we're screwed no matter who's in office next time around. permalink parent award report block reply YouEssAye 11 points 5 hours ago He's also dealing with some financial swamp creatures He's actively campaigning for Lindsey Graham. Can we dispense with this idea that there is any intention to drain the swamp? permalink parent award report block reply view 5 more comments... gunteh 5 points 5 hours ago Yeah, but just because it's legal doesn't make it ethical. If Trump said 50 year mortgages are legal, that doesn't make it ethical to give banks the ability to force people into 50 year mortgages with \"hey, look at your monthly payments now, much cheaper than 30 year mortgages, huh? Wanna go for the lower monthly payment?\" If you've ever been on an 84-month car loan, you'll know the pain of being stuck with that monthly payment for that long. permalink parent award report block reply Awakened 2 points 4 hours ago He should be concerned about impeachment if he loses the midterms. permalink parent award report block reply Megaboom2025 2 points 3 hours ago I think he’s the father in law of Israel first permalink parent award report block reply Long_time_lurker 2 points 4 hours ago It was a word salad but it sounded like he was talking about the original justification, which was that they'd do jobs the companies can't find an American who can do in high end science or whatever. The problem as we've seen is that the program is gamed to death and companies like them for being essentially slave labor that can't quit.  This goes hand-in-hand with being cheaper. So they post stupid job requirements on a message board nobody sees and get their desired candidate, possibly via internal transfer, instead of ever trying to hire American, and they get them for cheap and know they won't quit right away because they cannot. Thus you see some random bigcorp hiring people for $50k who normally make 2-3x that much. permalink parent award report block reply load 6 more comments...\nIncredibleMrE1 35 points 6 hours ago Funny how Americans can't do the jobs and training them would be cumbersome, so we need to bring in half a million foreigners from a hostile nation and train them instead. From the same admin that is justifying everything with \"muh national security.\" permalink parent award report block reply gunteh 25 points 5 hours ago Gaslighting is telling someone you're \"tough on immigration\" while also saying \"Americans can't do what these foreigners can\", change my mind... permalink parent award report block reply Madnote1984 7 points 5 hours ago The truth of the matter is, they want dirt cheap labor. There are plenty of competent Americans to do those jobs, but they expect a certain amount of pay. So the solution is to import foreigners who may be somewhat competent, but will work suicide hours for hardly no pay. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago And get their housing and food and schooling subsidized by American taxpayers because, again, they’re working for shit pay. But all that never hits the company’s bottom line so it’s a win win for them. permalink parent award report block reply IncredibleMrE1 4 points 5 hours ago Yup permalink parent award report block reply\ngunteh 25 points 5 hours ago Gaslighting is telling someone you're \"tough on immigration\" while also saying \"Americans can't do what these foreigners can\", change my mind... permalink parent award report block reply\nMadnote1984 7 points 5 hours ago The truth of the matter is, they want dirt cheap labor. There are plenty of competent Americans to do those jobs, but they expect a certain amount of pay. So the solution is to import foreigners who may be somewhat competent, but will work suicide hours for hardly no pay. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago And get their housing and food and schooling subsidized by American taxpayers because, again, they’re working for shit pay. But all that never hits the company’s bottom line so it’s a win win for them. permalink parent award report block reply IncredibleMrE1 4 points 5 hours ago Yup permalink parent award report block reply\nTheTelltaleFly 6 points 4 hours ago And get their housing and food and schooling subsidized by American taxpayers because, again, they’re working for shit pay. But all that never hits the company’s bottom line so it’s a win win for them. permalink parent award report block reply\nIncredibleMrE1 4 points 5 hours ago Yup permalink parent award report block reply\nnewestofnew 15 points 5 hours ago its incredible that they think they can psyop people into believing that their children with unrealized potential because of failed and flawed education system are inferior to third worlders so inferior that its not even worth giving them a chance. this is winning messaging? permalink parent award report block reply\nGatoradeJeb 7 points 5 hours ago Its because he exposed his hatred of White man and his desire to replace us with browns permalink parent award report block reply\ntt777 4 points 5 hours ago Trump is a business man first. Business concerns will always be first to him. permalink parent award report block reply Wrexxis780 25 points 5 hours ago Unfortunately if he's more concerned about big stock numbers than a dead middle class America... his legacy will be dead. permalink parent award report block reply gunteh -2 points 5 hours ago Trump was given an America on life support, after Biden. He's also dealing with some financial swamp creatures still (Powell comes immediately to mind). With all that said, Trump has the defibrillators on full tilt, and if he can't get America back up on its feet, then we're screwed no matter who's in office next time around. permalink parent award report block reply YouEssAye 11 points 5 hours ago He's also dealing with some financial swamp creatures He's actively campaigning for Lindsey Graham. Can we dispense with this idea that there is any intention to drain the swamp? permalink parent award report block reply view 5 more comments... gunteh 5 points 5 hours ago Yeah, but just because it's legal doesn't make it ethical. If Trump said 50 year mortgages are legal, that doesn't make it ethical to give banks the ability to force people into 50 year mortgages with \"hey, look at your monthly payments now, much cheaper than 30 year mortgages, huh? Wanna go for the lower monthly payment?\" If you've ever been on an 84-month car loan, you'll know the pain of being stuck with that monthly payment for that long. permalink parent award report block reply Awakened 2 points 4 hours ago He should be concerned about impeachment if he loses the midterms. permalink parent award report block reply Megaboom2025 2 points 3 hours ago I think he’s the father in law of Israel first permalink parent award report block reply\nWrexxis780 25 points 5 hours ago Unfortunately if he's more concerned about big stock numbers than a dead middle class America... his legacy will be dead. permalink parent award report block reply gunteh -2 points 5 hours ago Trump was given an America on life support, after Biden. He's also dealing with some financial swamp creatures still (Powell comes immediately to mind). With all that said, Trump has the defibrillators on full tilt, and if he can't get America back up on its feet, then we're screwed no matter who's in office next time around. permalink parent award report block reply YouEssAye 11 points 5 hours ago He's also dealing with some financial swamp creatures He's actively campaigning for Lindsey Graham. Can we dispense with this idea that there is any intention to drain the swamp? permalink parent award report block reply view 5 more comments...\ngunteh -2 points 5 hours ago Trump was given an America on life support, after Biden. He's also dealing with some financial swamp creatures still (Powell comes immediately to mind). With all that said, Trump has the defibrillators on full tilt, and if he can't get America back up on its feet, then we're screwed no matter who's in office next time around. permalink parent award report block reply YouEssAye 11 points 5 hours ago He's also dealing with some financial swamp creatures He's actively campaigning for Lindsey Graham. Can we dispense with this idea that there is any intention to drain the swamp? permalink parent award report block reply view 5 more comments...\nYouEssAye 11 points 5 hours ago He's also dealing with some financial swamp creatures He's actively campaigning for Lindsey Graham. Can we dispense with this idea that there is any intention to drain the swamp? permalink parent award report block reply view 5 more comments...\ngunteh 5 points 5 hours ago Yeah, but just because it's legal doesn't make it ethical. If Trump said 50 year mortgages are legal, that doesn't make it ethical to give banks the ability to force people into 50 year mortgages with \"hey, look at your monthly payments now, much cheaper than 30 year mortgages, huh? Wanna go for the lower monthly payment?\" If you've ever been on an 84-month car loan, you'll know the pain of being stuck with that monthly payment for that long. permalink parent award report block reply\nAwakened 2 points 4 hours ago He should be concerned about impeachment if he loses the midterms. permalink parent award report block reply\nMegaboom2025 2 points 3 hours ago I think he’s the father in law of Israel first permalink parent award report block reply\nLong_time_lurker 2 points 4 hours ago It was a word salad but it sounded like he was talking about the original justification, which was that they'd do jobs the companies can't find an American who can do in high end science or whatever. The problem as we've seen is that the program is gamed to death and companies like them for being essentially slave labor that can't quit.  This goes hand-in-hand with being cheaper. So they post stupid job requirements on a message board nobody sees and get their desired candidate, possibly via internal transfer, instead of ever trying to hire American, and they get them for cheap and know they won't quit right away because they cannot. Thus you see some random bigcorp hiring people for $50k who normally make 2-3x that much. permalink parent award report block reply\nbejeavis 44 points 6 hours ago Vivek is dead to this site for saying the exact same thing. Change my mind. permalink award report block reply popcultmember 12 points 4 hours ago And Elon same reason permalink parent award report block reply deleted 10 points 5 hours ago Bigstick7 8 points 5 hours ago Yep I like what Vance says but this part concerns me. I think Desantis should be the next Repub nominy. permalink parent award report block reply TheTelltaleFly 8 points 4 hours ago DeSantis is Israel first. He signed a Florida censorship law in freaking Israel FFS. permalink parent award report block reply SavingPrivateGrace 4 points 4 hours ago Stephen Miller is a natural God gifted MAGA, which neither of them are, was, or ever will be. permalink parent award report block reply gunteh 4 points 5 hours ago The arrow loosed too early or too late both miss the mark. permalink parent award report block reply Ricky_CIA 4 points 4 hours ago Yeah because jeets be jeetin' permalink parent award report block reply MediaBro 2 points 27 minutes ago All Vivek had to say was, \"Hey, American kids have been coddled for too long and we need to change this. Let's reform the H1B visa system and limit the numbers arriving but let's still let in a few. In the meantime, let's set up a 5 yr plan, where we find American kids that are patriotic and love the country and want to be given a chance to prove themselves - let's focus on those kids, give them a chance to prosper and from there, we figure out a way to continue uplifting more American-born kids\" This is how you win both sides. You show love of nation, love of the people you grew up with, love of even the people you think are lazy and love of the people who just want to show they too can work towards something great. But, nope, let's call Americans lazy and too stupid to do jobs in the very fields their own parents and grandparents helped create and set up. permalink parent award report block reply bejeavis 1 points 22 minutes ago Accurate permalink parent award report block reply\npopcultmember 12 points 4 hours ago And Elon same reason permalink parent award report block reply\ndeleted 10 points 5 hours ago Bigstick7 8 points 5 hours ago Yep I like what Vance says but this part concerns me. I think Desantis should be the next Repub nominy. permalink parent award report block reply TheTelltaleFly 8 points 4 hours ago DeSantis is Israel first. He signed a Florida censorship law in freaking Israel FFS. permalink parent award report block reply SavingPrivateGrace 4 points 4 hours ago Stephen Miller is a natural God gifted MAGA, which neither of them are, was, or ever will be. permalink parent award report block reply\nBigstick7 8 points 5 hours ago Yep I like what Vance says but this part concerns me. I think Desantis should be the next Repub nominy. permalink parent award report block reply TheTelltaleFly 8 points 4 hours ago DeSantis is Israel first. He signed a Florida censorship law in freaking Israel FFS. permalink parent award report block reply SavingPrivateGrace 4 points 4 hours ago Stephen Miller is a natural God gifted MAGA, which neither of them are, was, or ever will be. permalink parent award report block reply\nTheTelltaleFly 8 points 4 hours ago DeSantis is Israel first. He signed a Florida censorship law in freaking Israel FFS. permalink parent award report block reply\nSavingPrivateGrace 4 points 4 hours ago Stephen Miller is a natural God gifted MAGA, which neither of them are, was, or ever will be. permalink parent award report block reply\ngunteh 4 points 5 hours ago The arrow loosed too early or too late both miss the mark. permalink parent award report block reply\nRicky_CIA 4 points 4 hours ago Yeah because jeets be jeetin' permalink parent award report block reply\nMediaBro 2 points 27 minutes ago All Vivek had to say was, \"Hey, American kids have been coddled for too long and we need to change this. Let's reform the H1B visa system and limit the numbers arriving but let's still let in a few. In the meantime, let's set up a 5 yr plan, where we find American kids that are patriotic and love the country and want to be given a chance to prove themselves - let's focus on those kids, give them a chance to prosper and from there, we figure out a way to continue uplifting more American-born kids\" This is how you win both sides. You show love of nation, love of the people you grew up with, love of even the people you think are lazy and love of the people who just want to show they too can work towards something great. But, nope, let's call Americans lazy and too stupid to do jobs in the very fields their own parents and grandparents helped create and set up. permalink parent award report block reply bejeavis 1 points 22 minutes ago Accurate permalink parent award report block reply\nbejeavis 1 points 22 minutes ago Accurate permalink parent award report block reply\nCommietownUSA 29 points 5 hours ago How to lose the midterms and your legacy in one sentence: permalink award report block reply\nIncredibleMrE1 22 points 6 hours ago They're also not white. permalink award report block reply tribunabessica 10 points 5 hours ago And never will be. permalink parent award report block reply rebuildingMyself 8 points 5 hours ago Until they commit a violent crime and we need to classify race permalink parent award report block reply\ntribunabessica 10 points 5 hours ago And never will be. permalink parent award report block reply rebuildingMyself 8 points 5 hours ago Until they commit a violent crime and we need to classify race permalink parent award report block reply\nrebuildingMyself 8 points 5 hours ago Until they commit a violent crime and we need to classify race permalink parent award report block reply\nThrilly 17 points 5 hours ago They start by stealing our jobs.  They then import several generations of their families.  Then they breed.  Within 10 years America will turn into a 3rd world shithole permalink award report block reply GatoradeJeb 4 points 5 hours ago Worse they take the White woman for themselves as white woman have been braimwwshed to be race traitors permalink parent award report block reply newuser8 1 points 7 seconds ago White women don't race mix as much as you think. Black men and women race mix the most permalink parent award report block reply\nGatoradeJeb 4 points 5 hours ago Worse they take the White woman for themselves as white woman have been braimwwshed to be race traitors permalink parent award report block reply newuser8 1 points 7 seconds ago White women don't race mix as much as you think. Black men and women race mix the most permalink parent award report block reply\nnewuser8 1 points 7 seconds ago White women don't race mix as much as you think. Black men and women race mix the most permalink parent award report block reply\n24601 16 points 6 hours ago Serfs are cheaper than slaves because the ruler doesn't need to feed the serf. That's what the Globalists are after.... serfs. permalink award report block reply\n0Sum 15 points 6 hours ago And once they've scammed their way into management they discriminate in favor of their own kind. permalink award report block reply\ndeletedandreacted 14 points 6 hours ago They also stink permalink award report block reply Remember_the_Alamo 10 points 5 hours ago And are pushy and rude. permalink parent award report block reply IncredibleMrE1 -5 points 5 hours ago They have a better culture. permalink parent award report block reply Remember_the_Alamo 6 points 4 hours ago Ha!  So that's why they leave? permalink parent award report block reply 5DchessWatch 1 points 3 minutes ago I like my metropolitan areas to be so flooded with livestock that commutes take 3x longer than US where avg commute is already 45min.  Also I like walking into professional offices smeling like cowshits I stepped in permalink parent award report block reply\nRemember_the_Alamo 10 points 5 hours ago And are pushy and rude. permalink parent award report block reply IncredibleMrE1 -5 points 5 hours ago They have a better culture. permalink parent award report block reply Remember_the_Alamo 6 points 4 hours ago Ha!  So that's why they leave? permalink parent award report block reply 5DchessWatch 1 points 3 minutes ago I like my metropolitan areas to be so flooded with livestock that commutes take 3x longer than US where avg commute is already 45min.  Also I like walking into professional offices smeling like cowshits I stepped in permalink parent award report block reply\nIncredibleMrE1 -5 points 5 hours ago They have a better culture. permalink parent award report block reply Remember_the_Alamo 6 points 4 hours ago Ha!  So that's why they leave? permalink parent award report block reply 5DchessWatch 1 points 3 minutes ago I like my metropolitan areas to be so flooded with livestock that commutes take 3x longer than US where avg commute is already 45min.  Also I like walking into professional offices smeling like cowshits I stepped in permalink parent award report block reply\nRemember_the_Alamo 6 points 4 hours ago Ha!  So that's why they leave? permalink parent award report block reply\n5DchessWatch 1 points 3 minutes ago I like my metropolitan areas to be so flooded with livestock that commutes take 3x longer than US where avg commute is already 45min.  Also I like walking into professional offices smeling like cowshits I stepped in permalink parent award report block reply\nWhozat 12 points 5 hours ago If our grandmothers could build airplanes and battleships for WW2 and learned those jobs in weeks, not years,\nwhy do we need these people? permalink award report block reply bidensmissingbrain -4 points 5 hours ago Because the women of today are not our grandmothers. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago But we’re not at war so the men of today can build airplanes and battleships. permalink parent award report block reply bidensmissingbrain -3 points 3 hours ago And the men of today are not our grandfathers. permalink parent award report block reply\nbidensmissingbrain -4 points 5 hours ago Because the women of today are not our grandmothers. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago But we’re not at war so the men of today can build airplanes and battleships. permalink parent award report block reply bidensmissingbrain -3 points 3 hours ago And the men of today are not our grandfathers. permalink parent award report block reply\nTheTelltaleFly 6 points 4 hours ago But we’re not at war so the men of today can build airplanes and battleships. permalink parent award report block reply bidensmissingbrain -3 points 3 hours ago And the men of today are not our grandfathers. permalink parent award report block reply\nbidensmissingbrain -3 points 3 hours ago And the men of today are not our grandfathers. permalink parent award report block reply\nSleeperAgentSupreme 11 points 4 hours ago This is why JD Vance will not get my vote in 2028. Trump is doing this because Vance is in his ear and Vance's INDIAN wife is in his ear nagging all day. RIP the movement. When will we actually get a president that cares about America? permalink award report block reply\nbooblitchutz 9 points 5 hours ago They’re not even really cheaper. They are just locked into their job for 6 years (at a minimum). permalink award report block reply MakinBacon 8 points 5 hours ago Beat me to it. Somebody got a bonus for hiring them, virturally everytime, or a cut of their pay. permalink parent award report block reply FRONT_TOWARD_LEFT 4 points 4 hours ago Kickbacks paid back in India are part of the culture. permalink parent award report block reply MakinBacon 5 points 4 hours ago their culture, as are many other things not acceptable in America. permalink parent award report block reply\nMakinBacon 8 points 5 hours ago Beat me to it. Somebody got a bonus for hiring them, virturally everytime, or a cut of their pay. permalink parent award report block reply FRONT_TOWARD_LEFT 4 points 4 hours ago Kickbacks paid back in India are part of the culture. permalink parent award report block reply MakinBacon 5 points 4 hours ago their culture, as are many other things not acceptable in America. permalink parent award report block reply\nFRONT_TOWARD_LEFT 4 points 4 hours ago Kickbacks paid back in India are part of the culture. permalink parent award report block reply MakinBacon 5 points 4 hours ago their culture, as are many other things not acceptable in America. permalink parent award report block reply\nMakinBacon 5 points 4 hours ago their culture, as are many other things not acceptable in America. permalink parent award report block reply\nTrumpalorian 9 points 6 hours ago Are they cheaper after you factor in all the Gibs theyll take or damage they'll cause? permalink award report block reply wharfthrowaway 5 points 5 hours ago We pay for the gins and have to live with the crime and filth. The politicians and lobbyists don’t have to deal with it permalink parent award report block reply\nwharfthrowaway 5 points 5 hours ago We pay for the gins and have to live with the crime and filth. The politicians and lobbyists don’t have to deal with it permalink parent award report block reply\nRemember_the_Alamo 7 points 6 hours ago Immigrants are imitation brand Americans. permalink award report block reply\nforcedaspiration 6 points 5 hours ago They should hire cheap American kids if the boomers are too greedy, not panjeets. permalink award report block reply TheTelltaleFly 5 points 4 hours ago I work with so many boomers who just refuse to retire. There is no upward mobility because the boomers are occupying all the high-paying positions. Young kids can’t get a job because nobody in the middle has anywhere to go. permalink parent award report block reply forcedaspiration 2 points 2 hours ago They didn't have the heart to shit can the boomers stuck in the fax machine age, so they commit civilizational suicide instead. permalink parent award report block reply\nTheTelltaleFly 5 points 4 hours ago I work with so many boomers who just refuse to retire. There is no upward mobility because the boomers are occupying all the high-paying positions. Young kids can’t get a job because nobody in the middle has anywhere to go. permalink parent award report block reply forcedaspiration 2 points 2 hours ago They didn't have the heart to shit can the boomers stuck in the fax machine age, so they commit civilizational suicide instead. permalink parent award report block reply\nforcedaspiration 2 points 2 hours ago They didn't have the heart to shit can the boomers stuck in the fax machine age, so they commit civilizational suicide instead. permalink parent award report block reply\nBidenSniffsLittleKid 6 points 6 hours ago Somebody should tell Trump permalink award report block reply\nAggrieved03 5 points 5 hours ago Republican donors love them! We’re ruled not represented. permalink award report block reply NO_RINOs 4 points 4 hours ago We are definitely NOT being represented by our politicians! Homeschool your kids and prepare for the worst. Have a backup option if the USA falls apart because of our traitorous politicians. permalink parent award report block reply\nNO_RINOs 4 points 4 hours ago We are definitely NOT being represented by our politicians! Homeschool your kids and prepare for the worst. Have a backup option if the USA falls apart because of our traitorous politicians. permalink parent award report block reply\nJehsun 4 points 2 hours ago Trump deserves just as much pushback as elong and Vivek had when they presented this same point.. I can't believe he would actually say what he said.. permalink award report block reply\nHeavenlyTrumpets 4 points 5 hours ago Also they often don't know what they claim to know. They just learn on the job, while Americans are required to prove what they know. permalink award report block reply\nbluewhiteandred 3 points 3 hours ago it's just corporate greed, taking advantage of the poors in other countries while slashing wages for Americans permalink award report block reply\nPillarOfWisdom 3 points 5 hours ago Woah.  If you laugh or agree with this meme, doesn't that make you a doomer? permalink award report block reply\nTrajano 3 points 5 hours ago This is 100% true. permalink award report block reply\nTheDevilMonkey 3 points 1 hour ago All the cultists love jeets now. Very sad. Thank you for your attention to this matter. permalink award report block reply\naaafirefly123 3 points 4 hours ago I think Trump sees 2 options: Either import cheap labor and keep the businesses here. Or let the businesses outsource to countries with slave labor. For the government, the former is preferable to the later. permalink award report block reply TheTelltaleFly 6 points 4 hours ago What’s the point of having the manufacturing here if they aren’t hiring Americans? Just to pollute our fucking water and invade our schools with their litters of kids who don’t speak English? permalink parent award report block reply aaafirefly123 1 points 3 hours ago Well for the government, the point of keeping the businesses here is to build and maintain manufacturing infrastructure while denying said infrastructure to China. Every business that outsources to China empowers China just a little bit more. permalink parent award report block reply\nTheTelltaleFly 6 points 4 hours ago What’s the point of having the manufacturing here if they aren’t hiring Americans? Just to pollute our fucking water and invade our schools with their litters of kids who don’t speak English? permalink parent award report block reply aaafirefly123 1 points 3 hours ago Well for the government, the point of keeping the businesses here is to build and maintain manufacturing infrastructure while denying said infrastructure to China. Every business that outsources to China empowers China just a little bit more. permalink parent award report block reply\naaafirefly123 1 points 3 hours ago Well for the government, the point of keeping the businesses here is to build and maintain manufacturing infrastructure while denying said infrastructure to China. Every business that outsources to China empowers China just a little bit more. permalink parent award report block reply\nPDWUsername 2 points 5 hours ago They are cheaper per hour because they're willing to work 15 hours a day on the same salary as an American to make enough money to support their family of 10 back home. permalink award report block reply popcultmember 6 points 4 hours ago I dont buy this. I've worked w hundreds of them. They are fake af. Show up right before the boss, leave right after the boss, talk about all the hours they put in, be on cell phone in break room all the time. They definitely don't work harder or contribute more permalink parent award report block reply\npopcultmember 6 points 4 hours ago I dont buy this. I've worked w hundreds of them. They are fake af. Show up right before the boss, leave right after the boss, talk about all the hours they put in, be on cell phone in break room all the time. They definitely don't work harder or contribute more permalink parent award report block reply\nbehemoth887 2 points 55 minutes ago they're not cheaper though, the damage they cause to the environment and the infrastructure in addition to the lower quality of work offsets the lower salary permalink award report block reply\nNO_RINOs 2 points 4 hours ago Well, I am definitely off the trump train now. We all have to stick up and fight for ourselves. Government nor the politicians will help or protect us. Honestly questioning whether Trump is becoming senile. His handlers told him to insult his base now? Trump clearly loves Israel more than the USA. What happened to no more wars, Donnie boy? You bombed Iran. Peace is supposed to the prize! This is why I am a Ron Paul libertarian. I can take care of myself. Just want to make sure government is neutered so it can't hurt me. permalink award report block reply\nEshasta 2 points 50 minutes ago Depends which Iones were looking at. There are millions of inner-city Street rats who aren't talented enough to do anything. If we isolate the black community, I think 40% aren't employed full-time or care to be. We need to eliminate the welfare state first before we assess who's talented or not. permalink award report block reply\npatrioticwinning3 2 points 48 minutes ago EXACTLY!  WAKE THE FUCK UP TRUMP!!!  THANK YOU FOR YOUR ATTENTION TO THIS MATTER! permalink award report block reply\nMhmm2MoreWeeks 1 points 2 hours ago So you mean to tell me the WEF Stakeholder class has no loyalty to God, Race, Nation, State, Community, Faith, Family, or anything other then their own power? Who Knew??? Blame Jews harder Geniuses. Surely that will fix it. /s permalink award report block reply\nirescreams 1 points 3 hours ago scammers all of them permalink award report block reply\nBeardholder 1 points 5 hours ago They are not even cheaper. THey are the ones buying all these $500k-$3 million homes here in Dallas. permalink award report block reply\nFKH2 1 points 4 hours ago They don't get benefits either permalink award report block reply\ngriff 1 points 5 hours ago They also have that Eastern \"slavish\" behavior to leadership. They just do as they are told. permalink award report block reply\ndixontic 1 points 3 hours ago Cheaply written code is the most expensive. permalink award report block reply\nRedditIs4Retards 1 points 5 hours ago I always have problems with illegal framers, siding, and sheet rockers. They either destroy my electrical, knock out my boxes so they can repair their framing screw ups and proceed to leave my boxes out, bury boxes and wiring behind sheetrock, and when asked to block and do siding around exterior electrical, \"uhhh I ask heem contrrractor to do\" then proceeds not to ask and leaves it as is. Can't speak English so they don't even make an attempt to communicate so we can work together. permalink award report block reply\nSenaleb 1 points 5 hours ago Finally, the real sentiment is making it to the top. permalink award report block reply\nShmioighan 1 points 5 hours ago Cheaper AND more cooperative/collectivized. permalink award report block reply\nalucard13mmfmj 1 points 39 minutes ago Thats not even true.. since the quality is crap lol. permalink award report block reply\nmilutza 1 points 1 hour ago As an imigrant, myself, i can confirm. My employers just cared that they could hire me for half pay and replace two people.\nIt's sad as this is not the mentality that made the west successfull... permalink award report block reply\nrastren 1 points 4 hours ago Full intention has nothing to do with jobs, it's a full on war against the American people to take over the federal government. These people don't care, they will vote for communism and erode societal trust. Trump needs to denaturalize these people and deport them. permalink award report block reply\nhappyfave 1 points 4 hours ago There are smart ones too.  Isn't there like a billion people.. Got to assume there is a few smart ones in there. permalink award report block reply\n5DchessWatch 1 points 6 minutes ago CS degree : check Knows javascript: check Call center experience w/ microsoft technical support and/or warranty expiration: check Threw food dyes soon to be banned in the US during holi festival: check Commuted to work with goats and 200 others hanging off the sides of a dump truck: check Threw cowpaddies at friend during pagan worshipful fest: check Ok, Padjeep, you're in permalink award report block reply\nWesmacker 1 points 47 minutes ago They are dumber and less talented to be honest permalink award report block reply\nFormerlurker92 0 points 5 hours ago I support antifa tactics against insoursing companies permalink award report block reply\nFranklymydear -4 points 5 hours ago I have never seen people get their fucking panties in a bunch so fast….\nChristiansAreIsrael 1 points 4 hours ago \"Anyone in business knows that your general American guy out there is a total dumbass -sorry but that’s just the truth. \" Fuck yourself you jeet average 70 IQ faggot. Pushing yes man politics to enable your filth being further imported. permalink parent award report block reply Franklymydear 0 points 3 hours ago You jeet ? Is that proper grammar where you come from? Or are you too lazy to pay attention to the details of your post? I’m not a jeet. Moron permalink parent award report block reply\nFranklymydear 0 points 3 hours ago You jeet ? Is that proper grammar where you come from? Or are you too lazy to pay attention to the details of your post? I’m not a jeet. Moron permalink parent award report block reply"}