{"id": "8185097", "contents": "63 JUST IN: 🇺🇸 Treasury Secretary Bessent announces “$2,000 tariff stimulus checks” likely for Americans earning under $100,000/year. posted 6 hours ago by -Evspra 34 comments award share report block Remarks @remarks • 6h JUST IN: 🇺🇸 Treasury Secretary Bessent announces “$2,000 tariff stimulus checks” likely for Americans earning under $100,000/year.\n34 comments Sort by Top Top New Worst Old Save JoePlumber 15 points 6 hours ago Oh cool. Fuck the rest of us who are middle class and paying taxes out the ass I guess. permalink award report block reply SHILL_DETECTOR 3 points 6 hours ago im assuming this means 100k for married couples, but 50k for single filers? otherwise it might be 200k for married... permalink parent award report block reply JoePlumber 4 points 6 hours ago In another thing he says $100k families. Idk where they're getting that $100k combined income is upper middle class. permalink parent award report block reply FromNC 2 points 6 hours ago I live in a low cost of living area with a $250k house and my $110k salary + wife’s $60k is barely enough. That’s with 1 car payment(700) and 1 student loan payment($350) and no other ‘bad’ debt. I’m sure there are plenty of countries where $100k is middle class in but it’s not this one. I’d hate to live somewhere where the average house is at the national average. permalink parent award report block reply JoePlumber 2 points 5 hours ago Yeah $100k for a family doesn't go very far these days. This is honestly horseshit because most of the families earning under $100k are Democrats. permalink parent award report block reply geckogreen 1 points 5 hours ago You need Dave Ramsey if you are struggling with a170k income and a cheap house. For one thing get rid of that $700 car payment. permalink parent award report block reply view 3 more comments... Patriot4TN 3 points 6 hours ago If this is 50k for a single filer, Americans just got fucked again. Let's hope this is not the case. permalink parent award report block reply PhantomShield72 1 points 4 hours ago Let's hope against the evidence... permalink parent award report block reply Krat 0 points 5 hours ago You are slaves to a communist state now permalink parent award report block reply RejectoftheRepublic 12 points 6 hours ago Whatever happened to getting rid of Income tax? Why is the solution always free money and not less taxation even from our own side? The economic policies of this admin have been horrible so far. 50 year mortgages, 2,000 stimulus checks, and h1b visas for Chinese? Not to mention the latest Trump interview where he sounds like Joe Biden denying people's economic struggles. What the hell is going on? This is not what we voted for. If we end up with a socialist president in 2028 Donald Trump will be to blame because of stupid economic policies like this. Why not vote socialist when even the previous Republican president was in favor of handing out free money? We need to put pressure on this admin to wake them the hell up and change course fast!! permalink award report block reply FusionBlack 5 points 6 hours ago This is getting stranger by the minute. permalink parent award report block reply friarfox 7 points 5 hours ago The illegals will get twice the amount and one for each borrowed kid. permalink award report block reply someguy7738 5 points 6 hours ago Great, so our purchasing power is about to take a massive hit. permalink award report block reply PensivePatriot 2 points 5 hours ago Peanut M&Ms used to be 75 CENTS for a “party size bag” in 1996. One third of that same bag is now $12. permalink parent award report block reply NadlersNads 5 points 6 hours ago Not happy cirizens? Here, take this bribe and believe all is well permalink award report block reply -Evspra OP 4 points 6 hours ago is we getting a stimulus check?? shieeeett permalink award report block reply Aggrieved03 4 points 6 hours ago Give me dat government money. Maybe it will arrive after my Doge dividend. permalink award report block reply DenturesNancy 3 points 6 hours ago all middle class Americans oughtta have a business on the side on paper and claim losses every damn year so they owe as little as possible in taxes.\nThis admin has completely deflated, we started with \"Eliminate the IRS\", now we're at \"Best we can do is send $2k checks to people that might not deserve it\" permalink award report block reply HeatherSwanson 3 points 6 hours ago Pay down the national debt! Donald, stop listening to your Democrat hires permalink award report block reply keeptherepublic1776 -1 points 5 hours ago Fuck the debt. permalink parent award report block reply DestroyerofCobwebs 2 points 5 hours ago Great, more gibs for the people who basically aren't paying taxes in the first place. permalink award report block reply mty_green_go 2 points 5 hours ago great, i'm getting fucked again. Thanks Donald! permalink award report block reply TrumpPatriot84 2 points 4 hours ago Anyone on any other assistance; welfare, EBT, SNAP, etc.. should be disqualified. permalink award report block reply TrancePhreak 1 points 4 hours ago Link a real source for this, please. permalink award report block reply PhantomShield72 1 points 4 hours ago Whoopie fuckin' dooooooooo. The 2K is worth about $850 bucks. Truly \"life changing\". How much was sent to Ukraine? Israel? Uganda? How much was sent to support LGTBQWERTY studies in Pakistan? FUCK ALL OF THIS. permalink award report block reply medicpatriot 1 points 5 hours ago Fuck you permalink award report block reply Paralax 1 points 5 hours ago Tired of this socialist shit… permalink award report block reply Krat 0 points 5 hours ago We are in a communist state now permalink parent award report block reply Langtath 1 points 5 hours ago I don't even want the check, just end all income tax and we're good. permalink award report block reply BerettaStroker 1 points 6 hours ago This is to calm down all the food stamps whores who got pissed about their EBT cards not working for 2 weeks. permalink award report block reply Patriot4TN 1 points 4 hours ago I am looking for a marketing guru. I think we can sell the American people jars of vaseline for an inflated price. I just need a catchy slogan. After all, it seems we love being taken advantage of time and time again! permalink award report block reply\nJoePlumber 15 points 6 hours ago Oh cool. Fuck the rest of us who are middle class and paying taxes out the ass I guess. permalink award report block reply SHILL_DETECTOR 3 points 6 hours ago im assuming this means 100k for married couples, but 50k for single filers? otherwise it might be 200k for married... permalink parent award report block reply JoePlumber 4 points 6 hours ago In another thing he says $100k families. Idk where they're getting that $100k combined income is upper middle class. permalink parent award report block reply FromNC 2 points 6 hours ago I live in a low cost of living area with a $250k house and my $110k salary + wife’s $60k is barely enough. That’s with 1 car payment(700) and 1 student loan payment($350) and no other ‘bad’ debt. I’m sure there are plenty of countries where $100k is middle class in but it’s not this one. I’d hate to live somewhere where the average house is at the national average. permalink parent award report block reply JoePlumber 2 points 5 hours ago Yeah $100k for a family doesn't go very far these days. This is honestly horseshit because most of the families earning under $100k are Democrats. permalink parent award report block reply geckogreen 1 points 5 hours ago You need Dave Ramsey if you are struggling with a170k income and a cheap house. For one thing get rid of that $700 car payment. permalink parent award report block reply view 3 more comments... Patriot4TN 3 points 6 hours ago If this is 50k for a single filer, Americans just got fucked again. Let's hope this is not the case. permalink parent award report block reply PhantomShield72 1 points 4 hours ago Let's hope against the evidence... permalink parent award report block reply Krat 0 points 5 hours ago You are slaves to a communist state now permalink parent award report block reply\nSHILL_DETECTOR 3 points 6 hours ago im assuming this means 100k for married couples, but 50k for single filers? otherwise it might be 200k for married... permalink parent award report block reply JoePlumber 4 points 6 hours ago In another thing he says $100k families. Idk where they're getting that $100k combined income is upper middle class. permalink parent award report block reply FromNC 2 points 6 hours ago I live in a low cost of living area with a $250k house and my $110k salary + wife’s $60k is barely enough. That’s with 1 car payment(700) and 1 student loan payment($350) and no other ‘bad’ debt. I’m sure there are plenty of countries where $100k is middle class in but it’s not this one. I’d hate to live somewhere where the average house is at the national average. permalink parent award report block reply JoePlumber 2 points 5 hours ago Yeah $100k for a family doesn't go very far these days. This is honestly horseshit because most of the families earning under $100k are Democrats. permalink parent award report block reply geckogreen 1 points 5 hours ago You need Dave Ramsey if you are struggling with a170k income and a cheap house. For one thing get rid of that $700 car payment. permalink parent award report block reply view 3 more comments... Patriot4TN 3 points 6 hours ago If this is 50k for a single filer, Americans just got fucked again. Let's hope this is not the case. permalink parent award report block reply PhantomShield72 1 points 4 hours ago Let's hope against the evidence... permalink parent award report block reply\nJoePlumber 4 points 6 hours ago In another thing he says $100k families. Idk where they're getting that $100k combined income is upper middle class. permalink parent award report block reply FromNC 2 points 6 hours ago I live in a low cost of living area with a $250k house and my $110k salary + wife’s $60k is barely enough. That’s with 1 car payment(700) and 1 student loan payment($350) and no other ‘bad’ debt. I’m sure there are plenty of countries where $100k is middle class in but it’s not this one. I’d hate to live somewhere where the average house is at the national average. permalink parent award report block reply JoePlumber 2 points 5 hours ago Yeah $100k for a family doesn't go very far these days. This is honestly horseshit because most of the families earning under $100k are Democrats. permalink parent award report block reply geckogreen 1 points 5 hours ago You need Dave Ramsey if you are struggling with a170k income and a cheap house. For one thing get rid of that $700 car payment. permalink parent award report block reply view 3 more comments...\nFromNC 2 points 6 hours ago I live in a low cost of living area with a $250k house and my $110k salary + wife’s $60k is barely enough. That’s with 1 car payment(700) and 1 student loan payment($350) and no other ‘bad’ debt. I’m sure there are plenty of countries where $100k is middle class in but it’s not this one. I’d hate to live somewhere where the average house is at the national average. permalink parent award report block reply JoePlumber 2 points 5 hours ago Yeah $100k for a family doesn't go very far these days. This is honestly horseshit because most of the families earning under $100k are Democrats. permalink parent award report block reply geckogreen 1 points 5 hours ago You need Dave Ramsey if you are struggling with a170k income and a cheap house. For one thing get rid of that $700 car payment. permalink parent award report block reply view 3 more comments...\nJoePlumber 2 points 5 hours ago Yeah $100k for a family doesn't go very far these days. This is honestly horseshit because most of the families earning under $100k are Democrats. permalink parent award report block reply\ngeckogreen 1 points 5 hours ago You need Dave Ramsey if you are struggling with a170k income and a cheap house. For one thing get rid of that $700 car payment. permalink parent award report block reply view 3 more comments...\nPatriot4TN 3 points 6 hours ago If this is 50k for a single filer, Americans just got fucked again. Let's hope this is not the case. permalink parent award report block reply PhantomShield72 1 points 4 hours ago Let's hope against the evidence... permalink parent award report block reply\nPhantomShield72 1 points 4 hours ago Let's hope against the evidence... permalink parent award report block reply\nKrat 0 points 5 hours ago You are slaves to a communist state now permalink parent award report block reply\nRejectoftheRepublic 12 points 6 hours ago Whatever happened to getting rid of Income tax? Why is the solution always free money and not less taxation even from our own side? The economic policies of this admin have been horrible so far. 50 year mortgages, 2,000 stimulus checks, and h1b visas for Chinese? Not to mention the latest Trump interview where he sounds like Joe Biden denying people's economic struggles. What the hell is going on? This is not what we voted for. If we end up with a socialist president in 2028 Donald Trump will be to blame because of stupid economic policies like this. Why not vote socialist when even the previous Republican president was in favor of handing out free money? We need to put pressure on this admin to wake them the hell up and change course fast!! permalink award report block reply FusionBlack 5 points 6 hours ago This is getting stranger by the minute. permalink parent award report block reply\nFusionBlack 5 points 6 hours ago This is getting stranger by the minute. permalink parent award report block reply\nfriarfox 7 points 5 hours ago The illegals will get twice the amount and one for each borrowed kid. permalink award report block reply\nsomeguy7738 5 points 6 hours ago Great, so our purchasing power is about to take a massive hit. permalink award report block reply PensivePatriot 2 points 5 hours ago Peanut M&Ms used to be 75 CENTS for a “party size bag” in 1996. One third of that same bag is now $12. permalink parent award report block reply\nPensivePatriot 2 points 5 hours ago Peanut M&Ms used to be 75 CENTS for a “party size bag” in 1996. One third of that same bag is now $12. permalink parent award report block reply\nNadlersNads 5 points 6 hours ago Not happy cirizens? Here, take this bribe and believe all is well permalink award report block reply\n-Evspra OP 4 points 6 hours ago is we getting a stimulus check?? shieeeett permalink award report block reply\nAggrieved03 4 points 6 hours ago Give me dat government money. Maybe it will arrive after my Doge dividend. permalink award report block reply\nDenturesNancy 3 points 6 hours ago all middle class Americans oughtta have a business on the side on paper and claim losses every damn year so they owe as little as possible in taxes.\nThis admin has completely deflated, we started with \"Eliminate the IRS\", now we're at \"Best we can do is send $2k checks to people that might not deserve it\" permalink award report block reply\nHeatherSwanson 3 points 6 hours ago Pay down the national debt! Donald, stop listening to your Democrat hires permalink award report block reply keeptherepublic1776 -1 points 5 hours ago Fuck the debt. permalink parent award report block reply\nkeeptherepublic1776 -1 points 5 hours ago Fuck the debt. permalink parent award report block reply\nDestroyerofCobwebs 2 points 5 hours ago Great, more gibs for the people who basically aren't paying taxes in the first place. permalink award report block reply\nmty_green_go 2 points 5 hours ago great, i'm getting fucked again. Thanks Donald! permalink award report block reply\nTrumpPatriot84 2 points 4 hours ago Anyone on any other assistance; welfare, EBT, SNAP, etc.. should be disqualified. permalink award report block reply\nTrancePhreak 1 points 4 hours ago Link a real source for this, please. permalink award report block reply\nPhantomShield72 1 points 4 hours ago Whoopie fuckin' dooooooooo. The 2K is worth about $850 bucks. Truly \"life changing\". How much was sent to Ukraine? Israel? Uganda? How much was sent to support LGTBQWERTY studies in Pakistan? FUCK ALL OF THIS. permalink award report block reply\nmedicpatriot 1 points 5 hours ago Fuck you permalink award report block reply\nParalax 1 points 5 hours ago Tired of this socialist shit… permalink award report block reply Krat 0 points 5 hours ago We are in a communist state now permalink parent award report block reply\nKrat 0 points 5 hours ago We are in a communist state now permalink parent award report block reply\nLangtath 1 points 5 hours ago I don't even want the check, just end all income tax and we're good. permalink award report block reply\nBerettaStroker 1 points 6 hours ago This is to calm down all the food stamps whores who got pissed about their EBT cards not working for 2 weeks. permalink award report block reply\nPatriot4TN 1 points 4 hours ago I am looking for a marketing guru. I think we can sell the American people jars of vaseline for an inflated price. I just need a catchy slogan. After all, it seems we love being taken advantage of time and time again! permalink award report block reply"}