{"id": "8185347", "contents": "960 IT'S OFFICIAL: The US Mint will officially STOP minting pennies. Today, the LAST Penny will be minted! posted 8 hours ago by Eruditio 243 comments award share report block The Patriot Oasis™ @ThePatriotOasis • 9h 🚨BREAKING: IT'S OFFICIAL: The US Mint will officially STOP minting pennies. Today, the LAST Penny will be minted! One Penny Costs the U.S Taxpayer $0.37 cents to Mint. U.S. Mint lost $85,300,000,000 BILLION minting pennies in FY2024 alone.\n243 comments Sort by Top Top New Worst Old Save The Real Story Behind His Exit No One Saw Coming Read More Ads by Ad.Style SpaceWizard 120 points 8 hours ago How the fuck are people going to give their two cents permalink award report block reply ToxicAvengerOhio 55 points 8 hours ago Penny for your thoughts? The price just went up. permalink parent award report block reply BeauHD 53 points 7 hours ago $85,300,000,000 BILLION Let that number sink in. Eighty-Five SEXTILLION dollars. permalink parent award report block reply Bohemyth_2 15 points 7 hours ago FUCK JOE BIDEN permalink parent award report block reply TDAF 7 points 7 hours ago Auto-penny just got revoked. permalink parent award report block reply vongregormench 2 points 5 hours ago This permalink parent award report block reply Modern_Times 6 points 7 hours ago Goes along with the  $0.37 cents to mint. Should say 3.7 cents. permalink parent award report block reply mty_green_go 6 points 7 hours ago 85 quadrillion trillion billion. extra spicy permalink parent award report block reply brimshae 1 points 2 hours ago Serious question: Why don't they stop using copper on them? It would be a bit of a change for people, but copper prices went from under 50 cents a pound at the end of the 60s to over $50 a pound the next year , and other than a crash in 2011 have still been incredibly high compared to that 1960s price. permalink parent award report block reply cryptoapebot 1 points 6 hours ago yeah, mixed financial metaphors, lol permalink parent award report block reply load 4 more comments... Bolo 6 points 7 hours ago \"If it's a penny for your thoughts and you put in your two cents worth, then someone, somewhere is making a penny.\" permalink parent award report block reply Standingoak 1 points 7 hours ago They just don't have thoughts....something about only landowners voting permalink parent award report block reply DeportThemAllForever 3 points 7 hours ago Worry about inflation.  There government assholes created so much inflation that it costs 37 cents to make one. This is why gold will be at 10k soon, inflation is still very strong. Nation ran by banks will be forever in inflation and debt. permalink parent award report block reply AIDS1255 14 points 8 hours ago Inflation my guy, gotta give 5 cents now permalink parent award report block reply BeauHD 10 points 7 hours ago Yeah but they say above \"$0.37 cents\" so is that 37 cents or 0.37 cents? Patriot Oasis is the stuff hashish is made of. permalink parent award report block reply BoughtByBloomberg2 3 points 5 hours ago 3.7. Each penny costa 3.7 pennies. permalink parent award report block reply SemperFidelis231 3 points 4 hours ago Yeah the dude wrote this tweet like a retard. The answer is a single penny costs about 3.7 cents to mint and distribute. And the US government spent 56 million dollars minting pennies last year. I have absolutely no idea where 85 billion is coming from. The US spends only 1.1 billion per year to mint ALL currency. permalink parent award report block reply Modern_Times 2 points 7 hours ago 3.7 cents permalink parent award report block reply RejectRedditization 2 points 7 hours ago 85 billion BILLION is also more than the planet is worth permalink parent award report block reply mty_green_go 2 points 7 hours ago what about 85 trillion billion? all paid with spice permalink parent award report block reply view 1 more comments... FinishTheBorderWall 2 points 4 hours ago That’s literally an oxymoron. The correct amount would be 3.7 cents, also expressible as $.037 permalink parent award report block reply Shitsbrokeyo 6 points 8 hours ago Sign of the times permalink parent award report block reply SavingPrivateGrace 6 points 8 hours ago People can't even rub 2 nickles together, get rid of them too. permalink parent award report block reply booblitchutz 3 points 7 hours ago Just swipe your card bro. Cmon bro. permalink parent award report block reply PM_ME_UR_MAGIC_CARDS 2 points 7 hours ago Maybe they'll mint a two-cent coin permalink parent award report block reply load 11 more comments... SHILL_DETECTOR 59 points 8 hours ago we are fucked permalink award report block reply South_Florida_Guy 50 points 8 hours ago Just take out a 50 year mortgage, you'll be fine permalink parent award report block reply SHILL_DETECTOR 16 points 7 hours ago lmao you got me with that one permalink parent award report block reply TruthyBrat 8 points 7 hours ago Don't forget your 10 year car note. On a car that will last 6-7 years due to all the regulatory bullshit required. permalink parent award report block reply lostremote- 5 points 7 hours ago Thats why I fix my late 90s Ranger.  It will outlive me. permalink parent award report block reply view 1 more comments... laredditarmy 2 points 4 hours ago l0l permalink parent award report block reply newestofnew 38 points 8 hours ago \"let them have usury\" permalink parent award report block reply they-see-me-trollin 9 points 5 hours ago this. the reason why they're going fucking crazy about Nazis is not because Trump is one, but because if you look up what actually happened after WWI, the outcomes were fucking obvious. the \"losers\" of WWI were either dissolved or buried in debt slavery.  germany was the latter.  and these kids growing up were now responsible for this cosmic debt slavery for something they had nothing to do with.  Hitler offered a way out, by banning usury, and instating increasing mortgage forgiveness for every baby a german had.  that's why he gathered so much power so quickly... he ran on a platform of withdrawing germans from the debt slavery of a prior generation.  and ultimately when it came out who owned the bulk of that debt, it was Js.  things continued to escalate and spiral out because the debt slavers weren't going to let their debt slaves go quietly. see, usury is cancer in that it allows foreign lenders to subvert entire economies.  they make money much more available, which drives up prices, pushing more people to have to borrow to be able to afford things, which pushed up prices even more.  ALL debt spending does this, just a question of by how much. so now with debt slavery in the US continuing to climb, 50 year mortgages, student loans that are enslaving an entire generation, failing social security and medicare, and all this other broken government run wealth redistribution with no way to fund the outlays in the future other than higher and higher taxes, people are starting to wake the fuck up.  the problem isn't Trump.  the problem is the guy who comes after Trump who says the debt slavers need to be dragged into the streets, hung up on a meathook through their asshole, and then gutted like a fish... and only that because they're such vile scum that shooting them in the head execution style would be a waste of a perfectly good bullet.  they're trying to spark a totalitarian revolution, but they want it to be globalist, not nationalist.  shit, hitler was seen as far left until the 1960s when literally communist academics redefined \"national socialism\" as being right wing. coincidentally, islam bans usury across the board.  so anyone opposing banning usury is an islamophobic bigot. permalink parent award report block reply Friendly_B 6 points 5 hours ago This so-called \"noticer\" is ignoring the Bank of England, and ignoring that magically somehow the London Financial District is the most expensive real estate in the world. Ignoring that America forgot to wage a revolution against the Bank of England after \"winning\" the Revolutionary War. Ignoring ignoring. permalink parent award report block reply SwedishChainsaw2 4 points 2 hours ago Who owns the bank of england? permalink parent award report block reply Nanteen 5 points 4 hours ago Gee, I wonder if they're going to round up or round down all the taxes? permalink parent award report block reply vongregormench 4 points 5 hours ago You’re the reason I had to fuck around with a change purse on my wallet for an extra two decades in a constant shuffle to get rid of as many pennies as possible. I still lost and have a huge jar full. They’re worthless and a hassle and cost the government millions of taxpayer dollars to make. It’s 20 years too late. Fuck the penny. permalink parent award report block reply SHILL_DETECTOR 4 points 5 hours ago ok once the penny is gone the nickel will be gone in like 4 years permalink parent award report block reply Cptthunder 2 points 4 hours ago Yeah but if the nickle is gone, you can't be nickle and dimed anymore. permalink parent award report block reply vongregormench 2 points 5 hours ago Yes, also good. Take it all the way up to the quarter. I was in europe in 2004 and the lowest change I was ever given was .25. It was nice. I didn't have a bunch of worthless change when I came home. I was able to use the change since it wasn't all this loose bullshit worthless stuff. When it was the German Mark all the stuff lower than .25 was copper and they called it brown money and it was essentially treated like we do with the penny. Worthless garbage. permalink parent award report block reply SHILL_DETECTOR 5 points 4 hours ago usa wont stop until theres no cash at all permalink parent award report block reply view 1 more comments... TrumpIsTheVictor 3 points 4 hours ago It is not worthless change, you dumb faggot. Move to Europe. permalink parent award report block reply view 1 more comments... tarballs 1 points 4 hours ago Coins make for great shrapnel... permalink parent award report block reply load 3 more comments... rightoverthere 43 points 8 hours ago we need to make $1000 bills. it just makes it easier to pay for all the expensive shit. it saves room in the wallet too permalink award report block reply danneskjold 26 points 8 hours ago I recently was paid in a bunch of $100 bills.  I was very surprised at how many places won't take them.  I'm looking at you, Steak 'n' Shake.  The tallow fries are great, but the experience has become so impersonal that I can't even anymore. permalink parent award report block reply AlmostFullyDilated 18 points 8 hours ago if they won't take your legal tender that's on them, enjoy your free meal! permalink parent award report block reply RedStoneDeepState 13 points 8 hours ago You pay before your meal there, legal tender only matters for debts or paying the government. permalink parent award report block reply 1DontTreadOnMe1 9 points 8 hours ago I've never paid before eating at a Steak & Shake. permalink parent award report block reply edxzxz 8 points 7 hours ago 'All debts public and private'.  Says so right on the paper money. permalink parent award report block reply view 7 more comments... schiff_for_brains 4 points 8 hours ago This pede currencies. permalink parent award report block reply The_Yakuza 0 points 3 hours ago Enjoy your ride to jail to lol. permalink parent award report block reply AlmostFullyDilated 4 points 2 hours ago that's not how it works. if a restaurant refuses to take my money that's on them. I've never encountered a restaurant that can't break 100 permalink parent award report block reply view 1 more comments... sm12381 -3 points 8 hours ago For all debts public and private. A fucking burger isn't a debt. Grocery stores aren't debts. Turn your brain on permalink parent award report block reply RedStoneDeepState 7 points 8 hours ago A burger can be a debt if it's a sit down restaurant where you pay after the meal. Steak and shake isn't that way though. permalink parent award report block reply BannedAccount 5 points 7 hours ago Owing money to anyone for any reason is a debt. Buying groceries? That's a debt, once rung up the debt is owed until paid. Order a burger? Yep that's a debt (even if you pay before you get the burger) until its either paid or canceled. permalink parent award report block reply view 8 more comments... AlmostFullyDilated 2 points 7 hours ago if they don't want my money that's on them permalink parent award report block reply suckmycorona 3 points 7 hours ago Hundreds are the new twenty permalink parent award report block reply ADAM_SCHITT 5 points 7 hours ago A $50 bill now is worth the same as a $20 bill in 1990 permalink parent award report block reply QSWO1 3 points 7 hours ago Wetbacks have pockets full of them. permalink parent award report block reply laredditarmy 1 points 4 hours ago Yeah that was irritating to.  Any business that doesn't take cash I walk out of.  Thankfully they had one kiosks that took cash. permalink parent award report block reply RedStoneDeepState 13 points 8 hours ago Yes. When we first had the hundred dollar bill, the 5 had the purchasing power of the 100 dollar bill today. We need cash that is useful for large transactions like real estate or car purchases. permalink parent award report block reply booblitchutz 11 points 7 hours ago I watch a lot of old movies, from the 40s and 50s. The cost of things back then was pretty stark. In The Apartment, Jack Lemmon's character lived in an overpriced apartment in the Upper West Side of Manhattan and it was $85 per month. permalink parent award report block reply RedStoneDeepState 5 points 7 hours ago Yep. And they could still pay for that with 4 20s and a 5. 5 bills. Not even perfectly efficient, that would be a 50, a 20, a 10 and a 5. Now? NYC rent is 3500 a month for that. Say 3565. You need to pay that with 38 bills. And most of that is the highest denomination bills that exist. It's too fucking hard to pay shit in cash now. permalink parent award report block reply booblitchutz 2 points 7 hours ago I guess The Apartment was 1960, but it was black and white because of an artistic decision. But still $85 in 1960 for an upper west side apartment. permalink parent award report block reply Sparks1017 5 points 8 hours ago They used to make them. 500, 1000 , 5000 and 10,000. 10K had Salmon Chase, Treasury Secs picture.. Last printed in 1934, if you had one collectors pay 300-400K for one. permalink parent award report block reply edxzxz 3 points 7 hours ago If you had a $10,000 bill in 1934, your other options besides saving it and selling it now for $400,000 would have been to buy 5 large duplexes and sell those now for $2.5 million, or 300 ounces of gold which you could sell now for about $1.2 million. permalink parent award report block reply RedStoneDeepState 3 points 7 hours ago It was illegal to buy gold in 1934 permalink parent award report block reply edxzxz 4 points 6 hours ago In the USA it was.  European countries still operated on the gold standard for a while after that.  Somehow, a guy in Philadelphia managed to get ahold of some 1933 gold double eagles from his bank, smuggled one out of the country, and King Farouk of Egypt bought it.  After some legal wrangling, the US government ok'd it being auctioned off and it sold for just under $19 million at auction in 2021. https://www.coinagemag.com/the-worlds-most-valuable-coin/ permalink parent award report block reply PM_ME_UR_MAGIC_CARDS 3 points 7 hours ago They actually exist, but were exclusively for banks. Just need to print them into mass circulation permalink parent award report block reply tehrocketman 2 points 4 hours ago That's incorrect.  The $100,000 bill was the only one that was ever exclusively used for banks.  The other large denominations were PRIMARILY used by banks,  but they were also released into regular circulation as well.  My father is a currency collector and he owns two $1000 bills. permalink parent award report block reply UsernameChexOut 3 points 8 hours ago We're gonna need them to pay those 50 year mortgages! permalink parent award report block reply load 5 more comments... brassmule 32 points 8 hours ago This makes no cents. permalink award report block reply trumpdagoat 11 points 8 hours ago Kek! permalink parent award report block reply SigSauer1776 30 points 8 hours ago I doubt that we spent $85 quintillion dollars on pennies.\n$85,300,000,000 BILLION is actually $85 quintillion dollars. permalink award report block reply South_Florida_Guy 10 points 8 hours ago lol came to say this permalink parent award report block reply SemperFidelis231 5 points 4 hours ago The number isn't even 85 billion to begin with. The US government only spent about 1.1 billion minting ALL currency last year. Only around 56 million was spent on pennies specifically. permalink parent award report block reply KeepTexasTexan 5 points 7 hours ago That happens when it costs $0.37 cents to mint a penny permalink parent award report block reply awookienookie 16 points 8 hours ago Holy shit lol, 85 billion lost to make a penny? Get that shit the fuck out of here. There are plenty in circulation to not make any more. permalink award report block reply AllisterTwo 8 points 8 hours ago This is not true, for years people have been culling out the old full copper ones by the millions (exceeding new production levels) and sitting on them as a raw metal investment that will never again be put back into circulation or sold for face value...  This culling and sitting on them will get worse now... permalink parent award report block reply Tardigrade 8 points 7 hours ago Yeah, 3 cents per pre-1982 penny, hell of an investment. permalink parent award report block reply AllisterTwo 3 points 7 hours ago And guaranteed, go to bank get 1000s upon 1000s of pennies, cull out the copper ones for 3x profit return the rest and get full value back, you can lose!  And the sorting machines are cheap in the overall picture! permalink parent award report block reply ADAM_SCHITT 6 points 7 hours ago It's $85 million, not billion. This post is retarded. He says million in the video but the shitty fox news graphic shows billion. Doing the math it's obviously million. permalink parent award report block reply Sparks1017 1 points 7 hours ago True between material for them and the process of making them, it costs us 3.7 cents to make 1 ,one cent coin, so it is ridiculous to keep making them. There are billions of them in jars in every household permalink parent award report block reply AllisterTwo 1 points 7 hours ago Those in jars are not in circulation, that is the problem and it will get worse now as the already profitable pre-1982 pennies will continue to be culled out for profit even if those jars are put back into circulation and reduce the amount in circulation even further and faster... permalink parent award report block reply danneskjold 15 points 8 hours ago $85,300,000,000 BILLION???? Holy shit do we even have that much money? permalink award report block reply hatredcopter 23 points 8 hours ago Post is retarded lol permalink parent award report block reply SigSauer1776 8 points 8 hours ago that is $85 quintillion lmao permalink parent award report block reply Washington_Redskins 1 points 8 hours ago Even if they were performing coin reassignment surgery with a full metallurgical team the way they do medical care, it wouldn't cost anything like that permalink parent award report block reply vote_for_MAGA_2020 1 points 7 hours ago Money printers go brrrrrrrrrrrrrr permalink parent award report block reply dtrap 15 points 8 hours ago On step closer to digital currency... Be careful Patriots. permalink award report block reply stealthboy 3 points 7 hours ago That ship has sailed.  So many places just take card now, and not cash.  You can thank the Covid idiocy because \"contactless payment\" was a concept some idiot made up. permalink parent award report block reply guywholikesDjtof2024 2 points 3 hours ago has sailed Then drag it back, set it on fire, bomb it. Or just torpedo it. We don't need more antiChrist drivel. permalink parent award report block reply Klaus73 13 points 8 hours ago I remember when a single penny could buy something.. permalink award report block reply loveshock 1 points 7 hours ago Only the government can lose money by printing money with inefficiency. permalink parent award report block reply Right0hio 12 points 7 hours ago This is a first step to digital currency. It’s not about the cost, make them out of f*ckin PLASTIC if it’s a cost concern. The denomination of the coin no longer has any to do with the value of the metal anymore anyway. permalink award report block reply IForgotToAddAnEmail 8 points 8 hours ago You didn't lose 85 billion. You were scammed out of it. Stop believing your dumb MainStream Bullshit. The whole 'It cost 2 cents to make one' is as big a lie as Climate Change. permalink award report block reply Maskurbator 7 points 6 hours ago Maybe if they didn't inflate infinity dollars a penny would cost a fucking penny. permalink award report block reply Riehlpissed 7 points 8 hours ago Nickels will be next, and so on and so on until we are digitized. permalink award report block reply AllisterTwo 6 points 8 hours ago They will phase out the penny, then the nickel will be next as it too cost more to make then face value, then the dime will be on the axing block as it's already costing about 7 cents to make a dime and costing more each year... permalink award report block reply AlmostFullyDilated 5 points 8 hours ago fucking gay! permalink award report block reply SkullE 5 points 8 hours ago Have got lots to go on sale on eBay for 1.00 each. permalink award report block reply Scot 5 points 7 hours ago It costs $0.37 to mint $0.01 because it's being done by the government. permalink award report block reply shadypollster 5 points 8 hours ago Hello Amero. permalink award report block reply MemoryHoleyeO 4 points 7 hours ago Inflation did this permalink award report block reply AVeryNakedMan 4 points 6 hours ago We need 2% yearly deflation until a penny can buy a candy bar again. permalink award report block reply RedditStillSucks 4 points 7 hours ago They be killin my boy Lincoln again permalink award report block reply iirc_life 4 points 8 hours ago Have we figured out how this is raycis yet? permalink award report block reply TrailLover1536 2 points 7 hours ago Lmfao🤣🤣🤣 permalink parent award report block reply Beelzy 4 points 7 hours ago Hey, I'm selling some of mine. $.30 each....\nand no lowballing, I know what I got. permalink award report block reply Right0hio 4 points 7 hours ago Just scan that microchip in your hand, Prol permalink award report block reply Mulletgunning 3 points 6 hours ago Are they going to round up or down in pricing and sales tax? Lol permalink award report block reply fluffykitten 3 points 8 hours ago Why does it say it costs $0.37 cents to mint a penny when most sources say it's around $0.03-$0.04? If it's $0.37 for a penny, then how much does it cost to make a nickel, dime, and quarter? permalink award report block reply ADAM_SCHITT 2 points 7 hours ago It's 3.7 cents per penny. Post is retarded. permalink parent award report block reply edxzxz 2 points 7 hours ago https://www.moneydigest.com/1794993/the-cost-to-make-every-major-us-coin-more-than-thought/ 13.8c for a nickel, 5.2c for a dime, 12.3c for a quarter.and 3.7c for a penny, so the info in OP is way off. permalink parent award report block reply BannedAccount 1 points 7 hours ago It would cost 37 cents if today's pennies were still made out of copper permalink parent award report block reply notsuicidalatall 3 points 8 hours ago From grok: As of November 2025, there are approximately 250 billion pennies in circulation in the United States. This estimate accounts for the U.S. Mint's cessation of penny production earlier in the year, with no new coins entering the supply since then. The figure represents the total estimated stockpile, including those actively used in transactions, held in reserves by the Federal Reserve, and stored in jars or drawers at home—though many are underutilized and not frequently circulated. For context: Earlier in 2025 (February), the Federal Reserve reported about 114 billion pennies, equating to roughly $1.14 billion in value and about 700 pennies per person in the U.S. By mid-2025, estimates rose to around 240 billion as final batches from ongoing production (about 1 billion pennies minted that year) were released. Recent reports (October–November 2025) from the American Bankers Association and retailers cite 250 billion, noting localized shortages due to reduced distribution rather than an overall scarcity. Pennies remain legal tender indefinitely, and it could take decades for them to naturally phase out through loss, hoarding, or melting. Countries like Canada, which stopped minting pennies in 2012, still have billions in circulation today with minimal economic disruption. permalink award report block reply Washington_Redskins 0 points 7 hours ago US Mint has produced roughly 300 billion pennies total since 1909. The US Mint almost certainly did not produce roughly half of those pennies last year. The US Mint spent roughly 4.7 billion dollars in total for 2024, yet they want us to think they spent almost 100 billion dollars on pennies alone? permalink parent award report block reply ADAM_SCHITT 4 points 7 hours ago The post is retarded. They lost $85 million making pennies, not billion. permalink parent award report block reply notsuicidalatall 2 points 7 hours ago I don't believe it.  I do believe there are a shit ton of pennies available though. permalink parent award report block reply pococurante -1 points 6 hours ago Embarrassing that Canada found common sense on this over a decade earlier than the US. permalink parent award report block reply NeverNotTrump 3 points 7 hours ago The text says $85,300,000,000 BILLION.  The news guy say $85MILLION dollars.  The text says it costs $0.37 cents to make a penny.  The news guy says 3.7¢ to make a penny.  The screen reads 3.2 billion pennies made in FY2024.  3,200,000,000 * 0.027 = $86,400,000.  $86MILLION, not BILLION.  FAKE NEWS. permalink award report block reply edxzxz 3 points 7 hours ago \"Today, it costs nearly 4 cents to make a penny.\"\nAlso, the entire budget for the US Mint is $5.7 Billion, so the OP's numbers are absolute bullshit.\n\"It now costs about 13.8 cents to produce a nickel, far surpassing its face value of 5 cents. And it's likely to move up.\"\n\"Financially, each quarter, valued at 25 cents, generates about 12.7 cents in seigniorage, which the Mint counts as profit.\"\nRead More: https://www.moneydigest.com/1794993/the-cost-to-make-every-major-us-coin-more-than-thought/ So, it seems there's a profit making opportunity here - if the US Mint makes almost 100% profit producing quarters, producing collectible versions would not only result in a 100% profit for every coin produced, there's also the 'profit' that results when coins are paid for and taken out of circulation as money by collectors.  So, how about a Trump quarter?  Limited edition, maybe a couple versions, with each commemorating one of the many peace deals brokered by our beloved POTUS? permalink award report block reply lukenator1 3 points 7 hours ago I don't like this permalink award report block reply PatriotSkorzeny 3 points 7 hours ago It should be a USMC 250th Penny. permalink award report block reply JackOfAllTirades 3 points 7 hours ago That last penny will double in value. permalink award report block reply bluewhiteandred 3 points 7 hours ago Can't make cheaper pennies to make it economically viable? permalink award report block reply NazisWereSocialist 2 points 6 hours ago 85 Million not billion permalink award report block reply pococurante 2 points 6 hours ago Now do nickels and dimes. Now do daylight savings time. Please get rid of this pointless nonsense that serves no purpose in existing anymore. When pennies were first made they were worth more than a quarter is worth today. permalink award report block reply Michalusmichalus 1 points 5 hours ago Trump wants to do DST. Power companies are agsiant it. permalink parent award report block reply EyesSewnShut 2 points 7 hours ago This is not to our benefit. Everything will be rounded up now. permalink award report block reply Washington_Redskins 2 points 8 hours ago They didn't spend $80 billion on pennies. They may have spent $200 to 250 million on pennies but I doubt even that. Roughly $4 billion in new pennies are needed every year to replace the ones that were out or taken out of circulation. At 3.7 cents per penny that's under 150 million per year. Even if we allow for $5 billion dollars in pennies it would still be around $185 million dollars. The US didn't suddenly need 500 times as many pennies last year. If anything people are using pennies far less often than before because most transactions are digital. The anti-penny movement is a lifelong fetish for some government officials. permalink award report block reply TheSwampThang 2 points 8 hours ago Admitting total economic failure and ushering digital currency and social credit scores. permalink award report block reply Unboosted 2 points 7 hours ago Oh brother, talk about a failed government. They couldnt even keep a penny less than a penny to make. Tax strike 2026! They are imbeciles! permalink award report block reply linereddit 2 points 7 hours ago put a dollar sign in front of a number, and the word \"cents\" after? permalink award report block reply todayabetterme 2 points 5 hours ago Importing more cheap H1Bs should help. permalink award report block reply spinometer2 2 points 6 hours ago it's 85 Million. not billion permalink award report block reply Vermino 2 points 4 hours ago Now force companies to stick to round numbers or rounding down. Fuck this $3.99 marketing shit. permalink award report block reply Vermino 1 points 4 hours ago I aint rounding up to some charity because i dont have pennies. permalink parent award report block reply Pats5x 2 points 7 hours ago #winning permalink award report block reply guywholikesDjtof2024 2 points 3 hours ago /s permalink parent award report block reply NoWorries77 2 points 4 hours ago How much does it cost to make a nickel?\nHow much does it cost to make a dime?\nHow much does it cost to make a quarter? First cheap in the metal coins. Then use paper. Then use a mark on your hand or forehead. And then, no beyond the shadow of a doubt you are screwed. permalink award report block reply evlbstrd 2 points 7 hours ago so we rounding up or down for cash transactions? (yes i know this is part of them moving us away from cash lol) permalink award report block reply Daffy 2 points 7 hours ago The story is incorrect it costs 3.7 cents per penny. permalink award report block reply SurfandTurf 1 points 8 hours ago What’s 85 billion billion come out to? permalink award report block reply PhoneBandit 1 points 7 hours ago This is a method to slow inflation. Trump is trying to buy time. permalink award report block reply Noodly 1 points 2 hours ago Technically, the US never minted a 'penny' that's a UK currency. The US has cents. permalink award report block reply Nitrenes 1 points 7 hours ago Are they offering a buyback at $.36 a cent? permalink award report block reply dixontic 0 points 7 hours ago This is \"no, and too bad\" for a number of reasons You can't melt coinage and sell the material.  I'm sure people out of the US are doing this for the material, not sure how the government monitors people in the US who are melting coins, because a 1:37 payout is probably worth the risk. Shocking how much money as lost value. I recall, way back when, some Las Vegas CEO paid himself in gold coins and used the value on the coin as how much he was paid, and thus the basis for taxes.   The IRS was not humored and I recall him losing his case.  This is the poor man's analog.  I don't think you can pay your taxes in pennies at a 1:37 ratio, and I wouldn't try. permalink parent award report block reply edxzxz 2 points 7 hours ago A friend of mine was an accountant and every year at tax time he'd joke that he was going to send the IRS a toilet seat and a hammer, and claim a six figure refund, since the government pays 6 figures for toilet seats and hammers. permalink parent award report block reply Jbliss 1 points 5 hours ago The display says $85.3 Billion but the dude says $85.3 Million. I suspect its million and the Fox News dipshits dont double check their work. permalink award report block reply GhostOfMyFormerSelf 1 points 4 hours ago $85,300,000,000 BILLION... Should we tell him? permalink award report block reply Keep_on_winning_kag 1 points 2 hours ago Shouldn't it be $85,300,000,000,000,000,000.99? permalink parent award report block reply Lower 1 points 5 hours ago Now what am I supposed to pinch? permalink award report block reply Prandogolio 0 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply laredditarmy 1 points 4 hours ago Where do all the pennies go though?  Shouldn't it just be rotating as people spend it goes back to the banks and they put it back in rotation? permalink award report block reply Tardigrade 2 points 2 hours ago Yes.  It's not like we'll stop seeing them anytime soon. permalink parent award report block reply jackneefus 1 points 55 minutes ago I do not give a sou. permalink award report block reply NoMoreIncumbents 1 points 4 hours ago They didn’t lose all that minting. This was another place for them to hide their enormous grift numbers.\nNow they need to hide it somewhere else. permalink award report block reply UnknownUserName 1 points 7 hours ago So how are we supposed to get change when an item costs something that's not a multiple of 5 cents? permalink award report block reply schiff_for_brains 1 points 8 hours ago The US lost $85.3 billion billion minting pennies? permalink award report block reply Sparks1017 2 points 7 hours ago 3.7 cents cost to make 1 penny permalink parent award report block reply schiff_for_brains 1 points 7 hours ago woosh permalink parent award report block reply PatriotSkorzeny 1 points 7 hours ago So all prices go down to the lowest 5 or 0. K. “You’re moneys is suddenly not accepted here”\nYeah ok yeah. If you don’t accept the penny, you don’t get any tax funds for anything. If you don’t take cash, you get no pixels. How’s that? permalink award report block reply RolandDelacroix 1 points 5 hours ago What does a nickel cost?  Scrap everything up to the quarter permalink award report block reply Scot 1 points 7 hours ago $85.3 billion billion? That's a lot of money! permalink award report block reply Skabliggum2 1 points 6 hours ago So if you're paying with cash and the total is $1.37, there's no way to pay the exact amount.  And no way for the store to give exact change.  I'm assuming this means stores will start rounding up to the nearest 5 cent increment for all sales. permalink award report block reply ChimpanzeeFatigue 1 points 8 hours ago How much does a nickel cost to make? A dime? A quarter? I would need to research this topic more to know what the heck I’m talking about, but my first thought is to just come out with a new coin that costs less or equal to make than what it’s worth? permalink award report block reply learntocode 1 points 4 hours ago Boys, I been stockpiling mine for months now. I figure my diamond hands and a proper diet and exercise regimin I will be able to cash these in about 20 years from now and walk away with about a dollar worth of copper coins from the No Globohomo Based Bank of America. permalink award report block reply KungPaoMcChicken 1 points 4 hours ago https://youtu.be/A_MaPNFc6jM?si=vYNQ-QpB8Lm5s8s7 Such a shame though... permalink award report block reply DemocratsLikeKids 1 points 8 hours ago $0.37 to make\n$0.01 \"value produced\"\n$0.36 \"value lost\"\n$85,300,000,000 in total value lost\n85,300,000,000 / 0.36 = 230,540,540,540 pennies made in 2024? permalink award report block reply schiff_for_brains 2 points 8 hours ago You need presses, materials, people, buildings, transportation, storage.... permalink parent award report block reply fluffykitten 1 points 8 hours ago it's retarded Twitter math permalink parent award report block reply Ostia 1 points 8 hours ago Yeah, that's bullshit, holmes. 230+ billion pennies in a year ain't real. permalink parent award report block reply Raziel68 1 points 4 hours ago Move to the copper standard!  All of a sudden financial stability if a penny still costs one cent.  Let all other values descend from this lowly coin! permalink award report block reply Hikedelics 1 points 5 hours ago $85,300,000,000,000,000,000!!!!! Insane!1! permalink award report block reply DangerousAmerican76 1 points 7 hours ago It still Amazes me how dysfunctional the guberment is permalink award report block reply keeman 1 points 4 hours ago And so the denarius finally is eaten completely.  Back in Roman times it was made from pure silver and was approximately how much you would be paid for a day's unskilled labor.  Rome as an empire debased it with copper until it had only 5% silver at the end of the Roman empire.  The US penny was copied from Britain's copy of this coin and was nearly 100% copper.  It kept approximately constant value until the early 20th century.  Now the US version has destroyed its copper descendant through inflation to support its own empire.  End the empire.  End money printing.  Drain the swamp. permalink award report block reply Josemarti 1 points 8 hours ago I hate things like this because it's the government stated that they're giving up on fighting inflation. permalink award report block reply vongregormench 1 points 5 hours ago Thank god. permalink award report block reply Nanteen 1 points 4 hours ago Deep down, I somehow feel Trump will end up with a barrel of the last pennies that they'll sell at some point permalink award report block reply Justjayce 1 points 10 minutes ago So nickels and dimes and quarters are the same??? permalink award report block reply asodfiu43253457 1 points 5 hours ago inflation making your money worthless permalink award report block reply TrumpIsTheVictor 1 points 4 hours ago Anyone in favor of doing away with the penny is an idiot. permalink award report block reply Michalusmichalus 1 points 5 hours ago A grocery store near me gave gift cards for double however many pennies people brought to the store up to $100. Usually, stores want you to use Coinstar. Now stores do not want you putting pennies in coinstar. permalink award report block reply TheSwampThang 0 points 8 hours ago By the way I expect exact change or for you to round up 100% of the time.  I won't accept 1 penny less.  Not my problem.   Will file a police report for theft of 1 penny is missing permalink award report block reply Tardigrade 1 points 7 hours ago How are the police reports you've already filed going?  Because you must have filed one every time you go to a gas station and they round the total from tenths of a cent to the nearest cent. permalink parent award report block reply TheSwampThang 1 points 6 hours ago 1/10 of a cent isn't an official monetary denomination. permalink parent award report block reply Tardigrade 2 points 6 hours ago Sure it is, it's called a mill. permalink parent award report block reply TheSwampThang 1 points 5 hours ago Or a file.  😀 You should trade intact currency for one's that were cut in tenths. permalink parent award report block reply view 1 more comments... Mhmm2MoreWeeks 0 points 8 hours ago I can think of no better evidence of inflation. permalink award report block reply covfefecat 2 points 7 hours ago If the Treasury (Mint) stops selling pennies to Federal reserve for less than it costs to make, it’s effectively a tax spend cut without a direct reduction in taxes so it reduces inflation permalink parent award report block reply TexasBrowncoat 0 points 4 hours ago How are you going to pay for a gallon of gas which always ends in 99/100? Oh, enter digital currency which always has the exact change... if you are willing to trade a little privacy for a little convenience. permalink award report block reply Prandogolio 1 points 4 hours ago You can still use pennies, genius.  They just aren't minting them. permalink parent award report block reply Pederella -1 points 7 hours ago Penny shortages are already closing self pay registers, or turning them card only. permalink award report block reply Coprolite -3 points 7 hours ago In my opinion quarters are the only coin that should exist. The money has been devalued to the point that it's denomination structure is not useful. permalink award report block reply guywholikesDjtof2024 2 points 3 hours ago No. Everyone should stop trying to remove physical currency options. permalink parent award report block reply\nSpaceWizard 120 points 8 hours ago How the fuck are people going to give their two cents permalink award report block reply ToxicAvengerOhio 55 points 8 hours ago Penny for your thoughts? The price just went up. permalink parent award report block reply BeauHD 53 points 7 hours ago $85,300,000,000 BILLION Let that number sink in. Eighty-Five SEXTILLION dollars. permalink parent award report block reply Bohemyth_2 15 points 7 hours ago FUCK JOE BIDEN permalink parent award report block reply TDAF 7 points 7 hours ago Auto-penny just got revoked. permalink parent award report block reply vongregormench 2 points 5 hours ago This permalink parent award report block reply Modern_Times 6 points 7 hours ago Goes along with the  $0.37 cents to mint. Should say 3.7 cents. permalink parent award report block reply mty_green_go 6 points 7 hours ago 85 quadrillion trillion billion. extra spicy permalink parent award report block reply brimshae 1 points 2 hours ago Serious question: Why don't they stop using copper on them? It would be a bit of a change for people, but copper prices went from under 50 cents a pound at the end of the 60s to over $50 a pound the next year , and other than a crash in 2011 have still been incredibly high compared to that 1960s price. permalink parent award report block reply cryptoapebot 1 points 6 hours ago yeah, mixed financial metaphors, lol permalink parent award report block reply load 4 more comments... Bolo 6 points 7 hours ago \"If it's a penny for your thoughts and you put in your two cents worth, then someone, somewhere is making a penny.\" permalink parent award report block reply Standingoak 1 points 7 hours ago They just don't have thoughts....something about only landowners voting permalink parent award report block reply DeportThemAllForever 3 points 7 hours ago Worry about inflation.  There government assholes created so much inflation that it costs 37 cents to make one. This is why gold will be at 10k soon, inflation is still very strong. Nation ran by banks will be forever in inflation and debt. permalink parent award report block reply AIDS1255 14 points 8 hours ago Inflation my guy, gotta give 5 cents now permalink parent award report block reply BeauHD 10 points 7 hours ago Yeah but they say above \"$0.37 cents\" so is that 37 cents or 0.37 cents? Patriot Oasis is the stuff hashish is made of. permalink parent award report block reply BoughtByBloomberg2 3 points 5 hours ago 3.7. Each penny costa 3.7 pennies. permalink parent award report block reply SemperFidelis231 3 points 4 hours ago Yeah the dude wrote this tweet like a retard. The answer is a single penny costs about 3.7 cents to mint and distribute. And the US government spent 56 million dollars minting pennies last year. I have absolutely no idea where 85 billion is coming from. The US spends only 1.1 billion per year to mint ALL currency. permalink parent award report block reply Modern_Times 2 points 7 hours ago 3.7 cents permalink parent award report block reply RejectRedditization 2 points 7 hours ago 85 billion BILLION is also more than the planet is worth permalink parent award report block reply mty_green_go 2 points 7 hours ago what about 85 trillion billion? all paid with spice permalink parent award report block reply view 1 more comments... FinishTheBorderWall 2 points 4 hours ago That’s literally an oxymoron. The correct amount would be 3.7 cents, also expressible as $.037 permalink parent award report block reply Shitsbrokeyo 6 points 8 hours ago Sign of the times permalink parent award report block reply SavingPrivateGrace 6 points 8 hours ago People can't even rub 2 nickles together, get rid of them too. permalink parent award report block reply booblitchutz 3 points 7 hours ago Just swipe your card bro. Cmon bro. permalink parent award report block reply PM_ME_UR_MAGIC_CARDS 2 points 7 hours ago Maybe they'll mint a two-cent coin permalink parent award report block reply load 11 more comments...\nToxicAvengerOhio 55 points 8 hours ago Penny for your thoughts? The price just went up. permalink parent award report block reply BeauHD 53 points 7 hours ago $85,300,000,000 BILLION Let that number sink in. Eighty-Five SEXTILLION dollars. permalink parent award report block reply Bohemyth_2 15 points 7 hours ago FUCK JOE BIDEN permalink parent award report block reply TDAF 7 points 7 hours ago Auto-penny just got revoked. permalink parent award report block reply vongregormench 2 points 5 hours ago This permalink parent award report block reply Modern_Times 6 points 7 hours ago Goes along with the  $0.37 cents to mint. Should say 3.7 cents. permalink parent award report block reply mty_green_go 6 points 7 hours ago 85 quadrillion trillion billion. extra spicy permalink parent award report block reply brimshae 1 points 2 hours ago Serious question: Why don't they stop using copper on them? It would be a bit of a change for people, but copper prices went from under 50 cents a pound at the end of the 60s to over $50 a pound the next year , and other than a crash in 2011 have still been incredibly high compared to that 1960s price. permalink parent award report block reply cryptoapebot 1 points 6 hours ago yeah, mixed financial metaphors, lol permalink parent award report block reply load 4 more comments... Bolo 6 points 7 hours ago \"If it's a penny for your thoughts and you put in your two cents worth, then someone, somewhere is making a penny.\" permalink parent award report block reply Standingoak 1 points 7 hours ago They just don't have thoughts....something about only landowners voting permalink parent award report block reply DeportThemAllForever 3 points 7 hours ago Worry about inflation.  There government assholes created so much inflation that it costs 37 cents to make one. This is why gold will be at 10k soon, inflation is still very strong. Nation ran by banks will be forever in inflation and debt. permalink parent award report block reply\nBeauHD 53 points 7 hours ago $85,300,000,000 BILLION Let that number sink in. Eighty-Five SEXTILLION dollars. permalink parent award report block reply Bohemyth_2 15 points 7 hours ago FUCK JOE BIDEN permalink parent award report block reply TDAF 7 points 7 hours ago Auto-penny just got revoked. permalink parent award report block reply vongregormench 2 points 5 hours ago This permalink parent award report block reply Modern_Times 6 points 7 hours ago Goes along with the  $0.37 cents to mint. Should say 3.7 cents. permalink parent award report block reply mty_green_go 6 points 7 hours ago 85 quadrillion trillion billion. extra spicy permalink parent award report block reply brimshae 1 points 2 hours ago Serious question: Why don't they stop using copper on them? It would be a bit of a change for people, but copper prices went from under 50 cents a pound at the end of the 60s to over $50 a pound the next year , and other than a crash in 2011 have still been incredibly high compared to that 1960s price. permalink parent award report block reply cryptoapebot 1 points 6 hours ago yeah, mixed financial metaphors, lol permalink parent award report block reply load 4 more comments...\nBohemyth_2 15 points 7 hours ago FUCK JOE BIDEN permalink parent award report block reply TDAF 7 points 7 hours ago Auto-penny just got revoked. permalink parent award report block reply vongregormench 2 points 5 hours ago This permalink parent award report block reply\nTDAF 7 points 7 hours ago Auto-penny just got revoked. permalink parent award report block reply\nvongregormench 2 points 5 hours ago This permalink parent award report block reply\nModern_Times 6 points 7 hours ago Goes along with the  $0.37 cents to mint. Should say 3.7 cents. permalink parent award report block reply\nmty_green_go 6 points 7 hours ago 85 quadrillion trillion billion. extra spicy permalink parent award report block reply\nbrimshae 1 points 2 hours ago Serious question: Why don't they stop using copper on them? It would be a bit of a change for people, but copper prices went from under 50 cents a pound at the end of the 60s to over $50 a pound the next year , and other than a crash in 2011 have still been incredibly high compared to that 1960s price. permalink parent award report block reply\ncryptoapebot 1 points 6 hours ago yeah, mixed financial metaphors, lol permalink parent award report block reply\nBolo 6 points 7 hours ago \"If it's a penny for your thoughts and you put in your two cents worth, then someone, somewhere is making a penny.\" permalink parent award report block reply Standingoak 1 points 7 hours ago They just don't have thoughts....something about only landowners voting permalink parent award report block reply\nStandingoak 1 points 7 hours ago They just don't have thoughts....something about only landowners voting permalink parent award report block reply\nDeportThemAllForever 3 points 7 hours ago Worry about inflation.  There government assholes created so much inflation that it costs 37 cents to make one. This is why gold will be at 10k soon, inflation is still very strong. Nation ran by banks will be forever in inflation and debt. permalink parent award report block reply\nAIDS1255 14 points 8 hours ago Inflation my guy, gotta give 5 cents now permalink parent award report block reply BeauHD 10 points 7 hours ago Yeah but they say above \"$0.37 cents\" so is that 37 cents or 0.37 cents? Patriot Oasis is the stuff hashish is made of. permalink parent award report block reply BoughtByBloomberg2 3 points 5 hours ago 3.7. Each penny costa 3.7 pennies. permalink parent award report block reply SemperFidelis231 3 points 4 hours ago Yeah the dude wrote this tweet like a retard. The answer is a single penny costs about 3.7 cents to mint and distribute. And the US government spent 56 million dollars minting pennies last year. I have absolutely no idea where 85 billion is coming from. The US spends only 1.1 billion per year to mint ALL currency. permalink parent award report block reply Modern_Times 2 points 7 hours ago 3.7 cents permalink parent award report block reply RejectRedditization 2 points 7 hours ago 85 billion BILLION is also more than the planet is worth permalink parent award report block reply mty_green_go 2 points 7 hours ago what about 85 trillion billion? all paid with spice permalink parent award report block reply view 1 more comments... FinishTheBorderWall 2 points 4 hours ago That’s literally an oxymoron. The correct amount would be 3.7 cents, also expressible as $.037 permalink parent award report block reply Shitsbrokeyo 6 points 8 hours ago Sign of the times permalink parent award report block reply\nBeauHD 10 points 7 hours ago Yeah but they say above \"$0.37 cents\" so is that 37 cents or 0.37 cents? Patriot Oasis is the stuff hashish is made of. permalink parent award report block reply BoughtByBloomberg2 3 points 5 hours ago 3.7. Each penny costa 3.7 pennies. permalink parent award report block reply SemperFidelis231 3 points 4 hours ago Yeah the dude wrote this tweet like a retard. The answer is a single penny costs about 3.7 cents to mint and distribute. And the US government spent 56 million dollars minting pennies last year. I have absolutely no idea where 85 billion is coming from. The US spends only 1.1 billion per year to mint ALL currency. permalink parent award report block reply Modern_Times 2 points 7 hours ago 3.7 cents permalink parent award report block reply RejectRedditization 2 points 7 hours ago 85 billion BILLION is also more than the planet is worth permalink parent award report block reply mty_green_go 2 points 7 hours ago what about 85 trillion billion? all paid with spice permalink parent award report block reply view 1 more comments... FinishTheBorderWall 2 points 4 hours ago That’s literally an oxymoron. The correct amount would be 3.7 cents, also expressible as $.037 permalink parent award report block reply\nBoughtByBloomberg2 3 points 5 hours ago 3.7. Each penny costa 3.7 pennies. permalink parent award report block reply\nSemperFidelis231 3 points 4 hours ago Yeah the dude wrote this tweet like a retard. The answer is a single penny costs about 3.7 cents to mint and distribute. And the US government spent 56 million dollars minting pennies last year. I have absolutely no idea where 85 billion is coming from. The US spends only 1.1 billion per year to mint ALL currency. permalink parent award report block reply\nModern_Times 2 points 7 hours ago 3.7 cents permalink parent award report block reply\nRejectRedditization 2 points 7 hours ago 85 billion BILLION is also more than the planet is worth permalink parent award report block reply mty_green_go 2 points 7 hours ago what about 85 trillion billion? all paid with spice permalink parent award report block reply view 1 more comments...\nmty_green_go 2 points 7 hours ago what about 85 trillion billion? all paid with spice permalink parent award report block reply view 1 more comments...\nFinishTheBorderWall 2 points 4 hours ago That’s literally an oxymoron. The correct amount would be 3.7 cents, also expressible as $.037 permalink parent award report block reply\nShitsbrokeyo 6 points 8 hours ago Sign of the times permalink parent award report block reply\nSavingPrivateGrace 6 points 8 hours ago People can't even rub 2 nickles together, get rid of them too. permalink parent award report block reply\nbooblitchutz 3 points 7 hours ago Just swipe your card bro. Cmon bro. permalink parent award report block reply\nPM_ME_UR_MAGIC_CARDS 2 points 7 hours ago Maybe they'll mint a two-cent coin permalink parent award report block reply\nSHILL_DETECTOR 59 points 8 hours ago we are fucked permalink award report block reply South_Florida_Guy 50 points 8 hours ago Just take out a 50 year mortgage, you'll be fine permalink parent award report block reply SHILL_DETECTOR 16 points 7 hours ago lmao you got me with that one permalink parent award report block reply TruthyBrat 8 points 7 hours ago Don't forget your 10 year car note. On a car that will last 6-7 years due to all the regulatory bullshit required. permalink parent award report block reply lostremote- 5 points 7 hours ago Thats why I fix my late 90s Ranger.  It will outlive me. permalink parent award report block reply view 1 more comments... laredditarmy 2 points 4 hours ago l0l permalink parent award report block reply newestofnew 38 points 8 hours ago \"let them have usury\" permalink parent award report block reply they-see-me-trollin 9 points 5 hours ago this. the reason why they're going fucking crazy about Nazis is not because Trump is one, but because if you look up what actually happened after WWI, the outcomes were fucking obvious. the \"losers\" of WWI were either dissolved or buried in debt slavery.  germany was the latter.  and these kids growing up were now responsible for this cosmic debt slavery for something they had nothing to do with.  Hitler offered a way out, by banning usury, and instating increasing mortgage forgiveness for every baby a german had.  that's why he gathered so much power so quickly... he ran on a platform of withdrawing germans from the debt slavery of a prior generation.  and ultimately when it came out who owned the bulk of that debt, it was Js.  things continued to escalate and spiral out because the debt slavers weren't going to let their debt slaves go quietly. see, usury is cancer in that it allows foreign lenders to subvert entire economies.  they make money much more available, which drives up prices, pushing more people to have to borrow to be able to afford things, which pushed up prices even more.  ALL debt spending does this, just a question of by how much. so now with debt slavery in the US continuing to climb, 50 year mortgages, student loans that are enslaving an entire generation, failing social security and medicare, and all this other broken government run wealth redistribution with no way to fund the outlays in the future other than higher and higher taxes, people are starting to wake the fuck up.  the problem isn't Trump.  the problem is the guy who comes after Trump who says the debt slavers need to be dragged into the streets, hung up on a meathook through their asshole, and then gutted like a fish... and only that because they're such vile scum that shooting them in the head execution style would be a waste of a perfectly good bullet.  they're trying to spark a totalitarian revolution, but they want it to be globalist, not nationalist.  shit, hitler was seen as far left until the 1960s when literally communist academics redefined \"national socialism\" as being right wing. coincidentally, islam bans usury across the board.  so anyone opposing banning usury is an islamophobic bigot. permalink parent award report block reply Friendly_B 6 points 5 hours ago This so-called \"noticer\" is ignoring the Bank of England, and ignoring that magically somehow the London Financial District is the most expensive real estate in the world. Ignoring that America forgot to wage a revolution against the Bank of England after \"winning\" the Revolutionary War. Ignoring ignoring. permalink parent award report block reply SwedishChainsaw2 4 points 2 hours ago Who owns the bank of england? permalink parent award report block reply Nanteen 5 points 4 hours ago Gee, I wonder if they're going to round up or round down all the taxes? permalink parent award report block reply vongregormench 4 points 5 hours ago You’re the reason I had to fuck around with a change purse on my wallet for an extra two decades in a constant shuffle to get rid of as many pennies as possible. I still lost and have a huge jar full. They’re worthless and a hassle and cost the government millions of taxpayer dollars to make. It’s 20 years too late. Fuck the penny. permalink parent award report block reply SHILL_DETECTOR 4 points 5 hours ago ok once the penny is gone the nickel will be gone in like 4 years permalink parent award report block reply Cptthunder 2 points 4 hours ago Yeah but if the nickle is gone, you can't be nickle and dimed anymore. permalink parent award report block reply vongregormench 2 points 5 hours ago Yes, also good. Take it all the way up to the quarter. I was in europe in 2004 and the lowest change I was ever given was .25. It was nice. I didn't have a bunch of worthless change when I came home. I was able to use the change since it wasn't all this loose bullshit worthless stuff. When it was the German Mark all the stuff lower than .25 was copper and they called it brown money and it was essentially treated like we do with the penny. Worthless garbage. permalink parent award report block reply SHILL_DETECTOR 5 points 4 hours ago usa wont stop until theres no cash at all permalink parent award report block reply view 1 more comments... TrumpIsTheVictor 3 points 4 hours ago It is not worthless change, you dumb faggot. Move to Europe. permalink parent award report block reply view 1 more comments... tarballs 1 points 4 hours ago Coins make for great shrapnel... permalink parent award report block reply load 3 more comments...\nSouth_Florida_Guy 50 points 8 hours ago Just take out a 50 year mortgage, you'll be fine permalink parent award report block reply SHILL_DETECTOR 16 points 7 hours ago lmao you got me with that one permalink parent award report block reply TruthyBrat 8 points 7 hours ago Don't forget your 10 year car note. On a car that will last 6-7 years due to all the regulatory bullshit required. permalink parent award report block reply lostremote- 5 points 7 hours ago Thats why I fix my late 90s Ranger.  It will outlive me. permalink parent award report block reply view 1 more comments... laredditarmy 2 points 4 hours ago l0l permalink parent award report block reply\nSHILL_DETECTOR 16 points 7 hours ago lmao you got me with that one permalink parent award report block reply TruthyBrat 8 points 7 hours ago Don't forget your 10 year car note. On a car that will last 6-7 years due to all the regulatory bullshit required. permalink parent award report block reply lostremote- 5 points 7 hours ago Thats why I fix my late 90s Ranger.  It will outlive me. permalink parent award report block reply view 1 more comments...\nTruthyBrat 8 points 7 hours ago Don't forget your 10 year car note. On a car that will last 6-7 years due to all the regulatory bullshit required. permalink parent award report block reply lostremote- 5 points 7 hours ago Thats why I fix my late 90s Ranger.  It will outlive me. permalink parent award report block reply view 1 more comments...\nlostremote- 5 points 7 hours ago Thats why I fix my late 90s Ranger.  It will outlive me. permalink parent award report block reply view 1 more comments...\nlaredditarmy 2 points 4 hours ago l0l permalink parent award report block reply\nnewestofnew 38 points 8 hours ago \"let them have usury\" permalink parent award report block reply they-see-me-trollin 9 points 5 hours ago this. the reason why they're going fucking crazy about Nazis is not because Trump is one, but because if you look up what actually happened after WWI, the outcomes were fucking obvious. the \"losers\" of WWI were either dissolved or buried in debt slavery.  germany was the latter.  and these kids growing up were now responsible for this cosmic debt slavery for something they had nothing to do with.  Hitler offered a way out, by banning usury, and instating increasing mortgage forgiveness for every baby a german had.  that's why he gathered so much power so quickly... he ran on a platform of withdrawing germans from the debt slavery of a prior generation.  and ultimately when it came out who owned the bulk of that debt, it was Js.  things continued to escalate and spiral out because the debt slavers weren't going to let their debt slaves go quietly. see, usury is cancer in that it allows foreign lenders to subvert entire economies.  they make money much more available, which drives up prices, pushing more people to have to borrow to be able to afford things, which pushed up prices even more.  ALL debt spending does this, just a question of by how much. so now with debt slavery in the US continuing to climb, 50 year mortgages, student loans that are enslaving an entire generation, failing social security and medicare, and all this other broken government run wealth redistribution with no way to fund the outlays in the future other than higher and higher taxes, people are starting to wake the fuck up.  the problem isn't Trump.  the problem is the guy who comes after Trump who says the debt slavers need to be dragged into the streets, hung up on a meathook through their asshole, and then gutted like a fish... and only that because they're such vile scum that shooting them in the head execution style would be a waste of a perfectly good bullet.  they're trying to spark a totalitarian revolution, but they want it to be globalist, not nationalist.  shit, hitler was seen as far left until the 1960s when literally communist academics redefined \"national socialism\" as being right wing. coincidentally, islam bans usury across the board.  so anyone opposing banning usury is an islamophobic bigot. permalink parent award report block reply Friendly_B 6 points 5 hours ago This so-called \"noticer\" is ignoring the Bank of England, and ignoring that magically somehow the London Financial District is the most expensive real estate in the world. Ignoring that America forgot to wage a revolution against the Bank of England after \"winning\" the Revolutionary War. Ignoring ignoring. permalink parent award report block reply SwedishChainsaw2 4 points 2 hours ago Who owns the bank of england? permalink parent award report block reply\nthey-see-me-trollin 9 points 5 hours ago this. the reason why they're going fucking crazy about Nazis is not because Trump is one, but because if you look up what actually happened after WWI, the outcomes were fucking obvious. the \"losers\" of WWI were either dissolved or buried in debt slavery.  germany was the latter.  and these kids growing up were now responsible for this cosmic debt slavery for something they had nothing to do with.  Hitler offered a way out, by banning usury, and instating increasing mortgage forgiveness for every baby a german had.  that's why he gathered so much power so quickly... he ran on a platform of withdrawing germans from the debt slavery of a prior generation.  and ultimately when it came out who owned the bulk of that debt, it was Js.  things continued to escalate and spiral out because the debt slavers weren't going to let their debt slaves go quietly. see, usury is cancer in that it allows foreign lenders to subvert entire economies.  they make money much more available, which drives up prices, pushing more people to have to borrow to be able to afford things, which pushed up prices even more.  ALL debt spending does this, just a question of by how much. so now with debt slavery in the US continuing to climb, 50 year mortgages, student loans that are enslaving an entire generation, failing social security and medicare, and all this other broken government run wealth redistribution with no way to fund the outlays in the future other than higher and higher taxes, people are starting to wake the fuck up.  the problem isn't Trump.  the problem is the guy who comes after Trump who says the debt slavers need to be dragged into the streets, hung up on a meathook through their asshole, and then gutted like a fish... and only that because they're such vile scum that shooting them in the head execution style would be a waste of a perfectly good bullet.  they're trying to spark a totalitarian revolution, but they want it to be globalist, not nationalist.  shit, hitler was seen as far left until the 1960s when literally communist academics redefined \"national socialism\" as being right wing. coincidentally, islam bans usury across the board.  so anyone opposing banning usury is an islamophobic bigot. permalink parent award report block reply Friendly_B 6 points 5 hours ago This so-called \"noticer\" is ignoring the Bank of England, and ignoring that magically somehow the London Financial District is the most expensive real estate in the world. Ignoring that America forgot to wage a revolution against the Bank of England after \"winning\" the Revolutionary War. Ignoring ignoring. permalink parent award report block reply SwedishChainsaw2 4 points 2 hours ago Who owns the bank of england? permalink parent award report block reply\nFriendly_B 6 points 5 hours ago This so-called \"noticer\" is ignoring the Bank of England, and ignoring that magically somehow the London Financial District is the most expensive real estate in the world. Ignoring that America forgot to wage a revolution against the Bank of England after \"winning\" the Revolutionary War. Ignoring ignoring. permalink parent award report block reply SwedishChainsaw2 4 points 2 hours ago Who owns the bank of england? permalink parent award report block reply\nSwedishChainsaw2 4 points 2 hours ago Who owns the bank of england? permalink parent award report block reply\nNanteen 5 points 4 hours ago Gee, I wonder if they're going to round up or round down all the taxes? permalink parent award report block reply\nvongregormench 4 points 5 hours ago You’re the reason I had to fuck around with a change purse on my wallet for an extra two decades in a constant shuffle to get rid of as many pennies as possible. I still lost and have a huge jar full. They’re worthless and a hassle and cost the government millions of taxpayer dollars to make. It’s 20 years too late. Fuck the penny. permalink parent award report block reply SHILL_DETECTOR 4 points 5 hours ago ok once the penny is gone the nickel will be gone in like 4 years permalink parent award report block reply Cptthunder 2 points 4 hours ago Yeah but if the nickle is gone, you can't be nickle and dimed anymore. permalink parent award report block reply vongregormench 2 points 5 hours ago Yes, also good. Take it all the way up to the quarter. I was in europe in 2004 and the lowest change I was ever given was .25. It was nice. I didn't have a bunch of worthless change when I came home. I was able to use the change since it wasn't all this loose bullshit worthless stuff. When it was the German Mark all the stuff lower than .25 was copper and they called it brown money and it was essentially treated like we do with the penny. Worthless garbage. permalink parent award report block reply SHILL_DETECTOR 5 points 4 hours ago usa wont stop until theres no cash at all permalink parent award report block reply view 1 more comments... TrumpIsTheVictor 3 points 4 hours ago It is not worthless change, you dumb faggot. Move to Europe. permalink parent award report block reply view 1 more comments... tarballs 1 points 4 hours ago Coins make for great shrapnel... permalink parent award report block reply\nSHILL_DETECTOR 4 points 5 hours ago ok once the penny is gone the nickel will be gone in like 4 years permalink parent award report block reply Cptthunder 2 points 4 hours ago Yeah but if the nickle is gone, you can't be nickle and dimed anymore. permalink parent award report block reply vongregormench 2 points 5 hours ago Yes, also good. Take it all the way up to the quarter. I was in europe in 2004 and the lowest change I was ever given was .25. It was nice. I didn't have a bunch of worthless change when I came home. I was able to use the change since it wasn't all this loose bullshit worthless stuff. When it was the German Mark all the stuff lower than .25 was copper and they called it brown money and it was essentially treated like we do with the penny. Worthless garbage. permalink parent award report block reply SHILL_DETECTOR 5 points 4 hours ago usa wont stop until theres no cash at all permalink parent award report block reply view 1 more comments... TrumpIsTheVictor 3 points 4 hours ago It is not worthless change, you dumb faggot. Move to Europe. permalink parent award report block reply view 1 more comments...\nCptthunder 2 points 4 hours ago Yeah but if the nickle is gone, you can't be nickle and dimed anymore. permalink parent award report block reply\nvongregormench 2 points 5 hours ago Yes, also good. Take it all the way up to the quarter. I was in europe in 2004 and the lowest change I was ever given was .25. It was nice. I didn't have a bunch of worthless change when I came home. I was able to use the change since it wasn't all this loose bullshit worthless stuff. When it was the German Mark all the stuff lower than .25 was copper and they called it brown money and it was essentially treated like we do with the penny. Worthless garbage. permalink parent award report block reply SHILL_DETECTOR 5 points 4 hours ago usa wont stop until theres no cash at all permalink parent award report block reply view 1 more comments... TrumpIsTheVictor 3 points 4 hours ago It is not worthless change, you dumb faggot. Move to Europe. permalink parent award report block reply view 1 more comments...\nSHILL_DETECTOR 5 points 4 hours ago usa wont stop until theres no cash at all permalink parent award report block reply view 1 more comments...\nTrumpIsTheVictor 3 points 4 hours ago It is not worthless change, you dumb faggot. Move to Europe. permalink parent award report block reply view 1 more comments...\ntarballs 1 points 4 hours ago Coins make for great shrapnel... permalink parent award report block reply\nrightoverthere 43 points 8 hours ago we need to make $1000 bills. it just makes it easier to pay for all the expensive shit. it saves room in the wallet too permalink award report block reply danneskjold 26 points 8 hours ago I recently was paid in a bunch of $100 bills.  I was very surprised at how many places won't take them.  I'm looking at you, Steak 'n' Shake.  The tallow fries are great, but the experience has become so impersonal that I can't even anymore. permalink parent award report block reply AlmostFullyDilated 18 points 8 hours ago if they won't take your legal tender that's on them, enjoy your free meal! permalink parent award report block reply RedStoneDeepState 13 points 8 hours ago You pay before your meal there, legal tender only matters for debts or paying the government. permalink parent award report block reply 1DontTreadOnMe1 9 points 8 hours ago I've never paid before eating at a Steak & Shake. permalink parent award report block reply edxzxz 8 points 7 hours ago 'All debts public and private'.  Says so right on the paper money. permalink parent award report block reply view 7 more comments... schiff_for_brains 4 points 8 hours ago This pede currencies. permalink parent award report block reply The_Yakuza 0 points 3 hours ago Enjoy your ride to jail to lol. permalink parent award report block reply AlmostFullyDilated 4 points 2 hours ago that's not how it works. if a restaurant refuses to take my money that's on them. I've never encountered a restaurant that can't break 100 permalink parent award report block reply view 1 more comments... sm12381 -3 points 8 hours ago For all debts public and private. A fucking burger isn't a debt. Grocery stores aren't debts. Turn your brain on permalink parent award report block reply RedStoneDeepState 7 points 8 hours ago A burger can be a debt if it's a sit down restaurant where you pay after the meal. Steak and shake isn't that way though. permalink parent award report block reply BannedAccount 5 points 7 hours ago Owing money to anyone for any reason is a debt. Buying groceries? That's a debt, once rung up the debt is owed until paid. Order a burger? Yep that's a debt (even if you pay before you get the burger) until its either paid or canceled. permalink parent award report block reply view 8 more comments... AlmostFullyDilated 2 points 7 hours ago if they don't want my money that's on them permalink parent award report block reply suckmycorona 3 points 7 hours ago Hundreds are the new twenty permalink parent award report block reply ADAM_SCHITT 5 points 7 hours ago A $50 bill now is worth the same as a $20 bill in 1990 permalink parent award report block reply QSWO1 3 points 7 hours ago Wetbacks have pockets full of them. permalink parent award report block reply laredditarmy 1 points 4 hours ago Yeah that was irritating to.  Any business that doesn't take cash I walk out of.  Thankfully they had one kiosks that took cash. permalink parent award report block reply RedStoneDeepState 13 points 8 hours ago Yes. When we first had the hundred dollar bill, the 5 had the purchasing power of the 100 dollar bill today. We need cash that is useful for large transactions like real estate or car purchases. permalink parent award report block reply booblitchutz 11 points 7 hours ago I watch a lot of old movies, from the 40s and 50s. The cost of things back then was pretty stark. In The Apartment, Jack Lemmon's character lived in an overpriced apartment in the Upper West Side of Manhattan and it was $85 per month. permalink parent award report block reply RedStoneDeepState 5 points 7 hours ago Yep. And they could still pay for that with 4 20s and a 5. 5 bills. Not even perfectly efficient, that would be a 50, a 20, a 10 and a 5. Now? NYC rent is 3500 a month for that. Say 3565. You need to pay that with 38 bills. And most of that is the highest denomination bills that exist. It's too fucking hard to pay shit in cash now. permalink parent award report block reply booblitchutz 2 points 7 hours ago I guess The Apartment was 1960, but it was black and white because of an artistic decision. But still $85 in 1960 for an upper west side apartment. permalink parent award report block reply Sparks1017 5 points 8 hours ago They used to make them. 500, 1000 , 5000 and 10,000. 10K had Salmon Chase, Treasury Secs picture.. Last printed in 1934, if you had one collectors pay 300-400K for one. permalink parent award report block reply edxzxz 3 points 7 hours ago If you had a $10,000 bill in 1934, your other options besides saving it and selling it now for $400,000 would have been to buy 5 large duplexes and sell those now for $2.5 million, or 300 ounces of gold which you could sell now for about $1.2 million. permalink parent award report block reply RedStoneDeepState 3 points 7 hours ago It was illegal to buy gold in 1934 permalink parent award report block reply edxzxz 4 points 6 hours ago In the USA it was.  European countries still operated on the gold standard for a while after that.  Somehow, a guy in Philadelphia managed to get ahold of some 1933 gold double eagles from his bank, smuggled one out of the country, and King Farouk of Egypt bought it.  After some legal wrangling, the US government ok'd it being auctioned off and it sold for just under $19 million at auction in 2021. https://www.coinagemag.com/the-worlds-most-valuable-coin/ permalink parent award report block reply PM_ME_UR_MAGIC_CARDS 3 points 7 hours ago They actually exist, but were exclusively for banks. Just need to print them into mass circulation permalink parent award report block reply tehrocketman 2 points 4 hours ago That's incorrect.  The $100,000 bill was the only one that was ever exclusively used for banks.  The other large denominations were PRIMARILY used by banks,  but they were also released into regular circulation as well.  My father is a currency collector and he owns two $1000 bills. permalink parent award report block reply UsernameChexOut 3 points 8 hours ago We're gonna need them to pay those 50 year mortgages! permalink parent award report block reply load 5 more comments...\ndanneskjold 26 points 8 hours ago I recently was paid in a bunch of $100 bills.  I was very surprised at how many places won't take them.  I'm looking at you, Steak 'n' Shake.  The tallow fries are great, but the experience has become so impersonal that I can't even anymore. permalink parent award report block reply AlmostFullyDilated 18 points 8 hours ago if they won't take your legal tender that's on them, enjoy your free meal! permalink parent award report block reply RedStoneDeepState 13 points 8 hours ago You pay before your meal there, legal tender only matters for debts or paying the government. permalink parent award report block reply 1DontTreadOnMe1 9 points 8 hours ago I've never paid before eating at a Steak & Shake. permalink parent award report block reply edxzxz 8 points 7 hours ago 'All debts public and private'.  Says so right on the paper money. permalink parent award report block reply view 7 more comments... schiff_for_brains 4 points 8 hours ago This pede currencies. permalink parent award report block reply The_Yakuza 0 points 3 hours ago Enjoy your ride to jail to lol. permalink parent award report block reply AlmostFullyDilated 4 points 2 hours ago that's not how it works. if a restaurant refuses to take my money that's on them. I've never encountered a restaurant that can't break 100 permalink parent award report block reply view 1 more comments... sm12381 -3 points 8 hours ago For all debts public and private. A fucking burger isn't a debt. Grocery stores aren't debts. Turn your brain on permalink parent award report block reply RedStoneDeepState 7 points 8 hours ago A burger can be a debt if it's a sit down restaurant where you pay after the meal. Steak and shake isn't that way though. permalink parent award report block reply BannedAccount 5 points 7 hours ago Owing money to anyone for any reason is a debt. Buying groceries? That's a debt, once rung up the debt is owed until paid. Order a burger? Yep that's a debt (even if you pay before you get the burger) until its either paid or canceled. permalink parent award report block reply view 8 more comments... AlmostFullyDilated 2 points 7 hours ago if they don't want my money that's on them permalink parent award report block reply suckmycorona 3 points 7 hours ago Hundreds are the new twenty permalink parent award report block reply ADAM_SCHITT 5 points 7 hours ago A $50 bill now is worth the same as a $20 bill in 1990 permalink parent award report block reply QSWO1 3 points 7 hours ago Wetbacks have pockets full of them. permalink parent award report block reply laredditarmy 1 points 4 hours ago Yeah that was irritating to.  Any business that doesn't take cash I walk out of.  Thankfully they had one kiosks that took cash. permalink parent award report block reply\nAlmostFullyDilated 18 points 8 hours ago if they won't take your legal tender that's on them, enjoy your free meal! permalink parent award report block reply RedStoneDeepState 13 points 8 hours ago You pay before your meal there, legal tender only matters for debts or paying the government. permalink parent award report block reply 1DontTreadOnMe1 9 points 8 hours ago I've never paid before eating at a Steak & Shake. permalink parent award report block reply edxzxz 8 points 7 hours ago 'All debts public and private'.  Says so right on the paper money. permalink parent award report block reply view 7 more comments... schiff_for_brains 4 points 8 hours ago This pede currencies. permalink parent award report block reply The_Yakuza 0 points 3 hours ago Enjoy your ride to jail to lol. permalink parent award report block reply AlmostFullyDilated 4 points 2 hours ago that's not how it works. if a restaurant refuses to take my money that's on them. I've never encountered a restaurant that can't break 100 permalink parent award report block reply view 1 more comments... sm12381 -3 points 8 hours ago For all debts public and private. A fucking burger isn't a debt. Grocery stores aren't debts. Turn your brain on permalink parent award report block reply RedStoneDeepState 7 points 8 hours ago A burger can be a debt if it's a sit down restaurant where you pay after the meal. Steak and shake isn't that way though. permalink parent award report block reply BannedAccount 5 points 7 hours ago Owing money to anyone for any reason is a debt. Buying groceries? That's a debt, once rung up the debt is owed until paid. Order a burger? Yep that's a debt (even if you pay before you get the burger) until its either paid or canceled. permalink parent award report block reply view 8 more comments... AlmostFullyDilated 2 points 7 hours ago if they don't want my money that's on them permalink parent award report block reply\nRedStoneDeepState 13 points 8 hours ago You pay before your meal there, legal tender only matters for debts or paying the government. permalink parent award report block reply 1DontTreadOnMe1 9 points 8 hours ago I've never paid before eating at a Steak & Shake. permalink parent award report block reply edxzxz 8 points 7 hours ago 'All debts public and private'.  Says so right on the paper money. permalink parent award report block reply view 7 more comments... schiff_for_brains 4 points 8 hours ago This pede currencies. permalink parent award report block reply\n1DontTreadOnMe1 9 points 8 hours ago I've never paid before eating at a Steak & Shake. permalink parent award report block reply\nedxzxz 8 points 7 hours ago 'All debts public and private'.  Says so right on the paper money. permalink parent award report block reply view 7 more comments...\nschiff_for_brains 4 points 8 hours ago This pede currencies. permalink parent award report block reply\nThe_Yakuza 0 points 3 hours ago Enjoy your ride to jail to lol. permalink parent award report block reply AlmostFullyDilated 4 points 2 hours ago that's not how it works. if a restaurant refuses to take my money that's on them. I've never encountered a restaurant that can't break 100 permalink parent award report block reply view 1 more comments...\nAlmostFullyDilated 4 points 2 hours ago that's not how it works. if a restaurant refuses to take my money that's on them. I've never encountered a restaurant that can't break 100 permalink parent award report block reply view 1 more comments...\nsm12381 -3 points 8 hours ago For all debts public and private. A fucking burger isn't a debt. Grocery stores aren't debts. Turn your brain on permalink parent award report block reply RedStoneDeepState 7 points 8 hours ago A burger can be a debt if it's a sit down restaurant where you pay after the meal. Steak and shake isn't that way though. permalink parent award report block reply BannedAccount 5 points 7 hours ago Owing money to anyone for any reason is a debt. Buying groceries? That's a debt, once rung up the debt is owed until paid. Order a burger? Yep that's a debt (even if you pay before you get the burger) until its either paid or canceled. permalink parent award report block reply view 8 more comments... AlmostFullyDilated 2 points 7 hours ago if they don't want my money that's on them permalink parent award report block reply\nRedStoneDeepState 7 points 8 hours ago A burger can be a debt if it's a sit down restaurant where you pay after the meal. Steak and shake isn't that way though. permalink parent award report block reply\nBannedAccount 5 points 7 hours ago Owing money to anyone for any reason is a debt. Buying groceries? That's a debt, once rung up the debt is owed until paid. Order a burger? Yep that's a debt (even if you pay before you get the burger) until its either paid or canceled. permalink parent award report block reply view 8 more comments...\nAlmostFullyDilated 2 points 7 hours ago if they don't want my money that's on them permalink parent award report block reply\nsuckmycorona 3 points 7 hours ago Hundreds are the new twenty permalink parent award report block reply ADAM_SCHITT 5 points 7 hours ago A $50 bill now is worth the same as a $20 bill in 1990 permalink parent award report block reply QSWO1 3 points 7 hours ago Wetbacks have pockets full of them. permalink parent award report block reply\nADAM_SCHITT 5 points 7 hours ago A $50 bill now is worth the same as a $20 bill in 1990 permalink parent award report block reply\nQSWO1 3 points 7 hours ago Wetbacks have pockets full of them. permalink parent award report block reply\nlaredditarmy 1 points 4 hours ago Yeah that was irritating to.  Any business that doesn't take cash I walk out of.  Thankfully they had one kiosks that took cash. permalink parent award report block reply\nRedStoneDeepState 13 points 8 hours ago Yes. When we first had the hundred dollar bill, the 5 had the purchasing power of the 100 dollar bill today. We need cash that is useful for large transactions like real estate or car purchases. permalink parent award report block reply booblitchutz 11 points 7 hours ago I watch a lot of old movies, from the 40s and 50s. The cost of things back then was pretty stark. In The Apartment, Jack Lemmon's character lived in an overpriced apartment in the Upper West Side of Manhattan and it was $85 per month. permalink parent award report block reply RedStoneDeepState 5 points 7 hours ago Yep. And they could still pay for that with 4 20s and a 5. 5 bills. Not even perfectly efficient, that would be a 50, a 20, a 10 and a 5. Now? NYC rent is 3500 a month for that. Say 3565. You need to pay that with 38 bills. And most of that is the highest denomination bills that exist. It's too fucking hard to pay shit in cash now. permalink parent award report block reply booblitchutz 2 points 7 hours ago I guess The Apartment was 1960, but it was black and white because of an artistic decision. But still $85 in 1960 for an upper west side apartment. permalink parent award report block reply\nbooblitchutz 11 points 7 hours ago I watch a lot of old movies, from the 40s and 50s. The cost of things back then was pretty stark. In The Apartment, Jack Lemmon's character lived in an overpriced apartment in the Upper West Side of Manhattan and it was $85 per month. permalink parent award report block reply RedStoneDeepState 5 points 7 hours ago Yep. And they could still pay for that with 4 20s and a 5. 5 bills. Not even perfectly efficient, that would be a 50, a 20, a 10 and a 5. Now? NYC rent is 3500 a month for that. Say 3565. You need to pay that with 38 bills. And most of that is the highest denomination bills that exist. It's too fucking hard to pay shit in cash now. permalink parent award report block reply booblitchutz 2 points 7 hours ago I guess The Apartment was 1960, but it was black and white because of an artistic decision. But still $85 in 1960 for an upper west side apartment. permalink parent award report block reply\nRedStoneDeepState 5 points 7 hours ago Yep. And they could still pay for that with 4 20s and a 5. 5 bills. Not even perfectly efficient, that would be a 50, a 20, a 10 and a 5. Now? NYC rent is 3500 a month for that. Say 3565. You need to pay that with 38 bills. And most of that is the highest denomination bills that exist. It's too fucking hard to pay shit in cash now. permalink parent award report block reply booblitchutz 2 points 7 hours ago I guess The Apartment was 1960, but it was black and white because of an artistic decision. But still $85 in 1960 for an upper west side apartment. permalink parent award report block reply\nbooblitchutz 2 points 7 hours ago I guess The Apartment was 1960, but it was black and white because of an artistic decision. But still $85 in 1960 for an upper west side apartment. permalink parent award report block reply\nSparks1017 5 points 8 hours ago They used to make them. 500, 1000 , 5000 and 10,000. 10K had Salmon Chase, Treasury Secs picture.. Last printed in 1934, if you had one collectors pay 300-400K for one. permalink parent award report block reply edxzxz 3 points 7 hours ago If you had a $10,000 bill in 1934, your other options besides saving it and selling it now for $400,000 would have been to buy 5 large duplexes and sell those now for $2.5 million, or 300 ounces of gold which you could sell now for about $1.2 million. permalink parent award report block reply RedStoneDeepState 3 points 7 hours ago It was illegal to buy gold in 1934 permalink parent award report block reply edxzxz 4 points 6 hours ago In the USA it was.  European countries still operated on the gold standard for a while after that.  Somehow, a guy in Philadelphia managed to get ahold of some 1933 gold double eagles from his bank, smuggled one out of the country, and King Farouk of Egypt bought it.  After some legal wrangling, the US government ok'd it being auctioned off and it sold for just under $19 million at auction in 2021. https://www.coinagemag.com/the-worlds-most-valuable-coin/ permalink parent award report block reply\nedxzxz 3 points 7 hours ago If you had a $10,000 bill in 1934, your other options besides saving it and selling it now for $400,000 would have been to buy 5 large duplexes and sell those now for $2.5 million, or 300 ounces of gold which you could sell now for about $1.2 million. permalink parent award report block reply RedStoneDeepState 3 points 7 hours ago It was illegal to buy gold in 1934 permalink parent award report block reply edxzxz 4 points 6 hours ago In the USA it was.  European countries still operated on the gold standard for a while after that.  Somehow, a guy in Philadelphia managed to get ahold of some 1933 gold double eagles from his bank, smuggled one out of the country, and King Farouk of Egypt bought it.  After some legal wrangling, the US government ok'd it being auctioned off and it sold for just under $19 million at auction in 2021. https://www.coinagemag.com/the-worlds-most-valuable-coin/ permalink parent award report block reply\nRedStoneDeepState 3 points 7 hours ago It was illegal to buy gold in 1934 permalink parent award report block reply edxzxz 4 points 6 hours ago In the USA it was.  European countries still operated on the gold standard for a while after that.  Somehow, a guy in Philadelphia managed to get ahold of some 1933 gold double eagles from his bank, smuggled one out of the country, and King Farouk of Egypt bought it.  After some legal wrangling, the US government ok'd it being auctioned off and it sold for just under $19 million at auction in 2021. https://www.coinagemag.com/the-worlds-most-valuable-coin/ permalink parent award report block reply\nedxzxz 4 points 6 hours ago In the USA it was.  European countries still operated on the gold standard for a while after that.  Somehow, a guy in Philadelphia managed to get ahold of some 1933 gold double eagles from his bank, smuggled one out of the country, and King Farouk of Egypt bought it.  After some legal wrangling, the US government ok'd it being auctioned off and it sold for just under $19 million at auction in 2021. https://www.coinagemag.com/the-worlds-most-valuable-coin/ permalink parent award report block reply\nPM_ME_UR_MAGIC_CARDS 3 points 7 hours ago They actually exist, but were exclusively for banks. Just need to print them into mass circulation permalink parent award report block reply tehrocketman 2 points 4 hours ago That's incorrect.  The $100,000 bill was the only one that was ever exclusively used for banks.  The other large denominations were PRIMARILY used by banks,  but they were also released into regular circulation as well.  My father is a currency collector and he owns two $1000 bills. permalink parent award report block reply\ntehrocketman 2 points 4 hours ago That's incorrect.  The $100,000 bill was the only one that was ever exclusively used for banks.  The other large denominations were PRIMARILY used by banks,  but they were also released into regular circulation as well.  My father is a currency collector and he owns two $1000 bills. permalink parent award report block reply\nUsernameChexOut 3 points 8 hours ago We're gonna need them to pay those 50 year mortgages! permalink parent award report block reply\nbrassmule 32 points 8 hours ago This makes no cents. permalink award report block reply trumpdagoat 11 points 8 hours ago Kek! permalink parent award report block reply\ntrumpdagoat 11 points 8 hours ago Kek! permalink parent award report block reply\nSigSauer1776 30 points 8 hours ago I doubt that we spent $85 quintillion dollars on pennies.\n$85,300,000,000 BILLION is actually $85 quintillion dollars. permalink award report block reply South_Florida_Guy 10 points 8 hours ago lol came to say this permalink parent award report block reply SemperFidelis231 5 points 4 hours ago The number isn't even 85 billion to begin with. The US government only spent about 1.1 billion minting ALL currency last year. Only around 56 million was spent on pennies specifically. permalink parent award report block reply KeepTexasTexan 5 points 7 hours ago That happens when it costs $0.37 cents to mint a penny permalink parent award report block reply\nSouth_Florida_Guy 10 points 8 hours ago lol came to say this permalink parent award report block reply\nSemperFidelis231 5 points 4 hours ago The number isn't even 85 billion to begin with. The US government only spent about 1.1 billion minting ALL currency last year. Only around 56 million was spent on pennies specifically. permalink parent award report block reply\nKeepTexasTexan 5 points 7 hours ago That happens when it costs $0.37 cents to mint a penny permalink parent award report block reply\nawookienookie 16 points 8 hours ago Holy shit lol, 85 billion lost to make a penny? Get that shit the fuck out of here. There are plenty in circulation to not make any more. permalink award report block reply AllisterTwo 8 points 8 hours ago This is not true, for years people have been culling out the old full copper ones by the millions (exceeding new production levels) and sitting on them as a raw metal investment that will never again be put back into circulation or sold for face value...  This culling and sitting on them will get worse now... permalink parent award report block reply Tardigrade 8 points 7 hours ago Yeah, 3 cents per pre-1982 penny, hell of an investment. permalink parent award report block reply AllisterTwo 3 points 7 hours ago And guaranteed, go to bank get 1000s upon 1000s of pennies, cull out the copper ones for 3x profit return the rest and get full value back, you can lose!  And the sorting machines are cheap in the overall picture! permalink parent award report block reply ADAM_SCHITT 6 points 7 hours ago It's $85 million, not billion. This post is retarded. He says million in the video but the shitty fox news graphic shows billion. Doing the math it's obviously million. permalink parent award report block reply Sparks1017 1 points 7 hours ago True between material for them and the process of making them, it costs us 3.7 cents to make 1 ,one cent coin, so it is ridiculous to keep making them. There are billions of them in jars in every household permalink parent award report block reply AllisterTwo 1 points 7 hours ago Those in jars are not in circulation, that is the problem and it will get worse now as the already profitable pre-1982 pennies will continue to be culled out for profit even if those jars are put back into circulation and reduce the amount in circulation even further and faster... permalink parent award report block reply\nAllisterTwo 8 points 8 hours ago This is not true, for years people have been culling out the old full copper ones by the millions (exceeding new production levels) and sitting on them as a raw metal investment that will never again be put back into circulation or sold for face value...  This culling and sitting on them will get worse now... permalink parent award report block reply Tardigrade 8 points 7 hours ago Yeah, 3 cents per pre-1982 penny, hell of an investment. permalink parent award report block reply AllisterTwo 3 points 7 hours ago And guaranteed, go to bank get 1000s upon 1000s of pennies, cull out the copper ones for 3x profit return the rest and get full value back, you can lose!  And the sorting machines are cheap in the overall picture! permalink parent award report block reply\nTardigrade 8 points 7 hours ago Yeah, 3 cents per pre-1982 penny, hell of an investment. permalink parent award report block reply AllisterTwo 3 points 7 hours ago And guaranteed, go to bank get 1000s upon 1000s of pennies, cull out the copper ones for 3x profit return the rest and get full value back, you can lose!  And the sorting machines are cheap in the overall picture! permalink parent award report block reply\nAllisterTwo 3 points 7 hours ago And guaranteed, go to bank get 1000s upon 1000s of pennies, cull out the copper ones for 3x profit return the rest and get full value back, you can lose!  And the sorting machines are cheap in the overall picture! permalink parent award report block reply\nADAM_SCHITT 6 points 7 hours ago It's $85 million, not billion. This post is retarded. He says million in the video but the shitty fox news graphic shows billion. Doing the math it's obviously million. permalink parent award report block reply\nSparks1017 1 points 7 hours ago True between material for them and the process of making them, it costs us 3.7 cents to make 1 ,one cent coin, so it is ridiculous to keep making them. There are billions of them in jars in every household permalink parent award report block reply AllisterTwo 1 points 7 hours ago Those in jars are not in circulation, that is the problem and it will get worse now as the already profitable pre-1982 pennies will continue to be culled out for profit even if those jars are put back into circulation and reduce the amount in circulation even further and faster... permalink parent award report block reply\nAllisterTwo 1 points 7 hours ago Those in jars are not in circulation, that is the problem and it will get worse now as the already profitable pre-1982 pennies will continue to be culled out for profit even if those jars are put back into circulation and reduce the amount in circulation even further and faster... permalink parent award report block reply\ndanneskjold 15 points 8 hours ago $85,300,000,000 BILLION???? Holy shit do we even have that much money? permalink award report block reply hatredcopter 23 points 8 hours ago Post is retarded lol permalink parent award report block reply SigSauer1776 8 points 8 hours ago that is $85 quintillion lmao permalink parent award report block reply Washington_Redskins 1 points 8 hours ago Even if they were performing coin reassignment surgery with a full metallurgical team the way they do medical care, it wouldn't cost anything like that permalink parent award report block reply vote_for_MAGA_2020 1 points 7 hours ago Money printers go brrrrrrrrrrrrrr permalink parent award report block reply\nhatredcopter 23 points 8 hours ago Post is retarded lol permalink parent award report block reply\nSigSauer1776 8 points 8 hours ago that is $85 quintillion lmao permalink parent award report block reply Washington_Redskins 1 points 8 hours ago Even if they were performing coin reassignment surgery with a full metallurgical team the way they do medical care, it wouldn't cost anything like that permalink parent award report block reply\nWashington_Redskins 1 points 8 hours ago Even if they were performing coin reassignment surgery with a full metallurgical team the way they do medical care, it wouldn't cost anything like that permalink parent award report block reply\nvote_for_MAGA_2020 1 points 7 hours ago Money printers go brrrrrrrrrrrrrr permalink parent award report block reply\ndtrap 15 points 8 hours ago On step closer to digital currency... Be careful Patriots. permalink award report block reply stealthboy 3 points 7 hours ago That ship has sailed.  So many places just take card now, and not cash.  You can thank the Covid idiocy because \"contactless payment\" was a concept some idiot made up. permalink parent award report block reply guywholikesDjtof2024 2 points 3 hours ago has sailed Then drag it back, set it on fire, bomb it. Or just torpedo it. We don't need more antiChrist drivel. permalink parent award report block reply\nstealthboy 3 points 7 hours ago That ship has sailed.  So many places just take card now, and not cash.  You can thank the Covid idiocy because \"contactless payment\" was a concept some idiot made up. permalink parent award report block reply guywholikesDjtof2024 2 points 3 hours ago has sailed Then drag it back, set it on fire, bomb it. Or just torpedo it. We don't need more antiChrist drivel. permalink parent award report block reply\nguywholikesDjtof2024 2 points 3 hours ago has sailed Then drag it back, set it on fire, bomb it. Or just torpedo it. We don't need more antiChrist drivel. permalink parent award report block reply\nKlaus73 13 points 8 hours ago I remember when a single penny could buy something.. permalink award report block reply loveshock 1 points 7 hours ago Only the government can lose money by printing money with inefficiency. permalink parent award report block reply\nloveshock 1 points 7 hours ago Only the government can lose money by printing money with inefficiency. permalink parent award report block reply\nRight0hio 12 points 7 hours ago This is a first step to digital currency. It’s not about the cost, make them out of f*ckin PLASTIC if it’s a cost concern. The denomination of the coin no longer has any to do with the value of the metal anymore anyway. permalink award report block reply\nIForgotToAddAnEmail 8 points 8 hours ago You didn't lose 85 billion. You were scammed out of it. Stop believing your dumb MainStream Bullshit. The whole 'It cost 2 cents to make one' is as big a lie as Climate Change. permalink award report block reply\nMaskurbator 7 points 6 hours ago Maybe if they didn't inflate infinity dollars a penny would cost a fucking penny. permalink award report block reply\nRiehlpissed 7 points 8 hours ago Nickels will be next, and so on and so on until we are digitized. permalink award report block reply\nAllisterTwo 6 points 8 hours ago They will phase out the penny, then the nickel will be next as it too cost more to make then face value, then the dime will be on the axing block as it's already costing about 7 cents to make a dime and costing more each year... permalink award report block reply\nAlmostFullyDilated 5 points 8 hours ago fucking gay! permalink award report block reply\nSkullE 5 points 8 hours ago Have got lots to go on sale on eBay for 1.00 each. permalink award report block reply\nScot 5 points 7 hours ago It costs $0.37 to mint $0.01 because it's being done by the government. permalink award report block reply\nshadypollster 5 points 8 hours ago Hello Amero. permalink award report block reply\nMemoryHoleyeO 4 points 7 hours ago Inflation did this permalink award report block reply\nAVeryNakedMan 4 points 6 hours ago We need 2% yearly deflation until a penny can buy a candy bar again. permalink award report block reply\nRedditStillSucks 4 points 7 hours ago They be killin my boy Lincoln again permalink award report block reply\niirc_life 4 points 8 hours ago Have we figured out how this is raycis yet? permalink award report block reply TrailLover1536 2 points 7 hours ago Lmfao🤣🤣🤣 permalink parent award report block reply\nTrailLover1536 2 points 7 hours ago Lmfao🤣🤣🤣 permalink parent award report block reply\nBeelzy 4 points 7 hours ago Hey, I'm selling some of mine. $.30 each....\nand no lowballing, I know what I got. permalink award report block reply\nRight0hio 4 points 7 hours ago Just scan that microchip in your hand, Prol permalink award report block reply\nMulletgunning 3 points 6 hours ago Are they going to round up or down in pricing and sales tax? Lol permalink award report block reply\nfluffykitten 3 points 8 hours ago Why does it say it costs $0.37 cents to mint a penny when most sources say it's around $0.03-$0.04? If it's $0.37 for a penny, then how much does it cost to make a nickel, dime, and quarter? permalink award report block reply ADAM_SCHITT 2 points 7 hours ago It's 3.7 cents per penny. Post is retarded. permalink parent award report block reply edxzxz 2 points 7 hours ago https://www.moneydigest.com/1794993/the-cost-to-make-every-major-us-coin-more-than-thought/ 13.8c for a nickel, 5.2c for a dime, 12.3c for a quarter.and 3.7c for a penny, so the info in OP is way off. permalink parent award report block reply BannedAccount 1 points 7 hours ago It would cost 37 cents if today's pennies were still made out of copper permalink parent award report block reply\nADAM_SCHITT 2 points 7 hours ago It's 3.7 cents per penny. Post is retarded. permalink parent award report block reply\nedxzxz 2 points 7 hours ago https://www.moneydigest.com/1794993/the-cost-to-make-every-major-us-coin-more-than-thought/ 13.8c for a nickel, 5.2c for a dime, 12.3c for a quarter.and 3.7c for a penny, so the info in OP is way off. permalink parent award report block reply\nBannedAccount 1 points 7 hours ago It would cost 37 cents if today's pennies were still made out of copper permalink parent award report block reply\nnotsuicidalatall 3 points 8 hours ago From grok: As of November 2025, there are approximately 250 billion pennies in circulation in the United States. This estimate accounts for the U.S. Mint's cessation of penny production earlier in the year, with no new coins entering the supply since then. The figure represents the total estimated stockpile, including those actively used in transactions, held in reserves by the Federal Reserve, and stored in jars or drawers at home—though many are underutilized and not frequently circulated. For context: Earlier in 2025 (February), the Federal Reserve reported about 114 billion pennies, equating to roughly $1.14 billion in value and about 700 pennies per person in the U.S. By mid-2025, estimates rose to around 240 billion as final batches from ongoing production (about 1 billion pennies minted that year) were released. Recent reports (October–November 2025) from the American Bankers Association and retailers cite 250 billion, noting localized shortages due to reduced distribution rather than an overall scarcity. Pennies remain legal tender indefinitely, and it could take decades for them to naturally phase out through loss, hoarding, or melting. Countries like Canada, which stopped minting pennies in 2012, still have billions in circulation today with minimal economic disruption. permalink award report block reply Washington_Redskins 0 points 7 hours ago US Mint has produced roughly 300 billion pennies total since 1909. The US Mint almost certainly did not produce roughly half of those pennies last year. The US Mint spent roughly 4.7 billion dollars in total for 2024, yet they want us to think they spent almost 100 billion dollars on pennies alone? permalink parent award report block reply ADAM_SCHITT 4 points 7 hours ago The post is retarded. They lost $85 million making pennies, not billion. permalink parent award report block reply notsuicidalatall 2 points 7 hours ago I don't believe it.  I do believe there are a shit ton of pennies available though. permalink parent award report block reply pococurante -1 points 6 hours ago Embarrassing that Canada found common sense on this over a decade earlier than the US. permalink parent award report block reply\nWashington_Redskins 0 points 7 hours ago US Mint has produced roughly 300 billion pennies total since 1909. The US Mint almost certainly did not produce roughly half of those pennies last year. The US Mint spent roughly 4.7 billion dollars in total for 2024, yet they want us to think they spent almost 100 billion dollars on pennies alone? permalink parent award report block reply ADAM_SCHITT 4 points 7 hours ago The post is retarded. They lost $85 million making pennies, not billion. permalink parent award report block reply notsuicidalatall 2 points 7 hours ago I don't believe it.  I do believe there are a shit ton of pennies available though. permalink parent award report block reply\nADAM_SCHITT 4 points 7 hours ago The post is retarded. They lost $85 million making pennies, not billion. permalink parent award report block reply\nnotsuicidalatall 2 points 7 hours ago I don't believe it.  I do believe there are a shit ton of pennies available though. permalink parent award report block reply\npococurante -1 points 6 hours ago Embarrassing that Canada found common sense on this over a decade earlier than the US. permalink parent award report block reply\nNeverNotTrump 3 points 7 hours ago The text says $85,300,000,000 BILLION.  The news guy say $85MILLION dollars.  The text says it costs $0.37 cents to make a penny.  The news guy says 3.7¢ to make a penny.  The screen reads 3.2 billion pennies made in FY2024.  3,200,000,000 * 0.027 = $86,400,000.  $86MILLION, not BILLION.  FAKE NEWS. permalink award report block reply\nedxzxz 3 points 7 hours ago \"Today, it costs nearly 4 cents to make a penny.\"\nRead More: https://www.moneydigest.com/1794993/the-cost-to-make-every-major-us-coin-more-than-thought/ So, it seems there's a profit making opportunity here - if the US Mint makes almost 100% profit producing quarters, producing collectible versions would not only result in a 100% profit for every coin produced, there's also the 'profit' that results when coins are paid for and taken out of circulation as money by collectors.  So, how about a Trump quarter?  Limited edition, maybe a couple versions, with each commemorating one of the many peace deals brokered by our beloved POTUS? permalink award report block reply\nlukenator1 3 points 7 hours ago I don't like this permalink award report block reply\nPatriotSkorzeny 3 points 7 hours ago It should be a USMC 250th Penny. permalink award report block reply\nJackOfAllTirades 3 points 7 hours ago That last penny will double in value. permalink award report block reply\nbluewhiteandred 3 points 7 hours ago Can't make cheaper pennies to make it economically viable? permalink award report block reply\nNazisWereSocialist 2 points 6 hours ago 85 Million not billion permalink award report block reply\npococurante 2 points 6 hours ago Now do nickels and dimes. Now do daylight savings time. Please get rid of this pointless nonsense that serves no purpose in existing anymore. When pennies were first made they were worth more than a quarter is worth today. permalink award report block reply Michalusmichalus 1 points 5 hours ago Trump wants to do DST. Power companies are agsiant it. permalink parent award report block reply\nMichalusmichalus 1 points 5 hours ago Trump wants to do DST. Power companies are agsiant it. permalink parent award report block reply\nEyesSewnShut 2 points 7 hours ago This is not to our benefit. Everything will be rounded up now. permalink award report block reply\nWashington_Redskins 2 points 8 hours ago They didn't spend $80 billion on pennies. They may have spent $200 to 250 million on pennies but I doubt even that. Roughly $4 billion in new pennies are needed every year to replace the ones that were out or taken out of circulation. At 3.7 cents per penny that's under 150 million per year. Even if we allow for $5 billion dollars in pennies it would still be around $185 million dollars. The US didn't suddenly need 500 times as many pennies last year. If anything people are using pennies far less often than before because most transactions are digital. The anti-penny movement is a lifelong fetish for some government officials. permalink award report block reply\nTheSwampThang 2 points 8 hours ago Admitting total economic failure and ushering digital currency and social credit scores. permalink award report block reply\nUnboosted 2 points 7 hours ago Oh brother, talk about a failed government. They couldnt even keep a penny less than a penny to make. Tax strike 2026! They are imbeciles! permalink award report block reply\nlinereddit 2 points 7 hours ago put a dollar sign in front of a number, and the word \"cents\" after? permalink award report block reply\ntodayabetterme 2 points 5 hours ago Importing more cheap H1Bs should help. permalink award report block reply\nspinometer2 2 points 6 hours ago it's 85 Million. not billion permalink award report block reply\nVermino 2 points 4 hours ago Now force companies to stick to round numbers or rounding down. Fuck this $3.99 marketing shit. permalink award report block reply Vermino 1 points 4 hours ago I aint rounding up to some charity because i dont have pennies. permalink parent award report block reply\nVermino 1 points 4 hours ago I aint rounding up to some charity because i dont have pennies. permalink parent award report block reply\nPats5x 2 points 7 hours ago #winning permalink award report block reply guywholikesDjtof2024 2 points 3 hours ago /s permalink parent award report block reply\nguywholikesDjtof2024 2 points 3 hours ago /s permalink parent award report block reply\nNoWorries77 2 points 4 hours ago How much does it cost to make a nickel?\nHow much does it cost to make a quarter? First cheap in the metal coins. Then use paper. Then use a mark on your hand or forehead. And then, no beyond the shadow of a doubt you are screwed. permalink award report block reply\nevlbstrd 2 points 7 hours ago so we rounding up or down for cash transactions? (yes i know this is part of them moving us away from cash lol) permalink award report block reply\nDaffy 2 points 7 hours ago The story is incorrect it costs 3.7 cents per penny. permalink award report block reply\nSurfandTurf 1 points 8 hours ago What’s 85 billion billion come out to? permalink award report block reply\nPhoneBandit 1 points 7 hours ago This is a method to slow inflation. Trump is trying to buy time. permalink award report block reply\nNoodly 1 points 2 hours ago Technically, the US never minted a 'penny' that's a UK currency. The US has cents. permalink award report block reply\nNitrenes 1 points 7 hours ago Are they offering a buyback at $.36 a cent? permalink award report block reply dixontic 0 points 7 hours ago This is \"no, and too bad\" for a number of reasons You can't melt coinage and sell the material.  I'm sure people out of the US are doing this for the material, not sure how the government monitors people in the US who are melting coins, because a 1:37 payout is probably worth the risk. Shocking how much money as lost value. I recall, way back when, some Las Vegas CEO paid himself in gold coins and used the value on the coin as how much he was paid, and thus the basis for taxes.   The IRS was not humored and I recall him losing his case.  This is the poor man's analog.  I don't think you can pay your taxes in pennies at a 1:37 ratio, and I wouldn't try. permalink parent award report block reply edxzxz 2 points 7 hours ago A friend of mine was an accountant and every year at tax time he'd joke that he was going to send the IRS a toilet seat and a hammer, and claim a six figure refund, since the government pays 6 figures for toilet seats and hammers. permalink parent award report block reply\ndixontic 0 points 7 hours ago This is \"no, and too bad\" for a number of reasons You can't melt coinage and sell the material.  I'm sure people out of the US are doing this for the material, not sure how the government monitors people in the US who are melting coins, because a 1:37 payout is probably worth the risk. Shocking how much money as lost value. I recall, way back when, some Las Vegas CEO paid himself in gold coins and used the value on the coin as how much he was paid, and thus the basis for taxes.   The IRS was not humored and I recall him losing his case.  This is the poor man's analog.  I don't think you can pay your taxes in pennies at a 1:37 ratio, and I wouldn't try. permalink parent award report block reply edxzxz 2 points 7 hours ago A friend of mine was an accountant and every year at tax time he'd joke that he was going to send the IRS a toilet seat and a hammer, and claim a six figure refund, since the government pays 6 figures for toilet seats and hammers. permalink parent award report block reply\nedxzxz 2 points 7 hours ago A friend of mine was an accountant and every year at tax time he'd joke that he was going to send the IRS a toilet seat and a hammer, and claim a six figure refund, since the government pays 6 figures for toilet seats and hammers. permalink parent award report block reply\nJbliss 1 points 5 hours ago The display says $85.3 Billion but the dude says $85.3 Million. I suspect its million and the Fox News dipshits dont double check their work. permalink award report block reply\nGhostOfMyFormerSelf 1 points 4 hours ago $85,300,000,000 BILLION... Should we tell him? permalink award report block reply Keep_on_winning_kag 1 points 2 hours ago Shouldn't it be $85,300,000,000,000,000,000.99? permalink parent award report block reply\nKeep_on_winning_kag 1 points 2 hours ago Shouldn't it be $85,300,000,000,000,000,000.99? permalink parent award report block reply\nLower 1 points 5 hours ago Now what am I supposed to pinch? permalink award report block reply Prandogolio 0 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nPrandogolio 0 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nlaredditarmy 1 points 4 hours ago Where do all the pennies go though?  Shouldn't it just be rotating as people spend it goes back to the banks and they put it back in rotation? permalink award report block reply Tardigrade 2 points 2 hours ago Yes.  It's not like we'll stop seeing them anytime soon. permalink parent award report block reply\nTardigrade 2 points 2 hours ago Yes.  It's not like we'll stop seeing them anytime soon. permalink parent award report block reply\njackneefus 1 points 55 minutes ago I do not give a sou. permalink award report block reply\nNoMoreIncumbents 1 points 4 hours ago They didn’t lose all that minting. This was another place for them to hide their enormous grift numbers.\nNow they need to hide it somewhere else. permalink award report block reply\nUnknownUserName 1 points 7 hours ago So how are we supposed to get change when an item costs something that's not a multiple of 5 cents? permalink award report block reply\nschiff_for_brains 1 points 8 hours ago The US lost $85.3 billion billion minting pennies? permalink award report block reply Sparks1017 2 points 7 hours ago 3.7 cents cost to make 1 penny permalink parent award report block reply schiff_for_brains 1 points 7 hours ago woosh permalink parent award report block reply\nSparks1017 2 points 7 hours ago 3.7 cents cost to make 1 penny permalink parent award report block reply schiff_for_brains 1 points 7 hours ago woosh permalink parent award report block reply\nschiff_for_brains 1 points 7 hours ago woosh permalink parent award report block reply\nPatriotSkorzeny 1 points 7 hours ago So all prices go down to the lowest 5 or 0. K. “You’re moneys is suddenly not accepted here”\nYeah ok yeah. If you don’t accept the penny, you don’t get any tax funds for anything. If you don’t take cash, you get no pixels. How’s that? permalink award report block reply\nRolandDelacroix 1 points 5 hours ago What does a nickel cost?  Scrap everything up to the quarter permalink award report block reply\nScot 1 points 7 hours ago $85.3 billion billion? That's a lot of money! permalink award report block reply\nSkabliggum2 1 points 6 hours ago So if you're paying with cash and the total is $1.37, there's no way to pay the exact amount.  And no way for the store to give exact change.  I'm assuming this means stores will start rounding up to the nearest 5 cent increment for all sales. permalink award report block reply\nChimpanzeeFatigue 1 points 8 hours ago How much does a nickel cost to make? A dime? A quarter? I would need to research this topic more to know what the heck I’m talking about, but my first thought is to just come out with a new coin that costs less or equal to make than what it’s worth? permalink award report block reply\nlearntocode 1 points 4 hours ago Boys, I been stockpiling mine for months now. I figure my diamond hands and a proper diet and exercise regimin I will be able to cash these in about 20 years from now and walk away with about a dollar worth of copper coins from the No Globohomo Based Bank of America. permalink award report block reply\nKungPaoMcChicken 1 points 4 hours ago https://youtu.be/A_MaPNFc6jM?si=vYNQ-QpB8Lm5s8s7 Such a shame though... permalink award report block reply\nDemocratsLikeKids 1 points 8 hours ago $0.37 to make\n85,300,000,000 / 0.36 = 230,540,540,540 pennies made in 2024? permalink award report block reply schiff_for_brains 2 points 8 hours ago You need presses, materials, people, buildings, transportation, storage.... permalink parent award report block reply fluffykitten 1 points 8 hours ago it's retarded Twitter math permalink parent award report block reply Ostia 1 points 8 hours ago Yeah, that's bullshit, holmes. 230+ billion pennies in a year ain't real. permalink parent award report block reply\nschiff_for_brains 2 points 8 hours ago You need presses, materials, people, buildings, transportation, storage.... permalink parent award report block reply\nfluffykitten 1 points 8 hours ago it's retarded Twitter math permalink parent award report block reply\nOstia 1 points 8 hours ago Yeah, that's bullshit, holmes. 230+ billion pennies in a year ain't real. permalink parent award report block reply\nRaziel68 1 points 4 hours ago Move to the copper standard!  All of a sudden financial stability if a penny still costs one cent.  Let all other values descend from this lowly coin! permalink award report block reply\nHikedelics 1 points 5 hours ago $85,300,000,000,000,000,000!!!!! Insane!1! permalink award report block reply\nDangerousAmerican76 1 points 7 hours ago It still Amazes me how dysfunctional the guberment is permalink award report block reply\nkeeman 1 points 4 hours ago And so the denarius finally is eaten completely.  Back in Roman times it was made from pure silver and was approximately how much you would be paid for a day's unskilled labor.  Rome as an empire debased it with copper until it had only 5% silver at the end of the Roman empire.  The US penny was copied from Britain's copy of this coin and was nearly 100% copper.  It kept approximately constant value until the early 20th century.  Now the US version has destroyed its copper descendant through inflation to support its own empire.  End the empire.  End money printing.  Drain the swamp. permalink award report block reply\nJosemarti 1 points 8 hours ago I hate things like this because it's the government stated that they're giving up on fighting inflation. permalink award report block reply\nvongregormench 1 points 5 hours ago Thank god. permalink award report block reply\nNanteen 1 points 4 hours ago Deep down, I somehow feel Trump will end up with a barrel of the last pennies that they'll sell at some point permalink award report block reply\nJustjayce 1 points 10 minutes ago So nickels and dimes and quarters are the same??? permalink award report block reply\nasodfiu43253457 1 points 5 hours ago inflation making your money worthless permalink award report block reply\nTrumpIsTheVictor 1 points 4 hours ago Anyone in favor of doing away with the penny is an idiot. permalink award report block reply\nMichalusmichalus 1 points 5 hours ago A grocery store near me gave gift cards for double however many pennies people brought to the store up to $100. Usually, stores want you to use Coinstar. Now stores do not want you putting pennies in coinstar. permalink award report block reply\nTheSwampThang 0 points 8 hours ago By the way I expect exact change or for you to round up 100% of the time.  I won't accept 1 penny less.  Not my problem.   Will file a police report for theft of 1 penny is missing permalink award report block reply Tardigrade 1 points 7 hours ago How are the police reports you've already filed going?  Because you must have filed one every time you go to a gas station and they round the total from tenths of a cent to the nearest cent. permalink parent award report block reply TheSwampThang 1 points 6 hours ago 1/10 of a cent isn't an official monetary denomination. permalink parent award report block reply Tardigrade 2 points 6 hours ago Sure it is, it's called a mill. permalink parent award report block reply TheSwampThang 1 points 5 hours ago Or a file.  😀 You should trade intact currency for one's that were cut in tenths. permalink parent award report block reply view 1 more comments...\nTardigrade 1 points 7 hours ago How are the police reports you've already filed going?  Because you must have filed one every time you go to a gas station and they round the total from tenths of a cent to the nearest cent. permalink parent award report block reply TheSwampThang 1 points 6 hours ago 1/10 of a cent isn't an official monetary denomination. permalink parent award report block reply Tardigrade 2 points 6 hours ago Sure it is, it's called a mill. permalink parent award report block reply TheSwampThang 1 points 5 hours ago Or a file.  😀 You should trade intact currency for one's that were cut in tenths. permalink parent award report block reply view 1 more comments...\nTheSwampThang 1 points 6 hours ago 1/10 of a cent isn't an official monetary denomination. permalink parent award report block reply Tardigrade 2 points 6 hours ago Sure it is, it's called a mill. permalink parent award report block reply TheSwampThang 1 points 5 hours ago Or a file.  😀 You should trade intact currency for one's that were cut in tenths. permalink parent award report block reply view 1 more comments...\nTardigrade 2 points 6 hours ago Sure it is, it's called a mill. permalink parent award report block reply TheSwampThang 1 points 5 hours ago Or a file.  😀 You should trade intact currency for one's that were cut in tenths. permalink parent award report block reply view 1 more comments...\nTheSwampThang 1 points 5 hours ago Or a file.  😀 You should trade intact currency for one's that were cut in tenths. permalink parent award report block reply view 1 more comments...\nMhmm2MoreWeeks 0 points 8 hours ago I can think of no better evidence of inflation. permalink award report block reply covfefecat 2 points 7 hours ago If the Treasury (Mint) stops selling pennies to Federal reserve for less than it costs to make, it’s effectively a tax spend cut without a direct reduction in taxes so it reduces inflation permalink parent award report block reply\ncovfefecat 2 points 7 hours ago If the Treasury (Mint) stops selling pennies to Federal reserve for less than it costs to make, it’s effectively a tax spend cut without a direct reduction in taxes so it reduces inflation permalink parent award report block reply\nTexasBrowncoat 0 points 4 hours ago How are you going to pay for a gallon of gas which always ends in 99/100? Oh, enter digital currency which always has the exact change... if you are willing to trade a little privacy for a little convenience. permalink award report block reply Prandogolio 1 points 4 hours ago You can still use pennies, genius.  They just aren't minting them. permalink parent award report block reply\nPrandogolio 1 points 4 hours ago You can still use pennies, genius.  They just aren't minting them. permalink parent award report block reply\nPederella -1 points 7 hours ago Penny shortages are already closing self pay registers, or turning them card only. permalink award report block reply\nCoprolite -3 points 7 hours ago In my opinion quarters are the only coin that should exist. The money has been devalued to the point that it's denomination structure is not useful. permalink award report block reply guywholikesDjtof2024 2 points 3 hours ago No. Everyone should stop trying to remove physical currency options. permalink parent award report block reply\nguywholikesDjtof2024 2 points 3 hours ago No. Everyone should stop trying to remove physical currency options. permalink parent award report block reply"}