{"id": "8185655", "contents": "59 Enjoy Tucker while you can.  If his voice and ideas cannot be cancelled, his subscription to Life will be cancelled.  The Qatar stuff was supposed to be his takedown. It didn't work. SAVE AMERICA posted 2 hours ago by shadypollster 10 comments award share download report block\n10 comments Sort by Top Top New Worst Old Save Crucible 4 points 1 hour ago I like him. He's probably a little more hardcore than what we're led to believe. permalink award report block reply FusionBlack 4 points 1 hour ago Been a fan from the \"crossfire \" days. He speaks alot lately on things based on his belief in Jesus and Christianity.  That's where the backlash comes from. I agree with him. permalink award report block reply IncredibleMrE1 1 points 4 minutes ago The neocons have returned to their Trotskyist roots with the leftist playbook they've pulled out on him. permalink award report block reply blockchain-the-vote 1 points 43 minutes ago He's 100% paid by Muslim oil money/BRICS some way, some how, I won't even dispute it because it's been nakedly transparent to me for over a year now. He absolutely should not be cancelled, at least he filled out his FARA permalink award report block reply shadypollster OP 3 points 41 minutes ago I'm a big believer in the marketplace of ideas (on the Right, the Left uses a command model). The backlash when he gets assassinated is something I cannot predict. He has been floated as a POTUS candidate and they took Charlie Kirk away from us, another potential POTUS candidate. permalink parent award report block reply blockchain-the-vote 1 points 32 minutes ago I am a free speech absolutist but speech isn't spam, bots, or drowning out other ideas... never was. Speech is a (wilful) exchange (not association). No one is obligated to have Tucker at all, or like him, or even tolerate him (I don't, I think he's a die-hard statist who lies as he breathes)... but this leftist-style de-platforming shit never works and he has every right to spew his spin as any other asshole doing the same. Sunlight is the disinfectant, his ideas are dogshit (Tucker \"le heckin Sharia is kinda ok tho\" Carlson's ideas aren't really even his) so by all means, go on another podcast. permalink parent award report block reply shadypollster OP 3 points 28 minutes ago Yeah. De-platforming didn't work with Fuentes, Jones or Torba. Fuentes is being astroturfed, Jones is as red as ever and Torba runs his own social media site and accepted bitcoin way before it ballooned like it did. permalink parent award report block reply blockchain-the-vote 2 points 26 minutes ago AJ is above all of them and oddly enough the comparative moderate permalink parent award report block reply fightfightfightx 1 points 41 minutes ago oh no, he's against jewish supremacy, HOW DARE HE permalink parent award report block reply Briben -1 points 33 minutes ago Nobody’s canceling anything.  Calling out his paid off guests for supporting foreign enemies is not censorship. permalink award report block reply\nCrucible 4 points 1 hour ago I like him. He's probably a little more hardcore than what we're led to believe. permalink award report block reply\nFusionBlack 4 points 1 hour ago Been a fan from the \"crossfire \" days. He speaks alot lately on things based on his belief in Jesus and Christianity.  That's where the backlash comes from. I agree with him. permalink award report block reply\nIncredibleMrE1 1 points 4 minutes ago The neocons have returned to their Trotskyist roots with the leftist playbook they've pulled out on him. permalink award report block reply\nblockchain-the-vote 1 points 43 minutes ago He's 100% paid by Muslim oil money/BRICS some way, some how, I won't even dispute it because it's been nakedly transparent to me for over a year now. He absolutely should not be cancelled, at least he filled out his FARA permalink award report block reply shadypollster OP 3 points 41 minutes ago I'm a big believer in the marketplace of ideas (on the Right, the Left uses a command model). The backlash when he gets assassinated is something I cannot predict. He has been floated as a POTUS candidate and they took Charlie Kirk away from us, another potential POTUS candidate. permalink parent award report block reply blockchain-the-vote 1 points 32 minutes ago I am a free speech absolutist but speech isn't spam, bots, or drowning out other ideas... never was. Speech is a (wilful) exchange (not association). No one is obligated to have Tucker at all, or like him, or even tolerate him (I don't, I think he's a die-hard statist who lies as he breathes)... but this leftist-style de-platforming shit never works and he has every right to spew his spin as any other asshole doing the same. Sunlight is the disinfectant, his ideas are dogshit (Tucker \"le heckin Sharia is kinda ok tho\" Carlson's ideas aren't really even his) so by all means, go on another podcast. permalink parent award report block reply shadypollster OP 3 points 28 minutes ago Yeah. De-platforming didn't work with Fuentes, Jones or Torba. Fuentes is being astroturfed, Jones is as red as ever and Torba runs his own social media site and accepted bitcoin way before it ballooned like it did. permalink parent award report block reply blockchain-the-vote 2 points 26 minutes ago AJ is above all of them and oddly enough the comparative moderate permalink parent award report block reply fightfightfightx 1 points 41 minutes ago oh no, he's against jewish supremacy, HOW DARE HE permalink parent award report block reply\nshadypollster OP 3 points 41 minutes ago I'm a big believer in the marketplace of ideas (on the Right, the Left uses a command model). The backlash when he gets assassinated is something I cannot predict. He has been floated as a POTUS candidate and they took Charlie Kirk away from us, another potential POTUS candidate. permalink parent award report block reply blockchain-the-vote 1 points 32 minutes ago I am a free speech absolutist but speech isn't spam, bots, or drowning out other ideas... never was. Speech is a (wilful) exchange (not association). No one is obligated to have Tucker at all, or like him, or even tolerate him (I don't, I think he's a die-hard statist who lies as he breathes)... but this leftist-style de-platforming shit never works and he has every right to spew his spin as any other asshole doing the same. Sunlight is the disinfectant, his ideas are dogshit (Tucker \"le heckin Sharia is kinda ok tho\" Carlson's ideas aren't really even his) so by all means, go on another podcast. permalink parent award report block reply shadypollster OP 3 points 28 minutes ago Yeah. De-platforming didn't work with Fuentes, Jones or Torba. Fuentes is being astroturfed, Jones is as red as ever and Torba runs his own social media site and accepted bitcoin way before it ballooned like it did. permalink parent award report block reply blockchain-the-vote 2 points 26 minutes ago AJ is above all of them and oddly enough the comparative moderate permalink parent award report block reply\nblockchain-the-vote 1 points 32 minutes ago I am a free speech absolutist but speech isn't spam, bots, or drowning out other ideas... never was. Speech is a (wilful) exchange (not association). No one is obligated to have Tucker at all, or like him, or even tolerate him (I don't, I think he's a die-hard statist who lies as he breathes)... but this leftist-style de-platforming shit never works and he has every right to spew his spin as any other asshole doing the same. Sunlight is the disinfectant, his ideas are dogshit (Tucker \"le heckin Sharia is kinda ok tho\" Carlson's ideas aren't really even his) so by all means, go on another podcast. permalink parent award report block reply shadypollster OP 3 points 28 minutes ago Yeah. De-platforming didn't work with Fuentes, Jones or Torba. Fuentes is being astroturfed, Jones is as red as ever and Torba runs his own social media site and accepted bitcoin way before it ballooned like it did. permalink parent award report block reply blockchain-the-vote 2 points 26 minutes ago AJ is above all of them and oddly enough the comparative moderate permalink parent award report block reply\nshadypollster OP 3 points 28 minutes ago Yeah. De-platforming didn't work with Fuentes, Jones or Torba. Fuentes is being astroturfed, Jones is as red as ever and Torba runs his own social media site and accepted bitcoin way before it ballooned like it did. permalink parent award report block reply blockchain-the-vote 2 points 26 minutes ago AJ is above all of them and oddly enough the comparative moderate permalink parent award report block reply\nblockchain-the-vote 2 points 26 minutes ago AJ is above all of them and oddly enough the comparative moderate permalink parent award report block reply\nfightfightfightx 1 points 41 minutes ago oh no, he's against jewish supremacy, HOW DARE HE permalink parent award report block reply\nBriben -1 points 33 minutes ago Nobody’s canceling anything.  Calling out his paid off guests for supporting foreign enemies is not censorship. permalink award report block reply"}