{"id": "8185024", "contents": "454 Please do the needful posted 10 hours ago by HappyFunBall 22 comments award share download report block\n22 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style 19American62Woman 29 points 10 hours ago My small Texas town was 99% white. It changed literally overnight. Now our stores all look ransacked, things under lock and key. Gangs of vandals, and can’t get a job unless you are dark. permalink award report block reply mty_green_go 13 points 9 hours ago sounds like you have been culturally enriched! Embrace your \"divershitty is out strength\"!! permalink parent award report block reply Rydanovich 6 points 9 hours ago It's funny seeing what is or isn't under lock and key. Bars of soap? Nope. Candy? Yep. permalink parent award report block reply iamherefortheluls 5 points 7 hours ago and can’t get a job unless you are dark white libs refuse to get this. Literally no one else, anywhere in the world, thinks racial discrimination is bad when its done for their in-group's preference. Everyone except 'white' people wants to hire only 'their own kind' permalink parent award report block reply BenDoverAssho 18 points 10 hours ago The Kalergi Plan is working. White replacement is a real phenomenon. The solution: 1- Our borders need to be shut, 2- legal immigration needs to be greatly reduced and limited to White Western people only, and 3- mass deportations of illegal foreigners need to be ramped up a hundred fold. Currently, I'm not sure that any of this is happening. permalink award report block reply someguy7738 14 points 10 hours ago And White people need to entirely eschew birth control and have as many children as possible. permalink parent award report block reply greatpumpkin 7 points 6 hours ago That'll never happen unless all divorce laws (& associated drek) going back 106 years are voided. permalink parent award report block reply CleanUpPhillyTrump24 2 points 4 hours ago #1 is def happening. The borders are shut. No one is being \"released\" because no one is coming in, so don't be confused by the fed lingo. #2 is well underway. We've revoked TPS, or temp status, and are revoking and even denaturalizing criminals and anti-American chaos agents organizing professional unrest and violence. I've seen this myself in Philly. #3 as for mass deportations, it's ramping up every day. Every day new ICE/CBP come online to process the detainees who need to go back home, and as you can see, the turnover in places like Alligator Alcatraz is vast. But we really are just starting. 11 months into the new Trump 2.0, we're gearing up for the next improved year of processing and deportations. Dems are losing their minds, which is a great metric to go by when gauging effectiveness. Their illegal voters are self-deporting, which is the most pressing problem for them, if I overhear Dems correctly. permalink parent award report block reply BenDoverAssho 2 points 4 hours ago This is a wonderful thing! It's probably best to keep it low-key and just simply get it done. I'd  like to see the people interfering with the process get hauled away and jailed for a few years as well. permalink parent award report block reply greatpumpkin 8 points 6 hours ago Lyndon Johnson screwed us in ways he could never imagine in 1960 ..... permalink award report block reply PatriotSkorzeny 5 points 10 hours ago NC is Yemen and Mexico. It’s a tragic shame. The admins legacy. 😒 permalink award report block reply Thune 5 points 9 hours ago This is every bit the invasion and threat that has conquered other peoples throughout history.  This must be repelled.  This is not their home.  They need to go home. permalink award report block reply BenDoverAssho 4 points 8 hours ago The people facilitating this need to be,\n\" removed\" as well. permalink parent award report block reply TD_Covfefe_Crusader 4 points 5 hours ago I had a old high school friend who moved to Minneapolis many years ago and became a Democrat. He loved 0bama and he used to mock the people in Minneapolis who were \"having a hard time\" with all the Somalis being imported. I wonder if he feels any remorse now that it has been completely overrun with Somalis and become an absolute shit hole. permalink award report block reply IlhanOmarsFagBrother 1 points 56 minutes ago Doubt it, He's probably privileged enough to live far enough away from them where he doesn't see them everyday permalink parent award report block reply Dev404 3 points 8 hours ago Obama, and Congress, were happy to replace the white people there with third world goatfuckers. permalink award report block reply CleanUpPhillyTrump24 2 points 5 hours ago It''s up to the patriots in Minn. to REPORT to ICE those who are illegal. Just do a little research to make the case. The ICE online tip line is for ANY SUSPICIOUS ACTIVITY, per their own website: https://www.ice.gov/webform/ice-tip-form Don't be shy. Don't be lazy. Take your nation back. permalink award report block reply redinmn 2 points 2 hours ago At some point Catholic Charities and Lutheran social services need to pay a price for the damage they have caused to this state. permalink award report block reply Shitsbrokeyo 2 points 6 hours ago Deport permalink award report block reply IlhanOmarsFagBrother 1 points 1 hour ago Make Minnesota Lutheran Again permalink award report block reply\n19American62Woman 29 points 10 hours ago My small Texas town was 99% white. It changed literally overnight. Now our stores all look ransacked, things under lock and key. Gangs of vandals, and can’t get a job unless you are dark. permalink award report block reply mty_green_go 13 points 9 hours ago sounds like you have been culturally enriched! Embrace your \"divershitty is out strength\"!! permalink parent award report block reply Rydanovich 6 points 9 hours ago It's funny seeing what is or isn't under lock and key. Bars of soap? Nope. Candy? Yep. permalink parent award report block reply iamherefortheluls 5 points 7 hours ago and can’t get a job unless you are dark white libs refuse to get this. Literally no one else, anywhere in the world, thinks racial discrimination is bad when its done for their in-group's preference. Everyone except 'white' people wants to hire only 'their own kind' permalink parent award report block reply\nmty_green_go 13 points 9 hours ago sounds like you have been culturally enriched! Embrace your \"divershitty is out strength\"!! permalink parent award report block reply\nRydanovich 6 points 9 hours ago It's funny seeing what is or isn't under lock and key. Bars of soap? Nope. Candy? Yep. permalink parent award report block reply\niamherefortheluls 5 points 7 hours ago and can’t get a job unless you are dark white libs refuse to get this. Literally no one else, anywhere in the world, thinks racial discrimination is bad when its done for their in-group's preference. Everyone except 'white' people wants to hire only 'their own kind' permalink parent award report block reply\nBenDoverAssho 18 points 10 hours ago The Kalergi Plan is working. White replacement is a real phenomenon. The solution: 1- Our borders need to be shut, 2- legal immigration needs to be greatly reduced and limited to White Western people only, and 3- mass deportations of illegal foreigners need to be ramped up a hundred fold. Currently, I'm not sure that any of this is happening. permalink award report block reply someguy7738 14 points 10 hours ago And White people need to entirely eschew birth control and have as many children as possible. permalink parent award report block reply greatpumpkin 7 points 6 hours ago That'll never happen unless all divorce laws (& associated drek) going back 106 years are voided. permalink parent award report block reply CleanUpPhillyTrump24 2 points 4 hours ago #1 is def happening. The borders are shut. No one is being \"released\" because no one is coming in, so don't be confused by the fed lingo. #2 is well underway. We've revoked TPS, or temp status, and are revoking and even denaturalizing criminals and anti-American chaos agents organizing professional unrest and violence. I've seen this myself in Philly. #3 as for mass deportations, it's ramping up every day. Every day new ICE/CBP come online to process the detainees who need to go back home, and as you can see, the turnover in places like Alligator Alcatraz is vast. But we really are just starting. 11 months into the new Trump 2.0, we're gearing up for the next improved year of processing and deportations. Dems are losing their minds, which is a great metric to go by when gauging effectiveness. Their illegal voters are self-deporting, which is the most pressing problem for them, if I overhear Dems correctly. permalink parent award report block reply BenDoverAssho 2 points 4 hours ago This is a wonderful thing! It's probably best to keep it low-key and just simply get it done. I'd  like to see the people interfering with the process get hauled away and jailed for a few years as well. permalink parent award report block reply\nsomeguy7738 14 points 10 hours ago And White people need to entirely eschew birth control and have as many children as possible. permalink parent award report block reply greatpumpkin 7 points 6 hours ago That'll never happen unless all divorce laws (& associated drek) going back 106 years are voided. permalink parent award report block reply\ngreatpumpkin 7 points 6 hours ago That'll never happen unless all divorce laws (& associated drek) going back 106 years are voided. permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 4 hours ago #1 is def happening. The borders are shut. No one is being \"released\" because no one is coming in, so don't be confused by the fed lingo. #2 is well underway. We've revoked TPS, or temp status, and are revoking and even denaturalizing criminals and anti-American chaos agents organizing professional unrest and violence. I've seen this myself in Philly. #3 as for mass deportations, it's ramping up every day. Every day new ICE/CBP come online to process the detainees who need to go back home, and as you can see, the turnover in places like Alligator Alcatraz is vast. But we really are just starting. 11 months into the new Trump 2.0, we're gearing up for the next improved year of processing and deportations. Dems are losing their minds, which is a great metric to go by when gauging effectiveness. Their illegal voters are self-deporting, which is the most pressing problem for them, if I overhear Dems correctly. permalink parent award report block reply BenDoverAssho 2 points 4 hours ago This is a wonderful thing! It's probably best to keep it low-key and just simply get it done. I'd  like to see the people interfering with the process get hauled away and jailed for a few years as well. permalink parent award report block reply\nBenDoverAssho 2 points 4 hours ago This is a wonderful thing! It's probably best to keep it low-key and just simply get it done. I'd  like to see the people interfering with the process get hauled away and jailed for a few years as well. permalink parent award report block reply\ngreatpumpkin 8 points 6 hours ago Lyndon Johnson screwed us in ways he could never imagine in 1960 ..... permalink award report block reply\nPatriotSkorzeny 5 points 10 hours ago NC is Yemen and Mexico. It’s a tragic shame. The admins legacy. 😒 permalink award report block reply\nThune 5 points 9 hours ago This is every bit the invasion and threat that has conquered other peoples throughout history.  This must be repelled.  This is not their home.  They need to go home. permalink award report block reply BenDoverAssho 4 points 8 hours ago The people facilitating this need to be,\n\" removed\" as well. permalink parent award report block reply\nBenDoverAssho 4 points 8 hours ago The people facilitating this need to be,\nTD_Covfefe_Crusader 4 points 5 hours ago I had a old high school friend who moved to Minneapolis many years ago and became a Democrat. He loved 0bama and he used to mock the people in Minneapolis who were \"having a hard time\" with all the Somalis being imported. I wonder if he feels any remorse now that it has been completely overrun with Somalis and become an absolute shit hole. permalink award report block reply IlhanOmarsFagBrother 1 points 56 minutes ago Doubt it, He's probably privileged enough to live far enough away from them where he doesn't see them everyday permalink parent award report block reply\nIlhanOmarsFagBrother 1 points 56 minutes ago Doubt it, He's probably privileged enough to live far enough away from them where he doesn't see them everyday permalink parent award report block reply\nDev404 3 points 8 hours ago Obama, and Congress, were happy to replace the white people there with third world goatfuckers. permalink award report block reply\nCleanUpPhillyTrump24 2 points 5 hours ago It''s up to the patriots in Minn. to REPORT to ICE those who are illegal. Just do a little research to make the case. The ICE online tip line is for ANY SUSPICIOUS ACTIVITY, per their own website: https://www.ice.gov/webform/ice-tip-form Don't be shy. Don't be lazy. Take your nation back. permalink award report block reply\nredinmn 2 points 2 hours ago At some point Catholic Charities and Lutheran social services need to pay a price for the damage they have caused to this state. permalink award report block reply\nShitsbrokeyo 2 points 6 hours ago Deport permalink award report block reply\nIlhanOmarsFagBrother 1 points 1 hour ago Make Minnesota Lutheran Again permalink award report block reply"}