{"id": "8185523", "contents": "96 (www.thegatewaypundit.com) posted 7 hours ago by thegatewaybandit 6 comments award share report block WAYNE ROOT: CHEMTRAILS: We All See It. We All Know It’s Happening. We’re All Concerned. We Want President Trump and RFK Jr. to A... By Wayne Allyn Root This will be one of the shortest columns I’ve ever written. www.thegatewaypundit.com\n6 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget RudeFrog 2 points 7 hours ago The sky outside is fucking insane, I just counted over 30 trails, the whole sky is covered permalink award report block reply LORDFALCONE 2 points 6 hours ago Inb4 DUUUUUURRRRRRR ITS WATER VAPOR DURRRRRR permalink award report block reply LiteraIIyHitIer 1 points 3 hours ago Best we can do is ignore you because you used the term \"chemtrails\". Better luck next time, conspiracy theorist. permalink award report block reply SDsc0rch 1 points 6 hours ago ...sigh.......... its WATER vapor!! permalink award report block reply LORDFALCONE 1 points 6 hours ago You know what the punishment for crimes against humanity is permalink parent award report block reply IroWide -1 points 6 hours ago Please stop with your gatewayjunkit spamming. I've reported you numerous times. permalink award report block reply\nRudeFrog 2 points 7 hours ago The sky outside is fucking insane, I just counted over 30 trails, the whole sky is covered permalink award report block reply\nLORDFALCONE 2 points 6 hours ago Inb4 DUUUUUURRRRRRR ITS WATER VAPOR DURRRRRR permalink award report block reply\nLiteraIIyHitIer 1 points 3 hours ago Best we can do is ignore you because you used the term \"chemtrails\". Better luck next time, conspiracy theorist. permalink award report block reply\nSDsc0rch 1 points 6 hours ago ...sigh.......... its WATER vapor!! permalink award report block reply LORDFALCONE 1 points 6 hours ago You know what the punishment for crimes against humanity is permalink parent award report block reply\nLORDFALCONE 1 points 6 hours ago You know what the punishment for crimes against humanity is permalink parent award report block reply\nIroWide -1 points 6 hours ago Please stop with your gatewayjunkit spamming. I've reported you numerous times. permalink award report block reply"}