{"id": "8185494", "contents": "344 Natalie Winters: Not sure what is worse: this actually happening or the admin thinking this is a “win”. posted 7 hours ago by Bazhosh 47 comments award share report block Natalie Winters @nataliegwinters • 9h Not sure what is worse: this actually happening or the admin thinking this is a “win”. Disclose.tv @disclosetv • 11h NOW - DHS Secretary Noem on H-1Bs: \"Under the Trump admin, we've sped up our process and added integrity to the visa programs, to green cards, to all of that, but also more people are becoming naturalized under this admin than ever before. More people are becoming citizens.\"\n47 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget drmrboy 44 points 7 hours ago We're being lied to by the Trump administration.  Either they are compromised ... or this was their plan all along (MAGA was just a cover).  They're are no other explanations.  🤓 permalink award report block reply YaharaRiver 13 points 7 hours ago The part amusing to me is how it’s all perfectly LEGAL ever since the GAY muslim Kenyan fucked with our Smith-Mundt Act. obama and his ☪️ult, say yer prayerz!! permalink parent award report block reply MastaJoda 7 points 6 hours ago the RINO Party helped pass that. Obama just approved it. Never forget that. permalink parent award report block reply gunteh 11 points 6 hours ago We expected a Crossing of the Rubicon, and instead got a Trojan Horse. We toasted with hearty cheers but the drink was poisoned before we even took a sip. permalink parent award report block reply TheThreeSeashells -1 points 6 hours ago It boils down to President Trump being a businessman, so he's going to side with business every time.  If business wants illiterate foreign workers where it takes 5 of them to do the job of one American citizen, then business is going to get that from this administration. This is the same thing as them talking about amnesty of farm/hospitality workers a few months back because those businesses were bitching about losing their slave labor. permalink parent award report block reply ReleasetheList 10 points 6 hours ago Those businessmen he's trying to placate aren't going to do shit but celebrate when he's impeached and imprisoned. And Trump's a fool if they think they will stop with him. All of his sons will follow. permalink parent award report block reply MastaJoda 13 points 6 hours ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply TheThreeSeashells 2 points 60 minutes ago I remember in his first term he had a meeting with a bunch of CEOs who later turned on him the second the false Charlottesville narrative was pushed by the media.  It's pretty pathetic President Trump didn't learn his lesson from that and went right back to thinking they were all buddies again. permalink parent award report block reply TheTelltaleFly 36 points 7 hours ago Good thing Trump worked so hard to bring all that capital investment back to America to create American jobs so we can import enough foreigners to fill them. Yay. permalink award report block reply Region 19 points 7 hours ago WTAF? This is straight up globalism and antithetical to the speech he gave at the UN in 2019. permalink parent award report block reply TheThreeSeashells 12 points 6 hours ago Antithetical to the speech?  How about to MAGA itself.  If this shit is what he wants to do, he needs to take off the MAGA hat. permalink parent award report block reply FKH2 23 points 7 hours ago Find a way to stop this train, I want off, now permalink award report block reply farfiman 5 points 7 hours ago Jump. permalink parent award report block reply FKH2 9 points 7 hours ago I might permalink parent award report block reply Standingoak 2 points 6 hours ago Wait , volunteer for Mars. permalink parent award report block reply y_do_i_need_to_hide 2 points 6 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply y_do_i_need_to_hide -2 points 6 hours ago You guys know we are all on Truth, now, right? :) permalink parent award report block reply BigMikesBallz 23 points 7 hours ago “We’ve actually sped up replacing American citizens with foreigners that hate you.”  Thanks assholes. permalink award report block reply TD_Covfefe_Crusader 4 points 5 hours ago If they want to naturalize more citizens, they need to start revoking the citizenship of naturalized criminals, communists, and terrorists first. Free up some space by removing trash before adding more. permalink parent award report block reply IroWide 20 points 6 hours ago I actually don't care if our economy takes a big hit if it means I don't have to live near beaners or jeets anymore. permalink award report block reply GoldenEarz 15 points 6 hours ago When they say “foreigners are good for the economy”, they mean good for their economy not your economy. permalink parent award report block reply friarfox 7 points 6 hours ago But you get a Piggly Wiggly cart and a tent as the Jeets take your picket fence house. permalink parent award report block reply someguy7738 5 points 6 hours ago That's what they mean literally any time they claim something is good for \"America\". They mean the corporations and ruling class. Us lowly peasants can get fucked. I guess Jon \"Stuart\" Leibowitz was right \"this isn't your country, goyim!\" permalink parent award report block reply NoahGav 1 points 6 hours ago What about blax? permalink parent award report block reply IroWide 2 points 6 hours ago I have given up on ever getting rid of them. permalink parent award report block reply panic86 1 points 7 minutes ago Exactly. First things first. permalink parent award report block reply MastaJoda 1 points 6 hours ago whoa!!! THIS GUY HATES WALL STREET BILLIONAIRES! He's not MAGA permalink parent award report block reply Throwingway22 19 points 7 hours ago It's worse that they think it's a win. Completely out of touch. permalink award report block reply South_Florida_Guy 19 points 6 hours ago This is literally the opposite of what I voted for permalink award report block reply 62jawbill 17 points 7 hours ago Susie Wiles is the one making these decisions. Trump is not worried about what us peasants think. He had me fooled for 10 years. Trump is Q. permalink award report block reply South_Florida_Guy 13 points 6 hours ago Is she the one that says she like Israel better than the US? permalink parent award report block reply 62jawbill 8 points 6 hours ago Head of his administration. permalink parent award report block reply Standingoak 4 points 6 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply someguy7738 5 points 6 hours ago the one There are a lot more than one of them. permalink parent award report block reply RandoBudster 8 points 7 hours ago HOORAY! I'm an American citizen!...Now.. Death to America! permalink award report block reply TheTrumpiest 3 points 3 hours ago Whatever these “certain talents“ are, we need to create our own fast track training programs for them. Nine times out of 10, we don’t need a four year university degree. We just need a condensed training program. permalink award report block reply ACActual 2 points 2 hours ago Speeding up bringing foreigners in to replace Americans.   Whats not to love about that permalink award report block reply GayPatriotMAGAUncle 2 points 2 hours ago Bunch of Nazi stormfags here that don't understand the full context of this interview. No, you're not being replaced, Trump is only going to bring a handful of H-1B's to the US to fill in roles that no one here has the skills for. If you're too stupid to understand this, you are not MAGA. Just an entitled millennial brat who never grew up playing vidya, masturbating to anime, and got an underwater basket weaving degree in college. permalink award report block reply ChickenCasserole 1 points 1 hour ago Sure thing boomer. I guess we'll see. And when you die alone it'll be the shitskins that throw your carcass in the ditch as they move into your house permalink parent award report block reply GayPatriotMAGAUncle 2 points 1 hour ago You won't do shit pussy. permalink parent award report block reply ChickenCasserole 1 points 59 minutes ago To you? Never said I would faggot. But keep being upsetty spaghetti boomer shitass. Maybe your heart will give out. We can only hope. permalink parent award report block reply RuleoVicus 0 points 10 minutes ago Your diaper needs changing. permalink parent award report block reply ACActual 2 points 2 hours ago What this tells you is the policy has been written.   Replacing Americans is the default position of the Trump administration.   Its in writing.   We have officially been betrayed permalink award report block reply RuleoVicus 1 points 6 minutes ago Pretty much. permalink parent award report block reply blitzkrieg1 -4 points 6 hours ago This may help you with your uneducated post. https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply Be_The_Change 4 points 7 hours ago Comment removed by community moderators. permalink award report block reply SCHULTZ 2 points 6 hours ago Comment removed by community moderators. permalink award report block reply\ndrmrboy 44 points 7 hours ago We're being lied to by the Trump administration.  Either they are compromised ... or this was their plan all along (MAGA was just a cover).  They're are no other explanations.  🤓 permalink award report block reply YaharaRiver 13 points 7 hours ago The part amusing to me is how it’s all perfectly LEGAL ever since the GAY muslim Kenyan fucked with our Smith-Mundt Act. obama and his ☪️ult, say yer prayerz!! permalink parent award report block reply MastaJoda 7 points 6 hours ago the RINO Party helped pass that. Obama just approved it. Never forget that. permalink parent award report block reply gunteh 11 points 6 hours ago We expected a Crossing of the Rubicon, and instead got a Trojan Horse. We toasted with hearty cheers but the drink was poisoned before we even took a sip. permalink parent award report block reply TheThreeSeashells -1 points 6 hours ago It boils down to President Trump being a businessman, so he's going to side with business every time.  If business wants illiterate foreign workers where it takes 5 of them to do the job of one American citizen, then business is going to get that from this administration. This is the same thing as them talking about amnesty of farm/hospitality workers a few months back because those businesses were bitching about losing their slave labor. permalink parent award report block reply ReleasetheList 10 points 6 hours ago Those businessmen he's trying to placate aren't going to do shit but celebrate when he's impeached and imprisoned. And Trump's a fool if they think they will stop with him. All of his sons will follow. permalink parent award report block reply MastaJoda 13 points 6 hours ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply TheThreeSeashells 2 points 60 minutes ago I remember in his first term he had a meeting with a bunch of CEOs who later turned on him the second the false Charlottesville narrative was pushed by the media.  It's pretty pathetic President Trump didn't learn his lesson from that and went right back to thinking they were all buddies again. permalink parent award report block reply\nYaharaRiver 13 points 7 hours ago The part amusing to me is how it’s all perfectly LEGAL ever since the GAY muslim Kenyan fucked with our Smith-Mundt Act. obama and his ☪️ult, say yer prayerz!! permalink parent award report block reply MastaJoda 7 points 6 hours ago the RINO Party helped pass that. Obama just approved it. Never forget that. permalink parent award report block reply\nMastaJoda 7 points 6 hours ago the RINO Party helped pass that. Obama just approved it. Never forget that. permalink parent award report block reply\ngunteh 11 points 6 hours ago We expected a Crossing of the Rubicon, and instead got a Trojan Horse. We toasted with hearty cheers but the drink was poisoned before we even took a sip. permalink parent award report block reply\nTheThreeSeashells -1 points 6 hours ago It boils down to President Trump being a businessman, so he's going to side with business every time.  If business wants illiterate foreign workers where it takes 5 of them to do the job of one American citizen, then business is going to get that from this administration. This is the same thing as them talking about amnesty of farm/hospitality workers a few months back because those businesses were bitching about losing their slave labor. permalink parent award report block reply ReleasetheList 10 points 6 hours ago Those businessmen he's trying to placate aren't going to do shit but celebrate when he's impeached and imprisoned. And Trump's a fool if they think they will stop with him. All of his sons will follow. permalink parent award report block reply MastaJoda 13 points 6 hours ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply TheThreeSeashells 2 points 60 minutes ago I remember in his first term he had a meeting with a bunch of CEOs who later turned on him the second the false Charlottesville narrative was pushed by the media.  It's pretty pathetic President Trump didn't learn his lesson from that and went right back to thinking they were all buddies again. permalink parent award report block reply\nReleasetheList 10 points 6 hours ago Those businessmen he's trying to placate aren't going to do shit but celebrate when he's impeached and imprisoned. And Trump's a fool if they think they will stop with him. All of his sons will follow. permalink parent award report block reply MastaJoda 13 points 6 hours ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply TheThreeSeashells 2 points 60 minutes ago I remember in his first term he had a meeting with a bunch of CEOs who later turned on him the second the false Charlottesville narrative was pushed by the media.  It's pretty pathetic President Trump didn't learn his lesson from that and went right back to thinking they were all buddies again. permalink parent award report block reply\nMastaJoda 13 points 6 hours ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply\nTheThreeSeashells 2 points 60 minutes ago I remember in his first term he had a meeting with a bunch of CEOs who later turned on him the second the false Charlottesville narrative was pushed by the media.  It's pretty pathetic President Trump didn't learn his lesson from that and went right back to thinking they were all buddies again. permalink parent award report block reply\nTheTelltaleFly 36 points 7 hours ago Good thing Trump worked so hard to bring all that capital investment back to America to create American jobs so we can import enough foreigners to fill them. Yay. permalink award report block reply Region 19 points 7 hours ago WTAF? This is straight up globalism and antithetical to the speech he gave at the UN in 2019. permalink parent award report block reply TheThreeSeashells 12 points 6 hours ago Antithetical to the speech?  How about to MAGA itself.  If this shit is what he wants to do, he needs to take off the MAGA hat. permalink parent award report block reply\nRegion 19 points 7 hours ago WTAF? This is straight up globalism and antithetical to the speech he gave at the UN in 2019. permalink parent award report block reply TheThreeSeashells 12 points 6 hours ago Antithetical to the speech?  How about to MAGA itself.  If this shit is what he wants to do, he needs to take off the MAGA hat. permalink parent award report block reply\nTheThreeSeashells 12 points 6 hours ago Antithetical to the speech?  How about to MAGA itself.  If this shit is what he wants to do, he needs to take off the MAGA hat. permalink parent award report block reply\nFKH2 23 points 7 hours ago Find a way to stop this train, I want off, now permalink award report block reply farfiman 5 points 7 hours ago Jump. permalink parent award report block reply FKH2 9 points 7 hours ago I might permalink parent award report block reply Standingoak 2 points 6 hours ago Wait , volunteer for Mars. permalink parent award report block reply y_do_i_need_to_hide 2 points 6 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply y_do_i_need_to_hide -2 points 6 hours ago You guys know we are all on Truth, now, right? :) permalink parent award report block reply\nfarfiman 5 points 7 hours ago Jump. permalink parent award report block reply FKH2 9 points 7 hours ago I might permalink parent award report block reply Standingoak 2 points 6 hours ago Wait , volunteer for Mars. permalink parent award report block reply y_do_i_need_to_hide 2 points 6 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply\nFKH2 9 points 7 hours ago I might permalink parent award report block reply Standingoak 2 points 6 hours ago Wait , volunteer for Mars. permalink parent award report block reply y_do_i_need_to_hide 2 points 6 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply\nStandingoak 2 points 6 hours ago Wait , volunteer for Mars. permalink parent award report block reply\ny_do_i_need_to_hide 2 points 6 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply\ny_do_i_need_to_hide -2 points 6 hours ago You guys know we are all on Truth, now, right? :) permalink parent award report block reply\nBigMikesBallz 23 points 7 hours ago “We’ve actually sped up replacing American citizens with foreigners that hate you.”  Thanks assholes. permalink award report block reply TD_Covfefe_Crusader 4 points 5 hours ago If they want to naturalize more citizens, they need to start revoking the citizenship of naturalized criminals, communists, and terrorists first. Free up some space by removing trash before adding more. permalink parent award report block reply\nTD_Covfefe_Crusader 4 points 5 hours ago If they want to naturalize more citizens, they need to start revoking the citizenship of naturalized criminals, communists, and terrorists first. Free up some space by removing trash before adding more. permalink parent award report block reply\nIroWide 20 points 6 hours ago I actually don't care if our economy takes a big hit if it means I don't have to live near beaners or jeets anymore. permalink award report block reply GoldenEarz 15 points 6 hours ago When they say “foreigners are good for the economy”, they mean good for their economy not your economy. permalink parent award report block reply friarfox 7 points 6 hours ago But you get a Piggly Wiggly cart and a tent as the Jeets take your picket fence house. permalink parent award report block reply someguy7738 5 points 6 hours ago That's what they mean literally any time they claim something is good for \"America\". They mean the corporations and ruling class. Us lowly peasants can get fucked. I guess Jon \"Stuart\" Leibowitz was right \"this isn't your country, goyim!\" permalink parent award report block reply NoahGav 1 points 6 hours ago What about blax? permalink parent award report block reply IroWide 2 points 6 hours ago I have given up on ever getting rid of them. permalink parent award report block reply panic86 1 points 7 minutes ago Exactly. First things first. permalink parent award report block reply MastaJoda 1 points 6 hours ago whoa!!! THIS GUY HATES WALL STREET BILLIONAIRES! He's not MAGA permalink parent award report block reply\nGoldenEarz 15 points 6 hours ago When they say “foreigners are good for the economy”, they mean good for their economy not your economy. permalink parent award report block reply friarfox 7 points 6 hours ago But you get a Piggly Wiggly cart and a tent as the Jeets take your picket fence house. permalink parent award report block reply someguy7738 5 points 6 hours ago That's what they mean literally any time they claim something is good for \"America\". They mean the corporations and ruling class. Us lowly peasants can get fucked. I guess Jon \"Stuart\" Leibowitz was right \"this isn't your country, goyim!\" permalink parent award report block reply\nfriarfox 7 points 6 hours ago But you get a Piggly Wiggly cart and a tent as the Jeets take your picket fence house. permalink parent award report block reply\nsomeguy7738 5 points 6 hours ago That's what they mean literally any time they claim something is good for \"America\". They mean the corporations and ruling class. Us lowly peasants can get fucked. I guess Jon \"Stuart\" Leibowitz was right \"this isn't your country, goyim!\" permalink parent award report block reply\nNoahGav 1 points 6 hours ago What about blax? permalink parent award report block reply IroWide 2 points 6 hours ago I have given up on ever getting rid of them. permalink parent award report block reply panic86 1 points 7 minutes ago Exactly. First things first. permalink parent award report block reply\nIroWide 2 points 6 hours ago I have given up on ever getting rid of them. permalink parent award report block reply panic86 1 points 7 minutes ago Exactly. First things first. permalink parent award report block reply\npanic86 1 points 7 minutes ago Exactly. First things first. permalink parent award report block reply\nMastaJoda 1 points 6 hours ago whoa!!! THIS GUY HATES WALL STREET BILLIONAIRES! He's not MAGA permalink parent award report block reply\nThrowingway22 19 points 7 hours ago It's worse that they think it's a win. Completely out of touch. permalink award report block reply\nSouth_Florida_Guy 19 points 6 hours ago This is literally the opposite of what I voted for permalink award report block reply\n62jawbill 17 points 7 hours ago Susie Wiles is the one making these decisions. Trump is not worried about what us peasants think. He had me fooled for 10 years. Trump is Q. permalink award report block reply South_Florida_Guy 13 points 6 hours ago Is she the one that says she like Israel better than the US? permalink parent award report block reply 62jawbill 8 points 6 hours ago Head of his administration. permalink parent award report block reply Standingoak 4 points 6 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply someguy7738 5 points 6 hours ago the one There are a lot more than one of them. permalink parent award report block reply\nSouth_Florida_Guy 13 points 6 hours ago Is she the one that says she like Israel better than the US? permalink parent award report block reply 62jawbill 8 points 6 hours ago Head of his administration. permalink parent award report block reply Standingoak 4 points 6 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply someguy7738 5 points 6 hours ago the one There are a lot more than one of them. permalink parent award report block reply\n62jawbill 8 points 6 hours ago Head of his administration. permalink parent award report block reply Standingoak 4 points 6 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply\nStandingoak 4 points 6 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply\nsomeguy7738 5 points 6 hours ago the one There are a lot more than one of them. permalink parent award report block reply\nRandoBudster 8 points 7 hours ago HOORAY! I'm an American citizen!...Now.. Death to America! permalink award report block reply\nTheTrumpiest 3 points 3 hours ago Whatever these “certain talents“ are, we need to create our own fast track training programs for them. Nine times out of 10, we don’t need a four year university degree. We just need a condensed training program. permalink award report block reply\nACActual 2 points 2 hours ago Speeding up bringing foreigners in to replace Americans.   Whats not to love about that permalink award report block reply\nGayPatriotMAGAUncle 2 points 2 hours ago Bunch of Nazi stormfags here that don't understand the full context of this interview. No, you're not being replaced, Trump is only going to bring a handful of H-1B's to the US to fill in roles that no one here has the skills for. If you're too stupid to understand this, you are not MAGA. Just an entitled millennial brat who never grew up playing vidya, masturbating to anime, and got an underwater basket weaving degree in college. permalink award report block reply ChickenCasserole 1 points 1 hour ago Sure thing boomer. I guess we'll see. And when you die alone it'll be the shitskins that throw your carcass in the ditch as they move into your house permalink parent award report block reply GayPatriotMAGAUncle 2 points 1 hour ago You won't do shit pussy. permalink parent award report block reply ChickenCasserole 1 points 59 minutes ago To you? Never said I would faggot. But keep being upsetty spaghetti boomer shitass. Maybe your heart will give out. We can only hope. permalink parent award report block reply RuleoVicus 0 points 10 minutes ago Your diaper needs changing. permalink parent award report block reply\nChickenCasserole 1 points 1 hour ago Sure thing boomer. I guess we'll see. And when you die alone it'll be the shitskins that throw your carcass in the ditch as they move into your house permalink parent award report block reply GayPatriotMAGAUncle 2 points 1 hour ago You won't do shit pussy. permalink parent award report block reply ChickenCasserole 1 points 59 minutes ago To you? Never said I would faggot. But keep being upsetty spaghetti boomer shitass. Maybe your heart will give out. We can only hope. permalink parent award report block reply RuleoVicus 0 points 10 minutes ago Your diaper needs changing. permalink parent award report block reply\nGayPatriotMAGAUncle 2 points 1 hour ago You won't do shit pussy. permalink parent award report block reply ChickenCasserole 1 points 59 minutes ago To you? Never said I would faggot. But keep being upsetty spaghetti boomer shitass. Maybe your heart will give out. We can only hope. permalink parent award report block reply RuleoVicus 0 points 10 minutes ago Your diaper needs changing. permalink parent award report block reply\nChickenCasserole 1 points 59 minutes ago To you? Never said I would faggot. But keep being upsetty spaghetti boomer shitass. Maybe your heart will give out. We can only hope. permalink parent award report block reply\nRuleoVicus 0 points 10 minutes ago Your diaper needs changing. permalink parent award report block reply\nACActual 2 points 2 hours ago What this tells you is the policy has been written.   Replacing Americans is the default position of the Trump administration.   Its in writing.   We have officially been betrayed permalink award report block reply RuleoVicus 1 points 6 minutes ago Pretty much. permalink parent award report block reply\nRuleoVicus 1 points 6 minutes ago Pretty much. permalink parent award report block reply\nblitzkrieg1 -4 points 6 hours ago This may help you with your uneducated post. https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply\nBe_The_Change 4 points 7 hours ago Comment removed by community moderators. permalink award report block reply\nSCHULTZ 2 points 6 hours ago Comment removed by community moderators. permalink award report block reply"}