{"id": "8185569", "contents": "1367 💯‼️ 🚁 FREE CHOPPER RIDES 🚁 posted 6 hours ago by wst4 192 comments award share download report block\n192 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow SHILL_DETECTOR 56 points 6 hours ago best i can do is 6 dollars a pound ground beef permalink award report block reply KekistanPM 34 points 6 hours ago Free if you're on EBT. permalink parent award report block reply Mamapedia 16 points 6 hours ago Eatin' good in the (neighbor)hood. permalink parent award report block reply Trump4prez 4 points 5 hours ago 60 million deportations permalink parent award report block reply kekranger 2 points 3 hours ago Right now I’d call what they’ve done so far show deportations. When the numbers get to be enough to actually start making an impact on things like housing and jobs that’s when we’ll know if they’re serious. When the chamber of commerce republicans start asking Trump to call off the dogs because it’s hurting their business. permalink parent award report block reply MarALigma 1 points 3 hours ago AI PROTEST IS HOW WE WIN permalink parent award report block reply Klaus73 3 points 6 hours ago Honestly things would be better if EBT was moved toward more raw production items like meats and vegetables as opposed to processed shit that just makes you useless and lethargic. permalink parent award report block reply SteveRogers42 7 points 6 hours ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 3 points 5 hours ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 5 hours ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply view 1 more comments... MissingTrump 1 points 5 hours ago Paid for by taxpayer dollars. Never free. Nothing is ever free. permalink parent award report block reply GuerillaYourDreams 17 points 6 hours ago Nearly $7 a pound, where I live right now. I've stopped buying beef. And I love beef. permalink parent award report block reply Yignuced 11 points 6 hours ago I’d stop paying my 50 year mortgage before I stop eating beef.  Priorities and all. permalink parent award report block reply IncredibleMrE1 4 points 6 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply Deport_O_Matic 4 points 4 hours ago The endgame is $7/lb bugs permalink parent award report block reply GuerillaYourDreams 2 points 6 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply RedStoneDeepState 3 points 6 hours ago I paid 3.86 for some 80/20 yesterday. permalink parent award report block reply SHILL_DETECTOR 0 points 6 hours ago where?  texas probably permalink parent award report block reply RedStoneDeepState 3 points 6 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 6 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments... keeman 1 points 4 hours ago Man, that is some cheap ground beef.  I have been seeing up to $8 around here. permalink parent award report block reply SHILL_DETECTOR 1 points 4 hours ago yea, it was a bait comment, my bad permalink parent award report block reply South_Florida_Guy 1 points 6 hours ago lol you beat me to a comment like this one permalink parent award report block reply load 4 more comments... bejeavis 29 points 6 hours ago Sorry you don't have enough talent for that permalink award report block reply Viewer01 27 points 6 hours ago Trump has flipped 180 on immigration and is now willing to finish the dilution of whites to minority status. This is an obvious attempt to negate right wingers who were growing critical of Israel. Boomers would sooner sell this country to foreigners than give up on their Zionism. Which is all very ironic because it’s exactly how Weimar played out and will certainly mean the death of the grand ole party. I absolutely will not vote for losers in ‘26 without some massive wins and apologies. permalink parent award report block reply happyfave 3 points 6 hours ago How is he flipped 180 on immigration That is the stupidest take I've heard all day permalink parent award report block reply AVeryNakedMan 7 points 5 hours ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 6 points 5 hours ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 3 more comments... AppalachianTactical 5 points 4 hours ago You are either a bot or retarded boomer or jeet. He is flipping 180 on everything.\nFilibuster 180 and now we will get to lose our rights as trump removes fulibuster in time for dems to win midterms. Now hes on t.v. saying we MUST bring in foreigners because Americans dont have the talent.\nLiterally the rich versuon of the dems \"americans wont do thebwork argument\" but \"amerucans cant do the work.\" permalink parent award report block reply TheMrStone 1 points 6 minutes ago Call me a conspiracy theorist if you wish, but I am beginning to think there was a backroom deal where Trump would be allowed to win the 2024 election, but he had to do his level best to keep the status quo, and/or actively destroy the Republican Party. This filibuster elimination idea of his wreaks of intentional self-sabotage. Then there's the fact he has decided to call the whole Epstein debacle a hoax, looking as guilty as sin to impartial onlookers. It's bad all the way down. permalink parent award report block reply Viewer01 1 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply SanityGumby 3 points 5 hours ago He literally hasn’t permalink parent award report block reply Viewer01 3 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply Appeal2Heaven98 1 points 6 hours ago His drastic change in position on immigration is what's alarmed me the most. Has he given up? Or is he compromised? permalink parent award report block reply Fine_Kentucky_Jenkum 1 points 6 hours ago It’s almost as if he is an actor that could play a specific part on a TV role or something… who could have foreseen this? permalink parent award report block reply mohel -1 points 6 hours ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 5 hours ago lul permalink parent award report block reply try4gain PRO 1 points 5 hours ago he had one bad interview calm your tits permalink parent award report block reply Viewer01 1 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply load 1 more comments... mohel 1 points 6 hours ago Are we going to find out what 2A was meant for? permalink parent award report block reply HunterBidensPC 1 points 6 hours ago We already know what it’s for. Hit the fed needs a nice reminder permalink parent award report block reply xXCrusadyrXx 1 points 3 hours ago Never. Nothing but cowards and pussies in this once great nation. americans will have well earned their communism. permalink parent award report block reply Buce-Nudo 1 points 5 hours ago He didn't say that. Watch the clip. permalink parent award report block reply bejeavis 3 points 4 hours ago I did, hence the comment. Maybe you should. permalink parent award report block reply South_Florida_Guy 20 points 6 hours ago Best I can do is no more pennies permalink award report block reply SHILL_DETECTOR 6 points 6 hours ago thats a better one mines kind of a bait because ground beef is actually more like 8 dollars a pound and people will come in and say its actually 10 dollars a pound in democrat shit holes permalink parent award report block reply Krat 1 points 6 hours ago I've seen lean beef in Seattle at almost 20$ a pound. permalink parent award report block reply South_Florida_Guy 0 points 6 hours ago I'm going to start deep freezer storing hoards of it for future generations. permalink parent award report block reply 5DchessWatch 19 points 6 hours ago I don't want 50 yr mortgage I want 50 arrests of the deep staters involved in xfire hurricane/ russiagate/spygate, arctic frost, nimblewill and chancygambit and other projects they're up to that we don't know about yet permalink award report block reply Klaus73 4 points 6 hours ago Mind if I tag Epstien lister onto that? permalink parent award report block reply Appeal2Heaven98 4 points 6 hours ago Best I can do is have Bondi tell you it's on her desk. permalink parent award report block reply Drekken- 1 points 4 hours ago In a TV interview. If Trump could pick one good AG before his times up, that would be great. permalink parent award report block reply SanityGumby 0 points 5 hours ago Then don’t take one you retarded fuck permalink parent award report block reply henri_derelicte 11 points 6 hours ago I’m open to liquidating illegal immigrants as an alternative to deporting them if it’ll solve this problem faster. If anything, it’ll make self-deportation A LOT more attractive permalink award report block reply Throwingway22 9 points 5 hours ago A 50-year mortgage + reducing the use of credit scores in applicants would only expand the demand for houses without touching the supply. It would be another program to give inner-city joggers the ability to move next door in the suburb people moved to to get away from the crime and decay. Just absolute South Africanization of America. permalink award report block reply FatigueIsReal 2 points 5 hours ago Reducing the use of credit scores has been suggested? permalink parent award report block reply Porkbut 3 points 5 hours ago In propagandaland, yes permalink parent award report block reply Refugee1000 1 points 5 hours ago 100%, talk about DEI. What we need is to de regulate building. If someone wants to build a log cabin with nothing but a toilet in the corner fucking let them. Why is a 100 year old house legal to live in but a new one isn't unless you make an 3 foot wide door because someone who buys the house from you might be a gimp. And all the minimum square footage bs permalink parent award report block reply BillyBillington 8 points 6 hours ago We need cheaper houses. Not 50 years of interest payments to a fucking bank. permalink award report block reply VanDeKoik 1 points 5 hours ago And how do you get \"cheaper homes\"? Well wait... permalink parent award report block reply BillyBillington 2 points 3 hours ago Make it one bedroom. When is the last time you saw a new one bedroom home? permalink parent award report block reply VanDeKoik 1 points 2 hours ago A one-bedroom single-family house? Dude, go get a condo at that point. permalink parent award report block reply NutPsaki 1 points 3 hours ago Deporting all the illegals, which lowers demand. Econ 101. As demand drops, so do prices. permalink parent award report block reply VanDeKoik 1 points 2 hours ago If you think illegals are the crux of the demand, you are going to be in for a rude shock. permalink parent award report block reply 5DchessWatch 6 points 6 hours ago Best I can do is spraying cologne on an ex al queda guy running syria now permalink award report block reply TrumpPlay3dYouLoL 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply Illah88zillah 6 points 6 hours ago The nerve of anyone telling you this is good MAKE 15 YEAR MORTGAGES AFFORDABLE AGAIN. DEPORT BABY, DEPORT. permalink award report block reply FatigueIsReal 1 points 5 hours ago So let's say I'm selling my house. Why am I going to lower the price because of some deportations? permalink parent award report block reply VanDeKoik -1 points 5 hours ago Because dumbasses seriously think all of the homes are being bought by illegals. permalink parent award report block reply VanDeKoik 1 points 5 hours ago Ok. Well \"make it\". Magic wand wave it cheap!!!!! permalink parent award report block reply SanityGumby -5 points 5 hours ago The nerve of you being so low iq you don’t understand how it’s good or how this is a psyop you low iq fucks are falling into permalink parent award report block reply YodaBannon 5 points 6 hours ago ? deportations are happening, a 50 year mortgage is an option. tarded permalink award report block reply NADSAQ 7 points 6 hours ago this is AI slop permalink parent award report block reply YodaBannon 4 points 6 hours ago sloppy joe permalink parent award report block reply YouEssAye 3 points 5 hours ago deportations are happening On pace to deport about 2.5 million or 5% of 50 million over his 4 year term. They may be happening, but not to the extent that will actually tangibly improve the country. permalink parent award report block reply AVeryNakedMan 0 points 5 hours ago People don't want to admit that deporting all illegal aliens, while maintaining civil rights and the 4th amendment, is going to take a very long time. You can't just arrest every brown person you see, the way that Eisenhower did. There are tens of millions of Hispanics that are US citizens today. That was not the case back in the days of Operation Wetback. The best thing we can do is push Trump to arrest CEO's for hiring illegals. If that happens, the jobs for illegals will dry up, and self-deportations will skyrocket. permalink parent award report block reply Drekken- 3 points 3 hours ago They haven't even hit the Muslim community. I want them gone! No mosques. No prayer chants over loud speakers. No mayors or sharia law. What is happening? It isn't just Mexicans and South Americans. It's Anti-American pieces of shit that need to go... Now. permalink parent award report block reply AppalachianTactical 2 points 4 hours ago Trump is doing a 180 on filibuster, he is saying we need to import indians because americans arent smart enough, deportations arent happening at near the rate required and its nostly provocations to get violence so he xan pull a bush. If you cant see we are  being fucked you are blind. permalink parent award report block reply YodaBannon -1 points 3 hours ago shud up permalink parent award report block reply AppalachianTactical 3 points 3 hours ago Impressive rebuttal. Your lefty bf teach it to you? permalink parent award report block reply GA_Logic 1 points 6 hours ago You are correct on both points. permalink parent award report block reply keeman 4 points 4 hours ago I want the government out of the mortgage game entirely AND 50 million deportations. permalink award report block reply ErgonomicNomad 4 points 4 hours ago 15 year mortgage. Dave Ramsey. Tell your friends. Live within your means. permalink award report block reply IvIA6A 4 points 6 hours ago Housing so affordable you only need a 15 year mortgage. permalink award report block reply NADSAQ 4 points 6 hours ago ai slop permalink award report block reply ParadigmShift2070 3 points 6 hours ago Best I can do is 600k Chinese students permalink award report block reply Rock9Head 2 points 5 hours ago That would fix housing. permalink award report block reply 2Guns1ForEachofYa 2 points 5 hours ago Including H1Bs permalink award report block reply AppalachianTactical 2 points 4 hours ago AI because our side wont go out and protest Trump even though we should be. Trump on t.v. telling you he needs more indians because americans dont have the talent. Im starting to think he doesnt want american manufacture back. He wants chinese style manufacture in America. permalink award report block reply Emodius 2 points 6 hours ago You'll have both. permalink award report block reply cyberwar 2 points 6 hours ago why can't you have both? permalink award report block reply SanityGumby 2 points 5 hours ago What fucking retard stickied a psyop permalink award report block reply YouEssAye 4 points 5 hours ago Do you ever stop to think if you're the one that's fallen for a psyop and not everyone else? permalink parent award report block reply Buce-Nudo 1 points 5 hours ago Did you finish cleaning Charlie's blood off your hands yet? permalink parent award report block reply Porkbut 0 points 5 hours ago Do you? permalink parent award report block reply YouEssAye 0 points 5 hours ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 5 hours ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 6 more comments... chefjeffb 0 points 5 hours ago No, it's you faggots clamoring away about Trump turning his back to immigration efforts permalink parent award report block reply YouEssAye 2 points 5 hours ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -3 points 5 hours ago Show proof of that promise, assaye permalink parent award report block reply view 10 more comments... AppalachianTactical 1 points 3 hours ago I know you are dumb but Trumps little ice shows in vlue cities are soing fuck all.\nAll they do is set the stage for opportunities for ice agents ro die so trump can grab some george w style power to use elsewhere. Meanwhile Trump is on t.v. saying we need a million Indians to come here because americans arent smart enough to do the job. Ironically indians are rhe ones that fake degrees and have low af iqs. permalink parent award report block reply SanityGumby 0 points 4 hours ago I’m not the retard trying to compare two separate things or failing to understand how 50 year loans can be beneficial to the right buyer permalink parent award report block reply YouEssAye 0 points 4 hours ago 50 year loans will just make house prices increase. This helps bankers more than it helps Americans. I understand it's optional, but you understand most Americans are financially illiterate. Also these aren't two separate ideas, deporting 50 million would significantly lower housing costs, making 50 year mortgages totally unnecessary. permalink parent award report block reply SanityGumby 1 points 22 minutes ago No they won’t. That’s why we are deporting illegals. You people can’t hold more than one idea in your head at a time permalink parent award report block reply view 1 more comments... AppalachianTactical 0 points 4 hours ago No its a good message but its ai trash. We should be in the streets saying this for real. permalink parent award report block reply BillboDickens 2 points 2 hours ago Generational debt enslavement, or replaced by foreigners in your own country?  Trumps says, ‘perhaps both’ permalink award report block reply HeavenlyTrumpets 2 points 5 hours ago Yep permalink award report block reply 67Vert 1 points 5 hours ago I’m locked at 2.7%.  I’d take 50 yr am.  Interest only would be even better. permalink award report block reply DITTOPatriot 1 points 5 hours ago Good luck with that, unless you're one of the ones surrounding the administration, and it’s going to be a plus if you can promise a seaside resort. permalink award report block reply f_bastiat 1 points 2 hours ago I want thermonuclear warheads landing in densely populated Muslim countries, let's get this holy war on the road! permalink award report block reply NoMaskNoMaster 1 points 1 hour ago AI slop, but yes permalink award report block reply AcquittedZombieSlay 1 points 2 hours ago you're all pretty retarded, 50 year mortgage is a fantastic idea.  If ask to have it explained im not gonna bother because you're to retarded to understand allready. permalink award report block reply Flowers-By-Irene 1 points 6 hours ago Can sub for democrats if we run out of illegals. permalink award report block reply AlmostFullyDilated 1 points 3 hours ago it would be cheaper to give them 90 days to self deport and then sell game tags to hunt illegals permalink award report block reply VanDeKoik 1 points 5 hours ago Ok? Dont get one? And if you want 50 million deportations there are openings at ICE right now. permalink award report block reply bemac 1 points 5 hours ago AI shit permalink award report block reply Goatboy66 1 points 6 hours ago 50 million Deportations will definitely bring down the Cost of Housing. permalink award report block reply VanDeKoik 1 points 5 hours ago No it won't. permalink parent award report block reply DeltaSierra 1 points 6 hours ago The best is still - Black Sabbath Matters permalink award report block reply cciv 1 points 3 hours ago Why not both? permalink award report block reply SickOfNeoPolitics 1 points 1 hour ago I am past wanting deportations. I just want invaders to be be dealt with in the traditional manner. permalink award report block reply try4gain PRO 0 points 6 hours ago ALWAYS BE CHIMPING permalink award report block reply donteatthat 0 points 6 hours ago Well that's just too bad permalink award report block reply FatigueIsReal -1 points 5 hours ago Fucking retard level memes are getting stickied now? I guess we'll need to get the treasury employees to get off their ass and start deporting people. Geeze this is getting bad. permalink award report block reply Repentnow -4 points 6 hours ago Both is the correct answer. The 50 year mortgage hate is retarded. It just adds an additional option. You can still get what ever length mortgage you want. If you take a 50 year mortgage and make the same payment as a 15 year mortgage, you'll be paid off in 15 years with the exact same interest paid. The advantage of the 50yr is your minimum payment is much lower compared to a 15yr, so if you hit a financial snag anywhere during that 15 years, you could drop back to the lower minimum payment for a little while. permalink award report block reply Parhelion12 5 points 6 hours ago Oh cmon. That's just intellectually dishonest. Combing 50 year mtgs with the widespread financial illiteracy is an AUTOMATIC wealth transfer. permalink parent award report block reply FatigueIsReal 3 points 5 hours ago So when the 30 year mortgages were created, a wealth transfer happened? Japan and Switzerland offer 50 year mortgages.  Sweden has no limit and the average is 140 years. Japan has previously offered generational 100 year mortgages. Let me know how they're doing compared to the US. Hint: the problem might be darker and have nothing to do with the mortgage term length. permalink parent award report block reply Repentnow 1 points 5 hours ago If some people are too stupid to understand how mortgage and interest work, then they deserve whatever financial disaster befalls them. People are 100%  responsible for their own selves. permalink parent award report block reply Porkbut -1 points 5 hours ago Tell me youre a democrat without telling me. Your favorite show is the young turks. Say donor class. permalink parent award report block reply GA_Logic 2 points 6 hours ago Agreed. Dave Ramsey has said if you can't obtain a 15 year mortgage go with a 30 and just pay it off in 15 years. permalink parent award report block reply FatigueIsReal 3 points 5 hours ago I know many that have used this. The going strategy was to base it on interest.  High interest, get the higher year mortgage and when interest drops, refi for the 10 or 15 year mortgage. permalink parent award report block reply GA_Logic 1 points 5 hours ago This was very common in the 80s with interest sky high. permalink parent award report block reply berserkerbarrage -7 points 6 hours ago Then  don't take out a 50 year mortgage. They also said that they were working on making 5 and 15 year mortgages more available. Nobody is forcing you to do anything you don't want to, but other people will appreciate the options. We're deporting people as fast as legally possible and at much higher rates than previous administrations (turnaways =/= deportations). If it's not fast enough then maybe you should focus more on electing MAGA candidates to change the law and less on trying to help open borders Democrats win. For the anti-Trump trolls that will inevitably bot the shit out of this thread. permalink award report block reply Mamapedia 6 points 6 hours ago Every person who has legitimate criticisms of Trump's words and actions is not an anti-Trump troll. Blind adulation is for fools.  Thank you for the facts you outlined, but the last sentence conflates valid criticism and trolling. permalink parent award report block reply Porkbut -4 points 5 hours ago You dont have legitimate criticisms, you just claim you do while sperging over and over like a petulant child. permalink parent award report block reply Mamapedia 4 points 5 hours ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut -1 points 5 hours ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 4 more comments... berserkerbarrage -4 points 6 hours ago Where is the legitimate criticism? It's also just a fact that this site is being botted and brigaded by Nick Fuentes trolls. If you can't explain why offering people more mortgage options (on both ends of the spectrum) is a bad thing then it's not a legitimate criticism. If you're blaming Trump for the fact that more people aren't being deported (despite him deporting people as fast as legally possible), that's not legitimate criticism. If you're blaming Trump for high beef prices but you can't say how or why he's responsible for high beef prices, that's not a legitimate criticism. permalink parent award report block reply Mamapedia 1 points 6 hours ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 5 hours ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 6 hours ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments... deleted 0 points 4 hours ago TheDevilMonkey 2 points 6 hours ago 1 month old shill account. 👆👃 permalink parent award report block reply berserkerbarrage -4 points 6 hours ago And yet you're the one pushing fake news, anti-Trump narratives on a supposedly pro-Trump site. permalink parent award report block reply TheDevilMonkey 3 points 6 hours ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 6 hours ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 5 more comments... Repentnow -1 points 6 hours ago There's a few non-doomers left, but just like importing a minority of foreigners causes the locals to leave and then they take over — the agitators here are working hard at their goal to cause division and make us long-time residents of T_D leave. permalink parent award report block reply FatigueIsReal 1 points 5 hours ago There's only one rule that I want them to enforce. Be here for Trump and MAGA So many people shit on Trump without anything other than a regurgitation from some influencer out there. permalink parent award report block reply SanityGumby -1 points 5 hours ago I’m getting close if the mods are not going to enforce the literal fucking rules on the side panel. Worse yet one of them pinned this obvious psyop permalink parent award report block reply YouEssAye 1 points 5 hours ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply loktar00 2 points 4 hours ago Exactly my feelings, also been to rallies, protests after Jan 6th etc, this term there has yet to be anything where I'm like \"Hell yeah!\" like I was from the first term. Nothing that has positively affected me directly. H1Bs are still killing the industry I'm in, my pay hasn't gone up, I'm scared I'll lose my job any day now and good luck finding another the economy is complete shit right now, healthcare, car insurance, and basically everything else is still expensive af. No one has been arrested, no BTC strategic reserve, no Epstein files... First term we had some amazing big wins we all celebrated here that actually were passed onto us in our personal lives, not just symbolistic \"culture war\" wins that will be reversed the next time a Dem is in office. permalink parent award report block reply SanityGumby 0 points 4 hours ago No they haven’t permalink parent award report block reply view 1 more comments... SHILL_DETECTOR -2 points 6 hours ago the troll was when i said its 6 dollars a pound permalink parent award report block reply berserkerbarrage 2 points 6 hours ago Cool. Now explain how it's Trump fault. permalink parent award report block reply\nSHILL_DETECTOR 56 points 6 hours ago best i can do is 6 dollars a pound ground beef permalink award report block reply KekistanPM 34 points 6 hours ago Free if you're on EBT. permalink parent award report block reply Mamapedia 16 points 6 hours ago Eatin' good in the (neighbor)hood. permalink parent award report block reply Trump4prez 4 points 5 hours ago 60 million deportations permalink parent award report block reply kekranger 2 points 3 hours ago Right now I’d call what they’ve done so far show deportations. When the numbers get to be enough to actually start making an impact on things like housing and jobs that’s when we’ll know if they’re serious. When the chamber of commerce republicans start asking Trump to call off the dogs because it’s hurting their business. permalink parent award report block reply MarALigma 1 points 3 hours ago AI PROTEST IS HOW WE WIN permalink parent award report block reply Klaus73 3 points 6 hours ago Honestly things would be better if EBT was moved toward more raw production items like meats and vegetables as opposed to processed shit that just makes you useless and lethargic. permalink parent award report block reply SteveRogers42 7 points 6 hours ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 3 points 5 hours ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 5 hours ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply view 1 more comments... MissingTrump 1 points 5 hours ago Paid for by taxpayer dollars. Never free. Nothing is ever free. permalink parent award report block reply GuerillaYourDreams 17 points 6 hours ago Nearly $7 a pound, where I live right now. I've stopped buying beef. And I love beef. permalink parent award report block reply Yignuced 11 points 6 hours ago I’d stop paying my 50 year mortgage before I stop eating beef.  Priorities and all. permalink parent award report block reply IncredibleMrE1 4 points 6 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply Deport_O_Matic 4 points 4 hours ago The endgame is $7/lb bugs permalink parent award report block reply GuerillaYourDreams 2 points 6 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply RedStoneDeepState 3 points 6 hours ago I paid 3.86 for some 80/20 yesterday. permalink parent award report block reply SHILL_DETECTOR 0 points 6 hours ago where?  texas probably permalink parent award report block reply RedStoneDeepState 3 points 6 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 6 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments... keeman 1 points 4 hours ago Man, that is some cheap ground beef.  I have been seeing up to $8 around here. permalink parent award report block reply SHILL_DETECTOR 1 points 4 hours ago yea, it was a bait comment, my bad permalink parent award report block reply South_Florida_Guy 1 points 6 hours ago lol you beat me to a comment like this one permalink parent award report block reply load 4 more comments...\nKekistanPM 34 points 6 hours ago Free if you're on EBT. permalink parent award report block reply Mamapedia 16 points 6 hours ago Eatin' good in the (neighbor)hood. permalink parent award report block reply Trump4prez 4 points 5 hours ago 60 million deportations permalink parent award report block reply kekranger 2 points 3 hours ago Right now I’d call what they’ve done so far show deportations. When the numbers get to be enough to actually start making an impact on things like housing and jobs that’s when we’ll know if they’re serious. When the chamber of commerce republicans start asking Trump to call off the dogs because it’s hurting their business. permalink parent award report block reply MarALigma 1 points 3 hours ago AI PROTEST IS HOW WE WIN permalink parent award report block reply Klaus73 3 points 6 hours ago Honestly things would be better if EBT was moved toward more raw production items like meats and vegetables as opposed to processed shit that just makes you useless and lethargic. permalink parent award report block reply SteveRogers42 7 points 6 hours ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 3 points 5 hours ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 5 hours ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply view 1 more comments... MissingTrump 1 points 5 hours ago Paid for by taxpayer dollars. Never free. Nothing is ever free. permalink parent award report block reply\nMamapedia 16 points 6 hours ago Eatin' good in the (neighbor)hood. permalink parent award report block reply Trump4prez 4 points 5 hours ago 60 million deportations permalink parent award report block reply kekranger 2 points 3 hours ago Right now I’d call what they’ve done so far show deportations. When the numbers get to be enough to actually start making an impact on things like housing and jobs that’s when we’ll know if they’re serious. When the chamber of commerce republicans start asking Trump to call off the dogs because it’s hurting their business. permalink parent award report block reply MarALigma 1 points 3 hours ago AI PROTEST IS HOW WE WIN permalink parent award report block reply\nTrump4prez 4 points 5 hours ago 60 million deportations permalink parent award report block reply kekranger 2 points 3 hours ago Right now I’d call what they’ve done so far show deportations. When the numbers get to be enough to actually start making an impact on things like housing and jobs that’s when we’ll know if they’re serious. When the chamber of commerce republicans start asking Trump to call off the dogs because it’s hurting their business. permalink parent award report block reply MarALigma 1 points 3 hours ago AI PROTEST IS HOW WE WIN permalink parent award report block reply\nkekranger 2 points 3 hours ago Right now I’d call what they’ve done so far show deportations. When the numbers get to be enough to actually start making an impact on things like housing and jobs that’s when we’ll know if they’re serious. When the chamber of commerce republicans start asking Trump to call off the dogs because it’s hurting their business. permalink parent award report block reply\nMarALigma 1 points 3 hours ago AI PROTEST IS HOW WE WIN permalink parent award report block reply\nKlaus73 3 points 6 hours ago Honestly things would be better if EBT was moved toward more raw production items like meats and vegetables as opposed to processed shit that just makes you useless and lethargic. permalink parent award report block reply SteveRogers42 7 points 6 hours ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 3 points 5 hours ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 5 hours ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply view 1 more comments...\nSteveRogers42 7 points 6 hours ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 3 points 5 hours ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 5 hours ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply view 1 more comments...\nRefugee1000 3 points 5 hours ago Was just about to say this lol permalink parent award report block reply\nKlaus73 2 points 5 hours ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply view 1 more comments...\nMissingTrump 1 points 5 hours ago Paid for by taxpayer dollars. Never free. Nothing is ever free. permalink parent award report block reply\nGuerillaYourDreams 17 points 6 hours ago Nearly $7 a pound, where I live right now. I've stopped buying beef. And I love beef. permalink parent award report block reply Yignuced 11 points 6 hours ago I’d stop paying my 50 year mortgage before I stop eating beef.  Priorities and all. permalink parent award report block reply IncredibleMrE1 4 points 6 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply Deport_O_Matic 4 points 4 hours ago The endgame is $7/lb bugs permalink parent award report block reply GuerillaYourDreams 2 points 6 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply\nYignuced 11 points 6 hours ago I’d stop paying my 50 year mortgage before I stop eating beef.  Priorities and all. permalink parent award report block reply IncredibleMrE1 4 points 6 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply Deport_O_Matic 4 points 4 hours ago The endgame is $7/lb bugs permalink parent award report block reply GuerillaYourDreams 2 points 6 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply\nIncredibleMrE1 4 points 6 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply Deport_O_Matic 4 points 4 hours ago The endgame is $7/lb bugs permalink parent award report block reply\nDeport_O_Matic 4 points 4 hours ago The endgame is $7/lb bugs permalink parent award report block reply\nGuerillaYourDreams 2 points 6 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply\nRedStoneDeepState 3 points 6 hours ago I paid 3.86 for some 80/20 yesterday. permalink parent award report block reply SHILL_DETECTOR 0 points 6 hours ago where?  texas probably permalink parent award report block reply RedStoneDeepState 3 points 6 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 6 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments...\nSHILL_DETECTOR 0 points 6 hours ago where?  texas probably permalink parent award report block reply RedStoneDeepState 3 points 6 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 6 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments...\nRedStoneDeepState 3 points 6 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 6 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments...\nSHILL_DETECTOR 0 points 6 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments...\nkeeman 1 points 4 hours ago Man, that is some cheap ground beef.  I have been seeing up to $8 around here. permalink parent award report block reply SHILL_DETECTOR 1 points 4 hours ago yea, it was a bait comment, my bad permalink parent award report block reply\nSHILL_DETECTOR 1 points 4 hours ago yea, it was a bait comment, my bad permalink parent award report block reply\nSouth_Florida_Guy 1 points 6 hours ago lol you beat me to a comment like this one permalink parent award report block reply\nbejeavis 29 points 6 hours ago Sorry you don't have enough talent for that permalink award report block reply Viewer01 27 points 6 hours ago Trump has flipped 180 on immigration and is now willing to finish the dilution of whites to minority status. This is an obvious attempt to negate right wingers who were growing critical of Israel. Boomers would sooner sell this country to foreigners than give up on their Zionism. Which is all very ironic because it’s exactly how Weimar played out and will certainly mean the death of the grand ole party. I absolutely will not vote for losers in ‘26 without some massive wins and apologies. permalink parent award report block reply happyfave 3 points 6 hours ago How is he flipped 180 on immigration That is the stupidest take I've heard all day permalink parent award report block reply AVeryNakedMan 7 points 5 hours ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 6 points 5 hours ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 3 more comments... AppalachianTactical 5 points 4 hours ago You are either a bot or retarded boomer or jeet. He is flipping 180 on everything.\nLiterally the rich versuon of the dems \"americans wont do thebwork argument\" but \"amerucans cant do the work.\" permalink parent award report block reply TheMrStone 1 points 6 minutes ago Call me a conspiracy theorist if you wish, but I am beginning to think there was a backroom deal where Trump would be allowed to win the 2024 election, but he had to do his level best to keep the status quo, and/or actively destroy the Republican Party. This filibuster elimination idea of his wreaks of intentional self-sabotage. Then there's the fact he has decided to call the whole Epstein debacle a hoax, looking as guilty as sin to impartial onlookers. It's bad all the way down. permalink parent award report block reply Viewer01 1 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply SanityGumby 3 points 5 hours ago He literally hasn’t permalink parent award report block reply Viewer01 3 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply Appeal2Heaven98 1 points 6 hours ago His drastic change in position on immigration is what's alarmed me the most. Has he given up? Or is he compromised? permalink parent award report block reply Fine_Kentucky_Jenkum 1 points 6 hours ago It’s almost as if he is an actor that could play a specific part on a TV role or something… who could have foreseen this? permalink parent award report block reply mohel -1 points 6 hours ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 5 hours ago lul permalink parent award report block reply try4gain PRO 1 points 5 hours ago he had one bad interview calm your tits permalink parent award report block reply Viewer01 1 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply load 1 more comments... mohel 1 points 6 hours ago Are we going to find out what 2A was meant for? permalink parent award report block reply HunterBidensPC 1 points 6 hours ago We already know what it’s for. Hit the fed needs a nice reminder permalink parent award report block reply xXCrusadyrXx 1 points 3 hours ago Never. Nothing but cowards and pussies in this once great nation. americans will have well earned their communism. permalink parent award report block reply Buce-Nudo 1 points 5 hours ago He didn't say that. Watch the clip. permalink parent award report block reply bejeavis 3 points 4 hours ago I did, hence the comment. Maybe you should. permalink parent award report block reply\nViewer01 27 points 6 hours ago Trump has flipped 180 on immigration and is now willing to finish the dilution of whites to minority status. This is an obvious attempt to negate right wingers who were growing critical of Israel. Boomers would sooner sell this country to foreigners than give up on their Zionism. Which is all very ironic because it’s exactly how Weimar played out and will certainly mean the death of the grand ole party. I absolutely will not vote for losers in ‘26 without some massive wins and apologies. permalink parent award report block reply happyfave 3 points 6 hours ago How is he flipped 180 on immigration That is the stupidest take I've heard all day permalink parent award report block reply AVeryNakedMan 7 points 5 hours ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 6 points 5 hours ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 3 more comments... AppalachianTactical 5 points 4 hours ago You are either a bot or retarded boomer or jeet. He is flipping 180 on everything.\nLiterally the rich versuon of the dems \"americans wont do thebwork argument\" but \"amerucans cant do the work.\" permalink parent award report block reply TheMrStone 1 points 6 minutes ago Call me a conspiracy theorist if you wish, but I am beginning to think there was a backroom deal where Trump would be allowed to win the 2024 election, but he had to do his level best to keep the status quo, and/or actively destroy the Republican Party. This filibuster elimination idea of his wreaks of intentional self-sabotage. Then there's the fact he has decided to call the whole Epstein debacle a hoax, looking as guilty as sin to impartial onlookers. It's bad all the way down. permalink parent award report block reply Viewer01 1 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply SanityGumby 3 points 5 hours ago He literally hasn’t permalink parent award report block reply Viewer01 3 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply Appeal2Heaven98 1 points 6 hours ago His drastic change in position on immigration is what's alarmed me the most. Has he given up? Or is he compromised? permalink parent award report block reply Fine_Kentucky_Jenkum 1 points 6 hours ago It’s almost as if he is an actor that could play a specific part on a TV role or something… who could have foreseen this? permalink parent award report block reply mohel -1 points 6 hours ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 5 hours ago lul permalink parent award report block reply try4gain PRO 1 points 5 hours ago he had one bad interview calm your tits permalink parent award report block reply Viewer01 1 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply load 1 more comments...\nhappyfave 3 points 6 hours ago How is he flipped 180 on immigration That is the stupidest take I've heard all day permalink parent award report block reply AVeryNakedMan 7 points 5 hours ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 6 points 5 hours ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 3 more comments... AppalachianTactical 5 points 4 hours ago You are either a bot or retarded boomer or jeet. He is flipping 180 on everything.\nLiterally the rich versuon of the dems \"americans wont do thebwork argument\" but \"amerucans cant do the work.\" permalink parent award report block reply TheMrStone 1 points 6 minutes ago Call me a conspiracy theorist if you wish, but I am beginning to think there was a backroom deal where Trump would be allowed to win the 2024 election, but he had to do his level best to keep the status quo, and/or actively destroy the Republican Party. This filibuster elimination idea of his wreaks of intentional self-sabotage. Then there's the fact he has decided to call the whole Epstein debacle a hoax, looking as guilty as sin to impartial onlookers. It's bad all the way down. permalink parent award report block reply Viewer01 1 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply\nAVeryNakedMan 7 points 5 hours ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 6 points 5 hours ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 3 more comments...\nMakeCaliforniaRED 6 points 5 hours ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 3 more comments...\nAppalachianTactical 5 points 4 hours ago You are either a bot or retarded boomer or jeet. He is flipping 180 on everything.\nLiterally the rich versuon of the dems \"americans wont do thebwork argument\" but \"amerucans cant do the work.\" permalink parent award report block reply TheMrStone 1 points 6 minutes ago Call me a conspiracy theorist if you wish, but I am beginning to think there was a backroom deal where Trump would be allowed to win the 2024 election, but he had to do his level best to keep the status quo, and/or actively destroy the Republican Party. This filibuster elimination idea of his wreaks of intentional self-sabotage. Then there's the fact he has decided to call the whole Epstein debacle a hoax, looking as guilty as sin to impartial onlookers. It's bad all the way down. permalink parent award report block reply\nTheMrStone 1 points 6 minutes ago Call me a conspiracy theorist if you wish, but I am beginning to think there was a backroom deal where Trump would be allowed to win the 2024 election, but he had to do his level best to keep the status quo, and/or actively destroy the Republican Party. This filibuster elimination idea of his wreaks of intentional self-sabotage. Then there's the fact he has decided to call the whole Epstein debacle a hoax, looking as guilty as sin to impartial onlookers. It's bad all the way down. permalink parent award report block reply\nViewer01 1 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply\nSanityGumby 3 points 5 hours ago He literally hasn’t permalink parent award report block reply Viewer01 3 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply\nViewer01 3 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply\nAppeal2Heaven98 1 points 6 hours ago His drastic change in position on immigration is what's alarmed me the most. Has he given up? Or is he compromised? permalink parent award report block reply\nFine_Kentucky_Jenkum 1 points 6 hours ago It’s almost as if he is an actor that could play a specific part on a TV role or something… who could have foreseen this? permalink parent award report block reply mohel -1 points 6 hours ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 5 hours ago lul permalink parent award report block reply\nmohel -1 points 6 hours ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 5 hours ago lul permalink parent award report block reply\nPissJuggernaut 1 points 5 hours ago lul permalink parent award report block reply\ntry4gain PRO 1 points 5 hours ago he had one bad interview calm your tits permalink parent award report block reply Viewer01 1 points 4 hours ago https://dailycallernewsfoundation.org/2025/11/12/kristi-noem-brags-that-more-foreigners-are-becoming-citizens-than-ever-before/ permalink parent award report block reply\nmohel 1 points 6 hours ago Are we going to find out what 2A was meant for? permalink parent award report block reply HunterBidensPC 1 points 6 hours ago We already know what it’s for. Hit the fed needs a nice reminder permalink parent award report block reply xXCrusadyrXx 1 points 3 hours ago Never. Nothing but cowards and pussies in this once great nation. americans will have well earned their communism. permalink parent award report block reply\nHunterBidensPC 1 points 6 hours ago We already know what it’s for. Hit the fed needs a nice reminder permalink parent award report block reply\nxXCrusadyrXx 1 points 3 hours ago Never. Nothing but cowards and pussies in this once great nation. americans will have well earned their communism. permalink parent award report block reply\nBuce-Nudo 1 points 5 hours ago He didn't say that. Watch the clip. permalink parent award report block reply bejeavis 3 points 4 hours ago I did, hence the comment. Maybe you should. permalink parent award report block reply\nbejeavis 3 points 4 hours ago I did, hence the comment. Maybe you should. permalink parent award report block reply\nSouth_Florida_Guy 20 points 6 hours ago Best I can do is no more pennies permalink award report block reply SHILL_DETECTOR 6 points 6 hours ago thats a better one mines kind of a bait because ground beef is actually more like 8 dollars a pound and people will come in and say its actually 10 dollars a pound in democrat shit holes permalink parent award report block reply Krat 1 points 6 hours ago I've seen lean beef in Seattle at almost 20$ a pound. permalink parent award report block reply South_Florida_Guy 0 points 6 hours ago I'm going to start deep freezer storing hoards of it for future generations. permalink parent award report block reply\nSHILL_DETECTOR 6 points 6 hours ago thats a better one mines kind of a bait because ground beef is actually more like 8 dollars a pound and people will come in and say its actually 10 dollars a pound in democrat shit holes permalink parent award report block reply Krat 1 points 6 hours ago I've seen lean beef in Seattle at almost 20$ a pound. permalink parent award report block reply South_Florida_Guy 0 points 6 hours ago I'm going to start deep freezer storing hoards of it for future generations. permalink parent award report block reply\nKrat 1 points 6 hours ago I've seen lean beef in Seattle at almost 20$ a pound. permalink parent award report block reply\nSouth_Florida_Guy 0 points 6 hours ago I'm going to start deep freezer storing hoards of it for future generations. permalink parent award report block reply\n5DchessWatch 19 points 6 hours ago I don't want 50 yr mortgage I want 50 arrests of the deep staters involved in xfire hurricane/ russiagate/spygate, arctic frost, nimblewill and chancygambit and other projects they're up to that we don't know about yet permalink award report block reply Klaus73 4 points 6 hours ago Mind if I tag Epstien lister onto that? permalink parent award report block reply Appeal2Heaven98 4 points 6 hours ago Best I can do is have Bondi tell you it's on her desk. permalink parent award report block reply Drekken- 1 points 4 hours ago In a TV interview. If Trump could pick one good AG before his times up, that would be great. permalink parent award report block reply SanityGumby 0 points 5 hours ago Then don’t take one you retarded fuck permalink parent award report block reply\nKlaus73 4 points 6 hours ago Mind if I tag Epstien lister onto that? permalink parent award report block reply\nAppeal2Heaven98 4 points 6 hours ago Best I can do is have Bondi tell you it's on her desk. permalink parent award report block reply Drekken- 1 points 4 hours ago In a TV interview. If Trump could pick one good AG before his times up, that would be great. permalink parent award report block reply\nDrekken- 1 points 4 hours ago In a TV interview. If Trump could pick one good AG before his times up, that would be great. permalink parent award report block reply\nSanityGumby 0 points 5 hours ago Then don’t take one you retarded fuck permalink parent award report block reply\nhenri_derelicte 11 points 6 hours ago I’m open to liquidating illegal immigrants as an alternative to deporting them if it’ll solve this problem faster. If anything, it’ll make self-deportation A LOT more attractive permalink award report block reply\nThrowingway22 9 points 5 hours ago A 50-year mortgage + reducing the use of credit scores in applicants would only expand the demand for houses without touching the supply. It would be another program to give inner-city joggers the ability to move next door in the suburb people moved to to get away from the crime and decay. Just absolute South Africanization of America. permalink award report block reply FatigueIsReal 2 points 5 hours ago Reducing the use of credit scores has been suggested? permalink parent award report block reply Porkbut 3 points 5 hours ago In propagandaland, yes permalink parent award report block reply Refugee1000 1 points 5 hours ago 100%, talk about DEI. What we need is to de regulate building. If someone wants to build a log cabin with nothing but a toilet in the corner fucking let them. Why is a 100 year old house legal to live in but a new one isn't unless you make an 3 foot wide door because someone who buys the house from you might be a gimp. And all the minimum square footage bs permalink parent award report block reply\nFatigueIsReal 2 points 5 hours ago Reducing the use of credit scores has been suggested? permalink parent award report block reply Porkbut 3 points 5 hours ago In propagandaland, yes permalink parent award report block reply\nPorkbut 3 points 5 hours ago In propagandaland, yes permalink parent award report block reply\nRefugee1000 1 points 5 hours ago 100%, talk about DEI. What we need is to de regulate building. If someone wants to build a log cabin with nothing but a toilet in the corner fucking let them. Why is a 100 year old house legal to live in but a new one isn't unless you make an 3 foot wide door because someone who buys the house from you might be a gimp. And all the minimum square footage bs permalink parent award report block reply\nBillyBillington 8 points 6 hours ago We need cheaper houses. Not 50 years of interest payments to a fucking bank. permalink award report block reply VanDeKoik 1 points 5 hours ago And how do you get \"cheaper homes\"? Well wait... permalink parent award report block reply BillyBillington 2 points 3 hours ago Make it one bedroom. When is the last time you saw a new one bedroom home? permalink parent award report block reply VanDeKoik 1 points 2 hours ago A one-bedroom single-family house? Dude, go get a condo at that point. permalink parent award report block reply NutPsaki 1 points 3 hours ago Deporting all the illegals, which lowers demand. Econ 101. As demand drops, so do prices. permalink parent award report block reply VanDeKoik 1 points 2 hours ago If you think illegals are the crux of the demand, you are going to be in for a rude shock. permalink parent award report block reply\nVanDeKoik 1 points 5 hours ago And how do you get \"cheaper homes\"? Well wait... permalink parent award report block reply BillyBillington 2 points 3 hours ago Make it one bedroom. When is the last time you saw a new one bedroom home? permalink parent award report block reply VanDeKoik 1 points 2 hours ago A one-bedroom single-family house? Dude, go get a condo at that point. permalink parent award report block reply NutPsaki 1 points 3 hours ago Deporting all the illegals, which lowers demand. Econ 101. As demand drops, so do prices. permalink parent award report block reply VanDeKoik 1 points 2 hours ago If you think illegals are the crux of the demand, you are going to be in for a rude shock. permalink parent award report block reply\nBillyBillington 2 points 3 hours ago Make it one bedroom. When is the last time you saw a new one bedroom home? permalink parent award report block reply VanDeKoik 1 points 2 hours ago A one-bedroom single-family house? Dude, go get a condo at that point. permalink parent award report block reply\nVanDeKoik 1 points 2 hours ago A one-bedroom single-family house? Dude, go get a condo at that point. permalink parent award report block reply\nNutPsaki 1 points 3 hours ago Deporting all the illegals, which lowers demand. Econ 101. As demand drops, so do prices. permalink parent award report block reply VanDeKoik 1 points 2 hours ago If you think illegals are the crux of the demand, you are going to be in for a rude shock. permalink parent award report block reply\nVanDeKoik 1 points 2 hours ago If you think illegals are the crux of the demand, you are going to be in for a rude shock. permalink parent award report block reply\n5DchessWatch 6 points 6 hours ago Best I can do is spraying cologne on an ex al queda guy running syria now permalink award report block reply TrumpPlay3dYouLoL 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply\nTrumpPlay3dYouLoL 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply\nIllah88zillah 6 points 6 hours ago The nerve of anyone telling you this is good MAKE 15 YEAR MORTGAGES AFFORDABLE AGAIN. DEPORT BABY, DEPORT. permalink award report block reply FatigueIsReal 1 points 5 hours ago So let's say I'm selling my house. Why am I going to lower the price because of some deportations? permalink parent award report block reply VanDeKoik -1 points 5 hours ago Because dumbasses seriously think all of the homes are being bought by illegals. permalink parent award report block reply VanDeKoik 1 points 5 hours ago Ok. Well \"make it\". Magic wand wave it cheap!!!!! permalink parent award report block reply SanityGumby -5 points 5 hours ago The nerve of you being so low iq you don’t understand how it’s good or how this is a psyop you low iq fucks are falling into permalink parent award report block reply\nFatigueIsReal 1 points 5 hours ago So let's say I'm selling my house. Why am I going to lower the price because of some deportations? permalink parent award report block reply VanDeKoik -1 points 5 hours ago Because dumbasses seriously think all of the homes are being bought by illegals. permalink parent award report block reply\nVanDeKoik -1 points 5 hours ago Because dumbasses seriously think all of the homes are being bought by illegals. permalink parent award report block reply\nVanDeKoik 1 points 5 hours ago Ok. Well \"make it\". Magic wand wave it cheap!!!!! permalink parent award report block reply\nSanityGumby -5 points 5 hours ago The nerve of you being so low iq you don’t understand how it’s good or how this is a psyop you low iq fucks are falling into permalink parent award report block reply\nYodaBannon 5 points 6 hours ago ? deportations are happening, a 50 year mortgage is an option. tarded permalink award report block reply NADSAQ 7 points 6 hours ago this is AI slop permalink parent award report block reply YodaBannon 4 points 6 hours ago sloppy joe permalink parent award report block reply YouEssAye 3 points 5 hours ago deportations are happening On pace to deport about 2.5 million or 5% of 50 million over his 4 year term. They may be happening, but not to the extent that will actually tangibly improve the country. permalink parent award report block reply AVeryNakedMan 0 points 5 hours ago People don't want to admit that deporting all illegal aliens, while maintaining civil rights and the 4th amendment, is going to take a very long time. You can't just arrest every brown person you see, the way that Eisenhower did. There are tens of millions of Hispanics that are US citizens today. That was not the case back in the days of Operation Wetback. The best thing we can do is push Trump to arrest CEO's for hiring illegals. If that happens, the jobs for illegals will dry up, and self-deportations will skyrocket. permalink parent award report block reply Drekken- 3 points 3 hours ago They haven't even hit the Muslim community. I want them gone! No mosques. No prayer chants over loud speakers. No mayors or sharia law. What is happening? It isn't just Mexicans and South Americans. It's Anti-American pieces of shit that need to go... Now. permalink parent award report block reply AppalachianTactical 2 points 4 hours ago Trump is doing a 180 on filibuster, he is saying we need to import indians because americans arent smart enough, deportations arent happening at near the rate required and its nostly provocations to get violence so he xan pull a bush. If you cant see we are  being fucked you are blind. permalink parent award report block reply YodaBannon -1 points 3 hours ago shud up permalink parent award report block reply AppalachianTactical 3 points 3 hours ago Impressive rebuttal. Your lefty bf teach it to you? permalink parent award report block reply GA_Logic 1 points 6 hours ago You are correct on both points. permalink parent award report block reply\nNADSAQ 7 points 6 hours ago this is AI slop permalink parent award report block reply YodaBannon 4 points 6 hours ago sloppy joe permalink parent award report block reply\nYodaBannon 4 points 6 hours ago sloppy joe permalink parent award report block reply\nYouEssAye 3 points 5 hours ago deportations are happening On pace to deport about 2.5 million or 5% of 50 million over his 4 year term. They may be happening, but not to the extent that will actually tangibly improve the country. permalink parent award report block reply AVeryNakedMan 0 points 5 hours ago People don't want to admit that deporting all illegal aliens, while maintaining civil rights and the 4th amendment, is going to take a very long time. You can't just arrest every brown person you see, the way that Eisenhower did. There are tens of millions of Hispanics that are US citizens today. That was not the case back in the days of Operation Wetback. The best thing we can do is push Trump to arrest CEO's for hiring illegals. If that happens, the jobs for illegals will dry up, and self-deportations will skyrocket. permalink parent award report block reply Drekken- 3 points 3 hours ago They haven't even hit the Muslim community. I want them gone! No mosques. No prayer chants over loud speakers. No mayors or sharia law. What is happening? It isn't just Mexicans and South Americans. It's Anti-American pieces of shit that need to go... Now. permalink parent award report block reply\nAVeryNakedMan 0 points 5 hours ago People don't want to admit that deporting all illegal aliens, while maintaining civil rights and the 4th amendment, is going to take a very long time. You can't just arrest every brown person you see, the way that Eisenhower did. There are tens of millions of Hispanics that are US citizens today. That was not the case back in the days of Operation Wetback. The best thing we can do is push Trump to arrest CEO's for hiring illegals. If that happens, the jobs for illegals will dry up, and self-deportations will skyrocket. permalink parent award report block reply Drekken- 3 points 3 hours ago They haven't even hit the Muslim community. I want them gone! No mosques. No prayer chants over loud speakers. No mayors or sharia law. What is happening? It isn't just Mexicans and South Americans. It's Anti-American pieces of shit that need to go... Now. permalink parent award report block reply\nDrekken- 3 points 3 hours ago They haven't even hit the Muslim community. I want them gone! No mosques. No prayer chants over loud speakers. No mayors or sharia law. What is happening? It isn't just Mexicans and South Americans. It's Anti-American pieces of shit that need to go... Now. permalink parent award report block reply\nAppalachianTactical 2 points 4 hours ago Trump is doing a 180 on filibuster, he is saying we need to import indians because americans arent smart enough, deportations arent happening at near the rate required and its nostly provocations to get violence so he xan pull a bush. If you cant see we are  being fucked you are blind. permalink parent award report block reply YodaBannon -1 points 3 hours ago shud up permalink parent award report block reply AppalachianTactical 3 points 3 hours ago Impressive rebuttal. Your lefty bf teach it to you? permalink parent award report block reply\nYodaBannon -1 points 3 hours ago shud up permalink parent award report block reply AppalachianTactical 3 points 3 hours ago Impressive rebuttal. Your lefty bf teach it to you? permalink parent award report block reply\nAppalachianTactical 3 points 3 hours ago Impressive rebuttal. Your lefty bf teach it to you? permalink parent award report block reply\nGA_Logic 1 points 6 hours ago You are correct on both points. permalink parent award report block reply\nkeeman 4 points 4 hours ago I want the government out of the mortgage game entirely AND 50 million deportations. permalink award report block reply\nErgonomicNomad 4 points 4 hours ago 15 year mortgage. Dave Ramsey. Tell your friends. Live within your means. permalink award report block reply\nIvIA6A 4 points 6 hours ago Housing so affordable you only need a 15 year mortgage. permalink award report block reply\nNADSAQ 4 points 6 hours ago ai slop permalink award report block reply\nParadigmShift2070 3 points 6 hours ago Best I can do is 600k Chinese students permalink award report block reply\nRock9Head 2 points 5 hours ago That would fix housing. permalink award report block reply\n2Guns1ForEachofYa 2 points 5 hours ago Including H1Bs permalink award report block reply\nAppalachianTactical 2 points 4 hours ago AI because our side wont go out and protest Trump even though we should be. Trump on t.v. telling you he needs more indians because americans dont have the talent. Im starting to think he doesnt want american manufacture back. He wants chinese style manufacture in America. permalink award report block reply\nEmodius 2 points 6 hours ago You'll have both. permalink award report block reply\ncyberwar 2 points 6 hours ago why can't you have both? permalink award report block reply\nSanityGumby 2 points 5 hours ago What fucking retard stickied a psyop permalink award report block reply YouEssAye 4 points 5 hours ago Do you ever stop to think if you're the one that's fallen for a psyop and not everyone else? permalink parent award report block reply Buce-Nudo 1 points 5 hours ago Did you finish cleaning Charlie's blood off your hands yet? permalink parent award report block reply Porkbut 0 points 5 hours ago Do you? permalink parent award report block reply YouEssAye 0 points 5 hours ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 5 hours ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 6 more comments... chefjeffb 0 points 5 hours ago No, it's you faggots clamoring away about Trump turning his back to immigration efforts permalink parent award report block reply YouEssAye 2 points 5 hours ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -3 points 5 hours ago Show proof of that promise, assaye permalink parent award report block reply view 10 more comments... AppalachianTactical 1 points 3 hours ago I know you are dumb but Trumps little ice shows in vlue cities are soing fuck all.\nAll they do is set the stage for opportunities for ice agents ro die so trump can grab some george w style power to use elsewhere. Meanwhile Trump is on t.v. saying we need a million Indians to come here because americans arent smart enough to do the job. Ironically indians are rhe ones that fake degrees and have low af iqs. permalink parent award report block reply SanityGumby 0 points 4 hours ago I’m not the retard trying to compare two separate things or failing to understand how 50 year loans can be beneficial to the right buyer permalink parent award report block reply YouEssAye 0 points 4 hours ago 50 year loans will just make house prices increase. This helps bankers more than it helps Americans. I understand it's optional, but you understand most Americans are financially illiterate. Also these aren't two separate ideas, deporting 50 million would significantly lower housing costs, making 50 year mortgages totally unnecessary. permalink parent award report block reply SanityGumby 1 points 22 minutes ago No they won’t. That’s why we are deporting illegals. You people can’t hold more than one idea in your head at a time permalink parent award report block reply view 1 more comments... AppalachianTactical 0 points 4 hours ago No its a good message but its ai trash. We should be in the streets saying this for real. permalink parent award report block reply\nYouEssAye 4 points 5 hours ago Do you ever stop to think if you're the one that's fallen for a psyop and not everyone else? permalink parent award report block reply Buce-Nudo 1 points 5 hours ago Did you finish cleaning Charlie's blood off your hands yet? permalink parent award report block reply Porkbut 0 points 5 hours ago Do you? permalink parent award report block reply YouEssAye 0 points 5 hours ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 5 hours ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 6 more comments... chefjeffb 0 points 5 hours ago No, it's you faggots clamoring away about Trump turning his back to immigration efforts permalink parent award report block reply YouEssAye 2 points 5 hours ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -3 points 5 hours ago Show proof of that promise, assaye permalink parent award report block reply view 10 more comments... AppalachianTactical 1 points 3 hours ago I know you are dumb but Trumps little ice shows in vlue cities are soing fuck all.\nAll they do is set the stage for opportunities for ice agents ro die so trump can grab some george w style power to use elsewhere. Meanwhile Trump is on t.v. saying we need a million Indians to come here because americans arent smart enough to do the job. Ironically indians are rhe ones that fake degrees and have low af iqs. permalink parent award report block reply SanityGumby 0 points 4 hours ago I’m not the retard trying to compare two separate things or failing to understand how 50 year loans can be beneficial to the right buyer permalink parent award report block reply YouEssAye 0 points 4 hours ago 50 year loans will just make house prices increase. This helps bankers more than it helps Americans. I understand it's optional, but you understand most Americans are financially illiterate. Also these aren't two separate ideas, deporting 50 million would significantly lower housing costs, making 50 year mortgages totally unnecessary. permalink parent award report block reply SanityGumby 1 points 22 minutes ago No they won’t. That’s why we are deporting illegals. You people can’t hold more than one idea in your head at a time permalink parent award report block reply view 1 more comments...\nBuce-Nudo 1 points 5 hours ago Did you finish cleaning Charlie's blood off your hands yet? permalink parent award report block reply\nPorkbut 0 points 5 hours ago Do you? permalink parent award report block reply YouEssAye 0 points 5 hours ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 5 hours ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 6 more comments...\nYouEssAye 0 points 5 hours ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 5 hours ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 6 more comments...\nPorkbut -1 points 5 hours ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 6 more comments...\nchefjeffb 0 points 5 hours ago No, it's you faggots clamoring away about Trump turning his back to immigration efforts permalink parent award report block reply YouEssAye 2 points 5 hours ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -3 points 5 hours ago Show proof of that promise, assaye permalink parent award report block reply view 10 more comments... AppalachianTactical 1 points 3 hours ago I know you are dumb but Trumps little ice shows in vlue cities are soing fuck all.\nAll they do is set the stage for opportunities for ice agents ro die so trump can grab some george w style power to use elsewhere. Meanwhile Trump is on t.v. saying we need a million Indians to come here because americans arent smart enough to do the job. Ironically indians are rhe ones that fake degrees and have low af iqs. permalink parent award report block reply\nYouEssAye 2 points 5 hours ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -3 points 5 hours ago Show proof of that promise, assaye permalink parent award report block reply view 10 more comments...\nPorkbut -3 points 5 hours ago Show proof of that promise, assaye permalink parent award report block reply view 10 more comments...\nAppalachianTactical 1 points 3 hours ago I know you are dumb but Trumps little ice shows in vlue cities are soing fuck all.\nSanityGumby 0 points 4 hours ago I’m not the retard trying to compare two separate things or failing to understand how 50 year loans can be beneficial to the right buyer permalink parent award report block reply YouEssAye 0 points 4 hours ago 50 year loans will just make house prices increase. This helps bankers more than it helps Americans. I understand it's optional, but you understand most Americans are financially illiterate. Also these aren't two separate ideas, deporting 50 million would significantly lower housing costs, making 50 year mortgages totally unnecessary. permalink parent award report block reply SanityGumby 1 points 22 minutes ago No they won’t. That’s why we are deporting illegals. You people can’t hold more than one idea in your head at a time permalink parent award report block reply view 1 more comments...\nYouEssAye 0 points 4 hours ago 50 year loans will just make house prices increase. This helps bankers more than it helps Americans. I understand it's optional, but you understand most Americans are financially illiterate. Also these aren't two separate ideas, deporting 50 million would significantly lower housing costs, making 50 year mortgages totally unnecessary. permalink parent award report block reply SanityGumby 1 points 22 minutes ago No they won’t. That’s why we are deporting illegals. You people can’t hold more than one idea in your head at a time permalink parent award report block reply view 1 more comments...\nSanityGumby 1 points 22 minutes ago No they won’t. That’s why we are deporting illegals. You people can’t hold more than one idea in your head at a time permalink parent award report block reply view 1 more comments...\nAppalachianTactical 0 points 4 hours ago No its a good message but its ai trash. We should be in the streets saying this for real. permalink parent award report block reply\nBillboDickens 2 points 2 hours ago Generational debt enslavement, or replaced by foreigners in your own country?  Trumps says, ‘perhaps both’ permalink award report block reply\nHeavenlyTrumpets 2 points 5 hours ago Yep permalink award report block reply\n67Vert 1 points 5 hours ago I’m locked at 2.7%.  I’d take 50 yr am.  Interest only would be even better. permalink award report block reply\nDITTOPatriot 1 points 5 hours ago Good luck with that, unless you're one of the ones surrounding the administration, and it’s going to be a plus if you can promise a seaside resort. permalink award report block reply\nf_bastiat 1 points 2 hours ago I want thermonuclear warheads landing in densely populated Muslim countries, let's get this holy war on the road! permalink award report block reply\nNoMaskNoMaster 1 points 1 hour ago AI slop, but yes permalink award report block reply\nAcquittedZombieSlay 1 points 2 hours ago you're all pretty retarded, 50 year mortgage is a fantastic idea.  If ask to have it explained im not gonna bother because you're to retarded to understand allready. permalink award report block reply\nFlowers-By-Irene 1 points 6 hours ago Can sub for democrats if we run out of illegals. permalink award report block reply\nAlmostFullyDilated 1 points 3 hours ago it would be cheaper to give them 90 days to self deport and then sell game tags to hunt illegals permalink award report block reply\nVanDeKoik 1 points 5 hours ago Ok? Dont get one? And if you want 50 million deportations there are openings at ICE right now. permalink award report block reply\nbemac 1 points 5 hours ago AI shit permalink award report block reply\nGoatboy66 1 points 6 hours ago 50 million Deportations will definitely bring down the Cost of Housing. permalink award report block reply VanDeKoik 1 points 5 hours ago No it won't. permalink parent award report block reply\nVanDeKoik 1 points 5 hours ago No it won't. permalink parent award report block reply\nDeltaSierra 1 points 6 hours ago The best is still - Black Sabbath Matters permalink award report block reply\ncciv 1 points 3 hours ago Why not both? permalink award report block reply\nSickOfNeoPolitics 1 points 1 hour ago I am past wanting deportations. I just want invaders to be be dealt with in the traditional manner. permalink award report block reply\ntry4gain PRO 0 points 6 hours ago ALWAYS BE CHIMPING permalink award report block reply\ndonteatthat 0 points 6 hours ago Well that's just too bad permalink award report block reply\nFatigueIsReal -1 points 5 hours ago Fucking retard level memes are getting stickied now? I guess we'll need to get the treasury employees to get off their ass and start deporting people. Geeze this is getting bad. permalink award report block reply\nRepentnow -4 points 6 hours ago Both is the correct answer. The 50 year mortgage hate is retarded. It just adds an additional option. You can still get what ever length mortgage you want. If you take a 50 year mortgage and make the same payment as a 15 year mortgage, you'll be paid off in 15 years with the exact same interest paid. The advantage of the 50yr is your minimum payment is much lower compared to a 15yr, so if you hit a financial snag anywhere during that 15 years, you could drop back to the lower minimum payment for a little while. permalink award report block reply Parhelion12 5 points 6 hours ago Oh cmon. That's just intellectually dishonest. Combing 50 year mtgs with the widespread financial illiteracy is an AUTOMATIC wealth transfer. permalink parent award report block reply FatigueIsReal 3 points 5 hours ago So when the 30 year mortgages were created, a wealth transfer happened? Japan and Switzerland offer 50 year mortgages.  Sweden has no limit and the average is 140 years. Japan has previously offered generational 100 year mortgages. Let me know how they're doing compared to the US. Hint: the problem might be darker and have nothing to do with the mortgage term length. permalink parent award report block reply Repentnow 1 points 5 hours ago If some people are too stupid to understand how mortgage and interest work, then they deserve whatever financial disaster befalls them. People are 100%  responsible for their own selves. permalink parent award report block reply Porkbut -1 points 5 hours ago Tell me youre a democrat without telling me. Your favorite show is the young turks. Say donor class. permalink parent award report block reply GA_Logic 2 points 6 hours ago Agreed. Dave Ramsey has said if you can't obtain a 15 year mortgage go with a 30 and just pay it off in 15 years. permalink parent award report block reply FatigueIsReal 3 points 5 hours ago I know many that have used this. The going strategy was to base it on interest.  High interest, get the higher year mortgage and when interest drops, refi for the 10 or 15 year mortgage. permalink parent award report block reply GA_Logic 1 points 5 hours ago This was very common in the 80s with interest sky high. permalink parent award report block reply\nParhelion12 5 points 6 hours ago Oh cmon. That's just intellectually dishonest. Combing 50 year mtgs with the widespread financial illiteracy is an AUTOMATIC wealth transfer. permalink parent award report block reply FatigueIsReal 3 points 5 hours ago So when the 30 year mortgages were created, a wealth transfer happened? Japan and Switzerland offer 50 year mortgages.  Sweden has no limit and the average is 140 years. Japan has previously offered generational 100 year mortgages. Let me know how they're doing compared to the US. Hint: the problem might be darker and have nothing to do with the mortgage term length. permalink parent award report block reply Repentnow 1 points 5 hours ago If some people are too stupid to understand how mortgage and interest work, then they deserve whatever financial disaster befalls them. People are 100%  responsible for their own selves. permalink parent award report block reply Porkbut -1 points 5 hours ago Tell me youre a democrat without telling me. Your favorite show is the young turks. Say donor class. permalink parent award report block reply\nFatigueIsReal 3 points 5 hours ago So when the 30 year mortgages were created, a wealth transfer happened? Japan and Switzerland offer 50 year mortgages.  Sweden has no limit and the average is 140 years. Japan has previously offered generational 100 year mortgages. Let me know how they're doing compared to the US. Hint: the problem might be darker and have nothing to do with the mortgage term length. permalink parent award report block reply\nRepentnow 1 points 5 hours ago If some people are too stupid to understand how mortgage and interest work, then they deserve whatever financial disaster befalls them. People are 100%  responsible for their own selves. permalink parent award report block reply\nPorkbut -1 points 5 hours ago Tell me youre a democrat without telling me. Your favorite show is the young turks. Say donor class. permalink parent award report block reply\nGA_Logic 2 points 6 hours ago Agreed. Dave Ramsey has said if you can't obtain a 15 year mortgage go with a 30 and just pay it off in 15 years. permalink parent award report block reply FatigueIsReal 3 points 5 hours ago I know many that have used this. The going strategy was to base it on interest.  High interest, get the higher year mortgage and when interest drops, refi for the 10 or 15 year mortgage. permalink parent award report block reply GA_Logic 1 points 5 hours ago This was very common in the 80s with interest sky high. permalink parent award report block reply\nFatigueIsReal 3 points 5 hours ago I know many that have used this. The going strategy was to base it on interest.  High interest, get the higher year mortgage and when interest drops, refi for the 10 or 15 year mortgage. permalink parent award report block reply GA_Logic 1 points 5 hours ago This was very common in the 80s with interest sky high. permalink parent award report block reply\nGA_Logic 1 points 5 hours ago This was very common in the 80s with interest sky high. permalink parent award report block reply\nberserkerbarrage -7 points 6 hours ago Then  don't take out a 50 year mortgage. They also said that they were working on making 5 and 15 year mortgages more available. Nobody is forcing you to do anything you don't want to, but other people will appreciate the options. We're deporting people as fast as legally possible and at much higher rates than previous administrations (turnaways =/= deportations). If it's not fast enough then maybe you should focus more on electing MAGA candidates to change the law and less on trying to help open borders Democrats win. For the anti-Trump trolls that will inevitably bot the shit out of this thread. permalink award report block reply Mamapedia 6 points 6 hours ago Every person who has legitimate criticisms of Trump's words and actions is not an anti-Trump troll. Blind adulation is for fools.  Thank you for the facts you outlined, but the last sentence conflates valid criticism and trolling. permalink parent award report block reply Porkbut -4 points 5 hours ago You dont have legitimate criticisms, you just claim you do while sperging over and over like a petulant child. permalink parent award report block reply Mamapedia 4 points 5 hours ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut -1 points 5 hours ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 4 more comments... berserkerbarrage -4 points 6 hours ago Where is the legitimate criticism? It's also just a fact that this site is being botted and brigaded by Nick Fuentes trolls. If you can't explain why offering people more mortgage options (on both ends of the spectrum) is a bad thing then it's not a legitimate criticism. If you're blaming Trump for the fact that more people aren't being deported (despite him deporting people as fast as legally possible), that's not legitimate criticism. If you're blaming Trump for high beef prices but you can't say how or why he's responsible for high beef prices, that's not a legitimate criticism. permalink parent award report block reply Mamapedia 1 points 6 hours ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 5 hours ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 6 hours ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments... deleted 0 points 4 hours ago TheDevilMonkey 2 points 6 hours ago 1 month old shill account. 👆👃 permalink parent award report block reply berserkerbarrage -4 points 6 hours ago And yet you're the one pushing fake news, anti-Trump narratives on a supposedly pro-Trump site. permalink parent award report block reply TheDevilMonkey 3 points 6 hours ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 6 hours ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 5 more comments... Repentnow -1 points 6 hours ago There's a few non-doomers left, but just like importing a minority of foreigners causes the locals to leave and then they take over — the agitators here are working hard at their goal to cause division and make us long-time residents of T_D leave. permalink parent award report block reply FatigueIsReal 1 points 5 hours ago There's only one rule that I want them to enforce. Be here for Trump and MAGA So many people shit on Trump without anything other than a regurgitation from some influencer out there. permalink parent award report block reply SanityGumby -1 points 5 hours ago I’m getting close if the mods are not going to enforce the literal fucking rules on the side panel. Worse yet one of them pinned this obvious psyop permalink parent award report block reply YouEssAye 1 points 5 hours ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply loktar00 2 points 4 hours ago Exactly my feelings, also been to rallies, protests after Jan 6th etc, this term there has yet to be anything where I'm like \"Hell yeah!\" like I was from the first term. Nothing that has positively affected me directly. H1Bs are still killing the industry I'm in, my pay hasn't gone up, I'm scared I'll lose my job any day now and good luck finding another the economy is complete shit right now, healthcare, car insurance, and basically everything else is still expensive af. No one has been arrested, no BTC strategic reserve, no Epstein files... First term we had some amazing big wins we all celebrated here that actually were passed onto us in our personal lives, not just symbolistic \"culture war\" wins that will be reversed the next time a Dem is in office. permalink parent award report block reply SanityGumby 0 points 4 hours ago No they haven’t permalink parent award report block reply view 1 more comments... SHILL_DETECTOR -2 points 6 hours ago the troll was when i said its 6 dollars a pound permalink parent award report block reply berserkerbarrage 2 points 6 hours ago Cool. Now explain how it's Trump fault. permalink parent award report block reply\nMamapedia 6 points 6 hours ago Every person who has legitimate criticisms of Trump's words and actions is not an anti-Trump troll. Blind adulation is for fools.  Thank you for the facts you outlined, but the last sentence conflates valid criticism and trolling. permalink parent award report block reply Porkbut -4 points 5 hours ago You dont have legitimate criticisms, you just claim you do while sperging over and over like a petulant child. permalink parent award report block reply Mamapedia 4 points 5 hours ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut -1 points 5 hours ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 4 more comments... berserkerbarrage -4 points 6 hours ago Where is the legitimate criticism? It's also just a fact that this site is being botted and brigaded by Nick Fuentes trolls. If you can't explain why offering people more mortgage options (on both ends of the spectrum) is a bad thing then it's not a legitimate criticism. If you're blaming Trump for the fact that more people aren't being deported (despite him deporting people as fast as legally possible), that's not legitimate criticism. If you're blaming Trump for high beef prices but you can't say how or why he's responsible for high beef prices, that's not a legitimate criticism. permalink parent award report block reply Mamapedia 1 points 6 hours ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 5 hours ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 6 hours ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments... deleted 0 points 4 hours ago\nPorkbut -4 points 5 hours ago You dont have legitimate criticisms, you just claim you do while sperging over and over like a petulant child. permalink parent award report block reply Mamapedia 4 points 5 hours ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut -1 points 5 hours ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 4 more comments...\nMamapedia 4 points 5 hours ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut -1 points 5 hours ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 4 more comments...\nPorkbut -1 points 5 hours ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 4 more comments...\nberserkerbarrage -4 points 6 hours ago Where is the legitimate criticism? It's also just a fact that this site is being botted and brigaded by Nick Fuentes trolls. If you can't explain why offering people more mortgage options (on both ends of the spectrum) is a bad thing then it's not a legitimate criticism. If you're blaming Trump for the fact that more people aren't being deported (despite him deporting people as fast as legally possible), that's not legitimate criticism. If you're blaming Trump for high beef prices but you can't say how or why he's responsible for high beef prices, that's not a legitimate criticism. permalink parent award report block reply Mamapedia 1 points 6 hours ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 5 hours ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 6 hours ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments... deleted 0 points 4 hours ago\nMamapedia 1 points 6 hours ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 5 hours ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 6 hours ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments...\nFatigueIsReal 2 points 5 hours ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments...\nberserkerbarrage 0 points 6 hours ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments...\ndeleted 0 points 4 hours ago\nTheDevilMonkey 2 points 6 hours ago 1 month old shill account. 👆👃 permalink parent award report block reply berserkerbarrage -4 points 6 hours ago And yet you're the one pushing fake news, anti-Trump narratives on a supposedly pro-Trump site. permalink parent award report block reply TheDevilMonkey 3 points 6 hours ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 6 hours ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 5 more comments...\nberserkerbarrage -4 points 6 hours ago And yet you're the one pushing fake news, anti-Trump narratives on a supposedly pro-Trump site. permalink parent award report block reply TheDevilMonkey 3 points 6 hours ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 6 hours ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 5 more comments...\nTheDevilMonkey 3 points 6 hours ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 6 hours ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 5 more comments...\nberserkerbarrage -3 points 6 hours ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 5 more comments...\nRepentnow -1 points 6 hours ago There's a few non-doomers left, but just like importing a minority of foreigners causes the locals to leave and then they take over — the agitators here are working hard at their goal to cause division and make us long-time residents of T_D leave. permalink parent award report block reply FatigueIsReal 1 points 5 hours ago There's only one rule that I want them to enforce. Be here for Trump and MAGA So many people shit on Trump without anything other than a regurgitation from some influencer out there. permalink parent award report block reply SanityGumby -1 points 5 hours ago I’m getting close if the mods are not going to enforce the literal fucking rules on the side panel. Worse yet one of them pinned this obvious psyop permalink parent award report block reply YouEssAye 1 points 5 hours ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply loktar00 2 points 4 hours ago Exactly my feelings, also been to rallies, protests after Jan 6th etc, this term there has yet to be anything where I'm like \"Hell yeah!\" like I was from the first term. Nothing that has positively affected me directly. H1Bs are still killing the industry I'm in, my pay hasn't gone up, I'm scared I'll lose my job any day now and good luck finding another the economy is complete shit right now, healthcare, car insurance, and basically everything else is still expensive af. No one has been arrested, no BTC strategic reserve, no Epstein files... First term we had some amazing big wins we all celebrated here that actually were passed onto us in our personal lives, not just symbolistic \"culture war\" wins that will be reversed the next time a Dem is in office. permalink parent award report block reply SanityGumby 0 points 4 hours ago No they haven’t permalink parent award report block reply view 1 more comments...\nFatigueIsReal 1 points 5 hours ago There's only one rule that I want them to enforce. Be here for Trump and MAGA So many people shit on Trump without anything other than a regurgitation from some influencer out there. permalink parent award report block reply\nSanityGumby -1 points 5 hours ago I’m getting close if the mods are not going to enforce the literal fucking rules on the side panel. Worse yet one of them pinned this obvious psyop permalink parent award report block reply YouEssAye 1 points 5 hours ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply loktar00 2 points 4 hours ago Exactly my feelings, also been to rallies, protests after Jan 6th etc, this term there has yet to be anything where I'm like \"Hell yeah!\" like I was from the first term. Nothing that has positively affected me directly. H1Bs are still killing the industry I'm in, my pay hasn't gone up, I'm scared I'll lose my job any day now and good luck finding another the economy is complete shit right now, healthcare, car insurance, and basically everything else is still expensive af. No one has been arrested, no BTC strategic reserve, no Epstein files... First term we had some amazing big wins we all celebrated here that actually were passed onto us in our personal lives, not just symbolistic \"culture war\" wins that will be reversed the next time a Dem is in office. permalink parent award report block reply SanityGumby 0 points 4 hours ago No they haven’t permalink parent award report block reply view 1 more comments...\nYouEssAye 1 points 5 hours ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply loktar00 2 points 4 hours ago Exactly my feelings, also been to rallies, protests after Jan 6th etc, this term there has yet to be anything where I'm like \"Hell yeah!\" like I was from the first term. Nothing that has positively affected me directly. H1Bs are still killing the industry I'm in, my pay hasn't gone up, I'm scared I'll lose my job any day now and good luck finding another the economy is complete shit right now, healthcare, car insurance, and basically everything else is still expensive af. No one has been arrested, no BTC strategic reserve, no Epstein files... First term we had some amazing big wins we all celebrated here that actually were passed onto us in our personal lives, not just symbolistic \"culture war\" wins that will be reversed the next time a Dem is in office. permalink parent award report block reply SanityGumby 0 points 4 hours ago No they haven’t permalink parent award report block reply view 1 more comments...\nloktar00 2 points 4 hours ago Exactly my feelings, also been to rallies, protests after Jan 6th etc, this term there has yet to be anything where I'm like \"Hell yeah!\" like I was from the first term. Nothing that has positively affected me directly. H1Bs are still killing the industry I'm in, my pay hasn't gone up, I'm scared I'll lose my job any day now and good luck finding another the economy is complete shit right now, healthcare, car insurance, and basically everything else is still expensive af. No one has been arrested, no BTC strategic reserve, no Epstein files... First term we had some amazing big wins we all celebrated here that actually were passed onto us in our personal lives, not just symbolistic \"culture war\" wins that will be reversed the next time a Dem is in office. permalink parent award report block reply\nSanityGumby 0 points 4 hours ago No they haven’t permalink parent award report block reply view 1 more comments...\nSHILL_DETECTOR -2 points 6 hours ago the troll was when i said its 6 dollars a pound permalink parent award report block reply berserkerbarrage 2 points 6 hours ago Cool. Now explain how it's Trump fault. permalink parent award report block reply\nberserkerbarrage 2 points 6 hours ago Cool. Now explain how it's Trump fault. permalink parent award report block reply"}