{"id": "8185722", "contents": "93 The average Democrat is evil. I'm tired of right wingers making up excuses for our enemies posted 5 hours ago by MasterChief08 6 comments award share report block They're not naive. They're not all dumb. They're evil. It's time we all just accepted this. We are engaged in a war over the heart of civilization. We are fighting people that want your children to be murdered. The average Democrat is waking up every single day angry that you're alive\n6 comments Sort by Top Top New Worst Old Save vote_for_MAGA_2020 3 points 3 hours ago I appreciate you saying this, I say it all the time myself. Yes, they are evil, not stupid. permalink award report block reply coffee_grdr 1 points 3 hours ago i... dont disagree! a normal, run of the mill person would says \"lets not inject drugs into kids to permanently change their hormones, because... they asked\". a sound person would not say \"its okay if men go into womens or girls bathrooms, as long as that man says hes a woman\".  dems, even the \"moderate\" ones are mentally unstable and with that comes an anger that is pure evil. permalink award report block reply Xahnel 1 points 3 hours ago As far as I know, I'm one of the first to advocate for the discarding of Hanlon's Razor. I've been saying for... 6-7 years now, to stop attributing to incompetence what is obviously malice. I'm very glad to see this spreading. It's time to stop giving our enemies the shield of stupidity. No one wants to lynch a retard, so stop calling them retarded. permalink award report block reply Saltish 1 points 10 minutes ago I know it's tempting to say this and believe this, and yes, some definitely are demons, but no, the average Democrat is not evil. I can say this because basically everyone in my family is either a normie or a liberal, and none of them are evil. I know them better than anyone in the world. They are just naive, and misled daily by the disgraced and captured corporate media, who are, in fact, quite evil. permalink award report block reply Duke442games 1 points 3 hours ago Bingo permalink award report block reply Combat_Hamster 1 points 5 hours ago Raymond Ibrahim masterfully agrees: https://www.youtube.com/watch?v=IDz7EmLJP9o&t=235s permalink award report block reply\nvote_for_MAGA_2020 3 points 3 hours ago I appreciate you saying this, I say it all the time myself. Yes, they are evil, not stupid. permalink award report block reply\ncoffee_grdr 1 points 3 hours ago i... dont disagree! a normal, run of the mill person would says \"lets not inject drugs into kids to permanently change their hormones, because... they asked\". a sound person would not say \"its okay if men go into womens or girls bathrooms, as long as that man says hes a woman\".  dems, even the \"moderate\" ones are mentally unstable and with that comes an anger that is pure evil. permalink award report block reply\nXahnel 1 points 3 hours ago As far as I know, I'm one of the first to advocate for the discarding of Hanlon's Razor. I've been saying for... 6-7 years now, to stop attributing to incompetence what is obviously malice. I'm very glad to see this spreading. It's time to stop giving our enemies the shield of stupidity. No one wants to lynch a retard, so stop calling them retarded. permalink award report block reply\nSaltish 1 points 10 minutes ago I know it's tempting to say this and believe this, and yes, some definitely are demons, but no, the average Democrat is not evil. I can say this because basically everyone in my family is either a normie or a liberal, and none of them are evil. I know them better than anyone in the world. They are just naive, and misled daily by the disgraced and captured corporate media, who are, in fact, quite evil. permalink award report block reply\nDuke442games 1 points 3 hours ago Bingo permalink award report block reply\nCombat_Hamster 1 points 5 hours ago Raymond Ibrahim masterfully agrees: https://www.youtube.com/watch?v=IDz7EmLJP9o&t=235s permalink award report block reply"}