{"id": "8185035", "contents": "682 700 Arrests in One Year posted 10 hours ago by flashersenpai 34 comments award share report block 🇺🇸 @FreeStateWill • 1d By the end of 2021, more than 700 J6ers had been arrested. So far in 2025, Pam Bondi hasn't arrested anyone for the fedsurrection, and the statute of limitations expires in eight weeks.\n34 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Raetchel 49 points 10 hours ago as is her plan permalink award report block reply MastaJoda 15 points 9 hours ago ☝☝☝ 🤡Trump will save us. Derrr herrrr👍 permalink parent award report block reply nolefthandshakes 3 points 2 hours ago it’s unbelievably obvious how much we’ve been played, and continue to get played in the most embarrassing fashion possible. permalink parent award report block reply LauraCoomer 31 points 10 hours ago Bill Barr energy permalink award report block reply Luvs_2_Bop 20 points 10 hours ago Bill Barrbie (can’t take credit, but I use this name often) permalink parent award report block reply Thrilly 2 points 5 hours ago Son of the man who put Epstein on the map. permalink parent award report block reply friarfox 26 points 10 hours ago Trust the plan. 5 d chess. Two more weeks. Forming a committee. What did I miss? permalink award report block reply Luvs_2_Bop 13 points 10 hours ago The list is on her desk… permalink parent award report block reply Standingoak 2 points 7 hours ago The list is on her desk…\"and the statute of limitations expires in eight weeks\"... unless the larger conspiracy/insurrection is still under investigation . permalink parent award report block reply starjello 4 points 7 hours ago I'm going to pipe in and totally agree with you. I love giving the Q faggots something to downvote give their useless lives meaning. permalink parent award report block reply mty_green_go 16 points 9 hours ago Pam Blondi is the biggest scam.. she has no teeth. just saggy tits and probably dentures...and tried to prosecute George Zimmerman permalink award report block reply TrumpPl4yedU 1 points 9 hours ago Comment removed upon the user being banned. permalink parent award report block reply Justjayce 12 points 10 hours ago Nothing will be done permalink award report block reply Standingoak 1 points 7 hours ago \"Nothing is Happening\" permalink parent award report block reply JerryNadlerBeltFund 0 points 9 hours ago Well, to bring this up just before midterm campaigns begin in earnest next year, would just appear political.   Best to wait until after the midterms. Rinos know how to lose, that's for sure. permalink parent award report block reply Area82 7 points 9 hours ago There is no SOL for ongoing conspiracies.  Just saying. permalink award report block reply TheGreenDutchman 6 points 7 hours ago Nor is there one for treason, AFAIK. permalink parent award report block reply edxzxz 5 points 9 hours ago Trump should have fired Durham and didn't, should have fired Bondi months ago, and hasn't.  Tick Tock. permalink award report block reply IAmRetard 3 points 10 hours ago Think about it permalink award report block reply SHILL_DETECTOR 11 points 10 hours ago the only stress they have is how to hoodwink us long enough until they cant charge anyone anymore permalink parent award report block reply MastaJoda 1 points 9 hours ago Sorry folks better luck nex...aaaand they stole another election. The cycle continues. permalink parent award report block reply IroWide 2 points 7 hours ago I bet they had a party when Trump told Matt Gaetz to withdraw. permalink award report block reply MAPatriot1966 2 points 9 hours ago 2 weeks…business days only days…excluding federal holidays….add a day for leap year… permalink award report block reply blueballs43 2 points 5 hours ago Some of you folks  still do not see the long game we are forced to be playing...and the very real problems with the DOJ dealing with a massive coup developed and preformed by a political party with a variety of activists --- domestic and foreign.\nAll this worrying about Bondi DOJ is for nought as it is  in the wrong venue, dealing with this coup-which in the broad definition is \"TREASON\" ,  if actions are to be taken against the plotters and activists; if this  ever happens  ie, investigations, grand juries,  warrants, arrests trials etc, these will likely  evolve from very secret investigations by military operatives, jag, space force and related  outside the Washington D.C. area.   How?  I do not know. The Dept of War initiatives will likely be the major player in the attempt to call to account the TRADERS. Failing that,  one can see the real possibility that another set of actors, not to unlike the actors from the \"TEA-PARTY would likely engage is some kinetics  against some individuals or groups. Interesting time to be alive! permalink award report block reply TyrannyBuster 2 points 4 hours ago Another point for the doomers. permalink award report block reply SilentSniper 2 points 10 hours ago 8 weeks and 1day she’ll arrest everyone permalink award report block reply HumblePepe 2 points 10 hours ago By design permalink award report block reply rebuildingMyself 1 points 9 hours ago \"Eight more weeks\" she thinks to herself as she prepares her next epic Fox News grrlboss rant about how that expiration is totally the reason it can't happen now. permalink award report block reply barwhack 1 points 5 hours ago Trump is in on it, it seems. Garbage: the lot. We have no one. May God revoke the bloody call. permalink award report block reply SanityGumby 1 points 15 minutes ago There is no statute of limitations. This guy is running a psy op permalink award report block reply Nanteen 0 points 4 hours ago Just two more weeks..... permalink award report block reply 2FBIAgents1Cup 0 points 7 hours ago The plan is working... permalink award report block reply TheSwampThang 0 points 9 hours ago She wanted to, but she couldn't.   You don't understand how government works.  Trust that they know what they're doing when they let the left get away with incredibly serious crimes, all the while provoking the left with no intention of defending us when they leave in a few years. permalink award report block reply SCHULTZ 1 points 9 hours ago Comment removed by community moderators. permalink award report block reply\nRaetchel 49 points 10 hours ago as is her plan permalink award report block reply MastaJoda 15 points 9 hours ago ☝☝☝ 🤡Trump will save us. Derrr herrrr👍 permalink parent award report block reply nolefthandshakes 3 points 2 hours ago it’s unbelievably obvious how much we’ve been played, and continue to get played in the most embarrassing fashion possible. permalink parent award report block reply\nMastaJoda 15 points 9 hours ago ☝☝☝ 🤡Trump will save us. Derrr herrrr👍 permalink parent award report block reply nolefthandshakes 3 points 2 hours ago it’s unbelievably obvious how much we’ve been played, and continue to get played in the most embarrassing fashion possible. permalink parent award report block reply\nnolefthandshakes 3 points 2 hours ago it’s unbelievably obvious how much we’ve been played, and continue to get played in the most embarrassing fashion possible. permalink parent award report block reply\nLauraCoomer 31 points 10 hours ago Bill Barr energy permalink award report block reply Luvs_2_Bop 20 points 10 hours ago Bill Barrbie (can’t take credit, but I use this name often) permalink parent award report block reply Thrilly 2 points 5 hours ago Son of the man who put Epstein on the map. permalink parent award report block reply\nLuvs_2_Bop 20 points 10 hours ago Bill Barrbie (can’t take credit, but I use this name often) permalink parent award report block reply\nThrilly 2 points 5 hours ago Son of the man who put Epstein on the map. permalink parent award report block reply\nfriarfox 26 points 10 hours ago Trust the plan. 5 d chess. Two more weeks. Forming a committee. What did I miss? permalink award report block reply Luvs_2_Bop 13 points 10 hours ago The list is on her desk… permalink parent award report block reply Standingoak 2 points 7 hours ago The list is on her desk…\"and the statute of limitations expires in eight weeks\"... unless the larger conspiracy/insurrection is still under investigation . permalink parent award report block reply starjello 4 points 7 hours ago I'm going to pipe in and totally agree with you. I love giving the Q faggots something to downvote give their useless lives meaning. permalink parent award report block reply\nLuvs_2_Bop 13 points 10 hours ago The list is on her desk… permalink parent award report block reply Standingoak 2 points 7 hours ago The list is on her desk…\"and the statute of limitations expires in eight weeks\"... unless the larger conspiracy/insurrection is still under investigation . permalink parent award report block reply\nStandingoak 2 points 7 hours ago The list is on her desk…\"and the statute of limitations expires in eight weeks\"... unless the larger conspiracy/insurrection is still under investigation . permalink parent award report block reply\nstarjello 4 points 7 hours ago I'm going to pipe in and totally agree with you. I love giving the Q faggots something to downvote give their useless lives meaning. permalink parent award report block reply\nmty_green_go 16 points 9 hours ago Pam Blondi is the biggest scam.. she has no teeth. just saggy tits and probably dentures...and tried to prosecute George Zimmerman permalink award report block reply TrumpPl4yedU 1 points 9 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpPl4yedU 1 points 9 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nJustjayce 12 points 10 hours ago Nothing will be done permalink award report block reply Standingoak 1 points 7 hours ago \"Nothing is Happening\" permalink parent award report block reply JerryNadlerBeltFund 0 points 9 hours ago Well, to bring this up just before midterm campaigns begin in earnest next year, would just appear political.   Best to wait until after the midterms. Rinos know how to lose, that's for sure. permalink parent award report block reply\nStandingoak 1 points 7 hours ago \"Nothing is Happening\" permalink parent award report block reply\nJerryNadlerBeltFund 0 points 9 hours ago Well, to bring this up just before midterm campaigns begin in earnest next year, would just appear political.   Best to wait until after the midterms. Rinos know how to lose, that's for sure. permalink parent award report block reply\nArea82 7 points 9 hours ago There is no SOL for ongoing conspiracies.  Just saying. permalink award report block reply TheGreenDutchman 6 points 7 hours ago Nor is there one for treason, AFAIK. permalink parent award report block reply\nTheGreenDutchman 6 points 7 hours ago Nor is there one for treason, AFAIK. permalink parent award report block reply\nedxzxz 5 points 9 hours ago Trump should have fired Durham and didn't, should have fired Bondi months ago, and hasn't.  Tick Tock. permalink award report block reply\nIAmRetard 3 points 10 hours ago Think about it permalink award report block reply SHILL_DETECTOR 11 points 10 hours ago the only stress they have is how to hoodwink us long enough until they cant charge anyone anymore permalink parent award report block reply MastaJoda 1 points 9 hours ago Sorry folks better luck nex...aaaand they stole another election. The cycle continues. permalink parent award report block reply\nSHILL_DETECTOR 11 points 10 hours ago the only stress they have is how to hoodwink us long enough until they cant charge anyone anymore permalink parent award report block reply MastaJoda 1 points 9 hours ago Sorry folks better luck nex...aaaand they stole another election. The cycle continues. permalink parent award report block reply\nMastaJoda 1 points 9 hours ago Sorry folks better luck nex...aaaand they stole another election. The cycle continues. permalink parent award report block reply\nIroWide 2 points 7 hours ago I bet they had a party when Trump told Matt Gaetz to withdraw. permalink award report block reply\nMAPatriot1966 2 points 9 hours ago 2 weeks…business days only days…excluding federal holidays….add a day for leap year… permalink award report block reply\nblueballs43 2 points 5 hours ago Some of you folks  still do not see the long game we are forced to be playing...and the very real problems with the DOJ dealing with a massive coup developed and preformed by a political party with a variety of activists --- domestic and foreign.\nAll this worrying about Bondi DOJ is for nought as it is  in the wrong venue, dealing with this coup-which in the broad definition is \"TREASON\" ,  if actions are to be taken against the plotters and activists; if this  ever happens  ie, investigations, grand juries,  warrants, arrests trials etc, these will likely  evolve from very secret investigations by military operatives, jag, space force and related  outside the Washington D.C. area.   How?  I do not know. The Dept of War initiatives will likely be the major player in the attempt to call to account the TRADERS. Failing that,  one can see the real possibility that another set of actors, not to unlike the actors from the \"TEA-PARTY would likely engage is some kinetics  against some individuals or groups. Interesting time to be alive! permalink award report block reply\nTyrannyBuster 2 points 4 hours ago Another point for the doomers. permalink award report block reply\nSilentSniper 2 points 10 hours ago 8 weeks and 1day she’ll arrest everyone permalink award report block reply\nHumblePepe 2 points 10 hours ago By design permalink award report block reply\nrebuildingMyself 1 points 9 hours ago \"Eight more weeks\" she thinks to herself as she prepares her next epic Fox News grrlboss rant about how that expiration is totally the reason it can't happen now. permalink award report block reply\nbarwhack 1 points 5 hours ago Trump is in on it, it seems. Garbage: the lot. We have no one. May God revoke the bloody call. permalink award report block reply\nSanityGumby 1 points 15 minutes ago There is no statute of limitations. This guy is running a psy op permalink award report block reply\nNanteen 0 points 4 hours ago Just two more weeks..... permalink award report block reply\n2FBIAgents1Cup 0 points 7 hours ago The plan is working... permalink award report block reply\nTheSwampThang 0 points 9 hours ago She wanted to, but she couldn't.   You don't understand how government works.  Trust that they know what they're doing when they let the left get away with incredibly serious crimes, all the while provoking the left with no intention of defending us when they leave in a few years. permalink award report block reply\nSCHULTZ 1 points 9 hours ago Comment removed by community moderators. permalink award report block reply"}