{"id": "8185085", "contents": "169 Officials in Marion County, Kansas, have agreed to pay more than $3 million and issue a formal apology over a 2023 police raid on a small-town newspaper that ignited national backlash and raised alarms about government overreach and press freedom. (www.foxnews.com) DON'T TREAD ON ME posted 10 hours ago by blue5707 5 comments award share report block Police raid on newspaper prompts $3M payout, apology amid press freedom outcry Marion County agrees to pay $3 million after a controversial newspaper raid, sparking public backlash over concerns about press freedom violations. www.foxnews.com\n5 comments Sort by Top Top New Worst Old Save Hantif 5 points 10 hours ago Now disbar and ban the judge and lawyers involved. Decertify and ban the cops involved. They should never be allowed to work those jobs anywhere. permalink award report block reply schiff_for_brains 5 points 9 hours ago They aren't paying for it personally.  Just sayin.... permalink award report block reply bill_in_texas 4 points 9 hours ago Nice, but the elderly woman co-owner who had her home raided and then died a day later from the stress of it all is.....still dead.  $ 3M doesn't make her or her family whole, not by a long shot. The mayor and police that did that need to go to prison. permalink award report block reply POTUS_DonnieJ 2 points 9 hours ago When acting in bad faith, they shouldn’t get to use taxpayer funds to bail themselves out. permalink award report block reply Waco419 1 points 8 hours ago Did the responsible town officials, bureaucrats and cops have to personally pay the three million, or did the taxpayers have to foot that bill? We know the answer. This is no different that government bailouts of banks, insurance companies and other \"too big to fail\" big businesses. Economically, this is commonly described as \"privatizing the profits\" and \"socializing the losses\". Politically, this is \"legalizing the crimes\" and \"socializing the restitution\". Collectively, the \"too big to fail\" club includes \"too important to prosecute\" apparatchiks at all levels of government. These people all have \"qualified immunity\" from prosecution for their criminal acts. The sad thing is that most people are unaware of just how communistic this all is. permalink award report block reply\nHantif 5 points 10 hours ago Now disbar and ban the judge and lawyers involved. Decertify and ban the cops involved. They should never be allowed to work those jobs anywhere. permalink award report block reply\nschiff_for_brains 5 points 9 hours ago They aren't paying for it personally.  Just sayin.... permalink award report block reply\nbill_in_texas 4 points 9 hours ago Nice, but the elderly woman co-owner who had her home raided and then died a day later from the stress of it all is.....still dead.  $ 3M doesn't make her or her family whole, not by a long shot. The mayor and police that did that need to go to prison. permalink award report block reply\nPOTUS_DonnieJ 2 points 9 hours ago When acting in bad faith, they shouldn’t get to use taxpayer funds to bail themselves out. permalink award report block reply\nWaco419 1 points 8 hours ago Did the responsible town officials, bureaucrats and cops have to personally pay the three million, or did the taxpayers have to foot that bill? We know the answer. This is no different that government bailouts of banks, insurance companies and other \"too big to fail\" big businesses. Economically, this is commonly described as \"privatizing the profits\" and \"socializing the losses\". Politically, this is \"legalizing the crimes\" and \"socializing the restitution\". Collectively, the \"too big to fail\" club includes \"too important to prosecute\" apparatchiks at all levels of government. These people all have \"qualified immunity\" from prosecution for their criminal acts. The sad thing is that most people are unaware of just how communistic this all is. permalink award report block reply"}