{"id": "8185534", "contents": "65 New cruise line posted 6 hours ago by vsekvsek 3 comments award share download report block\n3 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Thrilly 3 points 5 hours ago Send them back to Wakanda....Forever! permalink award report block reply IvanDrago 2 points 5 hours ago Let's milk the residual Wakanda hype. Disney wholly owns a new nation state in africa that is part theme park, part permanent residence. Africans from outside their home continent are encouraged to repatriate Wakanda via Disney's effective marketing and PR machinery. However, in order to join, they must relinquish their non-Wakandan citizenship and sell any major financial and physical assets they hold which won't transfer. We all know how this kind of story eventually ends (Liberia) so it's critical to have the bulk of the admissable population move immediately, and achieve critical mass. Since the government has failed at these endeavors, the private sector, Disney in this case, has better odds of success. In turn, tax dollars may need to be promised to Disney for the eventual massive loss, which can be mitigated by formally establishing an independent government separate from Disney before shit hits the fan (hence quick critical mass is needed). I'm not some Disney fan, quite the opposite, but Walt would have wanted it this way. permalink award report block reply edxzxz 1 points 5 hours ago Comment removed by community filter. permalink award report block reply\nThrilly 3 points 5 hours ago Send them back to Wakanda....Forever! permalink award report block reply\nIvanDrago 2 points 5 hours ago Let's milk the residual Wakanda hype. Disney wholly owns a new nation state in africa that is part theme park, part permanent residence. Africans from outside their home continent are encouraged to repatriate Wakanda via Disney's effective marketing and PR machinery. However, in order to join, they must relinquish their non-Wakandan citizenship and sell any major financial and physical assets they hold which won't transfer. We all know how this kind of story eventually ends (Liberia) so it's critical to have the bulk of the admissable population move immediately, and achieve critical mass. Since the government has failed at these endeavors, the private sector, Disney in this case, has better odds of success. In turn, tax dollars may need to be promised to Disney for the eventual massive loss, which can be mitigated by formally establishing an independent government separate from Disney before shit hits the fan (hence quick critical mass is needed). I'm not some Disney fan, quite the opposite, but Walt would have wanted it this way. permalink award report block reply\nedxzxz 1 points 5 hours ago Comment removed by community filter. permalink award report block reply"}