{"id": "8185227", "contents": "124 The way things are going with lack of deportations, 600k chinese students and H1b talk; it's going to push the base past black pill and into an era that will make Nick Fuentes blush posted 9 hours ago by MemoryHoleyeO 26 comments award share download report block\n26 comments Sort by Top Top New Worst Old Save breadbaker 13 points 9 hours ago Probably. Also, Papa Trump in defending H-1Bs and cozying uo to Syrian Al-Queda which seem to have at least a cooperative relationship with Israel is very quickly ankle deep in the swamp. permalink award report block reply HumblePepe 13 points 8 hours ago Saying America has no talent is a death sentence for his administration, in my opinion. permalink parent award report block reply LORDFALCONE 9 points 8 hours ago The handling of the Epstein files and then calling us all losers and telling us to get over it really did a number on his legacy permalink parent award report block reply LiteraIIyHitIer 2 points 2 hours ago You're still talking about that guy? permalink parent award report block reply GatoradeJeb 2 points 5 hours ago Say goodbye to midterms. Im not voting for any party that hates me for being a White man and wants me replaced with browns while also refusing to ban racemix hollywood propaganda which makes White woman betray White man permalink parent award report block reply Awakened 9 points 8 hours ago I use to rage against black pillers many years ago here on thr Donald. They turned out to be right, I turned out to be wrong. A wise man adapts. A fool holds on to his wishes for comfort. permalink award report block reply LORDFALCONE 8 points 9 hours ago \"My spirit will rise from the grave and the whole world will know that I was right\" permalink award report block reply RolandDelacroix 4 points 8 hours ago If what the base wants doesn't get done, we will just keep pushing more extreme candidates.  It's how Germany eventually elected a leader who made the trains run on time and fixed the Weimar runaway inflation. Some people never learn from history. permalink award report block reply ReleasetheList 7 points 8 hours ago The goal is to flood us with so many foreigners that our voice no longer matters. 10 years max until this happens. permalink parent award report block reply GatoradeJeb 2 points 5 hours ago The bigger goal is they want White man replaced by browns and huniliated as we are left single as we watch White woman betray us by racemixing with the browns permalink parent award report block reply 10MeV 4 points 9 hours ago Is this from the countless injunctions, I wonder? permalink award report block reply davidanderson90 3 points 7 hours ago No. Because he has won a lot of the appeals and he’d have no problem having judges arrested for obstruction of justice or criminal violation of civil rights given the shenanigans they’ve pulled. Any semi rationale administration, given they can fire and hire loyalist fbi agents, hsi agents, secret service agents, and etc, would order specific trusted federal agents to go undercover in dem county election offices, ballot counting places, state dmvs given all the illegals issued licenses, and court houses to find the conspiracy, racketeering, and fraud yet no action. He claimed there was fraud in 24 and as soon as he won not one word about election fraud, no investigations into the AZ elections, and CA counting ballots for two weeks to flip seats, no undercover operations for fraud in 2025, and no state dmvs. permalink parent award report block reply GuerillaYourDreams 4 points 6 hours ago This post was reported. I'm going to allow it because Trump people ARE HERE and they need to see how disappointed his base of voters, his LOYAL BASE of voters, are with this BULLSHIT about H1b Visas, Chinese students (who should ALL BE EXPELLED from the US as suspected spies), his stance on Israel First and so much more. He's becoming \"just another politician\" in the eyes of too many of those who have supported Trump since the escalator days... and he needs to know that we're concerned about this. permalink award report block reply GatoradeJeb 2 points 5 hours ago I never cared about nick fuentes but he never attacked me for being White nor did he demonize me for it. So i have more respect for Nick than trump now. Even Desantis and Nikki were on the right of trump to this permalink award report block reply OK_Parmaker 1 points 8 hours ago Very well said permalink award report block reply SoulSnipper -1 points 8 hours ago Lack of deportations? Are you on crack? Psy-op somewhere else, loser permalink award report block reply GatoradeJeb 1 points 5 hours ago We are no where near on track to deport the 20 million broens biden let in, let alone the 40 million already here. And ziondon made the emss worse by flooding us with pajeets and slanteyes permalink parent award report block reply SoulSnipper 1 points 3 hours ago You're so obvious that it's insulting. Piss off back to Bluesky or Reddit, or whatever other hole you crept out from. permalink parent award report block reply RINO_fatigue -2 points 8 hours ago Anime is for faggots. permalink award report block reply Lurker404 4 points 8 hours ago Anime is orders of magnitude less faggy than what Hollywood is producing these days. permalink parent award report block reply RINO_fatigue 2 points 8 hours ago ywnbaw permalink parent award report block reply GatoradeJeb 1 points 5 hours ago Says the retard watching mcu and nickolodian permalink parent award report block reply Scipio_Americanus 5 points 8 hours ago Comment removed by community moderators. permalink award report block reply boogeyman420 3 points 8 hours ago Comment removed by community moderators. permalink award report block reply negative_entropy 1 points 8 hours ago Comment removed by community moderators. permalink parent award report block reply Be_The_Change 1 points 9 hours ago Comment removed by community moderators. permalink award report block reply\nbreadbaker 13 points 9 hours ago Probably. Also, Papa Trump in defending H-1Bs and cozying uo to Syrian Al-Queda which seem to have at least a cooperative relationship with Israel is very quickly ankle deep in the swamp. permalink award report block reply HumblePepe 13 points 8 hours ago Saying America has no talent is a death sentence for his administration, in my opinion. permalink parent award report block reply LORDFALCONE 9 points 8 hours ago The handling of the Epstein files and then calling us all losers and telling us to get over it really did a number on his legacy permalink parent award report block reply LiteraIIyHitIer 2 points 2 hours ago You're still talking about that guy? permalink parent award report block reply GatoradeJeb 2 points 5 hours ago Say goodbye to midterms. Im not voting for any party that hates me for being a White man and wants me replaced with browns while also refusing to ban racemix hollywood propaganda which makes White woman betray White man permalink parent award report block reply\nHumblePepe 13 points 8 hours ago Saying America has no talent is a death sentence for his administration, in my opinion. permalink parent award report block reply LORDFALCONE 9 points 8 hours ago The handling of the Epstein files and then calling us all losers and telling us to get over it really did a number on his legacy permalink parent award report block reply LiteraIIyHitIer 2 points 2 hours ago You're still talking about that guy? permalink parent award report block reply GatoradeJeb 2 points 5 hours ago Say goodbye to midterms. Im not voting for any party that hates me for being a White man and wants me replaced with browns while also refusing to ban racemix hollywood propaganda which makes White woman betray White man permalink parent award report block reply\nLORDFALCONE 9 points 8 hours ago The handling of the Epstein files and then calling us all losers and telling us to get over it really did a number on his legacy permalink parent award report block reply LiteraIIyHitIer 2 points 2 hours ago You're still talking about that guy? permalink parent award report block reply\nLiteraIIyHitIer 2 points 2 hours ago You're still talking about that guy? permalink parent award report block reply\nGatoradeJeb 2 points 5 hours ago Say goodbye to midterms. Im not voting for any party that hates me for being a White man and wants me replaced with browns while also refusing to ban racemix hollywood propaganda which makes White woman betray White man permalink parent award report block reply\nAwakened 9 points 8 hours ago I use to rage against black pillers many years ago here on thr Donald. They turned out to be right, I turned out to be wrong. A wise man adapts. A fool holds on to his wishes for comfort. permalink award report block reply\nLORDFALCONE 8 points 9 hours ago \"My spirit will rise from the grave and the whole world will know that I was right\" permalink award report block reply\nRolandDelacroix 4 points 8 hours ago If what the base wants doesn't get done, we will just keep pushing more extreme candidates.  It's how Germany eventually elected a leader who made the trains run on time and fixed the Weimar runaway inflation. Some people never learn from history. permalink award report block reply ReleasetheList 7 points 8 hours ago The goal is to flood us with so many foreigners that our voice no longer matters. 10 years max until this happens. permalink parent award report block reply GatoradeJeb 2 points 5 hours ago The bigger goal is they want White man replaced by browns and huniliated as we are left single as we watch White woman betray us by racemixing with the browns permalink parent award report block reply\nReleasetheList 7 points 8 hours ago The goal is to flood us with so many foreigners that our voice no longer matters. 10 years max until this happens. permalink parent award report block reply GatoradeJeb 2 points 5 hours ago The bigger goal is they want White man replaced by browns and huniliated as we are left single as we watch White woman betray us by racemixing with the browns permalink parent award report block reply\nGatoradeJeb 2 points 5 hours ago The bigger goal is they want White man replaced by browns and huniliated as we are left single as we watch White woman betray us by racemixing with the browns permalink parent award report block reply\n10MeV 4 points 9 hours ago Is this from the countless injunctions, I wonder? permalink award report block reply davidanderson90 3 points 7 hours ago No. Because he has won a lot of the appeals and he’d have no problem having judges arrested for obstruction of justice or criminal violation of civil rights given the shenanigans they’ve pulled. Any semi rationale administration, given they can fire and hire loyalist fbi agents, hsi agents, secret service agents, and etc, would order specific trusted federal agents to go undercover in dem county election offices, ballot counting places, state dmvs given all the illegals issued licenses, and court houses to find the conspiracy, racketeering, and fraud yet no action. He claimed there was fraud in 24 and as soon as he won not one word about election fraud, no investigations into the AZ elections, and CA counting ballots for two weeks to flip seats, no undercover operations for fraud in 2025, and no state dmvs. permalink parent award report block reply\ndavidanderson90 3 points 7 hours ago No. Because he has won a lot of the appeals and he’d have no problem having judges arrested for obstruction of justice or criminal violation of civil rights given the shenanigans they’ve pulled. Any semi rationale administration, given they can fire and hire loyalist fbi agents, hsi agents, secret service agents, and etc, would order specific trusted federal agents to go undercover in dem county election offices, ballot counting places, state dmvs given all the illegals issued licenses, and court houses to find the conspiracy, racketeering, and fraud yet no action. He claimed there was fraud in 24 and as soon as he won not one word about election fraud, no investigations into the AZ elections, and CA counting ballots for two weeks to flip seats, no undercover operations for fraud in 2025, and no state dmvs. permalink parent award report block reply\nGuerillaYourDreams 4 points 6 hours ago This post was reported. I'm going to allow it because Trump people ARE HERE and they need to see how disappointed his base of voters, his LOYAL BASE of voters, are with this BULLSHIT about H1b Visas, Chinese students (who should ALL BE EXPELLED from the US as suspected spies), his stance on Israel First and so much more. He's becoming \"just another politician\" in the eyes of too many of those who have supported Trump since the escalator days... and he needs to know that we're concerned about this. permalink award report block reply\nGatoradeJeb 2 points 5 hours ago I never cared about nick fuentes but he never attacked me for being White nor did he demonize me for it. So i have more respect for Nick than trump now. Even Desantis and Nikki were on the right of trump to this permalink award report block reply\nOK_Parmaker 1 points 8 hours ago Very well said permalink award report block reply\nSoulSnipper -1 points 8 hours ago Lack of deportations? Are you on crack? Psy-op somewhere else, loser permalink award report block reply GatoradeJeb 1 points 5 hours ago We are no where near on track to deport the 20 million broens biden let in, let alone the 40 million already here. And ziondon made the emss worse by flooding us with pajeets and slanteyes permalink parent award report block reply SoulSnipper 1 points 3 hours ago You're so obvious that it's insulting. Piss off back to Bluesky or Reddit, or whatever other hole you crept out from. permalink parent award report block reply\nGatoradeJeb 1 points 5 hours ago We are no where near on track to deport the 20 million broens biden let in, let alone the 40 million already here. And ziondon made the emss worse by flooding us with pajeets and slanteyes permalink parent award report block reply SoulSnipper 1 points 3 hours ago You're so obvious that it's insulting. Piss off back to Bluesky or Reddit, or whatever other hole you crept out from. permalink parent award report block reply\nSoulSnipper 1 points 3 hours ago You're so obvious that it's insulting. Piss off back to Bluesky or Reddit, or whatever other hole you crept out from. permalink parent award report block reply\nRINO_fatigue -2 points 8 hours ago Anime is for faggots. permalink award report block reply Lurker404 4 points 8 hours ago Anime is orders of magnitude less faggy than what Hollywood is producing these days. permalink parent award report block reply RINO_fatigue 2 points 8 hours ago ywnbaw permalink parent award report block reply GatoradeJeb 1 points 5 hours ago Says the retard watching mcu and nickolodian permalink parent award report block reply\nLurker404 4 points 8 hours ago Anime is orders of magnitude less faggy than what Hollywood is producing these days. permalink parent award report block reply RINO_fatigue 2 points 8 hours ago ywnbaw permalink parent award report block reply\nRINO_fatigue 2 points 8 hours ago ywnbaw permalink parent award report block reply\nGatoradeJeb 1 points 5 hours ago Says the retard watching mcu and nickolodian permalink parent award report block reply\nScipio_Americanus 5 points 8 hours ago Comment removed by community moderators. permalink award report block reply\nboogeyman420 3 points 8 hours ago Comment removed by community moderators. permalink award report block reply negative_entropy 1 points 8 hours ago Comment removed by community moderators. permalink parent award report block reply\nnegative_entropy 1 points 8 hours ago Comment removed by community moderators. permalink parent award report block reply\nBe_The_Change 1 points 9 hours ago Comment removed by community moderators. permalink award report block reply"}