{"id": "8185435", "contents": "56 \"There appears to be a persistent and fundamental misunderstanding, at the top, of H-1B visas and the kinds of jobs they are used for. The vast majority are used to either replace an American who already has the job with a cheap foreign alternative or bypass Americans altogether\" posted 4 hours ago by bleeje 10 comments award share report block The Columbia Bugle 🇺🇸 @ColumbiaBugle • 4h There appears to be a persistent and fundamental misunderstanding, at the top, of H-1B visas and the kinds of jobs they are used for. The vast majority are used to either replace an American who already has the job with a cheap foreign alternative or bypass Americans altogether RedWave Press @RedWave_Press • 5h Brian Kilmeade: President Trump and Laura Ingraham clashed on H-1B visas… Where do you stand Mr. Secretary? Secretary of Treasury Scott Bessent: “So I think the president's vision here is to bring in overseas workers where these jobs went, who have the skills, 3, 5, 7 years to\n10 comments Sort by Top Top New Worst Old Save TrumpWonByALandslide 8 points 3 hours ago Trump talked back in 2016 about how the entire H1B system is a complete scam. It's not a misunderstanding, there's something deeper here. permalink award report block reply newestofnew 6 points 3 hours ago its all a red herring honestly. we lost shipbuilding but we still have ship builders! we lost high precision manufacturing but we still have high skill machinists! we never ever stoped making semiconductors. ever. the idea that an apprenticeship program couldn't multiply this knowledge in 3 or 5 years is laughable and absurd. they don't want to do it. Jerome said 3 years ago they need to constrain wages to control inflation. that's what is going on here. permalink award report block reply Donsabai 2 points 3 hours ago Agreed permalink parent award report block reply Iremembermypassword 5 points 3 hours ago Why not train Americans? Even if it takes 5 years. permalink award report block reply PlayboyPringles 0 points 2 hours ago Did you read the full tweet?  It's cut off here but on the full text, he goes into depth a bit more.  He says bring in these foreign workers who are experienced so that they can TRAIN Americans and then we take over the workforce of those positions. This sounds like a good compromise to me.  They even said the foreigners return home after completing the training process. permalink parent award report block reply Iremembermypassword 2 points 2 hours ago It would, if we had not lived through decades of foreign workers replacing Americans. It sounds like an excuse to do more of the same and just keep hiring the foreigners. In addition, why don‘t Americans have these skills? Do literally zero Americans have battery making skills? permalink parent award report block reply Awakened 1 points 1 hour ago This Pede gets it. permalink parent award report block reply Awakened 1 points 1 hour ago Fuck compromise. We've been down this road before. It's always an excuse to fuck us harder in the end. There will be no compromise or the midterms will be a complete slaughter and Trump will not only be impeached this time, but removed. permalink parent award report block reply KeepingAmericaGreat 4 points 2 hours ago The part that stands out to me is this official expecting us to believe the H-1b folks will agree to leave after living in America for 5 years.  Or, that the politicians and judges will allow it. permalink award report block reply Donsabai 4 points 3 hours ago This is a lie. It is all part of Trump's negotiation with India on tariffs... to allow India to flood us, as Trump is allowing the Chinese students to FLOOD us with these enemies. Why?  Trump has some terrible, terrible counsellors giving him bad advice. permalink award report block reply Awakened 1 points 1 hour ago He is giving the people that say he got compromised with Epstein more and more ammo. permalink parent award report block reply\nTrumpWonByALandslide 8 points 3 hours ago Trump talked back in 2016 about how the entire H1B system is a complete scam. It's not a misunderstanding, there's something deeper here. permalink award report block reply\nnewestofnew 6 points 3 hours ago its all a red herring honestly. we lost shipbuilding but we still have ship builders! we lost high precision manufacturing but we still have high skill machinists! we never ever stoped making semiconductors. ever. the idea that an apprenticeship program couldn't multiply this knowledge in 3 or 5 years is laughable and absurd. they don't want to do it. Jerome said 3 years ago they need to constrain wages to control inflation. that's what is going on here. permalink award report block reply Donsabai 2 points 3 hours ago Agreed permalink parent award report block reply\nDonsabai 2 points 3 hours ago Agreed permalink parent award report block reply\nIremembermypassword 5 points 3 hours ago Why not train Americans? Even if it takes 5 years. permalink award report block reply PlayboyPringles 0 points 2 hours ago Did you read the full tweet?  It's cut off here but on the full text, he goes into depth a bit more.  He says bring in these foreign workers who are experienced so that they can TRAIN Americans and then we take over the workforce of those positions. This sounds like a good compromise to me.  They even said the foreigners return home after completing the training process. permalink parent award report block reply Iremembermypassword 2 points 2 hours ago It would, if we had not lived through decades of foreign workers replacing Americans. It sounds like an excuse to do more of the same and just keep hiring the foreigners. In addition, why don‘t Americans have these skills? Do literally zero Americans have battery making skills? permalink parent award report block reply Awakened 1 points 1 hour ago This Pede gets it. permalink parent award report block reply Awakened 1 points 1 hour ago Fuck compromise. We've been down this road before. It's always an excuse to fuck us harder in the end. There will be no compromise or the midterms will be a complete slaughter and Trump will not only be impeached this time, but removed. permalink parent award report block reply\nPlayboyPringles 0 points 2 hours ago Did you read the full tweet?  It's cut off here but on the full text, he goes into depth a bit more.  He says bring in these foreign workers who are experienced so that they can TRAIN Americans and then we take over the workforce of those positions. This sounds like a good compromise to me.  They even said the foreigners return home after completing the training process. permalink parent award report block reply Iremembermypassword 2 points 2 hours ago It would, if we had not lived through decades of foreign workers replacing Americans. It sounds like an excuse to do more of the same and just keep hiring the foreigners. In addition, why don‘t Americans have these skills? Do literally zero Americans have battery making skills? permalink parent award report block reply Awakened 1 points 1 hour ago This Pede gets it. permalink parent award report block reply Awakened 1 points 1 hour ago Fuck compromise. We've been down this road before. It's always an excuse to fuck us harder in the end. There will be no compromise or the midterms will be a complete slaughter and Trump will not only be impeached this time, but removed. permalink parent award report block reply\nIremembermypassword 2 points 2 hours ago It would, if we had not lived through decades of foreign workers replacing Americans. It sounds like an excuse to do more of the same and just keep hiring the foreigners. In addition, why don‘t Americans have these skills? Do literally zero Americans have battery making skills? permalink parent award report block reply Awakened 1 points 1 hour ago This Pede gets it. permalink parent award report block reply\nAwakened 1 points 1 hour ago This Pede gets it. permalink parent award report block reply\nAwakened 1 points 1 hour ago Fuck compromise. We've been down this road before. It's always an excuse to fuck us harder in the end. There will be no compromise or the midterms will be a complete slaughter and Trump will not only be impeached this time, but removed. permalink parent award report block reply\nKeepingAmericaGreat 4 points 2 hours ago The part that stands out to me is this official expecting us to believe the H-1b folks will agree to leave after living in America for 5 years.  Or, that the politicians and judges will allow it. permalink award report block reply\nDonsabai 4 points 3 hours ago This is a lie. It is all part of Trump's negotiation with India on tariffs... to allow India to flood us, as Trump is allowing the Chinese students to FLOOD us with these enemies. Why?  Trump has some terrible, terrible counsellors giving him bad advice. permalink award report block reply Awakened 1 points 1 hour ago He is giving the people that say he got compromised with Epstein more and more ammo. permalink parent award report block reply\nAwakened 1 points 1 hour ago He is giving the people that say he got compromised with Epstein more and more ammo. permalink parent award report block reply"}