{"id": "8185621", "contents": "146 \"The magical foreign worker who builds bridges that collapse and airplanes that fall out of the fucking sky are needed to come here and train Americans to do the shit that they themselves cannot do? Lol, lmao.\" posted 6 hours ago by bleeje 5 comments award share report block Dour Visage @DourVisage • 7h @ThomBrady5 The magical foreign worker who builds bridges that collapse and airplanes that fall out of the fucking sky are needed to come here and train Americans to do the shit that they themselves cannot do? Lol, lmao.\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style corntortilla 4 points 5 hours ago We do fine at building stuff that collapses and falls out of the sky. We don’t need help with that. permalink award report block reply tt777 1 points 5 hours ago Perhaps true, but I'd rather have an American do it than a foreigner. permalink parent award report block reply GA_Logic 3 points 6 hours ago Actually a better argument is foreigners come to the USA for their education. That means USA education is top notch and Americans born here have a competitive advantage. permalink award report block reply NotYourMan 2 points 5 hours ago Yes, every H1B-visa worker in high-tech has a masters degree from a US university.  This is part of the current H1B-visa federal laws.  I worked in a team of 30 where 25 of those were Indians with H1B-visas, mostly from ASU.  One guy told me that his tuition for his masters are ASU was paid for by the US government.  Now this crap must stop. permalink parent award report block reply NotYourMan 2 points 5 hours ago This is not a good idea.  I absolutely support Trump but he needs to take on the corporations.  Every H1B-visa worker needs a federal fee of 20% of their salary per year every year.  This fee will go to funding the education of American's who choose a protical major like computer science or EE or any other engineering.  It will not go to DEI majors like Racial Equity masters or HR degrees. permalink award report block reply\ncorntortilla 4 points 5 hours ago We do fine at building stuff that collapses and falls out of the sky. We don’t need help with that. permalink award report block reply tt777 1 points 5 hours ago Perhaps true, but I'd rather have an American do it than a foreigner. permalink parent award report block reply\ntt777 1 points 5 hours ago Perhaps true, but I'd rather have an American do it than a foreigner. permalink parent award report block reply\nGA_Logic 3 points 6 hours ago Actually a better argument is foreigners come to the USA for their education. That means USA education is top notch and Americans born here have a competitive advantage. permalink award report block reply NotYourMan 2 points 5 hours ago Yes, every H1B-visa worker in high-tech has a masters degree from a US university.  This is part of the current H1B-visa federal laws.  I worked in a team of 30 where 25 of those were Indians with H1B-visas, mostly from ASU.  One guy told me that his tuition for his masters are ASU was paid for by the US government.  Now this crap must stop. permalink parent award report block reply\nNotYourMan 2 points 5 hours ago Yes, every H1B-visa worker in high-tech has a masters degree from a US university.  This is part of the current H1B-visa federal laws.  I worked in a team of 30 where 25 of those were Indians with H1B-visas, mostly from ASU.  One guy told me that his tuition for his masters are ASU was paid for by the US government.  Now this crap must stop. permalink parent award report block reply\nNotYourMan 2 points 5 hours ago This is not a good idea.  I absolutely support Trump but he needs to take on the corporations.  Every H1B-visa worker needs a federal fee of 20% of their salary per year every year.  This fee will go to funding the education of American's who choose a protical major like computer science or EE or any other engineering.  It will not go to DEI majors like Racial Equity masters or HR degrees. permalink award report block reply"}