{
  "id": "1ARK5904e5",
  "url": "https://patriots.win/p/1ARK5904e5/over-1-million-stolen-identities/c",
  "content": "916 Over 1 million stolen identities of Americans were used to make false Medicare claims, stealing $14.6 billion dollars from American taxpayers. posted 4 days ago by KuzoKevin 35 comments award share report block Wall Street Apes @WallStreetApes • 4d Over 1 million stolen identities of Americans were used to make false Medicare claims, stealing $14.6 billion dollars from American taxpayers - $14.6 billion in false claims - Pakistani executives charged in Illinois for $703 million scheme using stolen Medicare data - DOJ\n35 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style RYTHMICRIOT 37 points 4 days ago Now do voting permalink award report block reply bigdickhangsright 20 points 4 days ago Now do H1B credentials. permalink parent award report block reply awsure 9 points 4 days ago Now do democrat party permalink parent award report block reply BeauHD 5 points 4 days ago GLWT permalink parent award report block reply Hanging_Chad 0 points 4 days ago 🤞🏻 permalink parent award report block reply suckmycorona 2 points 4 days ago Now do Schumer. permalink parent award report block reply ForgottenUsername 13 points 4 days ago I get constant calls from Medicare/Medicaid kind of scams because my mother is in poor health.   Always the Indian accent.   Always a busy call center with chatter in the background.   Some of them sound legit, because they are for things that really apply to her.    My theory is that they steal medical information to make the scams more believable.    Either that or they outsourced so much that they're not getting a dollar in protest.   So I'm hanging up either way. permalink award report block reply ItsFunToSay-M-A-G-A 5 points 4 days ago 📞 Hiiiiii this is Steeeve with Mad-ee-care Ban-eff-etts, how are you do-eenk today, saar? permalink parent award report block reply Bunnybudman 5 points 4 days ago DO NOT REDEEM!! WHY DO YOU REDEEM! permalink parent award report block reply anotherthing 2 points 3 days ago I get a ton of them also, and I'm in my early 50s and in pretty decent health. It's not just because your mother is in poor health. They fish a lot. permalink parent award report block reply 2025WhatIsTrue 12 points 4 days ago So much corruption...so little time. permalink award report block reply KuzoKevin OP 11 points 4 days ago Life sentences in max prisons. permalink award report block reply USDMaga 7 points 4 days ago The 2 of them wearing Trump hats will be fully prosecuted. The other 999,998 will be ignored by the DOJ permalink award report block reply GreyKnight 6 points 4 days ago This happens with every federal and state level social welfare program. Africa, India, China and others have been stealing much of our money for the better part of the past 2-3 decades. permalink award report block reply Smurfection 4 points 4 days ago 10 billion there 10 billion here and pretty soon we're talking about real money. Congress, please end this. permalink award report block reply madisonmaga 4 points 4 days ago Kill the perpetrators on live TV. Hang them all. permalink award report block reply mikethemarine 4 points 4 days ago government is way to big, if they can't keep track of where the money is going especially that amount of money, if $10 is missing from my account I want to know where it went and if I find $10 missing I start searching for pennies permalink award report block reply billybaldwin2 3 points 4 days ago Pakistani like they're in Pakistan or from Pakistan, living in America and prison time + fines? permalink award report block reply SpellingContable 4 points 4 days ago sounds like from inside America. permalink parent award report block reply ForgottenUsername 3 points 4 days ago So the calls are coming from inside the house? permalink parent award report block reply SpellingContable 1 points 4 days ago Haha, yes. The cops caught them exiting to the neighbors after the jig was up. permalink parent award report block reply Bunnybudman 3 points 4 days ago Stolen- huh? Totally not organized in the way that when places like AT&T get “hacked” and it leaks all our data. No- couldn’t possibly be organized like that. permalink award report block reply booblitchutz 2 points 3 days ago Everyone’s SSN is out there now. permalink parent award report block reply Easzq8 3 points 4 days ago This can all be fixed by eliminating welfare. permalink award report block reply Snooptwo 3 points 4 days ago 50,000 Americans could buy a $300k house with that much money. It’s enough money to give every American $40,000 with money left over. permalink award report block reply Formerlurker92 2 points 4 days ago Hang them permalink award report block reply remindmelater 2 points 3 days ago I have found in a very short time......that doctors are adding in bogus charges to their medicare bills to the gov't.  I guess they think nobody will ever look at the bills......I'm sure this practice is widespread.......very unethical to be sure..... permalink award report block reply HowLongIsNever 2 points 4 days ago I was a victim of this type of fraud when I lived in California. I was between jobs and applied for SNAP. Couldn’t get it because someone else was using my SSN. Asked the lady on the phone who and all she could tell me is it was a female and therefore not me. I asked if she could do something about that like escalate this to higher ups and she said no. Luckily I had family I could rely on. To this day I have no idea if it’s still being used, but I no longer live in California at least. permalink award report block reply Aggrieved03 2 points 4 days ago How many foreign born doctors were involved? permalink award report block reply keeman 2 points 4 days ago What part of the constitution  specifically authorizes medicare?  End it.  Solves this problem also. permalink award report block reply Ihateallliars 1 points 4 days ago People have no say about anything anymore. I found this out when I tried to keep my insurance companies, including Medicare, from paying a doctor who should have been sued for malpractice. It's like we're in the system they'll use us like a number, but as humans we have no validity. permalink award report block reply Tabascocat12 1 points 4 days ago They sure do find a lot of crime and treason yet choose to prosecute.  I don’t just blame Blondi either, they won’t hold themselves accountable. permalink award report block reply Mudbutt 1 points 4 days ago I bet it's mostly foreigner doctors permalink award report block reply TNgirl4Trump 1 points 4 days ago Every time I see one of these stories I wonder if there’s a way to find out if your information was used. Is there any way to find out? Would they contact victims of identity theft? permalink award report block reply HowLongIsNever 4 points 4 days ago There is one way. I was a victim of this type of fraud when I lived in California. I was between jobs and applied for SNAP. Couldn’t get it because someone else was using my SSN. Asked the lady on the phone who and all she could tell me is it was a female and therefore not me. I asked if she could do something about that like escalate this to higher ups and she said no. Luckily I had family I could rely on. To this day I have no idea if it’s still being used, but I no longer live in California at least. permalink parent award report block reply\nRYTHMICRIOT 37 points 4 days ago Now do voting permalink award report block reply bigdickhangsright 20 points 4 days ago Now do H1B credentials. permalink parent award report block reply awsure 9 points 4 days ago Now do democrat party permalink parent award report block reply BeauHD 5 points 4 days ago GLWT permalink parent award report block reply Hanging_Chad 0 points 4 days ago 🤞🏻 permalink parent award report block reply suckmycorona 2 points 4 days ago Now do Schumer. permalink parent award report block reply\nbigdickhangsright 20 points 4 days ago Now do H1B credentials. permalink parent award report block reply\nawsure 9 points 4 days ago Now do democrat party permalink parent award report block reply\nBeauHD 5 points 4 days ago GLWT permalink parent award report block reply Hanging_Chad 0 points 4 days ago 🤞🏻 permalink parent award report block reply\nHanging_Chad 0 points 4 days ago 🤞🏻 permalink parent award report block reply\nsuckmycorona 2 points 4 days ago Now do Schumer. permalink parent award report block reply\nForgottenUsername 13 points 4 days ago I get constant calls from Medicare/Medicaid kind of scams because my mother is in poor health.   Always the Indian accent.   Always a busy call center with chatter in the background.   Some of them sound legit, because they are for things that really apply to her.    My theory is that they steal medical information to make the scams more believable.    Either that or they outsourced so much that they're not getting a dollar in protest.   So I'm hanging up either way. permalink award report block reply ItsFunToSay-M-A-G-A 5 points 4 days ago 📞 Hiiiiii this is Steeeve with Mad-ee-care Ban-eff-etts, how are you do-eenk today, saar? permalink parent award report block reply Bunnybudman 5 points 4 days ago DO NOT REDEEM!! WHY DO YOU REDEEM! permalink parent award report block reply anotherthing 2 points 3 days ago I get a ton of them also, and I'm in my early 50s and in pretty decent health. It's not just because your mother is in poor health. They fish a lot. permalink parent award report block reply\nItsFunToSay-M-A-G-A 5 points 4 days ago 📞 Hiiiiii this is Steeeve with Mad-ee-care Ban-eff-etts, how are you do-eenk today, saar? permalink parent award report block reply Bunnybudman 5 points 4 days ago DO NOT REDEEM!! WHY DO YOU REDEEM! permalink parent award report block reply\nBunnybudman 5 points 4 days ago DO NOT REDEEM!! WHY DO YOU REDEEM! permalink parent award report block reply\nanotherthing 2 points 3 days ago I get a ton of them also, and I'm in my early 50s and in pretty decent health. It's not just because your mother is in poor health. They fish a lot. permalink parent award report block reply\n2025WhatIsTrue 12 points 4 days ago So much corruption...so little time. permalink award report block reply\nKuzoKevin OP 11 points 4 days ago Life sentences in max prisons. permalink award report block reply\nUSDMaga 7 points 4 days ago The 2 of them wearing Trump hats will be fully prosecuted. The other 999,998 will be ignored by the DOJ permalink award report block reply\nGreyKnight 6 points 4 days ago This happens with every federal and state level social welfare program. Africa, India, China and others have been stealing much of our money for the better part of the past 2-3 decades. permalink award report block reply\nSmurfection 4 points 4 days ago 10 billion there 10 billion here and pretty soon we're talking about real money. Congress, please end this. permalink award report block reply\nmadisonmaga 4 points 4 days ago Kill the perpetrators on live TV. Hang them all. permalink award report block reply\nmikethemarine 4 points 4 days ago government is way to big, if they can't keep track of where the money is going especially that amount of money, if $10 is missing from my account I want to know where it went and if I find $10 missing I start searching for pennies permalink award report block reply\nbillybaldwin2 3 points 4 days ago Pakistani like they're in Pakistan or from Pakistan, living in America and prison time + fines? permalink award report block reply SpellingContable 4 points 4 days ago sounds like from inside America. permalink parent award report block reply ForgottenUsername 3 points 4 days ago So the calls are coming from inside the house? permalink parent award report block reply SpellingContable 1 points 4 days ago Haha, yes. The cops caught them exiting to the neighbors after the jig was up. permalink parent award report block reply\nSpellingContable 4 points 4 days ago sounds like from inside America. permalink parent award report block reply ForgottenUsername 3 points 4 days ago So the calls are coming from inside the house? permalink parent award report block reply SpellingContable 1 points 4 days ago Haha, yes. The cops caught them exiting to the neighbors after the jig was up. permalink parent award report block reply\nForgottenUsername 3 points 4 days ago So the calls are coming from inside the house? permalink parent award report block reply SpellingContable 1 points 4 days ago Haha, yes. The cops caught them exiting to the neighbors after the jig was up. permalink parent award report block reply\nSpellingContable 1 points 4 days ago Haha, yes. The cops caught them exiting to the neighbors after the jig was up. permalink parent award report block reply\nBunnybudman 3 points 4 days ago Stolen- huh? Totally not organized in the way that when places like AT&T get “hacked” and it leaks all our data. No- couldn’t possibly be organized like that. permalink award report block reply booblitchutz 2 points 3 days ago Everyone’s SSN is out there now. permalink parent award report block reply\nbooblitchutz 2 points 3 days ago Everyone’s SSN is out there now. permalink parent award report block reply\nEaszq8 3 points 4 days ago This can all be fixed by eliminating welfare. permalink award report block reply\nSnooptwo 3 points 4 days ago 50,000 Americans could buy a $300k house with that much money. It’s enough money to give every American $40,000 with money left over. permalink award report block reply\nFormerlurker92 2 points 4 days ago Hang them permalink award report block reply\nremindmelater 2 points 3 days ago I have found in a very short time......that doctors are adding in bogus charges to their medicare bills to the gov't.  I guess they think nobody will ever look at the bills......I'm sure this practice is widespread.......very unethical to be sure..... permalink award report block reply\nHowLongIsNever 2 points 4 days ago I was a victim of this type of fraud when I lived in California. I was between jobs and applied for SNAP. Couldn’t get it because someone else was using my SSN. Asked the lady on the phone who and all she could tell me is it was a female and therefore not me. I asked if she could do something about that like escalate this to higher ups and she said no. Luckily I had family I could rely on. To this day I have no idea if it’s still being used, but I no longer live in California at least. permalink award report block reply\nAggrieved03 2 points 4 days ago How many foreign born doctors were involved? permalink award report block reply\nkeeman 2 points 4 days ago What part of the constitution  specifically authorizes medicare?  End it.  Solves this problem also. permalink award report block reply\nIhateallliars 1 points 4 days ago People have no say about anything anymore. I found this out when I tried to keep my insurance companies, including Medicare, from paying a doctor who should have been sued for malpractice. It's like we're in the system they'll use us like a number, but as humans we have no validity. permalink award report block reply\nTabascocat12 1 points 4 days ago They sure do find a lot of crime and treason yet choose to prosecute.  I don’t just blame Blondi either, they won’t hold themselves accountable. permalink award report block reply\nMudbutt 1 points 4 days ago I bet it's mostly foreigner doctors permalink award report block reply\nTNgirl4Trump 1 points 4 days ago Every time I see one of these stories I wonder if there’s a way to find out if your information was used. Is there any way to find out? Would they contact victims of identity theft? permalink award report block reply HowLongIsNever 4 points 4 days ago There is one way. I was a victim of this type of fraud when I lived in California. I was between jobs and applied for SNAP. Couldn’t get it because someone else was using my SSN. Asked the lady on the phone who and all she could tell me is it was a female and therefore not me. I asked if she could do something about that like escalate this to higher ups and she said no. Luckily I had family I could rely on. To this day I have no idea if it’s still being used, but I no longer live in California at least. permalink parent award report block reply\nHowLongIsNever 4 points 4 days ago There is one way. I was a victim of this type of fraud when I lived in California. I was between jobs and applied for SNAP. Couldn’t get it because someone else was using my SSN. Asked the lady on the phone who and all she could tell me is it was a female and therefore not me. I asked if she could do something about that like escalate this to higher ups and she said no. Luckily I had family I could rely on. To this day I have no idea if it’s still being used, but I no longer live in California at least. permalink parent award report block reply"
}