{
  "id": "1ARK591iwG",
  "url": "https://patriots.win/p/1ARK591iwG/x/c",
  "content": "698 🍴 posted 3 days ago by Looniz74 PRO 18 comments award share report block Gunther Eagleman™ @GuntherEagleman • 3d\n18 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno friarfox 11 points 3 days ago Starving African children will be sending New York money and adopting a starving resident. permalink award report block reply RememberCharlieKirk 7 points 3 days ago Communists do not \"ask\" for money. I think the Tom Selleck meme \"Give me your house\" (where Selleck is pointing a gun) is more appropriate. permalink award report block reply MAGAguitar 5 points 3 days ago He’ll take over hotels for “free” housing. Capitalist built hotels. permalink award report block reply godgoldnguns 5 points 3 days ago It will take $20 or $200 a day... permalink award report block reply Sparkywalnutz 3 points 3 days ago Exactly! We're talking government run here. permalink parent award report block reply Rock9Head 3 points 3 days ago I will give a quarter a day, on the condition that the money does not go to feed a morbidly obese and unemployed welfare queen. permalink award report block reply Prof_Smith 2 points 3 days ago Nope.  I do not care what happens to NYC.  I can no longer even pretend to care about people I don’t like. permalink award report block reply SuperHonkey 2 points 3 days ago Nope, elections have consequences. Enjoy your 'fast' retards. permalink award report block reply DCYR66 1 points 3 days ago Here’s my down payment 🖕!!!!! permalink award report block reply Looniz74 OP PRO 1 points 3 days ago https://x.com/GuntherEagleman/status/1987482760299048984?s=20 permalink award report block reply barwhack 1 points 3 days ago Nope. I don't want New Yorkers taking over Minneannapolis, either... permalink award report block reply nemonster 1 points 3 days ago Biden asked 10. permalink award report block reply Maga305_47 1 points 3 days ago There will be a bridge for sale in a matter of months. permalink award report block reply AlmostFullyDilated 1 points 3 days ago I wouldn't give a single penny to save a new yorker permalink award report block reply Easzq8 1 points 3 days ago Can I pay 25 cents to throw a boot a New Yorker’s head? Might make them smarter 🤷‍♂️ permalink award report block reply JoeBidensDementia1 1 points 3 days ago Nah, let them starve. permalink award report block reply Thefrogeatsfree 1 points 3 days ago Needs 5 more zeros permalink award report block reply\nfriarfox 11 points 3 days ago Starving African children will be sending New York money and adopting a starving resident. permalink award report block reply\nRememberCharlieKirk 7 points 3 days ago Communists do not \"ask\" for money. I think the Tom Selleck meme \"Give me your house\" (where Selleck is pointing a gun) is more appropriate. permalink award report block reply\nMAGAguitar 5 points 3 days ago He’ll take over hotels for “free” housing. Capitalist built hotels. permalink award report block reply\ngodgoldnguns 5 points 3 days ago It will take $20 or $200 a day... permalink award report block reply Sparkywalnutz 3 points 3 days ago Exactly! We're talking government run here. permalink parent award report block reply\nSparkywalnutz 3 points 3 days ago Exactly! We're talking government run here. permalink parent award report block reply\nRock9Head 3 points 3 days ago I will give a quarter a day, on the condition that the money does not go to feed a morbidly obese and unemployed welfare queen. permalink award report block reply\nProf_Smith 2 points 3 days ago Nope.  I do not care what happens to NYC.  I can no longer even pretend to care about people I don’t like. permalink award report block reply\nSuperHonkey 2 points 3 days ago Nope, elections have consequences. Enjoy your 'fast' retards. permalink award report block reply\nDCYR66 1 points 3 days ago Here’s my down payment 🖕!!!!! permalink award report block reply\nLooniz74 OP PRO 1 points 3 days ago https://x.com/GuntherEagleman/status/1987482760299048984?s=20 permalink award report block reply\nbarwhack 1 points 3 days ago Nope. I don't want New Yorkers taking over Minneannapolis, either... permalink award report block reply\nnemonster 1 points 3 days ago Biden asked 10. permalink award report block reply\nMaga305_47 1 points 3 days ago There will be a bridge for sale in a matter of months. permalink award report block reply\nAlmostFullyDilated 1 points 3 days ago I wouldn't give a single penny to save a new yorker permalink award report block reply\nEaszq8 1 points 3 days ago Can I pay 25 cents to throw a boot a New Yorker’s head? Might make them smarter 🤷‍♂️ permalink award report block reply\nJoeBidensDementia1 1 points 3 days ago Nah, let them starve. permalink award report block reply\nThefrogeatsfree 1 points 3 days ago Needs 5 more zeros permalink award report block reply",
  "fetched_at": "2025-11-12T23:14:13.317856Z"
}