{
  "id": "1ARK5BGahh",
  "url": "https://patriots.win/p/1ARK5BGahh/the-canadian-government-killed-h/c",
  "content": "380 The Canadian government killed hundreds of healthy pet ostriches because a few had a positive P.C.R. test 2-3 years ago. 🛁🩸   BLOODBATH   🩸🛁 posted 3 days ago by SERP-SERP 27 comments award share download report block\n27 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget HappyFunBall 30 points 3 days ago That's crazy. Next they'll start euthanizing people. Oh wait. permalink award report block reply bigdickhangsright 16 points 3 days ago Next they'll be genociding white people by allowing every other race to flood the country and creating laws that discriminate against whites and make it harder to live than others. Oh wait. permalink parent award report block reply TheAftermath 22 points 3 days ago All PCR tests are faulty and their results are used fraudulently. Even the inventor of the test admitted as much. Canada is a WEF-CCP state and is now almost fully totalitarian. permalink award report block reply Votingnerd 9 points 3 days ago Yep, true story permalink parent award report block reply chickeninoven 6 points 3 days ago Wait, you mean the inventor who died suspiciously right before the first reports of COIVD showed up? permalink parent award report block reply pedespeed 2 points 3 days ago Or could it have been the Dr. who had conflict with Fauci during the AIDS \"pandemic\"? permalink parent award report block reply suckmycorona 6 points 3 days ago Almost was a few years ago permalink parent award report block reply gasemall 2 points 3 days ago And is a national security threat to the United States.  Better invade, it is the only way to be sure. permalink parent award report block reply Jrtomasejn 15 points 3 days ago Farm was working with lab. Ostrich Eggs. Medical breakthrough ensued. Lab shut down, Ostrich slaughter... What Breakthrough. permalink award report block reply TheAftermath 10 points 3 days ago And when it was found that chicken eggs reversed the side effects of the MRNA injections, all the poultry farms started going up in smoke. permalink parent award report block reply SERP-SERP OP 9 points 3 days ago The Canadian police also siezed & destroyed  the ostrich  eggs, even though they couldn't possibly have the alleged flu that the ostriches tested positive with. permalink parent award report block reply TheAftermath 5 points 3 days ago Unadulterated malice. Evil. permalink parent award report block reply suckmycorona 4 points 3 days ago Hope they had masks on and were vaccinated cause it could have been a lot worse.  Actually no fuck them. permalink parent award report block reply gasemall 2 points 3 days ago Now there is an avian flu outbreak at the Summerland Animal Sanctuary, let's see if they cull these animals too. https://www.kelownanow.com/watercooler/news/news/Okanagan/Summerland_s_Critteraid_Animal_Sanctuary_devastated_by_discovery_of_avian_flu_case/ permalink parent award report block reply ChyNahAzzWhole1 13 points 3 days ago 400... 2 died and they set the bird flu variables so sensitive that a Rock would have tested positive.\nThe Canadian Gubmint knew the ostriches were being researched to document the benefits .o permalink award report block reply SERP-SERP OP 12 points 3 days ago These ostriches were on their family farm for over 35 years, If you're right of Stalin, the government will kill your pets. permalink award report block reply LegendFang 9 points 3 days ago Poor Canada has gone down the tubes entirely. permalink award report block reply TheAftermath 7 points 3 days ago https://patriots.win/p/1ARK5BGJzE/vast-majority-of-covid-pcr-tests/c permalink award report block reply Trumpluv77 2 points 3 days ago This sickens me. It wasn't about HEALTH. It was bout CONTROL...and the Canadian government is sick af!!!!! permalink award report block reply Mhmm2MoreWeeks 2 points 3 days ago The Government of BC Canada is called NDP. They are who Leftists call Leftists, and telling you they are BATSHIT CRAZY would be a failure to take Batshit seriously. They are PSYCHOPATHS. permalink award report block reply gasemall 1 points 3 days ago THIS permalink parent award report block reply morememesplz 1 points 3 days ago Canada. Retards gonna retard. permalink award report block reply MPitcher1776 1 points 3 days ago Disgusting! I hate the Canadian government!!! permalink award report block reply Italianshamrock 1 points 3 days ago 400 permalink award report block reply Synonymity 1 points 3 days ago You failed a Cvd test n 2022. Put on the blind fold. permalink award report block reply Tacitus1963 1 points 3 days ago It's absolutely horrific what they did to those poor ostriches.\nThe Canadians need to rise against their WEF fag gov. permalink award report block reply\nHappyFunBall 30 points 3 days ago That's crazy. Next they'll start euthanizing people. Oh wait. permalink award report block reply bigdickhangsright 16 points 3 days ago Next they'll be genociding white people by allowing every other race to flood the country and creating laws that discriminate against whites and make it harder to live than others. Oh wait. permalink parent award report block reply\nbigdickhangsright 16 points 3 days ago Next they'll be genociding white people by allowing every other race to flood the country and creating laws that discriminate against whites and make it harder to live than others. Oh wait. permalink parent award report block reply\nTheAftermath 22 points 3 days ago All PCR tests are faulty and their results are used fraudulently. Even the inventor of the test admitted as much. Canada is a WEF-CCP state and is now almost fully totalitarian. permalink award report block reply Votingnerd 9 points 3 days ago Yep, true story permalink parent award report block reply chickeninoven 6 points 3 days ago Wait, you mean the inventor who died suspiciously right before the first reports of COIVD showed up? permalink parent award report block reply pedespeed 2 points 3 days ago Or could it have been the Dr. who had conflict with Fauci during the AIDS \"pandemic\"? permalink parent award report block reply suckmycorona 6 points 3 days ago Almost was a few years ago permalink parent award report block reply gasemall 2 points 3 days ago And is a national security threat to the United States.  Better invade, it is the only way to be sure. permalink parent award report block reply\nVotingnerd 9 points 3 days ago Yep, true story permalink parent award report block reply\nchickeninoven 6 points 3 days ago Wait, you mean the inventor who died suspiciously right before the first reports of COIVD showed up? permalink parent award report block reply pedespeed 2 points 3 days ago Or could it have been the Dr. who had conflict with Fauci during the AIDS \"pandemic\"? permalink parent award report block reply\npedespeed 2 points 3 days ago Or could it have been the Dr. who had conflict with Fauci during the AIDS \"pandemic\"? permalink parent award report block reply\nsuckmycorona 6 points 3 days ago Almost was a few years ago permalink parent award report block reply\ngasemall 2 points 3 days ago And is a national security threat to the United States.  Better invade, it is the only way to be sure. permalink parent award report block reply\nJrtomasejn 15 points 3 days ago Farm was working with lab. Ostrich Eggs. Medical breakthrough ensued. Lab shut down, Ostrich slaughter... What Breakthrough. permalink award report block reply TheAftermath 10 points 3 days ago And when it was found that chicken eggs reversed the side effects of the MRNA injections, all the poultry farms started going up in smoke. permalink parent award report block reply SERP-SERP OP 9 points 3 days ago The Canadian police also siezed & destroyed  the ostrich  eggs, even though they couldn't possibly have the alleged flu that the ostriches tested positive with. permalink parent award report block reply TheAftermath 5 points 3 days ago Unadulterated malice. Evil. permalink parent award report block reply suckmycorona 4 points 3 days ago Hope they had masks on and were vaccinated cause it could have been a lot worse.  Actually no fuck them. permalink parent award report block reply gasemall 2 points 3 days ago Now there is an avian flu outbreak at the Summerland Animal Sanctuary, let's see if they cull these animals too. https://www.kelownanow.com/watercooler/news/news/Okanagan/Summerland_s_Critteraid_Animal_Sanctuary_devastated_by_discovery_of_avian_flu_case/ permalink parent award report block reply\nTheAftermath 10 points 3 days ago And when it was found that chicken eggs reversed the side effects of the MRNA injections, all the poultry farms started going up in smoke. permalink parent award report block reply SERP-SERP OP 9 points 3 days ago The Canadian police also siezed & destroyed  the ostrich  eggs, even though they couldn't possibly have the alleged flu that the ostriches tested positive with. permalink parent award report block reply TheAftermath 5 points 3 days ago Unadulterated malice. Evil. permalink parent award report block reply suckmycorona 4 points 3 days ago Hope they had masks on and were vaccinated cause it could have been a lot worse.  Actually no fuck them. permalink parent award report block reply\nSERP-SERP OP 9 points 3 days ago The Canadian police also siezed & destroyed  the ostrich  eggs, even though they couldn't possibly have the alleged flu that the ostriches tested positive with. permalink parent award report block reply TheAftermath 5 points 3 days ago Unadulterated malice. Evil. permalink parent award report block reply suckmycorona 4 points 3 days ago Hope they had masks on and were vaccinated cause it could have been a lot worse.  Actually no fuck them. permalink parent award report block reply\nTheAftermath 5 points 3 days ago Unadulterated malice. Evil. permalink parent award report block reply\nsuckmycorona 4 points 3 days ago Hope they had masks on and were vaccinated cause it could have been a lot worse.  Actually no fuck them. permalink parent award report block reply\ngasemall 2 points 3 days ago Now there is an avian flu outbreak at the Summerland Animal Sanctuary, let's see if they cull these animals too. https://www.kelownanow.com/watercooler/news/news/Okanagan/Summerland_s_Critteraid_Animal_Sanctuary_devastated_by_discovery_of_avian_flu_case/ permalink parent award report block reply\nChyNahAzzWhole1 13 points 3 days ago 400... 2 died and they set the bird flu variables so sensitive that a Rock would have tested positive.\nThe Canadian Gubmint knew the ostriches were being researched to document the benefits .o permalink award report block reply\nSERP-SERP OP 12 points 3 days ago These ostriches were on their family farm for over 35 years, If you're right of Stalin, the government will kill your pets. permalink award report block reply\nLegendFang 9 points 3 days ago Poor Canada has gone down the tubes entirely. permalink award report block reply\nTheAftermath 7 points 3 days ago https://patriots.win/p/1ARK5BGJzE/vast-majority-of-covid-pcr-tests/c permalink award report block reply\nTrumpluv77 2 points 3 days ago This sickens me. It wasn't about HEALTH. It was bout CONTROL...and the Canadian government is sick af!!!!! permalink award report block reply\nMhmm2MoreWeeks 2 points 3 days ago The Government of BC Canada is called NDP. They are who Leftists call Leftists, and telling you they are BATSHIT CRAZY would be a failure to take Batshit seriously. They are PSYCHOPATHS. permalink award report block reply gasemall 1 points 3 days ago THIS permalink parent award report block reply\ngasemall 1 points 3 days ago THIS permalink parent award report block reply\nmorememesplz 1 points 3 days ago Canada. Retards gonna retard. permalink award report block reply\nMPitcher1776 1 points 3 days ago Disgusting! I hate the Canadian government!!! permalink award report block reply\nItalianshamrock 1 points 3 days ago 400 permalink award report block reply\nSynonymity 1 points 3 days ago You failed a Cvd test n 2022. Put on the blind fold. permalink award report block reply\nTacitus1963 1 points 3 days ago It's absolutely horrific what they did to those poor ostriches.\nThe Canadians need to rise against their WEF fag gov. permalink award report block reply",
  "fetched_at": "2025-11-12T22:59:44.471852Z"
}