{
  "id": "1ARK9oWN9e",
  "url": "https://patriots.win/p/1ARK9oWN9e/pam-bondi-is-bill-barr-20-and-wi/c",
  "content": "114 Pam Bondi is Bill Barr 2.0, and without arrest and making example of Traitors, everything MAGA and Trump do is temporary and will be rapidly undone in a few short years.  I have been dissapointed one too many times. No arrests. No midterm vote. Simple as that. posted 2 hours ago by Mhmm2MoreWeeks 29 comments award share download report block\n29 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MAG-n-KAG 8 points 2 hours ago \"I think she's doing a great job.\" At some point, the finger has to be pointed at the boss man himself. permalink award report block reply HumblePepe 3 points 1 hour ago Buck has to stop somewhere permalink parent award report block reply mojorisen -3 points 2 hours ago Several deep state indictments and more coming down the pipe.  This is impressive because it was done so quickly.  It usually takes far more than 10 months to put a case together for a high profile target.  You have to make sure everything is perfect knowing that you are going in front of a hostile judge and jury. If you know how the system works, this is undeniably a \"great job\".  If you don't than you come to patriots.win and cry and moan. Yes, she has made big mistakes. Yes she goes on Fox news every 5 mins but she has still done a great job with the number of indictments in a short period of time.  Like Trump she still has to follow laws and stay within a Constitution framework. permalink parent award report block reply Steve56775 5 points 1 hour ago I still can’t get the “binders” out of my head. What kind of shitshow was that? permalink parent award report block reply Aggrieved03 1 points 57 minutes ago Essentially jaywalking charges compared to their crimes. permalink parent award report block reply Mhmm2MoreWeeks OP 5 points 2 hours ago Nothing that Important has happened or been changed. All just pyrrhic victories so far. And since Republicans become complacent after nearly nothing but rhetoric their enemies just continue on with their schemes like nothing has changed. Because it hasn't. Not really. Bondi and Patel are literally living in fear for their safety and that of their loved ones are are the entire admin. There is not enough protection for them to follow through and then keep their families safe forever. Trump is the start. The real change has to come after a few more rounds of pain. Maybe in a generation. If millions of us are not eagerly ready to risk our lives then we are not at that critical moment. Deep State Globalism is not beaten with an election. It is beaten by making examples being made out of its ring leaders and their families. Our generation is not ready for that, but the next, after a lifetime of poverty, just might be. Freedom is never given. It is only taken by force, every 4-6 generations. permalink award report block reply HumblePepe 4 points 1 hour ago Trump had 1 year to prove he was serious. Now he'll be a lame duck this midterm as we march further towards annihilation. permalink award report block reply someguy7738 3 points 1 hour ago A few short years? I doubt it takes them over a week to completely undo everything and fuck us all over even harder. permalink award report block reply Alphahorizon 2 points 53 minutes ago Ours enemies do not regard laws. So you are correct. They seem to be able to apprehend anyone they want without regard or fear. And this blatant lack of action WILL only expedite their processes when they regain power. Which by the history of Republicants will be sooner rather then later. permalink parent award report block reply MeMargie 3 points 2 hours ago We The People  -“Thus, citizens have the unbridled right to empanel their own grand juries and present “True Bills” of indictment to a court, which is then required to commence a criminal proceeding. Our Founding Fathers presciently thereby created a “buffer” the people may rely upon for justice, when public officials, including judges, criminally violate the law.” -Justice Antonin Scalia https://www.commonlawcourt.xyz/pme/resources.php permalink award report block reply MemeWarsVet 2 points 2 hours ago That's what they are counting on. permalink award report block reply Aggrieved03 1 points 56 minutes ago So it's the Democrats fault trailer trash is worthless? permalink parent award report block reply SnowflakeScorcher 1 points 2 hours ago username is fitting permalink award report block reply MemphisMontoya71 1 points 2 hours ago Posted this many months ago, nobody cares, its just rah rah rah put your pom pom's on and everyone is a doomer. permalink award report block reply berserkerbarrage -2 points 1 hour ago I mean you sound like a moron. Hurr durr, Drumpf isn't rounding up all the Democrats so I'm gonna vote for the Democrats instead. Go cry about it on r/Politics. permalink parent award report block reply YouEssAye 3 points 1 hour ago It's always a strawman with you fucks. We're not ever going to vote for democrats. That doesn't change the fact that we've dutifully voted for Republicans for 20+ years and keep getting the same shit sandwich when we \"win\". I will abstain if they can't come up with a candidate who actually wants to put America first. I'm done with this \"lesser of two evils\" shit. How else can we hold our own party accountable for their (in)actions? If they know they can fuck us and we'll still vote for them, why would they stop fucking us? permalink parent award report block reply SneakyWino 3 points 58 minutes ago It doesn't even matter if we vote for them.  It's all rigged.  Thanks Dominion.  And paid off nig nogs. permalink parent award report block reply berserkerbarrage 0 points 51 minutes ago You're dumb as fuck. The midterms isn't for POTUS. If you can't find a single candidate that you like anywhere in the country then the problem is you. Also, your demands are simply unreasonable. Not everything is treason and you can't just arrest people that you don't like. permalink parent award report block reply YouEssAye 0 points 47 minutes ago I'm speaking in generalities, I'm not OP and I haven't mentioned the midterms. Also, your demands are simply unreasonable Then you're admitting Trump's promises were unreasonable. Not everything is treason and you can't just arrest people that you don't like. I repeat: \"It's always a strawman with you fucks.\" permalink parent award report block reply view 1 more comments... Framus 0 points 2 hours ago OK, sit the next one out. That'll teach 'em a lesson! permalink award report block reply _Liberty_Prime_ -1 points 2 hours ago What did Trump do this time to warrant a shill brigade? SNAP benefits not coming back? permalink award report block reply MAGATHREAD 3 points 2 hours ago She’s been a disappointment, and I say this as a fellow Jew. There’s a reason the swamp approved her. permalink parent award report block reply _Liberty_Prime_ 2 points 2 hours ago Not a Jew. Doubt you are, either. permalink parent award report block reply Spindle-spin 1 points 1 hour ago I think there's more gay people than Jews in this site Source: front page permalink parent award report block reply MAGATHREAD 0 points 2 hours ago lol, it’s not something to shy away from! I don’t know what your criteria for being a Jew is, but I read from the Torah at my bar mitzvah, and then held the Torah at my little brother’s bar mitzvah. I recognize your name through the permutations of underscores, and I’m pretty sure you’re a fellow Jew. In any case, Bondi has been useless, and the OP’s point stands. permalink parent award report block reply _Liberty_Prime_ 3 points 2 hours ago Yeah, no. Christian. But I support anyone who opposes Islam. Hindu, Christian or otherwise. permalink parent award report block reply MAGATHREAD 0 points 2 hours ago You can also check my post history. I’m a proud American that happens to be Jewish. I’ve gotten some hate here, but I know if I met any of those faggots they’d like me. Because, again, proud American. First. permalink parent award report block reply view 1 more comments...\nMAG-n-KAG 8 points 2 hours ago \"I think she's doing a great job.\" At some point, the finger has to be pointed at the boss man himself. permalink award report block reply HumblePepe 3 points 1 hour ago Buck has to stop somewhere permalink parent award report block reply mojorisen -3 points 2 hours ago Several deep state indictments and more coming down the pipe.  This is impressive because it was done so quickly.  It usually takes far more than 10 months to put a case together for a high profile target.  You have to make sure everything is perfect knowing that you are going in front of a hostile judge and jury. If you know how the system works, this is undeniably a \"great job\".  If you don't than you come to patriots.win and cry and moan. Yes, she has made big mistakes. Yes she goes on Fox news every 5 mins but she has still done a great job with the number of indictments in a short period of time.  Like Trump she still has to follow laws and stay within a Constitution framework. permalink parent award report block reply Steve56775 5 points 1 hour ago I still can’t get the “binders” out of my head. What kind of shitshow was that? permalink parent award report block reply Aggrieved03 1 points 57 minutes ago Essentially jaywalking charges compared to their crimes. permalink parent award report block reply\nHumblePepe 3 points 1 hour ago Buck has to stop somewhere permalink parent award report block reply\nmojorisen -3 points 2 hours ago Several deep state indictments and more coming down the pipe.  This is impressive because it was done so quickly.  It usually takes far more than 10 months to put a case together for a high profile target.  You have to make sure everything is perfect knowing that you are going in front of a hostile judge and jury. If you know how the system works, this is undeniably a \"great job\".  If you don't than you come to patriots.win and cry and moan. Yes, she has made big mistakes. Yes she goes on Fox news every 5 mins but she has still done a great job with the number of indictments in a short period of time.  Like Trump she still has to follow laws and stay within a Constitution framework. permalink parent award report block reply Steve56775 5 points 1 hour ago I still can’t get the “binders” out of my head. What kind of shitshow was that? permalink parent award report block reply Aggrieved03 1 points 57 minutes ago Essentially jaywalking charges compared to their crimes. permalink parent award report block reply\nSteve56775 5 points 1 hour ago I still can’t get the “binders” out of my head. What kind of shitshow was that? permalink parent award report block reply\nAggrieved03 1 points 57 minutes ago Essentially jaywalking charges compared to their crimes. permalink parent award report block reply\nMhmm2MoreWeeks OP 5 points 2 hours ago Nothing that Important has happened or been changed. All just pyrrhic victories so far. And since Republicans become complacent after nearly nothing but rhetoric their enemies just continue on with their schemes like nothing has changed. Because it hasn't. Not really. Bondi and Patel are literally living in fear for their safety and that of their loved ones are are the entire admin. There is not enough protection for them to follow through and then keep their families safe forever. Trump is the start. The real change has to come after a few more rounds of pain. Maybe in a generation. If millions of us are not eagerly ready to risk our lives then we are not at that critical moment. Deep State Globalism is not beaten with an election. It is beaten by making examples being made out of its ring leaders and their families. Our generation is not ready for that, but the next, after a lifetime of poverty, just might be. Freedom is never given. It is only taken by force, every 4-6 generations. permalink award report block reply\nHumblePepe 4 points 1 hour ago Trump had 1 year to prove he was serious. Now he'll be a lame duck this midterm as we march further towards annihilation. permalink award report block reply\nsomeguy7738 3 points 1 hour ago A few short years? I doubt it takes them over a week to completely undo everything and fuck us all over even harder. permalink award report block reply Alphahorizon 2 points 53 minutes ago Ours enemies do not regard laws. So you are correct. They seem to be able to apprehend anyone they want without regard or fear. And this blatant lack of action WILL only expedite their processes when they regain power. Which by the history of Republicants will be sooner rather then later. permalink parent award report block reply\nAlphahorizon 2 points 53 minutes ago Ours enemies do not regard laws. So you are correct. They seem to be able to apprehend anyone they want without regard or fear. And this blatant lack of action WILL only expedite their processes when they regain power. Which by the history of Republicants will be sooner rather then later. permalink parent award report block reply\nMeMargie 3 points 2 hours ago We The People  -“Thus, citizens have the unbridled right to empanel their own grand juries and present “True Bills” of indictment to a court, which is then required to commence a criminal proceeding. Our Founding Fathers presciently thereby created a “buffer” the people may rely upon for justice, when public officials, including judges, criminally violate the law.” -Justice Antonin Scalia https://www.commonlawcourt.xyz/pme/resources.php permalink award report block reply\nMemeWarsVet 2 points 2 hours ago That's what they are counting on. permalink award report block reply Aggrieved03 1 points 56 minutes ago So it's the Democrats fault trailer trash is worthless? permalink parent award report block reply\nAggrieved03 1 points 56 minutes ago So it's the Democrats fault trailer trash is worthless? permalink parent award report block reply\nSnowflakeScorcher 1 points 2 hours ago username is fitting permalink award report block reply\nMemphisMontoya71 1 points 2 hours ago Posted this many months ago, nobody cares, its just rah rah rah put your pom pom's on and everyone is a doomer. permalink award report block reply berserkerbarrage -2 points 1 hour ago I mean you sound like a moron. Hurr durr, Drumpf isn't rounding up all the Democrats so I'm gonna vote for the Democrats instead. Go cry about it on r/Politics. permalink parent award report block reply YouEssAye 3 points 1 hour ago It's always a strawman with you fucks. We're not ever going to vote for democrats. That doesn't change the fact that we've dutifully voted for Republicans for 20+ years and keep getting the same shit sandwich when we \"win\". I will abstain if they can't come up with a candidate who actually wants to put America first. I'm done with this \"lesser of two evils\" shit. How else can we hold our own party accountable for their (in)actions? If they know they can fuck us and we'll still vote for them, why would they stop fucking us? permalink parent award report block reply SneakyWino 3 points 58 minutes ago It doesn't even matter if we vote for them.  It's all rigged.  Thanks Dominion.  And paid off nig nogs. permalink parent award report block reply berserkerbarrage 0 points 51 minutes ago You're dumb as fuck. The midterms isn't for POTUS. If you can't find a single candidate that you like anywhere in the country then the problem is you. Also, your demands are simply unreasonable. Not everything is treason and you can't just arrest people that you don't like. permalink parent award report block reply YouEssAye 0 points 47 minutes ago I'm speaking in generalities, I'm not OP and I haven't mentioned the midterms. Also, your demands are simply unreasonable Then you're admitting Trump's promises were unreasonable. Not everything is treason and you can't just arrest people that you don't like. I repeat: \"It's always a strawman with you fucks.\" permalink parent award report block reply view 1 more comments...\nberserkerbarrage -2 points 1 hour ago I mean you sound like a moron. Hurr durr, Drumpf isn't rounding up all the Democrats so I'm gonna vote for the Democrats instead. Go cry about it on r/Politics. permalink parent award report block reply YouEssAye 3 points 1 hour ago It's always a strawman with you fucks. We're not ever going to vote for democrats. That doesn't change the fact that we've dutifully voted for Republicans for 20+ years and keep getting the same shit sandwich when we \"win\". I will abstain if they can't come up with a candidate who actually wants to put America first. I'm done with this \"lesser of two evils\" shit. How else can we hold our own party accountable for their (in)actions? If they know they can fuck us and we'll still vote for them, why would they stop fucking us? permalink parent award report block reply SneakyWino 3 points 58 minutes ago It doesn't even matter if we vote for them.  It's all rigged.  Thanks Dominion.  And paid off nig nogs. permalink parent award report block reply berserkerbarrage 0 points 51 minutes ago You're dumb as fuck. The midterms isn't for POTUS. If you can't find a single candidate that you like anywhere in the country then the problem is you. Also, your demands are simply unreasonable. Not everything is treason and you can't just arrest people that you don't like. permalink parent award report block reply YouEssAye 0 points 47 minutes ago I'm speaking in generalities, I'm not OP and I haven't mentioned the midterms. Also, your demands are simply unreasonable Then you're admitting Trump's promises were unreasonable. Not everything is treason and you can't just arrest people that you don't like. I repeat: \"It's always a strawman with you fucks.\" permalink parent award report block reply view 1 more comments...\nYouEssAye 3 points 1 hour ago It's always a strawman with you fucks. We're not ever going to vote for democrats. That doesn't change the fact that we've dutifully voted for Republicans for 20+ years and keep getting the same shit sandwich when we \"win\". I will abstain if they can't come up with a candidate who actually wants to put America first. I'm done with this \"lesser of two evils\" shit. How else can we hold our own party accountable for their (in)actions? If they know they can fuck us and we'll still vote for them, why would they stop fucking us? permalink parent award report block reply SneakyWino 3 points 58 minutes ago It doesn't even matter if we vote for them.  It's all rigged.  Thanks Dominion.  And paid off nig nogs. permalink parent award report block reply berserkerbarrage 0 points 51 minutes ago You're dumb as fuck. The midterms isn't for POTUS. If you can't find a single candidate that you like anywhere in the country then the problem is you. Also, your demands are simply unreasonable. Not everything is treason and you can't just arrest people that you don't like. permalink parent award report block reply YouEssAye 0 points 47 minutes ago I'm speaking in generalities, I'm not OP and I haven't mentioned the midterms. Also, your demands are simply unreasonable Then you're admitting Trump's promises were unreasonable. Not everything is treason and you can't just arrest people that you don't like. I repeat: \"It's always a strawman with you fucks.\" permalink parent award report block reply view 1 more comments...\nSneakyWino 3 points 58 minutes ago It doesn't even matter if we vote for them.  It's all rigged.  Thanks Dominion.  And paid off nig nogs. permalink parent award report block reply\nberserkerbarrage 0 points 51 minutes ago You're dumb as fuck. The midterms isn't for POTUS. If you can't find a single candidate that you like anywhere in the country then the problem is you. Also, your demands are simply unreasonable. Not everything is treason and you can't just arrest people that you don't like. permalink parent award report block reply YouEssAye 0 points 47 minutes ago I'm speaking in generalities, I'm not OP and I haven't mentioned the midterms. Also, your demands are simply unreasonable Then you're admitting Trump's promises were unreasonable. Not everything is treason and you can't just arrest people that you don't like. I repeat: \"It's always a strawman with you fucks.\" permalink parent award report block reply view 1 more comments...\nYouEssAye 0 points 47 minutes ago I'm speaking in generalities, I'm not OP and I haven't mentioned the midterms. Also, your demands are simply unreasonable Then you're admitting Trump's promises were unreasonable. Not everything is treason and you can't just arrest people that you don't like. I repeat: \"It's always a strawman with you fucks.\" permalink parent award report block reply view 1 more comments...\nFramus 0 points 2 hours ago OK, sit the next one out. That'll teach 'em a lesson! permalink award report block reply\n_Liberty_Prime_ -1 points 2 hours ago What did Trump do this time to warrant a shill brigade? SNAP benefits not coming back? permalink award report block reply MAGATHREAD 3 points 2 hours ago She’s been a disappointment, and I say this as a fellow Jew. There’s a reason the swamp approved her. permalink parent award report block reply _Liberty_Prime_ 2 points 2 hours ago Not a Jew. Doubt you are, either. permalink parent award report block reply Spindle-spin 1 points 1 hour ago I think there's more gay people than Jews in this site Source: front page permalink parent award report block reply MAGATHREAD 0 points 2 hours ago lol, it’s not something to shy away from! I don’t know what your criteria for being a Jew is, but I read from the Torah at my bar mitzvah, and then held the Torah at my little brother’s bar mitzvah. I recognize your name through the permutations of underscores, and I’m pretty sure you’re a fellow Jew. In any case, Bondi has been useless, and the OP’s point stands. permalink parent award report block reply _Liberty_Prime_ 3 points 2 hours ago Yeah, no. Christian. But I support anyone who opposes Islam. Hindu, Christian or otherwise. permalink parent award report block reply MAGATHREAD 0 points 2 hours ago You can also check my post history. I’m a proud American that happens to be Jewish. I’ve gotten some hate here, but I know if I met any of those faggots they’d like me. Because, again, proud American. First. permalink parent award report block reply view 1 more comments...\nMAGATHREAD 3 points 2 hours ago She’s been a disappointment, and I say this as a fellow Jew. There’s a reason the swamp approved her. permalink parent award report block reply _Liberty_Prime_ 2 points 2 hours ago Not a Jew. Doubt you are, either. permalink parent award report block reply Spindle-spin 1 points 1 hour ago I think there's more gay people than Jews in this site Source: front page permalink parent award report block reply MAGATHREAD 0 points 2 hours ago lol, it’s not something to shy away from! I don’t know what your criteria for being a Jew is, but I read from the Torah at my bar mitzvah, and then held the Torah at my little brother’s bar mitzvah. I recognize your name through the permutations of underscores, and I’m pretty sure you’re a fellow Jew. In any case, Bondi has been useless, and the OP’s point stands. permalink parent award report block reply _Liberty_Prime_ 3 points 2 hours ago Yeah, no. Christian. But I support anyone who opposes Islam. Hindu, Christian or otherwise. permalink parent award report block reply MAGATHREAD 0 points 2 hours ago You can also check my post history. I’m a proud American that happens to be Jewish. I’ve gotten some hate here, but I know if I met any of those faggots they’d like me. Because, again, proud American. First. permalink parent award report block reply view 1 more comments...\n_Liberty_Prime_ 2 points 2 hours ago Not a Jew. Doubt you are, either. permalink parent award report block reply Spindle-spin 1 points 1 hour ago I think there's more gay people than Jews in this site Source: front page permalink parent award report block reply MAGATHREAD 0 points 2 hours ago lol, it’s not something to shy away from! I don’t know what your criteria for being a Jew is, but I read from the Torah at my bar mitzvah, and then held the Torah at my little brother’s bar mitzvah. I recognize your name through the permutations of underscores, and I’m pretty sure you’re a fellow Jew. In any case, Bondi has been useless, and the OP’s point stands. permalink parent award report block reply _Liberty_Prime_ 3 points 2 hours ago Yeah, no. Christian. But I support anyone who opposes Islam. Hindu, Christian or otherwise. permalink parent award report block reply MAGATHREAD 0 points 2 hours ago You can also check my post history. I’m a proud American that happens to be Jewish. I’ve gotten some hate here, but I know if I met any of those faggots they’d like me. Because, again, proud American. First. permalink parent award report block reply view 1 more comments...\nSpindle-spin 1 points 1 hour ago I think there's more gay people than Jews in this site Source: front page permalink parent award report block reply\nMAGATHREAD 0 points 2 hours ago lol, it’s not something to shy away from! I don’t know what your criteria for being a Jew is, but I read from the Torah at my bar mitzvah, and then held the Torah at my little brother’s bar mitzvah. I recognize your name through the permutations of underscores, and I’m pretty sure you’re a fellow Jew. In any case, Bondi has been useless, and the OP’s point stands. permalink parent award report block reply _Liberty_Prime_ 3 points 2 hours ago Yeah, no. Christian. But I support anyone who opposes Islam. Hindu, Christian or otherwise. permalink parent award report block reply MAGATHREAD 0 points 2 hours ago You can also check my post history. I’m a proud American that happens to be Jewish. I’ve gotten some hate here, but I know if I met any of those faggots they’d like me. Because, again, proud American. First. permalink parent award report block reply view 1 more comments...\n_Liberty_Prime_ 3 points 2 hours ago Yeah, no. Christian. But I support anyone who opposes Islam. Hindu, Christian or otherwise. permalink parent award report block reply\nMAGATHREAD 0 points 2 hours ago You can also check my post history. I’m a proud American that happens to be Jewish. I’ve gotten some hate here, but I know if I met any of those faggots they’d like me. Because, again, proud American. First. permalink parent award report block reply view 1 more comments...",
  "fetched_at": "2025-11-12T23:27:17.114021Z"
}