{
  "id": "1ARK9mFJfI",
  "url": "https://patriots.win/p/1ARK9mFJfI/want-to-see-home-prices-and-rent/c",
  "content": "739 Want to see home prices and rents drop 50% and self-deportations spike 300% overnight?\n\nMake renting or selling property to illegal aliens a federal crime. posted 19 hours ago by PiratePatriotParrot 41 comments award share report block Bad Hombre @joma_gc • 24h Want to see home prices and rents drop 50% and self-deportations spike 300% overnight? Make renting or selling property to illegal aliens a federal crime.\n41 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style Abovethefray 41 points 19 hours ago Also;  when do employers get arrested for hiring illegal aliens?  I am starting to wonder if we will be able to fix anything. permalink award report block reply Formerlurker92 13 points 18 hours ago We can. It's just the political class getting in the way permalink parent award report block reply lixa 5 points 18 hours ago There has to be some way to know they're not legal. If businesses used e verify and the illegals were given SS numbers or stole them, they can say they didn't know. However sometimes they clearly do know and should be in prison. Business now owned by the USG. permalink parent award report block reply It_takes_10_years 2 points 8 hours ago Why would they? As long as they pass the government approved system E-Verify and present passing ID documents. How would that be the companies fault? Are companies gonna be required to hire PIs on every candidate now increasing costs? Are companies gonna be required to send in ID documents to 3rd party forensic verifiers now increasing costs? Are companies gonna be required to hire a government employee to verify each potential candidate  now increasing costs? This is 100% on the government to change. Otherwise you will pay for it. permalink parent award report block reply Abovethefray 1 points 5 hours ago You are right.  Let's give up, it is too hard. permalink parent award report block reply It_takes_10_years 2 points 5 hours ago Hey dumbass we are talking about Business here.  Its not the business sectors job to fix the governments fuck up. The government needs to REDO E VERIFY WORK VISA APPROVAL SYSTEMS permalink parent award report block reply Abovethefray 1 points 5 hours ago Ok, I am sorry shithead. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago The real solution is to investigate the e-verify applicants. Every e-verify record gets an AI scan and anything suspicious gets a red flag for document verification. Any fake documents get referred for a criminal investigation and deportation. Any company hiring tons of illegals while meeting the technical requirement to use e-verify gets constantly raided by ice until they cut the shit and make a good faith effort. Serial violaters could be subject to undercover sting operations and face criminal charges. Its not all that hard if we are serious about it. permalink parent award report block reply It_takes_10_years 1 points 6 hours ago And that falls entirely on the government. It’s not the business sector’s job to fix the government’s broken verification system. Companies follow the laws and systems they’re given. If those systems fail, that’s a government failure not a corporate crime. You can’t punish people for playing by the rulebook the referee wrote. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago Exactly. That is why we have law enforcement agencies. Let them do the investigations permalink parent award report block reply view 1 more comments... covok48 1 points 8 hours ago The answer is no. This is what’s being sold out looks like. permalink parent award report block reply Greenhills 24 points 19 hours ago Well non citizens should not be eligible for financing. permalink award report block reply borisborscht 4 points 9 hours ago or bank accounts or school or anything permalink parent award report block reply Knowthyself 11 points 18 hours ago Just wait till people learn that Muslims get halal loans and get to pay 0% intrest. permalink award report block reply ErgonomicNomad 5 points 14 hours ago Don't try to get one yourself if you're responsible and would otherwise pay it off early. Instead of charging interest, they rent to own at a fixed final price that basically packs interest into the payment but you don't get a discount for paying early since it's not interest. permalink parent award report block reply borisborscht 1 points 9 hours ago who would offer that loan and why why would they loan out money at 0% interest? permalink parent award report block reply Knowthyself 2 points 8 hours ago Many banks do. Charging intrest is forbidden under Shria law. Therefor they can get personal loans and only pay back then principle. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago Interest is forbidden in islam. permalink parent award report block reply ShadowInv 1 points 8 hours ago There are also 0% loans for jews from major banks. permalink parent award report block reply RYTHMICRIOT 11 points 19 hours ago Just ban commercial landscaping. Rake your own damn leaves. Itd be a good start permalink award report block reply PiratePatriotParrot OP 12 points 19 hours ago Everywhere I drive in my town is Mexicans out on the streets landscaping every inch of every road for 100s of miles. No joke. I nearly got a head-on crash this week because a blower guy was in the road. There must be a good 1000-3000 of them out there a time just on the public roads let alone any of the private houses and businesses. There's maybe 20-100k gardeners in my town. who knows. permalink parent award report block reply lixa 4 points 18 hours ago I live on a street that unfortunately has very little in the way of greenery. Other than a tiny strip of grass in the front, (on some properties, but few), the rest is all concrete. And yet every building has a team of lawn guys who come weekly to do who knows what other than blow dust into the adjacent properties. It's like money laundering or something permalink parent award report block reply Husky 2 points 10 hours ago My company's parking lot has a bed of pebbles adjacent to the parking lot. Every week Mexicans take weed eaters to this bed if rocks with no weeds andnscatter the rocks across the parking lot. Im convinced their contract is to damage my vehicle, not to remove weeds permalink parent award report block reply The_Bloofy_Bullshark 6 points 18 hours ago Our neighborhood hires a landscaping crew that is seemingly here 4 days out of the week but gets absolutely nothing accomplished. We have massive Amanita muscaria (fly agaric) everywhere that they just look at then wander off. All these fucks do is stand around and occasionally blow some leaves around to give off the impression that they are actually doing anything. permalink parent award report block reply Formerlurker92 7 points 18 hours ago Hiring too. Anyone hiring them should be financially and criminally punished permalink award report block reply Aggrieved03 3 points 18 hours ago How about hiring them or supporting them? permalink award report block reply Lamech_Slade 3 points 9 hours ago Make it illegal to sell property or finance loans to non US citizens.  Illegals are only a small part of the problem compared to \"legal\" immigration. permalink award report block reply borisborscht 4 points 9 hours ago I don't want to live in Jeetville either. permalink parent award report block reply Redpilled2Depression 2 points 13 hours ago It’s so simple, why is it not being done? permalink award report block reply covok48 2 points 8 hours ago But hey, Trump aid those H1B streetshitters are a-ok to take the place of illegals. permalink award report block reply TheBasedFriscoMan 2 points 12 hours ago A small suburb in Dallas tried that and lost.  Now Farmers Branch is filled with illegal aliens.  20 to a house.  Cars and trucks parked everywhere on the streets. See Villas at Parkside Partners v. City of Farmers Branch permalink award report block reply JoinTheDiscussion 1 points 15 hours ago Not how that works.. One legal buys or rents the house then sub leases it to his illegal buddies permalink award report block reply Datamancer 1 points 19 hours ago Yes. permalink award report block reply ShadowInv 1 points 8 hours ago Nuke investor ownership of sfh, and nuke all foreign ownership of sfh. permalink award report block reply TheGeneral 1 points 16 hours ago Pipe dream. permalink award report block reply iamimaginos 1 points 10 hours ago Do you mean like hiring them? permalink award report block reply derw00d 1 points 27 minutes ago The blue states would simply disregard any such law and still allow illegals to rent/buy homes. This would just result in all of the illegals being concentrated in blue states. So, not much different from how things are right now. The only acceptable solution is deportation. permalink award report block reply Shitsbrokeyo 1 points 15 hours ago And make the stakes significant. Same for employment. Jail time and huge fine permalink award report block reply borisborscht 1 points 9 hours ago Yes please permalink award report block reply MagaJay02 0 points 18 hours ago That wouldn't make home prices drop 50% lol... bit it'd still lower demand, which helps guaranteed. permalink award report block reply SCHULTZ 1 points 19 hours ago Comment removed by community moderators. permalink award report block reply\nAbovethefray 41 points 19 hours ago Also;  when do employers get arrested for hiring illegal aliens?  I am starting to wonder if we will be able to fix anything. permalink award report block reply Formerlurker92 13 points 18 hours ago We can. It's just the political class getting in the way permalink parent award report block reply lixa 5 points 18 hours ago There has to be some way to know they're not legal. If businesses used e verify and the illegals were given SS numbers or stole them, they can say they didn't know. However sometimes they clearly do know and should be in prison. Business now owned by the USG. permalink parent award report block reply It_takes_10_years 2 points 8 hours ago Why would they? As long as they pass the government approved system E-Verify and present passing ID documents. How would that be the companies fault? Are companies gonna be required to hire PIs on every candidate now increasing costs? Are companies gonna be required to send in ID documents to 3rd party forensic verifiers now increasing costs? Are companies gonna be required to hire a government employee to verify each potential candidate  now increasing costs? This is 100% on the government to change. Otherwise you will pay for it. permalink parent award report block reply Abovethefray 1 points 5 hours ago You are right.  Let's give up, it is too hard. permalink parent award report block reply It_takes_10_years 2 points 5 hours ago Hey dumbass we are talking about Business here.  Its not the business sectors job to fix the governments fuck up. The government needs to REDO E VERIFY WORK VISA APPROVAL SYSTEMS permalink parent award report block reply Abovethefray 1 points 5 hours ago Ok, I am sorry shithead. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago The real solution is to investigate the e-verify applicants. Every e-verify record gets an AI scan and anything suspicious gets a red flag for document verification. Any fake documents get referred for a criminal investigation and deportation. Any company hiring tons of illegals while meeting the technical requirement to use e-verify gets constantly raided by ice until they cut the shit and make a good faith effort. Serial violaters could be subject to undercover sting operations and face criminal charges. Its not all that hard if we are serious about it. permalink parent award report block reply It_takes_10_years 1 points 6 hours ago And that falls entirely on the government. It’s not the business sector’s job to fix the government’s broken verification system. Companies follow the laws and systems they’re given. If those systems fail, that’s a government failure not a corporate crime. You can’t punish people for playing by the rulebook the referee wrote. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago Exactly. That is why we have law enforcement agencies. Let them do the investigations permalink parent award report block reply view 1 more comments... covok48 1 points 8 hours ago The answer is no. This is what’s being sold out looks like. permalink parent award report block reply\nFormerlurker92 13 points 18 hours ago We can. It's just the political class getting in the way permalink parent award report block reply\nlixa 5 points 18 hours ago There has to be some way to know they're not legal. If businesses used e verify and the illegals were given SS numbers or stole them, they can say they didn't know. However sometimes they clearly do know and should be in prison. Business now owned by the USG. permalink parent award report block reply\nIt_takes_10_years 2 points 8 hours ago Why would they? As long as they pass the government approved system E-Verify and present passing ID documents. How would that be the companies fault? Are companies gonna be required to hire PIs on every candidate now increasing costs? Are companies gonna be required to send in ID documents to 3rd party forensic verifiers now increasing costs? Are companies gonna be required to hire a government employee to verify each potential candidate  now increasing costs? This is 100% on the government to change. Otherwise you will pay for it. permalink parent award report block reply Abovethefray 1 points 5 hours ago You are right.  Let's give up, it is too hard. permalink parent award report block reply It_takes_10_years 2 points 5 hours ago Hey dumbass we are talking about Business here.  Its not the business sectors job to fix the governments fuck up. The government needs to REDO E VERIFY WORK VISA APPROVAL SYSTEMS permalink parent award report block reply Abovethefray 1 points 5 hours ago Ok, I am sorry shithead. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago The real solution is to investigate the e-verify applicants. Every e-verify record gets an AI scan and anything suspicious gets a red flag for document verification. Any fake documents get referred for a criminal investigation and deportation. Any company hiring tons of illegals while meeting the technical requirement to use e-verify gets constantly raided by ice until they cut the shit and make a good faith effort. Serial violaters could be subject to undercover sting operations and face criminal charges. Its not all that hard if we are serious about it. permalink parent award report block reply It_takes_10_years 1 points 6 hours ago And that falls entirely on the government. It’s not the business sector’s job to fix the government’s broken verification system. Companies follow the laws and systems they’re given. If those systems fail, that’s a government failure not a corporate crime. You can’t punish people for playing by the rulebook the referee wrote. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago Exactly. That is why we have law enforcement agencies. Let them do the investigations permalink parent award report block reply view 1 more comments...\nAbovethefray 1 points 5 hours ago You are right.  Let's give up, it is too hard. permalink parent award report block reply It_takes_10_years 2 points 5 hours ago Hey dumbass we are talking about Business here.  Its not the business sectors job to fix the governments fuck up. The government needs to REDO E VERIFY WORK VISA APPROVAL SYSTEMS permalink parent award report block reply Abovethefray 1 points 5 hours ago Ok, I am sorry shithead. permalink parent award report block reply\nIt_takes_10_years 2 points 5 hours ago Hey dumbass we are talking about Business here.  Its not the business sectors job to fix the governments fuck up. The government needs to REDO E VERIFY WORK VISA APPROVAL SYSTEMS permalink parent award report block reply Abovethefray 1 points 5 hours ago Ok, I am sorry shithead. permalink parent award report block reply\nAbovethefray 1 points 5 hours ago Ok, I am sorry shithead. permalink parent award report block reply\nSide_o_beef_curtains 1 points 6 hours ago The real solution is to investigate the e-verify applicants. Every e-verify record gets an AI scan and anything suspicious gets a red flag for document verification. Any fake documents get referred for a criminal investigation and deportation. Any company hiring tons of illegals while meeting the technical requirement to use e-verify gets constantly raided by ice until they cut the shit and make a good faith effort. Serial violaters could be subject to undercover sting operations and face criminal charges. Its not all that hard if we are serious about it. permalink parent award report block reply It_takes_10_years 1 points 6 hours ago And that falls entirely on the government. It’s not the business sector’s job to fix the government’s broken verification system. Companies follow the laws and systems they’re given. If those systems fail, that’s a government failure not a corporate crime. You can’t punish people for playing by the rulebook the referee wrote. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago Exactly. That is why we have law enforcement agencies. Let them do the investigations permalink parent award report block reply view 1 more comments...\nIt_takes_10_years 1 points 6 hours ago And that falls entirely on the government. It’s not the business sector’s job to fix the government’s broken verification system. Companies follow the laws and systems they’re given. If those systems fail, that’s a government failure not a corporate crime. You can’t punish people for playing by the rulebook the referee wrote. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago Exactly. That is why we have law enforcement agencies. Let them do the investigations permalink parent award report block reply view 1 more comments...\nSide_o_beef_curtains 1 points 6 hours ago Exactly. That is why we have law enforcement agencies. Let them do the investigations permalink parent award report block reply view 1 more comments...\ncovok48 1 points 8 hours ago The answer is no. This is what’s being sold out looks like. permalink parent award report block reply\nGreenhills 24 points 19 hours ago Well non citizens should not be eligible for financing. permalink award report block reply borisborscht 4 points 9 hours ago or bank accounts or school or anything permalink parent award report block reply\nborisborscht 4 points 9 hours ago or bank accounts or school or anything permalink parent award report block reply\nKnowthyself 11 points 18 hours ago Just wait till people learn that Muslims get halal loans and get to pay 0% intrest. permalink award report block reply ErgonomicNomad 5 points 14 hours ago Don't try to get one yourself if you're responsible and would otherwise pay it off early. Instead of charging interest, they rent to own at a fixed final price that basically packs interest into the payment but you don't get a discount for paying early since it's not interest. permalink parent award report block reply borisborscht 1 points 9 hours ago who would offer that loan and why why would they loan out money at 0% interest? permalink parent award report block reply Knowthyself 2 points 8 hours ago Many banks do. Charging intrest is forbidden under Shria law. Therefor they can get personal loans and only pay back then principle. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago Interest is forbidden in islam. permalink parent award report block reply ShadowInv 1 points 8 hours ago There are also 0% loans for jews from major banks. permalink parent award report block reply\nErgonomicNomad 5 points 14 hours ago Don't try to get one yourself if you're responsible and would otherwise pay it off early. Instead of charging interest, they rent to own at a fixed final price that basically packs interest into the payment but you don't get a discount for paying early since it's not interest. permalink parent award report block reply\nborisborscht 1 points 9 hours ago who would offer that loan and why why would they loan out money at 0% interest? permalink parent award report block reply Knowthyself 2 points 8 hours ago Many banks do. Charging intrest is forbidden under Shria law. Therefor they can get personal loans and only pay back then principle. permalink parent award report block reply Side_o_beef_curtains 1 points 6 hours ago Interest is forbidden in islam. permalink parent award report block reply\nKnowthyself 2 points 8 hours ago Many banks do. Charging intrest is forbidden under Shria law. Therefor they can get personal loans and only pay back then principle. permalink parent award report block reply\nSide_o_beef_curtains 1 points 6 hours ago Interest is forbidden in islam. permalink parent award report block reply\nShadowInv 1 points 8 hours ago There are also 0% loans for jews from major banks. permalink parent award report block reply\nRYTHMICRIOT 11 points 19 hours ago Just ban commercial landscaping. Rake your own damn leaves. Itd be a good start permalink award report block reply PiratePatriotParrot OP 12 points 19 hours ago Everywhere I drive in my town is Mexicans out on the streets landscaping every inch of every road for 100s of miles. No joke. I nearly got a head-on crash this week because a blower guy was in the road. There must be a good 1000-3000 of them out there a time just on the public roads let alone any of the private houses and businesses. There's maybe 20-100k gardeners in my town. who knows. permalink parent award report block reply lixa 4 points 18 hours ago I live on a street that unfortunately has very little in the way of greenery. Other than a tiny strip of grass in the front, (on some properties, but few), the rest is all concrete. And yet every building has a team of lawn guys who come weekly to do who knows what other than blow dust into the adjacent properties. It's like money laundering or something permalink parent award report block reply Husky 2 points 10 hours ago My company's parking lot has a bed of pebbles adjacent to the parking lot. Every week Mexicans take weed eaters to this bed if rocks with no weeds andnscatter the rocks across the parking lot. Im convinced their contract is to damage my vehicle, not to remove weeds permalink parent award report block reply The_Bloofy_Bullshark 6 points 18 hours ago Our neighborhood hires a landscaping crew that is seemingly here 4 days out of the week but gets absolutely nothing accomplished. We have massive Amanita muscaria (fly agaric) everywhere that they just look at then wander off. All these fucks do is stand around and occasionally blow some leaves around to give off the impression that they are actually doing anything. permalink parent award report block reply\nPiratePatriotParrot OP 12 points 19 hours ago Everywhere I drive in my town is Mexicans out on the streets landscaping every inch of every road for 100s of miles. No joke. I nearly got a head-on crash this week because a blower guy was in the road. There must be a good 1000-3000 of them out there a time just on the public roads let alone any of the private houses and businesses. There's maybe 20-100k gardeners in my town. who knows. permalink parent award report block reply lixa 4 points 18 hours ago I live on a street that unfortunately has very little in the way of greenery. Other than a tiny strip of grass in the front, (on some properties, but few), the rest is all concrete. And yet every building has a team of lawn guys who come weekly to do who knows what other than blow dust into the adjacent properties. It's like money laundering or something permalink parent award report block reply Husky 2 points 10 hours ago My company's parking lot has a bed of pebbles adjacent to the parking lot. Every week Mexicans take weed eaters to this bed if rocks with no weeds andnscatter the rocks across the parking lot. Im convinced their contract is to damage my vehicle, not to remove weeds permalink parent award report block reply\nlixa 4 points 18 hours ago I live on a street that unfortunately has very little in the way of greenery. Other than a tiny strip of grass in the front, (on some properties, but few), the rest is all concrete. And yet every building has a team of lawn guys who come weekly to do who knows what other than blow dust into the adjacent properties. It's like money laundering or something permalink parent award report block reply Husky 2 points 10 hours ago My company's parking lot has a bed of pebbles adjacent to the parking lot. Every week Mexicans take weed eaters to this bed if rocks with no weeds andnscatter the rocks across the parking lot. Im convinced their contract is to damage my vehicle, not to remove weeds permalink parent award report block reply\nHusky 2 points 10 hours ago My company's parking lot has a bed of pebbles adjacent to the parking lot. Every week Mexicans take weed eaters to this bed if rocks with no weeds andnscatter the rocks across the parking lot. Im convinced their contract is to damage my vehicle, not to remove weeds permalink parent award report block reply\nThe_Bloofy_Bullshark 6 points 18 hours ago Our neighborhood hires a landscaping crew that is seemingly here 4 days out of the week but gets absolutely nothing accomplished. We have massive Amanita muscaria (fly agaric) everywhere that they just look at then wander off. All these fucks do is stand around and occasionally blow some leaves around to give off the impression that they are actually doing anything. permalink parent award report block reply\nFormerlurker92 7 points 18 hours ago Hiring too. Anyone hiring them should be financially and criminally punished permalink award report block reply\nAggrieved03 3 points 18 hours ago How about hiring them or supporting them? permalink award report block reply\nLamech_Slade 3 points 9 hours ago Make it illegal to sell property or finance loans to non US citizens.  Illegals are only a small part of the problem compared to \"legal\" immigration. permalink award report block reply borisborscht 4 points 9 hours ago I don't want to live in Jeetville either. permalink parent award report block reply\nborisborscht 4 points 9 hours ago I don't want to live in Jeetville either. permalink parent award report block reply\nRedpilled2Depression 2 points 13 hours ago It’s so simple, why is it not being done? permalink award report block reply\ncovok48 2 points 8 hours ago But hey, Trump aid those H1B streetshitters are a-ok to take the place of illegals. permalink award report block reply\nTheBasedFriscoMan 2 points 12 hours ago A small suburb in Dallas tried that and lost.  Now Farmers Branch is filled with illegal aliens.  20 to a house.  Cars and trucks parked everywhere on the streets. See Villas at Parkside Partners v. City of Farmers Branch permalink award report block reply\nJoinTheDiscussion 1 points 15 hours ago Not how that works.. One legal buys or rents the house then sub leases it to his illegal buddies permalink award report block reply\nDatamancer 1 points 19 hours ago Yes. permalink award report block reply\nShadowInv 1 points 8 hours ago Nuke investor ownership of sfh, and nuke all foreign ownership of sfh. permalink award report block reply\nTheGeneral 1 points 16 hours ago Pipe dream. permalink award report block reply\niamimaginos 1 points 10 hours ago Do you mean like hiring them? permalink award report block reply\nderw00d 1 points 27 minutes ago The blue states would simply disregard any such law and still allow illegals to rent/buy homes. This would just result in all of the illegals being concentrated in blue states. So, not much different from how things are right now. The only acceptable solution is deportation. permalink award report block reply\nShitsbrokeyo 1 points 15 hours ago And make the stakes significant. Same for employment. Jail time and huge fine permalink award report block reply\nborisborscht 1 points 9 hours ago Yes please permalink award report block reply\nMagaJay02 0 points 18 hours ago That wouldn't make home prices drop 50% lol... bit it'd still lower demand, which helps guaranteed. permalink award report block reply\nSCHULTZ 1 points 19 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:41:50.831707Z"
}