{
  "id": "8185569",
  "title": "799💯‼️🚁 FREE CHOPPER RIDES 🚁posted2 hours agobywst4125 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK9nP5EP/x/c",
  "content": "801 💯‼️ 🚁 FREE CHOPPER RIDES 🚁 posted 2 hours ago by wst4 125 comments award share download report block\n125 comments Sort by Top Top New Worst Old Save SHILL_DETECTOR 37 points 2 hours ago best i can do is 6 dollars a pound ground beef permalink award report block reply KekistanPM 21 points 2 hours ago Free if you're on EBT. permalink parent award report block reply Mamapedia 10 points 2 hours ago Eatin' good in the (neighbor)hood. permalink parent award report block reply Trump4prez 1 points 1 hour ago 60 million deportations permalink parent award report block reply Klaus73 3 points 2 hours ago Honestly things would be better if EBT was moved toward more raw production items like meats and vegetables as opposed to processed shit that just makes you useless and lethargic. permalink parent award report block reply SteveRogers42 5 points 1 hour ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 2 points 57 minutes ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 56 minutes ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply MissingTrump 1 points 47 minutes ago Paid for by taxpayer dollars. Never free. Nothing is ever free. permalink parent award report block reply GuerillaYourDreams 11 points 2 hours ago Nearly $7 a pound, where I live right now. I've stopped buying beef. And I love beef. permalink parent award report block reply Yignuced 8 points 2 hours ago I’d stop paying my 50 year mortgage before I stop eating beef.  Priorities and all. permalink parent award report block reply IncredibleMrE1 2 points 2 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply GuerillaYourDreams 2 points 2 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply RedStoneDeepState 2 points 2 hours ago I paid 3.86 for some 80/20 yesterday. permalink parent award report block reply SHILL_DETECTOR 0 points 2 hours ago where?  texas probably permalink parent award report block reply RedStoneDeepState 2 points 2 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 2 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments... South_Florida_Guy 1 points 2 hours ago lol you beat me to a comment like this one permalink parent award report block reply bejeavis 22 points 2 hours ago Sorry you don't have enough talent for that permalink award report block reply Viewer01 15 points 2 hours ago Trump has flipped 180 on immigration and is now willing to finish the dilution of whites to minority status. This is an obvious attempt to negate right wingers who were growing critical of Israel. Boomers would sooner sell this country to foreigners than give up on their Zionism. Which is all very ironic because it’s exactly how Weimar played out and will certainly mean the death of the grand ole party. I absolutely will not vote for losers in ‘26 without some massive wins and apologies. permalink parent award report block reply SanityGumby 7 points 1 hour ago He literally hasn’t permalink parent award report block reply happyfave 6 points 1 hour ago How is he flipped 180 on immigration That is the stupidest take I've heard all day permalink parent award report block reply AVeryNakedMan 3 points 35 minutes ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 2 points 29 minutes ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 1 more comments... Fine_Kentucky_Jenkum 1 points 1 hour ago It’s almost as if he is an actor that could play a specific part on a TV role or something… who could have foreseen this? permalink parent award report block reply mohel -1 points 1 hour ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 45 minutes ago lul permalink parent award report block reply try4gain PRO 1 points 1 hour ago he had one bad interview calm your tits permalink parent award report block reply chefjeffb 0 points 49 minutes ago Shut the fuck up Holy fuck \"Yah so Israel told him to do this so he is\" You're such a faggot, good god permalink parent award report block reply load 1 more comments... Buce-Nudo 1 points 48 minutes ago He didn't say that. Watch the clip. permalink parent award report block reply mohel 0 points 2 hours ago Are we going to find out what 2A was meant for? permalink parent award report block reply HunterBidensPC 1 points 2 hours ago We already know what it’s for. Hit the fed needs a nice reminder permalink parent award report block reply South_Florida_Guy 18 points 2 hours ago Best I can do is no more pennies permalink award report block reply SHILL_DETECTOR 5 points 2 hours ago thats a better one mines kind of a bait because ground beef is actually more like 8 dollars a pound and people will come in and say its actually 10 dollars a pound in democrat shit holes permalink parent award report block reply South_Florida_Guy 1 points 2 hours ago I'm going to start deep freezer storing hoards of it for future generations. permalink parent award report block reply Krat 1 points 2 hours ago I've seen lean beef in Seattle at almost 20$ a pound. permalink parent award report block reply 5DchessWatch 13 points 2 hours ago I don't want 50 yr mortgage I want 50 arrests of the deep staters involved in xfire hurricane/ russiagate/spygate, arctic frost, nimblewill and chancygambit and other projects they're up to that we don't know about yet permalink award report block reply Klaus73 3 points 2 hours ago Mind if I tag Epstien lister onto that? permalink parent award report block reply Appeal2Heaven98 1 points 1 hour ago Best I can do is have Bondi tell you it's on her desk. permalink parent award report block reply SanityGumby 1 points 1 hour ago Then don’t take one you retarded fuck permalink parent award report block reply henri_derelicte 7 points 2 hours ago I’m open to liquidating illegal immigrants as an alternative to deporting them if it’ll solve this problem faster. If anything, it’ll make self-deportation A LOT more attractive permalink award report block reply YodaBannon 6 points 1 hour ago ? deportations are happening, a 50 year mortgage is an option. tarded permalink award report block reply NADSAQ 5 points 1 hour ago this is AI slop permalink parent award report block reply YodaBannon 4 points 1 hour ago sloppy joe permalink parent award report block reply GA_Logic 2 points 1 hour ago You are correct on both points. permalink parent award report block reply YouEssAye 1 points 52 minutes ago deportations are happening On pace to deport about 2.5 million or 5% of 50 million over his 4 year term. They may be happening, but not to the extent that will actually tangibly improve the country. permalink parent award report block reply AVeryNakedMan 1 points 33 minutes ago People don't want to admit that deporting all illegal aliens, while maintaining civil rights and the 4th amendment, is going to take a very long time. You can't just arrest every brown person you see, the way that Eisenhower did. There are tens of millions of Hispanics that are US citizens today. That was not the case back in the days of Operation Wetback. The best thing we can do is push Trump to arrest CEO's for hiring illegals. If that happens, the jobs for illegals will dry up, and self-deportations will skyrocket. permalink parent award report block reply SanityGumby 6 points 1 hour ago What fucking retard stickied a psyop permalink award report block reply YouEssAye 0 points 51 minutes ago Do you ever stop to think if you're the one that's fallen for a psyop and not everyone else? permalink parent award report block reply chefjeffb 2 points 48 minutes ago No, it's you faggots clamoring away about Trump turning his back to immigration efforts permalink parent award report block reply YouEssAye 0 points 41 minutes ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -1 points 30 minutes ago Show proof of that promise, assaye permalink parent award report block reply view 2 more comments... Buce-Nudo 1 points 48 minutes ago Did you finish cleaning Charlie's blood off your hands yet? permalink parent award report block reply Porkbut 0 points 30 minutes ago Do you? permalink parent award report block reply YouEssAye 0 points 24 minutes ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 19 minutes ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 1 more comments... Throwingway22 5 points 57 minutes ago A 50-year mortgage + reducing the use of credit scores in applicants would only expand the demand for houses without touching the supply. It would be another program to give inner-city joggers the ability to move next door in the suburb people moved to to get away from the crime and decay. Just absolute South Africanization of America. permalink award report block reply FatigueIsReal 2 points 52 minutes ago Reducing the use of credit scores has been suggested? permalink parent award report block reply Porkbut 1 points 28 minutes ago In propagandaland, yes permalink parent award report block reply Refugee1000 1 points 54 minutes ago 100%, talk about DEI. What we need is to de regulate building. If someone wants to build a log cabin with nothing but a toilet in the corner fucking let them. Why is a 100 year old house legal to live in but a new one isn't unless you make an 3 foot wide door because someone who buys the house from you might be a gimp. And all the minimum square footage bs permalink parent award report block reply 5DchessWatch 5 points 2 hours ago Best I can do is spraying cologne on an ex al queda guy running syria now permalink award report block reply TrumpPlay3dYouLoL 1 points 1 hour ago Comment removed by community moderators. permalink parent award report block reply IvIA6A 4 points 2 hours ago Housing so affordable you only need a 15 year mortgage. permalink award report block reply BillyBillington 4 points 1 hour ago We need cheaper houses. Not 50 years of interest payments to a fucking bank. permalink award report block reply VanDeKoik 1 points 27 minutes ago And how do you get \"cheaper homes\"? Well wait... permalink parent award report block reply NADSAQ 4 points 1 hour ago ai slop permalink award report block reply Rock9Head 2 points 47 minutes ago That would fix housing. permalink award report block reply 2Guns1ForEachofYa 2 points 47 minutes ago Including H1Bs permalink award report block reply Emodius 2 points 1 hour ago You'll have both. permalink award report block reply DITTOPatriot 2 points 55 minutes ago Good luck with that, unless you're one of the ones surrounding the administration, and it’s going to be a plus if you can promise a seaside resort. permalink award report block reply cyberwar 2 points 1 hour ago why can't you have both? permalink award report block reply HeavenlyTrumpets 2 points 49 minutes ago Yep permalink award report block reply Illah88zillah 2 points 1 hour ago The nerve of anyone telling you this is good MAKE 15 YEAR MORTGAGES AFFORDABLE AGAIN. DEPORT BABY, DEPORT. permalink award report block reply FatigueIsReal 1 points 45 minutes ago So let's say I'm selling my house. Why am I going to lower the price because of some deportations? permalink parent award report block reply VanDeKoik 1 points 28 minutes ago Because dumbasses seriously think all of the homes are being bought by illegals. permalink parent award report block reply VanDeKoik 1 points 29 minutes ago Ok. Well \"make it\". Magic wand wave it cheap!!!!! permalink parent award report block reply SanityGumby -3 points 59 minutes ago The nerve of you being so low iq you don’t understand how it’s good or how this is a psyop you low iq fucks are falling into permalink parent award report block reply 67Vert 1 points 12 minutes ago I’m locked at 2.7%.  I’d take 50 yr am.  Interest only would be even better. permalink award report block reply ParadigmShift2070 1 points 1 hour ago Best I can do is 600k Chinese students permalink award report block reply FatigueIsReal 1 points 53 minutes ago Fucking retard level memes are getting stickied now? I guess we'll need to get the treasury employees to get off their ass and start deporting people. Geeze this is getting bad. permalink award report block reply Flowers-By-Irene 1 points 2 hours ago Can sub for democrats if we run out of illegals. permalink award report block reply VanDeKoik 1 points 31 minutes ago Ok? Dont get one? And if you want 50 million deportations there are openings at ICE right now. permalink award report block reply bemac 1 points 30 minutes ago AI shit permalink award report block reply Goatboy66 1 points 1 hour ago 50 million Deportations will definitely bring down the Cost of Housing. permalink award report block reply VanDeKoik 1 points 28 minutes ago No it won't. permalink parent award report block reply DeltaSierra 1 points 1 hour ago The best is still - Black Sabbath Matters permalink award report block reply try4gain PRO 0 points 1 hour ago ALWAYS BE CHIMPING permalink award report block reply donteatthat 0 points 2 hours ago Well that's just too bad permalink award report block reply Repentnow -2 points 1 hour ago Both is the correct answer. The 50 year mortgage hate is retarded. It just adds an additional option. You can still get what ever length mortgage you want. If you take a 50 year mortgage and make the same payment as a 15 year mortgage, you'll be paid off in 15 years with the exact same interest paid. The advantage of the 50yr is your minimum payment is much lower compared to a 15yr, so if you hit a financial snag anywhere during that 15 years, you could drop back to the lower minimum payment for a little while. permalink award report block reply Parhelion12 3 points 1 hour ago Oh cmon. That's just intellectually dishonest. Combing 50 year mtgs with the widespread financial illiteracy is an AUTOMATIC wealth transfer. permalink parent award report block reply FatigueIsReal 3 points 47 minutes ago So when the 30 year mortgages were created, a wealth transfer happened? Japan and Switzerland offer 50 year mortgages.  Sweden has no limit and the average is 140 years. Japan has previously offered generational 100 year mortgages. Let me know how they're doing compared to the US. Hint: the problem might be darker and have nothing to do with the mortgage term length. permalink parent award report block reply Repentnow 1 points 52 minutes ago If some people are too stupid to understand how mortgage and interest work, then they deserve whatever financial disaster befalls them. People are 100%  responsible for their own selves. permalink parent award report block reply Porkbut -1 points 55 minutes ago Tell me youre a democrat without telling me. Your favorite show is the young turks. Say donor class. permalink parent award report block reply GA_Logic 2 points 1 hour ago Agreed. Dave Ramsey has said if you can't obtain a 15 year mortgage go with a 30 and just pay it off in 15 years. permalink parent award report block reply FatigueIsReal 3 points 46 minutes ago I know many that have used this. The going strategy was to base it on interest.  High interest, get the higher year mortgage and when interest drops, refi for the 10 or 15 year mortgage. permalink parent award report block reply GA_Logic 1 points 40 minutes ago This was very common in the 80s with interest sky high. permalink parent award report block reply berserkerbarrage -5 points 2 hours ago Then  don't take out a 50 year mortgage. They also said that they were working on making 5 and 15 year mortgages more available. Nobody is forcing you to do anything you don't want to, but other people will appreciate the options. We're deporting people as fast as legally possible and at much higher rates than previous administrations (turnaways =/= deportations). If it's not fast enough then maybe you should focus more on electing MAGA candidates to change the law and less on trying to help open borders Democrats win. For the anti-Trump trolls that will inevitably bot the shit out of this thread. permalink award report block reply Mamapedia 4 points 2 hours ago Every person who has legitimate criticisms of Trump's words and actions is not an anti-Trump troll. Blind adulation is for fools.  Thank you for the facts you outlined, but the last sentence conflates valid criticism and trolling. permalink parent award report block reply Porkbut -2 points 56 minutes ago You dont have legitimate criticisms, you just claim you do while sperging over and over like a petulant child. permalink parent award report block reply Mamapedia 2 points 56 minutes ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut 0 points 38 minutes ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 1 more comments... berserkerbarrage -3 points 2 hours ago Where is the legitimate criticism? It's also just a fact that this site is being botted and brigaded by Nick Fuentes trolls. If you can't explain why offering people more mortgage options (on both ends of the spectrum) is a bad thing then it's not a legitimate criticism. If you're blaming Trump for the fact that more people aren't being deported (despite him deporting people as fast as legally possible), that's not legitimate criticism. If you're blaming Trump for high beef prices but you can't say how or why he's responsible for high beef prices, that's not a legitimate criticism. permalink parent award report block reply Mamapedia 1 points 1 hour ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 43 minutes ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 1 hour ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments... TheDevilMonkey 1 points 1 hour ago 1 month old shill account. 👆👃 permalink parent award report block reply berserkerbarrage -3 points 1 hour ago And yet you're the one pushing fake news, anti-Trump narratives on a supposedly pro-Trump site. permalink parent award report block reply TheDevilMonkey 2 points 1 hour ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 1 hour ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 3 more comments... Repentnow 1 points 1 hour ago There's a few non-doomers left, but just like importing a minority of foreigners causes the locals to leave and then they take over — the agitators here are working hard at their goal to cause division and make us long-time residents of T_D leave. permalink parent award report block reply FatigueIsReal 3 points 42 minutes ago There's only one rule that I want them to enforce. Be here for Trump and MAGA So many people shit on Trump without anything other than a regurgitation from some influencer out there. permalink parent award report block reply SanityGumby 0 points 56 minutes ago I’m getting close if the mods are not going to enforce the literal fucking rules on the side panel. Worse yet one of them pinned this obvious psyop permalink parent award report block reply YouEssAye 1 points 44 minutes ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply SHILL_DETECTOR -2 points 2 hours ago the troll was when i said its 6 dollars a pound permalink parent award report block reply berserkerbarrage 2 points 2 hours ago Cool. Now explain how it's Trump fault. permalink parent award report block reply\nSHILL_DETECTOR 37 points 2 hours ago best i can do is 6 dollars a pound ground beef permalink award report block reply KekistanPM 21 points 2 hours ago Free if you're on EBT. permalink parent award report block reply Mamapedia 10 points 2 hours ago Eatin' good in the (neighbor)hood. permalink parent award report block reply Trump4prez 1 points 1 hour ago 60 million deportations permalink parent award report block reply Klaus73 3 points 2 hours ago Honestly things would be better if EBT was moved toward more raw production items like meats and vegetables as opposed to processed shit that just makes you useless and lethargic. permalink parent award report block reply SteveRogers42 5 points 1 hour ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 2 points 57 minutes ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 56 minutes ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply MissingTrump 1 points 47 minutes ago Paid for by taxpayer dollars. Never free. Nothing is ever free. permalink parent award report block reply GuerillaYourDreams 11 points 2 hours ago Nearly $7 a pound, where I live right now. I've stopped buying beef. And I love beef. permalink parent award report block reply Yignuced 8 points 2 hours ago I’d stop paying my 50 year mortgage before I stop eating beef.  Priorities and all. permalink parent award report block reply IncredibleMrE1 2 points 2 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply GuerillaYourDreams 2 points 2 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply RedStoneDeepState 2 points 2 hours ago I paid 3.86 for some 80/20 yesterday. permalink parent award report block reply SHILL_DETECTOR 0 points 2 hours ago where?  texas probably permalink parent award report block reply RedStoneDeepState 2 points 2 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 2 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments... South_Florida_Guy 1 points 2 hours ago lol you beat me to a comment like this one permalink parent award report block reply\nKekistanPM 21 points 2 hours ago Free if you're on EBT. permalink parent award report block reply Mamapedia 10 points 2 hours ago Eatin' good in the (neighbor)hood. permalink parent award report block reply Trump4prez 1 points 1 hour ago 60 million deportations permalink parent award report block reply Klaus73 3 points 2 hours ago Honestly things would be better if EBT was moved toward more raw production items like meats and vegetables as opposed to processed shit that just makes you useless and lethargic. permalink parent award report block reply SteveRogers42 5 points 1 hour ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 2 points 57 minutes ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 56 minutes ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply MissingTrump 1 points 47 minutes ago Paid for by taxpayer dollars. Never free. Nothing is ever free. permalink parent award report block reply\nMamapedia 10 points 2 hours ago Eatin' good in the (neighbor)hood. permalink parent award report block reply Trump4prez 1 points 1 hour ago 60 million deportations permalink parent award report block reply\nTrump4prez 1 points 1 hour ago 60 million deportations permalink parent award report block reply\nKlaus73 3 points 2 hours ago Honestly things would be better if EBT was moved toward more raw production items like meats and vegetables as opposed to processed shit that just makes you useless and lethargic. permalink parent award report block reply SteveRogers42 5 points 1 hour ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 2 points 57 minutes ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 56 minutes ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply\nSteveRogers42 5 points 1 hour ago So that the criminals and rioters could be more energetic? permalink parent award report block reply Refugee1000 2 points 57 minutes ago Was just about to say this lol permalink parent award report block reply Klaus73 2 points 56 minutes ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply\nRefugee1000 2 points 57 minutes ago Was just about to say this lol permalink parent award report block reply\nKlaus73 2 points 56 minutes ago So people actually struggling can get out of the slump that usually follows with poverty rather then turning into fat useless tiktok slugs. permalink parent award report block reply\nMissingTrump 1 points 47 minutes ago Paid for by taxpayer dollars. Never free. Nothing is ever free. permalink parent award report block reply\nGuerillaYourDreams 11 points 2 hours ago Nearly $7 a pound, where I live right now. I've stopped buying beef. And I love beef. permalink parent award report block reply Yignuced 8 points 2 hours ago I’d stop paying my 50 year mortgage before I stop eating beef.  Priorities and all. permalink parent award report block reply IncredibleMrE1 2 points 2 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply GuerillaYourDreams 2 points 2 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply\nYignuced 8 points 2 hours ago I’d stop paying my 50 year mortgage before I stop eating beef.  Priorities and all. permalink parent award report block reply IncredibleMrE1 2 points 2 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply GuerillaYourDreams 2 points 2 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply\nIncredibleMrE1 2 points 2 hours ago You can eat ze bugs and not have any mortgage at all. permalink parent award report block reply\nGuerillaYourDreams 2 points 2 hours ago I only have it once a month. Retirement budget, for now. :) permalink parent award report block reply\nRedStoneDeepState 2 points 2 hours ago I paid 3.86 for some 80/20 yesterday. permalink parent award report block reply SHILL_DETECTOR 0 points 2 hours ago where?  texas probably permalink parent award report block reply RedStoneDeepState 2 points 2 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 2 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments...\nSHILL_DETECTOR 0 points 2 hours ago where?  texas probably permalink parent award report block reply RedStoneDeepState 2 points 2 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 2 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments...\nRedStoneDeepState 2 points 2 hours ago Just outside of DC. permalink parent award report block reply SHILL_DETECTOR 0 points 2 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments...\nSHILL_DETECTOR 0 points 2 hours ago 6.93 here at WALMART and i live in a cheap area, or did... oh god, the giant TUBE MEAT 73/27 (10lb) is 3.86 here but that shit is rubber cement or something, ill never buy it again permalink parent award report block reply view 3 more comments...\nSouth_Florida_Guy 1 points 2 hours ago lol you beat me to a comment like this one permalink parent award report block reply\nbejeavis 22 points 2 hours ago Sorry you don't have enough talent for that permalink award report block reply Viewer01 15 points 2 hours ago Trump has flipped 180 on immigration and is now willing to finish the dilution of whites to minority status. This is an obvious attempt to negate right wingers who were growing critical of Israel. Boomers would sooner sell this country to foreigners than give up on their Zionism. Which is all very ironic because it’s exactly how Weimar played out and will certainly mean the death of the grand ole party. I absolutely will not vote for losers in ‘26 without some massive wins and apologies. permalink parent award report block reply SanityGumby 7 points 1 hour ago He literally hasn’t permalink parent award report block reply happyfave 6 points 1 hour ago How is he flipped 180 on immigration That is the stupidest take I've heard all day permalink parent award report block reply AVeryNakedMan 3 points 35 minutes ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 2 points 29 minutes ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 1 more comments... Fine_Kentucky_Jenkum 1 points 1 hour ago It’s almost as if he is an actor that could play a specific part on a TV role or something… who could have foreseen this? permalink parent award report block reply mohel -1 points 1 hour ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 45 minutes ago lul permalink parent award report block reply try4gain PRO 1 points 1 hour ago he had one bad interview calm your tits permalink parent award report block reply chefjeffb 0 points 49 minutes ago Shut the fuck up Holy fuck \"Yah so Israel told him to do this so he is\" You're such a faggot, good god permalink parent award report block reply load 1 more comments... Buce-Nudo 1 points 48 minutes ago He didn't say that. Watch the clip. permalink parent award report block reply mohel 0 points 2 hours ago Are we going to find out what 2A was meant for? permalink parent award report block reply HunterBidensPC 1 points 2 hours ago We already know what it’s for. Hit the fed needs a nice reminder permalink parent award report block reply\nViewer01 15 points 2 hours ago Trump has flipped 180 on immigration and is now willing to finish the dilution of whites to minority status. This is an obvious attempt to negate right wingers who were growing critical of Israel. Boomers would sooner sell this country to foreigners than give up on their Zionism. Which is all very ironic because it’s exactly how Weimar played out and will certainly mean the death of the grand ole party. I absolutely will not vote for losers in ‘26 without some massive wins and apologies. permalink parent award report block reply SanityGumby 7 points 1 hour ago He literally hasn’t permalink parent award report block reply happyfave 6 points 1 hour ago How is he flipped 180 on immigration That is the stupidest take I've heard all day permalink parent award report block reply AVeryNakedMan 3 points 35 minutes ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 2 points 29 minutes ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 1 more comments... Fine_Kentucky_Jenkum 1 points 1 hour ago It’s almost as if he is an actor that could play a specific part on a TV role or something… who could have foreseen this? permalink parent award report block reply mohel -1 points 1 hour ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 45 minutes ago lul permalink parent award report block reply try4gain PRO 1 points 1 hour ago he had one bad interview calm your tits permalink parent award report block reply chefjeffb 0 points 49 minutes ago Shut the fuck up Holy fuck \"Yah so Israel told him to do this so he is\" You're such a faggot, good god permalink parent award report block reply load 1 more comments...\nSanityGumby 7 points 1 hour ago He literally hasn’t permalink parent award report block reply\nhappyfave 6 points 1 hour ago How is he flipped 180 on immigration That is the stupidest take I've heard all day permalink parent award report block reply AVeryNakedMan 3 points 35 minutes ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 2 points 29 minutes ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 1 more comments...\nAVeryNakedMan 3 points 35 minutes ago MAGA voters are shifting even further right on immigration than Trump ran on, then they are claiming that Trump ran on their current position. Trump never ran on ending all legal immigration. He made a few comments about H1B's but it was never a main issue for his campaign. He was mostly campaigning on deporting illegals, which he is doing. permalink parent award report block reply MakeCaliforniaRED 2 points 29 minutes ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 1 more comments...\nMakeCaliforniaRED 2 points 29 minutes ago I still want more deportations, it’s a drop in the bucket compared to what Xiden Autopen let in for 4 years. permalink parent award report block reply view 1 more comments...\nFine_Kentucky_Jenkum 1 points 1 hour ago It’s almost as if he is an actor that could play a specific part on a TV role or something… who could have foreseen this? permalink parent award report block reply mohel -1 points 1 hour ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 45 minutes ago lul permalink parent award report block reply\nmohel -1 points 1 hour ago such an unexpected turn of events, for sure permalink parent award report block reply PissJuggernaut 1 points 45 minutes ago lul permalink parent award report block reply\nPissJuggernaut 1 points 45 minutes ago lul permalink parent award report block reply\ntry4gain PRO 1 points 1 hour ago he had one bad interview calm your tits permalink parent award report block reply\nchefjeffb 0 points 49 minutes ago Shut the fuck up Holy fuck \"Yah so Israel told him to do this so he is\" You're such a faggot, good god permalink parent award report block reply\nBuce-Nudo 1 points 48 minutes ago He didn't say that. Watch the clip. permalink parent award report block reply\nmohel 0 points 2 hours ago Are we going to find out what 2A was meant for? permalink parent award report block reply HunterBidensPC 1 points 2 hours ago We already know what it’s for. Hit the fed needs a nice reminder permalink parent award report block reply\nHunterBidensPC 1 points 2 hours ago We already know what it’s for. Hit the fed needs a nice reminder permalink parent award report block reply\nSouth_Florida_Guy 18 points 2 hours ago Best I can do is no more pennies permalink award report block reply SHILL_DETECTOR 5 points 2 hours ago thats a better one mines kind of a bait because ground beef is actually more like 8 dollars a pound and people will come in and say its actually 10 dollars a pound in democrat shit holes permalink parent award report block reply South_Florida_Guy 1 points 2 hours ago I'm going to start deep freezer storing hoards of it for future generations. permalink parent award report block reply Krat 1 points 2 hours ago I've seen lean beef in Seattle at almost 20$ a pound. permalink parent award report block reply\nSHILL_DETECTOR 5 points 2 hours ago thats a better one mines kind of a bait because ground beef is actually more like 8 dollars a pound and people will come in and say its actually 10 dollars a pound in democrat shit holes permalink parent award report block reply South_Florida_Guy 1 points 2 hours ago I'm going to start deep freezer storing hoards of it for future generations. permalink parent award report block reply Krat 1 points 2 hours ago I've seen lean beef in Seattle at almost 20$ a pound. permalink parent award report block reply\nSouth_Florida_Guy 1 points 2 hours ago I'm going to start deep freezer storing hoards of it for future generations. permalink parent award report block reply\nKrat 1 points 2 hours ago I've seen lean beef in Seattle at almost 20$ a pound. permalink parent award report block reply\n5DchessWatch 13 points 2 hours ago I don't want 50 yr mortgage I want 50 arrests of the deep staters involved in xfire hurricane/ russiagate/spygate, arctic frost, nimblewill and chancygambit and other projects they're up to that we don't know about yet permalink award report block reply Klaus73 3 points 2 hours ago Mind if I tag Epstien lister onto that? permalink parent award report block reply Appeal2Heaven98 1 points 1 hour ago Best I can do is have Bondi tell you it's on her desk. permalink parent award report block reply SanityGumby 1 points 1 hour ago Then don’t take one you retarded fuck permalink parent award report block reply\nKlaus73 3 points 2 hours ago Mind if I tag Epstien lister onto that? permalink parent award report block reply\nAppeal2Heaven98 1 points 1 hour ago Best I can do is have Bondi tell you it's on her desk. permalink parent award report block reply\nSanityGumby 1 points 1 hour ago Then don’t take one you retarded fuck permalink parent award report block reply\nhenri_derelicte 7 points 2 hours ago I’m open to liquidating illegal immigrants as an alternative to deporting them if it’ll solve this problem faster. If anything, it’ll make self-deportation A LOT more attractive permalink award report block reply\nYodaBannon 6 points 1 hour ago ? deportations are happening, a 50 year mortgage is an option. tarded permalink award report block reply NADSAQ 5 points 1 hour ago this is AI slop permalink parent award report block reply YodaBannon 4 points 1 hour ago sloppy joe permalink parent award report block reply GA_Logic 2 points 1 hour ago You are correct on both points. permalink parent award report block reply YouEssAye 1 points 52 minutes ago deportations are happening On pace to deport about 2.5 million or 5% of 50 million over his 4 year term. They may be happening, but not to the extent that will actually tangibly improve the country. permalink parent award report block reply AVeryNakedMan 1 points 33 minutes ago People don't want to admit that deporting all illegal aliens, while maintaining civil rights and the 4th amendment, is going to take a very long time. You can't just arrest every brown person you see, the way that Eisenhower did. There are tens of millions of Hispanics that are US citizens today. That was not the case back in the days of Operation Wetback. The best thing we can do is push Trump to arrest CEO's for hiring illegals. If that happens, the jobs for illegals will dry up, and self-deportations will skyrocket. permalink parent award report block reply\nNADSAQ 5 points 1 hour ago this is AI slop permalink parent award report block reply YodaBannon 4 points 1 hour ago sloppy joe permalink parent award report block reply\nYodaBannon 4 points 1 hour ago sloppy joe permalink parent award report block reply\nGA_Logic 2 points 1 hour ago You are correct on both points. permalink parent award report block reply\nYouEssAye 1 points 52 minutes ago deportations are happening On pace to deport about 2.5 million or 5% of 50 million over his 4 year term. They may be happening, but not to the extent that will actually tangibly improve the country. permalink parent award report block reply AVeryNakedMan 1 points 33 minutes ago People don't want to admit that deporting all illegal aliens, while maintaining civil rights and the 4th amendment, is going to take a very long time. You can't just arrest every brown person you see, the way that Eisenhower did. There are tens of millions of Hispanics that are US citizens today. That was not the case back in the days of Operation Wetback. The best thing we can do is push Trump to arrest CEO's for hiring illegals. If that happens, the jobs for illegals will dry up, and self-deportations will skyrocket. permalink parent award report block reply\nAVeryNakedMan 1 points 33 minutes ago People don't want to admit that deporting all illegal aliens, while maintaining civil rights and the 4th amendment, is going to take a very long time. You can't just arrest every brown person you see, the way that Eisenhower did. There are tens of millions of Hispanics that are US citizens today. That was not the case back in the days of Operation Wetback. The best thing we can do is push Trump to arrest CEO's for hiring illegals. If that happens, the jobs for illegals will dry up, and self-deportations will skyrocket. permalink parent award report block reply\nSanityGumby 6 points 1 hour ago What fucking retard stickied a psyop permalink award report block reply YouEssAye 0 points 51 minutes ago Do you ever stop to think if you're the one that's fallen for a psyop and not everyone else? permalink parent award report block reply chefjeffb 2 points 48 minutes ago No, it's you faggots clamoring away about Trump turning his back to immigration efforts permalink parent award report block reply YouEssAye 0 points 41 minutes ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -1 points 30 minutes ago Show proof of that promise, assaye permalink parent award report block reply view 2 more comments... Buce-Nudo 1 points 48 minutes ago Did you finish cleaning Charlie's blood off your hands yet? permalink parent award report block reply Porkbut 0 points 30 minutes ago Do you? permalink parent award report block reply YouEssAye 0 points 24 minutes ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 19 minutes ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 1 more comments...\nYouEssAye 0 points 51 minutes ago Do you ever stop to think if you're the one that's fallen for a psyop and not everyone else? permalink parent award report block reply chefjeffb 2 points 48 minutes ago No, it's you faggots clamoring away about Trump turning his back to immigration efforts permalink parent award report block reply YouEssAye 0 points 41 minutes ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -1 points 30 minutes ago Show proof of that promise, assaye permalink parent award report block reply view 2 more comments... Buce-Nudo 1 points 48 minutes ago Did you finish cleaning Charlie's blood off your hands yet? permalink parent award report block reply Porkbut 0 points 30 minutes ago Do you? permalink parent award report block reply YouEssAye 0 points 24 minutes ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 19 minutes ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 1 more comments...\nchefjeffb 2 points 48 minutes ago No, it's you faggots clamoring away about Trump turning his back to immigration efforts permalink parent award report block reply YouEssAye 0 points 41 minutes ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -1 points 30 minutes ago Show proof of that promise, assaye permalink parent award report block reply view 2 more comments...\nYouEssAye 0 points 41 minutes ago Where are the mass deportations we were promised? permalink parent award report block reply Porkbut -1 points 30 minutes ago Show proof of that promise, assaye permalink parent award report block reply view 2 more comments...\nPorkbut -1 points 30 minutes ago Show proof of that promise, assaye permalink parent award report block reply view 2 more comments...\nBuce-Nudo 1 points 48 minutes ago Did you finish cleaning Charlie's blood off your hands yet? permalink parent award report block reply\nPorkbut 0 points 30 minutes ago Do you? permalink parent award report block reply YouEssAye 0 points 24 minutes ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 19 minutes ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 1 more comments...\nYouEssAye 0 points 24 minutes ago Please tell me, what psyop do you think I've fallen for? permalink parent award report block reply Porkbut -1 points 19 minutes ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 1 more comments...\nPorkbut -1 points 19 minutes ago \"Fallen for\" or are perpetrating? The psyop youre perpetrating is that youre making an optional 50 year mortgage into a mountain out of a mole hill, thats an easy one propagandist. Best youve got? permalink parent award report block reply view 1 more comments...\nThrowingway22 5 points 57 minutes ago A 50-year mortgage + reducing the use of credit scores in applicants would only expand the demand for houses without touching the supply. It would be another program to give inner-city joggers the ability to move next door in the suburb people moved to to get away from the crime and decay. Just absolute South Africanization of America. permalink award report block reply FatigueIsReal 2 points 52 minutes ago Reducing the use of credit scores has been suggested? permalink parent award report block reply Porkbut 1 points 28 minutes ago In propagandaland, yes permalink parent award report block reply Refugee1000 1 points 54 minutes ago 100%, talk about DEI. What we need is to de regulate building. If someone wants to build a log cabin with nothing but a toilet in the corner fucking let them. Why is a 100 year old house legal to live in but a new one isn't unless you make an 3 foot wide door because someone who buys the house from you might be a gimp. And all the minimum square footage bs permalink parent award report block reply\nFatigueIsReal 2 points 52 minutes ago Reducing the use of credit scores has been suggested? permalink parent award report block reply Porkbut 1 points 28 minutes ago In propagandaland, yes permalink parent award report block reply\nPorkbut 1 points 28 minutes ago In propagandaland, yes permalink parent award report block reply\nRefugee1000 1 points 54 minutes ago 100%, talk about DEI. What we need is to de regulate building. If someone wants to build a log cabin with nothing but a toilet in the corner fucking let them. Why is a 100 year old house legal to live in but a new one isn't unless you make an 3 foot wide door because someone who buys the house from you might be a gimp. And all the minimum square footage bs permalink parent award report block reply\n5DchessWatch 5 points 2 hours ago Best I can do is spraying cologne on an ex al queda guy running syria now permalink award report block reply TrumpPlay3dYouLoL 1 points 1 hour ago Comment removed by community moderators. permalink parent award report block reply\nTrumpPlay3dYouLoL 1 points 1 hour ago Comment removed by community moderators. permalink parent award report block reply\nIvIA6A 4 points 2 hours ago Housing so affordable you only need a 15 year mortgage. permalink award report block reply\nBillyBillington 4 points 1 hour ago We need cheaper houses. Not 50 years of interest payments to a fucking bank. permalink award report block reply VanDeKoik 1 points 27 minutes ago And how do you get \"cheaper homes\"? Well wait... permalink parent award report block reply\nVanDeKoik 1 points 27 minutes ago And how do you get \"cheaper homes\"? Well wait... permalink parent award report block reply\nNADSAQ 4 points 1 hour ago ai slop permalink award report block reply\nRock9Head 2 points 47 minutes ago That would fix housing. permalink award report block reply\n2Guns1ForEachofYa 2 points 47 minutes ago Including H1Bs permalink award report block reply\nEmodius 2 points 1 hour ago You'll have both. permalink award report block reply\nDITTOPatriot 2 points 55 minutes ago Good luck with that, unless you're one of the ones surrounding the administration, and it’s going to be a plus if you can promise a seaside resort. permalink award report block reply\ncyberwar 2 points 1 hour ago why can't you have both? permalink award report block reply\nHeavenlyTrumpets 2 points 49 minutes ago Yep permalink award report block reply\nIllah88zillah 2 points 1 hour ago The nerve of anyone telling you this is good MAKE 15 YEAR MORTGAGES AFFORDABLE AGAIN. DEPORT BABY, DEPORT. permalink award report block reply FatigueIsReal 1 points 45 minutes ago So let's say I'm selling my house. Why am I going to lower the price because of some deportations? permalink parent award report block reply VanDeKoik 1 points 28 minutes ago Because dumbasses seriously think all of the homes are being bought by illegals. permalink parent award report block reply VanDeKoik 1 points 29 minutes ago Ok. Well \"make it\". Magic wand wave it cheap!!!!! permalink parent award report block reply SanityGumby -3 points 59 minutes ago The nerve of you being so low iq you don’t understand how it’s good or how this is a psyop you low iq fucks are falling into permalink parent award report block reply\nFatigueIsReal 1 points 45 minutes ago So let's say I'm selling my house. Why am I going to lower the price because of some deportations? permalink parent award report block reply VanDeKoik 1 points 28 minutes ago Because dumbasses seriously think all of the homes are being bought by illegals. permalink parent award report block reply\nVanDeKoik 1 points 28 minutes ago Because dumbasses seriously think all of the homes are being bought by illegals. permalink parent award report block reply\nVanDeKoik 1 points 29 minutes ago Ok. Well \"make it\". Magic wand wave it cheap!!!!! permalink parent award report block reply\nSanityGumby -3 points 59 minutes ago The nerve of you being so low iq you don’t understand how it’s good or how this is a psyop you low iq fucks are falling into permalink parent award report block reply\n67Vert 1 points 12 minutes ago I’m locked at 2.7%.  I’d take 50 yr am.  Interest only would be even better. permalink award report block reply\nParadigmShift2070 1 points 1 hour ago Best I can do is 600k Chinese students permalink award report block reply\nFatigueIsReal 1 points 53 minutes ago Fucking retard level memes are getting stickied now? I guess we'll need to get the treasury employees to get off their ass and start deporting people. Geeze this is getting bad. permalink award report block reply\nFlowers-By-Irene 1 points 2 hours ago Can sub for democrats if we run out of illegals. permalink award report block reply\nVanDeKoik 1 points 31 minutes ago Ok? Dont get one? And if you want 50 million deportations there are openings at ICE right now. permalink award report block reply\nbemac 1 points 30 minutes ago AI shit permalink award report block reply\nGoatboy66 1 points 1 hour ago 50 million Deportations will definitely bring down the Cost of Housing. permalink award report block reply VanDeKoik 1 points 28 minutes ago No it won't. permalink parent award report block reply\nVanDeKoik 1 points 28 minutes ago No it won't. permalink parent award report block reply\nDeltaSierra 1 points 1 hour ago The best is still - Black Sabbath Matters permalink award report block reply\ntry4gain PRO 0 points 1 hour ago ALWAYS BE CHIMPING permalink award report block reply\ndonteatthat 0 points 2 hours ago Well that's just too bad permalink award report block reply\nRepentnow -2 points 1 hour ago Both is the correct answer. The 50 year mortgage hate is retarded. It just adds an additional option. You can still get what ever length mortgage you want. If you take a 50 year mortgage and make the same payment as a 15 year mortgage, you'll be paid off in 15 years with the exact same interest paid. The advantage of the 50yr is your minimum payment is much lower compared to a 15yr, so if you hit a financial snag anywhere during that 15 years, you could drop back to the lower minimum payment for a little while. permalink award report block reply Parhelion12 3 points 1 hour ago Oh cmon. That's just intellectually dishonest. Combing 50 year mtgs with the widespread financial illiteracy is an AUTOMATIC wealth transfer. permalink parent award report block reply FatigueIsReal 3 points 47 minutes ago So when the 30 year mortgages were created, a wealth transfer happened? Japan and Switzerland offer 50 year mortgages.  Sweden has no limit and the average is 140 years. Japan has previously offered generational 100 year mortgages. Let me know how they're doing compared to the US. Hint: the problem might be darker and have nothing to do with the mortgage term length. permalink parent award report block reply Repentnow 1 points 52 minutes ago If some people are too stupid to understand how mortgage and interest work, then they deserve whatever financial disaster befalls them. People are 100%  responsible for their own selves. permalink parent award report block reply Porkbut -1 points 55 minutes ago Tell me youre a democrat without telling me. Your favorite show is the young turks. Say donor class. permalink parent award report block reply GA_Logic 2 points 1 hour ago Agreed. Dave Ramsey has said if you can't obtain a 15 year mortgage go with a 30 and just pay it off in 15 years. permalink parent award report block reply FatigueIsReal 3 points 46 minutes ago I know many that have used this. The going strategy was to base it on interest.  High interest, get the higher year mortgage and when interest drops, refi for the 10 or 15 year mortgage. permalink parent award report block reply GA_Logic 1 points 40 minutes ago This was very common in the 80s with interest sky high. permalink parent award report block reply\nParhelion12 3 points 1 hour ago Oh cmon. That's just intellectually dishonest. Combing 50 year mtgs with the widespread financial illiteracy is an AUTOMATIC wealth transfer. permalink parent award report block reply FatigueIsReal 3 points 47 minutes ago So when the 30 year mortgages were created, a wealth transfer happened? Japan and Switzerland offer 50 year mortgages.  Sweden has no limit and the average is 140 years. Japan has previously offered generational 100 year mortgages. Let me know how they're doing compared to the US. Hint: the problem might be darker and have nothing to do with the mortgage term length. permalink parent award report block reply Repentnow 1 points 52 minutes ago If some people are too stupid to understand how mortgage and interest work, then they deserve whatever financial disaster befalls them. People are 100%  responsible for their own selves. permalink parent award report block reply Porkbut -1 points 55 minutes ago Tell me youre a democrat without telling me. Your favorite show is the young turks. Say donor class. permalink parent award report block reply\nFatigueIsReal 3 points 47 minutes ago So when the 30 year mortgages were created, a wealth transfer happened? Japan and Switzerland offer 50 year mortgages.  Sweden has no limit and the average is 140 years. Japan has previously offered generational 100 year mortgages. Let me know how they're doing compared to the US. Hint: the problem might be darker and have nothing to do with the mortgage term length. permalink parent award report block reply\nRepentnow 1 points 52 minutes ago If some people are too stupid to understand how mortgage and interest work, then they deserve whatever financial disaster befalls them. People are 100%  responsible for their own selves. permalink parent award report block reply\nPorkbut -1 points 55 minutes ago Tell me youre a democrat without telling me. Your favorite show is the young turks. Say donor class. permalink parent award report block reply\nGA_Logic 2 points 1 hour ago Agreed. Dave Ramsey has said if you can't obtain a 15 year mortgage go with a 30 and just pay it off in 15 years. permalink parent award report block reply FatigueIsReal 3 points 46 minutes ago I know many that have used this. The going strategy was to base it on interest.  High interest, get the higher year mortgage and when interest drops, refi for the 10 or 15 year mortgage. permalink parent award report block reply GA_Logic 1 points 40 minutes ago This was very common in the 80s with interest sky high. permalink parent award report block reply\nFatigueIsReal 3 points 46 minutes ago I know many that have used this. The going strategy was to base it on interest.  High interest, get the higher year mortgage and when interest drops, refi for the 10 or 15 year mortgage. permalink parent award report block reply GA_Logic 1 points 40 minutes ago This was very common in the 80s with interest sky high. permalink parent award report block reply\nGA_Logic 1 points 40 minutes ago This was very common in the 80s with interest sky high. permalink parent award report block reply\nberserkerbarrage -5 points 2 hours ago Then  don't take out a 50 year mortgage. They also said that they were working on making 5 and 15 year mortgages more available. Nobody is forcing you to do anything you don't want to, but other people will appreciate the options. We're deporting people as fast as legally possible and at much higher rates than previous administrations (turnaways =/= deportations). If it's not fast enough then maybe you should focus more on electing MAGA candidates to change the law and less on trying to help open borders Democrats win. For the anti-Trump trolls that will inevitably bot the shit out of this thread. permalink award report block reply Mamapedia 4 points 2 hours ago Every person who has legitimate criticisms of Trump's words and actions is not an anti-Trump troll. Blind adulation is for fools.  Thank you for the facts you outlined, but the last sentence conflates valid criticism and trolling. permalink parent award report block reply Porkbut -2 points 56 minutes ago You dont have legitimate criticisms, you just claim you do while sperging over and over like a petulant child. permalink parent award report block reply Mamapedia 2 points 56 minutes ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut 0 points 38 minutes ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 1 more comments... berserkerbarrage -3 points 2 hours ago Where is the legitimate criticism? It's also just a fact that this site is being botted and brigaded by Nick Fuentes trolls. If you can't explain why offering people more mortgage options (on both ends of the spectrum) is a bad thing then it's not a legitimate criticism. If you're blaming Trump for the fact that more people aren't being deported (despite him deporting people as fast as legally possible), that's not legitimate criticism. If you're blaming Trump for high beef prices but you can't say how or why he's responsible for high beef prices, that's not a legitimate criticism. permalink parent award report block reply Mamapedia 1 points 1 hour ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 43 minutes ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 1 hour ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments... TheDevilMonkey 1 points 1 hour ago 1 month old shill account. 👆👃 permalink parent award report block reply berserkerbarrage -3 points 1 hour ago And yet you're the one pushing fake news, anti-Trump narratives on a supposedly pro-Trump site. permalink parent award report block reply TheDevilMonkey 2 points 1 hour ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 1 hour ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 3 more comments... Repentnow 1 points 1 hour ago There's a few non-doomers left, but just like importing a minority of foreigners causes the locals to leave and then they take over — the agitators here are working hard at their goal to cause division and make us long-time residents of T_D leave. permalink parent award report block reply FatigueIsReal 3 points 42 minutes ago There's only one rule that I want them to enforce. Be here for Trump and MAGA So many people shit on Trump without anything other than a regurgitation from some influencer out there. permalink parent award report block reply SanityGumby 0 points 56 minutes ago I’m getting close if the mods are not going to enforce the literal fucking rules on the side panel. Worse yet one of them pinned this obvious psyop permalink parent award report block reply YouEssAye 1 points 44 minutes ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply SHILL_DETECTOR -2 points 2 hours ago the troll was when i said its 6 dollars a pound permalink parent award report block reply berserkerbarrage 2 points 2 hours ago Cool. Now explain how it's Trump fault. permalink parent award report block reply\nMamapedia 4 points 2 hours ago Every person who has legitimate criticisms of Trump's words and actions is not an anti-Trump troll. Blind adulation is for fools.  Thank you for the facts you outlined, but the last sentence conflates valid criticism and trolling. permalink parent award report block reply Porkbut -2 points 56 minutes ago You dont have legitimate criticisms, you just claim you do while sperging over and over like a petulant child. permalink parent award report block reply Mamapedia 2 points 56 minutes ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut 0 points 38 minutes ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 1 more comments... berserkerbarrage -3 points 2 hours ago Where is the legitimate criticism? It's also just a fact that this site is being botted and brigaded by Nick Fuentes trolls. If you can't explain why offering people more mortgage options (on both ends of the spectrum) is a bad thing then it's not a legitimate criticism. If you're blaming Trump for the fact that more people aren't being deported (despite him deporting people as fast as legally possible), that's not legitimate criticism. If you're blaming Trump for high beef prices but you can't say how or why he's responsible for high beef prices, that's not a legitimate criticism. permalink parent award report block reply Mamapedia 1 points 1 hour ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 43 minutes ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 1 hour ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments...\nPorkbut -2 points 56 minutes ago You dont have legitimate criticisms, you just claim you do while sperging over and over like a petulant child. permalink parent award report block reply Mamapedia 2 points 56 minutes ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut 0 points 38 minutes ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 1 more comments...\nMamapedia 2 points 56 minutes ago Oh Jesus, go with that if it makes you feel better. You may find that your blinders serve the left very well in the not so distant future. permalink parent award report block reply Porkbut 0 points 38 minutes ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 1 more comments...\nPorkbut 0 points 38 minutes ago Complaining about an option you dont have to take while hes trying to do nearly everything else he ran on is not legitimate criticism, sorry if you dont like that. The only, and I mean only, legitimate criticism ive seen of him lately is that the ingrham interview could have been alot better, and he doesnt seem to be dooming like everyone else so hes trying to focus on things hes doing right now. Is he a little out of touch in it, yeah, but if everyone is going to go full chicken little over an interview that wasnt great, MAGA deserves to lose far more than just the midterms. The democrats were loyal to biden for 4 years no matter what he did and he was a literal potato. MAGA is just fickle people who want magic wands to fix everything immediately apparently because the media plays into your attitudes, knowing you'll end up self destructing just like the democrats are doing. Only they'll be able to pull together in elections, because they are at least unified in their hatred of you. So dont forget to adjust your own blinders while acting smug. permalink parent award report block reply view 1 more comments...\nberserkerbarrage -3 points 2 hours ago Where is the legitimate criticism? It's also just a fact that this site is being botted and brigaded by Nick Fuentes trolls. If you can't explain why offering people more mortgage options (on both ends of the spectrum) is a bad thing then it's not a legitimate criticism. If you're blaming Trump for the fact that more people aren't being deported (despite him deporting people as fast as legally possible), that's not legitimate criticism. If you're blaming Trump for high beef prices but you can't say how or why he's responsible for high beef prices, that's not a legitimate criticism. permalink parent award report block reply Mamapedia 1 points 1 hour ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 43 minutes ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 1 hour ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments...\nMamapedia 1 points 1 hour ago Both exist.  You only appear willing to acknowledge the trolling.  Am I to understand that one must be 100% pro Israel and pro-corporate to be MAGA?  There are pressing domestic issues that should come first, and Trump seems to be otherwise engaged at this point, given what he has said about h1b's and his international focus.  I have to say that the ballroom business and the corporate love fest is awful for optics and the morale of those who are looking to Trump for economic relief, and I'm not talking about welfare recipients, but working people who keep falling farther behind despite their efforts.  If you don't see that and acknowledge the threat that it is, you must live in pretty rarified circumstances.  A people with a bleak future are very easy prey. permalink parent award report block reply FatigueIsReal 2 points 43 minutes ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments... berserkerbarrage 0 points 1 hour ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments...\nFatigueIsReal 2 points 43 minutes ago The fuck does Israel have to do with this conversation? permalink parent award report block reply view 1 more comments...\nberserkerbarrage 0 points 1 hour ago Nope, I am anti-Israel and anti-Jew, and you still haven't provided any legitimate criticisms. The ballroom? LOL. If we divided up the cost of the ballroom (which isn't being paid for by the tax payers) between everybody in America, you'd have less than $1. You want a dollar? permalink parent award report block reply view 1 more comments...\nTheDevilMonkey 1 points 1 hour ago 1 month old shill account. 👆👃 permalink parent award report block reply berserkerbarrage -3 points 1 hour ago And yet you're the one pushing fake news, anti-Trump narratives on a supposedly pro-Trump site. permalink parent award report block reply TheDevilMonkey 2 points 1 hour ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 1 hour ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 3 more comments...\nberserkerbarrage -3 points 1 hour ago And yet you're the one pushing fake news, anti-Trump narratives on a supposedly pro-Trump site. permalink parent award report block reply TheDevilMonkey 2 points 1 hour ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 1 hour ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 3 more comments...\nTheDevilMonkey 2 points 1 hour ago It's not fake news that Trump is filling our work force with street shitting jeets and our universities with chi coms. You are either a cultist or a shill and you can fuck yourself with a claw hammer. permalink parent award report block reply berserkerbarrage -3 points 1 hour ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 3 more comments...\nberserkerbarrage -3 points 1 hour ago Yes, it is fake news. H1B workers are less than 3% of the tech industry, and a fraction of a percentage of the overall work force. And we've always accepted foreign students, which account for roughly 5% of students. It's not something new and if anything, Trump has significantly cracked down on the abuse of such programs. permalink parent award report block reply view 3 more comments...\nRepentnow 1 points 1 hour ago There's a few non-doomers left, but just like importing a minority of foreigners causes the locals to leave and then they take over — the agitators here are working hard at their goal to cause division and make us long-time residents of T_D leave. permalink parent award report block reply FatigueIsReal 3 points 42 minutes ago There's only one rule that I want them to enforce. Be here for Trump and MAGA So many people shit on Trump without anything other than a regurgitation from some influencer out there. permalink parent award report block reply SanityGumby 0 points 56 minutes ago I’m getting close if the mods are not going to enforce the literal fucking rules on the side panel. Worse yet one of them pinned this obvious psyop permalink parent award report block reply YouEssAye 1 points 44 minutes ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply\nFatigueIsReal 3 points 42 minutes ago There's only one rule that I want them to enforce. Be here for Trump and MAGA So many people shit on Trump without anything other than a regurgitation from some influencer out there. permalink parent award report block reply\nSanityGumby 0 points 56 minutes ago I’m getting close if the mods are not going to enforce the literal fucking rules on the side panel. Worse yet one of them pinned this obvious psyop permalink parent award report block reply YouEssAye 1 points 44 minutes ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply\nYouEssAye 1 points 44 minutes ago You fucking retards are doing yourselves a disservice by thinking this is from \"anti-trump trolls\" and \"Fuentes trolls\". I've been a hardcore Trump fan since the escalator. I've been harassed many times for wearing my MAGA hat in public. I've donated money despite being on a tight budget. I've been to 3 rallies. I've fought friends and family endlessly for Trump. We're not getting what we voted for. permalink parent award report block reply\nSHILL_DETECTOR -2 points 2 hours ago the troll was when i said its 6 dollars a pound permalink parent award report block reply berserkerbarrage 2 points 2 hours ago Cool. Now explain how it's Trump fault. permalink parent award report block reply\nberserkerbarrage 2 points 2 hours ago Cool. Now explain how it's Trump fault. permalink parent award report block reply"
}