{
  "id": "1ARK56jI4P",
  "url": "https://patriots.win/p/1ARK56jI4P/the-price-is-white/c",
  "content": "723 THE PRICE IS WHITE posted 5 days ago by I-am-Orlando PRO 108 comments award share download report block\n108 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow mel_to_the_core 93 points 5 days ago They already do. permalink award report block reply UncleTrumpsBand 31 points 5 days ago Thats the neat trick, now its triple! permalink parent award report block reply OldGamerGuy79 23 points 5 days ago The anglophobia is real. permalink parent award report block reply Granny 11 points 5 days ago Sounds like jizya.... permalink parent award report block reply MCPHX84 5 points 5 days ago Good thing I don’t identify as a white. permalink parent award report block reply view 7 more comments... TheRPatriot 14 points 5 days ago That’s what these communist retards don’t understand. The wealthy already pay an exorbitant amount in taxes permalink parent award report block reply Tophat9000 12 points 5 days ago Lol They know that... They don't care Communists are thieves... A thief doesn't say oh I've already stolen too much from this person I'll quit now permalink parent award report block reply Sig229 6 points 5 days ago If they don't sort out elections fast - which means killing the filibuster - then America will be an Islamic caliphate in less than two decades....and we all know that means the rest of the planet is fucked well before that permalink parent award report block reply ColonelKlink 11 points 5 days ago They make us pay for everything. This shit has to stop. permalink parent award report block reply MuslimsWorshipSatan 4 points 5 days ago It won't until there's a lot of empty brass. permalink parent award report block reply Judenfrei -1 points 5 days ago One man tried to speak up for his people.. https://www.bitchute.com/video/mbvSjcRjJri8 permalink parent award report block reply Billionaired 70 points 5 days ago He wants all the white people to leave so he can bring in more Muslims.  Just another tactic like London and Paris. permalink award report block reply Filo76 27 points 5 days ago Exactly. It’s a win/win for him. Whites stay, they pay the high tax. They leave, put Muslims in their place. permalink parent award report block reply tallon 19 points 5 days ago Jizya tax permalink parent award report block reply Lelleck 5 points 5 days ago This is what people don‘t understand. Immediate implementation of a tax for non muslims. permalink parent award report block reply EdBuck 8 points 5 days ago Yeah but that city will grind to a halt these Muslims don't work permalink parent award report block reply Lelleck 2 points 5 days ago Trump announced to stop all payments. He does not… If the payments don‘t stop. They will keep on leeching. permalink parent award report block reply LookFatty 3 points 5 days ago The not so long plan permalink parent award report block reply NomadicKrow2 3 points 5 days ago Also, they leave, and vote blue in other states. permalink parent award report block reply OGpsywar 11 points 5 days ago The goal isn't to even try to succeed, it's to continue pulling down the US's cities by making its producers and creators leave them. ☪️🌏👃🤝 permalink parent award report block reply Klaus73 7 points 5 days ago Curious...doesn't this cross some sort of discrimination law? permalink parent award report block reply Billionaired 7 points 5 days ago Discrimination, you say?  WTF is that?  Only applies to non-whites. permalink parent award report block reply Klaus73 4 points 5 days ago I was pretty sure there looooong ago was this wild notion of all men being equal under god or some such... permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Content of character you say? permalink parent award report block reply lixa 2 points 5 days ago Yes, it'd be a lawsuit and easy win. permalink parent award report block reply Klaus73 2 points 5 days ago Yeah thats kind of what I figure - it would be nice if folks didn't need to have to constantly launch lawsuits against the government not to buttfuck them.. permalink parent award report block reply lixa 1 points 4 days ago Indeed. Passing a blatantly unconstitutional law should result in removal from office. permalink parent award report block reply deleted 5 points 5 days ago MaoHadOnly1Testicle 2 points 5 days ago If anyone wants an estimate of what the damage would look like, here's a NUKEMAP link permalink parent award report block reply LeRiverDanube 1 points 5 days ago theres a problem with that chief. white people are there gibbits, they leave in a considerable number and the socialism grift dies with them. on the other hand nyc is a crumbling shithole permalink parent award report block reply load 1 more comments... ManOfThePeople 26 points 5 days ago Do white neighborhoods even exist in NYC anymore? permalink award report block reply Filo76 13 points 5 days ago Staten Island. permalink parent award report block reply deleted 19 points 5 days ago BloodElfSupporter 5 points 5 days ago That’s actually a pretty good analogy lol permalink parent award report block reply _fidelio 1 points 5 days ago The Cuomintang administration has fled to Staten Island permalink parent award report block reply ManOfThePeople 5 points 5 days ago Damn. I can't believe I forgot about Staten Island. They voted for Trump. permalink parent award report block reply CandyBarr 2 points 5 days ago I just learned that Sicily is actually African geographicly. Just putting that out there. Hahahaha permalink parent award report block reply analog_shitposter 2 points 5 days ago Where’d you learn that? They may not think of themselves as Italian, and their gene pool includes genes from just about everywhere that can access Sicily by sea, but that island is not African permalink parent award report block reply CandyBarr 4 points 5 days ago It's on the same plate as Africa. Platetechtonichally (sp I'm sure) Sicily is Africa jamming it's island into the boot of Europe. permalink parent award report block reply view 2 more comments... djpat 2 points 5 days ago Congress needs to just declare that part of Jersey permalink parent award report block reply canada_is_communist 11 points 5 days ago So racism, got it. permalink award report block reply MadRussian 11 points 5 days ago Women who elected him wanted to be raped by mudslimes, so mission accomplished I should say. permalink award report block reply carpetxparmesan 4 points 5 days ago TFW you expect to open your cuntflaps and you have to actually open your leather wallet...no, no old lady, not THAT leather wallet! permalink parent award report block reply SavingPrivateGrace 10 points 5 days ago Sharia law or did he think of that himself? permalink award report block reply Filo76 13 points 5 days ago Jizya tax. permalink parent award report block reply UncleTrumpsBand 2 points 5 days ago Shakira Law permalink parent award report block reply TonyTheSlop 9 points 5 days ago They voted for it right? permalink award report block reply carpetxparmesan 8 points 5 days ago Young white women did, allegedly. These bitches are dumber than a bag full of kittens floating in a river. Someone REALLY needs to be studying how to take these cunts over because they're too stupid to ignore as a customer base. It does not get dumber or more self-destructive than this. permalink parent award report block reply CandyBarr 6 points 5 days ago White girls have pink nipples and normal sized noses. Most of the twitter woman I saw pimping Zohran did not fall into both categories. permalink parent award report block reply usernamechecksout 2 points 5 days ago So, look at the data. Your anecdote is crap. permalink parent award report block reply CandyBarr 2 points 5 days ago You can link a tweet. I'm sure theirs enough Pedes to be judges here and I obviously volunteer. For the science of it all obviously. permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago Data is crap. jews aren't White. arabs aren't White. persians aren't White. hispanics aren't White. You'll never find data compiled to reflect this reality. permalink parent award report block reply carpetxparmesan 2 points 4 days ago You might be onto something with who influences them. But the responsibility, as always, falls on the gay and fake retard who votes and does the deed. But if you ask me is the left capable of gaslighting and juking the stats so badly that NYC is now populated mostly by non-white \"whites\"? I'd find that plausible too. After all, white girls are more likely to get a college ride, but \"white\" girls are WAY more likely to get a college ride. That's just how the discrimination has been stacked for many decades. As far as internet influencers go, after the \"7k club\", and elon's 50% bots problem that he still hasn't fixed too much and the tencent army and its pajeet equivalent, things might be very fake and very gay indeed on the internet. The stats are what they are. Anyone dating in NYC knows the dating pool is what it is there, I'm not going to make any spicy anecdotal claims, but iykyk. So I'm not going to sit here and argue with you that the white women in the stats are very caucasian because yeah, might not be the case. I'm not someone who particularly cares about that detail, but yeah, it's a good point you raise. And if there are people who don't know these things already, they should be exposed to this information. permalink parent award report block reply Winter_Is_Coming2020 6 points 5 days ago From June. permalink award report block reply Justlooking250 6 points 5 days ago Not even 24 hours after 'his victory' that absolute LOSER was asking for donations to pay for more promised 'fReE gIbSz' and guess what ? Some of those liberal cunts will voluntarily hand that Marxist piece of shit even more money besides all the taxes they pay to NYC permalink award report block reply UncleTrumpsBand 6 points 5 days ago What constitutes as “white”? permalink award report block reply Ch3f4554551n 12 points 5 days ago To Marxists, \"White Rich People\" are anyone who has a penny more than they do. permalink parent award report block reply CandyBarr 3 points 5 days ago R1B permalink parent award report block reply Roadpower 2 points 5 days ago If you have stuff to take and don't present as anything darker than white. permalink parent award report block reply UncleTrumpsBand 2 points 5 days ago I identify as Cream Peach. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago European ancestry. Not south or east of the Mediterranean. permalink parent award report block reply thisisatestof2 1 points 5 days ago I mean, it is 2025 in New York City, so therefore, didn’t you dis identify something else? permalink parent award report block reply fightfightfightx 5 points 5 days ago after the jewish supremacists import enough 3rd worlders to America, this is their goal for ALL of America law be damned, they already ignore the civil rights law with discrimination against whites in school and jobs. Its how they seized power. Through racism. Its a lot easier to get hired over a white when you can illegally discriminate against one. permalink award report block reply TrumpAndGodWin 3 points 5 days ago Kalergi and UN plan for replacement 'migration.' permalink parent award report block reply DingleBalls 5 points 5 days ago Literally discrimination permalink award report block reply tlorsung 4 points 5 days ago Ok, NYC citizens fascination of Mamdani just didn't happen over night.  It was due to past Mayors and their poor decisions that favored wealthy over poor,  they help the poor but making them dependent on GOV and it grew and Past politicians did NOTHING.   ALL blue cities have these issues, yet democrats continue voting for these bad politicians. permalink award report block reply m0ntsta 4 points 5 days ago White people need to start purging these societal hemorrhoids. permalink award report block reply givethismanacoat 4 points 5 days ago SC would throw it out. permalink award report block reply MakinBacon 3 points 5 days ago have to get there first. permalink parent award report block reply grassshrimp 4 points 5 days ago White people didn't vote for this. White voters make up about 32% of NYC's population and a similar share of the electorate. Post-election breakdowns indicate Mamdani received 38% of the white vote, per detailed precinct and exit poll analyses. permalink award report block reply Rock9Head 3 points 5 days ago Karens will get mean. permalink award report block reply SicSemperTyrannis2 2 points 4 days ago Oh no. Anyway ... permalink parent award report block reply HoganP 3 points 5 days ago Lived in NYC for a decade.  I'm not aware that there are white neighborhoods. permalink award report block reply Abovethefray 3 points 5 days ago The White neighborhoods have one eighth the amount of cops.  Why is that I wonder? permalink award report block reply Moose_Antlers 2 points 5 days ago All that has to happen is a simple constitutional challenge. Any such law would be struck down. This is rhetoric to appease his racist af base. permalink award report block reply behemoth887 2 points 5 days ago conquer canada jeets are flown in by the millions into the totally conquered canada and turned into citizens on arrival run all humans out of lib york shitty lib york shitty is now a lib fortress and an immigration hub to bring jeets in directly from the totally conquered canada we get overran by jeets pretty much instantly permalink award report block reply MakinBacon 2 points 5 days ago if he admits he's a goat fucker on live tv...... permalink award report block reply Lance_Romance 2 points 5 days ago buckle up new york permalink award report block reply terribletwos 2 points 5 days ago Easiest case to win ever. Class action lawsuit that shit. permalink award report block reply EdBuck 2 points 5 days ago Fan Fucking Tastic. It's going to be a white person desert. Then they will have nobody to rob, murder, and tax. Then they'll eat each other It's going to be like Uganda lololol permalink award report block reply FreedomFromGovt 2 points 5 days ago Worse, it'll be like...Detroit... permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Still not a win. That just means the Muslim takeover proceeds faster. permalink parent award report block reply Keep_on_winning_kag 2 points 5 days ago That's racist. permalink award report block reply RexCollumSilvarum 1 points 5 days ago You know why there are so few white neighborhoods in big cities, and particularly working-class white neighborhoods?  Because the powers that be pushed them all out to car-dependent suburbs to get that money flowing to the automobile industry.  If you're white and not rich and want to live in the big city -- perhaps you have impaired eyesight and cannot drive a car -- you're practically an endangered species.  And this clown wants to tax you more ?  After what society did to these people over the past 70 years? permalink award report block reply cognoscere 1 points 5 days ago NOW DEFINE WHITE permalink award report block reply BOHICA2021 1 points 4 days ago here is the hard cold truth,  WE are being captured by 3rd world goat fuckers , drug dealers and rapist groomers and the  leftist cunts and their cucked ignorant idiots are all behind it , they are  empowering it at their own demise...there is a better way to dispose of these worthless fat assed cunts but if you think that  giving ground to a goat fucking mooj cocksuskcer is the way then you need to move (jump off a cliff or high building)   WE are being CAPTURED and you better fucking wake the fuck up... permalink award report block reply SedimentTrap 1 points 5 days ago why? permalink award report block reply realsolidsnakeoil 1 points 5 days ago How to lose your tax base in one easy step. permalink award report block reply GivingThemThe_D 1 points 4 days ago I can't be the only one who thought that said \"The Pence was White\"... Fuck Pence. permalink award report block reply Liberats 1 points 5 days ago Good luck pulling that off you commie fuckwit. permalink award report block reply Wexit-Delecto 1 points 5 days ago Are Whites the highest earning race? permalink award report block reply TrumpAndGodWin 2 points 5 days ago No. permalink parent award report block reply Wexit-Delecto 0 points 4 days ago Guess that means it’s more targeted anti White racism. permalink parent award report block reply brewser724 0 points 5 days ago Good job NYC. Lay in the bed that you made...and get fucked permalink award report block reply dontdrinksoy 0 points 5 days ago THE COLLAPSE BEGINS NOW. See what happens when all the white people leave. It won't be pretty. permalink award report block reply Moose_Antlers -3 points 5 days ago Context needed. A Murdoch clickbait headline is basically tabloid trash at this point. What was said, in full? When was it said? In what context? I had heard this was said prior to the election. Did he say it after winning? These things matter, and the Murdoch clickbait factory lies by omission. permalink award report block reply AmannamedRJ 7 points 5 days ago No they really don't. We all know what Islam believes and we all know what socialists believe. Does a muslim socialist magically stop being a muslim socialist because he won an election? permalink parent award report block reply HeavenlyTrumpets 2 points 5 days ago oh shut up.  there is no context where suggesting you favor taxation based on race is appropriate. permalink parent award report block reply Moose_Antlers 0 points 5 days ago Missing the Point, for $100, Alex. permalink parent award report block reply\nmel_to_the_core 93 points 5 days ago They already do. permalink award report block reply UncleTrumpsBand 31 points 5 days ago Thats the neat trick, now its triple! permalink parent award report block reply OldGamerGuy79 23 points 5 days ago The anglophobia is real. permalink parent award report block reply Granny 11 points 5 days ago Sounds like jizya.... permalink parent award report block reply MCPHX84 5 points 5 days ago Good thing I don’t identify as a white. permalink parent award report block reply view 7 more comments... TheRPatriot 14 points 5 days ago That’s what these communist retards don’t understand. The wealthy already pay an exorbitant amount in taxes permalink parent award report block reply Tophat9000 12 points 5 days ago Lol They know that... They don't care Communists are thieves... A thief doesn't say oh I've already stolen too much from this person I'll quit now permalink parent award report block reply Sig229 6 points 5 days ago If they don't sort out elections fast - which means killing the filibuster - then America will be an Islamic caliphate in less than two decades....and we all know that means the rest of the planet is fucked well before that permalink parent award report block reply ColonelKlink 11 points 5 days ago They make us pay for everything. This shit has to stop. permalink parent award report block reply MuslimsWorshipSatan 4 points 5 days ago It won't until there's a lot of empty brass. permalink parent award report block reply Judenfrei -1 points 5 days ago One man tried to speak up for his people.. https://www.bitchute.com/video/mbvSjcRjJri8 permalink parent award report block reply\nUncleTrumpsBand 31 points 5 days ago Thats the neat trick, now its triple! permalink parent award report block reply OldGamerGuy79 23 points 5 days ago The anglophobia is real. permalink parent award report block reply Granny 11 points 5 days ago Sounds like jizya.... permalink parent award report block reply MCPHX84 5 points 5 days ago Good thing I don’t identify as a white. permalink parent award report block reply view 7 more comments...\nOldGamerGuy79 23 points 5 days ago The anglophobia is real. permalink parent award report block reply Granny 11 points 5 days ago Sounds like jizya.... permalink parent award report block reply MCPHX84 5 points 5 days ago Good thing I don’t identify as a white. permalink parent award report block reply view 7 more comments...\nGranny 11 points 5 days ago Sounds like jizya.... permalink parent award report block reply MCPHX84 5 points 5 days ago Good thing I don’t identify as a white. permalink parent award report block reply view 7 more comments...\nMCPHX84 5 points 5 days ago Good thing I don’t identify as a white. permalink parent award report block reply view 7 more comments...\nTheRPatriot 14 points 5 days ago That’s what these communist retards don’t understand. The wealthy already pay an exorbitant amount in taxes permalink parent award report block reply Tophat9000 12 points 5 days ago Lol They know that... They don't care Communists are thieves... A thief doesn't say oh I've already stolen too much from this person I'll quit now permalink parent award report block reply Sig229 6 points 5 days ago If they don't sort out elections fast - which means killing the filibuster - then America will be an Islamic caliphate in less than two decades....and we all know that means the rest of the planet is fucked well before that permalink parent award report block reply\nTophat9000 12 points 5 days ago Lol They know that... They don't care Communists are thieves... A thief doesn't say oh I've already stolen too much from this person I'll quit now permalink parent award report block reply Sig229 6 points 5 days ago If they don't sort out elections fast - which means killing the filibuster - then America will be an Islamic caliphate in less than two decades....and we all know that means the rest of the planet is fucked well before that permalink parent award report block reply\nSig229 6 points 5 days ago If they don't sort out elections fast - which means killing the filibuster - then America will be an Islamic caliphate in less than two decades....and we all know that means the rest of the planet is fucked well before that permalink parent award report block reply\nColonelKlink 11 points 5 days ago They make us pay for everything. This shit has to stop. permalink parent award report block reply MuslimsWorshipSatan 4 points 5 days ago It won't until there's a lot of empty brass. permalink parent award report block reply Judenfrei -1 points 5 days ago One man tried to speak up for his people.. https://www.bitchute.com/video/mbvSjcRjJri8 permalink parent award report block reply\nMuslimsWorshipSatan 4 points 5 days ago It won't until there's a lot of empty brass. permalink parent award report block reply\nJudenfrei -1 points 5 days ago One man tried to speak up for his people.. https://www.bitchute.com/video/mbvSjcRjJri8 permalink parent award report block reply\nBillionaired 70 points 5 days ago He wants all the white people to leave so he can bring in more Muslims.  Just another tactic like London and Paris. permalink award report block reply Filo76 27 points 5 days ago Exactly. It’s a win/win for him. Whites stay, they pay the high tax. They leave, put Muslims in their place. permalink parent award report block reply tallon 19 points 5 days ago Jizya tax permalink parent award report block reply Lelleck 5 points 5 days ago This is what people don‘t understand. Immediate implementation of a tax for non muslims. permalink parent award report block reply EdBuck 8 points 5 days ago Yeah but that city will grind to a halt these Muslims don't work permalink parent award report block reply Lelleck 2 points 5 days ago Trump announced to stop all payments. He does not… If the payments don‘t stop. They will keep on leeching. permalink parent award report block reply LookFatty 3 points 5 days ago The not so long plan permalink parent award report block reply NomadicKrow2 3 points 5 days ago Also, they leave, and vote blue in other states. permalink parent award report block reply OGpsywar 11 points 5 days ago The goal isn't to even try to succeed, it's to continue pulling down the US's cities by making its producers and creators leave them. ☪️🌏👃🤝 permalink parent award report block reply Klaus73 7 points 5 days ago Curious...doesn't this cross some sort of discrimination law? permalink parent award report block reply Billionaired 7 points 5 days ago Discrimination, you say?  WTF is that?  Only applies to non-whites. permalink parent award report block reply Klaus73 4 points 5 days ago I was pretty sure there looooong ago was this wild notion of all men being equal under god or some such... permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Content of character you say? permalink parent award report block reply lixa 2 points 5 days ago Yes, it'd be a lawsuit and easy win. permalink parent award report block reply Klaus73 2 points 5 days ago Yeah thats kind of what I figure - it would be nice if folks didn't need to have to constantly launch lawsuits against the government not to buttfuck them.. permalink parent award report block reply lixa 1 points 4 days ago Indeed. Passing a blatantly unconstitutional law should result in removal from office. permalink parent award report block reply deleted 5 points 5 days ago MaoHadOnly1Testicle 2 points 5 days ago If anyone wants an estimate of what the damage would look like, here's a NUKEMAP link permalink parent award report block reply LeRiverDanube 1 points 5 days ago theres a problem with that chief. white people are there gibbits, they leave in a considerable number and the socialism grift dies with them. on the other hand nyc is a crumbling shithole permalink parent award report block reply load 1 more comments...\nFilo76 27 points 5 days ago Exactly. It’s a win/win for him. Whites stay, they pay the high tax. They leave, put Muslims in their place. permalink parent award report block reply tallon 19 points 5 days ago Jizya tax permalink parent award report block reply Lelleck 5 points 5 days ago This is what people don‘t understand. Immediate implementation of a tax for non muslims. permalink parent award report block reply EdBuck 8 points 5 days ago Yeah but that city will grind to a halt these Muslims don't work permalink parent award report block reply Lelleck 2 points 5 days ago Trump announced to stop all payments. He does not… If the payments don‘t stop. They will keep on leeching. permalink parent award report block reply LookFatty 3 points 5 days ago The not so long plan permalink parent award report block reply NomadicKrow2 3 points 5 days ago Also, they leave, and vote blue in other states. permalink parent award report block reply\ntallon 19 points 5 days ago Jizya tax permalink parent award report block reply Lelleck 5 points 5 days ago This is what people don‘t understand. Immediate implementation of a tax for non muslims. permalink parent award report block reply\nLelleck 5 points 5 days ago This is what people don‘t understand. Immediate implementation of a tax for non muslims. permalink parent award report block reply\nEdBuck 8 points 5 days ago Yeah but that city will grind to a halt these Muslims don't work permalink parent award report block reply Lelleck 2 points 5 days ago Trump announced to stop all payments. He does not… If the payments don‘t stop. They will keep on leeching. permalink parent award report block reply\nLelleck 2 points 5 days ago Trump announced to stop all payments. He does not… If the payments don‘t stop. They will keep on leeching. permalink parent award report block reply\nLookFatty 3 points 5 days ago The not so long plan permalink parent award report block reply\nNomadicKrow2 3 points 5 days ago Also, they leave, and vote blue in other states. permalink parent award report block reply\nOGpsywar 11 points 5 days ago The goal isn't to even try to succeed, it's to continue pulling down the US's cities by making its producers and creators leave them. ☪️🌏👃🤝 permalink parent award report block reply\nKlaus73 7 points 5 days ago Curious...doesn't this cross some sort of discrimination law? permalink parent award report block reply Billionaired 7 points 5 days ago Discrimination, you say?  WTF is that?  Only applies to non-whites. permalink parent award report block reply Klaus73 4 points 5 days ago I was pretty sure there looooong ago was this wild notion of all men being equal under god or some such... permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Content of character you say? permalink parent award report block reply lixa 2 points 5 days ago Yes, it'd be a lawsuit and easy win. permalink parent award report block reply Klaus73 2 points 5 days ago Yeah thats kind of what I figure - it would be nice if folks didn't need to have to constantly launch lawsuits against the government not to buttfuck them.. permalink parent award report block reply lixa 1 points 4 days ago Indeed. Passing a blatantly unconstitutional law should result in removal from office. permalink parent award report block reply\nBillionaired 7 points 5 days ago Discrimination, you say?  WTF is that?  Only applies to non-whites. permalink parent award report block reply Klaus73 4 points 5 days ago I was pretty sure there looooong ago was this wild notion of all men being equal under god or some such... permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Content of character you say? permalink parent award report block reply\nKlaus73 4 points 5 days ago I was pretty sure there looooong ago was this wild notion of all men being equal under god or some such... permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Content of character you say? permalink parent award report block reply\nSicSemperTyrannis2 1 points 4 days ago Content of character you say? permalink parent award report block reply\nlixa 2 points 5 days ago Yes, it'd be a lawsuit and easy win. permalink parent award report block reply Klaus73 2 points 5 days ago Yeah thats kind of what I figure - it would be nice if folks didn't need to have to constantly launch lawsuits against the government not to buttfuck them.. permalink parent award report block reply lixa 1 points 4 days ago Indeed. Passing a blatantly unconstitutional law should result in removal from office. permalink parent award report block reply\nKlaus73 2 points 5 days ago Yeah thats kind of what I figure - it would be nice if folks didn't need to have to constantly launch lawsuits against the government not to buttfuck them.. permalink parent award report block reply lixa 1 points 4 days ago Indeed. Passing a blatantly unconstitutional law should result in removal from office. permalink parent award report block reply\nlixa 1 points 4 days ago Indeed. Passing a blatantly unconstitutional law should result in removal from office. permalink parent award report block reply\ndeleted 5 points 5 days ago MaoHadOnly1Testicle 2 points 5 days ago If anyone wants an estimate of what the damage would look like, here's a NUKEMAP link permalink parent award report block reply\nMaoHadOnly1Testicle 2 points 5 days ago If anyone wants an estimate of what the damage would look like, here's a NUKEMAP link permalink parent award report block reply\nLeRiverDanube 1 points 5 days ago theres a problem with that chief. white people are there gibbits, they leave in a considerable number and the socialism grift dies with them. on the other hand nyc is a crumbling shithole permalink parent award report block reply\nManOfThePeople 26 points 5 days ago Do white neighborhoods even exist in NYC anymore? permalink award report block reply Filo76 13 points 5 days ago Staten Island. permalink parent award report block reply deleted 19 points 5 days ago BloodElfSupporter 5 points 5 days ago That’s actually a pretty good analogy lol permalink parent award report block reply _fidelio 1 points 5 days ago The Cuomintang administration has fled to Staten Island permalink parent award report block reply ManOfThePeople 5 points 5 days ago Damn. I can't believe I forgot about Staten Island. They voted for Trump. permalink parent award report block reply CandyBarr 2 points 5 days ago I just learned that Sicily is actually African geographicly. Just putting that out there. Hahahaha permalink parent award report block reply analog_shitposter 2 points 5 days ago Where’d you learn that? They may not think of themselves as Italian, and their gene pool includes genes from just about everywhere that can access Sicily by sea, but that island is not African permalink parent award report block reply CandyBarr 4 points 5 days ago It's on the same plate as Africa. Platetechtonichally (sp I'm sure) Sicily is Africa jamming it's island into the boot of Europe. permalink parent award report block reply view 2 more comments... djpat 2 points 5 days ago Congress needs to just declare that part of Jersey permalink parent award report block reply\nFilo76 13 points 5 days ago Staten Island. permalink parent award report block reply deleted 19 points 5 days ago BloodElfSupporter 5 points 5 days ago That’s actually a pretty good analogy lol permalink parent award report block reply _fidelio 1 points 5 days ago The Cuomintang administration has fled to Staten Island permalink parent award report block reply ManOfThePeople 5 points 5 days ago Damn. I can't believe I forgot about Staten Island. They voted for Trump. permalink parent award report block reply CandyBarr 2 points 5 days ago I just learned that Sicily is actually African geographicly. Just putting that out there. Hahahaha permalink parent award report block reply analog_shitposter 2 points 5 days ago Where’d you learn that? They may not think of themselves as Italian, and their gene pool includes genes from just about everywhere that can access Sicily by sea, but that island is not African permalink parent award report block reply CandyBarr 4 points 5 days ago It's on the same plate as Africa. Platetechtonichally (sp I'm sure) Sicily is Africa jamming it's island into the boot of Europe. permalink parent award report block reply view 2 more comments... djpat 2 points 5 days ago Congress needs to just declare that part of Jersey permalink parent award report block reply\ndeleted 19 points 5 days ago BloodElfSupporter 5 points 5 days ago That’s actually a pretty good analogy lol permalink parent award report block reply _fidelio 1 points 5 days ago The Cuomintang administration has fled to Staten Island permalink parent award report block reply\nBloodElfSupporter 5 points 5 days ago That’s actually a pretty good analogy lol permalink parent award report block reply _fidelio 1 points 5 days ago The Cuomintang administration has fled to Staten Island permalink parent award report block reply\n_fidelio 1 points 5 days ago The Cuomintang administration has fled to Staten Island permalink parent award report block reply\nManOfThePeople 5 points 5 days ago Damn. I can't believe I forgot about Staten Island. They voted for Trump. permalink parent award report block reply\nCandyBarr 2 points 5 days ago I just learned that Sicily is actually African geographicly. Just putting that out there. Hahahaha permalink parent award report block reply analog_shitposter 2 points 5 days ago Where’d you learn that? They may not think of themselves as Italian, and their gene pool includes genes from just about everywhere that can access Sicily by sea, but that island is not African permalink parent award report block reply CandyBarr 4 points 5 days ago It's on the same plate as Africa. Platetechtonichally (sp I'm sure) Sicily is Africa jamming it's island into the boot of Europe. permalink parent award report block reply view 2 more comments...\nanalog_shitposter 2 points 5 days ago Where’d you learn that? They may not think of themselves as Italian, and their gene pool includes genes from just about everywhere that can access Sicily by sea, but that island is not African permalink parent award report block reply CandyBarr 4 points 5 days ago It's on the same plate as Africa. Platetechtonichally (sp I'm sure) Sicily is Africa jamming it's island into the boot of Europe. permalink parent award report block reply view 2 more comments...\nCandyBarr 4 points 5 days ago It's on the same plate as Africa. Platetechtonichally (sp I'm sure) Sicily is Africa jamming it's island into the boot of Europe. permalink parent award report block reply view 2 more comments...\ndjpat 2 points 5 days ago Congress needs to just declare that part of Jersey permalink parent award report block reply\ncanada_is_communist 11 points 5 days ago So racism, got it. permalink award report block reply\nMadRussian 11 points 5 days ago Women who elected him wanted to be raped by mudslimes, so mission accomplished I should say. permalink award report block reply carpetxparmesan 4 points 5 days ago TFW you expect to open your cuntflaps and you have to actually open your leather wallet...no, no old lady, not THAT leather wallet! permalink parent award report block reply\ncarpetxparmesan 4 points 5 days ago TFW you expect to open your cuntflaps and you have to actually open your leather wallet...no, no old lady, not THAT leather wallet! permalink parent award report block reply\nSavingPrivateGrace 10 points 5 days ago Sharia law or did he think of that himself? permalink award report block reply Filo76 13 points 5 days ago Jizya tax. permalink parent award report block reply UncleTrumpsBand 2 points 5 days ago Shakira Law permalink parent award report block reply\nFilo76 13 points 5 days ago Jizya tax. permalink parent award report block reply UncleTrumpsBand 2 points 5 days ago Shakira Law permalink parent award report block reply\nUncleTrumpsBand 2 points 5 days ago Shakira Law permalink parent award report block reply\nTonyTheSlop 9 points 5 days ago They voted for it right? permalink award report block reply carpetxparmesan 8 points 5 days ago Young white women did, allegedly. These bitches are dumber than a bag full of kittens floating in a river. Someone REALLY needs to be studying how to take these cunts over because they're too stupid to ignore as a customer base. It does not get dumber or more self-destructive than this. permalink parent award report block reply CandyBarr 6 points 5 days ago White girls have pink nipples and normal sized noses. Most of the twitter woman I saw pimping Zohran did not fall into both categories. permalink parent award report block reply usernamechecksout 2 points 5 days ago So, look at the data. Your anecdote is crap. permalink parent award report block reply CandyBarr 2 points 5 days ago You can link a tweet. I'm sure theirs enough Pedes to be judges here and I obviously volunteer. For the science of it all obviously. permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago Data is crap. jews aren't White. arabs aren't White. persians aren't White. hispanics aren't White. You'll never find data compiled to reflect this reality. permalink parent award report block reply carpetxparmesan 2 points 4 days ago You might be onto something with who influences them. But the responsibility, as always, falls on the gay and fake retard who votes and does the deed. But if you ask me is the left capable of gaslighting and juking the stats so badly that NYC is now populated mostly by non-white \"whites\"? I'd find that plausible too. After all, white girls are more likely to get a college ride, but \"white\" girls are WAY more likely to get a college ride. That's just how the discrimination has been stacked for many decades. As far as internet influencers go, after the \"7k club\", and elon's 50% bots problem that he still hasn't fixed too much and the tencent army and its pajeet equivalent, things might be very fake and very gay indeed on the internet. The stats are what they are. Anyone dating in NYC knows the dating pool is what it is there, I'm not going to make any spicy anecdotal claims, but iykyk. So I'm not going to sit here and argue with you that the white women in the stats are very caucasian because yeah, might not be the case. I'm not someone who particularly cares about that detail, but yeah, it's a good point you raise. And if there are people who don't know these things already, they should be exposed to this information. permalink parent award report block reply\ncarpetxparmesan 8 points 5 days ago Young white women did, allegedly. These bitches are dumber than a bag full of kittens floating in a river. Someone REALLY needs to be studying how to take these cunts over because they're too stupid to ignore as a customer base. It does not get dumber or more self-destructive than this. permalink parent award report block reply CandyBarr 6 points 5 days ago White girls have pink nipples and normal sized noses. Most of the twitter woman I saw pimping Zohran did not fall into both categories. permalink parent award report block reply usernamechecksout 2 points 5 days ago So, look at the data. Your anecdote is crap. permalink parent award report block reply CandyBarr 2 points 5 days ago You can link a tweet. I'm sure theirs enough Pedes to be judges here and I obviously volunteer. For the science of it all obviously. permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago Data is crap. jews aren't White. arabs aren't White. persians aren't White. hispanics aren't White. You'll never find data compiled to reflect this reality. permalink parent award report block reply carpetxparmesan 2 points 4 days ago You might be onto something with who influences them. But the responsibility, as always, falls on the gay and fake retard who votes and does the deed. But if you ask me is the left capable of gaslighting and juking the stats so badly that NYC is now populated mostly by non-white \"whites\"? I'd find that plausible too. After all, white girls are more likely to get a college ride, but \"white\" girls are WAY more likely to get a college ride. That's just how the discrimination has been stacked for many decades. As far as internet influencers go, after the \"7k club\", and elon's 50% bots problem that he still hasn't fixed too much and the tencent army and its pajeet equivalent, things might be very fake and very gay indeed on the internet. The stats are what they are. Anyone dating in NYC knows the dating pool is what it is there, I'm not going to make any spicy anecdotal claims, but iykyk. So I'm not going to sit here and argue with you that the white women in the stats are very caucasian because yeah, might not be the case. I'm not someone who particularly cares about that detail, but yeah, it's a good point you raise. And if there are people who don't know these things already, they should be exposed to this information. permalink parent award report block reply\nCandyBarr 6 points 5 days ago White girls have pink nipples and normal sized noses. Most of the twitter woman I saw pimping Zohran did not fall into both categories. permalink parent award report block reply usernamechecksout 2 points 5 days ago So, look at the data. Your anecdote is crap. permalink parent award report block reply CandyBarr 2 points 5 days ago You can link a tweet. I'm sure theirs enough Pedes to be judges here and I obviously volunteer. For the science of it all obviously. permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago Data is crap. jews aren't White. arabs aren't White. persians aren't White. hispanics aren't White. You'll never find data compiled to reflect this reality. permalink parent award report block reply carpetxparmesan 2 points 4 days ago You might be onto something with who influences them. But the responsibility, as always, falls on the gay and fake retard who votes and does the deed. But if you ask me is the left capable of gaslighting and juking the stats so badly that NYC is now populated mostly by non-white \"whites\"? I'd find that plausible too. After all, white girls are more likely to get a college ride, but \"white\" girls are WAY more likely to get a college ride. That's just how the discrimination has been stacked for many decades. As far as internet influencers go, after the \"7k club\", and elon's 50% bots problem that he still hasn't fixed too much and the tencent army and its pajeet equivalent, things might be very fake and very gay indeed on the internet. The stats are what they are. Anyone dating in NYC knows the dating pool is what it is there, I'm not going to make any spicy anecdotal claims, but iykyk. So I'm not going to sit here and argue with you that the white women in the stats are very caucasian because yeah, might not be the case. I'm not someone who particularly cares about that detail, but yeah, it's a good point you raise. And if there are people who don't know these things already, they should be exposed to this information. permalink parent award report block reply\nusernamechecksout 2 points 5 days ago So, look at the data. Your anecdote is crap. permalink parent award report block reply CandyBarr 2 points 5 days ago You can link a tweet. I'm sure theirs enough Pedes to be judges here and I obviously volunteer. For the science of it all obviously. permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago Data is crap. jews aren't White. arabs aren't White. persians aren't White. hispanics aren't White. You'll never find data compiled to reflect this reality. permalink parent award report block reply\nCandyBarr 2 points 5 days ago You can link a tweet. I'm sure theirs enough Pedes to be judges here and I obviously volunteer. For the science of it all obviously. permalink parent award report block reply\nSicSemperTyrannis2 0 points 4 days ago Data is crap. jews aren't White. arabs aren't White. persians aren't White. hispanics aren't White. You'll never find data compiled to reflect this reality. permalink parent award report block reply\ncarpetxparmesan 2 points 4 days ago You might be onto something with who influences them. But the responsibility, as always, falls on the gay and fake retard who votes and does the deed. But if you ask me is the left capable of gaslighting and juking the stats so badly that NYC is now populated mostly by non-white \"whites\"? I'd find that plausible too. After all, white girls are more likely to get a college ride, but \"white\" girls are WAY more likely to get a college ride. That's just how the discrimination has been stacked for many decades. As far as internet influencers go, after the \"7k club\", and elon's 50% bots problem that he still hasn't fixed too much and the tencent army and its pajeet equivalent, things might be very fake and very gay indeed on the internet. The stats are what they are. Anyone dating in NYC knows the dating pool is what it is there, I'm not going to make any spicy anecdotal claims, but iykyk. So I'm not going to sit here and argue with you that the white women in the stats are very caucasian because yeah, might not be the case. I'm not someone who particularly cares about that detail, but yeah, it's a good point you raise. And if there are people who don't know these things already, they should be exposed to this information. permalink parent award report block reply\nWinter_Is_Coming2020 6 points 5 days ago From June. permalink award report block reply\nJustlooking250 6 points 5 days ago Not even 24 hours after 'his victory' that absolute LOSER was asking for donations to pay for more promised 'fReE gIbSz' and guess what ? Some of those liberal cunts will voluntarily hand that Marxist piece of shit even more money besides all the taxes they pay to NYC permalink award report block reply\nUncleTrumpsBand 6 points 5 days ago What constitutes as “white”? permalink award report block reply Ch3f4554551n 12 points 5 days ago To Marxists, \"White Rich People\" are anyone who has a penny more than they do. permalink parent award report block reply CandyBarr 3 points 5 days ago R1B permalink parent award report block reply Roadpower 2 points 5 days ago If you have stuff to take and don't present as anything darker than white. permalink parent award report block reply UncleTrumpsBand 2 points 5 days ago I identify as Cream Peach. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago European ancestry. Not south or east of the Mediterranean. permalink parent award report block reply thisisatestof2 1 points 5 days ago I mean, it is 2025 in New York City, so therefore, didn’t you dis identify something else? permalink parent award report block reply\nCh3f4554551n 12 points 5 days ago To Marxists, \"White Rich People\" are anyone who has a penny more than they do. permalink parent award report block reply\nCandyBarr 3 points 5 days ago R1B permalink parent award report block reply\nRoadpower 2 points 5 days ago If you have stuff to take and don't present as anything darker than white. permalink parent award report block reply UncleTrumpsBand 2 points 5 days ago I identify as Cream Peach. permalink parent award report block reply\nUncleTrumpsBand 2 points 5 days ago I identify as Cream Peach. permalink parent award report block reply\nSicSemperTyrannis2 1 points 4 days ago European ancestry. Not south or east of the Mediterranean. permalink parent award report block reply\nthisisatestof2 1 points 5 days ago I mean, it is 2025 in New York City, so therefore, didn’t you dis identify something else? permalink parent award report block reply\nfightfightfightx 5 points 5 days ago after the jewish supremacists import enough 3rd worlders to America, this is their goal for ALL of America law be damned, they already ignore the civil rights law with discrimination against whites in school and jobs. Its how they seized power. Through racism. Its a lot easier to get hired over a white when you can illegally discriminate against one. permalink award report block reply TrumpAndGodWin 3 points 5 days ago Kalergi and UN plan for replacement 'migration.' permalink parent award report block reply\nTrumpAndGodWin 3 points 5 days ago Kalergi and UN plan for replacement 'migration.' permalink parent award report block reply\nDingleBalls 5 points 5 days ago Literally discrimination permalink award report block reply\ntlorsung 4 points 5 days ago Ok, NYC citizens fascination of Mamdani just didn't happen over night.  It was due to past Mayors and their poor decisions that favored wealthy over poor,  they help the poor but making them dependent on GOV and it grew and Past politicians did NOTHING.   ALL blue cities have these issues, yet democrats continue voting for these bad politicians. permalink award report block reply\nm0ntsta 4 points 5 days ago White people need to start purging these societal hemorrhoids. permalink award report block reply\ngivethismanacoat 4 points 5 days ago SC would throw it out. permalink award report block reply MakinBacon 3 points 5 days ago have to get there first. permalink parent award report block reply\nMakinBacon 3 points 5 days ago have to get there first. permalink parent award report block reply\ngrassshrimp 4 points 5 days ago White people didn't vote for this. White voters make up about 32% of NYC's population and a similar share of the electorate. Post-election breakdowns indicate Mamdani received 38% of the white vote, per detailed precinct and exit poll analyses. permalink award report block reply\nRock9Head 3 points 5 days ago Karens will get mean. permalink award report block reply SicSemperTyrannis2 2 points 4 days ago Oh no. Anyway ... permalink parent award report block reply\nSicSemperTyrannis2 2 points 4 days ago Oh no. Anyway ... permalink parent award report block reply\nHoganP 3 points 5 days ago Lived in NYC for a decade.  I'm not aware that there are white neighborhoods. permalink award report block reply\nAbovethefray 3 points 5 days ago The White neighborhoods have one eighth the amount of cops.  Why is that I wonder? permalink award report block reply\nMoose_Antlers 2 points 5 days ago All that has to happen is a simple constitutional challenge. Any such law would be struck down. This is rhetoric to appease his racist af base. permalink award report block reply\nbehemoth887 2 points 5 days ago conquer canada jeets are flown in by the millions into the totally conquered canada and turned into citizens on arrival run all humans out of lib york shitty lib york shitty is now a lib fortress and an immigration hub to bring jeets in directly from the totally conquered canada we get overran by jeets pretty much instantly permalink award report block reply\nMakinBacon 2 points 5 days ago if he admits he's a goat fucker on live tv...... permalink award report block reply\nLance_Romance 2 points 5 days ago buckle up new york permalink award report block reply\nterribletwos 2 points 5 days ago Easiest case to win ever. Class action lawsuit that shit. permalink award report block reply\nEdBuck 2 points 5 days ago Fan Fucking Tastic. It's going to be a white person desert. Then they will have nobody to rob, murder, and tax. Then they'll eat each other It's going to be like Uganda lololol permalink award report block reply FreedomFromGovt 2 points 5 days ago Worse, it'll be like...Detroit... permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Still not a win. That just means the Muslim takeover proceeds faster. permalink parent award report block reply\nFreedomFromGovt 2 points 5 days ago Worse, it'll be like...Detroit... permalink parent award report block reply\nSicSemperTyrannis2 1 points 4 days ago Still not a win. That just means the Muslim takeover proceeds faster. permalink parent award report block reply\nKeep_on_winning_kag 2 points 5 days ago That's racist. permalink award report block reply\nRexCollumSilvarum 1 points 5 days ago You know why there are so few white neighborhoods in big cities, and particularly working-class white neighborhoods?  Because the powers that be pushed them all out to car-dependent suburbs to get that money flowing to the automobile industry.  If you're white and not rich and want to live in the big city -- perhaps you have impaired eyesight and cannot drive a car -- you're practically an endangered species.  And this clown wants to tax you more ?  After what society did to these people over the past 70 years? permalink award report block reply\ncognoscere 1 points 5 days ago NOW DEFINE WHITE permalink award report block reply\nBOHICA2021 1 points 4 days ago here is the hard cold truth,  WE are being captured by 3rd world goat fuckers , drug dealers and rapist groomers and the  leftist cunts and their cucked ignorant idiots are all behind it , they are  empowering it at their own demise...there is a better way to dispose of these worthless fat assed cunts but if you think that  giving ground to a goat fucking mooj cocksuskcer is the way then you need to move (jump off a cliff or high building)   WE are being CAPTURED and you better fucking wake the fuck up... permalink award report block reply\nSedimentTrap 1 points 5 days ago why? permalink award report block reply\nrealsolidsnakeoil 1 points 5 days ago How to lose your tax base in one easy step. permalink award report block reply\nGivingThemThe_D 1 points 4 days ago I can't be the only one who thought that said \"The Pence was White\"... Fuck Pence. permalink award report block reply\nLiberats 1 points 5 days ago Good luck pulling that off you commie fuckwit. permalink award report block reply\nWexit-Delecto 1 points 5 days ago Are Whites the highest earning race? permalink award report block reply TrumpAndGodWin 2 points 5 days ago No. permalink parent award report block reply Wexit-Delecto 0 points 4 days ago Guess that means it’s more targeted anti White racism. permalink parent award report block reply\nTrumpAndGodWin 2 points 5 days ago No. permalink parent award report block reply Wexit-Delecto 0 points 4 days ago Guess that means it’s more targeted anti White racism. permalink parent award report block reply\nWexit-Delecto 0 points 4 days ago Guess that means it’s more targeted anti White racism. permalink parent award report block reply\nbrewser724 0 points 5 days ago Good job NYC. Lay in the bed that you made...and get fucked permalink award report block reply\ndontdrinksoy 0 points 5 days ago THE COLLAPSE BEGINS NOW. See what happens when all the white people leave. It won't be pretty. permalink award report block reply\nMoose_Antlers -3 points 5 days ago Context needed. A Murdoch clickbait headline is basically tabloid trash at this point. What was said, in full? When was it said? In what context? I had heard this was said prior to the election. Did he say it after winning? These things matter, and the Murdoch clickbait factory lies by omission. permalink award report block reply AmannamedRJ 7 points 5 days ago No they really don't. We all know what Islam believes and we all know what socialists believe. Does a muslim socialist magically stop being a muslim socialist because he won an election? permalink parent award report block reply HeavenlyTrumpets 2 points 5 days ago oh shut up.  there is no context where suggesting you favor taxation based on race is appropriate. permalink parent award report block reply Moose_Antlers 0 points 5 days ago Missing the Point, for $100, Alex. permalink parent award report block reply\nAmannamedRJ 7 points 5 days ago No they really don't. We all know what Islam believes and we all know what socialists believe. Does a muslim socialist magically stop being a muslim socialist because he won an election? permalink parent award report block reply\nHeavenlyTrumpets 2 points 5 days ago oh shut up.  there is no context where suggesting you favor taxation based on race is appropriate. permalink parent award report block reply Moose_Antlers 0 points 5 days ago Missing the Point, for $100, Alex. permalink parent award report block reply\nMoose_Antlers 0 points 5 days ago Missing the Point, for $100, Alex. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:57:46.654159Z"
}