{
  "id": "1ARK9k0iYB",
  "url": "https://patriots.win/p/1ARK9k0iYB/what-is-a-trans-woman/c",
  "content": "272 What is a trans woman? posted 1 day ago by rdvs34283 4 comments award share download report block\n4 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style NotYourMan 3 points 1 day ago A transgender woman is a man pretending to be a woman.  In many ways men make this choice because the public school system tells them they are bad because they are men, because they have masculine behaviors built into them.  They are told they have toxic masculinity.  Being piratical, they switch to pretended to be a woman.  The problem is women teaching boys in the school system. permalink award report block reply imnotdeadyet 2 points 1 day ago Fagtards! permalink award report block reply Scot 1 points 1 day ago A \"trans woman\" is a woman pretending to be a man. The demons call a man pretending to be a woman a \"trans woman\" in an attempt to redefine our language. But, a man pretending to be a woman is a trans MAN. permalink award report block reply booblitchutz 1 points 1 day ago Retarded fags all the way down. permalink parent award report block reply\nNotYourMan 3 points 1 day ago A transgender woman is a man pretending to be a woman.  In many ways men make this choice because the public school system tells them they are bad because they are men, because they have masculine behaviors built into them.  They are told they have toxic masculinity.  Being piratical, they switch to pretended to be a woman.  The problem is women teaching boys in the school system. permalink award report block reply\nimnotdeadyet 2 points 1 day ago Fagtards! permalink award report block reply\nScot 1 points 1 day ago A \"trans woman\" is a woman pretending to be a man. The demons call a man pretending to be a woman a \"trans woman\" in an attempt to redefine our language. But, a man pretending to be a woman is a trans MAN. permalink award report block reply booblitchutz 1 points 1 day ago Retarded fags all the way down. permalink parent award report block reply\nbooblitchutz 1 points 1 day ago Retarded fags all the way down. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:04:44.203960Z"
}