{
  "id": "1ARK9k0zrj",
  "url": "https://patriots.win/p/1ARK9k0zrj/trump-about-to-speak-right-meow-/c",
  "content": "530 Trump about to speak right meow at the Veteran's Day ceremony (rumble.com) AMERICA        FIRST posted 1 day ago by HellNoKameltoe 27 comments award share report block\n27 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno here2red 18 points 1 day ago speak meow? LOL permalink award report block reply BeauHD 8 points 1 day ago Meow, where were we? permalink parent award report block reply HellNoKameltoe OP 7 points 1 day ago \"yes, you are freaking out, man! \" permalink parent award report block reply Deportthemall23 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply gorilla_grip 5 points 1 day ago 😹😹😹 permalink parent award report block reply America_No_1 2 points 1 day ago Reddit speak permalink parent award report block reply Appeal2Heaven98 -2 points 1 day ago I thought I was on Reddit for a second. permalink parent award report block reply South_Florida_Guy 9 points 1 day ago That's CATegorically awesome permalink award report block reply BeauHD 2 points 1 day ago Lol...LoL...LOL!!! permalink parent award report block reply SavingPrivateGrace 5 points 1 day ago Victory Day! 🇺🇸 permalink award report block reply MastaJoda 0 points 1 day ago Is Trump going to praise jihadi terrorists today as well? Maybe have his jihadi terrorist on stage with him as he praises him? Fuck Zion Don. Fuck his dumb ass combover as well. Retarded looking POS permalink parent award report block reply SavingPrivateGrace 1 points 24 hours ago He's not as to the far right as you.  I don't know why they call him a fascist, king, Nazi.  You're angry with him, I get it.  Try to think of some nice things about him you like, or that you learned from him so you don't carry that anger inappropriately on to others. permalink parent award report block reply Crappydatum 4 points 1 day ago With cat sounds? permalink award report block reply rebuildingMyself 2 points 1 day ago You stop that shitposting right meow! permalink parent award report block reply fluffykitten 3 points 1 day ago meow permalink award report block reply knittinkittens 2 points 1 day ago Meow! permalink parent award report block reply SmokeyAF 1 points 1 day ago PDJT always uses the \"Congressional MoH..\" term, sorry, annoys me.  Congress no longer deserves any leftover association to the MoH. permalink award report block reply Emodius 1 points 1 day ago Meow lol. Good movie permalink award report block reply Ritchie_Blackadder 1 points 1 day ago Not so funny meow, is it? permalink award report block reply DrVSGGEOTUSPhD 1 points 1 day ago what did everybody yell at trump??? permalink award report block reply covefefe_energy 1 points 1 day ago Purfect permalink award report block reply Sunnybats2 1 points 1 day ago To JD'd cat ladies? huh permalink award report block reply Klown_Kutz 1 points 1 day ago Did you just say…meow? permalink award report block reply SoulSnipper 1 points 1 day ago Since the CCP invested they're contractually obliged to say Mao at least three times an hour. Papa Ooo Mao Mao Everybody's heard about the word, Bird bird bird, the bird is the word. Right Mao. That's it for another hour. permalink award report block reply Tao_Pai 1 points 21 hours ago Meow! Melonia looks purrr-fect. permalink award report block reply Spawnlingman 1 points 1 day ago Comment removed by community moderators. permalink award report block reply BeauHD 1 points 1 day ago What about the rent? permalink parent award report block reply\nhere2red 18 points 1 day ago speak meow? LOL permalink award report block reply BeauHD 8 points 1 day ago Meow, where were we? permalink parent award report block reply HellNoKameltoe OP 7 points 1 day ago \"yes, you are freaking out, man! \" permalink parent award report block reply Deportthemall23 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply gorilla_grip 5 points 1 day ago 😹😹😹 permalink parent award report block reply America_No_1 2 points 1 day ago Reddit speak permalink parent award report block reply Appeal2Heaven98 -2 points 1 day ago I thought I was on Reddit for a second. permalink parent award report block reply\nBeauHD 8 points 1 day ago Meow, where were we? permalink parent award report block reply\nHellNoKameltoe OP 7 points 1 day ago \"yes, you are freaking out, man! \" permalink parent award report block reply Deportthemall23 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nDeportthemall23 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\ngorilla_grip 5 points 1 day ago 😹😹😹 permalink parent award report block reply\nAmerica_No_1 2 points 1 day ago Reddit speak permalink parent award report block reply\nAppeal2Heaven98 -2 points 1 day ago I thought I was on Reddit for a second. permalink parent award report block reply\nSouth_Florida_Guy 9 points 1 day ago That's CATegorically awesome permalink award report block reply BeauHD 2 points 1 day ago Lol...LoL...LOL!!! permalink parent award report block reply\nBeauHD 2 points 1 day ago Lol...LoL...LOL!!! permalink parent award report block reply\nSavingPrivateGrace 5 points 1 day ago Victory Day! 🇺🇸 permalink award report block reply MastaJoda 0 points 1 day ago Is Trump going to praise jihadi terrorists today as well? Maybe have his jihadi terrorist on stage with him as he praises him? Fuck Zion Don. Fuck his dumb ass combover as well. Retarded looking POS permalink parent award report block reply SavingPrivateGrace 1 points 24 hours ago He's not as to the far right as you.  I don't know why they call him a fascist, king, Nazi.  You're angry with him, I get it.  Try to think of some nice things about him you like, or that you learned from him so you don't carry that anger inappropriately on to others. permalink parent award report block reply\nMastaJoda 0 points 1 day ago Is Trump going to praise jihadi terrorists today as well? Maybe have his jihadi terrorist on stage with him as he praises him? Fuck Zion Don. Fuck his dumb ass combover as well. Retarded looking POS permalink parent award report block reply SavingPrivateGrace 1 points 24 hours ago He's not as to the far right as you.  I don't know why they call him a fascist, king, Nazi.  You're angry with him, I get it.  Try to think of some nice things about him you like, or that you learned from him so you don't carry that anger inappropriately on to others. permalink parent award report block reply\nSavingPrivateGrace 1 points 24 hours ago He's not as to the far right as you.  I don't know why they call him a fascist, king, Nazi.  You're angry with him, I get it.  Try to think of some nice things about him you like, or that you learned from him so you don't carry that anger inappropriately on to others. permalink parent award report block reply\nCrappydatum 4 points 1 day ago With cat sounds? permalink award report block reply rebuildingMyself 2 points 1 day ago You stop that shitposting right meow! permalink parent award report block reply\nrebuildingMyself 2 points 1 day ago You stop that shitposting right meow! permalink parent award report block reply\nfluffykitten 3 points 1 day ago meow permalink award report block reply knittinkittens 2 points 1 day ago Meow! permalink parent award report block reply\nknittinkittens 2 points 1 day ago Meow! permalink parent award report block reply\nSmokeyAF 1 points 1 day ago PDJT always uses the \"Congressional MoH..\" term, sorry, annoys me.  Congress no longer deserves any leftover association to the MoH. permalink award report block reply\nEmodius 1 points 1 day ago Meow lol. Good movie permalink award report block reply\nRitchie_Blackadder 1 points 1 day ago Not so funny meow, is it? permalink award report block reply\nDrVSGGEOTUSPhD 1 points 1 day ago what did everybody yell at trump??? permalink award report block reply\ncovefefe_energy 1 points 1 day ago Purfect permalink award report block reply\nSunnybats2 1 points 1 day ago To JD'd cat ladies? huh permalink award report block reply\nKlown_Kutz 1 points 1 day ago Did you just say…meow? permalink award report block reply\nSoulSnipper 1 points 1 day ago Since the CCP invested they're contractually obliged to say Mao at least three times an hour. Papa Ooo Mao Mao Everybody's heard about the word, Bird bird bird, the bird is the word. Right Mao. That's it for another hour. permalink award report block reply\nTao_Pai 1 points 21 hours ago Meow! Melonia looks purrr-fect. permalink award report block reply\nSpawnlingman 1 points 1 day ago Comment removed by community moderators. permalink award report block reply BeauHD 1 points 1 day ago What about the rent? permalink parent award report block reply\nBeauHD 1 points 1 day ago What about the rent? permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:47:21.155970Z"
}