{
  "id": "1ARK9iqfns",
  "url": "https://patriots.win/p/1ARK9iqfns/ben-shapiro-is-not-maga-what-a-f/c",
  "content": "389 Ben Shapiro is not MAGA, what a fu**ing joke. He is a Jewish supremacist, whose first loyalty is to his Mid Eastern roots - Israel. Israel is 75% percent Middle Eastern decent. They will never stop fighting their Middle Eastern counterparts. Let them handle their own entanglements. posted 2 days ago by TRUTH_BE_OUR_DOGMA 32 comments award share report block Let them handle their own entanglements.\n32 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style JackRile 24 points 2 days ago Ben is anti-Trump. permalink award report block reply South_Florida_Guy 23 points 2 days ago And anti American and anti Jesus permalink parent award report block reply ConfusedAngryArmed 15 points 2 days ago Could have just called him a Jew and saved yourself some typing. permalink parent award report block reply IncredibleMrE1 2 points 2 days ago .@ElishaKrauss wins with this comment on Jesus' \"hands up, don't shoot\" pose: \"it should be hands up, don't nail.\" https://twitter.com/benshapiro/status/516605479619817473 permalink parent award report block reply South_Florida_Guy 4 points 2 days ago Can't despise him enough permalink parent award report block reply IncredibleMrE1 9 points 2 days ago Ben Shapiro tried to destroy Corey Lewandowski's life with what he knew was a lie, and then he rage-quit Breitbart when Milo and Bannon wouldn't back him up. To this day he still hasn't apologized for it. He is a disgusting piece of shit. permalink parent award report block reply keeman 3 points 2 days ago Little Benny is for whatever Little Benny judges to be in the bests interest of Israel and (lower priority to him) his own career.  And he will invent superficially plausible sounding reasons for why he is for those things and then dare 19 yo lefty college kids to debate him about it, carefully editing out the very few who don't get completely rolled over by him. permalink parent award report block reply RizzlieDoodad 1 points 1 day ago Trump is compromised by Epstein. You don't have to like it, but where are the huge deportations we were promised. I want 65 million illegals deported permalink parent award report block reply stormdraintrooper 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply VoiceInTheLight 19 points 2 days ago Just waiting for the MIGA faggots to pop in here and start calling us all muslim nazi's. permalink award report block reply South_Florida_Guy 7 points 2 days ago F them permalink parent award report block reply foom 13 points 2 days ago You must understand this. Ben Shapiro is a manlet. If it wasn’t for incestuous judaism, he would never be able to reproduce. His genetic future is only secured by being part of that group. Of course he will forsake everything else for the group affiliation that got him laid against all odds. permalink award report block reply Givesgunstogrannies 9 points 2 days ago Don't worry, his audience is shriveling.  I have a 78 year old buddy I go to church with.  On Friday he was telling me Christ is working through Ben and Elon.  By Sunday he was making fun of Ben and expressing disgust at some of the \"morality\" of Dennis Prager.  It's not much, but it's honest work. permalink award report block reply kekapoo1 7 points 2 days ago I seriously consider that we are only holding them back.  As God's 'chosen people' we should get out of their way, pull all support and let israel on their own show the world how faithful and obedient and blessed they are so that we can have some reason to respect them.  they have had 3,500 years to do this so far and they always deny God, kill His prophets (including their Messiah, The Prophet Jesus, King also of the Jews) and suffer, but this time their trannies and gayes and trickster banksters and rapey army will get it genocidially right I'm sure permalink award report block reply Smurfection 7 points 2 days ago I'm also getting pretty sick of the Israel first crowd trying to tell conservatives who we can platform and who we can't.   it's obvious the demonization of Candace, Tuckery, Cooper is all orchestrated because they didn't follow the proper narrative regarding WWII. permalink award report block reply South_Florida_Guy 7 points 2 days ago 100% him and all other dual or foreign loyalty creep should be deported to their favorite country permalink award report block reply 5DchessWatch 6 points 2 days ago When his family originally immigrated to america, they were known in Yiddish as Shitzpierro , but it was changed by the Ellis Island officer to Shapiro . Shitzpierro translated to sad self shitting clown or clownshitter Ben Pubertyvoice is true to his ancestral surname permalink award report block reply Bunnybudman 4 points 2 days ago Been did not vote for Trump in 2016. He says he left it blank. permalink award report block reply the-new-style 4 points 2 days ago The Middle East isn't decent, that's why they flood everywhere else permalink award report block reply TGNX 4 points 2 days ago Precisely. permalink award report block reply Barron_FromTheFuture 4 points 2 days ago he is the gayest mossad agent ever permalink award report block reply berserkerbarrage 3 points 2 days ago Who said that he was? permalink award report block reply NoMoreIncumbents 2 points 2 days ago In other news, water is wet. permalink award report block reply steve_jerbs 2 points 2 days ago truth permalink award report block reply HoganP 1 points 2 days ago I'm not sure anyone has ever suggested that Ben Shapiro was MAGA besides, maybe, Ben Shapiro. permalink award report block reply Snooptwo 1 points 2 days ago Ben is an Eastern European. Just like most of the PMs of Israel, who changed their names to make them sound more Jewish. The Palestinians are actual semites, the “Israelis”that cry the most aren’t even Semitic. permalink award report block reply Rusty_Bungus 1 points 2 days ago Nobody here gives a fuck about Ben Shapiro.  Do you know what you should do when you see that globo-homo Ben?  Change the fucking channel.  Don't click the link.  Don't buy shit from his faggot advertisers.  That's it.  Done.  Stop wasting bandwidth on this little twerp. permalink award report block reply Gnometard -3 points 2 days ago Yet look at all the power he has over you. Do you people ever think that maybe you can just not pay attention to people? Does it ever cross your mind that maybe social media is forcing this on you for control over you? permalink award report block reply RuleoVicus 4 points 2 days ago Satan has no control over me and I'm able to still discuss him. permalink parent award report block reply tycho -9 points 2 days ago Naw, he's awesome and I love watching his show every day. He has a sane, balanced take that isn't influenced by the extreminism or the maga can do no wrong sides. permalink award report block reply Barron_FromTheFuture 5 points 2 days ago if this is satire, you win.  if not, you are retarded permalink parent award report block reply TearsAficionado 2 points 2 days ago It seems way to naive to NOT be satire. I think he's kidding. Kek. permalink parent award report block reply\nJackRile 24 points 2 days ago Ben is anti-Trump. permalink award report block reply South_Florida_Guy 23 points 2 days ago And anti American and anti Jesus permalink parent award report block reply ConfusedAngryArmed 15 points 2 days ago Could have just called him a Jew and saved yourself some typing. permalink parent award report block reply IncredibleMrE1 2 points 2 days ago .@ElishaKrauss wins with this comment on Jesus' \"hands up, don't shoot\" pose: \"it should be hands up, don't nail.\" https://twitter.com/benshapiro/status/516605479619817473 permalink parent award report block reply South_Florida_Guy 4 points 2 days ago Can't despise him enough permalink parent award report block reply IncredibleMrE1 9 points 2 days ago Ben Shapiro tried to destroy Corey Lewandowski's life with what he knew was a lie, and then he rage-quit Breitbart when Milo and Bannon wouldn't back him up. To this day he still hasn't apologized for it. He is a disgusting piece of shit. permalink parent award report block reply keeman 3 points 2 days ago Little Benny is for whatever Little Benny judges to be in the bests interest of Israel and (lower priority to him) his own career.  And he will invent superficially plausible sounding reasons for why he is for those things and then dare 19 yo lefty college kids to debate him about it, carefully editing out the very few who don't get completely rolled over by him. permalink parent award report block reply RizzlieDoodad 1 points 1 day ago Trump is compromised by Epstein. You don't have to like it, but where are the huge deportations we were promised. I want 65 million illegals deported permalink parent award report block reply stormdraintrooper 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply\nSouth_Florida_Guy 23 points 2 days ago And anti American and anti Jesus permalink parent award report block reply ConfusedAngryArmed 15 points 2 days ago Could have just called him a Jew and saved yourself some typing. permalink parent award report block reply IncredibleMrE1 2 points 2 days ago .@ElishaKrauss wins with this comment on Jesus' \"hands up, don't shoot\" pose: \"it should be hands up, don't nail.\" https://twitter.com/benshapiro/status/516605479619817473 permalink parent award report block reply South_Florida_Guy 4 points 2 days ago Can't despise him enough permalink parent award report block reply\nConfusedAngryArmed 15 points 2 days ago Could have just called him a Jew and saved yourself some typing. permalink parent award report block reply\nIncredibleMrE1 2 points 2 days ago .@ElishaKrauss wins with this comment on Jesus' \"hands up, don't shoot\" pose: \"it should be hands up, don't nail.\" https://twitter.com/benshapiro/status/516605479619817473 permalink parent award report block reply South_Florida_Guy 4 points 2 days ago Can't despise him enough permalink parent award report block reply\nSouth_Florida_Guy 4 points 2 days ago Can't despise him enough permalink parent award report block reply\nIncredibleMrE1 9 points 2 days ago Ben Shapiro tried to destroy Corey Lewandowski's life with what he knew was a lie, and then he rage-quit Breitbart when Milo and Bannon wouldn't back him up. To this day he still hasn't apologized for it. He is a disgusting piece of shit. permalink parent award report block reply\nkeeman 3 points 2 days ago Little Benny is for whatever Little Benny judges to be in the bests interest of Israel and (lower priority to him) his own career.  And he will invent superficially plausible sounding reasons for why he is for those things and then dare 19 yo lefty college kids to debate him about it, carefully editing out the very few who don't get completely rolled over by him. permalink parent award report block reply\nRizzlieDoodad 1 points 1 day ago Trump is compromised by Epstein. You don't have to like it, but where are the huge deportations we were promised. I want 65 million illegals deported permalink parent award report block reply\nstormdraintrooper 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply\nVoiceInTheLight 19 points 2 days ago Just waiting for the MIGA faggots to pop in here and start calling us all muslim nazi's. permalink award report block reply South_Florida_Guy 7 points 2 days ago F them permalink parent award report block reply\nSouth_Florida_Guy 7 points 2 days ago F them permalink parent award report block reply\nfoom 13 points 2 days ago You must understand this. Ben Shapiro is a manlet. If it wasn’t for incestuous judaism, he would never be able to reproduce. His genetic future is only secured by being part of that group. Of course he will forsake everything else for the group affiliation that got him laid against all odds. permalink award report block reply\nGivesgunstogrannies 9 points 2 days ago Don't worry, his audience is shriveling.  I have a 78 year old buddy I go to church with.  On Friday he was telling me Christ is working through Ben and Elon.  By Sunday he was making fun of Ben and expressing disgust at some of the \"morality\" of Dennis Prager.  It's not much, but it's honest work. permalink award report block reply\nkekapoo1 7 points 2 days ago I seriously consider that we are only holding them back.  As God's 'chosen people' we should get out of their way, pull all support and let israel on their own show the world how faithful and obedient and blessed they are so that we can have some reason to respect them.  they have had 3,500 years to do this so far and they always deny God, kill His prophets (including their Messiah, The Prophet Jesus, King also of the Jews) and suffer, but this time their trannies and gayes and trickster banksters and rapey army will get it genocidially right I'm sure permalink award report block reply\nSmurfection 7 points 2 days ago I'm also getting pretty sick of the Israel first crowd trying to tell conservatives who we can platform and who we can't.   it's obvious the demonization of Candace, Tuckery, Cooper is all orchestrated because they didn't follow the proper narrative regarding WWII. permalink award report block reply\nSouth_Florida_Guy 7 points 2 days ago 100% him and all other dual or foreign loyalty creep should be deported to their favorite country permalink award report block reply\n5DchessWatch 6 points 2 days ago When his family originally immigrated to america, they were known in Yiddish as Shitzpierro , but it was changed by the Ellis Island officer to Shapiro . Shitzpierro translated to sad self shitting clown or clownshitter Ben Pubertyvoice is true to his ancestral surname permalink award report block reply\nBunnybudman 4 points 2 days ago Been did not vote for Trump in 2016. He says he left it blank. permalink award report block reply\nthe-new-style 4 points 2 days ago The Middle East isn't decent, that's why they flood everywhere else permalink award report block reply\nTGNX 4 points 2 days ago Precisely. permalink award report block reply\nBarron_FromTheFuture 4 points 2 days ago he is the gayest mossad agent ever permalink award report block reply\nberserkerbarrage 3 points 2 days ago Who said that he was? permalink award report block reply\nNoMoreIncumbents 2 points 2 days ago In other news, water is wet. permalink award report block reply\nsteve_jerbs 2 points 2 days ago truth permalink award report block reply\nHoganP 1 points 2 days ago I'm not sure anyone has ever suggested that Ben Shapiro was MAGA besides, maybe, Ben Shapiro. permalink award report block reply\nSnooptwo 1 points 2 days ago Ben is an Eastern European. Just like most of the PMs of Israel, who changed their names to make them sound more Jewish. The Palestinians are actual semites, the “Israelis”that cry the most aren’t even Semitic. permalink award report block reply\nRusty_Bungus 1 points 2 days ago Nobody here gives a fuck about Ben Shapiro.  Do you know what you should do when you see that globo-homo Ben?  Change the fucking channel.  Don't click the link.  Don't buy shit from his faggot advertisers.  That's it.  Done.  Stop wasting bandwidth on this little twerp. permalink award report block reply\nGnometard -3 points 2 days ago Yet look at all the power he has over you. Do you people ever think that maybe you can just not pay attention to people? Does it ever cross your mind that maybe social media is forcing this on you for control over you? permalink award report block reply RuleoVicus 4 points 2 days ago Satan has no control over me and I'm able to still discuss him. permalink parent award report block reply\nRuleoVicus 4 points 2 days ago Satan has no control over me and I'm able to still discuss him. permalink parent award report block reply\ntycho -9 points 2 days ago Naw, he's awesome and I love watching his show every day. He has a sane, balanced take that isn't influenced by the extreminism or the maga can do no wrong sides. permalink award report block reply Barron_FromTheFuture 5 points 2 days ago if this is satire, you win.  if not, you are retarded permalink parent award report block reply TearsAficionado 2 points 2 days ago It seems way to naive to NOT be satire. I think he's kidding. Kek. permalink parent award report block reply\nBarron_FromTheFuture 5 points 2 days ago if this is satire, you win.  if not, you are retarded permalink parent award report block reply TearsAficionado 2 points 2 days ago It seems way to naive to NOT be satire. I think he's kidding. Kek. permalink parent award report block reply\nTearsAficionado 2 points 2 days ago It seems way to naive to NOT be satire. I think he's kidding. Kek. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:10:05.881370Z"
}