{
  "id": "1ARK52BQk2",
  "url": "https://patriots.win/p/1ARK52BQk2/if-arctic-frost-perpetrators-don/c",
  "content": "297 If Arctic Frost Perpetrators Don’t Go To Jail, Conservatives Will (thefederalist.com) posted 6 days ago by Sea_Still 9 comments award share report block If Arctic Frost Perpetrators Don't Go To Jail, Conservatives Will To conservatives, Arctic Frost is a scandal. To Democrats, it’s their new baseline. And the only way to stop it is to punish them. thefederalist.com\n9 comments Sort by Top Top New Worst Old Save BidenShowerDrool 5 points 6 days ago Dems are completely shameless and don't care about optics anymore. When they do get back in they will spend the entire time putting MAGA members in jail on garbage charges....you either jail them now or be prepared to do their jailtime for them. permalink award report block reply Grimarr 3 points 6 days ago After what they did to J6ers, no way am I going to jail for anything remotely political.  Getting dangerous for a fed to knock on doors. permalink award report block reply harryparatestes 3 points 6 days ago I hope the President, who's already been through ten years of this crap, has a strategy to deal with these clowns in the next three years because that's all the time we have left. permalink award report block reply Comanche_Moon 3 points 6 days ago The strategy should include getting a someone tougher than Blondi. permalink parent award report block reply Cville123 1 points 6 days ago Yes permalink award report block reply blitzstrasse 1 points 6 days ago The last time I checked, the Constitution described the punishment for Treason, and \"prison\" ain't on the list. * permalink award report block reply booblitchutz 1 points 6 days ago Narrator: They won’t. permalink award report block reply NoticesBugleOWO 1 points 6 days ago If Democrats ever take power again they're literally going to try to kill us. permalink award report block reply they-see-me-trollin 1 points 6 days ago fuck jail. gallows, guillotines, gas chambers. it's treason and sedition, punishable by death. permalink award report block reply\nBidenShowerDrool 5 points 6 days ago Dems are completely shameless and don't care about optics anymore. When they do get back in they will spend the entire time putting MAGA members in jail on garbage charges....you either jail them now or be prepared to do their jailtime for them. permalink award report block reply\nGrimarr 3 points 6 days ago After what they did to J6ers, no way am I going to jail for anything remotely political.  Getting dangerous for a fed to knock on doors. permalink award report block reply\nharryparatestes 3 points 6 days ago I hope the President, who's already been through ten years of this crap, has a strategy to deal with these clowns in the next three years because that's all the time we have left. permalink award report block reply Comanche_Moon 3 points 6 days ago The strategy should include getting a someone tougher than Blondi. permalink parent award report block reply\nComanche_Moon 3 points 6 days ago The strategy should include getting a someone tougher than Blondi. permalink parent award report block reply\nCville123 1 points 6 days ago Yes permalink award report block reply\nblitzstrasse 1 points 6 days ago The last time I checked, the Constitution described the punishment for Treason, and \"prison\" ain't on the list. * permalink award report block reply\nbooblitchutz 1 points 6 days ago Narrator: They won’t. permalink award report block reply\nNoticesBugleOWO 1 points 6 days ago If Democrats ever take power again they're literally going to try to kill us. permalink award report block reply\nthey-see-me-trollin 1 points 6 days ago fuck jail. gallows, guillotines, gas chambers. it's treason and sedition, punishable by death. permalink award report block reply",
  "fetched_at": "2025-11-12T21:04:50.777799Z"
}