{
  "id": "1ARK0UcSAb",
  "url": "https://patriots.win/p/1ARK0UcSAb/this-is-the-way/c",
  "content": "725 This Is The Way posted 7 days ago by sicarius 25 comments award share download report block\n25 comments Sort by Top Top New Worst Old Save Around the Web Natural Way to Regrow Hair on a Bald Head HaloGrow TheChillingEffect 45 points 7 days ago It's time to stand your ground, Western Man. permalink award report block reply magapatriot_pa 44 points 7 days ago That's fine, their new attorney general will just shoot members of your family until you support gun control. And if you still won't, then he'll just shoot you permalink award report block reply FerkenBlerkin 21 points 7 days ago That's WHY you own firearms.  Prepare for when someone breaks through your front door. permalink parent award report block reply Counterwhat 9 points 7 days ago This is the regret of every person in a communist state....... \"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? Or if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?... The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...𝗪𝗲 𝗱𝗶𝗱𝗻'𝘁 𝗹𝗼𝘃𝗲 𝗳𝗿𝗲𝗲𝗱𝗼𝗺 𝗲𝗻𝗼𝘂𝗴𝗵. 𝗔𝗻𝗱 𝗲𝘃𝗲𝗻 𝗺𝗼𝗿𝗲 – 𝘄𝗲 𝗵𝗮𝗱 𝗻𝗼 𝗮𝘄𝗮𝗿𝗲𝗻𝗲𝘀𝘀 𝗼𝗳 𝘁𝗵𝗲 𝗿𝗲𝗮𝗹 𝘀𝗶𝘁𝘂𝗮𝘁𝗶𝗼𝗻.... 𝗪𝗲 𝗽𝘂𝗿𝗲𝗹𝘆 𝗮𝗻𝗱 𝘀𝗶𝗺𝗽𝗹𝘆 𝗱𝗲𝘀𝗲𝗿𝘃𝗲𝗱 𝗲𝘃𝗲𝗿𝘆𝘁𝗵𝗶𝗻𝗴 𝘁𝗵𝗮𝘁 𝗵𝗮𝗽𝗽𝗲𝗻𝗲𝗱 𝗮𝗳𝘁𝗲𝗿𝘄𝗮𝗿𝗱.\" Aleksandr I. Solzhenitsyn , The Gulag Archipelago 1918–1956 permalink parent award report block reply FlyCatcher94 3 points 6 days ago You’ll gobtobtgecsuoermarket and they will pick you up like a mafia kidnapping.  You won’t even know they’re after you. permalink parent award report block reply bicentennial_john 3 points 6 days ago That doesnt work when we have 160,000,000 americans.  They could do it to a few select though.  But feds today are kinda fem and soy compared to the 50s, i doubt they can even do light shadow-work without losses these days permalink parent award report block reply FerkenBlerkin 1 points 6 days ago I have no clue what language you're speaking, but I carry daily.   I'm taking you with me. permalink parent award report block reply FlyCatcher94 1 points 6 days ago Hahaha.  I’m not even going to correct it.  covefefe !!! permalink parent award report block reply starjello 8 points 7 days ago That is correct. He better take at least two of them with him when it is his time. permalink parent award report block reply Plutossextape1 4 points 7 days ago Some of us patriots have no living family anymore unfortunately. permalink parent award report block reply medicpatriot 19 points 7 days ago They won’t take your guns. They’ll just restrict them heavily. It’s much easily to slowly erode your rights through incrementalism instead of doing an outright ban. permalink award report block reply Bramage 4 points 7 days ago We'll see.... permalink parent award report block reply ItsOkayToBeWight 1 points 6 days ago Fully automatic weapons are already de-facto illegal. Training with firearms is growing prohibitively expensive. permalink parent award report block reply IAmARealAmurican 1 points 6 days ago Hey its for the kids! permalink parent award report block reply hairless_ap3 6 points 6 days ago This is the guy who best Spermbarger in an election and it was close but they \"found 5000 votes for Spermbarger on a flash drive\" permalink award report block reply DarthEP 5 points 7 days ago On Your Mark... permalink award report block reply FlyCatcher94 4 points 6 days ago Think is they don’t care. permalink award report block reply glow-operator-2-0 3 points 6 days ago Prp-tip: Don't announce it. Demonstrate it when needed. Their drones outnumber you, so unless you have a totally loyal band of battle brothers and sisters to back you, stay fluid. Also, the 4473s you've been filling out? They've been requiring your email address the past year. Yes, they are collecting your information. permalink award report block reply redinmn 2 points 6 days ago Make them afraid to try to take them.   It really is the only way.  Platitudes mean nothing when it isnt backed up. permalink award report block reply ItsOkayToBeWight 2 points 6 days ago I always hated the \"boating accident\" joke. If you have to tell the government you lost your guns, then it's time to use the guns. permalink award report block reply sicarius OP 2 points 6 days ago If it's time to lose them, it's time to use them permalink parent award report block reply Pelosi_Halitosis 1 points 6 days ago I left Illinois. There's no point trying to fight them, you're never going to beat their perceived moral superiority. You're the problem because you own guns. permalink award report block reply Trump737 1 points 6 days ago Oooooo spicy, i like it permalink award report block reply patriotpodcast 0 points 6 days ago Gay permalink award report block reply NoMoreBullshit007 0 points 7 days ago Comment removed by community filter, pending further review. permalink award report block reply\nTheChillingEffect 45 points 7 days ago It's time to stand your ground, Western Man. permalink award report block reply\nmagapatriot_pa 44 points 7 days ago That's fine, their new attorney general will just shoot members of your family until you support gun control. And if you still won't, then he'll just shoot you permalink award report block reply FerkenBlerkin 21 points 7 days ago That's WHY you own firearms.  Prepare for when someone breaks through your front door. permalink parent award report block reply Counterwhat 9 points 7 days ago This is the regret of every person in a communist state....... \"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? Or if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?... The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...𝗪𝗲 𝗱𝗶𝗱𝗻'𝘁 𝗹𝗼𝘃𝗲 𝗳𝗿𝗲𝗲𝗱𝗼𝗺 𝗲𝗻𝗼𝘂𝗴𝗵. 𝗔𝗻𝗱 𝗲𝘃𝗲𝗻 𝗺𝗼𝗿𝗲 – 𝘄𝗲 𝗵𝗮𝗱 𝗻𝗼 𝗮𝘄𝗮𝗿𝗲𝗻𝗲𝘀𝘀 𝗼𝗳 𝘁𝗵𝗲 𝗿𝗲𝗮𝗹 𝘀𝗶𝘁𝘂𝗮𝘁𝗶𝗼𝗻.... 𝗪𝗲 𝗽𝘂𝗿𝗲𝗹𝘆 𝗮𝗻𝗱 𝘀𝗶𝗺𝗽𝗹𝘆 𝗱𝗲𝘀𝗲𝗿𝘃𝗲𝗱 𝗲𝘃𝗲𝗿𝘆𝘁𝗵𝗶𝗻𝗴 𝘁𝗵𝗮𝘁 𝗵𝗮𝗽𝗽𝗲𝗻𝗲𝗱 𝗮𝗳𝘁𝗲𝗿𝘄𝗮𝗿𝗱.\" Aleksandr I. Solzhenitsyn , The Gulag Archipelago 1918–1956 permalink parent award report block reply FlyCatcher94 3 points 6 days ago You’ll gobtobtgecsuoermarket and they will pick you up like a mafia kidnapping.  You won’t even know they’re after you. permalink parent award report block reply bicentennial_john 3 points 6 days ago That doesnt work when we have 160,000,000 americans.  They could do it to a few select though.  But feds today are kinda fem and soy compared to the 50s, i doubt they can even do light shadow-work without losses these days permalink parent award report block reply FerkenBlerkin 1 points 6 days ago I have no clue what language you're speaking, but I carry daily.   I'm taking you with me. permalink parent award report block reply FlyCatcher94 1 points 6 days ago Hahaha.  I’m not even going to correct it.  covefefe !!! permalink parent award report block reply starjello 8 points 7 days ago That is correct. He better take at least two of them with him when it is his time. permalink parent award report block reply Plutossextape1 4 points 7 days ago Some of us patriots have no living family anymore unfortunately. permalink parent award report block reply\nFerkenBlerkin 21 points 7 days ago That's WHY you own firearms.  Prepare for when someone breaks through your front door. permalink parent award report block reply Counterwhat 9 points 7 days ago This is the regret of every person in a communist state....... \"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? Or if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?... The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...𝗪𝗲 𝗱𝗶𝗱𝗻'𝘁 𝗹𝗼𝘃𝗲 𝗳𝗿𝗲𝗲𝗱𝗼𝗺 𝗲𝗻𝗼𝘂𝗴𝗵. 𝗔𝗻𝗱 𝗲𝘃𝗲𝗻 𝗺𝗼𝗿𝗲 – 𝘄𝗲 𝗵𝗮𝗱 𝗻𝗼 𝗮𝘄𝗮𝗿𝗲𝗻𝗲𝘀𝘀 𝗼𝗳 𝘁𝗵𝗲 𝗿𝗲𝗮𝗹 𝘀𝗶𝘁𝘂𝗮𝘁𝗶𝗼𝗻.... 𝗪𝗲 𝗽𝘂𝗿𝗲𝗹𝘆 𝗮𝗻𝗱 𝘀𝗶𝗺𝗽𝗹𝘆 𝗱𝗲𝘀𝗲𝗿𝘃𝗲𝗱 𝗲𝘃𝗲𝗿𝘆𝘁𝗵𝗶𝗻𝗴 𝘁𝗵𝗮𝘁 𝗵𝗮𝗽𝗽𝗲𝗻𝗲𝗱 𝗮𝗳𝘁𝗲𝗿𝘄𝗮𝗿𝗱.\" Aleksandr I. Solzhenitsyn , The Gulag Archipelago 1918–1956 permalink parent award report block reply FlyCatcher94 3 points 6 days ago You’ll gobtobtgecsuoermarket and they will pick you up like a mafia kidnapping.  You won’t even know they’re after you. permalink parent award report block reply bicentennial_john 3 points 6 days ago That doesnt work when we have 160,000,000 americans.  They could do it to a few select though.  But feds today are kinda fem and soy compared to the 50s, i doubt they can even do light shadow-work without losses these days permalink parent award report block reply FerkenBlerkin 1 points 6 days ago I have no clue what language you're speaking, but I carry daily.   I'm taking you with me. permalink parent award report block reply FlyCatcher94 1 points 6 days ago Hahaha.  I’m not even going to correct it.  covefefe !!! permalink parent award report block reply\nCounterwhat 9 points 7 days ago This is the regret of every person in a communist state....... \"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? Or if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?... The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...𝗪𝗲 𝗱𝗶𝗱𝗻'𝘁 𝗹𝗼𝘃𝗲 𝗳𝗿𝗲𝗲𝗱𝗼𝗺 𝗲𝗻𝗼𝘂𝗴𝗵. 𝗔𝗻𝗱 𝗲𝘃𝗲𝗻 𝗺𝗼𝗿𝗲 – 𝘄𝗲 𝗵𝗮𝗱 𝗻𝗼 𝗮𝘄𝗮𝗿𝗲𝗻𝗲𝘀𝘀 𝗼𝗳 𝘁𝗵𝗲 𝗿𝗲𝗮𝗹 𝘀𝗶𝘁𝘂𝗮𝘁𝗶𝗼𝗻.... 𝗪𝗲 𝗽𝘂𝗿𝗲𝗹𝘆 𝗮𝗻𝗱 𝘀𝗶𝗺𝗽𝗹𝘆 𝗱𝗲𝘀𝗲𝗿𝘃𝗲𝗱 𝗲𝘃𝗲𝗿𝘆𝘁𝗵𝗶𝗻𝗴 𝘁𝗵𝗮𝘁 𝗵𝗮𝗽𝗽𝗲𝗻𝗲𝗱 𝗮𝗳𝘁𝗲𝗿𝘄𝗮𝗿𝗱.\" Aleksandr I. Solzhenitsyn , The Gulag Archipelago 1918–1956 permalink parent award report block reply\nFlyCatcher94 3 points 6 days ago You’ll gobtobtgecsuoermarket and they will pick you up like a mafia kidnapping.  You won’t even know they’re after you. permalink parent award report block reply bicentennial_john 3 points 6 days ago That doesnt work when we have 160,000,000 americans.  They could do it to a few select though.  But feds today are kinda fem and soy compared to the 50s, i doubt they can even do light shadow-work without losses these days permalink parent award report block reply FerkenBlerkin 1 points 6 days ago I have no clue what language you're speaking, but I carry daily.   I'm taking you with me. permalink parent award report block reply FlyCatcher94 1 points 6 days ago Hahaha.  I’m not even going to correct it.  covefefe !!! permalink parent award report block reply\nbicentennial_john 3 points 6 days ago That doesnt work when we have 160,000,000 americans.  They could do it to a few select though.  But feds today are kinda fem and soy compared to the 50s, i doubt they can even do light shadow-work without losses these days permalink parent award report block reply\nFerkenBlerkin 1 points 6 days ago I have no clue what language you're speaking, but I carry daily.   I'm taking you with me. permalink parent award report block reply FlyCatcher94 1 points 6 days ago Hahaha.  I’m not even going to correct it.  covefefe !!! permalink parent award report block reply\nFlyCatcher94 1 points 6 days ago Hahaha.  I’m not even going to correct it.  covefefe !!! permalink parent award report block reply\nstarjello 8 points 7 days ago That is correct. He better take at least two of them with him when it is his time. permalink parent award report block reply\nPlutossextape1 4 points 7 days ago Some of us patriots have no living family anymore unfortunately. permalink parent award report block reply\nmedicpatriot 19 points 7 days ago They won’t take your guns. They’ll just restrict them heavily. It’s much easily to slowly erode your rights through incrementalism instead of doing an outright ban. permalink award report block reply Bramage 4 points 7 days ago We'll see.... permalink parent award report block reply ItsOkayToBeWight 1 points 6 days ago Fully automatic weapons are already de-facto illegal. Training with firearms is growing prohibitively expensive. permalink parent award report block reply IAmARealAmurican 1 points 6 days ago Hey its for the kids! permalink parent award report block reply\nBramage 4 points 7 days ago We'll see.... permalink parent award report block reply ItsOkayToBeWight 1 points 6 days ago Fully automatic weapons are already de-facto illegal. Training with firearms is growing prohibitively expensive. permalink parent award report block reply\nItsOkayToBeWight 1 points 6 days ago Fully automatic weapons are already de-facto illegal. Training with firearms is growing prohibitively expensive. permalink parent award report block reply\nIAmARealAmurican 1 points 6 days ago Hey its for the kids! permalink parent award report block reply\nhairless_ap3 6 points 6 days ago This is the guy who best Spermbarger in an election and it was close but they \"found 5000 votes for Spermbarger on a flash drive\" permalink award report block reply\nDarthEP 5 points 7 days ago On Your Mark... permalink award report block reply\nFlyCatcher94 4 points 6 days ago Think is they don’t care. permalink award report block reply\nglow-operator-2-0 3 points 6 days ago Prp-tip: Don't announce it. Demonstrate it when needed. Their drones outnumber you, so unless you have a totally loyal band of battle brothers and sisters to back you, stay fluid. Also, the 4473s you've been filling out? They've been requiring your email address the past year. Yes, they are collecting your information. permalink award report block reply\nredinmn 2 points 6 days ago Make them afraid to try to take them.   It really is the only way.  Platitudes mean nothing when it isnt backed up. permalink award report block reply\nItsOkayToBeWight 2 points 6 days ago I always hated the \"boating accident\" joke. If you have to tell the government you lost your guns, then it's time to use the guns. permalink award report block reply sicarius OP 2 points 6 days ago If it's time to lose them, it's time to use them permalink parent award report block reply\nsicarius OP 2 points 6 days ago If it's time to lose them, it's time to use them permalink parent award report block reply\nPelosi_Halitosis 1 points 6 days ago I left Illinois. There's no point trying to fight them, you're never going to beat their perceived moral superiority. You're the problem because you own guns. permalink award report block reply\nTrump737 1 points 6 days ago Oooooo spicy, i like it permalink award report block reply\npatriotpodcast 0 points 6 days ago Gay permalink award report block reply\nNoMoreBullshit007 0 points 7 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:11:23.288083Z"
}