{
  "id": "1ARK5BHPqi",
  "url": "https://patriots.win/p/1ARK5BHPqi/being-a-white-girl-is-really-sca/c",
  "content": "490 \"Being a white girl is really scary at this time.\"  Smart kid - posted 3 days ago by KuzoKevin 12 comments award share report block Libs of TikTok @libsoftiktok • 3d Young UK girl speaks out after being forced to not go to school because she was branded “racist“ for sounding the alarm about the migrant crime epidemic “I just want to feel safe in my community. I just want to be able to walk the streets without worrying”\n12 comments Sort by Top Top New Worst Old Save Roadpower 17 points 3 days ago Will still vote for libtard/egalitarian policies, she largely said so. permalink award report block reply Beachbum2023 14 points 3 days ago Respect their rape culture? How bad does it have to get before the whites stop being tolerant? permalink award report block reply Roadpower 6 points 3 days ago Pathological altruism is destroying us. But that is by design by those that pushed it on us. permalink parent award report block reply orcwordlaugh 7 points 3 days ago \"I respect everyone's cultures...I just want to feel safe\" She will learn. permalink award report block reply BecauseYoudBeInJail 3 points 2 days ago Hopefully well before she joins WNBA like her American doppelganger permalink parent award report block reply Oodles 5 points 2 days ago Islamic and black cultures are incompatible with civil society permalink award report block reply brewser724 4 points 3 days ago Almost there, right up to the accepting all that stuff from the rapists cultchah and all... permalink award report block reply DrVSGGEOTUSPhD 3 points 3 days ago Amazing young lady! permalink award report block reply donteatthat 2 points 3 days ago Best they can do is burn an effigy of Starmer permalink award report block reply BeerPatroit 2 points 2 days ago Those poor people need guns to solve this problem. permalink award report block reply Redeemable 2 points 2 days ago Sorry. You can't respect their culture and feel safe. You have to pick one. permalink award report block reply God-is-good 1 points 2 days ago Not exactly the quote from the video. Slightly adjusted unnecessarily. Do better Libz. permalink award report block reply\nRoadpower 17 points 3 days ago Will still vote for libtard/egalitarian policies, she largely said so. permalink award report block reply\nBeachbum2023 14 points 3 days ago Respect their rape culture? How bad does it have to get before the whites stop being tolerant? permalink award report block reply Roadpower 6 points 3 days ago Pathological altruism is destroying us. But that is by design by those that pushed it on us. permalink parent award report block reply\nRoadpower 6 points 3 days ago Pathological altruism is destroying us. But that is by design by those that pushed it on us. permalink parent award report block reply\norcwordlaugh 7 points 3 days ago \"I respect everyone's cultures...I just want to feel safe\" She will learn. permalink award report block reply BecauseYoudBeInJail 3 points 2 days ago Hopefully well before she joins WNBA like her American doppelganger permalink parent award report block reply\nBecauseYoudBeInJail 3 points 2 days ago Hopefully well before she joins WNBA like her American doppelganger permalink parent award report block reply\nOodles 5 points 2 days ago Islamic and black cultures are incompatible with civil society permalink award report block reply\nbrewser724 4 points 3 days ago Almost there, right up to the accepting all that stuff from the rapists cultchah and all... permalink award report block reply\nDrVSGGEOTUSPhD 3 points 3 days ago Amazing young lady! permalink award report block reply\ndonteatthat 2 points 3 days ago Best they can do is burn an effigy of Starmer permalink award report block reply\nBeerPatroit 2 points 2 days ago Those poor people need guns to solve this problem. permalink award report block reply\nRedeemable 2 points 2 days ago Sorry. You can't respect their culture and feel safe. You have to pick one. permalink award report block reply\nGod-is-good 1 points 2 days ago Not exactly the quote from the video. Slightly adjusted unnecessarily. Do better Libz. permalink award report block reply",
  "fetched_at": "2025-11-12T20:52:46.843088Z"
}