{
  "id": "8175841",
  "title": "1225J6 Fedbomber Caught(www.theblaze.com)posted4 days agobyKlandathu230 commentsawardsharereportbloc",
  "url": "https://patriots.win/p/1ARK56kf33/j6-fedbomber-caught/c",
  "content": "1225 J6 Fedbomber Caught (www.theblaze.com) posted 4 days ago by Klandathu 230 comments award share report block Former Capitol Police officer a forensic match for Jan. 6 pipe bomber, sources say | Blaze Media A computer program that compared the bomb suspect’s gait to that of Shauni Kerkhoff produced a 94% match. www.theblaze.com\n230 comments Sort by Top Top New Worst Old Save guywholikesDjtof2024 116 points 4 days ago Trump keeps taking away democrat talking points. Hopefully Trump will move swiftly to take away \"Doomer\" (lol) talking points with as much fervor, if not more! This bomber being caught is a great beginning of such. permalink award report block reply emorphia 76 points 4 days ago i want him to take away the filibuster and pass the MAGA agenda. permalink parent award report block reply NowTheyAllLose 27 points 4 days ago They already said “take away doomer talking points.” Why you got be redundant? 😅 permalink parent award report block reply War_Hamster 21 points 4 days ago That’s not up to Trump and there’s 20+ Republican Senators who won’t do it. Ain’t gonna happen. Focus on exposing the rot and corruption so maybe we can get honest politicians and then we can get the MAGA agenda. permalink parent award report block reply guywholikesDjtof2024 15 points 4 days ago Arrest the corrupt pooliticians. \"but muh optics\" The dems keep getting in wins without having optics. Imagine how much more we could accomplish if we didn't let optics behave like a yoke the Dems shackled to us!!!! permalink parent award report block reply PhilipeNegro 6 points 4 days ago Because Republicans never want to actually govern, only raise money and hold office. permalink parent award report block reply MAGARondonmonson 1 points 4 days ago Every Senator who is fir the Filibuster should be replaced. The Deep Stste UNI PARTY use this rule to do their will and not the will of the people who voted them in. Why can't we get a Balanced Budget Amendment ? Psstt, the Uni Party do not want one. Now the RINOs have an excuse, we do not have 60 votes. LOL. Its a built in excuse why they never have to pass anything they do not really want, they can just blame Dems, and the other side does the same thing when they are in power. Also, both sides when they are the Minority Party, can GET GRAFT by saying deal with us, give us this, this and this or we can't get to 60 votes for you. One last point, they say this was done way back 75-100 years ago in order to create Bipartisanship amongst the parties. Well, it has had just the opposite affect and I can prove that. If there was a 50 vote rule which represents we the people, as it should be, the Dems would be in these back rooms trying to get the best deal they could get, WORKING with the Majority party. The Filibuster is the worst, most evil rule ever put forth, it deprives us the Majority from ever having a say as the Majority. It is complete BS. permalink parent award report block reply AmericanJawa 5 points 4 days ago i want him to take away the filibuster and pass the MAGA agenda. I want him to get to those mass federal firings and then do that. permalink parent award report block reply AndanteAndante 4 points 4 days ago They don’t have enough votes. We have traitors in Congress. permalink parent award report block reply Made_in_America 4 points 4 days ago Yeah I give way less of a shit about being able to point the finger at low level swamp cronies and more about permanently ending their corrupt bs with legislation. permalink parent award report block reply load 1 more comments... bearhugprolapse 31 points 4 days ago he won’t. and the bomber isn’t “caught,” she’s merely revealed. spare us the pageantry of victory until at least a bare minimum of punishment has been served. permalink parent award report block reply snoopy3210 11 points 4 days ago This is the biggest : well, well well…  in history and you complain about it! Are you for the Fed agitators that broke the windows and framed Trump supporters as “insurrectionists”, you little piece of shit? permalink parent award report block reply bearhugprolapse 21 points 4 days ago lighten up, francis. i’m not complaining about it. i am a student of history—i’ve come to know for a while this is the circus act we’re subject to. you tell me when we last saw some substantial law enforcement go our way. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago I agree. That's why we should put the pedal to the metal. If this TDSer remains free for one whole month, and Trump complies with the TDS judges, then I'll believe this. permalink parent award report block reply view 3 more comments... snoopy3210 1 points 4 days ago Okay i looked up at the blaze and this is bullshit. The kyle seraphin stuff is always bullshit. So nobody will get arrested because it’s not the right person. You have to look at who is pushing it. But since Seraphin is former FBI that means the FBI is clearly involved in trying to disrupt the investigation as they’re also involved in J6 permalink parent award report block reply Cacciali_Via 18 points 4 days ago It has been known since before Trump took office that investigators knew the identity of the individual and that there was a cover up taking place. Bongino talked about it on his show endlessly. Kash has been in office for over 8 months and this lesbian cia terrorist has still not been perp walked. This means that either the coverup continues, or she is part of a greater investigation that Kash is not willing to yet reveal. In other words, two more weeks... permalink parent award report block reply roadrunner0 10 points 4 days ago Of course they knew it was a CIA operative.. The person used their phone right in front of a camera out of being a useful idiot or deliberately so they could be caught.. When I heard that cell data for the capitol was \"unavailable\" at the time of the incident I knew that they were in coverup mode since D.C. has massive digital spying going on separately by numerous agencies.. I am actually kind of surprised she and the others haven't had \"accidents\" to erase them from being lose ends.. permalink parent award report block reply Repentnow 1 points 4 days ago Bongino & Kash were clickfluencers. They didn't have any 'inside' information. They were both full of shit. permalink parent award report block reply view 2 more comments... bigfatnagger 6 points 4 days ago Hey take it easy man. We're on the same side. Knock off the friendly fire permalink parent award report block reply RYTHMICRIOT 2 points 4 days ago Then why is the Trump DOJ currently stating that this report is \"false\"? https://x.com/EdMartinDOJ/status/1986992472611012910?t=p8L2r9y-0OaYJ3maVfc_Uw&s=19 permalink parent award report block reply SanityGumby 1 points 4 days ago That’s why I’ve been saying pump the brakes because the lawsuit will be enormous if this isn’t the right person permalink parent award report block reply Emodius 0 points 4 days ago Exactly God he must be fun at parties permalink parent award report block reply bearhugprolapse 1 points 4 days ago i don’t bring politics to parties. permalink parent award report block reply view 12 more comments... guywholikesDjtof2024 -2 points 4 days ago why the mention of God? is there anything you are uncomfortable with? permalink parent award report block reply load 1 more comments... ianpatrick1966 11 points 4 days ago exactly the hopium is so high. we know who shot babbit too, but nothing was ever done about it! So what, this bitch has been \"revealed\" NOTHING WILL HAPPEN (and we have lots of evidence to confirm this) permalink parent award report block reply guywholikesDjtof2024 8 points 4 days ago I heard many on here blackpilling, using the pipebomber, specifically , as a blackpill. Least obvious goalpost shifting. \"grrr Trump doing nothing about pipebomber\" \"noo not like that\" Also, reveal happens prior to action. If we want action, we must motivate and push Trump himself to do something. Don't expect him to know absolutely everything. Go on Truth Social. permalink parent award report block reply bearhugprolapse 5 points 4 days ago if trump needs us to motivate him to move on the pipe bomber then he doesn’t need to be in office. permalink parent award report block reply roadrunner0 1 points 4 days ago Just maybe the President needs us to start making big noise about all the uncovered corruption and treason by parts of our own government to physically show that we as US citizens of the Constitutional Republic are mad as hell and aren't going to take it anymore.. I am ready for some MAGA protests............... permalink parent award report block reply view 5 more comments... guywholikesDjtof2024 0 points 4 days ago Or that could've come after dealing with our relationships with countries. Is the pipe bomber: Threatening our economy Getting thousands + of people killed in wars Resulting in our jobs being sent overseas Containing rare earth minerals that China could snatch ???? I'm no hopium huffer, but yet I see likely reasons for why he didn't do it earlier. permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 2 points 4 days ago You mean like we motivated him about the Epstein files? permalink parent award report block reply AppalachianTactical 1 points 4 days ago I mean, if the pipebomber is capitol police then nothing qill ve done because, guess what, theyve known since before they did it. Like you guys think that they actually suddenly discover thar it was themselves. Theyd have to take her down and a large part of the capitol police.\nHow many cap police watched it and immediately recognized. Theyll have to burn her as some lone wolf or claim that it was a training exercise that got reported as real. permalink parent award report block reply Appeal2Heaven98 2 points 4 days ago I know you're getting downvoted to oblivion for this take. But how else are we supposed to feel with how things have gone for us the past few years? Everyone downvoting you must have the sunrock equivalent of hopium. permalink parent award report block reply bearhugprolapse 2 points 4 days ago aside from when i come on here to goose people, my confirmation mostly comes from downvotes. occasionally i'll get a flurry of positives but i’m not really concerned about the number. i think a lot of people just aren’t ready for the truth. permalink parent award report block reply ApprenticeParty 1 points 4 days ago They’ve covered this up pretty good and destroyed evidence intentionally. Going to be tough to get a conviction permalink parent award report block reply SanityGumby 1 points 4 days ago The cell carrier says they have all of the data and the government lied about it being corrupted permalink parent award report block reply ApprenticeParty 1 points 4 days ago Yooo let’s go then! Their official story was incredibly retarded and everyone went with it so, I’m surprised to hear that. permalink parent award report block reply load 7 more comments... MisprisionIsEvil 6 points 4 days ago Doomer talking points? Do you mean something like all of the innocent people killed by the death vaccine, and now in their graves, while those who forced it on us are still wealthy, free and protected? That? permalink parent award report block reply Appeal2Heaven98 5 points 4 days ago I'll take the crap on being a Doomer if this person gets sentenced for more than a slap on the wrist for domestic terrorism. Past history shows that might not be the case. permalink parent award report block reply king_cocoon 4 points 4 days ago To be fair, Democrats never talk about the pipe bomber because they always knew it was a fedsurrection hoax. permalink parent award report block reply load 6 more comments... Trump454748 90 points 4 days ago Gee golly whillikers, it’s beginning to look like January 6th was just a giant fed operation and not an iNsUrReCtloN. permalink award report block reply MAGAguitar 33 points 4 days ago An insurrection against the SITTING president at the time - Trump permalink parent award report block reply PosterIsDead 21 points 4 days ago J6 Committee is equal in blame. permalink parent award report block reply bananaguard62 8 points 4 days ago They created the narrative that Trump and his followers were evil and should not be allowed in polite society. That was the goal. I lost friends, family, and work, for peacefully walking through the Rotunda thanks to the trap that was set and the story they told. J6ers deserve compensation. permalink parent award report block reply bigdickhangsright 3 points 4 days ago A siting president ROBBED of his reelection. That's some third world shit right there. permalink parent award report block reply SlowBurningRage 1 points 4 days ago How about an arrest and conviction for a change? permalink parent award report block reply TheTelltaleFly 1 points 4 days ago I’ll settle for disbanding the fbi permalink parent award report block reply BoberFett 10 points 4 days ago Trump doesn't have three years to dismantle the treason machine. He has one year. Democrats will continue to stonewall their way into midterm victories then Trump will be impeached again. Also, none of6 these DC demons can be convicted, DC juries will acquit every one. Trump needs to take drastic measures. Everyone needs to realize what time it is. permalink parent award report block reply Appeal2Heaven98 6 points 4 days ago Conspiracy theorists are being proven right. Again. permalink parent award report block reply Shitsbrokeyo 2 points 4 days ago So she had a pair of rare air Jordan's?\n\"Among women, Black women number 538 and White women number 170\" So a  woman, who beats the odds for dc police employment, woman of that build, height, obvious knowledge of criminal law and the risks, that is white, wearer of rare air jordans and knows someone in the inner loop of j6 planning?\nWas asked to play this federal terrorist crime role. ..and yet was intelligent enough to go get a job with the CIA said yes.  Got it. permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago It literally does not matter anymore. Unless people are perp walked, convicted, and a giant spectacle is made of it on every single news station, it absolutely does not matter. J6 and the ensuing cover up has served its purpose in poisoning the cultural zeitgeist. Unless you do the above, the idiots that believe it was an insurrection will not change their mind, and even then you'll still have idiots that will believe it was an insurrection. This has always been used as ammo to demonize the MAGA movement, and it has worked brilliantly. permalink parent award report block reply load 1 more comments... emorphia 64 points 4 days ago so fedboys to throw a flashbang and rile up the crowd to enter the capitol, another fed planting a bomb to blame MAGA. and antifa's dressed in MAGA gear to commit felonies to get the blame on the crowd.   entire J6 was staged.  and as usual, no arrests or punishment for the ones that planned it.  only the low hanging fruits will get busted. and nothing changes.   damn frustrating. permalink award report block reply jaeger 57 points 4 days ago The bomb is what cancelled the proceedings with 3mins to spare and changed the rules to allow the steal later that day. permalink parent award report block reply Emodius 29 points 4 days ago Great job pointing that out. That was a key event permalink parent award report block reply TheTelltaleFly 24 points 4 days ago And the FBI identified the bomber within days of Jan 6 AND CALLED THE WHOLE THING OFF and then proceeded to obstruct justice in the subsequent 4 years. How about we get Kash to do what he said he was going to do all along and DISBAND THE FBI. Fire everyone and bulldoze the entire city block. I’m done with it. We do not need a federal police force. permalink parent award report block reply roadrunner0 7 points 4 days ago The big brother of the FBI which happens to be the C-I-A seems to be deep into all of this and they can with a quick phone call shut down FBI investigations or coordinate with them to stage evidence and frame people.. How about we start by burning them down first since they traffic massive amounts of drugs, start wars to cover for this and seem to never be held to account?? permalink parent award report block reply view 3 more comments... NomadicKrow2 0 points 4 days ago The President can disband the FBI with the stroke of a pen. The FBI's existence is purely within the president's power. permalink parent award report block reply view 1 more comments... DownTheBurg 2 points 4 days ago Exactly permalink parent award report block reply PapaWheelie 1 points 4 days ago What rules changed? permalink parent award report block reply jaeger 1 points 4 days ago In the certification process, they used \"emergency\" rules and got to skip any challenges to the stolen election when they reconvened. permalink parent award report block reply PapaWheelie 1 points 4 days ago I'm not sure that's right.  I think they picked up where they left off with the challenges.  They did PA and then the others backed off due to lack of support. permalink parent award report block reply view 8 more comments... snoopy3210 12 points 4 days ago Nah I see a great RICO case in formation. permalink parent award report block reply DRKMSTR 3 points 4 days ago Just like occupy & the tea party patriots. Can't ever have a political movement that bridges the left-right divide. The sad thing is so many people fell for it, enough to make a spectacle out of it for decades to come. J6 was a resounding success because of dumb people in the crowd. permalink parent award report block reply UnknownUserName 2 points 4 days ago Wtf is trump doing about any of this? permalink parent award report block reply FlyCatcher94 2 points 4 days ago I think the FBI is probably doing an ok job, but they are under blondi who is absolutely slow walking until trump is gone. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago you mean like freeing the J6ers and exposing a perp? permalink parent award report block reply bananaguard62 1 points 4 days ago Did he expose anyone.  Seems like Steve baker did. permalink parent award report block reply load 6 more comments... deltaforcestrike 32 points 4 days ago After reading the article, this is reminiscent of the Pipes bursting, \"Miraculously\" on election eve November 3, 2020 permalink award report block reply Shitsbrokeyo 3 points 4 days ago she had a pair of rare air Jordan's? \"Among women, Black women number 538 and White women number 170\" So a woman, who beats the odds for dc police employment, woman of that build, height, obvious knowledge of criminal law and the risks, that is white, wearer of rare air jordans and knows someone in the inner loop of j6 planning? Was asked to play this federal terrorist crime role. ..and yet was intelligent enough to go get a job with the CIA said yes and wasnt killed to hide it. Got it. permalink parent award report block reply Lordfred1993 26 points 4 days ago And then went and joined the CIA...hahaha. permalink award report block reply brainphreeze 13 points 4 days ago Rewarded permalink parent award report block reply roadrunner0 8 points 4 days ago Recruited to be a useful idiot permalink parent award report block reply OG_BACONndEGGs 23 points 4 days ago Hang the dyke permalink award report block reply roadrunner0 10 points 4 days ago She like the others in the team that did this were amateurs and thus useful idiots.. It is the people at the top like Brennen, Clapper, Pelosi and others that need hung by the neck until dead on the South lawn of the White House after a quick military trial.. permalink parent award report block reply PatriotSkorzeny 5 points 4 days ago Fuck no dude. “Plant this bomb.” is a pretty specific you have to want to willingly do it act. Someone??? told the police officer to plant a bomb and she said yes. She has qualified immunity. 🤷🏼‍♂️ permalink parent award report block reply roadrunner0 1 points 4 days ago There is no immunity for TREASON permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago It wasn't real it was a fed training device. permalink parent award report block reply NomadicKrow2 1 points 4 days ago You don't have qualified immunity for shit like that dude. permalink parent award report block reply PhilipeNegro 2 points 4 days ago Exactly the opposite. Leftism requires an upward pressure from below - anyone can sit in the big chair and read a script. How you actually fight it is taking out the base, making those who may be willing to act think twice about it, and removing that upward pressure. That’s why it always took a right-wing junta to properly end communism - you have to make merely supporting it a physical risk. permalink parent award report block reply OG_BACONndEGGs 1 points 4 days ago They all top to bottom idc if you were a useful idiot. permalink parent award report block reply corporateshizer -1 points 4 days ago People died in the January 6th Massacre and the subsequent federal persecutions of American patriots. Thousands of lives ruined directly, and all Americans were harmed indirectly. The conspiring parties all need to be charged and judged accordingly, with death as the main sentence. permalink parent award report block reply Whatyougotson 2 points 4 days ago Massacre? No. permalink parent award report block reply corporateshizer 0 points 4 days ago What happened here? https://images.wsj.net/im-282310/?width=780&size=1.5 permalink parent award report block reply view 2 more comments... OlivaireBandaloo 16 points 4 days ago Bow give her the same treatment the J6res were given.  Jail, financial ruin, destruction of family. permalink award report block reply roadrunner0 4 points 4 days ago It is the people that gave the orders to do this act of treason I want to see tarred, feathered and drug behind a Humvee tied to a fence rail on their way to be hung by the neck on the South lawn of the White House.. permalink parent award report block reply PatriotSkorzeny 12 points 4 days ago Caught means in handcuffs. Handcuffs? permalink award report block reply ianpatrick1966 12 points 4 days ago Just like the cop that shot Babbit. Oh wait did you say commendations?  Because thats what HE got for murdering a patriot. permalink parent award report block reply FlyCatcher94 1 points 4 days ago Just a matter of time before biology takes over and he’s arrested for battery, drugs or any number of things. permalink parent award report block reply PhilipeNegro 1 points 4 days ago If an N-word Ns, and there’s no media to cover it or cops to arrest, is he truly even N-ing? permalink parent award report block reply Emodius 3 points 4 days ago It doesn't mean that. But we'd all love to see it. But really the handlers since that little moron is just a little foot soldier permalink parent award report block reply roadrunner0 1 points 4 days ago She had plenty of time to leave the country permalink parent award report block reply Alldayeveryday 8 points 4 days ago And still no arrests permalink award report block reply PhoneBandit 7 points 4 days ago So she's about to get suspended permalink award report block reply YodaBannon 15 points 4 days ago <book deal> permalink parent award report block reply DrVSGGEOTUSPhD 6 points 4 days ago <multi million dollar gofundme> permalink parent award report block reply YodaBannon 2 points 4 days ago <buy large mansion> permalink parent award report block reply DrVSGGEOTUSPhD 3 points 4 days ago <lavish settlement for wrongful termination> permalink parent award report block reply ChilledCovfefe 8 points 4 days ago Yes! Suspended!! Yay!  I can’t wait to read the real story in her book that will be out soon! permalink parent award report block reply Apersonofinterest 1 points 4 days ago ChatGPT is writing it as we speak. permalink parent award report block reply Nellie_the_Beaut 1 points 4 days ago With pay. While she’s housed at a military base with full security detail. permalink parent award report block reply AmericanJawa 7 points 4 days ago The Jan 6 Pipebomb job was an inside job. Change my mind. permalink award report block reply JoinTheDiscussion 1 points 4 days ago Of course it was and Bongino was all over it before they forced, I mean nominated him for a Trump cabinet position.. Just to keep him close and silenced permalink parent award report block reply DictumFactum 2 points 4 days ago Yes, this is why he wanted to jump ship early on. They got to him. permalink parent award report block reply jrkanig 7 points 4 days ago Cool. Now we just have to wait for someone, anyone , to do something, anything, about it. permalink award report block reply Strzok 1 points 4 days ago I'm sure we won't need to wait more than 14 days this time! permalink parent award report block reply 603taco 7 points 4 days ago Death penalty permalink award report block reply roadrunner0 3 points 4 days ago For her bosses that set this up permalink parent award report block reply BrewSwillis 6 points 4 days ago Wow, she was the first witness, for the prosecution, in one of the first J6 show trials. What a coincidence: After opening statements, the prosecution's first witness to testify was Shauni Kerkhoff, who was working with the Civil Disturbance Unit of the U.S. Capitol Police during the riot. The crowd was \"angry and violent\" and extended \"as far as I could see,\" she testified. \"They were calling us 'traitors.' \" The prosecution played a recording of Kerkhoff calling for backup over the radio. Kerkhoff described her own voice on the recording as \"panicked.\" Kerkhoff said she recognized Reffitt from that crowd on Jan. 6, and described how he ascended a stairway outside the Capitol building backed by the mob. She testified that Reffitt appeared to be \"leading the crowd up.\" Kerkhoff said officers used pepper balls and multiple cans of \"OC spray\" — commonly known as pepper spray — to try to repel Reffitt's advances. Eventually, Kerkhoff testified, Reffitt was hit with enough spray that he turned back and tried to flush out his eyes with a water bottle. Other rioters, however, pushed past the police line, and would breach the building itself. Nestler, the prosecutor, asked Kerkhoff about whether she considered using her firearm, which she had on her during the riot. \"I assumed that people in this crowd were armed,\" Kerkhoff responded, and said she was reluctant to use her own firearm because it could lead to a \"shootout,\" killing multiple people. Kerkhoff did testify that she did not see any indication that Reffitt was armed, though she said she did not have a view of his right hip, where his holster allegedly was. permalink award report block reply hoodar 6 points 4 days ago It's a dyke? No way. permalink award report block reply Apersonofinterest 6 points 4 days ago Member the 5 Capitol Police officers that all committed suicide in the weeks after J6? Also, pretty convenient that Brian Sicknick randomly died from a stroke a day after J6 and then they used his death to fabricate a story that Trump supporters killed him with a fire extinguisher. There was a lot going on behind the scenes with Nancy Pelosi and her private Capitol Police force. No wonder she didn’t want the National Guard there. She was running an Op. permalink award report block reply bananaguard62 3 points 4 days ago This is literally the last post, but you might be on to something. If CP were involved in setting the trap, they would have needed to prevent leaks. They need to find how close each of the deceased officers were to the conspirators. We know this goes all the way to the top permalink parent award report block reply hansgruber7 5 points 4 days ago They need to lean on this person to talk and to unravel the entire conspiracy. permalink award report block reply Psarg 5 points 4 days ago She has a limp from a soccer injury, trained officers on less than lethar weapons (they say these bombs looked like training bombs), and another Capitol police officer \"found\" the bomb. permalink award report block reply UnknownUserName 5 points 4 days ago No one is going to do anything about it permalink award report block reply OrangeCatBad 5 points 4 days ago How convenient she became CIA shortly after this. permalink award report block reply SnowSnake 4 points 4 days ago The egg timer must've been from her kitchen. permalink award report block reply roadrunner0 4 points 4 days ago They weren't even functional devices, no battery and the compound was said to be like road flare and stump remover a very low yield explosive.. I also heard it was a complete dummy filled with clay and sawdust like they use for training as no lab or forensic reports were released.. If initiated it would have made a lot of smoke and noise but unless you were within a few feet there was little chance of someone being hit with shrapnel.. Most metal pipe devices either blow off a cap or the metal splits and the pipe does not break into 100 pieces.. permalink parent award report block reply Apersonofinterest 2 points 4 days ago Was it ticking when it was “found”? Seems like an important detail that has been left out of the story. permalink parent award report block reply Litecola2 4 points 4 days ago Shauni didn't kill herself. permalink award report block reply ACActual 4 points 4 days ago I remember her.  She looked like a dude.  She was shooting pepper balls and kinetic rounds at us in the West Terrace all day. Cunt permalink award report block reply KneadThePeople 4 points 4 days ago She can use my cell at the DC Jail. permalink award report block reply Whatyougotson 4 points 4 days ago Heard she works/ went to work for the cia afterwards. Lets see how this plays out permalink award report block reply canadianhere 3 points 4 days ago \"6% is reasonable doubt!\" -the officer's lawyer, probably permalink award report block reply overblod 3 points 4 days ago .....aaaaaaand, no one's arrested. permalink award report block reply Ifeargovtmorethan 3 points 4 days ago Shouldn't this be a much bigger story permalink award report block reply JoinTheDiscussion 1 points 4 days ago Bongino should be front and center permalink parent award report block reply JetJocky 3 points 4 days ago It's quite clear now. The Dems needed to stop the electoral count so the GOP couldn't raise objections about voter fraud in certain states. To do that, a LEO planted fake bombs. The counting was stopped and that was the official reason given. The LEO has ties to the FBI and CIA. This release is the beginning of breaking the entire J6 federalized operation wide open. permalink award report block reply FKH2 3 points 4 days ago When does she get arrested permalink award report block reply Thesteelerfan181 1 points 4 days ago When they find actual evidence… permalink parent award report block reply FKH2 3 points 4 days ago So never permalink parent award report block reply Thesteelerfan181 1 points 4 days ago Basically, this is a cold case now permalink parent award report block reply BrewSwillis 2 points 4 days ago So, is the \"investigation\" over yet? Can we bring all of these Deep State™ psychos back in to testify, about how they all knew it was fake, because they were all in on it. And then maybe some arrests afterwards?? permalink award report block reply ShotgunParade69x 2 points 4 days ago So what’s gonna happen now? Shouldn’t the the AG have what she needs to take down the ppl that coordinated j6? permalink award report block reply mykillk 2 points 4 days ago Gait analysis is legit. Studies have shown it can be even more accurate than facial recognition. permalink award report block reply Kavantar 2 points 4 days ago Well geee, I wonder.... \"Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency\" permalink award report block reply Bogey 2 points 4 days ago I recall immediately after posters here and in the rightwing sphere people pointing out the gait looked like a white butch woman. permalink award report block reply Zacktopia33 2 points 4 days ago Now that we know who she is, we'll need every bit of data on the operation. Hope nothing unfortunate happens to her. Black site if needed. Every microscopic spec. All of it. permalink award report block reply Psarg 2 points 4 days ago The Daily Kos says she's MAGA and did this to draw resources away from the Capitol. permalink award report block reply barefootozark 2 points 4 days ago There is no way she did this without the planning of several agencies.  She has no criminal past.  She isn't some rogue bomb builder.  She had a civilian Air Force worker drive her there. John Ratcliffe needs to root her out of her protected CIA position and make her available to explain who employed her to do this. permalink award report block reply JoinTheDiscussion 2 points 4 days ago Nancy... permalink parent award report block reply Pepe_longcockings 1 points 4 days ago Any doubt of this person being the perpetrator is eliminated when you consider the fact that they got hired by the CIA.  Obviously a reward for the pipe bomb permalink award report block reply Nanteen 1 points 4 days ago 2 MOAR WEEKS permalink award report block reply wintervagina 1 points 4 days ago I don't saying often, but this bitch has a really stupid looking face permalink award report block reply Kolob64 1 points 4 days ago Shocked, shocked! permalink award report block reply HoganP 1 points 4 days ago Wasn't there something really early on about the bomber's vehicle having air force plates or something? permalink award report block reply Jnicolet4431 1 points 4 days ago That woman didn't commit suicide permalink award report block reply AppalachianTactical 1 points 4 days ago Her house is under protecrion not surveillance. permalink award report block reply JoinTheDiscussion 1 points 4 days ago 2 more weeks till an arrest... ARREST SOME PEOPLE YOU COWARDLY FUCKS!!!!! permalink award report block reply SanityGumby 0 points 4 days ago Several people have been arrested you dumb cunt permalink parent award report block reply JoinTheDiscussion 0 points 4 days ago I'm not talking about grandma in the rotunda permalink parent award report block reply Zacktopia33 1 points 4 days ago AI hasn't fully caught up yet.\nQ: Is Shauni Kerkhoff in custody yet?\nA: \"Shauni Kerkhoff is a former U.S. Capitol Police officer known for her testimony regarding the January 6, 2021, Capitol riot, where she used pepper balls in an attempt to control a rioter. She has also been recognized as a talented goalkeeper in women's soccer during her athletic career.\" permalink award report block reply spinometer2 1 points 4 days ago the conspiracy is ongoing, the statute of limitations clock hasn't even started permalink award report block reply redditadminssuckit 1 points 4 days ago CIA ...left the department in mid-2021 for a security detail at the Central Intelligence Agency, ...\" permalink award report block reply AgnesDomini 1 points 4 days ago Is she a lezzie? Because she looks like a woketard... permalink award report block reply DenturesNancy 1 points 4 days ago not caught, just revealed.  Lessons learned:  if you're out and about, try to walk with lump and make a deformed face when entering building or paying for shit permalink award report block reply ckover9000 1 points 4 days ago HEY GUISE!!! This technology that identifies you by the way you walk is awesome that it caught the J6 bomber! It totally won't be used against you to identify you from a video of you holding a sign at a Trump rally, will it? No way that can happen. permalink award report block reply bananaguard62 2 points 4 days ago Putting rocks in your shoes will change your gait enough to fool them. Better yet,  strap ducks to your feet. No way they'd find you permalink parent award report block reply Steve56775 1 points 4 days ago Nothing will happen because Bondi is in on too. permalink award report block reply Liberalism_is_mental 1 points 4 days ago Do something already.  This shit is getting old.  A news outlet shouldn't be releasing this when our team is in charge of the DOJ and FBI.  Where the hell is the MAGA cabinet team? permalink award report block reply Patriot_Dave 0 points 4 days ago Oh the blaze, riding Infowars coats tails again. Still love when Glenn lost his minds and cheeto faced himself. permalink award report block reply Mortal_Wombat 0 points 4 days ago That guy is a massive faggot. Probably a pedo too. permalink parent award report block reply Givesgunstogrannies 3 points 4 days ago But without him, who would raise money for individually packaged meals to the millions of 100 year old holocaust survivors in Israel?  They also need some help rebuilding, because a few launched hot water heaters made it throught the Iron Dome.  🤣 permalink parent award report block reply Retardloserimsogay 4 points 4 days ago And and Glenn is so reliable he will take care of these 100 year old Holocaust survivors well into their 130's permalink parent award report block reply Thesteelerfan181 0 points 4 days ago Forensic match of walking pattern lol permalink award report block reply Pats5x 0 points 4 days ago You actually think Patel, Bondi, Bongino will do a fucking thing?  They're all useless permalink award report block reply lul_cheto 0 points 4 days ago Some retard miga boomer solved the case? Patel is an embarrassment permalink award report block reply solo25 2 points 4 days ago Comment removed upon the user being banned. permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nguywholikesDjtof2024 116 points 4 days ago Trump keeps taking away democrat talking points. Hopefully Trump will move swiftly to take away \"Doomer\" (lol) talking points with as much fervor, if not more! This bomber being caught is a great beginning of such. permalink award report block reply emorphia 76 points 4 days ago i want him to take away the filibuster and pass the MAGA agenda. permalink parent award report block reply NowTheyAllLose 27 points 4 days ago They already said “take away doomer talking points.” Why you got be redundant? 😅 permalink parent award report block reply War_Hamster 21 points 4 days ago That’s not up to Trump and there’s 20+ Republican Senators who won’t do it. Ain’t gonna happen. Focus on exposing the rot and corruption so maybe we can get honest politicians and then we can get the MAGA agenda. permalink parent award report block reply guywholikesDjtof2024 15 points 4 days ago Arrest the corrupt pooliticians. \"but muh optics\" The dems keep getting in wins without having optics. Imagine how much more we could accomplish if we didn't let optics behave like a yoke the Dems shackled to us!!!! permalink parent award report block reply PhilipeNegro 6 points 4 days ago Because Republicans never want to actually govern, only raise money and hold office. permalink parent award report block reply MAGARondonmonson 1 points 4 days ago Every Senator who is fir the Filibuster should be replaced. The Deep Stste UNI PARTY use this rule to do their will and not the will of the people who voted them in. Why can't we get a Balanced Budget Amendment ? Psstt, the Uni Party do not want one. Now the RINOs have an excuse, we do not have 60 votes. LOL. Its a built in excuse why they never have to pass anything they do not really want, they can just blame Dems, and the other side does the same thing when they are in power. Also, both sides when they are the Minority Party, can GET GRAFT by saying deal with us, give us this, this and this or we can't get to 60 votes for you. One last point, they say this was done way back 75-100 years ago in order to create Bipartisanship amongst the parties. Well, it has had just the opposite affect and I can prove that. If there was a 50 vote rule which represents we the people, as it should be, the Dems would be in these back rooms trying to get the best deal they could get, WORKING with the Majority party. The Filibuster is the worst, most evil rule ever put forth, it deprives us the Majority from ever having a say as the Majority. It is complete BS. permalink parent award report block reply AmericanJawa 5 points 4 days ago i want him to take away the filibuster and pass the MAGA agenda. I want him to get to those mass federal firings and then do that. permalink parent award report block reply AndanteAndante 4 points 4 days ago They don’t have enough votes. We have traitors in Congress. permalink parent award report block reply Made_in_America 4 points 4 days ago Yeah I give way less of a shit about being able to point the finger at low level swamp cronies and more about permanently ending their corrupt bs with legislation. permalink parent award report block reply load 1 more comments... bearhugprolapse 31 points 4 days ago he won’t. and the bomber isn’t “caught,” she’s merely revealed. spare us the pageantry of victory until at least a bare minimum of punishment has been served. permalink parent award report block reply snoopy3210 11 points 4 days ago This is the biggest : well, well well…  in history and you complain about it! Are you for the Fed agitators that broke the windows and framed Trump supporters as “insurrectionists”, you little piece of shit? permalink parent award report block reply bearhugprolapse 21 points 4 days ago lighten up, francis. i’m not complaining about it. i am a student of history—i’ve come to know for a while this is the circus act we’re subject to. you tell me when we last saw some substantial law enforcement go our way. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago I agree. That's why we should put the pedal to the metal. If this TDSer remains free for one whole month, and Trump complies with the TDS judges, then I'll believe this. permalink parent award report block reply view 3 more comments... snoopy3210 1 points 4 days ago Okay i looked up at the blaze and this is bullshit. The kyle seraphin stuff is always bullshit. So nobody will get arrested because it’s not the right person. You have to look at who is pushing it. But since Seraphin is former FBI that means the FBI is clearly involved in trying to disrupt the investigation as they’re also involved in J6 permalink parent award report block reply Cacciali_Via 18 points 4 days ago It has been known since before Trump took office that investigators knew the identity of the individual and that there was a cover up taking place. Bongino talked about it on his show endlessly. Kash has been in office for over 8 months and this lesbian cia terrorist has still not been perp walked. This means that either the coverup continues, or she is part of a greater investigation that Kash is not willing to yet reveal. In other words, two more weeks... permalink parent award report block reply roadrunner0 10 points 4 days ago Of course they knew it was a CIA operative.. The person used their phone right in front of a camera out of being a useful idiot or deliberately so they could be caught.. When I heard that cell data for the capitol was \"unavailable\" at the time of the incident I knew that they were in coverup mode since D.C. has massive digital spying going on separately by numerous agencies.. I am actually kind of surprised she and the others haven't had \"accidents\" to erase them from being lose ends.. permalink parent award report block reply Repentnow 1 points 4 days ago Bongino & Kash were clickfluencers. They didn't have any 'inside' information. They were both full of shit. permalink parent award report block reply view 2 more comments... bigfatnagger 6 points 4 days ago Hey take it easy man. We're on the same side. Knock off the friendly fire permalink parent award report block reply RYTHMICRIOT 2 points 4 days ago Then why is the Trump DOJ currently stating that this report is \"false\"? https://x.com/EdMartinDOJ/status/1986992472611012910?t=p8L2r9y-0OaYJ3maVfc_Uw&s=19 permalink parent award report block reply SanityGumby 1 points 4 days ago That’s why I’ve been saying pump the brakes because the lawsuit will be enormous if this isn’t the right person permalink parent award report block reply Emodius 0 points 4 days ago Exactly God he must be fun at parties permalink parent award report block reply bearhugprolapse 1 points 4 days ago i don’t bring politics to parties. permalink parent award report block reply view 12 more comments... guywholikesDjtof2024 -2 points 4 days ago why the mention of God? is there anything you are uncomfortable with? permalink parent award report block reply load 1 more comments... ianpatrick1966 11 points 4 days ago exactly the hopium is so high. we know who shot babbit too, but nothing was ever done about it! So what, this bitch has been \"revealed\" NOTHING WILL HAPPEN (and we have lots of evidence to confirm this) permalink parent award report block reply guywholikesDjtof2024 8 points 4 days ago I heard many on here blackpilling, using the pipebomber, specifically , as a blackpill. Least obvious goalpost shifting. \"grrr Trump doing nothing about pipebomber\" \"noo not like that\" Also, reveal happens prior to action. If we want action, we must motivate and push Trump himself to do something. Don't expect him to know absolutely everything. Go on Truth Social. permalink parent award report block reply bearhugprolapse 5 points 4 days ago if trump needs us to motivate him to move on the pipe bomber then he doesn’t need to be in office. permalink parent award report block reply roadrunner0 1 points 4 days ago Just maybe the President needs us to start making big noise about all the uncovered corruption and treason by parts of our own government to physically show that we as US citizens of the Constitutional Republic are mad as hell and aren't going to take it anymore.. I am ready for some MAGA protests............... permalink parent award report block reply view 5 more comments... guywholikesDjtof2024 0 points 4 days ago Or that could've come after dealing with our relationships with countries. Is the pipe bomber: Threatening our economy Getting thousands + of people killed in wars Resulting in our jobs being sent overseas Containing rare earth minerals that China could snatch ???? I'm no hopium huffer, but yet I see likely reasons for why he didn't do it earlier. permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 2 points 4 days ago You mean like we motivated him about the Epstein files? permalink parent award report block reply AppalachianTactical 1 points 4 days ago I mean, if the pipebomber is capitol police then nothing qill ve done because, guess what, theyve known since before they did it. Like you guys think that they actually suddenly discover thar it was themselves. Theyd have to take her down and a large part of the capitol police.\nHow many cap police watched it and immediately recognized. Theyll have to burn her as some lone wolf or claim that it was a training exercise that got reported as real. permalink parent award report block reply Appeal2Heaven98 2 points 4 days ago I know you're getting downvoted to oblivion for this take. But how else are we supposed to feel with how things have gone for us the past few years? Everyone downvoting you must have the sunrock equivalent of hopium. permalink parent award report block reply bearhugprolapse 2 points 4 days ago aside from when i come on here to goose people, my confirmation mostly comes from downvotes. occasionally i'll get a flurry of positives but i’m not really concerned about the number. i think a lot of people just aren’t ready for the truth. permalink parent award report block reply ApprenticeParty 1 points 4 days ago They’ve covered this up pretty good and destroyed evidence intentionally. Going to be tough to get a conviction permalink parent award report block reply SanityGumby 1 points 4 days ago The cell carrier says they have all of the data and the government lied about it being corrupted permalink parent award report block reply ApprenticeParty 1 points 4 days ago Yooo let’s go then! Their official story was incredibly retarded and everyone went with it so, I’m surprised to hear that. permalink parent award report block reply load 7 more comments... MisprisionIsEvil 6 points 4 days ago Doomer talking points? Do you mean something like all of the innocent people killed by the death vaccine, and now in their graves, while those who forced it on us are still wealthy, free and protected? That? permalink parent award report block reply Appeal2Heaven98 5 points 4 days ago I'll take the crap on being a Doomer if this person gets sentenced for more than a slap on the wrist for domestic terrorism. Past history shows that might not be the case. permalink parent award report block reply king_cocoon 4 points 4 days ago To be fair, Democrats never talk about the pipe bomber because they always knew it was a fedsurrection hoax. permalink parent award report block reply load 6 more comments...\nemorphia 76 points 4 days ago i want him to take away the filibuster and pass the MAGA agenda. permalink parent award report block reply NowTheyAllLose 27 points 4 days ago They already said “take away doomer talking points.” Why you got be redundant? 😅 permalink parent award report block reply War_Hamster 21 points 4 days ago That’s not up to Trump and there’s 20+ Republican Senators who won’t do it. Ain’t gonna happen. Focus on exposing the rot and corruption so maybe we can get honest politicians and then we can get the MAGA agenda. permalink parent award report block reply guywholikesDjtof2024 15 points 4 days ago Arrest the corrupt pooliticians. \"but muh optics\" The dems keep getting in wins without having optics. Imagine how much more we could accomplish if we didn't let optics behave like a yoke the Dems shackled to us!!!! permalink parent award report block reply PhilipeNegro 6 points 4 days ago Because Republicans never want to actually govern, only raise money and hold office. permalink parent award report block reply MAGARondonmonson 1 points 4 days ago Every Senator who is fir the Filibuster should be replaced. The Deep Stste UNI PARTY use this rule to do their will and not the will of the people who voted them in. Why can't we get a Balanced Budget Amendment ? Psstt, the Uni Party do not want one. Now the RINOs have an excuse, we do not have 60 votes. LOL. Its a built in excuse why they never have to pass anything they do not really want, they can just blame Dems, and the other side does the same thing when they are in power. Also, both sides when they are the Minority Party, can GET GRAFT by saying deal with us, give us this, this and this or we can't get to 60 votes for you. One last point, they say this was done way back 75-100 years ago in order to create Bipartisanship amongst the parties. Well, it has had just the opposite affect and I can prove that. If there was a 50 vote rule which represents we the people, as it should be, the Dems would be in these back rooms trying to get the best deal they could get, WORKING with the Majority party. The Filibuster is the worst, most evil rule ever put forth, it deprives us the Majority from ever having a say as the Majority. It is complete BS. permalink parent award report block reply AmericanJawa 5 points 4 days ago i want him to take away the filibuster and pass the MAGA agenda. I want him to get to those mass federal firings and then do that. permalink parent award report block reply AndanteAndante 4 points 4 days ago They don’t have enough votes. We have traitors in Congress. permalink parent award report block reply Made_in_America 4 points 4 days ago Yeah I give way less of a shit about being able to point the finger at low level swamp cronies and more about permanently ending their corrupt bs with legislation. permalink parent award report block reply load 1 more comments...\nNowTheyAllLose 27 points 4 days ago They already said “take away doomer talking points.” Why you got be redundant? 😅 permalink parent award report block reply\nWar_Hamster 21 points 4 days ago That’s not up to Trump and there’s 20+ Republican Senators who won’t do it. Ain’t gonna happen. Focus on exposing the rot and corruption so maybe we can get honest politicians and then we can get the MAGA agenda. permalink parent award report block reply guywholikesDjtof2024 15 points 4 days ago Arrest the corrupt pooliticians. \"but muh optics\" The dems keep getting in wins without having optics. Imagine how much more we could accomplish if we didn't let optics behave like a yoke the Dems shackled to us!!!! permalink parent award report block reply PhilipeNegro 6 points 4 days ago Because Republicans never want to actually govern, only raise money and hold office. permalink parent award report block reply MAGARondonmonson 1 points 4 days ago Every Senator who is fir the Filibuster should be replaced. The Deep Stste UNI PARTY use this rule to do their will and not the will of the people who voted them in. Why can't we get a Balanced Budget Amendment ? Psstt, the Uni Party do not want one. Now the RINOs have an excuse, we do not have 60 votes. LOL. Its a built in excuse why they never have to pass anything they do not really want, they can just blame Dems, and the other side does the same thing when they are in power. Also, both sides when they are the Minority Party, can GET GRAFT by saying deal with us, give us this, this and this or we can't get to 60 votes for you. One last point, they say this was done way back 75-100 years ago in order to create Bipartisanship amongst the parties. Well, it has had just the opposite affect and I can prove that. If there was a 50 vote rule which represents we the people, as it should be, the Dems would be in these back rooms trying to get the best deal they could get, WORKING with the Majority party. The Filibuster is the worst, most evil rule ever put forth, it deprives us the Majority from ever having a say as the Majority. It is complete BS. permalink parent award report block reply\nguywholikesDjtof2024 15 points 4 days ago Arrest the corrupt pooliticians. \"but muh optics\" The dems keep getting in wins without having optics. Imagine how much more we could accomplish if we didn't let optics behave like a yoke the Dems shackled to us!!!! permalink parent award report block reply PhilipeNegro 6 points 4 days ago Because Republicans never want to actually govern, only raise money and hold office. permalink parent award report block reply\nPhilipeNegro 6 points 4 days ago Because Republicans never want to actually govern, only raise money and hold office. permalink parent award report block reply\nMAGARondonmonson 1 points 4 days ago Every Senator who is fir the Filibuster should be replaced. The Deep Stste UNI PARTY use this rule to do their will and not the will of the people who voted them in. Why can't we get a Balanced Budget Amendment ? Psstt, the Uni Party do not want one. Now the RINOs have an excuse, we do not have 60 votes. LOL. Its a built in excuse why they never have to pass anything they do not really want, they can just blame Dems, and the other side does the same thing when they are in power. Also, both sides when they are the Minority Party, can GET GRAFT by saying deal with us, give us this, this and this or we can't get to 60 votes for you. One last point, they say this was done way back 75-100 years ago in order to create Bipartisanship amongst the parties. Well, it has had just the opposite affect and I can prove that. If there was a 50 vote rule which represents we the people, as it should be, the Dems would be in these back rooms trying to get the best deal they could get, WORKING with the Majority party. The Filibuster is the worst, most evil rule ever put forth, it deprives us the Majority from ever having a say as the Majority. It is complete BS. permalink parent award report block reply\nAmericanJawa 5 points 4 days ago i want him to take away the filibuster and pass the MAGA agenda. I want him to get to those mass federal firings and then do that. permalink parent award report block reply\nAndanteAndante 4 points 4 days ago They don’t have enough votes. We have traitors in Congress. permalink parent award report block reply\nMade_in_America 4 points 4 days ago Yeah I give way less of a shit about being able to point the finger at low level swamp cronies and more about permanently ending their corrupt bs with legislation. permalink parent award report block reply\nbearhugprolapse 31 points 4 days ago he won’t. and the bomber isn’t “caught,” she’s merely revealed. spare us the pageantry of victory until at least a bare minimum of punishment has been served. permalink parent award report block reply snoopy3210 11 points 4 days ago This is the biggest : well, well well…  in history and you complain about it! Are you for the Fed agitators that broke the windows and framed Trump supporters as “insurrectionists”, you little piece of shit? permalink parent award report block reply bearhugprolapse 21 points 4 days ago lighten up, francis. i’m not complaining about it. i am a student of history—i’ve come to know for a while this is the circus act we’re subject to. you tell me when we last saw some substantial law enforcement go our way. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago I agree. That's why we should put the pedal to the metal. If this TDSer remains free for one whole month, and Trump complies with the TDS judges, then I'll believe this. permalink parent award report block reply view 3 more comments... snoopy3210 1 points 4 days ago Okay i looked up at the blaze and this is bullshit. The kyle seraphin stuff is always bullshit. So nobody will get arrested because it’s not the right person. You have to look at who is pushing it. But since Seraphin is former FBI that means the FBI is clearly involved in trying to disrupt the investigation as they’re also involved in J6 permalink parent award report block reply Cacciali_Via 18 points 4 days ago It has been known since before Trump took office that investigators knew the identity of the individual and that there was a cover up taking place. Bongino talked about it on his show endlessly. Kash has been in office for over 8 months and this lesbian cia terrorist has still not been perp walked. This means that either the coverup continues, or she is part of a greater investigation that Kash is not willing to yet reveal. In other words, two more weeks... permalink parent award report block reply roadrunner0 10 points 4 days ago Of course they knew it was a CIA operative.. The person used their phone right in front of a camera out of being a useful idiot or deliberately so they could be caught.. When I heard that cell data for the capitol was \"unavailable\" at the time of the incident I knew that they were in coverup mode since D.C. has massive digital spying going on separately by numerous agencies.. I am actually kind of surprised she and the others haven't had \"accidents\" to erase them from being lose ends.. permalink parent award report block reply Repentnow 1 points 4 days ago Bongino & Kash were clickfluencers. They didn't have any 'inside' information. They were both full of shit. permalink parent award report block reply view 2 more comments... bigfatnagger 6 points 4 days ago Hey take it easy man. We're on the same side. Knock off the friendly fire permalink parent award report block reply RYTHMICRIOT 2 points 4 days ago Then why is the Trump DOJ currently stating that this report is \"false\"? https://x.com/EdMartinDOJ/status/1986992472611012910?t=p8L2r9y-0OaYJ3maVfc_Uw&s=19 permalink parent award report block reply SanityGumby 1 points 4 days ago That’s why I’ve been saying pump the brakes because the lawsuit will be enormous if this isn’t the right person permalink parent award report block reply Emodius 0 points 4 days ago Exactly God he must be fun at parties permalink parent award report block reply bearhugprolapse 1 points 4 days ago i don’t bring politics to parties. permalink parent award report block reply view 12 more comments... guywholikesDjtof2024 -2 points 4 days ago why the mention of God? is there anything you are uncomfortable with? permalink parent award report block reply load 1 more comments... ianpatrick1966 11 points 4 days ago exactly the hopium is so high. we know who shot babbit too, but nothing was ever done about it! So what, this bitch has been \"revealed\" NOTHING WILL HAPPEN (and we have lots of evidence to confirm this) permalink parent award report block reply guywholikesDjtof2024 8 points 4 days ago I heard many on here blackpilling, using the pipebomber, specifically , as a blackpill. Least obvious goalpost shifting. \"grrr Trump doing nothing about pipebomber\" \"noo not like that\" Also, reveal happens prior to action. If we want action, we must motivate and push Trump himself to do something. Don't expect him to know absolutely everything. Go on Truth Social. permalink parent award report block reply bearhugprolapse 5 points 4 days ago if trump needs us to motivate him to move on the pipe bomber then he doesn’t need to be in office. permalink parent award report block reply roadrunner0 1 points 4 days ago Just maybe the President needs us to start making big noise about all the uncovered corruption and treason by parts of our own government to physically show that we as US citizens of the Constitutional Republic are mad as hell and aren't going to take it anymore.. I am ready for some MAGA protests............... permalink parent award report block reply view 5 more comments... guywholikesDjtof2024 0 points 4 days ago Or that could've come after dealing with our relationships with countries. Is the pipe bomber: Threatening our economy Getting thousands + of people killed in wars Resulting in our jobs being sent overseas Containing rare earth minerals that China could snatch ???? I'm no hopium huffer, but yet I see likely reasons for why he didn't do it earlier. permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 2 points 4 days ago You mean like we motivated him about the Epstein files? permalink parent award report block reply AppalachianTactical 1 points 4 days ago I mean, if the pipebomber is capitol police then nothing qill ve done because, guess what, theyve known since before they did it. Like you guys think that they actually suddenly discover thar it was themselves. Theyd have to take her down and a large part of the capitol police.\nHow many cap police watched it and immediately recognized. Theyll have to burn her as some lone wolf or claim that it was a training exercise that got reported as real. permalink parent award report block reply Appeal2Heaven98 2 points 4 days ago I know you're getting downvoted to oblivion for this take. But how else are we supposed to feel with how things have gone for us the past few years? Everyone downvoting you must have the sunrock equivalent of hopium. permalink parent award report block reply bearhugprolapse 2 points 4 days ago aside from when i come on here to goose people, my confirmation mostly comes from downvotes. occasionally i'll get a flurry of positives but i’m not really concerned about the number. i think a lot of people just aren’t ready for the truth. permalink parent award report block reply ApprenticeParty 1 points 4 days ago They’ve covered this up pretty good and destroyed evidence intentionally. Going to be tough to get a conviction permalink parent award report block reply SanityGumby 1 points 4 days ago The cell carrier says they have all of the data and the government lied about it being corrupted permalink parent award report block reply ApprenticeParty 1 points 4 days ago Yooo let’s go then! Their official story was incredibly retarded and everyone went with it so, I’m surprised to hear that. permalink parent award report block reply load 7 more comments...\nsnoopy3210 11 points 4 days ago This is the biggest : well, well well…  in history and you complain about it! Are you for the Fed agitators that broke the windows and framed Trump supporters as “insurrectionists”, you little piece of shit? permalink parent award report block reply bearhugprolapse 21 points 4 days ago lighten up, francis. i’m not complaining about it. i am a student of history—i’ve come to know for a while this is the circus act we’re subject to. you tell me when we last saw some substantial law enforcement go our way. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago I agree. That's why we should put the pedal to the metal. If this TDSer remains free for one whole month, and Trump complies with the TDS judges, then I'll believe this. permalink parent award report block reply view 3 more comments... snoopy3210 1 points 4 days ago Okay i looked up at the blaze and this is bullshit. The kyle seraphin stuff is always bullshit. So nobody will get arrested because it’s not the right person. You have to look at who is pushing it. But since Seraphin is former FBI that means the FBI is clearly involved in trying to disrupt the investigation as they’re also involved in J6 permalink parent award report block reply Cacciali_Via 18 points 4 days ago It has been known since before Trump took office that investigators knew the identity of the individual and that there was a cover up taking place. Bongino talked about it on his show endlessly. Kash has been in office for over 8 months and this lesbian cia terrorist has still not been perp walked. This means that either the coverup continues, or she is part of a greater investigation that Kash is not willing to yet reveal. In other words, two more weeks... permalink parent award report block reply roadrunner0 10 points 4 days ago Of course they knew it was a CIA operative.. The person used their phone right in front of a camera out of being a useful idiot or deliberately so they could be caught.. When I heard that cell data for the capitol was \"unavailable\" at the time of the incident I knew that they were in coverup mode since D.C. has massive digital spying going on separately by numerous agencies.. I am actually kind of surprised she and the others haven't had \"accidents\" to erase them from being lose ends.. permalink parent award report block reply Repentnow 1 points 4 days ago Bongino & Kash were clickfluencers. They didn't have any 'inside' information. They were both full of shit. permalink parent award report block reply view 2 more comments... bigfatnagger 6 points 4 days ago Hey take it easy man. We're on the same side. Knock off the friendly fire permalink parent award report block reply RYTHMICRIOT 2 points 4 days ago Then why is the Trump DOJ currently stating that this report is \"false\"? https://x.com/EdMartinDOJ/status/1986992472611012910?t=p8L2r9y-0OaYJ3maVfc_Uw&s=19 permalink parent award report block reply SanityGumby 1 points 4 days ago That’s why I’ve been saying pump the brakes because the lawsuit will be enormous if this isn’t the right person permalink parent award report block reply Emodius 0 points 4 days ago Exactly God he must be fun at parties permalink parent award report block reply bearhugprolapse 1 points 4 days ago i don’t bring politics to parties. permalink parent award report block reply view 12 more comments... guywholikesDjtof2024 -2 points 4 days ago why the mention of God? is there anything you are uncomfortable with? permalink parent award report block reply load 1 more comments...\nbearhugprolapse 21 points 4 days ago lighten up, francis. i’m not complaining about it. i am a student of history—i’ve come to know for a while this is the circus act we’re subject to. you tell me when we last saw some substantial law enforcement go our way. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago I agree. That's why we should put the pedal to the metal. If this TDSer remains free for one whole month, and Trump complies with the TDS judges, then I'll believe this. permalink parent award report block reply view 3 more comments... snoopy3210 1 points 4 days ago Okay i looked up at the blaze and this is bullshit. The kyle seraphin stuff is always bullshit. So nobody will get arrested because it’s not the right person. You have to look at who is pushing it. But since Seraphin is former FBI that means the FBI is clearly involved in trying to disrupt the investigation as they’re also involved in J6 permalink parent award report block reply\nguywholikesDjtof2024 3 points 4 days ago I agree. That's why we should put the pedal to the metal. If this TDSer remains free for one whole month, and Trump complies with the TDS judges, then I'll believe this. permalink parent award report block reply view 3 more comments...\nsnoopy3210 1 points 4 days ago Okay i looked up at the blaze and this is bullshit. The kyle seraphin stuff is always bullshit. So nobody will get arrested because it’s not the right person. You have to look at who is pushing it. But since Seraphin is former FBI that means the FBI is clearly involved in trying to disrupt the investigation as they’re also involved in J6 permalink parent award report block reply\nCacciali_Via 18 points 4 days ago It has been known since before Trump took office that investigators knew the identity of the individual and that there was a cover up taking place. Bongino talked about it on his show endlessly. Kash has been in office for over 8 months and this lesbian cia terrorist has still not been perp walked. This means that either the coverup continues, or she is part of a greater investigation that Kash is not willing to yet reveal. In other words, two more weeks... permalink parent award report block reply roadrunner0 10 points 4 days ago Of course they knew it was a CIA operative.. The person used their phone right in front of a camera out of being a useful idiot or deliberately so they could be caught.. When I heard that cell data for the capitol was \"unavailable\" at the time of the incident I knew that they were in coverup mode since D.C. has massive digital spying going on separately by numerous agencies.. I am actually kind of surprised she and the others haven't had \"accidents\" to erase them from being lose ends.. permalink parent award report block reply Repentnow 1 points 4 days ago Bongino & Kash were clickfluencers. They didn't have any 'inside' information. They were both full of shit. permalink parent award report block reply view 2 more comments...\nroadrunner0 10 points 4 days ago Of course they knew it was a CIA operative.. The person used their phone right in front of a camera out of being a useful idiot or deliberately so they could be caught.. When I heard that cell data for the capitol was \"unavailable\" at the time of the incident I knew that they were in coverup mode since D.C. has massive digital spying going on separately by numerous agencies.. I am actually kind of surprised she and the others haven't had \"accidents\" to erase them from being lose ends.. permalink parent award report block reply\nRepentnow 1 points 4 days ago Bongino & Kash were clickfluencers. They didn't have any 'inside' information. They were both full of shit. permalink parent award report block reply view 2 more comments...\nbigfatnagger 6 points 4 days ago Hey take it easy man. We're on the same side. Knock off the friendly fire permalink parent award report block reply\nRYTHMICRIOT 2 points 4 days ago Then why is the Trump DOJ currently stating that this report is \"false\"? https://x.com/EdMartinDOJ/status/1986992472611012910?t=p8L2r9y-0OaYJ3maVfc_Uw&s=19 permalink parent award report block reply SanityGumby 1 points 4 days ago That’s why I’ve been saying pump the brakes because the lawsuit will be enormous if this isn’t the right person permalink parent award report block reply\nSanityGumby 1 points 4 days ago That’s why I’ve been saying pump the brakes because the lawsuit will be enormous if this isn’t the right person permalink parent award report block reply\nEmodius 0 points 4 days ago Exactly God he must be fun at parties permalink parent award report block reply bearhugprolapse 1 points 4 days ago i don’t bring politics to parties. permalink parent award report block reply view 12 more comments... guywholikesDjtof2024 -2 points 4 days ago why the mention of God? is there anything you are uncomfortable with? permalink parent award report block reply\nbearhugprolapse 1 points 4 days ago i don’t bring politics to parties. permalink parent award report block reply view 12 more comments...\nguywholikesDjtof2024 -2 points 4 days ago why the mention of God? is there anything you are uncomfortable with? permalink parent award report block reply\nianpatrick1966 11 points 4 days ago exactly the hopium is so high. we know who shot babbit too, but nothing was ever done about it! So what, this bitch has been \"revealed\" NOTHING WILL HAPPEN (and we have lots of evidence to confirm this) permalink parent award report block reply\nguywholikesDjtof2024 8 points 4 days ago I heard many on here blackpilling, using the pipebomber, specifically , as a blackpill. Least obvious goalpost shifting. \"grrr Trump doing nothing about pipebomber\" \"noo not like that\" Also, reveal happens prior to action. If we want action, we must motivate and push Trump himself to do something. Don't expect him to know absolutely everything. Go on Truth Social. permalink parent award report block reply bearhugprolapse 5 points 4 days ago if trump needs us to motivate him to move on the pipe bomber then he doesn’t need to be in office. permalink parent award report block reply roadrunner0 1 points 4 days ago Just maybe the President needs us to start making big noise about all the uncovered corruption and treason by parts of our own government to physically show that we as US citizens of the Constitutional Republic are mad as hell and aren't going to take it anymore.. I am ready for some MAGA protests............... permalink parent award report block reply view 5 more comments... guywholikesDjtof2024 0 points 4 days ago Or that could've come after dealing with our relationships with countries. Is the pipe bomber: Threatening our economy Getting thousands + of people killed in wars Resulting in our jobs being sent overseas Containing rare earth minerals that China could snatch ???? I'm no hopium huffer, but yet I see likely reasons for why he didn't do it earlier. permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 2 points 4 days ago You mean like we motivated him about the Epstein files? permalink parent award report block reply AppalachianTactical 1 points 4 days ago I mean, if the pipebomber is capitol police then nothing qill ve done because, guess what, theyve known since before they did it. Like you guys think that they actually suddenly discover thar it was themselves. Theyd have to take her down and a large part of the capitol police.\nHow many cap police watched it and immediately recognized. Theyll have to burn her as some lone wolf or claim that it was a training exercise that got reported as real. permalink parent award report block reply\nbearhugprolapse 5 points 4 days ago if trump needs us to motivate him to move on the pipe bomber then he doesn’t need to be in office. permalink parent award report block reply roadrunner0 1 points 4 days ago Just maybe the President needs us to start making big noise about all the uncovered corruption and treason by parts of our own government to physically show that we as US citizens of the Constitutional Republic are mad as hell and aren't going to take it anymore.. I am ready for some MAGA protests............... permalink parent award report block reply view 5 more comments... guywholikesDjtof2024 0 points 4 days ago Or that could've come after dealing with our relationships with countries. Is the pipe bomber: Threatening our economy Getting thousands + of people killed in wars Resulting in our jobs being sent overseas Containing rare earth minerals that China could snatch ???? I'm no hopium huffer, but yet I see likely reasons for why he didn't do it earlier. permalink parent award report block reply view 1 more comments...\nroadrunner0 1 points 4 days ago Just maybe the President needs us to start making big noise about all the uncovered corruption and treason by parts of our own government to physically show that we as US citizens of the Constitutional Republic are mad as hell and aren't going to take it anymore.. I am ready for some MAGA protests............... permalink parent award report block reply view 5 more comments...\nguywholikesDjtof2024 0 points 4 days ago Or that could've come after dealing with our relationships with countries. Is the pipe bomber: Threatening our economy Getting thousands + of people killed in wars Resulting in our jobs being sent overseas Containing rare earth minerals that China could snatch ???? I'm no hopium huffer, but yet I see likely reasons for why he didn't do it earlier. permalink parent award report block reply view 1 more comments...\nConfusedAngryArmed 2 points 4 days ago You mean like we motivated him about the Epstein files? permalink parent award report block reply\nAppalachianTactical 1 points 4 days ago I mean, if the pipebomber is capitol police then nothing qill ve done because, guess what, theyve known since before they did it. Like you guys think that they actually suddenly discover thar it was themselves. Theyd have to take her down and a large part of the capitol police.\nHow many cap police watched it and immediately recognized. Theyll have to burn her as some lone wolf or claim that it was a training exercise that got reported as real. permalink parent award report block reply\nAppeal2Heaven98 2 points 4 days ago I know you're getting downvoted to oblivion for this take. But how else are we supposed to feel with how things have gone for us the past few years? Everyone downvoting you must have the sunrock equivalent of hopium. permalink parent award report block reply bearhugprolapse 2 points 4 days ago aside from when i come on here to goose people, my confirmation mostly comes from downvotes. occasionally i'll get a flurry of positives but i’m not really concerned about the number. i think a lot of people just aren’t ready for the truth. permalink parent award report block reply\nbearhugprolapse 2 points 4 days ago aside from when i come on here to goose people, my confirmation mostly comes from downvotes. occasionally i'll get a flurry of positives but i’m not really concerned about the number. i think a lot of people just aren’t ready for the truth. permalink parent award report block reply\nApprenticeParty 1 points 4 days ago They’ve covered this up pretty good and destroyed evidence intentionally. Going to be tough to get a conviction permalink parent award report block reply SanityGumby 1 points 4 days ago The cell carrier says they have all of the data and the government lied about it being corrupted permalink parent award report block reply ApprenticeParty 1 points 4 days ago Yooo let’s go then! Their official story was incredibly retarded and everyone went with it so, I’m surprised to hear that. permalink parent award report block reply\nSanityGumby 1 points 4 days ago The cell carrier says they have all of the data and the government lied about it being corrupted permalink parent award report block reply ApprenticeParty 1 points 4 days ago Yooo let’s go then! Their official story was incredibly retarded and everyone went with it so, I’m surprised to hear that. permalink parent award report block reply\nApprenticeParty 1 points 4 days ago Yooo let’s go then! Their official story was incredibly retarded and everyone went with it so, I’m surprised to hear that. permalink parent award report block reply\nMisprisionIsEvil 6 points 4 days ago Doomer talking points? Do you mean something like all of the innocent people killed by the death vaccine, and now in their graves, while those who forced it on us are still wealthy, free and protected? That? permalink parent award report block reply\nAppeal2Heaven98 5 points 4 days ago I'll take the crap on being a Doomer if this person gets sentenced for more than a slap on the wrist for domestic terrorism. Past history shows that might not be the case. permalink parent award report block reply\nking_cocoon 4 points 4 days ago To be fair, Democrats never talk about the pipe bomber because they always knew it was a fedsurrection hoax. permalink parent award report block reply\nTrump454748 90 points 4 days ago Gee golly whillikers, it’s beginning to look like January 6th was just a giant fed operation and not an iNsUrReCtloN. permalink award report block reply MAGAguitar 33 points 4 days ago An insurrection against the SITTING president at the time - Trump permalink parent award report block reply PosterIsDead 21 points 4 days ago J6 Committee is equal in blame. permalink parent award report block reply bananaguard62 8 points 4 days ago They created the narrative that Trump and his followers were evil and should not be allowed in polite society. That was the goal. I lost friends, family, and work, for peacefully walking through the Rotunda thanks to the trap that was set and the story they told. J6ers deserve compensation. permalink parent award report block reply bigdickhangsright 3 points 4 days ago A siting president ROBBED of his reelection. That's some third world shit right there. permalink parent award report block reply SlowBurningRage 1 points 4 days ago How about an arrest and conviction for a change? permalink parent award report block reply TheTelltaleFly 1 points 4 days ago I’ll settle for disbanding the fbi permalink parent award report block reply BoberFett 10 points 4 days ago Trump doesn't have three years to dismantle the treason machine. He has one year. Democrats will continue to stonewall their way into midterm victories then Trump will be impeached again. Also, none of6 these DC demons can be convicted, DC juries will acquit every one. Trump needs to take drastic measures. Everyone needs to realize what time it is. permalink parent award report block reply Appeal2Heaven98 6 points 4 days ago Conspiracy theorists are being proven right. Again. permalink parent award report block reply Shitsbrokeyo 2 points 4 days ago So she had a pair of rare air Jordan's?\n\"Among women, Black women number 538 and White women number 170\" So a  woman, who beats the odds for dc police employment, woman of that build, height, obvious knowledge of criminal law and the risks, that is white, wearer of rare air jordans and knows someone in the inner loop of j6 planning?\nWas asked to play this federal terrorist crime role. ..and yet was intelligent enough to go get a job with the CIA said yes.  Got it. permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago It literally does not matter anymore. Unless people are perp walked, convicted, and a giant spectacle is made of it on every single news station, it absolutely does not matter. J6 and the ensuing cover up has served its purpose in poisoning the cultural zeitgeist. Unless you do the above, the idiots that believe it was an insurrection will not change their mind, and even then you'll still have idiots that will believe it was an insurrection. This has always been used as ammo to demonize the MAGA movement, and it has worked brilliantly. permalink parent award report block reply load 1 more comments...\nMAGAguitar 33 points 4 days ago An insurrection against the SITTING president at the time - Trump permalink parent award report block reply PosterIsDead 21 points 4 days ago J6 Committee is equal in blame. permalink parent award report block reply bananaguard62 8 points 4 days ago They created the narrative that Trump and his followers were evil and should not be allowed in polite society. That was the goal. I lost friends, family, and work, for peacefully walking through the Rotunda thanks to the trap that was set and the story they told. J6ers deserve compensation. permalink parent award report block reply bigdickhangsright 3 points 4 days ago A siting president ROBBED of his reelection. That's some third world shit right there. permalink parent award report block reply SlowBurningRage 1 points 4 days ago How about an arrest and conviction for a change? permalink parent award report block reply TheTelltaleFly 1 points 4 days ago I’ll settle for disbanding the fbi permalink parent award report block reply\nPosterIsDead 21 points 4 days ago J6 Committee is equal in blame. permalink parent award report block reply bananaguard62 8 points 4 days ago They created the narrative that Trump and his followers were evil and should not be allowed in polite society. That was the goal. I lost friends, family, and work, for peacefully walking through the Rotunda thanks to the trap that was set and the story they told. J6ers deserve compensation. permalink parent award report block reply\nbananaguard62 8 points 4 days ago They created the narrative that Trump and his followers were evil and should not be allowed in polite society. That was the goal. I lost friends, family, and work, for peacefully walking through the Rotunda thanks to the trap that was set and the story they told. J6ers deserve compensation. permalink parent award report block reply\nbigdickhangsright 3 points 4 days ago A siting president ROBBED of his reelection. That's some third world shit right there. permalink parent award report block reply\nSlowBurningRage 1 points 4 days ago How about an arrest and conviction for a change? permalink parent award report block reply TheTelltaleFly 1 points 4 days ago I’ll settle for disbanding the fbi permalink parent award report block reply\nTheTelltaleFly 1 points 4 days ago I’ll settle for disbanding the fbi permalink parent award report block reply\nBoberFett 10 points 4 days ago Trump doesn't have three years to dismantle the treason machine. He has one year. Democrats will continue to stonewall their way into midterm victories then Trump will be impeached again. Also, none of6 these DC demons can be convicted, DC juries will acquit every one. Trump needs to take drastic measures. Everyone needs to realize what time it is. permalink parent award report block reply\nAppeal2Heaven98 6 points 4 days ago Conspiracy theorists are being proven right. Again. permalink parent award report block reply\nShitsbrokeyo 2 points 4 days ago So she had a pair of rare air Jordan's?\n\"Among women, Black women number 538 and White women number 170\" So a  woman, who beats the odds for dc police employment, woman of that build, height, obvious knowledge of criminal law and the risks, that is white, wearer of rare air jordans and knows someone in the inner loop of j6 planning?\nWas asked to play this federal terrorist crime role. ..and yet was intelligent enough to go get a job with the CIA said yes.  Got it. permalink parent award report block reply\nConfusedAngryArmed 1 points 4 days ago It literally does not matter anymore. Unless people are perp walked, convicted, and a giant spectacle is made of it on every single news station, it absolutely does not matter. J6 and the ensuing cover up has served its purpose in poisoning the cultural zeitgeist. Unless you do the above, the idiots that believe it was an insurrection will not change their mind, and even then you'll still have idiots that will believe it was an insurrection. This has always been used as ammo to demonize the MAGA movement, and it has worked brilliantly. permalink parent award report block reply\nemorphia 64 points 4 days ago so fedboys to throw a flashbang and rile up the crowd to enter the capitol, another fed planting a bomb to blame MAGA. and antifa's dressed in MAGA gear to commit felonies to get the blame on the crowd.   entire J6 was staged.  and as usual, no arrests or punishment for the ones that planned it.  only the low hanging fruits will get busted. and nothing changes.   damn frustrating. permalink award report block reply jaeger 57 points 4 days ago The bomb is what cancelled the proceedings with 3mins to spare and changed the rules to allow the steal later that day. permalink parent award report block reply Emodius 29 points 4 days ago Great job pointing that out. That was a key event permalink parent award report block reply TheTelltaleFly 24 points 4 days ago And the FBI identified the bomber within days of Jan 6 AND CALLED THE WHOLE THING OFF and then proceeded to obstruct justice in the subsequent 4 years. How about we get Kash to do what he said he was going to do all along and DISBAND THE FBI. Fire everyone and bulldoze the entire city block. I’m done with it. We do not need a federal police force. permalink parent award report block reply roadrunner0 7 points 4 days ago The big brother of the FBI which happens to be the C-I-A seems to be deep into all of this and they can with a quick phone call shut down FBI investigations or coordinate with them to stage evidence and frame people.. How about we start by burning them down first since they traffic massive amounts of drugs, start wars to cover for this and seem to never be held to account?? permalink parent award report block reply view 3 more comments... NomadicKrow2 0 points 4 days ago The President can disband the FBI with the stroke of a pen. The FBI's existence is purely within the president's power. permalink parent award report block reply view 1 more comments... DownTheBurg 2 points 4 days ago Exactly permalink parent award report block reply PapaWheelie 1 points 4 days ago What rules changed? permalink parent award report block reply jaeger 1 points 4 days ago In the certification process, they used \"emergency\" rules and got to skip any challenges to the stolen election when they reconvened. permalink parent award report block reply PapaWheelie 1 points 4 days ago I'm not sure that's right.  I think they picked up where they left off with the challenges.  They did PA and then the others backed off due to lack of support. permalink parent award report block reply view 8 more comments... snoopy3210 12 points 4 days ago Nah I see a great RICO case in formation. permalink parent award report block reply DRKMSTR 3 points 4 days ago Just like occupy & the tea party patriots. Can't ever have a political movement that bridges the left-right divide. The sad thing is so many people fell for it, enough to make a spectacle out of it for decades to come. J6 was a resounding success because of dumb people in the crowd. permalink parent award report block reply UnknownUserName 2 points 4 days ago Wtf is trump doing about any of this? permalink parent award report block reply FlyCatcher94 2 points 4 days ago I think the FBI is probably doing an ok job, but they are under blondi who is absolutely slow walking until trump is gone. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago you mean like freeing the J6ers and exposing a perp? permalink parent award report block reply bananaguard62 1 points 4 days ago Did he expose anyone.  Seems like Steve baker did. permalink parent award report block reply load 6 more comments...\njaeger 57 points 4 days ago The bomb is what cancelled the proceedings with 3mins to spare and changed the rules to allow the steal later that day. permalink parent award report block reply Emodius 29 points 4 days ago Great job pointing that out. That was a key event permalink parent award report block reply TheTelltaleFly 24 points 4 days ago And the FBI identified the bomber within days of Jan 6 AND CALLED THE WHOLE THING OFF and then proceeded to obstruct justice in the subsequent 4 years. How about we get Kash to do what he said he was going to do all along and DISBAND THE FBI. Fire everyone and bulldoze the entire city block. I’m done with it. We do not need a federal police force. permalink parent award report block reply roadrunner0 7 points 4 days ago The big brother of the FBI which happens to be the C-I-A seems to be deep into all of this and they can with a quick phone call shut down FBI investigations or coordinate with them to stage evidence and frame people.. How about we start by burning them down first since they traffic massive amounts of drugs, start wars to cover for this and seem to never be held to account?? permalink parent award report block reply view 3 more comments... NomadicKrow2 0 points 4 days ago The President can disband the FBI with the stroke of a pen. The FBI's existence is purely within the president's power. permalink parent award report block reply view 1 more comments... DownTheBurg 2 points 4 days ago Exactly permalink parent award report block reply PapaWheelie 1 points 4 days ago What rules changed? permalink parent award report block reply jaeger 1 points 4 days ago In the certification process, they used \"emergency\" rules and got to skip any challenges to the stolen election when they reconvened. permalink parent award report block reply PapaWheelie 1 points 4 days ago I'm not sure that's right.  I think they picked up where they left off with the challenges.  They did PA and then the others backed off due to lack of support. permalink parent award report block reply view 8 more comments...\nEmodius 29 points 4 days ago Great job pointing that out. That was a key event permalink parent award report block reply TheTelltaleFly 24 points 4 days ago And the FBI identified the bomber within days of Jan 6 AND CALLED THE WHOLE THING OFF and then proceeded to obstruct justice in the subsequent 4 years. How about we get Kash to do what he said he was going to do all along and DISBAND THE FBI. Fire everyone and bulldoze the entire city block. I’m done with it. We do not need a federal police force. permalink parent award report block reply roadrunner0 7 points 4 days ago The big brother of the FBI which happens to be the C-I-A seems to be deep into all of this and they can with a quick phone call shut down FBI investigations or coordinate with them to stage evidence and frame people.. How about we start by burning them down first since they traffic massive amounts of drugs, start wars to cover for this and seem to never be held to account?? permalink parent award report block reply view 3 more comments... NomadicKrow2 0 points 4 days ago The President can disband the FBI with the stroke of a pen. The FBI's existence is purely within the president's power. permalink parent award report block reply view 1 more comments...\nTheTelltaleFly 24 points 4 days ago And the FBI identified the bomber within days of Jan 6 AND CALLED THE WHOLE THING OFF and then proceeded to obstruct justice in the subsequent 4 years. How about we get Kash to do what he said he was going to do all along and DISBAND THE FBI. Fire everyone and bulldoze the entire city block. I’m done with it. We do not need a federal police force. permalink parent award report block reply roadrunner0 7 points 4 days ago The big brother of the FBI which happens to be the C-I-A seems to be deep into all of this and they can with a quick phone call shut down FBI investigations or coordinate with them to stage evidence and frame people.. How about we start by burning them down first since they traffic massive amounts of drugs, start wars to cover for this and seem to never be held to account?? permalink parent award report block reply view 3 more comments... NomadicKrow2 0 points 4 days ago The President can disband the FBI with the stroke of a pen. The FBI's existence is purely within the president's power. permalink parent award report block reply view 1 more comments...\nroadrunner0 7 points 4 days ago The big brother of the FBI which happens to be the C-I-A seems to be deep into all of this and they can with a quick phone call shut down FBI investigations or coordinate with them to stage evidence and frame people.. How about we start by burning them down first since they traffic massive amounts of drugs, start wars to cover for this and seem to never be held to account?? permalink parent award report block reply view 3 more comments...\nNomadicKrow2 0 points 4 days ago The President can disband the FBI with the stroke of a pen. The FBI's existence is purely within the president's power. permalink parent award report block reply view 1 more comments...\nDownTheBurg 2 points 4 days ago Exactly permalink parent award report block reply\nPapaWheelie 1 points 4 days ago What rules changed? permalink parent award report block reply jaeger 1 points 4 days ago In the certification process, they used \"emergency\" rules and got to skip any challenges to the stolen election when they reconvened. permalink parent award report block reply PapaWheelie 1 points 4 days ago I'm not sure that's right.  I think they picked up where they left off with the challenges.  They did PA and then the others backed off due to lack of support. permalink parent award report block reply view 8 more comments...\njaeger 1 points 4 days ago In the certification process, they used \"emergency\" rules and got to skip any challenges to the stolen election when they reconvened. permalink parent award report block reply PapaWheelie 1 points 4 days ago I'm not sure that's right.  I think they picked up where they left off with the challenges.  They did PA and then the others backed off due to lack of support. permalink parent award report block reply view 8 more comments...\nPapaWheelie 1 points 4 days ago I'm not sure that's right.  I think they picked up where they left off with the challenges.  They did PA and then the others backed off due to lack of support. permalink parent award report block reply view 8 more comments...\nsnoopy3210 12 points 4 days ago Nah I see a great RICO case in formation. permalink parent award report block reply\nDRKMSTR 3 points 4 days ago Just like occupy & the tea party patriots. Can't ever have a political movement that bridges the left-right divide. The sad thing is so many people fell for it, enough to make a spectacle out of it for decades to come. J6 was a resounding success because of dumb people in the crowd. permalink parent award report block reply\nUnknownUserName 2 points 4 days ago Wtf is trump doing about any of this? permalink parent award report block reply FlyCatcher94 2 points 4 days ago I think the FBI is probably doing an ok job, but they are under blondi who is absolutely slow walking until trump is gone. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago you mean like freeing the J6ers and exposing a perp? permalink parent award report block reply bananaguard62 1 points 4 days ago Did he expose anyone.  Seems like Steve baker did. permalink parent award report block reply\nFlyCatcher94 2 points 4 days ago I think the FBI is probably doing an ok job, but they are under blondi who is absolutely slow walking until trump is gone. permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago you mean like freeing the J6ers and exposing a perp? permalink parent award report block reply bananaguard62 1 points 4 days ago Did he expose anyone.  Seems like Steve baker did. permalink parent award report block reply\nbananaguard62 1 points 4 days ago Did he expose anyone.  Seems like Steve baker did. permalink parent award report block reply\ndeltaforcestrike 32 points 4 days ago After reading the article, this is reminiscent of the Pipes bursting, \"Miraculously\" on election eve November 3, 2020 permalink award report block reply Shitsbrokeyo 3 points 4 days ago she had a pair of rare air Jordan's? \"Among women, Black women number 538 and White women number 170\" So a woman, who beats the odds for dc police employment, woman of that build, height, obvious knowledge of criminal law and the risks, that is white, wearer of rare air jordans and knows someone in the inner loop of j6 planning? Was asked to play this federal terrorist crime role. ..and yet was intelligent enough to go get a job with the CIA said yes and wasnt killed to hide it. Got it. permalink parent award report block reply\nShitsbrokeyo 3 points 4 days ago she had a pair of rare air Jordan's? \"Among women, Black women number 538 and White women number 170\" So a woman, who beats the odds for dc police employment, woman of that build, height, obvious knowledge of criminal law and the risks, that is white, wearer of rare air jordans and knows someone in the inner loop of j6 planning? Was asked to play this federal terrorist crime role. ..and yet was intelligent enough to go get a job with the CIA said yes and wasnt killed to hide it. Got it. permalink parent award report block reply\nLordfred1993 26 points 4 days ago And then went and joined the CIA...hahaha. permalink award report block reply brainphreeze 13 points 4 days ago Rewarded permalink parent award report block reply roadrunner0 8 points 4 days ago Recruited to be a useful idiot permalink parent award report block reply\nbrainphreeze 13 points 4 days ago Rewarded permalink parent award report block reply\nroadrunner0 8 points 4 days ago Recruited to be a useful idiot permalink parent award report block reply\nOG_BACONndEGGs 23 points 4 days ago Hang the dyke permalink award report block reply roadrunner0 10 points 4 days ago She like the others in the team that did this were amateurs and thus useful idiots.. It is the people at the top like Brennen, Clapper, Pelosi and others that need hung by the neck until dead on the South lawn of the White House after a quick military trial.. permalink parent award report block reply PatriotSkorzeny 5 points 4 days ago Fuck no dude. “Plant this bomb.” is a pretty specific you have to want to willingly do it act. Someone??? told the police officer to plant a bomb and she said yes. She has qualified immunity. 🤷🏼‍♂️ permalink parent award report block reply roadrunner0 1 points 4 days ago There is no immunity for TREASON permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago It wasn't real it was a fed training device. permalink parent award report block reply NomadicKrow2 1 points 4 days ago You don't have qualified immunity for shit like that dude. permalink parent award report block reply PhilipeNegro 2 points 4 days ago Exactly the opposite. Leftism requires an upward pressure from below - anyone can sit in the big chair and read a script. How you actually fight it is taking out the base, making those who may be willing to act think twice about it, and removing that upward pressure. That’s why it always took a right-wing junta to properly end communism - you have to make merely supporting it a physical risk. permalink parent award report block reply OG_BACONndEGGs 1 points 4 days ago They all top to bottom idc if you were a useful idiot. permalink parent award report block reply corporateshizer -1 points 4 days ago People died in the January 6th Massacre and the subsequent federal persecutions of American patriots. Thousands of lives ruined directly, and all Americans were harmed indirectly. The conspiring parties all need to be charged and judged accordingly, with death as the main sentence. permalink parent award report block reply Whatyougotson 2 points 4 days ago Massacre? No. permalink parent award report block reply corporateshizer 0 points 4 days ago What happened here? https://images.wsj.net/im-282310/?width=780&size=1.5 permalink parent award report block reply view 2 more comments...\nroadrunner0 10 points 4 days ago She like the others in the team that did this were amateurs and thus useful idiots.. It is the people at the top like Brennen, Clapper, Pelosi and others that need hung by the neck until dead on the South lawn of the White House after a quick military trial.. permalink parent award report block reply PatriotSkorzeny 5 points 4 days ago Fuck no dude. “Plant this bomb.” is a pretty specific you have to want to willingly do it act. Someone??? told the police officer to plant a bomb and she said yes. She has qualified immunity. 🤷🏼‍♂️ permalink parent award report block reply roadrunner0 1 points 4 days ago There is no immunity for TREASON permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago It wasn't real it was a fed training device. permalink parent award report block reply NomadicKrow2 1 points 4 days ago You don't have qualified immunity for shit like that dude. permalink parent award report block reply PhilipeNegro 2 points 4 days ago Exactly the opposite. Leftism requires an upward pressure from below - anyone can sit in the big chair and read a script. How you actually fight it is taking out the base, making those who may be willing to act think twice about it, and removing that upward pressure. That’s why it always took a right-wing junta to properly end communism - you have to make merely supporting it a physical risk. permalink parent award report block reply OG_BACONndEGGs 1 points 4 days ago They all top to bottom idc if you were a useful idiot. permalink parent award report block reply corporateshizer -1 points 4 days ago People died in the January 6th Massacre and the subsequent federal persecutions of American patriots. Thousands of lives ruined directly, and all Americans were harmed indirectly. The conspiring parties all need to be charged and judged accordingly, with death as the main sentence. permalink parent award report block reply Whatyougotson 2 points 4 days ago Massacre? No. permalink parent award report block reply corporateshizer 0 points 4 days ago What happened here? https://images.wsj.net/im-282310/?width=780&size=1.5 permalink parent award report block reply view 2 more comments...\nPatriotSkorzeny 5 points 4 days ago Fuck no dude. “Plant this bomb.” is a pretty specific you have to want to willingly do it act. Someone??? told the police officer to plant a bomb and she said yes. She has qualified immunity. 🤷🏼‍♂️ permalink parent award report block reply roadrunner0 1 points 4 days ago There is no immunity for TREASON permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago It wasn't real it was a fed training device. permalink parent award report block reply NomadicKrow2 1 points 4 days ago You don't have qualified immunity for shit like that dude. permalink parent award report block reply\nroadrunner0 1 points 4 days ago There is no immunity for TREASON permalink parent award report block reply\nTrumpAndGodWin 1 points 4 days ago It wasn't real it was a fed training device. permalink parent award report block reply\nNomadicKrow2 1 points 4 days ago You don't have qualified immunity for shit like that dude. permalink parent award report block reply\nPhilipeNegro 2 points 4 days ago Exactly the opposite. Leftism requires an upward pressure from below - anyone can sit in the big chair and read a script. How you actually fight it is taking out the base, making those who may be willing to act think twice about it, and removing that upward pressure. That’s why it always took a right-wing junta to properly end communism - you have to make merely supporting it a physical risk. permalink parent award report block reply\nOG_BACONndEGGs 1 points 4 days ago They all top to bottom idc if you were a useful idiot. permalink parent award report block reply\ncorporateshizer -1 points 4 days ago People died in the January 6th Massacre and the subsequent federal persecutions of American patriots. Thousands of lives ruined directly, and all Americans were harmed indirectly. The conspiring parties all need to be charged and judged accordingly, with death as the main sentence. permalink parent award report block reply Whatyougotson 2 points 4 days ago Massacre? No. permalink parent award report block reply corporateshizer 0 points 4 days ago What happened here? https://images.wsj.net/im-282310/?width=780&size=1.5 permalink parent award report block reply view 2 more comments...\nWhatyougotson 2 points 4 days ago Massacre? No. permalink parent award report block reply corporateshizer 0 points 4 days ago What happened here? https://images.wsj.net/im-282310/?width=780&size=1.5 permalink parent award report block reply view 2 more comments...\ncorporateshizer 0 points 4 days ago What happened here? https://images.wsj.net/im-282310/?width=780&size=1.5 permalink parent award report block reply view 2 more comments...\nOlivaireBandaloo 16 points 4 days ago Bow give her the same treatment the J6res were given.  Jail, financial ruin, destruction of family. permalink award report block reply roadrunner0 4 points 4 days ago It is the people that gave the orders to do this act of treason I want to see tarred, feathered and drug behind a Humvee tied to a fence rail on their way to be hung by the neck on the South lawn of the White House.. permalink parent award report block reply\nroadrunner0 4 points 4 days ago It is the people that gave the orders to do this act of treason I want to see tarred, feathered and drug behind a Humvee tied to a fence rail on their way to be hung by the neck on the South lawn of the White House.. permalink parent award report block reply\nPatriotSkorzeny 12 points 4 days ago Caught means in handcuffs. Handcuffs? permalink award report block reply ianpatrick1966 12 points 4 days ago Just like the cop that shot Babbit. Oh wait did you say commendations?  Because thats what HE got for murdering a patriot. permalink parent award report block reply FlyCatcher94 1 points 4 days ago Just a matter of time before biology takes over and he’s arrested for battery, drugs or any number of things. permalink parent award report block reply PhilipeNegro 1 points 4 days ago If an N-word Ns, and there’s no media to cover it or cops to arrest, is he truly even N-ing? permalink parent award report block reply Emodius 3 points 4 days ago It doesn't mean that. But we'd all love to see it. But really the handlers since that little moron is just a little foot soldier permalink parent award report block reply roadrunner0 1 points 4 days ago She had plenty of time to leave the country permalink parent award report block reply\nianpatrick1966 12 points 4 days ago Just like the cop that shot Babbit. Oh wait did you say commendations?  Because thats what HE got for murdering a patriot. permalink parent award report block reply FlyCatcher94 1 points 4 days ago Just a matter of time before biology takes over and he’s arrested for battery, drugs or any number of things. permalink parent award report block reply PhilipeNegro 1 points 4 days ago If an N-word Ns, and there’s no media to cover it or cops to arrest, is he truly even N-ing? permalink parent award report block reply\nFlyCatcher94 1 points 4 days ago Just a matter of time before biology takes over and he’s arrested for battery, drugs or any number of things. permalink parent award report block reply PhilipeNegro 1 points 4 days ago If an N-word Ns, and there’s no media to cover it or cops to arrest, is he truly even N-ing? permalink parent award report block reply\nPhilipeNegro 1 points 4 days ago If an N-word Ns, and there’s no media to cover it or cops to arrest, is he truly even N-ing? permalink parent award report block reply\nEmodius 3 points 4 days ago It doesn't mean that. But we'd all love to see it. But really the handlers since that little moron is just a little foot soldier permalink parent award report block reply\nroadrunner0 1 points 4 days ago She had plenty of time to leave the country permalink parent award report block reply\nAlldayeveryday 8 points 4 days ago And still no arrests permalink award report block reply\nPhoneBandit 7 points 4 days ago So she's about to get suspended permalink award report block reply YodaBannon 15 points 4 days ago <book deal> permalink parent award report block reply DrVSGGEOTUSPhD 6 points 4 days ago <multi million dollar gofundme> permalink parent award report block reply YodaBannon 2 points 4 days ago <buy large mansion> permalink parent award report block reply DrVSGGEOTUSPhD 3 points 4 days ago <lavish settlement for wrongful termination> permalink parent award report block reply ChilledCovfefe 8 points 4 days ago Yes! Suspended!! Yay!  I can’t wait to read the real story in her book that will be out soon! permalink parent award report block reply Apersonofinterest 1 points 4 days ago ChatGPT is writing it as we speak. permalink parent award report block reply Nellie_the_Beaut 1 points 4 days ago With pay. While she’s housed at a military base with full security detail. permalink parent award report block reply\nYodaBannon 15 points 4 days ago <book deal> permalink parent award report block reply DrVSGGEOTUSPhD 6 points 4 days ago <multi million dollar gofundme> permalink parent award report block reply YodaBannon 2 points 4 days ago <buy large mansion> permalink parent award report block reply DrVSGGEOTUSPhD 3 points 4 days ago <lavish settlement for wrongful termination> permalink parent award report block reply\nDrVSGGEOTUSPhD 6 points 4 days ago <multi million dollar gofundme> permalink parent award report block reply YodaBannon 2 points 4 days ago <buy large mansion> permalink parent award report block reply DrVSGGEOTUSPhD 3 points 4 days ago <lavish settlement for wrongful termination> permalink parent award report block reply\nYodaBannon 2 points 4 days ago <buy large mansion> permalink parent award report block reply DrVSGGEOTUSPhD 3 points 4 days ago <lavish settlement for wrongful termination> permalink parent award report block reply\nDrVSGGEOTUSPhD 3 points 4 days ago <lavish settlement for wrongful termination> permalink parent award report block reply\nChilledCovfefe 8 points 4 days ago Yes! Suspended!! Yay!  I can’t wait to read the real story in her book that will be out soon! permalink parent award report block reply Apersonofinterest 1 points 4 days ago ChatGPT is writing it as we speak. permalink parent award report block reply\nApersonofinterest 1 points 4 days ago ChatGPT is writing it as we speak. permalink parent award report block reply\nNellie_the_Beaut 1 points 4 days ago With pay. While she’s housed at a military base with full security detail. permalink parent award report block reply\nAmericanJawa 7 points 4 days ago The Jan 6 Pipebomb job was an inside job. Change my mind. permalink award report block reply JoinTheDiscussion 1 points 4 days ago Of course it was and Bongino was all over it before they forced, I mean nominated him for a Trump cabinet position.. Just to keep him close and silenced permalink parent award report block reply DictumFactum 2 points 4 days ago Yes, this is why he wanted to jump ship early on. They got to him. permalink parent award report block reply\nJoinTheDiscussion 1 points 4 days ago Of course it was and Bongino was all over it before they forced, I mean nominated him for a Trump cabinet position.. Just to keep him close and silenced permalink parent award report block reply DictumFactum 2 points 4 days ago Yes, this is why he wanted to jump ship early on. They got to him. permalink parent award report block reply\nDictumFactum 2 points 4 days ago Yes, this is why he wanted to jump ship early on. They got to him. permalink parent award report block reply\njrkanig 7 points 4 days ago Cool. Now we just have to wait for someone, anyone , to do something, anything, about it. permalink award report block reply Strzok 1 points 4 days ago I'm sure we won't need to wait more than 14 days this time! permalink parent award report block reply\nStrzok 1 points 4 days ago I'm sure we won't need to wait more than 14 days this time! permalink parent award report block reply\n603taco 7 points 4 days ago Death penalty permalink award report block reply roadrunner0 3 points 4 days ago For her bosses that set this up permalink parent award report block reply\nroadrunner0 3 points 4 days ago For her bosses that set this up permalink parent award report block reply\nBrewSwillis 6 points 4 days ago Wow, she was the first witness, for the prosecution, in one of the first J6 show trials. What a coincidence: After opening statements, the prosecution's first witness to testify was Shauni Kerkhoff, who was working with the Civil Disturbance Unit of the U.S. Capitol Police during the riot. The crowd was \"angry and violent\" and extended \"as far as I could see,\" she testified. \"They were calling us 'traitors.' \" The prosecution played a recording of Kerkhoff calling for backup over the radio. Kerkhoff described her own voice on the recording as \"panicked.\" Kerkhoff said she recognized Reffitt from that crowd on Jan. 6, and described how he ascended a stairway outside the Capitol building backed by the mob. She testified that Reffitt appeared to be \"leading the crowd up.\" Kerkhoff said officers used pepper balls and multiple cans of \"OC spray\" — commonly known as pepper spray — to try to repel Reffitt's advances. Eventually, Kerkhoff testified, Reffitt was hit with enough spray that he turned back and tried to flush out his eyes with a water bottle. Other rioters, however, pushed past the police line, and would breach the building itself. Nestler, the prosecutor, asked Kerkhoff about whether she considered using her firearm, which she had on her during the riot. \"I assumed that people in this crowd were armed,\" Kerkhoff responded, and said she was reluctant to use her own firearm because it could lead to a \"shootout,\" killing multiple people. Kerkhoff did testify that she did not see any indication that Reffitt was armed, though she said she did not have a view of his right hip, where his holster allegedly was. permalink award report block reply\nhoodar 6 points 4 days ago It's a dyke? No way. permalink award report block reply\nApersonofinterest 6 points 4 days ago Member the 5 Capitol Police officers that all committed suicide in the weeks after J6? Also, pretty convenient that Brian Sicknick randomly died from a stroke a day after J6 and then they used his death to fabricate a story that Trump supporters killed him with a fire extinguisher. There was a lot going on behind the scenes with Nancy Pelosi and her private Capitol Police force. No wonder she didn’t want the National Guard there. She was running an Op. permalink award report block reply bananaguard62 3 points 4 days ago This is literally the last post, but you might be on to something. If CP were involved in setting the trap, they would have needed to prevent leaks. They need to find how close each of the deceased officers were to the conspirators. We know this goes all the way to the top permalink parent award report block reply\nbananaguard62 3 points 4 days ago This is literally the last post, but you might be on to something. If CP were involved in setting the trap, they would have needed to prevent leaks. They need to find how close each of the deceased officers were to the conspirators. We know this goes all the way to the top permalink parent award report block reply\nhansgruber7 5 points 4 days ago They need to lean on this person to talk and to unravel the entire conspiracy. permalink award report block reply\nPsarg 5 points 4 days ago She has a limp from a soccer injury, trained officers on less than lethar weapons (they say these bombs looked like training bombs), and another Capitol police officer \"found\" the bomb. permalink award report block reply\nUnknownUserName 5 points 4 days ago No one is going to do anything about it permalink award report block reply\nOrangeCatBad 5 points 4 days ago How convenient she became CIA shortly after this. permalink award report block reply\nSnowSnake 4 points 4 days ago The egg timer must've been from her kitchen. permalink award report block reply roadrunner0 4 points 4 days ago They weren't even functional devices, no battery and the compound was said to be like road flare and stump remover a very low yield explosive.. I also heard it was a complete dummy filled with clay and sawdust like they use for training as no lab or forensic reports were released.. If initiated it would have made a lot of smoke and noise but unless you were within a few feet there was little chance of someone being hit with shrapnel.. Most metal pipe devices either blow off a cap or the metal splits and the pipe does not break into 100 pieces.. permalink parent award report block reply Apersonofinterest 2 points 4 days ago Was it ticking when it was “found”? Seems like an important detail that has been left out of the story. permalink parent award report block reply\nroadrunner0 4 points 4 days ago They weren't even functional devices, no battery and the compound was said to be like road flare and stump remover a very low yield explosive.. I also heard it was a complete dummy filled with clay and sawdust like they use for training as no lab or forensic reports were released.. If initiated it would have made a lot of smoke and noise but unless you were within a few feet there was little chance of someone being hit with shrapnel.. Most metal pipe devices either blow off a cap or the metal splits and the pipe does not break into 100 pieces.. permalink parent award report block reply\nApersonofinterest 2 points 4 days ago Was it ticking when it was “found”? Seems like an important detail that has been left out of the story. permalink parent award report block reply\nLitecola2 4 points 4 days ago Shauni didn't kill herself. permalink award report block reply\nACActual 4 points 4 days ago I remember her.  She looked like a dude.  She was shooting pepper balls and kinetic rounds at us in the West Terrace all day. Cunt permalink award report block reply\nKneadThePeople 4 points 4 days ago She can use my cell at the DC Jail. permalink award report block reply\nWhatyougotson 4 points 4 days ago Heard she works/ went to work for the cia afterwards. Lets see how this plays out permalink award report block reply\ncanadianhere 3 points 4 days ago \"6% is reasonable doubt!\" -the officer's lawyer, probably permalink award report block reply\noverblod 3 points 4 days ago .....aaaaaaand, no one's arrested. permalink award report block reply\nIfeargovtmorethan 3 points 4 days ago Shouldn't this be a much bigger story permalink award report block reply JoinTheDiscussion 1 points 4 days ago Bongino should be front and center permalink parent award report block reply\nJoinTheDiscussion 1 points 4 days ago Bongino should be front and center permalink parent award report block reply\nJetJocky 3 points 4 days ago It's quite clear now. The Dems needed to stop the electoral count so the GOP couldn't raise objections about voter fraud in certain states. To do that, a LEO planted fake bombs. The counting was stopped and that was the official reason given. The LEO has ties to the FBI and CIA. This release is the beginning of breaking the entire J6 federalized operation wide open. permalink award report block reply\nFKH2 3 points 4 days ago When does she get arrested permalink award report block reply Thesteelerfan181 1 points 4 days ago When they find actual evidence… permalink parent award report block reply FKH2 3 points 4 days ago So never permalink parent award report block reply Thesteelerfan181 1 points 4 days ago Basically, this is a cold case now permalink parent award report block reply\nThesteelerfan181 1 points 4 days ago When they find actual evidence… permalink parent award report block reply FKH2 3 points 4 days ago So never permalink parent award report block reply Thesteelerfan181 1 points 4 days ago Basically, this is a cold case now permalink parent award report block reply\nFKH2 3 points 4 days ago So never permalink parent award report block reply Thesteelerfan181 1 points 4 days ago Basically, this is a cold case now permalink parent award report block reply\nThesteelerfan181 1 points 4 days ago Basically, this is a cold case now permalink parent award report block reply\nBrewSwillis 2 points 4 days ago So, is the \"investigation\" over yet? Can we bring all of these Deep State™ psychos back in to testify, about how they all knew it was fake, because they were all in on it. And then maybe some arrests afterwards?? permalink award report block reply\nShotgunParade69x 2 points 4 days ago So what’s gonna happen now? Shouldn’t the the AG have what she needs to take down the ppl that coordinated j6? permalink award report block reply\nmykillk 2 points 4 days ago Gait analysis is legit. Studies have shown it can be even more accurate than facial recognition. permalink award report block reply\nKavantar 2 points 4 days ago Well geee, I wonder.... \"Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency\" permalink award report block reply\nBogey 2 points 4 days ago I recall immediately after posters here and in the rightwing sphere people pointing out the gait looked like a white butch woman. permalink award report block reply\nZacktopia33 2 points 4 days ago Now that we know who she is, we'll need every bit of data on the operation. Hope nothing unfortunate happens to her. Black site if needed. Every microscopic spec. All of it. permalink award report block reply\nPsarg 2 points 4 days ago The Daily Kos says she's MAGA and did this to draw resources away from the Capitol. permalink award report block reply\nbarefootozark 2 points 4 days ago There is no way she did this without the planning of several agencies.  She has no criminal past.  She isn't some rogue bomb builder.  She had a civilian Air Force worker drive her there. John Ratcliffe needs to root her out of her protected CIA position and make her available to explain who employed her to do this. permalink award report block reply JoinTheDiscussion 2 points 4 days ago Nancy... permalink parent award report block reply\nJoinTheDiscussion 2 points 4 days ago Nancy... permalink parent award report block reply\nPepe_longcockings 1 points 4 days ago Any doubt of this person being the perpetrator is eliminated when you consider the fact that they got hired by the CIA.  Obviously a reward for the pipe bomb permalink award report block reply\nNanteen 1 points 4 days ago 2 MOAR WEEKS permalink award report block reply\nwintervagina 1 points 4 days ago I don't saying often, but this bitch has a really stupid looking face permalink award report block reply\nKolob64 1 points 4 days ago Shocked, shocked! permalink award report block reply\nHoganP 1 points 4 days ago Wasn't there something really early on about the bomber's vehicle having air force plates or something? permalink award report block reply\nJnicolet4431 1 points 4 days ago That woman didn't commit suicide permalink award report block reply\nAppalachianTactical 1 points 4 days ago Her house is under protecrion not surveillance. permalink award report block reply\nJoinTheDiscussion 1 points 4 days ago 2 more weeks till an arrest... ARREST SOME PEOPLE YOU COWARDLY FUCKS!!!!! permalink award report block reply SanityGumby 0 points 4 days ago Several people have been arrested you dumb cunt permalink parent award report block reply JoinTheDiscussion 0 points 4 days ago I'm not talking about grandma in the rotunda permalink parent award report block reply\nSanityGumby 0 points 4 days ago Several people have been arrested you dumb cunt permalink parent award report block reply JoinTheDiscussion 0 points 4 days ago I'm not talking about grandma in the rotunda permalink parent award report block reply\nJoinTheDiscussion 0 points 4 days ago I'm not talking about grandma in the rotunda permalink parent award report block reply\nZacktopia33 1 points 4 days ago AI hasn't fully caught up yet.\nQ: Is Shauni Kerkhoff in custody yet?\nA: \"Shauni Kerkhoff is a former U.S. Capitol Police officer known for her testimony regarding the January 6, 2021, Capitol riot, where she used pepper balls in an attempt to control a rioter. She has also been recognized as a talented goalkeeper in women's soccer during her athletic career.\" permalink award report block reply\nspinometer2 1 points 4 days ago the conspiracy is ongoing, the statute of limitations clock hasn't even started permalink award report block reply\nredditadminssuckit 1 points 4 days ago CIA ...left the department in mid-2021 for a security detail at the Central Intelligence Agency, ...\" permalink award report block reply\nAgnesDomini 1 points 4 days ago Is she a lezzie? Because she looks like a woketard... permalink award report block reply\nDenturesNancy 1 points 4 days ago not caught, just revealed.  Lessons learned:  if you're out and about, try to walk with lump and make a deformed face when entering building or paying for shit permalink award report block reply\nckover9000 1 points 4 days ago HEY GUISE!!! This technology that identifies you by the way you walk is awesome that it caught the J6 bomber! It totally won't be used against you to identify you from a video of you holding a sign at a Trump rally, will it? No way that can happen. permalink award report block reply bananaguard62 2 points 4 days ago Putting rocks in your shoes will change your gait enough to fool them. Better yet,  strap ducks to your feet. No way they'd find you permalink parent award report block reply\nbananaguard62 2 points 4 days ago Putting rocks in your shoes will change your gait enough to fool them. Better yet,  strap ducks to your feet. No way they'd find you permalink parent award report block reply\nSteve56775 1 points 4 days ago Nothing will happen because Bondi is in on too. permalink award report block reply\nLiberalism_is_mental 1 points 4 days ago Do something already.  This shit is getting old.  A news outlet shouldn't be releasing this when our team is in charge of the DOJ and FBI.  Where the hell is the MAGA cabinet team? permalink award report block reply\nPatriot_Dave 0 points 4 days ago Oh the blaze, riding Infowars coats tails again. Still love when Glenn lost his minds and cheeto faced himself. permalink award report block reply Mortal_Wombat 0 points 4 days ago That guy is a massive faggot. Probably a pedo too. permalink parent award report block reply Givesgunstogrannies 3 points 4 days ago But without him, who would raise money for individually packaged meals to the millions of 100 year old holocaust survivors in Israel?  They also need some help rebuilding, because a few launched hot water heaters made it throught the Iron Dome.  🤣 permalink parent award report block reply Retardloserimsogay 4 points 4 days ago And and Glenn is so reliable he will take care of these 100 year old Holocaust survivors well into their 130's permalink parent award report block reply\nMortal_Wombat 0 points 4 days ago That guy is a massive faggot. Probably a pedo too. permalink parent award report block reply Givesgunstogrannies 3 points 4 days ago But without him, who would raise money for individually packaged meals to the millions of 100 year old holocaust survivors in Israel?  They also need some help rebuilding, because a few launched hot water heaters made it throught the Iron Dome.  🤣 permalink parent award report block reply Retardloserimsogay 4 points 4 days ago And and Glenn is so reliable he will take care of these 100 year old Holocaust survivors well into their 130's permalink parent award report block reply\nGivesgunstogrannies 3 points 4 days ago But without him, who would raise money for individually packaged meals to the millions of 100 year old holocaust survivors in Israel?  They also need some help rebuilding, because a few launched hot water heaters made it throught the Iron Dome.  🤣 permalink parent award report block reply Retardloserimsogay 4 points 4 days ago And and Glenn is so reliable he will take care of these 100 year old Holocaust survivors well into their 130's permalink parent award report block reply\nRetardloserimsogay 4 points 4 days ago And and Glenn is so reliable he will take care of these 100 year old Holocaust survivors well into their 130's permalink parent award report block reply\nThesteelerfan181 0 points 4 days ago Forensic match of walking pattern lol permalink award report block reply\nPats5x 0 points 4 days ago You actually think Patel, Bondi, Bongino will do a fucking thing?  They're all useless permalink award report block reply\nlul_cheto 0 points 4 days ago Some retard miga boomer solved the case? Patel is an embarrassment permalink award report block reply\nsolo25 2 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply"
}