{
  "id": "1ARK0UbctG",
  "url": "https://patriots.win/p/1ARK0UbctG/my-fellow-americans-our-movement/c",
  "content": "1541 MY FELLOW AMERICANS, OUR MOVEMENT IS FAR FROM OVER—IN FACT, OUR FIGHT HAS ONLY JUST BEGUN! TRUMP  TRUTH posted 7 days ago by I-am-Orlando PRO 311 comments award share download report block\n311 comments Sort by Top Top New Worst Old Save TheGreenDragon 240 points 7 days ago He better tell that to Kash and Pam, they didn't get the memo. permalink award report block reply Thatunknownguy 70 points 7 days ago I hate those weepy faggots so much permalink parent award report block reply McFatty7 63 points 7 days ago Right. The only thing Republicans do in power is slow down Democrats. They don't fight back and play dirty like Democrats do, which is partly why Democrats won yesterday's Governor elections. Edit: Especially when all those ICE protest videos show the protesters yelling, honking their car horns, and throwing rocks at ICE agents, with no pushback from ICE agents, that was motivation for Democrats to think they were 'winning'. permalink parent award report block reply leakmouth 45 points 7 days ago we don’t even need to play dirty. Simply charge them with their actual crimes for fuck sake permalink parent award report block reply mty_green_go 10 points 7 days ago but what about the fake news painting us as bad guys permalink parent award report block reply HeftyAdministration8 10 points 7 days ago But they might call us racist. /s Edit: Added /s to clarify sarcasm. permalink parent award report block reply view 1 more comments... Protonboy 5 points 7 days ago They'll do that irrespective of what we do, you racist! permalink parent award report block reply view 2 more comments... Than0sIII 27 points 7 days ago Yep Democrats hold Republicans to rules and standards they don't give a shit about.  That's how this game has been going for awhile now.  And of course there are \"Republicans\" within Congress/the greater bureaucracy who buddy up with Democrats to get in on the corrupt $$$. permalink parent award report block reply MathletesFoot 1 points 6 days ago Since the 60s at least. Never forget Goldwater. permalink parent award report block reply KernalMustard 8 points 7 days ago Its all a grift for everyone. If you fix shit you cant grft. Dems open the door GOP hold it open. permalink parent award report block reply ReleasetheList 2 points 7 days ago Republicans drive the speed limit towards the edge of the cliff while dems go at 100mph. permalink parent award report block reply HenkZeilstra 1 points 7 days ago Absofuckinglutely After Trump Digital ID and CBDC will be fast tracked if they have not already prepared the framework covertly permalink parent award report block reply Sgt_Hulka 1 points 6 days ago It’s ready to go. Agenda 2030.  The infrastructure is already being put in place. See UK. permalink parent award report block reply Klaus73 1 points 6 days ago Trump is dick deep into digital currency; USDC has been up for a long time. Folks are hoping AI will be a big payday and if not then all that hardware will somehow be repurposed to bitcoin. permalink parent award report block reply Andover 51 points 7 days ago Grok says this is the 11th time since 2016 that Trump said he's only just begun. permalink parent award report block reply Blndhairylegs 31 points 7 days ago He's a regular Karen Carpenter permalink parent award report block reply TDAF 7 points 7 days ago The world needs a caring carpenter. permalink parent award report block reply Cuomorbidities 5 points 7 days ago Fuckin’ underrated comment 😂 permalink parent award report block reply Fingerbang 2 points 7 days ago I lololololololololololololololololololo'd permalink parent award report block reply DrJosephWarren 1 points 7 days ago Wew lad kek permalink parent award report block reply ParmesanCartel 23 points 7 days ago It's only just begun.... 10 years later.....Epstein was a hoax stop talking about it permalink parent award report block reply Klaus73 1 points 6 days ago I wonder if people will ask when the list eventually is forced to come out while any non-democrat name is redacted... permalink parent award report block reply AyChiXuaxua 15 points 7 days ago In two weeks, you're gonna see some real shit go down! permalink parent award report block reply nakedjay 3 points 7 days ago 6 more times to go. permalink parent award report block reply Hanging_Chad 2 points 7 days ago kek permalink parent award report block reply LiterallyKaiser 8 points 7 days ago I remember people telling me to trust Sacramucci or whatever his name was all the way back in 2017. permalink parent award report block reply EgregiousPhilbin 10 points 7 days ago Every 2 years, people tell me to vote for rinos. LOL good luck with that. permalink parent award report block reply Sgt_Hulka 2 points 6 days ago Trust Sessions Trust Kansas Trust Wray Operation Trust permalink parent award report block reply MAGA9428 6 points 7 days ago If only all Republicans had Trump’s convictions and determination. permalink parent award report block reply load 7 more comments... Glory-Unto-God 115 points 7 days ago Just begun? Big if true I haven't even witnessed a starting line. permalink award report block reply uxername27 51 points 7 days ago It's the 9th time this movement has begun since 2015. permalink parent award report block reply BeauHD 27 points 7 days ago So are you dooming? Because he has done a metric fruitton since 2015. We would all be in NWO shackles if it weren't for Trump's accomplishments. permalink parent award report block reply uxername27 10 points 7 days ago No just joking. It's not the first time I heard Trump say this is only the beginning. permalink parent award report block reply BeauHD -1 points 7 days ago Oh, LoL! permalink parent award report block reply Elonmuskbedo 5 points 7 days ago Lmao okay buddy keep telling yourself that when he is the reason for the covid vax permalink parent award report block reply BeauHD 0 points 7 days ago Anaconda Bot Detected. permalink parent award report block reply view 1 more comments... lostremote- -3 points 7 days ago This site has been swarming with dooming faggots and larpers for a couple of days. permalink parent award report block reply TurdSammich 9 points 7 days ago So just keep smiling and pretending the right is doing a good job? permalink parent award report block reply KernalMustard 6 points 7 days ago Stop being a Ostrich. Get your head out the sand. permalink parent award report block reply view 1 more comments... Glory-Unto-God 4 points 7 days ago This site is swarming with ample rage just like much of this nation. If we had a leader who could harness it properly and galvanize that movement then this nation could be rid of internal enemies within the timeline of this presidency. We do not have that. Its not dooming to say trump is Paul revere and we have no Washington. Thats just a fact of the situation. permalink parent award report block reply view 2 more comments... UCantStumpTheTrump -3 points 7 days ago Look up and down this thread, it’s full of doomer shills from Reddit permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply mikejones 13 points 7 days ago There are many checks and balances in place to keep the movement from beginning when most things Trump is doing can be undone quickly. permalink parent award report block reply starjello 8 points 7 days ago will be undone quickly permalink parent award report block reply Standingoak 6 points 7 days ago A journey of a thousand miles begins with a single step. 9 you say , Time to pick up the pace over the next 11 months . permalink parent award report block reply Standingoak 10 points 7 days ago The heavy air when you know the storm is here but the thunder is not yet loud or close.  \"Just Begun\" “Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.  ― Sun Tzu, The Art of (the Deal) War permalink parent award report block reply Chickensaurus 5 points 7 days ago Yes. We've just begun fighting (for our lives). The left has been for a long time. We've taken casualties. We're all on borrowed time now. permalink parent award report block reply Metal4Freedom 3 points 7 days ago Charlie is dead and we're still playing footsies with the left. permalink parent award report block reply Chickensaurus 2 points 6 days ago Yup. permalink parent award report block reply Saltman5000 -2 points 7 days ago For real! He hasn't done shit. permalink parent award report block reply tchouk 2 points 6 days ago He's done a whole lot to appease deviant fucks like Lindsay Graham and other America-last RINOs. permalink parent award report block reply JackOfAllTirades 92 points 7 days ago He's right. However, he needs to spend less time on the middle east and more time on domestic issues for the next 12 months. permalink award report block reply sumnayin2 18 points 7 days ago Im fine with the middle east if it includes nuking the juice and dunies permalink parent award report block reply Viewer01 12 points 7 days ago Unless it’s a crusade to reclaim the holy land, I’m not buying it. permalink parent award report block reply Donger-Lord 3 points 7 days ago Pretty gay how the moderators of this site are scared and try to censor anyone calling out the jews. They ALL have to go. permalink parent award report block reply BonginosRac1stCowboy 36 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply Datamancer 16 points 7 days ago Deus Vult permalink parent award report block reply MoldyLocksNesMonste 9 points 7 days ago Good luck with that. The muslims are rapidly expanding and colonizing the west.  We can't even occupy our own lands, and here you are fapping to occupying some place halfway across the globe. permalink parent award report block reply KernalMustard -2 points 7 days ago Killing themselves over religion. Does he really think Muslims in the rest of the world would stand by and let that happen? How about the Jews. You would be fighting a 2 pronged war in not just Israel. A fucking mess that would kill us all. permalink parent award report block reply view 1 more comments... Litterboxer1 2 points 7 days ago You can't even occupy your own countries LOL permalink parent award report block reply invalid_data 13 points 7 days ago Stop traveling around the world solving shit countries wars and instead solve this countries own civil war. Instead focus on the foreign invasion in our own border. Instead focus on still how Americans are getting fucked over for pajeets. permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago We don't have 12 months. He will be turning 80 fucking years old soon. permalink parent award report block reply bumpman -1 points 7 days ago He solved the Middle East in his first 9 months, we are past that.. if anything, the Israel obsessed folks on both sides should be cheering trump permalink parent award report block reply flashersenpai 4 points 7 days ago israel killed a few hundred people in Gaza or so since the ceasefire started it should be abandoned permalink parent award report block reply bumpman 1 points 6 days ago Killing can go down 99% and the war be over and y’all will never be satisfied. Try focusing more on America and Christian’s and less on Jews and Muslims for once permalink parent award report block reply Seeker_17 -4 points 7 days ago Killing terrorists aka palestinians is a good thing. permalink parent award report block reply Porkbut -4 points 7 days ago In response to attacks on soldiers by gazans. You propagandists only ever tell part of the story. permalink parent award report block reply Memebot 42 points 7 days ago Why are people acting like losing in majority demonrats states was the end of everything? I swear I fucking hate media so obsessed with 2-3 cities. permalink award report block reply Ghostphaez 62 points 7 days ago Because just a few weeks ago people were gloating that the Democrats were done as a party - but now we see that not only are they not done, they are fired up and can very possibly win more Congressional seats in 2026 and remove Trump from office. It was a brutal wakeup call last night. permalink parent award report block reply Badfinz_FL 40 points 7 days ago in the upcomign midterms ALL house seats are up for re-election and a majority of the senate as well This is a much bigger election as it deals with districts and states.  The senate races could get interesting but the house races will fall along their historic district norms.  That favors us. If we don't fix the voting shit in this country, or we fail to play the ballot stuffing game like the demo commies, we are in for an interesting midterm election especially in the senate races as they are more a statewide type election versus districts only. permalink parent award report block reply ParmesanCartel 5 points 7 days ago Unfortunately trump has fucked any chance the Republicans had for the midterms. His Israel first bullshit and his avoidance even backtracking on his promises really soured most trump supporters I know. permalink parent award report block reply NonbinaryPotatohead 3 points 6 days ago more importantly the young voter base. They aren't having this fake bullshit anymore. The CK thing really seems like the .......Turning Point for them. permalink parent award report block reply covok48 3 points 7 days ago Stop downvoting this. You KNOW it’s true, permalink parent award report block reply B-2StealthTrump -5 points 7 days ago Bot faggot detected ☝🏻 permalink parent award report block reply view 5 more comments... Memebot 10 points 7 days ago \"Brutal\" Like I don't see a demonrat winning the states they won as a brutal wake-up call. permalink parent award report block reply DeplorableCentipede 6 points 7 days ago It’s not about the democrats winning. It’s about the margins. Trump lost Virginia and New Jersey by 5 points. The Democrat gubernatorial candidates won both by 15 points. Moreover, both of these are states that have elected Republican governors in the recent past, so they’re not deep blue states like you make them out to be. The results bode poorly for Republican prospects in more consequential elections next year. permalink parent award report block reply couranto 7 points 7 days ago Wrong. The candidates were all anti Trump anti MaGa. permalink parent award report block reply view 1 more comments... starjello 5 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans. Also smashed in PA. Q faggots down vote facts. permalink parent award report block reply Obliv1 3 points 7 days ago true, dunno if they fried their brains or really this stupid or just feds with the same \"Trust the plan\" bs always. permalink parent award report block reply view 4 more comments... NonbinaryPotatohead 2 points 6 days ago Q was a mossad Op LOL permalink parent award report block reply view 1 more comments... covok48 2 points 7 days ago Now I’m sure it was fraud, but this admin thinks it can outvote it. Retards. permalink parent award report block reply goldkeyboardwarrior 6 points 7 days ago It still takes 67 senators to remove after impeachment and that only makes Vance president if they somehow get 67 votes. As much as we would like to pretend the GOP would win Virginia, most of us knew it probably wasn’t going to flip only a year after all statewide races in Virginia went to Dems, especially since a number of people hit by mass firings and the shutdown were from NOVA. Few people here seemed to notice VA still went blue last year because Trump didn’t need them to pass 270 and Hung Cao lost to a two-term incumbent in a state that hasn’t elected a Republican to the Senate since 2002. Youngkin was in the right place at the right time with his opponent’s controversies and with Loudoun County in the news for trying to cover up the same boy raping two girls in two different schools because he wore a dress when he did it. permalink parent award report block reply covok48 1 points 7 days ago Right but you didn’t mention the AG…for a reason. permalink parent award report block reply KernalMustard 6 points 7 days ago We warned them. They didnt listen. They called us doomers. Fuck the Cultist. Wake the fuck up! permalink parent award report block reply Obliv1 5 points 7 days ago they can't... they're still waiting on the Kraken and the raids in Germany, \"trusting the plan\" haven't even realized 5 yrs have passed permalink parent award report block reply Sgt_Hulka 2 points 6 days ago Oh yes they have! Thats why you now see “5-year deltas”. Have you seen the Q-clock?  LOL permalink parent award report block reply Azill 0 points 7 days ago Everyone knew that the party wasn't done except for the retards who mindlessly follow every headline. It doesn't matter if the party has 1% approval rating, people will ALWAYS vote for the dem, ALWAYS. The only way the party is ever truly finished is when they officially dissolve. permalink parent award report block reply starjello 0 points 7 days ago Everyone knew that the party wasn't done except for the retards who mindlessly follow every headline Too many of those retards hang out here. permalink parent award report block reply Azill -1 points 7 days ago Yes they do. They have a meltdown when everything doesn't go 100% our way and doom that the world is ending. permalink parent award report block reply view 1 more comments... RedFoxOnFire 21 points 7 days ago Because now campaigning on the promise of dead conservatives is a winning strategy. permalink parent award report block reply Obliv1 5 points 7 days ago Yeah only Wiles could sell McCain as what diehard MAGA wants! permalink parent award report block reply DT170x 18 points 7 days ago I rather act like we 20 points behind all the time. Keep the people from being complacent and politically apathetic. permalink parent award report block reply KernalMustard -7 points 7 days ago Says the cultist. permalink parent award report block reply Viewer01 13 points 7 days ago Because we all witnessed the Zionist vs America first crash out with Shapiro and Levine. We all know Zionists have trumps ears and we just watched their two biggest right wing gate keepers crash out the week before the election. Then there’s the group chat leaks and the secret recordings all done by Jews to purge anyone who isn’t bowing down to them. It’s fundamentally clear they’d sooner communist America than America without Israel. Also, it’s finally clicking in a lot of people’s minds that minorities will never ever vote red and will usher in communism. So a lot of peoples world view of if we’re nice to them they’ll be nice to us has been shattered. permalink parent award report block reply Seeker_17 -6 points 7 days ago Zionists? LOL. Aru you really that dense? Nobody cares about Zionists except for  muzzies like you.Go worship your goat fucking prophet. permalink parent award report block reply Viewer01 2 points 6 days ago I’m going to worship your moms fat khazar milkers tonight rabbi. permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago Are you 60 years old or something? Are you not aware of the avalanche of the young to middle age voter base, you know, the majority of voters, that are extremely dissatisfied with how blatant Israel has been with their takeover and foreign influence recently? LOL You can watch Bibi cream his pants talking to the 7k per post influencers about his \"Esther Project\" or Trump himself admitting Miriam Adelson OWNS him and dictates his policy. That is NOT what I nor anyone else voted for. Zionist influence is the HOTTEST topic across the political sphere currently. If you don't know that, it's because you aren't using apps or seeing the content that the MAJORITY voter base is, which makes your opinion irrelevant by definition. permalink parent award report block reply eclectic22 6 points 7 days ago It's a disappointment for sure and a wake up call. No place for complacency now. permalink parent award report block reply Badfinz_FL 11 points 7 days ago the polls have been showing for months neither republican candidate in those states had a chance. Our internal polls were much worse.  I'm surprised Sears did as well as she did though. Both were terrible candidates.  Trump let the RINOs run on this one and they got smacked.  He has a plan here. permalink parent award report block reply Blndhairylegs 6 points 7 days ago 4d chess! permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago LOL Losing on purpose to catch the bigger fish I'm sure .... permalink parent award report block reply load 6 more comments... MasterChief 41 points 7 days ago Our fight for whom? Israel? Ukraine? Argentina? America First or Fuck Off permalink award report block reply breadbaker 10 points 7 days ago America First or Fuck Off permalink parent award report block reply deleted 5 points 6 days ago King6of6the6retards 3 points 6 days ago AFFO>MAGA. permalink parent award report block reply DeportThemAllForever 0 points 6 days ago Venezuela permalink parent award report block reply Bball-gurl 39 points 7 days ago What exactly are we fighting for right now, Donald?? Please tell me. permalink award report block reply KernalMustard 24 points 7 days ago Israel and the neocons. permalink parent award report block reply tchouk 5 points 6 days ago Always has been, eh? I get that Trump can't just do whatever to overrule the whole system. But at least not giving them blowjobs would be a good start. permalink parent award report block reply RIPcharlie 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply oilybohunkofshit 0 points 7 days ago Comment removed by community moderators. permalink parent award report block reply Scumbag-reddit 0 points 7 days ago ...the United States of America? Our livelihood? Way of life? Freedom? permalink parent award report block reply BudBurner 33 points 7 days ago You have yet to ignore a single judge. Who are you telling to fucking fight Don??? permalink award report block reply bumpman 9 points 7 days ago Yep, he’s playing by the rules and still racking up W’s. permalink parent award report block reply guywholikesDjtof2024 6 points 7 days ago He would rack up more if he ignores judges and chucks a bunch of baddies in jail. permalink parent award report block reply spezisacuckold 2 points 7 days ago Fox News permalink parent award report block reply Fbiisazzhoe 25 points 7 days ago Not tired of winning.. just tired of sitting idle and losing my nation to foreigners and Islamists permalink award report block reply Quiznos585 23 points 7 days ago I’m getting tired of this. permalink award report block reply Krat 22 points 7 days ago Not with 0 arrests it isnt permalink award report block reply pollsarefake -1 points 7 days ago Building cases takes time They have to be bulletproof permalink parent award report block reply justinkayz 6 points 7 days ago Tell the J6er's that permalink parent award report block reply tchouk 2 points 6 days ago Like the cases against Trump, I'm sure. permalink parent award report block reply Spawnlingman 22 points 7 days ago Why's he telling us.  Tell Pam or Kash. permalink award report block reply pollsarefake 3 points 7 days ago Kash is an H1B infiltrator. His real name is Kashyap Pramod Patel permalink parent award report block reply Sgt_Hulka 1 points 6 days ago His first name is really Kash app? permalink parent award report block reply Redpilled2Depression 19 points 7 days ago It’s been 10 years since this fight started Mr. President, and I’ve lost friendships having your back and never once wavered, but I’m starting to become fatigued and really need to see some results. permalink award report block reply seangalt 7 points 7 days ago Not me.  i didn't lose friends, i lost TRAITORS and COMMIES.  i gained Friends.  i gained Patriots!  And we, the People, Patriotic Americans are so much the better for it. MAGA permalink parent award report block reply Beelzy 4 points 7 days ago 👍 permalink parent award report block reply guywholikesDjtof2024 1 points 7 days ago You didn't lose them. They lost you. permalink parent award report block reply B-2StealthTrump -6 points 7 days ago Oh no!!!  This faggot lost some liberal friends for supporting Trump!  Fuck the country!  Abandon ship!!   STFU faggot. permalink parent award report block reply the_new_one 1 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply NadlersNads 18 points 7 days ago SO FUCKING FIGHT ALREADY permalink award report block reply MrJinxy 16 points 7 days ago Is it time?  Can we stop standing by standing down now? permalink award report block reply Metal4Freedom 3 points 7 days ago We must rise together or we will die alone. permalink parent award report block reply GoBigly 16 points 7 days ago Arrest someone then permalink award report block reply spezisacuckold 15 points 7 days ago Shut up with the platitudes and arrest Democrats and Republicans. permalink award report block reply Goozmania 12 points 7 days ago Uh... That's an odd thing to say... permalink award report block reply Nanteen 11 points 7 days ago Pennsylvania we probably had 25% turnout. God. I'm just so disgusted with my fellow Americans for not bothering. permalink award report block reply starjello 4 points 7 days ago And the democrats totally steam rolled here in PA permalink parent award report block reply Nanteen 4 points 7 days ago They didn't really steamroll. No one bothered coming out for the election just less Democrats blew off the election than Republicans. In our local area literally 20% voter turnout. That's fucking sad permalink parent award report block reply starjello 4 points 7 days ago Cannot polish a turd. It was a rout. Wait till next year. Democrats assumed more local control and will further enable voter fraud. permalink parent award report block reply B-2StealthTrump 2 points 7 days ago Ya, PA has always been pathetic at elections.  You get steamrolled by the Philly Fraud Machine every time. Get your shit in order. permalink parent award report block reply 13MMshooter 11 points 7 days ago Prove it dude.  Drain the swamp. permalink award report block reply KernalMustard 3 points 7 days ago He said that 2015.....still not drained. People lie. Demand More, Demand Action. permalink parent award report block reply Hangmhigh 8 points 7 days ago No shit. The entire western world has been invaded and globalists are building an open digital prison. Start arresting for fucks sake. permalink award report block reply CaptRied 8 points 7 days ago Fight!  Fight!  Fight! permalink award report block reply MasterVader2U 8 points 7 days ago 2 more weeks!!! Yeah! permalink award report block reply RedPillosopher1776 8 points 7 days ago Arrests or IDGAF. permalink award report block reply Another_rando 7 points 7 days ago Same words were said  2016 permalink award report block reply starjello 4 points 7 days ago Yep and then Biden came in and did actual winning for the enemy. permalink parent award report block reply eclectic22 7 points 7 days ago When the going gets tough, the tough get going! permalink award report block reply RizzlieDoodad 7 points 7 days ago I'll believe it when I see it. Congress is useless. Judges are useless permalink award report block reply I-am-Orlando OP PRO 7 points 7 days ago Link https://truthsocial.com/@realDonaldTrump/115499721335991086 permalink award report block reply HankScorpio 6 points 7 days ago Trump saved the country from 16 straight years of DNC rule with Cuntilllary winning after Nairobi Barack. Image the state of the country with the Cunt appointing 3 more DEI hires to the Supreme Court. permalink award report block reply Awakened 6 points 7 days ago If this falls apart it hits him and his family hardest. He has put everything on the line for his country. A real American hero. I pray his greatest success is yet to come. He deserves a great victory after all of his massive hard work and courage. He doesn't deserve what they've done to him and what they will do if they get the upper hand again. I hope he is ready to cross the Rubicon when the time comes. Because it is coming and he won't win this with politics as usual. permalink award report block reply oilybohunkofshit 1 points 7 days ago Comment removed by community moderators. permalink parent award report block reply MinneMAGA 6 points 7 days ago Wouldn't our fight have to actually begin for it to \"only just begun?\" permalink award report block reply Senaleb 6 points 7 days ago He needs to drop Miriam Adelson because the timing for his video on the \"Republican Jew\" conference is pretty terrible timing and feels like Adelson rolled him out like a show dog. permalink award report block reply al-phabitz89 3 points 7 days ago What video is this ? permalink parent award report block reply ReleasetheList 2 points 7 days ago Link? permalink parent award report block reply SavingPrivateGrace 6 points 7 days ago Time to begin. permalink award report block reply journalist 6 points 7 days ago Fight, Fight, Fight permalink award report block reply Covidrrhea 5 points 7 days ago Has the Supreme Court ruled on whether the president can do presidential things like set tariffs? permalink award report block reply keeptherepublic1776 5 points 7 days ago Why no time stamp? permalink award report block reply barwhack 5 points 7 days ago Yeah? Where's my list of pedos in power? permalink award report block reply Nat4Pat 5 points 7 days ago MAGA is unsustainable by heavily relying on minorities instead of building large families for white christians. permalink award report block reply mikejones 11 points 7 days ago And not many people will have the means to find a lady, get and keep a good job and raise children with good education. Need to be super smart or an executive. Then fight by running for office and hope you don't get shot in the process. permalink parent award report block reply Nat4Pat 9 points 7 days ago You know what I like about the jews? They unify, even rushing to defend one of their own pedophiles. They also have this network where none of them have trouble finding a partner or job through family and friends. So no one is left behind as a race. That's why they can dominate this civilization with less than 2% population. Organizing is definitely the most important ability as modern social unit. And that is the untapped potential for this race to exploit. permalink parent award report block reply Bigstick7 9 points 7 days ago White people are basically the only ones who aren't tribal. Every other race in general is. permalink parent award report block reply Nat4Pat 3 points 7 days ago Seems someone needs to change and I don't expect it to be the other side. permalink parent award report block reply -Evspra 3 points 7 days ago i commented something similar a while back. it's genuinely amazing how jews have been able to stick together for THOUSANDS of years like fucking glue, yet we can barely stand one another and would never willingly go out of our way for a random white person on the street. indians are similar in this regard. you hire one indian at an american company and if they get a managerial position, you'll almost never see anyone other than indians getting hired after that. permalink parent award report block reply Nat4Pat 3 points 7 days ago The conquest of the world has put us in a secured and wealthy state that deprived us of survival instinct. Meanwhile the jews' discomfort and disgrace of being rejected only toughened them. This crisis unfolding before us is the opportunity to get the that instinct back and stay united, hopefully forever. permalink parent award report block reply KernalMustard -3 points 7 days ago Fucking nonsense. You win by bringing people in not excluding people. permalink parent award report block reply BonginosRac1stCowboy 8 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply VoldemarBGuerta 5 points 7 days ago If something doesn't change - and change fast... we are going to get rocked in the mid-terms. permalink award report block reply Kumalasbreakfast99 5 points 7 days ago Let's start with bacon on every entrance to necessary stores; grocery, unemployment, snap offices, city hall etc permalink award report block reply seangalt 4 points 7 days ago Super soakers filled with pig's blood. permalink parent award report block reply guywholikesDjtof2024 0 points 7 days ago They won't know it's pig. That's the problem with all these \"pig blood\" comments. How will the muslims ever know? DUMB. permalink parent award report block reply DJT4MoreYears 4 points 7 days ago Hopium pill for the masses. Swallow it ya bigots. permalink award report block reply Bythrfruitsyknow 4 points 7 days ago You could almost attribute this post to fucking ~Q~ permalink award report block reply starjello 3 points 7 days ago Maybe the Q fags were right and Q is really Trump who has been stringing those idiots along this whole time. permalink parent award report block reply tw0scoops 4 points 7 days ago Arrests when? permalink award report block reply Stanwyk74 4 points 7 days ago Yeah yeah yeah they tried to kill you and no one even charged yet permalink award report block reply orange_kek_great 4 points 7 days ago I don't see anyone on \"our side\" fighting. permalink award report block reply geekesmind 4 points 7 days ago stop bailing out other countries FUCK THEM!  AMERICA FIRST! permalink award report block reply Prof_Smith 4 points 7 days ago I have yet to see any proof that this continues without Trump. People don’t turn out.   It just doesn’t happen. Dems can dick around till 2026 and 2028 and then we go back to weak republicans pretending to be opposition to democrats. Vance might be the only option moving forward and even he came out today and pretty much said start working on domestic issues because the country is fucked. You also need to get the entire party to stop being a bunch of bitches.  The Dems elected a guy who wanted to see republican kids dead and the republicans spend days and days apologizing for using harsh language in private chats. permalink award report block reply seangalt 1 points 7 days ago Myopia is not a virtue. permalink parent award report block reply Prof_Smith 1 points 7 days ago Neither is denial. permalink parent award report block reply Scipio_Americanus 4 points 7 days ago I thought we were going to get tired of winning, but I'm still tired of our side losing. permalink award report block reply starjello 3 points 7 days ago pretty accurate. permalink parent award report block reply jlange94 4 points 7 days ago Talk talk talk talk talk talk talk talk talk and more talk. permalink award report block reply Imnotnorm 4 points 7 days ago Oh is it starting again? It's been 8 fucking years permalink award report block reply Aggrieved03 4 points 7 days ago Fight? I don’t see any fighting just the usual swamp robbing us blind. permalink award report block reply NickL 3 points 7 days ago What movement you said you don’t need us GFY permalink award report block reply cuqu2 3 points 7 days ago the sentiment here now...holy shit tide has turned permalink award report block reply Obliv1 3 points 7 days ago is he talking about the fight to save America or the fight against Tucker Carlson for talking too much truth? permalink award report block reply bearhugprolapse 3 points 7 days ago fucking whatever dude. permalink award report block reply Cali_kid 3 points 7 days ago Hopefully Mr President permalink award report block reply NineteenEightyFour 3 points 7 days ago Is this his way of telling us that we're going to war with Iran because Bibi says so? permalink award report block reply Saltman5000 3 points 7 days ago Well I have some bad news for you Donald, you moved too slow and now your movement is completely fucked and the Democrats are going to steal the primaries and there's nothing you can do about it. Why the fuck isn't Scott Pressler leading anything? permalink award report block reply seangalt 0 points 7 days ago It's because of Doomer Faggots like you that i quit watching and listening to Salty Faggot. permalink parent award report block reply Saltman5000 1 points 6 days ago Bro Donald Trump isn't going to do anything, he isn't going to have anyone arrested, he isn't going to change politics, he's probably going to end up in prison with the rest of his family and anyone who supported him. The Democrats have literally beaten him every step of the way and there's nothing he can do cuz he doesn't have the balls to do it. permalink parent award report block reply seangalt 1 points 5 days ago Doomer, you are not my bro.  You are either a dupe of the [DS] Propaganda Machine, or a Glowie sent to sow division.  Stuff it back up your ass where that shit you spew came from. My IQ is way too high to fall for your garbage bullshit vomit crap.\nAlso, i am ex-mil, and i never quit. permalink parent award report block reply corntortilla 3 points 7 days ago Yeah? Let me know when you decide to start fighting? permalink award report block reply Seeker_17 3 points 7 days ago I don't see us winning as long as immigrants decide elections like it just happened in NYC. This is fucking unreal. We need to end immigration, and mass deportations of 3rd worlders now. permalink award report block reply mailinvoter 3 points 7 days ago Don't forget the liberal White women. They're a bigger problem than immigrants. permalink parent award report block reply Alabama_Front_Butt 3 points 7 days ago 2 weeks permalink award report block reply tuaris 3 points 7 days ago In all seriousness... CA, NJ, VA, and NYC shouldn't be a disappointing shocker. The GOP could have thrown large amounts of money at this and risk still losing.  In my opinion, the funds are best used in 2026. permalink award report block reply starjello 3 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans permalink parent award report block reply OG_BACONndEGGs 3 points 7 days ago Was the message approved by Bibi? permalink award report block reply Pats5x 3 points 7 days ago Copium permalink award report block reply jimboonie 3 points 7 days ago Oh really? Do something then. permalink award report block reply covok48 2 points 7 days ago Make our lives better. I am convinced you’re still living in 2019. permalink award report block reply Rimbus_Reynolds 2 points 7 days ago What is this in reference too permalink award report block reply starjello 1 points 7 days ago Right wing extremists.People  who took the Epstein situation seriously. permalink parent award report block reply oilybohunkofshit 0 points 7 days ago Comment removed by community moderators. permalink parent award report block reply OmegaBird 2 points 7 days ago Trump, you are turning into Obama and not doing a whole hell of a lot. The wins are tiny, sparse and yet you ride them like they are grand and epic. Demoncrats are but behind bars, the J6 are not being investigated, the epstine conspirators are not in jail, fauci has not been executed. There is very little fight in you and very little winning. permalink award report block reply moscowjade 2 points 7 days ago Getting the communists out will take generations permalink award report block reply 13Maga135 2 points 7 days ago https://x.com/EdKrassen/status/1986240225899639267 look who wants to move to new york, maybe he can live next door to madami permalink award report block reply sully 2 points 7 days ago Our fight has been beginning for 10 years now permalink award report block reply LePEDES 2 points 7 days ago So do some Washington/LINCOLN type shit… permalink award report block reply KneadThePeople 2 points 7 days ago Cool, when are you going to support your J6ers? permalink award report block reply TOPDAWG23 5 points 7 days ago He freed them what do you want. permalink parent award report block reply KneadThePeople 1 points 7 days ago I am one. Not all of us have been pardoned (some only received commutations) and exactly ZERO of us have received any accountability, justice or restitution. permalink parent award report block reply ThePatriotGames2016 2 points 7 days ago you have 3 fucking years. Better get moving. permalink award report block reply TOPDAWG23 2 points 7 days ago Just be realistic he has to admit terms till they remove him. He needs to go scorched Earth on both the Democrats and Republicans fix the shit now or just fuck off. permalink parent award report block reply Antiluminati 2 points 7 days ago Who said it’s over? What’s going on here? Are people really that black pilled over like a few stupid elections that we already knew the way they were gonna turn out. Seriously someone explain this to me. permalink award report block reply CrankyCrab 3 points 7 days ago Can't rationalize the irrational.  It's just the influx of doomers, gloomers and trolls. permalink parent award report block reply seangalt -1 points 7 days ago Doomers, Glowies, Agents Provocateur.  It's a Divide and Conquer PsyOp. God Bless MAGA and God Bless POTUS DJT permalink parent award report block reply Sammy77 2 points 7 days ago Quit sucking Israeli dick and do something about jobs and prices. Also address wages. Quit addressing shit that doesn’t benefit the everyday American. AMERICA FIRST! permalink award report block reply HenkZeilstra 2 points 7 days ago Fire Pam Bondi and Kash permalink award report block reply Surfsup 2 points 6 days ago Got the first three words in there permalink award report block reply Beardholder 2 points 6 days ago If he started actually arresting all the traitors and commies and Muslims the battle would have been over already m permalink award report block reply TrumpIsTheVictor 2 points 7 days ago Didn't he call us \"Right Wing Extremists\"? permalink award report block reply Metal4Freedom 1 points 7 days ago We are!! Proudly!!! permalink parent award report block reply TrumpIsTheVictor 1 points 6 days ago He didn't say it is a complimentary manner. permalink parent award report block reply Obliv1 2 points 7 days ago yeah i'll believe it when he fires Wiles, Rubio, Ratcliffe, Bondi, Kash, Lutnick, Bessent, and actually puts MAGA populists in power like he had with Bannon before he got butthurt he was getting too much spotlight. Or hell maybe give the finger to Ukraine and Israel? do something... anything to put America 1st as the damn president of the USA Or stop edging on new wars no one wants? Or stop using tariffs as a response to people that piss you off (Canada runs ad = tariff?) or to the benefit of globohomo (tariff india to help Ukraine?) to the point where SCOTUS might actually rule 9-0 to send that emergency power back to congress? Or stop saying the Epstein list and files are a democrat Hoax when all your people pre election said it would be epic? Or don't ignore the grocery prices and brag they are down when we all have eyes and aren't seeing much change at the stores. and double stupid to do that while building an expansion to WH to host balls and Gatsby style feasts... a let them eat cake look. Trump is a masterful marketer but damn if that dude is terrible at filling out a staff. 90% rinos and deepstate. permalink award report block reply NonbinaryPotatohead 2 points 6 days ago \"2 more weeks\" Trump stop appointing retards to key positions! Wasting years of opportunity! Start appointing your voter base instead who will get the job done without fear of the consequences! permalink award report block reply Logan051361 2 points 7 days ago What does that mean?? permalink award report block reply unotrumpcard 2 points 6 days ago People just want everything fixed instantly. Trump was only just elected and has not had the time to get the ball moving yet. permalink award report block reply Maxdady01 1 points 7 days ago ...in Burundi now?  Am i right?!? permalink award report block reply covok48 1 points 7 days ago Only Israelis love him right now. permalink award report block reply DCYR66 1 points 7 days ago Problem is our side is a party of wimps and will never have the drive of our enemies. Fuck the GOP for allowing dems to steamroll us at every turn. Say goodbye to our majority in midterms. permalink award report block reply DITTOPatriot 1 points 6 days ago LOL, a rudderless ship in a sea storm bumping into everything in sight. permalink award report block reply Thomm 1 points 7 days ago To Trump, tweets like this are “fighting” permalink award report block reply Ey3sOpen 1 points 7 days ago Oh really? Release the Epstein files then. permalink award report block reply mercynurse 1 points 7 days ago Amen permalink award report block reply DenturesNancy 1 points 7 days ago how about you tell your blondi bitch to actually start prosecuting all the commies with proven criminal acts.  all capitals messages are nothing but screams of a drowning man.  your doj is failing you and everyone is witnessing it permalink award report block reply MrMcGreenGenes 1 points 7 days ago Quit hitting ourselves. permalink award report block reply AnonymousFrog 1 points 7 days ago Well, he’s clearly trying to kill it with these clowns he appointed to the FBI acting like Epstein killed himself and didn’t really traffic anyone anyway. How about a war in Iran? Maybe Venezuela? How about Trump Gaza? Oh, and did I remind you guys of how safe and effective the Covid vaccine is? Oh, and BTW, it was Tylenol causing all the autism, totally not vaccines. What a disaster. permalink award report block reply stingyarthropods 1 points 7 days ago so he's finally going to solve the goat fucker invasion? permalink award report block reply TOPDAWG23 1 points 7 days ago This just makes it sound like Trump lost   blue people replaced blue people in blue States. permalink award report block reply DarkKnightPatriot 1 points 6 days ago Just begun? Really? Then what is the general consensus on the lead up to the beginning as stated by Trump now? It feels a little drag assey and falling way short of the basic expectations of a revolution. Seems like its all being orchestrated to have just enough punch and kick to keep real fighters and patriots from taking control of the movement. Seems like the GOP is still full of flacid geriatric fucks that are too weak to fight Radicals, Leftists and Globalist Commies and the  Patriot/Q movement is filled more with 'by the book/follow the plan' Religious Zealots, Boomer Peaceniks, and Low T Hero Worshipers than actual fighters and revolutionaries. permalink award report block reply gp7373 1 points 7 days ago \"Our fight has only just begun, again...again....... permalink award report block reply Covfefebrulee 1 points 6 days ago JUST ENFORCE THE EXISTING LAWS FFS! permalink award report block reply Opi33 1 points 7 days ago Meh. permalink award report block reply Lynnforthetruth 1 points 7 days ago Hello world\nCan someone please create a spray bottle of pigs blood that Women and girls can carry for protection permalink award report block reply birb_never_dies 1 points 7 days ago He would sound better if he said that without a Jew cock in his mouth ... permalink award report block reply Doubleu1992 0 points 7 days ago Cool but we still lose midterms permalink award report block reply josiborg 0 points 7 days ago Quit being a pussy. The only way to win someone else's game is not play it. permalink award report block reply RedwhiteblueFe 0 points 7 days ago Nick fuentes 2032 permalink award report block reply UltraMAGAMilton -1 points 7 days ago Cute  . . permalink award report block reply seangalt -3 points 7 days ago Do NO let the [DS] Infiltrator Agents Provocateur DIVIDE and CONQUER us.  They are the ones who come in here and talk all kinds of shit about Trump's Administration, about the Epstein crap, about \"the Jews,\" etc.  They do this to DIVIDE and CONQUER.  Fuck those Glowie Faggots all the way to hell. God bless the Trump Administration and God bless the United States of America and God Bless President Donald J. Trump. MAGA permalink award report block reply guywholikesDjtof2024 3 points 7 days ago You're the divider. Epstien was a legit concern. permalink parent award report block reply starjello 2 points 7 days ago Get lost Q faggot. Go back to the gay awankening you moronic cultist. You fell for a CIA psyop you glowing glowie Infiltrator. permalink parent award report block reply Mhmm2MoreWeeks -3 points 7 days ago He is mistaken. We will be divided by the Woke Right. Uniparty will cheat back into power. permalink award report block reply ChilledCovfefe 1 points 7 days ago All this jew and Epstein shit is dividing maga as planned. Keep falling for it folks. I trust Trump. He doesn’t always do things the way WE want but he gets shit done. permalink parent award report block reply guywholikesDjtof2024 1 points 7 days ago \"The E files were destroyed before Trump ever took office\" is a likely theory. Do you really believe they would let the good guys have anything? LOOOL. Admit it. All evidence was withheld from Trump and tons of it destroyed. That's why there's no arrests nor mass exposure. permalink parent award report block reply GreenLeader1 4 points 7 days ago Comment removed upon the user being banned. permalink award report block reply oilybohunkofshit 1 points 7 days ago Comment removed by community moderators. permalink award report block reply ILoveGoatFucking 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply new_guy2 1 points 7 days ago Comment removed by community moderators. permalink award report block reply oilybohunkofshit 1 points 7 days ago Comment removed by community moderators. permalink award report block reply the_new_one 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply\nTheGreenDragon 240 points 7 days ago He better tell that to Kash and Pam, they didn't get the memo. permalink award report block reply Thatunknownguy 70 points 7 days ago I hate those weepy faggots so much permalink parent award report block reply McFatty7 63 points 7 days ago Right. The only thing Republicans do in power is slow down Democrats. They don't fight back and play dirty like Democrats do, which is partly why Democrats won yesterday's Governor elections. Edit: Especially when all those ICE protest videos show the protesters yelling, honking their car horns, and throwing rocks at ICE agents, with no pushback from ICE agents, that was motivation for Democrats to think they were 'winning'. permalink parent award report block reply leakmouth 45 points 7 days ago we don’t even need to play dirty. Simply charge them with their actual crimes for fuck sake permalink parent award report block reply mty_green_go 10 points 7 days ago but what about the fake news painting us as bad guys permalink parent award report block reply HeftyAdministration8 10 points 7 days ago But they might call us racist. /s Edit: Added /s to clarify sarcasm. permalink parent award report block reply view 1 more comments... Protonboy 5 points 7 days ago They'll do that irrespective of what we do, you racist! permalink parent award report block reply view 2 more comments... Than0sIII 27 points 7 days ago Yep Democrats hold Republicans to rules and standards they don't give a shit about.  That's how this game has been going for awhile now.  And of course there are \"Republicans\" within Congress/the greater bureaucracy who buddy up with Democrats to get in on the corrupt $$$. permalink parent award report block reply MathletesFoot 1 points 6 days ago Since the 60s at least. Never forget Goldwater. permalink parent award report block reply KernalMustard 8 points 7 days ago Its all a grift for everyone. If you fix shit you cant grft. Dems open the door GOP hold it open. permalink parent award report block reply ReleasetheList 2 points 7 days ago Republicans drive the speed limit towards the edge of the cliff while dems go at 100mph. permalink parent award report block reply HenkZeilstra 1 points 7 days ago Absofuckinglutely After Trump Digital ID and CBDC will be fast tracked if they have not already prepared the framework covertly permalink parent award report block reply Sgt_Hulka 1 points 6 days ago It’s ready to go. Agenda 2030.  The infrastructure is already being put in place. See UK. permalink parent award report block reply Klaus73 1 points 6 days ago Trump is dick deep into digital currency; USDC has been up for a long time. Folks are hoping AI will be a big payday and if not then all that hardware will somehow be repurposed to bitcoin. permalink parent award report block reply Andover 51 points 7 days ago Grok says this is the 11th time since 2016 that Trump said he's only just begun. permalink parent award report block reply Blndhairylegs 31 points 7 days ago He's a regular Karen Carpenter permalink parent award report block reply TDAF 7 points 7 days ago The world needs a caring carpenter. permalink parent award report block reply Cuomorbidities 5 points 7 days ago Fuckin’ underrated comment 😂 permalink parent award report block reply Fingerbang 2 points 7 days ago I lololololololololololololololololololo'd permalink parent award report block reply DrJosephWarren 1 points 7 days ago Wew lad kek permalink parent award report block reply ParmesanCartel 23 points 7 days ago It's only just begun.... 10 years later.....Epstein was a hoax stop talking about it permalink parent award report block reply Klaus73 1 points 6 days ago I wonder if people will ask when the list eventually is forced to come out while any non-democrat name is redacted... permalink parent award report block reply AyChiXuaxua 15 points 7 days ago In two weeks, you're gonna see some real shit go down! permalink parent award report block reply nakedjay 3 points 7 days ago 6 more times to go. permalink parent award report block reply Hanging_Chad 2 points 7 days ago kek permalink parent award report block reply LiterallyKaiser 8 points 7 days ago I remember people telling me to trust Sacramucci or whatever his name was all the way back in 2017. permalink parent award report block reply EgregiousPhilbin 10 points 7 days ago Every 2 years, people tell me to vote for rinos. LOL good luck with that. permalink parent award report block reply Sgt_Hulka 2 points 6 days ago Trust Sessions Trust Kansas Trust Wray Operation Trust permalink parent award report block reply MAGA9428 6 points 7 days ago If only all Republicans had Trump’s convictions and determination. permalink parent award report block reply load 7 more comments...\nThatunknownguy 70 points 7 days ago I hate those weepy faggots so much permalink parent award report block reply\nMcFatty7 63 points 7 days ago Right. The only thing Republicans do in power is slow down Democrats. They don't fight back and play dirty like Democrats do, which is partly why Democrats won yesterday's Governor elections. Edit: Especially when all those ICE protest videos show the protesters yelling, honking their car horns, and throwing rocks at ICE agents, with no pushback from ICE agents, that was motivation for Democrats to think they were 'winning'. permalink parent award report block reply leakmouth 45 points 7 days ago we don’t even need to play dirty. Simply charge them with their actual crimes for fuck sake permalink parent award report block reply mty_green_go 10 points 7 days ago but what about the fake news painting us as bad guys permalink parent award report block reply HeftyAdministration8 10 points 7 days ago But they might call us racist. /s Edit: Added /s to clarify sarcasm. permalink parent award report block reply view 1 more comments... Protonboy 5 points 7 days ago They'll do that irrespective of what we do, you racist! permalink parent award report block reply view 2 more comments... Than0sIII 27 points 7 days ago Yep Democrats hold Republicans to rules and standards they don't give a shit about.  That's how this game has been going for awhile now.  And of course there are \"Republicans\" within Congress/the greater bureaucracy who buddy up with Democrats to get in on the corrupt $$$. permalink parent award report block reply MathletesFoot 1 points 6 days ago Since the 60s at least. Never forget Goldwater. permalink parent award report block reply KernalMustard 8 points 7 days ago Its all a grift for everyone. If you fix shit you cant grft. Dems open the door GOP hold it open. permalink parent award report block reply ReleasetheList 2 points 7 days ago Republicans drive the speed limit towards the edge of the cliff while dems go at 100mph. permalink parent award report block reply HenkZeilstra 1 points 7 days ago Absofuckinglutely After Trump Digital ID and CBDC will be fast tracked if they have not already prepared the framework covertly permalink parent award report block reply Sgt_Hulka 1 points 6 days ago It’s ready to go. Agenda 2030.  The infrastructure is already being put in place. See UK. permalink parent award report block reply Klaus73 1 points 6 days ago Trump is dick deep into digital currency; USDC has been up for a long time. Folks are hoping AI will be a big payday and if not then all that hardware will somehow be repurposed to bitcoin. permalink parent award report block reply\nleakmouth 45 points 7 days ago we don’t even need to play dirty. Simply charge them with their actual crimes for fuck sake permalink parent award report block reply mty_green_go 10 points 7 days ago but what about the fake news painting us as bad guys permalink parent award report block reply HeftyAdministration8 10 points 7 days ago But they might call us racist. /s Edit: Added /s to clarify sarcasm. permalink parent award report block reply view 1 more comments... Protonboy 5 points 7 days ago They'll do that irrespective of what we do, you racist! permalink parent award report block reply view 2 more comments...\nmty_green_go 10 points 7 days ago but what about the fake news painting us as bad guys permalink parent award report block reply HeftyAdministration8 10 points 7 days ago But they might call us racist. /s Edit: Added /s to clarify sarcasm. permalink parent award report block reply view 1 more comments... Protonboy 5 points 7 days ago They'll do that irrespective of what we do, you racist! permalink parent award report block reply view 2 more comments...\nHeftyAdministration8 10 points 7 days ago But they might call us racist. /s Edit: Added /s to clarify sarcasm. permalink parent award report block reply view 1 more comments...\nProtonboy 5 points 7 days ago They'll do that irrespective of what we do, you racist! permalink parent award report block reply view 2 more comments...\nThan0sIII 27 points 7 days ago Yep Democrats hold Republicans to rules and standards they don't give a shit about.  That's how this game has been going for awhile now.  And of course there are \"Republicans\" within Congress/the greater bureaucracy who buddy up with Democrats to get in on the corrupt $$$. permalink parent award report block reply MathletesFoot 1 points 6 days ago Since the 60s at least. Never forget Goldwater. permalink parent award report block reply\nMathletesFoot 1 points 6 days ago Since the 60s at least. Never forget Goldwater. permalink parent award report block reply\nKernalMustard 8 points 7 days ago Its all a grift for everyone. If you fix shit you cant grft. Dems open the door GOP hold it open. permalink parent award report block reply\nReleasetheList 2 points 7 days ago Republicans drive the speed limit towards the edge of the cliff while dems go at 100mph. permalink parent award report block reply\nHenkZeilstra 1 points 7 days ago Absofuckinglutely After Trump Digital ID and CBDC will be fast tracked if they have not already prepared the framework covertly permalink parent award report block reply Sgt_Hulka 1 points 6 days ago It’s ready to go. Agenda 2030.  The infrastructure is already being put in place. See UK. permalink parent award report block reply Klaus73 1 points 6 days ago Trump is dick deep into digital currency; USDC has been up for a long time. Folks are hoping AI will be a big payday and if not then all that hardware will somehow be repurposed to bitcoin. permalink parent award report block reply\nSgt_Hulka 1 points 6 days ago It’s ready to go. Agenda 2030.  The infrastructure is already being put in place. See UK. permalink parent award report block reply\nKlaus73 1 points 6 days ago Trump is dick deep into digital currency; USDC has been up for a long time. Folks are hoping AI will be a big payday and if not then all that hardware will somehow be repurposed to bitcoin. permalink parent award report block reply\nAndover 51 points 7 days ago Grok says this is the 11th time since 2016 that Trump said he's only just begun. permalink parent award report block reply Blndhairylegs 31 points 7 days ago He's a regular Karen Carpenter permalink parent award report block reply TDAF 7 points 7 days ago The world needs a caring carpenter. permalink parent award report block reply Cuomorbidities 5 points 7 days ago Fuckin’ underrated comment 😂 permalink parent award report block reply Fingerbang 2 points 7 days ago I lololololololololololololololololololo'd permalink parent award report block reply DrJosephWarren 1 points 7 days ago Wew lad kek permalink parent award report block reply ParmesanCartel 23 points 7 days ago It's only just begun.... 10 years later.....Epstein was a hoax stop talking about it permalink parent award report block reply Klaus73 1 points 6 days ago I wonder if people will ask when the list eventually is forced to come out while any non-democrat name is redacted... permalink parent award report block reply AyChiXuaxua 15 points 7 days ago In two weeks, you're gonna see some real shit go down! permalink parent award report block reply nakedjay 3 points 7 days ago 6 more times to go. permalink parent award report block reply Hanging_Chad 2 points 7 days ago kek permalink parent award report block reply\nBlndhairylegs 31 points 7 days ago He's a regular Karen Carpenter permalink parent award report block reply TDAF 7 points 7 days ago The world needs a caring carpenter. permalink parent award report block reply Cuomorbidities 5 points 7 days ago Fuckin’ underrated comment 😂 permalink parent award report block reply Fingerbang 2 points 7 days ago I lololololololololololololololololololo'd permalink parent award report block reply DrJosephWarren 1 points 7 days ago Wew lad kek permalink parent award report block reply\nTDAF 7 points 7 days ago The world needs a caring carpenter. permalink parent award report block reply\nCuomorbidities 5 points 7 days ago Fuckin’ underrated comment 😂 permalink parent award report block reply\nFingerbang 2 points 7 days ago I lololololololololololololololololololo'd permalink parent award report block reply\nDrJosephWarren 1 points 7 days ago Wew lad kek permalink parent award report block reply\nParmesanCartel 23 points 7 days ago It's only just begun.... 10 years later.....Epstein was a hoax stop talking about it permalink parent award report block reply Klaus73 1 points 6 days ago I wonder if people will ask when the list eventually is forced to come out while any non-democrat name is redacted... permalink parent award report block reply\nKlaus73 1 points 6 days ago I wonder if people will ask when the list eventually is forced to come out while any non-democrat name is redacted... permalink parent award report block reply\nAyChiXuaxua 15 points 7 days ago In two weeks, you're gonna see some real shit go down! permalink parent award report block reply\nnakedjay 3 points 7 days ago 6 more times to go. permalink parent award report block reply\nHanging_Chad 2 points 7 days ago kek permalink parent award report block reply\nLiterallyKaiser 8 points 7 days ago I remember people telling me to trust Sacramucci or whatever his name was all the way back in 2017. permalink parent award report block reply EgregiousPhilbin 10 points 7 days ago Every 2 years, people tell me to vote for rinos. LOL good luck with that. permalink parent award report block reply Sgt_Hulka 2 points 6 days ago Trust Sessions Trust Kansas Trust Wray Operation Trust permalink parent award report block reply\nEgregiousPhilbin 10 points 7 days ago Every 2 years, people tell me to vote for rinos. LOL good luck with that. permalink parent award report block reply\nSgt_Hulka 2 points 6 days ago Trust Sessions Trust Kansas Trust Wray Operation Trust permalink parent award report block reply\nMAGA9428 6 points 7 days ago If only all Republicans had Trump’s convictions and determination. permalink parent award report block reply\nGlory-Unto-God 115 points 7 days ago Just begun? Big if true I haven't even witnessed a starting line. permalink award report block reply uxername27 51 points 7 days ago It's the 9th time this movement has begun since 2015. permalink parent award report block reply BeauHD 27 points 7 days ago So are you dooming? Because he has done a metric fruitton since 2015. We would all be in NWO shackles if it weren't for Trump's accomplishments. permalink parent award report block reply uxername27 10 points 7 days ago No just joking. It's not the first time I heard Trump say this is only the beginning. permalink parent award report block reply BeauHD -1 points 7 days ago Oh, LoL! permalink parent award report block reply Elonmuskbedo 5 points 7 days ago Lmao okay buddy keep telling yourself that when he is the reason for the covid vax permalink parent award report block reply BeauHD 0 points 7 days ago Anaconda Bot Detected. permalink parent award report block reply view 1 more comments... lostremote- -3 points 7 days ago This site has been swarming with dooming faggots and larpers for a couple of days. permalink parent award report block reply TurdSammich 9 points 7 days ago So just keep smiling and pretending the right is doing a good job? permalink parent award report block reply KernalMustard 6 points 7 days ago Stop being a Ostrich. Get your head out the sand. permalink parent award report block reply view 1 more comments... Glory-Unto-God 4 points 7 days ago This site is swarming with ample rage just like much of this nation. If we had a leader who could harness it properly and galvanize that movement then this nation could be rid of internal enemies within the timeline of this presidency. We do not have that. Its not dooming to say trump is Paul revere and we have no Washington. Thats just a fact of the situation. permalink parent award report block reply view 2 more comments... UCantStumpTheTrump -3 points 7 days ago Look up and down this thread, it’s full of doomer shills from Reddit permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply mikejones 13 points 7 days ago There are many checks and balances in place to keep the movement from beginning when most things Trump is doing can be undone quickly. permalink parent award report block reply starjello 8 points 7 days ago will be undone quickly permalink parent award report block reply Standingoak 6 points 7 days ago A journey of a thousand miles begins with a single step. 9 you say , Time to pick up the pace over the next 11 months . permalink parent award report block reply Standingoak 10 points 7 days ago The heavy air when you know the storm is here but the thunder is not yet loud or close.  \"Just Begun\" “Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.  ― Sun Tzu, The Art of (the Deal) War permalink parent award report block reply Chickensaurus 5 points 7 days ago Yes. We've just begun fighting (for our lives). The left has been for a long time. We've taken casualties. We're all on borrowed time now. permalink parent award report block reply Metal4Freedom 3 points 7 days ago Charlie is dead and we're still playing footsies with the left. permalink parent award report block reply Chickensaurus 2 points 6 days ago Yup. permalink parent award report block reply Saltman5000 -2 points 7 days ago For real! He hasn't done shit. permalink parent award report block reply tchouk 2 points 6 days ago He's done a whole lot to appease deviant fucks like Lindsay Graham and other America-last RINOs. permalink parent award report block reply\nuxername27 51 points 7 days ago It's the 9th time this movement has begun since 2015. permalink parent award report block reply BeauHD 27 points 7 days ago So are you dooming? Because he has done a metric fruitton since 2015. We would all be in NWO shackles if it weren't for Trump's accomplishments. permalink parent award report block reply uxername27 10 points 7 days ago No just joking. It's not the first time I heard Trump say this is only the beginning. permalink parent award report block reply BeauHD -1 points 7 days ago Oh, LoL! permalink parent award report block reply Elonmuskbedo 5 points 7 days ago Lmao okay buddy keep telling yourself that when he is the reason for the covid vax permalink parent award report block reply BeauHD 0 points 7 days ago Anaconda Bot Detected. permalink parent award report block reply view 1 more comments... lostremote- -3 points 7 days ago This site has been swarming with dooming faggots and larpers for a couple of days. permalink parent award report block reply TurdSammich 9 points 7 days ago So just keep smiling and pretending the right is doing a good job? permalink parent award report block reply KernalMustard 6 points 7 days ago Stop being a Ostrich. Get your head out the sand. permalink parent award report block reply view 1 more comments... Glory-Unto-God 4 points 7 days ago This site is swarming with ample rage just like much of this nation. If we had a leader who could harness it properly and galvanize that movement then this nation could be rid of internal enemies within the timeline of this presidency. We do not have that. Its not dooming to say trump is Paul revere and we have no Washington. Thats just a fact of the situation. permalink parent award report block reply view 2 more comments... UCantStumpTheTrump -3 points 7 days ago Look up and down this thread, it’s full of doomer shills from Reddit permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply mikejones 13 points 7 days ago There are many checks and balances in place to keep the movement from beginning when most things Trump is doing can be undone quickly. permalink parent award report block reply starjello 8 points 7 days ago will be undone quickly permalink parent award report block reply Standingoak 6 points 7 days ago A journey of a thousand miles begins with a single step. 9 you say , Time to pick up the pace over the next 11 months . permalink parent award report block reply\nBeauHD 27 points 7 days ago So are you dooming? Because he has done a metric fruitton since 2015. We would all be in NWO shackles if it weren't for Trump's accomplishments. permalink parent award report block reply uxername27 10 points 7 days ago No just joking. It's not the first time I heard Trump say this is only the beginning. permalink parent award report block reply BeauHD -1 points 7 days ago Oh, LoL! permalink parent award report block reply Elonmuskbedo 5 points 7 days ago Lmao okay buddy keep telling yourself that when he is the reason for the covid vax permalink parent award report block reply BeauHD 0 points 7 days ago Anaconda Bot Detected. permalink parent award report block reply view 1 more comments... lostremote- -3 points 7 days ago This site has been swarming with dooming faggots and larpers for a couple of days. permalink parent award report block reply TurdSammich 9 points 7 days ago So just keep smiling and pretending the right is doing a good job? permalink parent award report block reply KernalMustard 6 points 7 days ago Stop being a Ostrich. Get your head out the sand. permalink parent award report block reply view 1 more comments... Glory-Unto-God 4 points 7 days ago This site is swarming with ample rage just like much of this nation. If we had a leader who could harness it properly and galvanize that movement then this nation could be rid of internal enemies within the timeline of this presidency. We do not have that. Its not dooming to say trump is Paul revere and we have no Washington. Thats just a fact of the situation. permalink parent award report block reply view 2 more comments... UCantStumpTheTrump -3 points 7 days ago Look up and down this thread, it’s full of doomer shills from Reddit permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nuxername27 10 points 7 days ago No just joking. It's not the first time I heard Trump say this is only the beginning. permalink parent award report block reply BeauHD -1 points 7 days ago Oh, LoL! permalink parent award report block reply\nBeauHD -1 points 7 days ago Oh, LoL! permalink parent award report block reply\nElonmuskbedo 5 points 7 days ago Lmao okay buddy keep telling yourself that when he is the reason for the covid vax permalink parent award report block reply BeauHD 0 points 7 days ago Anaconda Bot Detected. permalink parent award report block reply view 1 more comments...\nBeauHD 0 points 7 days ago Anaconda Bot Detected. permalink parent award report block reply view 1 more comments...\nlostremote- -3 points 7 days ago This site has been swarming with dooming faggots and larpers for a couple of days. permalink parent award report block reply TurdSammich 9 points 7 days ago So just keep smiling and pretending the right is doing a good job? permalink parent award report block reply KernalMustard 6 points 7 days ago Stop being a Ostrich. Get your head out the sand. permalink parent award report block reply view 1 more comments... Glory-Unto-God 4 points 7 days ago This site is swarming with ample rage just like much of this nation. If we had a leader who could harness it properly and galvanize that movement then this nation could be rid of internal enemies within the timeline of this presidency. We do not have that. Its not dooming to say trump is Paul revere and we have no Washington. Thats just a fact of the situation. permalink parent award report block reply view 2 more comments...\nTurdSammich 9 points 7 days ago So just keep smiling and pretending the right is doing a good job? permalink parent award report block reply\nKernalMustard 6 points 7 days ago Stop being a Ostrich. Get your head out the sand. permalink parent award report block reply view 1 more comments...\nGlory-Unto-God 4 points 7 days ago This site is swarming with ample rage just like much of this nation. If we had a leader who could harness it properly and galvanize that movement then this nation could be rid of internal enemies within the timeline of this presidency. We do not have that. Its not dooming to say trump is Paul revere and we have no Washington. Thats just a fact of the situation. permalink parent award report block reply view 2 more comments...\nUCantStumpTheTrump -3 points 7 days ago Look up and down this thread, it’s full of doomer shills from Reddit permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nmikejones 13 points 7 days ago There are many checks and balances in place to keep the movement from beginning when most things Trump is doing can be undone quickly. permalink parent award report block reply starjello 8 points 7 days ago will be undone quickly permalink parent award report block reply\nstarjello 8 points 7 days ago will be undone quickly permalink parent award report block reply\nStandingoak 6 points 7 days ago A journey of a thousand miles begins with a single step. 9 you say , Time to pick up the pace over the next 11 months . permalink parent award report block reply\nStandingoak 10 points 7 days ago The heavy air when you know the storm is here but the thunder is not yet loud or close.  \"Just Begun\" “Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.  ― Sun Tzu, The Art of (the Deal) War permalink parent award report block reply\nChickensaurus 5 points 7 days ago Yes. We've just begun fighting (for our lives). The left has been for a long time. We've taken casualties. We're all on borrowed time now. permalink parent award report block reply Metal4Freedom 3 points 7 days ago Charlie is dead and we're still playing footsies with the left. permalink parent award report block reply Chickensaurus 2 points 6 days ago Yup. permalink parent award report block reply\nMetal4Freedom 3 points 7 days ago Charlie is dead and we're still playing footsies with the left. permalink parent award report block reply Chickensaurus 2 points 6 days ago Yup. permalink parent award report block reply\nChickensaurus 2 points 6 days ago Yup. permalink parent award report block reply\nSaltman5000 -2 points 7 days ago For real! He hasn't done shit. permalink parent award report block reply tchouk 2 points 6 days ago He's done a whole lot to appease deviant fucks like Lindsay Graham and other America-last RINOs. permalink parent award report block reply\ntchouk 2 points 6 days ago He's done a whole lot to appease deviant fucks like Lindsay Graham and other America-last RINOs. permalink parent award report block reply\nJackOfAllTirades 92 points 7 days ago He's right. However, he needs to spend less time on the middle east and more time on domestic issues for the next 12 months. permalink award report block reply sumnayin2 18 points 7 days ago Im fine with the middle east if it includes nuking the juice and dunies permalink parent award report block reply Viewer01 12 points 7 days ago Unless it’s a crusade to reclaim the holy land, I’m not buying it. permalink parent award report block reply Donger-Lord 3 points 7 days ago Pretty gay how the moderators of this site are scared and try to censor anyone calling out the jews. They ALL have to go. permalink parent award report block reply BonginosRac1stCowboy 36 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply Datamancer 16 points 7 days ago Deus Vult permalink parent award report block reply MoldyLocksNesMonste 9 points 7 days ago Good luck with that. The muslims are rapidly expanding and colonizing the west.  We can't even occupy our own lands, and here you are fapping to occupying some place halfway across the globe. permalink parent award report block reply KernalMustard -2 points 7 days ago Killing themselves over religion. Does he really think Muslims in the rest of the world would stand by and let that happen? How about the Jews. You would be fighting a 2 pronged war in not just Israel. A fucking mess that would kill us all. permalink parent award report block reply view 1 more comments... Litterboxer1 2 points 7 days ago You can't even occupy your own countries LOL permalink parent award report block reply invalid_data 13 points 7 days ago Stop traveling around the world solving shit countries wars and instead solve this countries own civil war. Instead focus on the foreign invasion in our own border. Instead focus on still how Americans are getting fucked over for pajeets. permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago We don't have 12 months. He will be turning 80 fucking years old soon. permalink parent award report block reply bumpman -1 points 7 days ago He solved the Middle East in his first 9 months, we are past that.. if anything, the Israel obsessed folks on both sides should be cheering trump permalink parent award report block reply flashersenpai 4 points 7 days ago israel killed a few hundred people in Gaza or so since the ceasefire started it should be abandoned permalink parent award report block reply bumpman 1 points 6 days ago Killing can go down 99% and the war be over and y’all will never be satisfied. Try focusing more on America and Christian’s and less on Jews and Muslims for once permalink parent award report block reply Seeker_17 -4 points 7 days ago Killing terrorists aka palestinians is a good thing. permalink parent award report block reply Porkbut -4 points 7 days ago In response to attacks on soldiers by gazans. You propagandists only ever tell part of the story. permalink parent award report block reply\nsumnayin2 18 points 7 days ago Im fine with the middle east if it includes nuking the juice and dunies permalink parent award report block reply Viewer01 12 points 7 days ago Unless it’s a crusade to reclaim the holy land, I’m not buying it. permalink parent award report block reply Donger-Lord 3 points 7 days ago Pretty gay how the moderators of this site are scared and try to censor anyone calling out the jews. They ALL have to go. permalink parent award report block reply BonginosRac1stCowboy 36 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply Datamancer 16 points 7 days ago Deus Vult permalink parent award report block reply MoldyLocksNesMonste 9 points 7 days ago Good luck with that. The muslims are rapidly expanding and colonizing the west.  We can't even occupy our own lands, and here you are fapping to occupying some place halfway across the globe. permalink parent award report block reply KernalMustard -2 points 7 days ago Killing themselves over religion. Does he really think Muslims in the rest of the world would stand by and let that happen? How about the Jews. You would be fighting a 2 pronged war in not just Israel. A fucking mess that would kill us all. permalink parent award report block reply view 1 more comments... Litterboxer1 2 points 7 days ago You can't even occupy your own countries LOL permalink parent award report block reply\nViewer01 12 points 7 days ago Unless it’s a crusade to reclaim the holy land, I’m not buying it. permalink parent award report block reply\nDonger-Lord 3 points 7 days ago Pretty gay how the moderators of this site are scared and try to censor anyone calling out the jews. They ALL have to go. permalink parent award report block reply\nBonginosRac1stCowboy 36 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply Datamancer 16 points 7 days ago Deus Vult permalink parent award report block reply MoldyLocksNesMonste 9 points 7 days ago Good luck with that. The muslims are rapidly expanding and colonizing the west.  We can't even occupy our own lands, and here you are fapping to occupying some place halfway across the globe. permalink parent award report block reply KernalMustard -2 points 7 days ago Killing themselves over religion. Does he really think Muslims in the rest of the world would stand by and let that happen? How about the Jews. You would be fighting a 2 pronged war in not just Israel. A fucking mess that would kill us all. permalink parent award report block reply view 1 more comments... Litterboxer1 2 points 7 days ago You can't even occupy your own countries LOL permalink parent award report block reply\nDatamancer 16 points 7 days ago Deus Vult permalink parent award report block reply\nMoldyLocksNesMonste 9 points 7 days ago Good luck with that. The muslims are rapidly expanding and colonizing the west.  We can't even occupy our own lands, and here you are fapping to occupying some place halfway across the globe. permalink parent award report block reply KernalMustard -2 points 7 days ago Killing themselves over religion. Does he really think Muslims in the rest of the world would stand by and let that happen? How about the Jews. You would be fighting a 2 pronged war in not just Israel. A fucking mess that would kill us all. permalink parent award report block reply view 1 more comments...\nKernalMustard -2 points 7 days ago Killing themselves over religion. Does he really think Muslims in the rest of the world would stand by and let that happen? How about the Jews. You would be fighting a 2 pronged war in not just Israel. A fucking mess that would kill us all. permalink parent award report block reply view 1 more comments...\nLitterboxer1 2 points 7 days ago You can't even occupy your own countries LOL permalink parent award report block reply\ninvalid_data 13 points 7 days ago Stop traveling around the world solving shit countries wars and instead solve this countries own civil war. Instead focus on the foreign invasion in our own border. Instead focus on still how Americans are getting fucked over for pajeets. permalink parent award report block reply\nNonbinaryPotatohead 1 points 6 days ago We don't have 12 months. He will be turning 80 fucking years old soon. permalink parent award report block reply\nbumpman -1 points 7 days ago He solved the Middle East in his first 9 months, we are past that.. if anything, the Israel obsessed folks on both sides should be cheering trump permalink parent award report block reply flashersenpai 4 points 7 days ago israel killed a few hundred people in Gaza or so since the ceasefire started it should be abandoned permalink parent award report block reply bumpman 1 points 6 days ago Killing can go down 99% and the war be over and y’all will never be satisfied. Try focusing more on America and Christian’s and less on Jews and Muslims for once permalink parent award report block reply Seeker_17 -4 points 7 days ago Killing terrorists aka palestinians is a good thing. permalink parent award report block reply Porkbut -4 points 7 days ago In response to attacks on soldiers by gazans. You propagandists only ever tell part of the story. permalink parent award report block reply\nflashersenpai 4 points 7 days ago israel killed a few hundred people in Gaza or so since the ceasefire started it should be abandoned permalink parent award report block reply bumpman 1 points 6 days ago Killing can go down 99% and the war be over and y’all will never be satisfied. Try focusing more on America and Christian’s and less on Jews and Muslims for once permalink parent award report block reply Seeker_17 -4 points 7 days ago Killing terrorists aka palestinians is a good thing. permalink parent award report block reply Porkbut -4 points 7 days ago In response to attacks on soldiers by gazans. You propagandists only ever tell part of the story. permalink parent award report block reply\nbumpman 1 points 6 days ago Killing can go down 99% and the war be over and y’all will never be satisfied. Try focusing more on America and Christian’s and less on Jews and Muslims for once permalink parent award report block reply\nSeeker_17 -4 points 7 days ago Killing terrorists aka palestinians is a good thing. permalink parent award report block reply\nPorkbut -4 points 7 days ago In response to attacks on soldiers by gazans. You propagandists only ever tell part of the story. permalink parent award report block reply\nMemebot 42 points 7 days ago Why are people acting like losing in majority demonrats states was the end of everything? I swear I fucking hate media so obsessed with 2-3 cities. permalink award report block reply Ghostphaez 62 points 7 days ago Because just a few weeks ago people were gloating that the Democrats were done as a party - but now we see that not only are they not done, they are fired up and can very possibly win more Congressional seats in 2026 and remove Trump from office. It was a brutal wakeup call last night. permalink parent award report block reply Badfinz_FL 40 points 7 days ago in the upcomign midterms ALL house seats are up for re-election and a majority of the senate as well This is a much bigger election as it deals with districts and states.  The senate races could get interesting but the house races will fall along their historic district norms.  That favors us. If we don't fix the voting shit in this country, or we fail to play the ballot stuffing game like the demo commies, we are in for an interesting midterm election especially in the senate races as they are more a statewide type election versus districts only. permalink parent award report block reply ParmesanCartel 5 points 7 days ago Unfortunately trump has fucked any chance the Republicans had for the midterms. His Israel first bullshit and his avoidance even backtracking on his promises really soured most trump supporters I know. permalink parent award report block reply NonbinaryPotatohead 3 points 6 days ago more importantly the young voter base. They aren't having this fake bullshit anymore. The CK thing really seems like the .......Turning Point for them. permalink parent award report block reply covok48 3 points 7 days ago Stop downvoting this. You KNOW it’s true, permalink parent award report block reply B-2StealthTrump -5 points 7 days ago Bot faggot detected ☝🏻 permalink parent award report block reply view 5 more comments... Memebot 10 points 7 days ago \"Brutal\" Like I don't see a demonrat winning the states they won as a brutal wake-up call. permalink parent award report block reply DeplorableCentipede 6 points 7 days ago It’s not about the democrats winning. It’s about the margins. Trump lost Virginia and New Jersey by 5 points. The Democrat gubernatorial candidates won both by 15 points. Moreover, both of these are states that have elected Republican governors in the recent past, so they’re not deep blue states like you make them out to be. The results bode poorly for Republican prospects in more consequential elections next year. permalink parent award report block reply couranto 7 points 7 days ago Wrong. The candidates were all anti Trump anti MaGa. permalink parent award report block reply view 1 more comments... starjello 5 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans. Also smashed in PA. Q faggots down vote facts. permalink parent award report block reply Obliv1 3 points 7 days ago true, dunno if they fried their brains or really this stupid or just feds with the same \"Trust the plan\" bs always. permalink parent award report block reply view 4 more comments... NonbinaryPotatohead 2 points 6 days ago Q was a mossad Op LOL permalink parent award report block reply view 1 more comments... covok48 2 points 7 days ago Now I’m sure it was fraud, but this admin thinks it can outvote it. Retards. permalink parent award report block reply goldkeyboardwarrior 6 points 7 days ago It still takes 67 senators to remove after impeachment and that only makes Vance president if they somehow get 67 votes. As much as we would like to pretend the GOP would win Virginia, most of us knew it probably wasn’t going to flip only a year after all statewide races in Virginia went to Dems, especially since a number of people hit by mass firings and the shutdown were from NOVA. Few people here seemed to notice VA still went blue last year because Trump didn’t need them to pass 270 and Hung Cao lost to a two-term incumbent in a state that hasn’t elected a Republican to the Senate since 2002. Youngkin was in the right place at the right time with his opponent’s controversies and with Loudoun County in the news for trying to cover up the same boy raping two girls in two different schools because he wore a dress when he did it. permalink parent award report block reply covok48 1 points 7 days ago Right but you didn’t mention the AG…for a reason. permalink parent award report block reply KernalMustard 6 points 7 days ago We warned them. They didnt listen. They called us doomers. Fuck the Cultist. Wake the fuck up! permalink parent award report block reply Obliv1 5 points 7 days ago they can't... they're still waiting on the Kraken and the raids in Germany, \"trusting the plan\" haven't even realized 5 yrs have passed permalink parent award report block reply Sgt_Hulka 2 points 6 days ago Oh yes they have! Thats why you now see “5-year deltas”. Have you seen the Q-clock?  LOL permalink parent award report block reply Azill 0 points 7 days ago Everyone knew that the party wasn't done except for the retards who mindlessly follow every headline. It doesn't matter if the party has 1% approval rating, people will ALWAYS vote for the dem, ALWAYS. The only way the party is ever truly finished is when they officially dissolve. permalink parent award report block reply starjello 0 points 7 days ago Everyone knew that the party wasn't done except for the retards who mindlessly follow every headline Too many of those retards hang out here. permalink parent award report block reply Azill -1 points 7 days ago Yes they do. They have a meltdown when everything doesn't go 100% our way and doom that the world is ending. permalink parent award report block reply view 1 more comments... RedFoxOnFire 21 points 7 days ago Because now campaigning on the promise of dead conservatives is a winning strategy. permalink parent award report block reply Obliv1 5 points 7 days ago Yeah only Wiles could sell McCain as what diehard MAGA wants! permalink parent award report block reply DT170x 18 points 7 days ago I rather act like we 20 points behind all the time. Keep the people from being complacent and politically apathetic. permalink parent award report block reply KernalMustard -7 points 7 days ago Says the cultist. permalink parent award report block reply Viewer01 13 points 7 days ago Because we all witnessed the Zionist vs America first crash out with Shapiro and Levine. We all know Zionists have trumps ears and we just watched their two biggest right wing gate keepers crash out the week before the election. Then there’s the group chat leaks and the secret recordings all done by Jews to purge anyone who isn’t bowing down to them. It’s fundamentally clear they’d sooner communist America than America without Israel. Also, it’s finally clicking in a lot of people’s minds that minorities will never ever vote red and will usher in communism. So a lot of peoples world view of if we’re nice to them they’ll be nice to us has been shattered. permalink parent award report block reply Seeker_17 -6 points 7 days ago Zionists? LOL. Aru you really that dense? Nobody cares about Zionists except for  muzzies like you.Go worship your goat fucking prophet. permalink parent award report block reply Viewer01 2 points 6 days ago I’m going to worship your moms fat khazar milkers tonight rabbi. permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago Are you 60 years old or something? Are you not aware of the avalanche of the young to middle age voter base, you know, the majority of voters, that are extremely dissatisfied with how blatant Israel has been with their takeover and foreign influence recently? LOL You can watch Bibi cream his pants talking to the 7k per post influencers about his \"Esther Project\" or Trump himself admitting Miriam Adelson OWNS him and dictates his policy. That is NOT what I nor anyone else voted for. Zionist influence is the HOTTEST topic across the political sphere currently. If you don't know that, it's because you aren't using apps or seeing the content that the MAJORITY voter base is, which makes your opinion irrelevant by definition. permalink parent award report block reply eclectic22 6 points 7 days ago It's a disappointment for sure and a wake up call. No place for complacency now. permalink parent award report block reply Badfinz_FL 11 points 7 days ago the polls have been showing for months neither republican candidate in those states had a chance. Our internal polls were much worse.  I'm surprised Sears did as well as she did though. Both were terrible candidates.  Trump let the RINOs run on this one and they got smacked.  He has a plan here. permalink parent award report block reply Blndhairylegs 6 points 7 days ago 4d chess! permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago LOL Losing on purpose to catch the bigger fish I'm sure .... permalink parent award report block reply load 6 more comments...\nGhostphaez 62 points 7 days ago Because just a few weeks ago people were gloating that the Democrats were done as a party - but now we see that not only are they not done, they are fired up and can very possibly win more Congressional seats in 2026 and remove Trump from office. It was a brutal wakeup call last night. permalink parent award report block reply Badfinz_FL 40 points 7 days ago in the upcomign midterms ALL house seats are up for re-election and a majority of the senate as well This is a much bigger election as it deals with districts and states.  The senate races could get interesting but the house races will fall along their historic district norms.  That favors us. If we don't fix the voting shit in this country, or we fail to play the ballot stuffing game like the demo commies, we are in for an interesting midterm election especially in the senate races as they are more a statewide type election versus districts only. permalink parent award report block reply ParmesanCartel 5 points 7 days ago Unfortunately trump has fucked any chance the Republicans had for the midterms. His Israel first bullshit and his avoidance even backtracking on his promises really soured most trump supporters I know. permalink parent award report block reply NonbinaryPotatohead 3 points 6 days ago more importantly the young voter base. They aren't having this fake bullshit anymore. The CK thing really seems like the .......Turning Point for them. permalink parent award report block reply covok48 3 points 7 days ago Stop downvoting this. You KNOW it’s true, permalink parent award report block reply B-2StealthTrump -5 points 7 days ago Bot faggot detected ☝🏻 permalink parent award report block reply view 5 more comments... Memebot 10 points 7 days ago \"Brutal\" Like I don't see a demonrat winning the states they won as a brutal wake-up call. permalink parent award report block reply DeplorableCentipede 6 points 7 days ago It’s not about the democrats winning. It’s about the margins. Trump lost Virginia and New Jersey by 5 points. The Democrat gubernatorial candidates won both by 15 points. Moreover, both of these are states that have elected Republican governors in the recent past, so they’re not deep blue states like you make them out to be. The results bode poorly for Republican prospects in more consequential elections next year. permalink parent award report block reply couranto 7 points 7 days ago Wrong. The candidates were all anti Trump anti MaGa. permalink parent award report block reply view 1 more comments... starjello 5 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans. Also smashed in PA. Q faggots down vote facts. permalink parent award report block reply Obliv1 3 points 7 days ago true, dunno if they fried their brains or really this stupid or just feds with the same \"Trust the plan\" bs always. permalink parent award report block reply view 4 more comments... NonbinaryPotatohead 2 points 6 days ago Q was a mossad Op LOL permalink parent award report block reply view 1 more comments... covok48 2 points 7 days ago Now I’m sure it was fraud, but this admin thinks it can outvote it. Retards. permalink parent award report block reply goldkeyboardwarrior 6 points 7 days ago It still takes 67 senators to remove after impeachment and that only makes Vance president if they somehow get 67 votes. As much as we would like to pretend the GOP would win Virginia, most of us knew it probably wasn’t going to flip only a year after all statewide races in Virginia went to Dems, especially since a number of people hit by mass firings and the shutdown were from NOVA. Few people here seemed to notice VA still went blue last year because Trump didn’t need them to pass 270 and Hung Cao lost to a two-term incumbent in a state that hasn’t elected a Republican to the Senate since 2002. Youngkin was in the right place at the right time with his opponent’s controversies and with Loudoun County in the news for trying to cover up the same boy raping two girls in two different schools because he wore a dress when he did it. permalink parent award report block reply covok48 1 points 7 days ago Right but you didn’t mention the AG…for a reason. permalink parent award report block reply KernalMustard 6 points 7 days ago We warned them. They didnt listen. They called us doomers. Fuck the Cultist. Wake the fuck up! permalink parent award report block reply Obliv1 5 points 7 days ago they can't... they're still waiting on the Kraken and the raids in Germany, \"trusting the plan\" haven't even realized 5 yrs have passed permalink parent award report block reply Sgt_Hulka 2 points 6 days ago Oh yes they have! Thats why you now see “5-year deltas”. Have you seen the Q-clock?  LOL permalink parent award report block reply Azill 0 points 7 days ago Everyone knew that the party wasn't done except for the retards who mindlessly follow every headline. It doesn't matter if the party has 1% approval rating, people will ALWAYS vote for the dem, ALWAYS. The only way the party is ever truly finished is when they officially dissolve. permalink parent award report block reply starjello 0 points 7 days ago Everyone knew that the party wasn't done except for the retards who mindlessly follow every headline Too many of those retards hang out here. permalink parent award report block reply Azill -1 points 7 days ago Yes they do. They have a meltdown when everything doesn't go 100% our way and doom that the world is ending. permalink parent award report block reply view 1 more comments...\nBadfinz_FL 40 points 7 days ago in the upcomign midterms ALL house seats are up for re-election and a majority of the senate as well This is a much bigger election as it deals with districts and states.  The senate races could get interesting but the house races will fall along their historic district norms.  That favors us. If we don't fix the voting shit in this country, or we fail to play the ballot stuffing game like the demo commies, we are in for an interesting midterm election especially in the senate races as they are more a statewide type election versus districts only. permalink parent award report block reply ParmesanCartel 5 points 7 days ago Unfortunately trump has fucked any chance the Republicans had for the midterms. His Israel first bullshit and his avoidance even backtracking on his promises really soured most trump supporters I know. permalink parent award report block reply NonbinaryPotatohead 3 points 6 days ago more importantly the young voter base. They aren't having this fake bullshit anymore. The CK thing really seems like the .......Turning Point for them. permalink parent award report block reply covok48 3 points 7 days ago Stop downvoting this. You KNOW it’s true, permalink parent award report block reply B-2StealthTrump -5 points 7 days ago Bot faggot detected ☝🏻 permalink parent award report block reply view 5 more comments...\nParmesanCartel 5 points 7 days ago Unfortunately trump has fucked any chance the Republicans had for the midterms. His Israel first bullshit and his avoidance even backtracking on his promises really soured most trump supporters I know. permalink parent award report block reply NonbinaryPotatohead 3 points 6 days ago more importantly the young voter base. They aren't having this fake bullshit anymore. The CK thing really seems like the .......Turning Point for them. permalink parent award report block reply covok48 3 points 7 days ago Stop downvoting this. You KNOW it’s true, permalink parent award report block reply B-2StealthTrump -5 points 7 days ago Bot faggot detected ☝🏻 permalink parent award report block reply view 5 more comments...\nNonbinaryPotatohead 3 points 6 days ago more importantly the young voter base. They aren't having this fake bullshit anymore. The CK thing really seems like the .......Turning Point for them. permalink parent award report block reply\ncovok48 3 points 7 days ago Stop downvoting this. You KNOW it’s true, permalink parent award report block reply\nB-2StealthTrump -5 points 7 days ago Bot faggot detected ☝🏻 permalink parent award report block reply view 5 more comments...\nMemebot 10 points 7 days ago \"Brutal\" Like I don't see a demonrat winning the states they won as a brutal wake-up call. permalink parent award report block reply DeplorableCentipede 6 points 7 days ago It’s not about the democrats winning. It’s about the margins. Trump lost Virginia and New Jersey by 5 points. The Democrat gubernatorial candidates won both by 15 points. Moreover, both of these are states that have elected Republican governors in the recent past, so they’re not deep blue states like you make them out to be. The results bode poorly for Republican prospects in more consequential elections next year. permalink parent award report block reply couranto 7 points 7 days ago Wrong. The candidates were all anti Trump anti MaGa. permalink parent award report block reply view 1 more comments... starjello 5 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans. Also smashed in PA. Q faggots down vote facts. permalink parent award report block reply Obliv1 3 points 7 days ago true, dunno if they fried their brains or really this stupid or just feds with the same \"Trust the plan\" bs always. permalink parent award report block reply view 4 more comments... NonbinaryPotatohead 2 points 6 days ago Q was a mossad Op LOL permalink parent award report block reply view 1 more comments... covok48 2 points 7 days ago Now I’m sure it was fraud, but this admin thinks it can outvote it. Retards. permalink parent award report block reply\nDeplorableCentipede 6 points 7 days ago It’s not about the democrats winning. It’s about the margins. Trump lost Virginia and New Jersey by 5 points. The Democrat gubernatorial candidates won both by 15 points. Moreover, both of these are states that have elected Republican governors in the recent past, so they’re not deep blue states like you make them out to be. The results bode poorly for Republican prospects in more consequential elections next year. permalink parent award report block reply couranto 7 points 7 days ago Wrong. The candidates were all anti Trump anti MaGa. permalink parent award report block reply view 1 more comments...\ncouranto 7 points 7 days ago Wrong. The candidates were all anti Trump anti MaGa. permalink parent award report block reply view 1 more comments...\nstarjello 5 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans. Also smashed in PA. Q faggots down vote facts. permalink parent award report block reply Obliv1 3 points 7 days ago true, dunno if they fried their brains or really this stupid or just feds with the same \"Trust the plan\" bs always. permalink parent award report block reply view 4 more comments... NonbinaryPotatohead 2 points 6 days ago Q was a mossad Op LOL permalink parent award report block reply view 1 more comments... covok48 2 points 7 days ago Now I’m sure it was fraud, but this admin thinks it can outvote it. Retards. permalink parent award report block reply\nObliv1 3 points 7 days ago true, dunno if they fried their brains or really this stupid or just feds with the same \"Trust the plan\" bs always. permalink parent award report block reply view 4 more comments...\nNonbinaryPotatohead 2 points 6 days ago Q was a mossad Op LOL permalink parent award report block reply view 1 more comments...\ncovok48 2 points 7 days ago Now I’m sure it was fraud, but this admin thinks it can outvote it. Retards. permalink parent award report block reply\ngoldkeyboardwarrior 6 points 7 days ago It still takes 67 senators to remove after impeachment and that only makes Vance president if they somehow get 67 votes. As much as we would like to pretend the GOP would win Virginia, most of us knew it probably wasn’t going to flip only a year after all statewide races in Virginia went to Dems, especially since a number of people hit by mass firings and the shutdown were from NOVA. Few people here seemed to notice VA still went blue last year because Trump didn’t need them to pass 270 and Hung Cao lost to a two-term incumbent in a state that hasn’t elected a Republican to the Senate since 2002. Youngkin was in the right place at the right time with his opponent’s controversies and with Loudoun County in the news for trying to cover up the same boy raping two girls in two different schools because he wore a dress when he did it. permalink parent award report block reply covok48 1 points 7 days ago Right but you didn’t mention the AG…for a reason. permalink parent award report block reply\ncovok48 1 points 7 days ago Right but you didn’t mention the AG…for a reason. permalink parent award report block reply\nKernalMustard 6 points 7 days ago We warned them. They didnt listen. They called us doomers. Fuck the Cultist. Wake the fuck up! permalink parent award report block reply Obliv1 5 points 7 days ago they can't... they're still waiting on the Kraken and the raids in Germany, \"trusting the plan\" haven't even realized 5 yrs have passed permalink parent award report block reply Sgt_Hulka 2 points 6 days ago Oh yes they have! Thats why you now see “5-year deltas”. Have you seen the Q-clock?  LOL permalink parent award report block reply\nObliv1 5 points 7 days ago they can't... they're still waiting on the Kraken and the raids in Germany, \"trusting the plan\" haven't even realized 5 yrs have passed permalink parent award report block reply Sgt_Hulka 2 points 6 days ago Oh yes they have! Thats why you now see “5-year deltas”. Have you seen the Q-clock?  LOL permalink parent award report block reply\nSgt_Hulka 2 points 6 days ago Oh yes they have! Thats why you now see “5-year deltas”. Have you seen the Q-clock?  LOL permalink parent award report block reply\nAzill 0 points 7 days ago Everyone knew that the party wasn't done except for the retards who mindlessly follow every headline. It doesn't matter if the party has 1% approval rating, people will ALWAYS vote for the dem, ALWAYS. The only way the party is ever truly finished is when they officially dissolve. permalink parent award report block reply starjello 0 points 7 days ago Everyone knew that the party wasn't done except for the retards who mindlessly follow every headline Too many of those retards hang out here. permalink parent award report block reply Azill -1 points 7 days ago Yes they do. They have a meltdown when everything doesn't go 100% our way and doom that the world is ending. permalink parent award report block reply view 1 more comments...\nstarjello 0 points 7 days ago Everyone knew that the party wasn't done except for the retards who mindlessly follow every headline Too many of those retards hang out here. permalink parent award report block reply Azill -1 points 7 days ago Yes they do. They have a meltdown when everything doesn't go 100% our way and doom that the world is ending. permalink parent award report block reply view 1 more comments...\nAzill -1 points 7 days ago Yes they do. They have a meltdown when everything doesn't go 100% our way and doom that the world is ending. permalink parent award report block reply view 1 more comments...\nRedFoxOnFire 21 points 7 days ago Because now campaigning on the promise of dead conservatives is a winning strategy. permalink parent award report block reply Obliv1 5 points 7 days ago Yeah only Wiles could sell McCain as what diehard MAGA wants! permalink parent award report block reply\nObliv1 5 points 7 days ago Yeah only Wiles could sell McCain as what diehard MAGA wants! permalink parent award report block reply\nDT170x 18 points 7 days ago I rather act like we 20 points behind all the time. Keep the people from being complacent and politically apathetic. permalink parent award report block reply KernalMustard -7 points 7 days ago Says the cultist. permalink parent award report block reply\nKernalMustard -7 points 7 days ago Says the cultist. permalink parent award report block reply\nViewer01 13 points 7 days ago Because we all witnessed the Zionist vs America first crash out with Shapiro and Levine. We all know Zionists have trumps ears and we just watched their two biggest right wing gate keepers crash out the week before the election. Then there’s the group chat leaks and the secret recordings all done by Jews to purge anyone who isn’t bowing down to them. It’s fundamentally clear they’d sooner communist America than America without Israel. Also, it’s finally clicking in a lot of people’s minds that minorities will never ever vote red and will usher in communism. So a lot of peoples world view of if we’re nice to them they’ll be nice to us has been shattered. permalink parent award report block reply Seeker_17 -6 points 7 days ago Zionists? LOL. Aru you really that dense? Nobody cares about Zionists except for  muzzies like you.Go worship your goat fucking prophet. permalink parent award report block reply Viewer01 2 points 6 days ago I’m going to worship your moms fat khazar milkers tonight rabbi. permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago Are you 60 years old or something? Are you not aware of the avalanche of the young to middle age voter base, you know, the majority of voters, that are extremely dissatisfied with how blatant Israel has been with their takeover and foreign influence recently? LOL You can watch Bibi cream his pants talking to the 7k per post influencers about his \"Esther Project\" or Trump himself admitting Miriam Adelson OWNS him and dictates his policy. That is NOT what I nor anyone else voted for. Zionist influence is the HOTTEST topic across the political sphere currently. If you don't know that, it's because you aren't using apps or seeing the content that the MAJORITY voter base is, which makes your opinion irrelevant by definition. permalink parent award report block reply\nSeeker_17 -6 points 7 days ago Zionists? LOL. Aru you really that dense? Nobody cares about Zionists except for  muzzies like you.Go worship your goat fucking prophet. permalink parent award report block reply Viewer01 2 points 6 days ago I’m going to worship your moms fat khazar milkers tonight rabbi. permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago Are you 60 years old or something? Are you not aware of the avalanche of the young to middle age voter base, you know, the majority of voters, that are extremely dissatisfied with how blatant Israel has been with their takeover and foreign influence recently? LOL You can watch Bibi cream his pants talking to the 7k per post influencers about his \"Esther Project\" or Trump himself admitting Miriam Adelson OWNS him and dictates his policy. That is NOT what I nor anyone else voted for. Zionist influence is the HOTTEST topic across the political sphere currently. If you don't know that, it's because you aren't using apps or seeing the content that the MAJORITY voter base is, which makes your opinion irrelevant by definition. permalink parent award report block reply\nViewer01 2 points 6 days ago I’m going to worship your moms fat khazar milkers tonight rabbi. permalink parent award report block reply\nNonbinaryPotatohead 1 points 6 days ago Are you 60 years old or something? Are you not aware of the avalanche of the young to middle age voter base, you know, the majority of voters, that are extremely dissatisfied with how blatant Israel has been with their takeover and foreign influence recently? LOL You can watch Bibi cream his pants talking to the 7k per post influencers about his \"Esther Project\" or Trump himself admitting Miriam Adelson OWNS him and dictates his policy. That is NOT what I nor anyone else voted for. Zionist influence is the HOTTEST topic across the political sphere currently. If you don't know that, it's because you aren't using apps or seeing the content that the MAJORITY voter base is, which makes your opinion irrelevant by definition. permalink parent award report block reply\neclectic22 6 points 7 days ago It's a disappointment for sure and a wake up call. No place for complacency now. permalink parent award report block reply Badfinz_FL 11 points 7 days ago the polls have been showing for months neither republican candidate in those states had a chance. Our internal polls were much worse.  I'm surprised Sears did as well as she did though. Both were terrible candidates.  Trump let the RINOs run on this one and they got smacked.  He has a plan here. permalink parent award report block reply Blndhairylegs 6 points 7 days ago 4d chess! permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago LOL Losing on purpose to catch the bigger fish I'm sure .... permalink parent award report block reply\nBadfinz_FL 11 points 7 days ago the polls have been showing for months neither republican candidate in those states had a chance. Our internal polls were much worse.  I'm surprised Sears did as well as she did though. Both were terrible candidates.  Trump let the RINOs run on this one and they got smacked.  He has a plan here. permalink parent award report block reply Blndhairylegs 6 points 7 days ago 4d chess! permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago LOL Losing on purpose to catch the bigger fish I'm sure .... permalink parent award report block reply\nBlndhairylegs 6 points 7 days ago 4d chess! permalink parent award report block reply NonbinaryPotatohead 1 points 6 days ago LOL Losing on purpose to catch the bigger fish I'm sure .... permalink parent award report block reply\nNonbinaryPotatohead 1 points 6 days ago LOL Losing on purpose to catch the bigger fish I'm sure .... permalink parent award report block reply\nMasterChief 41 points 7 days ago Our fight for whom? Israel? Ukraine? Argentina? America First or Fuck Off permalink award report block reply breadbaker 10 points 7 days ago America First or Fuck Off permalink parent award report block reply deleted 5 points 6 days ago King6of6the6retards 3 points 6 days ago AFFO>MAGA. permalink parent award report block reply DeportThemAllForever 0 points 6 days ago Venezuela permalink parent award report block reply\nbreadbaker 10 points 7 days ago America First or Fuck Off permalink parent award report block reply deleted 5 points 6 days ago King6of6the6retards 3 points 6 days ago AFFO>MAGA. permalink parent award report block reply\ndeleted 5 points 6 days ago King6of6the6retards 3 points 6 days ago AFFO>MAGA. permalink parent award report block reply\nKing6of6the6retards 3 points 6 days ago AFFO>MAGA. permalink parent award report block reply\nDeportThemAllForever 0 points 6 days ago Venezuela permalink parent award report block reply\nBball-gurl 39 points 7 days ago What exactly are we fighting for right now, Donald?? Please tell me. permalink award report block reply KernalMustard 24 points 7 days ago Israel and the neocons. permalink parent award report block reply tchouk 5 points 6 days ago Always has been, eh? I get that Trump can't just do whatever to overrule the whole system. But at least not giving them blowjobs would be a good start. permalink parent award report block reply RIPcharlie 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply oilybohunkofshit 0 points 7 days ago Comment removed by community moderators. permalink parent award report block reply Scumbag-reddit 0 points 7 days ago ...the United States of America? Our livelihood? Way of life? Freedom? permalink parent award report block reply\nKernalMustard 24 points 7 days ago Israel and the neocons. permalink parent award report block reply tchouk 5 points 6 days ago Always has been, eh? I get that Trump can't just do whatever to overrule the whole system. But at least not giving them blowjobs would be a good start. permalink parent award report block reply RIPcharlie 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply oilybohunkofshit 0 points 7 days ago Comment removed by community moderators. permalink parent award report block reply\ntchouk 5 points 6 days ago Always has been, eh? I get that Trump can't just do whatever to overrule the whole system. But at least not giving them blowjobs would be a good start. permalink parent award report block reply\nRIPcharlie 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\noilybohunkofshit 0 points 7 days ago Comment removed by community moderators. permalink parent award report block reply\nScumbag-reddit 0 points 7 days ago ...the United States of America? Our livelihood? Way of life? Freedom? permalink parent award report block reply\nBudBurner 33 points 7 days ago You have yet to ignore a single judge. Who are you telling to fucking fight Don??? permalink award report block reply bumpman 9 points 7 days ago Yep, he’s playing by the rules and still racking up W’s. permalink parent award report block reply guywholikesDjtof2024 6 points 7 days ago He would rack up more if he ignores judges and chucks a bunch of baddies in jail. permalink parent award report block reply spezisacuckold 2 points 7 days ago Fox News permalink parent award report block reply\nbumpman 9 points 7 days ago Yep, he’s playing by the rules and still racking up W’s. permalink parent award report block reply guywholikesDjtof2024 6 points 7 days ago He would rack up more if he ignores judges and chucks a bunch of baddies in jail. permalink parent award report block reply\nguywholikesDjtof2024 6 points 7 days ago He would rack up more if he ignores judges and chucks a bunch of baddies in jail. permalink parent award report block reply\nspezisacuckold 2 points 7 days ago Fox News permalink parent award report block reply\nFbiisazzhoe 25 points 7 days ago Not tired of winning.. just tired of sitting idle and losing my nation to foreigners and Islamists permalink award report block reply\nQuiznos585 23 points 7 days ago I’m getting tired of this. permalink award report block reply\nKrat 22 points 7 days ago Not with 0 arrests it isnt permalink award report block reply pollsarefake -1 points 7 days ago Building cases takes time They have to be bulletproof permalink parent award report block reply justinkayz 6 points 7 days ago Tell the J6er's that permalink parent award report block reply tchouk 2 points 6 days ago Like the cases against Trump, I'm sure. permalink parent award report block reply\npollsarefake -1 points 7 days ago Building cases takes time They have to be bulletproof permalink parent award report block reply justinkayz 6 points 7 days ago Tell the J6er's that permalink parent award report block reply tchouk 2 points 6 days ago Like the cases against Trump, I'm sure. permalink parent award report block reply\njustinkayz 6 points 7 days ago Tell the J6er's that permalink parent award report block reply\ntchouk 2 points 6 days ago Like the cases against Trump, I'm sure. permalink parent award report block reply\nSpawnlingman 22 points 7 days ago Why's he telling us.  Tell Pam or Kash. permalink award report block reply pollsarefake 3 points 7 days ago Kash is an H1B infiltrator. His real name is Kashyap Pramod Patel permalink parent award report block reply Sgt_Hulka 1 points 6 days ago His first name is really Kash app? permalink parent award report block reply\npollsarefake 3 points 7 days ago Kash is an H1B infiltrator. His real name is Kashyap Pramod Patel permalink parent award report block reply Sgt_Hulka 1 points 6 days ago His first name is really Kash app? permalink parent award report block reply\nSgt_Hulka 1 points 6 days ago His first name is really Kash app? permalink parent award report block reply\nRedpilled2Depression 19 points 7 days ago It’s been 10 years since this fight started Mr. President, and I’ve lost friendships having your back and never once wavered, but I’m starting to become fatigued and really need to see some results. permalink award report block reply seangalt 7 points 7 days ago Not me.  i didn't lose friends, i lost TRAITORS and COMMIES.  i gained Friends.  i gained Patriots!  And we, the People, Patriotic Americans are so much the better for it. MAGA permalink parent award report block reply Beelzy 4 points 7 days ago 👍 permalink parent award report block reply guywholikesDjtof2024 1 points 7 days ago You didn't lose them. They lost you. permalink parent award report block reply B-2StealthTrump -6 points 7 days ago Oh no!!!  This faggot lost some liberal friends for supporting Trump!  Fuck the country!  Abandon ship!!   STFU faggot. permalink parent award report block reply the_new_one 1 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nseangalt 7 points 7 days ago Not me.  i didn't lose friends, i lost TRAITORS and COMMIES.  i gained Friends.  i gained Patriots!  And we, the People, Patriotic Americans are so much the better for it. MAGA permalink parent award report block reply Beelzy 4 points 7 days ago 👍 permalink parent award report block reply\nBeelzy 4 points 7 days ago 👍 permalink parent award report block reply\nguywholikesDjtof2024 1 points 7 days ago You didn't lose them. They lost you. permalink parent award report block reply\nB-2StealthTrump -6 points 7 days ago Oh no!!!  This faggot lost some liberal friends for supporting Trump!  Fuck the country!  Abandon ship!!   STFU faggot. permalink parent award report block reply\nthe_new_one 1 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNadlersNads 18 points 7 days ago SO FUCKING FIGHT ALREADY permalink award report block reply\nMrJinxy 16 points 7 days ago Is it time?  Can we stop standing by standing down now? permalink award report block reply Metal4Freedom 3 points 7 days ago We must rise together or we will die alone. permalink parent award report block reply\nMetal4Freedom 3 points 7 days ago We must rise together or we will die alone. permalink parent award report block reply\nGoBigly 16 points 7 days ago Arrest someone then permalink award report block reply\nspezisacuckold 15 points 7 days ago Shut up with the platitudes and arrest Democrats and Republicans. permalink award report block reply\nGoozmania 12 points 7 days ago Uh... That's an odd thing to say... permalink award report block reply\nNanteen 11 points 7 days ago Pennsylvania we probably had 25% turnout. God. I'm just so disgusted with my fellow Americans for not bothering. permalink award report block reply starjello 4 points 7 days ago And the democrats totally steam rolled here in PA permalink parent award report block reply Nanteen 4 points 7 days ago They didn't really steamroll. No one bothered coming out for the election just less Democrats blew off the election than Republicans. In our local area literally 20% voter turnout. That's fucking sad permalink parent award report block reply starjello 4 points 7 days ago Cannot polish a turd. It was a rout. Wait till next year. Democrats assumed more local control and will further enable voter fraud. permalink parent award report block reply B-2StealthTrump 2 points 7 days ago Ya, PA has always been pathetic at elections.  You get steamrolled by the Philly Fraud Machine every time. Get your shit in order. permalink parent award report block reply\nstarjello 4 points 7 days ago And the democrats totally steam rolled here in PA permalink parent award report block reply Nanteen 4 points 7 days ago They didn't really steamroll. No one bothered coming out for the election just less Democrats blew off the election than Republicans. In our local area literally 20% voter turnout. That's fucking sad permalink parent award report block reply starjello 4 points 7 days ago Cannot polish a turd. It was a rout. Wait till next year. Democrats assumed more local control and will further enable voter fraud. permalink parent award report block reply B-2StealthTrump 2 points 7 days ago Ya, PA has always been pathetic at elections.  You get steamrolled by the Philly Fraud Machine every time. Get your shit in order. permalink parent award report block reply\nNanteen 4 points 7 days ago They didn't really steamroll. No one bothered coming out for the election just less Democrats blew off the election than Republicans. In our local area literally 20% voter turnout. That's fucking sad permalink parent award report block reply starjello 4 points 7 days ago Cannot polish a turd. It was a rout. Wait till next year. Democrats assumed more local control and will further enable voter fraud. permalink parent award report block reply B-2StealthTrump 2 points 7 days ago Ya, PA has always been pathetic at elections.  You get steamrolled by the Philly Fraud Machine every time. Get your shit in order. permalink parent award report block reply\nstarjello 4 points 7 days ago Cannot polish a turd. It was a rout. Wait till next year. Democrats assumed more local control and will further enable voter fraud. permalink parent award report block reply\nB-2StealthTrump 2 points 7 days ago Ya, PA has always been pathetic at elections.  You get steamrolled by the Philly Fraud Machine every time. Get your shit in order. permalink parent award report block reply\n13MMshooter 11 points 7 days ago Prove it dude.  Drain the swamp. permalink award report block reply KernalMustard 3 points 7 days ago He said that 2015.....still not drained. People lie. Demand More, Demand Action. permalink parent award report block reply\nKernalMustard 3 points 7 days ago He said that 2015.....still not drained. People lie. Demand More, Demand Action. permalink parent award report block reply\nHangmhigh 8 points 7 days ago No shit. The entire western world has been invaded and globalists are building an open digital prison. Start arresting for fucks sake. permalink award report block reply\nCaptRied 8 points 7 days ago Fight!  Fight!  Fight! permalink award report block reply\nMasterVader2U 8 points 7 days ago 2 more weeks!!! Yeah! permalink award report block reply\nRedPillosopher1776 8 points 7 days ago Arrests or IDGAF. permalink award report block reply\nAnother_rando 7 points 7 days ago Same words were said  2016 permalink award report block reply starjello 4 points 7 days ago Yep and then Biden came in and did actual winning for the enemy. permalink parent award report block reply\nstarjello 4 points 7 days ago Yep and then Biden came in and did actual winning for the enemy. permalink parent award report block reply\neclectic22 7 points 7 days ago When the going gets tough, the tough get going! permalink award report block reply\nRizzlieDoodad 7 points 7 days ago I'll believe it when I see it. Congress is useless. Judges are useless permalink award report block reply\nI-am-Orlando OP PRO 7 points 7 days ago Link https://truthsocial.com/@realDonaldTrump/115499721335991086 permalink award report block reply\nHankScorpio 6 points 7 days ago Trump saved the country from 16 straight years of DNC rule with Cuntilllary winning after Nairobi Barack. Image the state of the country with the Cunt appointing 3 more DEI hires to the Supreme Court. permalink award report block reply\nAwakened 6 points 7 days ago If this falls apart it hits him and his family hardest. He has put everything on the line for his country. A real American hero. I pray his greatest success is yet to come. He deserves a great victory after all of his massive hard work and courage. He doesn't deserve what they've done to him and what they will do if they get the upper hand again. I hope he is ready to cross the Rubicon when the time comes. Because it is coming and he won't win this with politics as usual. permalink award report block reply oilybohunkofshit 1 points 7 days ago Comment removed by community moderators. permalink parent award report block reply\noilybohunkofshit 1 points 7 days ago Comment removed by community moderators. permalink parent award report block reply\nMinneMAGA 6 points 7 days ago Wouldn't our fight have to actually begin for it to \"only just begun?\" permalink award report block reply\nSenaleb 6 points 7 days ago He needs to drop Miriam Adelson because the timing for his video on the \"Republican Jew\" conference is pretty terrible timing and feels like Adelson rolled him out like a show dog. permalink award report block reply al-phabitz89 3 points 7 days ago What video is this ? permalink parent award report block reply ReleasetheList 2 points 7 days ago Link? permalink parent award report block reply\nal-phabitz89 3 points 7 days ago What video is this ? permalink parent award report block reply\nReleasetheList 2 points 7 days ago Link? permalink parent award report block reply\nSavingPrivateGrace 6 points 7 days ago Time to begin. permalink award report block reply\njournalist 6 points 7 days ago Fight, Fight, Fight permalink award report block reply\nCovidrrhea 5 points 7 days ago Has the Supreme Court ruled on whether the president can do presidential things like set tariffs? permalink award report block reply\nkeeptherepublic1776 5 points 7 days ago Why no time stamp? permalink award report block reply\nbarwhack 5 points 7 days ago Yeah? Where's my list of pedos in power? permalink award report block reply\nNat4Pat 5 points 7 days ago MAGA is unsustainable by heavily relying on minorities instead of building large families for white christians. permalink award report block reply mikejones 11 points 7 days ago And not many people will have the means to find a lady, get and keep a good job and raise children with good education. Need to be super smart or an executive. Then fight by running for office and hope you don't get shot in the process. permalink parent award report block reply Nat4Pat 9 points 7 days ago You know what I like about the jews? They unify, even rushing to defend one of their own pedophiles. They also have this network where none of them have trouble finding a partner or job through family and friends. So no one is left behind as a race. That's why they can dominate this civilization with less than 2% population. Organizing is definitely the most important ability as modern social unit. And that is the untapped potential for this race to exploit. permalink parent award report block reply Bigstick7 9 points 7 days ago White people are basically the only ones who aren't tribal. Every other race in general is. permalink parent award report block reply Nat4Pat 3 points 7 days ago Seems someone needs to change and I don't expect it to be the other side. permalink parent award report block reply -Evspra 3 points 7 days ago i commented something similar a while back. it's genuinely amazing how jews have been able to stick together for THOUSANDS of years like fucking glue, yet we can barely stand one another and would never willingly go out of our way for a random white person on the street. indians are similar in this regard. you hire one indian at an american company and if they get a managerial position, you'll almost never see anyone other than indians getting hired after that. permalink parent award report block reply Nat4Pat 3 points 7 days ago The conquest of the world has put us in a secured and wealthy state that deprived us of survival instinct. Meanwhile the jews' discomfort and disgrace of being rejected only toughened them. This crisis unfolding before us is the opportunity to get the that instinct back and stay united, hopefully forever. permalink parent award report block reply KernalMustard -3 points 7 days ago Fucking nonsense. You win by bringing people in not excluding people. permalink parent award report block reply BonginosRac1stCowboy 8 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nmikejones 11 points 7 days ago And not many people will have the means to find a lady, get and keep a good job and raise children with good education. Need to be super smart or an executive. Then fight by running for office and hope you don't get shot in the process. permalink parent award report block reply Nat4Pat 9 points 7 days ago You know what I like about the jews? They unify, even rushing to defend one of their own pedophiles. They also have this network where none of them have trouble finding a partner or job through family and friends. So no one is left behind as a race. That's why they can dominate this civilization with less than 2% population. Organizing is definitely the most important ability as modern social unit. And that is the untapped potential for this race to exploit. permalink parent award report block reply Bigstick7 9 points 7 days ago White people are basically the only ones who aren't tribal. Every other race in general is. permalink parent award report block reply Nat4Pat 3 points 7 days ago Seems someone needs to change and I don't expect it to be the other side. permalink parent award report block reply -Evspra 3 points 7 days ago i commented something similar a while back. it's genuinely amazing how jews have been able to stick together for THOUSANDS of years like fucking glue, yet we can barely stand one another and would never willingly go out of our way for a random white person on the street. indians are similar in this regard. you hire one indian at an american company and if they get a managerial position, you'll almost never see anyone other than indians getting hired after that. permalink parent award report block reply Nat4Pat 3 points 7 days ago The conquest of the world has put us in a secured and wealthy state that deprived us of survival instinct. Meanwhile the jews' discomfort and disgrace of being rejected only toughened them. This crisis unfolding before us is the opportunity to get the that instinct back and stay united, hopefully forever. permalink parent award report block reply\nNat4Pat 9 points 7 days ago You know what I like about the jews? They unify, even rushing to defend one of their own pedophiles. They also have this network where none of them have trouble finding a partner or job through family and friends. So no one is left behind as a race. That's why they can dominate this civilization with less than 2% population. Organizing is definitely the most important ability as modern social unit. And that is the untapped potential for this race to exploit. permalink parent award report block reply Bigstick7 9 points 7 days ago White people are basically the only ones who aren't tribal. Every other race in general is. permalink parent award report block reply Nat4Pat 3 points 7 days ago Seems someone needs to change and I don't expect it to be the other side. permalink parent award report block reply -Evspra 3 points 7 days ago i commented something similar a while back. it's genuinely amazing how jews have been able to stick together for THOUSANDS of years like fucking glue, yet we can barely stand one another and would never willingly go out of our way for a random white person on the street. indians are similar in this regard. you hire one indian at an american company and if they get a managerial position, you'll almost never see anyone other than indians getting hired after that. permalink parent award report block reply Nat4Pat 3 points 7 days ago The conquest of the world has put us in a secured and wealthy state that deprived us of survival instinct. Meanwhile the jews' discomfort and disgrace of being rejected only toughened them. This crisis unfolding before us is the opportunity to get the that instinct back and stay united, hopefully forever. permalink parent award report block reply\nBigstick7 9 points 7 days ago White people are basically the only ones who aren't tribal. Every other race in general is. permalink parent award report block reply Nat4Pat 3 points 7 days ago Seems someone needs to change and I don't expect it to be the other side. permalink parent award report block reply\nNat4Pat 3 points 7 days ago Seems someone needs to change and I don't expect it to be the other side. permalink parent award report block reply\n-Evspra 3 points 7 days ago i commented something similar a while back. it's genuinely amazing how jews have been able to stick together for THOUSANDS of years like fucking glue, yet we can barely stand one another and would never willingly go out of our way for a random white person on the street. indians are similar in this regard. you hire one indian at an american company and if they get a managerial position, you'll almost never see anyone other than indians getting hired after that. permalink parent award report block reply Nat4Pat 3 points 7 days ago The conquest of the world has put us in a secured and wealthy state that deprived us of survival instinct. Meanwhile the jews' discomfort and disgrace of being rejected only toughened them. This crisis unfolding before us is the opportunity to get the that instinct back and stay united, hopefully forever. permalink parent award report block reply\nNat4Pat 3 points 7 days ago The conquest of the world has put us in a secured and wealthy state that deprived us of survival instinct. Meanwhile the jews' discomfort and disgrace of being rejected only toughened them. This crisis unfolding before us is the opportunity to get the that instinct back and stay united, hopefully forever. permalink parent award report block reply\nKernalMustard -3 points 7 days ago Fucking nonsense. You win by bringing people in not excluding people. permalink parent award report block reply\nBonginosRac1stCowboy 8 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nVoldemarBGuerta 5 points 7 days ago If something doesn't change - and change fast... we are going to get rocked in the mid-terms. permalink award report block reply\nKumalasbreakfast99 5 points 7 days ago Let's start with bacon on every entrance to necessary stores; grocery, unemployment, snap offices, city hall etc permalink award report block reply seangalt 4 points 7 days ago Super soakers filled with pig's blood. permalink parent award report block reply guywholikesDjtof2024 0 points 7 days ago They won't know it's pig. That's the problem with all these \"pig blood\" comments. How will the muslims ever know? DUMB. permalink parent award report block reply\nseangalt 4 points 7 days ago Super soakers filled with pig's blood. permalink parent award report block reply guywholikesDjtof2024 0 points 7 days ago They won't know it's pig. That's the problem with all these \"pig blood\" comments. How will the muslims ever know? DUMB. permalink parent award report block reply\nguywholikesDjtof2024 0 points 7 days ago They won't know it's pig. That's the problem with all these \"pig blood\" comments. How will the muslims ever know? DUMB. permalink parent award report block reply\nDJT4MoreYears 4 points 7 days ago Hopium pill for the masses. Swallow it ya bigots. permalink award report block reply\nBythrfruitsyknow 4 points 7 days ago You could almost attribute this post to fucking ~Q~ permalink award report block reply starjello 3 points 7 days ago Maybe the Q fags were right and Q is really Trump who has been stringing those idiots along this whole time. permalink parent award report block reply\nstarjello 3 points 7 days ago Maybe the Q fags were right and Q is really Trump who has been stringing those idiots along this whole time. permalink parent award report block reply\ntw0scoops 4 points 7 days ago Arrests when? permalink award report block reply\nStanwyk74 4 points 7 days ago Yeah yeah yeah they tried to kill you and no one even charged yet permalink award report block reply\norange_kek_great 4 points 7 days ago I don't see anyone on \"our side\" fighting. permalink award report block reply\ngeekesmind 4 points 7 days ago stop bailing out other countries FUCK THEM!  AMERICA FIRST! permalink award report block reply\nProf_Smith 4 points 7 days ago I have yet to see any proof that this continues without Trump. People don’t turn out.   It just doesn’t happen. Dems can dick around till 2026 and 2028 and then we go back to weak republicans pretending to be opposition to democrats. Vance might be the only option moving forward and even he came out today and pretty much said start working on domestic issues because the country is fucked. You also need to get the entire party to stop being a bunch of bitches.  The Dems elected a guy who wanted to see republican kids dead and the republicans spend days and days apologizing for using harsh language in private chats. permalink award report block reply seangalt 1 points 7 days ago Myopia is not a virtue. permalink parent award report block reply Prof_Smith 1 points 7 days ago Neither is denial. permalink parent award report block reply\nseangalt 1 points 7 days ago Myopia is not a virtue. permalink parent award report block reply Prof_Smith 1 points 7 days ago Neither is denial. permalink parent award report block reply\nProf_Smith 1 points 7 days ago Neither is denial. permalink parent award report block reply\nScipio_Americanus 4 points 7 days ago I thought we were going to get tired of winning, but I'm still tired of our side losing. permalink award report block reply starjello 3 points 7 days ago pretty accurate. permalink parent award report block reply\nstarjello 3 points 7 days ago pretty accurate. permalink parent award report block reply\njlange94 4 points 7 days ago Talk talk talk talk talk talk talk talk talk and more talk. permalink award report block reply\nImnotnorm 4 points 7 days ago Oh is it starting again? It's been 8 fucking years permalink award report block reply\nAggrieved03 4 points 7 days ago Fight? I don’t see any fighting just the usual swamp robbing us blind. permalink award report block reply\nNickL 3 points 7 days ago What movement you said you don’t need us GFY permalink award report block reply\ncuqu2 3 points 7 days ago the sentiment here now...holy shit tide has turned permalink award report block reply\nObliv1 3 points 7 days ago is he talking about the fight to save America or the fight against Tucker Carlson for talking too much truth? permalink award report block reply\nbearhugprolapse 3 points 7 days ago fucking whatever dude. permalink award report block reply\nCali_kid 3 points 7 days ago Hopefully Mr President permalink award report block reply\nNineteenEightyFour 3 points 7 days ago Is this his way of telling us that we're going to war with Iran because Bibi says so? permalink award report block reply\nSaltman5000 3 points 7 days ago Well I have some bad news for you Donald, you moved too slow and now your movement is completely fucked and the Democrats are going to steal the primaries and there's nothing you can do about it. Why the fuck isn't Scott Pressler leading anything? permalink award report block reply seangalt 0 points 7 days ago It's because of Doomer Faggots like you that i quit watching and listening to Salty Faggot. permalink parent award report block reply Saltman5000 1 points 6 days ago Bro Donald Trump isn't going to do anything, he isn't going to have anyone arrested, he isn't going to change politics, he's probably going to end up in prison with the rest of his family and anyone who supported him. The Democrats have literally beaten him every step of the way and there's nothing he can do cuz he doesn't have the balls to do it. permalink parent award report block reply seangalt 1 points 5 days ago Doomer, you are not my bro.  You are either a dupe of the [DS] Propaganda Machine, or a Glowie sent to sow division.  Stuff it back up your ass where that shit you spew came from. My IQ is way too high to fall for your garbage bullshit vomit crap.\nAlso, i am ex-mil, and i never quit. permalink parent award report block reply\nseangalt 0 points 7 days ago It's because of Doomer Faggots like you that i quit watching and listening to Salty Faggot. permalink parent award report block reply Saltman5000 1 points 6 days ago Bro Donald Trump isn't going to do anything, he isn't going to have anyone arrested, he isn't going to change politics, he's probably going to end up in prison with the rest of his family and anyone who supported him. The Democrats have literally beaten him every step of the way and there's nothing he can do cuz he doesn't have the balls to do it. permalink parent award report block reply seangalt 1 points 5 days ago Doomer, you are not my bro.  You are either a dupe of the [DS] Propaganda Machine, or a Glowie sent to sow division.  Stuff it back up your ass where that shit you spew came from. My IQ is way too high to fall for your garbage bullshit vomit crap.\nAlso, i am ex-mil, and i never quit. permalink parent award report block reply\nSaltman5000 1 points 6 days ago Bro Donald Trump isn't going to do anything, he isn't going to have anyone arrested, he isn't going to change politics, he's probably going to end up in prison with the rest of his family and anyone who supported him. The Democrats have literally beaten him every step of the way and there's nothing he can do cuz he doesn't have the balls to do it. permalink parent award report block reply seangalt 1 points 5 days ago Doomer, you are not my bro.  You are either a dupe of the [DS] Propaganda Machine, or a Glowie sent to sow division.  Stuff it back up your ass where that shit you spew came from. My IQ is way too high to fall for your garbage bullshit vomit crap.\nAlso, i am ex-mil, and i never quit. permalink parent award report block reply\nseangalt 1 points 5 days ago Doomer, you are not my bro.  You are either a dupe of the [DS] Propaganda Machine, or a Glowie sent to sow division.  Stuff it back up your ass where that shit you spew came from. My IQ is way too high to fall for your garbage bullshit vomit crap.\nAlso, i am ex-mil, and i never quit. permalink parent award report block reply\ncorntortilla 3 points 7 days ago Yeah? Let me know when you decide to start fighting? permalink award report block reply\nSeeker_17 3 points 7 days ago I don't see us winning as long as immigrants decide elections like it just happened in NYC. This is fucking unreal. We need to end immigration, and mass deportations of 3rd worlders now. permalink award report block reply mailinvoter 3 points 7 days ago Don't forget the liberal White women. They're a bigger problem than immigrants. permalink parent award report block reply\nmailinvoter 3 points 7 days ago Don't forget the liberal White women. They're a bigger problem than immigrants. permalink parent award report block reply\nAlabama_Front_Butt 3 points 7 days ago 2 weeks permalink award report block reply\ntuaris 3 points 7 days ago In all seriousness... CA, NJ, VA, and NYC shouldn't be a disappointing shocker. The GOP could have thrown large amounts of money at this and risk still losing.  In my opinion, the funds are best used in 2026. permalink award report block reply starjello 3 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans permalink parent award report block reply\nstarjello 3 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans permalink parent award report block reply\nOG_BACONndEGGs 3 points 7 days ago Was the message approved by Bibi? permalink award report block reply\nPats5x 3 points 7 days ago Copium permalink award report block reply\njimboonie 3 points 7 days ago Oh really? Do something then. permalink award report block reply\ncovok48 2 points 7 days ago Make our lives better. I am convinced you’re still living in 2019. permalink award report block reply\nRimbus_Reynolds 2 points 7 days ago What is this in reference too permalink award report block reply starjello 1 points 7 days ago Right wing extremists.People  who took the Epstein situation seriously. permalink parent award report block reply oilybohunkofshit 0 points 7 days ago Comment removed by community moderators. permalink parent award report block reply\nstarjello 1 points 7 days ago Right wing extremists.People  who took the Epstein situation seriously. permalink parent award report block reply oilybohunkofshit 0 points 7 days ago Comment removed by community moderators. permalink parent award report block reply\noilybohunkofshit 0 points 7 days ago Comment removed by community moderators. permalink parent award report block reply\nOmegaBird 2 points 7 days ago Trump, you are turning into Obama and not doing a whole hell of a lot. The wins are tiny, sparse and yet you ride them like they are grand and epic. Demoncrats are but behind bars, the J6 are not being investigated, the epstine conspirators are not in jail, fauci has not been executed. There is very little fight in you and very little winning. permalink award report block reply\nmoscowjade 2 points 7 days ago Getting the communists out will take generations permalink award report block reply\n13Maga135 2 points 7 days ago https://x.com/EdKrassen/status/1986240225899639267 look who wants to move to new york, maybe he can live next door to madami permalink award report block reply\nsully 2 points 7 days ago Our fight has been beginning for 10 years now permalink award report block reply\nLePEDES 2 points 7 days ago So do some Washington/LINCOLN type shit… permalink award report block reply\nKneadThePeople 2 points 7 days ago Cool, when are you going to support your J6ers? permalink award report block reply TOPDAWG23 5 points 7 days ago He freed them what do you want. permalink parent award report block reply KneadThePeople 1 points 7 days ago I am one. Not all of us have been pardoned (some only received commutations) and exactly ZERO of us have received any accountability, justice or restitution. permalink parent award report block reply\nTOPDAWG23 5 points 7 days ago He freed them what do you want. permalink parent award report block reply KneadThePeople 1 points 7 days ago I am one. Not all of us have been pardoned (some only received commutations) and exactly ZERO of us have received any accountability, justice or restitution. permalink parent award report block reply\nKneadThePeople 1 points 7 days ago I am one. Not all of us have been pardoned (some only received commutations) and exactly ZERO of us have received any accountability, justice or restitution. permalink parent award report block reply\nThePatriotGames2016 2 points 7 days ago you have 3 fucking years. Better get moving. permalink award report block reply TOPDAWG23 2 points 7 days ago Just be realistic he has to admit terms till they remove him. He needs to go scorched Earth on both the Democrats and Republicans fix the shit now or just fuck off. permalink parent award report block reply\nTOPDAWG23 2 points 7 days ago Just be realistic he has to admit terms till they remove him. He needs to go scorched Earth on both the Democrats and Republicans fix the shit now or just fuck off. permalink parent award report block reply\nAntiluminati 2 points 7 days ago Who said it’s over? What’s going on here? Are people really that black pilled over like a few stupid elections that we already knew the way they were gonna turn out. Seriously someone explain this to me. permalink award report block reply CrankyCrab 3 points 7 days ago Can't rationalize the irrational.  It's just the influx of doomers, gloomers and trolls. permalink parent award report block reply seangalt -1 points 7 days ago Doomers, Glowies, Agents Provocateur.  It's a Divide and Conquer PsyOp. God Bless MAGA and God Bless POTUS DJT permalink parent award report block reply\nCrankyCrab 3 points 7 days ago Can't rationalize the irrational.  It's just the influx of doomers, gloomers and trolls. permalink parent award report block reply\nseangalt -1 points 7 days ago Doomers, Glowies, Agents Provocateur.  It's a Divide and Conquer PsyOp. God Bless MAGA and God Bless POTUS DJT permalink parent award report block reply\nSammy77 2 points 7 days ago Quit sucking Israeli dick and do something about jobs and prices. Also address wages. Quit addressing shit that doesn’t benefit the everyday American. AMERICA FIRST! permalink award report block reply\nHenkZeilstra 2 points 7 days ago Fire Pam Bondi and Kash permalink award report block reply\nSurfsup 2 points 6 days ago Got the first three words in there permalink award report block reply\nBeardholder 2 points 6 days ago If he started actually arresting all the traitors and commies and Muslims the battle would have been over already m permalink award report block reply\nTrumpIsTheVictor 2 points 7 days ago Didn't he call us \"Right Wing Extremists\"? permalink award report block reply Metal4Freedom 1 points 7 days ago We are!! Proudly!!! permalink parent award report block reply TrumpIsTheVictor 1 points 6 days ago He didn't say it is a complimentary manner. permalink parent award report block reply\nMetal4Freedom 1 points 7 days ago We are!! Proudly!!! permalink parent award report block reply TrumpIsTheVictor 1 points 6 days ago He didn't say it is a complimentary manner. permalink parent award report block reply\nTrumpIsTheVictor 1 points 6 days ago He didn't say it is a complimentary manner. permalink parent award report block reply\nObliv1 2 points 7 days ago yeah i'll believe it when he fires Wiles, Rubio, Ratcliffe, Bondi, Kash, Lutnick, Bessent, and actually puts MAGA populists in power like he had with Bannon before he got butthurt he was getting too much spotlight. Or hell maybe give the finger to Ukraine and Israel? do something... anything to put America 1st as the damn president of the USA Or stop edging on new wars no one wants? Or stop using tariffs as a response to people that piss you off (Canada runs ad = tariff?) or to the benefit of globohomo (tariff india to help Ukraine?) to the point where SCOTUS might actually rule 9-0 to send that emergency power back to congress? Or stop saying the Epstein list and files are a democrat Hoax when all your people pre election said it would be epic? Or don't ignore the grocery prices and brag they are down when we all have eyes and aren't seeing much change at the stores. and double stupid to do that while building an expansion to WH to host balls and Gatsby style feasts... a let them eat cake look. Trump is a masterful marketer but damn if that dude is terrible at filling out a staff. 90% rinos and deepstate. permalink award report block reply\nNonbinaryPotatohead 2 points 6 days ago \"2 more weeks\" Trump stop appointing retards to key positions! Wasting years of opportunity! Start appointing your voter base instead who will get the job done without fear of the consequences! permalink award report block reply\nLogan051361 2 points 7 days ago What does that mean?? permalink award report block reply\nunotrumpcard 2 points 6 days ago People just want everything fixed instantly. Trump was only just elected and has not had the time to get the ball moving yet. permalink award report block reply\nMaxdady01 1 points 7 days ago ...in Burundi now?  Am i right?!? permalink award report block reply\ncovok48 1 points 7 days ago Only Israelis love him right now. permalink award report block reply\nDCYR66 1 points 7 days ago Problem is our side is a party of wimps and will never have the drive of our enemies. Fuck the GOP for allowing dems to steamroll us at every turn. Say goodbye to our majority in midterms. permalink award report block reply\nDITTOPatriot 1 points 6 days ago LOL, a rudderless ship in a sea storm bumping into everything in sight. permalink award report block reply\nThomm 1 points 7 days ago To Trump, tweets like this are “fighting” permalink award report block reply\nEy3sOpen 1 points 7 days ago Oh really? Release the Epstein files then. permalink award report block reply\nmercynurse 1 points 7 days ago Amen permalink award report block reply\nDenturesNancy 1 points 7 days ago how about you tell your blondi bitch to actually start prosecuting all the commies with proven criminal acts.  all capitals messages are nothing but screams of a drowning man.  your doj is failing you and everyone is witnessing it permalink award report block reply\nMrMcGreenGenes 1 points 7 days ago Quit hitting ourselves. permalink award report block reply\nAnonymousFrog 1 points 7 days ago Well, he’s clearly trying to kill it with these clowns he appointed to the FBI acting like Epstein killed himself and didn’t really traffic anyone anyway. How about a war in Iran? Maybe Venezuela? How about Trump Gaza? Oh, and did I remind you guys of how safe and effective the Covid vaccine is? Oh, and BTW, it was Tylenol causing all the autism, totally not vaccines. What a disaster. permalink award report block reply\nstingyarthropods 1 points 7 days ago so he's finally going to solve the goat fucker invasion? permalink award report block reply\nTOPDAWG23 1 points 7 days ago This just makes it sound like Trump lost   blue people replaced blue people in blue States. permalink award report block reply\nDarkKnightPatriot 1 points 6 days ago Just begun? Really? Then what is the general consensus on the lead up to the beginning as stated by Trump now? It feels a little drag assey and falling way short of the basic expectations of a revolution. Seems like its all being orchestrated to have just enough punch and kick to keep real fighters and patriots from taking control of the movement. Seems like the GOP is still full of flacid geriatric fucks that are too weak to fight Radicals, Leftists and Globalist Commies and the  Patriot/Q movement is filled more with 'by the book/follow the plan' Religious Zealots, Boomer Peaceniks, and Low T Hero Worshipers than actual fighters and revolutionaries. permalink award report block reply\ngp7373 1 points 7 days ago \"Our fight has only just begun, again...again....... permalink award report block reply\nCovfefebrulee 1 points 6 days ago JUST ENFORCE THE EXISTING LAWS FFS! permalink award report block reply\nOpi33 1 points 7 days ago Meh. permalink award report block reply\nLynnforthetruth 1 points 7 days ago Hello world\nCan someone please create a spray bottle of pigs blood that Women and girls can carry for protection permalink award report block reply\nbirb_never_dies 1 points 7 days ago He would sound better if he said that without a Jew cock in his mouth ... permalink award report block reply\nDoubleu1992 0 points 7 days ago Cool but we still lose midterms permalink award report block reply\njosiborg 0 points 7 days ago Quit being a pussy. The only way to win someone else's game is not play it. permalink award report block reply\nRedwhiteblueFe 0 points 7 days ago Nick fuentes 2032 permalink award report block reply\nUltraMAGAMilton -1 points 7 days ago Cute  . . permalink award report block reply\nseangalt -3 points 7 days ago Do NO let the [DS] Infiltrator Agents Provocateur DIVIDE and CONQUER us.  They are the ones who come in here and talk all kinds of shit about Trump's Administration, about the Epstein crap, about \"the Jews,\" etc.  They do this to DIVIDE and CONQUER.  Fuck those Glowie Faggots all the way to hell. God bless the Trump Administration and God bless the United States of America and God Bless President Donald J. Trump. MAGA permalink award report block reply guywholikesDjtof2024 3 points 7 days ago You're the divider. Epstien was a legit concern. permalink parent award report block reply starjello 2 points 7 days ago Get lost Q faggot. Go back to the gay awankening you moronic cultist. You fell for a CIA psyop you glowing glowie Infiltrator. permalink parent award report block reply\nguywholikesDjtof2024 3 points 7 days ago You're the divider. Epstien was a legit concern. permalink parent award report block reply\nstarjello 2 points 7 days ago Get lost Q faggot. Go back to the gay awankening you moronic cultist. You fell for a CIA psyop you glowing glowie Infiltrator. permalink parent award report block reply\nMhmm2MoreWeeks -3 points 7 days ago He is mistaken. We will be divided by the Woke Right. Uniparty will cheat back into power. permalink award report block reply ChilledCovfefe 1 points 7 days ago All this jew and Epstein shit is dividing maga as planned. Keep falling for it folks. I trust Trump. He doesn’t always do things the way WE want but he gets shit done. permalink parent award report block reply guywholikesDjtof2024 1 points 7 days ago \"The E files were destroyed before Trump ever took office\" is a likely theory. Do you really believe they would let the good guys have anything? LOOOL. Admit it. All evidence was withheld from Trump and tons of it destroyed. That's why there's no arrests nor mass exposure. permalink parent award report block reply\nChilledCovfefe 1 points 7 days ago All this jew and Epstein shit is dividing maga as planned. Keep falling for it folks. I trust Trump. He doesn’t always do things the way WE want but he gets shit done. permalink parent award report block reply guywholikesDjtof2024 1 points 7 days ago \"The E files were destroyed before Trump ever took office\" is a likely theory. Do you really believe they would let the good guys have anything? LOOOL. Admit it. All evidence was withheld from Trump and tons of it destroyed. That's why there's no arrests nor mass exposure. permalink parent award report block reply\nguywholikesDjtof2024 1 points 7 days ago \"The E files were destroyed before Trump ever took office\" is a likely theory. Do you really believe they would let the good guys have anything? LOOOL. Admit it. All evidence was withheld from Trump and tons of it destroyed. That's why there's no arrests nor mass exposure. permalink parent award report block reply\nGreenLeader1 4 points 7 days ago Comment removed upon the user being banned. permalink award report block reply\noilybohunkofshit 1 points 7 days ago Comment removed by community moderators. permalink award report block reply\nILoveGoatFucking 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply\nnew_guy2 1 points 7 days ago Comment removed by community moderators. permalink award report block reply\noilybohunkofshit 1 points 7 days ago Comment removed by community moderators. permalink award report block reply\nthe_new_one 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:13:48.656947Z"
}