{
  "id": "1ARK9iqP1E",
  "url": "https://patriots.win/p/1ARK9iqP1E/rep-nancy-pelosis-daughter-dca-c/c",
  "content": "976 Rep. Nancy Pelosi’s daughter (D-CA), Christine Pelosi, announces she is running to be a California State Senator. \n\n“In courtrooms, campaigns and corridors of power, I’ve fought to build Power For The People. And that’s why I’m running for California Senate.” posted 2 days ago by Eruditio 127 comments award share report block RedWave Press @RedWave_Press • 2d NEW: Rep. Nancy Pelosi’s daughter (D-CA), Christine Pelosi, announces she is running to be a California State Senator. “In courtrooms, campaigns and corridors of power, I’ve fought to build Power For The People. And that’s why I’m running for California Senate.” Ahh yes,\n127 comments Sort by Top Top New Worst Old Save MedicallyReddit 121 points 2 days ago Just another money launderer permalink award report block reply IvIA6A 44 points 2 days ago \"attorney, author, and great stock picker. Together my mom and I beat the best stock portfolios, including Warren Buffett 7 times over\" permalink parent award report block reply deleted 10 points 2 days ago permissible_missile 4 points 2 days ago This mean's either Gavin's mother or father is a sibling to Nancy. So, which is it? permalink parent award report block reply Filo76 2 points 2 days ago Gavin Newsom and Nancy Pelosi are related through marriage; Newsom's aunt, Barbara Newsom, was married to Ron Pelosi, Nancy Pelosi's brother-in-law. They aren’t blood relatives. permalink parent award report block reply view 4 more comments... salt-collector 0 points 2 days ago both.lol permalink parent award report block reply IncredibleMrE1 11 points 2 days ago She's running for the seat that gay child rapist Scott Wiener currently holds, and he is running for Nancy's seat against AOC's former chief of staff. Wiener's seat isn't up for grabs until 2028 unless he wins, though. So I'm guessing the California machine will make it happen. permalink parent award report block reply KernalMustard 7 points 2 days ago Musical chairs. permalink parent award report block reply Whoopies_tds 4 points 2 days ago Installed money launderer probably with the same impeccable ability to pick stocks permalink parent award report block reply Gletkin 3 points 2 days ago Just another member of the Pelosi/Newsom crime family continuing the family business. These evil fucks clearly do not give the tiniest shit how much they are hated. permalink parent award report block reply TruthWillOut 2 points 2 days ago Time to put an end to crimes of the the Pelosi crime family. permalink parent award report block reply load 3 more comments... MooseStangSally 55 points 2 days ago You guys thought Pelosi was done with insider trading??? permalink award report block reply 2008RonPaul2012 49 points 2 days ago Mobbed up like her whole family permalink award report block reply JoeBidensDementia1 44 points 2 days ago $200 million isn't enough for the entire fam? permalink award report block reply deleted 25 points 2 days ago JoeBidensDementia1 1 points 2 days ago Where is that coming from? Honest question. permalink parent award report block reply deleted 2 points 2 days ago Friar_Pede 2 points 2 days ago I've given up hope on the inflation death spiral permalink parent award report block reply LaVaughnRobinson 1 points 2 days ago butt buttttt mUh LowEr IntErestett RaT3s everyone fucking wants on here permalink parent award report block reply harryparatestes 6 points 2 days ago Not when there's an entire state treasury to plunder. permalink parent award report block reply CommonSenseAmerican 5 points 2 days ago It's never enough with these people. permalink parent award report block reply SHILL_DETECTOR 4 points 2 days ago they want power permalink parent award report block reply Taqiyya_Mockingbird 32 points 2 days ago She’s an accessory to the J6 setup. Had a documentary film crew all set up and ready to film everything. permalink award report block reply Idontevenknow 11 points 2 days ago This, implicated in the narrative. permalink parent award report block reply Joeret 17 points 2 days ago Let me guess; she’s a really good stock picker too. permalink award report block reply clownworld30330 3 points 2 days ago Well, she will be, yes, just not quite yet. permalink parent award report block reply MemeWarsVet 15 points 2 days ago barf permalink award report block reply SavingPrivateGrace 4 points 2 days ago She got some bad genes. permalink parent award report block reply OutlawPurpleHairDye 14 points 2 days ago I wouldn't trust her with anything except my stock portfolio. permalink award report block reply airborne3502 13 points 2 days ago Ugh. This is like when you think the Kardashians are finally gone, and here comes a Jenner. Saw this one coming. She'll win. permalink award report block reply Chickapede 11 points 2 days ago She's an accessory to treason.  Wasn't she there all day filming it? permalink award report block reply Rudy_DankMemer 10 points 2 days ago Wasn't she there all day filming it? When her mother was too plowed to continue, Chistine stepped in to finish writing the script... she is guilty af. permalink parent award report block reply covefefe_energy 1 points 2 days ago Probably why she's running. To have the power of shaping public influence over her crimes. permalink parent award report block reply COnDEMnED 10 points 2 days ago She has J6 problems, so this will be entertaining to see how it plays out. Running for office won’t save you? permalink award report block reply tired_of_leftists 7 points 2 days ago No More Kings!!! (Nevermind the Bush family, the Cheney family, the Clinton family, The Murkowski family, and on and on. And now potentially the Pelosi family. ) Trump is a King and the problem here!!!!! permalink award report block reply IvIA6A 6 points 2 days ago Revolving door of California politics. Better check her mortgages and brokerage account permalink award report block reply thelastlast 6 points 2 days ago we're going to hurt this family.  as a country.  they just don't realize it yet. permalink award report block reply tuaris 6 points 2 days ago Nancy has respawed.  She's left the decaying corpse and jumped into a new one.  It calls itself \"Christine\" now. permalink award report block reply RiffFantastic 6 points 2 days ago We thought we could get rid of her.  Jokes on us. permalink award report block reply mty_green_go 1 points 2 days ago it has spawn!! obviously from 80 years ago before abortion was legalized permalink parent award report block reply Datamancer 5 points 2 days ago power for the people Fucking communist. permalink award report block reply VirTW 4 points 2 days ago Her face looks like it has had some kind of botched plastic surgery permalink award report block reply covefefe_energy 2 points 2 days ago Her and Chelsea Clinton got hit by the ugly bus. permalink parent award report block reply Brownwaterboys 3 points 2 days ago one hag goes down another rises from the swamp permalink award report block reply Formerlurker92 3 points 2 days ago We don't have royalty in this country, but we do have dynasties. And that's functionally the same thing permalink award report block reply mty_green_go 3 points 2 days ago oh god it looks like an abomination. why wasn't abortion legal 80 years ago? permalink award report block reply 2025WhatIsTrue 3 points 2 days ago She was part of the Jan 6th government overthrow plot.  Shouldn't this worthless piece of **** be arrested and thrown in prison when found guilty???  What a pathetic jerk. permalink award report block reply DaveyBoyKag 3 points 2 days ago My god these people are like bedbugs they won’t go away! permalink award report block reply Ferretman 2 points 2 days ago WAIT WAIT WAIT....somebody bred with her? Huh. permalink award report block reply Sunnybats2 2 points 2 days ago She needs to share a cell with mommy for Fedsurrection times permalink award report block reply ThouShallNotSteal 2 points 2 days ago Hasn't everyone had enough of these fuckers? But you know damned well this skank will get \"elected\". It's such a fucking farcical phenomenon. permalink award report block reply ElectionDenier2020 1 points 2 days ago Neposkank permalink parent award report block reply lul_cheto 2 points 2 days ago No kings... Just political dynastys permalink award report block reply Buck_O_Five 2 points 2 days ago No kings they say, just our royal families. permalink award report block reply Smurfection 2 points 2 days ago Enough with the friggin' dynasties.  We do not have a political class in America and we shouldn't.   We're supposed to be represented by real people who have lived real lives.  Not wealthy scions who have checked the right boxes, went to the right schools and greased the skids enough. permalink award report block reply RexCollumSilvarum 2 points 2 days ago They say \"no kings\", but they don't have much of a problem with a hereditary government. permalink award report block reply HeatherSwanson 2 points 2 days ago How are the pendejo Mexicanos and Latinos okay with this? They are literally the majority population in California yet the Italian mafia and the Getty family pick who rules. permalink award report block reply Steve56775 2 points 2 days ago Mom showed her that grift and corruption pay well permalink award report block reply HumblePepe 2 points 2 days ago \"I've bought to build power for my family and myself.\" permalink award report block reply FuckRedditMAGAMAGA 1 points 2 days ago Thar she blows! permalink award report block reply Ricky_CIA 1 points 2 days ago That can be fixed very easily. permalink award report block reply SimaYi 1 points 2 days ago No Kings, but hereditary rule is fine. permalink award report block reply DeepStateParasite 1 points 2 days ago Those insider trades aren't going to pick themselves! permalink award report block reply NoMoreShinesBilly 1 points 2 days ago malodorous skank. TFD permalink award report block reply barwhack 1 points 2 days ago Oh good. Hammered Time 3, the sequel sequel. This time it's snatchier. permalink award report block reply YodaBannon 1 points 2 days ago frrrrrrrrrrrt permalink award report block reply Dev404 1 points 2 days ago Gee, another career criminal politician looking to steal her millions next. permalink award report block reply catsfive 1 points 2 days ago This makes absolutely no sense.... does anyone here speak communist permalink award report block reply AnnieMm 1 points 2 days ago Nooooooo! permalink award report block reply lifeisahologram 1 points 2 days ago This is the first time I’ve ever see this woman and I hate her so much for how fake and retarded she is. permalink award report block reply Hambonemcgee 1 points 2 days ago Dynasty's dynastying! permalink award report block reply Jonald_Trump 1 points 2 days ago No Queens…this isn’t a Monarchy permalink award report block reply ParticleCannon 1 points 2 days ago No, you're running because Mom's portfolio stopped growing permalink award report block reply 1LoathsomeDove 1 points 1 day ago The scepter & orb are generally inherited by right of birth.\nThe princess becomes the queen.\nAll hail the monarchy. permalink award report block reply WanderingStar 1 points 2 days ago Her Mom still has a number of schemes (think J6) to pull on the American people and dearest daughter can film those too! permalink award report block reply Live_free_or_die_55 1 points 2 days ago Never another pelosi!!! Hammer time!! permalink award report block reply Prandogolio 1 points 2 days ago Political families are parasites permalink award report block reply sumnayin2 1 points 2 days ago I'm sure she can point out change she has made. Not just words..but actual change. I'll wait. permalink award report block reply ReturnOfSmarm 1 points 2 days ago Forgot that these fuckers get drunk and breed. permalink award report block reply Mcrumples 1 points 2 days ago Oh great. We got away from kings and dynasties in our chief executive, only to have it exist in the senate. Just fucking dandy permalink award report block reply rivetjoint2 1 points 2 days ago She should just run for Nancy's seat. permalink award report block reply utfanx2 1 points 2 days ago Didn't know Paul the hammer and Nancy the hammered had it in them. permalink award report block reply Nick-Kerr 1 points 2 days ago California, (non-sarcastically unfortunately) #NoKings Oh wait, another Getty, Pelosi, Newsom heir? Yes please! permalink award report block reply Texas_81 1 points 2 days ago Wild… permalink award report block reply CaTrumpFan 1 points 2 days ago The Pelosi family need to keep up the insider trading. permalink award report block reply mohel 1 points 2 days ago Scott Wiener replaces Pelosi, Pelosi daughter replaces Wiener. permalink award report block reply salt-collector 1 points 2 days ago In your FACE America...pretty much what this is.\nOne cunt retires the next cunt comes in. This country is so FKED permalink award report block reply Easzq8 1 points 2 days ago I can’t believe somebody schtupped Nancy. permalink award report block reply DontTreadOnLego 1 points 2 days ago No more Bushes, no more Cheneys, no more Clintons, no more Pelosis permalink award report block reply Than0sIII 1 points 2 days ago Of course she's carrying on her mom's business. permalink award report block reply mav7579 1 points 2 days ago She's a real beauty! Just kidding lol. permalink award report block reply WolfLoud 1 points 2 days ago Here we go again. permalink award report block reply SHILL_DETECTOR 1 points 2 days ago fuck, another permenant fixture?? permalink award report block reply redneckrevival 1 points 2 days ago Another silver spoon useless BITCH!!!! permalink award report block reply KungFlu4u 1 points 2 days ago She sees momma wiping her wrinkled ass, with hundred dollar bills & says to herself, self….i gotta get me some of that. Last thing this country needs, is another Pelosi in government. GTFO! permalink award report block reply Juzeza 1 points 2 days ago Dynastic coronation permalink award report block reply Decepticons-superior 1 points 2 days ago It would be nice if she lost, but all a prominent Democrat has to do in California is announce that they are intending to run and the office is theirs. Adam Schiff has no business being a Senator, let alone out of prison, but that’s what he wanted, so that’s what he got. permalink award report block reply spinometer2 1 points 2 days ago is she the one filming j6? she should be in jail permalink award report block reply gofishoregon 1 points 2 days ago Daddy needs those stock tips. permalink award report block reply Bob_sacamanao 1 points 2 days ago Going to run for san fransisco and rule over hordes of illegal aliens,  junkies,  and thousands of pounds of feces on the streets every day from junkies! permalink award report block reply Im_RickSteves_bitch 1 points 2 days ago 🤮 permalink award report block reply TheLeftIsAntiRight 1 points 2 days ago That's already her position. No election necessary. She's going to be \"voted in\". That's why Nancy retired. permalink award report block reply crabpapple 1 points 2 days ago Modern day politics are a joke. permalink award report block reply Eurpoean 1 points 2 days ago Fighting for a bunch of groups that aren't me. Fuck you and fuck off. permalink award report block reply aaafirefly123 1 points 2 days ago What a fucked up dynasty. permalink award report block reply mass55th 1 points 2 days ago Somehow she thinks she's privileged, because her retarded, drunk mother held that seat, and wasn't qualified either. permalink award report block reply Speedgraphic69 1 points 2 days ago Fuck me Agnes permalink award report block reply Nellie_the_Beaut 1 points 2 days ago Interesting.  I thought for sure Nancy had her set up to take her place in the U.S. Congress. Maybe she still does - getting Christina some experience first. permalink award report block reply papa_newguineapig 1 points 2 days ago SURELY we as Americans don't let allow this to happen right? I mean...SOMETHING has to happen. permalink award report block reply top_eagle 1 points 2 days ago Why she so fat? permalink award report block reply aqua27 1 points 2 days ago Like a kingdom passing power from one generation to another. permalink award report block reply America_No_1 1 points 2 days ago About as unlikeable as Kamala permalink award report block reply Steve1 1 points 2 days ago What a load of crap - Got to keep the family GRIFT going permalink award report block reply GontMawr 1 points 2 days ago Are you ready for another Pelosi in power for 50+ years? permalink award report block reply pingpongdingdong 1 points 2 days ago never held a real job in her life. permalink award report block reply TrumpLandslide20201 1 points 2 days ago Legacy of corruption and death! permalink award report block reply\nMedicallyReddit 121 points 2 days ago Just another money launderer permalink award report block reply IvIA6A 44 points 2 days ago \"attorney, author, and great stock picker. Together my mom and I beat the best stock portfolios, including Warren Buffett 7 times over\" permalink parent award report block reply deleted 10 points 2 days ago permissible_missile 4 points 2 days ago This mean's either Gavin's mother or father is a sibling to Nancy. So, which is it? permalink parent award report block reply Filo76 2 points 2 days ago Gavin Newsom and Nancy Pelosi are related through marriage; Newsom's aunt, Barbara Newsom, was married to Ron Pelosi, Nancy Pelosi's brother-in-law. They aren’t blood relatives. permalink parent award report block reply view 4 more comments... salt-collector 0 points 2 days ago both.lol permalink parent award report block reply IncredibleMrE1 11 points 2 days ago She's running for the seat that gay child rapist Scott Wiener currently holds, and he is running for Nancy's seat against AOC's former chief of staff. Wiener's seat isn't up for grabs until 2028 unless he wins, though. So I'm guessing the California machine will make it happen. permalink parent award report block reply KernalMustard 7 points 2 days ago Musical chairs. permalink parent award report block reply Whoopies_tds 4 points 2 days ago Installed money launderer probably with the same impeccable ability to pick stocks permalink parent award report block reply Gletkin 3 points 2 days ago Just another member of the Pelosi/Newsom crime family continuing the family business. These evil fucks clearly do not give the tiniest shit how much they are hated. permalink parent award report block reply TruthWillOut 2 points 2 days ago Time to put an end to crimes of the the Pelosi crime family. permalink parent award report block reply load 3 more comments...\nIvIA6A 44 points 2 days ago \"attorney, author, and great stock picker. Together my mom and I beat the best stock portfolios, including Warren Buffett 7 times over\" permalink parent award report block reply deleted 10 points 2 days ago permissible_missile 4 points 2 days ago This mean's either Gavin's mother or father is a sibling to Nancy. So, which is it? permalink parent award report block reply Filo76 2 points 2 days ago Gavin Newsom and Nancy Pelosi are related through marriage; Newsom's aunt, Barbara Newsom, was married to Ron Pelosi, Nancy Pelosi's brother-in-law. They aren’t blood relatives. permalink parent award report block reply view 4 more comments... salt-collector 0 points 2 days ago both.lol permalink parent award report block reply\ndeleted 10 points 2 days ago permissible_missile 4 points 2 days ago This mean's either Gavin's mother or father is a sibling to Nancy. So, which is it? permalink parent award report block reply Filo76 2 points 2 days ago Gavin Newsom and Nancy Pelosi are related through marriage; Newsom's aunt, Barbara Newsom, was married to Ron Pelosi, Nancy Pelosi's brother-in-law. They aren’t blood relatives. permalink parent award report block reply view 4 more comments... salt-collector 0 points 2 days ago both.lol permalink parent award report block reply\npermissible_missile 4 points 2 days ago This mean's either Gavin's mother or father is a sibling to Nancy. So, which is it? permalink parent award report block reply Filo76 2 points 2 days ago Gavin Newsom and Nancy Pelosi are related through marriage; Newsom's aunt, Barbara Newsom, was married to Ron Pelosi, Nancy Pelosi's brother-in-law. They aren’t blood relatives. permalink parent award report block reply view 4 more comments... salt-collector 0 points 2 days ago both.lol permalink parent award report block reply\nFilo76 2 points 2 days ago Gavin Newsom and Nancy Pelosi are related through marriage; Newsom's aunt, Barbara Newsom, was married to Ron Pelosi, Nancy Pelosi's brother-in-law. They aren’t blood relatives. permalink parent award report block reply view 4 more comments...\nsalt-collector 0 points 2 days ago both.lol permalink parent award report block reply\nIncredibleMrE1 11 points 2 days ago She's running for the seat that gay child rapist Scott Wiener currently holds, and he is running for Nancy's seat against AOC's former chief of staff. Wiener's seat isn't up for grabs until 2028 unless he wins, though. So I'm guessing the California machine will make it happen. permalink parent award report block reply KernalMustard 7 points 2 days ago Musical chairs. permalink parent award report block reply\nKernalMustard 7 points 2 days ago Musical chairs. permalink parent award report block reply\nWhoopies_tds 4 points 2 days ago Installed money launderer probably with the same impeccable ability to pick stocks permalink parent award report block reply\nGletkin 3 points 2 days ago Just another member of the Pelosi/Newsom crime family continuing the family business. These evil fucks clearly do not give the tiniest shit how much they are hated. permalink parent award report block reply\nTruthWillOut 2 points 2 days ago Time to put an end to crimes of the the Pelosi crime family. permalink parent award report block reply\nMooseStangSally 55 points 2 days ago You guys thought Pelosi was done with insider trading??? permalink award report block reply\n2008RonPaul2012 49 points 2 days ago Mobbed up like her whole family permalink award report block reply\nJoeBidensDementia1 44 points 2 days ago $200 million isn't enough for the entire fam? permalink award report block reply deleted 25 points 2 days ago JoeBidensDementia1 1 points 2 days ago Where is that coming from? Honest question. permalink parent award report block reply deleted 2 points 2 days ago Friar_Pede 2 points 2 days ago I've given up hope on the inflation death spiral permalink parent award report block reply LaVaughnRobinson 1 points 2 days ago butt buttttt mUh LowEr IntErestett RaT3s everyone fucking wants on here permalink parent award report block reply harryparatestes 6 points 2 days ago Not when there's an entire state treasury to plunder. permalink parent award report block reply CommonSenseAmerican 5 points 2 days ago It's never enough with these people. permalink parent award report block reply SHILL_DETECTOR 4 points 2 days ago they want power permalink parent award report block reply\ndeleted 25 points 2 days ago JoeBidensDementia1 1 points 2 days ago Where is that coming from? Honest question. permalink parent award report block reply deleted 2 points 2 days ago Friar_Pede 2 points 2 days ago I've given up hope on the inflation death spiral permalink parent award report block reply LaVaughnRobinson 1 points 2 days ago butt buttttt mUh LowEr IntErestett RaT3s everyone fucking wants on here permalink parent award report block reply\nJoeBidensDementia1 1 points 2 days ago Where is that coming from? Honest question. permalink parent award report block reply deleted 2 points 2 days ago Friar_Pede 2 points 2 days ago I've given up hope on the inflation death spiral permalink parent award report block reply\ndeleted 2 points 2 days ago Friar_Pede 2 points 2 days ago I've given up hope on the inflation death spiral permalink parent award report block reply\nFriar_Pede 2 points 2 days ago I've given up hope on the inflation death spiral permalink parent award report block reply\nLaVaughnRobinson 1 points 2 days ago butt buttttt mUh LowEr IntErestett RaT3s everyone fucking wants on here permalink parent award report block reply\nharryparatestes 6 points 2 days ago Not when there's an entire state treasury to plunder. permalink parent award report block reply\nCommonSenseAmerican 5 points 2 days ago It's never enough with these people. permalink parent award report block reply\nSHILL_DETECTOR 4 points 2 days ago they want power permalink parent award report block reply\nTaqiyya_Mockingbird 32 points 2 days ago She’s an accessory to the J6 setup. Had a documentary film crew all set up and ready to film everything. permalink award report block reply Idontevenknow 11 points 2 days ago This, implicated in the narrative. permalink parent award report block reply\nIdontevenknow 11 points 2 days ago This, implicated in the narrative. permalink parent award report block reply\nJoeret 17 points 2 days ago Let me guess; she’s a really good stock picker too. permalink award report block reply clownworld30330 3 points 2 days ago Well, she will be, yes, just not quite yet. permalink parent award report block reply\nclownworld30330 3 points 2 days ago Well, she will be, yes, just not quite yet. permalink parent award report block reply\nMemeWarsVet 15 points 2 days ago barf permalink award report block reply SavingPrivateGrace 4 points 2 days ago She got some bad genes. permalink parent award report block reply\nSavingPrivateGrace 4 points 2 days ago She got some bad genes. permalink parent award report block reply\nOutlawPurpleHairDye 14 points 2 days ago I wouldn't trust her with anything except my stock portfolio. permalink award report block reply\nairborne3502 13 points 2 days ago Ugh. This is like when you think the Kardashians are finally gone, and here comes a Jenner. Saw this one coming. She'll win. permalink award report block reply\nChickapede 11 points 2 days ago She's an accessory to treason.  Wasn't she there all day filming it? permalink award report block reply Rudy_DankMemer 10 points 2 days ago Wasn't she there all day filming it? When her mother was too plowed to continue, Chistine stepped in to finish writing the script... she is guilty af. permalink parent award report block reply covefefe_energy 1 points 2 days ago Probably why she's running. To have the power of shaping public influence over her crimes. permalink parent award report block reply\nRudy_DankMemer 10 points 2 days ago Wasn't she there all day filming it? When her mother was too plowed to continue, Chistine stepped in to finish writing the script... she is guilty af. permalink parent award report block reply\ncovefefe_energy 1 points 2 days ago Probably why she's running. To have the power of shaping public influence over her crimes. permalink parent award report block reply\nCOnDEMnED 10 points 2 days ago She has J6 problems, so this will be entertaining to see how it plays out. Running for office won’t save you? permalink award report block reply\ntired_of_leftists 7 points 2 days ago No More Kings!!! (Nevermind the Bush family, the Cheney family, the Clinton family, The Murkowski family, and on and on. And now potentially the Pelosi family. ) Trump is a King and the problem here!!!!! permalink award report block reply\nIvIA6A 6 points 2 days ago Revolving door of California politics. Better check her mortgages and brokerage account permalink award report block reply\nthelastlast 6 points 2 days ago we're going to hurt this family.  as a country.  they just don't realize it yet. permalink award report block reply\ntuaris 6 points 2 days ago Nancy has respawed.  She's left the decaying corpse and jumped into a new one.  It calls itself \"Christine\" now. permalink award report block reply\nRiffFantastic 6 points 2 days ago We thought we could get rid of her.  Jokes on us. permalink award report block reply mty_green_go 1 points 2 days ago it has spawn!! obviously from 80 years ago before abortion was legalized permalink parent award report block reply\nmty_green_go 1 points 2 days ago it has spawn!! obviously from 80 years ago before abortion was legalized permalink parent award report block reply\nDatamancer 5 points 2 days ago power for the people Fucking communist. permalink award report block reply\nVirTW 4 points 2 days ago Her face looks like it has had some kind of botched plastic surgery permalink award report block reply covefefe_energy 2 points 2 days ago Her and Chelsea Clinton got hit by the ugly bus. permalink parent award report block reply\ncovefefe_energy 2 points 2 days ago Her and Chelsea Clinton got hit by the ugly bus. permalink parent award report block reply\nBrownwaterboys 3 points 2 days ago one hag goes down another rises from the swamp permalink award report block reply\nFormerlurker92 3 points 2 days ago We don't have royalty in this country, but we do have dynasties. And that's functionally the same thing permalink award report block reply\nmty_green_go 3 points 2 days ago oh god it looks like an abomination. why wasn't abortion legal 80 years ago? permalink award report block reply\n2025WhatIsTrue 3 points 2 days ago She was part of the Jan 6th government overthrow plot.  Shouldn't this worthless piece of **** be arrested and thrown in prison when found guilty???  What a pathetic jerk. permalink award report block reply\nDaveyBoyKag 3 points 2 days ago My god these people are like bedbugs they won’t go away! permalink award report block reply\nFerretman 2 points 2 days ago WAIT WAIT WAIT....somebody bred with her? Huh. permalink award report block reply\nSunnybats2 2 points 2 days ago She needs to share a cell with mommy for Fedsurrection times permalink award report block reply\nThouShallNotSteal 2 points 2 days ago Hasn't everyone had enough of these fuckers? But you know damned well this skank will get \"elected\". It's such a fucking farcical phenomenon. permalink award report block reply ElectionDenier2020 1 points 2 days ago Neposkank permalink parent award report block reply\nElectionDenier2020 1 points 2 days ago Neposkank permalink parent award report block reply\nlul_cheto 2 points 2 days ago No kings... Just political dynastys permalink award report block reply\nBuck_O_Five 2 points 2 days ago No kings they say, just our royal families. permalink award report block reply\nSmurfection 2 points 2 days ago Enough with the friggin' dynasties.  We do not have a political class in America and we shouldn't.   We're supposed to be represented by real people who have lived real lives.  Not wealthy scions who have checked the right boxes, went to the right schools and greased the skids enough. permalink award report block reply\nRexCollumSilvarum 2 points 2 days ago They say \"no kings\", but they don't have much of a problem with a hereditary government. permalink award report block reply\nHeatherSwanson 2 points 2 days ago How are the pendejo Mexicanos and Latinos okay with this? They are literally the majority population in California yet the Italian mafia and the Getty family pick who rules. permalink award report block reply\nSteve56775 2 points 2 days ago Mom showed her that grift and corruption pay well permalink award report block reply\nHumblePepe 2 points 2 days ago \"I've bought to build power for my family and myself.\" permalink award report block reply\nFuckRedditMAGAMAGA 1 points 2 days ago Thar she blows! permalink award report block reply\nRicky_CIA 1 points 2 days ago That can be fixed very easily. permalink award report block reply\nSimaYi 1 points 2 days ago No Kings, but hereditary rule is fine. permalink award report block reply\nDeepStateParasite 1 points 2 days ago Those insider trades aren't going to pick themselves! permalink award report block reply\nNoMoreShinesBilly 1 points 2 days ago malodorous skank. TFD permalink award report block reply\nbarwhack 1 points 2 days ago Oh good. Hammered Time 3, the sequel sequel. This time it's snatchier. permalink award report block reply\nYodaBannon 1 points 2 days ago frrrrrrrrrrrt permalink award report block reply\nDev404 1 points 2 days ago Gee, another career criminal politician looking to steal her millions next. permalink award report block reply\ncatsfive 1 points 2 days ago This makes absolutely no sense.... does anyone here speak communist permalink award report block reply\nAnnieMm 1 points 2 days ago Nooooooo! permalink award report block reply\nlifeisahologram 1 points 2 days ago This is the first time I’ve ever see this woman and I hate her so much for how fake and retarded she is. permalink award report block reply\nHambonemcgee 1 points 2 days ago Dynasty's dynastying! permalink award report block reply\nJonald_Trump 1 points 2 days ago No Queens…this isn’t a Monarchy permalink award report block reply\nParticleCannon 1 points 2 days ago No, you're running because Mom's portfolio stopped growing permalink award report block reply\n1LoathsomeDove 1 points 1 day ago The scepter & orb are generally inherited by right of birth.\nThe princess becomes the queen.\nAll hail the monarchy. permalink award report block reply\nWanderingStar 1 points 2 days ago Her Mom still has a number of schemes (think J6) to pull on the American people and dearest daughter can film those too! permalink award report block reply\nLive_free_or_die_55 1 points 2 days ago Never another pelosi!!! Hammer time!! permalink award report block reply\nPrandogolio 1 points 2 days ago Political families are parasites permalink award report block reply\nsumnayin2 1 points 2 days ago I'm sure she can point out change she has made. Not just words..but actual change. I'll wait. permalink award report block reply\nReturnOfSmarm 1 points 2 days ago Forgot that these fuckers get drunk and breed. permalink award report block reply\nMcrumples 1 points 2 days ago Oh great. We got away from kings and dynasties in our chief executive, only to have it exist in the senate. Just fucking dandy permalink award report block reply\nrivetjoint2 1 points 2 days ago She should just run for Nancy's seat. permalink award report block reply\nutfanx2 1 points 2 days ago Didn't know Paul the hammer and Nancy the hammered had it in them. permalink award report block reply\nNick-Kerr 1 points 2 days ago California, (non-sarcastically unfortunately) #NoKings Oh wait, another Getty, Pelosi, Newsom heir? Yes please! permalink award report block reply\nTexas_81 1 points 2 days ago Wild… permalink award report block reply\nCaTrumpFan 1 points 2 days ago The Pelosi family need to keep up the insider trading. permalink award report block reply\nmohel 1 points 2 days ago Scott Wiener replaces Pelosi, Pelosi daughter replaces Wiener. permalink award report block reply\nsalt-collector 1 points 2 days ago In your FACE America...pretty much what this is.\nOne cunt retires the next cunt comes in. This country is so FKED permalink award report block reply\nEaszq8 1 points 2 days ago I can’t believe somebody schtupped Nancy. permalink award report block reply\nDontTreadOnLego 1 points 2 days ago No more Bushes, no more Cheneys, no more Clintons, no more Pelosis permalink award report block reply\nThan0sIII 1 points 2 days ago Of course she's carrying on her mom's business. permalink award report block reply\nmav7579 1 points 2 days ago She's a real beauty! Just kidding lol. permalink award report block reply\nWolfLoud 1 points 2 days ago Here we go again. permalink award report block reply\nSHILL_DETECTOR 1 points 2 days ago fuck, another permenant fixture?? permalink award report block reply\nredneckrevival 1 points 2 days ago Another silver spoon useless BITCH!!!! permalink award report block reply\nKungFlu4u 1 points 2 days ago She sees momma wiping her wrinkled ass, with hundred dollar bills & says to herself, self….i gotta get me some of that. Last thing this country needs, is another Pelosi in government. GTFO! permalink award report block reply\nJuzeza 1 points 2 days ago Dynastic coronation permalink award report block reply\nDecepticons-superior 1 points 2 days ago It would be nice if she lost, but all a prominent Democrat has to do in California is announce that they are intending to run and the office is theirs. Adam Schiff has no business being a Senator, let alone out of prison, but that’s what he wanted, so that’s what he got. permalink award report block reply\nspinometer2 1 points 2 days ago is she the one filming j6? she should be in jail permalink award report block reply\ngofishoregon 1 points 2 days ago Daddy needs those stock tips. permalink award report block reply\nBob_sacamanao 1 points 2 days ago Going to run for san fransisco and rule over hordes of illegal aliens,  junkies,  and thousands of pounds of feces on the streets every day from junkies! permalink award report block reply\nIm_RickSteves_bitch 1 points 2 days ago 🤮 permalink award report block reply\nTheLeftIsAntiRight 1 points 2 days ago That's already her position. No election necessary. She's going to be \"voted in\". That's why Nancy retired. permalink award report block reply\ncrabpapple 1 points 2 days ago Modern day politics are a joke. permalink award report block reply\nEurpoean 1 points 2 days ago Fighting for a bunch of groups that aren't me. Fuck you and fuck off. permalink award report block reply\naaafirefly123 1 points 2 days ago What a fucked up dynasty. permalink award report block reply\nmass55th 1 points 2 days ago Somehow she thinks she's privileged, because her retarded, drunk mother held that seat, and wasn't qualified either. permalink award report block reply\nSpeedgraphic69 1 points 2 days ago Fuck me Agnes permalink award report block reply\nNellie_the_Beaut 1 points 2 days ago Interesting.  I thought for sure Nancy had her set up to take her place in the U.S. Congress. Maybe she still does - getting Christina some experience first. permalink award report block reply\npapa_newguineapig 1 points 2 days ago SURELY we as Americans don't let allow this to happen right? I mean...SOMETHING has to happen. permalink award report block reply\ntop_eagle 1 points 2 days ago Why she so fat? permalink award report block reply\naqua27 1 points 2 days ago Like a kingdom passing power from one generation to another. permalink award report block reply\nAmerica_No_1 1 points 2 days ago About as unlikeable as Kamala permalink award report block reply\nSteve1 1 points 2 days ago What a load of crap - Got to keep the family GRIFT going permalink award report block reply\nGontMawr 1 points 2 days ago Are you ready for another Pelosi in power for 50+ years? permalink award report block reply\npingpongdingdong 1 points 2 days ago never held a real job in her life. permalink award report block reply\nTrumpLandslide20201 1 points 2 days ago Legacy of corruption and death! permalink award report block reply",
  "fetched_at": "2025-11-12T20:59:46.945575Z"
}