{
  "id": "1ARK57qr2m",
  "url": "https://patriots.win/p/1ARK57qr2m/based/c",
  "content": "315 BASED posted 4 days ago by kek_saved_the_world 20 comments award share download report block\n20 comments Sort by Top Top New Worst Old Save bratt 4 points 4 days ago Chainfemale. 😛 permalink award report block reply 202_ 3 points 4 days ago A man and a woman permalink parent award report block reply bratt 2 points 4 days ago Chainfemale is my play on chain mail armor. permalink parent award report block reply asdrubael_was_right 4 points 4 days ago If she announced tomorrow we had to retake the holy land I would be in Messina by dusk. permalink award report block reply I_Love_45-70_Gov 2 points 4 days ago A woman crusader with no long sword. I can live with that. permalink award report block reply God-is-good 4 points 4 days ago To me I see the sharpest of all swords, for she wields wise words. Hebrews 4:12 (KJV) For the word of God [is] quick, and powerful, and sharper than any twoedged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and [is] a discerner of the thoughts and intents of the heart. permalink parent award report block reply Covfefebrulee 3 points 4 days ago She looks great in everything ! permalink parent award report block reply HockeyMom4Trump 3 points 4 days ago She really does. I love her spunk, too! permalink parent award report block reply Covfefebrulee 2 points 4 days ago 🤠 permalink parent award report block reply Reefay 2 points 4 days ago My same reaction permalink parent award report block reply dangermousebuu 2 points 4 days ago She lives 3 miles from me. 😭😭😭 I'm single Sydney! permalink award report block reply I_Love_45-70_Gov 2 points 4 days ago I was being snarky, meaning that she had no \"sword\" hidden under her chainmail. permalink award report block reply TrustYourself 2 points 4 days ago I love how the reporter was just crying inside about how ugly she is by comparison.   Desperately trying to find something that makes her better.   And failing. permalink award report block reply Saltyminer11 2 points 4 days ago Ill allow it. permalink award report block reply AcAirman 1 points 4 days ago She would stomp a mud hole in  DeusVult1096 ass. Sydney wills it. permalink award report block reply PastorCharles 1 points 4 days ago Dearest Simps, before you declare her \"SUPER BASED\" and start chanting \"one of us\" at her, you should remember Sweeney's body of work includes some of the most degenerate, pozzed nonsense ever put on screen. permalink award report block reply jhewish 2 points 4 days ago Stop clutching pearls like a fag. Its a celebrity that doesn't seem to drink the retarded Kool Aid. She doesn't need to be \"one of us\". The gay tribalism is for the communists. permalink parent award report block reply PastorCharles 1 points 4 days ago Sure thing, Donny Simopanero permalink parent award report block reply Reefay 1 points 4 days ago I should research this to verify permalink parent award report block reply\nbratt 4 points 4 days ago Chainfemale. 😛 permalink award report block reply 202_ 3 points 4 days ago A man and a woman permalink parent award report block reply bratt 2 points 4 days ago Chainfemale is my play on chain mail armor. permalink parent award report block reply\n202_ 3 points 4 days ago A man and a woman permalink parent award report block reply bratt 2 points 4 days ago Chainfemale is my play on chain mail armor. permalink parent award report block reply\nbratt 2 points 4 days ago Chainfemale is my play on chain mail armor. permalink parent award report block reply\nasdrubael_was_right 4 points 4 days ago If she announced tomorrow we had to retake the holy land I would be in Messina by dusk. permalink award report block reply\nI_Love_45-70_Gov 2 points 4 days ago A woman crusader with no long sword. I can live with that. permalink award report block reply God-is-good 4 points 4 days ago To me I see the sharpest of all swords, for she wields wise words. Hebrews 4:12 (KJV) For the word of God [is] quick, and powerful, and sharper than any twoedged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and [is] a discerner of the thoughts and intents of the heart. permalink parent award report block reply Covfefebrulee 3 points 4 days ago She looks great in everything ! permalink parent award report block reply HockeyMom4Trump 3 points 4 days ago She really does. I love her spunk, too! permalink parent award report block reply Covfefebrulee 2 points 4 days ago 🤠 permalink parent award report block reply Reefay 2 points 4 days ago My same reaction permalink parent award report block reply\nGod-is-good 4 points 4 days ago To me I see the sharpest of all swords, for she wields wise words. Hebrews 4:12 (KJV) For the word of God [is] quick, and powerful, and sharper than any twoedged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and [is] a discerner of the thoughts and intents of the heart. permalink parent award report block reply\nCovfefebrulee 3 points 4 days ago She looks great in everything ! permalink parent award report block reply HockeyMom4Trump 3 points 4 days ago She really does. I love her spunk, too! permalink parent award report block reply Covfefebrulee 2 points 4 days ago 🤠 permalink parent award report block reply Reefay 2 points 4 days ago My same reaction permalink parent award report block reply\nHockeyMom4Trump 3 points 4 days ago She really does. I love her spunk, too! permalink parent award report block reply Covfefebrulee 2 points 4 days ago 🤠 permalink parent award report block reply Reefay 2 points 4 days ago My same reaction permalink parent award report block reply\nCovfefebrulee 2 points 4 days ago 🤠 permalink parent award report block reply Reefay 2 points 4 days ago My same reaction permalink parent award report block reply\nReefay 2 points 4 days ago My same reaction permalink parent award report block reply\ndangermousebuu 2 points 4 days ago She lives 3 miles from me. 😭😭😭 I'm single Sydney! permalink award report block reply\nI_Love_45-70_Gov 2 points 4 days ago I was being snarky, meaning that she had no \"sword\" hidden under her chainmail. permalink award report block reply\nTrustYourself 2 points 4 days ago I love how the reporter was just crying inside about how ugly she is by comparison.   Desperately trying to find something that makes her better.   And failing. permalink award report block reply\nSaltyminer11 2 points 4 days ago Ill allow it. permalink award report block reply\nAcAirman 1 points 4 days ago She would stomp a mud hole in  DeusVult1096 ass. Sydney wills it. permalink award report block reply\nPastorCharles 1 points 4 days ago Dearest Simps, before you declare her \"SUPER BASED\" and start chanting \"one of us\" at her, you should remember Sweeney's body of work includes some of the most degenerate, pozzed nonsense ever put on screen. permalink award report block reply jhewish 2 points 4 days ago Stop clutching pearls like a fag. Its a celebrity that doesn't seem to drink the retarded Kool Aid. She doesn't need to be \"one of us\". The gay tribalism is for the communists. permalink parent award report block reply PastorCharles 1 points 4 days ago Sure thing, Donny Simopanero permalink parent award report block reply Reefay 1 points 4 days ago I should research this to verify permalink parent award report block reply\njhewish 2 points 4 days ago Stop clutching pearls like a fag. Its a celebrity that doesn't seem to drink the retarded Kool Aid. She doesn't need to be \"one of us\". The gay tribalism is for the communists. permalink parent award report block reply PastorCharles 1 points 4 days ago Sure thing, Donny Simopanero permalink parent award report block reply\nPastorCharles 1 points 4 days ago Sure thing, Donny Simopanero permalink parent award report block reply\nReefay 1 points 4 days ago I should research this to verify permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:55:55.848031Z"
}