{
  "id": "1ARK9jztbN",
  "url": "https://patriots.win/p/1ARK9jztbN/nycs-free-buses/c",
  "content": "359 NYC's Free Buses posted 1 day ago by ArthurJ 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Exsultate 10 points 1 day ago The smell of feces, urine, and body odor  will be unimaginable.  They’ll be human disease transfer stations. permalink award report block reply lifeisahologram 7 points 1 day ago Denver has a free bus line and it’s terrible for a number of reasons. permalink award report block reply BillGateCanSuckIt 5 points 1 day ago Or they won't look like that because there are not going to be free buses.  <Insert Simpsons HA HA meme> permalink award report block reply patriotpodcast 2 points 1 day ago No it won't. It will be mostly empty because no civilized person will ride it. It will instead have a few people slumped over in a few seats coming down from their highs with various bodily fluids smeared all over the floor. Frequently as the various junkies get into moods with each other, there will be fights and killings. In the back you'll find some whoring. permalink award report block reply Faintlight 1 points 1 day ago Good video about Mamdani's retardation: https://old.bitchute.com/video/fNL_QDzfkn4/ Talks about how his numbers don't work. permalink award report block reply Comanche_Moon 1 points 1 day ago Needs more cages with chickens and some goats, too. permalink award report block reply\nExsultate 10 points 1 day ago The smell of feces, urine, and body odor  will be unimaginable.  They’ll be human disease transfer stations. permalink award report block reply\nlifeisahologram 7 points 1 day ago Denver has a free bus line and it’s terrible for a number of reasons. permalink award report block reply\nBillGateCanSuckIt 5 points 1 day ago Or they won't look like that because there are not going to be free buses.  <Insert Simpsons HA HA meme> permalink award report block reply\npatriotpodcast 2 points 1 day ago No it won't. It will be mostly empty because no civilized person will ride it. It will instead have a few people slumped over in a few seats coming down from their highs with various bodily fluids smeared all over the floor. Frequently as the various junkies get into moods with each other, there will be fights and killings. In the back you'll find some whoring. permalink award report block reply\nFaintlight 1 points 1 day ago Good video about Mamdani's retardation: https://old.bitchute.com/video/fNL_QDzfkn4/ Talks about how his numbers don't work. permalink award report block reply\nComanche_Moon 1 points 1 day ago Needs more cages with chickens and some goats, too. permalink award report block reply",
  "fetched_at": "2025-11-12T23:16:22.507760Z"
}