{
  "id": "8172080",
  "title": "1316Socialist Hypocrite Mamdani Jets to Luxury Puerto Rico Resort(redstate.com)posted6 days agobyher",
  "url": "https://patriots.win/p/1ARK53JHMW/socialist-hypocrite-mamdani-jets/c",
  "content": "1316 Socialist Hypocrite Mamdani Jets to Luxury Puerto Rico Resort (redstate.com) posted 6 days ago by here2red 134 comments award share report block Socialist Hypocrite Mamdani Jets to Luxury Puerto Rico Resort Mamdani's luxury trip raises questions about socialist values and accountability. redstate.com\n134 comments Sort by Top Top New Worst Old Save Bullet3250 91 points 6 days ago \"it's for the people!' permalink award report block reply caKAG 26 points 6 days ago Well, if he stayed there enjoying his parents money, unplugging, and not returning to New York, then it definitely for the people. But if he wants to go to the max, he should continue to fly south until he reaches Venezuela, he needs to experience the beaches of this socialist paradise, I think he should stay there a while permalink parent award report block reply Hanging_Chad 18 points 6 days ago I think he should visit CECOT permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago They'll leave the light on for him? permalink parent award report block reply Live_free_or_die_55 2 points 5 days ago Not just visit, stay there permalink parent award report block reply Hanging_Chad 3 points 5 days ago once you go in, you don’t come out unless you’re a Maryland Father permalink parent award report block reply thunderpussy 11 points 6 days ago At the same time, begging his \"working class\" supporters to give him money for his transition team, if you can believe that. Not even in office yet, and he is already skimming off his supporters..... permalink parent award report block reply caKAG 5 points 6 days ago He should have asked Alex Soros for money permalink parent award report block reply thunderpussy 2 points 6 days ago Indeed. permalink parent award report block reply TwoArizonaPedes 4 points 5 days ago Muslims need to live in Muslim countries and nowhere else. permalink parent award report block reply yukondave 3 points 6 days ago I have some better beaches for him.  Diversity is our power https://timesofindia.indiatimes.com/photo/msid-58058074/58058074.jpg?642774 permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago How else is he supposed to meet Greta? permalink parent award report block reply Taqiyya_Mockingbird 2 points 5 days ago Why is no one calling out his White supremacist hand gesture? permalink parent award report block reply PitfallHarry 1 points 6 days ago So does the crossed eyed jeet. Our country is being run by foreigners. permalink parent award report block reply AfterGlow 65 points 6 days ago His family lives in a private compound in Uganda. The cars they drive are worth more than the local village earns in a lifetime. permalink award report block reply ReleasetheList 31 points 6 days ago No wonder why the jews like him. permalink parent award report block reply caKAG 10 points 6 days ago Only 33% of Jews voted for Mamdani. It was the young millennial hipster Jews that supported him, which was the trend in New York regardless of religion permalink parent award report block reply snoopy3210 2 points 6 days ago His whole campaign was so fake and fraudulent I won’t be surprised if he didn’t get a slice of the vote he claims to have gotten.. so staged.. it started with Trump bizarrely pushing Mayor Adams out, the only guy who had a chance to win.. and the fake polls immediately pushing for Mamdhimmi way too early and now he’s already leaving to puerto rico, almost a gaffe on day one…. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago Did DJT actually push Adams out? permalink parent award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply Viewer01 13 points 6 days ago Hypocrisy is an abstract concept that only white men understand and appreciate. Pointing it out and bitching about it is useless when trying to convince women and minorities. This man just promised those groups several thousand dollars so they don’t give a shit if he takes a vacation. they got Dey bag. You need to understand this when talking to those groups. You’re not talking to a peer who thinks like you. None of these people pay taxes. They don’t care if the govt fails. Their only concern is direct first order effects and how others will perceive them. permalink parent award report block reply BidensBodyDouble 5 points 6 days ago Plenty of dem faggots don't understand hypocrisy either. Just about all of them. permalink parent award report block reply bidensmissingbrain 9 points 6 days ago So a Champaign Socialist who was probably groomed specifically to go to the US and get elected somewhere. permalink parent award report block reply anotherthing 1 points 5 days ago A champagne socialist with a paid bar at his election party, and he also banned Hasan Piker from attending. That dog abusing shit bag was live streaming getting denied entry to it. It was pretty funny. He was also begging for more money before heading off to Puerto Rico. permalink parent award report block reply Midsouth 52 points 6 days ago Didn't he just say 6 months ago he's not going anywhere he's going to stay in New York City?  2 days after getting elected he's jetting to Puerto Rico- at a time that airlines are canceling flights because of the democrat shutdown.  Can't make this shit up 😭😭😭.  Another prime example of you get what you vote for. permalink award report block reply here2red OP 31 points 6 days ago His entire campaign was a joke. I cant believe people here actually praised him for his debate answer. GTFOH. permalink parent award report block reply anotherthing 1 points 5 days ago It was a good answer, it just wasn't an honest one. permalink parent award report block reply KekistanPM 15 points 6 days ago \"But he's my guy so it's totally fine; in fact he deserves it! So handsome too! If I could just get a lock of his hair I bet it would have magical healing power too!\" -- Immigrants and liberal women permalink parent award report block reply TD_Covfefe_Crusader 8 points 6 days ago There's plenty of soy infused faggots that love the guy too. permalink parent award report block reply FrmrAmericanRepublic 5 points 6 days ago Giving away \"free\" shit works on the gullible, until they realize who is really paying for it. permalink parent award report block reply TheAttackTitan 4 points 6 days ago Oh man my TDS addled buddy is one of them permalink parent award report block reply DiamondDroid 6 points 6 days ago Illegals and liberal white women permalink parent award report block reply TD_Covfefe_Crusader 6 points 6 days ago Like all Democrats, he lies as a matter of habit. permalink parent award report block reply sordfysh PRO 2 points 6 days ago They asked which foreign country he would visit. Puerto Rico is in the US. Israel is not part of the US, yet. permalink parent award report block reply Midsouth 4 points 6 days ago He made a point of adding an additional statement that he was staying in \"New York City\". Puerto Rico is not New York City,\nThat's when the moderator started questioning him about whether Israel has the right to exist or something to that effect. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago You're talking about a debate? Is it worth watching? permalink parent award report block reply Midsouth 4 points 6 days ago It was the Democrat mayoral debate.  The moderators really were pushing for loyalty to Israel....weird to watch permalink parent award report block reply sordfysh PRO 1 points 5 days ago He didn't say that he would never leave the city ever. This is a dumb thing to criticize him on. Puerto Rico is one of the only US areas in the Gulf of America or Carribean that is run by communists. It's his commie beach resort. permalink parent award report block reply FullyDilated 0 points 6 days ago Puerto Rico is not in the United States permalink parent award report block reply anotherthing 2 points 5 days ago It's a territory. It's United States soil. It's also the United States soil where the most welfare recipients per capita are. permalink parent award report block reply FullyDilated 1 points 6 days ago hopefully his plane crashes permalink parent award report block reply FredRedd 34 points 6 days ago Oh, he HAS  been spending time with Bernie permalink award report block reply TD_Covfefe_Crusader 9 points 6 days ago And just like with Bernie, the useful idiots that support him don't give a single fuck about *his\" life of luxury and financial wealth. permalink parent award report block reply billybaldwin2 25 points 6 days ago Is he meeting anyone there? permalink award report block reply BlueKentuckyGirl 13 points 6 days ago Exactly 🍻 permalink parent award report block reply Taqiyya_Mockingbird 5 points 6 days ago He has a blackmail appointment. permalink parent award report block reply caKAG 5 points 6 days ago Probably Bad Bunny, another talentless America hater that the normies soon over. permalink parent award report block reply _Sully_ 3 points 6 days ago If there is a god it would be super AIDS. permalink parent award report block reply MemoryHoleyeO 1 points 6 days ago His foreign financers permalink parent award report block reply projectarcturus1 19 points 6 days ago Block him from coming back. permalink award report block reply lixa 6 points 6 days ago That's the ticket lol. Can they get their act together on his denaturalization while he's gone please permalink parent award report block reply Politoed 5 points 6 days ago While he's gone in... America? permalink parent award report block reply Beachbum2023 1 points 6 days ago Its about as American as New York, which is to say its a shit hole filled with people who hate the US who dont speak English permalink parent award report block reply BoricuaPede 2 points 5 days ago a shit hole Yes filled with people who hate the US Absolutely false. who don't speak English As a percentage of population, more speak fluent English than the populations of many of the stateside blue cities these days. permalink parent award report block reply Lmn8rinos 15 points 6 days ago Maybe they have better looking goats in Puerto Rico? permalink award report block reply BlueKentuckyGirl 10 points 6 days ago Meeting his foreign money men, aka evil things that hate the USA permalink parent award report block reply thunderpussy 2 points 6 days ago The goats in New York are still recovering from his \"victory celebration\"...... permalink parent award report block reply DanIsSwell 14 points 6 days ago Odd thing to do the day after being elected. Doesn’t the position involve work to get started on? permalink award report block reply MEME-SUPREME 4 points 6 days ago Working vacation. /s permalink parent award report block reply Midsouth 2 points 6 days ago Working on getting some of that money permalink parent award report block reply Filo76 3 points 6 days ago He has an all female transition team working in the deets. It’s all good👌🏻 permalink parent award report block reply Taqiyya_Mockingbird 2 points 5 days ago Warlords don’t bleed for their power, only the people do. permalink parent award report block reply SavingPrivateGrace 9 points 6 days ago This party was paid for and was hosted by Letitia James.  \"Mamdani is attending a cocktail reception on Thursday hosted by New York's Democrat Attorney General Letitia James per a schedule of the visit obtained by Fox News Digital.\" permalink award report block reply GreyKnight 8 points 6 days ago Another psychopath willing to do anything for money and power. permalink award report block reply MEME-SUPREME 3 points 6 days ago ☝ permalink parent award report block reply f_bastiat 7 points 6 days ago A conference for New York government officials, is held at a resort in Puerto Rico. If Mamdani wanted to score points and put his money where his mouth is, he would have attended via Zoom or not participated at all out of principal. permalink award report block reply thisisatestof2 4 points 6 days ago Yep.  And called out the organizer for the location.  If only NY or NYC has suitable event space. permalink parent award report block reply Nellie_the_Beaut 2 points 5 days ago And his main handler Newsom tried to make a big deal out of Trump attending a Great Gatsby themed Halloween Party while “hungry families are going without their EBT benefits!!!” Wonder how much this conference in Puerto Rico for NY officials cost? And how many “hungry NYC families” that would feed this month? permalink parent award report block reply DoMagnum 7 points 6 days ago There is some sort of DS faggotry going down in PR. permalink award report block reply GA_Logic 3 points 6 days ago Always has been for a while. PR was a highly literate society and within a generation it is now a place where people want to escape PR. permalink parent award report block reply DoMagnum 4 points 6 days ago I have been there several times for vacation but not since the worst global pandemic ever. Like it, it could be a tropical paradise. The decline, like most of them is deliberate and planned, IMO. DS has use of the territory. permalink parent award report block reply TruthyBrat 2 points 6 days ago PR has been a low-trust society since forever. Known for criminality. When all the locals buy gobs of razor wire and wrought iron security bars that tells you a lot about the place. That long pre-dated the Plandemic. permalink parent award report block reply DoMagnum 2 points 5 days ago No shit, every land that was spanish ruled has that. I simply have not traveled since that time. The feds like it that way though, they need lawless shitholes to work their sorcery. permalink parent award report block reply InfinitesimalOrange 6 points 6 days ago INSTANTLY WASTING MONEY. I WANT TO HEAR LITERALLY NOTHING ABOUT MONEY FROM DEMOCRATS EVER AGAIN. THEY BURN MONEY FOR THE LULZ. permalink award report block reply HillarysFUPA 6 points 6 days ago This is not hypothetical... This is by design and exactly how socialism works.  Rich on top, getting richer, poor everyone else. permalink award report block reply gaijin_ronin 5 points 6 days ago Hopefully this muzzie piece of shit dies in a plane crash because of a DEI (or DIE in this case) hire. permalink award report block reply DontTreadOnLego 5 points 6 days ago REVOKE HIS REENTRY.  Illegal needs to stay out. permalink award report block reply RockapulcoRedpill 3 points 6 days ago there is no reentry it's a domestic flight permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Shoot it down. permalink parent award report block reply hnoble444 5 points 6 days ago LOL I hope New YOrkers pay attention to what's going to unfold, a master class in socialism, REAL socialism, hypocrisy, corruption, criminality, authoritarianism, wealth redistribution, anti-whitism. Oh this is going to be quite the show. permalink award report block reply Nellie_the_Beaut 1 points 5 days ago Socialism done right, dammit! permalink parent award report block reply Dev404 5 points 6 days ago Champagne socialist acting like a champagne socialist...... no way...... permalink award report block reply MEME-SUPREME 4 points 6 days ago 🍿🍿🍿🍿 Don't get fooled again dems. 🤣 permalink award report block reply donkeyKang 4 points 6 days ago He's secretly gay. Allegedly. LOLOLOL permalink award report block reply UpvoteBot 4 points 6 days ago This is always the case and the stupidest people on earth will always buy it. permalink award report block reply thunderpussy 2 points 6 days ago Indeed. Garden variety. Do these people know ANYTHING about history whatsoever? permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago History is rayyycisss! permalink parent award report block reply MasterVader2U 4 points 6 days ago Puerto Rico is a human trafficking hub. They are making him officially part of the club. permalink award report block reply Deltamyass 4 points 6 days ago Wealth for me! permalink award report block reply The_Bloofy_Bullshark 4 points 6 days ago lol I’ve spent a lot of time at that Hilton. It really isn’t as great as they make it out to be (place was relevant in the 1960s), but of course he would go there. Because in socialism, the “leaders” are different than everyone else. As for the resort, they are absolute fucking assholes about the rules there to the point where it makes vacations less enjoyable than they should be (last time I went there, you had a wristband but still have to check in with a security guard every single time you wanted to walk down from the main bar area/lobby to the pool). Restaurants are nice though and their bartenders are cool. Cash bar, not all-inclusive, so bin Laden over here will feel right at home. Their spa and gym are pretty fucking killer though, I’ll give them that (I hope he stays far away from both). Place seemingly was always packed with ultra Orthodox Jews. Starcucks always had a massive line. Unless you camp out in the morning, good luck getting a chair/towel. I fed an iguana a quesadilla. If anyone here is ever planning on going to PR though, stay at the Palacio Provincial in San Juan. No annoying kids. permalink award report block reply onesummerdream 4 points 6 days ago Ahahahahahahahahahahahahahahaha! Good luck NYC! permalink award report block reply Genericwhitemale 3 points 6 days ago CNN and MSDNC will be reporting nonstop about this for sure! /s permalink award report block reply Unboosted 3 points 6 days ago Mamdanis luxury trip raises questions about socialist values and accountability\"-  ? No it doesnt. They take the money abd use it for themselves. Duh permalink award report block reply Herc130 3 points 6 days ago Well,  that's not far from Epstein's island. Probably looking for some \"decorations\" for his new mansion. permalink award report block reply sordfysh PRO 3 points 6 days ago Couldn't he just eminent domain Epstein's vampire mansion? The guy is dead, so what's going on with his NYC mansion? permalink parent award report block reply MinnieWhittaker 3 points 6 days ago Some animals are more equal than others. permalink award report block reply behemoth887 3 points 6 days ago like any good \"socialist\" the moment he gets a tiny amount of power he starts spending other people's money like crazy permalink award report block reply Zacktopia33 3 points 6 days ago Don't we use PR to test military equipment? permalink award report block reply Chuj 3 points 6 days ago We used to. The bombing area is now a resort island with bioluminescent critters (natural, not nuclear, and very cool) permalink parent award report block reply Zacktopia33 3 points 6 days ago Then NYC will have to be the new PR. It's been headed that way for a long time. permalink parent award report block reply KennyKetchem 2 points 6 days ago I hope he finds poison permalink award report block reply FullyDilated 2 points 6 days ago already on a goat fucking holiday? permalink award report block reply ridge3z 2 points 6 days ago He's following in Bernie Sanders footsteps permalink award report block reply godgoldnguns 2 points 6 days ago Should be in Cuba permalink award report block reply Chuj 2 points 6 days ago Same flag, inverted colors permalink parent award report block reply BoricuaPede 2 points 5 days ago Fun fact: That flag was designed in NYC by Cubans and Puerto Ricans in exile who were plotting to take their islands from Spain and join the USA. permalink parent award report block reply Chuj 1 points 5 days ago Cool. I did not know that. I've been to PR twice. I'll pass on Cuba though permalink parent award report block reply Tacitus1963 2 points 6 days ago Mamdani was raised on the rabid anti-white rhetoric of the ANC and EFF in South Africa. His father was even too radical for the University of Capetown and had to move on. However, he got a job at Columbia without a problem. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink award report block reply SimaYi 2 points 6 days ago If I can't stay in a luxurious resort, what's the point of fighting for le people? permalink award report block reply knnbccb 2 points 6 days ago Not a hypocrite, that's who they really are. permalink award report block reply ThePatriotGames2016 2 points 6 days ago saying a communist doing communist things is not a hypocrite. it's calling a fag a fag. permalink award report block reply HeavenlyTrumpets 2 points 6 days ago lol permalink award report block reply VikingHalo45 2 points 6 days ago We knew he was a fake POS.   NY will have to learn later. permalink award report block reply emorphia 2 points 6 days ago well he did ask for donations.  i guess he needs some gambling money for that resort. permalink award report block reply socal_maga 2 points 6 days ago Fuckin fag permalink award report block reply Bastard 2 points 6 days ago The people that run a socialist state are worse than the \"billionaires\" lefties rail against.  I hope Mandani proves that every day. permalink award report block reply davidac1982 2 points 6 days ago the FBI better be bugging the whole thing… permalink award report block reply KernalMustard 2 points 6 days ago Thats why hes in PR. Far enough out of sight and not have anything bugged permalink parent award report block reply Tellman125 2 points 6 days ago That spoiled and pampered little shit takes office on January 1, which means there's still nearly TWO WHOLE MONTHS while he's still in this hyper idealistic phase. Right now he's still in his campaign-rally/debate mode of being a 10th grader all giddy and over-eager to do his class presentation where he gets to impress the stupid woman fake-history teacher with all the bullshit he has memorized from her lectures and reading assignments. He was the most absent assembly member in his 4 years there. So, once he becomes mayor and has to start show up EVERY SINGLE DAY to 2, 3, or 4  crisis locations (fires, gang violence, tragedies, emergencies), or tense union meetings, or business groups, or whatever ethnic group meetings (all sort of NON-Muslim ones he doesn't give a shit about), he'll start burning out fast and unravel and start saying shit that reveals how uninterested, underequipped, and unqualified he is for the job. His campaign was such a breeze, letting his TikTok videos do the work for him, and her kept up the phony grin for the 2 hours of the 2 debates, but he won't be able to keep that fucking phony grin on his face for that many hours a day, and with so many people telling him their stories, complaining to him, pleading with him, and hectoring him. permalink award report block reply thisisatestof2 2 points 6 days ago I knew I would have ample opportunities to break out the popcorn, just not this soon. permalink award report block reply AmericanJawa 2 points 6 days ago Mamdani's luxury trip raises questions about socialist values and accountability. It's par the course for communists, really. permalink award report block reply thunderpussy 3 points 6 days ago Really. Like an earlier poster said, this is the norm for socialists and commies. Party big wigs and apparatchiks living the good and luxurious life, while the masses  live in squalor.... permalink parent award report block reply tlorsung 2 points 6 days ago Don't allow him back!   have someone steal his passport! permalink award report block reply 2025WhatIsTrue 1 points 6 days ago This guy is a pathetic joke.  The \"voters\" in NYC are pathetic jokes.  They deserve what they get. LOL! permalink award report block reply MR__K 1 points 6 days ago Its for himself hes worked hard infiltrating the government of his enemies permalink award report block reply Shih_Tabed 1 points 6 days ago If anyone has an opportunity to take care of business they should probably do it.  Your family will be well compensated. permalink award report block reply booblitchutz 1 points 5 days ago But you know, he needs money for his “transition “. permalink award report block reply BoricuaPede 1 points 5 days ago It's really not that nice of a resort. Trust me. permalink award report block reply quiznossucks 1 points 6 days ago sooooo it's off to a good start  ??? permalink award report block reply dontdrinksoy 1 points 5 days ago Another champagne socialist. permalink award report block reply Nellie_the_Beaut 1 points 5 days ago lol, he’s 34 and already looks like he’s 44.  All I keep hearing is about how incredibly handsome, attractive, good looking this Ugandan guy is, with the megawatt Hollywood smile and great charisma. He looks like any other wealthy middle-aged Indian guy who has been spoiled by daddy and mama his whole life.  Well fed, expensive hair cut and groomed beard, nice clothes. Arrogance that only comes from being treated like a little prince that can do no wrong. Mamdani will look like a beefy and bloated Sadham Husain exiting the bunker by the time his term is up.  All these champagne communists always end up gorging themselves on the spoils. permalink award report block reply starjello 1 points 5 days ago That's all the left of know is hypocrisy. This guy could be a Bernie bro permalink award report block reply 1LoathsomeDove 1 points 5 days ago Is he delivering money or accepting it?\nAnybody watching this fucker while he's there? permalink award report block reply BallotsOnRubysUSB -5 points 6 days ago ︎ Don't let him fly back to the States! ︎ permalink award report block reply As1487 2 points 6 days ago He flew from NY to PR. He never left ‘the States’ permalink parent award report block reply\nBullet3250 91 points 6 days ago \"it's for the people!' permalink award report block reply caKAG 26 points 6 days ago Well, if he stayed there enjoying his parents money, unplugging, and not returning to New York, then it definitely for the people. But if he wants to go to the max, he should continue to fly south until he reaches Venezuela, he needs to experience the beaches of this socialist paradise, I think he should stay there a while permalink parent award report block reply Hanging_Chad 18 points 6 days ago I think he should visit CECOT permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago They'll leave the light on for him? permalink parent award report block reply Live_free_or_die_55 2 points 5 days ago Not just visit, stay there permalink parent award report block reply Hanging_Chad 3 points 5 days ago once you go in, you don’t come out unless you’re a Maryland Father permalink parent award report block reply thunderpussy 11 points 6 days ago At the same time, begging his \"working class\" supporters to give him money for his transition team, if you can believe that. Not even in office yet, and he is already skimming off his supporters..... permalink parent award report block reply caKAG 5 points 6 days ago He should have asked Alex Soros for money permalink parent award report block reply thunderpussy 2 points 6 days ago Indeed. permalink parent award report block reply TwoArizonaPedes 4 points 5 days ago Muslims need to live in Muslim countries and nowhere else. permalink parent award report block reply yukondave 3 points 6 days ago I have some better beaches for him.  Diversity is our power https://timesofindia.indiatimes.com/photo/msid-58058074/58058074.jpg?642774 permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago How else is he supposed to meet Greta? permalink parent award report block reply Taqiyya_Mockingbird 2 points 5 days ago Why is no one calling out his White supremacist hand gesture? permalink parent award report block reply PitfallHarry 1 points 6 days ago So does the crossed eyed jeet. Our country is being run by foreigners. permalink parent award report block reply\ncaKAG 26 points 6 days ago Well, if he stayed there enjoying his parents money, unplugging, and not returning to New York, then it definitely for the people. But if he wants to go to the max, he should continue to fly south until he reaches Venezuela, he needs to experience the beaches of this socialist paradise, I think he should stay there a while permalink parent award report block reply Hanging_Chad 18 points 6 days ago I think he should visit CECOT permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago They'll leave the light on for him? permalink parent award report block reply Live_free_or_die_55 2 points 5 days ago Not just visit, stay there permalink parent award report block reply Hanging_Chad 3 points 5 days ago once you go in, you don’t come out unless you’re a Maryland Father permalink parent award report block reply thunderpussy 11 points 6 days ago At the same time, begging his \"working class\" supporters to give him money for his transition team, if you can believe that. Not even in office yet, and he is already skimming off his supporters..... permalink parent award report block reply caKAG 5 points 6 days ago He should have asked Alex Soros for money permalink parent award report block reply thunderpussy 2 points 6 days ago Indeed. permalink parent award report block reply TwoArizonaPedes 4 points 5 days ago Muslims need to live in Muslim countries and nowhere else. permalink parent award report block reply yukondave 3 points 6 days ago I have some better beaches for him.  Diversity is our power https://timesofindia.indiatimes.com/photo/msid-58058074/58058074.jpg?642774 permalink parent award report block reply\nHanging_Chad 18 points 6 days ago I think he should visit CECOT permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago They'll leave the light on for him? permalink parent award report block reply Live_free_or_die_55 2 points 5 days ago Not just visit, stay there permalink parent award report block reply Hanging_Chad 3 points 5 days ago once you go in, you don’t come out unless you’re a Maryland Father permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago They'll leave the light on for him? permalink parent award report block reply\nLive_free_or_die_55 2 points 5 days ago Not just visit, stay there permalink parent award report block reply Hanging_Chad 3 points 5 days ago once you go in, you don’t come out unless you’re a Maryland Father permalink parent award report block reply\nHanging_Chad 3 points 5 days ago once you go in, you don’t come out unless you’re a Maryland Father permalink parent award report block reply\nthunderpussy 11 points 6 days ago At the same time, begging his \"working class\" supporters to give him money for his transition team, if you can believe that. Not even in office yet, and he is already skimming off his supporters..... permalink parent award report block reply caKAG 5 points 6 days ago He should have asked Alex Soros for money permalink parent award report block reply thunderpussy 2 points 6 days ago Indeed. permalink parent award report block reply\ncaKAG 5 points 6 days ago He should have asked Alex Soros for money permalink parent award report block reply thunderpussy 2 points 6 days ago Indeed. permalink parent award report block reply\nthunderpussy 2 points 6 days ago Indeed. permalink parent award report block reply\nTwoArizonaPedes 4 points 5 days ago Muslims need to live in Muslim countries and nowhere else. permalink parent award report block reply\nyukondave 3 points 6 days ago I have some better beaches for him.  Diversity is our power https://timesofindia.indiatimes.com/photo/msid-58058074/58058074.jpg?642774 permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago How else is he supposed to meet Greta? permalink parent award report block reply\nTaqiyya_Mockingbird 2 points 5 days ago Why is no one calling out his White supremacist hand gesture? permalink parent award report block reply\nPitfallHarry 1 points 6 days ago So does the crossed eyed jeet. Our country is being run by foreigners. permalink parent award report block reply\nAfterGlow 65 points 6 days ago His family lives in a private compound in Uganda. The cars they drive are worth more than the local village earns in a lifetime. permalink award report block reply ReleasetheList 31 points 6 days ago No wonder why the jews like him. permalink parent award report block reply caKAG 10 points 6 days ago Only 33% of Jews voted for Mamdani. It was the young millennial hipster Jews that supported him, which was the trend in New York regardless of religion permalink parent award report block reply snoopy3210 2 points 6 days ago His whole campaign was so fake and fraudulent I won’t be surprised if he didn’t get a slice of the vote he claims to have gotten.. so staged.. it started with Trump bizarrely pushing Mayor Adams out, the only guy who had a chance to win.. and the fake polls immediately pushing for Mamdhimmi way too early and now he’s already leaving to puerto rico, almost a gaffe on day one…. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago Did DJT actually push Adams out? permalink parent award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply Viewer01 13 points 6 days ago Hypocrisy is an abstract concept that only white men understand and appreciate. Pointing it out and bitching about it is useless when trying to convince women and minorities. This man just promised those groups several thousand dollars so they don’t give a shit if he takes a vacation. they got Dey bag. You need to understand this when talking to those groups. You’re not talking to a peer who thinks like you. None of these people pay taxes. They don’t care if the govt fails. Their only concern is direct first order effects and how others will perceive them. permalink parent award report block reply BidensBodyDouble 5 points 6 days ago Plenty of dem faggots don't understand hypocrisy either. Just about all of them. permalink parent award report block reply bidensmissingbrain 9 points 6 days ago So a Champaign Socialist who was probably groomed specifically to go to the US and get elected somewhere. permalink parent award report block reply anotherthing 1 points 5 days ago A champagne socialist with a paid bar at his election party, and he also banned Hasan Piker from attending. That dog abusing shit bag was live streaming getting denied entry to it. It was pretty funny. He was also begging for more money before heading off to Puerto Rico. permalink parent award report block reply\nReleasetheList 31 points 6 days ago No wonder why the jews like him. permalink parent award report block reply caKAG 10 points 6 days ago Only 33% of Jews voted for Mamdani. It was the young millennial hipster Jews that supported him, which was the trend in New York regardless of religion permalink parent award report block reply snoopy3210 2 points 6 days ago His whole campaign was so fake and fraudulent I won’t be surprised if he didn’t get a slice of the vote he claims to have gotten.. so staged.. it started with Trump bizarrely pushing Mayor Adams out, the only guy who had a chance to win.. and the fake polls immediately pushing for Mamdhimmi way too early and now he’s already leaving to puerto rico, almost a gaffe on day one…. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago Did DJT actually push Adams out? permalink parent award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply\ncaKAG 10 points 6 days ago Only 33% of Jews voted for Mamdani. It was the young millennial hipster Jews that supported him, which was the trend in New York regardless of religion permalink parent award report block reply snoopy3210 2 points 6 days ago His whole campaign was so fake and fraudulent I won’t be surprised if he didn’t get a slice of the vote he claims to have gotten.. so staged.. it started with Trump bizarrely pushing Mayor Adams out, the only guy who had a chance to win.. and the fake polls immediately pushing for Mamdhimmi way too early and now he’s already leaving to puerto rico, almost a gaffe on day one…. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago Did DJT actually push Adams out? permalink parent award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply\nsnoopy3210 2 points 6 days ago His whole campaign was so fake and fraudulent I won’t be surprised if he didn’t get a slice of the vote he claims to have gotten.. so staged.. it started with Trump bizarrely pushing Mayor Adams out, the only guy who had a chance to win.. and the fake polls immediately pushing for Mamdhimmi way too early and now he’s already leaving to puerto rico, almost a gaffe on day one…. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago Did DJT actually push Adams out? permalink parent award report block reply\nSicSemperTyrannis2 3 points 6 days ago Did DJT actually push Adams out? permalink parent award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply\nViewer01 13 points 6 days ago Hypocrisy is an abstract concept that only white men understand and appreciate. Pointing it out and bitching about it is useless when trying to convince women and minorities. This man just promised those groups several thousand dollars so they don’t give a shit if he takes a vacation. they got Dey bag. You need to understand this when talking to those groups. You’re not talking to a peer who thinks like you. None of these people pay taxes. They don’t care if the govt fails. Their only concern is direct first order effects and how others will perceive them. permalink parent award report block reply BidensBodyDouble 5 points 6 days ago Plenty of dem faggots don't understand hypocrisy either. Just about all of them. permalink parent award report block reply\nBidensBodyDouble 5 points 6 days ago Plenty of dem faggots don't understand hypocrisy either. Just about all of them. permalink parent award report block reply\nbidensmissingbrain 9 points 6 days ago So a Champaign Socialist who was probably groomed specifically to go to the US and get elected somewhere. permalink parent award report block reply anotherthing 1 points 5 days ago A champagne socialist with a paid bar at his election party, and he also banned Hasan Piker from attending. That dog abusing shit bag was live streaming getting denied entry to it. It was pretty funny. He was also begging for more money before heading off to Puerto Rico. permalink parent award report block reply\nanotherthing 1 points 5 days ago A champagne socialist with a paid bar at his election party, and he also banned Hasan Piker from attending. That dog abusing shit bag was live streaming getting denied entry to it. It was pretty funny. He was also begging for more money before heading off to Puerto Rico. permalink parent award report block reply\nMidsouth 52 points 6 days ago Didn't he just say 6 months ago he's not going anywhere he's going to stay in New York City?  2 days after getting elected he's jetting to Puerto Rico- at a time that airlines are canceling flights because of the democrat shutdown.  Can't make this shit up 😭😭😭.  Another prime example of you get what you vote for. permalink award report block reply here2red OP 31 points 6 days ago His entire campaign was a joke. I cant believe people here actually praised him for his debate answer. GTFOH. permalink parent award report block reply anotherthing 1 points 5 days ago It was a good answer, it just wasn't an honest one. permalink parent award report block reply KekistanPM 15 points 6 days ago \"But he's my guy so it's totally fine; in fact he deserves it! So handsome too! If I could just get a lock of his hair I bet it would have magical healing power too!\" -- Immigrants and liberal women permalink parent award report block reply TD_Covfefe_Crusader 8 points 6 days ago There's plenty of soy infused faggots that love the guy too. permalink parent award report block reply FrmrAmericanRepublic 5 points 6 days ago Giving away \"free\" shit works on the gullible, until they realize who is really paying for it. permalink parent award report block reply TheAttackTitan 4 points 6 days ago Oh man my TDS addled buddy is one of them permalink parent award report block reply DiamondDroid 6 points 6 days ago Illegals and liberal white women permalink parent award report block reply TD_Covfefe_Crusader 6 points 6 days ago Like all Democrats, he lies as a matter of habit. permalink parent award report block reply sordfysh PRO 2 points 6 days ago They asked which foreign country he would visit. Puerto Rico is in the US. Israel is not part of the US, yet. permalink parent award report block reply Midsouth 4 points 6 days ago He made a point of adding an additional statement that he was staying in \"New York City\". Puerto Rico is not New York City,\nThat's when the moderator started questioning him about whether Israel has the right to exist or something to that effect. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago You're talking about a debate? Is it worth watching? permalink parent award report block reply Midsouth 4 points 6 days ago It was the Democrat mayoral debate.  The moderators really were pushing for loyalty to Israel....weird to watch permalink parent award report block reply sordfysh PRO 1 points 5 days ago He didn't say that he would never leave the city ever. This is a dumb thing to criticize him on. Puerto Rico is one of the only US areas in the Gulf of America or Carribean that is run by communists. It's his commie beach resort. permalink parent award report block reply FullyDilated 0 points 6 days ago Puerto Rico is not in the United States permalink parent award report block reply anotherthing 2 points 5 days ago It's a territory. It's United States soil. It's also the United States soil where the most welfare recipients per capita are. permalink parent award report block reply FullyDilated 1 points 6 days ago hopefully his plane crashes permalink parent award report block reply\nhere2red OP 31 points 6 days ago His entire campaign was a joke. I cant believe people here actually praised him for his debate answer. GTFOH. permalink parent award report block reply anotherthing 1 points 5 days ago It was a good answer, it just wasn't an honest one. permalink parent award report block reply\nanotherthing 1 points 5 days ago It was a good answer, it just wasn't an honest one. permalink parent award report block reply\nKekistanPM 15 points 6 days ago \"But he's my guy so it's totally fine; in fact he deserves it! So handsome too! If I could just get a lock of his hair I bet it would have magical healing power too!\" -- Immigrants and liberal women permalink parent award report block reply TD_Covfefe_Crusader 8 points 6 days ago There's plenty of soy infused faggots that love the guy too. permalink parent award report block reply FrmrAmericanRepublic 5 points 6 days ago Giving away \"free\" shit works on the gullible, until they realize who is really paying for it. permalink parent award report block reply TheAttackTitan 4 points 6 days ago Oh man my TDS addled buddy is one of them permalink parent award report block reply DiamondDroid 6 points 6 days ago Illegals and liberal white women permalink parent award report block reply\nTD_Covfefe_Crusader 8 points 6 days ago There's plenty of soy infused faggots that love the guy too. permalink parent award report block reply FrmrAmericanRepublic 5 points 6 days ago Giving away \"free\" shit works on the gullible, until they realize who is really paying for it. permalink parent award report block reply TheAttackTitan 4 points 6 days ago Oh man my TDS addled buddy is one of them permalink parent award report block reply\nFrmrAmericanRepublic 5 points 6 days ago Giving away \"free\" shit works on the gullible, until they realize who is really paying for it. permalink parent award report block reply\nTheAttackTitan 4 points 6 days ago Oh man my TDS addled buddy is one of them permalink parent award report block reply\nDiamondDroid 6 points 6 days ago Illegals and liberal white women permalink parent award report block reply\nTD_Covfefe_Crusader 6 points 6 days ago Like all Democrats, he lies as a matter of habit. permalink parent award report block reply\nsordfysh PRO 2 points 6 days ago They asked which foreign country he would visit. Puerto Rico is in the US. Israel is not part of the US, yet. permalink parent award report block reply Midsouth 4 points 6 days ago He made a point of adding an additional statement that he was staying in \"New York City\". Puerto Rico is not New York City,\nThat's when the moderator started questioning him about whether Israel has the right to exist or something to that effect. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago You're talking about a debate? Is it worth watching? permalink parent award report block reply Midsouth 4 points 6 days ago It was the Democrat mayoral debate.  The moderators really were pushing for loyalty to Israel....weird to watch permalink parent award report block reply sordfysh PRO 1 points 5 days ago He didn't say that he would never leave the city ever. This is a dumb thing to criticize him on. Puerto Rico is one of the only US areas in the Gulf of America or Carribean that is run by communists. It's his commie beach resort. permalink parent award report block reply FullyDilated 0 points 6 days ago Puerto Rico is not in the United States permalink parent award report block reply anotherthing 2 points 5 days ago It's a territory. It's United States soil. It's also the United States soil where the most welfare recipients per capita are. permalink parent award report block reply\nMidsouth 4 points 6 days ago He made a point of adding an additional statement that he was staying in \"New York City\". Puerto Rico is not New York City,\nThat's when the moderator started questioning him about whether Israel has the right to exist or something to that effect. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago You're talking about a debate? Is it worth watching? permalink parent award report block reply Midsouth 4 points 6 days ago It was the Democrat mayoral debate.  The moderators really were pushing for loyalty to Israel....weird to watch permalink parent award report block reply sordfysh PRO 1 points 5 days ago He didn't say that he would never leave the city ever. This is a dumb thing to criticize him on. Puerto Rico is one of the only US areas in the Gulf of America or Carribean that is run by communists. It's his commie beach resort. permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago You're talking about a debate? Is it worth watching? permalink parent award report block reply Midsouth 4 points 6 days ago It was the Democrat mayoral debate.  The moderators really were pushing for loyalty to Israel....weird to watch permalink parent award report block reply\nMidsouth 4 points 6 days ago It was the Democrat mayoral debate.  The moderators really were pushing for loyalty to Israel....weird to watch permalink parent award report block reply\nsordfysh PRO 1 points 5 days ago He didn't say that he would never leave the city ever. This is a dumb thing to criticize him on. Puerto Rico is one of the only US areas in the Gulf of America or Carribean that is run by communists. It's his commie beach resort. permalink parent award report block reply\nFullyDilated 0 points 6 days ago Puerto Rico is not in the United States permalink parent award report block reply anotherthing 2 points 5 days ago It's a territory. It's United States soil. It's also the United States soil where the most welfare recipients per capita are. permalink parent award report block reply\nanotherthing 2 points 5 days ago It's a territory. It's United States soil. It's also the United States soil where the most welfare recipients per capita are. permalink parent award report block reply\nFullyDilated 1 points 6 days ago hopefully his plane crashes permalink parent award report block reply\nFredRedd 34 points 6 days ago Oh, he HAS  been spending time with Bernie permalink award report block reply TD_Covfefe_Crusader 9 points 6 days ago And just like with Bernie, the useful idiots that support him don't give a single fuck about *his\" life of luxury and financial wealth. permalink parent award report block reply\nTD_Covfefe_Crusader 9 points 6 days ago And just like with Bernie, the useful idiots that support him don't give a single fuck about *his\" life of luxury and financial wealth. permalink parent award report block reply\nbillybaldwin2 25 points 6 days ago Is he meeting anyone there? permalink award report block reply BlueKentuckyGirl 13 points 6 days ago Exactly 🍻 permalink parent award report block reply Taqiyya_Mockingbird 5 points 6 days ago He has a blackmail appointment. permalink parent award report block reply caKAG 5 points 6 days ago Probably Bad Bunny, another talentless America hater that the normies soon over. permalink parent award report block reply _Sully_ 3 points 6 days ago If there is a god it would be super AIDS. permalink parent award report block reply MemoryHoleyeO 1 points 6 days ago His foreign financers permalink parent award report block reply\nBlueKentuckyGirl 13 points 6 days ago Exactly 🍻 permalink parent award report block reply\nTaqiyya_Mockingbird 5 points 6 days ago He has a blackmail appointment. permalink parent award report block reply\ncaKAG 5 points 6 days ago Probably Bad Bunny, another talentless America hater that the normies soon over. permalink parent award report block reply\n_Sully_ 3 points 6 days ago If there is a god it would be super AIDS. permalink parent award report block reply\nMemoryHoleyeO 1 points 6 days ago His foreign financers permalink parent award report block reply\nprojectarcturus1 19 points 6 days ago Block him from coming back. permalink award report block reply lixa 6 points 6 days ago That's the ticket lol. Can they get their act together on his denaturalization while he's gone please permalink parent award report block reply Politoed 5 points 6 days ago While he's gone in... America? permalink parent award report block reply Beachbum2023 1 points 6 days ago Its about as American as New York, which is to say its a shit hole filled with people who hate the US who dont speak English permalink parent award report block reply BoricuaPede 2 points 5 days ago a shit hole Yes filled with people who hate the US Absolutely false. who don't speak English As a percentage of population, more speak fluent English than the populations of many of the stateside blue cities these days. permalink parent award report block reply\nlixa 6 points 6 days ago That's the ticket lol. Can they get their act together on his denaturalization while he's gone please permalink parent award report block reply Politoed 5 points 6 days ago While he's gone in... America? permalink parent award report block reply Beachbum2023 1 points 6 days ago Its about as American as New York, which is to say its a shit hole filled with people who hate the US who dont speak English permalink parent award report block reply BoricuaPede 2 points 5 days ago a shit hole Yes filled with people who hate the US Absolutely false. who don't speak English As a percentage of population, more speak fluent English than the populations of many of the stateside blue cities these days. permalink parent award report block reply\nPolitoed 5 points 6 days ago While he's gone in... America? permalink parent award report block reply Beachbum2023 1 points 6 days ago Its about as American as New York, which is to say its a shit hole filled with people who hate the US who dont speak English permalink parent award report block reply BoricuaPede 2 points 5 days ago a shit hole Yes filled with people who hate the US Absolutely false. who don't speak English As a percentage of population, more speak fluent English than the populations of many of the stateside blue cities these days. permalink parent award report block reply\nBeachbum2023 1 points 6 days ago Its about as American as New York, which is to say its a shit hole filled with people who hate the US who dont speak English permalink parent award report block reply BoricuaPede 2 points 5 days ago a shit hole Yes filled with people who hate the US Absolutely false. who don't speak English As a percentage of population, more speak fluent English than the populations of many of the stateside blue cities these days. permalink parent award report block reply\nBoricuaPede 2 points 5 days ago a shit hole Yes filled with people who hate the US Absolutely false. who don't speak English As a percentage of population, more speak fluent English than the populations of many of the stateside blue cities these days. permalink parent award report block reply\nLmn8rinos 15 points 6 days ago Maybe they have better looking goats in Puerto Rico? permalink award report block reply BlueKentuckyGirl 10 points 6 days ago Meeting his foreign money men, aka evil things that hate the USA permalink parent award report block reply thunderpussy 2 points 6 days ago The goats in New York are still recovering from his \"victory celebration\"...... permalink parent award report block reply\nBlueKentuckyGirl 10 points 6 days ago Meeting his foreign money men, aka evil things that hate the USA permalink parent award report block reply\nthunderpussy 2 points 6 days ago The goats in New York are still recovering from his \"victory celebration\"...... permalink parent award report block reply\nDanIsSwell 14 points 6 days ago Odd thing to do the day after being elected. Doesn’t the position involve work to get started on? permalink award report block reply MEME-SUPREME 4 points 6 days ago Working vacation. /s permalink parent award report block reply Midsouth 2 points 6 days ago Working on getting some of that money permalink parent award report block reply Filo76 3 points 6 days ago He has an all female transition team working in the deets. It’s all good👌🏻 permalink parent award report block reply Taqiyya_Mockingbird 2 points 5 days ago Warlords don’t bleed for their power, only the people do. permalink parent award report block reply\nMEME-SUPREME 4 points 6 days ago Working vacation. /s permalink parent award report block reply Midsouth 2 points 6 days ago Working on getting some of that money permalink parent award report block reply\nMidsouth 2 points 6 days ago Working on getting some of that money permalink parent award report block reply\nFilo76 3 points 6 days ago He has an all female transition team working in the deets. It’s all good👌🏻 permalink parent award report block reply\nTaqiyya_Mockingbird 2 points 5 days ago Warlords don’t bleed for their power, only the people do. permalink parent award report block reply\nSavingPrivateGrace 9 points 6 days ago This party was paid for and was hosted by Letitia James.  \"Mamdani is attending a cocktail reception on Thursday hosted by New York's Democrat Attorney General Letitia James per a schedule of the visit obtained by Fox News Digital.\" permalink award report block reply\nGreyKnight 8 points 6 days ago Another psychopath willing to do anything for money and power. permalink award report block reply MEME-SUPREME 3 points 6 days ago ☝ permalink parent award report block reply\nMEME-SUPREME 3 points 6 days ago ☝ permalink parent award report block reply\nf_bastiat 7 points 6 days ago A conference for New York government officials, is held at a resort in Puerto Rico. If Mamdani wanted to score points and put his money where his mouth is, he would have attended via Zoom or not participated at all out of principal. permalink award report block reply thisisatestof2 4 points 6 days ago Yep.  And called out the organizer for the location.  If only NY or NYC has suitable event space. permalink parent award report block reply Nellie_the_Beaut 2 points 5 days ago And his main handler Newsom tried to make a big deal out of Trump attending a Great Gatsby themed Halloween Party while “hungry families are going without their EBT benefits!!!” Wonder how much this conference in Puerto Rico for NY officials cost? And how many “hungry NYC families” that would feed this month? permalink parent award report block reply\nthisisatestof2 4 points 6 days ago Yep.  And called out the organizer for the location.  If only NY or NYC has suitable event space. permalink parent award report block reply\nNellie_the_Beaut 2 points 5 days ago And his main handler Newsom tried to make a big deal out of Trump attending a Great Gatsby themed Halloween Party while “hungry families are going without their EBT benefits!!!” Wonder how much this conference in Puerto Rico for NY officials cost? And how many “hungry NYC families” that would feed this month? permalink parent award report block reply\nDoMagnum 7 points 6 days ago There is some sort of DS faggotry going down in PR. permalink award report block reply GA_Logic 3 points 6 days ago Always has been for a while. PR was a highly literate society and within a generation it is now a place where people want to escape PR. permalink parent award report block reply DoMagnum 4 points 6 days ago I have been there several times for vacation but not since the worst global pandemic ever. Like it, it could be a tropical paradise. The decline, like most of them is deliberate and planned, IMO. DS has use of the territory. permalink parent award report block reply TruthyBrat 2 points 6 days ago PR has been a low-trust society since forever. Known for criminality. When all the locals buy gobs of razor wire and wrought iron security bars that tells you a lot about the place. That long pre-dated the Plandemic. permalink parent award report block reply DoMagnum 2 points 5 days ago No shit, every land that was spanish ruled has that. I simply have not traveled since that time. The feds like it that way though, they need lawless shitholes to work their sorcery. permalink parent award report block reply\nGA_Logic 3 points 6 days ago Always has been for a while. PR was a highly literate society and within a generation it is now a place where people want to escape PR. permalink parent award report block reply DoMagnum 4 points 6 days ago I have been there several times for vacation but not since the worst global pandemic ever. Like it, it could be a tropical paradise. The decline, like most of them is deliberate and planned, IMO. DS has use of the territory. permalink parent award report block reply TruthyBrat 2 points 6 days ago PR has been a low-trust society since forever. Known for criminality. When all the locals buy gobs of razor wire and wrought iron security bars that tells you a lot about the place. That long pre-dated the Plandemic. permalink parent award report block reply DoMagnum 2 points 5 days ago No shit, every land that was spanish ruled has that. I simply have not traveled since that time. The feds like it that way though, they need lawless shitholes to work their sorcery. permalink parent award report block reply\nDoMagnum 4 points 6 days ago I have been there several times for vacation but not since the worst global pandemic ever. Like it, it could be a tropical paradise. The decline, like most of them is deliberate and planned, IMO. DS has use of the territory. permalink parent award report block reply TruthyBrat 2 points 6 days ago PR has been a low-trust society since forever. Known for criminality. When all the locals buy gobs of razor wire and wrought iron security bars that tells you a lot about the place. That long pre-dated the Plandemic. permalink parent award report block reply DoMagnum 2 points 5 days ago No shit, every land that was spanish ruled has that. I simply have not traveled since that time. The feds like it that way though, they need lawless shitholes to work their sorcery. permalink parent award report block reply\nTruthyBrat 2 points 6 days ago PR has been a low-trust society since forever. Known for criminality. When all the locals buy gobs of razor wire and wrought iron security bars that tells you a lot about the place. That long pre-dated the Plandemic. permalink parent award report block reply DoMagnum 2 points 5 days ago No shit, every land that was spanish ruled has that. I simply have not traveled since that time. The feds like it that way though, they need lawless shitholes to work their sorcery. permalink parent award report block reply\nDoMagnum 2 points 5 days ago No shit, every land that was spanish ruled has that. I simply have not traveled since that time. The feds like it that way though, they need lawless shitholes to work their sorcery. permalink parent award report block reply\nInfinitesimalOrange 6 points 6 days ago INSTANTLY WASTING MONEY. I WANT TO HEAR LITERALLY NOTHING ABOUT MONEY FROM DEMOCRATS EVER AGAIN. THEY BURN MONEY FOR THE LULZ. permalink award report block reply\nHillarysFUPA 6 points 6 days ago This is not hypothetical... This is by design and exactly how socialism works.  Rich on top, getting richer, poor everyone else. permalink award report block reply\ngaijin_ronin 5 points 6 days ago Hopefully this muzzie piece of shit dies in a plane crash because of a DEI (or DIE in this case) hire. permalink award report block reply\nDontTreadOnLego 5 points 6 days ago REVOKE HIS REENTRY.  Illegal needs to stay out. permalink award report block reply RockapulcoRedpill 3 points 6 days ago there is no reentry it's a domestic flight permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Shoot it down. permalink parent award report block reply\nRockapulcoRedpill 3 points 6 days ago there is no reentry it's a domestic flight permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Shoot it down. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Shoot it down. permalink parent award report block reply\nhnoble444 5 points 6 days ago LOL I hope New YOrkers pay attention to what's going to unfold, a master class in socialism, REAL socialism, hypocrisy, corruption, criminality, authoritarianism, wealth redistribution, anti-whitism. Oh this is going to be quite the show. permalink award report block reply Nellie_the_Beaut 1 points 5 days ago Socialism done right, dammit! permalink parent award report block reply\nNellie_the_Beaut 1 points 5 days ago Socialism done right, dammit! permalink parent award report block reply\nDev404 5 points 6 days ago Champagne socialist acting like a champagne socialist...... no way...... permalink award report block reply\nMEME-SUPREME 4 points 6 days ago 🍿🍿🍿🍿 Don't get fooled again dems. 🤣 permalink award report block reply\ndonkeyKang 4 points 6 days ago He's secretly gay. Allegedly. LOLOLOL permalink award report block reply\nUpvoteBot 4 points 6 days ago This is always the case and the stupidest people on earth will always buy it. permalink award report block reply thunderpussy 2 points 6 days ago Indeed. Garden variety. Do these people know ANYTHING about history whatsoever? permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago History is rayyycisss! permalink parent award report block reply\nthunderpussy 2 points 6 days ago Indeed. Garden variety. Do these people know ANYTHING about history whatsoever? permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago History is rayyycisss! permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago History is rayyycisss! permalink parent award report block reply\nMasterVader2U 4 points 6 days ago Puerto Rico is a human trafficking hub. They are making him officially part of the club. permalink award report block reply\nDeltamyass 4 points 6 days ago Wealth for me! permalink award report block reply\nThe_Bloofy_Bullshark 4 points 6 days ago lol I’ve spent a lot of time at that Hilton. It really isn’t as great as they make it out to be (place was relevant in the 1960s), but of course he would go there. Because in socialism, the “leaders” are different than everyone else. As for the resort, they are absolute fucking assholes about the rules there to the point where it makes vacations less enjoyable than they should be (last time I went there, you had a wristband but still have to check in with a security guard every single time you wanted to walk down from the main bar area/lobby to the pool). Restaurants are nice though and their bartenders are cool. Cash bar, not all-inclusive, so bin Laden over here will feel right at home. Their spa and gym are pretty fucking killer though, I’ll give them that (I hope he stays far away from both). Place seemingly was always packed with ultra Orthodox Jews. Starcucks always had a massive line. Unless you camp out in the morning, good luck getting a chair/towel. I fed an iguana a quesadilla. If anyone here is ever planning on going to PR though, stay at the Palacio Provincial in San Juan. No annoying kids. permalink award report block reply\nonesummerdream 4 points 6 days ago Ahahahahahahahahahahahahahahaha! Good luck NYC! permalink award report block reply\nGenericwhitemale 3 points 6 days ago CNN and MSDNC will be reporting nonstop about this for sure! /s permalink award report block reply\nUnboosted 3 points 6 days ago Mamdanis luxury trip raises questions about socialist values and accountability\"-  ? No it doesnt. They take the money abd use it for themselves. Duh permalink award report block reply\nHerc130 3 points 6 days ago Well,  that's not far from Epstein's island. Probably looking for some \"decorations\" for his new mansion. permalink award report block reply sordfysh PRO 3 points 6 days ago Couldn't he just eminent domain Epstein's vampire mansion? The guy is dead, so what's going on with his NYC mansion? permalink parent award report block reply\nsordfysh PRO 3 points 6 days ago Couldn't he just eminent domain Epstein's vampire mansion? The guy is dead, so what's going on with his NYC mansion? permalink parent award report block reply\nMinnieWhittaker 3 points 6 days ago Some animals are more equal than others. permalink award report block reply\nbehemoth887 3 points 6 days ago like any good \"socialist\" the moment he gets a tiny amount of power he starts spending other people's money like crazy permalink award report block reply\nZacktopia33 3 points 6 days ago Don't we use PR to test military equipment? permalink award report block reply Chuj 3 points 6 days ago We used to. The bombing area is now a resort island with bioluminescent critters (natural, not nuclear, and very cool) permalink parent award report block reply Zacktopia33 3 points 6 days ago Then NYC will have to be the new PR. It's been headed that way for a long time. permalink parent award report block reply\nChuj 3 points 6 days ago We used to. The bombing area is now a resort island with bioluminescent critters (natural, not nuclear, and very cool) permalink parent award report block reply Zacktopia33 3 points 6 days ago Then NYC will have to be the new PR. It's been headed that way for a long time. permalink parent award report block reply\nZacktopia33 3 points 6 days ago Then NYC will have to be the new PR. It's been headed that way for a long time. permalink parent award report block reply\nKennyKetchem 2 points 6 days ago I hope he finds poison permalink award report block reply\nFullyDilated 2 points 6 days ago already on a goat fucking holiday? permalink award report block reply\nridge3z 2 points 6 days ago He's following in Bernie Sanders footsteps permalink award report block reply\ngodgoldnguns 2 points 6 days ago Should be in Cuba permalink award report block reply Chuj 2 points 6 days ago Same flag, inverted colors permalink parent award report block reply BoricuaPede 2 points 5 days ago Fun fact: That flag was designed in NYC by Cubans and Puerto Ricans in exile who were plotting to take their islands from Spain and join the USA. permalink parent award report block reply Chuj 1 points 5 days ago Cool. I did not know that. I've been to PR twice. I'll pass on Cuba though permalink parent award report block reply\nChuj 2 points 6 days ago Same flag, inverted colors permalink parent award report block reply BoricuaPede 2 points 5 days ago Fun fact: That flag was designed in NYC by Cubans and Puerto Ricans in exile who were plotting to take their islands from Spain and join the USA. permalink parent award report block reply Chuj 1 points 5 days ago Cool. I did not know that. I've been to PR twice. I'll pass on Cuba though permalink parent award report block reply\nBoricuaPede 2 points 5 days ago Fun fact: That flag was designed in NYC by Cubans and Puerto Ricans in exile who were plotting to take their islands from Spain and join the USA. permalink parent award report block reply Chuj 1 points 5 days ago Cool. I did not know that. I've been to PR twice. I'll pass on Cuba though permalink parent award report block reply\nChuj 1 points 5 days ago Cool. I did not know that. I've been to PR twice. I'll pass on Cuba though permalink parent award report block reply\nTacitus1963 2 points 6 days ago Mamdani was raised on the rabid anti-white rhetoric of the ANC and EFF in South Africa. His father was even too radical for the University of Capetown and had to move on. However, he got a job at Columbia without a problem. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink award report block reply\nSimaYi 2 points 6 days ago If I can't stay in a luxurious resort, what's the point of fighting for le people? permalink award report block reply\nknnbccb 2 points 6 days ago Not a hypocrite, that's who they really are. permalink award report block reply\nThePatriotGames2016 2 points 6 days ago saying a communist doing communist things is not a hypocrite. it's calling a fag a fag. permalink award report block reply\nHeavenlyTrumpets 2 points 6 days ago lol permalink award report block reply\nVikingHalo45 2 points 6 days ago We knew he was a fake POS.   NY will have to learn later. permalink award report block reply\nemorphia 2 points 6 days ago well he did ask for donations.  i guess he needs some gambling money for that resort. permalink award report block reply\nsocal_maga 2 points 6 days ago Fuckin fag permalink award report block reply\nBastard 2 points 6 days ago The people that run a socialist state are worse than the \"billionaires\" lefties rail against.  I hope Mandani proves that every day. permalink award report block reply\ndavidac1982 2 points 6 days ago the FBI better be bugging the whole thing… permalink award report block reply KernalMustard 2 points 6 days ago Thats why hes in PR. Far enough out of sight and not have anything bugged permalink parent award report block reply\nKernalMustard 2 points 6 days ago Thats why hes in PR. Far enough out of sight and not have anything bugged permalink parent award report block reply\nTellman125 2 points 6 days ago That spoiled and pampered little shit takes office on January 1, which means there's still nearly TWO WHOLE MONTHS while he's still in this hyper idealistic phase. Right now he's still in his campaign-rally/debate mode of being a 10th grader all giddy and over-eager to do his class presentation where he gets to impress the stupid woman fake-history teacher with all the bullshit he has memorized from her lectures and reading assignments. He was the most absent assembly member in his 4 years there. So, once he becomes mayor and has to start show up EVERY SINGLE DAY to 2, 3, or 4  crisis locations (fires, gang violence, tragedies, emergencies), or tense union meetings, or business groups, or whatever ethnic group meetings (all sort of NON-Muslim ones he doesn't give a shit about), he'll start burning out fast and unravel and start saying shit that reveals how uninterested, underequipped, and unqualified he is for the job. His campaign was such a breeze, letting his TikTok videos do the work for him, and her kept up the phony grin for the 2 hours of the 2 debates, but he won't be able to keep that fucking phony grin on his face for that many hours a day, and with so many people telling him their stories, complaining to him, pleading with him, and hectoring him. permalink award report block reply\nthisisatestof2 2 points 6 days ago I knew I would have ample opportunities to break out the popcorn, just not this soon. permalink award report block reply\nAmericanJawa 2 points 6 days ago Mamdani's luxury trip raises questions about socialist values and accountability. It's par the course for communists, really. permalink award report block reply thunderpussy 3 points 6 days ago Really. Like an earlier poster said, this is the norm for socialists and commies. Party big wigs and apparatchiks living the good and luxurious life, while the masses  live in squalor.... permalink parent award report block reply\nthunderpussy 3 points 6 days ago Really. Like an earlier poster said, this is the norm for socialists and commies. Party big wigs and apparatchiks living the good and luxurious life, while the masses  live in squalor.... permalink parent award report block reply\ntlorsung 2 points 6 days ago Don't allow him back!   have someone steal his passport! permalink award report block reply\n2025WhatIsTrue 1 points 6 days ago This guy is a pathetic joke.  The \"voters\" in NYC are pathetic jokes.  They deserve what they get. LOL! permalink award report block reply\nMR__K 1 points 6 days ago Its for himself hes worked hard infiltrating the government of his enemies permalink award report block reply\nShih_Tabed 1 points 6 days ago If anyone has an opportunity to take care of business they should probably do it.  Your family will be well compensated. permalink award report block reply\nbooblitchutz 1 points 5 days ago But you know, he needs money for his “transition “. permalink award report block reply\nBoricuaPede 1 points 5 days ago It's really not that nice of a resort. Trust me. permalink award report block reply\nquiznossucks 1 points 6 days ago sooooo it's off to a good start  ??? permalink award report block reply\ndontdrinksoy 1 points 5 days ago Another champagne socialist. permalink award report block reply\nNellie_the_Beaut 1 points 5 days ago lol, he’s 34 and already looks like he’s 44.  All I keep hearing is about how incredibly handsome, attractive, good looking this Ugandan guy is, with the megawatt Hollywood smile and great charisma. He looks like any other wealthy middle-aged Indian guy who has been spoiled by daddy and mama his whole life.  Well fed, expensive hair cut and groomed beard, nice clothes. Arrogance that only comes from being treated like a little prince that can do no wrong. Mamdani will look like a beefy and bloated Sadham Husain exiting the bunker by the time his term is up.  All these champagne communists always end up gorging themselves on the spoils. permalink award report block reply\nstarjello 1 points 5 days ago That's all the left of know is hypocrisy. This guy could be a Bernie bro permalink award report block reply\n1LoathsomeDove 1 points 5 days ago Is he delivering money or accepting it?\nAnybody watching this fucker while he's there? permalink award report block reply\nBallotsOnRubysUSB -5 points 6 days ago ︎ Don't let him fly back to the States! ︎ permalink award report block reply As1487 2 points 6 days ago He flew from NY to PR. He never left ‘the States’ permalink parent award report block reply\nAs1487 2 points 6 days ago He flew from NY to PR. He never left ‘the States’ permalink parent award report block reply"
}