{
  "id": "1ARK56iSet",
  "url": "https://patriots.win/p/1ARK56iSet/j6-pipe-bomber-believed-to-be-fe/c",
  "content": "532 J6 pipe bomber believed to be female Capitol Hill police officer posted 5 days ago by Tailgunnerjoe 38 comments award share report block Officer Lew @officer_Lew • 6d \"Less lethal\" instructor Kerkhoff departed the @CapitolPolice roughly six months after January 6. Colleagues learned she joined a three-letter federal intelligence agency. \"She promptly scrubbed her social media, phone numbers, and email accounts.\" Officer Lew @officer_Lew • 6d NEW🚨: “A credible source just told me the January 6th pipe bomber was a female Capitol Police officer.” -Per @CaraCastronuova\n38 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Zhongda 27 points 5 days ago Whoops.  Turns out she's dead now.  Shucks.  If only we knew!!!  Oh well.  Carry on, slave.  We need more money to fund more government bullshit. permalink award report block reply mikethemarine 11 points 5 days ago Yep, the laying of the bombs was her assignment to be able to get into the FBI, they will all now say they didn't know about what she had done before joining the FBI. I was incorrect, she went to the CIA. Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. permalink parent award report block reply UCantStumpTheTrump 10 points 5 days ago Man I remember way back in 2021 looking at that video and thinking it looked like a female FBI agent! Not far off at all! permalink parent award report block reply RealmanPwns 5 points 5 days ago She went to CIA not FBI permalink parent award report block reply snoopy3210 2 points 4 days ago Why would be trust a twitter account? permalink parent award report block reply RealmanPwns 1 points 4 days ago https://www.theblaze.com/news/former-capitol-police-officer-a-forensic-match-for-jan-6-pipe-bomber-sources-say permalink parent award report block reply mikethemarine 1 points 4 days ago Yep you are correct. Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. permalink parent award report block reply Infidel 10 points 5 days ago the plot thickens: https://x.com/officer_Lew/status/1986654965855646051 The source is Steve Baker https://www.theblaze.com/news/shes-one-of-us-steve-baker-stuns-glenn-beck-with-bombshell-revelation-about-j6-pipe-bomb-suspect I see she also was the first prosecution witness to testify against Jan 6th defendants. I bet there are probably even communications between her and Pelosi that day, who was in charge of Capitol Police. Does this have anything to do with her sudden retirement announcement after decades in Congress? Just the fact that they claim not to have found them, and they went all around the US rounding up people for MISDAMEANORS.... just shows it's a coverup, fedsurrection. People need to go to jail. You think the J6 committee didn't know? This could be why those capitol police killed themselves. The entire J6 committee should be stripped of title, and arrested. The harm they did to the country with their false narratives, hate, and division is unforgivable. Also they used all the cell phone data to go after and find and persecute all the Jan 6th orderly velvet rope strollers. We see in the downgraded videos of the pipe bomber she was on a cell phone in the area where she placed the fake bombs. I wonder who she was talking to? Or will those geo fences phone data be accidentally deleted as well? permalink award report block reply Deplora 10 points 5 days ago A version of this that I read a couple of hours ago said that some of her colleagues \"believed\" she went to an intel agency.  Now this clickbaiter has stretched it to they \"learned\" she went to an intel agency as if this definitely happened, though no new information has come out since the \"believed\" version started circulating. Until an official source starts confirming some of this story, it's nothing but a rumor. permalink award report block reply SwampRangers 14 points 5 days ago Until an official source starts confirming some of this story, it's nothing but a rumor. Yes, but there's evidence this is all about to drop: The bomber had all three phones' data spoofed by AT&T so had some connection to pull. [Tony Seruga] The bomber had an Outback Wilderness just like Capitol Police officer Shauni Kerkhoff. [Marco Polo] There is an emoji floating around of a hoodie wearer that looks like Shauni Kerkhoff. [Breanna Morello] The bomber had the rough height and build of Shauni Kerkhoff. [Ivan Raiklin] The bomber's gait analysis is a 94% match to Shauni Kerkhoff. [Joseph MacKinnon] The bomber on J5 caused a distraction that caused Shauni Kerkhoff's police force to be dwindled on J6. [Steve Baker] The bomber is a woman with the initials S.K. [Kyle Seraphin] intense popcorn-munching sounds permalink parent award report block reply zooty 13 points 5 days ago Any time in the next 13 to 15 days. permalink parent award report block reply HanginChad 4 points 5 days ago There should be a name for this time increment. permalink parent award report block reply Retardloserimsogay 3 points 5 days ago How many days are in a week again? permalink parent award report block reply view 1 more comments... LibertyFox 3 points 4 days ago Wasn't AT&T the carrier that was all-too-happy to turn over Republican Senators' phone records to Jack Smith without question? permalink parent award report block reply Deplora 1 points 5 days ago Or it's just a giant circle jerk of clickbaiters who don't actually know anything beyond what they heard from other clickbaiters.  We'll see. permalink parent award report block reply MastaJoda 5 points 5 days ago 😂🤣😂☝This douche believes official sources and experts. \"Im going to wait until my 100% honest and trustworthy fed gov tells me what to believe.🤡👍'' You mean the same official sources who claimed it was definitely a MAGA terrorist???🤣😂🤣😂🤣😂👍yeah, OK permalink parent award report block reply nakedjay 2 points 4 days ago Same people that don't think it's official till it comes from the NYT. 😂 permalink parent award report block reply Deplora 1 points 5 days ago I'll believe Trump's government over a bunch of purely profit-driven self-employed pundits and social media clickbaiters.  Who knows?  Maybe Trump's government will confirm a lot of these rumors.  But maybe not, because maybe they're not true. permalink parent award report block reply redinmn 8 points 5 days ago So did that look like she was waving to officers driving by and then did the OOPS and turned it into a big yawn instead? permalink award report block reply tomthung 2 points 5 days ago yep permalink parent award report block reply TruthWillOut 1 points 5 days ago Did the officer/s inside then also had a brief chat with her? Inquiring minds want to know. permalink parent award report block reply DJTXLV 1 points 4 days ago Damn. Good catch. Exactly what that is permalink parent award report block reply JoeBidensDementia1 8 points 5 days ago Why is this being revealed now though? And why isn't this coming from the FBI? permalink award report block reply MastaJoda 9 points 5 days ago The FBI only covers up DC crimes...never seeks prosecution of DC crooks. This is common knowledge. permalink parent award report block reply deleted 8 points 5 days ago BidenShowerDrool 3 points 5 days ago ^^Bingo permalink parent award report block reply Ch3f4554551n 2 points 5 days ago I don't understand why this isn't common knowledge on PDW. READ:\nDr. John Coleman Whitney Webb John O'Neal Daniel Estulin permalink parent award report block reply onesummerdream 1 points 4 days ago 👆 The Man Who Warned America: The Life and Death of John O'Neill, the FBI's Embattled Counterterror Warrior. The More You Know … permalink parent award report block reply Moebius 7 points 5 days ago Typical. ...and Capitol Police cannot be FOIA'd for any of her records. permalink award report block reply PunishedSnek 5 points 5 days ago Makes sense it's a Trump hating dike permalink award report block reply Losferwords 5 points 5 days ago She is now employed by the FBI. permalink award report block reply Ryker 1 points 5 days ago Where was she September 10 ? permalink parent award report block reply KewMan 2 points 5 days ago She look retarded... permalink award report block reply infinitysupreme 2 points 4 days ago You can't trust this . . . but you know it's closer to the truth than any other story about the pipe bomber permalink award report block reply throttlejohnson 2 points 5 days ago good read here https://theconservativetreehouse.com/blog/2023/03/12/the-parliamentary-motive-behind-the-j6-fedsurrection/ permalink award report block reply frredy 1 points 5 days ago Thats an executable offence isnt it? permalink award report block reply Stlpoolguy 1 points 4 days ago She's got the same creepy eastern European look as those 2 brothers that collaborated against Trump permalink award report block reply\nZhongda 27 points 5 days ago Whoops.  Turns out she's dead now.  Shucks.  If only we knew!!!  Oh well.  Carry on, slave.  We need more money to fund more government bullshit. permalink award report block reply mikethemarine 11 points 5 days ago Yep, the laying of the bombs was her assignment to be able to get into the FBI, they will all now say they didn't know about what she had done before joining the FBI. I was incorrect, she went to the CIA. Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. permalink parent award report block reply UCantStumpTheTrump 10 points 5 days ago Man I remember way back in 2021 looking at that video and thinking it looked like a female FBI agent! Not far off at all! permalink parent award report block reply RealmanPwns 5 points 5 days ago She went to CIA not FBI permalink parent award report block reply snoopy3210 2 points 4 days ago Why would be trust a twitter account? permalink parent award report block reply RealmanPwns 1 points 4 days ago https://www.theblaze.com/news/former-capitol-police-officer-a-forensic-match-for-jan-6-pipe-bomber-sources-say permalink parent award report block reply mikethemarine 1 points 4 days ago Yep you are correct. Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. permalink parent award report block reply\nmikethemarine 11 points 5 days ago Yep, the laying of the bombs was her assignment to be able to get into the FBI, they will all now say they didn't know about what she had done before joining the FBI. I was incorrect, she went to the CIA. Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. permalink parent award report block reply UCantStumpTheTrump 10 points 5 days ago Man I remember way back in 2021 looking at that video and thinking it looked like a female FBI agent! Not far off at all! permalink parent award report block reply RealmanPwns 5 points 5 days ago She went to CIA not FBI permalink parent award report block reply snoopy3210 2 points 4 days ago Why would be trust a twitter account? permalink parent award report block reply RealmanPwns 1 points 4 days ago https://www.theblaze.com/news/former-capitol-police-officer-a-forensic-match-for-jan-6-pipe-bomber-sources-say permalink parent award report block reply mikethemarine 1 points 4 days ago Yep you are correct. Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. permalink parent award report block reply\nUCantStumpTheTrump 10 points 5 days ago Man I remember way back in 2021 looking at that video and thinking it looked like a female FBI agent! Not far off at all! permalink parent award report block reply\nRealmanPwns 5 points 5 days ago She went to CIA not FBI permalink parent award report block reply snoopy3210 2 points 4 days ago Why would be trust a twitter account? permalink parent award report block reply RealmanPwns 1 points 4 days ago https://www.theblaze.com/news/former-capitol-police-officer-a-forensic-match-for-jan-6-pipe-bomber-sources-say permalink parent award report block reply mikethemarine 1 points 4 days ago Yep you are correct. Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. permalink parent award report block reply\nsnoopy3210 2 points 4 days ago Why would be trust a twitter account? permalink parent award report block reply RealmanPwns 1 points 4 days ago https://www.theblaze.com/news/former-capitol-police-officer-a-forensic-match-for-jan-6-pipe-bomber-sources-say permalink parent award report block reply\nRealmanPwns 1 points 4 days ago https://www.theblaze.com/news/former-capitol-police-officer-a-forensic-match-for-jan-6-pipe-bomber-sources-say permalink parent award report block reply\nmikethemarine 1 points 4 days ago Yep you are correct. Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. permalink parent award report block reply\nInfidel 10 points 5 days ago the plot thickens: https://x.com/officer_Lew/status/1986654965855646051 The source is Steve Baker https://www.theblaze.com/news/shes-one-of-us-steve-baker-stuns-glenn-beck-with-bombshell-revelation-about-j6-pipe-bomb-suspect I see she also was the first prosecution witness to testify against Jan 6th defendants. I bet there are probably even communications between her and Pelosi that day, who was in charge of Capitol Police. Does this have anything to do with her sudden retirement announcement after decades in Congress? Just the fact that they claim not to have found them, and they went all around the US rounding up people for MISDAMEANORS.... just shows it's a coverup, fedsurrection. People need to go to jail. You think the J6 committee didn't know? This could be why those capitol police killed themselves. The entire J6 committee should be stripped of title, and arrested. The harm they did to the country with their false narratives, hate, and division is unforgivable. Also they used all the cell phone data to go after and find and persecute all the Jan 6th orderly velvet rope strollers. We see in the downgraded videos of the pipe bomber she was on a cell phone in the area where she placed the fake bombs. I wonder who she was talking to? Or will those geo fences phone data be accidentally deleted as well? permalink award report block reply\nDeplora 10 points 5 days ago A version of this that I read a couple of hours ago said that some of her colleagues \"believed\" she went to an intel agency.  Now this clickbaiter has stretched it to they \"learned\" she went to an intel agency as if this definitely happened, though no new information has come out since the \"believed\" version started circulating. Until an official source starts confirming some of this story, it's nothing but a rumor. permalink award report block reply SwampRangers 14 points 5 days ago Until an official source starts confirming some of this story, it's nothing but a rumor. Yes, but there's evidence this is all about to drop: The bomber had all three phones' data spoofed by AT&T so had some connection to pull. [Tony Seruga] The bomber had an Outback Wilderness just like Capitol Police officer Shauni Kerkhoff. [Marco Polo] There is an emoji floating around of a hoodie wearer that looks like Shauni Kerkhoff. [Breanna Morello] The bomber had the rough height and build of Shauni Kerkhoff. [Ivan Raiklin] The bomber's gait analysis is a 94% match to Shauni Kerkhoff. [Joseph MacKinnon] The bomber on J5 caused a distraction that caused Shauni Kerkhoff's police force to be dwindled on J6. [Steve Baker] The bomber is a woman with the initials S.K. [Kyle Seraphin] intense popcorn-munching sounds permalink parent award report block reply zooty 13 points 5 days ago Any time in the next 13 to 15 days. permalink parent award report block reply HanginChad 4 points 5 days ago There should be a name for this time increment. permalink parent award report block reply Retardloserimsogay 3 points 5 days ago How many days are in a week again? permalink parent award report block reply view 1 more comments... LibertyFox 3 points 4 days ago Wasn't AT&T the carrier that was all-too-happy to turn over Republican Senators' phone records to Jack Smith without question? permalink parent award report block reply Deplora 1 points 5 days ago Or it's just a giant circle jerk of clickbaiters who don't actually know anything beyond what they heard from other clickbaiters.  We'll see. permalink parent award report block reply MastaJoda 5 points 5 days ago 😂🤣😂☝This douche believes official sources and experts. \"Im going to wait until my 100% honest and trustworthy fed gov tells me what to believe.🤡👍'' You mean the same official sources who claimed it was definitely a MAGA terrorist???🤣😂🤣😂🤣😂👍yeah, OK permalink parent award report block reply nakedjay 2 points 4 days ago Same people that don't think it's official till it comes from the NYT. 😂 permalink parent award report block reply Deplora 1 points 5 days ago I'll believe Trump's government over a bunch of purely profit-driven self-employed pundits and social media clickbaiters.  Who knows?  Maybe Trump's government will confirm a lot of these rumors.  But maybe not, because maybe they're not true. permalink parent award report block reply\nSwampRangers 14 points 5 days ago Until an official source starts confirming some of this story, it's nothing but a rumor. Yes, but there's evidence this is all about to drop: The bomber had all three phones' data spoofed by AT&T so had some connection to pull. [Tony Seruga] The bomber had an Outback Wilderness just like Capitol Police officer Shauni Kerkhoff. [Marco Polo] There is an emoji floating around of a hoodie wearer that looks like Shauni Kerkhoff. [Breanna Morello] The bomber had the rough height and build of Shauni Kerkhoff. [Ivan Raiklin] The bomber's gait analysis is a 94% match to Shauni Kerkhoff. [Joseph MacKinnon] The bomber on J5 caused a distraction that caused Shauni Kerkhoff's police force to be dwindled on J6. [Steve Baker] The bomber is a woman with the initials S.K. [Kyle Seraphin] intense popcorn-munching sounds permalink parent award report block reply zooty 13 points 5 days ago Any time in the next 13 to 15 days. permalink parent award report block reply HanginChad 4 points 5 days ago There should be a name for this time increment. permalink parent award report block reply Retardloserimsogay 3 points 5 days ago How many days are in a week again? permalink parent award report block reply view 1 more comments... LibertyFox 3 points 4 days ago Wasn't AT&T the carrier that was all-too-happy to turn over Republican Senators' phone records to Jack Smith without question? permalink parent award report block reply Deplora 1 points 5 days ago Or it's just a giant circle jerk of clickbaiters who don't actually know anything beyond what they heard from other clickbaiters.  We'll see. permalink parent award report block reply\nzooty 13 points 5 days ago Any time in the next 13 to 15 days. permalink parent award report block reply HanginChad 4 points 5 days ago There should be a name for this time increment. permalink parent award report block reply Retardloserimsogay 3 points 5 days ago How many days are in a week again? permalink parent award report block reply view 1 more comments...\nHanginChad 4 points 5 days ago There should be a name for this time increment. permalink parent award report block reply Retardloserimsogay 3 points 5 days ago How many days are in a week again? permalink parent award report block reply view 1 more comments...\nRetardloserimsogay 3 points 5 days ago How many days are in a week again? permalink parent award report block reply view 1 more comments...\nLibertyFox 3 points 4 days ago Wasn't AT&T the carrier that was all-too-happy to turn over Republican Senators' phone records to Jack Smith without question? permalink parent award report block reply\nDeplora 1 points 5 days ago Or it's just a giant circle jerk of clickbaiters who don't actually know anything beyond what they heard from other clickbaiters.  We'll see. permalink parent award report block reply\nMastaJoda 5 points 5 days ago 😂🤣😂☝This douche believes official sources and experts. \"Im going to wait until my 100% honest and trustworthy fed gov tells me what to believe.🤡👍'' You mean the same official sources who claimed it was definitely a MAGA terrorist???🤣😂🤣😂🤣😂👍yeah, OK permalink parent award report block reply nakedjay 2 points 4 days ago Same people that don't think it's official till it comes from the NYT. 😂 permalink parent award report block reply Deplora 1 points 5 days ago I'll believe Trump's government over a bunch of purely profit-driven self-employed pundits and social media clickbaiters.  Who knows?  Maybe Trump's government will confirm a lot of these rumors.  But maybe not, because maybe they're not true. permalink parent award report block reply\nnakedjay 2 points 4 days ago Same people that don't think it's official till it comes from the NYT. 😂 permalink parent award report block reply\nDeplora 1 points 5 days ago I'll believe Trump's government over a bunch of purely profit-driven self-employed pundits and social media clickbaiters.  Who knows?  Maybe Trump's government will confirm a lot of these rumors.  But maybe not, because maybe they're not true. permalink parent award report block reply\nredinmn 8 points 5 days ago So did that look like she was waving to officers driving by and then did the OOPS and turned it into a big yawn instead? permalink award report block reply tomthung 2 points 5 days ago yep permalink parent award report block reply TruthWillOut 1 points 5 days ago Did the officer/s inside then also had a brief chat with her? Inquiring minds want to know. permalink parent award report block reply DJTXLV 1 points 4 days ago Damn. Good catch. Exactly what that is permalink parent award report block reply\ntomthung 2 points 5 days ago yep permalink parent award report block reply\nTruthWillOut 1 points 5 days ago Did the officer/s inside then also had a brief chat with her? Inquiring minds want to know. permalink parent award report block reply\nDJTXLV 1 points 4 days ago Damn. Good catch. Exactly what that is permalink parent award report block reply\nJoeBidensDementia1 8 points 5 days ago Why is this being revealed now though? And why isn't this coming from the FBI? permalink award report block reply MastaJoda 9 points 5 days ago The FBI only covers up DC crimes...never seeks prosecution of DC crooks. This is common knowledge. permalink parent award report block reply deleted 8 points 5 days ago BidenShowerDrool 3 points 5 days ago ^^Bingo permalink parent award report block reply Ch3f4554551n 2 points 5 days ago I don't understand why this isn't common knowledge on PDW. READ:\nDr. John Coleman Whitney Webb John O'Neal Daniel Estulin permalink parent award report block reply onesummerdream 1 points 4 days ago 👆 The Man Who Warned America: The Life and Death of John O'Neill, the FBI's Embattled Counterterror Warrior. The More You Know … permalink parent award report block reply\nMastaJoda 9 points 5 days ago The FBI only covers up DC crimes...never seeks prosecution of DC crooks. This is common knowledge. permalink parent award report block reply deleted 8 points 5 days ago BidenShowerDrool 3 points 5 days ago ^^Bingo permalink parent award report block reply Ch3f4554551n 2 points 5 days ago I don't understand why this isn't common knowledge on PDW. READ:\nDr. John Coleman Whitney Webb John O'Neal Daniel Estulin permalink parent award report block reply onesummerdream 1 points 4 days ago 👆 The Man Who Warned America: The Life and Death of John O'Neill, the FBI's Embattled Counterterror Warrior. The More You Know … permalink parent award report block reply\ndeleted 8 points 5 days ago BidenShowerDrool 3 points 5 days ago ^^Bingo permalink parent award report block reply Ch3f4554551n 2 points 5 days ago I don't understand why this isn't common knowledge on PDW. READ:\nDr. John Coleman Whitney Webb John O'Neal Daniel Estulin permalink parent award report block reply onesummerdream 1 points 4 days ago 👆 The Man Who Warned America: The Life and Death of John O'Neill, the FBI's Embattled Counterterror Warrior. The More You Know … permalink parent award report block reply\nBidenShowerDrool 3 points 5 days ago ^^Bingo permalink parent award report block reply\nCh3f4554551n 2 points 5 days ago I don't understand why this isn't common knowledge on PDW. READ:\nDr. John Coleman Whitney Webb John O'Neal Daniel Estulin permalink parent award report block reply onesummerdream 1 points 4 days ago 👆 The Man Who Warned America: The Life and Death of John O'Neill, the FBI's Embattled Counterterror Warrior. The More You Know … permalink parent award report block reply\nonesummerdream 1 points 4 days ago 👆 The Man Who Warned America: The Life and Death of John O'Neill, the FBI's Embattled Counterterror Warrior. The More You Know … permalink parent award report block reply\nMoebius 7 points 5 days ago Typical. ...and Capitol Police cannot be FOIA'd for any of her records. permalink award report block reply\nPunishedSnek 5 points 5 days ago Makes sense it's a Trump hating dike permalink award report block reply\nLosferwords 5 points 5 days ago She is now employed by the FBI. permalink award report block reply Ryker 1 points 5 days ago Where was she September 10 ? permalink parent award report block reply\nRyker 1 points 5 days ago Where was she September 10 ? permalink parent award report block reply\nKewMan 2 points 5 days ago She look retarded... permalink award report block reply\ninfinitysupreme 2 points 4 days ago You can't trust this . . . but you know it's closer to the truth than any other story about the pipe bomber permalink award report block reply\nthrottlejohnson 2 points 5 days ago good read here https://theconservativetreehouse.com/blog/2023/03/12/the-parliamentary-motive-behind-the-j6-fedsurrection/ permalink award report block reply\nfrredy 1 points 5 days ago Thats an executable offence isnt it? permalink award report block reply\nStlpoolguy 1 points 4 days ago She's got the same creepy eastern European look as those 2 brothers that collaborated against Trump permalink award report block reply",
  "fetched_at": "2025-11-12T23:01:38.982544Z"
}