{
  "id": "1ARK54SlkO",
  "url": "https://patriots.win/p/1ARK54SlkO/conservatives-are-now-pointing-t/c",
  "content": "261 Conservatives are now pointing to inconsistencies in the New Jersey gubernatorial race after nearly 500,000 new voters appeared from 2021 to 2025 posted 5 days ago by CounterStrike 21 comments award share download report block\n21 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style Tim_Berframer 14 points 5 days ago Elections are the perfect vehicle for fraud. Hide it until actual voting, steal the win, then deny, deny, deny. Once you are in, nobody can get you out. Dims own the process. It's all they've got. permalink award report block reply NotYourMan 8 points 5 days ago No voter ID is cheating.  Drop off ballot boxes is cheating as we found with the 2000 Mules data.  Dead people voting is cheating.  Ballot harvesting senior homes and apartments to write in the democrat candidate is cheating. permalink parent award report block reply cuhboose 5 points 5 days ago Lol just like the 20 million random democrats for Biden permalink award report block reply SpeekFreely 5 points 5 days ago Isn’t MAGA babe Alina Habba in NJ ? What’s she doing in response to this ? permalink award report block reply Oldman1234 1 points 5 days ago Before this recent election, she was quoted as having said that she will enforce the law to the fullest extent if any election fraud occurs in New Jersey.  Since we haven't heard anything, I'm assuming no election fraud occurred. https://savejersey.com/2025/04/habba-launches-n-j-election-intergrity-task-force/ permalink parent award report block reply lixa 1 points 5 days ago I wouldn't assume bec she hasn't made a statement that she isn't doing anything. permalink parent award report block reply SpeekFreely 1 points 5 days ago I checked her X act, and saw nothing current, but i don’t have an account so i may not be seeing recent posts. permalink parent award report block reply Bullet3250 4 points 5 days ago Without DOGE full analysis - it is all going to collapse into undocumented boring accusations. permalink award report block reply South_Florida_Guy 4 points 5 days ago That place is overrun by foreign invaders mostly from India permalink award report block reply Canadiapede7 3 points 5 days ago No shit. They do it every time, but let’s also not pretend that New Jersey isn’t absolutely retarded like the rest of the states around it. permalink award report block reply aqua27 2 points 5 days ago The republican party does nothing to clean up elections or win. permalink award report block reply suckmycorona 3 points 5 days ago Paid not too permalink parent award report block reply CyanScales 2 points 5 days ago Looks like R's keep gaining slightly, and D's keep adding more fraud. permalink award report block reply Krat 2 points 5 days ago Boden imported invaders permalink award report block reply NotYourMan 2 points 5 days ago Arrests?  Investigation?  Are they allowed to cheat because voting is a \"states\" right?  Like can states just have no voter ID, ballot harvesting, dead people voting, printing fake ballots, stuffing drop off ballot boxes and extensive cheating because voting is a state right? permalink award report block reply lixa 2 points 5 days ago Citizens are supposed to rebel. That's how our founding fathers intended it to be. That's the safeguard, not the federal gov coming to punish the state. I admit the latter would be easier though less of a safeguard. permalink parent award report block reply CounterStrike OP 2 points 5 days ago https://x.com/Rightanglenews/status/1986526277214613662 permalink award report block reply greatpumpkin 1 points 5 days ago Are they suggesting O'Biden's 81m were just ghosts in the machine? permalink award report block reply truthjusticetruth 1 points 5 days ago All election fraud from here on out is Pam Bondi’s fault and by extension Trump’s fault for not firing her. permalink award report block reply 3stepsahead 1 points 5 days ago This is what happens when you dont punish a child for stealing a cookie, and then lying about it with chocolate chip on their lips.  This will continue until the country is blue by minority. permalink award report block reply\nTim_Berframer 14 points 5 days ago Elections are the perfect vehicle for fraud. Hide it until actual voting, steal the win, then deny, deny, deny. Once you are in, nobody can get you out. Dims own the process. It's all they've got. permalink award report block reply NotYourMan 8 points 5 days ago No voter ID is cheating.  Drop off ballot boxes is cheating as we found with the 2000 Mules data.  Dead people voting is cheating.  Ballot harvesting senior homes and apartments to write in the democrat candidate is cheating. permalink parent award report block reply\nNotYourMan 8 points 5 days ago No voter ID is cheating.  Drop off ballot boxes is cheating as we found with the 2000 Mules data.  Dead people voting is cheating.  Ballot harvesting senior homes and apartments to write in the democrat candidate is cheating. permalink parent award report block reply\ncuhboose 5 points 5 days ago Lol just like the 20 million random democrats for Biden permalink award report block reply\nSpeekFreely 5 points 5 days ago Isn’t MAGA babe Alina Habba in NJ ? What’s she doing in response to this ? permalink award report block reply Oldman1234 1 points 5 days ago Before this recent election, she was quoted as having said that she will enforce the law to the fullest extent if any election fraud occurs in New Jersey.  Since we haven't heard anything, I'm assuming no election fraud occurred. https://savejersey.com/2025/04/habba-launches-n-j-election-intergrity-task-force/ permalink parent award report block reply lixa 1 points 5 days ago I wouldn't assume bec she hasn't made a statement that she isn't doing anything. permalink parent award report block reply SpeekFreely 1 points 5 days ago I checked her X act, and saw nothing current, but i don’t have an account so i may not be seeing recent posts. permalink parent award report block reply\nOldman1234 1 points 5 days ago Before this recent election, she was quoted as having said that she will enforce the law to the fullest extent if any election fraud occurs in New Jersey.  Since we haven't heard anything, I'm assuming no election fraud occurred. https://savejersey.com/2025/04/habba-launches-n-j-election-intergrity-task-force/ permalink parent award report block reply lixa 1 points 5 days ago I wouldn't assume bec she hasn't made a statement that she isn't doing anything. permalink parent award report block reply SpeekFreely 1 points 5 days ago I checked her X act, and saw nothing current, but i don’t have an account so i may not be seeing recent posts. permalink parent award report block reply\nlixa 1 points 5 days ago I wouldn't assume bec she hasn't made a statement that she isn't doing anything. permalink parent award report block reply\nSpeekFreely 1 points 5 days ago I checked her X act, and saw nothing current, but i don’t have an account so i may not be seeing recent posts. permalink parent award report block reply\nBullet3250 4 points 5 days ago Without DOGE full analysis - it is all going to collapse into undocumented boring accusations. permalink award report block reply\nSouth_Florida_Guy 4 points 5 days ago That place is overrun by foreign invaders mostly from India permalink award report block reply\nCanadiapede7 3 points 5 days ago No shit. They do it every time, but let’s also not pretend that New Jersey isn’t absolutely retarded like the rest of the states around it. permalink award report block reply\naqua27 2 points 5 days ago The republican party does nothing to clean up elections or win. permalink award report block reply suckmycorona 3 points 5 days ago Paid not too permalink parent award report block reply\nsuckmycorona 3 points 5 days ago Paid not too permalink parent award report block reply\nCyanScales 2 points 5 days ago Looks like R's keep gaining slightly, and D's keep adding more fraud. permalink award report block reply\nKrat 2 points 5 days ago Boden imported invaders permalink award report block reply\nNotYourMan 2 points 5 days ago Arrests?  Investigation?  Are they allowed to cheat because voting is a \"states\" right?  Like can states just have no voter ID, ballot harvesting, dead people voting, printing fake ballots, stuffing drop off ballot boxes and extensive cheating because voting is a state right? permalink award report block reply lixa 2 points 5 days ago Citizens are supposed to rebel. That's how our founding fathers intended it to be. That's the safeguard, not the federal gov coming to punish the state. I admit the latter would be easier though less of a safeguard. permalink parent award report block reply\nlixa 2 points 5 days ago Citizens are supposed to rebel. That's how our founding fathers intended it to be. That's the safeguard, not the federal gov coming to punish the state. I admit the latter would be easier though less of a safeguard. permalink parent award report block reply\nCounterStrike OP 2 points 5 days ago https://x.com/Rightanglenews/status/1986526277214613662 permalink award report block reply\ngreatpumpkin 1 points 5 days ago Are they suggesting O'Biden's 81m were just ghosts in the machine? permalink award report block reply\ntruthjusticetruth 1 points 5 days ago All election fraud from here on out is Pam Bondi’s fault and by extension Trump’s fault for not firing her. permalink award report block reply\n3stepsahead 1 points 5 days ago This is what happens when you dont punish a child for stealing a cookie, and then lying about it with chocolate chip on their lips.  This will continue until the country is blue by minority. permalink award report block reply",
  "fetched_at": "2025-11-12T20:55:57.238445Z"
}