{
  "id": "8185011",
  "title": "129I am so sick of Walmart!posted6 hours agobyboredrandomguy39 commentsawardsharereportblock",
  "url": "https://patriots.win/p/1ARK9nNheT/i-am-so-sick-of-walmart/c",
  "content": "129 I am so sick of Walmart! posted 6 hours ago by boredrandomguy 39 comments award share report block My car is currently out of commission and I live on the edge of town far away from any grocery stores. As such, I'm at the mercy of getting a ride from someone or having food delivered. Last night I made the mistake of placing an order from Walmart to be delivered this morning.  I waited up until the near end of the delivery window. I received notice that the order was on the way. I watched the tracker show the GPS location of the driver (named Jose Louis) and the guy overshot my street and was driving up and down another street. After about 5-10 minutes of this, I received notice that my order was delivered and it showed a picture of a house that was not mine and one that I did not recognize.  I walked outside and checked a few neighbors' porches to no avail. I reached out to Walmart and had to go through the motions with an AI chatbot just to get them to call me.  I received a call about 15 minutes later (AI again) before finally connecting to a human being.  Of course that  person was in India with a thick accent. She argued at first, saying my order was delivered and to the correct address. After a few minutes of that, I finally got her to refund my order. I still had to go in to the order to manually remove the tip because that was considered a separate charge that went directly to their (probably illegal) delivery driver. So now I'm stuck without groceries. Fuck Walmart!\n39 comments Sort by Top Top New Worst Old Save 2flathat 15 points 6 hours ago Typical Walmart service. Sorry you're struggling. permalink award report block reply boredrandomguy OP 9 points 6 hours ago It's been a rough week. My fridge died last week, had to throw everything out and get a new fridge. A couple days after getting the new fridge, my car broke down and my mechanic can't get me in for about another week or so and it's looking like an expensive repair (likely head gasket). permalink parent award report block reply E-dantes 3 points 6 hours ago Or coolant in the oil pan? (This would make the oil look milky) permalink parent award report block reply boredrandomguy OP 4 points 6 hours ago Good question. I didn't dig that deep. I'm not a car person and don't want to touch anything. This is the second time the head gasket went out. It first happened at about 27k miles but was after the 3 year warranty ended. Now I'm at 70k and the same shit just happened again. 2012 Chevy Sonic. permalink parent award report block reply E-dantes 4 points 6 hours ago Get rid of that car the first chance you can. permalink parent award report block reply view 4 more comments... God-is-good 2 points 4 hours ago Those 5000k mile oil changes are critical. I blew a head gasket before anyone explained regular car maintenance to me. Not saying that’s what happened for you but that’s what I did wrong. permalink parent award report block reply E-dantes 1 points 6 hours ago Is there oil all over the place? permalink parent award report block reply Dreddhead13 2 points 6 hours ago Truly with customer service call in centers. permalink parent award report block reply Mega_MAGA 11 points 6 hours ago It might be easier to take an Uber to Walmart, rather than use their delivery. permalink award report block reply Throwingway22 7 points 5 hours ago I'm old enough to remember the 90's/early 2000's fight that small towns put up to keep Walmart out, to stop them from destroying the towns. Except in rare instances, local politicians forged ahead anyway and pushed a lot of towns barely surviving after the factory left over the edge. Then came the Obamacare flood of opiates... I'm sure this happened numerous times, but does anyone remember the famous story of a Walmart whos land lease (and subsidies) where comeing up and the local politicians wouldn't give them the tax waivers they wanted? Walmart up and closes their store and builds a new walmart like 100 yards away, on the other side of the town border, leaving the monstrosity of an empty building to decay? Walmart is evil. permalink award report block reply YaharaRiver 2 points 4 hours ago I absolutely do remember the fight to keep Walmarts out of small towns. Small dept stores on Main Street started closing or converting to tattoo shops and bars.  I remember Carmen’s that sold ONLY winter coats, nothing else!! And Fanny Farmers that sold ONLY candy, nothing else! Bookstores, florists, toys, even a store that sold ONLY posters for the wall. Wandering shops was fun because you could find this huge selection everywhere, exploring territory to find your valuable treasure. It’s how we passed a lot of happy hours. Until ‘get everything in one trip’ was seen as a big improvement, which it was at the time. Everyone suddenly wanted to be somewhere else!  People adapted. We always do. And then familiarity turns to contempt. It always does. The solution? TRADITION!  Certain things MUST be preserved. permalink parent award report block reply SHILL_DETECTOR 5 points 6 hours ago these people are retarded... probably an H1B permalink award report block reply Dreddhead13 1 points 6 hours ago Depending on where they're (OP) at. permalink parent award report block reply mty_green_go 4 points 5 hours ago bro for real get a bike. i'm in my 60's and bike across town whenever my car is out of commission. to be fair it's always warm here in south FL, so it makes it easier as long as its not raining permalink award report block reply KartoffelPuffer 1 points 3 hours ago Or a scooter or electric bike. My 73 yr old non-driving sibling bought one a few years back and claims it's been life changing. permalink parent award report block reply Scipio_Americanus 4 points 5 hours ago The worst part is Walmart doesn't include your address on the delivery sticker on the bag(s.) I've had Walmart orders dropped off at my door, but because the actual delivery address isn't on them, I can't just take them to the correct address. Walmart's system is fully stupid. permalink award report block reply Pats5x 2 points 3 hours ago I thought Trump was going to stop all this outsourcing? permalink award report block reply Come-mistertallyman 2 points 1 hour ago i tip ONLY cash, and to English speakers. i tried once to tell an illegal to wait for a tip, and he just turned and got in his car. he definitely no comprendo. permalink award report block reply E-dantes 2 points 6 hours ago What's wrong with your car? Honest question. permalink award report block reply boredrandomguy OP 1 points 6 hours ago It's smoking under the hood and spraying coolant all over the place and there is what appears to be oil in the coolant resevour. permalink parent award report block reply E-dantes 2 points 6 hours ago Rephrase: was hoping you'd say no to my other replies. permalink parent award report block reply E-dantes 1 points 6 hours ago Damn, was hoping you'd say no. Your mechanic is probably right. permalink parent award report block reply boredrandomguy OP 1 points 6 hours ago I haven't even taken it to him yet. He's booked up and can't get me in until next week. Right now it's rotting under a pile of snow in my driveway. permalink parent award report block reply E-dantes 1 points 6 hours ago Alright. You're probably right. Did the guy who did the last job on it have you come back in to recheck the torque on the head bolts after a couple/few hundred miles? permalink parent award report block reply Come-mistertallyman 2 points 1 hour ago we used to live 2 miles away from a Wally world, in nearly a straight line, down a 4-lane road.  should take about 10-15 mins MAX to get there. they used to provide a live view of the vehicle on it's way to your home. this retard (jorge or something similar) took my groceries on a 3-hour TOUR! SO many times, our groceries were delivered by someone besides the name on the app. Erica is on her way!  then jesus shows up. permalink award report block reply friarfox 2 points 5 hours ago Thank you come again/s permalink award report block reply pookiee68 2 points 5 hours ago What Democrat shithole do you live in? permalink award report block reply Dreddhead13 1 points 6 hours ago Are you located in a blue City? permalink award report block reply Dreddhead13 2 points 6 hours ago There's only a handful of immigrants here now where I'm at. And they're all legal. The illegal ones literally started disappearing after Trump was elected.  you can usually tell when they're driving a beater car, and they've got a temp tag in the window. One that looks like it's been hanging for the last 2 years. WalMart delivery was having problems with illegal immigrants using vetted peoples accounts to deliver.  Lately they've implemented regular identification verifications. And you can also see the driver's picture in the app when you're getting your delivery. Anyone who sees that it isn't the same person, that should be delivering your order, needs to report it immediately. Ever since the purge, we're getting better drivers here and less problems. But if you're in a blue City that would be a possible sanctuary, you're going to have issues. permalink parent award report block reply Dreddhead13 1 points 6 hours ago Also another thing. GPS gets s*** f***** up all the time. Yesterday I had GPS take me to the neighbor's house. But luckily I check every time I stop. A way to avoid a problem, however you gave them the address, put it in yourself to Google maps. See what happens. Make sure it's pointing to your home. You can do that also by turning on your overhead view to satellite. Uses a little more data, but will get you better results. Because Walmart has that address in there and you might have put the address in correct, if Google has it wrong, Walmart has it wrong. Because you can't even close or deliver the item unless you are in the right spot according to the app. But because a lot of these immigrants are low IQ, they don't know to double check and that Google is fallible. When this happens to me, I usually have to clock in the order at the wrong spot. Then drive the order to the correct spot to deliver. It's a pain in the ass. But you got to do what you got to do to get the job done correctly. Then I have to report it.  Hopefully to get the pajeets in customer service to change to the proper location. permalink parent award report block reply Dreddhead13 1 points 6 hours ago It's not always directly Walmart's fault. Nine times out of 10 it's Google. permalink parent award report block reply Dreddhead13 2 points 6 hours ago The only direct fault is hiring poor drivers. permalink parent award report block reply 73Cuda 0 points 2 hours ago Thats like being mad at Tesla when you spend 100k on a battery powered piece of shit, and getting mad if they lock you out...lol...you must be self sufficient, otherwise you dont make the rules to the game. permalink award report block reply Logan051361 0 points 6 hours ago you must have a fucked up Walmart. I can call my Walmart directly and get a normal person. Shit gets delivered here all the time. sounds like you have illegals working there. But im in a town with about 40,000 people permalink award report block reply Be_The_Change 0 points 6 hours ago Comment removed by community moderators. permalink award report block reply\n2flathat 15 points 6 hours ago Typical Walmart service. Sorry you're struggling. permalink award report block reply boredrandomguy OP 9 points 6 hours ago It's been a rough week. My fridge died last week, had to throw everything out and get a new fridge. A couple days after getting the new fridge, my car broke down and my mechanic can't get me in for about another week or so and it's looking like an expensive repair (likely head gasket). permalink parent award report block reply E-dantes 3 points 6 hours ago Or coolant in the oil pan? (This would make the oil look milky) permalink parent award report block reply boredrandomguy OP 4 points 6 hours ago Good question. I didn't dig that deep. I'm not a car person and don't want to touch anything. This is the second time the head gasket went out. It first happened at about 27k miles but was after the 3 year warranty ended. Now I'm at 70k and the same shit just happened again. 2012 Chevy Sonic. permalink parent award report block reply E-dantes 4 points 6 hours ago Get rid of that car the first chance you can. permalink parent award report block reply view 4 more comments... God-is-good 2 points 4 hours ago Those 5000k mile oil changes are critical. I blew a head gasket before anyone explained regular car maintenance to me. Not saying that’s what happened for you but that’s what I did wrong. permalink parent award report block reply E-dantes 1 points 6 hours ago Is there oil all over the place? permalink parent award report block reply Dreddhead13 2 points 6 hours ago Truly with customer service call in centers. permalink parent award report block reply\nboredrandomguy OP 9 points 6 hours ago It's been a rough week. My fridge died last week, had to throw everything out and get a new fridge. A couple days after getting the new fridge, my car broke down and my mechanic can't get me in for about another week or so and it's looking like an expensive repair (likely head gasket). permalink parent award report block reply E-dantes 3 points 6 hours ago Or coolant in the oil pan? (This would make the oil look milky) permalink parent award report block reply boredrandomguy OP 4 points 6 hours ago Good question. I didn't dig that deep. I'm not a car person and don't want to touch anything. This is the second time the head gasket went out. It first happened at about 27k miles but was after the 3 year warranty ended. Now I'm at 70k and the same shit just happened again. 2012 Chevy Sonic. permalink parent award report block reply E-dantes 4 points 6 hours ago Get rid of that car the first chance you can. permalink parent award report block reply view 4 more comments... God-is-good 2 points 4 hours ago Those 5000k mile oil changes are critical. I blew a head gasket before anyone explained regular car maintenance to me. Not saying that’s what happened for you but that’s what I did wrong. permalink parent award report block reply E-dantes 1 points 6 hours ago Is there oil all over the place? permalink parent award report block reply\nE-dantes 3 points 6 hours ago Or coolant in the oil pan? (This would make the oil look milky) permalink parent award report block reply boredrandomguy OP 4 points 6 hours ago Good question. I didn't dig that deep. I'm not a car person and don't want to touch anything. This is the second time the head gasket went out. It first happened at about 27k miles but was after the 3 year warranty ended. Now I'm at 70k and the same shit just happened again. 2012 Chevy Sonic. permalink parent award report block reply E-dantes 4 points 6 hours ago Get rid of that car the first chance you can. permalink parent award report block reply view 4 more comments... God-is-good 2 points 4 hours ago Those 5000k mile oil changes are critical. I blew a head gasket before anyone explained regular car maintenance to me. Not saying that’s what happened for you but that’s what I did wrong. permalink parent award report block reply\nboredrandomguy OP 4 points 6 hours ago Good question. I didn't dig that deep. I'm not a car person and don't want to touch anything. This is the second time the head gasket went out. It first happened at about 27k miles but was after the 3 year warranty ended. Now I'm at 70k and the same shit just happened again. 2012 Chevy Sonic. permalink parent award report block reply E-dantes 4 points 6 hours ago Get rid of that car the first chance you can. permalink parent award report block reply view 4 more comments... God-is-good 2 points 4 hours ago Those 5000k mile oil changes are critical. I blew a head gasket before anyone explained regular car maintenance to me. Not saying that’s what happened for you but that’s what I did wrong. permalink parent award report block reply\nE-dantes 4 points 6 hours ago Get rid of that car the first chance you can. permalink parent award report block reply view 4 more comments...\nGod-is-good 2 points 4 hours ago Those 5000k mile oil changes are critical. I blew a head gasket before anyone explained regular car maintenance to me. Not saying that’s what happened for you but that’s what I did wrong. permalink parent award report block reply\nE-dantes 1 points 6 hours ago Is there oil all over the place? permalink parent award report block reply\nDreddhead13 2 points 6 hours ago Truly with customer service call in centers. permalink parent award report block reply\nMega_MAGA 11 points 6 hours ago It might be easier to take an Uber to Walmart, rather than use their delivery. permalink award report block reply\nThrowingway22 7 points 5 hours ago I'm old enough to remember the 90's/early 2000's fight that small towns put up to keep Walmart out, to stop them from destroying the towns. Except in rare instances, local politicians forged ahead anyway and pushed a lot of towns barely surviving after the factory left over the edge. Then came the Obamacare flood of opiates... I'm sure this happened numerous times, but does anyone remember the famous story of a Walmart whos land lease (and subsidies) where comeing up and the local politicians wouldn't give them the tax waivers they wanted? Walmart up and closes their store and builds a new walmart like 100 yards away, on the other side of the town border, leaving the monstrosity of an empty building to decay? Walmart is evil. permalink award report block reply YaharaRiver 2 points 4 hours ago I absolutely do remember the fight to keep Walmarts out of small towns. Small dept stores on Main Street started closing or converting to tattoo shops and bars.  I remember Carmen’s that sold ONLY winter coats, nothing else!! And Fanny Farmers that sold ONLY candy, nothing else! Bookstores, florists, toys, even a store that sold ONLY posters for the wall. Wandering shops was fun because you could find this huge selection everywhere, exploring territory to find your valuable treasure. It’s how we passed a lot of happy hours. Until ‘get everything in one trip’ was seen as a big improvement, which it was at the time. Everyone suddenly wanted to be somewhere else!  People adapted. We always do. And then familiarity turns to contempt. It always does. The solution? TRADITION!  Certain things MUST be preserved. permalink parent award report block reply\nYaharaRiver 2 points 4 hours ago I absolutely do remember the fight to keep Walmarts out of small towns. Small dept stores on Main Street started closing or converting to tattoo shops and bars.  I remember Carmen’s that sold ONLY winter coats, nothing else!! And Fanny Farmers that sold ONLY candy, nothing else! Bookstores, florists, toys, even a store that sold ONLY posters for the wall. Wandering shops was fun because you could find this huge selection everywhere, exploring territory to find your valuable treasure. It’s how we passed a lot of happy hours. Until ‘get everything in one trip’ was seen as a big improvement, which it was at the time. Everyone suddenly wanted to be somewhere else!  People adapted. We always do. And then familiarity turns to contempt. It always does. The solution? TRADITION!  Certain things MUST be preserved. permalink parent award report block reply\nSHILL_DETECTOR 5 points 6 hours ago these people are retarded... probably an H1B permalink award report block reply Dreddhead13 1 points 6 hours ago Depending on where they're (OP) at. permalink parent award report block reply\nDreddhead13 1 points 6 hours ago Depending on where they're (OP) at. permalink parent award report block reply\nmty_green_go 4 points 5 hours ago bro for real get a bike. i'm in my 60's and bike across town whenever my car is out of commission. to be fair it's always warm here in south FL, so it makes it easier as long as its not raining permalink award report block reply KartoffelPuffer 1 points 3 hours ago Or a scooter or electric bike. My 73 yr old non-driving sibling bought one a few years back and claims it's been life changing. permalink parent award report block reply\nKartoffelPuffer 1 points 3 hours ago Or a scooter or electric bike. My 73 yr old non-driving sibling bought one a few years back and claims it's been life changing. permalink parent award report block reply\nScipio_Americanus 4 points 5 hours ago The worst part is Walmart doesn't include your address on the delivery sticker on the bag(s.) I've had Walmart orders dropped off at my door, but because the actual delivery address isn't on them, I can't just take them to the correct address. Walmart's system is fully stupid. permalink award report block reply\nPats5x 2 points 3 hours ago I thought Trump was going to stop all this outsourcing? permalink award report block reply\nCome-mistertallyman 2 points 1 hour ago i tip ONLY cash, and to English speakers. i tried once to tell an illegal to wait for a tip, and he just turned and got in his car. he definitely no comprendo. permalink award report block reply\nE-dantes 2 points 6 hours ago What's wrong with your car? Honest question. permalink award report block reply boredrandomguy OP 1 points 6 hours ago It's smoking under the hood and spraying coolant all over the place and there is what appears to be oil in the coolant resevour. permalink parent award report block reply E-dantes 2 points 6 hours ago Rephrase: was hoping you'd say no to my other replies. permalink parent award report block reply E-dantes 1 points 6 hours ago Damn, was hoping you'd say no. Your mechanic is probably right. permalink parent award report block reply boredrandomguy OP 1 points 6 hours ago I haven't even taken it to him yet. He's booked up and can't get me in until next week. Right now it's rotting under a pile of snow in my driveway. permalink parent award report block reply E-dantes 1 points 6 hours ago Alright. You're probably right. Did the guy who did the last job on it have you come back in to recheck the torque on the head bolts after a couple/few hundred miles? permalink parent award report block reply\nboredrandomguy OP 1 points 6 hours ago It's smoking under the hood and spraying coolant all over the place and there is what appears to be oil in the coolant resevour. permalink parent award report block reply E-dantes 2 points 6 hours ago Rephrase: was hoping you'd say no to my other replies. permalink parent award report block reply E-dantes 1 points 6 hours ago Damn, was hoping you'd say no. Your mechanic is probably right. permalink parent award report block reply boredrandomguy OP 1 points 6 hours ago I haven't even taken it to him yet. He's booked up and can't get me in until next week. Right now it's rotting under a pile of snow in my driveway. permalink parent award report block reply E-dantes 1 points 6 hours ago Alright. You're probably right. Did the guy who did the last job on it have you come back in to recheck the torque on the head bolts after a couple/few hundred miles? permalink parent award report block reply\nE-dantes 2 points 6 hours ago Rephrase: was hoping you'd say no to my other replies. permalink parent award report block reply\nE-dantes 1 points 6 hours ago Damn, was hoping you'd say no. Your mechanic is probably right. permalink parent award report block reply boredrandomguy OP 1 points 6 hours ago I haven't even taken it to him yet. He's booked up and can't get me in until next week. Right now it's rotting under a pile of snow in my driveway. permalink parent award report block reply E-dantes 1 points 6 hours ago Alright. You're probably right. Did the guy who did the last job on it have you come back in to recheck the torque on the head bolts after a couple/few hundred miles? permalink parent award report block reply\nboredrandomguy OP 1 points 6 hours ago I haven't even taken it to him yet. He's booked up and can't get me in until next week. Right now it's rotting under a pile of snow in my driveway. permalink parent award report block reply E-dantes 1 points 6 hours ago Alright. You're probably right. Did the guy who did the last job on it have you come back in to recheck the torque on the head bolts after a couple/few hundred miles? permalink parent award report block reply\nE-dantes 1 points 6 hours ago Alright. You're probably right. Did the guy who did the last job on it have you come back in to recheck the torque on the head bolts after a couple/few hundred miles? permalink parent award report block reply\nCome-mistertallyman 2 points 1 hour ago we used to live 2 miles away from a Wally world, in nearly a straight line, down a 4-lane road.  should take about 10-15 mins MAX to get there. they used to provide a live view of the vehicle on it's way to your home. this retard (jorge or something similar) took my groceries on a 3-hour TOUR! SO many times, our groceries were delivered by someone besides the name on the app. Erica is on her way!  then jesus shows up. permalink award report block reply\nfriarfox 2 points 5 hours ago Thank you come again/s permalink award report block reply\npookiee68 2 points 5 hours ago What Democrat shithole do you live in? permalink award report block reply\nDreddhead13 1 points 6 hours ago Are you located in a blue City? permalink award report block reply Dreddhead13 2 points 6 hours ago There's only a handful of immigrants here now where I'm at. And they're all legal. The illegal ones literally started disappearing after Trump was elected.  you can usually tell when they're driving a beater car, and they've got a temp tag in the window. One that looks like it's been hanging for the last 2 years. WalMart delivery was having problems with illegal immigrants using vetted peoples accounts to deliver.  Lately they've implemented regular identification verifications. And you can also see the driver's picture in the app when you're getting your delivery. Anyone who sees that it isn't the same person, that should be delivering your order, needs to report it immediately. Ever since the purge, we're getting better drivers here and less problems. But if you're in a blue City that would be a possible sanctuary, you're going to have issues. permalink parent award report block reply Dreddhead13 1 points 6 hours ago Also another thing. GPS gets s*** f***** up all the time. Yesterday I had GPS take me to the neighbor's house. But luckily I check every time I stop. A way to avoid a problem, however you gave them the address, put it in yourself to Google maps. See what happens. Make sure it's pointing to your home. You can do that also by turning on your overhead view to satellite. Uses a little more data, but will get you better results. Because Walmart has that address in there and you might have put the address in correct, if Google has it wrong, Walmart has it wrong. Because you can't even close or deliver the item unless you are in the right spot according to the app. But because a lot of these immigrants are low IQ, they don't know to double check and that Google is fallible. When this happens to me, I usually have to clock in the order at the wrong spot. Then drive the order to the correct spot to deliver. It's a pain in the ass. But you got to do what you got to do to get the job done correctly. Then I have to report it.  Hopefully to get the pajeets in customer service to change to the proper location. permalink parent award report block reply Dreddhead13 1 points 6 hours ago It's not always directly Walmart's fault. Nine times out of 10 it's Google. permalink parent award report block reply Dreddhead13 2 points 6 hours ago The only direct fault is hiring poor drivers. permalink parent award report block reply\nDreddhead13 2 points 6 hours ago There's only a handful of immigrants here now where I'm at. And they're all legal. The illegal ones literally started disappearing after Trump was elected.  you can usually tell when they're driving a beater car, and they've got a temp tag in the window. One that looks like it's been hanging for the last 2 years. WalMart delivery was having problems with illegal immigrants using vetted peoples accounts to deliver.  Lately they've implemented regular identification verifications. And you can also see the driver's picture in the app when you're getting your delivery. Anyone who sees that it isn't the same person, that should be delivering your order, needs to report it immediately. Ever since the purge, we're getting better drivers here and less problems. But if you're in a blue City that would be a possible sanctuary, you're going to have issues. permalink parent award report block reply Dreddhead13 1 points 6 hours ago Also another thing. GPS gets s*** f***** up all the time. Yesterday I had GPS take me to the neighbor's house. But luckily I check every time I stop. A way to avoid a problem, however you gave them the address, put it in yourself to Google maps. See what happens. Make sure it's pointing to your home. You can do that also by turning on your overhead view to satellite. Uses a little more data, but will get you better results. Because Walmart has that address in there and you might have put the address in correct, if Google has it wrong, Walmart has it wrong. Because you can't even close or deliver the item unless you are in the right spot according to the app. But because a lot of these immigrants are low IQ, they don't know to double check and that Google is fallible. When this happens to me, I usually have to clock in the order at the wrong spot. Then drive the order to the correct spot to deliver. It's a pain in the ass. But you got to do what you got to do to get the job done correctly. Then I have to report it.  Hopefully to get the pajeets in customer service to change to the proper location. permalink parent award report block reply Dreddhead13 1 points 6 hours ago It's not always directly Walmart's fault. Nine times out of 10 it's Google. permalink parent award report block reply Dreddhead13 2 points 6 hours ago The only direct fault is hiring poor drivers. permalink parent award report block reply\nDreddhead13 1 points 6 hours ago Also another thing. GPS gets s*** f***** up all the time. Yesterday I had GPS take me to the neighbor's house. But luckily I check every time I stop. A way to avoid a problem, however you gave them the address, put it in yourself to Google maps. See what happens. Make sure it's pointing to your home. You can do that also by turning on your overhead view to satellite. Uses a little more data, but will get you better results. Because Walmart has that address in there and you might have put the address in correct, if Google has it wrong, Walmart has it wrong. Because you can't even close or deliver the item unless you are in the right spot according to the app. But because a lot of these immigrants are low IQ, they don't know to double check and that Google is fallible. When this happens to me, I usually have to clock in the order at the wrong spot. Then drive the order to the correct spot to deliver. It's a pain in the ass. But you got to do what you got to do to get the job done correctly. Then I have to report it.  Hopefully to get the pajeets in customer service to change to the proper location. permalink parent award report block reply Dreddhead13 1 points 6 hours ago It's not always directly Walmart's fault. Nine times out of 10 it's Google. permalink parent award report block reply Dreddhead13 2 points 6 hours ago The only direct fault is hiring poor drivers. permalink parent award report block reply\nDreddhead13 1 points 6 hours ago It's not always directly Walmart's fault. Nine times out of 10 it's Google. permalink parent award report block reply Dreddhead13 2 points 6 hours ago The only direct fault is hiring poor drivers. permalink parent award report block reply\nDreddhead13 2 points 6 hours ago The only direct fault is hiring poor drivers. permalink parent award report block reply\n73Cuda 0 points 2 hours ago Thats like being mad at Tesla when you spend 100k on a battery powered piece of shit, and getting mad if they lock you out...lol...you must be self sufficient, otherwise you dont make the rules to the game. permalink award report block reply\nLogan051361 0 points 6 hours ago you must have a fucked up Walmart. I can call my Walmart directly and get a normal person. Shit gets delivered here all the time. sounds like you have illegals working there. But im in a town with about 40,000 people permalink award report block reply\nBe_The_Change 0 points 6 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T19:24:47.978299Z"
}