{
  "id": "1ARK54SlsZ",
  "url": "https://patriots.win/p/1ARK54SlsZ/dont-tell-us-to-calm-down/c",
  "content": "723 Don't tell us to \"calm down.\" posted 5 days ago by blue5707 19 comments award share report block aka @akafaceUS • 6d Don't tell us to \"calm down.\"\n19 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Super_Dave 35 points 5 days ago That still-frame of Iryna breaks my heart, every time.. permalink award report block reply DickTick PRO 19 points 5 days ago It really does. An absolutely beautiful woman that was very clearly dressing down as much as she could to make herself look as unappealing and average as possible so that freaks like this would leave her alone and even that wasn't enough.... She was the definition of minding your own business. Poor thing permalink parent award report block reply PlayboyPringles 10 points 5 days ago I think she just finished a shift at her work, which I believe is a pizza joint.  So I don't know if that's the case, but this image is truly heartbreaking nonetheless. permalink parent award report block reply starjello 3 points 5 days ago Me too. If only she would have stayed in her homeland supporting the young men that have had to give her their lives sacrificed. She may still be alive today and doing something productive for the young men on the front lines permalink parent award report block reply worldowedexplanation 2 points 5 days ago I’ve had 2 families of Ukrainian “refuge” neighbors in rural NC. They are being brought over by liberal landlords who are getting some kind of government kickback. So now they’re being murdered by liberals. Not my problem. Maybe they’ll learn. permalink parent award report block reply StCharlie 0 points 5 days ago So fucking haunting.  I couldn't stop replaying it.  I played it till my stomach was sick and my anger overflowing.  Watching that poor, innocent soul, get stabbed so many times, go into fetal position then roll over dead.  All with nobody batting a fucking eye.  Disgusting.  All killers of the innocent should receive the same death but worse. permalink parent award report block reply TearsAficionado 2 points 5 days ago That should have resulted in a massive uprising and a culling of that entire leftist criminal herd. Yet here we are 😕 permalink parent award report block reply StCharlie 2 points 5 days ago There is reason for that.  The best analogy is the matrix. When white people are in the matrix, every person could be a Smith agent.  If you draw attention to yourself talking about \"Europe and America are white countries that have been invaded\", then a femenazi, BLM, LGBTQ, antifa will appear.  Sometimes even those that have taken the red pill will betray you and want to make concessions to be rich and enjoy life in the simulation again. Trump is our Neo.  The deep state can't control him.  His money isn't beholden to the government.  We are all just the lost and wandering just trying to stay alive outside the matrix.  The average person only has the ability to red pill others and protect themselves.  The red pilled only enter the matrix to speak to those in the matrix and tell them the truth.  The Smith agents will kill anyone that remains in the matrix for too long converting others to MAGA.  That's why they killed Charlie Kirk.  He was red pilling faster than anyone.  Recognize that if you don't know how to fight in the matrix then you must try to convert cautiously and out of the prying eyes of others.  That is why Trinity met with Neo in the night club so no one could hear their conversation.  You need to know if the person you are talking to is \"ready\".  Some are critical thinkers and questioning people, they are easier to red pill.  They were already ready.  There are others that must be led down the rabbit hole by making them question their reality in the matrix. permalink parent award report block reply TearsAficionado 1 points 4 days ago That's actually a perfect explanation. I suppose now, we gotta do Kung fu. permalink parent award report block reply worldowedexplanation -1 points 5 days ago Trump is entirely controlled by the Deep State permalink parent award report block reply view 1 more comments... SirPokeSmottington 0 points 5 days ago That still-frame of Iryna breaks my heart, every time.. That's why not a single day goes past where the ones wanting to start a civil war, don't come on here and post it. EVERY... SINGLE... FUCKING... DAY... IT IS POSTED This site is not your friend. This site is trying to incite everyone here into crime. permalink parent award report block reply StCharlie 3 points 5 days ago As it should be.  You need to treat it as the current state of our society and how you should be \"armed\", \"aware\", and pick a place to sit where your eyes can be on everyone.  Everyone is a threat when you are a white person. permalink parent award report block reply drmrboy -1 points 5 days ago ☝️☝️☝️☝️☝️☝️ permalink parent award report block reply fskfsk 9 points 5 days ago If \"violence is an artificial construct\", why bother arresting Daniel Penny?  He only responded to one artificial construct with another artificial construct. permalink award report block reply Stolen 7 points 5 days ago There are so many other examples permalink award report block reply chickeninoven 2 points 5 days ago How bout the young kids, Julian Wood and Cannon Hinnant. Juluan's fat boon orc murderer was sentenced to life in prison last month. So I get to support that dumpy demonic fuck for the next 40 years. permalink parent award report block reply gustodog 3 points 5 days ago The same corrupt FBI that we're supposed to believe cracked the Kirk case still hasn't cracked the Butler case. We're supposed to believe the \"lone gunman\" narrative in both cases despite the strange circumstances around both incidents. permalink award report block reply sordfysh PRO 2 points 5 days ago Also don't tell us that these problems were caused by politicians who have yet to be in office. permalink award report block reply Bandanna1 2 points 5 days ago Why do we have to calm down? Lets be like the ghetto blacks and turn up. If we just lashed out as much as latifah at Walmart we'd have this shit settled in a weekend. permalink award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nSuper_Dave 35 points 5 days ago That still-frame of Iryna breaks my heart, every time.. permalink award report block reply DickTick PRO 19 points 5 days ago It really does. An absolutely beautiful woman that was very clearly dressing down as much as she could to make herself look as unappealing and average as possible so that freaks like this would leave her alone and even that wasn't enough.... She was the definition of minding your own business. Poor thing permalink parent award report block reply PlayboyPringles 10 points 5 days ago I think she just finished a shift at her work, which I believe is a pizza joint.  So I don't know if that's the case, but this image is truly heartbreaking nonetheless. permalink parent award report block reply starjello 3 points 5 days ago Me too. If only she would have stayed in her homeland supporting the young men that have had to give her their lives sacrificed. She may still be alive today and doing something productive for the young men on the front lines permalink parent award report block reply worldowedexplanation 2 points 5 days ago I’ve had 2 families of Ukrainian “refuge” neighbors in rural NC. They are being brought over by liberal landlords who are getting some kind of government kickback. So now they’re being murdered by liberals. Not my problem. Maybe they’ll learn. permalink parent award report block reply StCharlie 0 points 5 days ago So fucking haunting.  I couldn't stop replaying it.  I played it till my stomach was sick and my anger overflowing.  Watching that poor, innocent soul, get stabbed so many times, go into fetal position then roll over dead.  All with nobody batting a fucking eye.  Disgusting.  All killers of the innocent should receive the same death but worse. permalink parent award report block reply TearsAficionado 2 points 5 days ago That should have resulted in a massive uprising and a culling of that entire leftist criminal herd. Yet here we are 😕 permalink parent award report block reply StCharlie 2 points 5 days ago There is reason for that.  The best analogy is the matrix. When white people are in the matrix, every person could be a Smith agent.  If you draw attention to yourself talking about \"Europe and America are white countries that have been invaded\", then a femenazi, BLM, LGBTQ, antifa will appear.  Sometimes even those that have taken the red pill will betray you and want to make concessions to be rich and enjoy life in the simulation again. Trump is our Neo.  The deep state can't control him.  His money isn't beholden to the government.  We are all just the lost and wandering just trying to stay alive outside the matrix.  The average person only has the ability to red pill others and protect themselves.  The red pilled only enter the matrix to speak to those in the matrix and tell them the truth.  The Smith agents will kill anyone that remains in the matrix for too long converting others to MAGA.  That's why they killed Charlie Kirk.  He was red pilling faster than anyone.  Recognize that if you don't know how to fight in the matrix then you must try to convert cautiously and out of the prying eyes of others.  That is why Trinity met with Neo in the night club so no one could hear their conversation.  You need to know if the person you are talking to is \"ready\".  Some are critical thinkers and questioning people, they are easier to red pill.  They were already ready.  There are others that must be led down the rabbit hole by making them question their reality in the matrix. permalink parent award report block reply TearsAficionado 1 points 4 days ago That's actually a perfect explanation. I suppose now, we gotta do Kung fu. permalink parent award report block reply worldowedexplanation -1 points 5 days ago Trump is entirely controlled by the Deep State permalink parent award report block reply view 1 more comments... SirPokeSmottington 0 points 5 days ago That still-frame of Iryna breaks my heart, every time.. That's why not a single day goes past where the ones wanting to start a civil war, don't come on here and post it. EVERY... SINGLE... FUCKING... DAY... IT IS POSTED This site is not your friend. This site is trying to incite everyone here into crime. permalink parent award report block reply StCharlie 3 points 5 days ago As it should be.  You need to treat it as the current state of our society and how you should be \"armed\", \"aware\", and pick a place to sit where your eyes can be on everyone.  Everyone is a threat when you are a white person. permalink parent award report block reply drmrboy -1 points 5 days ago ☝️☝️☝️☝️☝️☝️ permalink parent award report block reply\nDickTick PRO 19 points 5 days ago It really does. An absolutely beautiful woman that was very clearly dressing down as much as she could to make herself look as unappealing and average as possible so that freaks like this would leave her alone and even that wasn't enough.... She was the definition of minding your own business. Poor thing permalink parent award report block reply PlayboyPringles 10 points 5 days ago I think she just finished a shift at her work, which I believe is a pizza joint.  So I don't know if that's the case, but this image is truly heartbreaking nonetheless. permalink parent award report block reply\nPlayboyPringles 10 points 5 days ago I think she just finished a shift at her work, which I believe is a pizza joint.  So I don't know if that's the case, but this image is truly heartbreaking nonetheless. permalink parent award report block reply\nstarjello 3 points 5 days ago Me too. If only she would have stayed in her homeland supporting the young men that have had to give her their lives sacrificed. She may still be alive today and doing something productive for the young men on the front lines permalink parent award report block reply worldowedexplanation 2 points 5 days ago I’ve had 2 families of Ukrainian “refuge” neighbors in rural NC. They are being brought over by liberal landlords who are getting some kind of government kickback. So now they’re being murdered by liberals. Not my problem. Maybe they’ll learn. permalink parent award report block reply\nworldowedexplanation 2 points 5 days ago I’ve had 2 families of Ukrainian “refuge” neighbors in rural NC. They are being brought over by liberal landlords who are getting some kind of government kickback. So now they’re being murdered by liberals. Not my problem. Maybe they’ll learn. permalink parent award report block reply\nStCharlie 0 points 5 days ago So fucking haunting.  I couldn't stop replaying it.  I played it till my stomach was sick and my anger overflowing.  Watching that poor, innocent soul, get stabbed so many times, go into fetal position then roll over dead.  All with nobody batting a fucking eye.  Disgusting.  All killers of the innocent should receive the same death but worse. permalink parent award report block reply TearsAficionado 2 points 5 days ago That should have resulted in a massive uprising and a culling of that entire leftist criminal herd. Yet here we are 😕 permalink parent award report block reply StCharlie 2 points 5 days ago There is reason for that.  The best analogy is the matrix. When white people are in the matrix, every person could be a Smith agent.  If you draw attention to yourself talking about \"Europe and America are white countries that have been invaded\", then a femenazi, BLM, LGBTQ, antifa will appear.  Sometimes even those that have taken the red pill will betray you and want to make concessions to be rich and enjoy life in the simulation again. Trump is our Neo.  The deep state can't control him.  His money isn't beholden to the government.  We are all just the lost and wandering just trying to stay alive outside the matrix.  The average person only has the ability to red pill others and protect themselves.  The red pilled only enter the matrix to speak to those in the matrix and tell them the truth.  The Smith agents will kill anyone that remains in the matrix for too long converting others to MAGA.  That's why they killed Charlie Kirk.  He was red pilling faster than anyone.  Recognize that if you don't know how to fight in the matrix then you must try to convert cautiously and out of the prying eyes of others.  That is why Trinity met with Neo in the night club so no one could hear their conversation.  You need to know if the person you are talking to is \"ready\".  Some are critical thinkers and questioning people, they are easier to red pill.  They were already ready.  There are others that must be led down the rabbit hole by making them question their reality in the matrix. permalink parent award report block reply TearsAficionado 1 points 4 days ago That's actually a perfect explanation. I suppose now, we gotta do Kung fu. permalink parent award report block reply worldowedexplanation -1 points 5 days ago Trump is entirely controlled by the Deep State permalink parent award report block reply view 1 more comments...\nTearsAficionado 2 points 5 days ago That should have resulted in a massive uprising and a culling of that entire leftist criminal herd. Yet here we are 😕 permalink parent award report block reply StCharlie 2 points 5 days ago There is reason for that.  The best analogy is the matrix. When white people are in the matrix, every person could be a Smith agent.  If you draw attention to yourself talking about \"Europe and America are white countries that have been invaded\", then a femenazi, BLM, LGBTQ, antifa will appear.  Sometimes even those that have taken the red pill will betray you and want to make concessions to be rich and enjoy life in the simulation again. Trump is our Neo.  The deep state can't control him.  His money isn't beholden to the government.  We are all just the lost and wandering just trying to stay alive outside the matrix.  The average person only has the ability to red pill others and protect themselves.  The red pilled only enter the matrix to speak to those in the matrix and tell them the truth.  The Smith agents will kill anyone that remains in the matrix for too long converting others to MAGA.  That's why they killed Charlie Kirk.  He was red pilling faster than anyone.  Recognize that if you don't know how to fight in the matrix then you must try to convert cautiously and out of the prying eyes of others.  That is why Trinity met with Neo in the night club so no one could hear their conversation.  You need to know if the person you are talking to is \"ready\".  Some are critical thinkers and questioning people, they are easier to red pill.  They were already ready.  There are others that must be led down the rabbit hole by making them question their reality in the matrix. permalink parent award report block reply TearsAficionado 1 points 4 days ago That's actually a perfect explanation. I suppose now, we gotta do Kung fu. permalink parent award report block reply worldowedexplanation -1 points 5 days ago Trump is entirely controlled by the Deep State permalink parent award report block reply view 1 more comments...\nStCharlie 2 points 5 days ago There is reason for that.  The best analogy is the matrix. When white people are in the matrix, every person could be a Smith agent.  If you draw attention to yourself talking about \"Europe and America are white countries that have been invaded\", then a femenazi, BLM, LGBTQ, antifa will appear.  Sometimes even those that have taken the red pill will betray you and want to make concessions to be rich and enjoy life in the simulation again. Trump is our Neo.  The deep state can't control him.  His money isn't beholden to the government.  We are all just the lost and wandering just trying to stay alive outside the matrix.  The average person only has the ability to red pill others and protect themselves.  The red pilled only enter the matrix to speak to those in the matrix and tell them the truth.  The Smith agents will kill anyone that remains in the matrix for too long converting others to MAGA.  That's why they killed Charlie Kirk.  He was red pilling faster than anyone.  Recognize that if you don't know how to fight in the matrix then you must try to convert cautiously and out of the prying eyes of others.  That is why Trinity met with Neo in the night club so no one could hear their conversation.  You need to know if the person you are talking to is \"ready\".  Some are critical thinkers and questioning people, they are easier to red pill.  They were already ready.  There are others that must be led down the rabbit hole by making them question their reality in the matrix. permalink parent award report block reply TearsAficionado 1 points 4 days ago That's actually a perfect explanation. I suppose now, we gotta do Kung fu. permalink parent award report block reply worldowedexplanation -1 points 5 days ago Trump is entirely controlled by the Deep State permalink parent award report block reply view 1 more comments...\nTearsAficionado 1 points 4 days ago That's actually a perfect explanation. I suppose now, we gotta do Kung fu. permalink parent award report block reply\nworldowedexplanation -1 points 5 days ago Trump is entirely controlled by the Deep State permalink parent award report block reply view 1 more comments...\nSirPokeSmottington 0 points 5 days ago That still-frame of Iryna breaks my heart, every time.. That's why not a single day goes past where the ones wanting to start a civil war, don't come on here and post it. EVERY... SINGLE... FUCKING... DAY... IT IS POSTED This site is not your friend. This site is trying to incite everyone here into crime. permalink parent award report block reply StCharlie 3 points 5 days ago As it should be.  You need to treat it as the current state of our society and how you should be \"armed\", \"aware\", and pick a place to sit where your eyes can be on everyone.  Everyone is a threat when you are a white person. permalink parent award report block reply drmrboy -1 points 5 days ago ☝️☝️☝️☝️☝️☝️ permalink parent award report block reply\nStCharlie 3 points 5 days ago As it should be.  You need to treat it as the current state of our society and how you should be \"armed\", \"aware\", and pick a place to sit where your eyes can be on everyone.  Everyone is a threat when you are a white person. permalink parent award report block reply\ndrmrboy -1 points 5 days ago ☝️☝️☝️☝️☝️☝️ permalink parent award report block reply\nfskfsk 9 points 5 days ago If \"violence is an artificial construct\", why bother arresting Daniel Penny?  He only responded to one artificial construct with another artificial construct. permalink award report block reply\nStolen 7 points 5 days ago There are so many other examples permalink award report block reply chickeninoven 2 points 5 days ago How bout the young kids, Julian Wood and Cannon Hinnant. Juluan's fat boon orc murderer was sentenced to life in prison last month. So I get to support that dumpy demonic fuck for the next 40 years. permalink parent award report block reply\nchickeninoven 2 points 5 days ago How bout the young kids, Julian Wood and Cannon Hinnant. Juluan's fat boon orc murderer was sentenced to life in prison last month. So I get to support that dumpy demonic fuck for the next 40 years. permalink parent award report block reply\ngustodog 3 points 5 days ago The same corrupt FBI that we're supposed to believe cracked the Kirk case still hasn't cracked the Butler case. We're supposed to believe the \"lone gunman\" narrative in both cases despite the strange circumstances around both incidents. permalink award report block reply\nsordfysh PRO 2 points 5 days ago Also don't tell us that these problems were caused by politicians who have yet to be in office. permalink award report block reply\nBandanna1 2 points 5 days ago Why do we have to calm down? Lets be like the ghetto blacks and turn up. If we just lashed out as much as latifah at Walmart we'd have this shit settled in a weekend. permalink award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:14:25.855145Z"
}