{
  "id": "1ARK5BH8rs",
  "url": "https://patriots.win/p/1ARK5BH8rs/nyc-gentlemens-clubs-are-about-t/c",
  "content": "1151 NYC gentlemen’s clubs are about to get wild 🪩𓃚 🤡🌎  HONK  HONK  🌎🤡 posted 3 days ago by Hanging_Chad 69 comments award share report block Dr. Clown, PhD @DrClownPhD • 3d New York gentlemen’s clubs are about to get wild.\n69 comments Sort by Top Top New Worst Old Save The Real Story Behind His Exit No One Saw Coming Read More Ads by Ad.Style GuerillaYourDreams 74 points 3 days ago Ooh, if this was my forum, I'd sticky the living hell out of this clip! LOL!! permalink award report block reply BloodElfSupporter 14 points 3 days ago Habibiiiiii <33333 permalink parent award report block reply GuerillaYourDreams 8 points 3 days ago Hasheepie! permalink parent award report block reply Hangemh1gh 11 points 3 days ago I ❤ Ewe permalink parent award report block reply Seeing_Red 5 points 3 days ago This made my heart skip a bleet. permalink parent award report block reply ColonelKlink 6 points 3 days ago Goooooaaaaaaatttt!!! permalink parent award report block reply ProtestantPatriot777 24 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply TooBright 34 points 3 days ago Yalllah Ha-Bee-Bee! permalink award report block reply McFatty7 14 points 3 days ago 💀 permalink parent award report block reply Roadpower 9 points 3 days ago kek permalink parent award report block reply Zskills 26 points 3 days ago Wtf I love AI now permalink award report block reply TrumpIsMyyPresident 25 points 3 days ago This is fucking diabolical, and I'm here for it! 😂😂😂😂 permalink award report block reply JoeBidenWakeUp 18 points 3 days ago Damn they’re at it already? permalink award report block reply IncredibleMrE1 17 points 3 days ago All the baaaaad boys are gonna be there. permalink award report block reply MAGALADON9 16 points 3 days ago Those poor goats are trapped and exploited permalink award report block reply BerettaStroker 11 points 3 days ago Uh, they raped, bro. Like a lot. permalink parent award report block reply TwoArizonaPedes 8 points 3 days ago Bestiality is allowed in Islam. permalink parent award report block reply MAGALADON9 0 points 2 days ago Islam allows or advocates so much that saying that can actually be confusing  - i know you're probably joking but when stuff like \"Muhammad advocated drinking camel urine for health, and dunking Flys that land on your water then drinking it\" is actually true, people may wonder if beastiality is also true. It is technically not. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago It is technically not. Bestiality is allowed in Islam. https://patriots.win/p/1AR0izr6jC/islam-is-a-sex-cult/c/4eWd26ANWtw permalink parent award report block reply view 1 more comments... Chukna -3 points 2 days ago I guess that's why you love Islam so much, fucking animal & little boy fucking pedophile faggot. permalink parent award report block reply BadManOrange 1 points 2 days ago This clip just looks like these guys having a good time yelling at goats running around. It's way more tame compared to what would probably happen in real life. permalink parent award report block reply mlstrass 9 points 3 days ago How ewe doin.... permalink award report block reply TwoArizonaPedes 3 points 3 days ago omg permalink parent award report block reply JohnN 8 points 3 days ago Epic. permalink award report block reply RogueLeaderX 8 points 3 days ago Good thing Mamdani is making prostitution legal. Those goats about to make big money, permalink award report block reply TwoArizonaPedes 7 points 3 days ago Prostitution is allowed in Islam. It's called mutah, or \"temporary marriage.\" It's used to pass around little girls in their communities. permalink parent award report block reply Hanging_Chad OP 3 points 2 days ago big girls need not apply? permalink parent award report block reply Chukna -3 points 2 days ago I guess that's why you love Islam, fucking retarded degenerate faggot. permalink parent award report block reply Hanging_Chad OP 3 points 3 days ago will he tax the goats or their customers? permalink parent award report block reply MasterChief 3 points 3 days ago they're both getting fucked permalink parent award report block reply Coin-Op 1 points 2 days ago Both figuratively and LITERALLY!!! permalink parent award report block reply TheWoodsman 7 points 3 days ago He’s just kidding around permalink award report block reply Seeing_Red 3 points 3 days ago A pun like that will be hard to bleet permalink parent award report block reply GuerillaYourDreams 7 points 3 days ago Thanks to whoever stickied this! 😂😂😂 permalink award report block reply mygovisacommie 7 points 3 days ago Once upon a time this would have been a skit on SNL. And people would have all laughed. Then again, the idea on NY voting in a Muslim mayor would have also gotten laughs at that point in history as well. God i hate the stupid gay future. permalink award report block reply 4886Battery 6 points 3 days ago And those are the respectable ones, the scum ones will be parked out front of middle schools in their Ubers offering free rides, kebabs, alcohol, drugs, addiction, gang raped, etc. permalink award report block reply MyNameIsTaxpayer 5 points 3 days ago ASPCA is about to get a cash windfall to ignore the dancing goats and dog hatred. permalink award report block reply Megaboom2025 4 points 3 days ago That’s only for poor Muslims. The rich ones eat Dubai chocolate permalink award report block reply Coin-Op 1 points 2 days ago Oh, so that's what they call child rape in Dubai. 🤫 permalink parent award report block reply Megaboom2025 1 points 2 days ago I thought it was influencer scat permalink parent award report block reply Live_free_or_die_55 4 points 3 days ago Goat fuckers club permalink award report block reply BillGateCanSuckIt 3 points 3 days ago Damn, someone got sent to the burn ward permalink award report block reply MedicallyReddit 3 points 3 days ago Snackbar permalink award report block reply Easzq8 3 points 3 days ago This is fucked up. Updoot. permalink award report block reply ElevenMile 3 points 2 days ago The screaming goat at the end makes LOL every time permalink award report block reply Washington_Redskins 3 points 3 days ago Im not sure I.want.to click on the.video.. Does it involve.dancing goats, permalink award report block reply NoMaskNoMaster 3 points 3 days ago So they really do fuck goats then Yikes permalink award report block reply JoeGottem 3 points 3 days ago New job opportunity for farm hand sweeping pellets every hour! permalink award report block reply fazaman 3 points 2 days ago No one can convince me that this isn't real. permalink award report block reply BadBrainsBuzzcocks 3 points 3 days ago Thank you. This is why I am here. permalink award report block reply Shih_Tabed 3 points 3 days ago Someone needs to get a garter on a goat and put it next to a stripper pole for a good meme. permalink award report block reply TravisRSCX 3 points 3 days ago Lmao permalink award report block reply Pappy_Gunn 3 points 3 days ago Happenin' place.. permalink award report block reply 1776Widowmaker 2 points 2 days ago This is a GOAT  post! permalink award report block reply RodAlanDickelman 2 points 3 days ago Wanna pioneer a genre? Arabian goat fucking music! https://suno.com/s/CoJ6Dhk7xZVSvr0V permalink award report block reply quiznossucks 2 points 3 days ago 🤣🤣🤣🤣🤣🤣👍👍👍👍👍👍🤣🤣🤣🤣🤣🤣 permalink award report block reply Aambrick 2 points 3 days ago Ai, but a little funny as well. permalink award report block reply patrioticwinning3 2 points 3 days ago \"Muhammed, you're a ba-a-a-a-a-d boy!\" :p permalink award report block reply SaltyTitties4 2 points 2 days ago I can’t believe things are so retarded now that I have to say this:  This is a shitpost, right? permalink award report block reply Tordah 2 points 3 days ago Ala goatfucka permalink award report block reply barwhack 2 points 2 days ago \"wild\" -> hircine... permalink award report block reply Coin-Op 2 points 2 days ago They like big goats and they cannot lie... permalink award report block reply AgnesDomini 2 points 3 days ago A.I. getting wild! permalink award report block reply GuerillaYourDreams 1 points 3 days ago Needs sticky longer says Pepe. permalink award report block reply Hanging_Chad OP 3 points 3 days ago Pepe’s wish has been granted permalink parent award report block reply bananafone 1 points 3 days ago Cringe permalink award report block reply DILLIGAF_Bro 0 points 3 days ago Comment removed by community moderators. permalink award report block reply\nGuerillaYourDreams 74 points 3 days ago Ooh, if this was my forum, I'd sticky the living hell out of this clip! LOL!! permalink award report block reply BloodElfSupporter 14 points 3 days ago Habibiiiiii <33333 permalink parent award report block reply GuerillaYourDreams 8 points 3 days ago Hasheepie! permalink parent award report block reply Hangemh1gh 11 points 3 days ago I ❤ Ewe permalink parent award report block reply Seeing_Red 5 points 3 days ago This made my heart skip a bleet. permalink parent award report block reply ColonelKlink 6 points 3 days ago Goooooaaaaaaatttt!!! permalink parent award report block reply ProtestantPatriot777 24 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBloodElfSupporter 14 points 3 days ago Habibiiiiii <33333 permalink parent award report block reply GuerillaYourDreams 8 points 3 days ago Hasheepie! permalink parent award report block reply Hangemh1gh 11 points 3 days ago I ❤ Ewe permalink parent award report block reply Seeing_Red 5 points 3 days ago This made my heart skip a bleet. permalink parent award report block reply\nGuerillaYourDreams 8 points 3 days ago Hasheepie! permalink parent award report block reply Hangemh1gh 11 points 3 days ago I ❤ Ewe permalink parent award report block reply Seeing_Red 5 points 3 days ago This made my heart skip a bleet. permalink parent award report block reply\nHangemh1gh 11 points 3 days ago I ❤ Ewe permalink parent award report block reply Seeing_Red 5 points 3 days ago This made my heart skip a bleet. permalink parent award report block reply\nSeeing_Red 5 points 3 days ago This made my heart skip a bleet. permalink parent award report block reply\nColonelKlink 6 points 3 days ago Goooooaaaaaaatttt!!! permalink parent award report block reply\nProtestantPatriot777 24 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTooBright 34 points 3 days ago Yalllah Ha-Bee-Bee! permalink award report block reply McFatty7 14 points 3 days ago 💀 permalink parent award report block reply Roadpower 9 points 3 days ago kek permalink parent award report block reply\nMcFatty7 14 points 3 days ago 💀 permalink parent award report block reply\nRoadpower 9 points 3 days ago kek permalink parent award report block reply\nZskills 26 points 3 days ago Wtf I love AI now permalink award report block reply\nTrumpIsMyyPresident 25 points 3 days ago This is fucking diabolical, and I'm here for it! 😂😂😂😂 permalink award report block reply\nJoeBidenWakeUp 18 points 3 days ago Damn they’re at it already? permalink award report block reply\nIncredibleMrE1 17 points 3 days ago All the baaaaad boys are gonna be there. permalink award report block reply\nMAGALADON9 16 points 3 days ago Those poor goats are trapped and exploited permalink award report block reply BerettaStroker 11 points 3 days ago Uh, they raped, bro. Like a lot. permalink parent award report block reply TwoArizonaPedes 8 points 3 days ago Bestiality is allowed in Islam. permalink parent award report block reply MAGALADON9 0 points 2 days ago Islam allows or advocates so much that saying that can actually be confusing  - i know you're probably joking but when stuff like \"Muhammad advocated drinking camel urine for health, and dunking Flys that land on your water then drinking it\" is actually true, people may wonder if beastiality is also true. It is technically not. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago It is technically not. Bestiality is allowed in Islam. https://patriots.win/p/1AR0izr6jC/islam-is-a-sex-cult/c/4eWd26ANWtw permalink parent award report block reply view 1 more comments... Chukna -3 points 2 days ago I guess that's why you love Islam so much, fucking animal & little boy fucking pedophile faggot. permalink parent award report block reply BadManOrange 1 points 2 days ago This clip just looks like these guys having a good time yelling at goats running around. It's way more tame compared to what would probably happen in real life. permalink parent award report block reply\nBerettaStroker 11 points 3 days ago Uh, they raped, bro. Like a lot. permalink parent award report block reply TwoArizonaPedes 8 points 3 days ago Bestiality is allowed in Islam. permalink parent award report block reply MAGALADON9 0 points 2 days ago Islam allows or advocates so much that saying that can actually be confusing  - i know you're probably joking but when stuff like \"Muhammad advocated drinking camel urine for health, and dunking Flys that land on your water then drinking it\" is actually true, people may wonder if beastiality is also true. It is technically not. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago It is technically not. Bestiality is allowed in Islam. https://patriots.win/p/1AR0izr6jC/islam-is-a-sex-cult/c/4eWd26ANWtw permalink parent award report block reply view 1 more comments... Chukna -3 points 2 days ago I guess that's why you love Islam so much, fucking animal & little boy fucking pedophile faggot. permalink parent award report block reply BadManOrange 1 points 2 days ago This clip just looks like these guys having a good time yelling at goats running around. It's way more tame compared to what would probably happen in real life. permalink parent award report block reply\nTwoArizonaPedes 8 points 3 days ago Bestiality is allowed in Islam. permalink parent award report block reply MAGALADON9 0 points 2 days ago Islam allows or advocates so much that saying that can actually be confusing  - i know you're probably joking but when stuff like \"Muhammad advocated drinking camel urine for health, and dunking Flys that land on your water then drinking it\" is actually true, people may wonder if beastiality is also true. It is technically not. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago It is technically not. Bestiality is allowed in Islam. https://patriots.win/p/1AR0izr6jC/islam-is-a-sex-cult/c/4eWd26ANWtw permalink parent award report block reply view 1 more comments... Chukna -3 points 2 days ago I guess that's why you love Islam so much, fucking animal & little boy fucking pedophile faggot. permalink parent award report block reply\nMAGALADON9 0 points 2 days ago Islam allows or advocates so much that saying that can actually be confusing  - i know you're probably joking but when stuff like \"Muhammad advocated drinking camel urine for health, and dunking Flys that land on your water then drinking it\" is actually true, people may wonder if beastiality is also true. It is technically not. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago It is technically not. Bestiality is allowed in Islam. https://patriots.win/p/1AR0izr6jC/islam-is-a-sex-cult/c/4eWd26ANWtw permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 4 points 2 days ago It is technically not. Bestiality is allowed in Islam. https://patriots.win/p/1AR0izr6jC/islam-is-a-sex-cult/c/4eWd26ANWtw permalink parent award report block reply view 1 more comments...\nChukna -3 points 2 days ago I guess that's why you love Islam so much, fucking animal & little boy fucking pedophile faggot. permalink parent award report block reply\nBadManOrange 1 points 2 days ago This clip just looks like these guys having a good time yelling at goats running around. It's way more tame compared to what would probably happen in real life. permalink parent award report block reply\nmlstrass 9 points 3 days ago How ewe doin.... permalink award report block reply TwoArizonaPedes 3 points 3 days ago omg permalink parent award report block reply\nTwoArizonaPedes 3 points 3 days ago omg permalink parent award report block reply\nJohnN 8 points 3 days ago Epic. permalink award report block reply\nRogueLeaderX 8 points 3 days ago Good thing Mamdani is making prostitution legal. Those goats about to make big money, permalink award report block reply TwoArizonaPedes 7 points 3 days ago Prostitution is allowed in Islam. It's called mutah, or \"temporary marriage.\" It's used to pass around little girls in their communities. permalink parent award report block reply Hanging_Chad OP 3 points 2 days ago big girls need not apply? permalink parent award report block reply Chukna -3 points 2 days ago I guess that's why you love Islam, fucking retarded degenerate faggot. permalink parent award report block reply Hanging_Chad OP 3 points 3 days ago will he tax the goats or their customers? permalink parent award report block reply MasterChief 3 points 3 days ago they're both getting fucked permalink parent award report block reply Coin-Op 1 points 2 days ago Both figuratively and LITERALLY!!! permalink parent award report block reply\nTwoArizonaPedes 7 points 3 days ago Prostitution is allowed in Islam. It's called mutah, or \"temporary marriage.\" It's used to pass around little girls in their communities. permalink parent award report block reply Hanging_Chad OP 3 points 2 days ago big girls need not apply? permalink parent award report block reply Chukna -3 points 2 days ago I guess that's why you love Islam, fucking retarded degenerate faggot. permalink parent award report block reply\nHanging_Chad OP 3 points 2 days ago big girls need not apply? permalink parent award report block reply\nChukna -3 points 2 days ago I guess that's why you love Islam, fucking retarded degenerate faggot. permalink parent award report block reply\nHanging_Chad OP 3 points 3 days ago will he tax the goats or their customers? permalink parent award report block reply MasterChief 3 points 3 days ago they're both getting fucked permalink parent award report block reply Coin-Op 1 points 2 days ago Both figuratively and LITERALLY!!! permalink parent award report block reply\nMasterChief 3 points 3 days ago they're both getting fucked permalink parent award report block reply Coin-Op 1 points 2 days ago Both figuratively and LITERALLY!!! permalink parent award report block reply\nCoin-Op 1 points 2 days ago Both figuratively and LITERALLY!!! permalink parent award report block reply\nTheWoodsman 7 points 3 days ago He’s just kidding around permalink award report block reply Seeing_Red 3 points 3 days ago A pun like that will be hard to bleet permalink parent award report block reply\nSeeing_Red 3 points 3 days ago A pun like that will be hard to bleet permalink parent award report block reply\nGuerillaYourDreams 7 points 3 days ago Thanks to whoever stickied this! 😂😂😂 permalink award report block reply\nmygovisacommie 7 points 3 days ago Once upon a time this would have been a skit on SNL. And people would have all laughed. Then again, the idea on NY voting in a Muslim mayor would have also gotten laughs at that point in history as well. God i hate the stupid gay future. permalink award report block reply\n4886Battery 6 points 3 days ago And those are the respectable ones, the scum ones will be parked out front of middle schools in their Ubers offering free rides, kebabs, alcohol, drugs, addiction, gang raped, etc. permalink award report block reply\nMyNameIsTaxpayer 5 points 3 days ago ASPCA is about to get a cash windfall to ignore the dancing goats and dog hatred. permalink award report block reply\nMegaboom2025 4 points 3 days ago That’s only for poor Muslims. The rich ones eat Dubai chocolate permalink award report block reply Coin-Op 1 points 2 days ago Oh, so that's what they call child rape in Dubai. 🤫 permalink parent award report block reply Megaboom2025 1 points 2 days ago I thought it was influencer scat permalink parent award report block reply\nCoin-Op 1 points 2 days ago Oh, so that's what they call child rape in Dubai. 🤫 permalink parent award report block reply Megaboom2025 1 points 2 days ago I thought it was influencer scat permalink parent award report block reply\nMegaboom2025 1 points 2 days ago I thought it was influencer scat permalink parent award report block reply\nLive_free_or_die_55 4 points 3 days ago Goat fuckers club permalink award report block reply\nBillGateCanSuckIt 3 points 3 days ago Damn, someone got sent to the burn ward permalink award report block reply\nMedicallyReddit 3 points 3 days ago Snackbar permalink award report block reply\nEaszq8 3 points 3 days ago This is fucked up. Updoot. permalink award report block reply\nElevenMile 3 points 2 days ago The screaming goat at the end makes LOL every time permalink award report block reply\nWashington_Redskins 3 points 3 days ago Im not sure I.want.to click on the.video.. Does it involve.dancing goats, permalink award report block reply\nNoMaskNoMaster 3 points 3 days ago So they really do fuck goats then Yikes permalink award report block reply\nJoeGottem 3 points 3 days ago New job opportunity for farm hand sweeping pellets every hour! permalink award report block reply\nfazaman 3 points 2 days ago No one can convince me that this isn't real. permalink award report block reply\nBadBrainsBuzzcocks 3 points 3 days ago Thank you. This is why I am here. permalink award report block reply\nShih_Tabed 3 points 3 days ago Someone needs to get a garter on a goat and put it next to a stripper pole for a good meme. permalink award report block reply\nTravisRSCX 3 points 3 days ago Lmao permalink award report block reply\nPappy_Gunn 3 points 3 days ago Happenin' place.. permalink award report block reply\n1776Widowmaker 2 points 2 days ago This is a GOAT  post! permalink award report block reply\nRodAlanDickelman 2 points 3 days ago Wanna pioneer a genre? Arabian goat fucking music! https://suno.com/s/CoJ6Dhk7xZVSvr0V permalink award report block reply\nquiznossucks 2 points 3 days ago 🤣🤣🤣🤣🤣🤣👍👍👍👍👍👍🤣🤣🤣🤣🤣🤣 permalink award report block reply\nAambrick 2 points 3 days ago Ai, but a little funny as well. permalink award report block reply\npatrioticwinning3 2 points 3 days ago \"Muhammed, you're a ba-a-a-a-a-d boy!\" :p permalink award report block reply\nSaltyTitties4 2 points 2 days ago I can’t believe things are so retarded now that I have to say this:  This is a shitpost, right? permalink award report block reply\nTordah 2 points 3 days ago Ala goatfucka permalink award report block reply\nbarwhack 2 points 2 days ago \"wild\" -> hircine... permalink award report block reply\nCoin-Op 2 points 2 days ago They like big goats and they cannot lie... permalink award report block reply\nAgnesDomini 2 points 3 days ago A.I. getting wild! permalink award report block reply\nGuerillaYourDreams 1 points 3 days ago Needs sticky longer says Pepe. permalink award report block reply Hanging_Chad OP 3 points 3 days ago Pepe’s wish has been granted permalink parent award report block reply\nHanging_Chad OP 3 points 3 days ago Pepe’s wish has been granted permalink parent award report block reply\nbananafone 1 points 3 days ago Cringe permalink award report block reply\nDILLIGAF_Bro 0 points 3 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:52:39.164086Z"
}