{
  "id": "1ARK5BH8ng",
  "url": "https://patriots.win/p/1ARK5BH8ng/crooked-media-/c",
  "content": "816 Crooked Media posted 3 days ago by PiratePatriotParrot 24 comments award share download report block\n24 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style BeauHD 19 points 3 days ago She is so hot. I wonder if she is single. Anyone? permalink award report block reply imnotdeadyet 13 points 3 days ago Yes, she broke up with her boy friend of 7 years because she heard Pepe was interested in her! permalink parent award report block reply ProtestantPatriot777 -11 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply DT170x 15 points 3 days ago Honestly I don't have any comments for what you said but WTF EWWWW. permalink parent award report block reply vote_for_MAGA_2020 7 points 3 days ago Butt sex is gay permalink parent award report block reply BeauHD 6 points 3 days ago Is that what turns you on, sicko? permalink parent award report block reply SavingPrivateGrace 11 points 3 days ago Christmas genes are the best genes. permalink award report block reply Bohemyth_2 10 points 3 days ago the women of the right: unapologetically hot women of the left: undefinably not permalink award report block reply deleted 3 points 3 days ago Sicsempertyrannis76 10 points 3 days ago New response.. \"May Christ fill your Christmas season with love and peace.\" permalink award report block reply neomt 8 points 3 days ago This meme template will feed families for generations permalink award report block reply vote_for_MAGA_2020 6 points 3 days ago Hello Mrs Atheist! Merry FUCKING Christmas!!! permalink award report block reply anotherthing 1 points 2 days ago Care to take a stab at the ethnicity of the interviewer? permalink parent award report block reply WassermanSchultz 6 points 3 days ago Man, I really don't like her face.  The interviewer chick - not Sydney. permalink award report block reply DoesItWorkAlready 6 points 3 days ago Best Meme I've seen yet: \"are you sorry for implying white supremacy\"? \"My next job is with Hugo Boss\" permalink award report block reply NADSAQ 4 points 3 days ago it’s funny but Hugo Boss would be rolling in his grave if he saw the modern ads they run permalink parent award report block reply Rucktoe 5 points 3 days ago Loving the memes from this, haven't had this good of a time since pocahontas released her \"genetic test\" permalink award report block reply ReturnOfSmarm 2 points 3 days ago Where/when was this interview ..... now I gotta see this. permalink award report block reply ThisTrainHasNoBrakes 2 points 3 days ago Hoe, hoe, hoe! permalink award report block reply Spicy_cat 1 points 3 days ago \"Can't you just name at least one thing you think Hitler did wrong?\" permalink award report block reply mikejones 0 points 3 days ago You can have plastic surgery that makes you look incredible for $20,000 permalink award report block reply Hanging_Chad -1 points 3 days ago sticky with 1 updoot 👏🏻 permalink award report block reply\nBeauHD 19 points 3 days ago She is so hot. I wonder if she is single. Anyone? permalink award report block reply imnotdeadyet 13 points 3 days ago Yes, she broke up with her boy friend of 7 years because she heard Pepe was interested in her! permalink parent award report block reply ProtestantPatriot777 -11 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply DT170x 15 points 3 days ago Honestly I don't have any comments for what you said but WTF EWWWW. permalink parent award report block reply vote_for_MAGA_2020 7 points 3 days ago Butt sex is gay permalink parent award report block reply BeauHD 6 points 3 days ago Is that what turns you on, sicko? permalink parent award report block reply\nimnotdeadyet 13 points 3 days ago Yes, she broke up with her boy friend of 7 years because she heard Pepe was interested in her! permalink parent award report block reply\nProtestantPatriot777 -11 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply DT170x 15 points 3 days ago Honestly I don't have any comments for what you said but WTF EWWWW. permalink parent award report block reply vote_for_MAGA_2020 7 points 3 days ago Butt sex is gay permalink parent award report block reply BeauHD 6 points 3 days ago Is that what turns you on, sicko? permalink parent award report block reply\nDT170x 15 points 3 days ago Honestly I don't have any comments for what you said but WTF EWWWW. permalink parent award report block reply vote_for_MAGA_2020 7 points 3 days ago Butt sex is gay permalink parent award report block reply\nvote_for_MAGA_2020 7 points 3 days ago Butt sex is gay permalink parent award report block reply\nBeauHD 6 points 3 days ago Is that what turns you on, sicko? permalink parent award report block reply\nSavingPrivateGrace 11 points 3 days ago Christmas genes are the best genes. permalink award report block reply\nBohemyth_2 10 points 3 days ago the women of the right: unapologetically hot women of the left: undefinably not permalink award report block reply deleted 3 points 3 days ago\ndeleted 3 points 3 days ago\nSicsempertyrannis76 10 points 3 days ago New response.. \"May Christ fill your Christmas season with love and peace.\" permalink award report block reply\nneomt 8 points 3 days ago This meme template will feed families for generations permalink award report block reply\nvote_for_MAGA_2020 6 points 3 days ago Hello Mrs Atheist! Merry FUCKING Christmas!!! permalink award report block reply anotherthing 1 points 2 days ago Care to take a stab at the ethnicity of the interviewer? permalink parent award report block reply\nanotherthing 1 points 2 days ago Care to take a stab at the ethnicity of the interviewer? permalink parent award report block reply\nWassermanSchultz 6 points 3 days ago Man, I really don't like her face.  The interviewer chick - not Sydney. permalink award report block reply\nDoesItWorkAlready 6 points 3 days ago Best Meme I've seen yet: \"are you sorry for implying white supremacy\"? \"My next job is with Hugo Boss\" permalink award report block reply NADSAQ 4 points 3 days ago it’s funny but Hugo Boss would be rolling in his grave if he saw the modern ads they run permalink parent award report block reply\nNADSAQ 4 points 3 days ago it’s funny but Hugo Boss would be rolling in his grave if he saw the modern ads they run permalink parent award report block reply\nRucktoe 5 points 3 days ago Loving the memes from this, haven't had this good of a time since pocahontas released her \"genetic test\" permalink award report block reply\nReturnOfSmarm 2 points 3 days ago Where/when was this interview ..... now I gotta see this. permalink award report block reply\nThisTrainHasNoBrakes 2 points 3 days ago Hoe, hoe, hoe! permalink award report block reply\nSpicy_cat 1 points 3 days ago \"Can't you just name at least one thing you think Hitler did wrong?\" permalink award report block reply\nmikejones 0 points 3 days ago You can have plastic surgery that makes you look incredible for $20,000 permalink award report block reply\nHanging_Chad -1 points 3 days ago sticky with 1 updoot 👏🏻 permalink award report block reply",
  "fetched_at": "2025-11-12T20:48:24.540585Z"
}