{
  "id": "1ARK52AsJJ",
  "url": "https://patriots.win/p/1ARK52AsJJ/trump-just-texted-fox-to-react-t/c",
  "content": "518 Trump just texted Fox to react to Pelosi’s retirement: “The retirement of Nancy Pelosi is a great thing for America. She was evil, corrupt, and only focused on bad things for our country… I’m very honored she impeached me twice and failed miserably…” posted 6 days ago by Mr_Rightside 13 comments award share report block johnny maga @_johnnymaga • 6d Trump just texted Fox to react to Pelosi’s retirement: “The retirement of Nancy Pelosi is a great thing for America. She was evil, corrupt, and only focused on bad things for our country… I’m very honored she impeached me twice and failed miserably…” 🤣\n13 comments Sort by Top Top New Worst Old Save highenergywinning 8 points 6 days ago can we arrest her now permalink award report block reply thisaintitchief76 1 points 6 days ago I'm telling you man, I wanted to see a whole line of these rat bastards in chains going to prison on Trump's first day back. I am very very very disappointed that they are still free and haven't been charged. permalink parent award report block reply MasterVader2U 1 points 6 days ago Soon. Just 2 more weeks. permalink parent award report block reply NdNcenti 5 points 6 days ago The blaze is supposed to break a big story about the “J6 pipe bomb” and this dinosaur chooses today to retire 🤔 permalink award report block reply TEXinLA 3 points 6 days ago 🤣🤣🤣🤣🤣🤣 permalink award report block reply BurtMcGirt 3 points 6 days ago The look of sheer hatred in her face when President Trump said that America would never be a communist or socialist country sums her up. permalink award report block reply PatriotSkorzeny 1 points 6 days ago So it’s just a Fox content admin for 2026 fundraising. permalink award report block reply TD_Covfefe_Crusader 1 points 6 days ago She will be replaced by someone worse though, guaranteed. permalink award report block reply PatriotSam 1 points 6 days ago Problem is that she is holding back the radicals on her end, just like Charlie Kirk was on ours. permalink award report block reply JoeMcCarthyWasRight 1 points 6 days ago Sunlight is the best disinfectant. Marxism has thrived in America because of how it’s been quietly it’s been implemented. permalink parent award report block reply behemoth887 1 points 6 days ago her amazing stock trading prowess is suddenly going to disappear when she leaves congress and it'll be so weird and nobody will know why permalink award report block reply Smurfection 1 points 6 days ago I love Trump and yes, it is an honor to be impeached and failed to remove from office by an excommunicated lying avaricious harpy!   Nancy Pelosi has done more to screw up this nation than any congressional representative ever has. She voted for the big Obama bailout in 2009, then did every trick in the book to pass Obamacare without a single, not one, Republican vote.  Then she went on to okay using the budgetary process, Reconciliation, to literally take over one seventh of the private sector economy via Obamacare.  In her first interview after doing this, she said \"We have to pass it to see what's in it\".   She had no clue and she didn't care.  She basically relied on her hope and feelings instead of knowing anything about it or how it work. After spending two billion dollars on the Obamacare website, healthcare.gov, it crashed the first day it was live and has been useless every since. I could list virtually everything she did in Congress and it's the same thing.  All delusions about what would happen, lies, misdirections, ignorance and all of it ending in ashes.  Nancy Pelosi and the \"Future is Female\" Crowd are the worst thing to ever happen to any western nations.  Letting women in positions of power has been a catastrophe because they assess based on feelings and teams and tones and not on hard facts like budgets, laws and results. permalink award report block reply Nellie_the_Beaut 1 points 6 days ago Pelosi plans to install her nut job daughter Christina in her place. But much to her drunken chagrin, the worst homosexual pedophile in the California senate named Scott Weiner has his eyes on that seat and has already announced he is going to run for it.  Look him? up - CA Senator Scott Weiner from San Francisco. Big obsessed with pushing sexuality on minors, and removing any obstacles to adults preying on them. Big friends with Newsom, AOC, Schiff and all the usual suspects. permalink award report block reply shadypollster 1 points 6 days ago I love this man more every day 🤣 permalink award report block reply\nhighenergywinning 8 points 6 days ago can we arrest her now permalink award report block reply thisaintitchief76 1 points 6 days ago I'm telling you man, I wanted to see a whole line of these rat bastards in chains going to prison on Trump's first day back. I am very very very disappointed that they are still free and haven't been charged. permalink parent award report block reply MasterVader2U 1 points 6 days ago Soon. Just 2 more weeks. permalink parent award report block reply\nthisaintitchief76 1 points 6 days ago I'm telling you man, I wanted to see a whole line of these rat bastards in chains going to prison on Trump's first day back. I am very very very disappointed that they are still free and haven't been charged. permalink parent award report block reply\nMasterVader2U 1 points 6 days ago Soon. Just 2 more weeks. permalink parent award report block reply\nNdNcenti 5 points 6 days ago The blaze is supposed to break a big story about the “J6 pipe bomb” and this dinosaur chooses today to retire 🤔 permalink award report block reply\nTEXinLA 3 points 6 days ago 🤣🤣🤣🤣🤣🤣 permalink award report block reply\nBurtMcGirt 3 points 6 days ago The look of sheer hatred in her face when President Trump said that America would never be a communist or socialist country sums her up. permalink award report block reply\nPatriotSkorzeny 1 points 6 days ago So it’s just a Fox content admin for 2026 fundraising. permalink award report block reply\nTD_Covfefe_Crusader 1 points 6 days ago She will be replaced by someone worse though, guaranteed. permalink award report block reply\nPatriotSam 1 points 6 days ago Problem is that she is holding back the radicals on her end, just like Charlie Kirk was on ours. permalink award report block reply JoeMcCarthyWasRight 1 points 6 days ago Sunlight is the best disinfectant. Marxism has thrived in America because of how it’s been quietly it’s been implemented. permalink parent award report block reply\nJoeMcCarthyWasRight 1 points 6 days ago Sunlight is the best disinfectant. Marxism has thrived in America because of how it’s been quietly it’s been implemented. permalink parent award report block reply\nbehemoth887 1 points 6 days ago her amazing stock trading prowess is suddenly going to disappear when she leaves congress and it'll be so weird and nobody will know why permalink award report block reply\nSmurfection 1 points 6 days ago I love Trump and yes, it is an honor to be impeached and failed to remove from office by an excommunicated lying avaricious harpy!   Nancy Pelosi has done more to screw up this nation than any congressional representative ever has. She voted for the big Obama bailout in 2009, then did every trick in the book to pass Obamacare without a single, not one, Republican vote.  Then she went on to okay using the budgetary process, Reconciliation, to literally take over one seventh of the private sector economy via Obamacare.  In her first interview after doing this, she said \"We have to pass it to see what's in it\".   She had no clue and she didn't care.  She basically relied on her hope and feelings instead of knowing anything about it or how it work. After spending two billion dollars on the Obamacare website, healthcare.gov, it crashed the first day it was live and has been useless every since. I could list virtually everything she did in Congress and it's the same thing.  All delusions about what would happen, lies, misdirections, ignorance and all of it ending in ashes.  Nancy Pelosi and the \"Future is Female\" Crowd are the worst thing to ever happen to any western nations.  Letting women in positions of power has been a catastrophe because they assess based on feelings and teams and tones and not on hard facts like budgets, laws and results. permalink award report block reply\nNellie_the_Beaut 1 points 6 days ago Pelosi plans to install her nut job daughter Christina in her place. But much to her drunken chagrin, the worst homosexual pedophile in the California senate named Scott Weiner has his eyes on that seat and has already announced he is going to run for it.  Look him? up - CA Senator Scott Weiner from San Francisco. Big obsessed with pushing sexuality on minors, and removing any obstacles to adults preying on them. Big friends with Newsom, AOC, Schiff and all the usual suspects. permalink award report block reply\nshadypollster 1 points 6 days ago I love this man more every day 🤣 permalink award report block reply",
  "fetched_at": "2025-11-12T20:51:40.494751Z"
}