{
  "id": "1ARK9k0zjS",
  "url": "https://patriots.win/p/1ARK9k0zjS/this-is-how-feminism-works/c",
  "content": "323 THIS IS HOW FEMINISM WORKS!!!! posted 1 day ago by China4Biden 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget patrioticwinning3 7 points 1 day ago One of the best memes I've seen! permalink award report block reply NeverNotTrump 6 points 1 day ago original classic: https://i.imgflip.com/2oqrvl.jpg?a489600 permalink award report block reply SBOJ_JOBS 4 points 1 day ago If the shoe fits... use it. --- Every potential \"victim\" permalink award report block reply JoyousMischief 4 points 1 day ago They really do seem to get hot and bothered about that one story that no man has ever heard of. permalink award report block reply upside-downPHflag 3 points 1 day ago With one hand on the boot, the other is inside the robe. permalink parent award report block reply woodjack 2 points 1 day ago It's how the msm works. permalink award report block reply\npatrioticwinning3 7 points 1 day ago One of the best memes I've seen! permalink award report block reply\nNeverNotTrump 6 points 1 day ago original classic: https://i.imgflip.com/2oqrvl.jpg?a489600 permalink award report block reply\nSBOJ_JOBS 4 points 1 day ago If the shoe fits... use it. --- Every potential \"victim\" permalink award report block reply\nJoyousMischief 4 points 1 day ago They really do seem to get hot and bothered about that one story that no man has ever heard of. permalink award report block reply upside-downPHflag 3 points 1 day ago With one hand on the boot, the other is inside the robe. permalink parent award report block reply\nupside-downPHflag 3 points 1 day ago With one hand on the boot, the other is inside the robe. permalink parent award report block reply\nwoodjack 2 points 1 day ago It's how the msm works. permalink award report block reply",
  "fetched_at": "2025-11-12T21:24:38.829599Z"
}