{
  "id": "8171776",
  "title": "1447“Can you stop at the camera, please?\"\n\nRUBIO: “I didn’t talk to you guys when I worked here, why",
  "url": "https://patriots.win/p/1ARK52Co7S/can-you-stop-at-the-camera-pleas/c",
  "content": "1447 “Can you stop at the camera, please?\"\n\nRUBIO: “I didn’t talk to you guys when I worked here, why would I talk to you NOW?\" posted 6 days ago by DeusVult1096 101 comments award share report block Eric Daugherty @EricLDaugh • 6d 🚨 LMAO! Marco Rubio is the BEST Secretary of State! “Can you stop at the camera, please?\" RUBIO: “I didn’t talk to you guys when I worked here, why would I talk to you NOW?\" We love Marco 🤣🔥\n101 comments Sort by Top Top New Worst Old Save Bullet3250 138 points 6 days ago If a republican talks to the MEDIA - they will just lie about what he says. Republicans should have stopped engaging with the MSM 30 years ago. permalink award report block reply ChrisSuperDude 96 points 6 days ago My favorite thing to say to liberals when they wanna debate the last month has been “you people shot the last guy who actually wanted to debate you, why should I take that risk?” permalink parent award report block reply Bullet3250 43 points 6 days ago And of course - if they used 'reason and logic' and looked at policy fairly - they would be MAGA already. There is no debating those people - and I have tried. permalink parent award report block reply TheThreeSeashells 7 points 6 days ago I listen to Andrew Wilkow's show every day while I work.  Every single Leftist that calls him starts off thinking they \"got him\" with one of their moronic points.  Andrew immediately blows them out of the water with facts and logic and they immediately go right to angrily yelling, name calling, and insults.  Every single time. permalink parent award report block reply cucks_on_parade 4 points 6 days ago Right down to my ex high school friends.  They're all under the same brainwashed spell producing nearly identical results in every individual regardless of purported \"beliefs.\"  One of the modern marvels in a way permalink parent award report block reply MehNahMehNah 2 points 5 days ago Wilkow is a sharp dude. permalink parent award report block reply Quietam_Unum 1 points 5 days ago I really enjoyed Andrew back when I had Sirius/XM but it isn't worth getting JUST for the Wilkow Show any more. The best thing I ever heard on Sirius/XM was on the David Webb show.  He took a call on air from some lefty journalist/blogger type and the laughs started.  She went off on him for several minutes on end berating him for his \"white privilege.\"  He let her go on, no interruptions,  until she finally ran down. Then, and only then, he pointed out that \"her people\" needed to do better vetting so she'd know when the was interviewing black people. permalink parent award report block reply realPhantomFuck 6 points 6 days ago Debate died with Charlie. permalink parent award report block reply Citizen_Bob 17 points 6 days ago the media is a political party operating as PR firms operating as ad salesmen operating as news edit: can pro'ly put deep state before the party permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Al Jazeera is the same thing, just working for Qatar. permalink parent award report block reply Ralph-RaccooN 2 points 6 days ago people that are under attack of the media can detect the lies, if your part of the mob its harder. its no wonder RT and Al Jazeera popped up. permalink parent award report block reply BeekeepingPatriot 80 points 6 days ago He’s been my favorite surprise in this entire administration.  RFK as well. permalink award report block reply hatredcopter 21 points 6 days ago I used to think he was the poster child for that weak chamber of commerce type republican. permalink parent award report block reply clownworld30330 3 points 6 days ago Maybe he still will be in 2029. permalink parent award report block reply Cakes4077 14 points 6 days ago When Trump named him, I thought he would be a good fit cause even though he was a RINO in the senate, he seemed to have a strong understanding of geopolitics. permalink parent award report block reply Aambrick 18 points 6 days ago To be honest I think it is very simple. He was a RINO, but when he saw how popular Trump was with people after Trump won the first term he started to copy Trump to a degree. Did it long enough that the RINO part of him slowly starved while that new attitude and observation was fed. Eventually, this became his real attitude before he was even nominated to the position, and working in that position just enforced that new attitude. I still say never trust politicians, but look at their work record. Rubio's work record is starting to branch into the effective territory instead of good territory now. permalink parent award report block reply Cakes4077 13 points 6 days ago I still wouldn’t trust him as an executive, but as a worker for a strong executive, he is great. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago You're assuming it's heartfelt and not an act. He sure has been making it seem that way! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago DJT even called him out for being approved unanimously. He's very much a surprise! permalink parent award report block reply DITTOPatriot 0 points 5 days ago That should tell you everything you need to know about Marco, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago Don't be such a simpleton. permalink parent award report block reply view 1 more comments... ingrowntoenail 2 points 6 days ago Yes, Little Marco and JD have been awesome.  I'm on the fence about RFK. permalink parent award report block reply SicSemperTyrannis2 -1 points 6 days ago JD did absolutely nothing about the Parliamentarian's \"rulings.\" He should be made to be afraid to show his face in public. permalink parent award report block reply ingrowntoenail 2 points 5 days ago JD is doing just fine. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago And that's the problem. He's at least as bad as 30 Pence, betrayed us all. permalink parent award report block reply RealTXPatriot 2 points 6 days ago Yeh? Remember when Boehner was playing that role? All theater my guy\nAlways has been. permalink parent award report block reply EgregiousPhilbin 33 points 6 days ago Based little person permalink award report block reply MostEffectualTopKek 45 points 6 days ago Best redemption arc permalink parent award report block reply PepePinochet 29 points 6 days ago Big Marco permalink parent award report block reply ThorsonTT 19 points 6 days ago MAGA Marco permalink parent award report block reply TheDTOMDon 7 points 6 days ago Based Micro Rubio permalink parent award report block reply IncredibleMrE1 23 points 6 days ago 99-0 confirmation vote permalink award report block reply jatergator 44 points 6 days ago Honestly I bet they wouldn’t vote this way now. Since his confirmation, he’s become even better. We were all skeptical of him. He’s proven us wrong so far. permalink parent award report block reply Talledega 11 points 6 days ago The Democrats and many Republicans DEFINITELY voted for him because they thought he was going to be the same RINO that ran against Trump in 2016. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Not \"many,\" he was confirmed unanimously. permalink parent award report block reply MehNahMehNah 1 points 5 days ago We had little reason to distrust Pence until... permalink parent award report block reply SicSemperTyrannis2 0 points 6 days ago \"proven us wrong?\" No! Impossible to trust government without being an idiot. Everyone in government  should be scrutinized as a crook; those who seem to pass the test should still be suspected for what they might be getting away with that we just don't know about yet. This is the way our government is designed to function. \"Eternal vigilance!\" permalink parent award report block reply DITTOPatriot 0 points 5 days ago You cant say that. Do you realize how many have worked so hard to convince the base that he's changed? Look at the leaked emails of how Ellision vetted him, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago You know nothing. You have no idea what it means to be an American. permalink parent award report block reply view 1 more comments... Cakes4077 2 points 6 days ago That’s really common when it comes to Senators being named as a secretary though. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Used to be. Anymore it's orange man bad, no way Jose, and blue no matter who. permalink parent award report block reply LatitudeofMind 1 points 5 days ago I could never vote for him permalink parent award report block reply rootGoose 17 points 6 days ago Stupid follow: 'He used to talk to us, actually.' He clearly stopped because you sold your soul for a paycheck and bit of waning influence. permalink award report block reply WarOfTheFanboys2 18 points 6 days ago that was just pure cope from someone just banished to the shadow realm permalink parent award report block reply justicein2020 3 points 6 days ago Not enough people have told the media people directly what we REALLY think about them these days. Because it would be called a threat or a hate crime and get you in trouble... Someone should really tell them tho. permalink parent award report block reply America_No_1 15 points 6 days ago Pretty nice rack at the 6 seconds left marker for any mammary lovers here permalink award report block reply deleted 7 points 6 days ago makersmarx 4 points 6 days ago https://ibb.co/S4PSqmcs permalink parent award report block reply ragnarokrobo 4 points 6 days ago Awooga permalink parent award report block reply VirtusHonos 4 points 6 days ago I noted her assets as well permalink parent award report block reply ganachain 2 points 6 days ago You da real MVP permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Get a glimpse of the rest of her body too, very well put together top to bottom. permalink parent award report block reply load 1 more comments... AwShitHereWeGoAgain 10 points 6 days ago Shocked at how based Marco has become. permalink award report block reply Dallasguy 7 points 6 days ago Did Marco get a dose of dewormer to kill the rino virus in his ass? permalink award report block reply BoomShtick 10 points 6 days ago I believe he is one of those guys that will nut up when in a group of stronger men (like Trump and MAGA), but will cuck if he is not supported and has to fight by himself. permalink parent award report block reply Aquamine-Amarine 6 points 6 days ago I think this way too. He was a young up and coming Tea Partier. The RINO establishment probably took advantage of him back then. permalink parent award report block reply JDSquare13 3 points 6 days ago Cuckservative, rather than a RINO permalink parent award report block reply Alpha_Lemming 4 points 6 days ago This dude's redemption arc from\n2016 is damned impressive. permalink award report block reply spezisacuckold 4 points 6 days ago He's learning permalink award report block reply Racerspuff 3 points 6 days ago Still someone wearing a mask. permalink award report block reply DITTOPatriot 1 points 5 days ago Yes. permalink parent award report block reply cusp-of-carabelli 3 points 6 days ago Little Marco is the YTD MVP of the Trump campaign.  He’s currently the hardest working man in Washington, DC. permalink award report block reply knnbccb 3 points 6 days ago They're not journalists, why are they still allowed to be there? They are a security threat. Put a restraining order on them and their equipment. permalink award report block reply Mungo 3 points 6 days ago Nice permalink award report block reply JesusIsMyGod114 3 points 5 days ago Spicy permalink award report block reply drmrboy 2 points 6 days ago Mr. Israel himself!!!  🙄 permalink award report block reply DITTOPatriot 2 points 5 days ago For sure. permalink parent award report block reply TrumpMostUnMAGA 2 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply Tokyo_Proud_Boys 2 points 5 days ago With a big smile on his face.  Love it. permalink award report block reply RealTXPatriot 2 points 6 days ago ....and closing us out.. the fat heffer permalink award report block reply Cuck_Slayer24 2 points 6 days ago Marco has been the most improved player by far. permalink award report block reply TheRPatriot 1 points 6 days ago 🚨 permalink award report block reply nemonster 1 points 5 days ago That jeet come bery close to stab him with his phone permalink award report block reply RedEnsign4Trump 1 points 6 days ago He used to talk to us akshually 🤓☝️ permalink award report block reply thelastlast 1 points 6 days ago listen to the bitter nerd chatter at the end.  i thought high school ended at 18 but the bitter nerds all become reporters and try to ruin everyone else's lives. permalink award report block reply maga_gal2 1 points 6 days ago Seriously, he gets my vote if he runs. Full stop. permalink award report block reply KernalMustard 6 points 6 days ago Demand Better. permalink parent award report block reply grad16uc 4 points 6 days ago I can't believe we're still eating this up. permalink parent award report block reply TheWhitestOfFangs 4 points 6 days ago He's not your ally. He just knows what the appearance of him should be, but he's still a net negative. permalink parent award report block reply makersmarx 4 points 6 days ago He's a snake doing the bidding of our greatest ally. Ill never trust him permalink parent award report block reply TheWhitestOfFangs 1 points 6 days ago He is a snake, but I don't think he is doing anyone's bidding... other than his own bidding. Don't like that either. permalink parent award report block reply makersmarx -2 points 6 days ago Maybe youre right, but the jubios sure do love Rubio! And Bondi permalink parent award report block reply DITTOPatriot 2 points 5 days ago Exactly. permalink parent award report block reply Redeemable 1 points 5 days ago I presume this is the Senste? permalink award report block reply keeman 0 points 6 days ago He's probably late for his appointment with his Zionist masters. permalink award report block reply DITTOPatriot 0 points 5 days ago Marco is controlled opposition. permalink award report block reply NeverNotTrump -1 points 6 days ago Spoiler Alert: Lil' Marco will sell MAGA downriver the first chance he gets. permalink award report block reply KernalMustard -2 points 6 days ago The cultists will cheer him on till that happens. They will then cry he betrayed us. The rest of us have warned till we are blue in rhe face. They wont listen. permalink parent award report block reply DITTOPatriot 1 points 5 days ago Understand that the cultist aren't real. 90% of the commentors in this forum are sub class 7k club members. permalink parent award report block reply lul_cheto -1 points 6 days ago Rubio is neo con MIGA trash.\nAlways has been.\nAlways will be. permalink award report block reply M-m-m-my-corona -1 points 6 days ago OMG so awesome.  OK I agree.  We can die for Israel now permalink award report block reply sgttoporbottoms -7 points 6 days ago I believe Rubio to be a neocon who is trying to scam trump into a Venezuela invasion. permalink award report block reply UsernameChexOut -25 points 6 days ago Marco Rubio is a swamp creature that is working overtime to derail Trump's presidency, fuck him permalink award report block reply Politoed 21 points 6 days ago What has he done to derail Trump? permalink parent award report block reply NadlersNads -7 points 6 days ago So.many. snakes permalink parent award report block reply FullyDilated 0 points 6 days ago Comment removed by community filter. permalink award report block reply FullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply FullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nBullet3250 138 points 6 days ago If a republican talks to the MEDIA - they will just lie about what he says. Republicans should have stopped engaging with the MSM 30 years ago. permalink award report block reply ChrisSuperDude 96 points 6 days ago My favorite thing to say to liberals when they wanna debate the last month has been “you people shot the last guy who actually wanted to debate you, why should I take that risk?” permalink parent award report block reply Bullet3250 43 points 6 days ago And of course - if they used 'reason and logic' and looked at policy fairly - they would be MAGA already. There is no debating those people - and I have tried. permalink parent award report block reply TheThreeSeashells 7 points 6 days ago I listen to Andrew Wilkow's show every day while I work.  Every single Leftist that calls him starts off thinking they \"got him\" with one of their moronic points.  Andrew immediately blows them out of the water with facts and logic and they immediately go right to angrily yelling, name calling, and insults.  Every single time. permalink parent award report block reply cucks_on_parade 4 points 6 days ago Right down to my ex high school friends.  They're all under the same brainwashed spell producing nearly identical results in every individual regardless of purported \"beliefs.\"  One of the modern marvels in a way permalink parent award report block reply MehNahMehNah 2 points 5 days ago Wilkow is a sharp dude. permalink parent award report block reply Quietam_Unum 1 points 5 days ago I really enjoyed Andrew back when I had Sirius/XM but it isn't worth getting JUST for the Wilkow Show any more. The best thing I ever heard on Sirius/XM was on the David Webb show.  He took a call on air from some lefty journalist/blogger type and the laughs started.  She went off on him for several minutes on end berating him for his \"white privilege.\"  He let her go on, no interruptions,  until she finally ran down. Then, and only then, he pointed out that \"her people\" needed to do better vetting so she'd know when the was interviewing black people. permalink parent award report block reply realPhantomFuck 6 points 6 days ago Debate died with Charlie. permalink parent award report block reply Citizen_Bob 17 points 6 days ago the media is a political party operating as PR firms operating as ad salesmen operating as news edit: can pro'ly put deep state before the party permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Al Jazeera is the same thing, just working for Qatar. permalink parent award report block reply Ralph-RaccooN 2 points 6 days ago people that are under attack of the media can detect the lies, if your part of the mob its harder. its no wonder RT and Al Jazeera popped up. permalink parent award report block reply\nChrisSuperDude 96 points 6 days ago My favorite thing to say to liberals when they wanna debate the last month has been “you people shot the last guy who actually wanted to debate you, why should I take that risk?” permalink parent award report block reply Bullet3250 43 points 6 days ago And of course - if they used 'reason and logic' and looked at policy fairly - they would be MAGA already. There is no debating those people - and I have tried. permalink parent award report block reply TheThreeSeashells 7 points 6 days ago I listen to Andrew Wilkow's show every day while I work.  Every single Leftist that calls him starts off thinking they \"got him\" with one of their moronic points.  Andrew immediately blows them out of the water with facts and logic and they immediately go right to angrily yelling, name calling, and insults.  Every single time. permalink parent award report block reply cucks_on_parade 4 points 6 days ago Right down to my ex high school friends.  They're all under the same brainwashed spell producing nearly identical results in every individual regardless of purported \"beliefs.\"  One of the modern marvels in a way permalink parent award report block reply MehNahMehNah 2 points 5 days ago Wilkow is a sharp dude. permalink parent award report block reply Quietam_Unum 1 points 5 days ago I really enjoyed Andrew back when I had Sirius/XM but it isn't worth getting JUST for the Wilkow Show any more. The best thing I ever heard on Sirius/XM was on the David Webb show.  He took a call on air from some lefty journalist/blogger type and the laughs started.  She went off on him for several minutes on end berating him for his \"white privilege.\"  He let her go on, no interruptions,  until she finally ran down. Then, and only then, he pointed out that \"her people\" needed to do better vetting so she'd know when the was interviewing black people. permalink parent award report block reply realPhantomFuck 6 points 6 days ago Debate died with Charlie. permalink parent award report block reply\nBullet3250 43 points 6 days ago And of course - if they used 'reason and logic' and looked at policy fairly - they would be MAGA already. There is no debating those people - and I have tried. permalink parent award report block reply TheThreeSeashells 7 points 6 days ago I listen to Andrew Wilkow's show every day while I work.  Every single Leftist that calls him starts off thinking they \"got him\" with one of their moronic points.  Andrew immediately blows them out of the water with facts and logic and they immediately go right to angrily yelling, name calling, and insults.  Every single time. permalink parent award report block reply cucks_on_parade 4 points 6 days ago Right down to my ex high school friends.  They're all under the same brainwashed spell producing nearly identical results in every individual regardless of purported \"beliefs.\"  One of the modern marvels in a way permalink parent award report block reply MehNahMehNah 2 points 5 days ago Wilkow is a sharp dude. permalink parent award report block reply Quietam_Unum 1 points 5 days ago I really enjoyed Andrew back when I had Sirius/XM but it isn't worth getting JUST for the Wilkow Show any more. The best thing I ever heard on Sirius/XM was on the David Webb show.  He took a call on air from some lefty journalist/blogger type and the laughs started.  She went off on him for several minutes on end berating him for his \"white privilege.\"  He let her go on, no interruptions,  until she finally ran down. Then, and only then, he pointed out that \"her people\" needed to do better vetting so she'd know when the was interviewing black people. permalink parent award report block reply\nTheThreeSeashells 7 points 6 days ago I listen to Andrew Wilkow's show every day while I work.  Every single Leftist that calls him starts off thinking they \"got him\" with one of their moronic points.  Andrew immediately blows them out of the water with facts and logic and they immediately go right to angrily yelling, name calling, and insults.  Every single time. permalink parent award report block reply cucks_on_parade 4 points 6 days ago Right down to my ex high school friends.  They're all under the same brainwashed spell producing nearly identical results in every individual regardless of purported \"beliefs.\"  One of the modern marvels in a way permalink parent award report block reply MehNahMehNah 2 points 5 days ago Wilkow is a sharp dude. permalink parent award report block reply Quietam_Unum 1 points 5 days ago I really enjoyed Andrew back when I had Sirius/XM but it isn't worth getting JUST for the Wilkow Show any more. The best thing I ever heard on Sirius/XM was on the David Webb show.  He took a call on air from some lefty journalist/blogger type and the laughs started.  She went off on him for several minutes on end berating him for his \"white privilege.\"  He let her go on, no interruptions,  until she finally ran down. Then, and only then, he pointed out that \"her people\" needed to do better vetting so she'd know when the was interviewing black people. permalink parent award report block reply\ncucks_on_parade 4 points 6 days ago Right down to my ex high school friends.  They're all under the same brainwashed spell producing nearly identical results in every individual regardless of purported \"beliefs.\"  One of the modern marvels in a way permalink parent award report block reply\nMehNahMehNah 2 points 5 days ago Wilkow is a sharp dude. permalink parent award report block reply\nQuietam_Unum 1 points 5 days ago I really enjoyed Andrew back when I had Sirius/XM but it isn't worth getting JUST for the Wilkow Show any more. The best thing I ever heard on Sirius/XM was on the David Webb show.  He took a call on air from some lefty journalist/blogger type and the laughs started.  She went off on him for several minutes on end berating him for his \"white privilege.\"  He let her go on, no interruptions,  until she finally ran down. Then, and only then, he pointed out that \"her people\" needed to do better vetting so she'd know when the was interviewing black people. permalink parent award report block reply\nrealPhantomFuck 6 points 6 days ago Debate died with Charlie. permalink parent award report block reply\nCitizen_Bob 17 points 6 days ago the media is a political party operating as PR firms operating as ad salesmen operating as news edit: can pro'ly put deep state before the party permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Al Jazeera is the same thing, just working for Qatar. permalink parent award report block reply Ralph-RaccooN 2 points 6 days ago people that are under attack of the media can detect the lies, if your part of the mob its harder. its no wonder RT and Al Jazeera popped up. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Al Jazeera is the same thing, just working for Qatar. permalink parent award report block reply Ralph-RaccooN 2 points 6 days ago people that are under attack of the media can detect the lies, if your part of the mob its harder. its no wonder RT and Al Jazeera popped up. permalink parent award report block reply\nRalph-RaccooN 2 points 6 days ago people that are under attack of the media can detect the lies, if your part of the mob its harder. its no wonder RT and Al Jazeera popped up. permalink parent award report block reply\nBeekeepingPatriot 80 points 6 days ago He’s been my favorite surprise in this entire administration.  RFK as well. permalink award report block reply hatredcopter 21 points 6 days ago I used to think he was the poster child for that weak chamber of commerce type republican. permalink parent award report block reply clownworld30330 3 points 6 days ago Maybe he still will be in 2029. permalink parent award report block reply Cakes4077 14 points 6 days ago When Trump named him, I thought he would be a good fit cause even though he was a RINO in the senate, he seemed to have a strong understanding of geopolitics. permalink parent award report block reply Aambrick 18 points 6 days ago To be honest I think it is very simple. He was a RINO, but when he saw how popular Trump was with people after Trump won the first term he started to copy Trump to a degree. Did it long enough that the RINO part of him slowly starved while that new attitude and observation was fed. Eventually, this became his real attitude before he was even nominated to the position, and working in that position just enforced that new attitude. I still say never trust politicians, but look at their work record. Rubio's work record is starting to branch into the effective territory instead of good territory now. permalink parent award report block reply Cakes4077 13 points 6 days ago I still wouldn’t trust him as an executive, but as a worker for a strong executive, he is great. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago You're assuming it's heartfelt and not an act. He sure has been making it seem that way! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago DJT even called him out for being approved unanimously. He's very much a surprise! permalink parent award report block reply DITTOPatriot 0 points 5 days ago That should tell you everything you need to know about Marco, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago Don't be such a simpleton. permalink parent award report block reply view 1 more comments... ingrowntoenail 2 points 6 days ago Yes, Little Marco and JD have been awesome.  I'm on the fence about RFK. permalink parent award report block reply SicSemperTyrannis2 -1 points 6 days ago JD did absolutely nothing about the Parliamentarian's \"rulings.\" He should be made to be afraid to show his face in public. permalink parent award report block reply ingrowntoenail 2 points 5 days ago JD is doing just fine. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago And that's the problem. He's at least as bad as 30 Pence, betrayed us all. permalink parent award report block reply RealTXPatriot 2 points 6 days ago Yeh? Remember when Boehner was playing that role? All theater my guy\nAlways has been. permalink parent award report block reply\nhatredcopter 21 points 6 days ago I used to think he was the poster child for that weak chamber of commerce type republican. permalink parent award report block reply clownworld30330 3 points 6 days ago Maybe he still will be in 2029. permalink parent award report block reply\nclownworld30330 3 points 6 days ago Maybe he still will be in 2029. permalink parent award report block reply\nCakes4077 14 points 6 days ago When Trump named him, I thought he would be a good fit cause even though he was a RINO in the senate, he seemed to have a strong understanding of geopolitics. permalink parent award report block reply Aambrick 18 points 6 days ago To be honest I think it is very simple. He was a RINO, but when he saw how popular Trump was with people after Trump won the first term he started to copy Trump to a degree. Did it long enough that the RINO part of him slowly starved while that new attitude and observation was fed. Eventually, this became his real attitude before he was even nominated to the position, and working in that position just enforced that new attitude. I still say never trust politicians, but look at their work record. Rubio's work record is starting to branch into the effective territory instead of good territory now. permalink parent award report block reply Cakes4077 13 points 6 days ago I still wouldn’t trust him as an executive, but as a worker for a strong executive, he is great. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago You're assuming it's heartfelt and not an act. He sure has been making it seem that way! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago DJT even called him out for being approved unanimously. He's very much a surprise! permalink parent award report block reply DITTOPatriot 0 points 5 days ago That should tell you everything you need to know about Marco, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago Don't be such a simpleton. permalink parent award report block reply view 1 more comments...\nAambrick 18 points 6 days ago To be honest I think it is very simple. He was a RINO, but when he saw how popular Trump was with people after Trump won the first term he started to copy Trump to a degree. Did it long enough that the RINO part of him slowly starved while that new attitude and observation was fed. Eventually, this became his real attitude before he was even nominated to the position, and working in that position just enforced that new attitude. I still say never trust politicians, but look at their work record. Rubio's work record is starting to branch into the effective territory instead of good territory now. permalink parent award report block reply Cakes4077 13 points 6 days ago I still wouldn’t trust him as an executive, but as a worker for a strong executive, he is great. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago You're assuming it's heartfelt and not an act. He sure has been making it seem that way! permalink parent award report block reply\nCakes4077 13 points 6 days ago I still wouldn’t trust him as an executive, but as a worker for a strong executive, he is great. permalink parent award report block reply\nSicSemperTyrannis2 3 points 6 days ago You're assuming it's heartfelt and not an act. He sure has been making it seem that way! permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago DJT even called him out for being approved unanimously. He's very much a surprise! permalink parent award report block reply DITTOPatriot 0 points 5 days ago That should tell you everything you need to know about Marco, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago Don't be such a simpleton. permalink parent award report block reply view 1 more comments...\nDITTOPatriot 0 points 5 days ago That should tell you everything you need to know about Marco, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago Don't be such a simpleton. permalink parent award report block reply view 1 more comments...\nSicSemperTyrannis2 0 points 5 days ago Don't be such a simpleton. permalink parent award report block reply view 1 more comments...\ningrowntoenail 2 points 6 days ago Yes, Little Marco and JD have been awesome.  I'm on the fence about RFK. permalink parent award report block reply SicSemperTyrannis2 -1 points 6 days ago JD did absolutely nothing about the Parliamentarian's \"rulings.\" He should be made to be afraid to show his face in public. permalink parent award report block reply ingrowntoenail 2 points 5 days ago JD is doing just fine. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago And that's the problem. He's at least as bad as 30 Pence, betrayed us all. permalink parent award report block reply\nSicSemperTyrannis2 -1 points 6 days ago JD did absolutely nothing about the Parliamentarian's \"rulings.\" He should be made to be afraid to show his face in public. permalink parent award report block reply ingrowntoenail 2 points 5 days ago JD is doing just fine. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago And that's the problem. He's at least as bad as 30 Pence, betrayed us all. permalink parent award report block reply\ningrowntoenail 2 points 5 days ago JD is doing just fine. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago And that's the problem. He's at least as bad as 30 Pence, betrayed us all. permalink parent award report block reply\nSicSemperTyrannis2 1 points 5 days ago And that's the problem. He's at least as bad as 30 Pence, betrayed us all. permalink parent award report block reply\nRealTXPatriot 2 points 6 days ago Yeh? Remember when Boehner was playing that role? All theater my guy\nAlways has been. permalink parent award report block reply\nEgregiousPhilbin 33 points 6 days ago Based little person permalink award report block reply MostEffectualTopKek 45 points 6 days ago Best redemption arc permalink parent award report block reply PepePinochet 29 points 6 days ago Big Marco permalink parent award report block reply ThorsonTT 19 points 6 days ago MAGA Marco permalink parent award report block reply TheDTOMDon 7 points 6 days ago Based Micro Rubio permalink parent award report block reply\nMostEffectualTopKek 45 points 6 days ago Best redemption arc permalink parent award report block reply\nPepePinochet 29 points 6 days ago Big Marco permalink parent award report block reply ThorsonTT 19 points 6 days ago MAGA Marco permalink parent award report block reply\nThorsonTT 19 points 6 days ago MAGA Marco permalink parent award report block reply\nTheDTOMDon 7 points 6 days ago Based Micro Rubio permalink parent award report block reply\nIncredibleMrE1 23 points 6 days ago 99-0 confirmation vote permalink award report block reply jatergator 44 points 6 days ago Honestly I bet they wouldn’t vote this way now. Since his confirmation, he’s become even better. We were all skeptical of him. He’s proven us wrong so far. permalink parent award report block reply Talledega 11 points 6 days ago The Democrats and many Republicans DEFINITELY voted for him because they thought he was going to be the same RINO that ran against Trump in 2016. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Not \"many,\" he was confirmed unanimously. permalink parent award report block reply MehNahMehNah 1 points 5 days ago We had little reason to distrust Pence until... permalink parent award report block reply SicSemperTyrannis2 0 points 6 days ago \"proven us wrong?\" No! Impossible to trust government without being an idiot. Everyone in government  should be scrutinized as a crook; those who seem to pass the test should still be suspected for what they might be getting away with that we just don't know about yet. This is the way our government is designed to function. \"Eternal vigilance!\" permalink parent award report block reply DITTOPatriot 0 points 5 days ago You cant say that. Do you realize how many have worked so hard to convince the base that he's changed? Look at the leaked emails of how Ellision vetted him, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago You know nothing. You have no idea what it means to be an American. permalink parent award report block reply view 1 more comments... Cakes4077 2 points 6 days ago That’s really common when it comes to Senators being named as a secretary though. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Used to be. Anymore it's orange man bad, no way Jose, and blue no matter who. permalink parent award report block reply LatitudeofMind 1 points 5 days ago I could never vote for him permalink parent award report block reply\njatergator 44 points 6 days ago Honestly I bet they wouldn’t vote this way now. Since his confirmation, he’s become even better. We were all skeptical of him. He’s proven us wrong so far. permalink parent award report block reply Talledega 11 points 6 days ago The Democrats and many Republicans DEFINITELY voted for him because they thought he was going to be the same RINO that ran against Trump in 2016. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Not \"many,\" he was confirmed unanimously. permalink parent award report block reply MehNahMehNah 1 points 5 days ago We had little reason to distrust Pence until... permalink parent award report block reply SicSemperTyrannis2 0 points 6 days ago \"proven us wrong?\" No! Impossible to trust government without being an idiot. Everyone in government  should be scrutinized as a crook; those who seem to pass the test should still be suspected for what they might be getting away with that we just don't know about yet. This is the way our government is designed to function. \"Eternal vigilance!\" permalink parent award report block reply DITTOPatriot 0 points 5 days ago You cant say that. Do you realize how many have worked so hard to convince the base that he's changed? Look at the leaked emails of how Ellision vetted him, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago You know nothing. You have no idea what it means to be an American. permalink parent award report block reply view 1 more comments...\nTalledega 11 points 6 days ago The Democrats and many Republicans DEFINITELY voted for him because they thought he was going to be the same RINO that ran against Trump in 2016. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Not \"many,\" he was confirmed unanimously. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Not \"many,\" he was confirmed unanimously. permalink parent award report block reply\nMehNahMehNah 1 points 5 days ago We had little reason to distrust Pence until... permalink parent award report block reply\nSicSemperTyrannis2 0 points 6 days ago \"proven us wrong?\" No! Impossible to trust government without being an idiot. Everyone in government  should be scrutinized as a crook; those who seem to pass the test should still be suspected for what they might be getting away with that we just don't know about yet. This is the way our government is designed to function. \"Eternal vigilance!\" permalink parent award report block reply DITTOPatriot 0 points 5 days ago You cant say that. Do you realize how many have worked so hard to convince the base that he's changed? Look at the leaked emails of how Ellision vetted him, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago You know nothing. You have no idea what it means to be an American. permalink parent award report block reply view 1 more comments...\nDITTOPatriot 0 points 5 days ago You cant say that. Do you realize how many have worked so hard to convince the base that he's changed? Look at the leaked emails of how Ellision vetted him, permalink parent award report block reply SicSemperTyrannis2 0 points 5 days ago You know nothing. You have no idea what it means to be an American. permalink parent award report block reply view 1 more comments...\nSicSemperTyrannis2 0 points 5 days ago You know nothing. You have no idea what it means to be an American. permalink parent award report block reply view 1 more comments...\nCakes4077 2 points 6 days ago That’s really common when it comes to Senators being named as a secretary though. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Used to be. Anymore it's orange man bad, no way Jose, and blue no matter who. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Used to be. Anymore it's orange man bad, no way Jose, and blue no matter who. permalink parent award report block reply\nLatitudeofMind 1 points 5 days ago I could never vote for him permalink parent award report block reply\nrootGoose 17 points 6 days ago Stupid follow: 'He used to talk to us, actually.' He clearly stopped because you sold your soul for a paycheck and bit of waning influence. permalink award report block reply WarOfTheFanboys2 18 points 6 days ago that was just pure cope from someone just banished to the shadow realm permalink parent award report block reply justicein2020 3 points 6 days ago Not enough people have told the media people directly what we REALLY think about them these days. Because it would be called a threat or a hate crime and get you in trouble... Someone should really tell them tho. permalink parent award report block reply\nWarOfTheFanboys2 18 points 6 days ago that was just pure cope from someone just banished to the shadow realm permalink parent award report block reply\njusticein2020 3 points 6 days ago Not enough people have told the media people directly what we REALLY think about them these days. Because it would be called a threat or a hate crime and get you in trouble... Someone should really tell them tho. permalink parent award report block reply\nAmerica_No_1 15 points 6 days ago Pretty nice rack at the 6 seconds left marker for any mammary lovers here permalink award report block reply deleted 7 points 6 days ago makersmarx 4 points 6 days ago https://ibb.co/S4PSqmcs permalink parent award report block reply ragnarokrobo 4 points 6 days ago Awooga permalink parent award report block reply VirtusHonos 4 points 6 days ago I noted her assets as well permalink parent award report block reply ganachain 2 points 6 days ago You da real MVP permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Get a glimpse of the rest of her body too, very well put together top to bottom. permalink parent award report block reply load 1 more comments...\ndeleted 7 points 6 days ago makersmarx 4 points 6 days ago https://ibb.co/S4PSqmcs permalink parent award report block reply\nmakersmarx 4 points 6 days ago https://ibb.co/S4PSqmcs permalink parent award report block reply\nragnarokrobo 4 points 6 days ago Awooga permalink parent award report block reply\nVirtusHonos 4 points 6 days ago I noted her assets as well permalink parent award report block reply\nganachain 2 points 6 days ago You da real MVP permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Get a glimpse of the rest of her body too, very well put together top to bottom. permalink parent award report block reply\nAwShitHereWeGoAgain 10 points 6 days ago Shocked at how based Marco has become. permalink award report block reply\nDallasguy 7 points 6 days ago Did Marco get a dose of dewormer to kill the rino virus in his ass? permalink award report block reply BoomShtick 10 points 6 days ago I believe he is one of those guys that will nut up when in a group of stronger men (like Trump and MAGA), but will cuck if he is not supported and has to fight by himself. permalink parent award report block reply Aquamine-Amarine 6 points 6 days ago I think this way too. He was a young up and coming Tea Partier. The RINO establishment probably took advantage of him back then. permalink parent award report block reply JDSquare13 3 points 6 days ago Cuckservative, rather than a RINO permalink parent award report block reply\nBoomShtick 10 points 6 days ago I believe he is one of those guys that will nut up when in a group of stronger men (like Trump and MAGA), but will cuck if he is not supported and has to fight by himself. permalink parent award report block reply Aquamine-Amarine 6 points 6 days ago I think this way too. He was a young up and coming Tea Partier. The RINO establishment probably took advantage of him back then. permalink parent award report block reply JDSquare13 3 points 6 days ago Cuckservative, rather than a RINO permalink parent award report block reply\nAquamine-Amarine 6 points 6 days ago I think this way too. He was a young up and coming Tea Partier. The RINO establishment probably took advantage of him back then. permalink parent award report block reply\nJDSquare13 3 points 6 days ago Cuckservative, rather than a RINO permalink parent award report block reply\nAlpha_Lemming 4 points 6 days ago This dude's redemption arc from\n2016 is damned impressive. permalink award report block reply\nspezisacuckold 4 points 6 days ago He's learning permalink award report block reply\nRacerspuff 3 points 6 days ago Still someone wearing a mask. permalink award report block reply DITTOPatriot 1 points 5 days ago Yes. permalink parent award report block reply\nDITTOPatriot 1 points 5 days ago Yes. permalink parent award report block reply\ncusp-of-carabelli 3 points 6 days ago Little Marco is the YTD MVP of the Trump campaign.  He’s currently the hardest working man in Washington, DC. permalink award report block reply\nknnbccb 3 points 6 days ago They're not journalists, why are they still allowed to be there? They are a security threat. Put a restraining order on them and their equipment. permalink award report block reply\nMungo 3 points 6 days ago Nice permalink award report block reply\nJesusIsMyGod114 3 points 5 days ago Spicy permalink award report block reply\ndrmrboy 2 points 6 days ago Mr. Israel himself!!!  🙄 permalink award report block reply DITTOPatriot 2 points 5 days ago For sure. permalink parent award report block reply TrumpMostUnMAGA 2 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nDITTOPatriot 2 points 5 days ago For sure. permalink parent award report block reply\nTrumpMostUnMAGA 2 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTokyo_Proud_Boys 2 points 5 days ago With a big smile on his face.  Love it. permalink award report block reply\nRealTXPatriot 2 points 6 days ago ....and closing us out.. the fat heffer permalink award report block reply\nCuck_Slayer24 2 points 6 days ago Marco has been the most improved player by far. permalink award report block reply\nTheRPatriot 1 points 6 days ago 🚨 permalink award report block reply\nnemonster 1 points 5 days ago That jeet come bery close to stab him with his phone permalink award report block reply\nRedEnsign4Trump 1 points 6 days ago He used to talk to us akshually 🤓☝️ permalink award report block reply\nthelastlast 1 points 6 days ago listen to the bitter nerd chatter at the end.  i thought high school ended at 18 but the bitter nerds all become reporters and try to ruin everyone else's lives. permalink award report block reply\nmaga_gal2 1 points 6 days ago Seriously, he gets my vote if he runs. Full stop. permalink award report block reply KernalMustard 6 points 6 days ago Demand Better. permalink parent award report block reply grad16uc 4 points 6 days ago I can't believe we're still eating this up. permalink parent award report block reply TheWhitestOfFangs 4 points 6 days ago He's not your ally. He just knows what the appearance of him should be, but he's still a net negative. permalink parent award report block reply makersmarx 4 points 6 days ago He's a snake doing the bidding of our greatest ally. Ill never trust him permalink parent award report block reply TheWhitestOfFangs 1 points 6 days ago He is a snake, but I don't think he is doing anyone's bidding... other than his own bidding. Don't like that either. permalink parent award report block reply makersmarx -2 points 6 days ago Maybe youre right, but the jubios sure do love Rubio! And Bondi permalink parent award report block reply DITTOPatriot 2 points 5 days ago Exactly. permalink parent award report block reply\nKernalMustard 6 points 6 days ago Demand Better. permalink parent award report block reply grad16uc 4 points 6 days ago I can't believe we're still eating this up. permalink parent award report block reply\ngrad16uc 4 points 6 days ago I can't believe we're still eating this up. permalink parent award report block reply\nTheWhitestOfFangs 4 points 6 days ago He's not your ally. He just knows what the appearance of him should be, but he's still a net negative. permalink parent award report block reply makersmarx 4 points 6 days ago He's a snake doing the bidding of our greatest ally. Ill never trust him permalink parent award report block reply TheWhitestOfFangs 1 points 6 days ago He is a snake, but I don't think he is doing anyone's bidding... other than his own bidding. Don't like that either. permalink parent award report block reply makersmarx -2 points 6 days ago Maybe youre right, but the jubios sure do love Rubio! And Bondi permalink parent award report block reply DITTOPatriot 2 points 5 days ago Exactly. permalink parent award report block reply\nmakersmarx 4 points 6 days ago He's a snake doing the bidding of our greatest ally. Ill never trust him permalink parent award report block reply TheWhitestOfFangs 1 points 6 days ago He is a snake, but I don't think he is doing anyone's bidding... other than his own bidding. Don't like that either. permalink parent award report block reply makersmarx -2 points 6 days ago Maybe youre right, but the jubios sure do love Rubio! And Bondi permalink parent award report block reply\nTheWhitestOfFangs 1 points 6 days ago He is a snake, but I don't think he is doing anyone's bidding... other than his own bidding. Don't like that either. permalink parent award report block reply makersmarx -2 points 6 days ago Maybe youre right, but the jubios sure do love Rubio! And Bondi permalink parent award report block reply\nmakersmarx -2 points 6 days ago Maybe youre right, but the jubios sure do love Rubio! And Bondi permalink parent award report block reply\nDITTOPatriot 2 points 5 days ago Exactly. permalink parent award report block reply\nRedeemable 1 points 5 days ago I presume this is the Senste? permalink award report block reply\nkeeman 0 points 6 days ago He's probably late for his appointment with his Zionist masters. permalink award report block reply\nDITTOPatriot 0 points 5 days ago Marco is controlled opposition. permalink award report block reply\nNeverNotTrump -1 points 6 days ago Spoiler Alert: Lil' Marco will sell MAGA downriver the first chance he gets. permalink award report block reply KernalMustard -2 points 6 days ago The cultists will cheer him on till that happens. They will then cry he betrayed us. The rest of us have warned till we are blue in rhe face. They wont listen. permalink parent award report block reply DITTOPatriot 1 points 5 days ago Understand that the cultist aren't real. 90% of the commentors in this forum are sub class 7k club members. permalink parent award report block reply\nKernalMustard -2 points 6 days ago The cultists will cheer him on till that happens. They will then cry he betrayed us. The rest of us have warned till we are blue in rhe face. They wont listen. permalink parent award report block reply DITTOPatriot 1 points 5 days ago Understand that the cultist aren't real. 90% of the commentors in this forum are sub class 7k club members. permalink parent award report block reply\nDITTOPatriot 1 points 5 days ago Understand that the cultist aren't real. 90% of the commentors in this forum are sub class 7k club members. permalink parent award report block reply\nlul_cheto -1 points 6 days ago Rubio is neo con MIGA trash.\nAlways has been.\nAlways will be. permalink award report block reply\nM-m-m-my-corona -1 points 6 days ago OMG so awesome.  OK I agree.  We can die for Israel now permalink award report block reply\nsgttoporbottoms -7 points 6 days ago I believe Rubio to be a neocon who is trying to scam trump into a Venezuela invasion. permalink award report block reply\nUsernameChexOut -25 points 6 days ago Marco Rubio is a swamp creature that is working overtime to derail Trump's presidency, fuck him permalink award report block reply Politoed 21 points 6 days ago What has he done to derail Trump? permalink parent award report block reply NadlersNads -7 points 6 days ago So.many. snakes permalink parent award report block reply\nPolitoed 21 points 6 days ago What has he done to derail Trump? permalink parent award report block reply\nNadlersNads -7 points 6 days ago So.many. snakes permalink parent award report block reply\nFullyDilated 0 points 6 days ago Comment removed by community filter. permalink award report block reply\nFullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nFullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T20:04:38.466006Z"
}