{
  "id": "1ARK0TUbDN",
  "url": "https://patriots.win/p/1ARK0TUbDN/deus-vult/c",
  "content": "389 ✝️⚔️DEUS VULT⚔️✝️ ✝️   UNDER GOD   ✝️ posted 7 days ago by shadypollster 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save RINO_fatigue 21 points 7 days ago Thats overly ambitious, Christendom first needs to assert control over it's homelands in Europe and North America before it can start thinking about expanding. permalink award report block reply staroframphansbhole 6 points 7 days ago It's not expanding it's reclaiming what is ours, especially since Pissfake is the source of the heathen invasion of the West. Thank you, next! permalink parent award report block reply MapleMAGA 9 points 7 days ago More! Lebanon , Iraq, and Syria should be Christian countries too! We need them back! The British and French governments gave them up, but they were not theirs to begin with. permalink award report block reply PensivePatriot 7 points 7 days ago “Your soul is in your keeping alone. Whether they be kings or great rulers of powerful men, when you stand before your maker, you cannot say ‘others told me to do thus,’ or that ‘virtue was not convenient.’” ”This will not suffice.” permalink award report block reply teleomorph 6 points 7 days ago I think the Bible says that doesn't happen untill after the second coming. permalink award report block reply staroframphansbhole 6 points 7 days ago The Bible says that Jesus's kingdom is not of this world so we should kick the Christ-deniers out of physical Palestine now IMO permalink parent award report block reply Shih_Tabed 1 points 7 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Secondrun007 6 points 7 days ago Since Jesus is Jewish, I agree! permalink award report block reply mesba1980 3 points 7 days ago remember, only on his mothers side. permalink parent award report block reply Secondrun007 1 points 1 day ago Actually, his father, Joseph, was Jewish too.  The Holy Spirit transcends your retarded contemplation.  Stop trying to be snarky.  That’s only for the intelligent permalink parent award report block reply Klabusterbaer 2 points 7 days ago Would be intersting to see which of the constantly offended factions would be more offended by this. permalink award report block reply shadypollster OP 2 points 7 days ago Edit your post and report to me after class. permalink parent award report block reply Mhmm2MoreWeeks 2 points 7 days ago This is why Jews hide Nukes in the Desert. permalink award report block reply Ch3f4554551n 2 points 7 days ago Baalist gnostic astrotheologists ruled by egyptians pretend to be Israelites, then Jesus kicks their asses, then a Roman Spy co-opts Christianity to destroy Jewry, then the Emperors graft platonist and pagan DNA into Paul's Christianity to co-opt all western pagan traditions and convert the masses while consolidating power, creating the Catholic Church, then the east and west schism, then Gutenberg, Luther and a British king shatter the papal control, then Jewry infiltrates denominations with Zionism. Egypt - Phonecia - David's Kingdom - Rome - Byzantium - Germany - London - DC - Israel. Thanks, organized religion. permalink award report block reply Duster_340 1 points 7 days ago The dude living at 1600 Pennsylvania ave doesn’t, nor does all of his Judeo Christian friends who are worthless except for doing neocon shit, and killing off our solders for laundring operations. permalink award report block reply GreenLeader1 2 points 7 days ago Comment removed upon the user being banned. permalink award report block reply\nRINO_fatigue 21 points 7 days ago Thats overly ambitious, Christendom first needs to assert control over it's homelands in Europe and North America before it can start thinking about expanding. permalink award report block reply staroframphansbhole 6 points 7 days ago It's not expanding it's reclaiming what is ours, especially since Pissfake is the source of the heathen invasion of the West. Thank you, next! permalink parent award report block reply\nstaroframphansbhole 6 points 7 days ago It's not expanding it's reclaiming what is ours, especially since Pissfake is the source of the heathen invasion of the West. Thank you, next! permalink parent award report block reply\nMapleMAGA 9 points 7 days ago More! Lebanon , Iraq, and Syria should be Christian countries too! We need them back! The British and French governments gave them up, but they were not theirs to begin with. permalink award report block reply\nPensivePatriot 7 points 7 days ago “Your soul is in your keeping alone. Whether they be kings or great rulers of powerful men, when you stand before your maker, you cannot say ‘others told me to do thus,’ or that ‘virtue was not convenient.’” ”This will not suffice.” permalink award report block reply\nteleomorph 6 points 7 days ago I think the Bible says that doesn't happen untill after the second coming. permalink award report block reply staroframphansbhole 6 points 7 days ago The Bible says that Jesus's kingdom is not of this world so we should kick the Christ-deniers out of physical Palestine now IMO permalink parent award report block reply Shih_Tabed 1 points 7 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nstaroframphansbhole 6 points 7 days ago The Bible says that Jesus's kingdom is not of this world so we should kick the Christ-deniers out of physical Palestine now IMO permalink parent award report block reply\nShih_Tabed 1 points 7 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nSecondrun007 6 points 7 days ago Since Jesus is Jewish, I agree! permalink award report block reply mesba1980 3 points 7 days ago remember, only on his mothers side. permalink parent award report block reply Secondrun007 1 points 1 day ago Actually, his father, Joseph, was Jewish too.  The Holy Spirit transcends your retarded contemplation.  Stop trying to be snarky.  That’s only for the intelligent permalink parent award report block reply\nmesba1980 3 points 7 days ago remember, only on his mothers side. permalink parent award report block reply Secondrun007 1 points 1 day ago Actually, his father, Joseph, was Jewish too.  The Holy Spirit transcends your retarded contemplation.  Stop trying to be snarky.  That’s only for the intelligent permalink parent award report block reply\nSecondrun007 1 points 1 day ago Actually, his father, Joseph, was Jewish too.  The Holy Spirit transcends your retarded contemplation.  Stop trying to be snarky.  That’s only for the intelligent permalink parent award report block reply\nKlabusterbaer 2 points 7 days ago Would be intersting to see which of the constantly offended factions would be more offended by this. permalink award report block reply shadypollster OP 2 points 7 days ago Edit your post and report to me after class. permalink parent award report block reply\nshadypollster OP 2 points 7 days ago Edit your post and report to me after class. permalink parent award report block reply\nMhmm2MoreWeeks 2 points 7 days ago This is why Jews hide Nukes in the Desert. permalink award report block reply\nCh3f4554551n 2 points 7 days ago Baalist gnostic astrotheologists ruled by egyptians pretend to be Israelites, then Jesus kicks their asses, then a Roman Spy co-opts Christianity to destroy Jewry, then the Emperors graft platonist and pagan DNA into Paul's Christianity to co-opt all western pagan traditions and convert the masses while consolidating power, creating the Catholic Church, then the east and west schism, then Gutenberg, Luther and a British king shatter the papal control, then Jewry infiltrates denominations with Zionism. Egypt - Phonecia - David's Kingdom - Rome - Byzantium - Germany - London - DC - Israel. Thanks, organized religion. permalink award report block reply\nDuster_340 1 points 7 days ago The dude living at 1600 Pennsylvania ave doesn’t, nor does all of his Judeo Christian friends who are worthless except for doing neocon shit, and killing off our solders for laundring operations. permalink award report block reply\nGreenLeader1 2 points 7 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:08:49.365463Z"
}