{
  "id": "1ARK57r8EC",
  "url": "https://patriots.win/p/1ARK57r8EC/go-back-and-fix-your-own-shithol/c",
  "content": "968 Go back and fix your own shithole instead of running here (www.cbsnews.com) posted 4 days ago by South_Florida_Guy 83 comments award share report block Over 250,000 Venezuelans in U.S., including thousands in South Florida, to lose Temporary Protected Status For the past several years, many Venezuelans have been shielded by TPS, a federal program that allows migrants from unstable countries to live and work legally in the U.S. www.cbsnews.com\n83 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style TrumpYouMagaFrenner 69 points 4 days ago Get the fuck out of my country permalink award report block reply PoleWatcher 39 points 4 days ago I am so tired of all these people, every single one. permalink parent award report block reply South_Florida_Guy OP 29 points 4 days ago The endless browning of America permalink parent award report block reply NomadicKrow2 13 points 4 days ago The rolling brown out, if you will. permalink parent award report block reply imnotdeadyet 8 points 4 days ago I would like to know what their definition of an \"unstable countries\" is because I would think American would qualify right now. permalink parent award report block reply 5DchessWatch 2 points 4 days ago browneye of providence of the shrilluminateye permalink parent award report block reply Valiazaner 2 points 4 days ago stop thinking of them as people. They are not people. They are demons. permalink parent award report block reply South_Florida_Guy OP 42 points 4 days ago We're not the world's dumping ground for all of the world's problems. These free loaders want to abandon the ship they built and then expect us to take care of them and then whine and cry when we say enough is enough. So sick of it. permalink award report block reply TheMostUselessFeeder 19 points 4 days ago I just want to know when we can do this to other countries. I know euro idiots will be like MUH AMERICAN WARS etc, but like, when do we get to ship millions of people to say, China, and then start demanding they tailor their entire national culture to us and riot over muh racism and gibs and stuff? 🤔 Why is it always America? permalink parent award report block reply Viewer01 15 points 4 days ago No. You misunderstand. They want to burn the constitution and they want in the pyre. For no other reason than you’re white and Christian. They will destroy this country. Sift the ashes and then go home. Like any good invader would. permalink parent award report block reply NomadicKrow2 1 points 4 days ago Jesus and Moses defeated the Romans with AK47's and hand grenades. We can learn by his Godly example. permalink parent award report block reply slimcoat 3 points 4 days ago Sounds like an amazing plot for a movie. permalink parent award report block reply terribletwos 9 points 4 days ago You get one, then you get 10 you get ten you get 100, you get 100 you 100,000. The gentlemen's agreement no longer stands. There's no compromising our way out of the problem. permalink parent award report block reply South_Florida_Guy OP 9 points 4 days ago Even worse with the street shitting dot heads that are all turning up down here too now permalink parent award report block reply NomadicKrow2 4 points 4 days ago I think Bill Clinton was the major architect of turning the US into the world's police on a much larger scale than we'd known previously. I base this on a political cartoon I saw as a kid, so I could be wrong, but it was a bunch of fire hoses with country names, and a donkey hooking them up to a hydrant with \"USA\" on it, and Bill turning the wrench to make the water (money) flow. permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago The same people that abort their children also force you to pay for a foreign adult invader as if it were your child. permalink parent award report block reply JayKay1776 18 points 4 days ago President Trump has no allegiance to any foreign fucking country you dumb fucking bitch. God damn right he fucking betrayed Venezuelans he's a fuck about Venezuelans we're trying to bomb the fuck out of him right now. Personally I think if we bomb the country we shouldn't allow the people in from that country especially goes for Afghan Somalians Ethiopian fucking Iraqis any kind of Muslim. permalink award report block reply TrumpIsTheVictor 1 points 4 days ago He only has allegiance to Israel. As their needs are his needs. permalink parent award report block reply PoopJeet 3 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply suckmycorona 13 points 4 days ago Go make Venezuela mediocre again. permalink award report block reply Pnw4gotpwd 8 points 4 days ago Venezuela WAS a first world country, until they elected hugo chavez. I have a good deal if sympathy for those who the government there was actually oppressing, AND a degree of sympathy for people suffering economically due to commie shit policies. But the ones who wanna come here and be socialists / communists, and get an entitled attitude need to be kicked the fuck out permalink parent award report block reply Speedgraphic69 12 points 4 days ago Send their asses down the road now. permalink award report block reply BruddahIz 6 points 4 days ago First can they pickup a free AR and 1000 rounds of ammo before going back. permalink parent award report block reply Viewer01 3 points 4 days ago I think we’re six months and a brown riot away for even the staunchest boomer with a black friend starts connecting the dots on race and culture. permalink parent award report block reply FusionBlack 9 points 4 days ago Time to deport and close all immigration for at least 10 years. H1bs ,students  ,you name it shut it down. Its the only way to slow this curve. permalink award report block reply Alphahorizon 9 points 4 days ago Take this as you may, I made an observation decades ago that if these people were/are unwilling to fix the issues in their own countries what chance would we have of them actually being loyal to our nation? permalink award report block reply Zskills 9 points 4 days ago You're touching on \"magic dirt theory\".  It's a fantastical liberal idea that once you take 3rd worlders and put them on American soil they magically become integrated into our value system and culture and become productive citizens.  There is absolutely zero reason to suspect that this would be the case. permalink parent award report block reply South_Florida_Guy OP 6 points 4 days ago Not only that look how quickly they start spitting vitriol at Trump when they don't get what they want. permalink parent award report block reply Counterwhat 8 points 4 days ago If they don't come here legally, they shouldn't be here. No one is exempt. permalink award report block reply Zskills 6 points 4 days ago Even if they came here legally, they need to leave. permalink parent award report block reply Live_free_or_die_55 8 points 4 days ago The same thing with the newyorkers!\nThey fucked up their city and now leaving for Florida and Texas. They should not be allowed to leave their shithole city. Eat your own shit what you created. permalink award report block reply thisisatestof2 4 points 4 days ago A relative of mine came here from Venezuela sometime in the early 80s   When they did, they learned English, assimilated to the culture and became a productive member of society.   When they first got here, they were on some government assistance for like six months just to get themselves on their feet. Ever since then, they’ve held a good job that provides for themselves and their family. permalink award report block reply donteatthat 4 points 4 days ago GTFO OUT NOW. YOU ARE NOT WANTED permalink award report block reply mailinvoter 4 points 4 days ago But the socialist commies already won in their shit holes. They come here for the better life our country provides and to destroy it. permalink award report block reply spezisacuckold 4 points 4 days ago This is what I voted for! permalink award report block reply redditadminssuckit 4 points 4 days ago Notice that sign that says \"Trump betrays Venezuelans\"? So the refugees are VOTING? permalink award report block reply altYPNeT 2 points 4 days ago At least its written in English permalink parent award report block reply MajorClark 4 points 4 days ago Sick of all these foreigners coming to the United States making demands from the government and watching corrupt coward politicians stealing US tax payer money to support them!   Deport them all back to the shit hole they came from.  Congress allowed these  leeches to use & abuse Americans for to long. permalink award report block reply AstroLonghorn 4 points 4 days ago Betrays Venezuelans? He never promised you shit to begin with you Chavez lovers 😂 permalink award report block reply Beaner78 4 points 4 days ago Fuck em, get the fuck out. permalink award report block reply Bisque 3 points 4 days ago the solution is simple. Go back to Venezuela permalink award report block reply knnbccb 3 points 4 days ago Keyword is 'temporary'. Once Maduro is dead and his regime annihilated, there is no point receiving 'protection'. permalink award report block reply LightBeacons 3 points 4 days ago hmmm, all those years and years  here in America, but never applied for nateralized citizenship??? Stupid is, stupid does. Get out now voluntarily or be deported by  ICE. You knew this day was coming. No sympathy at all. Buh-bye! permalink award report block reply Retardloserimsogay 3 points 4 days ago 250k is quite the force, if they ever have a chance to fix Venezuela... it's now. Adios fags. permalink award report block reply budgsxr 3 points 4 days ago I am sick and tired of those assholes from South America coming here and demanding free shit. Go the fuck home you useless fucks! permalink award report block reply airborne3502 2 points 4 days ago Oh no, anyway... permalink award report block reply NoMoreShinesBilly 2 points 4 days ago is that all??? permalink award report block reply henri_derelicte 2 points 4 days ago One of the benefits of a regime change operation in Venezuela is that we can summarily deport them. We can use the conflict as a justification to make them GTFO permalink award report block reply South_Florida_Guy OP 6 points 4 days ago We can do that right now regardless of feelings permalink parent award report block reply Crappydatum 2 points 4 days ago They're not voting themselves free in Venezuela and we're lot letting them vote is into slavery here permalink award report block reply awsure 2 points 4 days ago Send em all to Mexico. They are all H1-Beaners now! permalink award report block reply JoinTheDiscussion 2 points 4 days ago Send them home with crates of guns.. permalink award report block reply 5DchessWatch 1 points 4 days ago ZZARDOZZ permalink parent award report block reply SoulSnipper 2 points 4 days ago A mis amigos venezolanos. Hasta luego y gracias por todas las arepas, no tanto por las violaciones y el TdA. permalink award report block reply pedewithweed 2 points 4 days ago Ah fiddle sticks. Maybe they should self deport. 😊 permalink award report block reply 5DchessWatch 2 points 4 days ago We'll even pay you once you get there and sign a legal document that says you agree to be executed if you come back to america for more than a vacation Then you can rebuild your shithole with what was once USAID money that was recycled back to democrats that you weren't getting then anyway...now you actually get that money and you can build a school.  But you wont That's why we're sending in bechtel to build your solar farm and your school. Because you guys are failures.  Here's some peanut butter and blankets.  Sit this one out and let us train your children on how not to be better country infiltrating shithole excrempatriots permalink award report block reply mohel 2 points 4 days ago Protected status? We are a ZOO permalink award report block reply YaharaRiver 1 points 4 days ago Best comment. 👍 permalink parent award report block reply SmokeyAF 1 points 4 days ago Sone of them are the anti-commie exiles. permalink award report block reply South_Florida_Guy OP 0 points 4 days ago That's great then they can go home and fight them permalink parent award report block reply Liberats 1 points 4 days ago Go and turf Maduro out of office. permalink award report block reply SimaYi 1 points 4 days ago GO HOME. permalink award report block reply SavingPrivateGrace 1 points 4 days ago Now they get to apply for asylum.  A lengthy process that can take up to 10 years. permalink award report block reply Michalusmichalus 1 points 4 days ago This is a bad article. First it says they become undocumented. Lower down an attorney says they are on a one year timer to file for asylum. Which is it? Am I expected to care enough to do homework? permalink award report block reply Trajano 3 points 4 days ago The article is correct. Once the status expires, they will have no work authorization and will need to leave. If they stay, they are here illegally and can be deported. If they file for asylum, they will remain legally in the country until their claim is processed and an immigration officer or judge rules on whether to approve or reject their asylum application. The twist  is that processing an asylum application takes U.S immigration a very long time because of Biden's open border policies, which have overflowed the system and created a huge backlog: \"The average wait time for cases in front of the Executive Office for Immigration Review (EOIR) is approximately 4.3 years, with some courts, such as the one in Omaha, Nebraska, reporting wait times approaching 6 years.\nIn some instances, cases may extend beyond 10 years due to the large number of pending cases—over 1 million as of recent data—with an average wait time of more than 1,364 days for those granted asylum in FY 2023.\" During that time, the applicants will receive a work authorization and a legal status to remain in the country until their asylum claims are resolved. The lawyer in the article speculates that they have a full year to apply (it may be true or not), but until they file the claim,  they are here illegally. Full disclaimer, I am not an immigration lawyer, but someone with more knowledge than I has explained the whole process to me. permalink parent award report block reply Michalusmichalus 2 points 4 days ago Thanks for the details. permalink parent award report block reply stillbringingitback 1 points 4 days ago Venezuelans are, IMO, some of the more deserving refugees.  Obviously way way behind South African whites, but still better than black Africans or Middle Easterners. permalink award report block reply henri_derelicte 7 points 4 days ago Maduro is a bad hombre and needs to go down, but there’s several countries along the way that should be taking in Venezuelans seeking asylum before the US. permalink parent award report block reply JoinTheDiscussion 5 points 4 days ago They only come directly here for gibmedats and to make anchor babies permalink parent award report block reply stillbringingitback 2 points 4 days ago Agreed permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago Let them go to Colombia instead they're made for each other permalink parent award report block reply South_Florida_Guy OP 2 points 4 days ago Yeah I get that but we're full and we have our own problems to deal with. Also these people have driven up housing costs to an extreme level down here. Time to tell people no. permalink parent award report block reply stillbringingitback 1 points 4 days ago Ya, I agree Pede. permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago I've seen so many of them driving around with sos Venezuela written on their vehicles but never one had sos America when the illegal Biden regime took over and was in charge permalink parent award report block reply RagnarD 1 points 4 days ago There are 11 other countries in South America, and more in Central America, where they can seek refuge. permalink award report block reply SocraticMethod1 1 points 4 days ago At least the South Vietnamese and Cubans fought first. ....they lost but they came to America VERY anti commie if looking at voting patterns. permalink award report block reply WarEagleMAGA 0 points 4 days ago The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants. It is its natural manure.  Time to shed some blood hector. permalink award report block reply AngryPoop -1 points 4 days ago So how does this differ from the people leaving California, NY, and Illinois? They're leaving to a better area for their family. Granted its leaving a country instead of a state. But people are daily leaving blue states for red and not staying and fixing their own shithole permalink award report block reply South_Florida_Guy OP 5 points 4 days ago It doesn't. I have the same attitude for them. We're full. Stay out, stay where you are or go back and fix your own problems, stop bringing them here. permalink parent award report block reply anishr -4 points 4 days ago How does this differ from what your ancestors did to come here? permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago Fuck off permalink parent award report block reply anishr -3 points 4 days ago You first. permalink parent award report block reply\nTrumpYouMagaFrenner 69 points 4 days ago Get the fuck out of my country permalink award report block reply PoleWatcher 39 points 4 days ago I am so tired of all these people, every single one. permalink parent award report block reply South_Florida_Guy OP 29 points 4 days ago The endless browning of America permalink parent award report block reply NomadicKrow2 13 points 4 days ago The rolling brown out, if you will. permalink parent award report block reply imnotdeadyet 8 points 4 days ago I would like to know what their definition of an \"unstable countries\" is because I would think American would qualify right now. permalink parent award report block reply 5DchessWatch 2 points 4 days ago browneye of providence of the shrilluminateye permalink parent award report block reply Valiazaner 2 points 4 days ago stop thinking of them as people. They are not people. They are demons. permalink parent award report block reply\nPoleWatcher 39 points 4 days ago I am so tired of all these people, every single one. permalink parent award report block reply South_Florida_Guy OP 29 points 4 days ago The endless browning of America permalink parent award report block reply NomadicKrow2 13 points 4 days ago The rolling brown out, if you will. permalink parent award report block reply imnotdeadyet 8 points 4 days ago I would like to know what their definition of an \"unstable countries\" is because I would think American would qualify right now. permalink parent award report block reply 5DchessWatch 2 points 4 days ago browneye of providence of the shrilluminateye permalink parent award report block reply Valiazaner 2 points 4 days ago stop thinking of them as people. They are not people. They are demons. permalink parent award report block reply\nSouth_Florida_Guy OP 29 points 4 days ago The endless browning of America permalink parent award report block reply NomadicKrow2 13 points 4 days ago The rolling brown out, if you will. permalink parent award report block reply imnotdeadyet 8 points 4 days ago I would like to know what their definition of an \"unstable countries\" is because I would think American would qualify right now. permalink parent award report block reply 5DchessWatch 2 points 4 days ago browneye of providence of the shrilluminateye permalink parent award report block reply\nNomadicKrow2 13 points 4 days ago The rolling brown out, if you will. permalink parent award report block reply\nimnotdeadyet 8 points 4 days ago I would like to know what their definition of an \"unstable countries\" is because I would think American would qualify right now. permalink parent award report block reply\n5DchessWatch 2 points 4 days ago browneye of providence of the shrilluminateye permalink parent award report block reply\nValiazaner 2 points 4 days ago stop thinking of them as people. They are not people. They are demons. permalink parent award report block reply\nSouth_Florida_Guy OP 42 points 4 days ago We're not the world's dumping ground for all of the world's problems. These free loaders want to abandon the ship they built and then expect us to take care of them and then whine and cry when we say enough is enough. So sick of it. permalink award report block reply TheMostUselessFeeder 19 points 4 days ago I just want to know when we can do this to other countries. I know euro idiots will be like MUH AMERICAN WARS etc, but like, when do we get to ship millions of people to say, China, and then start demanding they tailor their entire national culture to us and riot over muh racism and gibs and stuff? 🤔 Why is it always America? permalink parent award report block reply Viewer01 15 points 4 days ago No. You misunderstand. They want to burn the constitution and they want in the pyre. For no other reason than you’re white and Christian. They will destroy this country. Sift the ashes and then go home. Like any good invader would. permalink parent award report block reply NomadicKrow2 1 points 4 days ago Jesus and Moses defeated the Romans with AK47's and hand grenades. We can learn by his Godly example. permalink parent award report block reply slimcoat 3 points 4 days ago Sounds like an amazing plot for a movie. permalink parent award report block reply terribletwos 9 points 4 days ago You get one, then you get 10 you get ten you get 100, you get 100 you 100,000. The gentlemen's agreement no longer stands. There's no compromising our way out of the problem. permalink parent award report block reply South_Florida_Guy OP 9 points 4 days ago Even worse with the street shitting dot heads that are all turning up down here too now permalink parent award report block reply NomadicKrow2 4 points 4 days ago I think Bill Clinton was the major architect of turning the US into the world's police on a much larger scale than we'd known previously. I base this on a political cartoon I saw as a kid, so I could be wrong, but it was a bunch of fire hoses with country names, and a donkey hooking them up to a hydrant with \"USA\" on it, and Bill turning the wrench to make the water (money) flow. permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago The same people that abort their children also force you to pay for a foreign adult invader as if it were your child. permalink parent award report block reply\nTheMostUselessFeeder 19 points 4 days ago I just want to know when we can do this to other countries. I know euro idiots will be like MUH AMERICAN WARS etc, but like, when do we get to ship millions of people to say, China, and then start demanding they tailor their entire national culture to us and riot over muh racism and gibs and stuff? 🤔 Why is it always America? permalink parent award report block reply\nViewer01 15 points 4 days ago No. You misunderstand. They want to burn the constitution and they want in the pyre. For no other reason than you’re white and Christian. They will destroy this country. Sift the ashes and then go home. Like any good invader would. permalink parent award report block reply NomadicKrow2 1 points 4 days ago Jesus and Moses defeated the Romans with AK47's and hand grenades. We can learn by his Godly example. permalink parent award report block reply slimcoat 3 points 4 days ago Sounds like an amazing plot for a movie. permalink parent award report block reply\nNomadicKrow2 1 points 4 days ago Jesus and Moses defeated the Romans with AK47's and hand grenades. We can learn by his Godly example. permalink parent award report block reply slimcoat 3 points 4 days ago Sounds like an amazing plot for a movie. permalink parent award report block reply\nslimcoat 3 points 4 days ago Sounds like an amazing plot for a movie. permalink parent award report block reply\nterribletwos 9 points 4 days ago You get one, then you get 10 you get ten you get 100, you get 100 you 100,000. The gentlemen's agreement no longer stands. There's no compromising our way out of the problem. permalink parent award report block reply South_Florida_Guy OP 9 points 4 days ago Even worse with the street shitting dot heads that are all turning up down here too now permalink parent award report block reply\nSouth_Florida_Guy OP 9 points 4 days ago Even worse with the street shitting dot heads that are all turning up down here too now permalink parent award report block reply\nNomadicKrow2 4 points 4 days ago I think Bill Clinton was the major architect of turning the US into the world's police on a much larger scale than we'd known previously. I base this on a political cartoon I saw as a kid, so I could be wrong, but it was a bunch of fire hoses with country names, and a donkey hooking them up to a hydrant with \"USA\" on it, and Bill turning the wrench to make the water (money) flow. permalink parent award report block reply\nTrumpAndGodWin 1 points 4 days ago The same people that abort their children also force you to pay for a foreign adult invader as if it were your child. permalink parent award report block reply\nJayKay1776 18 points 4 days ago President Trump has no allegiance to any foreign fucking country you dumb fucking bitch. God damn right he fucking betrayed Venezuelans he's a fuck about Venezuelans we're trying to bomb the fuck out of him right now. Personally I think if we bomb the country we shouldn't allow the people in from that country especially goes for Afghan Somalians Ethiopian fucking Iraqis any kind of Muslim. permalink award report block reply TrumpIsTheVictor 1 points 4 days ago He only has allegiance to Israel. As their needs are his needs. permalink parent award report block reply PoopJeet 3 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTrumpIsTheVictor 1 points 4 days ago He only has allegiance to Israel. As their needs are his needs. permalink parent award report block reply PoopJeet 3 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nPoopJeet 3 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nsuckmycorona 13 points 4 days ago Go make Venezuela mediocre again. permalink award report block reply Pnw4gotpwd 8 points 4 days ago Venezuela WAS a first world country, until they elected hugo chavez. I have a good deal if sympathy for those who the government there was actually oppressing, AND a degree of sympathy for people suffering economically due to commie shit policies. But the ones who wanna come here and be socialists / communists, and get an entitled attitude need to be kicked the fuck out permalink parent award report block reply\nPnw4gotpwd 8 points 4 days ago Venezuela WAS a first world country, until they elected hugo chavez. I have a good deal if sympathy for those who the government there was actually oppressing, AND a degree of sympathy for people suffering economically due to commie shit policies. But the ones who wanna come here and be socialists / communists, and get an entitled attitude need to be kicked the fuck out permalink parent award report block reply\nSpeedgraphic69 12 points 4 days ago Send their asses down the road now. permalink award report block reply BruddahIz 6 points 4 days ago First can they pickup a free AR and 1000 rounds of ammo before going back. permalink parent award report block reply Viewer01 3 points 4 days ago I think we’re six months and a brown riot away for even the staunchest boomer with a black friend starts connecting the dots on race and culture. permalink parent award report block reply\nBruddahIz 6 points 4 days ago First can they pickup a free AR and 1000 rounds of ammo before going back. permalink parent award report block reply\nViewer01 3 points 4 days ago I think we’re six months and a brown riot away for even the staunchest boomer with a black friend starts connecting the dots on race and culture. permalink parent award report block reply\nFusionBlack 9 points 4 days ago Time to deport and close all immigration for at least 10 years. H1bs ,students  ,you name it shut it down. Its the only way to slow this curve. permalink award report block reply\nAlphahorizon 9 points 4 days ago Take this as you may, I made an observation decades ago that if these people were/are unwilling to fix the issues in their own countries what chance would we have of them actually being loyal to our nation? permalink award report block reply Zskills 9 points 4 days ago You're touching on \"magic dirt theory\".  It's a fantastical liberal idea that once you take 3rd worlders and put them on American soil they magically become integrated into our value system and culture and become productive citizens.  There is absolutely zero reason to suspect that this would be the case. permalink parent award report block reply South_Florida_Guy OP 6 points 4 days ago Not only that look how quickly they start spitting vitriol at Trump when they don't get what they want. permalink parent award report block reply\nZskills 9 points 4 days ago You're touching on \"magic dirt theory\".  It's a fantastical liberal idea that once you take 3rd worlders and put them on American soil they magically become integrated into our value system and culture and become productive citizens.  There is absolutely zero reason to suspect that this would be the case. permalink parent award report block reply\nSouth_Florida_Guy OP 6 points 4 days ago Not only that look how quickly they start spitting vitriol at Trump when they don't get what they want. permalink parent award report block reply\nCounterwhat 8 points 4 days ago If they don't come here legally, they shouldn't be here. No one is exempt. permalink award report block reply Zskills 6 points 4 days ago Even if they came here legally, they need to leave. permalink parent award report block reply\nZskills 6 points 4 days ago Even if they came here legally, they need to leave. permalink parent award report block reply\nLive_free_or_die_55 8 points 4 days ago The same thing with the newyorkers!\nThey fucked up their city and now leaving for Florida and Texas. They should not be allowed to leave their shithole city. Eat your own shit what you created. permalink award report block reply\nthisisatestof2 4 points 4 days ago A relative of mine came here from Venezuela sometime in the early 80s   When they did, they learned English, assimilated to the culture and became a productive member of society.   When they first got here, they were on some government assistance for like six months just to get themselves on their feet. Ever since then, they’ve held a good job that provides for themselves and their family. permalink award report block reply\ndonteatthat 4 points 4 days ago GTFO OUT NOW. YOU ARE NOT WANTED permalink award report block reply\nmailinvoter 4 points 4 days ago But the socialist commies already won in their shit holes. They come here for the better life our country provides and to destroy it. permalink award report block reply\nspezisacuckold 4 points 4 days ago This is what I voted for! permalink award report block reply\nredditadminssuckit 4 points 4 days ago Notice that sign that says \"Trump betrays Venezuelans\"? So the refugees are VOTING? permalink award report block reply altYPNeT 2 points 4 days ago At least its written in English permalink parent award report block reply\naltYPNeT 2 points 4 days ago At least its written in English permalink parent award report block reply\nMajorClark 4 points 4 days ago Sick of all these foreigners coming to the United States making demands from the government and watching corrupt coward politicians stealing US tax payer money to support them!   Deport them all back to the shit hole they came from.  Congress allowed these  leeches to use & abuse Americans for to long. permalink award report block reply\nAstroLonghorn 4 points 4 days ago Betrays Venezuelans? He never promised you shit to begin with you Chavez lovers 😂 permalink award report block reply\nBeaner78 4 points 4 days ago Fuck em, get the fuck out. permalink award report block reply\nBisque 3 points 4 days ago the solution is simple. Go back to Venezuela permalink award report block reply\nknnbccb 3 points 4 days ago Keyword is 'temporary'. Once Maduro is dead and his regime annihilated, there is no point receiving 'protection'. permalink award report block reply\nLightBeacons 3 points 4 days ago hmmm, all those years and years  here in America, but never applied for nateralized citizenship??? Stupid is, stupid does. Get out now voluntarily or be deported by  ICE. You knew this day was coming. No sympathy at all. Buh-bye! permalink award report block reply\nRetardloserimsogay 3 points 4 days ago 250k is quite the force, if they ever have a chance to fix Venezuela... it's now. Adios fags. permalink award report block reply\nbudgsxr 3 points 4 days ago I am sick and tired of those assholes from South America coming here and demanding free shit. Go the fuck home you useless fucks! permalink award report block reply\nairborne3502 2 points 4 days ago Oh no, anyway... permalink award report block reply\nNoMoreShinesBilly 2 points 4 days ago is that all??? permalink award report block reply\nhenri_derelicte 2 points 4 days ago One of the benefits of a regime change operation in Venezuela is that we can summarily deport them. We can use the conflict as a justification to make them GTFO permalink award report block reply South_Florida_Guy OP 6 points 4 days ago We can do that right now regardless of feelings permalink parent award report block reply\nSouth_Florida_Guy OP 6 points 4 days ago We can do that right now regardless of feelings permalink parent award report block reply\nCrappydatum 2 points 4 days ago They're not voting themselves free in Venezuela and we're lot letting them vote is into slavery here permalink award report block reply\nawsure 2 points 4 days ago Send em all to Mexico. They are all H1-Beaners now! permalink award report block reply\nJoinTheDiscussion 2 points 4 days ago Send them home with crates of guns.. permalink award report block reply 5DchessWatch 1 points 4 days ago ZZARDOZZ permalink parent award report block reply\n5DchessWatch 1 points 4 days ago ZZARDOZZ permalink parent award report block reply\nSoulSnipper 2 points 4 days ago A mis amigos venezolanos. Hasta luego y gracias por todas las arepas, no tanto por las violaciones y el TdA. permalink award report block reply\npedewithweed 2 points 4 days ago Ah fiddle sticks. Maybe they should self deport. 😊 permalink award report block reply\n5DchessWatch 2 points 4 days ago We'll even pay you once you get there and sign a legal document that says you agree to be executed if you come back to america for more than a vacation Then you can rebuild your shithole with what was once USAID money that was recycled back to democrats that you weren't getting then anyway...now you actually get that money and you can build a school.  But you wont That's why we're sending in bechtel to build your solar farm and your school. Because you guys are failures.  Here's some peanut butter and blankets.  Sit this one out and let us train your children on how not to be better country infiltrating shithole excrempatriots permalink award report block reply\nmohel 2 points 4 days ago Protected status? We are a ZOO permalink award report block reply YaharaRiver 1 points 4 days ago Best comment. 👍 permalink parent award report block reply\nYaharaRiver 1 points 4 days ago Best comment. 👍 permalink parent award report block reply\nSmokeyAF 1 points 4 days ago Sone of them are the anti-commie exiles. permalink award report block reply South_Florida_Guy OP 0 points 4 days ago That's great then they can go home and fight them permalink parent award report block reply\nSouth_Florida_Guy OP 0 points 4 days ago That's great then they can go home and fight them permalink parent award report block reply\nLiberats 1 points 4 days ago Go and turf Maduro out of office. permalink award report block reply\nSimaYi 1 points 4 days ago GO HOME. permalink award report block reply\nSavingPrivateGrace 1 points 4 days ago Now they get to apply for asylum.  A lengthy process that can take up to 10 years. permalink award report block reply\nMichalusmichalus 1 points 4 days ago This is a bad article. First it says they become undocumented. Lower down an attorney says they are on a one year timer to file for asylum. Which is it? Am I expected to care enough to do homework? permalink award report block reply Trajano 3 points 4 days ago The article is correct. Once the status expires, they will have no work authorization and will need to leave. If they stay, they are here illegally and can be deported. If they file for asylum, they will remain legally in the country until their claim is processed and an immigration officer or judge rules on whether to approve or reject their asylum application. The twist  is that processing an asylum application takes U.S immigration a very long time because of Biden's open border policies, which have overflowed the system and created a huge backlog: \"The average wait time for cases in front of the Executive Office for Immigration Review (EOIR) is approximately 4.3 years, with some courts, such as the one in Omaha, Nebraska, reporting wait times approaching 6 years.\nIn some instances, cases may extend beyond 10 years due to the large number of pending cases—over 1 million as of recent data—with an average wait time of more than 1,364 days for those granted asylum in FY 2023.\" During that time, the applicants will receive a work authorization and a legal status to remain in the country until their asylum claims are resolved. The lawyer in the article speculates that they have a full year to apply (it may be true or not), but until they file the claim,  they are here illegally. Full disclaimer, I am not an immigration lawyer, but someone with more knowledge than I has explained the whole process to me. permalink parent award report block reply Michalusmichalus 2 points 4 days ago Thanks for the details. permalink parent award report block reply\nTrajano 3 points 4 days ago The article is correct. Once the status expires, they will have no work authorization and will need to leave. If they stay, they are here illegally and can be deported. If they file for asylum, they will remain legally in the country until their claim is processed and an immigration officer or judge rules on whether to approve or reject their asylum application. The twist  is that processing an asylum application takes U.S immigration a very long time because of Biden's open border policies, which have overflowed the system and created a huge backlog: \"The average wait time for cases in front of the Executive Office for Immigration Review (EOIR) is approximately 4.3 years, with some courts, such as the one in Omaha, Nebraska, reporting wait times approaching 6 years.\nIn some instances, cases may extend beyond 10 years due to the large number of pending cases—over 1 million as of recent data—with an average wait time of more than 1,364 days for those granted asylum in FY 2023.\" During that time, the applicants will receive a work authorization and a legal status to remain in the country until their asylum claims are resolved. The lawyer in the article speculates that they have a full year to apply (it may be true or not), but until they file the claim,  they are here illegally. Full disclaimer, I am not an immigration lawyer, but someone with more knowledge than I has explained the whole process to me. permalink parent award report block reply Michalusmichalus 2 points 4 days ago Thanks for the details. permalink parent award report block reply\nMichalusmichalus 2 points 4 days ago Thanks for the details. permalink parent award report block reply\nstillbringingitback 1 points 4 days ago Venezuelans are, IMO, some of the more deserving refugees.  Obviously way way behind South African whites, but still better than black Africans or Middle Easterners. permalink award report block reply henri_derelicte 7 points 4 days ago Maduro is a bad hombre and needs to go down, but there’s several countries along the way that should be taking in Venezuelans seeking asylum before the US. permalink parent award report block reply JoinTheDiscussion 5 points 4 days ago They only come directly here for gibmedats and to make anchor babies permalink parent award report block reply stillbringingitback 2 points 4 days ago Agreed permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago Let them go to Colombia instead they're made for each other permalink parent award report block reply South_Florida_Guy OP 2 points 4 days ago Yeah I get that but we're full and we have our own problems to deal with. Also these people have driven up housing costs to an extreme level down here. Time to tell people no. permalink parent award report block reply stillbringingitback 1 points 4 days ago Ya, I agree Pede. permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago I've seen so many of them driving around with sos Venezuela written on their vehicles but never one had sos America when the illegal Biden regime took over and was in charge permalink parent award report block reply\nhenri_derelicte 7 points 4 days ago Maduro is a bad hombre and needs to go down, but there’s several countries along the way that should be taking in Venezuelans seeking asylum before the US. permalink parent award report block reply JoinTheDiscussion 5 points 4 days ago They only come directly here for gibmedats and to make anchor babies permalink parent award report block reply stillbringingitback 2 points 4 days ago Agreed permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago Let them go to Colombia instead they're made for each other permalink parent award report block reply\nJoinTheDiscussion 5 points 4 days ago They only come directly here for gibmedats and to make anchor babies permalink parent award report block reply\nstillbringingitback 2 points 4 days ago Agreed permalink parent award report block reply\nSouth_Florida_Guy OP 1 points 4 days ago Let them go to Colombia instead they're made for each other permalink parent award report block reply\nSouth_Florida_Guy OP 2 points 4 days ago Yeah I get that but we're full and we have our own problems to deal with. Also these people have driven up housing costs to an extreme level down here. Time to tell people no. permalink parent award report block reply stillbringingitback 1 points 4 days ago Ya, I agree Pede. permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago I've seen so many of them driving around with sos Venezuela written on their vehicles but never one had sos America when the illegal Biden regime took over and was in charge permalink parent award report block reply\nstillbringingitback 1 points 4 days ago Ya, I agree Pede. permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago I've seen so many of them driving around with sos Venezuela written on their vehicles but never one had sos America when the illegal Biden regime took over and was in charge permalink parent award report block reply\nSouth_Florida_Guy OP 1 points 4 days ago I've seen so many of them driving around with sos Venezuela written on their vehicles but never one had sos America when the illegal Biden regime took over and was in charge permalink parent award report block reply\nRagnarD 1 points 4 days ago There are 11 other countries in South America, and more in Central America, where they can seek refuge. permalink award report block reply\nSocraticMethod1 1 points 4 days ago At least the South Vietnamese and Cubans fought first. ....they lost but they came to America VERY anti commie if looking at voting patterns. permalink award report block reply\nWarEagleMAGA 0 points 4 days ago The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants. It is its natural manure.  Time to shed some blood hector. permalink award report block reply\nAngryPoop -1 points 4 days ago So how does this differ from the people leaving California, NY, and Illinois? They're leaving to a better area for their family. Granted its leaving a country instead of a state. But people are daily leaving blue states for red and not staying and fixing their own shithole permalink award report block reply South_Florida_Guy OP 5 points 4 days ago It doesn't. I have the same attitude for them. We're full. Stay out, stay where you are or go back and fix your own problems, stop bringing them here. permalink parent award report block reply anishr -4 points 4 days ago How does this differ from what your ancestors did to come here? permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago Fuck off permalink parent award report block reply anishr -3 points 4 days ago You first. permalink parent award report block reply\nSouth_Florida_Guy OP 5 points 4 days ago It doesn't. I have the same attitude for them. We're full. Stay out, stay where you are or go back and fix your own problems, stop bringing them here. permalink parent award report block reply anishr -4 points 4 days ago How does this differ from what your ancestors did to come here? permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago Fuck off permalink parent award report block reply anishr -3 points 4 days ago You first. permalink parent award report block reply\nanishr -4 points 4 days ago How does this differ from what your ancestors did to come here? permalink parent award report block reply South_Florida_Guy OP 1 points 4 days ago Fuck off permalink parent award report block reply anishr -3 points 4 days ago You first. permalink parent award report block reply\nSouth_Florida_Guy OP 1 points 4 days ago Fuck off permalink parent award report block reply anishr -3 points 4 days ago You first. permalink parent award report block reply\nanishr -3 points 4 days ago You first. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:17:26.014271Z"
}