{
  "id": "1ARK51321K",
  "url": "https://patriots.win/p/1ARK51321K/tommy-robinson-\n\na-ladys-airbnb-/c",
  "content": "489 Tommy Robinson 🇬🇧\n:\nA lady's Airbnb was used by 20 men(no prizes for what kind of \"men\")\n\nWho had 14yr old girls in the property.\n\nThe lady reported all this to police, they also destroyed her belongings. \n\nThe police ignored her and told her to drop her report. posted 7 days ago by PiratePatriotParrot 18 comments award share report block Tommy Robinson 🇬🇧 @TRobinsonNewEra • 7d A lady's Airbnb was used by 20 men(no prizes for what kind of \"men\") Who had 14yr old girls in the property. The lady reported all this to police, they also destroyed her belongings. The police ignored her and told her to drop her report. They're still turning a blind eye!\n18 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Treefiddydiddy 26 points 6 days ago the police are actually supporting the rape , humiliation and eventual death of their own citizens.......they make me fucking puke permalink award report block reply Steve56775 9 points 6 days ago Most of them got to attend the party “for free”. permalink parent award report block reply Vadernocturnus 7 points 6 days ago Denver airport murals…British banking cartel running the world…Islam is their weapon. All makes sense when put into perspective. They are using every tool to demoralize and destroy western civilization. permalink parent award report block reply Hangmhigh 19 points 6 days ago They are biowepons unleashed on the population so they cant organize a counter attack against the globalists. permalink award report block reply lifeisahologram 4 points 6 days ago This is why if you do Airbnb you need to have it set for everyday by request (no auto bookings) and then when someone asks, you have to review their profile. Then to avoid being labeled a racist and kicked off the platform for refusing service to certain races, you just say say you are occupying it with family that time and you apologize because you use it a lot that’s why it’s set by request only. permalink award report block reply AmarilloArmadillo 2 points 6 days ago Smart permalink parent award report block reply BastardsBlanket 4 points 6 days ago There needs to be a country wide action group of some sort. Instead of going to the cops go and tell an army of patriots. Turn the whole thing into a mass brawl. permalink award report block reply Dev404 2 points 6 days ago I wonder which group of people have a reputation of doing this that also gets 24/7 media protection like Obama. Anyway, thank feminists for their support in all the cultural rot around the world and inviting foreign invaders to every first world country, and the government for subsidizing their invasion and running cover for them. permalink award report block reply keeman 1 points 6 days ago Also, the investigator who was assisting her was fired and his notes destroyed.  Probably someone called him a racist for investigating why a  bunch of Paki men were cohabiting with 14 year old British girls. permalink award report block reply CheeseAndOnion 1 points 6 days ago If she doesnt like it, she shouldnt be living in a moslem country. permalink award report block reply entwickelnden 7 points 6 days ago What a stupid take. Is she going to leave her homeland and come here? Biden let all the illegals in, what did you do? They shot trump and killed a supporter, what did you do? They killed Charlie, what did you do? They just elected the muzzie to NYC mayor, what did you do? She's doing more then you. permalink parent award report block reply CheeseAndOnion 0 points 5 days ago Woosh right over your head permalink parent award report block reply entwickelnden 1 points 5 days ago Lol, I'm sure ur just too bright, clown. permalink parent award report block reply CheeseAndOnion 1 points 5 days ago England is basically a moslen country and the whites are being beaten by its own government. Its a shithole. permalink parent award report block reply view 1 more comments... budgsxr 1 points 6 days ago The only way Brit’s fix it is to burn it all down. I think we’re not far from having to do the same. permalink award report block reply ciaramella_is_gay 0 points 6 days ago Tommy is a jew dick sucker. permalink award report block reply\nTreefiddydiddy 26 points 6 days ago the police are actually supporting the rape , humiliation and eventual death of their own citizens.......they make me fucking puke permalink award report block reply Steve56775 9 points 6 days ago Most of them got to attend the party “for free”. permalink parent award report block reply Vadernocturnus 7 points 6 days ago Denver airport murals…British banking cartel running the world…Islam is their weapon. All makes sense when put into perspective. They are using every tool to demoralize and destroy western civilization. permalink parent award report block reply\nSteve56775 9 points 6 days ago Most of them got to attend the party “for free”. permalink parent award report block reply\nVadernocturnus 7 points 6 days ago Denver airport murals…British banking cartel running the world…Islam is their weapon. All makes sense when put into perspective. They are using every tool to demoralize and destroy western civilization. permalink parent award report block reply\nHangmhigh 19 points 6 days ago They are biowepons unleashed on the population so they cant organize a counter attack against the globalists. permalink award report block reply\nlifeisahologram 4 points 6 days ago This is why if you do Airbnb you need to have it set for everyday by request (no auto bookings) and then when someone asks, you have to review their profile. Then to avoid being labeled a racist and kicked off the platform for refusing service to certain races, you just say say you are occupying it with family that time and you apologize because you use it a lot that’s why it’s set by request only. permalink award report block reply AmarilloArmadillo 2 points 6 days ago Smart permalink parent award report block reply\nAmarilloArmadillo 2 points 6 days ago Smart permalink parent award report block reply\nBastardsBlanket 4 points 6 days ago There needs to be a country wide action group of some sort. Instead of going to the cops go and tell an army of patriots. Turn the whole thing into a mass brawl. permalink award report block reply\nDev404 2 points 6 days ago I wonder which group of people have a reputation of doing this that also gets 24/7 media protection like Obama. Anyway, thank feminists for their support in all the cultural rot around the world and inviting foreign invaders to every first world country, and the government for subsidizing their invasion and running cover for them. permalink award report block reply\nkeeman 1 points 6 days ago Also, the investigator who was assisting her was fired and his notes destroyed.  Probably someone called him a racist for investigating why a  bunch of Paki men were cohabiting with 14 year old British girls. permalink award report block reply\nCheeseAndOnion 1 points 6 days ago If she doesnt like it, she shouldnt be living in a moslem country. permalink award report block reply entwickelnden 7 points 6 days ago What a stupid take. Is she going to leave her homeland and come here? Biden let all the illegals in, what did you do? They shot trump and killed a supporter, what did you do? They killed Charlie, what did you do? They just elected the muzzie to NYC mayor, what did you do? She's doing more then you. permalink parent award report block reply CheeseAndOnion 0 points 5 days ago Woosh right over your head permalink parent award report block reply entwickelnden 1 points 5 days ago Lol, I'm sure ur just too bright, clown. permalink parent award report block reply CheeseAndOnion 1 points 5 days ago England is basically a moslen country and the whites are being beaten by its own government. Its a shithole. permalink parent award report block reply view 1 more comments...\nentwickelnden 7 points 6 days ago What a stupid take. Is she going to leave her homeland and come here? Biden let all the illegals in, what did you do? They shot trump and killed a supporter, what did you do? They killed Charlie, what did you do? They just elected the muzzie to NYC mayor, what did you do? She's doing more then you. permalink parent award report block reply CheeseAndOnion 0 points 5 days ago Woosh right over your head permalink parent award report block reply entwickelnden 1 points 5 days ago Lol, I'm sure ur just too bright, clown. permalink parent award report block reply CheeseAndOnion 1 points 5 days ago England is basically a moslen country and the whites are being beaten by its own government. Its a shithole. permalink parent award report block reply view 1 more comments...\nCheeseAndOnion 0 points 5 days ago Woosh right over your head permalink parent award report block reply entwickelnden 1 points 5 days ago Lol, I'm sure ur just too bright, clown. permalink parent award report block reply CheeseAndOnion 1 points 5 days ago England is basically a moslen country and the whites are being beaten by its own government. Its a shithole. permalink parent award report block reply view 1 more comments...\nentwickelnden 1 points 5 days ago Lol, I'm sure ur just too bright, clown. permalink parent award report block reply CheeseAndOnion 1 points 5 days ago England is basically a moslen country and the whites are being beaten by its own government. Its a shithole. permalink parent award report block reply view 1 more comments...\nCheeseAndOnion 1 points 5 days ago England is basically a moslen country and the whites are being beaten by its own government. Its a shithole. permalink parent award report block reply view 1 more comments...\nbudgsxr 1 points 6 days ago The only way Brit’s fix it is to burn it all down. I think we’re not far from having to do the same. permalink award report block reply\nciaramella_is_gay 0 points 6 days ago Tommy is a jew dick sucker. permalink award report block reply",
  "fetched_at": "2025-11-12T22:58:53.379253Z"
}