{
  "id": "1ARK55a3wC",
  "url": "https://patriots.win/p/1ARK55a3wC/-im-lovin-it-mcdonalds-ceo-says-/c",
  "content": "683 🍔 I'm Lovin' It: McDonald’s CEO says traffic from low income customers is “declining.” M A H A posted 5 days ago by TheRedPilledArtist 60 comments award share download report block\n60 comments Sort by Top Top New Worst Old Save hughjasske69 46 points 5 days ago I would imagine traffic from high income customers is not existent permalink award report block reply 2016TrumpMAGA 32 points 5 days ago Traditionally, fast food restaurants did well in any economy. In a bad economy, people who used to eat at 'better' restaurants moved 'down' to fast food. In a good economy, people who never ate out moved 'up' to fast food. At $15 for a big mac meal, no one is moving 'up' or 'down' to fast food.  They are moving 'down' to microwave food, and 'up' or laterally to dine in restaurants. permalink parent award report block reply imnotdeadyet 5 points 5 days ago Exactly.  I can go to a restaurant and get better food for the same price.  I stopped by a Jack in the Box and ordered a large Diet Coke and it was $3!  Fast Food used to be fast and cheap.  Not anymore! permalink parent award report block reply SPEDMan64 3 points 5 days ago Right. I can get an order of fajitas with rice, beans, and guac for the same price as a Wendy's combo from any of the Mexican joints near me so why wouldn't I get that over a bunch of processed crap? permalink parent award report block reply anotherthing 1 points 4 days ago I've noticed this as well. You can get more food at Mexican restaurants for about the same price as fast food these days. Even places like Denny's are fairly pricey now. On the subject of Denny's, they kept their egg premium cost addon long after the prices of eggs came down. The cost of eggs dropped quite a bit by the second month Trump was in office, but they kept the premium charge for meals with eggs through most of the Summer months. I'm not sure if that was political or greed or a combination of the two, but it was definitely a put off. permalink parent award report block reply view 1 more comments... FrmrAmericanRepublic 3 points 5 days ago Couple price increases with declining quality and even the most obese fuck that loved McDonald's will stuff their faces with something elsewhere. I'd rather have a burger at a local joint that processes it from a farm less than 20 miles away than go to some fastfood shack where some attitude-laden Sheniqua chucks my burger in a container with her never-cleaned talon-length nails. permalink parent award report block reply Gfloydvotestrump 2 points 5 days ago It's absolutely outrageous. I just made an entire box of spaghetti with meat sauce for dinner, combined everything wasn't even 8$ at the store and I can eat this numerous times. Big Macs, hell fast food in general isn't worth the wrapping paper/box it comes in permalink parent award report block reply CPT88 7 points 5 days ago Not sure what the threshold of high income is but I'd probably be that. My family used to use McDonald's as a quick option every few weeks or so when things were busy. Now we never go near it. It's no longer quick, that's my biggest gripe. You watch the movie The Founder and you realize that was a key USP and they have completely lost that. And now you have to wait plus prices are up and quality is down, you may as well go to a local takeout for far better food. There's no reason to go there any more other than the inertia of the brand. Plus even in that mass franchise space there's now so many options, but we mostly hit owner run local places now for far better food. permalink parent award report block reply Tbonius45maximus 5 points 5 days ago Flavor brought to you by sysco permalink parent award report block reply Nibba2 1 points 5 days ago Trump loves McDonald’s. permalink parent award report block reply BeefFarmerForTrump 22 points 5 days ago Everything is falling into place. In Demolition man, Taco Bell was a fine dining establishment. I found it hilarious as a kid watching the movie but now I'm seeing it happen. Soon, only the rich will be able to afford it. I've been saying for a while and I've seen other people say it too, but we truly are heading for a combination of a Demolition Man/Idiocracy future. permalink award report block reply RedFoxOnFire 6 points 5 days ago \"What kind of kids eat Armour Hotdogs?\" 🎶 permalink parent award report block reply TearsAficionado 5 points 5 days ago SHUT UP! I'm 'batin'! permalink parent award report block reply Coover 3 points 5 days ago Sammy Sosa loves Armour  🌭 permalink parent award report block reply WassermanSchultz 3 points 5 days ago This is funny.  On Halloween I took the kids out to Taco Bell before trick-or-treating.  I hadn't been there in years, so when the total for the three of us came to $30 my jaw kind of hit the floor.  Next time I go I'll be sure to rent a tux. permalink parent award report block reply FatigueIsReal 12 points 5 days ago I bet this would continue if they took the EBT sign out of the window. permalink award report block reply Hex_Star 8 points 5 days ago I only get Taco Bell like a respectable poor. permalink award report block reply Surfsup 6 points 5 days ago Where their taco meat is \"at least 50% meat\" https://www.huffpost.com/entry/taco-bell-beef-lawsuit_n_813185 permalink parent award report block reply ThisTrainHasNoBrakes 2 points 5 days ago 35%! permalink parent award report block reply Surfsup 1 points 4 days ago At least! permalink parent award report block reply Steve56775 1 points 5 days ago Maybe, but fake meat is real too, right? permalink parent award report block reply ThisTrainHasNoBrakes 2 points 5 days ago Sure is.  It’s real fake. permalink parent award report block reply Transparency 2 points 5 days ago 100% of the times that I have gotten ANY level of food poisoning... it has been from Taco Bell. Needless to say... I don't eat there any longer. Ever. permalink parent award report block reply covok48 1 points 5 days ago They’re going to win the franchise wars. permalink parent award report block reply HellNoKameltoe 8 points 5 days ago wasn't aware McD accepted SNAP permalink award report block reply jdemarco2014 8 points 5 days ago They do in comiefornia permalink parent award report block reply SanityGumby 7 points 5 days ago No shit. The prices lost the plot. The sausage breakfast burritos not that long ago were a dollar each, plus a coffee was under $5. Now, even in my relatively lower priced region it's nearly $10. permalink award report block reply kippo_hard 7 points 5 days ago Could also have to do with them raising their prices so they could pay employees $15 an hour. permalink award report block reply Jimmyprawns 2 points 5 days ago An hour of minimum wage pay usually sets the cost of a combo meal. permalink parent award report block reply ParadigmShift2070 2 points 5 days ago And then replace them with kiosks and robots permalink parent award report block reply Covfefebrulee 5 points 5 days ago It’s not even food. It’s like the AI slop of food. permalink award report block reply DudeNoOne 5 points 5 days ago How do they know which of their customers are low income? permalink award report block reply TheRedPilledArtist OP 5 points 5 days ago SOURCE: https://x.com/LeadingReport/status/1986869615322939727 permalink award report block reply bidensmissingbrain 4 points 5 days ago Haha ha ha ha! permalink award report block reply donalds_stones 4 points 5 days ago Even the low income people don’t want to eat that garbage. permalink award report block reply whiter5fx 4 points 5 days ago Good bye McDonald's permalink award report block reply mikethemarine 4 points 5 days ago so is PAPA MURPHY'S PIZZA, how is it they can use and EBT card to go out and eat?, This is simply bullshit, I can't always go out and eat when I want to and I worked for a living, feed them only no going out eat at home like working people trying to make ends meet permalink award report block reply stjimmy92 1 points 5 days ago Only the elderly, disabled, or homeless are supposed to be in the EBT program allowing it to be used for prepared food. Not counting fraud, I’m guessing they’re not going to fast food as much because they actually have to pay for their own groceries now, so that’s taking up their prior McDonald’s budget permalink parent award report block reply Surfsup 4 points 5 days ago Good, no real food permalink award report block reply OZYMANDIAS1939 3 points 5 days ago Wages are stagnant and inflation keeps going up... tough times man. . permalink award report block reply Shitsbrokeyo 3 points 5 days ago They use doordash via SNAP.  SORRY MICKYDEES permalink award report block reply Bboop 3 points 5 days ago It should make MacDs money in the long run - no more furniture broken up, counters tipped over, glass broken, regular customers scared off. Should be win-win permalink award report block reply Steve56775 2 points 5 days ago They can’t pay people 20 bucks an hour for a high school kids part time job and sell hamburger meals for 15 bucks. The food is not worth it. They might as well close. permalink award report block reply ThePatriotGames2016 2 points 5 days ago The system works permalink award report block reply redditadminssuckit 2 points 5 days ago Uhhh...no moe ebt gibs permalink award report block reply PoleWatcher 1 points 5 days ago Ceo needs a pay cut, ebt should not be allowed,  more value for customers. Replace lazy wagys with self checkout or apps permalink award report block reply 4022a 1 points 5 days ago get fucked brokies permalink award report block reply Zskills 2 points 5 days ago The politically correct term is \"rentoids\" permalink parent award report block reply lifeisahologram 1 points 5 days ago Yeah no shit, McDonald’s is not for low income anymore. A meal at McDonald’s can be as expensive as an affordable sit down restaurant meal in tourist areas like Vegas and Honolulu. McDonald’s shit food used to be cheap and fast.  But there is no reason to visit anymore permalink award report block reply ProfessorJagoff 1 points 5 days ago The problem is, if you're going to jack up the prices you have to make damn sure the product is always fresh, warm, consistent, etc. something they just can't seem to do in my area anymore. Furthermore, and this isn't a complaint against Hispanics in fast food, the drive-thru taco place in town is phenomenal and I eat there almost every other day, but I've noticed that the employees at my McD's are all hispanic now, but unlike the taco place they just don't really give a damn about their job. For example, the last time I was there, and the last time I will be there, I ordered a chicken deluxe sandwich with a new gold sauce, which also has bacon and veggies. What I got was cold soggy chicken between two smashed buns. and most importantly, NO SAUCE, the meal is literally named after the special sauce. So I went inside and to my surprise, they were shocked I came in to complain, and that about set me off. A supervisor came over and corrected it, and the next sandwich I got was amazing, as it should have been. permalink award report block reply Keep_on_Trumpin 1 points 5 days ago Now how the hell do they know whether a customer is low income or not? Are they paying for their McDouble with pocket change or something? permalink award report block reply LibsRcrazy 1 points 4 days ago McDonalds is batshit crazy if they think a rubber McMuffin is worth $7.00 permalink award report block reply Texasnumber1 1 points 5 days ago Even if they brought the prices down I will never eat their food ever the only Burgers I would probably eat from a fast food chain would be Whataburger and Dairy Queen and I haven't had those in a couple of years permalink award report block reply MAGANatsFan 1 points 5 days ago How would they know? permalink award report block reply LLP2 1 points 5 days ago Does that finally mean the end for the \"celebrity\" meals like Stormzy, Travis Scott, and Angel Reese meals? permalink award report block reply HanginChad 1 points 5 days ago Amazingly I don't hear of anyone starving. I mean like really starving not just saying it. permalink award report block reply MagaChamp253 1 points 5 days ago probably because a quick, cheap lunch costs $20 now instead of $5... permalink award report block reply MadRussian 1 points 5 days ago I'm lovin it is actually an acronym for Ailin' Vomit. The more you know. permalink award report block reply Beonkey 1 points 5 days ago I bet gas station burger sales are up.    I actually like a burger at Kwik Trip better than McDonald's. Best deal for $5.  You get to add your own toppings.  Most of the time,fresh. https://share.google/images/OGQtiJjJHvYKk8w7h . permalink award report block reply TheGoyimWhisperer 2 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nhughjasske69 46 points 5 days ago I would imagine traffic from high income customers is not existent permalink award report block reply 2016TrumpMAGA 32 points 5 days ago Traditionally, fast food restaurants did well in any economy. In a bad economy, people who used to eat at 'better' restaurants moved 'down' to fast food. In a good economy, people who never ate out moved 'up' to fast food. At $15 for a big mac meal, no one is moving 'up' or 'down' to fast food.  They are moving 'down' to microwave food, and 'up' or laterally to dine in restaurants. permalink parent award report block reply imnotdeadyet 5 points 5 days ago Exactly.  I can go to a restaurant and get better food for the same price.  I stopped by a Jack in the Box and ordered a large Diet Coke and it was $3!  Fast Food used to be fast and cheap.  Not anymore! permalink parent award report block reply SPEDMan64 3 points 5 days ago Right. I can get an order of fajitas with rice, beans, and guac for the same price as a Wendy's combo from any of the Mexican joints near me so why wouldn't I get that over a bunch of processed crap? permalink parent award report block reply anotherthing 1 points 4 days ago I've noticed this as well. You can get more food at Mexican restaurants for about the same price as fast food these days. Even places like Denny's are fairly pricey now. On the subject of Denny's, they kept their egg premium cost addon long after the prices of eggs came down. The cost of eggs dropped quite a bit by the second month Trump was in office, but they kept the premium charge for meals with eggs through most of the Summer months. I'm not sure if that was political or greed or a combination of the two, but it was definitely a put off. permalink parent award report block reply view 1 more comments... FrmrAmericanRepublic 3 points 5 days ago Couple price increases with declining quality and even the most obese fuck that loved McDonald's will stuff their faces with something elsewhere. I'd rather have a burger at a local joint that processes it from a farm less than 20 miles away than go to some fastfood shack where some attitude-laden Sheniqua chucks my burger in a container with her never-cleaned talon-length nails. permalink parent award report block reply Gfloydvotestrump 2 points 5 days ago It's absolutely outrageous. I just made an entire box of spaghetti with meat sauce for dinner, combined everything wasn't even 8$ at the store and I can eat this numerous times. Big Macs, hell fast food in general isn't worth the wrapping paper/box it comes in permalink parent award report block reply CPT88 7 points 5 days ago Not sure what the threshold of high income is but I'd probably be that. My family used to use McDonald's as a quick option every few weeks or so when things were busy. Now we never go near it. It's no longer quick, that's my biggest gripe. You watch the movie The Founder and you realize that was a key USP and they have completely lost that. And now you have to wait plus prices are up and quality is down, you may as well go to a local takeout for far better food. There's no reason to go there any more other than the inertia of the brand. Plus even in that mass franchise space there's now so many options, but we mostly hit owner run local places now for far better food. permalink parent award report block reply Tbonius45maximus 5 points 5 days ago Flavor brought to you by sysco permalink parent award report block reply Nibba2 1 points 5 days ago Trump loves McDonald’s. permalink parent award report block reply\n2016TrumpMAGA 32 points 5 days ago Traditionally, fast food restaurants did well in any economy. In a bad economy, people who used to eat at 'better' restaurants moved 'down' to fast food. In a good economy, people who never ate out moved 'up' to fast food. At $15 for a big mac meal, no one is moving 'up' or 'down' to fast food.  They are moving 'down' to microwave food, and 'up' or laterally to dine in restaurants. permalink parent award report block reply imnotdeadyet 5 points 5 days ago Exactly.  I can go to a restaurant and get better food for the same price.  I stopped by a Jack in the Box and ordered a large Diet Coke and it was $3!  Fast Food used to be fast and cheap.  Not anymore! permalink parent award report block reply SPEDMan64 3 points 5 days ago Right. I can get an order of fajitas with rice, beans, and guac for the same price as a Wendy's combo from any of the Mexican joints near me so why wouldn't I get that over a bunch of processed crap? permalink parent award report block reply anotherthing 1 points 4 days ago I've noticed this as well. You can get more food at Mexican restaurants for about the same price as fast food these days. Even places like Denny's are fairly pricey now. On the subject of Denny's, they kept their egg premium cost addon long after the prices of eggs came down. The cost of eggs dropped quite a bit by the second month Trump was in office, but they kept the premium charge for meals with eggs through most of the Summer months. I'm not sure if that was political or greed or a combination of the two, but it was definitely a put off. permalink parent award report block reply view 1 more comments... FrmrAmericanRepublic 3 points 5 days ago Couple price increases with declining quality and even the most obese fuck that loved McDonald's will stuff their faces with something elsewhere. I'd rather have a burger at a local joint that processes it from a farm less than 20 miles away than go to some fastfood shack where some attitude-laden Sheniqua chucks my burger in a container with her never-cleaned talon-length nails. permalink parent award report block reply Gfloydvotestrump 2 points 5 days ago It's absolutely outrageous. I just made an entire box of spaghetti with meat sauce for dinner, combined everything wasn't even 8$ at the store and I can eat this numerous times. Big Macs, hell fast food in general isn't worth the wrapping paper/box it comes in permalink parent award report block reply\nimnotdeadyet 5 points 5 days ago Exactly.  I can go to a restaurant and get better food for the same price.  I stopped by a Jack in the Box and ordered a large Diet Coke and it was $3!  Fast Food used to be fast and cheap.  Not anymore! permalink parent award report block reply SPEDMan64 3 points 5 days ago Right. I can get an order of fajitas with rice, beans, and guac for the same price as a Wendy's combo from any of the Mexican joints near me so why wouldn't I get that over a bunch of processed crap? permalink parent award report block reply anotherthing 1 points 4 days ago I've noticed this as well. You can get more food at Mexican restaurants for about the same price as fast food these days. Even places like Denny's are fairly pricey now. On the subject of Denny's, they kept their egg premium cost addon long after the prices of eggs came down. The cost of eggs dropped quite a bit by the second month Trump was in office, but they kept the premium charge for meals with eggs through most of the Summer months. I'm not sure if that was political or greed or a combination of the two, but it was definitely a put off. permalink parent award report block reply view 1 more comments...\nSPEDMan64 3 points 5 days ago Right. I can get an order of fajitas with rice, beans, and guac for the same price as a Wendy's combo from any of the Mexican joints near me so why wouldn't I get that over a bunch of processed crap? permalink parent award report block reply anotherthing 1 points 4 days ago I've noticed this as well. You can get more food at Mexican restaurants for about the same price as fast food these days. Even places like Denny's are fairly pricey now. On the subject of Denny's, they kept their egg premium cost addon long after the prices of eggs came down. The cost of eggs dropped quite a bit by the second month Trump was in office, but they kept the premium charge for meals with eggs through most of the Summer months. I'm not sure if that was political or greed or a combination of the two, but it was definitely a put off. permalink parent award report block reply view 1 more comments...\nanotherthing 1 points 4 days ago I've noticed this as well. You can get more food at Mexican restaurants for about the same price as fast food these days. Even places like Denny's are fairly pricey now. On the subject of Denny's, they kept their egg premium cost addon long after the prices of eggs came down. The cost of eggs dropped quite a bit by the second month Trump was in office, but they kept the premium charge for meals with eggs through most of the Summer months. I'm not sure if that was political or greed or a combination of the two, but it was definitely a put off. permalink parent award report block reply view 1 more comments...\nFrmrAmericanRepublic 3 points 5 days ago Couple price increases with declining quality and even the most obese fuck that loved McDonald's will stuff their faces with something elsewhere. I'd rather have a burger at a local joint that processes it from a farm less than 20 miles away than go to some fastfood shack where some attitude-laden Sheniqua chucks my burger in a container with her never-cleaned talon-length nails. permalink parent award report block reply\nGfloydvotestrump 2 points 5 days ago It's absolutely outrageous. I just made an entire box of spaghetti with meat sauce for dinner, combined everything wasn't even 8$ at the store and I can eat this numerous times. Big Macs, hell fast food in general isn't worth the wrapping paper/box it comes in permalink parent award report block reply\nCPT88 7 points 5 days ago Not sure what the threshold of high income is but I'd probably be that. My family used to use McDonald's as a quick option every few weeks or so when things were busy. Now we never go near it. It's no longer quick, that's my biggest gripe. You watch the movie The Founder and you realize that was a key USP and they have completely lost that. And now you have to wait plus prices are up and quality is down, you may as well go to a local takeout for far better food. There's no reason to go there any more other than the inertia of the brand. Plus even in that mass franchise space there's now so many options, but we mostly hit owner run local places now for far better food. permalink parent award report block reply Tbonius45maximus 5 points 5 days ago Flavor brought to you by sysco permalink parent award report block reply\nTbonius45maximus 5 points 5 days ago Flavor brought to you by sysco permalink parent award report block reply\nNibba2 1 points 5 days ago Trump loves McDonald’s. permalink parent award report block reply\nBeefFarmerForTrump 22 points 5 days ago Everything is falling into place. In Demolition man, Taco Bell was a fine dining establishment. I found it hilarious as a kid watching the movie but now I'm seeing it happen. Soon, only the rich will be able to afford it. I've been saying for a while and I've seen other people say it too, but we truly are heading for a combination of a Demolition Man/Idiocracy future. permalink award report block reply RedFoxOnFire 6 points 5 days ago \"What kind of kids eat Armour Hotdogs?\" 🎶 permalink parent award report block reply TearsAficionado 5 points 5 days ago SHUT UP! I'm 'batin'! permalink parent award report block reply Coover 3 points 5 days ago Sammy Sosa loves Armour  🌭 permalink parent award report block reply WassermanSchultz 3 points 5 days ago This is funny.  On Halloween I took the kids out to Taco Bell before trick-or-treating.  I hadn't been there in years, so when the total for the three of us came to $30 my jaw kind of hit the floor.  Next time I go I'll be sure to rent a tux. permalink parent award report block reply\nRedFoxOnFire 6 points 5 days ago \"What kind of kids eat Armour Hotdogs?\" 🎶 permalink parent award report block reply TearsAficionado 5 points 5 days ago SHUT UP! I'm 'batin'! permalink parent award report block reply Coover 3 points 5 days ago Sammy Sosa loves Armour  🌭 permalink parent award report block reply\nTearsAficionado 5 points 5 days ago SHUT UP! I'm 'batin'! permalink parent award report block reply\nCoover 3 points 5 days ago Sammy Sosa loves Armour  🌭 permalink parent award report block reply\nWassermanSchultz 3 points 5 days ago This is funny.  On Halloween I took the kids out to Taco Bell before trick-or-treating.  I hadn't been there in years, so when the total for the three of us came to $30 my jaw kind of hit the floor.  Next time I go I'll be sure to rent a tux. permalink parent award report block reply\nFatigueIsReal 12 points 5 days ago I bet this would continue if they took the EBT sign out of the window. permalink award report block reply\nHex_Star 8 points 5 days ago I only get Taco Bell like a respectable poor. permalink award report block reply Surfsup 6 points 5 days ago Where their taco meat is \"at least 50% meat\" https://www.huffpost.com/entry/taco-bell-beef-lawsuit_n_813185 permalink parent award report block reply ThisTrainHasNoBrakes 2 points 5 days ago 35%! permalink parent award report block reply Surfsup 1 points 4 days ago At least! permalink parent award report block reply Steve56775 1 points 5 days ago Maybe, but fake meat is real too, right? permalink parent award report block reply ThisTrainHasNoBrakes 2 points 5 days ago Sure is.  It’s real fake. permalink parent award report block reply Transparency 2 points 5 days ago 100% of the times that I have gotten ANY level of food poisoning... it has been from Taco Bell. Needless to say... I don't eat there any longer. Ever. permalink parent award report block reply covok48 1 points 5 days ago They’re going to win the franchise wars. permalink parent award report block reply\nSurfsup 6 points 5 days ago Where their taco meat is \"at least 50% meat\" https://www.huffpost.com/entry/taco-bell-beef-lawsuit_n_813185 permalink parent award report block reply ThisTrainHasNoBrakes 2 points 5 days ago 35%! permalink parent award report block reply Surfsup 1 points 4 days ago At least! permalink parent award report block reply Steve56775 1 points 5 days ago Maybe, but fake meat is real too, right? permalink parent award report block reply ThisTrainHasNoBrakes 2 points 5 days ago Sure is.  It’s real fake. permalink parent award report block reply Transparency 2 points 5 days ago 100% of the times that I have gotten ANY level of food poisoning... it has been from Taco Bell. Needless to say... I don't eat there any longer. Ever. permalink parent award report block reply\nThisTrainHasNoBrakes 2 points 5 days ago 35%! permalink parent award report block reply Surfsup 1 points 4 days ago At least! permalink parent award report block reply Steve56775 1 points 5 days ago Maybe, but fake meat is real too, right? permalink parent award report block reply ThisTrainHasNoBrakes 2 points 5 days ago Sure is.  It’s real fake. permalink parent award report block reply\nSurfsup 1 points 4 days ago At least! permalink parent award report block reply\nSteve56775 1 points 5 days ago Maybe, but fake meat is real too, right? permalink parent award report block reply ThisTrainHasNoBrakes 2 points 5 days ago Sure is.  It’s real fake. permalink parent award report block reply\nThisTrainHasNoBrakes 2 points 5 days ago Sure is.  It’s real fake. permalink parent award report block reply\nTransparency 2 points 5 days ago 100% of the times that I have gotten ANY level of food poisoning... it has been from Taco Bell. Needless to say... I don't eat there any longer. Ever. permalink parent award report block reply\ncovok48 1 points 5 days ago They’re going to win the franchise wars. permalink parent award report block reply\nHellNoKameltoe 8 points 5 days ago wasn't aware McD accepted SNAP permalink award report block reply jdemarco2014 8 points 5 days ago They do in comiefornia permalink parent award report block reply\njdemarco2014 8 points 5 days ago They do in comiefornia permalink parent award report block reply\nSanityGumby 7 points 5 days ago No shit. The prices lost the plot. The sausage breakfast burritos not that long ago were a dollar each, plus a coffee was under $5. Now, even in my relatively lower priced region it's nearly $10. permalink award report block reply\nkippo_hard 7 points 5 days ago Could also have to do with them raising their prices so they could pay employees $15 an hour. permalink award report block reply Jimmyprawns 2 points 5 days ago An hour of minimum wage pay usually sets the cost of a combo meal. permalink parent award report block reply ParadigmShift2070 2 points 5 days ago And then replace them with kiosks and robots permalink parent award report block reply\nJimmyprawns 2 points 5 days ago An hour of minimum wage pay usually sets the cost of a combo meal. permalink parent award report block reply\nParadigmShift2070 2 points 5 days ago And then replace them with kiosks and robots permalink parent award report block reply\nCovfefebrulee 5 points 5 days ago It’s not even food. It’s like the AI slop of food. permalink award report block reply\nDudeNoOne 5 points 5 days ago How do they know which of their customers are low income? permalink award report block reply\nTheRedPilledArtist OP 5 points 5 days ago SOURCE: https://x.com/LeadingReport/status/1986869615322939727 permalink award report block reply\nbidensmissingbrain 4 points 5 days ago Haha ha ha ha! permalink award report block reply\ndonalds_stones 4 points 5 days ago Even the low income people don’t want to eat that garbage. permalink award report block reply\nwhiter5fx 4 points 5 days ago Good bye McDonald's permalink award report block reply\nmikethemarine 4 points 5 days ago so is PAPA MURPHY'S PIZZA, how is it they can use and EBT card to go out and eat?, This is simply bullshit, I can't always go out and eat when I want to and I worked for a living, feed them only no going out eat at home like working people trying to make ends meet permalink award report block reply stjimmy92 1 points 5 days ago Only the elderly, disabled, or homeless are supposed to be in the EBT program allowing it to be used for prepared food. Not counting fraud, I’m guessing they’re not going to fast food as much because they actually have to pay for their own groceries now, so that’s taking up their prior McDonald’s budget permalink parent award report block reply\nstjimmy92 1 points 5 days ago Only the elderly, disabled, or homeless are supposed to be in the EBT program allowing it to be used for prepared food. Not counting fraud, I’m guessing they’re not going to fast food as much because they actually have to pay for their own groceries now, so that’s taking up their prior McDonald’s budget permalink parent award report block reply\nSurfsup 4 points 5 days ago Good, no real food permalink award report block reply\nOZYMANDIAS1939 3 points 5 days ago Wages are stagnant and inflation keeps going up... tough times man. . permalink award report block reply\nShitsbrokeyo 3 points 5 days ago They use doordash via SNAP.  SORRY MICKYDEES permalink award report block reply\nBboop 3 points 5 days ago It should make MacDs money in the long run - no more furniture broken up, counters tipped over, glass broken, regular customers scared off. Should be win-win permalink award report block reply\nSteve56775 2 points 5 days ago They can’t pay people 20 bucks an hour for a high school kids part time job and sell hamburger meals for 15 bucks. The food is not worth it. They might as well close. permalink award report block reply\nThePatriotGames2016 2 points 5 days ago The system works permalink award report block reply\nredditadminssuckit 2 points 5 days ago Uhhh...no moe ebt gibs permalink award report block reply\nPoleWatcher 1 points 5 days ago Ceo needs a pay cut, ebt should not be allowed,  more value for customers. Replace lazy wagys with self checkout or apps permalink award report block reply\n4022a 1 points 5 days ago get fucked brokies permalink award report block reply Zskills 2 points 5 days ago The politically correct term is \"rentoids\" permalink parent award report block reply\nZskills 2 points 5 days ago The politically correct term is \"rentoids\" permalink parent award report block reply\nlifeisahologram 1 points 5 days ago Yeah no shit, McDonald’s is not for low income anymore. A meal at McDonald’s can be as expensive as an affordable sit down restaurant meal in tourist areas like Vegas and Honolulu. McDonald’s shit food used to be cheap and fast.  But there is no reason to visit anymore permalink award report block reply\nProfessorJagoff 1 points 5 days ago The problem is, if you're going to jack up the prices you have to make damn sure the product is always fresh, warm, consistent, etc. something they just can't seem to do in my area anymore. Furthermore, and this isn't a complaint against Hispanics in fast food, the drive-thru taco place in town is phenomenal and I eat there almost every other day, but I've noticed that the employees at my McD's are all hispanic now, but unlike the taco place they just don't really give a damn about their job. For example, the last time I was there, and the last time I will be there, I ordered a chicken deluxe sandwich with a new gold sauce, which also has bacon and veggies. What I got was cold soggy chicken between two smashed buns. and most importantly, NO SAUCE, the meal is literally named after the special sauce. So I went inside and to my surprise, they were shocked I came in to complain, and that about set me off. A supervisor came over and corrected it, and the next sandwich I got was amazing, as it should have been. permalink award report block reply\nKeep_on_Trumpin 1 points 5 days ago Now how the hell do they know whether a customer is low income or not? Are they paying for their McDouble with pocket change or something? permalink award report block reply\nLibsRcrazy 1 points 4 days ago McDonalds is batshit crazy if they think a rubber McMuffin is worth $7.00 permalink award report block reply\nTexasnumber1 1 points 5 days ago Even if they brought the prices down I will never eat their food ever the only Burgers I would probably eat from a fast food chain would be Whataburger and Dairy Queen and I haven't had those in a couple of years permalink award report block reply\nMAGANatsFan 1 points 5 days ago How would they know? permalink award report block reply\nLLP2 1 points 5 days ago Does that finally mean the end for the \"celebrity\" meals like Stormzy, Travis Scott, and Angel Reese meals? permalink award report block reply\nHanginChad 1 points 5 days ago Amazingly I don't hear of anyone starving. I mean like really starving not just saying it. permalink award report block reply\nMagaChamp253 1 points 5 days ago probably because a quick, cheap lunch costs $20 now instead of $5... permalink award report block reply\nMadRussian 1 points 5 days ago I'm lovin it is actually an acronym for Ailin' Vomit. The more you know. permalink award report block reply\nBeonkey 1 points 5 days ago I bet gas station burger sales are up.    I actually like a burger at Kwik Trip better than McDonald's. Best deal for $5.  You get to add your own toppings.  Most of the time,fresh. https://share.google/images/OGQtiJjJHvYKk8w7h . permalink award report block reply\nTheGoyimWhisperer 2 points 5 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:15:07.180725Z"
}