{
  "id": "1ARK5131xC",
  "url": "https://patriots.win/p/1ARK5131xC/new-york-muslim-influencer-that-/c",
  "content": "378 New York Muslim influencer that helped get Zohran Mamdani elected pushing content says now begins the time to covert the New York City population to Islam and begin building new mosques\n\nThis was the plan all along. This is the Islamic takeover of America posted 7 days ago by PiratePatriotParrot 30 comments award share report block Wall Street Apes @WallStreetApes • 7d New York Muslim influencer that helped get Zohran Mamdani elected pushing content says now begins the time to covert the New York City population to Islam and begin building new mosques This was the plan all along. This is the Islamic takeover of America “The Islamic caliphate\n30 comments Sort by Top Top New Worst Old Save HeatherSwanson 19 points 6 days ago Stone her to death. Haram to expose hair like a whore permalink award report block reply BillGateCanSuckIt 8 points 6 days ago When she gets her wish, she will definitely be covered by a trash bag permalink parent award report block reply Unboosted 4 points 6 days ago She will go to hell. According to the quran 99% of muslim women go to hell. permalink parent award report block reply crashdaddy 12 points 6 days ago She looks like she'd be more comfortable converting people to judaism, if you know what I mean... permalink award report block reply hughjasske69 8 points 6 days ago They all kind of look the same except they're really dark ones permalink parent award report block reply friarfox 11 points 6 days ago In five years New York will look like London. permalink award report block reply Trooph-Hurts 8 points 6 days ago It’s funny how they would never do this for any other religion permalink award report block reply PiratePatriotParrot OP 7 points 7 days ago Fucking Qatar money permalink award report block reply glow-operator-2-0 4 points 6 days ago Showing her face and whoring herself out on social media means a well-deserved honor stonin'. permalink parent award report block reply suckmycorona 6 points 6 days ago Why isn’t she in a burka and chains? permalink award report block reply Patrick_Bateman 0 points 6 days ago Because she's obviously kidding and making ragebait so that dumbasses like OP pass it around. permalink parent award report block reply hughjasske69 4 points 6 days ago Get the stones permalink award report block reply IBentMyWookie 3 points 6 days ago This dumb twat thinks she’ll be able to wear make up, a Don’t Tread on Me hat and “revealing” t shirt under Sharia law? Hefty bag ghost suit for you “sister!” permalink award report block reply DJT4MoreYears 2 points 6 days ago Where were these easily influenced brain-dead liberal women when the Christians were proselytizing Christianity? They see a smooth talking Muslim and all of a sudden it's the perfect amazing religion. lol Just wait until she's forced to wear face coverings and not go out without the company of 5 men and let's hope she doesn't look at another man that's not one of her many husbands...she'll be taken to the roof. But in the meantime everyone else has to suffer because of one group of stupid women. REPEAL THE 19TH IMMEDIATELY! permalink award report block reply Formerlurker92 2 points 6 days ago The part of me that wants a civil war so I can enact my personal vendettas against people like her keeps growing permalink award report block reply Psalm-118_24 2 points 6 days ago islam is not compatible with US Constitution.   She should be arrested for treason and deported to an islamic country. permalink award report block reply Unboosted 1 points 6 days ago Well yeah look at london and sadic khan. permalink award report block reply redinmn 1 points 6 days ago She will be one of the first against the wall. permalink award report block reply IBentMyWookie 1 points 6 days ago Off the roof more likely. permalink parent award report block reply Firepit 1 points 6 days ago That’s a JEWS FOR ZOHRAN shirt permalink award report block reply hughjasske69 1 points 6 days ago I hope the oppression she voted for beats her for opening her stupid mouth permalink award report block reply MisprisionIsEvil 1 points 6 days ago We need better good guys. permalink award report block reply DangerousAmerican76 1 points 6 days ago Hebrew writing on hat lol permalink award report block reply the-new-style 1 points 6 days ago did you work that out today ? permalink award report block reply Dev404 1 points 6 days ago Muslims always build mosques over conquered territory, nothing new. Leftist women will happily let them do it.... until they get culturally enriched one, too many times and then blame all men for being evil. This is generally how the female brain works: Create a problem.\nBlame men for the problem.\nDemand a nonsensical solution to the problem.\nDemand men implement the non-working solution.\nSolution makes things worse.\nBlame men for not doing it right.\nDemand men fix everything.\nTalk shit about how stupid and worthless men are.\nCreate a new problem...... permalink award report block reply YaharaRiver 1 points 6 days ago She speaks like a child and speaks to YOU like you’re a child. Are there ANY adults in pisslam?! permalink award report block reply CleanUpPhillyTrump24 1 points 6 days ago Report to ICE: https://www.ice.gov/webform/ice-tip-form permalink award report block reply NotYourMan 0 points 6 days ago Is this going to be like all over Europe where churches burn and mosques are built to replace them? permalink award report block reply MR__K 1 points 6 days ago Ya probably permalink parent award report block reply BillyBobJimmyJoe 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nHeatherSwanson 19 points 6 days ago Stone her to death. Haram to expose hair like a whore permalink award report block reply BillGateCanSuckIt 8 points 6 days ago When she gets her wish, she will definitely be covered by a trash bag permalink parent award report block reply Unboosted 4 points 6 days ago She will go to hell. According to the quran 99% of muslim women go to hell. permalink parent award report block reply\nBillGateCanSuckIt 8 points 6 days ago When she gets her wish, she will definitely be covered by a trash bag permalink parent award report block reply Unboosted 4 points 6 days ago She will go to hell. According to the quran 99% of muslim women go to hell. permalink parent award report block reply\nUnboosted 4 points 6 days ago She will go to hell. According to the quran 99% of muslim women go to hell. permalink parent award report block reply\ncrashdaddy 12 points 6 days ago She looks like she'd be more comfortable converting people to judaism, if you know what I mean... permalink award report block reply hughjasske69 8 points 6 days ago They all kind of look the same except they're really dark ones permalink parent award report block reply\nhughjasske69 8 points 6 days ago They all kind of look the same except they're really dark ones permalink parent award report block reply\nfriarfox 11 points 6 days ago In five years New York will look like London. permalink award report block reply\nTrooph-Hurts 8 points 6 days ago It’s funny how they would never do this for any other religion permalink award report block reply\nPiratePatriotParrot OP 7 points 7 days ago Fucking Qatar money permalink award report block reply glow-operator-2-0 4 points 6 days ago Showing her face and whoring herself out on social media means a well-deserved honor stonin'. permalink parent award report block reply\nglow-operator-2-0 4 points 6 days ago Showing her face and whoring herself out on social media means a well-deserved honor stonin'. permalink parent award report block reply\nsuckmycorona 6 points 6 days ago Why isn’t she in a burka and chains? permalink award report block reply Patrick_Bateman 0 points 6 days ago Because she's obviously kidding and making ragebait so that dumbasses like OP pass it around. permalink parent award report block reply\nPatrick_Bateman 0 points 6 days ago Because she's obviously kidding and making ragebait so that dumbasses like OP pass it around. permalink parent award report block reply\nhughjasske69 4 points 6 days ago Get the stones permalink award report block reply\nIBentMyWookie 3 points 6 days ago This dumb twat thinks she’ll be able to wear make up, a Don’t Tread on Me hat and “revealing” t shirt under Sharia law? Hefty bag ghost suit for you “sister!” permalink award report block reply\nDJT4MoreYears 2 points 6 days ago Where were these easily influenced brain-dead liberal women when the Christians were proselytizing Christianity? They see a smooth talking Muslim and all of a sudden it's the perfect amazing religion. lol Just wait until she's forced to wear face coverings and not go out without the company of 5 men and let's hope she doesn't look at another man that's not one of her many husbands...she'll be taken to the roof. But in the meantime everyone else has to suffer because of one group of stupid women. REPEAL THE 19TH IMMEDIATELY! permalink award report block reply\nFormerlurker92 2 points 6 days ago The part of me that wants a civil war so I can enact my personal vendettas against people like her keeps growing permalink award report block reply\nPsalm-118_24 2 points 6 days ago islam is not compatible with US Constitution.   She should be arrested for treason and deported to an islamic country. permalink award report block reply\nUnboosted 1 points 6 days ago Well yeah look at london and sadic khan. permalink award report block reply\nredinmn 1 points 6 days ago She will be one of the first against the wall. permalink award report block reply IBentMyWookie 1 points 6 days ago Off the roof more likely. permalink parent award report block reply\nIBentMyWookie 1 points 6 days ago Off the roof more likely. permalink parent award report block reply\nFirepit 1 points 6 days ago That’s a JEWS FOR ZOHRAN shirt permalink award report block reply\nhughjasske69 1 points 6 days ago I hope the oppression she voted for beats her for opening her stupid mouth permalink award report block reply\nMisprisionIsEvil 1 points 6 days ago We need better good guys. permalink award report block reply\nDangerousAmerican76 1 points 6 days ago Hebrew writing on hat lol permalink award report block reply\nthe-new-style 1 points 6 days ago did you work that out today ? permalink award report block reply\nDev404 1 points 6 days ago Muslims always build mosques over conquered territory, nothing new. Leftist women will happily let them do it.... until they get culturally enriched one, too many times and then blame all men for being evil. This is generally how the female brain works: Create a problem.\nBlame men for the problem.\nDemand a nonsensical solution to the problem.\nDemand men implement the non-working solution.\nSolution makes things worse.\nBlame men for not doing it right.\nDemand men fix everything.\nTalk shit about how stupid and worthless men are.\nCreate a new problem...... permalink award report block reply\nYaharaRiver 1 points 6 days ago She speaks like a child and speaks to YOU like you’re a child. Are there ANY adults in pisslam?! permalink award report block reply\nCleanUpPhillyTrump24 1 points 6 days ago Report to ICE: https://www.ice.gov/webform/ice-tip-form permalink award report block reply\nNotYourMan 0 points 6 days ago Is this going to be like all over Europe where churches burn and mosques are built to replace them? permalink award report block reply MR__K 1 points 6 days ago Ya probably permalink parent award report block reply\nMR__K 1 points 6 days ago Ya probably permalink parent award report block reply\nBillyBobJimmyJoe 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:00:34.523394Z"
}