{
  "id": "1ARK54SUd6",
  "url": "https://patriots.win/p/1ARK54SUd6/if-it-is-dangerous-to-obtain-a-c/c",
  "content": "670 If it is dangerous to obtain a CDL while not understanding English, why is it OK to obtain a regular drivers license? posted 5 days ago by Spinedoc 37 comments award share report block .\n37 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil Oldman1234 27 points 5 days ago States have been giving written drivers tests to applicants in whatever language they can read... even though all the street signs are in English.  And if they can't read, they give the test orally. Next up?  Braille!  What could go wrong? permalink award report block reply STONKATRUCK 11 points 5 days ago They hand out voter registration in any language too permalink parent award report block reply MarshallB 5 points 5 days ago See! One Mistake ALWAYS leads to more grievous mistakes. Of course there are ton's of prior mistakes to choose from. permalink parent award report block reply TwoArizonaPedes 5 points 5 days ago When I took my driver's test in California they offered it in more than 30 languages. I asked the DMV counter person why someone could take the test in another language if they couldn't read road signs in English and she just shrugged. permalink parent award report block reply MarshallB 2 points 5 days ago One mistake always leads to more grievous mistakes. permalink parent award report block reply Oldman1234 3 points 5 days ago It's called \"The Snowball Effect\". permalink parent award report block reply keeman 1 points 5 days ago And the tests are designed to be passed if you just memorize all the answers.  You could do the test in Klingon and the people who study for it would still pass.  It is government make-work.  Look at the questions and ask yourself what relationship those questions have to actual safe driving practices. permalink parent award report block reply GA_Logic 11 points 5 days ago It is also dangerous to hand out ID cards to any illegal.  But at this point illegals can apply for home loans which is a big driver for single family housing shortages. permalink award report block reply hughjasske69 8 points 5 days ago This doesn't pertain to illegals, but just anyone in general who pulls/drives a large RV.   90% are geriatric blue hairs and shouldn't be driving anything let alone a RV....or worse, towing a large goose neck with a boat behind that. permalink award report block reply Hantif 3 points 5 days ago Yep, I had to take tests to get my double/triple endorsement on my CDL but Harry, the 80 year old retired accountant, can tow his boat behind a fifth wheel trailer using a standard license. permalink parent award report block reply glow-operator-2-0 2 points 5 days ago If it's under 6500 lbs was the cut off  class C. Most oversized RV and boat trailer assholes need a class B. permalink parent award report block reply hughjasske69 2 points 5 days ago And he will eventually try to pull through the McDonald's to drive through with it permalink parent award report block reply Rockfish 2 points 5 days ago 90% is a big number, young man permalink parent award report block reply hughjasske69 3 points 5 days ago I'm old too permalink parent award report block reply Beat_to_Quarters 5 points 5 days ago Also they always like to say black people are too dumb to figure out how to obtain any form of ID and that prevents them from voting, but states will hand out ID and drivers licenses willy nilly to illegal aliens. permalink award report block reply TrancePhreak 5 points 5 days ago I 100% agree. permalink award report block reply Cdope45 5 points 5 days ago When I turned 16 I went to the DMV to take my test. I had to make two different trips to get all various documents they needed because the DEI hire working the desk couldn't be bothered to tell me what all I needed to provide. After a couple of hours I was able to take my test and submit my driving log. Meanwhile, a guy who couldn't speak English and was probably illegal was able to get a license after signing a few documents. Citizens have to jump through multiple hoops while foreigners just sign their names. permalink award report block reply billhound 4 points 5 days ago To be fair, you're using logic. permalink award report block reply SpeekFreely 4 points 5 days ago The size and weight of the vehicle for starters. Also CDL operators fall under Federal Regulations permalink award report block reply Roadpower 2 points 5 days ago Non commercial drivers are not held to the same standards as professionals because the non professional isn't involved in commerce and frequent interactions with various enforcement agencies and they aren't carrying cargo including vehicle mass that poses potentially significant dangers to the public. The road signs are one thing but the reality is that reading ability of road signs are not the main concerns. Especially when the signs of importance are already in a universal language like the color of traffic lights, stop signs, yield signs, no U turn signs, do not enter signs, etc. If you can't read or won't abide by those you are already someone who should not be behind a steering wheel anywhere in the world. permalink award report block reply Reclaimer69 2 points 5 days ago Air breaks and the total vehicle weight? permalink award report block reply Psarg 2 points 5 days ago A fender bender on a car is 3 people killed in an 18 wheeler. permalink award report block reply CaliBlonde 1 points 5 days ago California written tests come in 35 different languages, and before you can even schedule an appointment to take the test, you must register to vote.  My 20-year-old neighbor failed the written test 6 times.  On his 7th attempt, the DMV allowed him to take the test at home. permalink award report block reply TwoArizonaPedes 1 points 5 days ago Asking the right questions. permalink award report block reply keeman 1 points 5 days ago Are you under the impression that the DMV's purpose in handing out drivers licenses is in any way related to verifying that the driver is road safe?  Their purpose is to take your money and issue you your tax-animal livestock tracking card which they promised would never be used as a form of government ID when they started the system up. permalink award report block reply MythArcana 1 points 5 days ago We should ask Arnold Schwarzenegger who issued drivers licenses to illegals in California. And, of course, they were automatically registered to vote as a bonus. permalink award report block reply schiff_for_brains 1 points 5 days ago You aren't wrong.  But street signs have been internationalized to help foreign drivers across the world.  Many countries will reciprocate with your US driver's license, even though they drive on the silly side of the road, or you can make your own lane if you fit, and such.  The red octagon with a white rim always means stop, no matter where you are. permalink award report block reply Hikedelics 1 points 5 days ago It isn’t. I’m sure some cuck will make the argument that the consequences of an 18-wheeler accident are far greater than a regular passenger vehicle, but a passenger vehicle can cause 18-wheeler accidents by behaving like a retard on the road since they can’t read any of the signs. permalink award report block reply the-new-style 1 points 5 days ago Federal law states you must be capable of providing an accident report in English, either in writing or orally to an officer. permalink award report block reply mikethemarine 1 points 5 days ago it's not OK to get one, if you have ever gotten a drivers license from another country, guess what, ALL Americans are considered professional drivers and if you get into and accident in their country you are automatically at fault, cause we are professionals, they all know they can't drive, they are all an accident waiting to happen, don't give them one ate all permalink award report block reply PhantomShield72 1 points 5 days ago Also: If it's dangerous to buy alcohol without an ID, why is it okay to vote without one... permalink award report block reply Standingoak 1 points 5 days ago If drivers Licenses were originally only for someone driving a team (usually 8) of horses hauling commercial cargo and everyone else got \"MANDATED\" into getting them for personal travel and now there are NO requirements ; Why must we have Drivers Licenses ? permalink award report block reply Inficant 1 points 5 days ago Because you need 1/100th of the knowledge, have a lot less risk, and basic driving is basic. Don't ask retarded disengenuous questions.... permalink award report block reply HockeyMom4Trump 1 points 5 days ago It isn’t! permalink award report block reply HanginChad 1 points 5 days ago There are probably some compromises to allow foreign drivers that are here on business or vacation, some states will let you just swap out foreign driver's licenses for US ones. When someone goes to Germany for a vacation or business, should they also be required to pass a German test to drive a rental car there? Or should one have to learn Arabic to drive in the UK? It's not a perfect system, but I agree at least the written test should only be given in English. When I was taking the test I had the option of a few languages. permalink award report block reply MarshallB 1 points 5 days ago That's an easy one. YES! permalink parent award report block reply boomerbutnotOKBoomer 1 points 5 days ago Well, for one, a semi can weigh up to 50,000 pounds and that slamming into you is far worse than a Prius slamming into you... There's a lot of reasons the CDL is more complex than a regular driver's license FFS... permalink award report block reply\nOldman1234 27 points 5 days ago States have been giving written drivers tests to applicants in whatever language they can read... even though all the street signs are in English.  And if they can't read, they give the test orally. Next up?  Braille!  What could go wrong? permalink award report block reply STONKATRUCK 11 points 5 days ago They hand out voter registration in any language too permalink parent award report block reply MarshallB 5 points 5 days ago See! One Mistake ALWAYS leads to more grievous mistakes. Of course there are ton's of prior mistakes to choose from. permalink parent award report block reply TwoArizonaPedes 5 points 5 days ago When I took my driver's test in California they offered it in more than 30 languages. I asked the DMV counter person why someone could take the test in another language if they couldn't read road signs in English and she just shrugged. permalink parent award report block reply MarshallB 2 points 5 days ago One mistake always leads to more grievous mistakes. permalink parent award report block reply Oldman1234 3 points 5 days ago It's called \"The Snowball Effect\". permalink parent award report block reply keeman 1 points 5 days ago And the tests are designed to be passed if you just memorize all the answers.  You could do the test in Klingon and the people who study for it would still pass.  It is government make-work.  Look at the questions and ask yourself what relationship those questions have to actual safe driving practices. permalink parent award report block reply\nSTONKATRUCK 11 points 5 days ago They hand out voter registration in any language too permalink parent award report block reply MarshallB 5 points 5 days ago See! One Mistake ALWAYS leads to more grievous mistakes. Of course there are ton's of prior mistakes to choose from. permalink parent award report block reply\nMarshallB 5 points 5 days ago See! One Mistake ALWAYS leads to more grievous mistakes. Of course there are ton's of prior mistakes to choose from. permalink parent award report block reply\nTwoArizonaPedes 5 points 5 days ago When I took my driver's test in California they offered it in more than 30 languages. I asked the DMV counter person why someone could take the test in another language if they couldn't read road signs in English and she just shrugged. permalink parent award report block reply\nMarshallB 2 points 5 days ago One mistake always leads to more grievous mistakes. permalink parent award report block reply Oldman1234 3 points 5 days ago It's called \"The Snowball Effect\". permalink parent award report block reply\nOldman1234 3 points 5 days ago It's called \"The Snowball Effect\". permalink parent award report block reply\nkeeman 1 points 5 days ago And the tests are designed to be passed if you just memorize all the answers.  You could do the test in Klingon and the people who study for it would still pass.  It is government make-work.  Look at the questions and ask yourself what relationship those questions have to actual safe driving practices. permalink parent award report block reply\nGA_Logic 11 points 5 days ago It is also dangerous to hand out ID cards to any illegal.  But at this point illegals can apply for home loans which is a big driver for single family housing shortages. permalink award report block reply\nhughjasske69 8 points 5 days ago This doesn't pertain to illegals, but just anyone in general who pulls/drives a large RV.   90% are geriatric blue hairs and shouldn't be driving anything let alone a RV....or worse, towing a large goose neck with a boat behind that. permalink award report block reply Hantif 3 points 5 days ago Yep, I had to take tests to get my double/triple endorsement on my CDL but Harry, the 80 year old retired accountant, can tow his boat behind a fifth wheel trailer using a standard license. permalink parent award report block reply glow-operator-2-0 2 points 5 days ago If it's under 6500 lbs was the cut off  class C. Most oversized RV and boat trailer assholes need a class B. permalink parent award report block reply hughjasske69 2 points 5 days ago And he will eventually try to pull through the McDonald's to drive through with it permalink parent award report block reply Rockfish 2 points 5 days ago 90% is a big number, young man permalink parent award report block reply hughjasske69 3 points 5 days ago I'm old too permalink parent award report block reply\nHantif 3 points 5 days ago Yep, I had to take tests to get my double/triple endorsement on my CDL but Harry, the 80 year old retired accountant, can tow his boat behind a fifth wheel trailer using a standard license. permalink parent award report block reply glow-operator-2-0 2 points 5 days ago If it's under 6500 lbs was the cut off  class C. Most oversized RV and boat trailer assholes need a class B. permalink parent award report block reply hughjasske69 2 points 5 days ago And he will eventually try to pull through the McDonald's to drive through with it permalink parent award report block reply\nglow-operator-2-0 2 points 5 days ago If it's under 6500 lbs was the cut off  class C. Most oversized RV and boat trailer assholes need a class B. permalink parent award report block reply\nhughjasske69 2 points 5 days ago And he will eventually try to pull through the McDonald's to drive through with it permalink parent award report block reply\nRockfish 2 points 5 days ago 90% is a big number, young man permalink parent award report block reply hughjasske69 3 points 5 days ago I'm old too permalink parent award report block reply\nhughjasske69 3 points 5 days ago I'm old too permalink parent award report block reply\nBeat_to_Quarters 5 points 5 days ago Also they always like to say black people are too dumb to figure out how to obtain any form of ID and that prevents them from voting, but states will hand out ID and drivers licenses willy nilly to illegal aliens. permalink award report block reply\nTrancePhreak 5 points 5 days ago I 100% agree. permalink award report block reply\nCdope45 5 points 5 days ago When I turned 16 I went to the DMV to take my test. I had to make two different trips to get all various documents they needed because the DEI hire working the desk couldn't be bothered to tell me what all I needed to provide. After a couple of hours I was able to take my test and submit my driving log. Meanwhile, a guy who couldn't speak English and was probably illegal was able to get a license after signing a few documents. Citizens have to jump through multiple hoops while foreigners just sign their names. permalink award report block reply\nbillhound 4 points 5 days ago To be fair, you're using logic. permalink award report block reply\nSpeekFreely 4 points 5 days ago The size and weight of the vehicle for starters. Also CDL operators fall under Federal Regulations permalink award report block reply\nRoadpower 2 points 5 days ago Non commercial drivers are not held to the same standards as professionals because the non professional isn't involved in commerce and frequent interactions with various enforcement agencies and they aren't carrying cargo including vehicle mass that poses potentially significant dangers to the public. The road signs are one thing but the reality is that reading ability of road signs are not the main concerns. Especially when the signs of importance are already in a universal language like the color of traffic lights, stop signs, yield signs, no U turn signs, do not enter signs, etc. If you can't read or won't abide by those you are already someone who should not be behind a steering wheel anywhere in the world. permalink award report block reply\nReclaimer69 2 points 5 days ago Air breaks and the total vehicle weight? permalink award report block reply\nPsarg 2 points 5 days ago A fender bender on a car is 3 people killed in an 18 wheeler. permalink award report block reply\nCaliBlonde 1 points 5 days ago California written tests come in 35 different languages, and before you can even schedule an appointment to take the test, you must register to vote.  My 20-year-old neighbor failed the written test 6 times.  On his 7th attempt, the DMV allowed him to take the test at home. permalink award report block reply\nTwoArizonaPedes 1 points 5 days ago Asking the right questions. permalink award report block reply\nkeeman 1 points 5 days ago Are you under the impression that the DMV's purpose in handing out drivers licenses is in any way related to verifying that the driver is road safe?  Their purpose is to take your money and issue you your tax-animal livestock tracking card which they promised would never be used as a form of government ID when they started the system up. permalink award report block reply\nMythArcana 1 points 5 days ago We should ask Arnold Schwarzenegger who issued drivers licenses to illegals in California. And, of course, they were automatically registered to vote as a bonus. permalink award report block reply\nschiff_for_brains 1 points 5 days ago You aren't wrong.  But street signs have been internationalized to help foreign drivers across the world.  Many countries will reciprocate with your US driver's license, even though they drive on the silly side of the road, or you can make your own lane if you fit, and such.  The red octagon with a white rim always means stop, no matter where you are. permalink award report block reply\nHikedelics 1 points 5 days ago It isn’t. I’m sure some cuck will make the argument that the consequences of an 18-wheeler accident are far greater than a regular passenger vehicle, but a passenger vehicle can cause 18-wheeler accidents by behaving like a retard on the road since they can’t read any of the signs. permalink award report block reply\nthe-new-style 1 points 5 days ago Federal law states you must be capable of providing an accident report in English, either in writing or orally to an officer. permalink award report block reply\nmikethemarine 1 points 5 days ago it's not OK to get one, if you have ever gotten a drivers license from another country, guess what, ALL Americans are considered professional drivers and if you get into and accident in their country you are automatically at fault, cause we are professionals, they all know they can't drive, they are all an accident waiting to happen, don't give them one ate all permalink award report block reply\nPhantomShield72 1 points 5 days ago Also: If it's dangerous to buy alcohol without an ID, why is it okay to vote without one... permalink award report block reply\nStandingoak 1 points 5 days ago If drivers Licenses were originally only for someone driving a team (usually 8) of horses hauling commercial cargo and everyone else got \"MANDATED\" into getting them for personal travel and now there are NO requirements ; Why must we have Drivers Licenses ? permalink award report block reply\nInficant 1 points 5 days ago Because you need 1/100th of the knowledge, have a lot less risk, and basic driving is basic. Don't ask retarded disengenuous questions.... permalink award report block reply\nHockeyMom4Trump 1 points 5 days ago It isn’t! permalink award report block reply\nHanginChad 1 points 5 days ago There are probably some compromises to allow foreign drivers that are here on business or vacation, some states will let you just swap out foreign driver's licenses for US ones. When someone goes to Germany for a vacation or business, should they also be required to pass a German test to drive a rental car there? Or should one have to learn Arabic to drive in the UK? It's not a perfect system, but I agree at least the written test should only be given in English. When I was taking the test I had the option of a few languages. permalink award report block reply MarshallB 1 points 5 days ago That's an easy one. YES! permalink parent award report block reply\nMarshallB 1 points 5 days ago That's an easy one. YES! permalink parent award report block reply\nboomerbutnotOKBoomer 1 points 5 days ago Well, for one, a semi can weigh up to 50,000 pounds and that slamming into you is far worse than a Prius slamming into you... There's a lot of reasons the CDL is more complex than a regular driver's license FFS... permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:48.139779Z"
}