{
  "id": "1ARK9jzcYQ",
  "url": "https://patriots.win/p/1ARK9jzcYQ/robbystarbuck-why-is-antifa-stil/c",
  "content": "764 @robbystarbuck: Why is Antifa still allowed to terrorize 🇺🇸 @FBI? posted 1 day ago by blue5707 31 comments award share report block Robby Starbuck @robbystarbuck • 2d Why is Antifa still allowed to terrorize 🇺🇸 @FBI? Savanah Hernandez @Savsays • 2d UC Berkeley is currently a war zone and ANTIFA has tried to rush the barriers into tonight’s TPUSA event multiple times. The crowd is getting more and more rowdy.\n31 comments Sort by Top Top New Worst Old Save DenturesNancy 28 points 1 day ago because the fblie is working extra hard at hiding scandals and cash is flying around for his booty calls permalink award report block reply Klaus73 9 points 1 day ago Nah....everytime they make a bust they realize its their own guys. permalink parent award report block reply TheGreenDragon 22 points 1 day ago Because Kash is a backstabbing Maga useless POS and his Honey Pot is keeping distracted. permalink award report block reply Scot 21 points 1 day ago Same FBI dedicated THOUSANDS of agents and millions of dollars to hunt down January 6th patriots. permalink award report block reply MemoryHoleyeO 15 points 1 day ago FBI needs to have agents going undercover like they did with the neo Nazi groups.  I bet they aren't permalink award report block reply Aggrieved03 23 points 1 day ago They're undercover helping Antifa just like J6. permalink parent award report block reply alcowiggles 15 points 1 day ago Ka$h \"Money\" Patel. permalink award report block reply xkgb 4 points 1 day ago Kash is an unregistered foreign agent of China. permalink parent award report block reply Saxonlady 9 points 1 day ago If only all the tough talking translated into action eh! permalink award report block reply barwhack 9 points 1 day ago Because they are in on it. ALL of they are in on it. Uniparty And MAGA has been softly relegated by Trump's very own people ... permalink award report block reply TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply borisborscht 8 points 1 day ago FBI and Antifa are run by the same people permalink award report block reply Wildwind 6 points 1 day ago Why are antifa members not locked up as terrorists? permalink award report block reply Mike_Hoxbigg 4 points 1 day ago Live ammo, put 'em all down. Never happen though. MUH OPTICS! permalink award report block reply PhilipeNegro 4 points 1 day ago Shoot. Then, shoot again. permalink award report block reply Aggrieved03 4 points 1 day ago Cause Trump picks losers! permalink award report block reply mikethemarine 4 points 1 day ago And how do you fix this? Easy if they have a face mask on the know they are going to be causing trouble and don't want to be known, the other people showing their faces are just there cause they are stupid followers, start popping a cap off on the ones with face masks, and the problem will go away. I have had enough of them terrorizing this country, violence MUST be meet with violence permalink award report block reply MemeWarsVet 2 points 1 day ago Because it's all a work. permalink award report block reply Alphahorizon 2 points 1 day ago Where does this buck stop if not the top? permalink award report block reply MAGALADON9 1 points 1 day ago HOW CON DEY SCHLAPPPPP permalink award report block reply SteveRogers42 1 points 1 day ago I wonder what Bukele would do? permalink award report block reply knnbccb 1 points 1 day ago Just execute a few high profile organizers and sponsors of their 'movement', and watch them scatter away like the morning mist. permalink award report block reply patrioticwinning3 1 points 1 day ago Patel is compromised! https://archive.is/ptJG5 permalink award report block reply BigIglooActual 1 points 1 day ago Aren't they a terrorist organization now? We just allow terrorists to obstruct and attack law enforcement on american soil? permalink award report block reply DCYR66 1 points 1 day ago I guess terrorists have the right to do what they do now. Especially the domestic ones! permalink award report block reply Goozmania -2 points 1 day ago Because there is no such thing as a \"domestic terror organization,\" and thus, there is no legal jurisdiction to stop them. permalink award report block reply mydogma8yourkarma 11 points 1 day ago We already have laws to protect against violent protests.  \"Anytime, Anyplace, punch a fascist in the face\" as they're lighting shit on fire doesn't sound peaceful.  Shame we don't enforce it. However since they are the fascists shutting down free speech, I think we should take their advice. permalink parent award report block reply mojorisen 4 points 1 day ago This is correct.  The whole labeling Antifa as terrorist is basically just for show. permalink parent award report block reply MastaJoda 2 points 1 day ago great, another ''Trump win.'' like Biden level spending ''clean CR...' permalink parent award report block reply SaxonRealm 2 points 1 day ago We have the Patriot Act. We can do whatever we want. permalink parent award report block reply\nDenturesNancy 28 points 1 day ago because the fblie is working extra hard at hiding scandals and cash is flying around for his booty calls permalink award report block reply Klaus73 9 points 1 day ago Nah....everytime they make a bust they realize its their own guys. permalink parent award report block reply\nKlaus73 9 points 1 day ago Nah....everytime they make a bust they realize its their own guys. permalink parent award report block reply\nTheGreenDragon 22 points 1 day ago Because Kash is a backstabbing Maga useless POS and his Honey Pot is keeping distracted. permalink award report block reply\nScot 21 points 1 day ago Same FBI dedicated THOUSANDS of agents and millions of dollars to hunt down January 6th patriots. permalink award report block reply\nMemoryHoleyeO 15 points 1 day ago FBI needs to have agents going undercover like they did with the neo Nazi groups.  I bet they aren't permalink award report block reply Aggrieved03 23 points 1 day ago They're undercover helping Antifa just like J6. permalink parent award report block reply\nAggrieved03 23 points 1 day ago They're undercover helping Antifa just like J6. permalink parent award report block reply\nalcowiggles 15 points 1 day ago Ka$h \"Money\" Patel. permalink award report block reply xkgb 4 points 1 day ago Kash is an unregistered foreign agent of China. permalink parent award report block reply\nxkgb 4 points 1 day ago Kash is an unregistered foreign agent of China. permalink parent award report block reply\nSaxonlady 9 points 1 day ago If only all the tough talking translated into action eh! permalink award report block reply\nbarwhack 9 points 1 day ago Because they are in on it. ALL of they are in on it. Uniparty And MAGA has been softly relegated by Trump's very own people ... permalink award report block reply TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nborisborscht 8 points 1 day ago FBI and Antifa are run by the same people permalink award report block reply\nWildwind 6 points 1 day ago Why are antifa members not locked up as terrorists? permalink award report block reply\nMike_Hoxbigg 4 points 1 day ago Live ammo, put 'em all down. Never happen though. MUH OPTICS! permalink award report block reply\nPhilipeNegro 4 points 1 day ago Shoot. Then, shoot again. permalink award report block reply\nAggrieved03 4 points 1 day ago Cause Trump picks losers! permalink award report block reply\nmikethemarine 4 points 1 day ago And how do you fix this? Easy if they have a face mask on the know they are going to be causing trouble and don't want to be known, the other people showing their faces are just there cause they are stupid followers, start popping a cap off on the ones with face masks, and the problem will go away. I have had enough of them terrorizing this country, violence MUST be meet with violence permalink award report block reply\nMemeWarsVet 2 points 1 day ago Because it's all a work. permalink award report block reply\nAlphahorizon 2 points 1 day ago Where does this buck stop if not the top? permalink award report block reply\nMAGALADON9 1 points 1 day ago HOW CON DEY SCHLAPPPPP permalink award report block reply\nSteveRogers42 1 points 1 day ago I wonder what Bukele would do? permalink award report block reply\nknnbccb 1 points 1 day ago Just execute a few high profile organizers and sponsors of their 'movement', and watch them scatter away like the morning mist. permalink award report block reply\npatrioticwinning3 1 points 1 day ago Patel is compromised! https://archive.is/ptJG5 permalink award report block reply\nBigIglooActual 1 points 1 day ago Aren't they a terrorist organization now? We just allow terrorists to obstruct and attack law enforcement on american soil? permalink award report block reply\nDCYR66 1 points 1 day ago I guess terrorists have the right to do what they do now. Especially the domestic ones! permalink award report block reply\nGoozmania -2 points 1 day ago Because there is no such thing as a \"domestic terror organization,\" and thus, there is no legal jurisdiction to stop them. permalink award report block reply mydogma8yourkarma 11 points 1 day ago We already have laws to protect against violent protests.  \"Anytime, Anyplace, punch a fascist in the face\" as they're lighting shit on fire doesn't sound peaceful.  Shame we don't enforce it. However since they are the fascists shutting down free speech, I think we should take their advice. permalink parent award report block reply mojorisen 4 points 1 day ago This is correct.  The whole labeling Antifa as terrorist is basically just for show. permalink parent award report block reply MastaJoda 2 points 1 day ago great, another ''Trump win.'' like Biden level spending ''clean CR...' permalink parent award report block reply SaxonRealm 2 points 1 day ago We have the Patriot Act. We can do whatever we want. permalink parent award report block reply\nmydogma8yourkarma 11 points 1 day ago We already have laws to protect against violent protests.  \"Anytime, Anyplace, punch a fascist in the face\" as they're lighting shit on fire doesn't sound peaceful.  Shame we don't enforce it. However since they are the fascists shutting down free speech, I think we should take their advice. permalink parent award report block reply\nmojorisen 4 points 1 day ago This is correct.  The whole labeling Antifa as terrorist is basically just for show. permalink parent award report block reply MastaJoda 2 points 1 day ago great, another ''Trump win.'' like Biden level spending ''clean CR...' permalink parent award report block reply\nMastaJoda 2 points 1 day ago great, another ''Trump win.'' like Biden level spending ''clean CR...' permalink parent award report block reply\nSaxonRealm 2 points 1 day ago We have the Patriot Act. We can do whatever we want. permalink parent award report block reply",
  "fetched_at": "2025-11-12T21:22:55.506751Z"
}