{
  "id": "1ARK5AA7rH",
  "url": "https://patriots.win/p/1ARK5AA7rH/ice-is-now-conducting-raids-on-t/c",
  "content": "427 ICE is now conducting raids on the Hawaiian island of Kauai! DOZENS of Tren de Aragua gang members were just apprehended, and more raids are expected! You CANNOT hide from ICE. Even on an island thousands of miles from the US mainland. posted 3 days ago by LightBeacons 10 comments award share report block Nick Sortor @nicksortor • 3d 🚨 HOLY CRAP! ICE is now conducting raids on the Hawaiian island of Kauai DOZENS of Tren de Aragua gang members were just apprehended, and more raids are expected You CANNOT hide from ICE. Even on an island thousands of miles from the US mainland. They’re ALL going back! 🔥\n10 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil linereddit 7 points 3 days ago Time to follow that money! permalink award report block reply PosterIsDead 4 points 3 days ago Aloha means goodbye! permalink award report block reply JtBlaze 3 points 3 days ago I voted for this. permalink award report block reply Ryanaissance 2 points 3 days ago On Kauai, tren de aguara asked for shaved ice but instead ICE shaved them permalink award report block reply Lmn8rinos 2 points 3 days ago Book  ‘em Danno permalink award report block reply dukeofdoorcounty 2 points 3 days ago Who's gonna pick the coffee? permalink award report block reply m0r1arty 1 points 3 days ago Magnum never claims the credit. He's a good guy. permalink award report block reply _Sully_ 1 points 3 days ago Oh nice, now I should be able to afford that shack plopped right on top of that old lave flow. permalink award report block reply splink 1 points 3 days ago Well, stands to reason the dealers and stealers are going to be the guys with the $$ to be in a place like Kauai. permalink award report block reply HanginChad 1 points 3 days ago It's probably harder on an island. But also, how did they get there? Did they swim? Why weren't they apprehended at the airport? permalink award report block reply\nlinereddit 7 points 3 days ago Time to follow that money! permalink award report block reply\nPosterIsDead 4 points 3 days ago Aloha means goodbye! permalink award report block reply\nJtBlaze 3 points 3 days ago I voted for this. permalink award report block reply\nRyanaissance 2 points 3 days ago On Kauai, tren de aguara asked for shaved ice but instead ICE shaved them permalink award report block reply\nLmn8rinos 2 points 3 days ago Book  ‘em Danno permalink award report block reply\ndukeofdoorcounty 2 points 3 days ago Who's gonna pick the coffee? permalink award report block reply\nm0r1arty 1 points 3 days ago Magnum never claims the credit. He's a good guy. permalink award report block reply\n_Sully_ 1 points 3 days ago Oh nice, now I should be able to afford that shack plopped right on top of that old lave flow. permalink award report block reply\nsplink 1 points 3 days ago Well, stands to reason the dealers and stealers are going to be the guys with the $$ to be in a place like Kauai. permalink award report block reply\nHanginChad 1 points 3 days ago It's probably harder on an island. But also, how did they get there? Did they swim? Why weren't they apprehended at the airport? permalink award report block reply",
  "fetched_at": "2025-11-12T23:01:37.396642Z"
}