{
  "id": "1ARK5BG2bc",
  "url": "https://patriots.win/p/1ARK5BG2bc/hackeem-jeffries-says-that-democ/c",
  "content": "829 Hackeem Jeffries says that \"Democrats are definitely going to win control of the House in 2026\". (www.breitbart.com) posted 3 days ago by Landslide_2020 224 comments award share report block Jeffries: 'Democrats Are Definitely' Going to Win Control of the House in 2026 Sunday on NBC's \"Meet the Press,\" House Minority Leader Hakeem Jeffries (D-NY) predicted his party would take control of the House of Representatives in the 2026 midterm elections. | Clips www.breitbart.com\n224 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style StoneRealist 163 points 3 days ago They damn well could if Rs don't start making progress permalink award report block reply Run_over_Antifa 121 points 3 days ago R's lose on purpose, when is everyone going to realize this. permalink parent award report block reply deleted 53 points 3 days ago MasterChief08 22 points 3 days ago Marching on Washington will never happen. The right needs its own antifa like faction. Intimidation clearly worked for the left. Clinton and Obama took down hundreds of right wing militia even when they obeyed every law. It's time to rebuild permalink parent award report block reply chickeninoven 17 points 3 days ago Democrats twists themselves into pretzels trying to pretend Antifa doesn't exist, while saying things like \"I don't see why we don't have uprisings all over the country\" (Nancy Pelosi). Meanwhile Repubes trip over themselves disavowing and condemning even the most innocent organizing on the right. permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 14 points 3 days ago It will never happen for a lot of reasons, some of which you've mentioned. In general, people are too fat, happy, and comfortable for any meaningful revolution to happen. They also do not want to face the reality that doing so surely means killing other Americans, and particularly LEOs, feds, etc. TPTB will never let things get bad enough to actually urge people to make dramatic changes. We will continue to vote while the Overton Window shifts against us. It's like trying to push a massive boulder up a hill to keep from being rolled over; it's a losing endeavor. Additionally, we will likely never see an Antifa-like organization on the Right. 90% of people here would just call them feds. We saw the same with Patriot Front. And while I don't particularly trust PF, it's a good gauge for how the Right would treat any such organization. permalink parent award report block reply Executarian2 6 points 3 days ago Isn't that what the Proud Boys are supposed to be? Or was that just a bunch of feds? permalink parent award report block reply view 6 more comments... alucard13mmfmj 4 points 3 days ago This. Complacency fot another 4 to 10 years. permalink parent award report block reply vongregormench 8 points 3 days ago They abandoned like 6 seats and had one guy ejected. permalink parent award report block reply Cablespider 5 points 3 days ago They are benchwarmers for the same team. permalink parent award report block reply Kelemor88 3 points 3 days ago Yup can’t make money unless your in 2nd place asking for donations. permalink parent award report block reply ShitFromShinola 1 points 3 days ago That's because they suck at it. They are great at throwing stones and attacking Democrats, but are literally unable to govern. permalink parent award report block reply load 4 more comments... BlackPilledMAGA 32 points 3 days ago They will cheat like 2020. permalink parent award report block reply TDBabyBite 23 points 3 days ago Or 2024..all the close smaller elections magically went to dems. Or took weeks to count permalink parent award report block reply HeavyMetalPatriot 10 points 3 days ago And then nothing was done about any of those elections. Insane. permalink parent award report block reply TheTruthAlwaysWins 14 points 3 days ago It's going to make 2020 look like a cake walk. They just ran a test run, 7 bomb threats in republican areas. This will be at scale at midterms. Midterm elections decides our fate, and if we fail, the entire world falls too, because we're the only country capable of keeping peace.  No other country has a constitution like ours. If the dems take midterms, they will immediately impeach Trump, charge and incarcerate him, if not outright murder him. You think 2020 was bad? Midterms and the leadup will make 2020 look like a walk in the park. The muslims are getting more bold, Antifa is still walking the streets, cartels are here, the chineese are here, and the dung of random illegals from across the globe.  It was just a week back that an October 7th (or whatever day it was) terrorist was caught in Louisiana. There's no way to eliminate the threats before midterms. The bad guys are constantly pushing violence. It will likely tone down now some until next spring. TrAntifa doesn't seem to like working at night in the cold. That's a pattern too. I expect all of next year to be a steady increase in violence from their usful idiots. Just my take. permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply clownworld30330 1 points 2 days ago And the GOP will let them. permalink parent award report block reply maverick202 -1 points 3 days ago Lol nice cope.. Everytime Republicans lose, it's mUh RIgGeD eLeCtIoN!! permalink parent award report block reply DT170x 3 points 3 days ago It kinda is. Republicans needed about 60% anything less it most likely going to be a 51/49 split. permalink parent award report block reply UCantStumpTheTrump 3 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 2 points 3 days ago It's kinda not. Go out of your house and talk to people and you'll know democrats support is real. permalink parent award report block reply view 7 more comments... ShitFromShinola 3 points 3 days ago It's total horseshit. Literally no one is sniveling about muh rigged election because they don't exist. R's got shellacked because their policy sucks a fattie. permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 0 points 2 days ago On a scale from 0 to complete cucks.. How mad are you at this video, son? https://x.com/CollinRugg/status/1987957838535328174 permalink parent award report block reply view 6 more comments... EgregiousPhilbin 7 points 3 days ago I'm not voting for any of em. Weak faggots. Stone cold losers. permalink parent award report block reply The_Emperor 5 points 3 days ago I hate being a member of the defeatist party.\nVote or Die!  Commies always worse.  We truly are a silent majority. permalink parent award report block reply EgregiousPhilbin 5 points 3 days ago How does it feel enabling this endless RINO hell that we are in? I bet it feels retarded. permalink parent award report block reply KernalMustard 2 points 3 days ago Who says I part of this shit show any more. I'm not a Trump supporter anymore-Trumps words. permalink parent award report block reply MastaJoda -1 points 3 days ago remember 1/2 the people you meet are dumber than you. *See commentabove you. The RINO Party is clearly the surrenderist party, and the cucks cant support them hard enough no matter how many times they fail them (on purpose). permalink parent award report block reply ColonelKlink 6 points 3 days ago Removal of voter fraud must be a priority. permalink parent award report block reply MastaJoda 3 points 3 days ago Which is why Thune wont nuke the filibuster and get election security racheted all the way up before the midterms. permalink parent award report block reply patrioticwinning3 2 points 3 days ago Zero riggers arrested = zero incentive not to rig. permalink parent award report block reply load 15 more comments... DJT_MFers1 55 points 3 days ago That is the confidence of a person who knows election fraud will never change. permalink award report block reply FaRmErX2000 22 points 3 days ago OR trumps “red hot” economy is actually ice cold.. permalink parent award report block reply Simple_Doot 8 points 3 days ago And he is not MAGA if we go by 2016-2024 standards.  He's just plain old neocon and the O.G. MAGA people are very turned off by the bizarre change. permalink parent award report block reply DrWeeGee 11 points 3 days ago I'm sick of Israel permalink parent award report block reply LineInTheSand 4 points 3 days ago I'm never going to forget that pedophiles in powerful positions were allowed to get away with it. permalink parent award report block reply Chickensaurus 8 points 3 days ago Same fraud that gave Republicans the House, Senate, and White House?  No... the Republicans have had 10 months to do something meaningful and lasting. They passed the Laken Riley act. Nothing else. Hardly enthusiastic to vote R next year. Worthless. permalink parent award report block reply Executarian2 46 points 3 days ago Right now, he's definitely right. If you're saying otherwise, you're either lying or coping. We have to play like we're ten points behind and actually start doing shit that matters, like decreasing inflation. Instead, we're spending millions on primarying fucking Thomas Massie and sending billions to Israel. If this continues, we deserve to lose. If the same results from this Tuesday happen next year, we could very well lose the Senate, too. MAGA has to get its shit together permalink award report block reply DrCowboyPresident 25 points 3 days ago Anytime Republicans get power through populism, MIGA and the Neocons try to hijack the movement and tear it apart. permalink parent award report block reply Executarian2 19 points 3 days ago That's why we have to destroy MIGA, vote out every single Randy Fine and tell Trump to fuck off when he's taking hundreds of millions of Miriam Adelson and selling us to the Jews. permalink parent award report block reply FaRmErX2000 11 points 3 days ago Separate church and state and separate tel aviv from wshjngton permalink parent award report block reply Goozmania 4 points 3 days ago Impossible when maga doesn't vote. 70% of Republicans don't vote in non-presidential general elections. Trump won with low propensity voters. It's the only reason he won. They're going back to low propensity permalink parent award report block reply ConfusedAngryArmed 12 points 3 days ago They don't just try, they succeed. But God forbid you mention the staggering control that Jews and Israel have over our country. It's getting better, for sure, at least now you can openly talk about it here without getting banned. permalink parent award report block reply KernalMustard -1 points 3 days ago Tea party for example was taken over by the Christian right when its a more libertarian movement. That killed support. And like sheep you follow and do their bidding. People are manlipulated and dont even know it. History repeats itself. permalink parent award report block reply MediaBro -1 points 3 days ago Exactly. MAGA was supposed to be the moderate Right taking back the country. It's why ppl like RFK Jr. and Tulsi Gabbard joined the movement. Then the White Christian Evangelical nutjobs decided to take control of the movement and they seemingly opened the door to the White Supremacists. Now you have ppl here shitting on Usha Vance for her being Hindu. Are we also going to shit on Tulsi Gabbard for being a Hindu? Faith has always been a private matter in the US and as long as you don't use religion to push your shit, no one gave a fk. Now apparently, if we're not all White Catholics or White Evangelicals, who don't believe Jesus is about to show up soon, apparently we don't get to be in the US or live and prosper, despite this being a thing for decades now. It doesn't work like that and all this will do will create an absolute hellscape for everyone permalink parent award report block reply LineInTheSand 5 points 3 days ago You have some very odd ideas of the MAGA movement and religion. Faith has not \"always been a private matter\".  People used to be very public and open about their faith.  In the 1950s, they even displayed crosses using the lights of skyscrapers in New York .  Over time, religion became taboo to express in public.  Now, Christians get arrested for praying within 150 meters of an abortion clinic in the UK. Like it or not, the US was founded on Christian values and principles.  We have strayed from those values, and let leftism take control of our cities and institutions.  Do you see the disaster the left has caused in every major city they control?  Do you see the corruption and rot our country endures because of people who live only for themselves and only preach about bettering society, but never give up their power or money like they tell others to do? I suggest you listen to Paul Harvey's \" If I Were The Devil \" speech from 1965.  It is scary how accurate he was about the destruction of America. \"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\" - The Usual Suspects (1995) permalink parent award report block reply TheAttackTitan 4 points 3 days ago Considering it was D+10 nationwide this last election I’d say we need to play more like we’re 20 points behind permalink parent award report block reply starjello 1 points 3 days ago Stop that. Feel upset the retards around here that can't deal and what really happened last Tuesday. They can't read the tea leaves around here they're such cultists permalink parent award report block reply FBIsurveillance 3 points 3 days ago Your telling me you dont support the united states of AIPAC? Not very kosher of you permalink parent award report block reply tingo999 -3 points 3 days ago Doing weapons deals with Israel doesn't cause inflation. Both you and Massie are fucking retards. permalink parent award report block reply Executarian2 7 points 3 days ago Sending billions of dollars to Israel while Americans are unable to afford groceries is fucking retarded. Fuck you, and fuck the Jews. permalink parent award report block reply Prof_Smith 29 points 3 days ago I believe it.  Republicans can’t get anything done.   We just saw that no one turns out for republicans.  They do for Trump but congressional republicans continue to suck. Watch them cave in the shutdown.  By next year NPR will be getting more money than they were before. permalink award report block reply Executarian2 7 points 3 days ago Republicans CAN win if we put in common sense conservatives like Thomas Massie, actual populists who are America First. Instead, we put in Israel first shills like Randy Fine, who fucking hate America and would sell everything we have to the Jews. permalink parent award report block reply Chango3 7 points 3 days ago Massie has let us down on votes 100%. Prove me wrong. permalink parent award report block reply Executarian2 3 points 3 days ago Congress has let us down. Massie is one of the only truly America First Congressmen who isn't taking millions from AIPAC. permalink parent award report block reply Corse46 6 points 3 days ago Massie lol. The guy who helped out his buddy Kevin McCarthy, and voted in 2023 to COMPLETELY suspend the debt ceiling for Biden's entire term (ending Jan 2025). Yes, the man who walked around with a \"debt clock\" pin, helped add trillions of that debt himself. If Trump were a Democrat, Massie would've voted to raise (or suspend) the debt ceiling for him. permalink parent award report block reply wartooth6 6 points 3 days ago He also voted to honor George Floyd, but refused to do so for Charlie Kirk (because principles I guess) permalink parent award report block reply ragnarokrobo 2 points 3 days ago You mean \"my kevin\" Mccarthy as Trump called him? permalink parent award report block reply Executarian2 2 points 3 days ago Massie hasn't been perfect, but he has one of the highest liberty scores and has never taken a cent from a foreign nation, something that almost no other Congressmen can say. permalink parent award report block reply Prof_Smith 3 points 3 days ago I wouldn’t trust or vote for Massie at all. He’s a theatre production for opposition to the republicans which makes him a democrat sympathizer in my book.   You cannot count on him. permalink parent award report block reply KernalMustard 5 points 3 days ago Like we can trust the rest of the Republicans? permalink parent award report block reply Prof_Smith 2 points 3 days ago Nope.  Doesn't mean I trust Massie.  He's a fucking drama queen. permalink parent award report block reply MediaBro 0 points 3 days ago Apparently, the consensus here seems to be to not trust anyone. And this is why you dumbasses lose over and over again. Nobody gets 100% of what they want. You gotta understand that compromise has to happen. If neither side is compromising on anything, then its war. And I think ppl here want war. And with war, a new hell opens up. permalink parent award report block reply eclectic22 0 points 3 days ago lol, one asshole is not enough for you permalink parent award report block reply Viewer01 17 points 3 days ago All hinges on whether America first purges Zionist neo cons or vice versa. Also the economy. permalink award report block reply Executarian2 10 points 3 days ago Instead, we'll spend $100 million on trying to primary Thomas Massie and lose fifty seats in the House. permalink parent award report block reply Viewer01 8 points 3 days ago Yea that was wild hearing a gambling jewess is taking her ass to Kentucky to pick on massie. permalink parent award report block reply crackerstacker 12 points 3 days ago If the economy keeps rolling over it could well happen. permalink award report block reply eclectic22 -8 points 3 days ago the economy is booming, what are you smoking? permalink parent award report block reply MastaJoda 6 points 3 days ago definitely not crack like you, fuckhead. permalink parent award report block reply Executarian2 5 points 3 days ago In what world is the economy booming? permalink parent award report block reply KernalMustard 5 points 3 days ago Trumps world. permalink parent award report block reply HeavyMetalPatriot 4 points 3 days ago Must be nice there. Very unlike 2025 America. permalink parent award report block reply Brandon1776 10 points 3 days ago He probably isn't wrong permalink award report block reply noPTSDforMePlease 8 points 3 days ago Look at who said it. He will never say they won't win the house. What's he going to do, go on national TV and say his own party is weak and losing? Ha ha no permalink award report block reply Gilliais 10 points 3 days ago Exactly. His prediction is meant to encourage his demoralized team. He isn’t even talking to us. Why give this attention. permalink parent award report block reply TrumpYouMagaFrenner 3 points 3 days ago To mock him. Because only someone as dumb as him could be that foolish. permalink parent award report block reply DefenderDad 5 points 3 days ago They are. Because Rinos don’t want to win. They are selling the country out and cannot get in on the grift if they enact stuff that literally makes America Great Again. They could end the filibuster and cancel all H1Bs from any nation that has scam call centers stealing from American retirees. (China, Singapore and the great scam king India). Then we also add in no H1Bs for any nation trying to change our culture - India, China, and all of the Middle East get hit with that one. They would fix it fast to keep the remittance payments flowing. permalink award report block reply PosterIsDead 5 points 3 days ago He looks like a drunk pee-wee football coach. permalink award report block reply Datamancer 4 points 3 days ago Sorry, sombrero, you ain't getting jack and shit. permalink award report block reply Roadpower 4 points 3 days ago Trump may blame us for the loss because that is easier to do than to cut off his donors. permalink award report block reply Scot 3 points 3 days ago Oh course. Between massive voter fraud that hasn't been stopped and republicans who refuse to do ANYTHING we want, their chances of stealing back power are very high. permalink award report block reply MakeAmericaGreat9 3 points 3 days ago He's right. permalink award report block reply Califunya 3 points 3 days ago Why do Republican predictions lead to HUGE disappointment?!!  Dems predictions lead to fraudulent success!!???WTF permalink award report block reply DCYR66 3 points 3 days ago They will if our limp dick party doesn’t start fighting with the same energy they do. permalink award report block reply MeatShield72 3 points 3 days ago I mean. Probably. American voters are fucking retards, especially the R voters… permalink award report block reply clownworld30330 1 points 2 days ago Dominion voters in particular! permalink parent award report block reply HenkZeilstra 3 points 3 days ago ZERO ARRESTS, ZERO EO'S CODIFIED, USELESS SCUM permalink award report block reply jeigh44 3 points 3 days ago Cheat by mail!  Works every time! permalink award report block reply 24601 3 points 3 days ago Reminders.... Vote in the primaries. Vote early and in person in the general election. Stock up on ammunition. permalink award report block reply UnderHisWings 3 points 3 days ago Those eyes....He doesn't look human. permalink award report block reply Nellie_the_Beaut 2 points 2 days ago Like a monitor lizard. permalink parent award report block reply PepeMania 3 points 3 days ago Repeat of first term with congress permalink award report block reply Executarian2 1 points 3 days ago It's been over two decades since a midterm has been helpful for the president. permalink parent award report block reply Klown_Kutz 2 points 3 days ago We’re gonna hand it to them if we don’t get off our asses and vote like we did last year permalink award report block reply Cville123 2 points 3 days ago Probably.  But still voting R permalink award report block reply BTWiuseArch25 2 points 3 days ago Why yes hes correct, because the GOP is full of trans men sense they have no balls to do anything. permalink award report block reply grenades_and_ham 2 points 3 days ago Dopey Hakeem. permalink award report block reply Shaffro 2 points 3 days ago So they are going to try to cheat again? permalink award report block reply clownworld30330 1 points 2 days ago When have they not? permalink parent award report block reply MakeAmericaVapeAgain 2 points 3 days ago no they won’t. they are losing control of their ability to run propaganda. they will lose in bigger numbers than imagined permalink award report block reply BillyMahoney 2 points 3 days ago Cheaters have a way of predicting the future in voting. permalink award report block reply GreazyCheeks 2 points 3 days ago Does it matter? Republicans have all three branches now, and don't do shit. permalink award report block reply splink 2 points 3 days ago Is this kind of like when Rahm straight up stated he was going to be the mayor of Chicago and cackled...then he (surprise!) just was? permalink award report block reply B0bE 2 points 3 days ago Most likely. permalink award report block reply Nanteen 2 points 3 days ago Unless Republicans actually get off their fucking asses and pass some bills. Yeah that's what's going to happen permalink award report block reply For_All_Mankind 2 points 3 days ago I think he’s right tbh permalink award report block reply SlogKing 2 points 3 days ago He sure has that mulatto Frankenstein vibe going. permalink award report block reply JBlaze056 2 points 3 days ago Wake up from your delusional dream, Hakeem. permalink award report block reply raptormissle 1 points 3 days ago Temu Obama is scared that his job is in jeopardy. permalink award report block reply asiatrails 1 points 3 days ago Peso store, Obama is going to be surprised when the manure delivery arrives.  If it does not, then he will be correct. permalink award report block reply Wupta PRO 1 points 3 days ago Not if we get president Trucks safe act codified. permalink award report block reply clownworld30330 1 points 2 days ago Hahahaha right imagine Speaker Johnson (is he even 5ft?) passing any of the MAGA/AF agenda. permalink parent award report block reply MemeWarsVet 1 points 3 days ago Without high-profile deep state arrests AND massive voting reform, likely so. Because, as it stands, why wouldn't they continue to cheat? permalink award report block reply starjello 1 points 3 days ago The loser's here down vote you out of their pain. They can't deal in reality permalink parent award report block reply MegoThor 1 points 3 days ago Hakeem Jeffries should be deported. permalink award report block reply FusionBlack 1 points 3 days ago If that happens I'll be checking the exchange rate for Poland. permalink award report block reply f_bastiat 1 points 3 days ago Wouldn't surprise me, red team aside from Trump is doing a shit tier job. permalink award report block reply Goozmania 1 points 3 days ago He is correct. permalink award report block reply Boomstikchik 1 points 3 days ago Good luck with that, Dollar Store. permalink award report block reply Beachboy1b 1 points 3 days ago I’m sorry, are we just gonna ignore the fact that them getting back in power LITERALLY will end the country? Let me disabuse you all of the notion that we are still in a “vote them out” stage of government, because we are NOT. permalink award report block reply Executarian2 0 points 3 days ago What? You're using \"fact\" and \"LITERALLY\" incorrectly. permalink parent award report block reply Beachboy1b 1 points 3 days ago Am I though? Do you genuinely believe that they’re NOT going to try and completely FUCK the entire country as soon as they get any facet of real power? Unless you’ve been living under a rock, we have seen more than enough evidence that these people want us DEAD. permalink parent award report block reply Executarian2 0 points 3 days ago Being this terminally online is not healthy. permalink parent award report block reply Oleander 1 points 3 days ago I'm not the one you were talking to before, but I don't think you realize how close the Democrats are to total control. All it's going to take is disbanding border security, and/or a mass amnesty deal, and the deed is done. Republicans would not be viable as a national party anymore, imagine a blue Texas. They are definitely prepping their base to fall in line in favor of something like this by making border security a political issue, as well. I would be genuinely surprised if the next Democrat administration doesn't do this, so we are really only one Democrat away from the brink at this point. permalink parent award report block reply Pats5x 1 points 2 days ago It's part of the GOP plan....they've been in total power since 1/20/25.  Going on 10 months.  What have they accomplished?  A big beautiful bullshit bill that is way more mitt romney than maga...and a shitload of EOs that will be reversed the second Newsom takes office in 2029. permalink award report block reply VaultdwelIer 1 points 3 days ago the problem with republicans is that if things go bad they dont go out and vote but democrats vote blue no matter what permalink award report block reply Trump454748 1 points 3 days ago I must’ve missed something, is there a presidential election happening in 2026? permalink award report block reply Roadpower 3 points 3 days ago It's considered midterms for the president. Congress people are constantly running because of a two year election cycle. https://www.usa.gov/midterm-elections permalink parent award report block reply gezadreamsheets2 1 points 3 days ago Seems like that's what the GOP wants! They all fucking hate us permalink award report block reply MediaBro 1 points 3 days ago He is right. The Dems have a goal now, with Mamdani's win and they're clear they have enough legal and illegals to help them win that vote. The MAGA base has gone after even the moderate Independents who voted for MAGA in 2024, especially the non-White voters who voted for Trump. In attacking everyone who is not a White Christian and allowing Nick Fuentes to become the voice of MAGA, you'll have galvanised the worst of the Marxists to become the voice of reason and empathy. And that's a horrifying thought. So, yes, the Dems are going to sweep the midterms and win in 2026 and 2028, if this current climate continues. The only way the GOP wins again in 2026 or 2028 is if there is a massive turn in the economy and you'll muzzle the dumbfucks spouting their asinine comments on X. Free speech, where everyone is just calling everyone names, isn't going to win hearts and minds. permalink award report block reply FlyCatcher94 1 points 3 days ago Right. Because the GOP are cucks, and only care about vote payoffs.  Most of those fucks are compromised, and are unwilling to do anything right. permalink award report block reply KarenLukasik 1 points 3 days ago Since he’s wrong on just about EVERYTHING, this bothers me not at all… permalink award report block reply Executarian2 7 points 3 days ago Don't get complacent. permalink parent award report block reply KarenLukasik 1 points 2 days ago not complacent,just reassured by his rhetoric. Latest example: was Jeffries correct about the shutdown outcome? No,he wasn’t,so in the failure column it goes! permalink parent award report block reply Aggrieved03 1 points 3 days ago He ain’t wrong! permalink award report block reply AllTheWayTrump 1 points 2 days ago The cheating will never end and will only get worse because the cheaters have been emboldened. permalink award report block reply DoMe22 1 points 3 days ago Take this fucking threat seriously. Jesus Christ. The current administration needs to get something done. It feels like everyone around Trump, barring like 2 people are just dragging their heels. permalink award report block reply KernalMustard 0 points 3 days ago The ones who are pretty far from inner circle permalink parent award report block reply RizzlieDoodad 1 points 3 days ago Yes right. The Republicans won't get anything done and people will vote in the other party. The Republicans will just say, \"oh rats, we'll get em next time\" and the. Rinse and repeat permalink award report block reply Trumpvitative 1 points 3 days ago If there \"Republican\" politicians don't get their shit together they will permalink award report block reply 2025WhatIsTrue 1 points 2 days ago Hey...where's your sombrero, muchacho??? permalink award report block reply SonOfThunder 0 points 3 days ago The Republicans are working with him to make this happen. permalink award report block reply barwhack 0 points 3 days ago It doesn't matter who wins, if \"winning\" does not include the Epstard Files. The pedo system burns in any of the three ways; it's just who gets burned , that shifts around. permalink award report block reply deleted 4 points 3 days ago UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 0 points 3 days ago Right no one irl talk about or many doesn't even who who Epstein is. They don't have time to pay attention to this distraction while trying to work two jobs so they can pay rent, put food on the table and pay for gas/utility bills. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply rivetjoint2 0 points 3 days ago What is he going to do with his puppeteer Nancy? permalink award report block reply Alldayeveryday 0 points 3 days ago Of course they are gonna win. It's the plan. One big club and we ain't in it permalink award report block reply Deltamyass 0 points 3 days ago Ugly troll permalink award report block reply NoticesBugleOWO 0 points 3 days ago Over my dead body. permalink award report block reply Jrtomasejn 0 points 3 days ago Hahahaha.  Voter ID will wipe out the Democrat Party. permalink award report block reply KernalMustard 1 points 3 days ago You're a fool. They will take another route. A rat makes a new nest when discovered. permalink parent award report block reply Systemfree1632 0 points 3 days ago They are over confident in their cheating system . Why are we allowing this to continue ? permalink award report block reply DontTreadOnLego -1 points 3 days ago Now that California cheated to redistrict, Texas should redo their maps and get the additional few seats that they could have last time.  It is all out war. permalink award report block reply Executarian2 1 points 3 days ago Aren't both states now gerrymandered the same to wipe out five seats each? permalink parent award report block reply DontTreadOnLego 1 points 3 days ago Texas is not now.  Republicans could have gerrymandered but chose not to out of principle after ungerrymandering the demo-rat mess.  Now they should do it for retaliation for the cheating in Commifornia. permalink parent award report block reply Executarian2 1 points 3 days ago Oh, did Texas undo their map change? permalink parent award report block reply DontTreadOnLego 1 points 3 days ago No, the new map that is ungerrymandered is in place currently.  But it possible to gerrymander the current in the republican's favor. permalink parent award report block reply view 6 more comments... ImYourHuckleberry24 -1 points 3 days ago He's right, by cheating. There's nothing stopping them. permalink award report block reply Znut55 -1 points 3 days ago They have mastered cheating.  Look what happened in the election last week.  ALL the polls where wrong and no matter how much the Dems approval rating is in the tank, they soared in the election.  Make it make sense. permalink award report block reply Executarian2 6 points 3 days ago Stop blaming losses on cheating. There are plenty of substantive reasons why the Democrats whooped us on Tuesday, and sitting here complaining that \"well, we only lost because of CHEATING!\" is simply retarded. permalink parent award report block reply maverick202 1 points 3 days ago Why use critical thinking while we can just scream mUh RIgGeD eLeCtIoN!! permalink parent award report block reply Executarian2 2 points 3 days ago It's so fucking exhausting! Is voter fraud a problem? Maybe (it's fucking impossible to tell when every single lost election is declared to be fraudulent), but we can't just blame every loss on that. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply tlorsung -1 points 3 days ago Ok, Who is this Jeffries?   Did someone forget to tell him about DEM hit us, GOP Hit harder, lower, higher and most of all we'll cheat better then they did, has we learned from them!   Its On! permalink award report block reply Kickass2001 2 points 3 days ago Oh brother. permalink parent award report block reply Dwoj -2 points 3 days ago Yeah, not even in their wildest dreams permalink award report block reply Executarian2 6 points 3 days ago If the sentiment from last Tuesday continues into next year? We're fucked. No question about it. permalink parent award report block reply starjello 1 points 3 days ago You are exactly right. I said this the whole week since Tuesday's elections and all I get is grief and downvoting from the morons on here. permalink parent award report block reply oilybohunkofshit 2 points 3 days ago Comment removed by community moderators. permalink award report block reply Executarian2 1 points 3 days ago Nah, even if we lost every single Likely R and below seat, we'd still have like 45 in the Senate. You need 67 to remove. permalink parent award report block reply oilybohunkofshit 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply anymouse2233445566 1 points 3 days ago Comment removed by community filter, pending further review. permalink award report block reply\nStoneRealist 163 points 3 days ago They damn well could if Rs don't start making progress permalink award report block reply Run_over_Antifa 121 points 3 days ago R's lose on purpose, when is everyone going to realize this. permalink parent award report block reply deleted 53 points 3 days ago MasterChief08 22 points 3 days ago Marching on Washington will never happen. The right needs its own antifa like faction. Intimidation clearly worked for the left. Clinton and Obama took down hundreds of right wing militia even when they obeyed every law. It's time to rebuild permalink parent award report block reply chickeninoven 17 points 3 days ago Democrats twists themselves into pretzels trying to pretend Antifa doesn't exist, while saying things like \"I don't see why we don't have uprisings all over the country\" (Nancy Pelosi). Meanwhile Repubes trip over themselves disavowing and condemning even the most innocent organizing on the right. permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 14 points 3 days ago It will never happen for a lot of reasons, some of which you've mentioned. In general, people are too fat, happy, and comfortable for any meaningful revolution to happen. They also do not want to face the reality that doing so surely means killing other Americans, and particularly LEOs, feds, etc. TPTB will never let things get bad enough to actually urge people to make dramatic changes. We will continue to vote while the Overton Window shifts against us. It's like trying to push a massive boulder up a hill to keep from being rolled over; it's a losing endeavor. Additionally, we will likely never see an Antifa-like organization on the Right. 90% of people here would just call them feds. We saw the same with Patriot Front. And while I don't particularly trust PF, it's a good gauge for how the Right would treat any such organization. permalink parent award report block reply Executarian2 6 points 3 days ago Isn't that what the Proud Boys are supposed to be? Or was that just a bunch of feds? permalink parent award report block reply view 6 more comments... alucard13mmfmj 4 points 3 days ago This. Complacency fot another 4 to 10 years. permalink parent award report block reply vongregormench 8 points 3 days ago They abandoned like 6 seats and had one guy ejected. permalink parent award report block reply Cablespider 5 points 3 days ago They are benchwarmers for the same team. permalink parent award report block reply Kelemor88 3 points 3 days ago Yup can’t make money unless your in 2nd place asking for donations. permalink parent award report block reply ShitFromShinola 1 points 3 days ago That's because they suck at it. They are great at throwing stones and attacking Democrats, but are literally unable to govern. permalink parent award report block reply load 4 more comments... BlackPilledMAGA 32 points 3 days ago They will cheat like 2020. permalink parent award report block reply TDBabyBite 23 points 3 days ago Or 2024..all the close smaller elections magically went to dems. Or took weeks to count permalink parent award report block reply HeavyMetalPatriot 10 points 3 days ago And then nothing was done about any of those elections. Insane. permalink parent award report block reply TheTruthAlwaysWins 14 points 3 days ago It's going to make 2020 look like a cake walk. They just ran a test run, 7 bomb threats in republican areas. This will be at scale at midterms. Midterm elections decides our fate, and if we fail, the entire world falls too, because we're the only country capable of keeping peace.  No other country has a constitution like ours. If the dems take midterms, they will immediately impeach Trump, charge and incarcerate him, if not outright murder him. You think 2020 was bad? Midterms and the leadup will make 2020 look like a walk in the park. The muslims are getting more bold, Antifa is still walking the streets, cartels are here, the chineese are here, and the dung of random illegals from across the globe.  It was just a week back that an October 7th (or whatever day it was) terrorist was caught in Louisiana. There's no way to eliminate the threats before midterms. The bad guys are constantly pushing violence. It will likely tone down now some until next spring. TrAntifa doesn't seem to like working at night in the cold. That's a pattern too. I expect all of next year to be a steady increase in violence from their usful idiots. Just my take. permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply clownworld30330 1 points 2 days ago And the GOP will let them. permalink parent award report block reply maverick202 -1 points 3 days ago Lol nice cope.. Everytime Republicans lose, it's mUh RIgGeD eLeCtIoN!! permalink parent award report block reply DT170x 3 points 3 days ago It kinda is. Republicans needed about 60% anything less it most likely going to be a 51/49 split. permalink parent award report block reply UCantStumpTheTrump 3 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 2 points 3 days ago It's kinda not. Go out of your house and talk to people and you'll know democrats support is real. permalink parent award report block reply view 7 more comments... ShitFromShinola 3 points 3 days ago It's total horseshit. Literally no one is sniveling about muh rigged election because they don't exist. R's got shellacked because their policy sucks a fattie. permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 0 points 2 days ago On a scale from 0 to complete cucks.. How mad are you at this video, son? https://x.com/CollinRugg/status/1987957838535328174 permalink parent award report block reply view 6 more comments... EgregiousPhilbin 7 points 3 days ago I'm not voting for any of em. Weak faggots. Stone cold losers. permalink parent award report block reply The_Emperor 5 points 3 days ago I hate being a member of the defeatist party.\nVote or Die!  Commies always worse.  We truly are a silent majority. permalink parent award report block reply EgregiousPhilbin 5 points 3 days ago How does it feel enabling this endless RINO hell that we are in? I bet it feels retarded. permalink parent award report block reply KernalMustard 2 points 3 days ago Who says I part of this shit show any more. I'm not a Trump supporter anymore-Trumps words. permalink parent award report block reply MastaJoda -1 points 3 days ago remember 1/2 the people you meet are dumber than you. *See commentabove you. The RINO Party is clearly the surrenderist party, and the cucks cant support them hard enough no matter how many times they fail them (on purpose). permalink parent award report block reply ColonelKlink 6 points 3 days ago Removal of voter fraud must be a priority. permalink parent award report block reply MastaJoda 3 points 3 days ago Which is why Thune wont nuke the filibuster and get election security racheted all the way up before the midterms. permalink parent award report block reply patrioticwinning3 2 points 3 days ago Zero riggers arrested = zero incentive not to rig. permalink parent award report block reply load 15 more comments...\nRun_over_Antifa 121 points 3 days ago R's lose on purpose, when is everyone going to realize this. permalink parent award report block reply deleted 53 points 3 days ago MasterChief08 22 points 3 days ago Marching on Washington will never happen. The right needs its own antifa like faction. Intimidation clearly worked for the left. Clinton and Obama took down hundreds of right wing militia even when they obeyed every law. It's time to rebuild permalink parent award report block reply chickeninoven 17 points 3 days ago Democrats twists themselves into pretzels trying to pretend Antifa doesn't exist, while saying things like \"I don't see why we don't have uprisings all over the country\" (Nancy Pelosi). Meanwhile Repubes trip over themselves disavowing and condemning even the most innocent organizing on the right. permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 14 points 3 days ago It will never happen for a lot of reasons, some of which you've mentioned. In general, people are too fat, happy, and comfortable for any meaningful revolution to happen. They also do not want to face the reality that doing so surely means killing other Americans, and particularly LEOs, feds, etc. TPTB will never let things get bad enough to actually urge people to make dramatic changes. We will continue to vote while the Overton Window shifts against us. It's like trying to push a massive boulder up a hill to keep from being rolled over; it's a losing endeavor. Additionally, we will likely never see an Antifa-like organization on the Right. 90% of people here would just call them feds. We saw the same with Patriot Front. And while I don't particularly trust PF, it's a good gauge for how the Right would treat any such organization. permalink parent award report block reply Executarian2 6 points 3 days ago Isn't that what the Proud Boys are supposed to be? Or was that just a bunch of feds? permalink parent award report block reply view 6 more comments... alucard13mmfmj 4 points 3 days ago This. Complacency fot another 4 to 10 years. permalink parent award report block reply vongregormench 8 points 3 days ago They abandoned like 6 seats and had one guy ejected. permalink parent award report block reply Cablespider 5 points 3 days ago They are benchwarmers for the same team. permalink parent award report block reply Kelemor88 3 points 3 days ago Yup can’t make money unless your in 2nd place asking for donations. permalink parent award report block reply ShitFromShinola 1 points 3 days ago That's because they suck at it. They are great at throwing stones and attacking Democrats, but are literally unable to govern. permalink parent award report block reply load 4 more comments...\ndeleted 53 points 3 days ago MasterChief08 22 points 3 days ago Marching on Washington will never happen. The right needs its own antifa like faction. Intimidation clearly worked for the left. Clinton and Obama took down hundreds of right wing militia even when they obeyed every law. It's time to rebuild permalink parent award report block reply chickeninoven 17 points 3 days ago Democrats twists themselves into pretzels trying to pretend Antifa doesn't exist, while saying things like \"I don't see why we don't have uprisings all over the country\" (Nancy Pelosi). Meanwhile Repubes trip over themselves disavowing and condemning even the most innocent organizing on the right. permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 14 points 3 days ago It will never happen for a lot of reasons, some of which you've mentioned. In general, people are too fat, happy, and comfortable for any meaningful revolution to happen. They also do not want to face the reality that doing so surely means killing other Americans, and particularly LEOs, feds, etc. TPTB will never let things get bad enough to actually urge people to make dramatic changes. We will continue to vote while the Overton Window shifts against us. It's like trying to push a massive boulder up a hill to keep from being rolled over; it's a losing endeavor. Additionally, we will likely never see an Antifa-like organization on the Right. 90% of people here would just call them feds. We saw the same with Patriot Front. And while I don't particularly trust PF, it's a good gauge for how the Right would treat any such organization. permalink parent award report block reply Executarian2 6 points 3 days ago Isn't that what the Proud Boys are supposed to be? Or was that just a bunch of feds? permalink parent award report block reply view 6 more comments... alucard13mmfmj 4 points 3 days ago This. Complacency fot another 4 to 10 years. permalink parent award report block reply\nMasterChief08 22 points 3 days ago Marching on Washington will never happen. The right needs its own antifa like faction. Intimidation clearly worked for the left. Clinton and Obama took down hundreds of right wing militia even when they obeyed every law. It's time to rebuild permalink parent award report block reply chickeninoven 17 points 3 days ago Democrats twists themselves into pretzels trying to pretend Antifa doesn't exist, while saying things like \"I don't see why we don't have uprisings all over the country\" (Nancy Pelosi). Meanwhile Repubes trip over themselves disavowing and condemning even the most innocent organizing on the right. permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 14 points 3 days ago It will never happen for a lot of reasons, some of which you've mentioned. In general, people are too fat, happy, and comfortable for any meaningful revolution to happen. They also do not want to face the reality that doing so surely means killing other Americans, and particularly LEOs, feds, etc. TPTB will never let things get bad enough to actually urge people to make dramatic changes. We will continue to vote while the Overton Window shifts against us. It's like trying to push a massive boulder up a hill to keep from being rolled over; it's a losing endeavor. Additionally, we will likely never see an Antifa-like organization on the Right. 90% of people here would just call them feds. We saw the same with Patriot Front. And while I don't particularly trust PF, it's a good gauge for how the Right would treat any such organization. permalink parent award report block reply Executarian2 6 points 3 days ago Isn't that what the Proud Boys are supposed to be? Or was that just a bunch of feds? permalink parent award report block reply view 6 more comments...\nchickeninoven 17 points 3 days ago Democrats twists themselves into pretzels trying to pretend Antifa doesn't exist, while saying things like \"I don't see why we don't have uprisings all over the country\" (Nancy Pelosi). Meanwhile Repubes trip over themselves disavowing and condemning even the most innocent organizing on the right. permalink parent award report block reply view 1 more comments...\nConfusedAngryArmed 14 points 3 days ago It will never happen for a lot of reasons, some of which you've mentioned. In general, people are too fat, happy, and comfortable for any meaningful revolution to happen. They also do not want to face the reality that doing so surely means killing other Americans, and particularly LEOs, feds, etc. TPTB will never let things get bad enough to actually urge people to make dramatic changes. We will continue to vote while the Overton Window shifts against us. It's like trying to push a massive boulder up a hill to keep from being rolled over; it's a losing endeavor. Additionally, we will likely never see an Antifa-like organization on the Right. 90% of people here would just call them feds. We saw the same with Patriot Front. And while I don't particularly trust PF, it's a good gauge for how the Right would treat any such organization. permalink parent award report block reply\nExecutarian2 6 points 3 days ago Isn't that what the Proud Boys are supposed to be? Or was that just a bunch of feds? permalink parent award report block reply view 6 more comments...\nalucard13mmfmj 4 points 3 days ago This. Complacency fot another 4 to 10 years. permalink parent award report block reply\nvongregormench 8 points 3 days ago They abandoned like 6 seats and had one guy ejected. permalink parent award report block reply\nCablespider 5 points 3 days ago They are benchwarmers for the same team. permalink parent award report block reply\nKelemor88 3 points 3 days ago Yup can’t make money unless your in 2nd place asking for donations. permalink parent award report block reply\nShitFromShinola 1 points 3 days ago That's because they suck at it. They are great at throwing stones and attacking Democrats, but are literally unable to govern. permalink parent award report block reply\nBlackPilledMAGA 32 points 3 days ago They will cheat like 2020. permalink parent award report block reply TDBabyBite 23 points 3 days ago Or 2024..all the close smaller elections magically went to dems. Or took weeks to count permalink parent award report block reply HeavyMetalPatriot 10 points 3 days ago And then nothing was done about any of those elections. Insane. permalink parent award report block reply TheTruthAlwaysWins 14 points 3 days ago It's going to make 2020 look like a cake walk. They just ran a test run, 7 bomb threats in republican areas. This will be at scale at midterms. Midterm elections decides our fate, and if we fail, the entire world falls too, because we're the only country capable of keeping peace.  No other country has a constitution like ours. If the dems take midterms, they will immediately impeach Trump, charge and incarcerate him, if not outright murder him. You think 2020 was bad? Midterms and the leadup will make 2020 look like a walk in the park. The muslims are getting more bold, Antifa is still walking the streets, cartels are here, the chineese are here, and the dung of random illegals from across the globe.  It was just a week back that an October 7th (or whatever day it was) terrorist was caught in Louisiana. There's no way to eliminate the threats before midterms. The bad guys are constantly pushing violence. It will likely tone down now some until next spring. TrAntifa doesn't seem to like working at night in the cold. That's a pattern too. I expect all of next year to be a steady increase in violence from their usful idiots. Just my take. permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply clownworld30330 1 points 2 days ago And the GOP will let them. permalink parent award report block reply maverick202 -1 points 3 days ago Lol nice cope.. Everytime Republicans lose, it's mUh RIgGeD eLeCtIoN!! permalink parent award report block reply DT170x 3 points 3 days ago It kinda is. Republicans needed about 60% anything less it most likely going to be a 51/49 split. permalink parent award report block reply UCantStumpTheTrump 3 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 2 points 3 days ago It's kinda not. Go out of your house and talk to people and you'll know democrats support is real. permalink parent award report block reply view 7 more comments... ShitFromShinola 3 points 3 days ago It's total horseshit. Literally no one is sniveling about muh rigged election because they don't exist. R's got shellacked because their policy sucks a fattie. permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 0 points 2 days ago On a scale from 0 to complete cucks.. How mad are you at this video, son? https://x.com/CollinRugg/status/1987957838535328174 permalink parent award report block reply view 6 more comments...\nTDBabyBite 23 points 3 days ago Or 2024..all the close smaller elections magically went to dems. Or took weeks to count permalink parent award report block reply HeavyMetalPatriot 10 points 3 days ago And then nothing was done about any of those elections. Insane. permalink parent award report block reply\nHeavyMetalPatriot 10 points 3 days ago And then nothing was done about any of those elections. Insane. permalink parent award report block reply\nTheTruthAlwaysWins 14 points 3 days ago It's going to make 2020 look like a cake walk. They just ran a test run, 7 bomb threats in republican areas. This will be at scale at midterms. Midterm elections decides our fate, and if we fail, the entire world falls too, because we're the only country capable of keeping peace.  No other country has a constitution like ours. If the dems take midterms, they will immediately impeach Trump, charge and incarcerate him, if not outright murder him. You think 2020 was bad? Midterms and the leadup will make 2020 look like a walk in the park. The muslims are getting more bold, Antifa is still walking the streets, cartels are here, the chineese are here, and the dung of random illegals from across the globe.  It was just a week back that an October 7th (or whatever day it was) terrorist was caught in Louisiana. There's no way to eliminate the threats before midterms. The bad guys are constantly pushing violence. It will likely tone down now some until next spring. TrAntifa doesn't seem to like working at night in the cold. That's a pattern too. I expect all of next year to be a steady increase in violence from their usful idiots. Just my take. permalink parent award report block reply\nUCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nclownworld30330 1 points 2 days ago And the GOP will let them. permalink parent award report block reply\nmaverick202 -1 points 3 days ago Lol nice cope.. Everytime Republicans lose, it's mUh RIgGeD eLeCtIoN!! permalink parent award report block reply DT170x 3 points 3 days ago It kinda is. Republicans needed about 60% anything less it most likely going to be a 51/49 split. permalink parent award report block reply UCantStumpTheTrump 3 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 2 points 3 days ago It's kinda not. Go out of your house and talk to people and you'll know democrats support is real. permalink parent award report block reply view 7 more comments... ShitFromShinola 3 points 3 days ago It's total horseshit. Literally no one is sniveling about muh rigged election because they don't exist. R's got shellacked because their policy sucks a fattie. permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 0 points 2 days ago On a scale from 0 to complete cucks.. How mad are you at this video, son? https://x.com/CollinRugg/status/1987957838535328174 permalink parent award report block reply view 6 more comments...\nDT170x 3 points 3 days ago It kinda is. Republicans needed about 60% anything less it most likely going to be a 51/49 split. permalink parent award report block reply UCantStumpTheTrump 3 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 2 points 3 days ago It's kinda not. Go out of your house and talk to people and you'll know democrats support is real. permalink parent award report block reply view 7 more comments...\nUCantStumpTheTrump 3 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nmaverick202 2 points 3 days ago It's kinda not. Go out of your house and talk to people and you'll know democrats support is real. permalink parent award report block reply view 7 more comments...\nShitFromShinola 3 points 3 days ago It's total horseshit. Literally no one is sniveling about muh rigged election because they don't exist. R's got shellacked because their policy sucks a fattie. permalink parent award report block reply\nUCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 0 points 2 days ago On a scale from 0 to complete cucks.. How mad are you at this video, son? https://x.com/CollinRugg/status/1987957838535328174 permalink parent award report block reply view 6 more comments...\nmaverick202 0 points 2 days ago On a scale from 0 to complete cucks.. How mad are you at this video, son? https://x.com/CollinRugg/status/1987957838535328174 permalink parent award report block reply view 6 more comments...\nEgregiousPhilbin 7 points 3 days ago I'm not voting for any of em. Weak faggots. Stone cold losers. permalink parent award report block reply The_Emperor 5 points 3 days ago I hate being a member of the defeatist party.\nVote or Die!  Commies always worse.  We truly are a silent majority. permalink parent award report block reply EgregiousPhilbin 5 points 3 days ago How does it feel enabling this endless RINO hell that we are in? I bet it feels retarded. permalink parent award report block reply KernalMustard 2 points 3 days ago Who says I part of this shit show any more. I'm not a Trump supporter anymore-Trumps words. permalink parent award report block reply MastaJoda -1 points 3 days ago remember 1/2 the people you meet are dumber than you. *See commentabove you. The RINO Party is clearly the surrenderist party, and the cucks cant support them hard enough no matter how many times they fail them (on purpose). permalink parent award report block reply\nThe_Emperor 5 points 3 days ago I hate being a member of the defeatist party.\nVote or Die!  Commies always worse.  We truly are a silent majority. permalink parent award report block reply EgregiousPhilbin 5 points 3 days ago How does it feel enabling this endless RINO hell that we are in? I bet it feels retarded. permalink parent award report block reply KernalMustard 2 points 3 days ago Who says I part of this shit show any more. I'm not a Trump supporter anymore-Trumps words. permalink parent award report block reply MastaJoda -1 points 3 days ago remember 1/2 the people you meet are dumber than you. *See commentabove you. The RINO Party is clearly the surrenderist party, and the cucks cant support them hard enough no matter how many times they fail them (on purpose). permalink parent award report block reply\nEgregiousPhilbin 5 points 3 days ago How does it feel enabling this endless RINO hell that we are in? I bet it feels retarded. permalink parent award report block reply KernalMustard 2 points 3 days ago Who says I part of this shit show any more. I'm not a Trump supporter anymore-Trumps words. permalink parent award report block reply MastaJoda -1 points 3 days ago remember 1/2 the people you meet are dumber than you. *See commentabove you. The RINO Party is clearly the surrenderist party, and the cucks cant support them hard enough no matter how many times they fail them (on purpose). permalink parent award report block reply\nKernalMustard 2 points 3 days ago Who says I part of this shit show any more. I'm not a Trump supporter anymore-Trumps words. permalink parent award report block reply\nMastaJoda -1 points 3 days ago remember 1/2 the people you meet are dumber than you. *See commentabove you. The RINO Party is clearly the surrenderist party, and the cucks cant support them hard enough no matter how many times they fail them (on purpose). permalink parent award report block reply\nColonelKlink 6 points 3 days ago Removal of voter fraud must be a priority. permalink parent award report block reply MastaJoda 3 points 3 days ago Which is why Thune wont nuke the filibuster and get election security racheted all the way up before the midterms. permalink parent award report block reply\nMastaJoda 3 points 3 days ago Which is why Thune wont nuke the filibuster and get election security racheted all the way up before the midterms. permalink parent award report block reply\npatrioticwinning3 2 points 3 days ago Zero riggers arrested = zero incentive not to rig. permalink parent award report block reply\nDJT_MFers1 55 points 3 days ago That is the confidence of a person who knows election fraud will never change. permalink award report block reply FaRmErX2000 22 points 3 days ago OR trumps “red hot” economy is actually ice cold.. permalink parent award report block reply Simple_Doot 8 points 3 days ago And he is not MAGA if we go by 2016-2024 standards.  He's just plain old neocon and the O.G. MAGA people are very turned off by the bizarre change. permalink parent award report block reply DrWeeGee 11 points 3 days ago I'm sick of Israel permalink parent award report block reply LineInTheSand 4 points 3 days ago I'm never going to forget that pedophiles in powerful positions were allowed to get away with it. permalink parent award report block reply Chickensaurus 8 points 3 days ago Same fraud that gave Republicans the House, Senate, and White House?  No... the Republicans have had 10 months to do something meaningful and lasting. They passed the Laken Riley act. Nothing else. Hardly enthusiastic to vote R next year. Worthless. permalink parent award report block reply\nFaRmErX2000 22 points 3 days ago OR trumps “red hot” economy is actually ice cold.. permalink parent award report block reply Simple_Doot 8 points 3 days ago And he is not MAGA if we go by 2016-2024 standards.  He's just plain old neocon and the O.G. MAGA people are very turned off by the bizarre change. permalink parent award report block reply DrWeeGee 11 points 3 days ago I'm sick of Israel permalink parent award report block reply LineInTheSand 4 points 3 days ago I'm never going to forget that pedophiles in powerful positions were allowed to get away with it. permalink parent award report block reply\nSimple_Doot 8 points 3 days ago And he is not MAGA if we go by 2016-2024 standards.  He's just plain old neocon and the O.G. MAGA people are very turned off by the bizarre change. permalink parent award report block reply DrWeeGee 11 points 3 days ago I'm sick of Israel permalink parent award report block reply LineInTheSand 4 points 3 days ago I'm never going to forget that pedophiles in powerful positions were allowed to get away with it. permalink parent award report block reply\nDrWeeGee 11 points 3 days ago I'm sick of Israel permalink parent award report block reply LineInTheSand 4 points 3 days ago I'm never going to forget that pedophiles in powerful positions were allowed to get away with it. permalink parent award report block reply\nLineInTheSand 4 points 3 days ago I'm never going to forget that pedophiles in powerful positions were allowed to get away with it. permalink parent award report block reply\nChickensaurus 8 points 3 days ago Same fraud that gave Republicans the House, Senate, and White House?  No... the Republicans have had 10 months to do something meaningful and lasting. They passed the Laken Riley act. Nothing else. Hardly enthusiastic to vote R next year. Worthless. permalink parent award report block reply\nExecutarian2 46 points 3 days ago Right now, he's definitely right. If you're saying otherwise, you're either lying or coping. We have to play like we're ten points behind and actually start doing shit that matters, like decreasing inflation. Instead, we're spending millions on primarying fucking Thomas Massie and sending billions to Israel. If this continues, we deserve to lose. If the same results from this Tuesday happen next year, we could very well lose the Senate, too. MAGA has to get its shit together permalink award report block reply DrCowboyPresident 25 points 3 days ago Anytime Republicans get power through populism, MIGA and the Neocons try to hijack the movement and tear it apart. permalink parent award report block reply Executarian2 19 points 3 days ago That's why we have to destroy MIGA, vote out every single Randy Fine and tell Trump to fuck off when he's taking hundreds of millions of Miriam Adelson and selling us to the Jews. permalink parent award report block reply FaRmErX2000 11 points 3 days ago Separate church and state and separate tel aviv from wshjngton permalink parent award report block reply Goozmania 4 points 3 days ago Impossible when maga doesn't vote. 70% of Republicans don't vote in non-presidential general elections. Trump won with low propensity voters. It's the only reason he won. They're going back to low propensity permalink parent award report block reply ConfusedAngryArmed 12 points 3 days ago They don't just try, they succeed. But God forbid you mention the staggering control that Jews and Israel have over our country. It's getting better, for sure, at least now you can openly talk about it here without getting banned. permalink parent award report block reply KernalMustard -1 points 3 days ago Tea party for example was taken over by the Christian right when its a more libertarian movement. That killed support. And like sheep you follow and do their bidding. People are manlipulated and dont even know it. History repeats itself. permalink parent award report block reply MediaBro -1 points 3 days ago Exactly. MAGA was supposed to be the moderate Right taking back the country. It's why ppl like RFK Jr. and Tulsi Gabbard joined the movement. Then the White Christian Evangelical nutjobs decided to take control of the movement and they seemingly opened the door to the White Supremacists. Now you have ppl here shitting on Usha Vance for her being Hindu. Are we also going to shit on Tulsi Gabbard for being a Hindu? Faith has always been a private matter in the US and as long as you don't use religion to push your shit, no one gave a fk. Now apparently, if we're not all White Catholics or White Evangelicals, who don't believe Jesus is about to show up soon, apparently we don't get to be in the US or live and prosper, despite this being a thing for decades now. It doesn't work like that and all this will do will create an absolute hellscape for everyone permalink parent award report block reply LineInTheSand 5 points 3 days ago You have some very odd ideas of the MAGA movement and religion. Faith has not \"always been a private matter\".  People used to be very public and open about their faith.  In the 1950s, they even displayed crosses using the lights of skyscrapers in New York .  Over time, religion became taboo to express in public.  Now, Christians get arrested for praying within 150 meters of an abortion clinic in the UK. Like it or not, the US was founded on Christian values and principles.  We have strayed from those values, and let leftism take control of our cities and institutions.  Do you see the disaster the left has caused in every major city they control?  Do you see the corruption and rot our country endures because of people who live only for themselves and only preach about bettering society, but never give up their power or money like they tell others to do? I suggest you listen to Paul Harvey's \" If I Were The Devil \" speech from 1965.  It is scary how accurate he was about the destruction of America. \"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\" - The Usual Suspects (1995) permalink parent award report block reply TheAttackTitan 4 points 3 days ago Considering it was D+10 nationwide this last election I’d say we need to play more like we’re 20 points behind permalink parent award report block reply starjello 1 points 3 days ago Stop that. Feel upset the retards around here that can't deal and what really happened last Tuesday. They can't read the tea leaves around here they're such cultists permalink parent award report block reply FBIsurveillance 3 points 3 days ago Your telling me you dont support the united states of AIPAC? Not very kosher of you permalink parent award report block reply tingo999 -3 points 3 days ago Doing weapons deals with Israel doesn't cause inflation. Both you and Massie are fucking retards. permalink parent award report block reply Executarian2 7 points 3 days ago Sending billions of dollars to Israel while Americans are unable to afford groceries is fucking retarded. Fuck you, and fuck the Jews. permalink parent award report block reply\nDrCowboyPresident 25 points 3 days ago Anytime Republicans get power through populism, MIGA and the Neocons try to hijack the movement and tear it apart. permalink parent award report block reply Executarian2 19 points 3 days ago That's why we have to destroy MIGA, vote out every single Randy Fine and tell Trump to fuck off when he's taking hundreds of millions of Miriam Adelson and selling us to the Jews. permalink parent award report block reply FaRmErX2000 11 points 3 days ago Separate church and state and separate tel aviv from wshjngton permalink parent award report block reply Goozmania 4 points 3 days ago Impossible when maga doesn't vote. 70% of Republicans don't vote in non-presidential general elections. Trump won with low propensity voters. It's the only reason he won. They're going back to low propensity permalink parent award report block reply ConfusedAngryArmed 12 points 3 days ago They don't just try, they succeed. But God forbid you mention the staggering control that Jews and Israel have over our country. It's getting better, for sure, at least now you can openly talk about it here without getting banned. permalink parent award report block reply KernalMustard -1 points 3 days ago Tea party for example was taken over by the Christian right when its a more libertarian movement. That killed support. And like sheep you follow and do their bidding. People are manlipulated and dont even know it. History repeats itself. permalink parent award report block reply MediaBro -1 points 3 days ago Exactly. MAGA was supposed to be the moderate Right taking back the country. It's why ppl like RFK Jr. and Tulsi Gabbard joined the movement. Then the White Christian Evangelical nutjobs decided to take control of the movement and they seemingly opened the door to the White Supremacists. Now you have ppl here shitting on Usha Vance for her being Hindu. Are we also going to shit on Tulsi Gabbard for being a Hindu? Faith has always been a private matter in the US and as long as you don't use religion to push your shit, no one gave a fk. Now apparently, if we're not all White Catholics or White Evangelicals, who don't believe Jesus is about to show up soon, apparently we don't get to be in the US or live and prosper, despite this being a thing for decades now. It doesn't work like that and all this will do will create an absolute hellscape for everyone permalink parent award report block reply LineInTheSand 5 points 3 days ago You have some very odd ideas of the MAGA movement and religion. Faith has not \"always been a private matter\".  People used to be very public and open about their faith.  In the 1950s, they even displayed crosses using the lights of skyscrapers in New York .  Over time, religion became taboo to express in public.  Now, Christians get arrested for praying within 150 meters of an abortion clinic in the UK. Like it or not, the US was founded on Christian values and principles.  We have strayed from those values, and let leftism take control of our cities and institutions.  Do you see the disaster the left has caused in every major city they control?  Do you see the corruption and rot our country endures because of people who live only for themselves and only preach about bettering society, but never give up their power or money like they tell others to do? I suggest you listen to Paul Harvey's \" If I Were The Devil \" speech from 1965.  It is scary how accurate he was about the destruction of America. \"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\" - The Usual Suspects (1995) permalink parent award report block reply\nExecutarian2 19 points 3 days ago That's why we have to destroy MIGA, vote out every single Randy Fine and tell Trump to fuck off when he's taking hundreds of millions of Miriam Adelson and selling us to the Jews. permalink parent award report block reply FaRmErX2000 11 points 3 days ago Separate church and state and separate tel aviv from wshjngton permalink parent award report block reply Goozmania 4 points 3 days ago Impossible when maga doesn't vote. 70% of Republicans don't vote in non-presidential general elections. Trump won with low propensity voters. It's the only reason he won. They're going back to low propensity permalink parent award report block reply\nFaRmErX2000 11 points 3 days ago Separate church and state and separate tel aviv from wshjngton permalink parent award report block reply\nGoozmania 4 points 3 days ago Impossible when maga doesn't vote. 70% of Republicans don't vote in non-presidential general elections. Trump won with low propensity voters. It's the only reason he won. They're going back to low propensity permalink parent award report block reply\nConfusedAngryArmed 12 points 3 days ago They don't just try, they succeed. But God forbid you mention the staggering control that Jews and Israel have over our country. It's getting better, for sure, at least now you can openly talk about it here without getting banned. permalink parent award report block reply\nKernalMustard -1 points 3 days ago Tea party for example was taken over by the Christian right when its a more libertarian movement. That killed support. And like sheep you follow and do their bidding. People are manlipulated and dont even know it. History repeats itself. permalink parent award report block reply MediaBro -1 points 3 days ago Exactly. MAGA was supposed to be the moderate Right taking back the country. It's why ppl like RFK Jr. and Tulsi Gabbard joined the movement. Then the White Christian Evangelical nutjobs decided to take control of the movement and they seemingly opened the door to the White Supremacists. Now you have ppl here shitting on Usha Vance for her being Hindu. Are we also going to shit on Tulsi Gabbard for being a Hindu? Faith has always been a private matter in the US and as long as you don't use religion to push your shit, no one gave a fk. Now apparently, if we're not all White Catholics or White Evangelicals, who don't believe Jesus is about to show up soon, apparently we don't get to be in the US or live and prosper, despite this being a thing for decades now. It doesn't work like that and all this will do will create an absolute hellscape for everyone permalink parent award report block reply LineInTheSand 5 points 3 days ago You have some very odd ideas of the MAGA movement and religion. Faith has not \"always been a private matter\".  People used to be very public and open about their faith.  In the 1950s, they even displayed crosses using the lights of skyscrapers in New York .  Over time, religion became taboo to express in public.  Now, Christians get arrested for praying within 150 meters of an abortion clinic in the UK. Like it or not, the US was founded on Christian values and principles.  We have strayed from those values, and let leftism take control of our cities and institutions.  Do you see the disaster the left has caused in every major city they control?  Do you see the corruption and rot our country endures because of people who live only for themselves and only preach about bettering society, but never give up their power or money like they tell others to do? I suggest you listen to Paul Harvey's \" If I Were The Devil \" speech from 1965.  It is scary how accurate he was about the destruction of America. \"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\" - The Usual Suspects (1995) permalink parent award report block reply\nMediaBro -1 points 3 days ago Exactly. MAGA was supposed to be the moderate Right taking back the country. It's why ppl like RFK Jr. and Tulsi Gabbard joined the movement. Then the White Christian Evangelical nutjobs decided to take control of the movement and they seemingly opened the door to the White Supremacists. Now you have ppl here shitting on Usha Vance for her being Hindu. Are we also going to shit on Tulsi Gabbard for being a Hindu? Faith has always been a private matter in the US and as long as you don't use religion to push your shit, no one gave a fk. Now apparently, if we're not all White Catholics or White Evangelicals, who don't believe Jesus is about to show up soon, apparently we don't get to be in the US or live and prosper, despite this being a thing for decades now. It doesn't work like that and all this will do will create an absolute hellscape for everyone permalink parent award report block reply LineInTheSand 5 points 3 days ago You have some very odd ideas of the MAGA movement and religion. Faith has not \"always been a private matter\".  People used to be very public and open about their faith.  In the 1950s, they even displayed crosses using the lights of skyscrapers in New York .  Over time, religion became taboo to express in public.  Now, Christians get arrested for praying within 150 meters of an abortion clinic in the UK. Like it or not, the US was founded on Christian values and principles.  We have strayed from those values, and let leftism take control of our cities and institutions.  Do you see the disaster the left has caused in every major city they control?  Do you see the corruption and rot our country endures because of people who live only for themselves and only preach about bettering society, but never give up their power or money like they tell others to do? I suggest you listen to Paul Harvey's \" If I Were The Devil \" speech from 1965.  It is scary how accurate he was about the destruction of America. \"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\" - The Usual Suspects (1995) permalink parent award report block reply\nLineInTheSand 5 points 3 days ago You have some very odd ideas of the MAGA movement and religion. Faith has not \"always been a private matter\".  People used to be very public and open about their faith.  In the 1950s, they even displayed crosses using the lights of skyscrapers in New York .  Over time, religion became taboo to express in public.  Now, Christians get arrested for praying within 150 meters of an abortion clinic in the UK. Like it or not, the US was founded on Christian values and principles.  We have strayed from those values, and let leftism take control of our cities and institutions.  Do you see the disaster the left has caused in every major city they control?  Do you see the corruption and rot our country endures because of people who live only for themselves and only preach about bettering society, but never give up their power or money like they tell others to do? I suggest you listen to Paul Harvey's \" If I Were The Devil \" speech from 1965.  It is scary how accurate he was about the destruction of America. \"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\" - The Usual Suspects (1995) permalink parent award report block reply\nTheAttackTitan 4 points 3 days ago Considering it was D+10 nationwide this last election I’d say we need to play more like we’re 20 points behind permalink parent award report block reply starjello 1 points 3 days ago Stop that. Feel upset the retards around here that can't deal and what really happened last Tuesday. They can't read the tea leaves around here they're such cultists permalink parent award report block reply\nstarjello 1 points 3 days ago Stop that. Feel upset the retards around here that can't deal and what really happened last Tuesday. They can't read the tea leaves around here they're such cultists permalink parent award report block reply\nFBIsurveillance 3 points 3 days ago Your telling me you dont support the united states of AIPAC? Not very kosher of you permalink parent award report block reply\ntingo999 -3 points 3 days ago Doing weapons deals with Israel doesn't cause inflation. Both you and Massie are fucking retards. permalink parent award report block reply Executarian2 7 points 3 days ago Sending billions of dollars to Israel while Americans are unable to afford groceries is fucking retarded. Fuck you, and fuck the Jews. permalink parent award report block reply\nExecutarian2 7 points 3 days ago Sending billions of dollars to Israel while Americans are unable to afford groceries is fucking retarded. Fuck you, and fuck the Jews. permalink parent award report block reply\nProf_Smith 29 points 3 days ago I believe it.  Republicans can’t get anything done.   We just saw that no one turns out for republicans.  They do for Trump but congressional republicans continue to suck. Watch them cave in the shutdown.  By next year NPR will be getting more money than they were before. permalink award report block reply Executarian2 7 points 3 days ago Republicans CAN win if we put in common sense conservatives like Thomas Massie, actual populists who are America First. Instead, we put in Israel first shills like Randy Fine, who fucking hate America and would sell everything we have to the Jews. permalink parent award report block reply Chango3 7 points 3 days ago Massie has let us down on votes 100%. Prove me wrong. permalink parent award report block reply Executarian2 3 points 3 days ago Congress has let us down. Massie is one of the only truly America First Congressmen who isn't taking millions from AIPAC. permalink parent award report block reply Corse46 6 points 3 days ago Massie lol. The guy who helped out his buddy Kevin McCarthy, and voted in 2023 to COMPLETELY suspend the debt ceiling for Biden's entire term (ending Jan 2025). Yes, the man who walked around with a \"debt clock\" pin, helped add trillions of that debt himself. If Trump were a Democrat, Massie would've voted to raise (or suspend) the debt ceiling for him. permalink parent award report block reply wartooth6 6 points 3 days ago He also voted to honor George Floyd, but refused to do so for Charlie Kirk (because principles I guess) permalink parent award report block reply ragnarokrobo 2 points 3 days ago You mean \"my kevin\" Mccarthy as Trump called him? permalink parent award report block reply Executarian2 2 points 3 days ago Massie hasn't been perfect, but he has one of the highest liberty scores and has never taken a cent from a foreign nation, something that almost no other Congressmen can say. permalink parent award report block reply Prof_Smith 3 points 3 days ago I wouldn’t trust or vote for Massie at all. He’s a theatre production for opposition to the republicans which makes him a democrat sympathizer in my book.   You cannot count on him. permalink parent award report block reply KernalMustard 5 points 3 days ago Like we can trust the rest of the Republicans? permalink parent award report block reply Prof_Smith 2 points 3 days ago Nope.  Doesn't mean I trust Massie.  He's a fucking drama queen. permalink parent award report block reply MediaBro 0 points 3 days ago Apparently, the consensus here seems to be to not trust anyone. And this is why you dumbasses lose over and over again. Nobody gets 100% of what they want. You gotta understand that compromise has to happen. If neither side is compromising on anything, then its war. And I think ppl here want war. And with war, a new hell opens up. permalink parent award report block reply eclectic22 0 points 3 days ago lol, one asshole is not enough for you permalink parent award report block reply\nExecutarian2 7 points 3 days ago Republicans CAN win if we put in common sense conservatives like Thomas Massie, actual populists who are America First. Instead, we put in Israel first shills like Randy Fine, who fucking hate America and would sell everything we have to the Jews. permalink parent award report block reply Chango3 7 points 3 days ago Massie has let us down on votes 100%. Prove me wrong. permalink parent award report block reply Executarian2 3 points 3 days ago Congress has let us down. Massie is one of the only truly America First Congressmen who isn't taking millions from AIPAC. permalink parent award report block reply Corse46 6 points 3 days ago Massie lol. The guy who helped out his buddy Kevin McCarthy, and voted in 2023 to COMPLETELY suspend the debt ceiling for Biden's entire term (ending Jan 2025). Yes, the man who walked around with a \"debt clock\" pin, helped add trillions of that debt himself. If Trump were a Democrat, Massie would've voted to raise (or suspend) the debt ceiling for him. permalink parent award report block reply wartooth6 6 points 3 days ago He also voted to honor George Floyd, but refused to do so for Charlie Kirk (because principles I guess) permalink parent award report block reply ragnarokrobo 2 points 3 days ago You mean \"my kevin\" Mccarthy as Trump called him? permalink parent award report block reply Executarian2 2 points 3 days ago Massie hasn't been perfect, but he has one of the highest liberty scores and has never taken a cent from a foreign nation, something that almost no other Congressmen can say. permalink parent award report block reply Prof_Smith 3 points 3 days ago I wouldn’t trust or vote for Massie at all. He’s a theatre production for opposition to the republicans which makes him a democrat sympathizer in my book.   You cannot count on him. permalink parent award report block reply KernalMustard 5 points 3 days ago Like we can trust the rest of the Republicans? permalink parent award report block reply Prof_Smith 2 points 3 days ago Nope.  Doesn't mean I trust Massie.  He's a fucking drama queen. permalink parent award report block reply MediaBro 0 points 3 days ago Apparently, the consensus here seems to be to not trust anyone. And this is why you dumbasses lose over and over again. Nobody gets 100% of what they want. You gotta understand that compromise has to happen. If neither side is compromising on anything, then its war. And I think ppl here want war. And with war, a new hell opens up. permalink parent award report block reply eclectic22 0 points 3 days ago lol, one asshole is not enough for you permalink parent award report block reply\nChango3 7 points 3 days ago Massie has let us down on votes 100%. Prove me wrong. permalink parent award report block reply Executarian2 3 points 3 days ago Congress has let us down. Massie is one of the only truly America First Congressmen who isn't taking millions from AIPAC. permalink parent award report block reply\nExecutarian2 3 points 3 days ago Congress has let us down. Massie is one of the only truly America First Congressmen who isn't taking millions from AIPAC. permalink parent award report block reply\nCorse46 6 points 3 days ago Massie lol. The guy who helped out his buddy Kevin McCarthy, and voted in 2023 to COMPLETELY suspend the debt ceiling for Biden's entire term (ending Jan 2025). Yes, the man who walked around with a \"debt clock\" pin, helped add trillions of that debt himself. If Trump were a Democrat, Massie would've voted to raise (or suspend) the debt ceiling for him. permalink parent award report block reply wartooth6 6 points 3 days ago He also voted to honor George Floyd, but refused to do so for Charlie Kirk (because principles I guess) permalink parent award report block reply ragnarokrobo 2 points 3 days ago You mean \"my kevin\" Mccarthy as Trump called him? permalink parent award report block reply Executarian2 2 points 3 days ago Massie hasn't been perfect, but he has one of the highest liberty scores and has never taken a cent from a foreign nation, something that almost no other Congressmen can say. permalink parent award report block reply\nwartooth6 6 points 3 days ago He also voted to honor George Floyd, but refused to do so for Charlie Kirk (because principles I guess) permalink parent award report block reply\nragnarokrobo 2 points 3 days ago You mean \"my kevin\" Mccarthy as Trump called him? permalink parent award report block reply\nExecutarian2 2 points 3 days ago Massie hasn't been perfect, but he has one of the highest liberty scores and has never taken a cent from a foreign nation, something that almost no other Congressmen can say. permalink parent award report block reply\nProf_Smith 3 points 3 days ago I wouldn’t trust or vote for Massie at all. He’s a theatre production for opposition to the republicans which makes him a democrat sympathizer in my book.   You cannot count on him. permalink parent award report block reply KernalMustard 5 points 3 days ago Like we can trust the rest of the Republicans? permalink parent award report block reply Prof_Smith 2 points 3 days ago Nope.  Doesn't mean I trust Massie.  He's a fucking drama queen. permalink parent award report block reply MediaBro 0 points 3 days ago Apparently, the consensus here seems to be to not trust anyone. And this is why you dumbasses lose over and over again. Nobody gets 100% of what they want. You gotta understand that compromise has to happen. If neither side is compromising on anything, then its war. And I think ppl here want war. And with war, a new hell opens up. permalink parent award report block reply\nKernalMustard 5 points 3 days ago Like we can trust the rest of the Republicans? permalink parent award report block reply Prof_Smith 2 points 3 days ago Nope.  Doesn't mean I trust Massie.  He's a fucking drama queen. permalink parent award report block reply MediaBro 0 points 3 days ago Apparently, the consensus here seems to be to not trust anyone. And this is why you dumbasses lose over and over again. Nobody gets 100% of what they want. You gotta understand that compromise has to happen. If neither side is compromising on anything, then its war. And I think ppl here want war. And with war, a new hell opens up. permalink parent award report block reply\nProf_Smith 2 points 3 days ago Nope.  Doesn't mean I trust Massie.  He's a fucking drama queen. permalink parent award report block reply\nMediaBro 0 points 3 days ago Apparently, the consensus here seems to be to not trust anyone. And this is why you dumbasses lose over and over again. Nobody gets 100% of what they want. You gotta understand that compromise has to happen. If neither side is compromising on anything, then its war. And I think ppl here want war. And with war, a new hell opens up. permalink parent award report block reply\neclectic22 0 points 3 days ago lol, one asshole is not enough for you permalink parent award report block reply\nViewer01 17 points 3 days ago All hinges on whether America first purges Zionist neo cons or vice versa. Also the economy. permalink award report block reply Executarian2 10 points 3 days ago Instead, we'll spend $100 million on trying to primary Thomas Massie and lose fifty seats in the House. permalink parent award report block reply Viewer01 8 points 3 days ago Yea that was wild hearing a gambling jewess is taking her ass to Kentucky to pick on massie. permalink parent award report block reply\nExecutarian2 10 points 3 days ago Instead, we'll spend $100 million on trying to primary Thomas Massie and lose fifty seats in the House. permalink parent award report block reply Viewer01 8 points 3 days ago Yea that was wild hearing a gambling jewess is taking her ass to Kentucky to pick on massie. permalink parent award report block reply\nViewer01 8 points 3 days ago Yea that was wild hearing a gambling jewess is taking her ass to Kentucky to pick on massie. permalink parent award report block reply\ncrackerstacker 12 points 3 days ago If the economy keeps rolling over it could well happen. permalink award report block reply eclectic22 -8 points 3 days ago the economy is booming, what are you smoking? permalink parent award report block reply MastaJoda 6 points 3 days ago definitely not crack like you, fuckhead. permalink parent award report block reply Executarian2 5 points 3 days ago In what world is the economy booming? permalink parent award report block reply KernalMustard 5 points 3 days ago Trumps world. permalink parent award report block reply HeavyMetalPatriot 4 points 3 days ago Must be nice there. Very unlike 2025 America. permalink parent award report block reply\neclectic22 -8 points 3 days ago the economy is booming, what are you smoking? permalink parent award report block reply MastaJoda 6 points 3 days ago definitely not crack like you, fuckhead. permalink parent award report block reply Executarian2 5 points 3 days ago In what world is the economy booming? permalink parent award report block reply KernalMustard 5 points 3 days ago Trumps world. permalink parent award report block reply HeavyMetalPatriot 4 points 3 days ago Must be nice there. Very unlike 2025 America. permalink parent award report block reply\nMastaJoda 6 points 3 days ago definitely not crack like you, fuckhead. permalink parent award report block reply\nExecutarian2 5 points 3 days ago In what world is the economy booming? permalink parent award report block reply KernalMustard 5 points 3 days ago Trumps world. permalink parent award report block reply HeavyMetalPatriot 4 points 3 days ago Must be nice there. Very unlike 2025 America. permalink parent award report block reply\nKernalMustard 5 points 3 days ago Trumps world. permalink parent award report block reply HeavyMetalPatriot 4 points 3 days ago Must be nice there. Very unlike 2025 America. permalink parent award report block reply\nHeavyMetalPatriot 4 points 3 days ago Must be nice there. Very unlike 2025 America. permalink parent award report block reply\nBrandon1776 10 points 3 days ago He probably isn't wrong permalink award report block reply\nnoPTSDforMePlease 8 points 3 days ago Look at who said it. He will never say they won't win the house. What's he going to do, go on national TV and say his own party is weak and losing? Ha ha no permalink award report block reply Gilliais 10 points 3 days ago Exactly. His prediction is meant to encourage his demoralized team. He isn’t even talking to us. Why give this attention. permalink parent award report block reply TrumpYouMagaFrenner 3 points 3 days ago To mock him. Because only someone as dumb as him could be that foolish. permalink parent award report block reply\nGilliais 10 points 3 days ago Exactly. His prediction is meant to encourage his demoralized team. He isn’t even talking to us. Why give this attention. permalink parent award report block reply TrumpYouMagaFrenner 3 points 3 days ago To mock him. Because only someone as dumb as him could be that foolish. permalink parent award report block reply\nTrumpYouMagaFrenner 3 points 3 days ago To mock him. Because only someone as dumb as him could be that foolish. permalink parent award report block reply\nDefenderDad 5 points 3 days ago They are. Because Rinos don’t want to win. They are selling the country out and cannot get in on the grift if they enact stuff that literally makes America Great Again. They could end the filibuster and cancel all H1Bs from any nation that has scam call centers stealing from American retirees. (China, Singapore and the great scam king India). Then we also add in no H1Bs for any nation trying to change our culture - India, China, and all of the Middle East get hit with that one. They would fix it fast to keep the remittance payments flowing. permalink award report block reply\nPosterIsDead 5 points 3 days ago He looks like a drunk pee-wee football coach. permalink award report block reply\nDatamancer 4 points 3 days ago Sorry, sombrero, you ain't getting jack and shit. permalink award report block reply\nRoadpower 4 points 3 days ago Trump may blame us for the loss because that is easier to do than to cut off his donors. permalink award report block reply\nScot 3 points 3 days ago Oh course. Between massive voter fraud that hasn't been stopped and republicans who refuse to do ANYTHING we want, their chances of stealing back power are very high. permalink award report block reply\nMakeAmericaGreat9 3 points 3 days ago He's right. permalink award report block reply\nCalifunya 3 points 3 days ago Why do Republican predictions lead to HUGE disappointment?!!  Dems predictions lead to fraudulent success!!???WTF permalink award report block reply\nDCYR66 3 points 3 days ago They will if our limp dick party doesn’t start fighting with the same energy they do. permalink award report block reply\nMeatShield72 3 points 3 days ago I mean. Probably. American voters are fucking retards, especially the R voters… permalink award report block reply clownworld30330 1 points 2 days ago Dominion voters in particular! permalink parent award report block reply\nclownworld30330 1 points 2 days ago Dominion voters in particular! permalink parent award report block reply\nHenkZeilstra 3 points 3 days ago ZERO ARRESTS, ZERO EO'S CODIFIED, USELESS SCUM permalink award report block reply\njeigh44 3 points 3 days ago Cheat by mail!  Works every time! permalink award report block reply\n24601 3 points 3 days ago Reminders.... Vote in the primaries. Vote early and in person in the general election. Stock up on ammunition. permalink award report block reply\nUnderHisWings 3 points 3 days ago Those eyes....He doesn't look human. permalink award report block reply Nellie_the_Beaut 2 points 2 days ago Like a monitor lizard. permalink parent award report block reply\nNellie_the_Beaut 2 points 2 days ago Like a monitor lizard. permalink parent award report block reply\nPepeMania 3 points 3 days ago Repeat of first term with congress permalink award report block reply Executarian2 1 points 3 days ago It's been over two decades since a midterm has been helpful for the president. permalink parent award report block reply\nExecutarian2 1 points 3 days ago It's been over two decades since a midterm has been helpful for the president. permalink parent award report block reply\nKlown_Kutz 2 points 3 days ago We’re gonna hand it to them if we don’t get off our asses and vote like we did last year permalink award report block reply\nCville123 2 points 3 days ago Probably.  But still voting R permalink award report block reply\nBTWiuseArch25 2 points 3 days ago Why yes hes correct, because the GOP is full of trans men sense they have no balls to do anything. permalink award report block reply\ngrenades_and_ham 2 points 3 days ago Dopey Hakeem. permalink award report block reply\nShaffro 2 points 3 days ago So they are going to try to cheat again? permalink award report block reply clownworld30330 1 points 2 days ago When have they not? permalink parent award report block reply\nclownworld30330 1 points 2 days ago When have they not? permalink parent award report block reply\nMakeAmericaVapeAgain 2 points 3 days ago no they won’t. they are losing control of their ability to run propaganda. they will lose in bigger numbers than imagined permalink award report block reply\nBillyMahoney 2 points 3 days ago Cheaters have a way of predicting the future in voting. permalink award report block reply\nGreazyCheeks 2 points 3 days ago Does it matter? Republicans have all three branches now, and don't do shit. permalink award report block reply\nsplink 2 points 3 days ago Is this kind of like when Rahm straight up stated he was going to be the mayor of Chicago and cackled...then he (surprise!) just was? permalink award report block reply\nB0bE 2 points 3 days ago Most likely. permalink award report block reply\nNanteen 2 points 3 days ago Unless Republicans actually get off their fucking asses and pass some bills. Yeah that's what's going to happen permalink award report block reply\nFor_All_Mankind 2 points 3 days ago I think he’s right tbh permalink award report block reply\nSlogKing 2 points 3 days ago He sure has that mulatto Frankenstein vibe going. permalink award report block reply\nJBlaze056 2 points 3 days ago Wake up from your delusional dream, Hakeem. permalink award report block reply\nraptormissle 1 points 3 days ago Temu Obama is scared that his job is in jeopardy. permalink award report block reply\nasiatrails 1 points 3 days ago Peso store, Obama is going to be surprised when the manure delivery arrives.  If it does not, then he will be correct. permalink award report block reply\nWupta PRO 1 points 3 days ago Not if we get president Trucks safe act codified. permalink award report block reply clownworld30330 1 points 2 days ago Hahahaha right imagine Speaker Johnson (is he even 5ft?) passing any of the MAGA/AF agenda. permalink parent award report block reply\nclownworld30330 1 points 2 days ago Hahahaha right imagine Speaker Johnson (is he even 5ft?) passing any of the MAGA/AF agenda. permalink parent award report block reply\nMemeWarsVet 1 points 3 days ago Without high-profile deep state arrests AND massive voting reform, likely so. Because, as it stands, why wouldn't they continue to cheat? permalink award report block reply starjello 1 points 3 days ago The loser's here down vote you out of their pain. They can't deal in reality permalink parent award report block reply\nstarjello 1 points 3 days ago The loser's here down vote you out of their pain. They can't deal in reality permalink parent award report block reply\nMegoThor 1 points 3 days ago Hakeem Jeffries should be deported. permalink award report block reply\nFusionBlack 1 points 3 days ago If that happens I'll be checking the exchange rate for Poland. permalink award report block reply\nf_bastiat 1 points 3 days ago Wouldn't surprise me, red team aside from Trump is doing a shit tier job. permalink award report block reply\nGoozmania 1 points 3 days ago He is correct. permalink award report block reply\nBoomstikchik 1 points 3 days ago Good luck with that, Dollar Store. permalink award report block reply\nBeachboy1b 1 points 3 days ago I’m sorry, are we just gonna ignore the fact that them getting back in power LITERALLY will end the country? Let me disabuse you all of the notion that we are still in a “vote them out” stage of government, because we are NOT. permalink award report block reply Executarian2 0 points 3 days ago What? You're using \"fact\" and \"LITERALLY\" incorrectly. permalink parent award report block reply Beachboy1b 1 points 3 days ago Am I though? Do you genuinely believe that they’re NOT going to try and completely FUCK the entire country as soon as they get any facet of real power? Unless you’ve been living under a rock, we have seen more than enough evidence that these people want us DEAD. permalink parent award report block reply Executarian2 0 points 3 days ago Being this terminally online is not healthy. permalink parent award report block reply Oleander 1 points 3 days ago I'm not the one you were talking to before, but I don't think you realize how close the Democrats are to total control. All it's going to take is disbanding border security, and/or a mass amnesty deal, and the deed is done. Republicans would not be viable as a national party anymore, imagine a blue Texas. They are definitely prepping their base to fall in line in favor of something like this by making border security a political issue, as well. I would be genuinely surprised if the next Democrat administration doesn't do this, so we are really only one Democrat away from the brink at this point. permalink parent award report block reply\nExecutarian2 0 points 3 days ago What? You're using \"fact\" and \"LITERALLY\" incorrectly. permalink parent award report block reply Beachboy1b 1 points 3 days ago Am I though? Do you genuinely believe that they’re NOT going to try and completely FUCK the entire country as soon as they get any facet of real power? Unless you’ve been living under a rock, we have seen more than enough evidence that these people want us DEAD. permalink parent award report block reply Executarian2 0 points 3 days ago Being this terminally online is not healthy. permalink parent award report block reply Oleander 1 points 3 days ago I'm not the one you were talking to before, but I don't think you realize how close the Democrats are to total control. All it's going to take is disbanding border security, and/or a mass amnesty deal, and the deed is done. Republicans would not be viable as a national party anymore, imagine a blue Texas. They are definitely prepping their base to fall in line in favor of something like this by making border security a political issue, as well. I would be genuinely surprised if the next Democrat administration doesn't do this, so we are really only one Democrat away from the brink at this point. permalink parent award report block reply\nBeachboy1b 1 points 3 days ago Am I though? Do you genuinely believe that they’re NOT going to try and completely FUCK the entire country as soon as they get any facet of real power? Unless you’ve been living under a rock, we have seen more than enough evidence that these people want us DEAD. permalink parent award report block reply Executarian2 0 points 3 days ago Being this terminally online is not healthy. permalink parent award report block reply Oleander 1 points 3 days ago I'm not the one you were talking to before, but I don't think you realize how close the Democrats are to total control. All it's going to take is disbanding border security, and/or a mass amnesty deal, and the deed is done. Republicans would not be viable as a national party anymore, imagine a blue Texas. They are definitely prepping their base to fall in line in favor of something like this by making border security a political issue, as well. I would be genuinely surprised if the next Democrat administration doesn't do this, so we are really only one Democrat away from the brink at this point. permalink parent award report block reply\nExecutarian2 0 points 3 days ago Being this terminally online is not healthy. permalink parent award report block reply Oleander 1 points 3 days ago I'm not the one you were talking to before, but I don't think you realize how close the Democrats are to total control. All it's going to take is disbanding border security, and/or a mass amnesty deal, and the deed is done. Republicans would not be viable as a national party anymore, imagine a blue Texas. They are definitely prepping their base to fall in line in favor of something like this by making border security a political issue, as well. I would be genuinely surprised if the next Democrat administration doesn't do this, so we are really only one Democrat away from the brink at this point. permalink parent award report block reply\nOleander 1 points 3 days ago I'm not the one you were talking to before, but I don't think you realize how close the Democrats are to total control. All it's going to take is disbanding border security, and/or a mass amnesty deal, and the deed is done. Republicans would not be viable as a national party anymore, imagine a blue Texas. They are definitely prepping their base to fall in line in favor of something like this by making border security a political issue, as well. I would be genuinely surprised if the next Democrat administration doesn't do this, so we are really only one Democrat away from the brink at this point. permalink parent award report block reply\nPats5x 1 points 2 days ago It's part of the GOP plan....they've been in total power since 1/20/25.  Going on 10 months.  What have they accomplished?  A big beautiful bullshit bill that is way more mitt romney than maga...and a shitload of EOs that will be reversed the second Newsom takes office in 2029. permalink award report block reply\nVaultdwelIer 1 points 3 days ago the problem with republicans is that if things go bad they dont go out and vote but democrats vote blue no matter what permalink award report block reply\nTrump454748 1 points 3 days ago I must’ve missed something, is there a presidential election happening in 2026? permalink award report block reply Roadpower 3 points 3 days ago It's considered midterms for the president. Congress people are constantly running because of a two year election cycle. https://www.usa.gov/midterm-elections permalink parent award report block reply\nRoadpower 3 points 3 days ago It's considered midterms for the president. Congress people are constantly running because of a two year election cycle. https://www.usa.gov/midterm-elections permalink parent award report block reply\ngezadreamsheets2 1 points 3 days ago Seems like that's what the GOP wants! They all fucking hate us permalink award report block reply\nMediaBro 1 points 3 days ago He is right. The Dems have a goal now, with Mamdani's win and they're clear they have enough legal and illegals to help them win that vote. The MAGA base has gone after even the moderate Independents who voted for MAGA in 2024, especially the non-White voters who voted for Trump. In attacking everyone who is not a White Christian and allowing Nick Fuentes to become the voice of MAGA, you'll have galvanised the worst of the Marxists to become the voice of reason and empathy. And that's a horrifying thought. So, yes, the Dems are going to sweep the midterms and win in 2026 and 2028, if this current climate continues. The only way the GOP wins again in 2026 or 2028 is if there is a massive turn in the economy and you'll muzzle the dumbfucks spouting their asinine comments on X. Free speech, where everyone is just calling everyone names, isn't going to win hearts and minds. permalink award report block reply\nFlyCatcher94 1 points 3 days ago Right. Because the GOP are cucks, and only care about vote payoffs.  Most of those fucks are compromised, and are unwilling to do anything right. permalink award report block reply\nKarenLukasik 1 points 3 days ago Since he’s wrong on just about EVERYTHING, this bothers me not at all… permalink award report block reply Executarian2 7 points 3 days ago Don't get complacent. permalink parent award report block reply KarenLukasik 1 points 2 days ago not complacent,just reassured by his rhetoric. Latest example: was Jeffries correct about the shutdown outcome? No,he wasn’t,so in the failure column it goes! permalink parent award report block reply\nExecutarian2 7 points 3 days ago Don't get complacent. permalink parent award report block reply KarenLukasik 1 points 2 days ago not complacent,just reassured by his rhetoric. Latest example: was Jeffries correct about the shutdown outcome? No,he wasn’t,so in the failure column it goes! permalink parent award report block reply\nKarenLukasik 1 points 2 days ago not complacent,just reassured by his rhetoric. Latest example: was Jeffries correct about the shutdown outcome? No,he wasn’t,so in the failure column it goes! permalink parent award report block reply\nAggrieved03 1 points 3 days ago He ain’t wrong! permalink award report block reply\nAllTheWayTrump 1 points 2 days ago The cheating will never end and will only get worse because the cheaters have been emboldened. permalink award report block reply\nDoMe22 1 points 3 days ago Take this fucking threat seriously. Jesus Christ. The current administration needs to get something done. It feels like everyone around Trump, barring like 2 people are just dragging their heels. permalink award report block reply KernalMustard 0 points 3 days ago The ones who are pretty far from inner circle permalink parent award report block reply\nKernalMustard 0 points 3 days ago The ones who are pretty far from inner circle permalink parent award report block reply\nRizzlieDoodad 1 points 3 days ago Yes right. The Republicans won't get anything done and people will vote in the other party. The Republicans will just say, \"oh rats, we'll get em next time\" and the. Rinse and repeat permalink award report block reply\nTrumpvitative 1 points 3 days ago If there \"Republican\" politicians don't get their shit together they will permalink award report block reply\n2025WhatIsTrue 1 points 2 days ago Hey...where's your sombrero, muchacho??? permalink award report block reply\nSonOfThunder 0 points 3 days ago The Republicans are working with him to make this happen. permalink award report block reply\nbarwhack 0 points 3 days ago It doesn't matter who wins, if \"winning\" does not include the Epstard Files. The pedo system burns in any of the three ways; it's just who gets burned , that shifts around. permalink award report block reply deleted 4 points 3 days ago UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 0 points 3 days ago Right no one irl talk about or many doesn't even who who Epstein is. They don't have time to pay attention to this distraction while trying to work two jobs so they can pay rent, put food on the table and pay for gas/utility bills. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\ndeleted 4 points 3 days ago UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply maverick202 0 points 3 days ago Right no one irl talk about or many doesn't even who who Epstein is. They don't have time to pay attention to this distraction while trying to work two jobs so they can pay rent, put food on the table and pay for gas/utility bills. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nUCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nmaverick202 0 points 3 days ago Right no one irl talk about or many doesn't even who who Epstein is. They don't have time to pay attention to this distraction while trying to work two jobs so they can pay rent, put food on the table and pay for gas/utility bills. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nUCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nrivetjoint2 0 points 3 days ago What is he going to do with his puppeteer Nancy? permalink award report block reply\nAlldayeveryday 0 points 3 days ago Of course they are gonna win. It's the plan. One big club and we ain't in it permalink award report block reply\nDeltamyass 0 points 3 days ago Ugly troll permalink award report block reply\nNoticesBugleOWO 0 points 3 days ago Over my dead body. permalink award report block reply\nJrtomasejn 0 points 3 days ago Hahahaha.  Voter ID will wipe out the Democrat Party. permalink award report block reply KernalMustard 1 points 3 days ago You're a fool. They will take another route. A rat makes a new nest when discovered. permalink parent award report block reply\nKernalMustard 1 points 3 days ago You're a fool. They will take another route. A rat makes a new nest when discovered. permalink parent award report block reply\nSystemfree1632 0 points 3 days ago They are over confident in their cheating system . Why are we allowing this to continue ? permalink award report block reply\nDontTreadOnLego -1 points 3 days ago Now that California cheated to redistrict, Texas should redo their maps and get the additional few seats that they could have last time.  It is all out war. permalink award report block reply Executarian2 1 points 3 days ago Aren't both states now gerrymandered the same to wipe out five seats each? permalink parent award report block reply DontTreadOnLego 1 points 3 days ago Texas is not now.  Republicans could have gerrymandered but chose not to out of principle after ungerrymandering the demo-rat mess.  Now they should do it for retaliation for the cheating in Commifornia. permalink parent award report block reply Executarian2 1 points 3 days ago Oh, did Texas undo their map change? permalink parent award report block reply DontTreadOnLego 1 points 3 days ago No, the new map that is ungerrymandered is in place currently.  But it possible to gerrymander the current in the republican's favor. permalink parent award report block reply view 6 more comments...\nExecutarian2 1 points 3 days ago Aren't both states now gerrymandered the same to wipe out five seats each? permalink parent award report block reply DontTreadOnLego 1 points 3 days ago Texas is not now.  Republicans could have gerrymandered but chose not to out of principle after ungerrymandering the demo-rat mess.  Now they should do it for retaliation for the cheating in Commifornia. permalink parent award report block reply Executarian2 1 points 3 days ago Oh, did Texas undo their map change? permalink parent award report block reply DontTreadOnLego 1 points 3 days ago No, the new map that is ungerrymandered is in place currently.  But it possible to gerrymander the current in the republican's favor. permalink parent award report block reply view 6 more comments...\nDontTreadOnLego 1 points 3 days ago Texas is not now.  Republicans could have gerrymandered but chose not to out of principle after ungerrymandering the demo-rat mess.  Now they should do it for retaliation for the cheating in Commifornia. permalink parent award report block reply Executarian2 1 points 3 days ago Oh, did Texas undo their map change? permalink parent award report block reply DontTreadOnLego 1 points 3 days ago No, the new map that is ungerrymandered is in place currently.  But it possible to gerrymander the current in the republican's favor. permalink parent award report block reply view 6 more comments...\nExecutarian2 1 points 3 days ago Oh, did Texas undo their map change? permalink parent award report block reply DontTreadOnLego 1 points 3 days ago No, the new map that is ungerrymandered is in place currently.  But it possible to gerrymander the current in the republican's favor. permalink parent award report block reply view 6 more comments...\nDontTreadOnLego 1 points 3 days ago No, the new map that is ungerrymandered is in place currently.  But it possible to gerrymander the current in the republican's favor. permalink parent award report block reply view 6 more comments...\nImYourHuckleberry24 -1 points 3 days ago He's right, by cheating. There's nothing stopping them. permalink award report block reply\nZnut55 -1 points 3 days ago They have mastered cheating.  Look what happened in the election last week.  ALL the polls where wrong and no matter how much the Dems approval rating is in the tank, they soared in the election.  Make it make sense. permalink award report block reply Executarian2 6 points 3 days ago Stop blaming losses on cheating. There are plenty of substantive reasons why the Democrats whooped us on Tuesday, and sitting here complaining that \"well, we only lost because of CHEATING!\" is simply retarded. permalink parent award report block reply maverick202 1 points 3 days ago Why use critical thinking while we can just scream mUh RIgGeD eLeCtIoN!! permalink parent award report block reply Executarian2 2 points 3 days ago It's so fucking exhausting! Is voter fraud a problem? Maybe (it's fucking impossible to tell when every single lost election is declared to be fraudulent), but we can't just blame every loss on that. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nExecutarian2 6 points 3 days ago Stop blaming losses on cheating. There are plenty of substantive reasons why the Democrats whooped us on Tuesday, and sitting here complaining that \"well, we only lost because of CHEATING!\" is simply retarded. permalink parent award report block reply maverick202 1 points 3 days ago Why use critical thinking while we can just scream mUh RIgGeD eLeCtIoN!! permalink parent award report block reply Executarian2 2 points 3 days ago It's so fucking exhausting! Is voter fraud a problem? Maybe (it's fucking impossible to tell when every single lost election is declared to be fraudulent), but we can't just blame every loss on that. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nmaverick202 1 points 3 days ago Why use critical thinking while we can just scream mUh RIgGeD eLeCtIoN!! permalink parent award report block reply Executarian2 2 points 3 days ago It's so fucking exhausting! Is voter fraud a problem? Maybe (it's fucking impossible to tell when every single lost election is declared to be fraudulent), but we can't just blame every loss on that. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nExecutarian2 2 points 3 days ago It's so fucking exhausting! Is voter fraud a problem? Maybe (it's fucking impossible to tell when every single lost election is declared to be fraudulent), but we can't just blame every loss on that. permalink parent award report block reply\nUCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\nUCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\ntlorsung -1 points 3 days ago Ok, Who is this Jeffries?   Did someone forget to tell him about DEM hit us, GOP Hit harder, lower, higher and most of all we'll cheat better then they did, has we learned from them!   Its On! permalink award report block reply Kickass2001 2 points 3 days ago Oh brother. permalink parent award report block reply\nKickass2001 2 points 3 days ago Oh brother. permalink parent award report block reply\nDwoj -2 points 3 days ago Yeah, not even in their wildest dreams permalink award report block reply Executarian2 6 points 3 days ago If the sentiment from last Tuesday continues into next year? We're fucked. No question about it. permalink parent award report block reply starjello 1 points 3 days ago You are exactly right. I said this the whole week since Tuesday's elections and all I get is grief and downvoting from the morons on here. permalink parent award report block reply\nExecutarian2 6 points 3 days ago If the sentiment from last Tuesday continues into next year? We're fucked. No question about it. permalink parent award report block reply starjello 1 points 3 days ago You are exactly right. I said this the whole week since Tuesday's elections and all I get is grief and downvoting from the morons on here. permalink parent award report block reply\nstarjello 1 points 3 days ago You are exactly right. I said this the whole week since Tuesday's elections and all I get is grief and downvoting from the morons on here. permalink parent award report block reply\noilybohunkofshit 2 points 3 days ago Comment removed by community moderators. permalink award report block reply Executarian2 1 points 3 days ago Nah, even if we lost every single Likely R and below seat, we'd still have like 45 in the Senate. You need 67 to remove. permalink parent award report block reply oilybohunkofshit 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply\nExecutarian2 1 points 3 days ago Nah, even if we lost every single Likely R and below seat, we'd still have like 45 in the Senate. You need 67 to remove. permalink parent award report block reply oilybohunkofshit 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply\noilybohunkofshit 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply\nanymouse2233445566 1 points 3 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T20:53:11.893873Z"
}