{
  "id": "1ARK57t3In",
  "url": "https://patriots.win/p/1ARK57t3In/temporary-means-temporary--get-o/c",
  "content": "1111 \"Temporary\" means temporary.  Get over it and go home. posted 4 days ago by KuzoKevin 82 comments award share report block MJTruthUltra @MJTruthUltra • 4d KABOOM💥💥💥 Fire up the jets boys… we’re taking ILLEGALS home‼️ 🚨 #BREAKING - The Temporary Protected Status that Joe Biden Gave Hundreds of Thousands of Venezuelans, EXPIRED last night! 260,000 Venezuelans lost their status, their work permit, their drivers licenses. 🥳🥳🎉\n82 comments Sort by Top Top New Worst Old Save TheAftermath 92 points 4 days ago Now do Somalis. Also 'Temporary'. permalink award report block reply Hanging_Chad 21 points 4 days ago can we send the Cubans back home yet? permalink parent award report block reply SteelBallRun1890 25 points 4 days ago Cuba is different from the rest because we are the closest place to them and it is an actual communist regime where the people there are pulled off the streets and killed for disagreeing, and there hasn't been any food for natives to eat in months. It's why they were one of the few exceptions we had until 0bumma decided it wasn't \"real communisim\" and revoked it all. And yes I am aware many of the young Cubans are not the same as the older generations. permalink parent award report block reply Repentnow 24 points 4 days ago Show me in the Constitution where it says we need to give anybody refugee status? 100% of our immigration needs to be merit-based. No one should come here unless they are a net gain. permalink parent award report block reply Desensitized 7 points 4 days ago Cubans overwhelmingly vote Trump.  They hate socialism.  That's a net gain.  I really wish we had a test to find the Venezuelans who are here because they hate socialism.  I'd keep them, too.  Then I'd apply the test to Cubans, so we're only keeping the ones that hate socialism. permalink parent award report block reply view 6 more comments... Maskurbator 1 points 4 days ago Merit based is only a three quart measure. The question shouldn't be \"is this a good person?\" The question is \"will this person benefit the current stock of Americans? Will they improve and enrich the lives of the people who are already legally here?\" permalink parent award report block reply Govtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply redditadminssuckit 8 points 4 days ago Most Cubans are based permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Most OLD Cubans are based. Their kids are not. permalink parent award report block reply IncredibleMrE1 5 points 4 days ago Rubio and Mayorkas might not like being deported. permalink parent award report block reply Hanging_Chad 9 points 4 days ago Mayorkas should visit CECOT permalink parent award report block reply IncredibleMrE1 4 points 4 days ago And no private cell. permalink parent award report block reply Doritalos 2 points 4 days ago Marco was born in the USA, Miami FL. You should know this when he ran for fucking President. permalink parent award report block reply IncredibleMrE1 2 points 4 days ago To non-citizen refugee parents permalink parent award report block reply view 1 more comments... Easzq8 4 points 4 days ago Aren’t Cubans anti-communist? permalink parent award report block reply HeavyMetalPatriot 3 points 4 days ago Only the first generation. Their grandkids are retarded. permalink parent award report block reply TheMustacheBandit 3 points 4 days ago Cubans vote red. permalink parent award report block reply load 2 more comments... Filo76 18 points 4 days ago And the Haitians. permalink parent award report block reply TheAftermath 17 points 4 days ago Especially the Haitians. permalink parent award report block reply Frenchie619 6 points 4 days ago Yea,  no shit about the Haitians! They gotta GTFO! permalink parent award report block reply 10gauge 7 points 4 days ago Temporary,  like federal income tax from WW1? permalink parent award report block reply TheAftermath 5 points 4 days ago Ah now there's a long temporary. The 'Federal' Reserve needs to be 'temporarily' nuked from orbit. permalink parent award report block reply SorosHasBallsackEyes 5 points 4 days ago The Somalis are 100x worse\nRetarded cousin fuckers. One look at an average Somali confirms all prejudice against them. Their misshapen heads, crazy eyes, and  habit of producing children with family members all lend credibility to the notion that we don't need them here at all. permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Such focus on Somalis is very unfair! To be equitable, we must deport ALL muslims instead. permalink parent award report block reply TheAftermath 2 points 4 days ago These inbred subhumans have been imported as bioweapons to destroy our country. Your description is totally accurate. We need them like we need a hole in the head. permalink parent award report block reply preferredfault 33 points 4 days ago They didn't \"lose\" their status. They got all the status afforded to them, until it expired. Nothing was lost. The whole point of giving them temporary status wasn't so they could live in America forever, but so they could work out what they were going to do next, as in, either go back to Venezuela, try to seek citizenship and go through the process and qualifications for it, or figure out another country to go live in. That's what temporary status is for. They got everything they were given, in full. They didn't lose anything, they used it all up. permalink award report block reply henri_derelicte 10 points 4 days ago They don’t have to go back, but they can’t stay here permalink parent award report block reply guywholikesDjtof2024 7 points 4 days ago Correct. permalink parent award report block reply redditadminssuckit 3 points 4 days ago ☝️ permalink parent award report block reply Hanging_Chad 23 points 4 days ago bye bye permalink award report block reply IncredibleMrE1 20 points 4 days ago Go home to mommy! permalink parent award report block reply guywholikesDjtof2024 15 points 4 days ago Based. Get foreigners outta here. Dear Democrats: Your \"DEIversity\" is not our strength. ULTRA MAGA! permalink award report block reply IncredibleMrE1 12 points 4 days ago They have to go back. permalink award report block reply mohel 9 points 4 days ago We are not a ZOO permalink award report block reply Lmn8rinos 8 points 4 days ago Been to Walmart lately? permalink parent award report block reply billybaldwin2 9 points 4 days ago My deep blue area has had issues with Venezuelan trios. Always 2 men + 1 woman. Mugging people. Robbing stores. Killing people. Seems like 2 guys will always find a girl to be their bait. Everyone is nice to the girl, then two guys come in for the crime. Been going on since 2021. Always Venezuelan. The murders have gotten 10+ years. IDK about the rest. They appear in the news and never again. permalink award report block reply OrangeManBadasss 7 points 4 days ago They have to go. And I'm not sorry, and I'm not apologizing for it permalink award report block reply TheRedPilledArtist 7 points 4 days ago Adios! permalink award report block reply CANATIVE 6 points 4 days ago Too bad go home permalink award report block reply possibletower 5 points 4 days ago Are we going to deport these fuckers finally? They don't even get the right to claim DACA grey zone status. DEPORT THEM ALL!!!! They are a bunch of fucking welfare/food stamps leeches! permalink award report block reply ingrowntoenail 5 points 4 days ago GTFO! permalink award report block reply MemoryHoleyeO 4 points 4 days ago The first x response is \"doing jobs Americans won't\" what a crock of bullshit permalink award report block reply South_Florida_Guy 4 points 4 days ago Peace out permalink award report block reply Ladybug87 4 points 4 days ago Dems give the Venezuelans protected status because they are escaping socialism in their country, yet the same Dems are trying to implement socialism right here. It makes no sense. permalink award report block reply henri_derelicte 5 points 4 days ago The Venezuelans by me are either begging/selling stuff as unlicensed street vendors, or delivering food on bikes and scooters. Import the third world, become the third world permalink parent award report block reply FusionBlack 3 points 4 days ago Damn the reporter is even forgien. permalink award report block reply ChineseHamPlanet 3 points 4 days ago Get rid of all the fucking Muslim roaches first permalink award report block reply Shitsbrokeyo 3 points 4 days ago Kill the visa program now. permalink award report block reply RhodesianRidgeback 3 points 4 days ago They have fake papers and fake ID's. And they have entire industries that cater to them. They aren't going anywhere. permalink award report block reply AwShitHereWeGoAgain 3 points 4 days ago Helicopters might work better........... permalink award report block reply henri_derelicte 3 points 4 days ago I agree with the administration choosing not to renew or extend TPS. However, the part I’m bothered with are the handful of cases where the courts intervened and extended TPS status for some Haitians and Venezuelans into 2026. The courts don’t decide immigration status, the executive branch does permalink award report block reply TrumpLandslide20201 3 points 4 days ago Bye bye fuckers go make your shit hole great again we got our own problems. permalink award report block reply Braujager 3 points 4 days ago “It's just we're putting new coversheets on all the TPS Deports before they go out now. Did you get that memo?” 😉 permalink award report block reply PoleWatcher 3 points 4 days ago I can feel less traffic and less store lines eveeywhere permalink award report block reply magapatriot_pa 2 points 4 days ago Nothing is more permanent than a temporary government program permalink award report block reply QueensOwn 2 points 4 days ago Adios, amigos permalink award report block reply TheBasedFriscoMan 2 points 4 days ago GET THE FUCK OUT!!! permalink award report block reply DefKon1 2 points 4 days ago 260000???? That's fuckin' TREASON! permalink award report block reply Nanteen 2 points 4 days ago The Hawaiian judge will say temporary meant 2345. permalink award report block reply Krat 2 points 4 days ago We need live broadcasts of planes filled up leaving just like we had broadcasts of planes filled showing the tens of millions coming to steal your life and freedom away permalink award report block reply Greenblatts_4skin 2 points 4 days ago \"did you get what you voted for?\" \"yes, absolutely\" permalink award report block reply Agent_86 2 points 4 days ago GTFO!! permalink award report block reply josiborg 2 points 4 days ago Add 2 more zeros to the end of that permalink award report block reply FrenOrFoe 1 points 4 days ago Look at them flying all those Venezuelan flags! If you love your country so much, why don’t you want to go back? permalink award report block reply geekesmind 1 points 4 days ago They should never had any of that crap in the first place GTFO permalink award report block reply magaMC117 1 points 4 days ago NO WAY w/ those big titties will she not find a guy to marry permalink award report block reply f_bastiat 1 points 4 days ago Noice. I genuinely hope they go make Venezuela great again, or for the first time, idk if they were ever great because I don't care about countries other than my own. permalink award report block reply Tardigrade 1 points 4 days ago They were great, for what it's worth.  Richest country in South America. permalink parent award report block reply\nTheAftermath 92 points 4 days ago Now do Somalis. Also 'Temporary'. permalink award report block reply Hanging_Chad 21 points 4 days ago can we send the Cubans back home yet? permalink parent award report block reply SteelBallRun1890 25 points 4 days ago Cuba is different from the rest because we are the closest place to them and it is an actual communist regime where the people there are pulled off the streets and killed for disagreeing, and there hasn't been any food for natives to eat in months. It's why they were one of the few exceptions we had until 0bumma decided it wasn't \"real communisim\" and revoked it all. And yes I am aware many of the young Cubans are not the same as the older generations. permalink parent award report block reply Repentnow 24 points 4 days ago Show me in the Constitution where it says we need to give anybody refugee status? 100% of our immigration needs to be merit-based. No one should come here unless they are a net gain. permalink parent award report block reply Desensitized 7 points 4 days ago Cubans overwhelmingly vote Trump.  They hate socialism.  That's a net gain.  I really wish we had a test to find the Venezuelans who are here because they hate socialism.  I'd keep them, too.  Then I'd apply the test to Cubans, so we're only keeping the ones that hate socialism. permalink parent award report block reply view 6 more comments... Maskurbator 1 points 4 days ago Merit based is only a three quart measure. The question shouldn't be \"is this a good person?\" The question is \"will this person benefit the current stock of Americans? Will they improve and enrich the lives of the people who are already legally here?\" permalink parent award report block reply Govtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply redditadminssuckit 8 points 4 days ago Most Cubans are based permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Most OLD Cubans are based. Their kids are not. permalink parent award report block reply IncredibleMrE1 5 points 4 days ago Rubio and Mayorkas might not like being deported. permalink parent award report block reply Hanging_Chad 9 points 4 days ago Mayorkas should visit CECOT permalink parent award report block reply IncredibleMrE1 4 points 4 days ago And no private cell. permalink parent award report block reply Doritalos 2 points 4 days ago Marco was born in the USA, Miami FL. You should know this when he ran for fucking President. permalink parent award report block reply IncredibleMrE1 2 points 4 days ago To non-citizen refugee parents permalink parent award report block reply view 1 more comments... Easzq8 4 points 4 days ago Aren’t Cubans anti-communist? permalink parent award report block reply HeavyMetalPatriot 3 points 4 days ago Only the first generation. Their grandkids are retarded. permalink parent award report block reply TheMustacheBandit 3 points 4 days ago Cubans vote red. permalink parent award report block reply load 2 more comments... Filo76 18 points 4 days ago And the Haitians. permalink parent award report block reply TheAftermath 17 points 4 days ago Especially the Haitians. permalink parent award report block reply Frenchie619 6 points 4 days ago Yea,  no shit about the Haitians! They gotta GTFO! permalink parent award report block reply 10gauge 7 points 4 days ago Temporary,  like federal income tax from WW1? permalink parent award report block reply TheAftermath 5 points 4 days ago Ah now there's a long temporary. The 'Federal' Reserve needs to be 'temporarily' nuked from orbit. permalink parent award report block reply SorosHasBallsackEyes 5 points 4 days ago The Somalis are 100x worse\nRetarded cousin fuckers. One look at an average Somali confirms all prejudice against them. Their misshapen heads, crazy eyes, and  habit of producing children with family members all lend credibility to the notion that we don't need them here at all. permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Such focus on Somalis is very unfair! To be equitable, we must deport ALL muslims instead. permalink parent award report block reply TheAftermath 2 points 4 days ago These inbred subhumans have been imported as bioweapons to destroy our country. Your description is totally accurate. We need them like we need a hole in the head. permalink parent award report block reply\nHanging_Chad 21 points 4 days ago can we send the Cubans back home yet? permalink parent award report block reply SteelBallRun1890 25 points 4 days ago Cuba is different from the rest because we are the closest place to them and it is an actual communist regime where the people there are pulled off the streets and killed for disagreeing, and there hasn't been any food for natives to eat in months. It's why they were one of the few exceptions we had until 0bumma decided it wasn't \"real communisim\" and revoked it all. And yes I am aware many of the young Cubans are not the same as the older generations. permalink parent award report block reply Repentnow 24 points 4 days ago Show me in the Constitution where it says we need to give anybody refugee status? 100% of our immigration needs to be merit-based. No one should come here unless they are a net gain. permalink parent award report block reply Desensitized 7 points 4 days ago Cubans overwhelmingly vote Trump.  They hate socialism.  That's a net gain.  I really wish we had a test to find the Venezuelans who are here because they hate socialism.  I'd keep them, too.  Then I'd apply the test to Cubans, so we're only keeping the ones that hate socialism. permalink parent award report block reply view 6 more comments... Maskurbator 1 points 4 days ago Merit based is only a three quart measure. The question shouldn't be \"is this a good person?\" The question is \"will this person benefit the current stock of Americans? Will they improve and enrich the lives of the people who are already legally here?\" permalink parent award report block reply Govtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply redditadminssuckit 8 points 4 days ago Most Cubans are based permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Most OLD Cubans are based. Their kids are not. permalink parent award report block reply IncredibleMrE1 5 points 4 days ago Rubio and Mayorkas might not like being deported. permalink parent award report block reply Hanging_Chad 9 points 4 days ago Mayorkas should visit CECOT permalink parent award report block reply IncredibleMrE1 4 points 4 days ago And no private cell. permalink parent award report block reply Doritalos 2 points 4 days ago Marco was born in the USA, Miami FL. You should know this when he ran for fucking President. permalink parent award report block reply IncredibleMrE1 2 points 4 days ago To non-citizen refugee parents permalink parent award report block reply view 1 more comments... Easzq8 4 points 4 days ago Aren’t Cubans anti-communist? permalink parent award report block reply HeavyMetalPatriot 3 points 4 days ago Only the first generation. Their grandkids are retarded. permalink parent award report block reply TheMustacheBandit 3 points 4 days ago Cubans vote red. permalink parent award report block reply load 2 more comments...\nSteelBallRun1890 25 points 4 days ago Cuba is different from the rest because we are the closest place to them and it is an actual communist regime where the people there are pulled off the streets and killed for disagreeing, and there hasn't been any food for natives to eat in months. It's why they were one of the few exceptions we had until 0bumma decided it wasn't \"real communisim\" and revoked it all. And yes I am aware many of the young Cubans are not the same as the older generations. permalink parent award report block reply Repentnow 24 points 4 days ago Show me in the Constitution where it says we need to give anybody refugee status? 100% of our immigration needs to be merit-based. No one should come here unless they are a net gain. permalink parent award report block reply Desensitized 7 points 4 days ago Cubans overwhelmingly vote Trump.  They hate socialism.  That's a net gain.  I really wish we had a test to find the Venezuelans who are here because they hate socialism.  I'd keep them, too.  Then I'd apply the test to Cubans, so we're only keeping the ones that hate socialism. permalink parent award report block reply view 6 more comments... Maskurbator 1 points 4 days ago Merit based is only a three quart measure. The question shouldn't be \"is this a good person?\" The question is \"will this person benefit the current stock of Americans? Will they improve and enrich the lives of the people who are already legally here?\" permalink parent award report block reply Govtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nRepentnow 24 points 4 days ago Show me in the Constitution where it says we need to give anybody refugee status? 100% of our immigration needs to be merit-based. No one should come here unless they are a net gain. permalink parent award report block reply Desensitized 7 points 4 days ago Cubans overwhelmingly vote Trump.  They hate socialism.  That's a net gain.  I really wish we had a test to find the Venezuelans who are here because they hate socialism.  I'd keep them, too.  Then I'd apply the test to Cubans, so we're only keeping the ones that hate socialism. permalink parent award report block reply view 6 more comments... Maskurbator 1 points 4 days ago Merit based is only a three quart measure. The question shouldn't be \"is this a good person?\" The question is \"will this person benefit the current stock of Americans? Will they improve and enrich the lives of the people who are already legally here?\" permalink parent award report block reply\nDesensitized 7 points 4 days ago Cubans overwhelmingly vote Trump.  They hate socialism.  That's a net gain.  I really wish we had a test to find the Venezuelans who are here because they hate socialism.  I'd keep them, too.  Then I'd apply the test to Cubans, so we're only keeping the ones that hate socialism. permalink parent award report block reply view 6 more comments...\nMaskurbator 1 points 4 days ago Merit based is only a three quart measure. The question shouldn't be \"is this a good person?\" The question is \"will this person benefit the current stock of Americans? Will they improve and enrich the lives of the people who are already legally here?\" permalink parent award report block reply\nGovtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nredditadminssuckit 8 points 4 days ago Most Cubans are based permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Most OLD Cubans are based. Their kids are not. permalink parent award report block reply\nHeavyMetalPatriot 2 points 4 days ago Most OLD Cubans are based. Their kids are not. permalink parent award report block reply\nIncredibleMrE1 5 points 4 days ago Rubio and Mayorkas might not like being deported. permalink parent award report block reply Hanging_Chad 9 points 4 days ago Mayorkas should visit CECOT permalink parent award report block reply IncredibleMrE1 4 points 4 days ago And no private cell. permalink parent award report block reply Doritalos 2 points 4 days ago Marco was born in the USA, Miami FL. You should know this when he ran for fucking President. permalink parent award report block reply IncredibleMrE1 2 points 4 days ago To non-citizen refugee parents permalink parent award report block reply view 1 more comments...\nHanging_Chad 9 points 4 days ago Mayorkas should visit CECOT permalink parent award report block reply IncredibleMrE1 4 points 4 days ago And no private cell. permalink parent award report block reply\nIncredibleMrE1 4 points 4 days ago And no private cell. permalink parent award report block reply\nDoritalos 2 points 4 days ago Marco was born in the USA, Miami FL. You should know this when he ran for fucking President. permalink parent award report block reply IncredibleMrE1 2 points 4 days ago To non-citizen refugee parents permalink parent award report block reply view 1 more comments...\nIncredibleMrE1 2 points 4 days ago To non-citizen refugee parents permalink parent award report block reply view 1 more comments...\nEaszq8 4 points 4 days ago Aren’t Cubans anti-communist? permalink parent award report block reply HeavyMetalPatriot 3 points 4 days ago Only the first generation. Their grandkids are retarded. permalink parent award report block reply\nHeavyMetalPatriot 3 points 4 days ago Only the first generation. Their grandkids are retarded. permalink parent award report block reply\nTheMustacheBandit 3 points 4 days ago Cubans vote red. permalink parent award report block reply\nFilo76 18 points 4 days ago And the Haitians. permalink parent award report block reply TheAftermath 17 points 4 days ago Especially the Haitians. permalink parent award report block reply Frenchie619 6 points 4 days ago Yea,  no shit about the Haitians! They gotta GTFO! permalink parent award report block reply\nTheAftermath 17 points 4 days ago Especially the Haitians. permalink parent award report block reply Frenchie619 6 points 4 days ago Yea,  no shit about the Haitians! They gotta GTFO! permalink parent award report block reply\nFrenchie619 6 points 4 days ago Yea,  no shit about the Haitians! They gotta GTFO! permalink parent award report block reply\n10gauge 7 points 4 days ago Temporary,  like federal income tax from WW1? permalink parent award report block reply TheAftermath 5 points 4 days ago Ah now there's a long temporary. The 'Federal' Reserve needs to be 'temporarily' nuked from orbit. permalink parent award report block reply\nTheAftermath 5 points 4 days ago Ah now there's a long temporary. The 'Federal' Reserve needs to be 'temporarily' nuked from orbit. permalink parent award report block reply\nSorosHasBallsackEyes 5 points 4 days ago The Somalis are 100x worse\nRetarded cousin fuckers. One look at an average Somali confirms all prejudice against them. Their misshapen heads, crazy eyes, and  habit of producing children with family members all lend credibility to the notion that we don't need them here at all. permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Such focus on Somalis is very unfair! To be equitable, we must deport ALL muslims instead. permalink parent award report block reply TheAftermath 2 points 4 days ago These inbred subhumans have been imported as bioweapons to destroy our country. Your description is totally accurate. We need them like we need a hole in the head. permalink parent award report block reply\nHeavyMetalPatriot 2 points 4 days ago Such focus on Somalis is very unfair! To be equitable, we must deport ALL muslims instead. permalink parent award report block reply\nTheAftermath 2 points 4 days ago These inbred subhumans have been imported as bioweapons to destroy our country. Your description is totally accurate. We need them like we need a hole in the head. permalink parent award report block reply\npreferredfault 33 points 4 days ago They didn't \"lose\" their status. They got all the status afforded to them, until it expired. Nothing was lost. The whole point of giving them temporary status wasn't so they could live in America forever, but so they could work out what they were going to do next, as in, either go back to Venezuela, try to seek citizenship and go through the process and qualifications for it, or figure out another country to go live in. That's what temporary status is for. They got everything they were given, in full. They didn't lose anything, they used it all up. permalink award report block reply henri_derelicte 10 points 4 days ago They don’t have to go back, but they can’t stay here permalink parent award report block reply guywholikesDjtof2024 7 points 4 days ago Correct. permalink parent award report block reply redditadminssuckit 3 points 4 days ago ☝️ permalink parent award report block reply\nhenri_derelicte 10 points 4 days ago They don’t have to go back, but they can’t stay here permalink parent award report block reply\nguywholikesDjtof2024 7 points 4 days ago Correct. permalink parent award report block reply\nredditadminssuckit 3 points 4 days ago ☝️ permalink parent award report block reply\nHanging_Chad 23 points 4 days ago bye bye permalink award report block reply IncredibleMrE1 20 points 4 days ago Go home to mommy! permalink parent award report block reply\nIncredibleMrE1 20 points 4 days ago Go home to mommy! permalink parent award report block reply\nguywholikesDjtof2024 15 points 4 days ago Based. Get foreigners outta here. Dear Democrats: Your \"DEIversity\" is not our strength. ULTRA MAGA! permalink award report block reply\nIncredibleMrE1 12 points 4 days ago They have to go back. permalink award report block reply\nmohel 9 points 4 days ago We are not a ZOO permalink award report block reply Lmn8rinos 8 points 4 days ago Been to Walmart lately? permalink parent award report block reply\nLmn8rinos 8 points 4 days ago Been to Walmart lately? permalink parent award report block reply\nbillybaldwin2 9 points 4 days ago My deep blue area has had issues with Venezuelan trios. Always 2 men + 1 woman. Mugging people. Robbing stores. Killing people. Seems like 2 guys will always find a girl to be their bait. Everyone is nice to the girl, then two guys come in for the crime. Been going on since 2021. Always Venezuelan. The murders have gotten 10+ years. IDK about the rest. They appear in the news and never again. permalink award report block reply\nOrangeManBadasss 7 points 4 days ago They have to go. And I'm not sorry, and I'm not apologizing for it permalink award report block reply\nTheRedPilledArtist 7 points 4 days ago Adios! permalink award report block reply\nCANATIVE 6 points 4 days ago Too bad go home permalink award report block reply\npossibletower 5 points 4 days ago Are we going to deport these fuckers finally? They don't even get the right to claim DACA grey zone status. DEPORT THEM ALL!!!! They are a bunch of fucking welfare/food stamps leeches! permalink award report block reply\ningrowntoenail 5 points 4 days ago GTFO! permalink award report block reply\nMemoryHoleyeO 4 points 4 days ago The first x response is \"doing jobs Americans won't\" what a crock of bullshit permalink award report block reply\nSouth_Florida_Guy 4 points 4 days ago Peace out permalink award report block reply\nLadybug87 4 points 4 days ago Dems give the Venezuelans protected status because they are escaping socialism in their country, yet the same Dems are trying to implement socialism right here. It makes no sense. permalink award report block reply henri_derelicte 5 points 4 days ago The Venezuelans by me are either begging/selling stuff as unlicensed street vendors, or delivering food on bikes and scooters. Import the third world, become the third world permalink parent award report block reply\nhenri_derelicte 5 points 4 days ago The Venezuelans by me are either begging/selling stuff as unlicensed street vendors, or delivering food on bikes and scooters. Import the third world, become the third world permalink parent award report block reply\nFusionBlack 3 points 4 days ago Damn the reporter is even forgien. permalink award report block reply\nChineseHamPlanet 3 points 4 days ago Get rid of all the fucking Muslim roaches first permalink award report block reply\nShitsbrokeyo 3 points 4 days ago Kill the visa program now. permalink award report block reply\nRhodesianRidgeback 3 points 4 days ago They have fake papers and fake ID's. And they have entire industries that cater to them. They aren't going anywhere. permalink award report block reply\nAwShitHereWeGoAgain 3 points 4 days ago Helicopters might work better........... permalink award report block reply\nhenri_derelicte 3 points 4 days ago I agree with the administration choosing not to renew or extend TPS. However, the part I’m bothered with are the handful of cases where the courts intervened and extended TPS status for some Haitians and Venezuelans into 2026. The courts don’t decide immigration status, the executive branch does permalink award report block reply\nTrumpLandslide20201 3 points 4 days ago Bye bye fuckers go make your shit hole great again we got our own problems. permalink award report block reply\nBraujager 3 points 4 days ago “It's just we're putting new coversheets on all the TPS Deports before they go out now. Did you get that memo?” 😉 permalink award report block reply\nPoleWatcher 3 points 4 days ago I can feel less traffic and less store lines eveeywhere permalink award report block reply\nmagapatriot_pa 2 points 4 days ago Nothing is more permanent than a temporary government program permalink award report block reply\nQueensOwn 2 points 4 days ago Adios, amigos permalink award report block reply\nTheBasedFriscoMan 2 points 4 days ago GET THE FUCK OUT!!! permalink award report block reply\nDefKon1 2 points 4 days ago 260000???? That's fuckin' TREASON! permalink award report block reply\nNanteen 2 points 4 days ago The Hawaiian judge will say temporary meant 2345. permalink award report block reply\nKrat 2 points 4 days ago We need live broadcasts of planes filled up leaving just like we had broadcasts of planes filled showing the tens of millions coming to steal your life and freedom away permalink award report block reply\nGreenblatts_4skin 2 points 4 days ago \"did you get what you voted for?\" \"yes, absolutely\" permalink award report block reply\nAgent_86 2 points 4 days ago GTFO!! permalink award report block reply\njosiborg 2 points 4 days ago Add 2 more zeros to the end of that permalink award report block reply\nFrenOrFoe 1 points 4 days ago Look at them flying all those Venezuelan flags! If you love your country so much, why don’t you want to go back? permalink award report block reply\ngeekesmind 1 points 4 days ago They should never had any of that crap in the first place GTFO permalink award report block reply\nmagaMC117 1 points 4 days ago NO WAY w/ those big titties will she not find a guy to marry permalink award report block reply\nf_bastiat 1 points 4 days ago Noice. I genuinely hope they go make Venezuela great again, or for the first time, idk if they were ever great because I don't care about countries other than my own. permalink award report block reply Tardigrade 1 points 4 days ago They were great, for what it's worth.  Richest country in South America. permalink parent award report block reply\nTardigrade 1 points 4 days ago They were great, for what it's worth.  Richest country in South America. permalink parent award report block reply"
}