{
  "id": "1ARK9l8YyK",
  "url": "https://patriots.win/p/1ARK9l8YyK/anyone-else-remember-last-year-w/c",
  "content": "543 Anyone else remember last year when Auto Pen was imposing tariffs? posted 1 day ago by Whoopies_tds 24 comments award share download report block\n24 comments Sort by Top Top New Worst Old Save Badstate 23 points 1 day ago He also blamed grocery store managers for high food prices. permalink award report block reply RINO_fatigue 12 points 1 day ago He did that in 2024 because he wanted to eliminate it as a campaign issue for Trump, they probably had polls saying tariffs were popular and that being against them would cost them votes permalink award report block reply zooty 7 points 1 day ago Tariffs have typically been a thing of the left anyway, a holdover from when they pretended to represent the American worker rather than flat out hating them. permalink parent award report block reply Cville123 6 points 24 hours ago Tariffs are America’s only hope. permalink award report block reply Run_over_Antifa 4 points 1 day ago Just halt trade with the offending country, no tariffs needed. They will come around real fucking fast. permalink award report block reply zooty 8 points 1 day ago The experiment of trading with China has failed. Badly. Time to move on. If we must have cheap shit, there's plenty of other developing countries. permalink parent award report block reply Run_over_Antifa 7 points 1 day ago I have never understood why we trade with China. They are predatory on so many levels. Why do we give a single penny to a country who wants to destroy us? permalink parent award report block reply zooty 5 points 24 hours ago The argument was that trade would introduce capitalism and raising standards of living would encourage it to take over but it turns out the Chinese bigwigs are a bit smarter than that. The more likely answer is that US businessmen wanted cheap shit to sell the US people. permalink parent award report block reply Whoopies_tds OP 1 points 10 hours ago It goes beyond having cheap shit to sell here. Trading with China opens up a huge market for American businesses to sell consumer products to a billion people permalink parent award report block reply view 2 more comments... BidenShowerDrool 1 points 24 hours ago If we must have cheap shit, there's plenty of other developing countries. who the jeet? they hate us more. This capitalist need to move to shithole nations for profit only serves to undermine America. permalink parent award report block reply zooty 4 points 20 hours ago Gotta be some more Asians. It was Hong Kong and Japan when I was growing up then it moved to Taiwan and finally China (with a bit more in Taiwan). Ultimately, you're right though that moving stuff back onshore is the best solution overall. permalink parent award report block reply Klaus73 2 points 21 hours ago Thats really all you need to do if you don't want to risk your industry being stolen...but we seen what happened last time the US did that with China...folded within a week. The US needs to start making stuff; not just hoping to profit off the work of others. permalink parent award report block reply Nerdrem3 3 points 20 hours ago Saying China pays for tariffs is just a way of simplifying it for the general public, no China doesn't literally pay the tariffs, but the tariffs make them \"pay\" in lost revenue because when people were buying their goods because they were cheaper they're not going to keep buying them when the price goes up. The companies that are only making their goods there to increase profits won't continue when it's causing their profits to decrease so what do they do? Move manufacturing back here to avoid the tariffs thereby creating jobs causing unemployment to drop which causes wages to rise making people better able to afford the more expensive but higher quality American made goods and keeping our money here which benefits everyone. Much easier to just say China pays. permalink award report block reply patrioticwinning3 3 points 1 day ago Apparently the Supreme Court doesn't.... permalink award report block reply Klaus73 1 points 21 hours ago Did Biden apply a flat tariff to every country on earth? Or did he apply tariffs based on market protections? I mean I think calling Bidens tariffs the same thing is a bit disingenuous isn't it? Unfortunately Trumps scheme is for the world to pay for the operation of the US government; which would also turn the US into a dependant. Imagine if he turns off income tax because of tariffs...then everyone decides to shut off export to the US? permalink parent award report block reply rebuildingMyself 3 points 24 hours ago Biden also didn't drop any tariffs Trump put on China in his first term permalink award report block reply Antemalagon 2 points 20 hours ago Target cashiers are retarded and repeating shit they heard on tik tok. Let me guess , Biden also got his foreign policy from the Walmart cashiers. permalink award report block reply Advhawk 1 points 23 hours ago fuck off black pilled permalink award report block reply ShekelJa 1 points 22 hours ago This fucking retard should now comment on TAXES. permalink award report block reply Reddit2016 1 points 21 hours ago GREAT FIND, can we send this to SCOTUS permalink award report block reply MJPalazzolo 1 points 16 hours ago Biden didn't write any of this. permalink award report block reply bluewhiteandred 0 points 22 hours ago agreeing and disagreeing here (comment repost) there's probably three kinds of tariffs: 1 \"strongarm\" tariffs. USA could maybe do this, we have \"superior\" customer base, so you add an extra tariff that gets passed to the foreign company that loses. I'm guessing there's hope Trump tariffs are like this, and the next one... 2 defensive tariffs. Tit-for-tat that keeps playing field level. What Biden was likely doing in the second tweet (?). Other country tariffs USA at 10%, USA tariffs back at 10% to cancel the tariff somewhat. 3 \"weak\" tariffs. This is leeching from a bigger country to a weaker country. This feels like whatever tariffs other countries were putting on us. Why was this tolerated as they don't have the leverage to do so? I guess the profits were still high enough even with paying the tariff penalty that we just went along with it? But it drained monies from us that \"defensive tariffs\" could level out a bit I guess? Outside of this, tariffs are indeed usually thought to just be a tax that inhibits the free flow of business (Biden first tweet). I thought Trump's whole goal with the tariffs was to expose how harmful they are (maybe with mostly defensive tariffs?) to get to a place of low or no tariffs. permalink award report block reply\nBadstate 23 points 1 day ago He also blamed grocery store managers for high food prices. permalink award report block reply\nRINO_fatigue 12 points 1 day ago He did that in 2024 because he wanted to eliminate it as a campaign issue for Trump, they probably had polls saying tariffs were popular and that being against them would cost them votes permalink award report block reply zooty 7 points 1 day ago Tariffs have typically been a thing of the left anyway, a holdover from when they pretended to represent the American worker rather than flat out hating them. permalink parent award report block reply\nzooty 7 points 1 day ago Tariffs have typically been a thing of the left anyway, a holdover from when they pretended to represent the American worker rather than flat out hating them. permalink parent award report block reply\nCville123 6 points 24 hours ago Tariffs are America’s only hope. permalink award report block reply\nRun_over_Antifa 4 points 1 day ago Just halt trade with the offending country, no tariffs needed. They will come around real fucking fast. permalink award report block reply zooty 8 points 1 day ago The experiment of trading with China has failed. Badly. Time to move on. If we must have cheap shit, there's plenty of other developing countries. permalink parent award report block reply Run_over_Antifa 7 points 1 day ago I have never understood why we trade with China. They are predatory on so many levels. Why do we give a single penny to a country who wants to destroy us? permalink parent award report block reply zooty 5 points 24 hours ago The argument was that trade would introduce capitalism and raising standards of living would encourage it to take over but it turns out the Chinese bigwigs are a bit smarter than that. The more likely answer is that US businessmen wanted cheap shit to sell the US people. permalink parent award report block reply Whoopies_tds OP 1 points 10 hours ago It goes beyond having cheap shit to sell here. Trading with China opens up a huge market for American businesses to sell consumer products to a billion people permalink parent award report block reply view 2 more comments... BidenShowerDrool 1 points 24 hours ago If we must have cheap shit, there's plenty of other developing countries. who the jeet? they hate us more. This capitalist need to move to shithole nations for profit only serves to undermine America. permalink parent award report block reply zooty 4 points 20 hours ago Gotta be some more Asians. It was Hong Kong and Japan when I was growing up then it moved to Taiwan and finally China (with a bit more in Taiwan). Ultimately, you're right though that moving stuff back onshore is the best solution overall. permalink parent award report block reply Klaus73 2 points 21 hours ago Thats really all you need to do if you don't want to risk your industry being stolen...but we seen what happened last time the US did that with China...folded within a week. The US needs to start making stuff; not just hoping to profit off the work of others. permalink parent award report block reply\nzooty 8 points 1 day ago The experiment of trading with China has failed. Badly. Time to move on. If we must have cheap shit, there's plenty of other developing countries. permalink parent award report block reply Run_over_Antifa 7 points 1 day ago I have never understood why we trade with China. They are predatory on so many levels. Why do we give a single penny to a country who wants to destroy us? permalink parent award report block reply zooty 5 points 24 hours ago The argument was that trade would introduce capitalism and raising standards of living would encourage it to take over but it turns out the Chinese bigwigs are a bit smarter than that. The more likely answer is that US businessmen wanted cheap shit to sell the US people. permalink parent award report block reply Whoopies_tds OP 1 points 10 hours ago It goes beyond having cheap shit to sell here. Trading with China opens up a huge market for American businesses to sell consumer products to a billion people permalink parent award report block reply view 2 more comments... BidenShowerDrool 1 points 24 hours ago If we must have cheap shit, there's plenty of other developing countries. who the jeet? they hate us more. This capitalist need to move to shithole nations for profit only serves to undermine America. permalink parent award report block reply zooty 4 points 20 hours ago Gotta be some more Asians. It was Hong Kong and Japan when I was growing up then it moved to Taiwan and finally China (with a bit more in Taiwan). Ultimately, you're right though that moving stuff back onshore is the best solution overall. permalink parent award report block reply\nRun_over_Antifa 7 points 1 day ago I have never understood why we trade with China. They are predatory on so many levels. Why do we give a single penny to a country who wants to destroy us? permalink parent award report block reply zooty 5 points 24 hours ago The argument was that trade would introduce capitalism and raising standards of living would encourage it to take over but it turns out the Chinese bigwigs are a bit smarter than that. The more likely answer is that US businessmen wanted cheap shit to sell the US people. permalink parent award report block reply Whoopies_tds OP 1 points 10 hours ago It goes beyond having cheap shit to sell here. Trading with China opens up a huge market for American businesses to sell consumer products to a billion people permalink parent award report block reply view 2 more comments...\nzooty 5 points 24 hours ago The argument was that trade would introduce capitalism and raising standards of living would encourage it to take over but it turns out the Chinese bigwigs are a bit smarter than that. The more likely answer is that US businessmen wanted cheap shit to sell the US people. permalink parent award report block reply Whoopies_tds OP 1 points 10 hours ago It goes beyond having cheap shit to sell here. Trading with China opens up a huge market for American businesses to sell consumer products to a billion people permalink parent award report block reply view 2 more comments...\nWhoopies_tds OP 1 points 10 hours ago It goes beyond having cheap shit to sell here. Trading with China opens up a huge market for American businesses to sell consumer products to a billion people permalink parent award report block reply view 2 more comments...\nBidenShowerDrool 1 points 24 hours ago If we must have cheap shit, there's plenty of other developing countries. who the jeet? they hate us more. This capitalist need to move to shithole nations for profit only serves to undermine America. permalink parent award report block reply zooty 4 points 20 hours ago Gotta be some more Asians. It was Hong Kong and Japan when I was growing up then it moved to Taiwan and finally China (with a bit more in Taiwan). Ultimately, you're right though that moving stuff back onshore is the best solution overall. permalink parent award report block reply\nzooty 4 points 20 hours ago Gotta be some more Asians. It was Hong Kong and Japan when I was growing up then it moved to Taiwan and finally China (with a bit more in Taiwan). Ultimately, you're right though that moving stuff back onshore is the best solution overall. permalink parent award report block reply\nKlaus73 2 points 21 hours ago Thats really all you need to do if you don't want to risk your industry being stolen...but we seen what happened last time the US did that with China...folded within a week. The US needs to start making stuff; not just hoping to profit off the work of others. permalink parent award report block reply\nNerdrem3 3 points 20 hours ago Saying China pays for tariffs is just a way of simplifying it for the general public, no China doesn't literally pay the tariffs, but the tariffs make them \"pay\" in lost revenue because when people were buying their goods because they were cheaper they're not going to keep buying them when the price goes up. The companies that are only making their goods there to increase profits won't continue when it's causing their profits to decrease so what do they do? Move manufacturing back here to avoid the tariffs thereby creating jobs causing unemployment to drop which causes wages to rise making people better able to afford the more expensive but higher quality American made goods and keeping our money here which benefits everyone. Much easier to just say China pays. permalink award report block reply\npatrioticwinning3 3 points 1 day ago Apparently the Supreme Court doesn't.... permalink award report block reply Klaus73 1 points 21 hours ago Did Biden apply a flat tariff to every country on earth? Or did he apply tariffs based on market protections? I mean I think calling Bidens tariffs the same thing is a bit disingenuous isn't it? Unfortunately Trumps scheme is for the world to pay for the operation of the US government; which would also turn the US into a dependant. Imagine if he turns off income tax because of tariffs...then everyone decides to shut off export to the US? permalink parent award report block reply\nKlaus73 1 points 21 hours ago Did Biden apply a flat tariff to every country on earth? Or did he apply tariffs based on market protections? I mean I think calling Bidens tariffs the same thing is a bit disingenuous isn't it? Unfortunately Trumps scheme is for the world to pay for the operation of the US government; which would also turn the US into a dependant. Imagine if he turns off income tax because of tariffs...then everyone decides to shut off export to the US? permalink parent award report block reply\nrebuildingMyself 3 points 24 hours ago Biden also didn't drop any tariffs Trump put on China in his first term permalink award report block reply\nAntemalagon 2 points 20 hours ago Target cashiers are retarded and repeating shit they heard on tik tok. Let me guess , Biden also got his foreign policy from the Walmart cashiers. permalink award report block reply\nAdvhawk 1 points 23 hours ago fuck off black pilled permalink award report block reply\nShekelJa 1 points 22 hours ago This fucking retard should now comment on TAXES. permalink award report block reply\nReddit2016 1 points 21 hours ago GREAT FIND, can we send this to SCOTUS permalink award report block reply\nMJPalazzolo 1 points 16 hours ago Biden didn't write any of this. permalink award report block reply\nbluewhiteandred 0 points 22 hours ago agreeing and disagreeing here (comment repost) there's probably three kinds of tariffs: 1 \"strongarm\" tariffs. USA could maybe do this, we have \"superior\" customer base, so you add an extra tariff that gets passed to the foreign company that loses. I'm guessing there's hope Trump tariffs are like this, and the next one... 2 defensive tariffs. Tit-for-tat that keeps playing field level. What Biden was likely doing in the second tweet (?). Other country tariffs USA at 10%, USA tariffs back at 10% to cancel the tariff somewhat. 3 \"weak\" tariffs. This is leeching from a bigger country to a weaker country. This feels like whatever tariffs other countries were putting on us. Why was this tolerated as they don't have the leverage to do so? I guess the profits were still high enough even with paying the tariff penalty that we just went along with it? But it drained monies from us that \"defensive tariffs\" could level out a bit I guess? Outside of this, tariffs are indeed usually thought to just be a tax that inhibits the free flow of business (Biden first tweet). I thought Trump's whole goal with the tariffs was to expose how harmful they are (maybe with mostly defensive tariffs?) to get to a place of low or no tariffs. permalink award report block reply",
  "fetched_at": "2025-11-12T23:15:33.574303Z"
}