{
  "id": "1ARK52CoBb",
  "url": "https://patriots.win/p/1ARK52CoBb/calling-it-now-one-day-americans/c",
  "content": "945 Calling it now... One day Americans will be fighting Muslims on American soil. Mark. My. Words. posted 6 days ago by Capoditutticapi1 142 comments award share report block Toxic Cowboy @toxiccowboy1 • 6d Calling it now ... One day Americans will be fighting Muslims on American soil. Mark. My. Words.\n142 comments Sort by Top Top New Worst Old Save jcd_007 61 points 6 days ago Why don’t we stop letting them in? permalink award report block reply Nachos_and_cheese 37 points 6 days ago oy vey the liberals and democrats. permalink parent award report block reply Goozmania 8 points 5 days ago and libertarians and republicans. permalink parent award report block reply Taqiyya_Mockingbird 26 points 6 days ago Let’s ask Barbara Lerner Spectre permalink parent award report block reply stormdraintrooper 9 points 5 days ago What a cunt.  Patton was right. permalink parent award report block reply Govtizbad -5 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply fjzappa -1 points 6 days ago take money from Qatar. Like our president? permalink parent award report block reply Govtizbad 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... ReleasetheList 24 points 6 days ago 95% of politicians in both parties are funded by a certain lobby. That same lobby represents a group of people that are major funders of the NGO's that are bringing these invaders to the US and Europe. permalink parent award report block reply jcd_007 15 points 6 days ago Maybe we should ban lobbying. permalink parent award report block reply ReleasetheList 12 points 6 days ago We should but it will never happen. The vast majority of people that seek power, like shitbag politicians, are the people that should be furthest from power. They don't want the corruption to stop. How else would those retards become multi-millionaires? permalink parent award report block reply 1_Badcop 6 points 6 days ago Maybe we should ban juice. permalink parent award report block reply IroWide 4 points 6 days ago It worked before permalink parent award report block reply view 1 more comments... snoopy3210 4 points 6 days ago Right now the CIA is literally inviting with open arms in Washington DC a top Al Qaida leader, after installing him in Syria. Not sure what AIPAC did for your intel agency to invite a murderous radical Islamist and welcome him with open arms after helping open the border. permalink parent award report block reply ReleasetheList 8 points 6 days ago Seriously? The only reason he was installed is because he agreed to open up dialogue with Israel and agreed to certain terms. Do you not know anything about geopolitics? Israel was flying over Syrian airspace when they were bombing Iran. This was an agreement between the new leader of Syria and Israel. Pay attention. permalink parent award report block reply Tacitus1963 2 points 6 days ago And that lobby has an individual handler for every member of Congress to ensure that they all take care of that lobby's country. permalink parent award report block reply DITTOPatriot 1 points 5 days ago The qr code they make them wear is hilarious.  Imagine being scanned as you spit out your practiced MIGA speech while they walk around sampling Knishes and Falafel. How demeaning. permalink parent award report block reply DITTOPatriot 1 points 5 days ago That sounds antisemitic. permalink parent award report block reply Seeker_17 0 points 6 days ago White Christians is the lobby if anyone is wondering. permalink parent award report block reply stormdraintrooper 2 points 5 days ago Never heard of such a lobby.  I've seen AIPAC in action however. permalink parent award report block reply NotYourMan 6 points 6 days ago Well we are waiting for the terrorism like they have in France and Germany where Muslims drive cars, trunks and buses into crowded parks or country fairs.  The sad thing is all we can do is wait.  But by the time this is happening, there will be enough Muslims in the government and MSM to suppress the details of such attacks just like in the EU. permalink parent award report block reply jcd_007 7 points 6 days ago Yeah but at least here we can shoot back at terrorists. permalink parent award report block reply ReleasetheList 2 points 5 days ago I imagine the vast majority of these attacks will be happening in soft on crime blue cities which also have the strictest gun laws for law abiding citizens. Easy targets make the best targets to terrorists. permalink parent award report block reply newdaynewname9 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Nibba2 2 points 5 days ago Too many who have no foresight do not and will not care until it’s too late. permalink parent award report block reply load 1 more comments... Define_Assault 31 points 6 days ago We already are…but only one side is fighting permalink award report block reply josiborg 6 points 6 days ago Not even one side permalink parent award report block reply StCharlie 5 points 6 days ago Paint the british crusade flag and Christ is King on the street in high population Muslim areas.  Swap out a DEI or foreign countries flag for it and install signage.  Sending a message is important.  Muslims have spent years fighting a atypical war versus the U.S.  The strategy to combat Muslims overtaking cities must be fought in an atypical way as well.  Psychological.  Anonymous.  Unexpected.  Exploitable.  The men gather at mosques, their call to prayers should have to compete with Christ is King over an intercom.  Draw your best Muhammad contest.  Your goal is not to fight your enemy but bait them into a fight.  Make sure you pick someone that looks easily angered.  They will be the most exploitable to move to an action that they will regret.  You need to draw out their darkness for everyone to see.  And remember the most important part:  ABR - Always be recording. One last thought.  Make your bait easy for you to do.  Don't make it too complicated.  A simple picture of Muhammad drawn on the wall or a notepad with the name Muhammad at the top to be clear on the intention that you are drawing him.  We don't have laws against drawing a picture.  Draw to your hearts content.  If your identity revolves around your prophet being so sacred that he can't be criticized then that is a huge weakness.  Have some fun with it.  Pork>Muhammad.  The Bacon gods killed Muhammad.  Let's have fun, ok?  Just like in any competition, there are head fakes, unexpected plays, getting in your opponents head and rattling them, if you have to show your plan make it a fake one, watch videos, find out who you are dealing with and why they are here.  Use AI to slander them.  Video of your opponent saying something bad about Muhammad and how much they love Jesus Christ. permalink parent award report block reply Afeazo 5 points 6 days ago Exactly, one side is just going to roll over and allow it to happen. \"Sharia is preferable to avoiding violence on the street, just give them what they want\" permalink parent award report block reply jcd_007 4 points 6 days ago The left openly welcomes that evil. permalink parent award report block reply Chad_Prime 19 points 6 days ago If that happens, God forbid... Because there will not be an off switch. We will not stop until all Muslims and their enablers are 100% cleansed from our land. permalink award report block reply The_Bloofy_Bullshark 17 points 6 days ago If a modern SS-type organization was formed to wipe out Muslims, I would immediately join. 100% serious. Every last one of them. Never saw them as people, especially when overseas. permalink parent award report block reply Saltish 7 points 6 days ago I know this will probably put me on a list, but I actually 100% understand how people supported the Nazis in Germany. All I have to do is replace Jews with Muslims. I'd prefer exporting them back to their countries because I'm not inherently cruel, but if the only options are a.) ovens, or b.) letting them take over our civilization, I'm with a.) all the way, no apologies. So sorry that I want my civilization and culture to survive and don't want all future White women to be subjugated by a barbaric cult. I'm quirky that way. permalink parent award report block reply Probably_tryna_sleep 2 points 6 days ago Meh, we’re probably all already on watchlists anyways. I have no problem with the casual Muslim who likes a BLT and drinks some beers while watching the game. The extreme ones though that want to impose their own wild rule of law on the rest of society? Nah, fuck em. If we’re going to do a crusade here, then say when lol permalink parent award report block reply Seeker_17 2 points 6 days ago Yes, same here. permalink parent award report block reply Formerlurker92 6 points 6 days ago There's gonna be so many vengeance killings on both sides due to the amount of personal grievances that have built up. permalink parent award report block reply Seeker_17 3 points 6 days ago Yes. The sooner the better. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply magnokor 17 points 6 days ago The USA has been at war with moslems for 249.4 years. Most have only noticed it for a few years during that span. The moslems have been at war with everyone since around year 600. A region can only ever have two possible numbers of them, 0% or 100%. It will be good news for many countries when one country ignites, with the locals versus the invading heathens. Of course, the UN and their media and the invaders want to keep that from happening, as they know they would lose and they are guaranteed to win as long as the countries allow them to stay and also have open borders legal mass immigration so they can continue to bring in their invading army. permalink award report block reply gillonba 7 points 6 days ago \"From the halls of Montezuma to the shores of Tripoli!\" Iirc the Marine Corps was basically created to deal with Mohammedan slavers in Africa.  (Still waiting for my reparashuns) edit: The moslems have been at war with everyone since around year 600. You are spot on correct.  It is really disappointing to see so many people here who pretend that this isn't the case permalink parent award report block reply Seeker_17 7 points 6 days ago America was discovered the same year the Spaniards kicked the last muzzie out. Columbus was looking for new routes to India to avoid the Barbary pirates and Ottomans. They never tell you that little detail. permalink parent award report block reply josiborg 3 points 6 days ago Andrew Jackson fought war against Islam. They are used by joos to kill Christianity permalink parent award report block reply Nachos_and_cheese 13 points 6 days ago I have been saying the same thing for years. Every mosk has weapons in the basement, an armory for when they take up arms. I have uncles in the RCMP and there is a big mosk near toronto and they know its full of enough weapons to start an army. But they are not allowed to talk about it let alone raid the place. I was told that like 15 years ago, i cant imagine how bad it is now with all the trudeau human trash he imported. permalink award report block reply Groomerboomer 2 points 6 days ago Mosk permalink parent award report block reply FrankDuncan 2 points 6 days ago Alon? permalink parent award report block reply Nachos_and_cheese 1 points 4 days ago huh? permalink parent award report block reply Groomerboomer 1 points 4 days ago You wrote mosk instead of mosque permalink parent award report block reply Nachos_and_cheese 1 points 3 days ago i also write moslem instead of muslim because they dont deserve respect and it might trigger the goat fuckers. Much like i put ham/bacon in the halal coolers in the supermarket every time i am there, sometimes next to a muzzie lol permalink parent award report block reply Saltish 10 points 6 days ago And half the country will be fighting on BEHALF of the Muslims. Because they need to oppose \"Nazis.\" Mark these words as well. permalink award report block reply Rope_Tree_Journalist 2 points 6 days ago I'm okay killing them too. permalink parent award report block reply Nellie_the_Beaut 1 points 6 days ago Daniel Pearl comes to mind.  His grieving father said that his son’s murderers didn’t even realize that he wanted to be their friend and was “on their side.”. Yeah…they didn’t care. permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Mungo 8 points 6 days ago Already happening. permalink award report block reply RudeFrog 8 points 6 days ago We already are, this is a war whether you want to admit it or not permalink award report block reply South_Florida_Guy 8 points 6 days ago Impossible! We fought them \"over there\" so we don't have to fight them \"over here\"! permalink award report block reply Capoditutticapi1 OP 6 points 6 days ago Gubmint lied, they ALL lied, they're still lying, and will continue to lie into the future... permalink parent award report block reply 1_Badcop 3 points 6 days ago Right? That's what I was told. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply f_bastiat 8 points 6 days ago I hope it comes to that sooner than later before they breed a big enough army. I want every single one of them gone, I don't give a shit about freedom of a religion. I am an atheist but it is very clear what religions stand for what values, and Islam is a cancer on every population it touches. permalink award report block reply Seeker_17 4 points 6 days ago Islam isn't even a religion, it's more like an ideology or all encompassing system that also regulates the lifes of unbelievers. The way around the freedom of religion thing is to treat Islam as something else . permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply 1_Badcop 7 points 6 days ago Um, pretty sure muslims are already killing us here from time to time...or does he just mean at some point we'll be allowed to fight back? permalink award report block reply SpaceWizard 7 points 6 days ago And who can we thank for that? permalink award report block reply Seeker_17 4 points 6 days ago Catholic charities and other woke churches. permalink parent award report block reply SpaceWizard 2 points 5 days ago That's true, they had major contributions to the destruction of our country. They brought in TONS of illegals permalink parent award report block reply Capoditutticapi1 OP 4 points 6 days ago The real question isn’t \"who gets blamed,\" but why anyone thinks importing or incubating irreconcilable conflicts is sustainable. Blame follows power and narrative control, but the root cause would be decades of policy failures,  unchecked migration without assimilation, foreign policy blowback, and domestic polarization weaponized by elites. No group \"deserves\" this future. The way to avoid it isn’t more blame, it’s ruthless pragmatism about borders, culture, and security. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Thomm 7 points 6 days ago That day is today my friend. permalink award report block reply Hallelujah_Jesus 6 points 6 days ago I hope it doesn't come to that. permalink award report block reply 1_Badcop 5 points 6 days ago Too late. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply GeorgeBailey 6 points 6 days ago Kill the goats first so that they can’t try to reproduce. permalink award report block reply Khryn_Tzu 6 points 6 days ago Exodus 22:2 -  \"If a thief is caught breaking in at night and is struck a fatal blow, the defender is not guilty of bloodshed.\" DEUS. VULT. permalink award report block reply Smurfection 5 points 6 days ago It's about five to ten years away.  They're developing no-go areas and autonomous zones right now.It's not immigrants congregating together.  It's footholds. permalink award report block reply gillonba 5 points 6 days ago We can only hope Americans will fight back before we are overrun completely permalink award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply LordKuroTheGreat 5 points 6 days ago It'd be over in 20 minutes if we didn't have government faggots protecting them. permalink award report block reply ilikehats 5 points 6 days ago If only there were 2 to 3 million servicemen and women with the experience necessary to take on such a horde. 20+ years of war should be enough to pull from.\nThis is not counting the good ‘ol boys with itchy fingers who didn’t get a chance.\nI say Fucking Bring It permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Covfefe_Commando 5 points 6 days ago It starts with open-toed sandals and man-pajamas in the daylight hours...        it ends when we decide to end it... permalink award report block reply cardinaldrones 4 points 6 days ago We aren’t as fucked as Europe and never will be.  The deep state overlooked the fact that the 3rd worlders that they flooded us with are majority Roman Catholic.   Also many of the Muslims in America when they have kids the kids inevitably get more exposed to western values.  With each generation.  Western values destroy religion even Islam.  If you just cut them off from\nEntering the organic growth will be pretty tame religiously after a couple generations.  And Christianity will still be around. permalink award report block reply gaijin_ronin 4 points 6 days ago Yes and in a relatively short time too.  In addition white liberals (especially women) will also come to their aid (or rather be useful idiots to the slaughter).  It's going to start with some Weather Underground type shit and escalate. permalink award report block reply 2025WhatIsTrue 4 points 6 days ago Stay/get physically fit.  Go to the range regularly.  Be aware of your surroundings.  Defend FREE America from the various scum. permalink award report block reply knnbccb 3 points 6 days ago Better start fighting sooner rather than later, because their kind breeds like rabbits and they do zerg rush attacks in the name of Allah. The longer you delay, the greater your dismay. permalink award report block reply newchina 3 points 6 days ago What about the chinamen? permalink award report block reply HairSniffer 4 points 6 days ago We have enough Chinamen.  No more CCP agents.  Students go home.  Visas canceled. permalink parent award report block reply Anyone 3 points 6 days ago Absolutely 💯 % permalink award report block reply PiratePatriot 3 points 6 days ago already happening - look at the small crime reports. Don't need to wait for large scale army war. permalink award report block reply RedCapNation 3 points 6 days ago 100% It makes me sick permalink award report block reply Papabravo12 2 points 6 days ago I would agree if I didn’t think robots are going to kill us long before then anyway permalink award report block reply BeerPatroit 2 points 6 days ago We should do it now before they get to 10% like the UK. Need to do it before they try to take over. permalink award report block reply terribletwos 2 points 6 days ago Doubt it. Ask the UK how that's going. What we'll do is say \"two more weeks\" until the last man standing gets stabbed. permalink award report block reply infinitysupreme 2 points 6 days ago Already are. permalink award report block reply barwhack 2 points 6 days ago One day. Very soon, I think. permalink award report block reply peoplewatching101 2 points 6 days ago So I started blasting meme .. Canada and the US better get our shit together. There is no more time to correct course permalink award report block reply Seeker_17 2 points 6 days ago Yes, and it can't happen soon enough. Time to get rid of the cancer permalink award report block reply Diversity_Fire 2 points 6 days ago It will likely immediately follow us bailing Europe out permalink award report block reply Shih_Tabed 2 points 6 days ago No they won't.  Everyone will sit back thinking things will be under control.  Eventually there will be concentrated mobs of 100s or 1000s of muslims walking right into homes and dragging people into the street for execution.  The only way they get pushed back is if they are killed.  Incendiaries are generally the best option for dealing with crowds and they are easy to craft.  There needs to be a massive movement that doesn't care about being called racists, nazis, all the fun words and gets the job done.  The movement needs to not care about the purge of all things left being called \"censorship\".  Everyone worried about their kids hating them.  They already do.  Its time to take back society for ourselves so we can get something out of it before we die. permalink award report block reply Megaboom2025 2 points 6 days ago One day? You mean 9/11/2001? permalink award report block reply Aggrieved03 2 points 6 days ago If we’d fought the politicians when it mattered they wouldn’t be here. permalink award report block reply PatriotSkorzeny 2 points 6 days ago You gotta go thru their frontline troops, the cops. permalink award report block reply Capoditutticapi1 OP 6 points 6 days ago The cops will be replaced by the muslims..., then comes Sharia! Starting in NYC, Minnesota, Texas, Michigan, etc... Need to nip this shit in the bud now... permalink parent award report block reply Unboosted 2 points 5 days ago We already are. It was about 10 years ago that the NYC media said it would stop reporting on muslim attacks in NYC. There was an epidemic of muslim renting uhaul trucks and running over anyone they could. The last one I can remember being reported on was a uhaul barrelling down a bike path and like 9 ppl died. Its only gotten worse since then, but muslims are a protected class so go fuck yourself you filthy American I guess. Best we can answer back with is tax strike 2026 permalink award report block reply salt-collector 2 points 6 days ago He aint wrong...sadly. I hope Im not to old and frail by then permalink award report block reply FrankDuncan 2 points 6 days ago Some will fight with them against us permalink award report block reply birddogz 2 points 6 days ago We already are.  Wake up permalink award report block reply stormdraintrooper 2 points 6 days ago Who opened the gate? permalink award report block reply Moebius 2 points 6 days ago They're here... permalink award report block reply Kilroy 1 points 6 days ago It sure seems like we're heading that way thatnks to Speaker Johnson and a pathetic Congress permalink award report block reply borisborscht 1 points 6 days ago Why aren't you doing it now? permalink award report block reply LatitudeofMind 1 points 5 days ago We are already permalink award report block reply Mhmm2MoreWeeks 1 points 6 days ago Tell me about the Jewish Master Race Daddy. /s permalink award report block reply Beardholder 1 points 5 days ago We got 10 times the numbers. We got hunters and veterans and so on. That's not going to be a problem. IT will be in 10 years though permalink award report block reply FullyDilated 1 points 6 days ago kill em all permalink award report block reply stormdraintrooper 1 points 5 days ago As I see it now,  It's going to require a fulminant uprising. permalink award report block reply DEPORT50M 1 points 5 days ago Already are permalink award report block reply Reassess_Reevaluate 1 points 5 days ago All you have to do is read your Bible. In the Armies present at the Battle of Armageddon, the United States, and the armies of the west are nowhere to be seen. Imagine that.  There will be a war to literally end all wars, just prior to Jesus returning to earth, and the most powerful military on earth isn't in the fight? Something very bad happens to us by then.  Be prepared and watchful. permalink award report block reply throwaway29834751 1 points 5 days ago repeal the 1965 immigration act, and limit / reduce immigration from all other countries, western hemisphere included permalink award report block reply Patriot4TN 1 points 6 days ago Can we go ahead and get it started? permalink award report block reply HockeyMom4Trump 1 points 6 days ago Remember history? Yep. There will be a war down the road. permalink award report block reply benjovikenobi 1 points 6 days ago Remember when they tried to build a mosque at Ground Zero within a year after 9/11 happened? That was the first clue. Or maybe the 1993 WTC bombing should have been the clue, but I was too young to understand anything when it happened. permalink award report block reply CaptainWinston 1 points 5 days ago We already are permalink award report block reply h3xAd3c1m4L 1 points 5 days ago One day? Shit, we should be doing it every day! permalink award report block reply Nellie_the_Beaut 1 points 5 days ago Yep. I dreamt about that very thing the night of 9/10/2001. Swarms of Arab men capturing and killing Americans on the grounds of Central Park. It was at night, I watched in horror from the woods lining the park with a small group of people running stealthily to escape. I was frozen in terror watching the carnage until a stranger grabbed me and pulled me along. “C’mon, we have to go! You can’t help them now! Save yourself before they see you!”  I looked up and the buildings all around the park were on fire, including two very tall skyscrapers.  We were able to escape and jumped into a car and drove off and I turned around and watched the chaos behind us. There was so much fire the sky looked like daytime. It was the worst nightmare I have ever had and I woke up yelling and in a sweat around 4am PT on 9/11/2001, and my husband asked me what was wrong.  I told him “I just had the most awful nightmare… people were being massacred by Arab men in those white robes, it was so terrible… where did that come from??” He patted me and said it was only a dream and to go back to sleep. I have never been to Central Park or New York.  Be ready, and aware, folks. permalink award report block reply reasonablydisturbed 1 points 5 days ago Always have a tub of bacon grease for just this occasion. permalink award report block reply Mindcrym 1 points 5 days ago I'm going to use a flamethrower for a more effective approach. permalink award report block reply IanCrosslandEatBaby 1 points 6 days ago Listen to the guy with the picture of the faggot cowboy from TV. permalink award report block reply ILoveSilk 1 points 6 days ago LOL. We can't even win over Democrats and you think we will win over Muslims ... They will become the majority. 4 wives, 12 children ... They use womb to conquer you. And how many conservatives marry left spouses? permalink award report block reply Covefefe 0 points 6 days ago Didn’t that start officially in 1993????? permalink award report block reply Th0mas_Paine 0 points 6 days ago Americans fight back? Bless your heart. permalink award report block reply Shmioighan 0 points 6 days ago \"Americans\" kek. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply BillyBobJimmyJoe 1 points 5 days ago Comment removed by community filter, pending further review. permalink award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply ManWhoMakesTheMusic 0 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\njcd_007 61 points 6 days ago Why don’t we stop letting them in? permalink award report block reply Nachos_and_cheese 37 points 6 days ago oy vey the liberals and democrats. permalink parent award report block reply Goozmania 8 points 5 days ago and libertarians and republicans. permalink parent award report block reply Taqiyya_Mockingbird 26 points 6 days ago Let’s ask Barbara Lerner Spectre permalink parent award report block reply stormdraintrooper 9 points 5 days ago What a cunt.  Patton was right. permalink parent award report block reply Govtizbad -5 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply fjzappa -1 points 6 days ago take money from Qatar. Like our president? permalink parent award report block reply Govtizbad 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... ReleasetheList 24 points 6 days ago 95% of politicians in both parties are funded by a certain lobby. That same lobby represents a group of people that are major funders of the NGO's that are bringing these invaders to the US and Europe. permalink parent award report block reply jcd_007 15 points 6 days ago Maybe we should ban lobbying. permalink parent award report block reply ReleasetheList 12 points 6 days ago We should but it will never happen. The vast majority of people that seek power, like shitbag politicians, are the people that should be furthest from power. They don't want the corruption to stop. How else would those retards become multi-millionaires? permalink parent award report block reply 1_Badcop 6 points 6 days ago Maybe we should ban juice. permalink parent award report block reply IroWide 4 points 6 days ago It worked before permalink parent award report block reply view 1 more comments... snoopy3210 4 points 6 days ago Right now the CIA is literally inviting with open arms in Washington DC a top Al Qaida leader, after installing him in Syria. Not sure what AIPAC did for your intel agency to invite a murderous radical Islamist and welcome him with open arms after helping open the border. permalink parent award report block reply ReleasetheList 8 points 6 days ago Seriously? The only reason he was installed is because he agreed to open up dialogue with Israel and agreed to certain terms. Do you not know anything about geopolitics? Israel was flying over Syrian airspace when they were bombing Iran. This was an agreement between the new leader of Syria and Israel. Pay attention. permalink parent award report block reply Tacitus1963 2 points 6 days ago And that lobby has an individual handler for every member of Congress to ensure that they all take care of that lobby's country. permalink parent award report block reply DITTOPatriot 1 points 5 days ago The qr code they make them wear is hilarious.  Imagine being scanned as you spit out your practiced MIGA speech while they walk around sampling Knishes and Falafel. How demeaning. permalink parent award report block reply DITTOPatriot 1 points 5 days ago That sounds antisemitic. permalink parent award report block reply Seeker_17 0 points 6 days ago White Christians is the lobby if anyone is wondering. permalink parent award report block reply stormdraintrooper 2 points 5 days ago Never heard of such a lobby.  I've seen AIPAC in action however. permalink parent award report block reply NotYourMan 6 points 6 days ago Well we are waiting for the terrorism like they have in France and Germany where Muslims drive cars, trunks and buses into crowded parks or country fairs.  The sad thing is all we can do is wait.  But by the time this is happening, there will be enough Muslims in the government and MSM to suppress the details of such attacks just like in the EU. permalink parent award report block reply jcd_007 7 points 6 days ago Yeah but at least here we can shoot back at terrorists. permalink parent award report block reply ReleasetheList 2 points 5 days ago I imagine the vast majority of these attacks will be happening in soft on crime blue cities which also have the strictest gun laws for law abiding citizens. Easy targets make the best targets to terrorists. permalink parent award report block reply newdaynewname9 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Nibba2 2 points 5 days ago Too many who have no foresight do not and will not care until it’s too late. permalink parent award report block reply load 1 more comments...\nNachos_and_cheese 37 points 6 days ago oy vey the liberals and democrats. permalink parent award report block reply Goozmania 8 points 5 days ago and libertarians and republicans. permalink parent award report block reply\nGoozmania 8 points 5 days ago and libertarians and republicans. permalink parent award report block reply\nTaqiyya_Mockingbird 26 points 6 days ago Let’s ask Barbara Lerner Spectre permalink parent award report block reply stormdraintrooper 9 points 5 days ago What a cunt.  Patton was right. permalink parent award report block reply Govtizbad -5 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply fjzappa -1 points 6 days ago take money from Qatar. Like our president? permalink parent award report block reply Govtizbad 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nstormdraintrooper 9 points 5 days ago What a cunt.  Patton was right. permalink parent award report block reply\nGovtizbad -5 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply fjzappa -1 points 6 days ago take money from Qatar. Like our president? permalink parent award report block reply Govtizbad 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nfjzappa -1 points 6 days ago take money from Qatar. Like our president? permalink parent award report block reply Govtizbad 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nGovtizbad 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nReleasetheList 24 points 6 days ago 95% of politicians in both parties are funded by a certain lobby. That same lobby represents a group of people that are major funders of the NGO's that are bringing these invaders to the US and Europe. permalink parent award report block reply jcd_007 15 points 6 days ago Maybe we should ban lobbying. permalink parent award report block reply ReleasetheList 12 points 6 days ago We should but it will never happen. The vast majority of people that seek power, like shitbag politicians, are the people that should be furthest from power. They don't want the corruption to stop. How else would those retards become multi-millionaires? permalink parent award report block reply 1_Badcop 6 points 6 days ago Maybe we should ban juice. permalink parent award report block reply IroWide 4 points 6 days ago It worked before permalink parent award report block reply view 1 more comments... snoopy3210 4 points 6 days ago Right now the CIA is literally inviting with open arms in Washington DC a top Al Qaida leader, after installing him in Syria. Not sure what AIPAC did for your intel agency to invite a murderous radical Islamist and welcome him with open arms after helping open the border. permalink parent award report block reply ReleasetheList 8 points 6 days ago Seriously? The only reason he was installed is because he agreed to open up dialogue with Israel and agreed to certain terms. Do you not know anything about geopolitics? Israel was flying over Syrian airspace when they were bombing Iran. This was an agreement between the new leader of Syria and Israel. Pay attention. permalink parent award report block reply Tacitus1963 2 points 6 days ago And that lobby has an individual handler for every member of Congress to ensure that they all take care of that lobby's country. permalink parent award report block reply DITTOPatriot 1 points 5 days ago The qr code they make them wear is hilarious.  Imagine being scanned as you spit out your practiced MIGA speech while they walk around sampling Knishes and Falafel. How demeaning. permalink parent award report block reply DITTOPatriot 1 points 5 days ago That sounds antisemitic. permalink parent award report block reply Seeker_17 0 points 6 days ago White Christians is the lobby if anyone is wondering. permalink parent award report block reply stormdraintrooper 2 points 5 days ago Never heard of such a lobby.  I've seen AIPAC in action however. permalink parent award report block reply\njcd_007 15 points 6 days ago Maybe we should ban lobbying. permalink parent award report block reply ReleasetheList 12 points 6 days ago We should but it will never happen. The vast majority of people that seek power, like shitbag politicians, are the people that should be furthest from power. They don't want the corruption to stop. How else would those retards become multi-millionaires? permalink parent award report block reply 1_Badcop 6 points 6 days ago Maybe we should ban juice. permalink parent award report block reply IroWide 4 points 6 days ago It worked before permalink parent award report block reply view 1 more comments...\nReleasetheList 12 points 6 days ago We should but it will never happen. The vast majority of people that seek power, like shitbag politicians, are the people that should be furthest from power. They don't want the corruption to stop. How else would those retards become multi-millionaires? permalink parent award report block reply\n1_Badcop 6 points 6 days ago Maybe we should ban juice. permalink parent award report block reply IroWide 4 points 6 days ago It worked before permalink parent award report block reply view 1 more comments...\nIroWide 4 points 6 days ago It worked before permalink parent award report block reply view 1 more comments...\nsnoopy3210 4 points 6 days ago Right now the CIA is literally inviting with open arms in Washington DC a top Al Qaida leader, after installing him in Syria. Not sure what AIPAC did for your intel agency to invite a murderous radical Islamist and welcome him with open arms after helping open the border. permalink parent award report block reply ReleasetheList 8 points 6 days ago Seriously? The only reason he was installed is because he agreed to open up dialogue with Israel and agreed to certain terms. Do you not know anything about geopolitics? Israel was flying over Syrian airspace when they were bombing Iran. This was an agreement between the new leader of Syria and Israel. Pay attention. permalink parent award report block reply\nReleasetheList 8 points 6 days ago Seriously? The only reason he was installed is because he agreed to open up dialogue with Israel and agreed to certain terms. Do you not know anything about geopolitics? Israel was flying over Syrian airspace when they were bombing Iran. This was an agreement between the new leader of Syria and Israel. Pay attention. permalink parent award report block reply\nTacitus1963 2 points 6 days ago And that lobby has an individual handler for every member of Congress to ensure that they all take care of that lobby's country. permalink parent award report block reply DITTOPatriot 1 points 5 days ago The qr code they make them wear is hilarious.  Imagine being scanned as you spit out your practiced MIGA speech while they walk around sampling Knishes and Falafel. How demeaning. permalink parent award report block reply\nDITTOPatriot 1 points 5 days ago The qr code they make them wear is hilarious.  Imagine being scanned as you spit out your practiced MIGA speech while they walk around sampling Knishes and Falafel. How demeaning. permalink parent award report block reply\nDITTOPatriot 1 points 5 days ago That sounds antisemitic. permalink parent award report block reply\nSeeker_17 0 points 6 days ago White Christians is the lobby if anyone is wondering. permalink parent award report block reply stormdraintrooper 2 points 5 days ago Never heard of such a lobby.  I've seen AIPAC in action however. permalink parent award report block reply\nstormdraintrooper 2 points 5 days ago Never heard of such a lobby.  I've seen AIPAC in action however. permalink parent award report block reply\nNotYourMan 6 points 6 days ago Well we are waiting for the terrorism like they have in France and Germany where Muslims drive cars, trunks and buses into crowded parks or country fairs.  The sad thing is all we can do is wait.  But by the time this is happening, there will be enough Muslims in the government and MSM to suppress the details of such attacks just like in the EU. permalink parent award report block reply jcd_007 7 points 6 days ago Yeah but at least here we can shoot back at terrorists. permalink parent award report block reply ReleasetheList 2 points 5 days ago I imagine the vast majority of these attacks will be happening in soft on crime blue cities which also have the strictest gun laws for law abiding citizens. Easy targets make the best targets to terrorists. permalink parent award report block reply newdaynewname9 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\njcd_007 7 points 6 days ago Yeah but at least here we can shoot back at terrorists. permalink parent award report block reply ReleasetheList 2 points 5 days ago I imagine the vast majority of these attacks will be happening in soft on crime blue cities which also have the strictest gun laws for law abiding citizens. Easy targets make the best targets to terrorists. permalink parent award report block reply newdaynewname9 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nReleasetheList 2 points 5 days ago I imagine the vast majority of these attacks will be happening in soft on crime blue cities which also have the strictest gun laws for law abiding citizens. Easy targets make the best targets to terrorists. permalink parent award report block reply\nnewdaynewname9 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNibba2 2 points 5 days ago Too many who have no foresight do not and will not care until it’s too late. permalink parent award report block reply\nDefine_Assault 31 points 6 days ago We already are…but only one side is fighting permalink award report block reply josiborg 6 points 6 days ago Not even one side permalink parent award report block reply StCharlie 5 points 6 days ago Paint the british crusade flag and Christ is King on the street in high population Muslim areas.  Swap out a DEI or foreign countries flag for it and install signage.  Sending a message is important.  Muslims have spent years fighting a atypical war versus the U.S.  The strategy to combat Muslims overtaking cities must be fought in an atypical way as well.  Psychological.  Anonymous.  Unexpected.  Exploitable.  The men gather at mosques, their call to prayers should have to compete with Christ is King over an intercom.  Draw your best Muhammad contest.  Your goal is not to fight your enemy but bait them into a fight.  Make sure you pick someone that looks easily angered.  They will be the most exploitable to move to an action that they will regret.  You need to draw out their darkness for everyone to see.  And remember the most important part:  ABR - Always be recording. One last thought.  Make your bait easy for you to do.  Don't make it too complicated.  A simple picture of Muhammad drawn on the wall or a notepad with the name Muhammad at the top to be clear on the intention that you are drawing him.  We don't have laws against drawing a picture.  Draw to your hearts content.  If your identity revolves around your prophet being so sacred that he can't be criticized then that is a huge weakness.  Have some fun with it.  Pork>Muhammad.  The Bacon gods killed Muhammad.  Let's have fun, ok?  Just like in any competition, there are head fakes, unexpected plays, getting in your opponents head and rattling them, if you have to show your plan make it a fake one, watch videos, find out who you are dealing with and why they are here.  Use AI to slander them.  Video of your opponent saying something bad about Muhammad and how much they love Jesus Christ. permalink parent award report block reply Afeazo 5 points 6 days ago Exactly, one side is just going to roll over and allow it to happen. \"Sharia is preferable to avoiding violence on the street, just give them what they want\" permalink parent award report block reply jcd_007 4 points 6 days ago The left openly welcomes that evil. permalink parent award report block reply\njosiborg 6 points 6 days ago Not even one side permalink parent award report block reply\nStCharlie 5 points 6 days ago Paint the british crusade flag and Christ is King on the street in high population Muslim areas.  Swap out a DEI or foreign countries flag for it and install signage.  Sending a message is important.  Muslims have spent years fighting a atypical war versus the U.S.  The strategy to combat Muslims overtaking cities must be fought in an atypical way as well.  Psychological.  Anonymous.  Unexpected.  Exploitable.  The men gather at mosques, their call to prayers should have to compete with Christ is King over an intercom.  Draw your best Muhammad contest.  Your goal is not to fight your enemy but bait them into a fight.  Make sure you pick someone that looks easily angered.  They will be the most exploitable to move to an action that they will regret.  You need to draw out their darkness for everyone to see.  And remember the most important part:  ABR - Always be recording. One last thought.  Make your bait easy for you to do.  Don't make it too complicated.  A simple picture of Muhammad drawn on the wall or a notepad with the name Muhammad at the top to be clear on the intention that you are drawing him.  We don't have laws against drawing a picture.  Draw to your hearts content.  If your identity revolves around your prophet being so sacred that he can't be criticized then that is a huge weakness.  Have some fun with it.  Pork>Muhammad.  The Bacon gods killed Muhammad.  Let's have fun, ok?  Just like in any competition, there are head fakes, unexpected plays, getting in your opponents head and rattling them, if you have to show your plan make it a fake one, watch videos, find out who you are dealing with and why they are here.  Use AI to slander them.  Video of your opponent saying something bad about Muhammad and how much they love Jesus Christ. permalink parent award report block reply\nAfeazo 5 points 6 days ago Exactly, one side is just going to roll over and allow it to happen. \"Sharia is preferable to avoiding violence on the street, just give them what they want\" permalink parent award report block reply jcd_007 4 points 6 days ago The left openly welcomes that evil. permalink parent award report block reply\njcd_007 4 points 6 days ago The left openly welcomes that evil. permalink parent award report block reply\nChad_Prime 19 points 6 days ago If that happens, God forbid... Because there will not be an off switch. We will not stop until all Muslims and their enablers are 100% cleansed from our land. permalink award report block reply The_Bloofy_Bullshark 17 points 6 days ago If a modern SS-type organization was formed to wipe out Muslims, I would immediately join. 100% serious. Every last one of them. Never saw them as people, especially when overseas. permalink parent award report block reply Saltish 7 points 6 days ago I know this will probably put me on a list, but I actually 100% understand how people supported the Nazis in Germany. All I have to do is replace Jews with Muslims. I'd prefer exporting them back to their countries because I'm not inherently cruel, but if the only options are a.) ovens, or b.) letting them take over our civilization, I'm with a.) all the way, no apologies. So sorry that I want my civilization and culture to survive and don't want all future White women to be subjugated by a barbaric cult. I'm quirky that way. permalink parent award report block reply Probably_tryna_sleep 2 points 6 days ago Meh, we’re probably all already on watchlists anyways. I have no problem with the casual Muslim who likes a BLT and drinks some beers while watching the game. The extreme ones though that want to impose their own wild rule of law on the rest of society? Nah, fuck em. If we’re going to do a crusade here, then say when lol permalink parent award report block reply Seeker_17 2 points 6 days ago Yes, same here. permalink parent award report block reply Formerlurker92 6 points 6 days ago There's gonna be so many vengeance killings on both sides due to the amount of personal grievances that have built up. permalink parent award report block reply Seeker_17 3 points 6 days ago Yes. The sooner the better. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nThe_Bloofy_Bullshark 17 points 6 days ago If a modern SS-type organization was formed to wipe out Muslims, I would immediately join. 100% serious. Every last one of them. Never saw them as people, especially when overseas. permalink parent award report block reply Saltish 7 points 6 days ago I know this will probably put me on a list, but I actually 100% understand how people supported the Nazis in Germany. All I have to do is replace Jews with Muslims. I'd prefer exporting them back to their countries because I'm not inherently cruel, but if the only options are a.) ovens, or b.) letting them take over our civilization, I'm with a.) all the way, no apologies. So sorry that I want my civilization and culture to survive and don't want all future White women to be subjugated by a barbaric cult. I'm quirky that way. permalink parent award report block reply Probably_tryna_sleep 2 points 6 days ago Meh, we’re probably all already on watchlists anyways. I have no problem with the casual Muslim who likes a BLT and drinks some beers while watching the game. The extreme ones though that want to impose their own wild rule of law on the rest of society? Nah, fuck em. If we’re going to do a crusade here, then say when lol permalink parent award report block reply Seeker_17 2 points 6 days ago Yes, same here. permalink parent award report block reply\nSaltish 7 points 6 days ago I know this will probably put me on a list, but I actually 100% understand how people supported the Nazis in Germany. All I have to do is replace Jews with Muslims. I'd prefer exporting them back to their countries because I'm not inherently cruel, but if the only options are a.) ovens, or b.) letting them take over our civilization, I'm with a.) all the way, no apologies. So sorry that I want my civilization and culture to survive and don't want all future White women to be subjugated by a barbaric cult. I'm quirky that way. permalink parent award report block reply Probably_tryna_sleep 2 points 6 days ago Meh, we’re probably all already on watchlists anyways. I have no problem with the casual Muslim who likes a BLT and drinks some beers while watching the game. The extreme ones though that want to impose their own wild rule of law on the rest of society? Nah, fuck em. If we’re going to do a crusade here, then say when lol permalink parent award report block reply\nProbably_tryna_sleep 2 points 6 days ago Meh, we’re probably all already on watchlists anyways. I have no problem with the casual Muslim who likes a BLT and drinks some beers while watching the game. The extreme ones though that want to impose their own wild rule of law on the rest of society? Nah, fuck em. If we’re going to do a crusade here, then say when lol permalink parent award report block reply\nSeeker_17 2 points 6 days ago Yes, same here. permalink parent award report block reply\nFormerlurker92 6 points 6 days ago There's gonna be so many vengeance killings on both sides due to the amount of personal grievances that have built up. permalink parent award report block reply\nSeeker_17 3 points 6 days ago Yes. The sooner the better. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nmagnokor 17 points 6 days ago The USA has been at war with moslems for 249.4 years. Most have only noticed it for a few years during that span. The moslems have been at war with everyone since around year 600. A region can only ever have two possible numbers of them, 0% or 100%. It will be good news for many countries when one country ignites, with the locals versus the invading heathens. Of course, the UN and their media and the invaders want to keep that from happening, as they know they would lose and they are guaranteed to win as long as the countries allow them to stay and also have open borders legal mass immigration so they can continue to bring in their invading army. permalink award report block reply gillonba 7 points 6 days ago \"From the halls of Montezuma to the shores of Tripoli!\" Iirc the Marine Corps was basically created to deal with Mohammedan slavers in Africa.  (Still waiting for my reparashuns) edit: The moslems have been at war with everyone since around year 600. You are spot on correct.  It is really disappointing to see so many people here who pretend that this isn't the case permalink parent award report block reply Seeker_17 7 points 6 days ago America was discovered the same year the Spaniards kicked the last muzzie out. Columbus was looking for new routes to India to avoid the Barbary pirates and Ottomans. They never tell you that little detail. permalink parent award report block reply josiborg 3 points 6 days ago Andrew Jackson fought war against Islam. They are used by joos to kill Christianity permalink parent award report block reply\ngillonba 7 points 6 days ago \"From the halls of Montezuma to the shores of Tripoli!\" Iirc the Marine Corps was basically created to deal with Mohammedan slavers in Africa.  (Still waiting for my reparashuns) edit: The moslems have been at war with everyone since around year 600. You are spot on correct.  It is really disappointing to see so many people here who pretend that this isn't the case permalink parent award report block reply Seeker_17 7 points 6 days ago America was discovered the same year the Spaniards kicked the last muzzie out. Columbus was looking for new routes to India to avoid the Barbary pirates and Ottomans. They never tell you that little detail. permalink parent award report block reply\nSeeker_17 7 points 6 days ago America was discovered the same year the Spaniards kicked the last muzzie out. Columbus was looking for new routes to India to avoid the Barbary pirates and Ottomans. They never tell you that little detail. permalink parent award report block reply\njosiborg 3 points 6 days ago Andrew Jackson fought war against Islam. They are used by joos to kill Christianity permalink parent award report block reply\nNachos_and_cheese 13 points 6 days ago I have been saying the same thing for years. Every mosk has weapons in the basement, an armory for when they take up arms. I have uncles in the RCMP and there is a big mosk near toronto and they know its full of enough weapons to start an army. But they are not allowed to talk about it let alone raid the place. I was told that like 15 years ago, i cant imagine how bad it is now with all the trudeau human trash he imported. permalink award report block reply Groomerboomer 2 points 6 days ago Mosk permalink parent award report block reply FrankDuncan 2 points 6 days ago Alon? permalink parent award report block reply Nachos_and_cheese 1 points 4 days ago huh? permalink parent award report block reply Groomerboomer 1 points 4 days ago You wrote mosk instead of mosque permalink parent award report block reply Nachos_and_cheese 1 points 3 days ago i also write moslem instead of muslim because they dont deserve respect and it might trigger the goat fuckers. Much like i put ham/bacon in the halal coolers in the supermarket every time i am there, sometimes next to a muzzie lol permalink parent award report block reply\nGroomerboomer 2 points 6 days ago Mosk permalink parent award report block reply FrankDuncan 2 points 6 days ago Alon? permalink parent award report block reply Nachos_and_cheese 1 points 4 days ago huh? permalink parent award report block reply Groomerboomer 1 points 4 days ago You wrote mosk instead of mosque permalink parent award report block reply Nachos_and_cheese 1 points 3 days ago i also write moslem instead of muslim because they dont deserve respect and it might trigger the goat fuckers. Much like i put ham/bacon in the halal coolers in the supermarket every time i am there, sometimes next to a muzzie lol permalink parent award report block reply\nFrankDuncan 2 points 6 days ago Alon? permalink parent award report block reply\nNachos_and_cheese 1 points 4 days ago huh? permalink parent award report block reply Groomerboomer 1 points 4 days ago You wrote mosk instead of mosque permalink parent award report block reply Nachos_and_cheese 1 points 3 days ago i also write moslem instead of muslim because they dont deserve respect and it might trigger the goat fuckers. Much like i put ham/bacon in the halal coolers in the supermarket every time i am there, sometimes next to a muzzie lol permalink parent award report block reply\nGroomerboomer 1 points 4 days ago You wrote mosk instead of mosque permalink parent award report block reply Nachos_and_cheese 1 points 3 days ago i also write moslem instead of muslim because they dont deserve respect and it might trigger the goat fuckers. Much like i put ham/bacon in the halal coolers in the supermarket every time i am there, sometimes next to a muzzie lol permalink parent award report block reply\nNachos_and_cheese 1 points 3 days ago i also write moslem instead of muslim because they dont deserve respect and it might trigger the goat fuckers. Much like i put ham/bacon in the halal coolers in the supermarket every time i am there, sometimes next to a muzzie lol permalink parent award report block reply\nSaltish 10 points 6 days ago And half the country will be fighting on BEHALF of the Muslims. Because they need to oppose \"Nazis.\" Mark these words as well. permalink award report block reply Rope_Tree_Journalist 2 points 6 days ago I'm okay killing them too. permalink parent award report block reply Nellie_the_Beaut 1 points 6 days ago Daniel Pearl comes to mind.  His grieving father said that his son’s murderers didn’t even realize that he wanted to be their friend and was “on their side.”. Yeah…they didn’t care. permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nRope_Tree_Journalist 2 points 6 days ago I'm okay killing them too. permalink parent award report block reply\nNellie_the_Beaut 1 points 6 days ago Daniel Pearl comes to mind.  His grieving father said that his son’s murderers didn’t even realize that he wanted to be their friend and was “on their side.”. Yeah…they didn’t care. permalink parent award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nMungo 8 points 6 days ago Already happening. permalink award report block reply\nRudeFrog 8 points 6 days ago We already are, this is a war whether you want to admit it or not permalink award report block reply\nSouth_Florida_Guy 8 points 6 days ago Impossible! We fought them \"over there\" so we don't have to fight them \"over here\"! permalink award report block reply Capoditutticapi1 OP 6 points 6 days ago Gubmint lied, they ALL lied, they're still lying, and will continue to lie into the future... permalink parent award report block reply 1_Badcop 3 points 6 days ago Right? That's what I was told. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nCapoditutticapi1 OP 6 points 6 days ago Gubmint lied, they ALL lied, they're still lying, and will continue to lie into the future... permalink parent award report block reply\n1_Badcop 3 points 6 days ago Right? That's what I was told. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nf_bastiat 8 points 6 days ago I hope it comes to that sooner than later before they breed a big enough army. I want every single one of them gone, I don't give a shit about freedom of a religion. I am an atheist but it is very clear what religions stand for what values, and Islam is a cancer on every population it touches. permalink award report block reply Seeker_17 4 points 6 days ago Islam isn't even a religion, it's more like an ideology or all encompassing system that also regulates the lifes of unbelievers. The way around the freedom of religion thing is to treat Islam as something else . permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nSeeker_17 4 points 6 days ago Islam isn't even a religion, it's more like an ideology or all encompassing system that also regulates the lifes of unbelievers. The way around the freedom of religion thing is to treat Islam as something else . permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\n1_Badcop 7 points 6 days ago Um, pretty sure muslims are already killing us here from time to time...or does he just mean at some point we'll be allowed to fight back? permalink award report block reply\nSpaceWizard 7 points 6 days ago And who can we thank for that? permalink award report block reply Seeker_17 4 points 6 days ago Catholic charities and other woke churches. permalink parent award report block reply SpaceWizard 2 points 5 days ago That's true, they had major contributions to the destruction of our country. They brought in TONS of illegals permalink parent award report block reply Capoditutticapi1 OP 4 points 6 days ago The real question isn’t \"who gets blamed,\" but why anyone thinks importing or incubating irreconcilable conflicts is sustainable. Blame follows power and narrative control, but the root cause would be decades of policy failures,  unchecked migration without assimilation, foreign policy blowback, and domestic polarization weaponized by elites. No group \"deserves\" this future. The way to avoid it isn’t more blame, it’s ruthless pragmatism about borders, culture, and security. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nSeeker_17 4 points 6 days ago Catholic charities and other woke churches. permalink parent award report block reply SpaceWizard 2 points 5 days ago That's true, they had major contributions to the destruction of our country. They brought in TONS of illegals permalink parent award report block reply\nSpaceWizard 2 points 5 days ago That's true, they had major contributions to the destruction of our country. They brought in TONS of illegals permalink parent award report block reply\nCapoditutticapi1 OP 4 points 6 days ago The real question isn’t \"who gets blamed,\" but why anyone thinks importing or incubating irreconcilable conflicts is sustainable. Blame follows power and narrative control, but the root cause would be decades of policy failures,  unchecked migration without assimilation, foreign policy blowback, and domestic polarization weaponized by elites. No group \"deserves\" this future. The way to avoid it isn’t more blame, it’s ruthless pragmatism about borders, culture, and security. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nThomm 7 points 6 days ago That day is today my friend. permalink award report block reply\nHallelujah_Jesus 6 points 6 days ago I hope it doesn't come to that. permalink award report block reply 1_Badcop 5 points 6 days ago Too late. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\n1_Badcop 5 points 6 days ago Too late. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nGeorgeBailey 6 points 6 days ago Kill the goats first so that they can’t try to reproduce. permalink award report block reply\nKhryn_Tzu 6 points 6 days ago Exodus 22:2 -  \"If a thief is caught breaking in at night and is struck a fatal blow, the defender is not guilty of bloodshed.\" DEUS. VULT. permalink award report block reply\nSmurfection 5 points 6 days ago It's about five to ten years away.  They're developing no-go areas and autonomous zones right now.It's not immigrants congregating together.  It's footholds. permalink award report block reply\ngillonba 5 points 6 days ago We can only hope Americans will fight back before we are overrun completely permalink award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nLordKuroTheGreat 5 points 6 days ago It'd be over in 20 minutes if we didn't have government faggots protecting them. permalink award report block reply\nilikehats 5 points 6 days ago If only there were 2 to 3 million servicemen and women with the experience necessary to take on such a horde. 20+ years of war should be enough to pull from.\nThis is not counting the good ‘ol boys with itchy fingers who didn’t get a chance.\nI say Fucking Bring It permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nCovfefe_Commando 5 points 6 days ago It starts with open-toed sandals and man-pajamas in the daylight hours...        it ends when we decide to end it... permalink award report block reply\ncardinaldrones 4 points 6 days ago We aren’t as fucked as Europe and never will be.  The deep state overlooked the fact that the 3rd worlders that they flooded us with are majority Roman Catholic.   Also many of the Muslims in America when they have kids the kids inevitably get more exposed to western values.  With each generation.  Western values destroy religion even Islam.  If you just cut them off from\nEntering the organic growth will be pretty tame religiously after a couple generations.  And Christianity will still be around. permalink award report block reply\ngaijin_ronin 4 points 6 days ago Yes and in a relatively short time too.  In addition white liberals (especially women) will also come to their aid (or rather be useful idiots to the slaughter).  It's going to start with some Weather Underground type shit and escalate. permalink award report block reply\n2025WhatIsTrue 4 points 6 days ago Stay/get physically fit.  Go to the range regularly.  Be aware of your surroundings.  Defend FREE America from the various scum. permalink award report block reply\nknnbccb 3 points 6 days ago Better start fighting sooner rather than later, because their kind breeds like rabbits and they do zerg rush attacks in the name of Allah. The longer you delay, the greater your dismay. permalink award report block reply\nnewchina 3 points 6 days ago What about the chinamen? permalink award report block reply HairSniffer 4 points 6 days ago We have enough Chinamen.  No more CCP agents.  Students go home.  Visas canceled. permalink parent award report block reply\nHairSniffer 4 points 6 days ago We have enough Chinamen.  No more CCP agents.  Students go home.  Visas canceled. permalink parent award report block reply\nAnyone 3 points 6 days ago Absolutely 💯 % permalink award report block reply\nPiratePatriot 3 points 6 days ago already happening - look at the small crime reports. Don't need to wait for large scale army war. permalink award report block reply\nRedCapNation 3 points 6 days ago 100% It makes me sick permalink award report block reply\nPapabravo12 2 points 6 days ago I would agree if I didn’t think robots are going to kill us long before then anyway permalink award report block reply\nBeerPatroit 2 points 6 days ago We should do it now before they get to 10% like the UK. Need to do it before they try to take over. permalink award report block reply\nterribletwos 2 points 6 days ago Doubt it. Ask the UK how that's going. What we'll do is say \"two more weeks\" until the last man standing gets stabbed. permalink award report block reply\ninfinitysupreme 2 points 6 days ago Already are. permalink award report block reply\nbarwhack 2 points 6 days ago One day. Very soon, I think. permalink award report block reply\npeoplewatching101 2 points 6 days ago So I started blasting meme .. Canada and the US better get our shit together. There is no more time to correct course permalink award report block reply\nSeeker_17 2 points 6 days ago Yes, and it can't happen soon enough. Time to get rid of the cancer permalink award report block reply\nDiversity_Fire 2 points 6 days ago It will likely immediately follow us bailing Europe out permalink award report block reply\nShih_Tabed 2 points 6 days ago No they won't.  Everyone will sit back thinking things will be under control.  Eventually there will be concentrated mobs of 100s or 1000s of muslims walking right into homes and dragging people into the street for execution.  The only way they get pushed back is if they are killed.  Incendiaries are generally the best option for dealing with crowds and they are easy to craft.  There needs to be a massive movement that doesn't care about being called racists, nazis, all the fun words and gets the job done.  The movement needs to not care about the purge of all things left being called \"censorship\".  Everyone worried about their kids hating them.  They already do.  Its time to take back society for ourselves so we can get something out of it before we die. permalink award report block reply\nMegaboom2025 2 points 6 days ago One day? You mean 9/11/2001? permalink award report block reply\nAggrieved03 2 points 6 days ago If we’d fought the politicians when it mattered they wouldn’t be here. permalink award report block reply\nPatriotSkorzeny 2 points 6 days ago You gotta go thru their frontline troops, the cops. permalink award report block reply Capoditutticapi1 OP 6 points 6 days ago The cops will be replaced by the muslims..., then comes Sharia! Starting in NYC, Minnesota, Texas, Michigan, etc... Need to nip this shit in the bud now... permalink parent award report block reply\nCapoditutticapi1 OP 6 points 6 days ago The cops will be replaced by the muslims..., then comes Sharia! Starting in NYC, Minnesota, Texas, Michigan, etc... Need to nip this shit in the bud now... permalink parent award report block reply\nUnboosted 2 points 5 days ago We already are. It was about 10 years ago that the NYC media said it would stop reporting on muslim attacks in NYC. There was an epidemic of muslim renting uhaul trucks and running over anyone they could. The last one I can remember being reported on was a uhaul barrelling down a bike path and like 9 ppl died. Its only gotten worse since then, but muslims are a protected class so go fuck yourself you filthy American I guess. Best we can answer back with is tax strike 2026 permalink award report block reply\nsalt-collector 2 points 6 days ago He aint wrong...sadly. I hope Im not to old and frail by then permalink award report block reply\nFrankDuncan 2 points 6 days ago Some will fight with them against us permalink award report block reply\nbirddogz 2 points 6 days ago We already are.  Wake up permalink award report block reply\nstormdraintrooper 2 points 6 days ago Who opened the gate? permalink award report block reply\nMoebius 2 points 6 days ago They're here... permalink award report block reply\nKilroy 1 points 6 days ago It sure seems like we're heading that way thatnks to Speaker Johnson and a pathetic Congress permalink award report block reply\nborisborscht 1 points 6 days ago Why aren't you doing it now? permalink award report block reply\nLatitudeofMind 1 points 5 days ago We are already permalink award report block reply\nMhmm2MoreWeeks 1 points 6 days ago Tell me about the Jewish Master Race Daddy. /s permalink award report block reply\nBeardholder 1 points 5 days ago We got 10 times the numbers. We got hunters and veterans and so on. That's not going to be a problem. IT will be in 10 years though permalink award report block reply\nFullyDilated 1 points 6 days ago kill em all permalink award report block reply\nstormdraintrooper 1 points 5 days ago As I see it now,  It's going to require a fulminant uprising. permalink award report block reply\nDEPORT50M 1 points 5 days ago Already are permalink award report block reply\nReassess_Reevaluate 1 points 5 days ago All you have to do is read your Bible. In the Armies present at the Battle of Armageddon, the United States, and the armies of the west are nowhere to be seen. Imagine that.  There will be a war to literally end all wars, just prior to Jesus returning to earth, and the most powerful military on earth isn't in the fight? Something very bad happens to us by then.  Be prepared and watchful. permalink award report block reply\nthrowaway29834751 1 points 5 days ago repeal the 1965 immigration act, and limit / reduce immigration from all other countries, western hemisphere included permalink award report block reply\nPatriot4TN 1 points 6 days ago Can we go ahead and get it started? permalink award report block reply\nHockeyMom4Trump 1 points 6 days ago Remember history? Yep. There will be a war down the road. permalink award report block reply\nbenjovikenobi 1 points 6 days ago Remember when they tried to build a mosque at Ground Zero within a year after 9/11 happened? That was the first clue. Or maybe the 1993 WTC bombing should have been the clue, but I was too young to understand anything when it happened. permalink award report block reply\nCaptainWinston 1 points 5 days ago We already are permalink award report block reply\nh3xAd3c1m4L 1 points 5 days ago One day? Shit, we should be doing it every day! permalink award report block reply\nNellie_the_Beaut 1 points 5 days ago Yep. I dreamt about that very thing the night of 9/10/2001. Swarms of Arab men capturing and killing Americans on the grounds of Central Park. It was at night, I watched in horror from the woods lining the park with a small group of people running stealthily to escape. I was frozen in terror watching the carnage until a stranger grabbed me and pulled me along. “C’mon, we have to go! You can’t help them now! Save yourself before they see you!”  I looked up and the buildings all around the park were on fire, including two very tall skyscrapers.  We were able to escape and jumped into a car and drove off and I turned around and watched the chaos behind us. There was so much fire the sky looked like daytime. It was the worst nightmare I have ever had and I woke up yelling and in a sweat around 4am PT on 9/11/2001, and my husband asked me what was wrong.  I told him “I just had the most awful nightmare… people were being massacred by Arab men in those white robes, it was so terrible… where did that come from??” He patted me and said it was only a dream and to go back to sleep. I have never been to Central Park or New York.  Be ready, and aware, folks. permalink award report block reply\nreasonablydisturbed 1 points 5 days ago Always have a tub of bacon grease for just this occasion. permalink award report block reply\nMindcrym 1 points 5 days ago I'm going to use a flamethrower for a more effective approach. permalink award report block reply\nIanCrosslandEatBaby 1 points 6 days ago Listen to the guy with the picture of the faggot cowboy from TV. permalink award report block reply\nILoveSilk 1 points 6 days ago LOL. We can't even win over Democrats and you think we will win over Muslims ... They will become the majority. 4 wives, 12 children ... They use womb to conquer you. And how many conservatives marry left spouses? permalink award report block reply\nCovefefe 0 points 6 days ago Didn’t that start officially in 1993????? permalink award report block reply\nTh0mas_Paine 0 points 6 days ago Americans fight back? Bless your heart. permalink award report block reply Shmioighan 0 points 6 days ago \"Americans\" kek. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nShmioighan 0 points 6 days ago \"Americans\" kek. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBillyBobJimmyJoe 1 points 5 days ago Comment removed by community filter, pending further review. permalink award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nHoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply\nManWhoMakesTheMusic 0 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T20:45:05.723132Z"
}