{
  "id": "8172081",
  "title": "1467Woke Portland Politician Who Demanded “Unhoused Neighbors” Be Given a Place to Sleep Has Home To",
  "url": "https://patriots.win/p/1ARK53JHMX/woke-portland-politician-who-dem/c",
  "content": "1467 Woke Portland Politician Who Demanded “Unhoused Neighbors” Be Given a Place to Sleep Has Home Torched by Homeless Person (www.thegatewaypundit.com) posted 6 days ago by Trick 123 comments award share report block Woke Portland Politician Who Demanded \"Unhoused Neighbors\" Be Given a Place to Sleep Has Home Torched by Homeless Person | The G... A Portland Democrat who once called for homeless individuals to be given housing suffered an ironic and cruel twist of fate last week. www.thegatewaypundit.com\n123 comments Sort by Top Top New Worst Old Save Yawnz13 50 points 6 days ago Actual homeless, or \"homeless\"? permalink award report block reply lolpaladins 26 points 6 days ago he's been arrested 50 times, that means actual homeless. They only lock people up for a long time when they have something to lose. permalink parent award report block reply SicSemperTyrannis2 9 points 6 days ago Over 50x since 2006. The irony just keeps coming with this one: he says he tried to use an electrical outlet to get warm. When that didn't work he started a fire. When that got out of control he tried putting it out with his foot. When that didn't work he went to a nearby church. https://m.youtube.com/watch?v=0fodyfZi-No&pp=ygUUQW50aWZhIGZlZXQgb24gZmlyZSDSBwkJAwoBhyohjO8%3D My only complaint is this isn't an endless loop permalink parent award report block reply Yawnz13 7 points 6 days ago Depends on what he's been arrested for. permalink parent award report block reply Spartacus1188 4 points 5 days ago Euthanasia is the perfect solution for the homeless. permalink parent award report block reply TheMemesofProduction 21 points 6 days ago The perp’s name is literally Vashon Locust. Can’t make this shit up. permalink parent award report block reply impera 9 points 6 days ago Then the fifth angel sounded: And I saw a star fallen from heaven to the earth. To him was given the key to the [a]bottomless pit. 2 And he opened the bottomless pit, and smoke arose out of the pit like the smoke of a great furnace. So the sun and the air were darkened because of the smoke of the pit. 3 Then out of the smoke locusts came upon the earth. If it was going to go down anywhere, it will be Portland. permalink parent award report block reply Washington_Redskins 6 points 5 days ago And lo the locusts' name.were Vashon, Lebron, Deshawn, and Jaquan. . permalink parent award report block reply glow-operator-2-0 2 points 5 days ago Laquantamarius Kwaanzell Demarcus Demetrius III permalink parent award report block reply SicSemperTyrannis2 4 points 6 days ago Vermin Supreme? permalink parent award report block reply RedAltoids 3 points 5 days ago No, Vermin's OK. If he wins we get a free pony. permalink parent award report block reply SicSemperTyrannis2 2 points 5 days ago We have to turn in our guns though. In exchange for better guns! permalink parent award report block reply TD_Covfefe_Crusader 12 points 6 days ago A career criminal who will continue his crime spree after being released for the few misdemeanors they are charging him with in this case. Unsurprisingly, the Democrat cunt blamed the fire on MAGA. permalink parent award report block reply BeauHD 8 points 6 days ago Califor-nya-nya is good to the homel...wait! Portland!? Couldn't be! Color me shocked!!! permalink parent award report block reply Yawnz13 7 points 6 days ago I mean the ANTIFA types who claim to be homeless for welfare fraud. permalink parent award report block reply NotYourMan 1 points 5 days ago This seems like a good, heart warming story about retribution but she will learn nothing.  She will continue to hate white men and continue to be soft-on-crime.  She can't be replaced or voted out of office so why not. permalink parent award report block reply load 1 more comments... Beaverstatemilitia 44 points 6 days ago She tried to claim it was political when it first happened. She is a commie POS! permalink award report block reply TD_Covfefe_Crusader 20 points 6 days ago They always do. They have to be the victim, and the perpetrator is always MAGA. permalink parent award report block reply SicSemperTyrannis2 4 points 6 days ago This is, after all, MAGA country. permalink parent award report block reply Beaverstatemilitia 20 points 6 days ago The guy had been arrested something like 30 times before this incident. And he was low IQ! permalink award report block reply Lurker404 7 points 6 days ago And they always let him go ... until it hit one of their own. permalink parent award report block reply TD_Covfefe_Crusader 4 points 6 days ago Here in Oregon, even when criminals kill someone they usually don't spend much time in jail. For other felonies and misdemeanors they rarely get any jail time. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago It's such a shame I will never see any of the west coast. permalink parent award report block reply booblitchutz 2 points 5 days ago It is because outside of the major cities, it’s stunningly beautiful. The scumbag leftists don’t deserve it. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago Yeah, west coast beauty is spectacular. (And that's just referring to landscape) I even enjoy east coast beauty, and that's almost entirely low lying flood plains. permalink parent award report block reply TEXinLA 20 points 6 days ago WOMP WOMP permalink award report block reply Moebius 41 points 6 days ago She's got insurance right? It's just stuff. She was living on Stolen Land anyway... permalink parent award report block reply TEXinLA 2 points 3 days ago 😀😀😀😀 permalink parent award report block reply MastaJoda 4 points 6 days ago Karma doesn't FA. permalink parent award report block reply TEXinLA 1 points 3 days ago Agreed...😀 permalink parent award report block reply BasedMillennial 16 points 6 days ago \"Avalos and her cat managed to escape the incident unharmed. She claimed afterward that she was targeted for her political beliefs.\" Unbelievable permalink award report block reply ArtLife 14 points 6 days ago \" Avalos and her cat managed to escape the incident unharmed. \" hahaha permalink award report block reply TD_Covfefe_Crusader 11 points 6 days ago She lost all of her boxed wine though. permalink parent award report block reply ArtLife 8 points 6 days ago heartbreaking lol permalink parent award report block reply R3tro 13 points 6 days ago Famous last words before you are killed by the ones you wanted to hand free shit too…”but i’m on your side”… permalink award report block reply Covfefe_Commando 11 points 6 days ago I'll allow it. permalink award report block reply BlueKentuckyGirl 9 points 6 days ago Irony permalink award report block reply booblitchutz 2 points 5 days ago Yes. Proper use of the term. permalink parent award report block reply BlueKentuckyGirl 1 points 5 days ago 🍻 permalink parent award report block reply BillyMahoney 9 points 6 days ago Worse. Without evidence she blamed Trump supporters for the fire for weeks. Usually they start them by themselves for insurance fraud. Weird this case isn't that scenario. permalink award report block reply 559throw 8 points 6 days ago Unhoused unhouses unhinged retard, more news at 11 permalink award report block reply KekistanPM 7 points 6 days ago Demanded “Unhoused Neighbors” Be Given a Place to Sleep You first....oh. Nevermind. permalink award report block reply D__1 6 points 6 days ago She's unhoused now herself so she can really sympathize. permalink parent award report block reply gillonba 6 points 6 days ago Some might say she got what she deserved permalink award report block reply Hanrahan 1 points 5 days ago I wouldn't. She got out. permalink parent award report block reply NerdRage 5 points 6 days ago There's a reason why some homeless people are homeless. I'm not talking about the \"homeless for a week\" kinds either. These people do NOT have the brain capacity to function in modern society. permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply yummy_yumm_yumms 5 points 6 days ago The bums last name is locust, how fitting. permalink award report block reply Roadpower 5 points 6 days ago Wow, fuck Portland. He [the perp] faces charges of reckless burning, second-degree mischief, and trespassing. These are all misdemeanors. You burn down someone's home and you only get hit with misdemeanors? wtf permalink award report block reply SicSemperTyrannis2 2 points 6 days ago At least it's mischief in the second degree ... permalink parent award report block reply Liberats 1 points 5 days ago He didn't realise if you set fire to the lounge to stay warm it would torch the whole house.\nThat's his non qualified arsonists excuse. permalink parent award report block reply Speedgraphic69 5 points 6 days ago Tough shit dumbass permalink award report block reply Kael 4 points 6 days ago Ohhhh nooooo. Anyways.. permalink award report block reply Pissonit 4 points 6 days ago Plays song...🎶She's on Fire🎶🔥🔥🔥🔥🔥 permalink award report block reply D__1 6 points 6 days ago 🎶 burnin' down the house! 🎶 permalink parent award report block reply HunterBidensPC 4 points 6 days ago Good! Best reality check in the world. Bet it won’t do much but at least she gets a taste of karma permalink award report block reply projectarcturus1 4 points 6 days ago Idiot. permalink award report block reply 67Vert 4 points 6 days ago Locust has been arrested more than 50 times for various felony and misdemeanor charges since 2006, permalink award report block reply Ugh3rdaccount 4 points 6 days ago What the fuck is that thing in the picture? permalink award report block reply SicSemperTyrannis2 2 points 6 days ago UPO (Unidentifiable Political Object) permalink parent award report block reply Mamapedia 2 points 6 days ago Senorita Cerdito. I think. permalink parent award report block reply ak83 4 points 6 days ago They \"unhoused\" her. permalink award report block reply knnbccb 3 points 6 days ago Undocumented, Unhoused, Transitioned. Their side is full of lunatics. permalink award report block reply donkeyKang 3 points 6 days ago I wonder if she wouldn't let them stay with her at her house? If true, that's the definition of ironic. Bwahahahaha! permalink award report block reply ThisIsHowItStarts 3 points 6 days ago Suicidal empathy permalink award report block reply RandoBudster 3 points 6 days ago Ok, finally a feel good story today! Long live FAFO permalink award report block reply DefKon1 3 points 6 days ago I approve this message. permalink award report block reply 2025WhatIsTrue 2 points 6 days ago LOL.  What a naive fool. At least they have an opportunity now to reject their woke idiocy. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago I'm so sure that's the outcome here ... permalink parent award report block reply SmartyPants 2 points 6 days ago another happy ending... permalink award report block reply OpusX 2 points 6 days ago When the rubber meets the road. Why do liberals never learn and always force themselves to figure things out the hard way? permalink award report block reply SicSemperTyrannis2 1 points 6 days ago You're assuming any figuring out has occurred. permalink parent award report block reply gr8skawts 2 points 5 days ago YOU REAP WHAT YOU FUCKING SOW! permalink award report block reply Trumpluv77 2 points 6 days ago Awesome. permalink award report block reply Dantalian 2 points 6 days ago GOOD!!! permalink award report block reply RandyQuaidsBeard 2 points 6 days ago Read this headline and tell me God doesn't exist. LOL permalink award report block reply Eurpoean 2 points 5 days ago Oh this just made me smile such a nice big smile. Thanks for sharing! permalink award report block reply FightTheSWAMP 2 points 6 days ago Hopefully all of his charges will be dropped because he was just looking for a place to get warm and sleep. How cruel of her to not keep her door unlocked to give the unhoused a place to sleep... Now she's claiming the unhoused individual is a MAGA extremist. permalink award report block reply asdrubael_was_right 2 points 6 days ago Good that makes me happy. permalink award report block reply Cyclepath55 2 points 6 days ago Was she hopefully in it? permalink award report block reply learntocode 2 points 6 days ago Be a real shame this kept happening to \"advocates\". permalink award report block reply SicSemperTyrannis2 1 points 6 days ago Advocate Judges? 🤔 permalink parent award report block reply Hikedelics 2 points 6 days ago Now she can pay it forward and burn someone else’s house down by starting a fire in their shed to stay warm because she is now homeless too. Funny how if she actually believed in what she preached, she could have let the dude inside and he wouldn’t have started that particular fire. permalink award report block reply MythArcana 2 points 6 days ago Sometimes we sleep, sometimes we don't.   🏡🔥 permalink award report block reply Pnw4gotpwd 2 points 6 days ago Maybe now she understands. People aren't anti homeless etc to be mean, it's because we are tired of their crap permalink award report block reply saltyviewer123 2 points 6 days ago Full circle hath come around. permalink award report block reply Dev404 2 points 6 days ago Well deserved. permalink award report block reply throttlejohnson 2 points 6 days ago so now ther both homeless? thats real equality right there /s permalink award report block reply Bldg_2019 2 points 6 days ago Bitch needs to keep quiet. It wasn’t a “home”. It was just a collection of building materials. permalink award report block reply SorosHasBallsackEyes 2 points 6 days ago The criminal homeless guys name is 'Locust'. permalink award report block reply barwhack 2 points 6 days ago What a punchable face... permalink award report block reply newuser8 2 points 6 days ago The article says that torching a car a condo are only misdamenors? Wtf permalink award report block reply Moebius 2 points 6 days ago Vashon... Figures. permalink award report block reply knnbccb 2 points 6 days ago Homeless arsonists could have helped us out by immolating these trashy libtard politicians. Help thin the herd of these pests. permalink award report block reply RusherOfDin 1 points 5 days ago The grinning idiotic face of a females suicidal empathy permalink award report block reply suckmycorona 1 points 6 days ago Good. permalink award report block reply Dem_slayer 1 points 6 days ago I hope she didn't have fire insurance permalink award report block reply hey_spike 1 points 6 days ago A Republican is a Democrat who got mugged. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago This xir will never learn ... permalink parent award report block reply Trumpluv77 1 points 6 days ago WHACA permalink award report block reply OG_BACONndEGGs 1 points 6 days ago Ahahahahahahahahahah permalink award report block reply gummykage 1 points 6 days ago LO Fuckin L permalink award report block reply SaxonRealm 1 points 6 days ago Aaaa haha haha. 😂 permalink award report block reply YodaBannon 1 points 6 days ago 🎺 🤡 permalink award report block reply SicSemperTyrannis2 1 points 6 days ago Trumpet clown? permalink parent award report block reply sygish 1 points 6 days ago I was going to say, “at least she is not a hypocrite” but she had not offered any homeless shelter. The guy set a fire in her shed unbeknownst to her. permalink award report block reply PearlyGaits57 1 points 5 days ago MORONS without brains. permalink award report block reply Wolfram6911 1 points 6 days ago The only way the insanity stops is when it comes to their doorsteps and their families. I don't wish destruction upon anyone, but it is well past time when they put up their own safety for their ideals instead of volunteering everyone else to do so. permalink award report block reply TearsAficionado 1 points 6 days ago Based homeless person. permalink award report block reply jrhicksjr 1 points 6 days ago This is a great feelgood story. permalink award report block reply MAGALADON9 1 points 5 days ago Haw-Haw permalink award report block reply BonerJams2000 1 points 6 days ago I love a happy ending!  Hopefully she was in it and not bribed to the ground! permalink award report block reply starjello 1 points 5 days ago I love me some good karma in the morning permalink award report block reply Counterwhat 1 points 6 days ago Ahhh man 😂 permalink award report block reply quiznossucks 1 points 6 days ago 🤣🤣🤣🤣🤣🤣🤣 permalink award report block reply Ferretman 1 points 6 days ago Hah hah hah permalink award report block reply JoinTheDiscussion 1 points 5 days ago Too bad it was an accident.. I like when its due to some political retribution https://rmx.news/france/french-mayor-in-support-of-new-asylum-center-in-seaside-town-has-his-house-burned-down/ permalink award report block reply jhewish 1 points 5 days ago Fat, ugly, brown skin. Checks all the boxes. permalink award report block reply HankScorpio 1 points 6 days ago lol permalink award report block reply Justlooking250 1 points 5 days ago Womp womp FAFO she Darwin'ed her house lol permalink award report block reply AwShitHereWeGoAgain 1 points 6 days ago Palpatine: Ironic. permalink award report block reply Justlooking250 1 points 5 days ago M O R O N 🤤 permalink award report block reply Prandogolio 1 points 6 days ago Cool permalink award report block reply 5DchessWatch 0 points 6 days ago When they say \"the unhoused\" they actually mean the \"unhosed\", which is really code for \"deloused\" Ok, I'll say it.  Deep down, the house they want to put them in is jail.  No projecto permalink award report block reply DagneyTaggart -3 points 5 days ago No doubt the perp was released before she could dial the phone to call her insurance agent. permalink award report block reply Gwoz8881 0 points 6 days ago Comment removed by community moderators. permalink award report block reply\nYawnz13 50 points 6 days ago Actual homeless, or \"homeless\"? permalink award report block reply lolpaladins 26 points 6 days ago he's been arrested 50 times, that means actual homeless. They only lock people up for a long time when they have something to lose. permalink parent award report block reply SicSemperTyrannis2 9 points 6 days ago Over 50x since 2006. The irony just keeps coming with this one: he says he tried to use an electrical outlet to get warm. When that didn't work he started a fire. When that got out of control he tried putting it out with his foot. When that didn't work he went to a nearby church. https://m.youtube.com/watch?v=0fodyfZi-No&pp=ygUUQW50aWZhIGZlZXQgb24gZmlyZSDSBwkJAwoBhyohjO8%3D My only complaint is this isn't an endless loop permalink parent award report block reply Yawnz13 7 points 6 days ago Depends on what he's been arrested for. permalink parent award report block reply Spartacus1188 4 points 5 days ago Euthanasia is the perfect solution for the homeless. permalink parent award report block reply TheMemesofProduction 21 points 6 days ago The perp’s name is literally Vashon Locust. Can’t make this shit up. permalink parent award report block reply impera 9 points 6 days ago Then the fifth angel sounded: And I saw a star fallen from heaven to the earth. To him was given the key to the [a]bottomless pit. 2 And he opened the bottomless pit, and smoke arose out of the pit like the smoke of a great furnace. So the sun and the air were darkened because of the smoke of the pit. 3 Then out of the smoke locusts came upon the earth. If it was going to go down anywhere, it will be Portland. permalink parent award report block reply Washington_Redskins 6 points 5 days ago And lo the locusts' name.were Vashon, Lebron, Deshawn, and Jaquan. . permalink parent award report block reply glow-operator-2-0 2 points 5 days ago Laquantamarius Kwaanzell Demarcus Demetrius III permalink parent award report block reply SicSemperTyrannis2 4 points 6 days ago Vermin Supreme? permalink parent award report block reply RedAltoids 3 points 5 days ago No, Vermin's OK. If he wins we get a free pony. permalink parent award report block reply SicSemperTyrannis2 2 points 5 days ago We have to turn in our guns though. In exchange for better guns! permalink parent award report block reply TD_Covfefe_Crusader 12 points 6 days ago A career criminal who will continue his crime spree after being released for the few misdemeanors they are charging him with in this case. Unsurprisingly, the Democrat cunt blamed the fire on MAGA. permalink parent award report block reply BeauHD 8 points 6 days ago Califor-nya-nya is good to the homel...wait! Portland!? Couldn't be! Color me shocked!!! permalink parent award report block reply Yawnz13 7 points 6 days ago I mean the ANTIFA types who claim to be homeless for welfare fraud. permalink parent award report block reply NotYourMan 1 points 5 days ago This seems like a good, heart warming story about retribution but she will learn nothing.  She will continue to hate white men and continue to be soft-on-crime.  She can't be replaced or voted out of office so why not. permalink parent award report block reply load 1 more comments...\nlolpaladins 26 points 6 days ago he's been arrested 50 times, that means actual homeless. They only lock people up for a long time when they have something to lose. permalink parent award report block reply SicSemperTyrannis2 9 points 6 days ago Over 50x since 2006. The irony just keeps coming with this one: he says he tried to use an electrical outlet to get warm. When that didn't work he started a fire. When that got out of control he tried putting it out with his foot. When that didn't work he went to a nearby church. https://m.youtube.com/watch?v=0fodyfZi-No&pp=ygUUQW50aWZhIGZlZXQgb24gZmlyZSDSBwkJAwoBhyohjO8%3D My only complaint is this isn't an endless loop permalink parent award report block reply Yawnz13 7 points 6 days ago Depends on what he's been arrested for. permalink parent award report block reply Spartacus1188 4 points 5 days ago Euthanasia is the perfect solution for the homeless. permalink parent award report block reply\nSicSemperTyrannis2 9 points 6 days ago Over 50x since 2006. The irony just keeps coming with this one: he says he tried to use an electrical outlet to get warm. When that didn't work he started a fire. When that got out of control he tried putting it out with his foot. When that didn't work he went to a nearby church. https://m.youtube.com/watch?v=0fodyfZi-No&pp=ygUUQW50aWZhIGZlZXQgb24gZmlyZSDSBwkJAwoBhyohjO8%3D My only complaint is this isn't an endless loop permalink parent award report block reply\nYawnz13 7 points 6 days ago Depends on what he's been arrested for. permalink parent award report block reply\nSpartacus1188 4 points 5 days ago Euthanasia is the perfect solution for the homeless. permalink parent award report block reply\nTheMemesofProduction 21 points 6 days ago The perp’s name is literally Vashon Locust. Can’t make this shit up. permalink parent award report block reply impera 9 points 6 days ago Then the fifth angel sounded: And I saw a star fallen from heaven to the earth. To him was given the key to the [a]bottomless pit. 2 And he opened the bottomless pit, and smoke arose out of the pit like the smoke of a great furnace. So the sun and the air were darkened because of the smoke of the pit. 3 Then out of the smoke locusts came upon the earth. If it was going to go down anywhere, it will be Portland. permalink parent award report block reply Washington_Redskins 6 points 5 days ago And lo the locusts' name.were Vashon, Lebron, Deshawn, and Jaquan. . permalink parent award report block reply glow-operator-2-0 2 points 5 days ago Laquantamarius Kwaanzell Demarcus Demetrius III permalink parent award report block reply SicSemperTyrannis2 4 points 6 days ago Vermin Supreme? permalink parent award report block reply RedAltoids 3 points 5 days ago No, Vermin's OK. If he wins we get a free pony. permalink parent award report block reply SicSemperTyrannis2 2 points 5 days ago We have to turn in our guns though. In exchange for better guns! permalink parent award report block reply\nimpera 9 points 6 days ago Then the fifth angel sounded: And I saw a star fallen from heaven to the earth. To him was given the key to the [a]bottomless pit. 2 And he opened the bottomless pit, and smoke arose out of the pit like the smoke of a great furnace. So the sun and the air were darkened because of the smoke of the pit. 3 Then out of the smoke locusts came upon the earth. If it was going to go down anywhere, it will be Portland. permalink parent award report block reply Washington_Redskins 6 points 5 days ago And lo the locusts' name.were Vashon, Lebron, Deshawn, and Jaquan. . permalink parent award report block reply glow-operator-2-0 2 points 5 days ago Laquantamarius Kwaanzell Demarcus Demetrius III permalink parent award report block reply\nWashington_Redskins 6 points 5 days ago And lo the locusts' name.were Vashon, Lebron, Deshawn, and Jaquan. . permalink parent award report block reply glow-operator-2-0 2 points 5 days ago Laquantamarius Kwaanzell Demarcus Demetrius III permalink parent award report block reply\nglow-operator-2-0 2 points 5 days ago Laquantamarius Kwaanzell Demarcus Demetrius III permalink parent award report block reply\nSicSemperTyrannis2 4 points 6 days ago Vermin Supreme? permalink parent award report block reply RedAltoids 3 points 5 days ago No, Vermin's OK. If he wins we get a free pony. permalink parent award report block reply SicSemperTyrannis2 2 points 5 days ago We have to turn in our guns though. In exchange for better guns! permalink parent award report block reply\nRedAltoids 3 points 5 days ago No, Vermin's OK. If he wins we get a free pony. permalink parent award report block reply SicSemperTyrannis2 2 points 5 days ago We have to turn in our guns though. In exchange for better guns! permalink parent award report block reply\nSicSemperTyrannis2 2 points 5 days ago We have to turn in our guns though. In exchange for better guns! permalink parent award report block reply\nTD_Covfefe_Crusader 12 points 6 days ago A career criminal who will continue his crime spree after being released for the few misdemeanors they are charging him with in this case. Unsurprisingly, the Democrat cunt blamed the fire on MAGA. permalink parent award report block reply\nBeauHD 8 points 6 days ago Califor-nya-nya is good to the homel...wait! Portland!? Couldn't be! Color me shocked!!! permalink parent award report block reply Yawnz13 7 points 6 days ago I mean the ANTIFA types who claim to be homeless for welfare fraud. permalink parent award report block reply\nYawnz13 7 points 6 days ago I mean the ANTIFA types who claim to be homeless for welfare fraud. permalink parent award report block reply\nNotYourMan 1 points 5 days ago This seems like a good, heart warming story about retribution but she will learn nothing.  She will continue to hate white men and continue to be soft-on-crime.  She can't be replaced or voted out of office so why not. permalink parent award report block reply\nBeaverstatemilitia 44 points 6 days ago She tried to claim it was political when it first happened. She is a commie POS! permalink award report block reply TD_Covfefe_Crusader 20 points 6 days ago They always do. They have to be the victim, and the perpetrator is always MAGA. permalink parent award report block reply SicSemperTyrannis2 4 points 6 days ago This is, after all, MAGA country. permalink parent award report block reply\nTD_Covfefe_Crusader 20 points 6 days ago They always do. They have to be the victim, and the perpetrator is always MAGA. permalink parent award report block reply SicSemperTyrannis2 4 points 6 days ago This is, after all, MAGA country. permalink parent award report block reply\nSicSemperTyrannis2 4 points 6 days ago This is, after all, MAGA country. permalink parent award report block reply\nBeaverstatemilitia 20 points 6 days ago The guy had been arrested something like 30 times before this incident. And he was low IQ! permalink award report block reply Lurker404 7 points 6 days ago And they always let him go ... until it hit one of their own. permalink parent award report block reply TD_Covfefe_Crusader 4 points 6 days ago Here in Oregon, even when criminals kill someone they usually don't spend much time in jail. For other felonies and misdemeanors they rarely get any jail time. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago It's such a shame I will never see any of the west coast. permalink parent award report block reply booblitchutz 2 points 5 days ago It is because outside of the major cities, it’s stunningly beautiful. The scumbag leftists don’t deserve it. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago Yeah, west coast beauty is spectacular. (And that's just referring to landscape) I even enjoy east coast beauty, and that's almost entirely low lying flood plains. permalink parent award report block reply\nLurker404 7 points 6 days ago And they always let him go ... until it hit one of their own. permalink parent award report block reply\nTD_Covfefe_Crusader 4 points 6 days ago Here in Oregon, even when criminals kill someone they usually don't spend much time in jail. For other felonies and misdemeanors they rarely get any jail time. permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago It's such a shame I will never see any of the west coast. permalink parent award report block reply booblitchutz 2 points 5 days ago It is because outside of the major cities, it’s stunningly beautiful. The scumbag leftists don’t deserve it. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago Yeah, west coast beauty is spectacular. (And that's just referring to landscape) I even enjoy east coast beauty, and that's almost entirely low lying flood plains. permalink parent award report block reply\nSicSemperTyrannis2 3 points 6 days ago It's such a shame I will never see any of the west coast. permalink parent award report block reply booblitchutz 2 points 5 days ago It is because outside of the major cities, it’s stunningly beautiful. The scumbag leftists don’t deserve it. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago Yeah, west coast beauty is spectacular. (And that's just referring to landscape) I even enjoy east coast beauty, and that's almost entirely low lying flood plains. permalink parent award report block reply\nbooblitchutz 2 points 5 days ago It is because outside of the major cities, it’s stunningly beautiful. The scumbag leftists don’t deserve it. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago Yeah, west coast beauty is spectacular. (And that's just referring to landscape) I even enjoy east coast beauty, and that's almost entirely low lying flood plains. permalink parent award report block reply\nSicSemperTyrannis2 1 points 5 days ago Yeah, west coast beauty is spectacular. (And that's just referring to landscape) I even enjoy east coast beauty, and that's almost entirely low lying flood plains. permalink parent award report block reply\nTEXinLA 20 points 6 days ago WOMP WOMP permalink award report block reply Moebius 41 points 6 days ago She's got insurance right? It's just stuff. She was living on Stolen Land anyway... permalink parent award report block reply TEXinLA 2 points 3 days ago 😀😀😀😀 permalink parent award report block reply MastaJoda 4 points 6 days ago Karma doesn't FA. permalink parent award report block reply TEXinLA 1 points 3 days ago Agreed...😀 permalink parent award report block reply\nMoebius 41 points 6 days ago She's got insurance right? It's just stuff. She was living on Stolen Land anyway... permalink parent award report block reply TEXinLA 2 points 3 days ago 😀😀😀😀 permalink parent award report block reply\nTEXinLA 2 points 3 days ago 😀😀😀😀 permalink parent award report block reply\nMastaJoda 4 points 6 days ago Karma doesn't FA. permalink parent award report block reply TEXinLA 1 points 3 days ago Agreed...😀 permalink parent award report block reply\nTEXinLA 1 points 3 days ago Agreed...😀 permalink parent award report block reply\nBasedMillennial 16 points 6 days ago \"Avalos and her cat managed to escape the incident unharmed. She claimed afterward that she was targeted for her political beliefs.\" Unbelievable permalink award report block reply\nArtLife 14 points 6 days ago \" Avalos and her cat managed to escape the incident unharmed. \" hahaha permalink award report block reply TD_Covfefe_Crusader 11 points 6 days ago She lost all of her boxed wine though. permalink parent award report block reply ArtLife 8 points 6 days ago heartbreaking lol permalink parent award report block reply\nTD_Covfefe_Crusader 11 points 6 days ago She lost all of her boxed wine though. permalink parent award report block reply ArtLife 8 points 6 days ago heartbreaking lol permalink parent award report block reply\nArtLife 8 points 6 days ago heartbreaking lol permalink parent award report block reply\nR3tro 13 points 6 days ago Famous last words before you are killed by the ones you wanted to hand free shit too…”but i’m on your side”… permalink award report block reply\nCovfefe_Commando 11 points 6 days ago I'll allow it. permalink award report block reply\nBlueKentuckyGirl 9 points 6 days ago Irony permalink award report block reply booblitchutz 2 points 5 days ago Yes. Proper use of the term. permalink parent award report block reply BlueKentuckyGirl 1 points 5 days ago 🍻 permalink parent award report block reply\nbooblitchutz 2 points 5 days ago Yes. Proper use of the term. permalink parent award report block reply BlueKentuckyGirl 1 points 5 days ago 🍻 permalink parent award report block reply\nBlueKentuckyGirl 1 points 5 days ago 🍻 permalink parent award report block reply\nBillyMahoney 9 points 6 days ago Worse. Without evidence she blamed Trump supporters for the fire for weeks. Usually they start them by themselves for insurance fraud. Weird this case isn't that scenario. permalink award report block reply\n559throw 8 points 6 days ago Unhoused unhouses unhinged retard, more news at 11 permalink award report block reply\nKekistanPM 7 points 6 days ago Demanded “Unhoused Neighbors” Be Given a Place to Sleep You first....oh. Nevermind. permalink award report block reply D__1 6 points 6 days ago She's unhoused now herself so she can really sympathize. permalink parent award report block reply\nD__1 6 points 6 days ago She's unhoused now herself so she can really sympathize. permalink parent award report block reply\ngillonba 6 points 6 days ago Some might say she got what she deserved permalink award report block reply Hanrahan 1 points 5 days ago I wouldn't. She got out. permalink parent award report block reply\nHanrahan 1 points 5 days ago I wouldn't. She got out. permalink parent award report block reply\nNerdRage 5 points 6 days ago There's a reason why some homeless people are homeless. I'm not talking about the \"homeless for a week\" kinds either. These people do NOT have the brain capacity to function in modern society. permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nyummy_yumm_yumms 5 points 6 days ago The bums last name is locust, how fitting. permalink award report block reply\nRoadpower 5 points 6 days ago Wow, fuck Portland. He [the perp] faces charges of reckless burning, second-degree mischief, and trespassing. These are all misdemeanors. You burn down someone's home and you only get hit with misdemeanors? wtf permalink award report block reply SicSemperTyrannis2 2 points 6 days ago At least it's mischief in the second degree ... permalink parent award report block reply Liberats 1 points 5 days ago He didn't realise if you set fire to the lounge to stay warm it would torch the whole house.\nThat's his non qualified arsonists excuse. permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago At least it's mischief in the second degree ... permalink parent award report block reply\nLiberats 1 points 5 days ago He didn't realise if you set fire to the lounge to stay warm it would torch the whole house.\nThat's his non qualified arsonists excuse. permalink parent award report block reply\nSpeedgraphic69 5 points 6 days ago Tough shit dumbass permalink award report block reply\nKael 4 points 6 days ago Ohhhh nooooo. Anyways.. permalink award report block reply\nPissonit 4 points 6 days ago Plays song...🎶She's on Fire🎶🔥🔥🔥🔥🔥 permalink award report block reply D__1 6 points 6 days ago 🎶 burnin' down the house! 🎶 permalink parent award report block reply\nD__1 6 points 6 days ago 🎶 burnin' down the house! 🎶 permalink parent award report block reply\nHunterBidensPC 4 points 6 days ago Good! Best reality check in the world. Bet it won’t do much but at least she gets a taste of karma permalink award report block reply\nprojectarcturus1 4 points 6 days ago Idiot. permalink award report block reply\n67Vert 4 points 6 days ago Locust has been arrested more than 50 times for various felony and misdemeanor charges since 2006, permalink award report block reply\nUgh3rdaccount 4 points 6 days ago What the fuck is that thing in the picture? permalink award report block reply SicSemperTyrannis2 2 points 6 days ago UPO (Unidentifiable Political Object) permalink parent award report block reply Mamapedia 2 points 6 days ago Senorita Cerdito. I think. permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago UPO (Unidentifiable Political Object) permalink parent award report block reply\nMamapedia 2 points 6 days ago Senorita Cerdito. I think. permalink parent award report block reply\nak83 4 points 6 days ago They \"unhoused\" her. permalink award report block reply\nknnbccb 3 points 6 days ago Undocumented, Unhoused, Transitioned. Their side is full of lunatics. permalink award report block reply\ndonkeyKang 3 points 6 days ago I wonder if she wouldn't let them stay with her at her house? If true, that's the definition of ironic. Bwahahahaha! permalink award report block reply\nThisIsHowItStarts 3 points 6 days ago Suicidal empathy permalink award report block reply\nRandoBudster 3 points 6 days ago Ok, finally a feel good story today! Long live FAFO permalink award report block reply\nDefKon1 3 points 6 days ago I approve this message. permalink award report block reply\n2025WhatIsTrue 2 points 6 days ago LOL.  What a naive fool. At least they have an opportunity now to reject their woke idiocy. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago I'm so sure that's the outcome here ... permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago I'm so sure that's the outcome here ... permalink parent award report block reply\nSmartyPants 2 points 6 days ago another happy ending... permalink award report block reply\nOpusX 2 points 6 days ago When the rubber meets the road. Why do liberals never learn and always force themselves to figure things out the hard way? permalink award report block reply SicSemperTyrannis2 1 points 6 days ago You're assuming any figuring out has occurred. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago You're assuming any figuring out has occurred. permalink parent award report block reply\ngr8skawts 2 points 5 days ago YOU REAP WHAT YOU FUCKING SOW! permalink award report block reply\nTrumpluv77 2 points 6 days ago Awesome. permalink award report block reply\nDantalian 2 points 6 days ago GOOD!!! permalink award report block reply\nRandyQuaidsBeard 2 points 6 days ago Read this headline and tell me God doesn't exist. LOL permalink award report block reply\nEurpoean 2 points 5 days ago Oh this just made me smile such a nice big smile. Thanks for sharing! permalink award report block reply\nFightTheSWAMP 2 points 6 days ago Hopefully all of his charges will be dropped because he was just looking for a place to get warm and sleep. How cruel of her to not keep her door unlocked to give the unhoused a place to sleep... Now she's claiming the unhoused individual is a MAGA extremist. permalink award report block reply\nasdrubael_was_right 2 points 6 days ago Good that makes me happy. permalink award report block reply\nCyclepath55 2 points 6 days ago Was she hopefully in it? permalink award report block reply\nlearntocode 2 points 6 days ago Be a real shame this kept happening to \"advocates\". permalink award report block reply SicSemperTyrannis2 1 points 6 days ago Advocate Judges? 🤔 permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Advocate Judges? 🤔 permalink parent award report block reply\nHikedelics 2 points 6 days ago Now she can pay it forward and burn someone else’s house down by starting a fire in their shed to stay warm because she is now homeless too. Funny how if she actually believed in what she preached, she could have let the dude inside and he wouldn’t have started that particular fire. permalink award report block reply\nMythArcana 2 points 6 days ago Sometimes we sleep, sometimes we don't.   🏡🔥 permalink award report block reply\nPnw4gotpwd 2 points 6 days ago Maybe now she understands. People aren't anti homeless etc to be mean, it's because we are tired of their crap permalink award report block reply\nsaltyviewer123 2 points 6 days ago Full circle hath come around. permalink award report block reply\nDev404 2 points 6 days ago Well deserved. permalink award report block reply\nthrottlejohnson 2 points 6 days ago so now ther both homeless? thats real equality right there /s permalink award report block reply\nBldg_2019 2 points 6 days ago Bitch needs to keep quiet. It wasn’t a “home”. It was just a collection of building materials. permalink award report block reply\nSorosHasBallsackEyes 2 points 6 days ago The criminal homeless guys name is 'Locust'. permalink award report block reply\nbarwhack 2 points 6 days ago What a punchable face... permalink award report block reply\nnewuser8 2 points 6 days ago The article says that torching a car a condo are only misdamenors? Wtf permalink award report block reply\nMoebius 2 points 6 days ago Vashon... Figures. permalink award report block reply\nknnbccb 2 points 6 days ago Homeless arsonists could have helped us out by immolating these trashy libtard politicians. Help thin the herd of these pests. permalink award report block reply\nRusherOfDin 1 points 5 days ago The grinning idiotic face of a females suicidal empathy permalink award report block reply\nsuckmycorona 1 points 6 days ago Good. permalink award report block reply\nDem_slayer 1 points 6 days ago I hope she didn't have fire insurance permalink award report block reply\nhey_spike 1 points 6 days ago A Republican is a Democrat who got mugged. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago This xir will never learn ... permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago This xir will never learn ... permalink parent award report block reply\nTrumpluv77 1 points 6 days ago WHACA permalink award report block reply\nOG_BACONndEGGs 1 points 6 days ago Ahahahahahahahahahah permalink award report block reply\ngummykage 1 points 6 days ago LO Fuckin L permalink award report block reply\nSaxonRealm 1 points 6 days ago Aaaa haha haha. 😂 permalink award report block reply\nYodaBannon 1 points 6 days ago 🎺 🤡 permalink award report block reply SicSemperTyrannis2 1 points 6 days ago Trumpet clown? permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Trumpet clown? permalink parent award report block reply\nsygish 1 points 6 days ago I was going to say, “at least she is not a hypocrite” but she had not offered any homeless shelter. The guy set a fire in her shed unbeknownst to her. permalink award report block reply\nPearlyGaits57 1 points 5 days ago MORONS without brains. permalink award report block reply\nWolfram6911 1 points 6 days ago The only way the insanity stops is when it comes to their doorsteps and their families. I don't wish destruction upon anyone, but it is well past time when they put up their own safety for their ideals instead of volunteering everyone else to do so. permalink award report block reply\nTearsAficionado 1 points 6 days ago Based homeless person. permalink award report block reply\njrhicksjr 1 points 6 days ago This is a great feelgood story. permalink award report block reply\nMAGALADON9 1 points 5 days ago Haw-Haw permalink award report block reply\nBonerJams2000 1 points 6 days ago I love a happy ending!  Hopefully she was in it and not bribed to the ground! permalink award report block reply\nstarjello 1 points 5 days ago I love me some good karma in the morning permalink award report block reply\nCounterwhat 1 points 6 days ago Ahhh man 😂 permalink award report block reply\nquiznossucks 1 points 6 days ago 🤣🤣🤣🤣🤣🤣🤣 permalink award report block reply\nFerretman 1 points 6 days ago Hah hah hah permalink award report block reply\nJoinTheDiscussion 1 points 5 days ago Too bad it was an accident.. I like when its due to some political retribution https://rmx.news/france/french-mayor-in-support-of-new-asylum-center-in-seaside-town-has-his-house-burned-down/ permalink award report block reply\njhewish 1 points 5 days ago Fat, ugly, brown skin. Checks all the boxes. permalink award report block reply\nHankScorpio 1 points 6 days ago lol permalink award report block reply\nJustlooking250 1 points 5 days ago Womp womp FAFO she Darwin'ed her house lol permalink award report block reply\nAwShitHereWeGoAgain 1 points 6 days ago Palpatine: Ironic. permalink award report block reply\nJustlooking250 1 points 5 days ago M O R O N 🤤 permalink award report block reply\nPrandogolio 1 points 6 days ago Cool permalink award report block reply\n5DchessWatch 0 points 6 days ago When they say \"the unhoused\" they actually mean the \"unhosed\", which is really code for \"deloused\" Ok, I'll say it.  Deep down, the house they want to put them in is jail.  No projecto permalink award report block reply\nDagneyTaggart -3 points 5 days ago No doubt the perp was released before she could dial the phone to call her insurance agent. permalink award report block reply\nGwoz8881 0 points 6 days ago Comment removed by community moderators. permalink award report block reply"
}