{
  "id": "1ARK9mHVrF",
  "url": "https://patriots.win/p/1ARK9mHVrF/on-the-h1b-topic\n\nlaura-we-have-/c",
  "content": "62 On the H1B topic\n\nLaura: We have plenty of talented people in America\nTrump: No, we don't, No, we don't\n\nWTF Trump, get you act together. AMERICA FIRST! posted 12 hours ago by HenkZeilstra 9 comments award share report block\n9 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno TheGreenDragon 4 points 12 hours ago This pissed me off how he answered this. permalink award report block reply 13MMshooter 3 points 12 hours ago You trying to lose bud? permalink award report block reply jonnyuno 2 points 12 hours ago Granted, we have a lot of lazy welfare people here in the needed generation.  But the answer is not this!  But rather ripping free life away from these people and training Ameeicans to do these jobs. permalink award report block reply NotYourMan 1 points 11 hours ago We need to bring the cost of an H1B-visa employee above an American in the same job.  Make the H1B-visa employee be more expensive than an American per year, every year.  This does two things.  First it encourages companies to truly hire the best from outside the US because now they are hiring some really stupid people because they are cheaper.  Second it employees GenZ and this is the problem with 2026 and 2028. permalink award report block reply FUSnowflake 1 points 10 hours ago Abolish the H1-B and start paying reparations to white men:  expropriated from the personal fortunes of GatesofHell, Fuckerberg, Bozos, and the others. permalink parent award report block reply RudeFrog 1 points 9 hours ago This was just too much for me permalink award report block reply Greenhills 1 points 10 hours ago Huge mistake permalink award report block reply SuperDuperBasedMD -2 points 12 hours ago Keep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply BotFinder 1 points 8 hours ago This is a bot permalink parent award report block reply\nTheGreenDragon 4 points 12 hours ago This pissed me off how he answered this. permalink award report block reply\n13MMshooter 3 points 12 hours ago You trying to lose bud? permalink award report block reply\njonnyuno 2 points 12 hours ago Granted, we have a lot of lazy welfare people here in the needed generation.  But the answer is not this!  But rather ripping free life away from these people and training Ameeicans to do these jobs. permalink award report block reply\nNotYourMan 1 points 11 hours ago We need to bring the cost of an H1B-visa employee above an American in the same job.  Make the H1B-visa employee be more expensive than an American per year, every year.  This does two things.  First it encourages companies to truly hire the best from outside the US because now they are hiring some really stupid people because they are cheaper.  Second it employees GenZ and this is the problem with 2026 and 2028. permalink award report block reply FUSnowflake 1 points 10 hours ago Abolish the H1-B and start paying reparations to white men:  expropriated from the personal fortunes of GatesofHell, Fuckerberg, Bozos, and the others. permalink parent award report block reply\nFUSnowflake 1 points 10 hours ago Abolish the H1-B and start paying reparations to white men:  expropriated from the personal fortunes of GatesofHell, Fuckerberg, Bozos, and the others. permalink parent award report block reply\nRudeFrog 1 points 9 hours ago This was just too much for me permalink award report block reply\nGreenhills 1 points 10 hours ago Huge mistake permalink award report block reply\nSuperDuperBasedMD -2 points 12 hours ago Keep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply BotFinder 1 points 8 hours ago This is a bot permalink parent award report block reply\nBotFinder 1 points 8 hours ago This is a bot permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:28:14.330837Z"
}