{
  "id": "1ARK9nPdKP",
  "url": "https://patriots.win/p/1ARK9nPdKP/zerohedge--openai-ordered-to-pro/c",
  "content": "668 Zerohedge : OpenAI Ordered To Produce 20 Million User Conversations To NY Times (www.zerohedge.com) posted 4 hours ago by IlhansBrother 101 comments award share report block OpenAI Ordered To Produce 20 Million User Conversations To NY Times ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero www.zerohedge.com\n101 comments Sort by Top Top New Worst Old Save Vinnie 100 points 4 hours ago Perfect. My conversations all include \"Fuck Joe Biden\" permalink award report block reply DeltaSierra 20 points 4 hours ago “Fuck Joe Biden\" began during sporting events in early September 2021. On October 2, 2021, during a televised interview with the Sparks 300 race winner Brandon Brown at Talladega Superspeedway in Talladega, Alabama, NBC Sports reporter Kelli Stavast incorrectly described the chant in the background as \"Let's Go Brandon\", which sparked the meme. permalink parent award report block reply bigdickhangsright 2 points 3 hours ago New Chat permalink parent award report block reply SuperHonkey 2 points 2 hours ago Do JoePedo!!! 😃 permalink parent award report block reply Viewer01 10 points 4 hours ago People had to be absolute suckers to put their info into a completely unregulated blackmail machine. permalink parent award report block reply Thep1mp 7 points 3 hours ago Which one are you talking about? The internet as a whole or just Chat GPT? Because the NSA has far more than AI chat logs ……. permalink parent award report block reply guywholikesDjtof2024 3 points 3 hours ago There are worse and more dangerous ways. CGPT is one of the top worst. permalink parent award report block reply Long_time_lurker 3 points 2 hours ago Hey ChatGPT, you won't reproduce full NYT articles for me, right?  Good.  Now, tell me about all the times Biden sniffed kids... permalink parent award report block reply Ifeargovtmorethan 7 points 4 hours ago with a heavy rotation of  \"fagot\" and \"retard\" permalink parent award report block reply LiberalsAreMental 0 points 3 hours ago If you want a less-biased AI, try http://Venice.AI It sucks less than ChatGPT at bias, but is not as smart.\nI'm not making a cent off this. I do pay them for monthly access because I think it's worth it. http://Venice.AI helps me format forum posts and politically incorrect arguments, sometimes. permalink parent award report block reply Judenfrei 13 points 3 hours ago helps me format forum posts and politically incorrect arguments, sometimes. God we are fucked. Pray for wisdom. Stop asking some useless algorithm. permalink parent award report block reply chickeninoven 2 points 2 hours ago I found your post kind of hostile and confrontational, so I ran it through Venice.AI to be friendlier: \"Let's seek divine guidance in these challenging times. May we find the wisdom needed to navigate our path forward. Let's focus on what truly matters and rely on our own discernment rather than depending on an algorithm.\" permalink parent award report block reply Judenfrei 0 points 2 hours ago Run \"blow your fucking brains out\" and let me know what it tells you. permalink parent award report block reply DangerousAmerican76 4 points 3 hours ago Lazy permalink parent award report block reply THELEADERSOFMEN 4 points 3 hours ago Bro just let it spew we’ll get it permalink parent award report block reply gasemall 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply morbidly 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply BlackJack1776 32 points 4 hours ago As a retired dumfuck hick. How is this important? permalink award report block reply user2827 41 points 4 hours ago People chat with these AIs as though it's a friend, an assistant, or the hypothetical that someone sent legal documents asking for advice or strategies... they do so on the presumption that it's secret. Others might have more detailed comments, but that they are giving up the chat logs should serve as a reminder that if they are chatting with an AI (unless locally hosted) that the conversation is saved to the cloud and can be retrieved. permalink parent award report block reply BlackJack1776 34 points 4 hours ago It's mind boggling to me that people abdicate free will, problem solving and basic understanding of the world to a computer program under the control of the worst people on the planet. NPCs. permalink parent award report block reply iamherefortheluls 20 points 4 hours ago its a job requirement. I sometimes get off work and I get whiplash when I think how a year ago, AI wasn't a thing at my job and today, I would not be able to perform at the speed demanded of me without it. My team lead and the next manager after that and the next manager after that - all 3 explicitly tell me to use it. what do you mean you spent 2 hours on this 10 page technical write up? why didn't you use AI to generate it I did. I spent half an hour generating the requirements, and than the rest to actually read it and make sure its accurate and fix the errors why wouldn't you just ask another AI to check for errors? Last year, I would get 2 days for this same task at least. So there is no free will here, you want to keep your job these days, you use it or you are literally 10 times slower than every other employee permalink parent award report block reply InfinitesimalOrange 16 points 4 hours ago \"Why don't you have a hallucinating AI check for errors\"\nWhoever you work for is a retard. permalink parent award report block reply view 4 more comments... _Sully_ 15 points 4 hours ago Yeah and you'll produce garbage if you listen to them. I of course used AI even last year to help with every tech spec I wrote. But it produces incomprehensible garbage and you have to fix it. I've already heard about a project going awry because not only did they not write it themselves, the contractor didn't fucking read it and no one knows who agreed to what. Contractors were already notorious for not reading them thoroughly but now not even the producers of the doc knows what's in it to the degree necessary to be defensible. permalink parent award report block reply view 1 more comments... papa_newguineapig 2 points 2 hours ago Pfft. I use AI to do my work, I turn it in the same amount of time as I always did, which means I've increased my rate of pay substantially. With WFH, I average about 20 hrs worked IF that per week. Life is great. I'm actually looking to take on another WFH position to double my income. AI may be useless to most people, but when you know how to prompt it, and the subject matter, where to point it etc, it's worth its weight in gold. permalink parent award report block reply RedCalifornia 3 points 1 hour ago Man’s first act of free will was to disobey god. permalink parent award report block reply user2827 3 points 55 minutes ago That's the whole trend of, iirc, vibe coding, where the programmers just get AI to write the functions for them... I occasionally will use AI to take spec documents and ask it to summarize the parts that are relevant to my scope of work, but I also learned quickly that I would need to also get it to provide page numbers or how to locate the information just to confirm because even in that request I found they would sometimes make stuff up. permalink parent award report block reply Citizen_Bob 3 points 4 hours ago Yes. You can build these systems yourself and very easily. You can even use the existing models like ChatGPT or Grok to help you do it. Out of reach for most people still but if you are smart enough to finish reading this, you're smart enough to go to Grok.com and ask it to help you install Linux. Then have it help you build your own uncensored AI (e.g., Dolphin) on your current hardware. Just go to grok.com, hit voice, explain your situation, skill level, and ask it for help with this. Watch what happens. permalink parent award report block reply papa_newguineapig 2 points 1 hour ago Yeah, its not that easy, nor is it cheap. Nice try though bud. ( IT professional with 30 years experience and can do anything electronic ) Have my own dual RTX 5080 GPU LLM farm. permalink parent award report block reply view 1 more comments... TruthyBrat 1 points 4 hours ago What's the hardware investment for something like that? permalink parent award report block reply view 7 more comments... ImYourHuckleberry24 13 points 4 hours ago You mean like all of our emails and text messages? Yeah permalink parent award report block reply hatredcopter 10 points 4 hours ago This isn't really about that though its an implication. This is about content owners trying to catch AI companies in IP theft. Industry A vs Industry B with them framing it as something we are involved in. My take is that its closest analogue is probably Net Neutrality. permalink parent award report block reply booblitchutz 2 points 3 hours ago The closest analogue is like the \"sampling\" craze in Rap. You had artists like The Dust Brothers that created all the beats behind the Beastie Boys' \"Pauls Boutique\". That entire album was a collage of samples. The landmark case was Gilbert O'Sullivan suing Biz Markie. The court ruled that a sample remained the property of the copyright owner regardless of the duration of it. That is legal precedent here, for sure. And music is also part of what AI is trained on. Also movies, TV, all kinds of material written on the internet, books, youtube videos, you name it. permalink parent award report block reply hatredcopter 1 points 3 hours ago Oh I mean sure that's probably the most direct legal precedent for the case itself. What I was getting at is a bunch of press on both sides representing Industry A and Industry B as if it affects the public positively or negatively, when what is actually going to happen will probably be settlements or regulation that affects the industry and not the public whatsoever. permalink parent award report block reply user2827 1 points 47 minutes ago Oh, yes, this seems more what the lawsuit was about, I was thinking more in terms of what the problem is.... permalink parent award report block reply booblitchutz 1 points 3 hours ago Sure, the privacy concerns are there, but that's not the point here. The point is this is a legal vector that could pretty much end all AI platforms as we know it. permalink parent award report block reply Judenfrei 1 points 3 hours ago The point is this is a legal vector that could pretty much end all AI platforms as we know it. This would be great news. permalink parent award report block reply booblitchutz 4 points 3 hours ago I kind of agree, honestly. But alas, I think this shit is too big to fail at this point. I think if our legal system worked properly, OpenAI would be sued into oblivion, but there's so much money tied up in AI right now that our legal system will probably not upset the apple cart. permalink parent award report block reply Judenfrei 2 points 2 hours ago Matthew 17:19-20 ESV https://biblehub.com/esv/matthew/17.htm 19 Then the disciples came to Jesus privately and said, “Why could we not cast it out?” 20 He said to them, “Because of your little faith. For truly, I say to you, if you have faith like a grain of mustard seed, you will say to this mountain, ‘Move from here to there,’ and it will move, and nothing will be impossible for you.”e permalink parent award report block reply IlhansBrother OP 15 points 4 hours ago They will hand over your private conversations to Marxist activists permalink parent award report block reply booblitchutz 3 points 3 hours ago That's not really the point here. permalink parent award report block reply RedStoneDeepState 4 points 3 hours ago I have seen 4 people get fired for feeding DoD CUI into ChatGPT. That is the people that got caught. permalink parent award report block reply BlackJack1776 4 points 3 hours ago Okay. This makes the whole thing important. Feeding Confidential info into a shady data base, with a fancy algorithm, under the control of various horrible people is a worthy concern. Thanks for that perspective. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 hours ago How were they caught? permalink parent award report block reply RedStoneDeepState 3 points 2 hours ago Sending CUI from their work email to a personal email on the work laptop or bypassing security filters to run ChatGPT on the work laptop. Guess the skin color. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 hours ago Without admin rights, how would they bypass security on their .gov laptops? So they were busted for sending CUI to themselves, or using GPT specifically? permalink parent award report block reply view 1 more comments... Citizen_Bob 3 points 4 hours ago It's a massive violation of people's privacy rights. NYT will have intimate details of everything from business ideas to extreme trauma from someone's past. ToS surely tells people this is a potential outcome, so OpenAI will not be a party to that rights violation. Except they enabled it by not anonymizing users because they're ghoulish fuckheads with no civic morals. What this means is your person and effects can be transferred around by the state at the whim of some faggot judge and creepy lawyers working for one of your main political adversaries. permalink parent award report block reply B-2StealthTrump 2 points 2 hours ago NYT?  You misspelled CIA. permalink parent award report block reply iamherefortheluls 2 points 4 hours ago lots of idiots assume their AI conversations are not being recorded. Can't imagine how or why anyone might think that, but apparently its a thing. permalink parent award report block reply load 5 more comments... basedboston 22 points 4 hours ago New York Magistrate Judge Ona T. Wang .... No way. permalink award report block reply TheTelltaleFly 15 points 4 hours ago Unrelated, I think we should definitely bring in more Chinese students. It’s going great so far. permalink parent award report block reply nmipede 1 points 3 hours ago Beat me to this by an hour. GMTA. Heh-heh-heh yousaidonawang heh-heh-hehehehe-heh permalink parent award report block reply DemPanicAtTheDisco 16 points 4 hours ago Dumb pin. It's about data scraping. permalink award report block reply booblitchutz 0 points 3 hours ago NYT has a strong case with legal precedent. This has the potential to end AI platforms. permalink parent award report block reply DemPanicAtTheDisco 5 points 3 hours ago This has the potential to end AI platforms. No, it has the potential to change what sources LLMs are trained on for free moving forward. Worst case scenario some sites choose to opt out while others take payment for direct scraping from these companies. That will only create boutique scraping companies operating from other jurisdictions where they don't have to worry about litigation where they will operate as data brokers. This is just certain corporations trying to protect their own data from being used.... for free. It doesn't negate the years worth of data scraping that's already happened and been used to train these AI models. They aren't going to be forced to \"unlearn\" anything. permalink parent award report block reply booblitchutz 0 points 2 hours ago Of course they can be forced to \"unlearn\". Even if something is freely available on the internet, it doesn't mean it's not copyright protected, which means you can't just republish it as your own without permission from the copyright owner. permalink parent award report block reply DemPanicAtTheDisco 2 points 2 hours ago Lol you can't put the genie back in the bottle dude. You making category errors like \"you can't just republish it as your own\" clearly shows you don't have a grasp on what LLMs are doing and what the issue is. It's not republishing... It's training When I read a book and learn from it I'm not violating copyright laws even if I write a book report on it. If you think the courts can effectively get something removed from the Internet and AI companies worldwide then you need a reality check. AI companies are all over the world in different countries and jurisdictions. The Streisand effect would like a word - https://en.wikipedia.org/wiki/Streisand_effect Courts also made piracy illegal.... In most countries and yet it flourishes. permalink parent award report block reply Citizen_Bob 16 points 4 hours ago open isn't open and they are not private. neither is X but they do anonymize for their own purposes. you have to dump your data from chat and then 30 days it expunges. or use private and it will expunge immediately. permalink award report block reply HeinzHummer 7 points 4 hours ago I like to ask AI statistical questions that causes it to generate bullshit contextual summaries to discredit the real numbers. permalink award report block reply Zskills 4 points 3 hours ago Minorities commit more crime because they are poor but also they commit more crime than whites even when they make the same amount of money. They commit more crime because of discrimination but their crime rates are similar no matter what country you look at. Etc. AI is useless for discussions about statistics.  You are ALWAYS missing context no matter how many times you corner it. permalink parent award report block reply MoldyLocksNesMonste 4 points 2 hours ago \"Hey, I want to caution you. You are using charged language that is damaging to vulnerable communities\" permalink parent award report block reply DangerousAmerican76 6 points 3 hours ago AI is making us lazy and stupid And the people who build, make, maintain, program AI are all trained and educated at captive academia collectives, so it hates whites and tells lies I’m a millwright so it will be some time before they replace me but if you work in an office yeah I’d worry permalink award report block reply savman 5 points 4 hours ago AI Agents are an extension of human coders.  If I read a NYT article, have a photographic memory, or use a screen reader and tell my friends what I read, how can this be considered any different? permalink award report block reply booblitchutz 2 points 3 hours ago If you have a subscription to NYT and you read an article from behind their paywall you don't own the article and you can't republish it.  When you buy a CD you don't own the songs. You own a licensed copy of the recording of the song. You cant rebroadcast the song yourself, even if you don't profit from it. AI doesn't read an article and learn like we do, it is fed the article which it keeps in it's storage and then when you ask a question that is related to said article, it uses that article to generate a response either in part or in whole. But courts have ruled that copyright owners have a right to their material regardless of the duration of the sample used by someone else. permalink parent award report block reply B-2StealthTrump 3 points 2 hours ago Since we know corps/orgs like NYT don’t give a damn about anyone’s privacy (except their own), is this just a money grab by NYT and lawyers with $’s in their eyes?  If so, thousands of other corps/orgs will follow suit, which would bankrupt OpenAI, which the govt won’t allow to happen, which is why I think this goes nowhere. permalink parent award report block reply SavingPrivateGrace 4 points 3 hours ago The NYT was used to train AI and they want compensation for that because when they use AI, they are essentially getting fed back their waste along with some other byproducts.  Maybe they should be paid.  Training AI was not a contract, it was a friend taking advantage of you by going to another important business owner and telling them 'I am a friend of so and so', using that clout to get something in return...and then not share that with the friend.  Whatever, I don't know why I figured this out.  AI is not my friend. permalink award report block reply JimRaynor 4 points 4 hours ago Se must hang these crazy maniac judges. Anonymuse 20 million user conversations from around the wrold (with GDPR etc) in 2 days, safely, and hand it over to fake news democrat media? That's impossible single mistak could open ai to trillion dollar privacy lawsuits and tank its stock We must kill these marxist judges. they wont stop permalink award report block reply Gmb576 3 points 3 hours ago All this will be right wing dissident conversations which will be sent to taxpayer funded NGOs for opposition research. Lawfare prosecutors will have this, know what to look for, and use parallel construction techniques to hide abuse. This appears to be the point of this suit, a legitimized handover of sensative data. permalink award report block reply cross_bearer_02 3 points 3 hours ago Oh no! They will discover all of my battle plans and wartime strategic planning and troop advancement. Won't help them overthrow a nation. Might help 'em play a good game of Final Fantasy Tactics , though. permalink award report block reply schism 2 points 3 hours ago \"NY Magistrate Judge Ona T. Wang\" permalink award report block reply InfinitesimalOrange 2 points 4 hours ago What I see is: New York Times is developing their own ai and they want to train it on chatGPT conversations. Lmao, grifters. permalink award report block reply Eric42 2 points 3 hours ago \"Ordered\" to produce 20 million user conversations to \"NY Times\"????  We are losing -_- permalink award report block reply rebuildingMyself 2 points 4 hours ago Never, ever, assume what you say on any cloud-based service is private. I don't care how many ways they encrypt it. Not even the algorithms with a private key you store yourself. Always assume everything you say or store could eventually be read back out to you in some kangaroo court a decade from now if you get too much on the wrong radars. permalink award report block reply RealTXPatriot 2 points 3 hours ago Funniest shit over this is the fact I have a whole Google account I use for spam bullshit and signing up for these services... So my Google account i created for these interactions has done nothing but research the oddest shit you've ever imagined. One day they'll go through it and shit themselves permalink award report block reply mygovisacommie 2 points 4 hours ago I propose that any information taken from NYT used in training actually produced negative value by fucking up actual information with propaganda, so the outcome should be the NYT has to pay OpenAI for damages caused. permalink award report block reply nod32 1 points 1 hour ago uh Oh, gotta delete all the 6mil calculations permalink award report block reply Wtf_socialismreally 1 points 2 hours ago Why are they ordered to give it to the media? How does that make sense? Is it because it's taking data from NYT? Welcome to search engines. permalink award report block reply Jack_NC 1 points 4 hours ago And we don't think that Google doesn't keep (and sell? use?) google search info? The potential for industrial espionage is huge. Knowing what a person, or company, or government agent is searching for is very valuable. permalink award report block reply tw0scoops 1 points 2 hours ago I dont see how 20 million user conversations are relevant to the case. Its also ironic considering that AI will be used to scrape the data bc 20 million data points....... good luck.  Its retarded,  they ll be able to cherry pick, infer, and argue whatever the hell they want with a set that large. permalink award report block reply OkieDoker 1 points 3 hours ago I used chatgpt as a sounding board going through my divorce process. It was helpful tbh permalink award report block reply Xahnel 1 points 3 hours ago find yourself an AI that stores your chats in localStorage permalink award report block reply Desensitized 1 points 3 hours ago Can't they just ask the AI to sort out what's necessary for the case for them?  >_> permalink award report block reply CocaineNewsome 1 points 3 hours ago Cloud based AI is bad like that. Run your own or go home. A lot of people put their deepest thoughts in that machine. permalink award report block reply booblitchutz 1 points 3 hours ago It really was only a matter of time before all these AI companies were sued for copyright infringement. AI isn't \"intelligence\", it's just what other people have said already, re-formed based on models. It's not just text, it's imagery, music, movies. The avalanche of lawsuits over this should be enough to wipe them out and render their platforms useless. permalink award report block reply Mhmm2MoreWeeks 1 points 2 hours ago *Shrugs so. permalink award report block reply\nVinnie 100 points 4 hours ago Perfect. My conversations all include \"Fuck Joe Biden\" permalink award report block reply DeltaSierra 20 points 4 hours ago “Fuck Joe Biden\" began during sporting events in early September 2021. On October 2, 2021, during a televised interview with the Sparks 300 race winner Brandon Brown at Talladega Superspeedway in Talladega, Alabama, NBC Sports reporter Kelli Stavast incorrectly described the chant in the background as \"Let's Go Brandon\", which sparked the meme. permalink parent award report block reply bigdickhangsright 2 points 3 hours ago New Chat permalink parent award report block reply SuperHonkey 2 points 2 hours ago Do JoePedo!!! 😃 permalink parent award report block reply Viewer01 10 points 4 hours ago People had to be absolute suckers to put their info into a completely unregulated blackmail machine. permalink parent award report block reply Thep1mp 7 points 3 hours ago Which one are you talking about? The internet as a whole or just Chat GPT? Because the NSA has far more than AI chat logs ……. permalink parent award report block reply guywholikesDjtof2024 3 points 3 hours ago There are worse and more dangerous ways. CGPT is one of the top worst. permalink parent award report block reply Long_time_lurker 3 points 2 hours ago Hey ChatGPT, you won't reproduce full NYT articles for me, right?  Good.  Now, tell me about all the times Biden sniffed kids... permalink parent award report block reply Ifeargovtmorethan 7 points 4 hours ago with a heavy rotation of  \"fagot\" and \"retard\" permalink parent award report block reply LiberalsAreMental 0 points 3 hours ago If you want a less-biased AI, try http://Venice.AI It sucks less than ChatGPT at bias, but is not as smart.\nI'm not making a cent off this. I do pay them for monthly access because I think it's worth it. http://Venice.AI helps me format forum posts and politically incorrect arguments, sometimes. permalink parent award report block reply Judenfrei 13 points 3 hours ago helps me format forum posts and politically incorrect arguments, sometimes. God we are fucked. Pray for wisdom. Stop asking some useless algorithm. permalink parent award report block reply chickeninoven 2 points 2 hours ago I found your post kind of hostile and confrontational, so I ran it through Venice.AI to be friendlier: \"Let's seek divine guidance in these challenging times. May we find the wisdom needed to navigate our path forward. Let's focus on what truly matters and rely on our own discernment rather than depending on an algorithm.\" permalink parent award report block reply Judenfrei 0 points 2 hours ago Run \"blow your fucking brains out\" and let me know what it tells you. permalink parent award report block reply DangerousAmerican76 4 points 3 hours ago Lazy permalink parent award report block reply THELEADERSOFMEN 4 points 3 hours ago Bro just let it spew we’ll get it permalink parent award report block reply gasemall 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply morbidly 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nDeltaSierra 20 points 4 hours ago “Fuck Joe Biden\" began during sporting events in early September 2021. On October 2, 2021, during a televised interview with the Sparks 300 race winner Brandon Brown at Talladega Superspeedway in Talladega, Alabama, NBC Sports reporter Kelli Stavast incorrectly described the chant in the background as \"Let's Go Brandon\", which sparked the meme. permalink parent award report block reply bigdickhangsright 2 points 3 hours ago New Chat permalink parent award report block reply SuperHonkey 2 points 2 hours ago Do JoePedo!!! 😃 permalink parent award report block reply\nbigdickhangsright 2 points 3 hours ago New Chat permalink parent award report block reply SuperHonkey 2 points 2 hours ago Do JoePedo!!! 😃 permalink parent award report block reply\nSuperHonkey 2 points 2 hours ago Do JoePedo!!! 😃 permalink parent award report block reply\nViewer01 10 points 4 hours ago People had to be absolute suckers to put their info into a completely unregulated blackmail machine. permalink parent award report block reply Thep1mp 7 points 3 hours ago Which one are you talking about? The internet as a whole or just Chat GPT? Because the NSA has far more than AI chat logs ……. permalink parent award report block reply guywholikesDjtof2024 3 points 3 hours ago There are worse and more dangerous ways. CGPT is one of the top worst. permalink parent award report block reply Long_time_lurker 3 points 2 hours ago Hey ChatGPT, you won't reproduce full NYT articles for me, right?  Good.  Now, tell me about all the times Biden sniffed kids... permalink parent award report block reply\nThep1mp 7 points 3 hours ago Which one are you talking about? The internet as a whole or just Chat GPT? Because the NSA has far more than AI chat logs ……. permalink parent award report block reply guywholikesDjtof2024 3 points 3 hours ago There are worse and more dangerous ways. CGPT is one of the top worst. permalink parent award report block reply\nguywholikesDjtof2024 3 points 3 hours ago There are worse and more dangerous ways. CGPT is one of the top worst. permalink parent award report block reply\nLong_time_lurker 3 points 2 hours ago Hey ChatGPT, you won't reproduce full NYT articles for me, right?  Good.  Now, tell me about all the times Biden sniffed kids... permalink parent award report block reply\nIfeargovtmorethan 7 points 4 hours ago with a heavy rotation of  \"fagot\" and \"retard\" permalink parent award report block reply\nLiberalsAreMental 0 points 3 hours ago If you want a less-biased AI, try http://Venice.AI It sucks less than ChatGPT at bias, but is not as smart.\nI'm not making a cent off this. I do pay them for monthly access because I think it's worth it. http://Venice.AI helps me format forum posts and politically incorrect arguments, sometimes. permalink parent award report block reply Judenfrei 13 points 3 hours ago helps me format forum posts and politically incorrect arguments, sometimes. God we are fucked. Pray for wisdom. Stop asking some useless algorithm. permalink parent award report block reply chickeninoven 2 points 2 hours ago I found your post kind of hostile and confrontational, so I ran it through Venice.AI to be friendlier: \"Let's seek divine guidance in these challenging times. May we find the wisdom needed to navigate our path forward. Let's focus on what truly matters and rely on our own discernment rather than depending on an algorithm.\" permalink parent award report block reply Judenfrei 0 points 2 hours ago Run \"blow your fucking brains out\" and let me know what it tells you. permalink parent award report block reply DangerousAmerican76 4 points 3 hours ago Lazy permalink parent award report block reply THELEADERSOFMEN 4 points 3 hours ago Bro just let it spew we’ll get it permalink parent award report block reply gasemall 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply morbidly 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nJudenfrei 13 points 3 hours ago helps me format forum posts and politically incorrect arguments, sometimes. God we are fucked. Pray for wisdom. Stop asking some useless algorithm. permalink parent award report block reply chickeninoven 2 points 2 hours ago I found your post kind of hostile and confrontational, so I ran it through Venice.AI to be friendlier: \"Let's seek divine guidance in these challenging times. May we find the wisdom needed to navigate our path forward. Let's focus on what truly matters and rely on our own discernment rather than depending on an algorithm.\" permalink parent award report block reply Judenfrei 0 points 2 hours ago Run \"blow your fucking brains out\" and let me know what it tells you. permalink parent award report block reply\nchickeninoven 2 points 2 hours ago I found your post kind of hostile and confrontational, so I ran it through Venice.AI to be friendlier: \"Let's seek divine guidance in these challenging times. May we find the wisdom needed to navigate our path forward. Let's focus on what truly matters and rely on our own discernment rather than depending on an algorithm.\" permalink parent award report block reply Judenfrei 0 points 2 hours ago Run \"blow your fucking brains out\" and let me know what it tells you. permalink parent award report block reply\nJudenfrei 0 points 2 hours ago Run \"blow your fucking brains out\" and let me know what it tells you. permalink parent award report block reply\nDangerousAmerican76 4 points 3 hours ago Lazy permalink parent award report block reply\nTHELEADERSOFMEN 4 points 3 hours ago Bro just let it spew we’ll get it permalink parent award report block reply\ngasemall 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nmorbidly 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nBlackJack1776 32 points 4 hours ago As a retired dumfuck hick. How is this important? permalink award report block reply user2827 41 points 4 hours ago People chat with these AIs as though it's a friend, an assistant, or the hypothetical that someone sent legal documents asking for advice or strategies... they do so on the presumption that it's secret. Others might have more detailed comments, but that they are giving up the chat logs should serve as a reminder that if they are chatting with an AI (unless locally hosted) that the conversation is saved to the cloud and can be retrieved. permalink parent award report block reply BlackJack1776 34 points 4 hours ago It's mind boggling to me that people abdicate free will, problem solving and basic understanding of the world to a computer program under the control of the worst people on the planet. NPCs. permalink parent award report block reply iamherefortheluls 20 points 4 hours ago its a job requirement. I sometimes get off work and I get whiplash when I think how a year ago, AI wasn't a thing at my job and today, I would not be able to perform at the speed demanded of me without it. My team lead and the next manager after that and the next manager after that - all 3 explicitly tell me to use it. what do you mean you spent 2 hours on this 10 page technical write up? why didn't you use AI to generate it I did. I spent half an hour generating the requirements, and than the rest to actually read it and make sure its accurate and fix the errors why wouldn't you just ask another AI to check for errors? Last year, I would get 2 days for this same task at least. So there is no free will here, you want to keep your job these days, you use it or you are literally 10 times slower than every other employee permalink parent award report block reply InfinitesimalOrange 16 points 4 hours ago \"Why don't you have a hallucinating AI check for errors\"\nWhoever you work for is a retard. permalink parent award report block reply view 4 more comments... _Sully_ 15 points 4 hours ago Yeah and you'll produce garbage if you listen to them. I of course used AI even last year to help with every tech spec I wrote. But it produces incomprehensible garbage and you have to fix it. I've already heard about a project going awry because not only did they not write it themselves, the contractor didn't fucking read it and no one knows who agreed to what. Contractors were already notorious for not reading them thoroughly but now not even the producers of the doc knows what's in it to the degree necessary to be defensible. permalink parent award report block reply view 1 more comments... papa_newguineapig 2 points 2 hours ago Pfft. I use AI to do my work, I turn it in the same amount of time as I always did, which means I've increased my rate of pay substantially. With WFH, I average about 20 hrs worked IF that per week. Life is great. I'm actually looking to take on another WFH position to double my income. AI may be useless to most people, but when you know how to prompt it, and the subject matter, where to point it etc, it's worth its weight in gold. permalink parent award report block reply RedCalifornia 3 points 1 hour ago Man’s first act of free will was to disobey god. permalink parent award report block reply user2827 3 points 55 minutes ago That's the whole trend of, iirc, vibe coding, where the programmers just get AI to write the functions for them... I occasionally will use AI to take spec documents and ask it to summarize the parts that are relevant to my scope of work, but I also learned quickly that I would need to also get it to provide page numbers or how to locate the information just to confirm because even in that request I found they would sometimes make stuff up. permalink parent award report block reply Citizen_Bob 3 points 4 hours ago Yes. You can build these systems yourself and very easily. You can even use the existing models like ChatGPT or Grok to help you do it. Out of reach for most people still but if you are smart enough to finish reading this, you're smart enough to go to Grok.com and ask it to help you install Linux. Then have it help you build your own uncensored AI (e.g., Dolphin) on your current hardware. Just go to grok.com, hit voice, explain your situation, skill level, and ask it for help with this. Watch what happens. permalink parent award report block reply papa_newguineapig 2 points 1 hour ago Yeah, its not that easy, nor is it cheap. Nice try though bud. ( IT professional with 30 years experience and can do anything electronic ) Have my own dual RTX 5080 GPU LLM farm. permalink parent award report block reply view 1 more comments... TruthyBrat 1 points 4 hours ago What's the hardware investment for something like that? permalink parent award report block reply view 7 more comments... ImYourHuckleberry24 13 points 4 hours ago You mean like all of our emails and text messages? Yeah permalink parent award report block reply hatredcopter 10 points 4 hours ago This isn't really about that though its an implication. This is about content owners trying to catch AI companies in IP theft. Industry A vs Industry B with them framing it as something we are involved in. My take is that its closest analogue is probably Net Neutrality. permalink parent award report block reply booblitchutz 2 points 3 hours ago The closest analogue is like the \"sampling\" craze in Rap. You had artists like The Dust Brothers that created all the beats behind the Beastie Boys' \"Pauls Boutique\". That entire album was a collage of samples. The landmark case was Gilbert O'Sullivan suing Biz Markie. The court ruled that a sample remained the property of the copyright owner regardless of the duration of it. That is legal precedent here, for sure. And music is also part of what AI is trained on. Also movies, TV, all kinds of material written on the internet, books, youtube videos, you name it. permalink parent award report block reply hatredcopter 1 points 3 hours ago Oh I mean sure that's probably the most direct legal precedent for the case itself. What I was getting at is a bunch of press on both sides representing Industry A and Industry B as if it affects the public positively or negatively, when what is actually going to happen will probably be settlements or regulation that affects the industry and not the public whatsoever. permalink parent award report block reply user2827 1 points 47 minutes ago Oh, yes, this seems more what the lawsuit was about, I was thinking more in terms of what the problem is.... permalink parent award report block reply booblitchutz 1 points 3 hours ago Sure, the privacy concerns are there, but that's not the point here. The point is this is a legal vector that could pretty much end all AI platforms as we know it. permalink parent award report block reply Judenfrei 1 points 3 hours ago The point is this is a legal vector that could pretty much end all AI platforms as we know it. This would be great news. permalink parent award report block reply booblitchutz 4 points 3 hours ago I kind of agree, honestly. But alas, I think this shit is too big to fail at this point. I think if our legal system worked properly, OpenAI would be sued into oblivion, but there's so much money tied up in AI right now that our legal system will probably not upset the apple cart. permalink parent award report block reply Judenfrei 2 points 2 hours ago Matthew 17:19-20 ESV https://biblehub.com/esv/matthew/17.htm 19 Then the disciples came to Jesus privately and said, “Why could we not cast it out?” 20 He said to them, “Because of your little faith. For truly, I say to you, if you have faith like a grain of mustard seed, you will say to this mountain, ‘Move from here to there,’ and it will move, and nothing will be impossible for you.”e permalink parent award report block reply IlhansBrother OP 15 points 4 hours ago They will hand over your private conversations to Marxist activists permalink parent award report block reply booblitchutz 3 points 3 hours ago That's not really the point here. permalink parent award report block reply RedStoneDeepState 4 points 3 hours ago I have seen 4 people get fired for feeding DoD CUI into ChatGPT. That is the people that got caught. permalink parent award report block reply BlackJack1776 4 points 3 hours ago Okay. This makes the whole thing important. Feeding Confidential info into a shady data base, with a fancy algorithm, under the control of various horrible people is a worthy concern. Thanks for that perspective. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 hours ago How were they caught? permalink parent award report block reply RedStoneDeepState 3 points 2 hours ago Sending CUI from their work email to a personal email on the work laptop or bypassing security filters to run ChatGPT on the work laptop. Guess the skin color. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 hours ago Without admin rights, how would they bypass security on their .gov laptops? So they were busted for sending CUI to themselves, or using GPT specifically? permalink parent award report block reply view 1 more comments... Citizen_Bob 3 points 4 hours ago It's a massive violation of people's privacy rights. NYT will have intimate details of everything from business ideas to extreme trauma from someone's past. ToS surely tells people this is a potential outcome, so OpenAI will not be a party to that rights violation. Except they enabled it by not anonymizing users because they're ghoulish fuckheads with no civic morals. What this means is your person and effects can be transferred around by the state at the whim of some faggot judge and creepy lawyers working for one of your main political adversaries. permalink parent award report block reply B-2StealthTrump 2 points 2 hours ago NYT?  You misspelled CIA. permalink parent award report block reply iamherefortheluls 2 points 4 hours ago lots of idiots assume their AI conversations are not being recorded. Can't imagine how or why anyone might think that, but apparently its a thing. permalink parent award report block reply load 5 more comments...\nuser2827 41 points 4 hours ago People chat with these AIs as though it's a friend, an assistant, or the hypothetical that someone sent legal documents asking for advice or strategies... they do so on the presumption that it's secret. Others might have more detailed comments, but that they are giving up the chat logs should serve as a reminder that if they are chatting with an AI (unless locally hosted) that the conversation is saved to the cloud and can be retrieved. permalink parent award report block reply BlackJack1776 34 points 4 hours ago It's mind boggling to me that people abdicate free will, problem solving and basic understanding of the world to a computer program under the control of the worst people on the planet. NPCs. permalink parent award report block reply iamherefortheluls 20 points 4 hours ago its a job requirement. I sometimes get off work and I get whiplash when I think how a year ago, AI wasn't a thing at my job and today, I would not be able to perform at the speed demanded of me without it. My team lead and the next manager after that and the next manager after that - all 3 explicitly tell me to use it. what do you mean you spent 2 hours on this 10 page technical write up? why didn't you use AI to generate it I did. I spent half an hour generating the requirements, and than the rest to actually read it and make sure its accurate and fix the errors why wouldn't you just ask another AI to check for errors? Last year, I would get 2 days for this same task at least. So there is no free will here, you want to keep your job these days, you use it or you are literally 10 times slower than every other employee permalink parent award report block reply InfinitesimalOrange 16 points 4 hours ago \"Why don't you have a hallucinating AI check for errors\"\nWhoever you work for is a retard. permalink parent award report block reply view 4 more comments... _Sully_ 15 points 4 hours ago Yeah and you'll produce garbage if you listen to them. I of course used AI even last year to help with every tech spec I wrote. But it produces incomprehensible garbage and you have to fix it. I've already heard about a project going awry because not only did they not write it themselves, the contractor didn't fucking read it and no one knows who agreed to what. Contractors were already notorious for not reading them thoroughly but now not even the producers of the doc knows what's in it to the degree necessary to be defensible. permalink parent award report block reply view 1 more comments... papa_newguineapig 2 points 2 hours ago Pfft. I use AI to do my work, I turn it in the same amount of time as I always did, which means I've increased my rate of pay substantially. With WFH, I average about 20 hrs worked IF that per week. Life is great. I'm actually looking to take on another WFH position to double my income. AI may be useless to most people, but when you know how to prompt it, and the subject matter, where to point it etc, it's worth its weight in gold. permalink parent award report block reply RedCalifornia 3 points 1 hour ago Man’s first act of free will was to disobey god. permalink parent award report block reply user2827 3 points 55 minutes ago That's the whole trend of, iirc, vibe coding, where the programmers just get AI to write the functions for them... I occasionally will use AI to take spec documents and ask it to summarize the parts that are relevant to my scope of work, but I also learned quickly that I would need to also get it to provide page numbers or how to locate the information just to confirm because even in that request I found they would sometimes make stuff up. permalink parent award report block reply Citizen_Bob 3 points 4 hours ago Yes. You can build these systems yourself and very easily. You can even use the existing models like ChatGPT or Grok to help you do it. Out of reach for most people still but if you are smart enough to finish reading this, you're smart enough to go to Grok.com and ask it to help you install Linux. Then have it help you build your own uncensored AI (e.g., Dolphin) on your current hardware. Just go to grok.com, hit voice, explain your situation, skill level, and ask it for help with this. Watch what happens. permalink parent award report block reply papa_newguineapig 2 points 1 hour ago Yeah, its not that easy, nor is it cheap. Nice try though bud. ( IT professional with 30 years experience and can do anything electronic ) Have my own dual RTX 5080 GPU LLM farm. permalink parent award report block reply view 1 more comments... TruthyBrat 1 points 4 hours ago What's the hardware investment for something like that? permalink parent award report block reply view 7 more comments... ImYourHuckleberry24 13 points 4 hours ago You mean like all of our emails and text messages? Yeah permalink parent award report block reply hatredcopter 10 points 4 hours ago This isn't really about that though its an implication. This is about content owners trying to catch AI companies in IP theft. Industry A vs Industry B with them framing it as something we are involved in. My take is that its closest analogue is probably Net Neutrality. permalink parent award report block reply booblitchutz 2 points 3 hours ago The closest analogue is like the \"sampling\" craze in Rap. You had artists like The Dust Brothers that created all the beats behind the Beastie Boys' \"Pauls Boutique\". That entire album was a collage of samples. The landmark case was Gilbert O'Sullivan suing Biz Markie. The court ruled that a sample remained the property of the copyright owner regardless of the duration of it. That is legal precedent here, for sure. And music is also part of what AI is trained on. Also movies, TV, all kinds of material written on the internet, books, youtube videos, you name it. permalink parent award report block reply hatredcopter 1 points 3 hours ago Oh I mean sure that's probably the most direct legal precedent for the case itself. What I was getting at is a bunch of press on both sides representing Industry A and Industry B as if it affects the public positively or negatively, when what is actually going to happen will probably be settlements or regulation that affects the industry and not the public whatsoever. permalink parent award report block reply user2827 1 points 47 minutes ago Oh, yes, this seems more what the lawsuit was about, I was thinking more in terms of what the problem is.... permalink parent award report block reply booblitchutz 1 points 3 hours ago Sure, the privacy concerns are there, but that's not the point here. The point is this is a legal vector that could pretty much end all AI platforms as we know it. permalink parent award report block reply Judenfrei 1 points 3 hours ago The point is this is a legal vector that could pretty much end all AI platforms as we know it. This would be great news. permalink parent award report block reply booblitchutz 4 points 3 hours ago I kind of agree, honestly. But alas, I think this shit is too big to fail at this point. I think if our legal system worked properly, OpenAI would be sued into oblivion, but there's so much money tied up in AI right now that our legal system will probably not upset the apple cart. permalink parent award report block reply Judenfrei 2 points 2 hours ago Matthew 17:19-20 ESV https://biblehub.com/esv/matthew/17.htm 19 Then the disciples came to Jesus privately and said, “Why could we not cast it out?” 20 He said to them, “Because of your little faith. For truly, I say to you, if you have faith like a grain of mustard seed, you will say to this mountain, ‘Move from here to there,’ and it will move, and nothing will be impossible for you.”e permalink parent award report block reply\nBlackJack1776 34 points 4 hours ago It's mind boggling to me that people abdicate free will, problem solving and basic understanding of the world to a computer program under the control of the worst people on the planet. NPCs. permalink parent award report block reply iamherefortheluls 20 points 4 hours ago its a job requirement. I sometimes get off work and I get whiplash when I think how a year ago, AI wasn't a thing at my job and today, I would not be able to perform at the speed demanded of me without it. My team lead and the next manager after that and the next manager after that - all 3 explicitly tell me to use it. what do you mean you spent 2 hours on this 10 page technical write up? why didn't you use AI to generate it I did. I spent half an hour generating the requirements, and than the rest to actually read it and make sure its accurate and fix the errors why wouldn't you just ask another AI to check for errors? Last year, I would get 2 days for this same task at least. So there is no free will here, you want to keep your job these days, you use it or you are literally 10 times slower than every other employee permalink parent award report block reply InfinitesimalOrange 16 points 4 hours ago \"Why don't you have a hallucinating AI check for errors\"\nWhoever you work for is a retard. permalink parent award report block reply view 4 more comments... _Sully_ 15 points 4 hours ago Yeah and you'll produce garbage if you listen to them. I of course used AI even last year to help with every tech spec I wrote. But it produces incomprehensible garbage and you have to fix it. I've already heard about a project going awry because not only did they not write it themselves, the contractor didn't fucking read it and no one knows who agreed to what. Contractors were already notorious for not reading them thoroughly but now not even the producers of the doc knows what's in it to the degree necessary to be defensible. permalink parent award report block reply view 1 more comments... papa_newguineapig 2 points 2 hours ago Pfft. I use AI to do my work, I turn it in the same amount of time as I always did, which means I've increased my rate of pay substantially. With WFH, I average about 20 hrs worked IF that per week. Life is great. I'm actually looking to take on another WFH position to double my income. AI may be useless to most people, but when you know how to prompt it, and the subject matter, where to point it etc, it's worth its weight in gold. permalink parent award report block reply RedCalifornia 3 points 1 hour ago Man’s first act of free will was to disobey god. permalink parent award report block reply user2827 3 points 55 minutes ago That's the whole trend of, iirc, vibe coding, where the programmers just get AI to write the functions for them... I occasionally will use AI to take spec documents and ask it to summarize the parts that are relevant to my scope of work, but I also learned quickly that I would need to also get it to provide page numbers or how to locate the information just to confirm because even in that request I found they would sometimes make stuff up. permalink parent award report block reply Citizen_Bob 3 points 4 hours ago Yes. You can build these systems yourself and very easily. You can even use the existing models like ChatGPT or Grok to help you do it. Out of reach for most people still but if you are smart enough to finish reading this, you're smart enough to go to Grok.com and ask it to help you install Linux. Then have it help you build your own uncensored AI (e.g., Dolphin) on your current hardware. Just go to grok.com, hit voice, explain your situation, skill level, and ask it for help with this. Watch what happens. permalink parent award report block reply papa_newguineapig 2 points 1 hour ago Yeah, its not that easy, nor is it cheap. Nice try though bud. ( IT professional with 30 years experience and can do anything electronic ) Have my own dual RTX 5080 GPU LLM farm. permalink parent award report block reply view 1 more comments... TruthyBrat 1 points 4 hours ago What's the hardware investment for something like that? permalink parent award report block reply view 7 more comments...\niamherefortheluls 20 points 4 hours ago its a job requirement. I sometimes get off work and I get whiplash when I think how a year ago, AI wasn't a thing at my job and today, I would not be able to perform at the speed demanded of me without it. My team lead and the next manager after that and the next manager after that - all 3 explicitly tell me to use it. what do you mean you spent 2 hours on this 10 page technical write up? why didn't you use AI to generate it I did. I spent half an hour generating the requirements, and than the rest to actually read it and make sure its accurate and fix the errors why wouldn't you just ask another AI to check for errors? Last year, I would get 2 days for this same task at least. So there is no free will here, you want to keep your job these days, you use it or you are literally 10 times slower than every other employee permalink parent award report block reply InfinitesimalOrange 16 points 4 hours ago \"Why don't you have a hallucinating AI check for errors\"\nWhoever you work for is a retard. permalink parent award report block reply view 4 more comments... _Sully_ 15 points 4 hours ago Yeah and you'll produce garbage if you listen to them. I of course used AI even last year to help with every tech spec I wrote. But it produces incomprehensible garbage and you have to fix it. I've already heard about a project going awry because not only did they not write it themselves, the contractor didn't fucking read it and no one knows who agreed to what. Contractors were already notorious for not reading them thoroughly but now not even the producers of the doc knows what's in it to the degree necessary to be defensible. permalink parent award report block reply view 1 more comments... papa_newguineapig 2 points 2 hours ago Pfft. I use AI to do my work, I turn it in the same amount of time as I always did, which means I've increased my rate of pay substantially. With WFH, I average about 20 hrs worked IF that per week. Life is great. I'm actually looking to take on another WFH position to double my income. AI may be useless to most people, but when you know how to prompt it, and the subject matter, where to point it etc, it's worth its weight in gold. permalink parent award report block reply\nInfinitesimalOrange 16 points 4 hours ago \"Why don't you have a hallucinating AI check for errors\"\nWhoever you work for is a retard. permalink parent award report block reply view 4 more comments...\n_Sully_ 15 points 4 hours ago Yeah and you'll produce garbage if you listen to them. I of course used AI even last year to help with every tech spec I wrote. But it produces incomprehensible garbage and you have to fix it. I've already heard about a project going awry because not only did they not write it themselves, the contractor didn't fucking read it and no one knows who agreed to what. Contractors were already notorious for not reading them thoroughly but now not even the producers of the doc knows what's in it to the degree necessary to be defensible. permalink parent award report block reply view 1 more comments...\npapa_newguineapig 2 points 2 hours ago Pfft. I use AI to do my work, I turn it in the same amount of time as I always did, which means I've increased my rate of pay substantially. With WFH, I average about 20 hrs worked IF that per week. Life is great. I'm actually looking to take on another WFH position to double my income. AI may be useless to most people, but when you know how to prompt it, and the subject matter, where to point it etc, it's worth its weight in gold. permalink parent award report block reply\nRedCalifornia 3 points 1 hour ago Man’s first act of free will was to disobey god. permalink parent award report block reply\nuser2827 3 points 55 minutes ago That's the whole trend of, iirc, vibe coding, where the programmers just get AI to write the functions for them... I occasionally will use AI to take spec documents and ask it to summarize the parts that are relevant to my scope of work, but I also learned quickly that I would need to also get it to provide page numbers or how to locate the information just to confirm because even in that request I found they would sometimes make stuff up. permalink parent award report block reply\nCitizen_Bob 3 points 4 hours ago Yes. You can build these systems yourself and very easily. You can even use the existing models like ChatGPT or Grok to help you do it. Out of reach for most people still but if you are smart enough to finish reading this, you're smart enough to go to Grok.com and ask it to help you install Linux. Then have it help you build your own uncensored AI (e.g., Dolphin) on your current hardware. Just go to grok.com, hit voice, explain your situation, skill level, and ask it for help with this. Watch what happens. permalink parent award report block reply papa_newguineapig 2 points 1 hour ago Yeah, its not that easy, nor is it cheap. Nice try though bud. ( IT professional with 30 years experience and can do anything electronic ) Have my own dual RTX 5080 GPU LLM farm. permalink parent award report block reply view 1 more comments... TruthyBrat 1 points 4 hours ago What's the hardware investment for something like that? permalink parent award report block reply view 7 more comments...\npapa_newguineapig 2 points 1 hour ago Yeah, its not that easy, nor is it cheap. Nice try though bud. ( IT professional with 30 years experience and can do anything electronic ) Have my own dual RTX 5080 GPU LLM farm. permalink parent award report block reply view 1 more comments...\nTruthyBrat 1 points 4 hours ago What's the hardware investment for something like that? permalink parent award report block reply view 7 more comments...\nImYourHuckleberry24 13 points 4 hours ago You mean like all of our emails and text messages? Yeah permalink parent award report block reply\nhatredcopter 10 points 4 hours ago This isn't really about that though its an implication. This is about content owners trying to catch AI companies in IP theft. Industry A vs Industry B with them framing it as something we are involved in. My take is that its closest analogue is probably Net Neutrality. permalink parent award report block reply booblitchutz 2 points 3 hours ago The closest analogue is like the \"sampling\" craze in Rap. You had artists like The Dust Brothers that created all the beats behind the Beastie Boys' \"Pauls Boutique\". That entire album was a collage of samples. The landmark case was Gilbert O'Sullivan suing Biz Markie. The court ruled that a sample remained the property of the copyright owner regardless of the duration of it. That is legal precedent here, for sure. And music is also part of what AI is trained on. Also movies, TV, all kinds of material written on the internet, books, youtube videos, you name it. permalink parent award report block reply hatredcopter 1 points 3 hours ago Oh I mean sure that's probably the most direct legal precedent for the case itself. What I was getting at is a bunch of press on both sides representing Industry A and Industry B as if it affects the public positively or negatively, when what is actually going to happen will probably be settlements or regulation that affects the industry and not the public whatsoever. permalink parent award report block reply user2827 1 points 47 minutes ago Oh, yes, this seems more what the lawsuit was about, I was thinking more in terms of what the problem is.... permalink parent award report block reply\nbooblitchutz 2 points 3 hours ago The closest analogue is like the \"sampling\" craze in Rap. You had artists like The Dust Brothers that created all the beats behind the Beastie Boys' \"Pauls Boutique\". That entire album was a collage of samples. The landmark case was Gilbert O'Sullivan suing Biz Markie. The court ruled that a sample remained the property of the copyright owner regardless of the duration of it. That is legal precedent here, for sure. And music is also part of what AI is trained on. Also movies, TV, all kinds of material written on the internet, books, youtube videos, you name it. permalink parent award report block reply hatredcopter 1 points 3 hours ago Oh I mean sure that's probably the most direct legal precedent for the case itself. What I was getting at is a bunch of press on both sides representing Industry A and Industry B as if it affects the public positively or negatively, when what is actually going to happen will probably be settlements or regulation that affects the industry and not the public whatsoever. permalink parent award report block reply\nhatredcopter 1 points 3 hours ago Oh I mean sure that's probably the most direct legal precedent for the case itself. What I was getting at is a bunch of press on both sides representing Industry A and Industry B as if it affects the public positively or negatively, when what is actually going to happen will probably be settlements or regulation that affects the industry and not the public whatsoever. permalink parent award report block reply\nuser2827 1 points 47 minutes ago Oh, yes, this seems more what the lawsuit was about, I was thinking more in terms of what the problem is.... permalink parent award report block reply\nbooblitchutz 1 points 3 hours ago Sure, the privacy concerns are there, but that's not the point here. The point is this is a legal vector that could pretty much end all AI platforms as we know it. permalink parent award report block reply Judenfrei 1 points 3 hours ago The point is this is a legal vector that could pretty much end all AI platforms as we know it. This would be great news. permalink parent award report block reply booblitchutz 4 points 3 hours ago I kind of agree, honestly. But alas, I think this shit is too big to fail at this point. I think if our legal system worked properly, OpenAI would be sued into oblivion, but there's so much money tied up in AI right now that our legal system will probably not upset the apple cart. permalink parent award report block reply Judenfrei 2 points 2 hours ago Matthew 17:19-20 ESV https://biblehub.com/esv/matthew/17.htm 19 Then the disciples came to Jesus privately and said, “Why could we not cast it out?” 20 He said to them, “Because of your little faith. For truly, I say to you, if you have faith like a grain of mustard seed, you will say to this mountain, ‘Move from here to there,’ and it will move, and nothing will be impossible for you.”e permalink parent award report block reply\nJudenfrei 1 points 3 hours ago The point is this is a legal vector that could pretty much end all AI platforms as we know it. This would be great news. permalink parent award report block reply booblitchutz 4 points 3 hours ago I kind of agree, honestly. But alas, I think this shit is too big to fail at this point. I think if our legal system worked properly, OpenAI would be sued into oblivion, but there's so much money tied up in AI right now that our legal system will probably not upset the apple cart. permalink parent award report block reply Judenfrei 2 points 2 hours ago Matthew 17:19-20 ESV https://biblehub.com/esv/matthew/17.htm 19 Then the disciples came to Jesus privately and said, “Why could we not cast it out?” 20 He said to them, “Because of your little faith. For truly, I say to you, if you have faith like a grain of mustard seed, you will say to this mountain, ‘Move from here to there,’ and it will move, and nothing will be impossible for you.”e permalink parent award report block reply\nbooblitchutz 4 points 3 hours ago I kind of agree, honestly. But alas, I think this shit is too big to fail at this point. I think if our legal system worked properly, OpenAI would be sued into oblivion, but there's so much money tied up in AI right now that our legal system will probably not upset the apple cart. permalink parent award report block reply\nJudenfrei 2 points 2 hours ago Matthew 17:19-20 ESV https://biblehub.com/esv/matthew/17.htm 19 Then the disciples came to Jesus privately and said, “Why could we not cast it out?” 20 He said to them, “Because of your little faith. For truly, I say to you, if you have faith like a grain of mustard seed, you will say to this mountain, ‘Move from here to there,’ and it will move, and nothing will be impossible for you.”e permalink parent award report block reply\nIlhansBrother OP 15 points 4 hours ago They will hand over your private conversations to Marxist activists permalink parent award report block reply booblitchutz 3 points 3 hours ago That's not really the point here. permalink parent award report block reply\nbooblitchutz 3 points 3 hours ago That's not really the point here. permalink parent award report block reply\nRedStoneDeepState 4 points 3 hours ago I have seen 4 people get fired for feeding DoD CUI into ChatGPT. That is the people that got caught. permalink parent award report block reply BlackJack1776 4 points 3 hours ago Okay. This makes the whole thing important. Feeding Confidential info into a shady data base, with a fancy algorithm, under the control of various horrible people is a worthy concern. Thanks for that perspective. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 hours ago How were they caught? permalink parent award report block reply RedStoneDeepState 3 points 2 hours ago Sending CUI from their work email to a personal email on the work laptop or bypassing security filters to run ChatGPT on the work laptop. Guess the skin color. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 hours ago Without admin rights, how would they bypass security on their .gov laptops? So they were busted for sending CUI to themselves, or using GPT specifically? permalink parent award report block reply view 1 more comments...\nBlackJack1776 4 points 3 hours ago Okay. This makes the whole thing important. Feeding Confidential info into a shady data base, with a fancy algorithm, under the control of various horrible people is a worthy concern. Thanks for that perspective. permalink parent award report block reply\nMoldyLocksNesMonste 2 points 2 hours ago How were they caught? permalink parent award report block reply RedStoneDeepState 3 points 2 hours ago Sending CUI from their work email to a personal email on the work laptop or bypassing security filters to run ChatGPT on the work laptop. Guess the skin color. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 hours ago Without admin rights, how would they bypass security on their .gov laptops? So they were busted for sending CUI to themselves, or using GPT specifically? permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 3 points 2 hours ago Sending CUI from their work email to a personal email on the work laptop or bypassing security filters to run ChatGPT on the work laptop. Guess the skin color. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 hours ago Without admin rights, how would they bypass security on their .gov laptops? So they were busted for sending CUI to themselves, or using GPT specifically? permalink parent award report block reply view 1 more comments...\nMoldyLocksNesMonste 2 points 2 hours ago Without admin rights, how would they bypass security on their .gov laptops? So they were busted for sending CUI to themselves, or using GPT specifically? permalink parent award report block reply view 1 more comments...\nCitizen_Bob 3 points 4 hours ago It's a massive violation of people's privacy rights. NYT will have intimate details of everything from business ideas to extreme trauma from someone's past. ToS surely tells people this is a potential outcome, so OpenAI will not be a party to that rights violation. Except they enabled it by not anonymizing users because they're ghoulish fuckheads with no civic morals. What this means is your person and effects can be transferred around by the state at the whim of some faggot judge and creepy lawyers working for one of your main political adversaries. permalink parent award report block reply B-2StealthTrump 2 points 2 hours ago NYT?  You misspelled CIA. permalink parent award report block reply\nB-2StealthTrump 2 points 2 hours ago NYT?  You misspelled CIA. permalink parent award report block reply\niamherefortheluls 2 points 4 hours ago lots of idiots assume their AI conversations are not being recorded. Can't imagine how or why anyone might think that, but apparently its a thing. permalink parent award report block reply\nbasedboston 22 points 4 hours ago New York Magistrate Judge Ona T. Wang .... No way. permalink award report block reply TheTelltaleFly 15 points 4 hours ago Unrelated, I think we should definitely bring in more Chinese students. It’s going great so far. permalink parent award report block reply nmipede 1 points 3 hours ago Beat me to this by an hour. GMTA. Heh-heh-heh yousaidonawang heh-heh-hehehehe-heh permalink parent award report block reply\nTheTelltaleFly 15 points 4 hours ago Unrelated, I think we should definitely bring in more Chinese students. It’s going great so far. permalink parent award report block reply\nnmipede 1 points 3 hours ago Beat me to this by an hour. GMTA. Heh-heh-heh yousaidonawang heh-heh-hehehehe-heh permalink parent award report block reply\nDemPanicAtTheDisco 16 points 4 hours ago Dumb pin. It's about data scraping. permalink award report block reply booblitchutz 0 points 3 hours ago NYT has a strong case with legal precedent. This has the potential to end AI platforms. permalink parent award report block reply DemPanicAtTheDisco 5 points 3 hours ago This has the potential to end AI platforms. No, it has the potential to change what sources LLMs are trained on for free moving forward. Worst case scenario some sites choose to opt out while others take payment for direct scraping from these companies. That will only create boutique scraping companies operating from other jurisdictions where they don't have to worry about litigation where they will operate as data brokers. This is just certain corporations trying to protect their own data from being used.... for free. It doesn't negate the years worth of data scraping that's already happened and been used to train these AI models. They aren't going to be forced to \"unlearn\" anything. permalink parent award report block reply booblitchutz 0 points 2 hours ago Of course they can be forced to \"unlearn\". Even if something is freely available on the internet, it doesn't mean it's not copyright protected, which means you can't just republish it as your own without permission from the copyright owner. permalink parent award report block reply DemPanicAtTheDisco 2 points 2 hours ago Lol you can't put the genie back in the bottle dude. You making category errors like \"you can't just republish it as your own\" clearly shows you don't have a grasp on what LLMs are doing and what the issue is. It's not republishing... It's training When I read a book and learn from it I'm not violating copyright laws even if I write a book report on it. If you think the courts can effectively get something removed from the Internet and AI companies worldwide then you need a reality check. AI companies are all over the world in different countries and jurisdictions. The Streisand effect would like a word - https://en.wikipedia.org/wiki/Streisand_effect Courts also made piracy illegal.... In most countries and yet it flourishes. permalink parent award report block reply\nbooblitchutz 0 points 3 hours ago NYT has a strong case with legal precedent. This has the potential to end AI platforms. permalink parent award report block reply DemPanicAtTheDisco 5 points 3 hours ago This has the potential to end AI platforms. No, it has the potential to change what sources LLMs are trained on for free moving forward. Worst case scenario some sites choose to opt out while others take payment for direct scraping from these companies. That will only create boutique scraping companies operating from other jurisdictions where they don't have to worry about litigation where they will operate as data brokers. This is just certain corporations trying to protect their own data from being used.... for free. It doesn't negate the years worth of data scraping that's already happened and been used to train these AI models. They aren't going to be forced to \"unlearn\" anything. permalink parent award report block reply booblitchutz 0 points 2 hours ago Of course they can be forced to \"unlearn\". Even if something is freely available on the internet, it doesn't mean it's not copyright protected, which means you can't just republish it as your own without permission from the copyright owner. permalink parent award report block reply DemPanicAtTheDisco 2 points 2 hours ago Lol you can't put the genie back in the bottle dude. You making category errors like \"you can't just republish it as your own\" clearly shows you don't have a grasp on what LLMs are doing and what the issue is. It's not republishing... It's training When I read a book and learn from it I'm not violating copyright laws even if I write a book report on it. If you think the courts can effectively get something removed from the Internet and AI companies worldwide then you need a reality check. AI companies are all over the world in different countries and jurisdictions. The Streisand effect would like a word - https://en.wikipedia.org/wiki/Streisand_effect Courts also made piracy illegal.... In most countries and yet it flourishes. permalink parent award report block reply\nDemPanicAtTheDisco 5 points 3 hours ago This has the potential to end AI platforms. No, it has the potential to change what sources LLMs are trained on for free moving forward. Worst case scenario some sites choose to opt out while others take payment for direct scraping from these companies. That will only create boutique scraping companies operating from other jurisdictions where they don't have to worry about litigation where they will operate as data brokers. This is just certain corporations trying to protect their own data from being used.... for free. It doesn't negate the years worth of data scraping that's already happened and been used to train these AI models. They aren't going to be forced to \"unlearn\" anything. permalink parent award report block reply booblitchutz 0 points 2 hours ago Of course they can be forced to \"unlearn\". Even if something is freely available on the internet, it doesn't mean it's not copyright protected, which means you can't just republish it as your own without permission from the copyright owner. permalink parent award report block reply DemPanicAtTheDisco 2 points 2 hours ago Lol you can't put the genie back in the bottle dude. You making category errors like \"you can't just republish it as your own\" clearly shows you don't have a grasp on what LLMs are doing and what the issue is. It's not republishing... It's training When I read a book and learn from it I'm not violating copyright laws even if I write a book report on it. If you think the courts can effectively get something removed from the Internet and AI companies worldwide then you need a reality check. AI companies are all over the world in different countries and jurisdictions. The Streisand effect would like a word - https://en.wikipedia.org/wiki/Streisand_effect Courts also made piracy illegal.... In most countries and yet it flourishes. permalink parent award report block reply\nbooblitchutz 0 points 2 hours ago Of course they can be forced to \"unlearn\". Even if something is freely available on the internet, it doesn't mean it's not copyright protected, which means you can't just republish it as your own without permission from the copyright owner. permalink parent award report block reply DemPanicAtTheDisco 2 points 2 hours ago Lol you can't put the genie back in the bottle dude. You making category errors like \"you can't just republish it as your own\" clearly shows you don't have a grasp on what LLMs are doing and what the issue is. It's not republishing... It's training When I read a book and learn from it I'm not violating copyright laws even if I write a book report on it. If you think the courts can effectively get something removed from the Internet and AI companies worldwide then you need a reality check. AI companies are all over the world in different countries and jurisdictions. The Streisand effect would like a word - https://en.wikipedia.org/wiki/Streisand_effect Courts also made piracy illegal.... In most countries and yet it flourishes. permalink parent award report block reply\nDemPanicAtTheDisco 2 points 2 hours ago Lol you can't put the genie back in the bottle dude. You making category errors like \"you can't just republish it as your own\" clearly shows you don't have a grasp on what LLMs are doing and what the issue is. It's not republishing... It's training When I read a book and learn from it I'm not violating copyright laws even if I write a book report on it. If you think the courts can effectively get something removed from the Internet and AI companies worldwide then you need a reality check. AI companies are all over the world in different countries and jurisdictions. The Streisand effect would like a word - https://en.wikipedia.org/wiki/Streisand_effect Courts also made piracy illegal.... In most countries and yet it flourishes. permalink parent award report block reply\nCitizen_Bob 16 points 4 hours ago open isn't open and they are not private. neither is X but they do anonymize for their own purposes. you have to dump your data from chat and then 30 days it expunges. or use private and it will expunge immediately. permalink award report block reply\nHeinzHummer 7 points 4 hours ago I like to ask AI statistical questions that causes it to generate bullshit contextual summaries to discredit the real numbers. permalink award report block reply Zskills 4 points 3 hours ago Minorities commit more crime because they are poor but also they commit more crime than whites even when they make the same amount of money. They commit more crime because of discrimination but their crime rates are similar no matter what country you look at. Etc. AI is useless for discussions about statistics.  You are ALWAYS missing context no matter how many times you corner it. permalink parent award report block reply MoldyLocksNesMonste 4 points 2 hours ago \"Hey, I want to caution you. You are using charged language that is damaging to vulnerable communities\" permalink parent award report block reply\nZskills 4 points 3 hours ago Minorities commit more crime because they are poor but also they commit more crime than whites even when they make the same amount of money. They commit more crime because of discrimination but their crime rates are similar no matter what country you look at. Etc. AI is useless for discussions about statistics.  You are ALWAYS missing context no matter how many times you corner it. permalink parent award report block reply MoldyLocksNesMonste 4 points 2 hours ago \"Hey, I want to caution you. You are using charged language that is damaging to vulnerable communities\" permalink parent award report block reply\nMoldyLocksNesMonste 4 points 2 hours ago \"Hey, I want to caution you. You are using charged language that is damaging to vulnerable communities\" permalink parent award report block reply\nDangerousAmerican76 6 points 3 hours ago AI is making us lazy and stupid And the people who build, make, maintain, program AI are all trained and educated at captive academia collectives, so it hates whites and tells lies I’m a millwright so it will be some time before they replace me but if you work in an office yeah I’d worry permalink award report block reply\nsavman 5 points 4 hours ago AI Agents are an extension of human coders.  If I read a NYT article, have a photographic memory, or use a screen reader and tell my friends what I read, how can this be considered any different? permalink award report block reply booblitchutz 2 points 3 hours ago If you have a subscription to NYT and you read an article from behind their paywall you don't own the article and you can't republish it.  When you buy a CD you don't own the songs. You own a licensed copy of the recording of the song. You cant rebroadcast the song yourself, even if you don't profit from it. AI doesn't read an article and learn like we do, it is fed the article which it keeps in it's storage and then when you ask a question that is related to said article, it uses that article to generate a response either in part or in whole. But courts have ruled that copyright owners have a right to their material regardless of the duration of the sample used by someone else. permalink parent award report block reply B-2StealthTrump 3 points 2 hours ago Since we know corps/orgs like NYT don’t give a damn about anyone’s privacy (except their own), is this just a money grab by NYT and lawyers with $’s in their eyes?  If so, thousands of other corps/orgs will follow suit, which would bankrupt OpenAI, which the govt won’t allow to happen, which is why I think this goes nowhere. permalink parent award report block reply\nbooblitchutz 2 points 3 hours ago If you have a subscription to NYT and you read an article from behind their paywall you don't own the article and you can't republish it.  When you buy a CD you don't own the songs. You own a licensed copy of the recording of the song. You cant rebroadcast the song yourself, even if you don't profit from it. AI doesn't read an article and learn like we do, it is fed the article which it keeps in it's storage and then when you ask a question that is related to said article, it uses that article to generate a response either in part or in whole. But courts have ruled that copyright owners have a right to their material regardless of the duration of the sample used by someone else. permalink parent award report block reply B-2StealthTrump 3 points 2 hours ago Since we know corps/orgs like NYT don’t give a damn about anyone’s privacy (except their own), is this just a money grab by NYT and lawyers with $’s in their eyes?  If so, thousands of other corps/orgs will follow suit, which would bankrupt OpenAI, which the govt won’t allow to happen, which is why I think this goes nowhere. permalink parent award report block reply\nB-2StealthTrump 3 points 2 hours ago Since we know corps/orgs like NYT don’t give a damn about anyone’s privacy (except their own), is this just a money grab by NYT and lawyers with $’s in their eyes?  If so, thousands of other corps/orgs will follow suit, which would bankrupt OpenAI, which the govt won’t allow to happen, which is why I think this goes nowhere. permalink parent award report block reply\nSavingPrivateGrace 4 points 3 hours ago The NYT was used to train AI and they want compensation for that because when they use AI, they are essentially getting fed back their waste along with some other byproducts.  Maybe they should be paid.  Training AI was not a contract, it was a friend taking advantage of you by going to another important business owner and telling them 'I am a friend of so and so', using that clout to get something in return...and then not share that with the friend.  Whatever, I don't know why I figured this out.  AI is not my friend. permalink award report block reply\nJimRaynor 4 points 4 hours ago Se must hang these crazy maniac judges. Anonymuse 20 million user conversations from around the wrold (with GDPR etc) in 2 days, safely, and hand it over to fake news democrat media? That's impossible single mistak could open ai to trillion dollar privacy lawsuits and tank its stock We must kill these marxist judges. they wont stop permalink award report block reply\nGmb576 3 points 3 hours ago All this will be right wing dissident conversations which will be sent to taxpayer funded NGOs for opposition research. Lawfare prosecutors will have this, know what to look for, and use parallel construction techniques to hide abuse. This appears to be the point of this suit, a legitimized handover of sensative data. permalink award report block reply\ncross_bearer_02 3 points 3 hours ago Oh no! They will discover all of my battle plans and wartime strategic planning and troop advancement. Won't help them overthrow a nation. Might help 'em play a good game of Final Fantasy Tactics , though. permalink award report block reply\nschism 2 points 3 hours ago \"NY Magistrate Judge Ona T. Wang\" permalink award report block reply\nInfinitesimalOrange 2 points 4 hours ago What I see is: New York Times is developing their own ai and they want to train it on chatGPT conversations. Lmao, grifters. permalink award report block reply\nEric42 2 points 3 hours ago \"Ordered\" to produce 20 million user conversations to \"NY Times\"????  We are losing -_- permalink award report block reply\nrebuildingMyself 2 points 4 hours ago Never, ever, assume what you say on any cloud-based service is private. I don't care how many ways they encrypt it. Not even the algorithms with a private key you store yourself. Always assume everything you say or store could eventually be read back out to you in some kangaroo court a decade from now if you get too much on the wrong radars. permalink award report block reply\nRealTXPatriot 2 points 3 hours ago Funniest shit over this is the fact I have a whole Google account I use for spam bullshit and signing up for these services... So my Google account i created for these interactions has done nothing but research the oddest shit you've ever imagined. One day they'll go through it and shit themselves permalink award report block reply\nmygovisacommie 2 points 4 hours ago I propose that any information taken from NYT used in training actually produced negative value by fucking up actual information with propaganda, so the outcome should be the NYT has to pay OpenAI for damages caused. permalink award report block reply\nnod32 1 points 1 hour ago uh Oh, gotta delete all the 6mil calculations permalink award report block reply\nWtf_socialismreally 1 points 2 hours ago Why are they ordered to give it to the media? How does that make sense? Is it because it's taking data from NYT? Welcome to search engines. permalink award report block reply\nJack_NC 1 points 4 hours ago And we don't think that Google doesn't keep (and sell? use?) google search info? The potential for industrial espionage is huge. Knowing what a person, or company, or government agent is searching for is very valuable. permalink award report block reply\ntw0scoops 1 points 2 hours ago I dont see how 20 million user conversations are relevant to the case. Its also ironic considering that AI will be used to scrape the data bc 20 million data points....... good luck.  Its retarded,  they ll be able to cherry pick, infer, and argue whatever the hell they want with a set that large. permalink award report block reply\nOkieDoker 1 points 3 hours ago I used chatgpt as a sounding board going through my divorce process. It was helpful tbh permalink award report block reply\nXahnel 1 points 3 hours ago find yourself an AI that stores your chats in localStorage permalink award report block reply\nDesensitized 1 points 3 hours ago Can't they just ask the AI to sort out what's necessary for the case for them?  >_> permalink award report block reply\nCocaineNewsome 1 points 3 hours ago Cloud based AI is bad like that. Run your own or go home. A lot of people put their deepest thoughts in that machine. permalink award report block reply\nbooblitchutz 1 points 3 hours ago It really was only a matter of time before all these AI companies were sued for copyright infringement. AI isn't \"intelligence\", it's just what other people have said already, re-formed based on models. It's not just text, it's imagery, music, movies. The avalanche of lawsuits over this should be enough to wipe them out and render their platforms useless. permalink award report block reply\nMhmm2MoreWeeks 1 points 2 hours ago *Shrugs so. permalink award report block reply",
  "fetched_at": "2025-11-12T23:09:17.736572Z"
}