{
  "id": "1ARK56kNrn",
  "url": "https://patriots.win/p/1ARK56kNrn/9498-match-they-fucking-got-her-/c",
  "content": "636 94-98% match. They fucking GOT HER DEAD TO RIGHTS. Former Capitol Police officer a forensic match for Jan. 6 pipe bomber. (www.theblaze.com) posted 5 days ago by ThePopCan 45 comments award share report block Former Capitol Police officer a forensic match for Jan. 6 pipe bomber, sources say | Blaze Media A computer program that compared the bomb suspect’s gait to that of Shauni Kerkhoff produced a 94% match. www.theblaze.com\n45 comments Sort by Top Top New Worst Old Save corporateshizer 57 points 5 days ago As if every cop on the Capitol Hill force didn't already know the pipe bomber was one of their own. The wave to the passing cop car removes any doubt they ALL were in on it. Also explains the half dozen \"suicides\" in their force following the protests. It's a big club, and you aren't in it. permalink award report block reply Trooph-Hurts 16 points 5 days ago They suicided themselves good! permalink parent award report block reply impera 22 points 5 days ago The fake j6 committee insisted that the j6 people and organizers KILLED all those police! And the media repeated it every day, and most still say it now, almost 5 years later. Its no small irony that the j6 committee almost certainly knew that people like Nasty Nancy Pelosi were both organizer and probably gave the kill orders. permalink parent award report block reply Lower 2 points 4 days ago They probably threw her fucking parties, KNOWING why and what she did. permalink parent award report block reply keeponwinning 1 points 4 days ago Nah, just cemented her job at the CIA, which planned it as a potential justification for congress declaring an emergency and tabling any objections to the count. permalink parent award report block reply ScholarX 1 points 4 days ago Thread Hijack:  What does \"Dead to Rights\" mean?  Seriously? permalink parent award report block reply helenvsgladys 1 points 4 days ago It means the evidence is undeniable and they have nowhere to turn. I don't know the etymology of the phrase. permalink parent award report block reply Deplorable556 23 points 5 days ago oh whats this she suddenly offed herself. gawsh what a co-inky-dinky permalink award report block reply ThePopCan OP 16 points 5 days ago bro, at one point she worked for Ratcliffe permalink parent award report block reply couranto 13 points 4 days ago FYI for clarity, she was not hired by Ratcliffe or is she some kind of conservative: She moved over to a CIA security detail job under Biden admin. The job provides protection for CIA related dignitaries, which includes the director. She remained in that job even after the transition in Jan 2025. permalink parent award report block reply Deplorable556 10 points 5 days ago whatever happened to that asshole? the same thing thats about to happen to nancy. no charges, no jail time. just a smooth retirement and sailing into the wind of history. bullshit! permalink parent award report block reply ThePopCan OP 6 points 5 days ago wait, Ratcliffe? He's currently running the CIA. permalink parent award report block reply Deplorable556 4 points 5 days ago ah so he was promoted instead. that makes me even happier /s permalink parent award report block reply view 1 more comments... tholinz 17 points 5 days ago Amazing how they were able to figure this out in a couple of weeks while the Biden administration didn't do shit for years permalink award report block reply corporateshizer 16 points 5 days ago The big question is whether anyone will be prosecuted. I'm not holding my breath. https://pbs.twimg.com/media/G48OlRBbQAIwYsO.jpg permalink parent award report block reply Rudy_DankMemer 3 points 4 days ago The big question is whether anyone will be prosecuted. The suicides start happening rather fast.... the msg was clear. Pam will do nothing. And we will just meme about it permalink parent award report block reply Taqiyya_Mockingbird 3 points 4 days ago They’ve known all along. Everything like this is scheduled and scripted like a Hollywood show permalink parent award report block reply UpwardBound 11 points 5 days ago Shes just a useful idiot.  A little waterboarding may help to find out who put her up to this. permalink award report block reply hoodar 10 points 4 days ago Mentally ill bull dyke? Who knew. permalink award report block reply KewMan 8 points 5 days ago She looks retarded. Probably been transferred to the Kiev Clowns field office and will die in a mugging attempt. permalink award report block reply UpvoteBot 7 points 4 days ago Looks like a dike permalink award report block reply kekranger 7 points 4 days ago A college soccer lesbian turned cop, that tracks. permalink award report block reply GainesvilleFlorida 4 points 4 days ago Softball or soccer. Instant question marks. permalink parent award report block reply patrioticwinning3 4 points 4 days ago Now they just need to find her before she is suicided... permalink award report block reply knnbccb 2 points 4 days ago They're just the low level grunts and useful idiots. Who planned the thing and gave instructions, that's the key. permalink award report block reply JoinTheDiscussion 2 points 4 days ago Nancy's crew permalink parent award report block reply tomthung 2 points 4 days ago The phone records will confirm her location and is her life in danger now? permalink award report block reply Taupkek 2 points 4 days ago Beck better hope she really is this person. If not she will be living in his house and he'll be sleeping next to Crackhead Bob on the street in a pup tent. If it isn't proven 100% she will sue him and his company for everything, and win. permalink award report block reply JoinTheDiscussion 1 points 4 days ago FBI has the evidence and knows who it is.. permalink parent award report block reply sorrytodisagree 1 points 4 days ago They also need to get her co-conspirators that corrupted the data for the multiple cell phones she was carrying and shut down the investigation. permalink award report block reply RedWave26 1 points 4 days ago Hopium is a helluva a drug. Nobody is dead to rights. Cheeto Beck is going for clicks. permalink award report block reply KungPaoMcChicken 1 points 4 days ago It's just a token of my extreme... permalink award report block reply Yawnz13 1 points 4 days ago Yeah this isn't \"dead to rights\". permalink award report block reply Steve56775 1 points 4 days ago Hey the good news is the file is on Bondi’s desk. The bad news is it’s under the Epstein binders. permalink award report block reply UltraMagaWA 1 points 4 days ago Put this lesbicunt into Gitmo permalink award report block reply Wexit-Delecto 1 points 4 days ago Bull dyke face and hair checks out. permalink award report block reply TrumpyOldMan 1 points 4 days ago Isn't the real question this: why the fuck do they have her gait analysis?\nThis could be grounds for defamation if the accuser is wrong, and it could end very bad in a legal sense permalink award report block reply Psarg 3 points 4 days ago There's more.  Both have a limp, and this lady has one from a soccer injury.  They have the same height.  The bomb looked like it was from a training manual, this lady did training for Capitol Police.  The bomber used little known known back route to get to the DNC, lile she was a local.  Two other Capitol Police found the bomb.  Then this lady ends up being one of the first witnesses against the 1/6 defendants. permalink parent award report block reply EndTheFedEndTheSlvry 1 points 4 days ago Are you retarded? permalink parent award report block reply TrumpyOldMan 1 points 3 days ago Tell me how I'm wrong permalink parent award report block reply Choppermagic 1 points 4 days ago the left and media said J6 was worse than WW2 and 9/11 combined so hang this traitor.  Watch her give up evidence on the scam to save her own skin. permalink award report block reply ACActual 1 points 4 days ago Just got suspended on X for asking if she survives the weekend or suicides herself with 2 in the back of the head permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\ncorporateshizer 57 points 5 days ago As if every cop on the Capitol Hill force didn't already know the pipe bomber was one of their own. The wave to the passing cop car removes any doubt they ALL were in on it. Also explains the half dozen \"suicides\" in their force following the protests. It's a big club, and you aren't in it. permalink award report block reply Trooph-Hurts 16 points 5 days ago They suicided themselves good! permalink parent award report block reply impera 22 points 5 days ago The fake j6 committee insisted that the j6 people and organizers KILLED all those police! And the media repeated it every day, and most still say it now, almost 5 years later. Its no small irony that the j6 committee almost certainly knew that people like Nasty Nancy Pelosi were both organizer and probably gave the kill orders. permalink parent award report block reply Lower 2 points 4 days ago They probably threw her fucking parties, KNOWING why and what she did. permalink parent award report block reply keeponwinning 1 points 4 days ago Nah, just cemented her job at the CIA, which planned it as a potential justification for congress declaring an emergency and tabling any objections to the count. permalink parent award report block reply ScholarX 1 points 4 days ago Thread Hijack:  What does \"Dead to Rights\" mean?  Seriously? permalink parent award report block reply helenvsgladys 1 points 4 days ago It means the evidence is undeniable and they have nowhere to turn. I don't know the etymology of the phrase. permalink parent award report block reply\nTrooph-Hurts 16 points 5 days ago They suicided themselves good! permalink parent award report block reply impera 22 points 5 days ago The fake j6 committee insisted that the j6 people and organizers KILLED all those police! And the media repeated it every day, and most still say it now, almost 5 years later. Its no small irony that the j6 committee almost certainly knew that people like Nasty Nancy Pelosi were both organizer and probably gave the kill orders. permalink parent award report block reply\nimpera 22 points 5 days ago The fake j6 committee insisted that the j6 people and organizers KILLED all those police! And the media repeated it every day, and most still say it now, almost 5 years later. Its no small irony that the j6 committee almost certainly knew that people like Nasty Nancy Pelosi were both organizer and probably gave the kill orders. permalink parent award report block reply\nLower 2 points 4 days ago They probably threw her fucking parties, KNOWING why and what she did. permalink parent award report block reply keeponwinning 1 points 4 days ago Nah, just cemented her job at the CIA, which planned it as a potential justification for congress declaring an emergency and tabling any objections to the count. permalink parent award report block reply\nkeeponwinning 1 points 4 days ago Nah, just cemented her job at the CIA, which planned it as a potential justification for congress declaring an emergency and tabling any objections to the count. permalink parent award report block reply\nScholarX 1 points 4 days ago Thread Hijack:  What does \"Dead to Rights\" mean?  Seriously? permalink parent award report block reply helenvsgladys 1 points 4 days ago It means the evidence is undeniable and they have nowhere to turn. I don't know the etymology of the phrase. permalink parent award report block reply\nhelenvsgladys 1 points 4 days ago It means the evidence is undeniable and they have nowhere to turn. I don't know the etymology of the phrase. permalink parent award report block reply\nDeplorable556 23 points 5 days ago oh whats this she suddenly offed herself. gawsh what a co-inky-dinky permalink award report block reply ThePopCan OP 16 points 5 days ago bro, at one point she worked for Ratcliffe permalink parent award report block reply couranto 13 points 4 days ago FYI for clarity, she was not hired by Ratcliffe or is she some kind of conservative: She moved over to a CIA security detail job under Biden admin. The job provides protection for CIA related dignitaries, which includes the director. She remained in that job even after the transition in Jan 2025. permalink parent award report block reply Deplorable556 10 points 5 days ago whatever happened to that asshole? the same thing thats about to happen to nancy. no charges, no jail time. just a smooth retirement and sailing into the wind of history. bullshit! permalink parent award report block reply ThePopCan OP 6 points 5 days ago wait, Ratcliffe? He's currently running the CIA. permalink parent award report block reply Deplorable556 4 points 5 days ago ah so he was promoted instead. that makes me even happier /s permalink parent award report block reply view 1 more comments...\nThePopCan OP 16 points 5 days ago bro, at one point she worked for Ratcliffe permalink parent award report block reply couranto 13 points 4 days ago FYI for clarity, she was not hired by Ratcliffe or is she some kind of conservative: She moved over to a CIA security detail job under Biden admin. The job provides protection for CIA related dignitaries, which includes the director. She remained in that job even after the transition in Jan 2025. permalink parent award report block reply Deplorable556 10 points 5 days ago whatever happened to that asshole? the same thing thats about to happen to nancy. no charges, no jail time. just a smooth retirement and sailing into the wind of history. bullshit! permalink parent award report block reply ThePopCan OP 6 points 5 days ago wait, Ratcliffe? He's currently running the CIA. permalink parent award report block reply Deplorable556 4 points 5 days ago ah so he was promoted instead. that makes me even happier /s permalink parent award report block reply view 1 more comments...\ncouranto 13 points 4 days ago FYI for clarity, she was not hired by Ratcliffe or is she some kind of conservative: She moved over to a CIA security detail job under Biden admin. The job provides protection for CIA related dignitaries, which includes the director. She remained in that job even after the transition in Jan 2025. permalink parent award report block reply\nDeplorable556 10 points 5 days ago whatever happened to that asshole? the same thing thats about to happen to nancy. no charges, no jail time. just a smooth retirement and sailing into the wind of history. bullshit! permalink parent award report block reply ThePopCan OP 6 points 5 days ago wait, Ratcliffe? He's currently running the CIA. permalink parent award report block reply Deplorable556 4 points 5 days ago ah so he was promoted instead. that makes me even happier /s permalink parent award report block reply view 1 more comments...\nThePopCan OP 6 points 5 days ago wait, Ratcliffe? He's currently running the CIA. permalink parent award report block reply Deplorable556 4 points 5 days ago ah so he was promoted instead. that makes me even happier /s permalink parent award report block reply view 1 more comments...\nDeplorable556 4 points 5 days ago ah so he was promoted instead. that makes me even happier /s permalink parent award report block reply view 1 more comments...\ntholinz 17 points 5 days ago Amazing how they were able to figure this out in a couple of weeks while the Biden administration didn't do shit for years permalink award report block reply corporateshizer 16 points 5 days ago The big question is whether anyone will be prosecuted. I'm not holding my breath. https://pbs.twimg.com/media/G48OlRBbQAIwYsO.jpg permalink parent award report block reply Rudy_DankMemer 3 points 4 days ago The big question is whether anyone will be prosecuted. The suicides start happening rather fast.... the msg was clear. Pam will do nothing. And we will just meme about it permalink parent award report block reply Taqiyya_Mockingbird 3 points 4 days ago They’ve known all along. Everything like this is scheduled and scripted like a Hollywood show permalink parent award report block reply\ncorporateshizer 16 points 5 days ago The big question is whether anyone will be prosecuted. I'm not holding my breath. https://pbs.twimg.com/media/G48OlRBbQAIwYsO.jpg permalink parent award report block reply Rudy_DankMemer 3 points 4 days ago The big question is whether anyone will be prosecuted. The suicides start happening rather fast.... the msg was clear. Pam will do nothing. And we will just meme about it permalink parent award report block reply\nRudy_DankMemer 3 points 4 days ago The big question is whether anyone will be prosecuted. The suicides start happening rather fast.... the msg was clear. Pam will do nothing. And we will just meme about it permalink parent award report block reply\nTaqiyya_Mockingbird 3 points 4 days ago They’ve known all along. Everything like this is scheduled and scripted like a Hollywood show permalink parent award report block reply\nUpwardBound 11 points 5 days ago Shes just a useful idiot.  A little waterboarding may help to find out who put her up to this. permalink award report block reply\nhoodar 10 points 4 days ago Mentally ill bull dyke? Who knew. permalink award report block reply\nKewMan 8 points 5 days ago She looks retarded. Probably been transferred to the Kiev Clowns field office and will die in a mugging attempt. permalink award report block reply\nUpvoteBot 7 points 4 days ago Looks like a dike permalink award report block reply\nkekranger 7 points 4 days ago A college soccer lesbian turned cop, that tracks. permalink award report block reply GainesvilleFlorida 4 points 4 days ago Softball or soccer. Instant question marks. permalink parent award report block reply\nGainesvilleFlorida 4 points 4 days ago Softball or soccer. Instant question marks. permalink parent award report block reply\npatrioticwinning3 4 points 4 days ago Now they just need to find her before she is suicided... permalink award report block reply\nknnbccb 2 points 4 days ago They're just the low level grunts and useful idiots. Who planned the thing and gave instructions, that's the key. permalink award report block reply JoinTheDiscussion 2 points 4 days ago Nancy's crew permalink parent award report block reply\nJoinTheDiscussion 2 points 4 days ago Nancy's crew permalink parent award report block reply\ntomthung 2 points 4 days ago The phone records will confirm her location and is her life in danger now? permalink award report block reply\nTaupkek 2 points 4 days ago Beck better hope she really is this person. If not she will be living in his house and he'll be sleeping next to Crackhead Bob on the street in a pup tent. If it isn't proven 100% she will sue him and his company for everything, and win. permalink award report block reply JoinTheDiscussion 1 points 4 days ago FBI has the evidence and knows who it is.. permalink parent award report block reply\nJoinTheDiscussion 1 points 4 days ago FBI has the evidence and knows who it is.. permalink parent award report block reply\nsorrytodisagree 1 points 4 days ago They also need to get her co-conspirators that corrupted the data for the multiple cell phones she was carrying and shut down the investigation. permalink award report block reply\nRedWave26 1 points 4 days ago Hopium is a helluva a drug. Nobody is dead to rights. Cheeto Beck is going for clicks. permalink award report block reply\nKungPaoMcChicken 1 points 4 days ago It's just a token of my extreme... permalink award report block reply\nYawnz13 1 points 4 days ago Yeah this isn't \"dead to rights\". permalink award report block reply\nSteve56775 1 points 4 days ago Hey the good news is the file is on Bondi’s desk. The bad news is it’s under the Epstein binders. permalink award report block reply\nUltraMagaWA 1 points 4 days ago Put this lesbicunt into Gitmo permalink award report block reply\nWexit-Delecto 1 points 4 days ago Bull dyke face and hair checks out. permalink award report block reply\nTrumpyOldMan 1 points 4 days ago Isn't the real question this: why the fuck do they have her gait analysis?\nThis could be grounds for defamation if the accuser is wrong, and it could end very bad in a legal sense permalink award report block reply Psarg 3 points 4 days ago There's more.  Both have a limp, and this lady has one from a soccer injury.  They have the same height.  The bomb looked like it was from a training manual, this lady did training for Capitol Police.  The bomber used little known known back route to get to the DNC, lile she was a local.  Two other Capitol Police found the bomb.  Then this lady ends up being one of the first witnesses against the 1/6 defendants. permalink parent award report block reply EndTheFedEndTheSlvry 1 points 4 days ago Are you retarded? permalink parent award report block reply TrumpyOldMan 1 points 3 days ago Tell me how I'm wrong permalink parent award report block reply\nPsarg 3 points 4 days ago There's more.  Both have a limp, and this lady has one from a soccer injury.  They have the same height.  The bomb looked like it was from a training manual, this lady did training for Capitol Police.  The bomber used little known known back route to get to the DNC, lile she was a local.  Two other Capitol Police found the bomb.  Then this lady ends up being one of the first witnesses against the 1/6 defendants. permalink parent award report block reply\nEndTheFedEndTheSlvry 1 points 4 days ago Are you retarded? permalink parent award report block reply TrumpyOldMan 1 points 3 days ago Tell me how I'm wrong permalink parent award report block reply\nTrumpyOldMan 1 points 3 days ago Tell me how I'm wrong permalink parent award report block reply\nChoppermagic 1 points 4 days ago the left and media said J6 was worse than WW2 and 9/11 combined so hang this traitor.  Watch her give up evidence on the scam to save her own skin. permalink award report block reply\nACActual 1 points 4 days ago Just got suspended on X for asking if she survives the weekend or suicides herself with 2 in the back of the head permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:40.266984Z"
}