{
  "id": "8177405",
  "title": "1331Fox’s Greg Gutfeld is going viral after absolutely demolishing leftist NYT podcaster David March",
  "url": "https://patriots.win/p/1ARK590Lcz/foxs-greg-gutfeld-is-going-viral/c",
  "content": "1331 Fox’s Greg Gutfeld is going viral after absolutely demolishing leftist NYT podcaster David Marchese after he complained about Planned Parenthood clinics receiving mean letters from pro-life activists, with Gutfeld responding, “Well, I mean, they are killing children.\" posted 4 days ago by Mr_Rightside 81 comments award share report block Right Angle News Network @Rightanglenews • 4d BREAKING - Fox’s Greg Gutfeld is going viral after absolutely demolishing leftist NYT podcaster David Marchese after he complained about Planned Parenthood clinics receiving mean letters from pro-life activists, with Gutfeld responding, “Well, I mean, they are killing kids.”\n81 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Than0sIII 77 points 4 days ago It's so fucking frustrating that we somehow got to this point where they're literally killing unborn children who have no say in the matter, and somehow it's not treated as morally reprehensible as it should always be. permalink award report block reply _Sully_ 38 points 4 days ago Because you are trying to convince evil to be good. When they are evil because its easy. Like trying to convince an addict that getting high doesn't feel good. It absolutely does. That's why they do it. permalink parent award report block reply NewGoldenAge 21 points 4 days ago After they shot Charlie - it's like we should exterminate vermin and evil from the face of the Earth. Go for it. FIRE AWAY. permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago So true! permalink parent award report block reply Viewer01 29 points 4 days ago People don’t understand the scale of it. Over 15 million Gen z was aborted. That’s 1/3 of them. This is more murders than all homicides and war casualties in the history of the United States. I know no one here is paying attention to the groypers but they’re dead set on repealing the 19th because this is just heinous behavior from our women. They literally rival Stalin for deaths. permalink parent award report block reply Appeal2Heaven98 25 points 4 days ago I fucking hate what they're doing to my generation. First, they kill a third of us. Now, they're making life a living hell for the remaining 2/3rds. And they dare say we're lazy while robbing us of a decent life. permalink parent award report block reply RememberCharlieKirk 21 points 4 days ago While women tend to present themselves as one-issue voters over abortion, plenty of (disgusting) men are also in favor of abortion. Look at the figurehead of Barstool -- he said that his vote will flip for Democrats if the Republicans push for restrictions on abortion. There was also that long-serving Republican Congressman Tim Murphy who persuaded his mistress into having an abortion. He resigned in 2017 and, by doing so, gave Democrats another seat in the House of Representatives. permalink parent award report block reply Dangerous 9 points 4 days ago Weak men follow what women approve of. Reprehensible men tell women what they should approve of. Women prefer Reprehensible men permalink parent award report block reply Sgt_Hulka 2 points 3 days ago I’d bet money that Zuckerberg’s bastard brother is already voting Democrat. Fuck Portnoy permalink parent award report block reply RememberCharlieKirk 1 points 3 days ago If Portnoy could openly come out as a Democrat voter, that would be great. He is not a face that anyone should want representing the Republican voting base. permalink parent award report block reply Aquamine-Amarine 4 points 4 days ago Stealing voting rights isn't going to magically make leftist women smart. It also does nothing in regards to stupid leftist men. The source of the problem will always be the schools. Leftists learned this stuff from somewhere. 18+ years of public school and then college brainwashing. Letting the left infiltrate the education system and media was the greatest mistake conservatives made. permalink parent award report block reply Viewer01 10 points 4 days ago Go check up on voting habits. This country becomes 2/3 supermajority if white mens vote. permalink parent award report block reply guywholikesDjtof2024 5 points 4 days ago Stupid men do exist. You are right. Those stupid men made the 19 Amenmdent. permalink parent award report block reply Burneraccountno4 1 points 3 days ago Let's be honest. The vast majority of those babies were doomed the moment they were conceived because they were the product of a degenerate act. There was never a loving biological mother or father in the picture - just two selfish randos who wanted to fuck. Best case scenario the kid would have been adopted by a loving family. Unfortunately these days, faggots are given priority during the adoption process, so most of these kids would be subjected to horrific abuse either way had they not been aborted. permalink parent award report block reply Memebot 21 points 4 days ago A great radio host named Jim Quinn used to say \"The left stand on their head and tell you that you are upside down.\" permalink parent award report block reply Flubadub 3 points 3 days ago RIP Jim 😢 🙏🏻 he was the reason I became a conservative. I was listening to him talk politics in between songs on WRRK before I even knew who Rush was. permalink parent award report block reply Appeal2Heaven98 12 points 4 days ago I third of my generation (Gen Z) was genocided because of abortion. permalink parent award report block reply ShotgunParade69x 4 points 4 days ago Are we gonna be denied the Hayes of heaven for not slaughtering these evil demon basatrds ? permalink parent award report block reply load 3 more comments... TheRedPilledArtist 30 points 4 days ago I'm thankful I wasn't aborted. permalink award report block reply KernalMustard 16 points 4 days ago I just wish I had a different mother. I have said just 5 words to her in 35y. She showed up one day at the 2nd location. I wanted to be some place else at that moment. permalink parent award report block reply carpetxparmesan 8 points 4 days ago Eesh, and here I was going into an abortion thread expecting light fare! permalink parent award report block reply Female 7 points 4 days ago 10 When my father and my mother forsake me, then the LORD will take me up. 11 Teach me thy way, O LORD, and lead me in a plain path, because of mine enemies. 12 Deliver me not over unto the will of mine enemies: for false witnesses are risen up against me, and such as breathe out cruelty. 13 I had fainted, unless I had believed to see the goodness of the LORD in the land of the living. 14 Wait on the LORD: be of good courage, and he shall strengthen thine heart: wait, I say, on the LORD. Psalms chapter 27 KJV permalink parent award report block reply jonnyuno 2 points 3 days ago My parents are amazing while my spouse, ignoring childhood trauma, continues to destroy from within.  Thankful for God fearing, prayerful parents who remind me they love me when my spouse does not.   These verses are a huge encouragement! permalink parent award report block reply MAGABOND 2 points 4 days ago I wish that faggot from NYT was, along with all liberals. It’s not too fucking late you know. permalink parent award report block reply Tacitus1963 21 points 4 days ago Abortion is the \"sacrament\" of the Demtard party.\nThey love offering sacrifices to Moloch.\nThey supplement aborted babies with all the kids they turn tranny with those demonic surgeries.\nThey allow babies who have survived the horrendous abortion procedure to die on a sterile table before discarding them in the trash. permalink award report block reply SanityGumby 12 points 4 days ago I am old enough to remember when they brought a mobile abortion clinic to their national convention. permalink parent award report block reply Tacitus1963 6 points 4 days ago I'm old enough too as I remember that. permalink parent award report block reply KernalMustard -2 points 4 days ago Can you show me them worshipping Moloch? permalink parent award report block reply Dangerous 11 points 4 days ago https://www.wikileaks.org/clinton-emails/emailid/14333 \"With fingers crossed, the old rabbit's foot out of the box in the attic, I will be sacrificing a chicken in the backyard to Moloch . . .\" There is also the whole Bohemian Grove stuff and the Moloch temples with Lilith owls of Epstein Island permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago \" bUt aThiEsM iS tRue AnD God is fAke!!!!!11!1\" - ignorant nonChristians atheists permalink parent award report block reply thunderpussy 18 points 4 days ago Yeah, they aren't a cupcake shop.... permalink award report block reply NimbleNavigation2024 18 points 4 days ago \"In your face\" hahahahaha permalink award report block reply politicsaside 7 points 4 days ago That was the best part. permalink parent award report block reply carpetxparmesan 4 points 4 days ago 2025: \"they're killing children! HAHA!\" 🫤 Not sure what's worse, the fact that this is reality, or the fact that it's such a brilliantly layered joke, that faggot probably DOES HAVE some baby foreskin extract on his facial routine. reaches for the orbital escape handle permalink parent award report block reply FuckEveryDemocrat 18 points 4 days ago My ex getting an abortion because “we weren’t ready for kids” is why we broke up. I’ll literally never forgive her for killing my son. permalink award report block reply Aquamine-Amarine 8 points 4 days ago I'm so sorry. permalink parent award report block reply carpetxparmesan 5 points 4 days ago I'll say it, I'm not sorry he dodged that bullet. Most men don't survive an abortion. Ba dum tis Siri, play in the arms of an angel! Jokes aside, I hope he meets a less haunted vagina. Although, that is a very strong opening: \"are you going to kill our children? tha's a hard line for me\". Usually you look a little weird opening with that one but I think he can actually pull it off. permalink parent award report block reply Fistmagic 3 points 3 days ago That's my haunted vagina joke!  Glad to see it going around.  Just tell them you're scared of ghosts. permalink parent award report block reply Female 1 points 2 days ago his username 'F* every Democrat' implies promiscuity, however permalink parent award report block reply lukenator1 8 points 4 days ago sorry to hear that permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago What do you believe forgiveness entails, and why? permalink parent award report block reply FUCK_TYLER 1 points 3 days ago Its Gods job to forgive, not his permalink parent award report block reply guywholikesDjtof2024 1 points 3 days ago Jesus: \"Forgive seventy times seven\" permalink parent award report block reply Isolated_Patriot 3 points 3 days ago Please don't misuse the bible in such a condescending way. Jesus was asked how many times we should forgive our BROTHERS who repent. Not how many times we should forgive murderers etc. permalink parent award report block reply view 5 more comments... FUCK_TYLER 2 points 3 days ago Im sure this is one sin Jesus can forgive him for permalink parent award report block reply FUCK_TYLER 1 points 3 days ago Im so sorry 💔 permalink parent award report block reply westrock2000 13 points 4 days ago I watched a video on YouTube recently about the history of white people spending much time eradicating human sacrifice from the planet. It got me thinking about how people back then could rationalize human sacrifice to “please the gods” to improve crops and stuff. Then I started thinking about how today there are women who sacrifice their unborn because of the belief that it will improve their quality of life in the future. And I wondered if it really is just that easy to get people to rationalize human sacrifice. permalink award report block reply RememberCharlieKirk 11 points 4 days ago Watch Michelle Williams' acceptance speech for winning the Golden Globe Award for best actress. She praised herself for having had an abortion, and she raised up a golden award in tribute. She literally sacrificed her unborn child for a golden statue, her \"god.\" permalink parent award report block reply westrock2000 8 points 4 days ago The video if interested: https://youtu.be/sJs07ZNIh_Q permalink parent award report block reply Aquamine-Amarine 6 points 4 days ago Brainwashing and cults are very dangerous things. It really is that easy to get weak minded people to do terrible things. permalink parent award report block reply tlorsung 10 points 4 days ago It's a fact!  they are killing kids, mostly Black Kids! permalink award report block reply BlockWorks 14 points 4 days ago Sentiment about Margaret Sanger is... complicated. permalink parent award report block reply XlDEN 7 points 4 days ago Not killing. Goodifying. Words matter. permalink parent award report block reply TrumpAndGodWin 3 points 3 days ago Democrats have kept their plantation black population numbers at a stable number for a long time relative to their natural counterparts. permalink parent award report block reply JesusTheOnlyWay 8 points 4 days ago This all transcends politics. It's the same good vs evil, Jesus vs Satan battle since the beginning. Only in abnormally good and decent times (1950s - 2000s) could so many pretend otherwise. permalink award report block reply funwithguitars 6 points 4 days ago I have always been anti-abortion, but have recently thought we should put an abortion clinic on every street corner in democrat neighborhoods. The democrat party would be defunct in two generations. permalink award report block reply Dangerous 10 points 4 days ago No they wouldn't, they reproduce through fraud and social coercion not procreation permalink parent award report block reply HeavyMetalPatriot 6 points 4 days ago And open borders. permalink parent award report block reply Tardigrade 2 points 3 days ago Check out Lyman Stone. permalink parent award report block reply MAGAPlenty 4 points 4 days ago Practicers of eugenics like the nazis permalink award report block reply TrumpAndGodWin 2 points 3 days ago The nazis thought they'd have the support of the US and UK because they practiced eugenics of retards etc. permalink parent award report block reply Hikedelics 4 points 4 days ago One day I hope that when we see a headline about “demolishing” someone over abortion, it actually involves something like a sledgehammer to their head. I’m not even asking for violence so much as that I want the headline to match what actually took place. If baby murderers were to get demolished though, well that’d be just fine. permalink award report block reply guywholikesDjtof2024 3 points 4 days ago In the Old Testament, capital punishment was used. Almost as if God is Perfectly Just. permalink parent award report block reply ianpatrick1966 1 points 3 days ago We used to explode the clinics and assassins targeted the docs Those weee the good old days for sure Then we handed the movement off to gen X and Z and holy fuck A meme and a tweet don’t really strike the same fear permalink parent award report block reply Peekov3 3 points 4 days ago Ok, that was a 💣 bombshell 💣 permalink award report block reply MAGALADON9 2 points 3 days ago David Marchese is ..... drum roll..... a Jewish athiest. permalink award report block reply NewGoldenAge 2 points 4 days ago Evil is only a mater of will and pest control of vermin. Take appropriate action. permalink award report block reply Lurker6 2 points 4 days ago Oh no, not angry letters.  Maybe when these people start getting bullets to the neck I'll be sympathetic. permalink award report block reply Washington_Redskins 2 points 3 days ago Gutfield should set up a special show in which they have tiny plastic fetuses and they demonstrate the various methods they that Planned Parenthood uses to murder these babies whether it is saline injection or piercing their skulls and vacuuming out their brains or whichever method so that people can see how brutal Planned Parenthood really is permalink award report block reply MerlynTrump 1 points 4 days ago He's not wrong permalink award report block reply SickOfNeoPolitics 1 points 3 days ago If they want me to like jews, could they at least quit being reprehensible for at least one fucking day. permalink award report block reply Zippitydoodah 1 points 3 days ago If abortion were banned, we'd have many more black people. 3x? 4x? They'd be the majority of the population. permalink award report block reply Constitution_1788 1 points 3 days ago Go Greg, go. He loves it. As do I. permalink award report block reply billybaldwin2 1 points 3 days ago My local Planned Parenthood never has anyone there. Just 2 cars hanging out in back. I assume they're staff vehicles. The clinic looks creepy. Brown accents with dingy white tiles. It looks like a horror movie clinic, even in the daytime. Really undesirable to go to. There are other doctors and clinics that provide the same services that look better, like you wouldn't fear for your life being inside. permalink award report block reply SickofItall 1 points 3 days ago That mark of cain on the interviewer...ooof! permalink award report block reply RememberCharlieKirk 2 points 4 days ago Comment removed by community filter, pending further review. permalink award report block reply\nThan0sIII 77 points 4 days ago It's so fucking frustrating that we somehow got to this point where they're literally killing unborn children who have no say in the matter, and somehow it's not treated as morally reprehensible as it should always be. permalink award report block reply _Sully_ 38 points 4 days ago Because you are trying to convince evil to be good. When they are evil because its easy. Like trying to convince an addict that getting high doesn't feel good. It absolutely does. That's why they do it. permalink parent award report block reply NewGoldenAge 21 points 4 days ago After they shot Charlie - it's like we should exterminate vermin and evil from the face of the Earth. Go for it. FIRE AWAY. permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago So true! permalink parent award report block reply Viewer01 29 points 4 days ago People don’t understand the scale of it. Over 15 million Gen z was aborted. That’s 1/3 of them. This is more murders than all homicides and war casualties in the history of the United States. I know no one here is paying attention to the groypers but they’re dead set on repealing the 19th because this is just heinous behavior from our women. They literally rival Stalin for deaths. permalink parent award report block reply Appeal2Heaven98 25 points 4 days ago I fucking hate what they're doing to my generation. First, they kill a third of us. Now, they're making life a living hell for the remaining 2/3rds. And they dare say we're lazy while robbing us of a decent life. permalink parent award report block reply RememberCharlieKirk 21 points 4 days ago While women tend to present themselves as one-issue voters over abortion, plenty of (disgusting) men are also in favor of abortion. Look at the figurehead of Barstool -- he said that his vote will flip for Democrats if the Republicans push for restrictions on abortion. There was also that long-serving Republican Congressman Tim Murphy who persuaded his mistress into having an abortion. He resigned in 2017 and, by doing so, gave Democrats another seat in the House of Representatives. permalink parent award report block reply Dangerous 9 points 4 days ago Weak men follow what women approve of. Reprehensible men tell women what they should approve of. Women prefer Reprehensible men permalink parent award report block reply Sgt_Hulka 2 points 3 days ago I’d bet money that Zuckerberg’s bastard brother is already voting Democrat. Fuck Portnoy permalink parent award report block reply RememberCharlieKirk 1 points 3 days ago If Portnoy could openly come out as a Democrat voter, that would be great. He is not a face that anyone should want representing the Republican voting base. permalink parent award report block reply Aquamine-Amarine 4 points 4 days ago Stealing voting rights isn't going to magically make leftist women smart. It also does nothing in regards to stupid leftist men. The source of the problem will always be the schools. Leftists learned this stuff from somewhere. 18+ years of public school and then college brainwashing. Letting the left infiltrate the education system and media was the greatest mistake conservatives made. permalink parent award report block reply Viewer01 10 points 4 days ago Go check up on voting habits. This country becomes 2/3 supermajority if white mens vote. permalink parent award report block reply guywholikesDjtof2024 5 points 4 days ago Stupid men do exist. You are right. Those stupid men made the 19 Amenmdent. permalink parent award report block reply Burneraccountno4 1 points 3 days ago Let's be honest. The vast majority of those babies were doomed the moment they were conceived because they were the product of a degenerate act. There was never a loving biological mother or father in the picture - just two selfish randos who wanted to fuck. Best case scenario the kid would have been adopted by a loving family. Unfortunately these days, faggots are given priority during the adoption process, so most of these kids would be subjected to horrific abuse either way had they not been aborted. permalink parent award report block reply Memebot 21 points 4 days ago A great radio host named Jim Quinn used to say \"The left stand on their head and tell you that you are upside down.\" permalink parent award report block reply Flubadub 3 points 3 days ago RIP Jim 😢 🙏🏻 he was the reason I became a conservative. I was listening to him talk politics in between songs on WRRK before I even knew who Rush was. permalink parent award report block reply Appeal2Heaven98 12 points 4 days ago I third of my generation (Gen Z) was genocided because of abortion. permalink parent award report block reply ShotgunParade69x 4 points 4 days ago Are we gonna be denied the Hayes of heaven for not slaughtering these evil demon basatrds ? permalink parent award report block reply load 3 more comments...\n_Sully_ 38 points 4 days ago Because you are trying to convince evil to be good. When they are evil because its easy. Like trying to convince an addict that getting high doesn't feel good. It absolutely does. That's why they do it. permalink parent award report block reply NewGoldenAge 21 points 4 days ago After they shot Charlie - it's like we should exterminate vermin and evil from the face of the Earth. Go for it. FIRE AWAY. permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago So true! permalink parent award report block reply\nNewGoldenAge 21 points 4 days ago After they shot Charlie - it's like we should exterminate vermin and evil from the face of the Earth. Go for it. FIRE AWAY. permalink parent award report block reply\nguywholikesDjtof2024 4 points 4 days ago So true! permalink parent award report block reply\nViewer01 29 points 4 days ago People don’t understand the scale of it. Over 15 million Gen z was aborted. That’s 1/3 of them. This is more murders than all homicides and war casualties in the history of the United States. I know no one here is paying attention to the groypers but they’re dead set on repealing the 19th because this is just heinous behavior from our women. They literally rival Stalin for deaths. permalink parent award report block reply Appeal2Heaven98 25 points 4 days ago I fucking hate what they're doing to my generation. First, they kill a third of us. Now, they're making life a living hell for the remaining 2/3rds. And they dare say we're lazy while robbing us of a decent life. permalink parent award report block reply RememberCharlieKirk 21 points 4 days ago While women tend to present themselves as one-issue voters over abortion, plenty of (disgusting) men are also in favor of abortion. Look at the figurehead of Barstool -- he said that his vote will flip for Democrats if the Republicans push for restrictions on abortion. There was also that long-serving Republican Congressman Tim Murphy who persuaded his mistress into having an abortion. He resigned in 2017 and, by doing so, gave Democrats another seat in the House of Representatives. permalink parent award report block reply Dangerous 9 points 4 days ago Weak men follow what women approve of. Reprehensible men tell women what they should approve of. Women prefer Reprehensible men permalink parent award report block reply Sgt_Hulka 2 points 3 days ago I’d bet money that Zuckerberg’s bastard brother is already voting Democrat. Fuck Portnoy permalink parent award report block reply RememberCharlieKirk 1 points 3 days ago If Portnoy could openly come out as a Democrat voter, that would be great. He is not a face that anyone should want representing the Republican voting base. permalink parent award report block reply Aquamine-Amarine 4 points 4 days ago Stealing voting rights isn't going to magically make leftist women smart. It also does nothing in regards to stupid leftist men. The source of the problem will always be the schools. Leftists learned this stuff from somewhere. 18+ years of public school and then college brainwashing. Letting the left infiltrate the education system and media was the greatest mistake conservatives made. permalink parent award report block reply Viewer01 10 points 4 days ago Go check up on voting habits. This country becomes 2/3 supermajority if white mens vote. permalink parent award report block reply guywholikesDjtof2024 5 points 4 days ago Stupid men do exist. You are right. Those stupid men made the 19 Amenmdent. permalink parent award report block reply Burneraccountno4 1 points 3 days ago Let's be honest. The vast majority of those babies were doomed the moment they were conceived because they were the product of a degenerate act. There was never a loving biological mother or father in the picture - just two selfish randos who wanted to fuck. Best case scenario the kid would have been adopted by a loving family. Unfortunately these days, faggots are given priority during the adoption process, so most of these kids would be subjected to horrific abuse either way had they not been aborted. permalink parent award report block reply\nAppeal2Heaven98 25 points 4 days ago I fucking hate what they're doing to my generation. First, they kill a third of us. Now, they're making life a living hell for the remaining 2/3rds. And they dare say we're lazy while robbing us of a decent life. permalink parent award report block reply\nRememberCharlieKirk 21 points 4 days ago While women tend to present themselves as one-issue voters over abortion, plenty of (disgusting) men are also in favor of abortion. Look at the figurehead of Barstool -- he said that his vote will flip for Democrats if the Republicans push for restrictions on abortion. There was also that long-serving Republican Congressman Tim Murphy who persuaded his mistress into having an abortion. He resigned in 2017 and, by doing so, gave Democrats another seat in the House of Representatives. permalink parent award report block reply Dangerous 9 points 4 days ago Weak men follow what women approve of. Reprehensible men tell women what they should approve of. Women prefer Reprehensible men permalink parent award report block reply Sgt_Hulka 2 points 3 days ago I’d bet money that Zuckerberg’s bastard brother is already voting Democrat. Fuck Portnoy permalink parent award report block reply RememberCharlieKirk 1 points 3 days ago If Portnoy could openly come out as a Democrat voter, that would be great. He is not a face that anyone should want representing the Republican voting base. permalink parent award report block reply\nDangerous 9 points 4 days ago Weak men follow what women approve of. Reprehensible men tell women what they should approve of. Women prefer Reprehensible men permalink parent award report block reply\nSgt_Hulka 2 points 3 days ago I’d bet money that Zuckerberg’s bastard brother is already voting Democrat. Fuck Portnoy permalink parent award report block reply RememberCharlieKirk 1 points 3 days ago If Portnoy could openly come out as a Democrat voter, that would be great. He is not a face that anyone should want representing the Republican voting base. permalink parent award report block reply\nRememberCharlieKirk 1 points 3 days ago If Portnoy could openly come out as a Democrat voter, that would be great. He is not a face that anyone should want representing the Republican voting base. permalink parent award report block reply\nAquamine-Amarine 4 points 4 days ago Stealing voting rights isn't going to magically make leftist women smart. It also does nothing in regards to stupid leftist men. The source of the problem will always be the schools. Leftists learned this stuff from somewhere. 18+ years of public school and then college brainwashing. Letting the left infiltrate the education system and media was the greatest mistake conservatives made. permalink parent award report block reply Viewer01 10 points 4 days ago Go check up on voting habits. This country becomes 2/3 supermajority if white mens vote. permalink parent award report block reply guywholikesDjtof2024 5 points 4 days ago Stupid men do exist. You are right. Those stupid men made the 19 Amenmdent. permalink parent award report block reply\nViewer01 10 points 4 days ago Go check up on voting habits. This country becomes 2/3 supermajority if white mens vote. permalink parent award report block reply\nguywholikesDjtof2024 5 points 4 days ago Stupid men do exist. You are right. Those stupid men made the 19 Amenmdent. permalink parent award report block reply\nBurneraccountno4 1 points 3 days ago Let's be honest. The vast majority of those babies were doomed the moment they were conceived because they were the product of a degenerate act. There was never a loving biological mother or father in the picture - just two selfish randos who wanted to fuck. Best case scenario the kid would have been adopted by a loving family. Unfortunately these days, faggots are given priority during the adoption process, so most of these kids would be subjected to horrific abuse either way had they not been aborted. permalink parent award report block reply\nMemebot 21 points 4 days ago A great radio host named Jim Quinn used to say \"The left stand on their head and tell you that you are upside down.\" permalink parent award report block reply Flubadub 3 points 3 days ago RIP Jim 😢 🙏🏻 he was the reason I became a conservative. I was listening to him talk politics in between songs on WRRK before I even knew who Rush was. permalink parent award report block reply\nFlubadub 3 points 3 days ago RIP Jim 😢 🙏🏻 he was the reason I became a conservative. I was listening to him talk politics in between songs on WRRK before I even knew who Rush was. permalink parent award report block reply\nAppeal2Heaven98 12 points 4 days ago I third of my generation (Gen Z) was genocided because of abortion. permalink parent award report block reply\nShotgunParade69x 4 points 4 days ago Are we gonna be denied the Hayes of heaven for not slaughtering these evil demon basatrds ? permalink parent award report block reply\nTheRedPilledArtist 30 points 4 days ago I'm thankful I wasn't aborted. permalink award report block reply KernalMustard 16 points 4 days ago I just wish I had a different mother. I have said just 5 words to her in 35y. She showed up one day at the 2nd location. I wanted to be some place else at that moment. permalink parent award report block reply carpetxparmesan 8 points 4 days ago Eesh, and here I was going into an abortion thread expecting light fare! permalink parent award report block reply Female 7 points 4 days ago 10 When my father and my mother forsake me, then the LORD will take me up. 11 Teach me thy way, O LORD, and lead me in a plain path, because of mine enemies. 12 Deliver me not over unto the will of mine enemies: for false witnesses are risen up against me, and such as breathe out cruelty. 13 I had fainted, unless I had believed to see the goodness of the LORD in the land of the living. 14 Wait on the LORD: be of good courage, and he shall strengthen thine heart: wait, I say, on the LORD. Psalms chapter 27 KJV permalink parent award report block reply jonnyuno 2 points 3 days ago My parents are amazing while my spouse, ignoring childhood trauma, continues to destroy from within.  Thankful for God fearing, prayerful parents who remind me they love me when my spouse does not.   These verses are a huge encouragement! permalink parent award report block reply MAGABOND 2 points 4 days ago I wish that faggot from NYT was, along with all liberals. It’s not too fucking late you know. permalink parent award report block reply\nKernalMustard 16 points 4 days ago I just wish I had a different mother. I have said just 5 words to her in 35y. She showed up one day at the 2nd location. I wanted to be some place else at that moment. permalink parent award report block reply carpetxparmesan 8 points 4 days ago Eesh, and here I was going into an abortion thread expecting light fare! permalink parent award report block reply Female 7 points 4 days ago 10 When my father and my mother forsake me, then the LORD will take me up. 11 Teach me thy way, O LORD, and lead me in a plain path, because of mine enemies. 12 Deliver me not over unto the will of mine enemies: for false witnesses are risen up against me, and such as breathe out cruelty. 13 I had fainted, unless I had believed to see the goodness of the LORD in the land of the living. 14 Wait on the LORD: be of good courage, and he shall strengthen thine heart: wait, I say, on the LORD. Psalms chapter 27 KJV permalink parent award report block reply jonnyuno 2 points 3 days ago My parents are amazing while my spouse, ignoring childhood trauma, continues to destroy from within.  Thankful for God fearing, prayerful parents who remind me they love me when my spouse does not.   These verses are a huge encouragement! permalink parent award report block reply\ncarpetxparmesan 8 points 4 days ago Eesh, and here I was going into an abortion thread expecting light fare! permalink parent award report block reply\nFemale 7 points 4 days ago 10 When my father and my mother forsake me, then the LORD will take me up. 11 Teach me thy way, O LORD, and lead me in a plain path, because of mine enemies. 12 Deliver me not over unto the will of mine enemies: for false witnesses are risen up against me, and such as breathe out cruelty. 13 I had fainted, unless I had believed to see the goodness of the LORD in the land of the living. 14 Wait on the LORD: be of good courage, and he shall strengthen thine heart: wait, I say, on the LORD. Psalms chapter 27 KJV permalink parent award report block reply jonnyuno 2 points 3 days ago My parents are amazing while my spouse, ignoring childhood trauma, continues to destroy from within.  Thankful for God fearing, prayerful parents who remind me they love me when my spouse does not.   These verses are a huge encouragement! permalink parent award report block reply\njonnyuno 2 points 3 days ago My parents are amazing while my spouse, ignoring childhood trauma, continues to destroy from within.  Thankful for God fearing, prayerful parents who remind me they love me when my spouse does not.   These verses are a huge encouragement! permalink parent award report block reply\nMAGABOND 2 points 4 days ago I wish that faggot from NYT was, along with all liberals. It’s not too fucking late you know. permalink parent award report block reply\nTacitus1963 21 points 4 days ago Abortion is the \"sacrament\" of the Demtard party.\nThey love offering sacrifices to Moloch.\nThey supplement aborted babies with all the kids they turn tranny with those demonic surgeries.\nThey allow babies who have survived the horrendous abortion procedure to die on a sterile table before discarding them in the trash. permalink award report block reply SanityGumby 12 points 4 days ago I am old enough to remember when they brought a mobile abortion clinic to their national convention. permalink parent award report block reply Tacitus1963 6 points 4 days ago I'm old enough too as I remember that. permalink parent award report block reply KernalMustard -2 points 4 days ago Can you show me them worshipping Moloch? permalink parent award report block reply Dangerous 11 points 4 days ago https://www.wikileaks.org/clinton-emails/emailid/14333 \"With fingers crossed, the old rabbit's foot out of the box in the attic, I will be sacrificing a chicken in the backyard to Moloch . . .\" There is also the whole Bohemian Grove stuff and the Moloch temples with Lilith owls of Epstein Island permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago \" bUt aThiEsM iS tRue AnD God is fAke!!!!!11!1\" - ignorant nonChristians atheists permalink parent award report block reply\nSanityGumby 12 points 4 days ago I am old enough to remember when they brought a mobile abortion clinic to their national convention. permalink parent award report block reply Tacitus1963 6 points 4 days ago I'm old enough too as I remember that. permalink parent award report block reply\nTacitus1963 6 points 4 days ago I'm old enough too as I remember that. permalink parent award report block reply\nKernalMustard -2 points 4 days ago Can you show me them worshipping Moloch? permalink parent award report block reply Dangerous 11 points 4 days ago https://www.wikileaks.org/clinton-emails/emailid/14333 \"With fingers crossed, the old rabbit's foot out of the box in the attic, I will be sacrificing a chicken in the backyard to Moloch . . .\" There is also the whole Bohemian Grove stuff and the Moloch temples with Lilith owls of Epstein Island permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago \" bUt aThiEsM iS tRue AnD God is fAke!!!!!11!1\" - ignorant nonChristians atheists permalink parent award report block reply\nDangerous 11 points 4 days ago https://www.wikileaks.org/clinton-emails/emailid/14333 \"With fingers crossed, the old rabbit's foot out of the box in the attic, I will be sacrificing a chicken in the backyard to Moloch . . .\" There is also the whole Bohemian Grove stuff and the Moloch temples with Lilith owls of Epstein Island permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago \" bUt aThiEsM iS tRue AnD God is fAke!!!!!11!1\" - ignorant nonChristians atheists permalink parent award report block reply\nguywholikesDjtof2024 4 points 4 days ago \" bUt aThiEsM iS tRue AnD God is fAke!!!!!11!1\" - ignorant nonChristians atheists permalink parent award report block reply\nthunderpussy 18 points 4 days ago Yeah, they aren't a cupcake shop.... permalink award report block reply\nNimbleNavigation2024 18 points 4 days ago \"In your face\" hahahahaha permalink award report block reply politicsaside 7 points 4 days ago That was the best part. permalink parent award report block reply carpetxparmesan 4 points 4 days ago 2025: \"they're killing children! HAHA!\" 🫤 Not sure what's worse, the fact that this is reality, or the fact that it's such a brilliantly layered joke, that faggot probably DOES HAVE some baby foreskin extract on his facial routine. reaches for the orbital escape handle permalink parent award report block reply\npoliticsaside 7 points 4 days ago That was the best part. permalink parent award report block reply carpetxparmesan 4 points 4 days ago 2025: \"they're killing children! HAHA!\" 🫤 Not sure what's worse, the fact that this is reality, or the fact that it's such a brilliantly layered joke, that faggot probably DOES HAVE some baby foreskin extract on his facial routine. reaches for the orbital escape handle permalink parent award report block reply\ncarpetxparmesan 4 points 4 days ago 2025: \"they're killing children! HAHA!\" 🫤 Not sure what's worse, the fact that this is reality, or the fact that it's such a brilliantly layered joke, that faggot probably DOES HAVE some baby foreskin extract on his facial routine. reaches for the orbital escape handle permalink parent award report block reply\nFuckEveryDemocrat 18 points 4 days ago My ex getting an abortion because “we weren’t ready for kids” is why we broke up. I’ll literally never forgive her for killing my son. permalink award report block reply Aquamine-Amarine 8 points 4 days ago I'm so sorry. permalink parent award report block reply carpetxparmesan 5 points 4 days ago I'll say it, I'm not sorry he dodged that bullet. Most men don't survive an abortion. Ba dum tis Siri, play in the arms of an angel! Jokes aside, I hope he meets a less haunted vagina. Although, that is a very strong opening: \"are you going to kill our children? tha's a hard line for me\". Usually you look a little weird opening with that one but I think he can actually pull it off. permalink parent award report block reply Fistmagic 3 points 3 days ago That's my haunted vagina joke!  Glad to see it going around.  Just tell them you're scared of ghosts. permalink parent award report block reply Female 1 points 2 days ago his username 'F* every Democrat' implies promiscuity, however permalink parent award report block reply lukenator1 8 points 4 days ago sorry to hear that permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago What do you believe forgiveness entails, and why? permalink parent award report block reply FUCK_TYLER 1 points 3 days ago Its Gods job to forgive, not his permalink parent award report block reply guywholikesDjtof2024 1 points 3 days ago Jesus: \"Forgive seventy times seven\" permalink parent award report block reply Isolated_Patriot 3 points 3 days ago Please don't misuse the bible in such a condescending way. Jesus was asked how many times we should forgive our BROTHERS who repent. Not how many times we should forgive murderers etc. permalink parent award report block reply view 5 more comments... FUCK_TYLER 2 points 3 days ago Im sure this is one sin Jesus can forgive him for permalink parent award report block reply FUCK_TYLER 1 points 3 days ago Im so sorry 💔 permalink parent award report block reply\nAquamine-Amarine 8 points 4 days ago I'm so sorry. permalink parent award report block reply carpetxparmesan 5 points 4 days ago I'll say it, I'm not sorry he dodged that bullet. Most men don't survive an abortion. Ba dum tis Siri, play in the arms of an angel! Jokes aside, I hope he meets a less haunted vagina. Although, that is a very strong opening: \"are you going to kill our children? tha's a hard line for me\". Usually you look a little weird opening with that one but I think he can actually pull it off. permalink parent award report block reply Fistmagic 3 points 3 days ago That's my haunted vagina joke!  Glad to see it going around.  Just tell them you're scared of ghosts. permalink parent award report block reply Female 1 points 2 days ago his username 'F* every Democrat' implies promiscuity, however permalink parent award report block reply\ncarpetxparmesan 5 points 4 days ago I'll say it, I'm not sorry he dodged that bullet. Most men don't survive an abortion. Ba dum tis Siri, play in the arms of an angel! Jokes aside, I hope he meets a less haunted vagina. Although, that is a very strong opening: \"are you going to kill our children? tha's a hard line for me\". Usually you look a little weird opening with that one but I think he can actually pull it off. permalink parent award report block reply Fistmagic 3 points 3 days ago That's my haunted vagina joke!  Glad to see it going around.  Just tell them you're scared of ghosts. permalink parent award report block reply Female 1 points 2 days ago his username 'F* every Democrat' implies promiscuity, however permalink parent award report block reply\nFistmagic 3 points 3 days ago That's my haunted vagina joke!  Glad to see it going around.  Just tell them you're scared of ghosts. permalink parent award report block reply Female 1 points 2 days ago his username 'F* every Democrat' implies promiscuity, however permalink parent award report block reply\nFemale 1 points 2 days ago his username 'F* every Democrat' implies promiscuity, however permalink parent award report block reply\nlukenator1 8 points 4 days ago sorry to hear that permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago What do you believe forgiveness entails, and why? permalink parent award report block reply FUCK_TYLER 1 points 3 days ago Its Gods job to forgive, not his permalink parent award report block reply guywholikesDjtof2024 1 points 3 days ago Jesus: \"Forgive seventy times seven\" permalink parent award report block reply Isolated_Patriot 3 points 3 days ago Please don't misuse the bible in such a condescending way. Jesus was asked how many times we should forgive our BROTHERS who repent. Not how many times we should forgive murderers etc. permalink parent award report block reply view 5 more comments... FUCK_TYLER 2 points 3 days ago Im sure this is one sin Jesus can forgive him for permalink parent award report block reply\nFUCK_TYLER 1 points 3 days ago Its Gods job to forgive, not his permalink parent award report block reply guywholikesDjtof2024 1 points 3 days ago Jesus: \"Forgive seventy times seven\" permalink parent award report block reply Isolated_Patriot 3 points 3 days ago Please don't misuse the bible in such a condescending way. Jesus was asked how many times we should forgive our BROTHERS who repent. Not how many times we should forgive murderers etc. permalink parent award report block reply view 5 more comments... FUCK_TYLER 2 points 3 days ago Im sure this is one sin Jesus can forgive him for permalink parent award report block reply\nguywholikesDjtof2024 1 points 3 days ago Jesus: \"Forgive seventy times seven\" permalink parent award report block reply Isolated_Patriot 3 points 3 days ago Please don't misuse the bible in such a condescending way. Jesus was asked how many times we should forgive our BROTHERS who repent. Not how many times we should forgive murderers etc. permalink parent award report block reply view 5 more comments... FUCK_TYLER 2 points 3 days ago Im sure this is one sin Jesus can forgive him for permalink parent award report block reply\nIsolated_Patriot 3 points 3 days ago Please don't misuse the bible in such a condescending way. Jesus was asked how many times we should forgive our BROTHERS who repent. Not how many times we should forgive murderers etc. permalink parent award report block reply view 5 more comments...\nFUCK_TYLER 2 points 3 days ago Im sure this is one sin Jesus can forgive him for permalink parent award report block reply\nFUCK_TYLER 1 points 3 days ago Im so sorry 💔 permalink parent award report block reply\nwestrock2000 13 points 4 days ago I watched a video on YouTube recently about the history of white people spending much time eradicating human sacrifice from the planet. It got me thinking about how people back then could rationalize human sacrifice to “please the gods” to improve crops and stuff. Then I started thinking about how today there are women who sacrifice their unborn because of the belief that it will improve their quality of life in the future. And I wondered if it really is just that easy to get people to rationalize human sacrifice. permalink award report block reply RememberCharlieKirk 11 points 4 days ago Watch Michelle Williams' acceptance speech for winning the Golden Globe Award for best actress. She praised herself for having had an abortion, and she raised up a golden award in tribute. She literally sacrificed her unborn child for a golden statue, her \"god.\" permalink parent award report block reply westrock2000 8 points 4 days ago The video if interested: https://youtu.be/sJs07ZNIh_Q permalink parent award report block reply Aquamine-Amarine 6 points 4 days ago Brainwashing and cults are very dangerous things. It really is that easy to get weak minded people to do terrible things. permalink parent award report block reply\nRememberCharlieKirk 11 points 4 days ago Watch Michelle Williams' acceptance speech for winning the Golden Globe Award for best actress. She praised herself for having had an abortion, and she raised up a golden award in tribute. She literally sacrificed her unborn child for a golden statue, her \"god.\" permalink parent award report block reply\nwestrock2000 8 points 4 days ago The video if interested: https://youtu.be/sJs07ZNIh_Q permalink parent award report block reply\nAquamine-Amarine 6 points 4 days ago Brainwashing and cults are very dangerous things. It really is that easy to get weak minded people to do terrible things. permalink parent award report block reply\ntlorsung 10 points 4 days ago It's a fact!  they are killing kids, mostly Black Kids! permalink award report block reply BlockWorks 14 points 4 days ago Sentiment about Margaret Sanger is... complicated. permalink parent award report block reply XlDEN 7 points 4 days ago Not killing. Goodifying. Words matter. permalink parent award report block reply TrumpAndGodWin 3 points 3 days ago Democrats have kept their plantation black population numbers at a stable number for a long time relative to their natural counterparts. permalink parent award report block reply\nBlockWorks 14 points 4 days ago Sentiment about Margaret Sanger is... complicated. permalink parent award report block reply\nXlDEN 7 points 4 days ago Not killing. Goodifying. Words matter. permalink parent award report block reply\nTrumpAndGodWin 3 points 3 days ago Democrats have kept their plantation black population numbers at a stable number for a long time relative to their natural counterparts. permalink parent award report block reply\nJesusTheOnlyWay 8 points 4 days ago This all transcends politics. It's the same good vs evil, Jesus vs Satan battle since the beginning. Only in abnormally good and decent times (1950s - 2000s) could so many pretend otherwise. permalink award report block reply\nfunwithguitars 6 points 4 days ago I have always been anti-abortion, but have recently thought we should put an abortion clinic on every street corner in democrat neighborhoods. The democrat party would be defunct in two generations. permalink award report block reply Dangerous 10 points 4 days ago No they wouldn't, they reproduce through fraud and social coercion not procreation permalink parent award report block reply HeavyMetalPatriot 6 points 4 days ago And open borders. permalink parent award report block reply Tardigrade 2 points 3 days ago Check out Lyman Stone. permalink parent award report block reply\nDangerous 10 points 4 days ago No they wouldn't, they reproduce through fraud and social coercion not procreation permalink parent award report block reply HeavyMetalPatriot 6 points 4 days ago And open borders. permalink parent award report block reply\nHeavyMetalPatriot 6 points 4 days ago And open borders. permalink parent award report block reply\nTardigrade 2 points 3 days ago Check out Lyman Stone. permalink parent award report block reply\nMAGAPlenty 4 points 4 days ago Practicers of eugenics like the nazis permalink award report block reply TrumpAndGodWin 2 points 3 days ago The nazis thought they'd have the support of the US and UK because they practiced eugenics of retards etc. permalink parent award report block reply\nTrumpAndGodWin 2 points 3 days ago The nazis thought they'd have the support of the US and UK because they practiced eugenics of retards etc. permalink parent award report block reply\nHikedelics 4 points 4 days ago One day I hope that when we see a headline about “demolishing” someone over abortion, it actually involves something like a sledgehammer to their head. I’m not even asking for violence so much as that I want the headline to match what actually took place. If baby murderers were to get demolished though, well that’d be just fine. permalink award report block reply guywholikesDjtof2024 3 points 4 days ago In the Old Testament, capital punishment was used. Almost as if God is Perfectly Just. permalink parent award report block reply ianpatrick1966 1 points 3 days ago We used to explode the clinics and assassins targeted the docs Those weee the good old days for sure Then we handed the movement off to gen X and Z and holy fuck A meme and a tweet don’t really strike the same fear permalink parent award report block reply\nguywholikesDjtof2024 3 points 4 days ago In the Old Testament, capital punishment was used. Almost as if God is Perfectly Just. permalink parent award report block reply\nianpatrick1966 1 points 3 days ago We used to explode the clinics and assassins targeted the docs Those weee the good old days for sure Then we handed the movement off to gen X and Z and holy fuck A meme and a tweet don’t really strike the same fear permalink parent award report block reply\nPeekov3 3 points 4 days ago Ok, that was a 💣 bombshell 💣 permalink award report block reply\nMAGALADON9 2 points 3 days ago David Marchese is ..... drum roll..... a Jewish athiest. permalink award report block reply\nNewGoldenAge 2 points 4 days ago Evil is only a mater of will and pest control of vermin. Take appropriate action. permalink award report block reply\nLurker6 2 points 4 days ago Oh no, not angry letters.  Maybe when these people start getting bullets to the neck I'll be sympathetic. permalink award report block reply\nWashington_Redskins 2 points 3 days ago Gutfield should set up a special show in which they have tiny plastic fetuses and they demonstrate the various methods they that Planned Parenthood uses to murder these babies whether it is saline injection or piercing their skulls and vacuuming out their brains or whichever method so that people can see how brutal Planned Parenthood really is permalink award report block reply\nMerlynTrump 1 points 4 days ago He's not wrong permalink award report block reply\nSickOfNeoPolitics 1 points 3 days ago If they want me to like jews, could they at least quit being reprehensible for at least one fucking day. permalink award report block reply\nZippitydoodah 1 points 3 days ago If abortion were banned, we'd have many more black people. 3x? 4x? They'd be the majority of the population. permalink award report block reply\nConstitution_1788 1 points 3 days ago Go Greg, go. He loves it. As do I. permalink award report block reply\nbillybaldwin2 1 points 3 days ago My local Planned Parenthood never has anyone there. Just 2 cars hanging out in back. I assume they're staff vehicles. The clinic looks creepy. Brown accents with dingy white tiles. It looks like a horror movie clinic, even in the daytime. Really undesirable to go to. There are other doctors and clinics that provide the same services that look better, like you wouldn't fear for your life being inside. permalink award report block reply\nSickofItall 1 points 3 days ago That mark of cain on the interviewer...ooof! permalink award report block reply\nRememberCharlieKirk 2 points 4 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T20:09:19.706510Z"
}