{
  "id": "8185727",
  "title": "49Yay public schoolposted1 hour agobyFearGodTheAlmighty20 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK9nPd3v/yay-public-school/c",
  "content": "56 Yay public school posted 1 hour ago by FearGodTheAlmighty 24 comments award share download report block\n24 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno UntakenUsername 10 points 52 minutes ago This is the state of public school these days. This is one of the reasons my son has never and never will attend one of those institutions. We also don't want him beaten to death by one of the many ferals on those campuses. permalink award report block reply War_Hamster 2 points 6 minutes ago This \"teacher\" wouldn't have passed my HS freshman English teacher. That was painful to read, I can't imagine how bad the students are. permalink parent award report block reply BenDoverAssho 2 points 5 minutes ago Check out the book, \" The Preparation \" by Doug Casey. It's a \" how to\" guide on getting a better, more practical, education\nthan you will ever get in today's colleges.\n( ** at a fraction of the cost too!) permalink parent award report block reply FearGodTheAlmighty OP 1 points 1 minute ago Check out the holy bible permalink parent award report block reply btcsilver 8 points 1 hour ago Now, try working with those people when they are force graduated. permalink award report block reply FearGodTheAlmighty OP 5 points 59 minutes ago You think they go out and get jobs? permalink parent award report block reply shadypollster 6 points 58 minutes ago Yeah. Their job is to destroy society. permalink parent award report block reply sobriquet 2 points 16 minutes ago They make coffee and can't count change. permalink parent award report block reply FearGodTheAlmighty OP 2 points 9 minutes ago They don't work dude permalink parent award report block reply henri_derelicte 4 points 53 minutes ago I’m grateful I don’t have to. Because those people are hopefully the ones asking “would you like fries with that?” permalink parent award report block reply henri_derelicte 7 points 54 minutes ago Schools need to be able to fail/hold back students again. There’s too much pressure to let them pass and keep moving up even if they’re not ready because not doing so makes teachers, admins, parents, and to a lesser extent students look bad. permalink award report block reply Elencher 4 points 20 minutes ago Its racist when you disprortionally hold back blacks because they're unwilling to admit that blacks are disproportionately retarded. permalink parent award report block reply henri_derelicte 3 points 16 minutes ago They had to lower the IQ threshold for being mentally retarded because a disproportionate number of blacks were below the threshold. And DNA scientist James Watson was cancelled for publicly saying there are genetic differences between Whites and blacks causing problems because we keep trying to treat them as equals permalink parent award report block reply FearGodTheAlmighty OP 4 points 43 minutes ago Public schools need demolished. permalink parent award report block reply BenDoverAssho 4 points 1 hour ago I wonder what city and school district this teacher works in. I'm going to make a wild-ass guess and say it's in the ghetto section of town. permalink award report block reply FearGodTheAlmighty OP 3 points 58 minutes ago Doesn't matter, all public schools are dumpsters. permalink parent award report block reply BenDoverAssho 3 points 53 minutes ago Yep. permalink parent award report block reply sobriquet 2 points 11 minutes ago I graduated from high school a long time ago, and public school was well on its way to this destination back then.  Most of my HS classes were simply baby sitting crayon eaters. When I started English 101 in community College, a good portion of my peers were functionally illiterate.  I connected with my professor, cuz I had read (and could talk about) Asimov, and Vonnegut. permalink parent award report block reply redditadminssuckit 3 points 52 minutes ago \"DEY BE FUTURE SCIENTIST AND SHEIT\" permalink award report block reply PatriotSkorzeny 3 points 46 minutes ago “Why H1B’s.” 😒 permalink award report block reply NotYourMan 2 points 9 minutes ago Democratic politicians \"Lock down the country to slow the spread of COVID\".  Oh wait, that didn't work because everybody got it anyway and they destroyed a generation of children so democratic politicians failed the people.  Of course, they blame Trump. permalink award report block reply NeverNotTrump 2 points 20 minutes ago \"Co-taught\" is the problem.  \"My co-teacher...\"  Imagine having to deal with two teachers and disparate teaching styles, etc?  If anything, this is a condemnation of \"co-teaching\" (WhateverTF that is.) permalink award report block reply FearGodTheAlmighty OP 1 points 9 minutes ago \"Public school\" is the problem \"Bulldozer\" is the correct answer permalink parent award report block reply ManWhoMakesTheMusic 1 points 4 minutes ago She's just describing public school. Nothing more. permalink award report block reply CheeseAndOnion 1 points 1 minute ago But dey da same as us. It only be dat whites be keeping dem down. permalink award report block reply\nUntakenUsername 10 points 52 minutes ago This is the state of public school these days. This is one of the reasons my son has never and never will attend one of those institutions. We also don't want him beaten to death by one of the many ferals on those campuses. permalink award report block reply War_Hamster 2 points 6 minutes ago This \"teacher\" wouldn't have passed my HS freshman English teacher. That was painful to read, I can't imagine how bad the students are. permalink parent award report block reply BenDoverAssho 2 points 5 minutes ago Check out the book, \" The Preparation \" by Doug Casey. It's a \" how to\" guide on getting a better, more practical, education\nthan you will ever get in today's colleges.\n( ** at a fraction of the cost too!) permalink parent award report block reply FearGodTheAlmighty OP 1 points 1 minute ago Check out the holy bible permalink parent award report block reply\nWar_Hamster 2 points 6 minutes ago This \"teacher\" wouldn't have passed my HS freshman English teacher. That was painful to read, I can't imagine how bad the students are. permalink parent award report block reply\nBenDoverAssho 2 points 5 minutes ago Check out the book, \" The Preparation \" by Doug Casey. It's a \" how to\" guide on getting a better, more practical, education\nthan you will ever get in today's colleges.\n( ** at a fraction of the cost too!) permalink parent award report block reply FearGodTheAlmighty OP 1 points 1 minute ago Check out the holy bible permalink parent award report block reply\nFearGodTheAlmighty OP 1 points 1 minute ago Check out the holy bible permalink parent award report block reply\nbtcsilver 8 points 1 hour ago Now, try working with those people when they are force graduated. permalink award report block reply FearGodTheAlmighty OP 5 points 59 minutes ago You think they go out and get jobs? permalink parent award report block reply shadypollster 6 points 58 minutes ago Yeah. Their job is to destroy society. permalink parent award report block reply sobriquet 2 points 16 minutes ago They make coffee and can't count change. permalink parent award report block reply FearGodTheAlmighty OP 2 points 9 minutes ago They don't work dude permalink parent award report block reply henri_derelicte 4 points 53 minutes ago I’m grateful I don’t have to. Because those people are hopefully the ones asking “would you like fries with that?” permalink parent award report block reply\nFearGodTheAlmighty OP 5 points 59 minutes ago You think they go out and get jobs? permalink parent award report block reply shadypollster 6 points 58 minutes ago Yeah. Their job is to destroy society. permalink parent award report block reply sobriquet 2 points 16 minutes ago They make coffee and can't count change. permalink parent award report block reply FearGodTheAlmighty OP 2 points 9 minutes ago They don't work dude permalink parent award report block reply\nshadypollster 6 points 58 minutes ago Yeah. Their job is to destroy society. permalink parent award report block reply\nsobriquet 2 points 16 minutes ago They make coffee and can't count change. permalink parent award report block reply FearGodTheAlmighty OP 2 points 9 minutes ago They don't work dude permalink parent award report block reply\nFearGodTheAlmighty OP 2 points 9 minutes ago They don't work dude permalink parent award report block reply\nhenri_derelicte 4 points 53 minutes ago I’m grateful I don’t have to. Because those people are hopefully the ones asking “would you like fries with that?” permalink parent award report block reply\nhenri_derelicte 7 points 54 minutes ago Schools need to be able to fail/hold back students again. There’s too much pressure to let them pass and keep moving up even if they’re not ready because not doing so makes teachers, admins, parents, and to a lesser extent students look bad. permalink award report block reply Elencher 4 points 20 minutes ago Its racist when you disprortionally hold back blacks because they're unwilling to admit that blacks are disproportionately retarded. permalink parent award report block reply henri_derelicte 3 points 16 minutes ago They had to lower the IQ threshold for being mentally retarded because a disproportionate number of blacks were below the threshold. And DNA scientist James Watson was cancelled for publicly saying there are genetic differences between Whites and blacks causing problems because we keep trying to treat them as equals permalink parent award report block reply FearGodTheAlmighty OP 4 points 43 minutes ago Public schools need demolished. permalink parent award report block reply\nElencher 4 points 20 minutes ago Its racist when you disprortionally hold back blacks because they're unwilling to admit that blacks are disproportionately retarded. permalink parent award report block reply henri_derelicte 3 points 16 minutes ago They had to lower the IQ threshold for being mentally retarded because a disproportionate number of blacks were below the threshold. And DNA scientist James Watson was cancelled for publicly saying there are genetic differences between Whites and blacks causing problems because we keep trying to treat them as equals permalink parent award report block reply\nhenri_derelicte 3 points 16 minutes ago They had to lower the IQ threshold for being mentally retarded because a disproportionate number of blacks were below the threshold. And DNA scientist James Watson was cancelled for publicly saying there are genetic differences between Whites and blacks causing problems because we keep trying to treat them as equals permalink parent award report block reply\nFearGodTheAlmighty OP 4 points 43 minutes ago Public schools need demolished. permalink parent award report block reply\nBenDoverAssho 4 points 1 hour ago I wonder what city and school district this teacher works in. I'm going to make a wild-ass guess and say it's in the ghetto section of town. permalink award report block reply FearGodTheAlmighty OP 3 points 58 minutes ago Doesn't matter, all public schools are dumpsters. permalink parent award report block reply BenDoverAssho 3 points 53 minutes ago Yep. permalink parent award report block reply sobriquet 2 points 11 minutes ago I graduated from high school a long time ago, and public school was well on its way to this destination back then.  Most of my HS classes were simply baby sitting crayon eaters. When I started English 101 in community College, a good portion of my peers were functionally illiterate.  I connected with my professor, cuz I had read (and could talk about) Asimov, and Vonnegut. permalink parent award report block reply\nFearGodTheAlmighty OP 3 points 58 minutes ago Doesn't matter, all public schools are dumpsters. permalink parent award report block reply BenDoverAssho 3 points 53 minutes ago Yep. permalink parent award report block reply\nBenDoverAssho 3 points 53 minutes ago Yep. permalink parent award report block reply\nsobriquet 2 points 11 minutes ago I graduated from high school a long time ago, and public school was well on its way to this destination back then.  Most of my HS classes were simply baby sitting crayon eaters. When I started English 101 in community College, a good portion of my peers were functionally illiterate.  I connected with my professor, cuz I had read (and could talk about) Asimov, and Vonnegut. permalink parent award report block reply\nredditadminssuckit 3 points 52 minutes ago \"DEY BE FUTURE SCIENTIST AND SHEIT\" permalink award report block reply\nPatriotSkorzeny 3 points 46 minutes ago “Why H1B’s.” 😒 permalink award report block reply\nNotYourMan 2 points 9 minutes ago Democratic politicians \"Lock down the country to slow the spread of COVID\".  Oh wait, that didn't work because everybody got it anyway and they destroyed a generation of children so democratic politicians failed the people.  Of course, they blame Trump. permalink award report block reply\nNeverNotTrump 2 points 20 minutes ago \"Co-taught\" is the problem.  \"My co-teacher...\"  Imagine having to deal with two teachers and disparate teaching styles, etc?  If anything, this is a condemnation of \"co-teaching\" (WhateverTF that is.) permalink award report block reply FearGodTheAlmighty OP 1 points 9 minutes ago \"Public school\" is the problem \"Bulldozer\" is the correct answer permalink parent award report block reply\nFearGodTheAlmighty OP 1 points 9 minutes ago \"Public school\" is the problem \"Bulldozer\" is the correct answer permalink parent award report block reply\nManWhoMakesTheMusic 1 points 4 minutes ago She's just describing public school. Nothing more. permalink award report block reply\nCheeseAndOnion 1 points 1 minute ago But dey da same as us. It only be dat whites be keeping dem down. permalink award report block reply"
}