{
  "id": "1ARK9jzcUK",
  "url": "https://patriots.win/p/1ARK9jzcUK/you-sir-can-sit-down-and-shut-up/c",
  "content": "256 You, sir, can sit down and shut up. posted 1 day ago by blue5707 5 comments award share report block Joanie Scott @JstJoan • 2d I worked under your FAA @PeteButtigieg and, after 34 years, mostly as an Air Traffic Controller, I retired because of how you and the Biden administration, to use your words, shit on every employee at the FAA and ruined a once fine agency. You allowed men into my office Pete Buttigieg @PeteButtigieg • 2d The President wouldn't last five minutes as an air traffic controller, and after everything they've been through - and the way this administration has treated them from Day One - he has no business shitting on them now.\n5 comments Sort by Top Top New Worst Old Save GuerillaYourDreams 8 points 1 day ago Faggots know all about shit. permalink award report block reply GTHAYS 4 points 1 day ago Yep.  His pickup line for years was \"Hello, can I push up your stool?\" permalink parent award report block reply TrumpMagaNoBama 6 points 1 day ago \"FAGGOT!\" permalink award report block reply quodvox 3 points 1 day ago I didn't know about the Credit Union programs for ATC.  Anyone here able to corroborate that or have first-hand experience? permalink award report block reply Steve56775 2 points 1 day ago He should go back to “breastfeeding” his victims. permalink award report block reply\nGuerillaYourDreams 8 points 1 day ago Faggots know all about shit. permalink award report block reply GTHAYS 4 points 1 day ago Yep.  His pickup line for years was \"Hello, can I push up your stool?\" permalink parent award report block reply\nGTHAYS 4 points 1 day ago Yep.  His pickup line for years was \"Hello, can I push up your stool?\" permalink parent award report block reply\nTrumpMagaNoBama 6 points 1 day ago \"FAGGOT!\" permalink award report block reply\nquodvox 3 points 1 day ago I didn't know about the Credit Union programs for ATC.  Anyone here able to corroborate that or have first-hand experience? permalink award report block reply\nSteve56775 2 points 1 day ago He should go back to “breastfeeding” his victims. permalink award report block reply",
  "fetched_at": "2025-11-12T20:56:19.491306Z"
}