{
  "id": "8182754",
  "title": "1221Nov 11, 1918: 107 years ago, a German delegate signed an Armistice with Supreme Allied Commander",
  "url": "https://patriots.win/p/1ARK9k0RhU/nov-11-1918-107-years-ago-a-germ/c",
  "content": "1221 Nov 11, 1918: 107 years ago, a German delegate signed an Armistice with Supreme Allied Commander Ferdinand Foch, officially ending WW1. The day is celebrated as “Armistice Day” across the world, officially being changed to “Veterans Day” in America in 1954. posted 1 day ago by Cyber1776 100 comments award share download report block\n100 comments Sort by Top Top New Worst Old Save JohnN 62 points 1 day ago WW1 was the worst catastrophe ever to befall human civilization. permalink award report block reply PhilipeNegro 44 points 1 day ago Yes, fighting the Kaiser gave rise to European communism, and just about every symptom of leftist cancer we deal with today. permalink parent award report block reply Cyber1776 OP 23 points 1 day ago The Kaiser literally is the reason communism exist in Europe. He funded Lenin and sent him into Russia to destroy it from within. After the Bolsheviks took over, they almost immediately surrendered to the Entente Powers in March 1918 in the treaty of Brest-Litovsk. Russia just gave up all claims to Eastern European territories to Germany. With the eastern front won, Germany shifted its he bulk of its force to Western Europe. permalink parent award report block reply _Sully_ 13 points 1 day ago It was the equivalent of sending in some hipster Democratic Socialists into Europe now and thinking it would be funny. Be careful what you wish for. permalink parent award report block reply Awakened 6 points 1 day ago Fascinating, because that meddling would catch up to them in WWII. permalink parent award report block reply dukeofdoorcounty 4 points 1 day ago But Lenin was in Switzerland.  The Kaiser probably didn't know what was going on. permalink parent award report block reply Cyber1776 OP 5 points 1 day ago No, the German high command literally funded Lenin’s return trip to Russia. The Tsar has abdicated, a new interim government was established and were set to have their first ever elections, but the intern government was still in the war against Germany. The Kaiser wanted Lenin in control because he preached an immediate end to the war and the Kaiser knew he would start a civil war in Russia, which he did. permalink parent award report block reply SqRt7744 3 points 1 day ago While that is literally true, it's incomplete. He was no communist but was forced to destabilize Russia for tactical purposes - brilliant, actually. All of this was caused by the war which they would have already won in 1916 if the USA hadn't gotten involved. And why did the USA get involved? They were dragged in by the Zionists to rescue the British in exchange for the British promising them Palestine (yes, this is insane but true). The result was everything that followed - from the rise of fascism as a pan-European anti communist movement to the capturing of half the globe by the communists, millions of deaths in WW2 and eventual subjugation of the west to Israel, as well as the total downfall of western Christian civilization and destruction of western man. permalink parent award report block reply AliceCooperBiden 4 points 1 day ago “War which they would have already won” Dude they were in a stalemate for 3 years before the US gets involved lol. The US entered the war in 1917 not 1916. The Germans weren’t winning and were actually doing pretty bad with the war of attrition that was going on. Because the US was funding the Entente and Germans had really no one significant funding them.  Also how you excuse communism as “he was forced to do it” is pathetic. permalink parent award report block reply view 4 more comments... covok48 2 points 1 day ago (((Zimmerman))) telegram. permalink parent award report block reply view 3 more comments... Cyber1776 OP 2 points 1 day ago Wrong. Germany can’t do protracted warfare, their entire model relies on quick and decisive actions. The moment they got bogged down into trench warfare in France they were basically fucked. permalink parent award report block reply view 2 more comments... TallestSkill -1 points 1 day ago The United States entered World War I in April 1917 because Germany resumed unrestricted submarine warfare that was sinking American merchant ships and killing civilians. The Zimmermann Telegram, in which Germany tried to convince Mexico to attack the United States, was the final cause that pushed Wilson to act. The Balfour Declaration came later in November 1917. It was a British statement of support for a Jewish homeland issued after the United States had already joined the war. It was not a treaty or a deal. It was a short letter from the British Foreign Secretary to Lord Rothschild, a British Jewish leader, expressing sympathy for Zionist goals. There is no evidence that American Zionists had the political power to pull the United States into war. President Wilson’s decision came from global strategy and domestic pressure, not from Jewish influence. The story that “Zionists dragged America into World War I” began as Nazi propaganda. It was created to blame Jews for Germany’s loss and to justify antisemitism. Blaming an entire people for a world war is weak history. The conflict began through a chain reaction among European empires, military plans, and nationalist ambitions, not through any hidden ethnic conspiracy. The true results of the war, such as the Treaty of Versailles, economic collapse, the rise of communism and fascism, and the second world war, came from the failure of European elites to reform after the destruction of industrial warfare. The early Zionist movement played only a small role until Britain saw it as useful leverage in the dying Ottoman Empire. America entered the war because Germany was acting like a pirate state. The story of a “Zionist deal for Palestine” is a myth that survives only because it gives people a single villain to blame for a complex and tragic chapter of history. permalink parent award report block reply view 8 more comments... bejeavis 1 points 1 day ago It's a nice thing to see when you're not the only one who knows history. permalink parent award report block reply Awakened 9 points 1 day ago The US had no business being part of it, but the bankers knew how much money and influence they could gain and they were right so here we are today still under their thumb. permalink parent award report block reply stillbringingitback 1 points 19 hours ago …so far lol permalink parent award report block reply mohel 0 points 1 day ago Why did it happen? permalink parent award report block reply JohnN 3 points 1 day ago Tough to say precisely.  Perhaps, among other reasons... European empires continuing their traditional struggles for dominance without understanding the drastic changes in military technology. The dominos of alliances that dragged everyone in. Germany's \"blank check\" to Austria-Hungary, whereby Germany essentially allowed Austria-Hungary to decide whether Germany went to war. permalink parent award report block reply mohel 0 points 1 day ago Tough to say precisely 100 years was not enough to figure it out? permalink parent award report block reply JohnN -1 points 1 day ago No, certainly not precisely.  History is written by the victors. Why do you think it happened? permalink parent award report block reply view 4 more comments... Ugh3rdaccount 28 points 1 day ago No more brother wars. permalink award report block reply daberoniandcheese 4 points 1 day ago There's one going on right now in Ukraine. We're funding it, of course. permalink parent award report block reply RINOssuck 22 points 1 day ago The treaty terms were so severe against Germany that it caused a second world war 20 years later.  Day is best remembered as Veterans Day. permalink award report block reply BadCompany 11 points 1 day ago There is no question this treaty drove hitler and the 3rd reich to European dominance thereafter its destruction permalink parent award report block reply RINOssuck 6 points 1 day ago Hitler ranting about the terms of the treaty was what allowed him to gain power.  Treaty that ended WW11 was no peach either.  It forbade Japan and Germany from having a military.  The US had to spend billions to protect them while they both became economic powerhouses. permalink parent award report block reply stars 2 points 1 day ago No look at the 1928 German election and then 1930. permalink parent award report block reply booblitchutz 2 points 1 day ago And now… permalink parent award report block reply SanityGumby 1 points 14 hours ago Powerhouse is relative. None ever rivaled the US. And Japan has changed course and is building a real military besides its defense force while being one of a handful of only true allies left permalink parent award report block reply bejeavis 2 points 1 day ago Who is really responsible for WW2? France. permalink parent award report block reply stars 0 points 1 day ago No the great depression is objectively what caused his rise. permalink parent award report block reply Cyber1776 OP 3 points 1 day ago I don’t buy this take anymore bc the terms on Germany after WW2 were much more severe. permalink parent award report block reply stjimmy92 1 points 1 day ago The biggest difference is that there was a reconstruction effort after WW2 (largely bankrolled by the US, shockingly /s) to prevent a repeat  of the conditions after WW1, plus things got really bad when the Great Depression hit, which also didn’t recur after WW2 permalink parent award report block reply rambler045 1 points 1 day ago Which is why we didn't punish them or the Japanese so severely after WWII. That and the smart ones had already figured out communism was the bigger problem. permalink parent award report block reply plateowner2024 14 points 1 day ago \"A veteran is someone who, at one point in their life, wrote a blank check made payable to ‘The United States of America,’ for an amount up to and including their life.\" — Unknown permalink award report block reply 67Vert 8 points 1 day ago Or was drafted and sent into war against their will, coerced into signing a blank check. permalink parent award report block reply _Sully_ 9 points 1 day ago Even though it's about the Brits I'm gonna watch They Shall Not Grow Old again. It's such an amazing Doc. That and Dan Carlin's WW1 eps. That was the first time I learned about the drum roll bombardment. Fucking shit people went through hell. permalink award report block reply Cyber1776 OP 6 points 1 day ago I recommend this one, I post it all the time. It’s specifically about Americas experience in WW1 https://youtu.be/Pxb3j6Ps44c?si=9v_dHq9wReoK6jr1 permalink parent award report block reply Tocqueville 4 points 1 day ago If you want to know way more, listen to the Not So Quiet on the Western Front podcast. It starts with a very British focus but then expands to other powers permalink parent award report block reply BadCompany 4 points 1 day ago Dan Carlins eps are fucking wild. Ghosts of the Ostrafront is probably my favorite. What looked like a snow covered field in the summer a journalist wrote in the 90’s was actually a bone yard filled with what once was retreating reich soldiers from Stalingrad. permalink parent award report block reply USMC1234O10 9 points 1 day ago SEMPER FUCKING FIDELIS permalink award report block reply DogPilledMAGA 2 points 1 day ago I know it is early in the day but I would love to buy you a beer. permalink parent award report block reply USMC1234O10 4 points 1 day ago I ONLY DRINK THE BLOOD OF COMMIES AND MUDSLIMES I HAVE KILLED WITH MY BARE HANDS. OOOOOORRRAAAAHHHH!!! permalink parent award report block reply Parhelion12 4 points 1 day ago Doubt permalink parent award report block reply datagod 8 points 1 day ago And named Remembrance Day in Canada.  Lest we forget. permalink award report block reply BruddahIz 7 points 1 day ago I am sure they are trying to rename it \"If you're an old veteran - celebrate via assisted end oflife treatments\" day. permalink parent award report block reply covok48 2 points 1 day ago Or Extra Poop Day in Indian. permalink parent award report block reply SanityGumby 1 points 14 hours ago Canada clearly forgot permalink parent award report block reply datagod 1 points 14 hours ago Not all Canadians are retards.  Plenty of us veterans are good people. permalink parent award report block reply AliceCooperBiden 7 points 1 day ago I think it’s important to remember that the war was absolutely a tragedy but gets even worse when you remember that a lot of 14,15 and 16 year olds lied about their ages and volunteered. Not understanding what they were getting into. WW1 was just the worst war in human history. WW2 is more well known by people but the First World War was just so much more brutal than the second one. permalink award report block reply someguy7738 5 points 1 day ago The damage that war did to the European gene pool is almost inconceivable. All those teens wiped off the face of the Earth who had not yet even had children of their own, entire bloodlines just gone. permalink parent award report block reply AliceCooperBiden 3 points 1 day ago Millions of them just gone and all for nothing. Almost the entirety of the war was a stalemate even to the very end. Such a fucking tragedy that war was. permalink parent award report block reply covok48 2 points 1 day ago 100% permalink parent award report block reply memechallenger33 7 points 1 day ago Thanks for that history, Pede. https://www.worldhistory.org/article/2833/the-1918-armistice-with-germany/ permalink award report block reply SqRt7744 6 points 1 day ago Should be called \"beginning of the end of western civilization day\" but that doesn't roll off the tongue. permalink award report block reply Philhelm 4 points 1 day ago It would be interesting to see the butterfly effect of Germany winning WWI. At least everyone wouldn't be compared to Hitler or Nazis. permalink award report block reply Klown_Kutz 4 points 1 day ago Since you bring it up, tell everyone about what went on in occupied Germany. permalink award report block reply frenacrossthepond 4 points 1 day ago \"The day is celebrated as “Armistice Day” across the world, officially being changed to “Veterans Day” in America in 1954. \"... Well you won't believe this but in Germany and Austria, while the rest of the world is mourning, they celebrate the beginning of Carneval today (which goes on until the last day before Lent) by munching on doughnuts.....i.e. pssst..don't mention the war! permalink award report block reply AliceCooperBiden 6 points 1 day ago German 1: remember that time that we couldn’t even take out the French? German 2: nope. Here have a doughnut and shut the fuck up. permalink parent award report block reply SavingPrivateGrace 4 points 1 day ago Happy Veterans Day! Thank you for your service.  Lots of free meals and gifts for Vets https://themilitarywallet.com/veterans-day-free-meals-and-discounts/ permalink award report block reply blackswans 3 points 1 day ago *uckin Wilson got us into a war that was none of our business and we've never escaped. *uck Europe, *uck Asia, *uck Africa, and *uck the Middle *ucking East. Monroe Doctrine, Full Stop. permalink award report block reply SanityGumby 1 points 14 hours ago This isn’t Reddit faggot permalink parent award report block reply Overtaxed 3 points 1 day ago The eleventh month on the eleventh day at the eleventh hour. permalink award report block reply HillarysBeaverMunch 3 points 1 day ago If Germany had won WW1, there never would have been a H1tler. permalink award report block reply FutureVRPilot 3 points 1 day ago 1911 TIATANIC SINKS,,, DEC 24 1912 FDIC IN THE USA AND A YEAR LATER THE BANKS MAKE A BILLIONS FOR THE WAR AND THEN MAKES BILLIONS TO REBUILD. SOUNDS LIKE. WW2  COVID SNL.  911. ECT ECT ECT.....Mr. Q permalink award report block reply kalokagathia 3 points 1 day ago \"My center is giving way, my right is retreating: Situation excellent, I attack.\"\n-- Ferdinand Foch permalink award report block reply MAGA1773 3 points 1 day ago Aaacccckkk!! What a win. They got Bolshevik communism. permalink award report block reply HillarysBeaverMunch 2 points 1 day ago Fun Fact: it is now believed that the Russian Royal family was murdered according to the orders of bankers in New York, the same bankers that paid for the Bolshevik Revolution. permalink award report block reply Tongs_Ya_Bass 1 points 1 day ago There's evidence they were killed in a satanic ritual also. permalink parent award report block reply Sup101 2 points 1 day ago And so it began permalink award report block reply ToniBahloni 2 points 1 day ago So is that the day Germany felt they got Foch'd? permalink award report block reply Nomad899 2 points 19 hours ago The 11th hour of the 11th day of the 11th month permalink award report block reply tellmywifehello 2 points 1 day ago Nov 11, 1918. Armistice Day. The Great War is over and chaos comes to Germany.\nThe German Empire is dead. Emperor Wilhelm II is forced to abdicate his throne, exiled to the Netherlands. He will never see the Fatherland again.\nCommunists prowl the streets like wolves. There are still loyal men, good men. They are the lucky ones who survived the bloodshed or were too young to have served, but they are leaderless. Intuitively they understand things are going to get worse.\nJanuary 5, 1919. Trouble starts. Communists stage a general workers' strike. Led by Karl Liebknecht and the jewess Rosa Luxemberg, the Communist Party of Germany take to the streets, terrorizing small business owners. They demand power be handed over to a network of Soviet-style councils to carry out \"the will of the people.\" After 7 days of anarchy, the so-called Spartacist Uprising is put down by patriots from the Freikorps. The jewish leaders are executed.\nBut the communists smell blood in the water. They are just getting started.\nJanuary 7, 1919. Munich. Kurt Eisner, a middle-class jewish journalist and rabble-rouser, appoints himself Minister-President of Bavaria. A communist utopian, Eisner declares his Bavarian regime will be \"a government of kindness... a realm of light, beauty and reason.\" Problem is, none of his lieutenants are Bavarian. Like himself, to a man, they are jewish intellectuals, and of course communists. After enduring the indignity of Eisner's reign for only 1 month, the Germans of Bavaria finally have had enough. Eisner is shot dead by a nationalist patriot on Feb 21.\nThis drives the jewish communists into a frenzy. Again they take to the streets, burning, looting and destroying everything in their path. Again they seize power.\nMarch 7, 1919. Bamberg. Ernst Toller, a jewish journalist and playwright, declares himself leader of a new Soviet Republic in Bavaria. After only 6 days, he is deposed by an even more radical jew, Eugen Levine. Levine cobbles together a \"Red Army\" from disgruntled jewish miscreants and factory workers, which proceeds to confiscate cash, homes, food and weapons from ordinary people. Levine's Army rededicates Munich's Cathedral to the \"Goddess of Reason.\"\nThis time the jews will not be ousted so easily. it will take more than 1 armed patriot to bring them down.\nThe Freikorps mobilizes against the communists to restore power to the German volk. Panicking and desperate to hold onto power, the Red Army barricades itself in Munich with aristocratic German hostages. With negotiations leading nowhere, all 10 hostages are executed by the jews. War break out in the city, leading to the death of over 300 German civilians.\nAugust 1919. The so-called German Revolution is over. The threat of communism has been subdued, but the jewish revolutionary spirit is not so easily extinguished. The Weimer Republic is coming...\nThe 1 year period between the end of WW1 and the beginning of the Weimer Republic is sometimes called the German Revolution.\nGermany essentially had no government, which led to dozens of communist and socialist groups (all ran by jews) frantically trying to spark a Bolshevik uprising to seize power. Hitler talks about this in Mein Kampf, but again the details are so hyper-specific in time and place that it's hard for an outsider to understand.\nAs awful and degenerate as the Weimar period was, for Germans at the time it was at least a stable respite from the communist anarchy which preceded it. -- I forget where I got that story from, but it's an entertaining read. permalink award report block reply Tongs_Ya_Bass 2 points 1 day ago Conclusion: deport the Jews. Never let them back in. permalink parent award report block reply someguy7738 2 points 1 day ago Never should have been involved in the first place. Anyway, we get that fucking bullshit federal reserve and suddenly, before you know it, we're in some huge bullshit war that has fuck all to do with the American people racking up massive debt to same said central bank. Every other nation involved also had a branch of the international financier's central bank as well. Pure cohencidence. permalink award report block reply SurrenderFreeman 2 points 1 day ago Which lead to ww2 because of how shitty the agreement was permalink award report block reply SanityGumby 1 points 14 hours ago You can still wear poppies even though it’s name was changed permalink award report block reply RudeFrog 0 points 24 hours ago Ah yes one of the days our betters said we can stop killing each other for their bank accounts, what a special day permalink award report block reply booblitchutz 0 points 1 day ago Armistice Day celebrated the end of war. Veterans Day celebrates people who continue to fight in wars. The agenda is pretty clear. permalink award report block reply SkullLeader117 0 points 1 day ago How many white Christian men were killed? permalink award report block reply KungPaoMcChicken 0 points 24 hours ago And everyone lived happily ever after, the end. permalink award report block reply stillbringingitback -1 points 19 hours ago We fought the wrong enemy. permalink award report block reply dr_gonzo -1 points 19 hours ago And just 4 days earlier the Jewish communist Kurt Eisner overthrew the German government, causing the Kaiser to abdicate. Then they surrendered without a shot fired on German soil, signed the entire economic future over to western bankers and gave half the country away geographically. 🥳 And isn't it an odd coincidence that a year earlier the Brits released a public declaration addressed to Lord Walter Rothschild of the infamous German Jewish banking family, promising their support for a Jewish homeland in Israel if they won the war? This was called the Balfour Declaration, and it was later discovered at the Paris Peace Conference that this declaration was in exchange for the zionists using their newly established power in the American federal reserve to bring the US into the war on behalf of the allied powers. Such a strange coincidence. It's almost as if Jewish communists sold their country down the river in exchange for Israel. 🤔 And then one day, for no reason at all... permalink award report block reply\nJohnN 62 points 1 day ago WW1 was the worst catastrophe ever to befall human civilization. permalink award report block reply PhilipeNegro 44 points 1 day ago Yes, fighting the Kaiser gave rise to European communism, and just about every symptom of leftist cancer we deal with today. permalink parent award report block reply Cyber1776 OP 23 points 1 day ago The Kaiser literally is the reason communism exist in Europe. He funded Lenin and sent him into Russia to destroy it from within. After the Bolsheviks took over, they almost immediately surrendered to the Entente Powers in March 1918 in the treaty of Brest-Litovsk. Russia just gave up all claims to Eastern European territories to Germany. With the eastern front won, Germany shifted its he bulk of its force to Western Europe. permalink parent award report block reply _Sully_ 13 points 1 day ago It was the equivalent of sending in some hipster Democratic Socialists into Europe now and thinking it would be funny. Be careful what you wish for. permalink parent award report block reply Awakened 6 points 1 day ago Fascinating, because that meddling would catch up to them in WWII. permalink parent award report block reply dukeofdoorcounty 4 points 1 day ago But Lenin was in Switzerland.  The Kaiser probably didn't know what was going on. permalink parent award report block reply Cyber1776 OP 5 points 1 day ago No, the German high command literally funded Lenin’s return trip to Russia. The Tsar has abdicated, a new interim government was established and were set to have their first ever elections, but the intern government was still in the war against Germany. The Kaiser wanted Lenin in control because he preached an immediate end to the war and the Kaiser knew he would start a civil war in Russia, which he did. permalink parent award report block reply SqRt7744 3 points 1 day ago While that is literally true, it's incomplete. He was no communist but was forced to destabilize Russia for tactical purposes - brilliant, actually. All of this was caused by the war which they would have already won in 1916 if the USA hadn't gotten involved. And why did the USA get involved? They were dragged in by the Zionists to rescue the British in exchange for the British promising them Palestine (yes, this is insane but true). The result was everything that followed - from the rise of fascism as a pan-European anti communist movement to the capturing of half the globe by the communists, millions of deaths in WW2 and eventual subjugation of the west to Israel, as well as the total downfall of western Christian civilization and destruction of western man. permalink parent award report block reply AliceCooperBiden 4 points 1 day ago “War which they would have already won” Dude they were in a stalemate for 3 years before the US gets involved lol. The US entered the war in 1917 not 1916. The Germans weren’t winning and were actually doing pretty bad with the war of attrition that was going on. Because the US was funding the Entente and Germans had really no one significant funding them.  Also how you excuse communism as “he was forced to do it” is pathetic. permalink parent award report block reply view 4 more comments... covok48 2 points 1 day ago (((Zimmerman))) telegram. permalink parent award report block reply view 3 more comments... Cyber1776 OP 2 points 1 day ago Wrong. Germany can’t do protracted warfare, their entire model relies on quick and decisive actions. The moment they got bogged down into trench warfare in France they were basically fucked. permalink parent award report block reply view 2 more comments... TallestSkill -1 points 1 day ago The United States entered World War I in April 1917 because Germany resumed unrestricted submarine warfare that was sinking American merchant ships and killing civilians. The Zimmermann Telegram, in which Germany tried to convince Mexico to attack the United States, was the final cause that pushed Wilson to act. The Balfour Declaration came later in November 1917. It was a British statement of support for a Jewish homeland issued after the United States had already joined the war. It was not a treaty or a deal. It was a short letter from the British Foreign Secretary to Lord Rothschild, a British Jewish leader, expressing sympathy for Zionist goals. There is no evidence that American Zionists had the political power to pull the United States into war. President Wilson’s decision came from global strategy and domestic pressure, not from Jewish influence. The story that “Zionists dragged America into World War I” began as Nazi propaganda. It was created to blame Jews for Germany’s loss and to justify antisemitism. Blaming an entire people for a world war is weak history. The conflict began through a chain reaction among European empires, military plans, and nationalist ambitions, not through any hidden ethnic conspiracy. The true results of the war, such as the Treaty of Versailles, economic collapse, the rise of communism and fascism, and the second world war, came from the failure of European elites to reform after the destruction of industrial warfare. The early Zionist movement played only a small role until Britain saw it as useful leverage in the dying Ottoman Empire. America entered the war because Germany was acting like a pirate state. The story of a “Zionist deal for Palestine” is a myth that survives only because it gives people a single villain to blame for a complex and tragic chapter of history. permalink parent award report block reply view 8 more comments... bejeavis 1 points 1 day ago It's a nice thing to see when you're not the only one who knows history. permalink parent award report block reply Awakened 9 points 1 day ago The US had no business being part of it, but the bankers knew how much money and influence they could gain and they were right so here we are today still under their thumb. permalink parent award report block reply stillbringingitback 1 points 19 hours ago …so far lol permalink parent award report block reply mohel 0 points 1 day ago Why did it happen? permalink parent award report block reply JohnN 3 points 1 day ago Tough to say precisely.  Perhaps, among other reasons... European empires continuing their traditional struggles for dominance without understanding the drastic changes in military technology. The dominos of alliances that dragged everyone in. Germany's \"blank check\" to Austria-Hungary, whereby Germany essentially allowed Austria-Hungary to decide whether Germany went to war. permalink parent award report block reply mohel 0 points 1 day ago Tough to say precisely 100 years was not enough to figure it out? permalink parent award report block reply JohnN -1 points 1 day ago No, certainly not precisely.  History is written by the victors. Why do you think it happened? permalink parent award report block reply view 4 more comments...\nPhilipeNegro 44 points 1 day ago Yes, fighting the Kaiser gave rise to European communism, and just about every symptom of leftist cancer we deal with today. permalink parent award report block reply Cyber1776 OP 23 points 1 day ago The Kaiser literally is the reason communism exist in Europe. He funded Lenin and sent him into Russia to destroy it from within. After the Bolsheviks took over, they almost immediately surrendered to the Entente Powers in March 1918 in the treaty of Brest-Litovsk. Russia just gave up all claims to Eastern European territories to Germany. With the eastern front won, Germany shifted its he bulk of its force to Western Europe. permalink parent award report block reply _Sully_ 13 points 1 day ago It was the equivalent of sending in some hipster Democratic Socialists into Europe now and thinking it would be funny. Be careful what you wish for. permalink parent award report block reply Awakened 6 points 1 day ago Fascinating, because that meddling would catch up to them in WWII. permalink parent award report block reply dukeofdoorcounty 4 points 1 day ago But Lenin was in Switzerland.  The Kaiser probably didn't know what was going on. permalink parent award report block reply Cyber1776 OP 5 points 1 day ago No, the German high command literally funded Lenin’s return trip to Russia. The Tsar has abdicated, a new interim government was established and were set to have their first ever elections, but the intern government was still in the war against Germany. The Kaiser wanted Lenin in control because he preached an immediate end to the war and the Kaiser knew he would start a civil war in Russia, which he did. permalink parent award report block reply SqRt7744 3 points 1 day ago While that is literally true, it's incomplete. He was no communist but was forced to destabilize Russia for tactical purposes - brilliant, actually. All of this was caused by the war which they would have already won in 1916 if the USA hadn't gotten involved. And why did the USA get involved? They were dragged in by the Zionists to rescue the British in exchange for the British promising them Palestine (yes, this is insane but true). The result was everything that followed - from the rise of fascism as a pan-European anti communist movement to the capturing of half the globe by the communists, millions of deaths in WW2 and eventual subjugation of the west to Israel, as well as the total downfall of western Christian civilization and destruction of western man. permalink parent award report block reply AliceCooperBiden 4 points 1 day ago “War which they would have already won” Dude they were in a stalemate for 3 years before the US gets involved lol. The US entered the war in 1917 not 1916. The Germans weren’t winning and were actually doing pretty bad with the war of attrition that was going on. Because the US was funding the Entente and Germans had really no one significant funding them.  Also how you excuse communism as “he was forced to do it” is pathetic. permalink parent award report block reply view 4 more comments... covok48 2 points 1 day ago (((Zimmerman))) telegram. permalink parent award report block reply view 3 more comments... Cyber1776 OP 2 points 1 day ago Wrong. Germany can’t do protracted warfare, their entire model relies on quick and decisive actions. The moment they got bogged down into trench warfare in France they were basically fucked. permalink parent award report block reply view 2 more comments... TallestSkill -1 points 1 day ago The United States entered World War I in April 1917 because Germany resumed unrestricted submarine warfare that was sinking American merchant ships and killing civilians. The Zimmermann Telegram, in which Germany tried to convince Mexico to attack the United States, was the final cause that pushed Wilson to act. The Balfour Declaration came later in November 1917. It was a British statement of support for a Jewish homeland issued after the United States had already joined the war. It was not a treaty or a deal. It was a short letter from the British Foreign Secretary to Lord Rothschild, a British Jewish leader, expressing sympathy for Zionist goals. There is no evidence that American Zionists had the political power to pull the United States into war. President Wilson’s decision came from global strategy and domestic pressure, not from Jewish influence. The story that “Zionists dragged America into World War I” began as Nazi propaganda. It was created to blame Jews for Germany’s loss and to justify antisemitism. Blaming an entire people for a world war is weak history. The conflict began through a chain reaction among European empires, military plans, and nationalist ambitions, not through any hidden ethnic conspiracy. The true results of the war, such as the Treaty of Versailles, economic collapse, the rise of communism and fascism, and the second world war, came from the failure of European elites to reform after the destruction of industrial warfare. The early Zionist movement played only a small role until Britain saw it as useful leverage in the dying Ottoman Empire. America entered the war because Germany was acting like a pirate state. The story of a “Zionist deal for Palestine” is a myth that survives only because it gives people a single villain to blame for a complex and tragic chapter of history. permalink parent award report block reply view 8 more comments... bejeavis 1 points 1 day ago It's a nice thing to see when you're not the only one who knows history. permalink parent award report block reply\nCyber1776 OP 23 points 1 day ago The Kaiser literally is the reason communism exist in Europe. He funded Lenin and sent him into Russia to destroy it from within. After the Bolsheviks took over, they almost immediately surrendered to the Entente Powers in March 1918 in the treaty of Brest-Litovsk. Russia just gave up all claims to Eastern European territories to Germany. With the eastern front won, Germany shifted its he bulk of its force to Western Europe. permalink parent award report block reply _Sully_ 13 points 1 day ago It was the equivalent of sending in some hipster Democratic Socialists into Europe now and thinking it would be funny. Be careful what you wish for. permalink parent award report block reply Awakened 6 points 1 day ago Fascinating, because that meddling would catch up to them in WWII. permalink parent award report block reply dukeofdoorcounty 4 points 1 day ago But Lenin was in Switzerland.  The Kaiser probably didn't know what was going on. permalink parent award report block reply Cyber1776 OP 5 points 1 day ago No, the German high command literally funded Lenin’s return trip to Russia. The Tsar has abdicated, a new interim government was established and were set to have their first ever elections, but the intern government was still in the war against Germany. The Kaiser wanted Lenin in control because he preached an immediate end to the war and the Kaiser knew he would start a civil war in Russia, which he did. permalink parent award report block reply SqRt7744 3 points 1 day ago While that is literally true, it's incomplete. He was no communist but was forced to destabilize Russia for tactical purposes - brilliant, actually. All of this was caused by the war which they would have already won in 1916 if the USA hadn't gotten involved. And why did the USA get involved? They were dragged in by the Zionists to rescue the British in exchange for the British promising them Palestine (yes, this is insane but true). The result was everything that followed - from the rise of fascism as a pan-European anti communist movement to the capturing of half the globe by the communists, millions of deaths in WW2 and eventual subjugation of the west to Israel, as well as the total downfall of western Christian civilization and destruction of western man. permalink parent award report block reply AliceCooperBiden 4 points 1 day ago “War which they would have already won” Dude they were in a stalemate for 3 years before the US gets involved lol. The US entered the war in 1917 not 1916. The Germans weren’t winning and were actually doing pretty bad with the war of attrition that was going on. Because the US was funding the Entente and Germans had really no one significant funding them.  Also how you excuse communism as “he was forced to do it” is pathetic. permalink parent award report block reply view 4 more comments... covok48 2 points 1 day ago (((Zimmerman))) telegram. permalink parent award report block reply view 3 more comments... Cyber1776 OP 2 points 1 day ago Wrong. Germany can’t do protracted warfare, their entire model relies on quick and decisive actions. The moment they got bogged down into trench warfare in France they were basically fucked. permalink parent award report block reply view 2 more comments... TallestSkill -1 points 1 day ago The United States entered World War I in April 1917 because Germany resumed unrestricted submarine warfare that was sinking American merchant ships and killing civilians. The Zimmermann Telegram, in which Germany tried to convince Mexico to attack the United States, was the final cause that pushed Wilson to act. The Balfour Declaration came later in November 1917. It was a British statement of support for a Jewish homeland issued after the United States had already joined the war. It was not a treaty or a deal. It was a short letter from the British Foreign Secretary to Lord Rothschild, a British Jewish leader, expressing sympathy for Zionist goals. There is no evidence that American Zionists had the political power to pull the United States into war. President Wilson’s decision came from global strategy and domestic pressure, not from Jewish influence. The story that “Zionists dragged America into World War I” began as Nazi propaganda. It was created to blame Jews for Germany’s loss and to justify antisemitism. Blaming an entire people for a world war is weak history. The conflict began through a chain reaction among European empires, military plans, and nationalist ambitions, not through any hidden ethnic conspiracy. The true results of the war, such as the Treaty of Versailles, economic collapse, the rise of communism and fascism, and the second world war, came from the failure of European elites to reform after the destruction of industrial warfare. The early Zionist movement played only a small role until Britain saw it as useful leverage in the dying Ottoman Empire. America entered the war because Germany was acting like a pirate state. The story of a “Zionist deal for Palestine” is a myth that survives only because it gives people a single villain to blame for a complex and tragic chapter of history. permalink parent award report block reply view 8 more comments... bejeavis 1 points 1 day ago It's a nice thing to see when you're not the only one who knows history. permalink parent award report block reply\n_Sully_ 13 points 1 day ago It was the equivalent of sending in some hipster Democratic Socialists into Europe now and thinking it would be funny. Be careful what you wish for. permalink parent award report block reply\nAwakened 6 points 1 day ago Fascinating, because that meddling would catch up to them in WWII. permalink parent award report block reply\ndukeofdoorcounty 4 points 1 day ago But Lenin was in Switzerland.  The Kaiser probably didn't know what was going on. permalink parent award report block reply Cyber1776 OP 5 points 1 day ago No, the German high command literally funded Lenin’s return trip to Russia. The Tsar has abdicated, a new interim government was established and were set to have their first ever elections, but the intern government was still in the war against Germany. The Kaiser wanted Lenin in control because he preached an immediate end to the war and the Kaiser knew he would start a civil war in Russia, which he did. permalink parent award report block reply\nCyber1776 OP 5 points 1 day ago No, the German high command literally funded Lenin’s return trip to Russia. The Tsar has abdicated, a new interim government was established and were set to have their first ever elections, but the intern government was still in the war against Germany. The Kaiser wanted Lenin in control because he preached an immediate end to the war and the Kaiser knew he would start a civil war in Russia, which he did. permalink parent award report block reply\nSqRt7744 3 points 1 day ago While that is literally true, it's incomplete. He was no communist but was forced to destabilize Russia for tactical purposes - brilliant, actually. All of this was caused by the war which they would have already won in 1916 if the USA hadn't gotten involved. And why did the USA get involved? They were dragged in by the Zionists to rescue the British in exchange for the British promising them Palestine (yes, this is insane but true). The result was everything that followed - from the rise of fascism as a pan-European anti communist movement to the capturing of half the globe by the communists, millions of deaths in WW2 and eventual subjugation of the west to Israel, as well as the total downfall of western Christian civilization and destruction of western man. permalink parent award report block reply AliceCooperBiden 4 points 1 day ago “War which they would have already won” Dude they were in a stalemate for 3 years before the US gets involved lol. The US entered the war in 1917 not 1916. The Germans weren’t winning and were actually doing pretty bad with the war of attrition that was going on. Because the US was funding the Entente and Germans had really no one significant funding them.  Also how you excuse communism as “he was forced to do it” is pathetic. permalink parent award report block reply view 4 more comments... covok48 2 points 1 day ago (((Zimmerman))) telegram. permalink parent award report block reply view 3 more comments... Cyber1776 OP 2 points 1 day ago Wrong. Germany can’t do protracted warfare, their entire model relies on quick and decisive actions. The moment they got bogged down into trench warfare in France they were basically fucked. permalink parent award report block reply view 2 more comments... TallestSkill -1 points 1 day ago The United States entered World War I in April 1917 because Germany resumed unrestricted submarine warfare that was sinking American merchant ships and killing civilians. The Zimmermann Telegram, in which Germany tried to convince Mexico to attack the United States, was the final cause that pushed Wilson to act. The Balfour Declaration came later in November 1917. It was a British statement of support for a Jewish homeland issued after the United States had already joined the war. It was not a treaty or a deal. It was a short letter from the British Foreign Secretary to Lord Rothschild, a British Jewish leader, expressing sympathy for Zionist goals. There is no evidence that American Zionists had the political power to pull the United States into war. President Wilson’s decision came from global strategy and domestic pressure, not from Jewish influence. The story that “Zionists dragged America into World War I” began as Nazi propaganda. It was created to blame Jews for Germany’s loss and to justify antisemitism. Blaming an entire people for a world war is weak history. The conflict began through a chain reaction among European empires, military plans, and nationalist ambitions, not through any hidden ethnic conspiracy. The true results of the war, such as the Treaty of Versailles, economic collapse, the rise of communism and fascism, and the second world war, came from the failure of European elites to reform after the destruction of industrial warfare. The early Zionist movement played only a small role until Britain saw it as useful leverage in the dying Ottoman Empire. America entered the war because Germany was acting like a pirate state. The story of a “Zionist deal for Palestine” is a myth that survives only because it gives people a single villain to blame for a complex and tragic chapter of history. permalink parent award report block reply view 8 more comments...\nAliceCooperBiden 4 points 1 day ago “War which they would have already won” Dude they were in a stalemate for 3 years before the US gets involved lol. The US entered the war in 1917 not 1916. The Germans weren’t winning and were actually doing pretty bad with the war of attrition that was going on. Because the US was funding the Entente and Germans had really no one significant funding them.  Also how you excuse communism as “he was forced to do it” is pathetic. permalink parent award report block reply view 4 more comments...\ncovok48 2 points 1 day ago (((Zimmerman))) telegram. permalink parent award report block reply view 3 more comments...\nCyber1776 OP 2 points 1 day ago Wrong. Germany can’t do protracted warfare, their entire model relies on quick and decisive actions. The moment they got bogged down into trench warfare in France they were basically fucked. permalink parent award report block reply view 2 more comments...\nTallestSkill -1 points 1 day ago The United States entered World War I in April 1917 because Germany resumed unrestricted submarine warfare that was sinking American merchant ships and killing civilians. The Zimmermann Telegram, in which Germany tried to convince Mexico to attack the United States, was the final cause that pushed Wilson to act. The Balfour Declaration came later in November 1917. It was a British statement of support for a Jewish homeland issued after the United States had already joined the war. It was not a treaty or a deal. It was a short letter from the British Foreign Secretary to Lord Rothschild, a British Jewish leader, expressing sympathy for Zionist goals. There is no evidence that American Zionists had the political power to pull the United States into war. President Wilson’s decision came from global strategy and domestic pressure, not from Jewish influence. The story that “Zionists dragged America into World War I” began as Nazi propaganda. It was created to blame Jews for Germany’s loss and to justify antisemitism. Blaming an entire people for a world war is weak history. The conflict began through a chain reaction among European empires, military plans, and nationalist ambitions, not through any hidden ethnic conspiracy. The true results of the war, such as the Treaty of Versailles, economic collapse, the rise of communism and fascism, and the second world war, came from the failure of European elites to reform after the destruction of industrial warfare. The early Zionist movement played only a small role until Britain saw it as useful leverage in the dying Ottoman Empire. America entered the war because Germany was acting like a pirate state. The story of a “Zionist deal for Palestine” is a myth that survives only because it gives people a single villain to blame for a complex and tragic chapter of history. permalink parent award report block reply view 8 more comments...\nbejeavis 1 points 1 day ago It's a nice thing to see when you're not the only one who knows history. permalink parent award report block reply\nAwakened 9 points 1 day ago The US had no business being part of it, but the bankers knew how much money and influence they could gain and they were right so here we are today still under their thumb. permalink parent award report block reply\nstillbringingitback 1 points 19 hours ago …so far lol permalink parent award report block reply\nmohel 0 points 1 day ago Why did it happen? permalink parent award report block reply JohnN 3 points 1 day ago Tough to say precisely.  Perhaps, among other reasons... European empires continuing their traditional struggles for dominance without understanding the drastic changes in military technology. The dominos of alliances that dragged everyone in. Germany's \"blank check\" to Austria-Hungary, whereby Germany essentially allowed Austria-Hungary to decide whether Germany went to war. permalink parent award report block reply mohel 0 points 1 day ago Tough to say precisely 100 years was not enough to figure it out? permalink parent award report block reply JohnN -1 points 1 day ago No, certainly not precisely.  History is written by the victors. Why do you think it happened? permalink parent award report block reply view 4 more comments...\nJohnN 3 points 1 day ago Tough to say precisely.  Perhaps, among other reasons... European empires continuing their traditional struggles for dominance without understanding the drastic changes in military technology. The dominos of alliances that dragged everyone in. Germany's \"blank check\" to Austria-Hungary, whereby Germany essentially allowed Austria-Hungary to decide whether Germany went to war. permalink parent award report block reply mohel 0 points 1 day ago Tough to say precisely 100 years was not enough to figure it out? permalink parent award report block reply JohnN -1 points 1 day ago No, certainly not precisely.  History is written by the victors. Why do you think it happened? permalink parent award report block reply view 4 more comments...\nmohel 0 points 1 day ago Tough to say precisely 100 years was not enough to figure it out? permalink parent award report block reply JohnN -1 points 1 day ago No, certainly not precisely.  History is written by the victors. Why do you think it happened? permalink parent award report block reply view 4 more comments...\nJohnN -1 points 1 day ago No, certainly not precisely.  History is written by the victors. Why do you think it happened? permalink parent award report block reply view 4 more comments...\nUgh3rdaccount 28 points 1 day ago No more brother wars. permalink award report block reply daberoniandcheese 4 points 1 day ago There's one going on right now in Ukraine. We're funding it, of course. permalink parent award report block reply\ndaberoniandcheese 4 points 1 day ago There's one going on right now in Ukraine. We're funding it, of course. permalink parent award report block reply\nRINOssuck 22 points 1 day ago The treaty terms were so severe against Germany that it caused a second world war 20 years later.  Day is best remembered as Veterans Day. permalink award report block reply BadCompany 11 points 1 day ago There is no question this treaty drove hitler and the 3rd reich to European dominance thereafter its destruction permalink parent award report block reply RINOssuck 6 points 1 day ago Hitler ranting about the terms of the treaty was what allowed him to gain power.  Treaty that ended WW11 was no peach either.  It forbade Japan and Germany from having a military.  The US had to spend billions to protect them while they both became economic powerhouses. permalink parent award report block reply stars 2 points 1 day ago No look at the 1928 German election and then 1930. permalink parent award report block reply booblitchutz 2 points 1 day ago And now… permalink parent award report block reply SanityGumby 1 points 14 hours ago Powerhouse is relative. None ever rivaled the US. And Japan has changed course and is building a real military besides its defense force while being one of a handful of only true allies left permalink parent award report block reply bejeavis 2 points 1 day ago Who is really responsible for WW2? France. permalink parent award report block reply stars 0 points 1 day ago No the great depression is objectively what caused his rise. permalink parent award report block reply Cyber1776 OP 3 points 1 day ago I don’t buy this take anymore bc the terms on Germany after WW2 were much more severe. permalink parent award report block reply stjimmy92 1 points 1 day ago The biggest difference is that there was a reconstruction effort after WW2 (largely bankrolled by the US, shockingly /s) to prevent a repeat  of the conditions after WW1, plus things got really bad when the Great Depression hit, which also didn’t recur after WW2 permalink parent award report block reply rambler045 1 points 1 day ago Which is why we didn't punish them or the Japanese so severely after WWII. That and the smart ones had already figured out communism was the bigger problem. permalink parent award report block reply\nBadCompany 11 points 1 day ago There is no question this treaty drove hitler and the 3rd reich to European dominance thereafter its destruction permalink parent award report block reply RINOssuck 6 points 1 day ago Hitler ranting about the terms of the treaty was what allowed him to gain power.  Treaty that ended WW11 was no peach either.  It forbade Japan and Germany from having a military.  The US had to spend billions to protect them while they both became economic powerhouses. permalink parent award report block reply stars 2 points 1 day ago No look at the 1928 German election and then 1930. permalink parent award report block reply booblitchutz 2 points 1 day ago And now… permalink parent award report block reply SanityGumby 1 points 14 hours ago Powerhouse is relative. None ever rivaled the US. And Japan has changed course and is building a real military besides its defense force while being one of a handful of only true allies left permalink parent award report block reply bejeavis 2 points 1 day ago Who is really responsible for WW2? France. permalink parent award report block reply stars 0 points 1 day ago No the great depression is objectively what caused his rise. permalink parent award report block reply\nRINOssuck 6 points 1 day ago Hitler ranting about the terms of the treaty was what allowed him to gain power.  Treaty that ended WW11 was no peach either.  It forbade Japan and Germany from having a military.  The US had to spend billions to protect them while they both became economic powerhouses. permalink parent award report block reply stars 2 points 1 day ago No look at the 1928 German election and then 1930. permalink parent award report block reply booblitchutz 2 points 1 day ago And now… permalink parent award report block reply SanityGumby 1 points 14 hours ago Powerhouse is relative. None ever rivaled the US. And Japan has changed course and is building a real military besides its defense force while being one of a handful of only true allies left permalink parent award report block reply\nstars 2 points 1 day ago No look at the 1928 German election and then 1930. permalink parent award report block reply\nbooblitchutz 2 points 1 day ago And now… permalink parent award report block reply\nSanityGumby 1 points 14 hours ago Powerhouse is relative. None ever rivaled the US. And Japan has changed course and is building a real military besides its defense force while being one of a handful of only true allies left permalink parent award report block reply\nbejeavis 2 points 1 day ago Who is really responsible for WW2? France. permalink parent award report block reply\nstars 0 points 1 day ago No the great depression is objectively what caused his rise. permalink parent award report block reply\nCyber1776 OP 3 points 1 day ago I don’t buy this take anymore bc the terms on Germany after WW2 were much more severe. permalink parent award report block reply stjimmy92 1 points 1 day ago The biggest difference is that there was a reconstruction effort after WW2 (largely bankrolled by the US, shockingly /s) to prevent a repeat  of the conditions after WW1, plus things got really bad when the Great Depression hit, which also didn’t recur after WW2 permalink parent award report block reply\nstjimmy92 1 points 1 day ago The biggest difference is that there was a reconstruction effort after WW2 (largely bankrolled by the US, shockingly /s) to prevent a repeat  of the conditions after WW1, plus things got really bad when the Great Depression hit, which also didn’t recur after WW2 permalink parent award report block reply\nrambler045 1 points 1 day ago Which is why we didn't punish them or the Japanese so severely after WWII. That and the smart ones had already figured out communism was the bigger problem. permalink parent award report block reply\nplateowner2024 14 points 1 day ago \"A veteran is someone who, at one point in their life, wrote a blank check made payable to ‘The United States of America,’ for an amount up to and including their life.\" — Unknown permalink award report block reply 67Vert 8 points 1 day ago Or was drafted and sent into war against their will, coerced into signing a blank check. permalink parent award report block reply\n67Vert 8 points 1 day ago Or was drafted and sent into war against their will, coerced into signing a blank check. permalink parent award report block reply\n_Sully_ 9 points 1 day ago Even though it's about the Brits I'm gonna watch They Shall Not Grow Old again. It's such an amazing Doc. That and Dan Carlin's WW1 eps. That was the first time I learned about the drum roll bombardment. Fucking shit people went through hell. permalink award report block reply Cyber1776 OP 6 points 1 day ago I recommend this one, I post it all the time. It’s specifically about Americas experience in WW1 https://youtu.be/Pxb3j6Ps44c?si=9v_dHq9wReoK6jr1 permalink parent award report block reply Tocqueville 4 points 1 day ago If you want to know way more, listen to the Not So Quiet on the Western Front podcast. It starts with a very British focus but then expands to other powers permalink parent award report block reply BadCompany 4 points 1 day ago Dan Carlins eps are fucking wild. Ghosts of the Ostrafront is probably my favorite. What looked like a snow covered field in the summer a journalist wrote in the 90’s was actually a bone yard filled with what once was retreating reich soldiers from Stalingrad. permalink parent award report block reply\nCyber1776 OP 6 points 1 day ago I recommend this one, I post it all the time. It’s specifically about Americas experience in WW1 https://youtu.be/Pxb3j6Ps44c?si=9v_dHq9wReoK6jr1 permalink parent award report block reply\nTocqueville 4 points 1 day ago If you want to know way more, listen to the Not So Quiet on the Western Front podcast. It starts with a very British focus but then expands to other powers permalink parent award report block reply\nBadCompany 4 points 1 day ago Dan Carlins eps are fucking wild. Ghosts of the Ostrafront is probably my favorite. What looked like a snow covered field in the summer a journalist wrote in the 90’s was actually a bone yard filled with what once was retreating reich soldiers from Stalingrad. permalink parent award report block reply\nUSMC1234O10 9 points 1 day ago SEMPER FUCKING FIDELIS permalink award report block reply DogPilledMAGA 2 points 1 day ago I know it is early in the day but I would love to buy you a beer. permalink parent award report block reply USMC1234O10 4 points 1 day ago I ONLY DRINK THE BLOOD OF COMMIES AND MUDSLIMES I HAVE KILLED WITH MY BARE HANDS. OOOOOORRRAAAAHHHH!!! permalink parent award report block reply Parhelion12 4 points 1 day ago Doubt permalink parent award report block reply\nDogPilledMAGA 2 points 1 day ago I know it is early in the day but I would love to buy you a beer. permalink parent award report block reply USMC1234O10 4 points 1 day ago I ONLY DRINK THE BLOOD OF COMMIES AND MUDSLIMES I HAVE KILLED WITH MY BARE HANDS. OOOOOORRRAAAAHHHH!!! permalink parent award report block reply Parhelion12 4 points 1 day ago Doubt permalink parent award report block reply\nUSMC1234O10 4 points 1 day ago I ONLY DRINK THE BLOOD OF COMMIES AND MUDSLIMES I HAVE KILLED WITH MY BARE HANDS. OOOOOORRRAAAAHHHH!!! permalink parent award report block reply Parhelion12 4 points 1 day ago Doubt permalink parent award report block reply\nParhelion12 4 points 1 day ago Doubt permalink parent award report block reply\ndatagod 8 points 1 day ago And named Remembrance Day in Canada.  Lest we forget. permalink award report block reply BruddahIz 7 points 1 day ago I am sure they are trying to rename it \"If you're an old veteran - celebrate via assisted end oflife treatments\" day. permalink parent award report block reply covok48 2 points 1 day ago Or Extra Poop Day in Indian. permalink parent award report block reply SanityGumby 1 points 14 hours ago Canada clearly forgot permalink parent award report block reply datagod 1 points 14 hours ago Not all Canadians are retards.  Plenty of us veterans are good people. permalink parent award report block reply\nBruddahIz 7 points 1 day ago I am sure they are trying to rename it \"If you're an old veteran - celebrate via assisted end oflife treatments\" day. permalink parent award report block reply\ncovok48 2 points 1 day ago Or Extra Poop Day in Indian. permalink parent award report block reply\nSanityGumby 1 points 14 hours ago Canada clearly forgot permalink parent award report block reply datagod 1 points 14 hours ago Not all Canadians are retards.  Plenty of us veterans are good people. permalink parent award report block reply\ndatagod 1 points 14 hours ago Not all Canadians are retards.  Plenty of us veterans are good people. permalink parent award report block reply\nAliceCooperBiden 7 points 1 day ago I think it’s important to remember that the war was absolutely a tragedy but gets even worse when you remember that a lot of 14,15 and 16 year olds lied about their ages and volunteered. Not understanding what they were getting into. WW1 was just the worst war in human history. WW2 is more well known by people but the First World War was just so much more brutal than the second one. permalink award report block reply someguy7738 5 points 1 day ago The damage that war did to the European gene pool is almost inconceivable. All those teens wiped off the face of the Earth who had not yet even had children of their own, entire bloodlines just gone. permalink parent award report block reply AliceCooperBiden 3 points 1 day ago Millions of them just gone and all for nothing. Almost the entirety of the war was a stalemate even to the very end. Such a fucking tragedy that war was. permalink parent award report block reply covok48 2 points 1 day ago 100% permalink parent award report block reply\nsomeguy7738 5 points 1 day ago The damage that war did to the European gene pool is almost inconceivable. All those teens wiped off the face of the Earth who had not yet even had children of their own, entire bloodlines just gone. permalink parent award report block reply AliceCooperBiden 3 points 1 day ago Millions of them just gone and all for nothing. Almost the entirety of the war was a stalemate even to the very end. Such a fucking tragedy that war was. permalink parent award report block reply\nAliceCooperBiden 3 points 1 day ago Millions of them just gone and all for nothing. Almost the entirety of the war was a stalemate even to the very end. Such a fucking tragedy that war was. permalink parent award report block reply\ncovok48 2 points 1 day ago 100% permalink parent award report block reply\nmemechallenger33 7 points 1 day ago Thanks for that history, Pede. https://www.worldhistory.org/article/2833/the-1918-armistice-with-germany/ permalink award report block reply\nSqRt7744 6 points 1 day ago Should be called \"beginning of the end of western civilization day\" but that doesn't roll off the tongue. permalink award report block reply\nPhilhelm 4 points 1 day ago It would be interesting to see the butterfly effect of Germany winning WWI. At least everyone wouldn't be compared to Hitler or Nazis. permalink award report block reply\nKlown_Kutz 4 points 1 day ago Since you bring it up, tell everyone about what went on in occupied Germany. permalink award report block reply\nfrenacrossthepond 4 points 1 day ago \"The day is celebrated as “Armistice Day” across the world, officially being changed to “Veterans Day” in America in 1954. \"... Well you won't believe this but in Germany and Austria, while the rest of the world is mourning, they celebrate the beginning of Carneval today (which goes on until the last day before Lent) by munching on doughnuts.....i.e. pssst..don't mention the war! permalink award report block reply AliceCooperBiden 6 points 1 day ago German 1: remember that time that we couldn’t even take out the French? German 2: nope. Here have a doughnut and shut the fuck up. permalink parent award report block reply\nAliceCooperBiden 6 points 1 day ago German 1: remember that time that we couldn’t even take out the French? German 2: nope. Here have a doughnut and shut the fuck up. permalink parent award report block reply\nSavingPrivateGrace 4 points 1 day ago Happy Veterans Day! Thank you for your service.  Lots of free meals and gifts for Vets https://themilitarywallet.com/veterans-day-free-meals-and-discounts/ permalink award report block reply\nblackswans 3 points 1 day ago *uckin Wilson got us into a war that was none of our business and we've never escaped. *uck Europe, *uck Asia, *uck Africa, and *uck the Middle *ucking East. Monroe Doctrine, Full Stop. permalink award report block reply SanityGumby 1 points 14 hours ago This isn’t Reddit faggot permalink parent award report block reply\nSanityGumby 1 points 14 hours ago This isn’t Reddit faggot permalink parent award report block reply\nOvertaxed 3 points 1 day ago The eleventh month on the eleventh day at the eleventh hour. permalink award report block reply\nHillarysBeaverMunch 3 points 1 day ago If Germany had won WW1, there never would have been a H1tler. permalink award report block reply\nFutureVRPilot 3 points 1 day ago 1911 TIATANIC SINKS,,, DEC 24 1912 FDIC IN THE USA AND A YEAR LATER THE BANKS MAKE A BILLIONS FOR THE WAR AND THEN MAKES BILLIONS TO REBUILD. SOUNDS LIKE. WW2  COVID SNL.  911. ECT ECT ECT.....Mr. Q permalink award report block reply\nkalokagathia 3 points 1 day ago \"My center is giving way, my right is retreating: Situation excellent, I attack.\"\n-- Ferdinand Foch permalink award report block reply\nMAGA1773 3 points 1 day ago Aaacccckkk!! What a win. They got Bolshevik communism. permalink award report block reply\nHillarysBeaverMunch 2 points 1 day ago Fun Fact: it is now believed that the Russian Royal family was murdered according to the orders of bankers in New York, the same bankers that paid for the Bolshevik Revolution. permalink award report block reply Tongs_Ya_Bass 1 points 1 day ago There's evidence they were killed in a satanic ritual also. permalink parent award report block reply\nTongs_Ya_Bass 1 points 1 day ago There's evidence they were killed in a satanic ritual also. permalink parent award report block reply\nSup101 2 points 1 day ago And so it began permalink award report block reply\nToniBahloni 2 points 1 day ago So is that the day Germany felt they got Foch'd? permalink award report block reply\nNomad899 2 points 19 hours ago The 11th hour of the 11th day of the 11th month permalink award report block reply\ntellmywifehello 2 points 1 day ago Nov 11, 1918. Armistice Day. The Great War is over and chaos comes to Germany.\nThe German Empire is dead. Emperor Wilhelm II is forced to abdicate his throne, exiled to the Netherlands. He will never see the Fatherland again.\nCommunists prowl the streets like wolves. There are still loyal men, good men. They are the lucky ones who survived the bloodshed or were too young to have served, but they are leaderless. Intuitively they understand things are going to get worse.\nJanuary 5, 1919. Trouble starts. Communists stage a general workers' strike. Led by Karl Liebknecht and the jewess Rosa Luxemberg, the Communist Party of Germany take to the streets, terrorizing small business owners. They demand power be handed over to a network of Soviet-style councils to carry out \"the will of the people.\" After 7 days of anarchy, the so-called Spartacist Uprising is put down by patriots from the Freikorps. The jewish leaders are executed.\nBut the communists smell blood in the water. They are just getting started.\nJanuary 7, 1919. Munich. Kurt Eisner, a middle-class jewish journalist and rabble-rouser, appoints himself Minister-President of Bavaria. A communist utopian, Eisner declares his Bavarian regime will be \"a government of kindness... a realm of light, beauty and reason.\" Problem is, none of his lieutenants are Bavarian. Like himself, to a man, they are jewish intellectuals, and of course communists. After enduring the indignity of Eisner's reign for only 1 month, the Germans of Bavaria finally have had enough. Eisner is shot dead by a nationalist patriot on Feb 21.\nThis drives the jewish communists into a frenzy. Again they take to the streets, burning, looting and destroying everything in their path. Again they seize power.\nMarch 7, 1919. Bamberg. Ernst Toller, a jewish journalist and playwright, declares himself leader of a new Soviet Republic in Bavaria. After only 6 days, he is deposed by an even more radical jew, Eugen Levine. Levine cobbles together a \"Red Army\" from disgruntled jewish miscreants and factory workers, which proceeds to confiscate cash, homes, food and weapons from ordinary people. Levine's Army rededicates Munich's Cathedral to the \"Goddess of Reason.\"\nThis time the jews will not be ousted so easily. it will take more than 1 armed patriot to bring them down.\nThe Freikorps mobilizes against the communists to restore power to the German volk. Panicking and desperate to hold onto power, the Red Army barricades itself in Munich with aristocratic German hostages. With negotiations leading nowhere, all 10 hostages are executed by the jews. War break out in the city, leading to the death of over 300 German civilians.\nAugust 1919. The so-called German Revolution is over. The threat of communism has been subdued, but the jewish revolutionary spirit is not so easily extinguished. The Weimer Republic is coming...\nThe 1 year period between the end of WW1 and the beginning of the Weimer Republic is sometimes called the German Revolution.\nGermany essentially had no government, which led to dozens of communist and socialist groups (all ran by jews) frantically trying to spark a Bolshevik uprising to seize power. Hitler talks about this in Mein Kampf, but again the details are so hyper-specific in time and place that it's hard for an outsider to understand.\nAs awful and degenerate as the Weimar period was, for Germans at the time it was at least a stable respite from the communist anarchy which preceded it. -- I forget where I got that story from, but it's an entertaining read. permalink award report block reply Tongs_Ya_Bass 2 points 1 day ago Conclusion: deport the Jews. Never let them back in. permalink parent award report block reply\nTongs_Ya_Bass 2 points 1 day ago Conclusion: deport the Jews. Never let them back in. permalink parent award report block reply\nsomeguy7738 2 points 1 day ago Never should have been involved in the first place. Anyway, we get that fucking bullshit federal reserve and suddenly, before you know it, we're in some huge bullshit war that has fuck all to do with the American people racking up massive debt to same said central bank. Every other nation involved also had a branch of the international financier's central bank as well. Pure cohencidence. permalink award report block reply\nSurrenderFreeman 2 points 1 day ago Which lead to ww2 because of how shitty the agreement was permalink award report block reply\nSanityGumby 1 points 14 hours ago You can still wear poppies even though it’s name was changed permalink award report block reply\nRudeFrog 0 points 24 hours ago Ah yes one of the days our betters said we can stop killing each other for their bank accounts, what a special day permalink award report block reply\nbooblitchutz 0 points 1 day ago Armistice Day celebrated the end of war. Veterans Day celebrates people who continue to fight in wars. The agenda is pretty clear. permalink award report block reply\nSkullLeader117 0 points 1 day ago How many white Christian men were killed? permalink award report block reply\nKungPaoMcChicken 0 points 24 hours ago And everyone lived happily ever after, the end. permalink award report block reply\nstillbringingitback -1 points 19 hours ago We fought the wrong enemy. permalink award report block reply\ndr_gonzo -1 points 19 hours ago And just 4 days earlier the Jewish communist Kurt Eisner overthrew the German government, causing the Kaiser to abdicate. Then they surrendered without a shot fired on German soil, signed the entire economic future over to western bankers and gave half the country away geographically. 🥳 And isn't it an odd coincidence that a year earlier the Brits released a public declaration addressed to Lord Walter Rothschild of the infamous German Jewish banking family, promising their support for a Jewish homeland in Israel if they won the war? This was called the Balfour Declaration, and it was later discovered at the Paris Peace Conference that this declaration was in exchange for the zionists using their newly established power in the American federal reserve to bring the US into the war on behalf of the allied powers. Such a strange coincidence. It's almost as if Jewish communists sold their country down the river in exchange for Israel. 🤔 And then one day, for no reason at all... permalink award report block reply"
}