{
  "id": "1ARK58zFdG",
  "url": "https://patriots.win/p/1ARK58zFdG/iran-in-crisis-as-major-drought-/c",
  "content": "880 Iran in crisis as major drought forces regime to cut off water to Tehran, consider evacuation (nypost.com) posted 4 days ago by Deplora 191 comments award share report block Iran in crisis as major drought forces regime to cut off water to Tehran, consider evacuation The Islamic Republic announced it will start cutting its water supply to Tehran on Saturday night as it tries to stave off intense drought conditions that are crippling the nation. nypost.com\n191 comments Sort by Top Top New Worst Old Save Around the Web Seniors Born 1939-1969 Receive 11 Benefits This Month If They Ask Super Saving Online Oldman1234 79 points 4 days ago If they spent less time praying and hunting down infidels, and spent more time building dams and creating reservoirs, they wouldn't have this problem. permalink award report block reply Deplora OP 47 points 4 days ago Also if they'd spent a lot less time and money trying to build nuclear weapons.  Trump wouldn't have blown up dams and reservoirs. permalink parent award report block reply iamherefortheluls 9 points 4 days ago Their only other way to get fresh water is desalination. A process that requires a lot of energy, especially if you want to supply a country with such a large agriculture and pasture economy as Iran. They submitted to international inspections and those confirmed that Iran's nuclear fuel was not weapons grade, up until 'anonymous sources' told Trump otherwise. permalink parent award report block reply Noadhominem 1 points 3 days ago Israel figured it out. permalink parent award report block reply Kricket 1 points 4 days ago Yeah, well, it’s the desert. Maybe countries with such glaring vulnerabilities should just learn to shut the fuck up. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago hello Israel. permalink parent award report block reply fightfightfightx -9 points 4 days ago considering Israel has for 30 years expressed a desire to conquer them, nukes are their only chance at existing sad reality permalink parent award report block reply aaafirefly123 17 points 4 days ago Israel’s population is too small to rule an empire that big. And Muslims are WAY too unruly to be ruled over by foreigners. permalink parent award report block reply fightfightfightx 11 points 4 days ago tell that to Netanyahu who has openly expressed this for decades lol cant have a \"greater Israel\" if you dont genocide your neighbors permalink parent award report block reply view 7 more comments... okboomer59 4 points 4 days ago The French and British colonized virtually the entire Muslim world. permalink parent award report block reply view 4 more comments... NADSAQ 9 points 4 days ago i have seen a lot of outlandish claims about jews and israel in the past 30 years i have literally never heard this one, and it’s a doozy permalink parent award report block reply fightfightfightx 9 points 4 days ago Netanyahu has openly expressed a desire to conquer them for 30 years. If they succeeded in killing Trump, you'd have Nikki Haley and war with Iran right now. When Trump was shot, they blamed Iran with 0 evidence. But, Mayorkas is a communist jew from cuba, ruled the DHS which controlled the secret service when a roof was left open right next to Trump as a patsy took a shot at Trump. The media crowned Nikki Haley as #2 right beforehand, despite no actual public support. She is a huge warhawk that would go into ANY war, especially with Iran. Weird, huh? Then Trump becomes president, and Israel tries to start the war anyway. They assassinate hundreds of politicians and public figures. Trump puts his foot down and says no because he wants to be known for peace, not war. We avoided what I claimed Israel wants by a hair. And you call it an outlandish claim? What time is it in Tel Aviv? lol permalink parent award report block reply view 5 more comments... hansgruber7 4 points 4 days ago Joined 106 days ago.  Retarded take. permalink parent award report block reply fightfightfightx -3 points 4 days ago Ive been watching T_D since before the Orlando shooting on reddit, fag the reality is the jews in the region as as, if not more, blood thirst then their muzzie neighbors they openly celebrate when EU aid workers get specifically murdered by the IDF in a targeted strike on social media, and openly declare every child of the arab neighbors be killed in gaza demonic freaks, the whole region is a mess if two feral animals want to kill each other, the only chance for feral animal B to survive feral animal A is to have the same strength fuck Iran, but Im not blind. They obviously are fucked if they dont get their shit together. It's like a chinese village with the mongolian horde (Israel) right next to them permalink parent award report block reply view 5 more comments... Yawnz13 2 points 4 days ago Care to show statements proving that?  It's the other way around. permalink parent award report block reply Kricket 1 points 4 days ago Well then maybe they don’t get to exist. This has been largely understood for all of history up until recently. permalink parent award report block reply load 2 more comments... DeportThemAllForever -11 points 4 days ago Their crime is they wanted to keep their own oil, we got to be honest with each other. permalink parent award report block reply Deplora OP 17 points 4 days ago No they didn't.  Their government wanted to sell their oil to the highest bidders so it would have more money to spend building nuclear weapons. permalink parent award report block reply RedStoneDeepState 6 points 4 days ago Their crime is murdering hundreds of Americans as a Soviet backed puppet. permalink parent award report block reply nemonster 2 points 4 days ago Tequila , you know... permalink parent award report block reply rootGoose 2 points 4 days ago The crime is that they are idolatrous pagans. permalink parent award report block reply hansgruber7 2 points 4 days ago Joined 282 days ago. permalink parent award report block reply load 1 more comments... BruddahIz 7 points 4 days ago Curious what the population of Iran has been since the Shaw Fell?  So I looked it up.  They are not exponentially breeding after Ayatolah came to power.  In general its linear - but at a very high rate. https://www.macrotrends.net/global-metrics/countries/irn/iran/population permalink parent award report block reply guywholikesDjtof2024 5 points 4 days ago praying To a false god. Prayer to Christ yields good. Prayers to false gods is hollow. Biblical Christianity is what iran needs. Not islam. permalink parent award report block reply KernalMustard 6 points 4 days ago Maybe a return to Zoroastrianism permalink parent award report block reply anishr 0 points 4 days ago Christianity is a bullshit political pyramid scheme that is trying super hard to be called a religion. Try a real religion next time. permalink parent award report block reply guywholikesDjtof2024 0 points 4 days ago You sound confident that is a fact. Not that that's a bad thing. I wonder, where do you get your confidence from? And in your belief set, why should \"what harms humans\" be a bad thing? In Christianity, it is because God made us valuable and loves us. In your worldview, it is bad because [blank] What religion do YOU suggest? permalink parent award report block reply anishr 0 points 3 days ago I get my confidence from 10 years of Bible study, multiple generations of Hindu wisdom, 10 additional years of actual religious study combined with practice and experimentation. In my belief set, humans are vessels of God. Would you harm a vessel of God? Most pagan religions have a superior understanding of reality compared to Christianity. Gallic, Celtic, Zoroastrians, Tao, Hinduism, etc. permalink parent award report block reply view 3 more comments... RedStoneDeepState 4 points 4 days ago The issue is excessive dams. permalink parent award report block reply Tyndel 2 points 4 days ago And it started all the way back before the muslims took over also.  The short and mid term answer is to desalinate the caspian sea and pump water to the headwaters in the mountains just south.  But when isreal offered to help them develop the desalinization plants they doubled down on funding terror instead. permalink parent award report block reply RedStoneDeepState 5 points 4 days ago I wont blame Iran for not accepting infrastructure project help from a hostile foreign country, but it is a bit hilarious that the only country with the technical experts they need is their opposition, Israel and to a far lesser extent the USA. permalink parent award report block reply iamherefortheluls 1 points 4 days ago the only country with the technical experts they need its by far not the only country. Both Russia and China are more than willing to provide expertise on this. The problem with desalination is that you need obscene amounts of energy to do it on scale that matters. Iran's in a dry region and the country is big on agriculture and also pastures. So they are going to need to desalinate a whole lot of water to help offset their drained natural reservoir Guess what Iran needs for that? if you said 'a bunch of nuclear power plants' and nuclear fuel, you would be right. Now you might recall that their nuclear program has been sabotaged repeatedly by US and Israel and also someone recently bombed the shit out of their critical sites. And yeah, for Iran getting that nuclear program up and running well is a matter of long term national survival in the strategic sense. Which is why a lot of people who watch that region believe Trump didn't stop a war in that particular case but merely guaranteed one to happen soon. permalink parent award report block reply view 3 more comments... KernalMustard 1 points 4 days ago Religion. permalink parent award report block reply load 5 more comments... DeusVult1096 23 points 4 days ago Oh no! Anyway... permalink award report block reply Deplora OP 21 points 4 days ago I feel bad for the innocent people who are trapped under this evil and incompetent regime. permalink parent award report block reply BruddahIz 4 points 4 days ago Many of the people that would care were killed. permalink parent award report block reply RedStoneDeepState 6 points 4 days ago Fuck no, they were targeted strikes on government facilities. That kills regime loyalists. permalink parent award report block reply DT170x 19 points 4 days ago Instead of spending Islam.....You just build some desalination plants with that oil money. Idk....I just a Dumb infidel. permalink award report block reply Deplora OP 8 points 4 days ago Instead of building nuclear weapons that President Trump is just going to come along and blow up.  The amount of capital burned through by that decades-long project is staggering. permalink parent award report block reply Hikedelics 3 points 4 days ago I mean, they’re dumb, but also I sorta get it. If I had the means I’d probably have a nuke tucked in the corner of my closet. To be honest, I think most guys would. I don’t think any of us have a clue as to why we’d want it or what we’d do with it other than “have” it. permalink parent award report block reply carpetxparmesan 1 points 3 days ago To be honest, it's your CONSTITUTIONAL RIGHT to have a nuclear weapon and it's your duty under God to make it happen. permalink parent award report block reply LordKuroTheGreat 5 points 4 days ago To be fair, to do that efficiently you need nuclear power, and if they do that Israel will order America to burn $100 million+ in taxpayer dollars to bomb them. permalink parent award report block reply RedStoneDeepState 3 points 4 days ago Nuclear power is incredibly expensive permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Where are they going to get technical experts? The world leading technical experts in desalinization are all Israelis. permalink parent award report block reply DT170x 7 points 4 days ago American and the west got some desalination plants....oh wait they don't like them. Well they can get it from Temu(China) and hope it does not fail in a few years. permalink parent award report block reply RedStoneDeepState 1 points 4 days ago All the projects in California hire Israelis too. Besides that there really isn't much in the West. This is what AIPAC actually lobbies for - joint US Israeli programs. 80% of it is missile defense but desalinization is a large part of the other programs. China doesn't have shit for desalinization technology because their climate results in them not needing it. Most of their people live in what is naturally tropical rainforest. permalink parent award report block reply TenaciousDT 2 points 4 days ago LOL sure buddy permalink parent award report block reply NADSAQ 5 points 4 days ago maybe instead of professing to kill them all, they could try hiring them? permalink parent award report block reply RedStoneDeepState 3 points 4 days ago They would need regime change and they would rather people die than regime change. permalink parent award report block reply carpetxparmesan 2 points 3 days ago My guy, they know how to get water. 🤣🤣🤣 permalink parent award report block reply Tyndel 4 points 4 days ago Isreal offered to help them build them but iran refused all the way back in 2018.  They doubled down on funding terror, nukes, and worshiping a rock for rain. permalink parent award report block reply Viewer01 1 points 4 days ago If only they had a compact source of energy to make such cheap and efficient. Like a nuclear- oh. permalink parent award report block reply henri_derelicte 18 points 4 days ago This is more devastating than any bomb dropped by the Israelis permalink award report block reply aaafirefly123 14 points 4 days ago Yep, turns out the biggest threat to Iran wasn’t Israel nor America. It was the Ayatollah’s own inept leadership. I don’t think the Ayatollah regime will last much longer. permalink parent award report block reply CanadianTrump2 8 points 4 days ago I feel like thats been said now for a decade+ permalink parent award report block reply iamherefortheluls 2 points 4 days ago which again shows that the best thing Trump could have done there is just left them the fuck alone. His air strikes on the country only bolstered the political influence of the regime who's now been justified in their claims that US and Israel are an imminent threat. permalink parent award report block reply Deplora OP 10 points 4 days ago Also more devastating than the bunkerbuster bombs dropped by the Americans. permalink parent award report block reply spez_this 9 points 4 days ago The bunkerbusters didn't destroy anything of benefit to the Iranian people. permalink parent award report block reply Deplora OP 6 points 4 days ago No, but the nuclear weapon-building facilities that the bunkerbusters destroyed had cost huge amounts of money for decades, and one way or another, all that capital was taken from the Iranian people. At least the bunkerbusters put a stop to the long-running capital-guzzling project. permalink parent award report block reply carpetxparmesan 1 points 3 days ago You shouldn't arrest fentanyl dealers. One way or another, you're taxing the crackhead population and, really, is that not too unkind? permalink parent award report block reply iamherefortheluls 1 points 4 days ago of course. If your country is short on water and your only option is to desalinate from the nearby sea, why would you want silly things like having nuclear power plants. Its not like desalination is one of the most energy demanding process on... oh wait, I was reading that the wrong way around. Well, its not like fresh water is important. I am sure they will just calmly accept that they are not allowed to have any because USA says so. permalink parent award report block reply spez_this 1 points 3 days ago They weren't nuclear power plants. They were uranium enrichment facilities. A nuclear power plant operates operates on 3-5% uranium. These facilities were being used to generate weapons-grade uranium - up to 90%. BTW, you don't hide nuclear power plants 80 m underground. permalink parent award report block reply friedchicken 0 points 4 days ago israel is a mistake permalink parent award report block reply btntx 11 points 4 days ago Quick! Send the democrats there! They know how to make the weather gooder! permalink award report block reply BruddahIz 7 points 4 days ago I wonder what the lowering of the Caspian Sea via diversion the last 20 years has affected thier wtern patterns? permalink award report block reply Tyndel 2 points 4 days ago The countries around but specifically to the east are diverting water from rivers and also doing cloud seeding.  There is not an unlimited amount of water in the air so when water is artificially removed the passing air starts to pull it out of the ground it is next passing through.  This is why countries down weather from large cloud seeding projects are seeing changes in rainfall and climate. permalink parent award report block reply Nomad899 7 points 4 days ago Climate warming change permalink award report block reply LordKuroTheGreat 6 points 4 days ago 0 fucks to give unless they try to evacuate here, in which case fuck you and stay in your desert shithole. permalink award report block reply Bldg_2019 6 points 4 days ago They can still hang faggots from cranes, right. No water needed. permalink award report block reply carpetxparmesan 1 points 3 days ago Environmentally conscious jihad. It's the only way. permalink parent award report block reply rtav 5 points 4 days ago We're doing it with our weather control machines. permalink award report block reply Nigel_Planter 3 points 4 days ago Weather warfare permalink parent award report block reply tralbolh 5 points 4 days ago Good thing they kicked out all those illegal immigrants earlier this year. We should do the same for our next drought. permalink award report block reply Overtaxed 5 points 4 days ago They better get to England, Ireland, Germany or France ASAP!  /s permalink award report block reply friedchicken 5 points 4 days ago That sucks :( permalink award report block reply Deplora OP 5 points 4 days ago It does, because I'm sure that somehow the leaders of the regime will still get all the water they want.  It's the ordinary people who are screwed. permalink parent award report block reply billybaldwin2 5 points 4 days ago Clinton wishing her foundation to dump them all in Michigan again. permalink award report block reply lul_cheto 4 points 4 days ago Whats this have to do with murica? permalink award report block reply RedStoneDeepState 3 points 4 days ago Iran was a Soviet backed puppet who has backed repeated acts of terrorism against the USA. permalink parent award report block reply staroframphansbhole 5 points 4 days ago Did you get those talking points from your local synagogue? permalink parent award report block reply RedStoneDeepState -2 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply IForgotToAddAnEmail 2 points 3 days ago Hello Jew, along with that dues vult guy permalink parent award report block reply staroframphansbhole 1 points 2 days ago If I had a nickel for every time a Christ-denier tried to set up the false dialectic that anyone awake to their bullshit must be a follower of Muhammad the pedophile, I'd have enough to pay the interest you charge. permalink parent award report block reply view 1 more comments... lul_cheto -1 points 4 days ago lololololololol.. permalink parent award report block reply RedStoneDeepState 2 points 4 days ago So you are a retard, got it. permalink parent award report block reply lul_cheto -1 points 4 days ago im the retard? yet you wanna get re engaged in a pro azzreal middle east war and are still scured of a regime that fell almost 50 years ago.. lol ok gay permalink parent award report block reply view 7 more comments... ArchRespawnsAgain 0 points 4 days ago Many posters here are Israelis who want to drag the US into an Iranian regime change operation. permalink parent award report block reply lul_cheto 4 points 4 days ago Whats this got to do with murica? permalink award report block reply staroframphansbhole 2 points 4 days ago Nothing, just more MIGA poison that Christ-denying faggots like u/DeusVult1096 u/DT170x u/henri_derelicte can inject into MAGA and beat off to when they’re not bloodying mattresses in tunnels under NYC permalink parent award report block reply IForgotToAddAnEmail 2 points 3 days ago Add RedStoneDeepstate to that permalink parent award report block reply nemonster 3 points 4 days ago Call allah. Not my fucking problem permalink award report block reply FusionBlack 3 points 4 days ago What a shame. permalink award report block reply DingleBalls 2 points 4 days ago A DROUGHT. In a DESERT. 🤔 permalink award report block reply carpetxparmesan 2 points 3 days ago I feel like I read about the hanging gardens of babylon in some book somewhere. Some even speculate they may have used archimedan screws for local pumping, though the engineering feat of supplying the water alone would be impressive on its own. Iran is just having a real life ancient aliens episode right now. \"But how habibi? How does watere move, inchallah? What does this proverb mean that mohammed must come to the mountain?\" permalink parent award report block reply Rango 2 points 4 days ago Better send more Billion$ to Ukraine. permalink award report block reply carpetxparmesan 2 points 3 days ago \"The oldest known aqueduct is the Jerwan Aqueduct, constructed between 703 and 690 BC by Sanherib (Sennecherib) of Assyria in what is now Iraqi Kurdistan.\" - AI slop Imagine being a sand negro in 700 before some jew gets nailed to a cross by one of the white swamp creatures living way out in the uncivilized boonies, inventing moving water from a mountain top to your capital 100km away ordering some sand negro engineering genius to carve rock out 3cm per 100m using bronze and iron age tools and then looking at these faggots in 2025 running out of water. I shit you not, you would make a new epic saga about decapitating every single one of them and order your feat immortalized in stone. permalink award report block reply SorosHasBallsackEyes 2 points 4 days ago Is this why it fucking rained in Biblical fashion for months here in Florida?\nSeriously. I am certain that weather modification experiments were to blame, but I initially thought it related to hurricane mitigation. Toppling Iran due to drought was not on my radar. permalink award report block reply Secondrun007 2 points 4 days ago Israel can make water.  Maybe if they beg? permalink award report block reply BlueKentuckyGirl 2 points 4 days ago God has his exquisite ways. That’s why one needs to be patient. His will be done. To him is the glory and power.\nMan can seek revenge, but it is nothing compared to the exquisite retribution that the almighty comes up with! Beautiful 🔥🔥🔥 permalink award report block reply guywholikesDjtof2024 10 points 4 days ago His* Him* the Almighty* permalink parent award report block reply BlueKentuckyGirl 5 points 4 days ago 🍻 permalink parent award report block reply fightfightfightx 2 points 4 days ago huh? meanwhile EU and US are being destroyed too or is that also \"God's plan\"???? permalink parent award report block reply patrioticwinning3 2 points 4 days ago That saddens me...no intervention! permalink award report block reply carpetxparmesan 1 points 3 days ago thisguyforcongress2028.jpg permalink parent award report block reply possibletower 2 points 4 days ago FAFO, Iran. Don't pick a fight and fight a war that doesn't even involve you in Syria and Lebanon and Gaza unless you want to find out. permalink award report block reply fightfightfightx 2 points 4 days ago they've been under constant siege of Israeli aggression for a while. The whole region is over 2000 years of racist blood wars between jewish supremacists and muzzies permalink parent award report block reply RedStoneDeepState -2 points 4 days ago Bullshit, Iran was a Soviet backed puppet and that is the source of current issues, not Israel. permalink parent award report block reply staroframphansbhole 0 points 4 days ago Pissfake’s existence is the source of current issues my Christ-killer cock-licker permalink parent award report block reply RedStoneDeepState -3 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply IncredibleMrE1 1 points 4 days ago Kek permalink parent award report block reply ParmesanCartel -3 points 4 days ago This is rich permalink parent award report block reply gaijin_ronin 2 points 4 days ago Oh no, anyways I had great day out with my son. We got treated to an early dinner because of his demonstration team's performance.  Then we went to the hardware store and bought a new oscillating tool so I can fix a door frame and work on some tile. Also Iran is a sandpit to begin with.  There is no loss. permalink award report block reply malooch 1 points 4 days ago oh no permalink award report block reply Handshake_Shmanshake 1 points 4 days ago Sounds like hell. permalink award report block reply Deplora OP 1 points 4 days ago Indeed.  And Iran was already pretty close to hell when running water was readily available. permalink parent award report block reply IronPatriot1 1 points 4 days ago Oh no....anyways. permalink award report block reply barwhack 1 points 4 days ago Allah loves you, O Mohammed. permalink award report block reply YaharaRiver 1 points 4 days ago lol Gonna have to use goat piss in your WUDUs 😂 permalink award report block reply DrVSGGEOTUSPhD 1 points 4 days ago Weather weapons?? permalink award report block reply carpetxparmesan 1 points 3 days ago It's called weather. This is just jihadi communists squeezing their tax base for shekels. They have all the guns and all the desire and means to kill. So the ones who don't... eat shit and die. A story as old as the desert itself. permalink parent award report block reply JustInTime2_ 1 points 4 days ago Not US concerns. permalink award report block reply DrVSGGEOTUSPhD 1 points 4 days ago QUICK SEND THEM MORE PALLETS OF CASH!!! permalink award report block reply Quiznos585 1 points 4 days ago Not. Our. Problem. permalink award report block reply Deplora OP 1 points 4 days ago At least not until they start fleeing in droves, and Mamdani rolls out the welcome mat for them in NYC . . . permalink parent award report block reply Datamancer 1 points 4 days ago Less time fuckin goats and building nukes and more time taking care of your citizens. permalink award report block reply JoeBidensDementia1 1 points 4 days ago Oh. Darn. permalink award report block reply rootGoose 1 points 4 days ago God is withholding the rain. permalink award report block reply alucard13mmfmj 1 points 4 days ago Its alright. Theyll be another source of rapfugees.... permalink award report block reply keeman 1 points 4 days ago I thought this was a Make America Great forum.  Why are we spending time on this shit? permalink award report block reply Hikedelics 1 points 4 days ago Let them go rebuild Gaza. Without our involvement. At all. permalink award report block reply nemonster 1 points 4 days ago More refugies. Welcome to NYC permalink award report block reply MocksFordComma 1 points 4 days ago I don’t care. Leave us out of it. permalink award report block reply HowLongIsNever 1 points 4 days ago I thought climate change was supposed to be a bad thing lmao permalink award report block reply MajorClark 1 points 4 days ago And  how much US tax payer money does congress want to give them?    Better be none! permalink award report block reply Deplora OP 2 points 4 days ago We delivered those nifty bunkerbuster bombs, which were certainly welcomed by the Iranian people, and cost us a tidy sum.  Money well spent, in my opinion.  But I feel like they need to deal with their own water problems.  Or ask their neighbors for help. permalink parent award report block reply funwithguitars 1 points 4 days ago We now know , we will never have go to war with Iran, we only have to  cut off the water supply permalink award report block reply Vorticity1 0 points 4 days ago So climate change is real? permalink award report block reply okboomer59 0 points 4 days ago Proof Joooz control the weather permalink award report block reply ciaramella_is_gay -1 points 4 days ago Just nuke the jews and take their water. permalink award report block reply MemeWarsVet 8 points 4 days ago Delicious nuclear water. permalink parent award report block reply RedStoneDeepState 4 points 4 days ago Delicious nuclear salt water pumped though Syria and Iraq. Israel needs desalinization tech for their water. permalink parent award report block reply nemonster 3 points 4 days ago Call india permalink parent award report block reply possibletower 3 points 4 days ago Iran can't do that because they have a shittyass military. They were unable to kill a single Israeli soldier or airman other than one off-duty IDF soldier killed in a missile strike by Iran on Israel while the entire Iranian military's hierarchy's generals were BBQ-ed by the Israelis 🤣 It was hilarious seeing all the Iran-cocksucking faggots here chimp out and REEEE, screaming \"UNFAIR ADVANTAGE\", everytime their generals were getting vaporized while they couldn't shoot down a single Israeli jet or stop a single Israeli missile. Iran's cocksuckers, especially here, were hyping them up as some powerful military for decades too. permalink parent award report block reply henri_derelicte 5 points 4 days ago Iran got their shit kicked in by Israel. The war may have ended in a “ceasefire,” but it was a decisive Israeli victory permalink parent award report block reply aaafirefly123 6 points 4 days ago It proved rather definitively that the Iranian government is completely powerless to stop Israel. permalink parent award report block reply henri_derelicte 4 points 4 days ago I wish Israel eliminated the ayatollah and “civilian” leadership of Iran just to show they could. permalink parent award report block reply fightfightfightx 0 points 4 days ago using American weapons and American taxdollars lets pull out and see how Israel handles the region... permalink parent award report block reply RedStoneDeepState 2 points 4 days ago Why? Iran was a Soviet backed puppet that claims legitimacy by being opposition to the USA. permalink parent award report block reply fightfightfightx 1 points 4 days ago demonic jewish supremacist warmongering is not something I care about if all the anti-bacon ideologies sunk into the ocean out planet would be better off permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Iran was a Soviet backed puppet and that is the source of current issues, not Israel. permalink parent award report block reply TheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nOldman1234 79 points 4 days ago If they spent less time praying and hunting down infidels, and spent more time building dams and creating reservoirs, they wouldn't have this problem. permalink award report block reply Deplora OP 47 points 4 days ago Also if they'd spent a lot less time and money trying to build nuclear weapons.  Trump wouldn't have blown up dams and reservoirs. permalink parent award report block reply iamherefortheluls 9 points 4 days ago Their only other way to get fresh water is desalination. A process that requires a lot of energy, especially if you want to supply a country with such a large agriculture and pasture economy as Iran. They submitted to international inspections and those confirmed that Iran's nuclear fuel was not weapons grade, up until 'anonymous sources' told Trump otherwise. permalink parent award report block reply Noadhominem 1 points 3 days ago Israel figured it out. permalink parent award report block reply Kricket 1 points 4 days ago Yeah, well, it’s the desert. Maybe countries with such glaring vulnerabilities should just learn to shut the fuck up. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago hello Israel. permalink parent award report block reply fightfightfightx -9 points 4 days ago considering Israel has for 30 years expressed a desire to conquer them, nukes are their only chance at existing sad reality permalink parent award report block reply aaafirefly123 17 points 4 days ago Israel’s population is too small to rule an empire that big. And Muslims are WAY too unruly to be ruled over by foreigners. permalink parent award report block reply fightfightfightx 11 points 4 days ago tell that to Netanyahu who has openly expressed this for decades lol cant have a \"greater Israel\" if you dont genocide your neighbors permalink parent award report block reply view 7 more comments... okboomer59 4 points 4 days ago The French and British colonized virtually the entire Muslim world. permalink parent award report block reply view 4 more comments... NADSAQ 9 points 4 days ago i have seen a lot of outlandish claims about jews and israel in the past 30 years i have literally never heard this one, and it’s a doozy permalink parent award report block reply fightfightfightx 9 points 4 days ago Netanyahu has openly expressed a desire to conquer them for 30 years. If they succeeded in killing Trump, you'd have Nikki Haley and war with Iran right now. When Trump was shot, they blamed Iran with 0 evidence. But, Mayorkas is a communist jew from cuba, ruled the DHS which controlled the secret service when a roof was left open right next to Trump as a patsy took a shot at Trump. The media crowned Nikki Haley as #2 right beforehand, despite no actual public support. She is a huge warhawk that would go into ANY war, especially with Iran. Weird, huh? Then Trump becomes president, and Israel tries to start the war anyway. They assassinate hundreds of politicians and public figures. Trump puts his foot down and says no because he wants to be known for peace, not war. We avoided what I claimed Israel wants by a hair. And you call it an outlandish claim? What time is it in Tel Aviv? lol permalink parent award report block reply view 5 more comments... hansgruber7 4 points 4 days ago Joined 106 days ago.  Retarded take. permalink parent award report block reply fightfightfightx -3 points 4 days ago Ive been watching T_D since before the Orlando shooting on reddit, fag the reality is the jews in the region as as, if not more, blood thirst then their muzzie neighbors they openly celebrate when EU aid workers get specifically murdered by the IDF in a targeted strike on social media, and openly declare every child of the arab neighbors be killed in gaza demonic freaks, the whole region is a mess if two feral animals want to kill each other, the only chance for feral animal B to survive feral animal A is to have the same strength fuck Iran, but Im not blind. They obviously are fucked if they dont get their shit together. It's like a chinese village with the mongolian horde (Israel) right next to them permalink parent award report block reply view 5 more comments... Yawnz13 2 points 4 days ago Care to show statements proving that?  It's the other way around. permalink parent award report block reply Kricket 1 points 4 days ago Well then maybe they don’t get to exist. This has been largely understood for all of history up until recently. permalink parent award report block reply load 2 more comments... DeportThemAllForever -11 points 4 days ago Their crime is they wanted to keep their own oil, we got to be honest with each other. permalink parent award report block reply Deplora OP 17 points 4 days ago No they didn't.  Their government wanted to sell their oil to the highest bidders so it would have more money to spend building nuclear weapons. permalink parent award report block reply RedStoneDeepState 6 points 4 days ago Their crime is murdering hundreds of Americans as a Soviet backed puppet. permalink parent award report block reply nemonster 2 points 4 days ago Tequila , you know... permalink parent award report block reply rootGoose 2 points 4 days ago The crime is that they are idolatrous pagans. permalink parent award report block reply hansgruber7 2 points 4 days ago Joined 282 days ago. permalink parent award report block reply load 1 more comments... BruddahIz 7 points 4 days ago Curious what the population of Iran has been since the Shaw Fell?  So I looked it up.  They are not exponentially breeding after Ayatolah came to power.  In general its linear - but at a very high rate. https://www.macrotrends.net/global-metrics/countries/irn/iran/population permalink parent award report block reply guywholikesDjtof2024 5 points 4 days ago praying To a false god. Prayer to Christ yields good. Prayers to false gods is hollow. Biblical Christianity is what iran needs. Not islam. permalink parent award report block reply KernalMustard 6 points 4 days ago Maybe a return to Zoroastrianism permalink parent award report block reply anishr 0 points 4 days ago Christianity is a bullshit political pyramid scheme that is trying super hard to be called a religion. Try a real religion next time. permalink parent award report block reply guywholikesDjtof2024 0 points 4 days ago You sound confident that is a fact. Not that that's a bad thing. I wonder, where do you get your confidence from? And in your belief set, why should \"what harms humans\" be a bad thing? In Christianity, it is because God made us valuable and loves us. In your worldview, it is bad because [blank] What religion do YOU suggest? permalink parent award report block reply anishr 0 points 3 days ago I get my confidence from 10 years of Bible study, multiple generations of Hindu wisdom, 10 additional years of actual religious study combined with practice and experimentation. In my belief set, humans are vessels of God. Would you harm a vessel of God? Most pagan religions have a superior understanding of reality compared to Christianity. Gallic, Celtic, Zoroastrians, Tao, Hinduism, etc. permalink parent award report block reply view 3 more comments... RedStoneDeepState 4 points 4 days ago The issue is excessive dams. permalink parent award report block reply Tyndel 2 points 4 days ago And it started all the way back before the muslims took over also.  The short and mid term answer is to desalinate the caspian sea and pump water to the headwaters in the mountains just south.  But when isreal offered to help them develop the desalinization plants they doubled down on funding terror instead. permalink parent award report block reply RedStoneDeepState 5 points 4 days ago I wont blame Iran for not accepting infrastructure project help from a hostile foreign country, but it is a bit hilarious that the only country with the technical experts they need is their opposition, Israel and to a far lesser extent the USA. permalink parent award report block reply iamherefortheluls 1 points 4 days ago the only country with the technical experts they need its by far not the only country. Both Russia and China are more than willing to provide expertise on this. The problem with desalination is that you need obscene amounts of energy to do it on scale that matters. Iran's in a dry region and the country is big on agriculture and also pastures. So they are going to need to desalinate a whole lot of water to help offset their drained natural reservoir Guess what Iran needs for that? if you said 'a bunch of nuclear power plants' and nuclear fuel, you would be right. Now you might recall that their nuclear program has been sabotaged repeatedly by US and Israel and also someone recently bombed the shit out of their critical sites. And yeah, for Iran getting that nuclear program up and running well is a matter of long term national survival in the strategic sense. Which is why a lot of people who watch that region believe Trump didn't stop a war in that particular case but merely guaranteed one to happen soon. permalink parent award report block reply view 3 more comments... KernalMustard 1 points 4 days ago Religion. permalink parent award report block reply load 5 more comments...\nDeplora OP 47 points 4 days ago Also if they'd spent a lot less time and money trying to build nuclear weapons.  Trump wouldn't have blown up dams and reservoirs. permalink parent award report block reply iamherefortheluls 9 points 4 days ago Their only other way to get fresh water is desalination. A process that requires a lot of energy, especially if you want to supply a country with such a large agriculture and pasture economy as Iran. They submitted to international inspections and those confirmed that Iran's nuclear fuel was not weapons grade, up until 'anonymous sources' told Trump otherwise. permalink parent award report block reply Noadhominem 1 points 3 days ago Israel figured it out. permalink parent award report block reply Kricket 1 points 4 days ago Yeah, well, it’s the desert. Maybe countries with such glaring vulnerabilities should just learn to shut the fuck up. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago hello Israel. permalink parent award report block reply fightfightfightx -9 points 4 days ago considering Israel has for 30 years expressed a desire to conquer them, nukes are their only chance at existing sad reality permalink parent award report block reply aaafirefly123 17 points 4 days ago Israel’s population is too small to rule an empire that big. And Muslims are WAY too unruly to be ruled over by foreigners. permalink parent award report block reply fightfightfightx 11 points 4 days ago tell that to Netanyahu who has openly expressed this for decades lol cant have a \"greater Israel\" if you dont genocide your neighbors permalink parent award report block reply view 7 more comments... okboomer59 4 points 4 days ago The French and British colonized virtually the entire Muslim world. permalink parent award report block reply view 4 more comments... NADSAQ 9 points 4 days ago i have seen a lot of outlandish claims about jews and israel in the past 30 years i have literally never heard this one, and it’s a doozy permalink parent award report block reply fightfightfightx 9 points 4 days ago Netanyahu has openly expressed a desire to conquer them for 30 years. If they succeeded in killing Trump, you'd have Nikki Haley and war with Iran right now. When Trump was shot, they blamed Iran with 0 evidence. But, Mayorkas is a communist jew from cuba, ruled the DHS which controlled the secret service when a roof was left open right next to Trump as a patsy took a shot at Trump. The media crowned Nikki Haley as #2 right beforehand, despite no actual public support. She is a huge warhawk that would go into ANY war, especially with Iran. Weird, huh? Then Trump becomes president, and Israel tries to start the war anyway. They assassinate hundreds of politicians and public figures. Trump puts his foot down and says no because he wants to be known for peace, not war. We avoided what I claimed Israel wants by a hair. And you call it an outlandish claim? What time is it in Tel Aviv? lol permalink parent award report block reply view 5 more comments... hansgruber7 4 points 4 days ago Joined 106 days ago.  Retarded take. permalink parent award report block reply fightfightfightx -3 points 4 days ago Ive been watching T_D since before the Orlando shooting on reddit, fag the reality is the jews in the region as as, if not more, blood thirst then their muzzie neighbors they openly celebrate when EU aid workers get specifically murdered by the IDF in a targeted strike on social media, and openly declare every child of the arab neighbors be killed in gaza demonic freaks, the whole region is a mess if two feral animals want to kill each other, the only chance for feral animal B to survive feral animal A is to have the same strength fuck Iran, but Im not blind. They obviously are fucked if they dont get their shit together. It's like a chinese village with the mongolian horde (Israel) right next to them permalink parent award report block reply view 5 more comments... Yawnz13 2 points 4 days ago Care to show statements proving that?  It's the other way around. permalink parent award report block reply Kricket 1 points 4 days ago Well then maybe they don’t get to exist. This has been largely understood for all of history up until recently. permalink parent award report block reply load 2 more comments... DeportThemAllForever -11 points 4 days ago Their crime is they wanted to keep their own oil, we got to be honest with each other. permalink parent award report block reply Deplora OP 17 points 4 days ago No they didn't.  Their government wanted to sell their oil to the highest bidders so it would have more money to spend building nuclear weapons. permalink parent award report block reply RedStoneDeepState 6 points 4 days ago Their crime is murdering hundreds of Americans as a Soviet backed puppet. permalink parent award report block reply nemonster 2 points 4 days ago Tequila , you know... permalink parent award report block reply rootGoose 2 points 4 days ago The crime is that they are idolatrous pagans. permalink parent award report block reply hansgruber7 2 points 4 days ago Joined 282 days ago. permalink parent award report block reply load 1 more comments...\niamherefortheluls 9 points 4 days ago Their only other way to get fresh water is desalination. A process that requires a lot of energy, especially if you want to supply a country with such a large agriculture and pasture economy as Iran. They submitted to international inspections and those confirmed that Iran's nuclear fuel was not weapons grade, up until 'anonymous sources' told Trump otherwise. permalink parent award report block reply Noadhominem 1 points 3 days ago Israel figured it out. permalink parent award report block reply Kricket 1 points 4 days ago Yeah, well, it’s the desert. Maybe countries with such glaring vulnerabilities should just learn to shut the fuck up. permalink parent award report block reply\nNoadhominem 1 points 3 days ago Israel figured it out. permalink parent award report block reply\nKricket 1 points 4 days ago Yeah, well, it’s the desert. Maybe countries with such glaring vulnerabilities should just learn to shut the fuck up. permalink parent award report block reply\nPeterThielAntiChrist 1 points 3 days ago hello Israel. permalink parent award report block reply\nfightfightfightx -9 points 4 days ago considering Israel has for 30 years expressed a desire to conquer them, nukes are their only chance at existing sad reality permalink parent award report block reply aaafirefly123 17 points 4 days ago Israel’s population is too small to rule an empire that big. And Muslims are WAY too unruly to be ruled over by foreigners. permalink parent award report block reply fightfightfightx 11 points 4 days ago tell that to Netanyahu who has openly expressed this for decades lol cant have a \"greater Israel\" if you dont genocide your neighbors permalink parent award report block reply view 7 more comments... okboomer59 4 points 4 days ago The French and British colonized virtually the entire Muslim world. permalink parent award report block reply view 4 more comments... NADSAQ 9 points 4 days ago i have seen a lot of outlandish claims about jews and israel in the past 30 years i have literally never heard this one, and it’s a doozy permalink parent award report block reply fightfightfightx 9 points 4 days ago Netanyahu has openly expressed a desire to conquer them for 30 years. If they succeeded in killing Trump, you'd have Nikki Haley and war with Iran right now. When Trump was shot, they blamed Iran with 0 evidence. But, Mayorkas is a communist jew from cuba, ruled the DHS which controlled the secret service when a roof was left open right next to Trump as a patsy took a shot at Trump. The media crowned Nikki Haley as #2 right beforehand, despite no actual public support. She is a huge warhawk that would go into ANY war, especially with Iran. Weird, huh? Then Trump becomes president, and Israel tries to start the war anyway. They assassinate hundreds of politicians and public figures. Trump puts his foot down and says no because he wants to be known for peace, not war. We avoided what I claimed Israel wants by a hair. And you call it an outlandish claim? What time is it in Tel Aviv? lol permalink parent award report block reply view 5 more comments... hansgruber7 4 points 4 days ago Joined 106 days ago.  Retarded take. permalink parent award report block reply fightfightfightx -3 points 4 days ago Ive been watching T_D since before the Orlando shooting on reddit, fag the reality is the jews in the region as as, if not more, blood thirst then their muzzie neighbors they openly celebrate when EU aid workers get specifically murdered by the IDF in a targeted strike on social media, and openly declare every child of the arab neighbors be killed in gaza demonic freaks, the whole region is a mess if two feral animals want to kill each other, the only chance for feral animal B to survive feral animal A is to have the same strength fuck Iran, but Im not blind. They obviously are fucked if they dont get their shit together. It's like a chinese village with the mongolian horde (Israel) right next to them permalink parent award report block reply view 5 more comments... Yawnz13 2 points 4 days ago Care to show statements proving that?  It's the other way around. permalink parent award report block reply Kricket 1 points 4 days ago Well then maybe they don’t get to exist. This has been largely understood for all of history up until recently. permalink parent award report block reply load 2 more comments...\naaafirefly123 17 points 4 days ago Israel’s population is too small to rule an empire that big. And Muslims are WAY too unruly to be ruled over by foreigners. permalink parent award report block reply fightfightfightx 11 points 4 days ago tell that to Netanyahu who has openly expressed this for decades lol cant have a \"greater Israel\" if you dont genocide your neighbors permalink parent award report block reply view 7 more comments... okboomer59 4 points 4 days ago The French and British colonized virtually the entire Muslim world. permalink parent award report block reply view 4 more comments...\nfightfightfightx 11 points 4 days ago tell that to Netanyahu who has openly expressed this for decades lol cant have a \"greater Israel\" if you dont genocide your neighbors permalink parent award report block reply view 7 more comments...\nokboomer59 4 points 4 days ago The French and British colonized virtually the entire Muslim world. permalink parent award report block reply view 4 more comments...\nNADSAQ 9 points 4 days ago i have seen a lot of outlandish claims about jews and israel in the past 30 years i have literally never heard this one, and it’s a doozy permalink parent award report block reply fightfightfightx 9 points 4 days ago Netanyahu has openly expressed a desire to conquer them for 30 years. If they succeeded in killing Trump, you'd have Nikki Haley and war with Iran right now. When Trump was shot, they blamed Iran with 0 evidence. But, Mayorkas is a communist jew from cuba, ruled the DHS which controlled the secret service when a roof was left open right next to Trump as a patsy took a shot at Trump. The media crowned Nikki Haley as #2 right beforehand, despite no actual public support. She is a huge warhawk that would go into ANY war, especially with Iran. Weird, huh? Then Trump becomes president, and Israel tries to start the war anyway. They assassinate hundreds of politicians and public figures. Trump puts his foot down and says no because he wants to be known for peace, not war. We avoided what I claimed Israel wants by a hair. And you call it an outlandish claim? What time is it in Tel Aviv? lol permalink parent award report block reply view 5 more comments...\nfightfightfightx 9 points 4 days ago Netanyahu has openly expressed a desire to conquer them for 30 years. If they succeeded in killing Trump, you'd have Nikki Haley and war with Iran right now. When Trump was shot, they blamed Iran with 0 evidence. But, Mayorkas is a communist jew from cuba, ruled the DHS which controlled the secret service when a roof was left open right next to Trump as a patsy took a shot at Trump. The media crowned Nikki Haley as #2 right beforehand, despite no actual public support. She is a huge warhawk that would go into ANY war, especially with Iran. Weird, huh? Then Trump becomes president, and Israel tries to start the war anyway. They assassinate hundreds of politicians and public figures. Trump puts his foot down and says no because he wants to be known for peace, not war. We avoided what I claimed Israel wants by a hair. And you call it an outlandish claim? What time is it in Tel Aviv? lol permalink parent award report block reply view 5 more comments...\nhansgruber7 4 points 4 days ago Joined 106 days ago.  Retarded take. permalink parent award report block reply fightfightfightx -3 points 4 days ago Ive been watching T_D since before the Orlando shooting on reddit, fag the reality is the jews in the region as as, if not more, blood thirst then their muzzie neighbors they openly celebrate when EU aid workers get specifically murdered by the IDF in a targeted strike on social media, and openly declare every child of the arab neighbors be killed in gaza demonic freaks, the whole region is a mess if two feral animals want to kill each other, the only chance for feral animal B to survive feral animal A is to have the same strength fuck Iran, but Im not blind. They obviously are fucked if they dont get their shit together. It's like a chinese village with the mongolian horde (Israel) right next to them permalink parent award report block reply view 5 more comments...\nfightfightfightx -3 points 4 days ago Ive been watching T_D since before the Orlando shooting on reddit, fag the reality is the jews in the region as as, if not more, blood thirst then their muzzie neighbors they openly celebrate when EU aid workers get specifically murdered by the IDF in a targeted strike on social media, and openly declare every child of the arab neighbors be killed in gaza demonic freaks, the whole region is a mess if two feral animals want to kill each other, the only chance for feral animal B to survive feral animal A is to have the same strength fuck Iran, but Im not blind. They obviously are fucked if they dont get their shit together. It's like a chinese village with the mongolian horde (Israel) right next to them permalink parent award report block reply view 5 more comments...\nYawnz13 2 points 4 days ago Care to show statements proving that?  It's the other way around. permalink parent award report block reply\nKricket 1 points 4 days ago Well then maybe they don’t get to exist. This has been largely understood for all of history up until recently. permalink parent award report block reply\nDeportThemAllForever -11 points 4 days ago Their crime is they wanted to keep their own oil, we got to be honest with each other. permalink parent award report block reply Deplora OP 17 points 4 days ago No they didn't.  Their government wanted to sell their oil to the highest bidders so it would have more money to spend building nuclear weapons. permalink parent award report block reply RedStoneDeepState 6 points 4 days ago Their crime is murdering hundreds of Americans as a Soviet backed puppet. permalink parent award report block reply nemonster 2 points 4 days ago Tequila , you know... permalink parent award report block reply rootGoose 2 points 4 days ago The crime is that they are idolatrous pagans. permalink parent award report block reply hansgruber7 2 points 4 days ago Joined 282 days ago. permalink parent award report block reply load 1 more comments...\nDeplora OP 17 points 4 days ago No they didn't.  Their government wanted to sell their oil to the highest bidders so it would have more money to spend building nuclear weapons. permalink parent award report block reply\nRedStoneDeepState 6 points 4 days ago Their crime is murdering hundreds of Americans as a Soviet backed puppet. permalink parent award report block reply\nnemonster 2 points 4 days ago Tequila , you know... permalink parent award report block reply\nrootGoose 2 points 4 days ago The crime is that they are idolatrous pagans. permalink parent award report block reply\nhansgruber7 2 points 4 days ago Joined 282 days ago. permalink parent award report block reply\nBruddahIz 7 points 4 days ago Curious what the population of Iran has been since the Shaw Fell?  So I looked it up.  They are not exponentially breeding after Ayatolah came to power.  In general its linear - but at a very high rate. https://www.macrotrends.net/global-metrics/countries/irn/iran/population permalink parent award report block reply\nguywholikesDjtof2024 5 points 4 days ago praying To a false god. Prayer to Christ yields good. Prayers to false gods is hollow. Biblical Christianity is what iran needs. Not islam. permalink parent award report block reply KernalMustard 6 points 4 days ago Maybe a return to Zoroastrianism permalink parent award report block reply anishr 0 points 4 days ago Christianity is a bullshit political pyramid scheme that is trying super hard to be called a religion. Try a real religion next time. permalink parent award report block reply guywholikesDjtof2024 0 points 4 days ago You sound confident that is a fact. Not that that's a bad thing. I wonder, where do you get your confidence from? And in your belief set, why should \"what harms humans\" be a bad thing? In Christianity, it is because God made us valuable and loves us. In your worldview, it is bad because [blank] What religion do YOU suggest? permalink parent award report block reply anishr 0 points 3 days ago I get my confidence from 10 years of Bible study, multiple generations of Hindu wisdom, 10 additional years of actual religious study combined with practice and experimentation. In my belief set, humans are vessels of God. Would you harm a vessel of God? Most pagan religions have a superior understanding of reality compared to Christianity. Gallic, Celtic, Zoroastrians, Tao, Hinduism, etc. permalink parent award report block reply view 3 more comments...\nKernalMustard 6 points 4 days ago Maybe a return to Zoroastrianism permalink parent award report block reply\nanishr 0 points 4 days ago Christianity is a bullshit political pyramid scheme that is trying super hard to be called a religion. Try a real religion next time. permalink parent award report block reply guywholikesDjtof2024 0 points 4 days ago You sound confident that is a fact. Not that that's a bad thing. I wonder, where do you get your confidence from? And in your belief set, why should \"what harms humans\" be a bad thing? In Christianity, it is because God made us valuable and loves us. In your worldview, it is bad because [blank] What religion do YOU suggest? permalink parent award report block reply anishr 0 points 3 days ago I get my confidence from 10 years of Bible study, multiple generations of Hindu wisdom, 10 additional years of actual religious study combined with practice and experimentation. In my belief set, humans are vessels of God. Would you harm a vessel of God? Most pagan religions have a superior understanding of reality compared to Christianity. Gallic, Celtic, Zoroastrians, Tao, Hinduism, etc. permalink parent award report block reply view 3 more comments...\nguywholikesDjtof2024 0 points 4 days ago You sound confident that is a fact. Not that that's a bad thing. I wonder, where do you get your confidence from? And in your belief set, why should \"what harms humans\" be a bad thing? In Christianity, it is because God made us valuable and loves us. In your worldview, it is bad because [blank] What religion do YOU suggest? permalink parent award report block reply anishr 0 points 3 days ago I get my confidence from 10 years of Bible study, multiple generations of Hindu wisdom, 10 additional years of actual religious study combined with practice and experimentation. In my belief set, humans are vessels of God. Would you harm a vessel of God? Most pagan religions have a superior understanding of reality compared to Christianity. Gallic, Celtic, Zoroastrians, Tao, Hinduism, etc. permalink parent award report block reply view 3 more comments...\nanishr 0 points 3 days ago I get my confidence from 10 years of Bible study, multiple generations of Hindu wisdom, 10 additional years of actual religious study combined with practice and experimentation. In my belief set, humans are vessels of God. Would you harm a vessel of God? Most pagan religions have a superior understanding of reality compared to Christianity. Gallic, Celtic, Zoroastrians, Tao, Hinduism, etc. permalink parent award report block reply view 3 more comments...\nRedStoneDeepState 4 points 4 days ago The issue is excessive dams. permalink parent award report block reply Tyndel 2 points 4 days ago And it started all the way back before the muslims took over also.  The short and mid term answer is to desalinate the caspian sea and pump water to the headwaters in the mountains just south.  But when isreal offered to help them develop the desalinization plants they doubled down on funding terror instead. permalink parent award report block reply RedStoneDeepState 5 points 4 days ago I wont blame Iran for not accepting infrastructure project help from a hostile foreign country, but it is a bit hilarious that the only country with the technical experts they need is their opposition, Israel and to a far lesser extent the USA. permalink parent award report block reply iamherefortheluls 1 points 4 days ago the only country with the technical experts they need its by far not the only country. Both Russia and China are more than willing to provide expertise on this. The problem with desalination is that you need obscene amounts of energy to do it on scale that matters. Iran's in a dry region and the country is big on agriculture and also pastures. So they are going to need to desalinate a whole lot of water to help offset their drained natural reservoir Guess what Iran needs for that? if you said 'a bunch of nuclear power plants' and nuclear fuel, you would be right. Now you might recall that their nuclear program has been sabotaged repeatedly by US and Israel and also someone recently bombed the shit out of their critical sites. And yeah, for Iran getting that nuclear program up and running well is a matter of long term national survival in the strategic sense. Which is why a lot of people who watch that region believe Trump didn't stop a war in that particular case but merely guaranteed one to happen soon. permalink parent award report block reply view 3 more comments...\nTyndel 2 points 4 days ago And it started all the way back before the muslims took over also.  The short and mid term answer is to desalinate the caspian sea and pump water to the headwaters in the mountains just south.  But when isreal offered to help them develop the desalinization plants they doubled down on funding terror instead. permalink parent award report block reply RedStoneDeepState 5 points 4 days ago I wont blame Iran for not accepting infrastructure project help from a hostile foreign country, but it is a bit hilarious that the only country with the technical experts they need is their opposition, Israel and to a far lesser extent the USA. permalink parent award report block reply iamherefortheluls 1 points 4 days ago the only country with the technical experts they need its by far not the only country. Both Russia and China are more than willing to provide expertise on this. The problem with desalination is that you need obscene amounts of energy to do it on scale that matters. Iran's in a dry region and the country is big on agriculture and also pastures. So they are going to need to desalinate a whole lot of water to help offset their drained natural reservoir Guess what Iran needs for that? if you said 'a bunch of nuclear power plants' and nuclear fuel, you would be right. Now you might recall that their nuclear program has been sabotaged repeatedly by US and Israel and also someone recently bombed the shit out of their critical sites. And yeah, for Iran getting that nuclear program up and running well is a matter of long term national survival in the strategic sense. Which is why a lot of people who watch that region believe Trump didn't stop a war in that particular case but merely guaranteed one to happen soon. permalink parent award report block reply view 3 more comments...\nRedStoneDeepState 5 points 4 days ago I wont blame Iran for not accepting infrastructure project help from a hostile foreign country, but it is a bit hilarious that the only country with the technical experts they need is their opposition, Israel and to a far lesser extent the USA. permalink parent award report block reply iamherefortheluls 1 points 4 days ago the only country with the technical experts they need its by far not the only country. Both Russia and China are more than willing to provide expertise on this. The problem with desalination is that you need obscene amounts of energy to do it on scale that matters. Iran's in a dry region and the country is big on agriculture and also pastures. So they are going to need to desalinate a whole lot of water to help offset their drained natural reservoir Guess what Iran needs for that? if you said 'a bunch of nuclear power plants' and nuclear fuel, you would be right. Now you might recall that their nuclear program has been sabotaged repeatedly by US and Israel and also someone recently bombed the shit out of their critical sites. And yeah, for Iran getting that nuclear program up and running well is a matter of long term national survival in the strategic sense. Which is why a lot of people who watch that region believe Trump didn't stop a war in that particular case but merely guaranteed one to happen soon. permalink parent award report block reply view 3 more comments...\niamherefortheluls 1 points 4 days ago the only country with the technical experts they need its by far not the only country. Both Russia and China are more than willing to provide expertise on this. The problem with desalination is that you need obscene amounts of energy to do it on scale that matters. Iran's in a dry region and the country is big on agriculture and also pastures. So they are going to need to desalinate a whole lot of water to help offset their drained natural reservoir Guess what Iran needs for that? if you said 'a bunch of nuclear power plants' and nuclear fuel, you would be right. Now you might recall that their nuclear program has been sabotaged repeatedly by US and Israel and also someone recently bombed the shit out of their critical sites. And yeah, for Iran getting that nuclear program up and running well is a matter of long term national survival in the strategic sense. Which is why a lot of people who watch that region believe Trump didn't stop a war in that particular case but merely guaranteed one to happen soon. permalink parent award report block reply view 3 more comments...\nKernalMustard 1 points 4 days ago Religion. permalink parent award report block reply\nDeusVult1096 23 points 4 days ago Oh no! Anyway... permalink award report block reply Deplora OP 21 points 4 days ago I feel bad for the innocent people who are trapped under this evil and incompetent regime. permalink parent award report block reply BruddahIz 4 points 4 days ago Many of the people that would care were killed. permalink parent award report block reply RedStoneDeepState 6 points 4 days ago Fuck no, they were targeted strikes on government facilities. That kills regime loyalists. permalink parent award report block reply\nDeplora OP 21 points 4 days ago I feel bad for the innocent people who are trapped under this evil and incompetent regime. permalink parent award report block reply BruddahIz 4 points 4 days ago Many of the people that would care were killed. permalink parent award report block reply RedStoneDeepState 6 points 4 days ago Fuck no, they were targeted strikes on government facilities. That kills regime loyalists. permalink parent award report block reply\nBruddahIz 4 points 4 days ago Many of the people that would care were killed. permalink parent award report block reply RedStoneDeepState 6 points 4 days ago Fuck no, they were targeted strikes on government facilities. That kills regime loyalists. permalink parent award report block reply\nRedStoneDeepState 6 points 4 days ago Fuck no, they were targeted strikes on government facilities. That kills regime loyalists. permalink parent award report block reply\nDT170x 19 points 4 days ago Instead of spending Islam.....You just build some desalination plants with that oil money. Idk....I just a Dumb infidel. permalink award report block reply Deplora OP 8 points 4 days ago Instead of building nuclear weapons that President Trump is just going to come along and blow up.  The amount of capital burned through by that decades-long project is staggering. permalink parent award report block reply Hikedelics 3 points 4 days ago I mean, they’re dumb, but also I sorta get it. If I had the means I’d probably have a nuke tucked in the corner of my closet. To be honest, I think most guys would. I don’t think any of us have a clue as to why we’d want it or what we’d do with it other than “have” it. permalink parent award report block reply carpetxparmesan 1 points 3 days ago To be honest, it's your CONSTITUTIONAL RIGHT to have a nuclear weapon and it's your duty under God to make it happen. permalink parent award report block reply LordKuroTheGreat 5 points 4 days ago To be fair, to do that efficiently you need nuclear power, and if they do that Israel will order America to burn $100 million+ in taxpayer dollars to bomb them. permalink parent award report block reply RedStoneDeepState 3 points 4 days ago Nuclear power is incredibly expensive permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Where are they going to get technical experts? The world leading technical experts in desalinization are all Israelis. permalink parent award report block reply DT170x 7 points 4 days ago American and the west got some desalination plants....oh wait they don't like them. Well they can get it from Temu(China) and hope it does not fail in a few years. permalink parent award report block reply RedStoneDeepState 1 points 4 days ago All the projects in California hire Israelis too. Besides that there really isn't much in the West. This is what AIPAC actually lobbies for - joint US Israeli programs. 80% of it is missile defense but desalinization is a large part of the other programs. China doesn't have shit for desalinization technology because their climate results in them not needing it. Most of their people live in what is naturally tropical rainforest. permalink parent award report block reply TenaciousDT 2 points 4 days ago LOL sure buddy permalink parent award report block reply NADSAQ 5 points 4 days ago maybe instead of professing to kill them all, they could try hiring them? permalink parent award report block reply RedStoneDeepState 3 points 4 days ago They would need regime change and they would rather people die than regime change. permalink parent award report block reply carpetxparmesan 2 points 3 days ago My guy, they know how to get water. 🤣🤣🤣 permalink parent award report block reply Tyndel 4 points 4 days ago Isreal offered to help them build them but iran refused all the way back in 2018.  They doubled down on funding terror, nukes, and worshiping a rock for rain. permalink parent award report block reply Viewer01 1 points 4 days ago If only they had a compact source of energy to make such cheap and efficient. Like a nuclear- oh. permalink parent award report block reply\nDeplora OP 8 points 4 days ago Instead of building nuclear weapons that President Trump is just going to come along and blow up.  The amount of capital burned through by that decades-long project is staggering. permalink parent award report block reply Hikedelics 3 points 4 days ago I mean, they’re dumb, but also I sorta get it. If I had the means I’d probably have a nuke tucked in the corner of my closet. To be honest, I think most guys would. I don’t think any of us have a clue as to why we’d want it or what we’d do with it other than “have” it. permalink parent award report block reply carpetxparmesan 1 points 3 days ago To be honest, it's your CONSTITUTIONAL RIGHT to have a nuclear weapon and it's your duty under God to make it happen. permalink parent award report block reply\nHikedelics 3 points 4 days ago I mean, they’re dumb, but also I sorta get it. If I had the means I’d probably have a nuke tucked in the corner of my closet. To be honest, I think most guys would. I don’t think any of us have a clue as to why we’d want it or what we’d do with it other than “have” it. permalink parent award report block reply carpetxparmesan 1 points 3 days ago To be honest, it's your CONSTITUTIONAL RIGHT to have a nuclear weapon and it's your duty under God to make it happen. permalink parent award report block reply\ncarpetxparmesan 1 points 3 days ago To be honest, it's your CONSTITUTIONAL RIGHT to have a nuclear weapon and it's your duty under God to make it happen. permalink parent award report block reply\nLordKuroTheGreat 5 points 4 days ago To be fair, to do that efficiently you need nuclear power, and if they do that Israel will order America to burn $100 million+ in taxpayer dollars to bomb them. permalink parent award report block reply RedStoneDeepState 3 points 4 days ago Nuclear power is incredibly expensive permalink parent award report block reply\nRedStoneDeepState 3 points 4 days ago Nuclear power is incredibly expensive permalink parent award report block reply\nRedStoneDeepState 1 points 4 days ago Where are they going to get technical experts? The world leading technical experts in desalinization are all Israelis. permalink parent award report block reply DT170x 7 points 4 days ago American and the west got some desalination plants....oh wait they don't like them. Well they can get it from Temu(China) and hope it does not fail in a few years. permalink parent award report block reply RedStoneDeepState 1 points 4 days ago All the projects in California hire Israelis too. Besides that there really isn't much in the West. This is what AIPAC actually lobbies for - joint US Israeli programs. 80% of it is missile defense but desalinization is a large part of the other programs. China doesn't have shit for desalinization technology because their climate results in them not needing it. Most of their people live in what is naturally tropical rainforest. permalink parent award report block reply TenaciousDT 2 points 4 days ago LOL sure buddy permalink parent award report block reply NADSAQ 5 points 4 days ago maybe instead of professing to kill them all, they could try hiring them? permalink parent award report block reply RedStoneDeepState 3 points 4 days ago They would need regime change and they would rather people die than regime change. permalink parent award report block reply carpetxparmesan 2 points 3 days ago My guy, they know how to get water. 🤣🤣🤣 permalink parent award report block reply Tyndel 4 points 4 days ago Isreal offered to help them build them but iran refused all the way back in 2018.  They doubled down on funding terror, nukes, and worshiping a rock for rain. permalink parent award report block reply\nDT170x 7 points 4 days ago American and the west got some desalination plants....oh wait they don't like them. Well they can get it from Temu(China) and hope it does not fail in a few years. permalink parent award report block reply RedStoneDeepState 1 points 4 days ago All the projects in California hire Israelis too. Besides that there really isn't much in the West. This is what AIPAC actually lobbies for - joint US Israeli programs. 80% of it is missile defense but desalinization is a large part of the other programs. China doesn't have shit for desalinization technology because their climate results in them not needing it. Most of their people live in what is naturally tropical rainforest. permalink parent award report block reply TenaciousDT 2 points 4 days ago LOL sure buddy permalink parent award report block reply\nRedStoneDeepState 1 points 4 days ago All the projects in California hire Israelis too. Besides that there really isn't much in the West. This is what AIPAC actually lobbies for - joint US Israeli programs. 80% of it is missile defense but desalinization is a large part of the other programs. China doesn't have shit for desalinization technology because their climate results in them not needing it. Most of their people live in what is naturally tropical rainforest. permalink parent award report block reply TenaciousDT 2 points 4 days ago LOL sure buddy permalink parent award report block reply\nTenaciousDT 2 points 4 days ago LOL sure buddy permalink parent award report block reply\nNADSAQ 5 points 4 days ago maybe instead of professing to kill them all, they could try hiring them? permalink parent award report block reply RedStoneDeepState 3 points 4 days ago They would need regime change and they would rather people die than regime change. permalink parent award report block reply carpetxparmesan 2 points 3 days ago My guy, they know how to get water. 🤣🤣🤣 permalink parent award report block reply\nRedStoneDeepState 3 points 4 days ago They would need regime change and they would rather people die than regime change. permalink parent award report block reply\ncarpetxparmesan 2 points 3 days ago My guy, they know how to get water. 🤣🤣🤣 permalink parent award report block reply\nTyndel 4 points 4 days ago Isreal offered to help them build them but iran refused all the way back in 2018.  They doubled down on funding terror, nukes, and worshiping a rock for rain. permalink parent award report block reply\nViewer01 1 points 4 days ago If only they had a compact source of energy to make such cheap and efficient. Like a nuclear- oh. permalink parent award report block reply\nhenri_derelicte 18 points 4 days ago This is more devastating than any bomb dropped by the Israelis permalink award report block reply aaafirefly123 14 points 4 days ago Yep, turns out the biggest threat to Iran wasn’t Israel nor America. It was the Ayatollah’s own inept leadership. I don’t think the Ayatollah regime will last much longer. permalink parent award report block reply CanadianTrump2 8 points 4 days ago I feel like thats been said now for a decade+ permalink parent award report block reply iamherefortheluls 2 points 4 days ago which again shows that the best thing Trump could have done there is just left them the fuck alone. His air strikes on the country only bolstered the political influence of the regime who's now been justified in their claims that US and Israel are an imminent threat. permalink parent award report block reply Deplora OP 10 points 4 days ago Also more devastating than the bunkerbuster bombs dropped by the Americans. permalink parent award report block reply spez_this 9 points 4 days ago The bunkerbusters didn't destroy anything of benefit to the Iranian people. permalink parent award report block reply Deplora OP 6 points 4 days ago No, but the nuclear weapon-building facilities that the bunkerbusters destroyed had cost huge amounts of money for decades, and one way or another, all that capital was taken from the Iranian people. At least the bunkerbusters put a stop to the long-running capital-guzzling project. permalink parent award report block reply carpetxparmesan 1 points 3 days ago You shouldn't arrest fentanyl dealers. One way or another, you're taxing the crackhead population and, really, is that not too unkind? permalink parent award report block reply iamherefortheluls 1 points 4 days ago of course. If your country is short on water and your only option is to desalinate from the nearby sea, why would you want silly things like having nuclear power plants. Its not like desalination is one of the most energy demanding process on... oh wait, I was reading that the wrong way around. Well, its not like fresh water is important. I am sure they will just calmly accept that they are not allowed to have any because USA says so. permalink parent award report block reply spez_this 1 points 3 days ago They weren't nuclear power plants. They were uranium enrichment facilities. A nuclear power plant operates operates on 3-5% uranium. These facilities were being used to generate weapons-grade uranium - up to 90%. BTW, you don't hide nuclear power plants 80 m underground. permalink parent award report block reply friedchicken 0 points 4 days ago israel is a mistake permalink parent award report block reply\naaafirefly123 14 points 4 days ago Yep, turns out the biggest threat to Iran wasn’t Israel nor America. It was the Ayatollah’s own inept leadership. I don’t think the Ayatollah regime will last much longer. permalink parent award report block reply CanadianTrump2 8 points 4 days ago I feel like thats been said now for a decade+ permalink parent award report block reply iamherefortheluls 2 points 4 days ago which again shows that the best thing Trump could have done there is just left them the fuck alone. His air strikes on the country only bolstered the political influence of the regime who's now been justified in their claims that US and Israel are an imminent threat. permalink parent award report block reply\nCanadianTrump2 8 points 4 days ago I feel like thats been said now for a decade+ permalink parent award report block reply\niamherefortheluls 2 points 4 days ago which again shows that the best thing Trump could have done there is just left them the fuck alone. His air strikes on the country only bolstered the political influence of the regime who's now been justified in their claims that US and Israel are an imminent threat. permalink parent award report block reply\nDeplora OP 10 points 4 days ago Also more devastating than the bunkerbuster bombs dropped by the Americans. permalink parent award report block reply spez_this 9 points 4 days ago The bunkerbusters didn't destroy anything of benefit to the Iranian people. permalink parent award report block reply Deplora OP 6 points 4 days ago No, but the nuclear weapon-building facilities that the bunkerbusters destroyed had cost huge amounts of money for decades, and one way or another, all that capital was taken from the Iranian people. At least the bunkerbusters put a stop to the long-running capital-guzzling project. permalink parent award report block reply carpetxparmesan 1 points 3 days ago You shouldn't arrest fentanyl dealers. One way or another, you're taxing the crackhead population and, really, is that not too unkind? permalink parent award report block reply iamherefortheluls 1 points 4 days ago of course. If your country is short on water and your only option is to desalinate from the nearby sea, why would you want silly things like having nuclear power plants. Its not like desalination is one of the most energy demanding process on... oh wait, I was reading that the wrong way around. Well, its not like fresh water is important. I am sure they will just calmly accept that they are not allowed to have any because USA says so. permalink parent award report block reply spez_this 1 points 3 days ago They weren't nuclear power plants. They were uranium enrichment facilities. A nuclear power plant operates operates on 3-5% uranium. These facilities were being used to generate weapons-grade uranium - up to 90%. BTW, you don't hide nuclear power plants 80 m underground. permalink parent award report block reply\nspez_this 9 points 4 days ago The bunkerbusters didn't destroy anything of benefit to the Iranian people. permalink parent award report block reply Deplora OP 6 points 4 days ago No, but the nuclear weapon-building facilities that the bunkerbusters destroyed had cost huge amounts of money for decades, and one way or another, all that capital was taken from the Iranian people. At least the bunkerbusters put a stop to the long-running capital-guzzling project. permalink parent award report block reply carpetxparmesan 1 points 3 days ago You shouldn't arrest fentanyl dealers. One way or another, you're taxing the crackhead population and, really, is that not too unkind? permalink parent award report block reply iamherefortheluls 1 points 4 days ago of course. If your country is short on water and your only option is to desalinate from the nearby sea, why would you want silly things like having nuclear power plants. Its not like desalination is one of the most energy demanding process on... oh wait, I was reading that the wrong way around. Well, its not like fresh water is important. I am sure they will just calmly accept that they are not allowed to have any because USA says so. permalink parent award report block reply spez_this 1 points 3 days ago They weren't nuclear power plants. They were uranium enrichment facilities. A nuclear power plant operates operates on 3-5% uranium. These facilities were being used to generate weapons-grade uranium - up to 90%. BTW, you don't hide nuclear power plants 80 m underground. permalink parent award report block reply\nDeplora OP 6 points 4 days ago No, but the nuclear weapon-building facilities that the bunkerbusters destroyed had cost huge amounts of money for decades, and one way or another, all that capital was taken from the Iranian people. At least the bunkerbusters put a stop to the long-running capital-guzzling project. permalink parent award report block reply carpetxparmesan 1 points 3 days ago You shouldn't arrest fentanyl dealers. One way or another, you're taxing the crackhead population and, really, is that not too unkind? permalink parent award report block reply\ncarpetxparmesan 1 points 3 days ago You shouldn't arrest fentanyl dealers. One way or another, you're taxing the crackhead population and, really, is that not too unkind? permalink parent award report block reply\niamherefortheluls 1 points 4 days ago of course. If your country is short on water and your only option is to desalinate from the nearby sea, why would you want silly things like having nuclear power plants. Its not like desalination is one of the most energy demanding process on... oh wait, I was reading that the wrong way around. Well, its not like fresh water is important. I am sure they will just calmly accept that they are not allowed to have any because USA says so. permalink parent award report block reply spez_this 1 points 3 days ago They weren't nuclear power plants. They were uranium enrichment facilities. A nuclear power plant operates operates on 3-5% uranium. These facilities were being used to generate weapons-grade uranium - up to 90%. BTW, you don't hide nuclear power plants 80 m underground. permalink parent award report block reply\nspez_this 1 points 3 days ago They weren't nuclear power plants. They were uranium enrichment facilities. A nuclear power plant operates operates on 3-5% uranium. These facilities were being used to generate weapons-grade uranium - up to 90%. BTW, you don't hide nuclear power plants 80 m underground. permalink parent award report block reply\nfriedchicken 0 points 4 days ago israel is a mistake permalink parent award report block reply\nbtntx 11 points 4 days ago Quick! Send the democrats there! They know how to make the weather gooder! permalink award report block reply\nBruddahIz 7 points 4 days ago I wonder what the lowering of the Caspian Sea via diversion the last 20 years has affected thier wtern patterns? permalink award report block reply Tyndel 2 points 4 days ago The countries around but specifically to the east are diverting water from rivers and also doing cloud seeding.  There is not an unlimited amount of water in the air so when water is artificially removed the passing air starts to pull it out of the ground it is next passing through.  This is why countries down weather from large cloud seeding projects are seeing changes in rainfall and climate. permalink parent award report block reply\nTyndel 2 points 4 days ago The countries around but specifically to the east are diverting water from rivers and also doing cloud seeding.  There is not an unlimited amount of water in the air so when water is artificially removed the passing air starts to pull it out of the ground it is next passing through.  This is why countries down weather from large cloud seeding projects are seeing changes in rainfall and climate. permalink parent award report block reply\nNomad899 7 points 4 days ago Climate warming change permalink award report block reply\nLordKuroTheGreat 6 points 4 days ago 0 fucks to give unless they try to evacuate here, in which case fuck you and stay in your desert shithole. permalink award report block reply\nBldg_2019 6 points 4 days ago They can still hang faggots from cranes, right. No water needed. permalink award report block reply carpetxparmesan 1 points 3 days ago Environmentally conscious jihad. It's the only way. permalink parent award report block reply\ncarpetxparmesan 1 points 3 days ago Environmentally conscious jihad. It's the only way. permalink parent award report block reply\nrtav 5 points 4 days ago We're doing it with our weather control machines. permalink award report block reply Nigel_Planter 3 points 4 days ago Weather warfare permalink parent award report block reply\nNigel_Planter 3 points 4 days ago Weather warfare permalink parent award report block reply\ntralbolh 5 points 4 days ago Good thing they kicked out all those illegal immigrants earlier this year. We should do the same for our next drought. permalink award report block reply\nOvertaxed 5 points 4 days ago They better get to England, Ireland, Germany or France ASAP!  /s permalink award report block reply\nfriedchicken 5 points 4 days ago That sucks :( permalink award report block reply Deplora OP 5 points 4 days ago It does, because I'm sure that somehow the leaders of the regime will still get all the water they want.  It's the ordinary people who are screwed. permalink parent award report block reply\nDeplora OP 5 points 4 days ago It does, because I'm sure that somehow the leaders of the regime will still get all the water they want.  It's the ordinary people who are screwed. permalink parent award report block reply\nbillybaldwin2 5 points 4 days ago Clinton wishing her foundation to dump them all in Michigan again. permalink award report block reply\nlul_cheto 4 points 4 days ago Whats this have to do with murica? permalink award report block reply RedStoneDeepState 3 points 4 days ago Iran was a Soviet backed puppet who has backed repeated acts of terrorism against the USA. permalink parent award report block reply staroframphansbhole 5 points 4 days ago Did you get those talking points from your local synagogue? permalink parent award report block reply RedStoneDeepState -2 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply IForgotToAddAnEmail 2 points 3 days ago Hello Jew, along with that dues vult guy permalink parent award report block reply staroframphansbhole 1 points 2 days ago If I had a nickel for every time a Christ-denier tried to set up the false dialectic that anyone awake to their bullshit must be a follower of Muhammad the pedophile, I'd have enough to pay the interest you charge. permalink parent award report block reply view 1 more comments... lul_cheto -1 points 4 days ago lololololololol.. permalink parent award report block reply RedStoneDeepState 2 points 4 days ago So you are a retard, got it. permalink parent award report block reply lul_cheto -1 points 4 days ago im the retard? yet you wanna get re engaged in a pro azzreal middle east war and are still scured of a regime that fell almost 50 years ago.. lol ok gay permalink parent award report block reply view 7 more comments... ArchRespawnsAgain 0 points 4 days ago Many posters here are Israelis who want to drag the US into an Iranian regime change operation. permalink parent award report block reply\nRedStoneDeepState 3 points 4 days ago Iran was a Soviet backed puppet who has backed repeated acts of terrorism against the USA. permalink parent award report block reply staroframphansbhole 5 points 4 days ago Did you get those talking points from your local synagogue? permalink parent award report block reply RedStoneDeepState -2 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply IForgotToAddAnEmail 2 points 3 days ago Hello Jew, along with that dues vult guy permalink parent award report block reply staroframphansbhole 1 points 2 days ago If I had a nickel for every time a Christ-denier tried to set up the false dialectic that anyone awake to their bullshit must be a follower of Muhammad the pedophile, I'd have enough to pay the interest you charge. permalink parent award report block reply view 1 more comments... lul_cheto -1 points 4 days ago lololololololol.. permalink parent award report block reply RedStoneDeepState 2 points 4 days ago So you are a retard, got it. permalink parent award report block reply lul_cheto -1 points 4 days ago im the retard? yet you wanna get re engaged in a pro azzreal middle east war and are still scured of a regime that fell almost 50 years ago.. lol ok gay permalink parent award report block reply view 7 more comments...\nstaroframphansbhole 5 points 4 days ago Did you get those talking points from your local synagogue? permalink parent award report block reply RedStoneDeepState -2 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply IForgotToAddAnEmail 2 points 3 days ago Hello Jew, along with that dues vult guy permalink parent award report block reply staroframphansbhole 1 points 2 days ago If I had a nickel for every time a Christ-denier tried to set up the false dialectic that anyone awake to their bullshit must be a follower of Muhammad the pedophile, I'd have enough to pay the interest you charge. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState -2 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply IForgotToAddAnEmail 2 points 3 days ago Hello Jew, along with that dues vult guy permalink parent award report block reply staroframphansbhole 1 points 2 days ago If I had a nickel for every time a Christ-denier tried to set up the false dialectic that anyone awake to their bullshit must be a follower of Muhammad the pedophile, I'd have enough to pay the interest you charge. permalink parent award report block reply view 1 more comments...\nIForgotToAddAnEmail 2 points 3 days ago Hello Jew, along with that dues vult guy permalink parent award report block reply\nstaroframphansbhole 1 points 2 days ago If I had a nickel for every time a Christ-denier tried to set up the false dialectic that anyone awake to their bullshit must be a follower of Muhammad the pedophile, I'd have enough to pay the interest you charge. permalink parent award report block reply view 1 more comments...\nlul_cheto -1 points 4 days ago lololololololol.. permalink parent award report block reply RedStoneDeepState 2 points 4 days ago So you are a retard, got it. permalink parent award report block reply lul_cheto -1 points 4 days ago im the retard? yet you wanna get re engaged in a pro azzreal middle east war and are still scured of a regime that fell almost 50 years ago.. lol ok gay permalink parent award report block reply view 7 more comments...\nRedStoneDeepState 2 points 4 days ago So you are a retard, got it. permalink parent award report block reply lul_cheto -1 points 4 days ago im the retard? yet you wanna get re engaged in a pro azzreal middle east war and are still scured of a regime that fell almost 50 years ago.. lol ok gay permalink parent award report block reply view 7 more comments...\nlul_cheto -1 points 4 days ago im the retard? yet you wanna get re engaged in a pro azzreal middle east war and are still scured of a regime that fell almost 50 years ago.. lol ok gay permalink parent award report block reply view 7 more comments...\nArchRespawnsAgain 0 points 4 days ago Many posters here are Israelis who want to drag the US into an Iranian regime change operation. permalink parent award report block reply\nlul_cheto 4 points 4 days ago Whats this got to do with murica? permalink award report block reply staroframphansbhole 2 points 4 days ago Nothing, just more MIGA poison that Christ-denying faggots like u/DeusVult1096 u/DT170x u/henri_derelicte can inject into MAGA and beat off to when they’re not bloodying mattresses in tunnels under NYC permalink parent award report block reply IForgotToAddAnEmail 2 points 3 days ago Add RedStoneDeepstate to that permalink parent award report block reply\nstaroframphansbhole 2 points 4 days ago Nothing, just more MIGA poison that Christ-denying faggots like u/DeusVult1096 u/DT170x u/henri_derelicte can inject into MAGA and beat off to when they’re not bloodying mattresses in tunnels under NYC permalink parent award report block reply IForgotToAddAnEmail 2 points 3 days ago Add RedStoneDeepstate to that permalink parent award report block reply\nIForgotToAddAnEmail 2 points 3 days ago Add RedStoneDeepstate to that permalink parent award report block reply\nnemonster 3 points 4 days ago Call allah. Not my fucking problem permalink award report block reply\nFusionBlack 3 points 4 days ago What a shame. permalink award report block reply\nDingleBalls 2 points 4 days ago A DROUGHT. In a DESERT. 🤔 permalink award report block reply carpetxparmesan 2 points 3 days ago I feel like I read about the hanging gardens of babylon in some book somewhere. Some even speculate they may have used archimedan screws for local pumping, though the engineering feat of supplying the water alone would be impressive on its own. Iran is just having a real life ancient aliens episode right now. \"But how habibi? How does watere move, inchallah? What does this proverb mean that mohammed must come to the mountain?\" permalink parent award report block reply\ncarpetxparmesan 2 points 3 days ago I feel like I read about the hanging gardens of babylon in some book somewhere. Some even speculate they may have used archimedan screws for local pumping, though the engineering feat of supplying the water alone would be impressive on its own. Iran is just having a real life ancient aliens episode right now. \"But how habibi? How does watere move, inchallah? What does this proverb mean that mohammed must come to the mountain?\" permalink parent award report block reply\nRango 2 points 4 days ago Better send more Billion$ to Ukraine. permalink award report block reply\ncarpetxparmesan 2 points 3 days ago \"The oldest known aqueduct is the Jerwan Aqueduct, constructed between 703 and 690 BC by Sanherib (Sennecherib) of Assyria in what is now Iraqi Kurdistan.\" - AI slop Imagine being a sand negro in 700 before some jew gets nailed to a cross by one of the white swamp creatures living way out in the uncivilized boonies, inventing moving water from a mountain top to your capital 100km away ordering some sand negro engineering genius to carve rock out 3cm per 100m using bronze and iron age tools and then looking at these faggots in 2025 running out of water. I shit you not, you would make a new epic saga about decapitating every single one of them and order your feat immortalized in stone. permalink award report block reply\nSorosHasBallsackEyes 2 points 4 days ago Is this why it fucking rained in Biblical fashion for months here in Florida?\nSeriously. I am certain that weather modification experiments were to blame, but I initially thought it related to hurricane mitigation. Toppling Iran due to drought was not on my radar. permalink award report block reply\nSecondrun007 2 points 4 days ago Israel can make water.  Maybe if they beg? permalink award report block reply\nBlueKentuckyGirl 2 points 4 days ago God has his exquisite ways. That’s why one needs to be patient. His will be done. To him is the glory and power.\nMan can seek revenge, but it is nothing compared to the exquisite retribution that the almighty comes up with! Beautiful 🔥🔥🔥 permalink award report block reply guywholikesDjtof2024 10 points 4 days ago His* Him* the Almighty* permalink parent award report block reply BlueKentuckyGirl 5 points 4 days ago 🍻 permalink parent award report block reply fightfightfightx 2 points 4 days ago huh? meanwhile EU and US are being destroyed too or is that also \"God's plan\"???? permalink parent award report block reply\nguywholikesDjtof2024 10 points 4 days ago His* Him* the Almighty* permalink parent award report block reply BlueKentuckyGirl 5 points 4 days ago 🍻 permalink parent award report block reply\nBlueKentuckyGirl 5 points 4 days ago 🍻 permalink parent award report block reply\nfightfightfightx 2 points 4 days ago huh? meanwhile EU and US are being destroyed too or is that also \"God's plan\"???? permalink parent award report block reply\npatrioticwinning3 2 points 4 days ago That saddens me...no intervention! permalink award report block reply carpetxparmesan 1 points 3 days ago thisguyforcongress2028.jpg permalink parent award report block reply\ncarpetxparmesan 1 points 3 days ago thisguyforcongress2028.jpg permalink parent award report block reply\npossibletower 2 points 4 days ago FAFO, Iran. Don't pick a fight and fight a war that doesn't even involve you in Syria and Lebanon and Gaza unless you want to find out. permalink award report block reply fightfightfightx 2 points 4 days ago they've been under constant siege of Israeli aggression for a while. The whole region is over 2000 years of racist blood wars between jewish supremacists and muzzies permalink parent award report block reply RedStoneDeepState -2 points 4 days ago Bullshit, Iran was a Soviet backed puppet and that is the source of current issues, not Israel. permalink parent award report block reply staroframphansbhole 0 points 4 days ago Pissfake’s existence is the source of current issues my Christ-killer cock-licker permalink parent award report block reply RedStoneDeepState -3 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply IncredibleMrE1 1 points 4 days ago Kek permalink parent award report block reply ParmesanCartel -3 points 4 days ago This is rich permalink parent award report block reply\nfightfightfightx 2 points 4 days ago they've been under constant siege of Israeli aggression for a while. The whole region is over 2000 years of racist blood wars between jewish supremacists and muzzies permalink parent award report block reply RedStoneDeepState -2 points 4 days ago Bullshit, Iran was a Soviet backed puppet and that is the source of current issues, not Israel. permalink parent award report block reply staroframphansbhole 0 points 4 days ago Pissfake’s existence is the source of current issues my Christ-killer cock-licker permalink parent award report block reply RedStoneDeepState -3 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply\nRedStoneDeepState -2 points 4 days ago Bullshit, Iran was a Soviet backed puppet and that is the source of current issues, not Israel. permalink parent award report block reply staroframphansbhole 0 points 4 days ago Pissfake’s existence is the source of current issues my Christ-killer cock-licker permalink parent award report block reply RedStoneDeepState -3 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply\nstaroframphansbhole 0 points 4 days ago Pissfake’s existence is the source of current issues my Christ-killer cock-licker permalink parent award report block reply RedStoneDeepState -3 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply\nRedStoneDeepState -3 points 4 days ago You are a Pakistani larping as an American. permalink parent award report block reply\nIncredibleMrE1 1 points 4 days ago Kek permalink parent award report block reply\nParmesanCartel -3 points 4 days ago This is rich permalink parent award report block reply\ngaijin_ronin 2 points 4 days ago Oh no, anyways I had great day out with my son. We got treated to an early dinner because of his demonstration team's performance.  Then we went to the hardware store and bought a new oscillating tool so I can fix a door frame and work on some tile. Also Iran is a sandpit to begin with.  There is no loss. permalink award report block reply\nmalooch 1 points 4 days ago oh no permalink award report block reply\nHandshake_Shmanshake 1 points 4 days ago Sounds like hell. permalink award report block reply Deplora OP 1 points 4 days ago Indeed.  And Iran was already pretty close to hell when running water was readily available. permalink parent award report block reply\nDeplora OP 1 points 4 days ago Indeed.  And Iran was already pretty close to hell when running water was readily available. permalink parent award report block reply\nIronPatriot1 1 points 4 days ago Oh no....anyways. permalink award report block reply\nbarwhack 1 points 4 days ago Allah loves you, O Mohammed. permalink award report block reply\nYaharaRiver 1 points 4 days ago lol Gonna have to use goat piss in your WUDUs 😂 permalink award report block reply\nDrVSGGEOTUSPhD 1 points 4 days ago Weather weapons?? permalink award report block reply carpetxparmesan 1 points 3 days ago It's called weather. This is just jihadi communists squeezing their tax base for shekels. They have all the guns and all the desire and means to kill. So the ones who don't... eat shit and die. A story as old as the desert itself. permalink parent award report block reply\ncarpetxparmesan 1 points 3 days ago It's called weather. This is just jihadi communists squeezing their tax base for shekels. They have all the guns and all the desire and means to kill. So the ones who don't... eat shit and die. A story as old as the desert itself. permalink parent award report block reply\nJustInTime2_ 1 points 4 days ago Not US concerns. permalink award report block reply\nDrVSGGEOTUSPhD 1 points 4 days ago QUICK SEND THEM MORE PALLETS OF CASH!!! permalink award report block reply\nQuiznos585 1 points 4 days ago Not. Our. Problem. permalink award report block reply Deplora OP 1 points 4 days ago At least not until they start fleeing in droves, and Mamdani rolls out the welcome mat for them in NYC . . . permalink parent award report block reply\nDeplora OP 1 points 4 days ago At least not until they start fleeing in droves, and Mamdani rolls out the welcome mat for them in NYC . . . permalink parent award report block reply\nDatamancer 1 points 4 days ago Less time fuckin goats and building nukes and more time taking care of your citizens. permalink award report block reply\nJoeBidensDementia1 1 points 4 days ago Oh. Darn. permalink award report block reply\nrootGoose 1 points 4 days ago God is withholding the rain. permalink award report block reply\nalucard13mmfmj 1 points 4 days ago Its alright. Theyll be another source of rapfugees.... permalink award report block reply\nkeeman 1 points 4 days ago I thought this was a Make America Great forum.  Why are we spending time on this shit? permalink award report block reply\nHikedelics 1 points 4 days ago Let them go rebuild Gaza. Without our involvement. At all. permalink award report block reply\nnemonster 1 points 4 days ago More refugies. Welcome to NYC permalink award report block reply\nMocksFordComma 1 points 4 days ago I don’t care. Leave us out of it. permalink award report block reply\nHowLongIsNever 1 points 4 days ago I thought climate change was supposed to be a bad thing lmao permalink award report block reply\nMajorClark 1 points 4 days ago And  how much US tax payer money does congress want to give them?    Better be none! permalink award report block reply Deplora OP 2 points 4 days ago We delivered those nifty bunkerbuster bombs, which were certainly welcomed by the Iranian people, and cost us a tidy sum.  Money well spent, in my opinion.  But I feel like they need to deal with their own water problems.  Or ask their neighbors for help. permalink parent award report block reply\nDeplora OP 2 points 4 days ago We delivered those nifty bunkerbuster bombs, which were certainly welcomed by the Iranian people, and cost us a tidy sum.  Money well spent, in my opinion.  But I feel like they need to deal with their own water problems.  Or ask their neighbors for help. permalink parent award report block reply\nfunwithguitars 1 points 4 days ago We now know , we will never have go to war with Iran, we only have to  cut off the water supply permalink award report block reply\nVorticity1 0 points 4 days ago So climate change is real? permalink award report block reply\nokboomer59 0 points 4 days ago Proof Joooz control the weather permalink award report block reply\nciaramella_is_gay -1 points 4 days ago Just nuke the jews and take their water. permalink award report block reply MemeWarsVet 8 points 4 days ago Delicious nuclear water. permalink parent award report block reply RedStoneDeepState 4 points 4 days ago Delicious nuclear salt water pumped though Syria and Iraq. Israel needs desalinization tech for their water. permalink parent award report block reply nemonster 3 points 4 days ago Call india permalink parent award report block reply possibletower 3 points 4 days ago Iran can't do that because they have a shittyass military. They were unable to kill a single Israeli soldier or airman other than one off-duty IDF soldier killed in a missile strike by Iran on Israel while the entire Iranian military's hierarchy's generals were BBQ-ed by the Israelis 🤣 It was hilarious seeing all the Iran-cocksucking faggots here chimp out and REEEE, screaming \"UNFAIR ADVANTAGE\", everytime their generals were getting vaporized while they couldn't shoot down a single Israeli jet or stop a single Israeli missile. Iran's cocksuckers, especially here, were hyping them up as some powerful military for decades too. permalink parent award report block reply henri_derelicte 5 points 4 days ago Iran got their shit kicked in by Israel. The war may have ended in a “ceasefire,” but it was a decisive Israeli victory permalink parent award report block reply aaafirefly123 6 points 4 days ago It proved rather definitively that the Iranian government is completely powerless to stop Israel. permalink parent award report block reply henri_derelicte 4 points 4 days ago I wish Israel eliminated the ayatollah and “civilian” leadership of Iran just to show they could. permalink parent award report block reply fightfightfightx 0 points 4 days ago using American weapons and American taxdollars lets pull out and see how Israel handles the region... permalink parent award report block reply RedStoneDeepState 2 points 4 days ago Why? Iran was a Soviet backed puppet that claims legitimacy by being opposition to the USA. permalink parent award report block reply fightfightfightx 1 points 4 days ago demonic jewish supremacist warmongering is not something I care about if all the anti-bacon ideologies sunk into the ocean out planet would be better off permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Iran was a Soviet backed puppet and that is the source of current issues, not Israel. permalink parent award report block reply\nMemeWarsVet 8 points 4 days ago Delicious nuclear water. permalink parent award report block reply RedStoneDeepState 4 points 4 days ago Delicious nuclear salt water pumped though Syria and Iraq. Israel needs desalinization tech for their water. permalink parent award report block reply nemonster 3 points 4 days ago Call india permalink parent award report block reply\nRedStoneDeepState 4 points 4 days ago Delicious nuclear salt water pumped though Syria and Iraq. Israel needs desalinization tech for their water. permalink parent award report block reply nemonster 3 points 4 days ago Call india permalink parent award report block reply\nnemonster 3 points 4 days ago Call india permalink parent award report block reply\npossibletower 3 points 4 days ago Iran can't do that because they have a shittyass military. They were unable to kill a single Israeli soldier or airman other than one off-duty IDF soldier killed in a missile strike by Iran on Israel while the entire Iranian military's hierarchy's generals were BBQ-ed by the Israelis 🤣 It was hilarious seeing all the Iran-cocksucking faggots here chimp out and REEEE, screaming \"UNFAIR ADVANTAGE\", everytime their generals were getting vaporized while they couldn't shoot down a single Israeli jet or stop a single Israeli missile. Iran's cocksuckers, especially here, were hyping them up as some powerful military for decades too. permalink parent award report block reply henri_derelicte 5 points 4 days ago Iran got their shit kicked in by Israel. The war may have ended in a “ceasefire,” but it was a decisive Israeli victory permalink parent award report block reply aaafirefly123 6 points 4 days ago It proved rather definitively that the Iranian government is completely powerless to stop Israel. permalink parent award report block reply henri_derelicte 4 points 4 days ago I wish Israel eliminated the ayatollah and “civilian” leadership of Iran just to show they could. permalink parent award report block reply fightfightfightx 0 points 4 days ago using American weapons and American taxdollars lets pull out and see how Israel handles the region... permalink parent award report block reply RedStoneDeepState 2 points 4 days ago Why? Iran was a Soviet backed puppet that claims legitimacy by being opposition to the USA. permalink parent award report block reply fightfightfightx 1 points 4 days ago demonic jewish supremacist warmongering is not something I care about if all the anti-bacon ideologies sunk into the ocean out planet would be better off permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Iran was a Soviet backed puppet and that is the source of current issues, not Israel. permalink parent award report block reply\nhenri_derelicte 5 points 4 days ago Iran got their shit kicked in by Israel. The war may have ended in a “ceasefire,” but it was a decisive Israeli victory permalink parent award report block reply aaafirefly123 6 points 4 days ago It proved rather definitively that the Iranian government is completely powerless to stop Israel. permalink parent award report block reply henri_derelicte 4 points 4 days ago I wish Israel eliminated the ayatollah and “civilian” leadership of Iran just to show they could. permalink parent award report block reply fightfightfightx 0 points 4 days ago using American weapons and American taxdollars lets pull out and see how Israel handles the region... permalink parent award report block reply RedStoneDeepState 2 points 4 days ago Why? Iran was a Soviet backed puppet that claims legitimacy by being opposition to the USA. permalink parent award report block reply\naaafirefly123 6 points 4 days ago It proved rather definitively that the Iranian government is completely powerless to stop Israel. permalink parent award report block reply henri_derelicte 4 points 4 days ago I wish Israel eliminated the ayatollah and “civilian” leadership of Iran just to show they could. permalink parent award report block reply\nhenri_derelicte 4 points 4 days ago I wish Israel eliminated the ayatollah and “civilian” leadership of Iran just to show they could. permalink parent award report block reply\nfightfightfightx 0 points 4 days ago using American weapons and American taxdollars lets pull out and see how Israel handles the region... permalink parent award report block reply RedStoneDeepState 2 points 4 days ago Why? Iran was a Soviet backed puppet that claims legitimacy by being opposition to the USA. permalink parent award report block reply\nRedStoneDeepState 2 points 4 days ago Why? Iran was a Soviet backed puppet that claims legitimacy by being opposition to the USA. permalink parent award report block reply\nfightfightfightx 1 points 4 days ago demonic jewish supremacist warmongering is not something I care about if all the anti-bacon ideologies sunk into the ocean out planet would be better off permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Iran was a Soviet backed puppet and that is the source of current issues, not Israel. permalink parent award report block reply\nRedStoneDeepState 1 points 4 days ago Iran was a Soviet backed puppet and that is the source of current issues, not Israel. permalink parent award report block reply\nTheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T22:57:14.295522Z"
}