{
  "id": "1ARK5BHy9C",
  "url": "https://patriots.win/p/1ARK5BHy9C/ron-desantis\n\nit-opened-my-eyes-/c",
  "content": "282 Ron DeSantis\n:\nIt opened my eyes as well especially because what Disney did was legal; that is, US law allowed firing Americans and then having the Americans train their foreign-worker replacements.  Bad policy. MEATBALL posted 3 days ago by PiratePatriotParrot 5 comments award share report block Ron DeSantis @RonDeSantis • 3d It opened my eyes as well especially because what Disney did was legal; that is, US law allowed firing Americans and then having the Americans train their foreign-worker replacements.  Bad policy. CommanderGub @CommanderGub • 3d @RonDeSantis Disney firing all of their IT was the thing that opened my eyes to the absolute treachery of H1B abuse and offshoring. Never forget that betrayal and keep fighting for American workers @RonDeSantis ! Thank you!!!\n5 comments Sort by Top Top New Worst Old Save Th3Cho0sing0ne 11 points 3 days ago Meatball and team have done a fantastic job of damage control since 2023.  Seriously.  He's been pretty solid since. Respect, where it's due. permalink award report block reply sixfingerdildo 5 points 3 days ago the story of his 2024 campaign will be interesting. his retard wife seems to have been muzzled too. permalink parent award report block reply peterthegreen 2 points 2 days ago Ah, memories... https://rumble.com/v31i0ko-he-was-a-meatball.html permalink parent award report block reply Obambi 1 points 3 days ago Big Boots Ron bangs his wife with dem 8 inch heels. Not mad at you brah. permalink award report block reply God-is-good 1 points 2 days ago When did this happen at Disney, curious what movies it effected? permalink award report block reply\nTh3Cho0sing0ne 11 points 3 days ago Meatball and team have done a fantastic job of damage control since 2023.  Seriously.  He's been pretty solid since. Respect, where it's due. permalink award report block reply sixfingerdildo 5 points 3 days ago the story of his 2024 campaign will be interesting. his retard wife seems to have been muzzled too. permalink parent award report block reply peterthegreen 2 points 2 days ago Ah, memories... https://rumble.com/v31i0ko-he-was-a-meatball.html permalink parent award report block reply\nsixfingerdildo 5 points 3 days ago the story of his 2024 campaign will be interesting. his retard wife seems to have been muzzled too. permalink parent award report block reply peterthegreen 2 points 2 days ago Ah, memories... https://rumble.com/v31i0ko-he-was-a-meatball.html permalink parent award report block reply\npeterthegreen 2 points 2 days ago Ah, memories... https://rumble.com/v31i0ko-he-was-a-meatball.html permalink parent award report block reply\nObambi 1 points 3 days ago Big Boots Ron bangs his wife with dem 8 inch heels. Not mad at you brah. permalink award report block reply\nGod-is-good 1 points 2 days ago When did this happen at Disney, curious what movies it effected? permalink award report block reply",
  "fetched_at": "2025-11-12T23:11:59.240685Z"
}