{
  "id": "8174284",
  "title": "1356Developer: Florida Real Estate Surges as New Yorkers ‘Nervous’ About Socialist Zohran Mamdani(ww",
  "url": "https://patriots.win/p/1ARK55acVA/developer-florida-real-estate-su/c",
  "content": "1356 Developer: Florida Real Estate Surges as New Yorkers ‘Nervous’ About Socialist Zohran Mamdani (www.breitbart.com) posted 5 days ago by Toobigtorig1234 197 comments award share report block Florida Real Estate Surges as New Yorkers 'Nervous' About Socialist Mamdani Florida's real estate business is booming with New Yorkers looking to relocate as the politics in the city appear to be taking a left turn. www.breitbart.com\n197 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Aquamine-Amarine 133 points 5 days ago Great, make it even harder for us young conservatives to buy a house. Fuck commies. permalink award report block reply Viewer01 61 points 5 days ago It is the most criminal thing. Faggots in Cali and nyc purposely cause massive inflation in their states. Then these fucks sell their inflated assets and go to more fiscally responsible states and inflate shit there too. All because we are captured by usurers who swapped us off the gold standard and onto fiat. permalink parent award report block reply Easzq8 2 points 5 days ago Do you suggest a ban on buying houses for investment purposes? That would be a fairly overreaching legislation, would it not? permalink parent award report block reply StruggleSession 8 points 5 days ago A progressive property tax that makes home owners pay little or nothing for their first primary residence and then increases exponentially for each new house would discourage hoarding. Another option is just deporting immigrants to increase the supply of houses or ban foreigners from owning or purchasing US property. Anything is better than making it impossible for Americans to buy homes and raise families. permalink parent award report block reply Aambrick 2 points 5 days ago I would say do all of that with the last one having monthly inspections if allowed. permalink parent award report block reply UpvoteBot 2 points 4 days ago This is exactly the solution. Particularly the deportation of ALL illegals and the majority of Visa holders. You can directly track the increase in real estate pricing to the increase in illegal immigration. All these brown folks have to live someplace. The same fact holds true with the price of groceries, healthcare, welfare spending, literally everything. The one thing that does not increase with the number of illegals entering the country, is prosperity and wealth. Deporting all illegals remains the number one most important thing that can be done to increase the quality of life for American citizens. permalink parent award report block reply view 1 more comments... Viewer01 6 points 5 days ago Institutional ownership by any business or fund of single family or condo type units? Yes. permalink parent award report block reply Mandroid901 1 points 5 days ago You do realize Trump is from NYC and moved to Florida permalink parent award report block reply NADSAQ 5 points 5 days ago after he was President, and he has had business interests and a residence in FL for decades permalink parent award report block reply permissible_missile 5 points 5 days ago He made it harder for some young conservative to buy Mar A Lago. Downright criminal if you ask me! permalink parent award report block reply MastaJoda 1 points 5 days ago What a stupid, irrelevant comment. permalink parent award report block reply ShitFromShinola -6 points 5 days ago How is it that people In a particular state cause inflation in their that state? Inflation is always too much money chasing too little a supply. It's kind of baked in to wherever you live. In NYC, there is almost no land available of new housing, so the price goes up. Due to the increases in prices, companies have to pay more for the best people so salaries go up. So it seems that this is mostly a function of land scarcity in mature markets. And you have the opposite going on in shitholes like West Virginia where housing is really cheap. But decent jobs are hard to come by and culturally, it's a fucking dump. And there is not exactly a rush of people moving to WV-  and there is a reason for that. permalink parent award report block reply EdgyUsernamexX69Xx 7 points 5 days ago The way markets actually work is not found in an economics textbook. permalink parent award report block reply ShitFromShinola -5 points 5 days ago Is that so, Professor. Please tell us how things really work. permalink parent award report block reply view 3 more comments... ShadowInv 3 points 5 days ago Equity locusts permalink parent award report block reply ShitFromShinola 1 points 5 days ago What's the solution, shit stain? permalink parent award report block reply 420praiseit894 2 points 5 days ago People with a lot of money from NYC flee to states with cheaper living, driving demand in those areas up past reasonable price levels for natives. Government policy also affects inflation. Hence, voting for leftist shit drives up cost of living in their own state, and then they flee like parasites to better states, which drives up costs there as well. Housing market costs are heavily influenced by expatriates from more expensive areas being willing to pay a lot more. permalink parent award report block reply ShitFromShinola -1 points 5 days ago So stop sniveling and move to West Virginia, then. Then those hillbillies will blame you for driving up the cost of a single wide trailer in Morgantown. See how this works? permalink parent award report block reply TrumpsBigBalls 1 points 5 days ago not sure why the downvotes as your statement is accurate. permalink parent award report block reply ShitFromShinola 1 points 5 days ago People need a scapegoat- someone to blame for their misfortune. Houses cost more in desirable places and less in shitholes. That's the way the world works. In markets where real estate is higher- so are salaries for most professions. A lot of it is that they resent the fact that Blue cities are so much more desirable (including better jobs)  due to the many things they offer above and beyond what is available in small town or rural America. But that is literally the way it is any you'd go in the entire world. permalink parent award report block reply AlmostFullyDilated -10 points 5 days ago lol what? as a American I can buy land wherever the fuck I want . I'll buy your childhood home and burn it too the ground permalink parent award report block reply Viewer01 4 points 5 days ago A fool and his money are soon parted so this checks out. permalink parent award report block reply AlmostFullyDilated -4 points 5 days ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments... PapaPepe 22 points 5 days ago The average age of a first time homebuyer just reached 40. permalink parent award report block reply Parhelion12 13 points 5 days ago That's a crisis permalink parent award report block reply PapaPepe 9 points 5 days ago Boomers are basically the ones buying and selling like 60% of homes. They will hold on to their investment till they die. permalink parent award report block reply Husky 7 points 5 days ago Boomers are the only ones that have been buying houses for 30 years permalink parent award report block reply view 2 more comments... MastaJoda 1 points 5 days ago lol mature folks holding onto their greatest asset??? OMG THOSE MONSTERS!!! Fucking idiot, thats called being smart! They arent the dumb fuck young gens that need new shiney objects every year to feel special. How ignorant are you? permalink parent award report block reply KernalMustard 3 points 5 days ago Sure is. I was 24. Paid off at 36 permalink parent award report block reply barryb0nds 1 points 5 days ago Wow congrats! May I ask how much you paid, what interest rate you got, and what kind of overpayments you were making? permalink parent award report block reply goldwater4ever 2 points 5 days ago don't worry, comrade! We will own nothing and be happy soon enough.. permalink parent award report block reply 420praiseit894 3 points 5 days ago There's an even more damning statistic. The average home buyer age, not first time, overall, has been staying at the exact same birth year - e.g going up by 1 every year, for about 20 years. The same age group is buying most of the houses for 20 fucking years. permalink parent award report block reply PapaPepe 2 points 5 days ago Boomers just tell everyone to pull themselves up by their bootstraps permalink parent award report block reply bejeavis 2 points 5 days ago Or they just down vote because truth hurts permalink parent award report block reply Bunny 1 points 5 days ago We're always welcoming conservatives in Alabama.. 😁 permalink parent award report block reply pnwpatriot97 1 points 5 days ago Yep. Now New York will become the East Coast California 2.0 and their wealthiest people will flock to other states and drive the prices up even more! Fucking fantastic shit huh? permalink parent award report block reply MastaJoda 1 points 5 days ago 😂🤣😂FL about to go purple again permalink parent award report block reply load 42 more comments... jdovejr 44 points 5 days ago Great. Those idiots elect a commie and my prices go up. permalink award report block reply Govtizbad 44 points 5 days ago And then they will come to your state and elect another commie It's like a virus. It spreads from host to host edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply realPhantomFuck 16 points 5 days ago My state has been the largest recipient of California Locusts. Can confirm--hell follows with them permalink parent award report block reply LaVaughnRobinson 12 points 5 days ago Dont you love how they move and then bitch about where they moved too how its not like where they moved from.  Then vote how they did back at the shithole they came from to fuck the new home up.  Commies, all of them. permalink parent award report block reply Shitsbrokeyo 4 points 5 days ago We get mainly NY, OH, FL here in TN. Come red or stay out. permalink parent award report block reply view 3 more comments... Nibba2 2 points 5 days ago That’s the entire point. Just like California. permalink parent award report block reply MediaBro 2 points 5 days ago Sounds like Muslims. permalink parent award report block reply TheRPatriot 2 points 5 days ago Florida has only gotten more red post exodus’…. permalink parent award report block reply snoopy3210 1 points 5 days ago Powell Jobs is such a parasite permalink parent award report block reply load 2 more comments... DeplorachuIChooseYou 29 points 5 days ago Great. More liberals in Florida just what the state needs permalink award report block reply MisterMAGA 27 points 5 days ago “Yay our blue guy won, let’s move to a really red area honey!” nobody, ever permalink parent award report block reply Bushwookiee07 20 points 5 days ago It’s the ones that voted for the other blue guy. They move to Montana too. They’ve been shitting up our state since 2020. permalink parent award report block reply RememberCharlieKirk 4 points 5 days ago Shades of blue: These potential movers could think of themselves as left-center, whatever that label means anymore. They could be supporters of Andrew \"how am I not in prison after purposefully leading NY grandparents to their deaths?\" Cuomo. Perhaps, even they think handing NYC to an unemployable, Karl Marx quoting, economically illiterate bum is a recipe for disaster. permalink parent award report block reply guywholikesDjtof2024 2 points 5 days ago Your name is MEGA BASED!!!! Stick around! Is Jesus God? permalink parent award report block reply RememberCharlieKirk 1 points 4 days ago Thank you. Yes. Originally, I thought that you were being facetious; I read your comment as mockery, as opposed to sincere. However, your second, most latest comment has proved otherwise. permalink parent award report block reply view 3 more comments... MisterMAGA 1 points 5 days ago Or it’s the conservatives. There are millions there you know. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply Nibba2 3 points 5 days ago You must be unfamiliar with California, rabbi. permalink parent award report block reply MisterMAGA 1 points 5 days ago Yep. I’m only familiar with Texas where I live, and the vast majority of people I know who lived here from CA or NY in last 5nywars have been conservatives. permalink parent award report block reply snoopy3210 4 points 5 days ago No the republicans in NY were the first to go to florida, and now the independents and the former democrats registered Republicans. Not bad. permalink parent award report block reply DeplorachuIChooseYou 4 points 5 days ago I just don't see it. especially when you look at CO, NM, NJ, and WA. Even if that is true, It's a ripple effect. those locusts will destroy that state so far that even the socialites will flee. Look at areas in Texas now. Look at Montana apparently becoming a hotspot for Californians, and what Idaho could become. permalink parent award report block reply BidensBodyDouble 2 points 5 days ago The state keeps getting more red. My county was reliably blue. Same with the neighboring. Both are purple now and lean red. There's some shitty local politics where dems win but that's more a result of Rs not getting involved in local politics. The fucking fear mongering is insane. As someone who's been here 15 years I've watched it turn. permalink parent award report block reply SarsourCuntReturns 1 points 5 days ago Can confirm about NM. A lot of people who moved from CA to NM stayed voting blue because they're retarded. permalink parent award report block reply Govtizbad 4 points 5 days ago Build the Florida wall edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply KernalMustard 2 points 5 days ago Hi Ballots. permalink parent award report block reply The_Emperor 1 points 5 days ago Not liberals.  Outnumbered normal people permalink parent award report block reply GainesvilleFlorida 1 points 5 days ago They think they are conservative but then they’ll want gun laws and believe trans are legit. permalink parent award report block reply RedFoxOnFire 20 points 5 days ago Don't New York my Florida. permalink award report block reply MAGAPlenty 3 points 5 days ago Maybe our open carry laws will scare them off permalink parent award report block reply StCharlie 2 points 5 days ago Continue to convert them.  They must be willing to accept that selfishness is ok, individualism is ok, financial savers will progress into financial freedom, build as many skillsets as you can, then save the world.  Your money is no one elses but your own, unless you choose to give it freely and it should be to someone deserving.  The money and property of others is not yours to give away. permalink parent award report block reply Paydro 0 points 5 days ago Dont worry, the faggots who leave NY cause of politics arent coming to FL to vote blue. We're in a suburb of Orlando and I'd say 90% of our neighbors are Christian and Republican. Every teacher our kids have had in public school so far (4  kids) has been a Christian and regular church goer. This is America permalink parent award report block reply blueeyephoto 15 points 5 days ago we already have limited housing and skyhigh rents... NYC people need to STAY in NYC and not come here bringing their liberal voting with them permalink award report block reply ERIC_CIARAMELLA 10 points 5 days ago Still shouldn't be paying more than 100k for a 1500 square foot home. Sorry. permalink award report block reply TrumpAndGodWin 3 points 5 days ago E.g. a boomer I know in Florida paid around 70k for that and now it's worth over 400k. permalink parent award report block reply ERIC_CIARAMELLA 4 points 5 days ago Exactly. Paid 128k for a property with my bitch ass ex wife when things were good.  It is worth 450k now.  We sold it for 138k in our divorce at that point in time. Fuck this shit man. permalink parent award report block reply BidensBodyDouble 2 points 5 days ago Been to a Home Depot lately? Can't do shit for 100k let alone build a house. If you wanna talk land values being ridiculous sure - but putting up any structure is fucking expensive. permalink parent award report block reply ERIC_CIARAMELLA 2 points 5 days ago Indeed. permalink parent award report block reply NADSAQ 1 points 5 days ago try 650k permalink parent award report block reply deleted 10 points 5 days ago BidensBodyDouble 3 points 5 days ago Housing prices have been dropping for the last year. And unlikely these people end up anywhere north of Boca/Jupiter. More likely - they leave after their first hurricane. All those SoFL transplants from covid still haven't really had to go through one. I suspect a mass exodus if/when it happens. SWFL saw this happen after covid migration. permalink parent award report block reply jimboonie 5 points 5 days ago Narrator: “They didn’t leave…” permalink parent award report block reply bull_in_a_china_shop 1 points 4 days ago Recently on Lotus Eaters I heard them discussing some British politician in the 1960s who was saying something to the effect of \"the windrushers will leave after their first winter.\" permalink parent award report block reply 420praiseit894 1 points 5 days ago Housing prices are dropping in areas where the federal government was handing out checks to illegals. Housing prices in other areas aren't necessarily going to follow suit. permalink parent award report block reply BidensBodyDouble 1 points 4 days ago Yea I agree that's prolly a factor but it's more likely the FHA loans that were getting bailed out by the Biden admin. For about the last 2 yrs of Biden they were paying people's mortgages to not cause a housing crash. FL had something like 3 cities who were in the top 5 recipients on that list. permalink parent award report block reply MudDog 1 points 5 days ago now?! permalink parent award report block reply Greenhills 9 points 5 days ago All the CEOs will work from billionaires bunker while their employees are required to be onsite five days a week at the Babylonian buildings they left behind permalink award report block reply JackLemon 7 points 5 days ago That was the psy-ops. We already have too many libtard foids moving to red states. Between them and the illegal aliens they believe they can flip red states to blue.\nAnyone moving in from Libtardia should be banned from voting in red states for at least ten years. permalink award report block reply YodaBannon 7 points 5 days ago Cuomo: 854,995\nZohran: 1,036,051 NY Dems are at war with each other, TRUMP is gonna toy with the clown, as a New Yorker I will be happy watching this all unfold, Stefanik 26, MAGA permalink award report block reply Stanwyk74 4 points 5 days ago Add in the other joker and it is dead even permalink parent award report block reply Govtizbad 0 points 5 days ago Yeah let's destroy our country so that we can laugh at Democrats! permalink parent award report block reply Krat 3 points 5 days ago Its already destroyed bubs permalink parent award report block reply YodaBannon 2 points 5 days ago he will be a 1 term dumpster fire permalink parent award report block reply Badfinz_FL 5 points 5 days ago Florida is full permalink award report block reply terribletwos 4 points 5 days ago There's still like 2.5 million republicans in nyc, so the people fleeing are probably just as much if not more republican. In theory we should all be moving to republican states to consolidate. Since there's a high probability that this might be how groups are aligned in the future. permalink award report block reply florida_man123 4 points 5 days ago I fucking hate yankees. permalink award report block reply Ryan282 3 points 5 days ago As a born and raised Floridian, I agree, 100%. permalink parent award report block reply Justjayce 4 points 5 days ago Poor babies.. Most probably didn't vote Go fuck yourself permalink award report block reply Stanwyk74 4 points 5 days ago Fuck these assholes permalink award report block reply Choppermagic 4 points 5 days ago DeSantis is trying to remove property tax too. That would be awesome permalink award report block reply MegoThor 4 points 5 days ago Keep Northern locusts out of Florida! permalink award report block reply rockaustin 4 points 5 days ago I live in CT and don’t want them here either. This state is blue enough and I don’t like the way New Yorkers drive. permalink award report block reply Deltamyass 4 points 5 days ago Florida should tell them to fuck off. They wanted for the cancer that brought more cancer in. Sit there and enjoy what you brought in. permalink award report block reply CommanderComadant 4 points 5 days ago I’m in Texas and I want to move to Florida. Texas is already overrun. Florida still has 10-15 years lol. permalink award report block reply captainmundane 2 points 5 days ago There is no room. permalink parent award report block reply Ryan282 2 points 5 days ago Come on over! permalink parent award report block reply jml1997 3 points 5 days ago Florida is full, go to Comifornia. permalink award report block reply genericamerican69 3 points 5 days ago It's funny how our side just flees the areas that the globos take over and think it's a win somehow. This is literally what they want and what leads to them conquering an area and getting their one party rule. Injecting their 3rd world parasites into your major metropolitan area is the perfect way to get you to leave. Remember that california was once completely red. permalink award report block reply ACActual 3 points 5 days ago Previous New Yorkers should be forced to take purity tests.  Social media inspections, etc.  FAFO permalink award report block reply IAmDisappoint 3 points 5 days ago Great, they are going to bring their voting habits to FL now and make FL the new NY. Just like CA transplants did to WA. permalink award report block reply behemoth887 3 points 5 days ago the virus of lib begins to spread permalink award report block reply MrCrispy 3 points 5 days ago Fuck. Stay away from Florida you locusts. Trust me, you’ll hate it here. We’ve got horrible weather and roaches the size of chicken tenders and they can fly. You don’t want that. permalink award report block reply BuSpocky 3 points 5 days ago Stay. The fuck. Out. permalink award report block reply snoozeflu 3 points 5 days ago Elect a commie. Move to Florida & continue to vote blue. Elect another commie. Wash, dry, rinse, spin, repeat. permalink award report block reply Shitsbrokeyo 3 points 5 days ago The bottom is going to fall out of NY market permalink award report block reply Bldg_2019 3 points 5 days ago Blue state Flahraduh incoming once again. permalink award report block reply nebula72 2 points 5 days ago Bad news for Florida. They will just vote for the same assholes that ruined their State.  Worse than cancer. permalink award report block reply NonbinaryPotatohead 2 points 5 days ago Why do these people have only 2 options in their head?\nI'll let you all answer that. permalink award report block reply ShadowInv 2 points 5 days ago Nooo permalink award report block reply Genericwhitemale 2 points 5 days ago The Bee already called it permalink award report block reply S810 2 points 5 days ago that's what florida needed, HIGHER real estate prices permalink award report block reply N3G4T1V3 2 points 5 days ago He won't be running much.  He's the front man.  It'll be as bad as they might think, and worse.  Another infiltrator puppet. permalink award report block reply OTher55 2 points 5 days ago A lot of Miami residents have fled there from socialist and communist governments such as Cuba, Venezuela, and Nicaragua. They'll fit right in. permalink award report block reply MyNameIsTaxpayer 2 points 5 days ago They should only be allowed to buy homes on MLK named roads permalink award report block reply RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply pedewithweed 2 points 5 days ago Haiyaaa 😭 permalink award report block reply Rock9Head 2 points 5 days ago Didn’t they all just vote for communism? permalink award report block reply RhodesianRidgeback 2 points 5 days ago Jewrida permalink award report block reply PatriotSkorzeny 2 points 5 days ago How many flights have actually departed Alligator Alcatraz? Bring back daily stats. Daily Morning Reports. We deserve to know. permalink award report block reply EddieAteTheEmu 2 points 5 days ago We don't want them, let them figure it out and turn out to vote next time! permalink award report block reply hilboggins 2 points 5 days ago Band immigration to Florida. Ok off! permalink award report block reply Scumbag-reddit 2 points 5 days ago Mother fuckers stay the fuck away, we're full. permalink award report block reply Thegman 2 points 5 days ago But muh accelerationism. permalink award report block reply ShotgunParade69x 2 points 5 days ago Why would libs move from there? permalink award report block reply pedeypete 2 points 4 days ago A real estate friend is doing whatever he needs to do to work in New York, said the amount of calls he's gotten from clients asking for help moving friends and family out has been through the roof! Good, hard working Americans. To be replaced by goat fuckers. permalink award report block reply ragnarokrobo 2 points 5 days ago Yankee go home. Or stay home rather. permalink award report block reply philnmdg 1 points 4 days ago No, you don't want to go to Florida, go to California. You created that mess in NY, don't bring it to Florida. Did you vote in this recent election? permalink award report block reply knnbccb 1 points 5 days ago Trump had the foresight to leave that shithole years ago. permalink award report block reply barryb0nds 1 points 5 days ago I expect to see NYC go the way of Detroit in my lifetime. You can't be hostile to the tiny percentage of people who pay half of the income tax in NYC and expect it to go well. permalink award report block reply BasedMillennial 1 points 5 days ago DeSantis should continue with the plan to eliminate property taxes, except for new residents coming from out of state. permalink award report block reply AppalachianTactical 1 points 5 days ago Sure they are.\nMamdani was installed to scare the right back into the arms of Israel. Dudes in pictures wearing fucking yarmulkes. Gay muslim dude with a beard wife wearing a yarmulke and taking soros money. permalink award report block reply HenkZeilstra 1 points 4 days ago Dont let that cancer in permalink award report block reply Zytos 1 points 5 days ago Long Island suburbs of NYC are doing just fine. permalink award report block reply DrVSGGEOTUSPhD 1 points 5 days ago Did Florida real-estate ever not surge in recent years? permalink award report block reply Nomad899 1 points 5 days ago Is that his hooker beard next to him or a niece? permalink award report block reply gezadreamsheets2 1 points 5 days ago Free, free, free permalink award report block reply patrioticwinning3 1 points 5 days ago His wife is ugly :p permalink award report block reply auntjemima 1 points 5 days ago poor florida.... permalink award report block reply stillbringingitback 1 points 5 days ago Can someone plz explain to me where the fuck this guys campaign/persona/eligibility came from?  Like what about this guy is just so amazing that differentiates him from any other retard that could take his place and say the same stupid stuff? permalink award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nAquamine-Amarine 133 points 5 days ago Great, make it even harder for us young conservatives to buy a house. Fuck commies. permalink award report block reply Viewer01 61 points 5 days ago It is the most criminal thing. Faggots in Cali and nyc purposely cause massive inflation in their states. Then these fucks sell their inflated assets and go to more fiscally responsible states and inflate shit there too. All because we are captured by usurers who swapped us off the gold standard and onto fiat. permalink parent award report block reply Easzq8 2 points 5 days ago Do you suggest a ban on buying houses for investment purposes? That would be a fairly overreaching legislation, would it not? permalink parent award report block reply StruggleSession 8 points 5 days ago A progressive property tax that makes home owners pay little or nothing for their first primary residence and then increases exponentially for each new house would discourage hoarding. Another option is just deporting immigrants to increase the supply of houses or ban foreigners from owning or purchasing US property. Anything is better than making it impossible for Americans to buy homes and raise families. permalink parent award report block reply Aambrick 2 points 5 days ago I would say do all of that with the last one having monthly inspections if allowed. permalink parent award report block reply UpvoteBot 2 points 4 days ago This is exactly the solution. Particularly the deportation of ALL illegals and the majority of Visa holders. You can directly track the increase in real estate pricing to the increase in illegal immigration. All these brown folks have to live someplace. The same fact holds true with the price of groceries, healthcare, welfare spending, literally everything. The one thing that does not increase with the number of illegals entering the country, is prosperity and wealth. Deporting all illegals remains the number one most important thing that can be done to increase the quality of life for American citizens. permalink parent award report block reply view 1 more comments... Viewer01 6 points 5 days ago Institutional ownership by any business or fund of single family or condo type units? Yes. permalink parent award report block reply Mandroid901 1 points 5 days ago You do realize Trump is from NYC and moved to Florida permalink parent award report block reply NADSAQ 5 points 5 days ago after he was President, and he has had business interests and a residence in FL for decades permalink parent award report block reply permissible_missile 5 points 5 days ago He made it harder for some young conservative to buy Mar A Lago. Downright criminal if you ask me! permalink parent award report block reply MastaJoda 1 points 5 days ago What a stupid, irrelevant comment. permalink parent award report block reply ShitFromShinola -6 points 5 days ago How is it that people In a particular state cause inflation in their that state? Inflation is always too much money chasing too little a supply. It's kind of baked in to wherever you live. In NYC, there is almost no land available of new housing, so the price goes up. Due to the increases in prices, companies have to pay more for the best people so salaries go up. So it seems that this is mostly a function of land scarcity in mature markets. And you have the opposite going on in shitholes like West Virginia where housing is really cheap. But decent jobs are hard to come by and culturally, it's a fucking dump. And there is not exactly a rush of people moving to WV-  and there is a reason for that. permalink parent award report block reply EdgyUsernamexX69Xx 7 points 5 days ago The way markets actually work is not found in an economics textbook. permalink parent award report block reply ShitFromShinola -5 points 5 days ago Is that so, Professor. Please tell us how things really work. permalink parent award report block reply view 3 more comments... ShadowInv 3 points 5 days ago Equity locusts permalink parent award report block reply ShitFromShinola 1 points 5 days ago What's the solution, shit stain? permalink parent award report block reply 420praiseit894 2 points 5 days ago People with a lot of money from NYC flee to states with cheaper living, driving demand in those areas up past reasonable price levels for natives. Government policy also affects inflation. Hence, voting for leftist shit drives up cost of living in their own state, and then they flee like parasites to better states, which drives up costs there as well. Housing market costs are heavily influenced by expatriates from more expensive areas being willing to pay a lot more. permalink parent award report block reply ShitFromShinola -1 points 5 days ago So stop sniveling and move to West Virginia, then. Then those hillbillies will blame you for driving up the cost of a single wide trailer in Morgantown. See how this works? permalink parent award report block reply TrumpsBigBalls 1 points 5 days ago not sure why the downvotes as your statement is accurate. permalink parent award report block reply ShitFromShinola 1 points 5 days ago People need a scapegoat- someone to blame for their misfortune. Houses cost more in desirable places and less in shitholes. That's the way the world works. In markets where real estate is higher- so are salaries for most professions. A lot of it is that they resent the fact that Blue cities are so much more desirable (including better jobs)  due to the many things they offer above and beyond what is available in small town or rural America. But that is literally the way it is any you'd go in the entire world. permalink parent award report block reply AlmostFullyDilated -10 points 5 days ago lol what? as a American I can buy land wherever the fuck I want . I'll buy your childhood home and burn it too the ground permalink parent award report block reply Viewer01 4 points 5 days ago A fool and his money are soon parted so this checks out. permalink parent award report block reply AlmostFullyDilated -4 points 5 days ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments... PapaPepe 22 points 5 days ago The average age of a first time homebuyer just reached 40. permalink parent award report block reply Parhelion12 13 points 5 days ago That's a crisis permalink parent award report block reply PapaPepe 9 points 5 days ago Boomers are basically the ones buying and selling like 60% of homes. They will hold on to their investment till they die. permalink parent award report block reply Husky 7 points 5 days ago Boomers are the only ones that have been buying houses for 30 years permalink parent award report block reply view 2 more comments... MastaJoda 1 points 5 days ago lol mature folks holding onto their greatest asset??? OMG THOSE MONSTERS!!! Fucking idiot, thats called being smart! They arent the dumb fuck young gens that need new shiney objects every year to feel special. How ignorant are you? permalink parent award report block reply KernalMustard 3 points 5 days ago Sure is. I was 24. Paid off at 36 permalink parent award report block reply barryb0nds 1 points 5 days ago Wow congrats! May I ask how much you paid, what interest rate you got, and what kind of overpayments you were making? permalink parent award report block reply goldwater4ever 2 points 5 days ago don't worry, comrade! We will own nothing and be happy soon enough.. permalink parent award report block reply 420praiseit894 3 points 5 days ago There's an even more damning statistic. The average home buyer age, not first time, overall, has been staying at the exact same birth year - e.g going up by 1 every year, for about 20 years. The same age group is buying most of the houses for 20 fucking years. permalink parent award report block reply PapaPepe 2 points 5 days ago Boomers just tell everyone to pull themselves up by their bootstraps permalink parent award report block reply bejeavis 2 points 5 days ago Or they just down vote because truth hurts permalink parent award report block reply Bunny 1 points 5 days ago We're always welcoming conservatives in Alabama.. 😁 permalink parent award report block reply pnwpatriot97 1 points 5 days ago Yep. Now New York will become the East Coast California 2.0 and their wealthiest people will flock to other states and drive the prices up even more! Fucking fantastic shit huh? permalink parent award report block reply MastaJoda 1 points 5 days ago 😂🤣😂FL about to go purple again permalink parent award report block reply load 42 more comments...\nViewer01 61 points 5 days ago It is the most criminal thing. Faggots in Cali and nyc purposely cause massive inflation in their states. Then these fucks sell their inflated assets and go to more fiscally responsible states and inflate shit there too. All because we are captured by usurers who swapped us off the gold standard and onto fiat. permalink parent award report block reply Easzq8 2 points 5 days ago Do you suggest a ban on buying houses for investment purposes? That would be a fairly overreaching legislation, would it not? permalink parent award report block reply StruggleSession 8 points 5 days ago A progressive property tax that makes home owners pay little or nothing for their first primary residence and then increases exponentially for each new house would discourage hoarding. Another option is just deporting immigrants to increase the supply of houses or ban foreigners from owning or purchasing US property. Anything is better than making it impossible for Americans to buy homes and raise families. permalink parent award report block reply Aambrick 2 points 5 days ago I would say do all of that with the last one having monthly inspections if allowed. permalink parent award report block reply UpvoteBot 2 points 4 days ago This is exactly the solution. Particularly the deportation of ALL illegals and the majority of Visa holders. You can directly track the increase in real estate pricing to the increase in illegal immigration. All these brown folks have to live someplace. The same fact holds true with the price of groceries, healthcare, welfare spending, literally everything. The one thing that does not increase with the number of illegals entering the country, is prosperity and wealth. Deporting all illegals remains the number one most important thing that can be done to increase the quality of life for American citizens. permalink parent award report block reply view 1 more comments... Viewer01 6 points 5 days ago Institutional ownership by any business or fund of single family or condo type units? Yes. permalink parent award report block reply Mandroid901 1 points 5 days ago You do realize Trump is from NYC and moved to Florida permalink parent award report block reply NADSAQ 5 points 5 days ago after he was President, and he has had business interests and a residence in FL for decades permalink parent award report block reply permissible_missile 5 points 5 days ago He made it harder for some young conservative to buy Mar A Lago. Downright criminal if you ask me! permalink parent award report block reply MastaJoda 1 points 5 days ago What a stupid, irrelevant comment. permalink parent award report block reply ShitFromShinola -6 points 5 days ago How is it that people In a particular state cause inflation in their that state? Inflation is always too much money chasing too little a supply. It's kind of baked in to wherever you live. In NYC, there is almost no land available of new housing, so the price goes up. Due to the increases in prices, companies have to pay more for the best people so salaries go up. So it seems that this is mostly a function of land scarcity in mature markets. And you have the opposite going on in shitholes like West Virginia where housing is really cheap. But decent jobs are hard to come by and culturally, it's a fucking dump. And there is not exactly a rush of people moving to WV-  and there is a reason for that. permalink parent award report block reply EdgyUsernamexX69Xx 7 points 5 days ago The way markets actually work is not found in an economics textbook. permalink parent award report block reply ShitFromShinola -5 points 5 days ago Is that so, Professor. Please tell us how things really work. permalink parent award report block reply view 3 more comments... ShadowInv 3 points 5 days ago Equity locusts permalink parent award report block reply ShitFromShinola 1 points 5 days ago What's the solution, shit stain? permalink parent award report block reply 420praiseit894 2 points 5 days ago People with a lot of money from NYC flee to states with cheaper living, driving demand in those areas up past reasonable price levels for natives. Government policy also affects inflation. Hence, voting for leftist shit drives up cost of living in their own state, and then they flee like parasites to better states, which drives up costs there as well. Housing market costs are heavily influenced by expatriates from more expensive areas being willing to pay a lot more. permalink parent award report block reply ShitFromShinola -1 points 5 days ago So stop sniveling and move to West Virginia, then. Then those hillbillies will blame you for driving up the cost of a single wide trailer in Morgantown. See how this works? permalink parent award report block reply TrumpsBigBalls 1 points 5 days ago not sure why the downvotes as your statement is accurate. permalink parent award report block reply ShitFromShinola 1 points 5 days ago People need a scapegoat- someone to blame for their misfortune. Houses cost more in desirable places and less in shitholes. That's the way the world works. In markets where real estate is higher- so are salaries for most professions. A lot of it is that they resent the fact that Blue cities are so much more desirable (including better jobs)  due to the many things they offer above and beyond what is available in small town or rural America. But that is literally the way it is any you'd go in the entire world. permalink parent award report block reply AlmostFullyDilated -10 points 5 days ago lol what? as a American I can buy land wherever the fuck I want . I'll buy your childhood home and burn it too the ground permalink parent award report block reply Viewer01 4 points 5 days ago A fool and his money are soon parted so this checks out. permalink parent award report block reply AlmostFullyDilated -4 points 5 days ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments...\nEaszq8 2 points 5 days ago Do you suggest a ban on buying houses for investment purposes? That would be a fairly overreaching legislation, would it not? permalink parent award report block reply StruggleSession 8 points 5 days ago A progressive property tax that makes home owners pay little or nothing for their first primary residence and then increases exponentially for each new house would discourage hoarding. Another option is just deporting immigrants to increase the supply of houses or ban foreigners from owning or purchasing US property. Anything is better than making it impossible for Americans to buy homes and raise families. permalink parent award report block reply Aambrick 2 points 5 days ago I would say do all of that with the last one having monthly inspections if allowed. permalink parent award report block reply UpvoteBot 2 points 4 days ago This is exactly the solution. Particularly the deportation of ALL illegals and the majority of Visa holders. You can directly track the increase in real estate pricing to the increase in illegal immigration. All these brown folks have to live someplace. The same fact holds true with the price of groceries, healthcare, welfare spending, literally everything. The one thing that does not increase with the number of illegals entering the country, is prosperity and wealth. Deporting all illegals remains the number one most important thing that can be done to increase the quality of life for American citizens. permalink parent award report block reply view 1 more comments... Viewer01 6 points 5 days ago Institutional ownership by any business or fund of single family or condo type units? Yes. permalink parent award report block reply\nStruggleSession 8 points 5 days ago A progressive property tax that makes home owners pay little or nothing for their first primary residence and then increases exponentially for each new house would discourage hoarding. Another option is just deporting immigrants to increase the supply of houses or ban foreigners from owning or purchasing US property. Anything is better than making it impossible for Americans to buy homes and raise families. permalink parent award report block reply Aambrick 2 points 5 days ago I would say do all of that with the last one having monthly inspections if allowed. permalink parent award report block reply UpvoteBot 2 points 4 days ago This is exactly the solution. Particularly the deportation of ALL illegals and the majority of Visa holders. You can directly track the increase in real estate pricing to the increase in illegal immigration. All these brown folks have to live someplace. The same fact holds true with the price of groceries, healthcare, welfare spending, literally everything. The one thing that does not increase with the number of illegals entering the country, is prosperity and wealth. Deporting all illegals remains the number one most important thing that can be done to increase the quality of life for American citizens. permalink parent award report block reply view 1 more comments...\nAambrick 2 points 5 days ago I would say do all of that with the last one having monthly inspections if allowed. permalink parent award report block reply\nUpvoteBot 2 points 4 days ago This is exactly the solution. Particularly the deportation of ALL illegals and the majority of Visa holders. You can directly track the increase in real estate pricing to the increase in illegal immigration. All these brown folks have to live someplace. The same fact holds true with the price of groceries, healthcare, welfare spending, literally everything. The one thing that does not increase with the number of illegals entering the country, is prosperity and wealth. Deporting all illegals remains the number one most important thing that can be done to increase the quality of life for American citizens. permalink parent award report block reply view 1 more comments...\nViewer01 6 points 5 days ago Institutional ownership by any business or fund of single family or condo type units? Yes. permalink parent award report block reply\nMandroid901 1 points 5 days ago You do realize Trump is from NYC and moved to Florida permalink parent award report block reply NADSAQ 5 points 5 days ago after he was President, and he has had business interests and a residence in FL for decades permalink parent award report block reply permissible_missile 5 points 5 days ago He made it harder for some young conservative to buy Mar A Lago. Downright criminal if you ask me! permalink parent award report block reply MastaJoda 1 points 5 days ago What a stupid, irrelevant comment. permalink parent award report block reply\nNADSAQ 5 points 5 days ago after he was President, and he has had business interests and a residence in FL for decades permalink parent award report block reply\npermissible_missile 5 points 5 days ago He made it harder for some young conservative to buy Mar A Lago. Downright criminal if you ask me! permalink parent award report block reply\nMastaJoda 1 points 5 days ago What a stupid, irrelevant comment. permalink parent award report block reply\nShitFromShinola -6 points 5 days ago How is it that people In a particular state cause inflation in their that state? Inflation is always too much money chasing too little a supply. It's kind of baked in to wherever you live. In NYC, there is almost no land available of new housing, so the price goes up. Due to the increases in prices, companies have to pay more for the best people so salaries go up. So it seems that this is mostly a function of land scarcity in mature markets. And you have the opposite going on in shitholes like West Virginia where housing is really cheap. But decent jobs are hard to come by and culturally, it's a fucking dump. And there is not exactly a rush of people moving to WV-  and there is a reason for that. permalink parent award report block reply EdgyUsernamexX69Xx 7 points 5 days ago The way markets actually work is not found in an economics textbook. permalink parent award report block reply ShitFromShinola -5 points 5 days ago Is that so, Professor. Please tell us how things really work. permalink parent award report block reply view 3 more comments... ShadowInv 3 points 5 days ago Equity locusts permalink parent award report block reply ShitFromShinola 1 points 5 days ago What's the solution, shit stain? permalink parent award report block reply 420praiseit894 2 points 5 days ago People with a lot of money from NYC flee to states with cheaper living, driving demand in those areas up past reasonable price levels for natives. Government policy also affects inflation. Hence, voting for leftist shit drives up cost of living in their own state, and then they flee like parasites to better states, which drives up costs there as well. Housing market costs are heavily influenced by expatriates from more expensive areas being willing to pay a lot more. permalink parent award report block reply ShitFromShinola -1 points 5 days ago So stop sniveling and move to West Virginia, then. Then those hillbillies will blame you for driving up the cost of a single wide trailer in Morgantown. See how this works? permalink parent award report block reply TrumpsBigBalls 1 points 5 days ago not sure why the downvotes as your statement is accurate. permalink parent award report block reply ShitFromShinola 1 points 5 days ago People need a scapegoat- someone to blame for their misfortune. Houses cost more in desirable places and less in shitholes. That's the way the world works. In markets where real estate is higher- so are salaries for most professions. A lot of it is that they resent the fact that Blue cities are so much more desirable (including better jobs)  due to the many things they offer above and beyond what is available in small town or rural America. But that is literally the way it is any you'd go in the entire world. permalink parent award report block reply\nEdgyUsernamexX69Xx 7 points 5 days ago The way markets actually work is not found in an economics textbook. permalink parent award report block reply ShitFromShinola -5 points 5 days ago Is that so, Professor. Please tell us how things really work. permalink parent award report block reply view 3 more comments...\nShitFromShinola -5 points 5 days ago Is that so, Professor. Please tell us how things really work. permalink parent award report block reply view 3 more comments...\nShadowInv 3 points 5 days ago Equity locusts permalink parent award report block reply ShitFromShinola 1 points 5 days ago What's the solution, shit stain? permalink parent award report block reply\nShitFromShinola 1 points 5 days ago What's the solution, shit stain? permalink parent award report block reply\n420praiseit894 2 points 5 days ago People with a lot of money from NYC flee to states with cheaper living, driving demand in those areas up past reasonable price levels for natives. Government policy also affects inflation. Hence, voting for leftist shit drives up cost of living in their own state, and then they flee like parasites to better states, which drives up costs there as well. Housing market costs are heavily influenced by expatriates from more expensive areas being willing to pay a lot more. permalink parent award report block reply ShitFromShinola -1 points 5 days ago So stop sniveling and move to West Virginia, then. Then those hillbillies will blame you for driving up the cost of a single wide trailer in Morgantown. See how this works? permalink parent award report block reply\nShitFromShinola -1 points 5 days ago So stop sniveling and move to West Virginia, then. Then those hillbillies will blame you for driving up the cost of a single wide trailer in Morgantown. See how this works? permalink parent award report block reply\nTrumpsBigBalls 1 points 5 days ago not sure why the downvotes as your statement is accurate. permalink parent award report block reply ShitFromShinola 1 points 5 days ago People need a scapegoat- someone to blame for their misfortune. Houses cost more in desirable places and less in shitholes. That's the way the world works. In markets where real estate is higher- so are salaries for most professions. A lot of it is that they resent the fact that Blue cities are so much more desirable (including better jobs)  due to the many things they offer above and beyond what is available in small town or rural America. But that is literally the way it is any you'd go in the entire world. permalink parent award report block reply\nShitFromShinola 1 points 5 days ago People need a scapegoat- someone to blame for their misfortune. Houses cost more in desirable places and less in shitholes. That's the way the world works. In markets where real estate is higher- so are salaries for most professions. A lot of it is that they resent the fact that Blue cities are so much more desirable (including better jobs)  due to the many things they offer above and beyond what is available in small town or rural America. But that is literally the way it is any you'd go in the entire world. permalink parent award report block reply\nAlmostFullyDilated -10 points 5 days ago lol what? as a American I can buy land wherever the fuck I want . I'll buy your childhood home and burn it too the ground permalink parent award report block reply Viewer01 4 points 5 days ago A fool and his money are soon parted so this checks out. permalink parent award report block reply AlmostFullyDilated -4 points 5 days ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments...\nViewer01 4 points 5 days ago A fool and his money are soon parted so this checks out. permalink parent award report block reply AlmostFullyDilated -4 points 5 days ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments...\nAlmostFullyDilated -4 points 5 days ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments...\nPapaPepe 22 points 5 days ago The average age of a first time homebuyer just reached 40. permalink parent award report block reply Parhelion12 13 points 5 days ago That's a crisis permalink parent award report block reply PapaPepe 9 points 5 days ago Boomers are basically the ones buying and selling like 60% of homes. They will hold on to their investment till they die. permalink parent award report block reply Husky 7 points 5 days ago Boomers are the only ones that have been buying houses for 30 years permalink parent award report block reply view 2 more comments... MastaJoda 1 points 5 days ago lol mature folks holding onto their greatest asset??? OMG THOSE MONSTERS!!! Fucking idiot, thats called being smart! They arent the dumb fuck young gens that need new shiney objects every year to feel special. How ignorant are you? permalink parent award report block reply KernalMustard 3 points 5 days ago Sure is. I was 24. Paid off at 36 permalink parent award report block reply barryb0nds 1 points 5 days ago Wow congrats! May I ask how much you paid, what interest rate you got, and what kind of overpayments you were making? permalink parent award report block reply goldwater4ever 2 points 5 days ago don't worry, comrade! We will own nothing and be happy soon enough.. permalink parent award report block reply 420praiseit894 3 points 5 days ago There's an even more damning statistic. The average home buyer age, not first time, overall, has been staying at the exact same birth year - e.g going up by 1 every year, for about 20 years. The same age group is buying most of the houses for 20 fucking years. permalink parent award report block reply PapaPepe 2 points 5 days ago Boomers just tell everyone to pull themselves up by their bootstraps permalink parent award report block reply bejeavis 2 points 5 days ago Or they just down vote because truth hurts permalink parent award report block reply\nParhelion12 13 points 5 days ago That's a crisis permalink parent award report block reply PapaPepe 9 points 5 days ago Boomers are basically the ones buying and selling like 60% of homes. They will hold on to their investment till they die. permalink parent award report block reply Husky 7 points 5 days ago Boomers are the only ones that have been buying houses for 30 years permalink parent award report block reply view 2 more comments... MastaJoda 1 points 5 days ago lol mature folks holding onto their greatest asset??? OMG THOSE MONSTERS!!! Fucking idiot, thats called being smart! They arent the dumb fuck young gens that need new shiney objects every year to feel special. How ignorant are you? permalink parent award report block reply KernalMustard 3 points 5 days ago Sure is. I was 24. Paid off at 36 permalink parent award report block reply barryb0nds 1 points 5 days ago Wow congrats! May I ask how much you paid, what interest rate you got, and what kind of overpayments you were making? permalink parent award report block reply goldwater4ever 2 points 5 days ago don't worry, comrade! We will own nothing and be happy soon enough.. permalink parent award report block reply\nPapaPepe 9 points 5 days ago Boomers are basically the ones buying and selling like 60% of homes. They will hold on to their investment till they die. permalink parent award report block reply Husky 7 points 5 days ago Boomers are the only ones that have been buying houses for 30 years permalink parent award report block reply view 2 more comments... MastaJoda 1 points 5 days ago lol mature folks holding onto their greatest asset??? OMG THOSE MONSTERS!!! Fucking idiot, thats called being smart! They arent the dumb fuck young gens that need new shiney objects every year to feel special. How ignorant are you? permalink parent award report block reply\nHusky 7 points 5 days ago Boomers are the only ones that have been buying houses for 30 years permalink parent award report block reply view 2 more comments...\nMastaJoda 1 points 5 days ago lol mature folks holding onto their greatest asset??? OMG THOSE MONSTERS!!! Fucking idiot, thats called being smart! They arent the dumb fuck young gens that need new shiney objects every year to feel special. How ignorant are you? permalink parent award report block reply\nKernalMustard 3 points 5 days ago Sure is. I was 24. Paid off at 36 permalink parent award report block reply barryb0nds 1 points 5 days ago Wow congrats! May I ask how much you paid, what interest rate you got, and what kind of overpayments you were making? permalink parent award report block reply\nbarryb0nds 1 points 5 days ago Wow congrats! May I ask how much you paid, what interest rate you got, and what kind of overpayments you were making? permalink parent award report block reply\ngoldwater4ever 2 points 5 days ago don't worry, comrade! We will own nothing and be happy soon enough.. permalink parent award report block reply\n420praiseit894 3 points 5 days ago There's an even more damning statistic. The average home buyer age, not first time, overall, has been staying at the exact same birth year - e.g going up by 1 every year, for about 20 years. The same age group is buying most of the houses for 20 fucking years. permalink parent award report block reply PapaPepe 2 points 5 days ago Boomers just tell everyone to pull themselves up by their bootstraps permalink parent award report block reply bejeavis 2 points 5 days ago Or they just down vote because truth hurts permalink parent award report block reply\nPapaPepe 2 points 5 days ago Boomers just tell everyone to pull themselves up by their bootstraps permalink parent award report block reply bejeavis 2 points 5 days ago Or they just down vote because truth hurts permalink parent award report block reply\nbejeavis 2 points 5 days ago Or they just down vote because truth hurts permalink parent award report block reply\nBunny 1 points 5 days ago We're always welcoming conservatives in Alabama.. 😁 permalink parent award report block reply\npnwpatriot97 1 points 5 days ago Yep. Now New York will become the East Coast California 2.0 and their wealthiest people will flock to other states and drive the prices up even more! Fucking fantastic shit huh? permalink parent award report block reply\nMastaJoda 1 points 5 days ago 😂🤣😂FL about to go purple again permalink parent award report block reply\njdovejr 44 points 5 days ago Great. Those idiots elect a commie and my prices go up. permalink award report block reply Govtizbad 44 points 5 days ago And then they will come to your state and elect another commie It's like a virus. It spreads from host to host edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply realPhantomFuck 16 points 5 days ago My state has been the largest recipient of California Locusts. Can confirm--hell follows with them permalink parent award report block reply LaVaughnRobinson 12 points 5 days ago Dont you love how they move and then bitch about where they moved too how its not like where they moved from.  Then vote how they did back at the shithole they came from to fuck the new home up.  Commies, all of them. permalink parent award report block reply Shitsbrokeyo 4 points 5 days ago We get mainly NY, OH, FL here in TN. Come red or stay out. permalink parent award report block reply view 3 more comments... Nibba2 2 points 5 days ago That’s the entire point. Just like California. permalink parent award report block reply MediaBro 2 points 5 days ago Sounds like Muslims. permalink parent award report block reply TheRPatriot 2 points 5 days ago Florida has only gotten more red post exodus’…. permalink parent award report block reply snoopy3210 1 points 5 days ago Powell Jobs is such a parasite permalink parent award report block reply load 2 more comments...\nGovtizbad 44 points 5 days ago And then they will come to your state and elect another commie It's like a virus. It spreads from host to host edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply realPhantomFuck 16 points 5 days ago My state has been the largest recipient of California Locusts. Can confirm--hell follows with them permalink parent award report block reply LaVaughnRobinson 12 points 5 days ago Dont you love how they move and then bitch about where they moved too how its not like where they moved from.  Then vote how they did back at the shithole they came from to fuck the new home up.  Commies, all of them. permalink parent award report block reply Shitsbrokeyo 4 points 5 days ago We get mainly NY, OH, FL here in TN. Come red or stay out. permalink parent award report block reply view 3 more comments... Nibba2 2 points 5 days ago That’s the entire point. Just like California. permalink parent award report block reply MediaBro 2 points 5 days ago Sounds like Muslims. permalink parent award report block reply TheRPatriot 2 points 5 days ago Florida has only gotten more red post exodus’…. permalink parent award report block reply snoopy3210 1 points 5 days ago Powell Jobs is such a parasite permalink parent award report block reply load 2 more comments...\nrealPhantomFuck 16 points 5 days ago My state has been the largest recipient of California Locusts. Can confirm--hell follows with them permalink parent award report block reply LaVaughnRobinson 12 points 5 days ago Dont you love how they move and then bitch about where they moved too how its not like where they moved from.  Then vote how they did back at the shithole they came from to fuck the new home up.  Commies, all of them. permalink parent award report block reply Shitsbrokeyo 4 points 5 days ago We get mainly NY, OH, FL here in TN. Come red or stay out. permalink parent award report block reply view 3 more comments...\nLaVaughnRobinson 12 points 5 days ago Dont you love how they move and then bitch about where they moved too how its not like where they moved from.  Then vote how they did back at the shithole they came from to fuck the new home up.  Commies, all of them. permalink parent award report block reply Shitsbrokeyo 4 points 5 days ago We get mainly NY, OH, FL here in TN. Come red or stay out. permalink parent award report block reply view 3 more comments...\nShitsbrokeyo 4 points 5 days ago We get mainly NY, OH, FL here in TN. Come red or stay out. permalink parent award report block reply view 3 more comments...\nNibba2 2 points 5 days ago That’s the entire point. Just like California. permalink parent award report block reply\nMediaBro 2 points 5 days ago Sounds like Muslims. permalink parent award report block reply\nTheRPatriot 2 points 5 days ago Florida has only gotten more red post exodus’…. permalink parent award report block reply\nsnoopy3210 1 points 5 days ago Powell Jobs is such a parasite permalink parent award report block reply\nDeplorachuIChooseYou 29 points 5 days ago Great. More liberals in Florida just what the state needs permalink award report block reply MisterMAGA 27 points 5 days ago “Yay our blue guy won, let’s move to a really red area honey!” nobody, ever permalink parent award report block reply Bushwookiee07 20 points 5 days ago It’s the ones that voted for the other blue guy. They move to Montana too. They’ve been shitting up our state since 2020. permalink parent award report block reply RememberCharlieKirk 4 points 5 days ago Shades of blue: These potential movers could think of themselves as left-center, whatever that label means anymore. They could be supporters of Andrew \"how am I not in prison after purposefully leading NY grandparents to their deaths?\" Cuomo. Perhaps, even they think handing NYC to an unemployable, Karl Marx quoting, economically illiterate bum is a recipe for disaster. permalink parent award report block reply guywholikesDjtof2024 2 points 5 days ago Your name is MEGA BASED!!!! Stick around! Is Jesus God? permalink parent award report block reply RememberCharlieKirk 1 points 4 days ago Thank you. Yes. Originally, I thought that you were being facetious; I read your comment as mockery, as opposed to sincere. However, your second, most latest comment has proved otherwise. permalink parent award report block reply view 3 more comments... MisterMAGA 1 points 5 days ago Or it’s the conservatives. There are millions there you know. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply Nibba2 3 points 5 days ago You must be unfamiliar with California, rabbi. permalink parent award report block reply MisterMAGA 1 points 5 days ago Yep. I’m only familiar with Texas where I live, and the vast majority of people I know who lived here from CA or NY in last 5nywars have been conservatives. permalink parent award report block reply snoopy3210 4 points 5 days ago No the republicans in NY were the first to go to florida, and now the independents and the former democrats registered Republicans. Not bad. permalink parent award report block reply DeplorachuIChooseYou 4 points 5 days ago I just don't see it. especially when you look at CO, NM, NJ, and WA. Even if that is true, It's a ripple effect. those locusts will destroy that state so far that even the socialites will flee. Look at areas in Texas now. Look at Montana apparently becoming a hotspot for Californians, and what Idaho could become. permalink parent award report block reply BidensBodyDouble 2 points 5 days ago The state keeps getting more red. My county was reliably blue. Same with the neighboring. Both are purple now and lean red. There's some shitty local politics where dems win but that's more a result of Rs not getting involved in local politics. The fucking fear mongering is insane. As someone who's been here 15 years I've watched it turn. permalink parent award report block reply SarsourCuntReturns 1 points 5 days ago Can confirm about NM. A lot of people who moved from CA to NM stayed voting blue because they're retarded. permalink parent award report block reply Govtizbad 4 points 5 days ago Build the Florida wall edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply KernalMustard 2 points 5 days ago Hi Ballots. permalink parent award report block reply The_Emperor 1 points 5 days ago Not liberals.  Outnumbered normal people permalink parent award report block reply GainesvilleFlorida 1 points 5 days ago They think they are conservative but then they’ll want gun laws and believe trans are legit. permalink parent award report block reply\nMisterMAGA 27 points 5 days ago “Yay our blue guy won, let’s move to a really red area honey!” nobody, ever permalink parent award report block reply Bushwookiee07 20 points 5 days ago It’s the ones that voted for the other blue guy. They move to Montana too. They’ve been shitting up our state since 2020. permalink parent award report block reply RememberCharlieKirk 4 points 5 days ago Shades of blue: These potential movers could think of themselves as left-center, whatever that label means anymore. They could be supporters of Andrew \"how am I not in prison after purposefully leading NY grandparents to their deaths?\" Cuomo. Perhaps, even they think handing NYC to an unemployable, Karl Marx quoting, economically illiterate bum is a recipe for disaster. permalink parent award report block reply guywholikesDjtof2024 2 points 5 days ago Your name is MEGA BASED!!!! Stick around! Is Jesus God? permalink parent award report block reply RememberCharlieKirk 1 points 4 days ago Thank you. Yes. Originally, I thought that you were being facetious; I read your comment as mockery, as opposed to sincere. However, your second, most latest comment has proved otherwise. permalink parent award report block reply view 3 more comments... MisterMAGA 1 points 5 days ago Or it’s the conservatives. There are millions there you know. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply Nibba2 3 points 5 days ago You must be unfamiliar with California, rabbi. permalink parent award report block reply MisterMAGA 1 points 5 days ago Yep. I’m only familiar with Texas where I live, and the vast majority of people I know who lived here from CA or NY in last 5nywars have been conservatives. permalink parent award report block reply\nBushwookiee07 20 points 5 days ago It’s the ones that voted for the other blue guy. They move to Montana too. They’ve been shitting up our state since 2020. permalink parent award report block reply\nRememberCharlieKirk 4 points 5 days ago Shades of blue: These potential movers could think of themselves as left-center, whatever that label means anymore. They could be supporters of Andrew \"how am I not in prison after purposefully leading NY grandparents to their deaths?\" Cuomo. Perhaps, even they think handing NYC to an unemployable, Karl Marx quoting, economically illiterate bum is a recipe for disaster. permalink parent award report block reply guywholikesDjtof2024 2 points 5 days ago Your name is MEGA BASED!!!! Stick around! Is Jesus God? permalink parent award report block reply RememberCharlieKirk 1 points 4 days ago Thank you. Yes. Originally, I thought that you were being facetious; I read your comment as mockery, as opposed to sincere. However, your second, most latest comment has proved otherwise. permalink parent award report block reply view 3 more comments... MisterMAGA 1 points 5 days ago Or it’s the conservatives. There are millions there you know. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nguywholikesDjtof2024 2 points 5 days ago Your name is MEGA BASED!!!! Stick around! Is Jesus God? permalink parent award report block reply RememberCharlieKirk 1 points 4 days ago Thank you. Yes. Originally, I thought that you were being facetious; I read your comment as mockery, as opposed to sincere. However, your second, most latest comment has proved otherwise. permalink parent award report block reply view 3 more comments...\nRememberCharlieKirk 1 points 4 days ago Thank you. Yes. Originally, I thought that you were being facetious; I read your comment as mockery, as opposed to sincere. However, your second, most latest comment has proved otherwise. permalink parent award report block reply view 3 more comments...\nMisterMAGA 1 points 5 days ago Or it’s the conservatives. There are millions there you know. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nRememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nNibba2 3 points 5 days ago You must be unfamiliar with California, rabbi. permalink parent award report block reply MisterMAGA 1 points 5 days ago Yep. I’m only familiar with Texas where I live, and the vast majority of people I know who lived here from CA or NY in last 5nywars have been conservatives. permalink parent award report block reply\nMisterMAGA 1 points 5 days ago Yep. I’m only familiar with Texas where I live, and the vast majority of people I know who lived here from CA or NY in last 5nywars have been conservatives. permalink parent award report block reply\nsnoopy3210 4 points 5 days ago No the republicans in NY were the first to go to florida, and now the independents and the former democrats registered Republicans. Not bad. permalink parent award report block reply DeplorachuIChooseYou 4 points 5 days ago I just don't see it. especially when you look at CO, NM, NJ, and WA. Even if that is true, It's a ripple effect. those locusts will destroy that state so far that even the socialites will flee. Look at areas in Texas now. Look at Montana apparently becoming a hotspot for Californians, and what Idaho could become. permalink parent award report block reply BidensBodyDouble 2 points 5 days ago The state keeps getting more red. My county was reliably blue. Same with the neighboring. Both are purple now and lean red. There's some shitty local politics where dems win but that's more a result of Rs not getting involved in local politics. The fucking fear mongering is insane. As someone who's been here 15 years I've watched it turn. permalink parent award report block reply SarsourCuntReturns 1 points 5 days ago Can confirm about NM. A lot of people who moved from CA to NM stayed voting blue because they're retarded. permalink parent award report block reply\nDeplorachuIChooseYou 4 points 5 days ago I just don't see it. especially when you look at CO, NM, NJ, and WA. Even if that is true, It's a ripple effect. those locusts will destroy that state so far that even the socialites will flee. Look at areas in Texas now. Look at Montana apparently becoming a hotspot for Californians, and what Idaho could become. permalink parent award report block reply BidensBodyDouble 2 points 5 days ago The state keeps getting more red. My county was reliably blue. Same with the neighboring. Both are purple now and lean red. There's some shitty local politics where dems win but that's more a result of Rs not getting involved in local politics. The fucking fear mongering is insane. As someone who's been here 15 years I've watched it turn. permalink parent award report block reply SarsourCuntReturns 1 points 5 days ago Can confirm about NM. A lot of people who moved from CA to NM stayed voting blue because they're retarded. permalink parent award report block reply\nBidensBodyDouble 2 points 5 days ago The state keeps getting more red. My county was reliably blue. Same with the neighboring. Both are purple now and lean red. There's some shitty local politics where dems win but that's more a result of Rs not getting involved in local politics. The fucking fear mongering is insane. As someone who's been here 15 years I've watched it turn. permalink parent award report block reply\nSarsourCuntReturns 1 points 5 days ago Can confirm about NM. A lot of people who moved from CA to NM stayed voting blue because they're retarded. permalink parent award report block reply\nGovtizbad 4 points 5 days ago Build the Florida wall edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply KernalMustard 2 points 5 days ago Hi Ballots. permalink parent award report block reply\nKernalMustard 2 points 5 days ago Hi Ballots. permalink parent award report block reply\nThe_Emperor 1 points 5 days ago Not liberals.  Outnumbered normal people permalink parent award report block reply\nGainesvilleFlorida 1 points 5 days ago They think they are conservative but then they’ll want gun laws and believe trans are legit. permalink parent award report block reply\nRedFoxOnFire 20 points 5 days ago Don't New York my Florida. permalink award report block reply MAGAPlenty 3 points 5 days ago Maybe our open carry laws will scare them off permalink parent award report block reply StCharlie 2 points 5 days ago Continue to convert them.  They must be willing to accept that selfishness is ok, individualism is ok, financial savers will progress into financial freedom, build as many skillsets as you can, then save the world.  Your money is no one elses but your own, unless you choose to give it freely and it should be to someone deserving.  The money and property of others is not yours to give away. permalink parent award report block reply Paydro 0 points 5 days ago Dont worry, the faggots who leave NY cause of politics arent coming to FL to vote blue. We're in a suburb of Orlando and I'd say 90% of our neighbors are Christian and Republican. Every teacher our kids have had in public school so far (4  kids) has been a Christian and regular church goer. This is America permalink parent award report block reply\nMAGAPlenty 3 points 5 days ago Maybe our open carry laws will scare them off permalink parent award report block reply\nStCharlie 2 points 5 days ago Continue to convert them.  They must be willing to accept that selfishness is ok, individualism is ok, financial savers will progress into financial freedom, build as many skillsets as you can, then save the world.  Your money is no one elses but your own, unless you choose to give it freely and it should be to someone deserving.  The money and property of others is not yours to give away. permalink parent award report block reply\nPaydro 0 points 5 days ago Dont worry, the faggots who leave NY cause of politics arent coming to FL to vote blue. We're in a suburb of Orlando and I'd say 90% of our neighbors are Christian and Republican. Every teacher our kids have had in public school so far (4  kids) has been a Christian and regular church goer. This is America permalink parent award report block reply\nblueeyephoto 15 points 5 days ago we already have limited housing and skyhigh rents... NYC people need to STAY in NYC and not come here bringing their liberal voting with them permalink award report block reply\nERIC_CIARAMELLA 10 points 5 days ago Still shouldn't be paying more than 100k for a 1500 square foot home. Sorry. permalink award report block reply TrumpAndGodWin 3 points 5 days ago E.g. a boomer I know in Florida paid around 70k for that and now it's worth over 400k. permalink parent award report block reply ERIC_CIARAMELLA 4 points 5 days ago Exactly. Paid 128k for a property with my bitch ass ex wife when things were good.  It is worth 450k now.  We sold it for 138k in our divorce at that point in time. Fuck this shit man. permalink parent award report block reply BidensBodyDouble 2 points 5 days ago Been to a Home Depot lately? Can't do shit for 100k let alone build a house. If you wanna talk land values being ridiculous sure - but putting up any structure is fucking expensive. permalink parent award report block reply ERIC_CIARAMELLA 2 points 5 days ago Indeed. permalink parent award report block reply NADSAQ 1 points 5 days ago try 650k permalink parent award report block reply\nTrumpAndGodWin 3 points 5 days ago E.g. a boomer I know in Florida paid around 70k for that and now it's worth over 400k. permalink parent award report block reply ERIC_CIARAMELLA 4 points 5 days ago Exactly. Paid 128k for a property with my bitch ass ex wife when things were good.  It is worth 450k now.  We sold it for 138k in our divorce at that point in time. Fuck this shit man. permalink parent award report block reply\nERIC_CIARAMELLA 4 points 5 days ago Exactly. Paid 128k for a property with my bitch ass ex wife when things were good.  It is worth 450k now.  We sold it for 138k in our divorce at that point in time. Fuck this shit man. permalink parent award report block reply\nBidensBodyDouble 2 points 5 days ago Been to a Home Depot lately? Can't do shit for 100k let alone build a house. If you wanna talk land values being ridiculous sure - but putting up any structure is fucking expensive. permalink parent award report block reply ERIC_CIARAMELLA 2 points 5 days ago Indeed. permalink parent award report block reply\nERIC_CIARAMELLA 2 points 5 days ago Indeed. permalink parent award report block reply\nNADSAQ 1 points 5 days ago try 650k permalink parent award report block reply\ndeleted 10 points 5 days ago BidensBodyDouble 3 points 5 days ago Housing prices have been dropping for the last year. And unlikely these people end up anywhere north of Boca/Jupiter. More likely - they leave after their first hurricane. All those SoFL transplants from covid still haven't really had to go through one. I suspect a mass exodus if/when it happens. SWFL saw this happen after covid migration. permalink parent award report block reply jimboonie 5 points 5 days ago Narrator: “They didn’t leave…” permalink parent award report block reply bull_in_a_china_shop 1 points 4 days ago Recently on Lotus Eaters I heard them discussing some British politician in the 1960s who was saying something to the effect of \"the windrushers will leave after their first winter.\" permalink parent award report block reply 420praiseit894 1 points 5 days ago Housing prices are dropping in areas where the federal government was handing out checks to illegals. Housing prices in other areas aren't necessarily going to follow suit. permalink parent award report block reply BidensBodyDouble 1 points 4 days ago Yea I agree that's prolly a factor but it's more likely the FHA loans that were getting bailed out by the Biden admin. For about the last 2 yrs of Biden they were paying people's mortgages to not cause a housing crash. FL had something like 3 cities who were in the top 5 recipients on that list. permalink parent award report block reply MudDog 1 points 5 days ago now?! permalink parent award report block reply\nBidensBodyDouble 3 points 5 days ago Housing prices have been dropping for the last year. And unlikely these people end up anywhere north of Boca/Jupiter. More likely - they leave after their first hurricane. All those SoFL transplants from covid still haven't really had to go through one. I suspect a mass exodus if/when it happens. SWFL saw this happen after covid migration. permalink parent award report block reply jimboonie 5 points 5 days ago Narrator: “They didn’t leave…” permalink parent award report block reply bull_in_a_china_shop 1 points 4 days ago Recently on Lotus Eaters I heard them discussing some British politician in the 1960s who was saying something to the effect of \"the windrushers will leave after their first winter.\" permalink parent award report block reply 420praiseit894 1 points 5 days ago Housing prices are dropping in areas where the federal government was handing out checks to illegals. Housing prices in other areas aren't necessarily going to follow suit. permalink parent award report block reply BidensBodyDouble 1 points 4 days ago Yea I agree that's prolly a factor but it's more likely the FHA loans that were getting bailed out by the Biden admin. For about the last 2 yrs of Biden they were paying people's mortgages to not cause a housing crash. FL had something like 3 cities who were in the top 5 recipients on that list. permalink parent award report block reply\njimboonie 5 points 5 days ago Narrator: “They didn’t leave…” permalink parent award report block reply\nbull_in_a_china_shop 1 points 4 days ago Recently on Lotus Eaters I heard them discussing some British politician in the 1960s who was saying something to the effect of \"the windrushers will leave after their first winter.\" permalink parent award report block reply\n420praiseit894 1 points 5 days ago Housing prices are dropping in areas where the federal government was handing out checks to illegals. Housing prices in other areas aren't necessarily going to follow suit. permalink parent award report block reply BidensBodyDouble 1 points 4 days ago Yea I agree that's prolly a factor but it's more likely the FHA loans that were getting bailed out by the Biden admin. For about the last 2 yrs of Biden they were paying people's mortgages to not cause a housing crash. FL had something like 3 cities who were in the top 5 recipients on that list. permalink parent award report block reply\nBidensBodyDouble 1 points 4 days ago Yea I agree that's prolly a factor but it's more likely the FHA loans that were getting bailed out by the Biden admin. For about the last 2 yrs of Biden they were paying people's mortgages to not cause a housing crash. FL had something like 3 cities who were in the top 5 recipients on that list. permalink parent award report block reply\nMudDog 1 points 5 days ago now?! permalink parent award report block reply\nGreenhills 9 points 5 days ago All the CEOs will work from billionaires bunker while their employees are required to be onsite five days a week at the Babylonian buildings they left behind permalink award report block reply\nJackLemon 7 points 5 days ago That was the psy-ops. We already have too many libtard foids moving to red states. Between them and the illegal aliens they believe they can flip red states to blue.\nAnyone moving in from Libtardia should be banned from voting in red states for at least ten years. permalink award report block reply\nYodaBannon 7 points 5 days ago Cuomo: 854,995\nZohran: 1,036,051 NY Dems are at war with each other, TRUMP is gonna toy with the clown, as a New Yorker I will be happy watching this all unfold, Stefanik 26, MAGA permalink award report block reply Stanwyk74 4 points 5 days ago Add in the other joker and it is dead even permalink parent award report block reply Govtizbad 0 points 5 days ago Yeah let's destroy our country so that we can laugh at Democrats! permalink parent award report block reply Krat 3 points 5 days ago Its already destroyed bubs permalink parent award report block reply YodaBannon 2 points 5 days ago he will be a 1 term dumpster fire permalink parent award report block reply\nStanwyk74 4 points 5 days ago Add in the other joker and it is dead even permalink parent award report block reply\nGovtizbad 0 points 5 days ago Yeah let's destroy our country so that we can laugh at Democrats! permalink parent award report block reply Krat 3 points 5 days ago Its already destroyed bubs permalink parent award report block reply YodaBannon 2 points 5 days ago he will be a 1 term dumpster fire permalink parent award report block reply\nKrat 3 points 5 days ago Its already destroyed bubs permalink parent award report block reply\nYodaBannon 2 points 5 days ago he will be a 1 term dumpster fire permalink parent award report block reply\nBadfinz_FL 5 points 5 days ago Florida is full permalink award report block reply\nterribletwos 4 points 5 days ago There's still like 2.5 million republicans in nyc, so the people fleeing are probably just as much if not more republican. In theory we should all be moving to republican states to consolidate. Since there's a high probability that this might be how groups are aligned in the future. permalink award report block reply\nflorida_man123 4 points 5 days ago I fucking hate yankees. permalink award report block reply Ryan282 3 points 5 days ago As a born and raised Floridian, I agree, 100%. permalink parent award report block reply\nRyan282 3 points 5 days ago As a born and raised Floridian, I agree, 100%. permalink parent award report block reply\nJustjayce 4 points 5 days ago Poor babies.. Most probably didn't vote Go fuck yourself permalink award report block reply\nStanwyk74 4 points 5 days ago Fuck these assholes permalink award report block reply\nChoppermagic 4 points 5 days ago DeSantis is trying to remove property tax too. That would be awesome permalink award report block reply\nMegoThor 4 points 5 days ago Keep Northern locusts out of Florida! permalink award report block reply\nrockaustin 4 points 5 days ago I live in CT and don’t want them here either. This state is blue enough and I don’t like the way New Yorkers drive. permalink award report block reply\nDeltamyass 4 points 5 days ago Florida should tell them to fuck off. They wanted for the cancer that brought more cancer in. Sit there and enjoy what you brought in. permalink award report block reply\nCommanderComadant 4 points 5 days ago I’m in Texas and I want to move to Florida. Texas is already overrun. Florida still has 10-15 years lol. permalink award report block reply captainmundane 2 points 5 days ago There is no room. permalink parent award report block reply Ryan282 2 points 5 days ago Come on over! permalink parent award report block reply\ncaptainmundane 2 points 5 days ago There is no room. permalink parent award report block reply\nRyan282 2 points 5 days ago Come on over! permalink parent award report block reply\njml1997 3 points 5 days ago Florida is full, go to Comifornia. permalink award report block reply\ngenericamerican69 3 points 5 days ago It's funny how our side just flees the areas that the globos take over and think it's a win somehow. This is literally what they want and what leads to them conquering an area and getting their one party rule. Injecting their 3rd world parasites into your major metropolitan area is the perfect way to get you to leave. Remember that california was once completely red. permalink award report block reply\nACActual 3 points 5 days ago Previous New Yorkers should be forced to take purity tests.  Social media inspections, etc.  FAFO permalink award report block reply\nIAmDisappoint 3 points 5 days ago Great, they are going to bring their voting habits to FL now and make FL the new NY. Just like CA transplants did to WA. permalink award report block reply\nbehemoth887 3 points 5 days ago the virus of lib begins to spread permalink award report block reply\nMrCrispy 3 points 5 days ago Fuck. Stay away from Florida you locusts. Trust me, you’ll hate it here. We’ve got horrible weather and roaches the size of chicken tenders and they can fly. You don’t want that. permalink award report block reply\nBuSpocky 3 points 5 days ago Stay. The fuck. Out. permalink award report block reply\nsnoozeflu 3 points 5 days ago Elect a commie. Move to Florida & continue to vote blue. Elect another commie. Wash, dry, rinse, spin, repeat. permalink award report block reply\nShitsbrokeyo 3 points 5 days ago The bottom is going to fall out of NY market permalink award report block reply\nBldg_2019 3 points 5 days ago Blue state Flahraduh incoming once again. permalink award report block reply\nnebula72 2 points 5 days ago Bad news for Florida. They will just vote for the same assholes that ruined their State.  Worse than cancer. permalink award report block reply\nNonbinaryPotatohead 2 points 5 days ago Why do these people have only 2 options in their head?\nI'll let you all answer that. permalink award report block reply\nShadowInv 2 points 5 days ago Nooo permalink award report block reply\nGenericwhitemale 2 points 5 days ago The Bee already called it permalink award report block reply\nS810 2 points 5 days ago that's what florida needed, HIGHER real estate prices permalink award report block reply\nN3G4T1V3 2 points 5 days ago He won't be running much.  He's the front man.  It'll be as bad as they might think, and worse.  Another infiltrator puppet. permalink award report block reply\nOTher55 2 points 5 days ago A lot of Miami residents have fled there from socialist and communist governments such as Cuba, Venezuela, and Nicaragua. They'll fit right in. permalink award report block reply\nMyNameIsTaxpayer 2 points 5 days ago They should only be allowed to buy homes on MLK named roads permalink award report block reply RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nRememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\npedewithweed 2 points 5 days ago Haiyaaa 😭 permalink award report block reply\nRock9Head 2 points 5 days ago Didn’t they all just vote for communism? permalink award report block reply\nRhodesianRidgeback 2 points 5 days ago Jewrida permalink award report block reply\nPatriotSkorzeny 2 points 5 days ago How many flights have actually departed Alligator Alcatraz? Bring back daily stats. Daily Morning Reports. We deserve to know. permalink award report block reply\nEddieAteTheEmu 2 points 5 days ago We don't want them, let them figure it out and turn out to vote next time! permalink award report block reply\nhilboggins 2 points 5 days ago Band immigration to Florida. Ok off! permalink award report block reply\nScumbag-reddit 2 points 5 days ago Mother fuckers stay the fuck away, we're full. permalink award report block reply\nThegman 2 points 5 days ago But muh accelerationism. permalink award report block reply\nShotgunParade69x 2 points 5 days ago Why would libs move from there? permalink award report block reply\npedeypete 2 points 4 days ago A real estate friend is doing whatever he needs to do to work in New York, said the amount of calls he's gotten from clients asking for help moving friends and family out has been through the roof! Good, hard working Americans. To be replaced by goat fuckers. permalink award report block reply\nragnarokrobo 2 points 5 days ago Yankee go home. Or stay home rather. permalink award report block reply\nphilnmdg 1 points 4 days ago No, you don't want to go to Florida, go to California. You created that mess in NY, don't bring it to Florida. Did you vote in this recent election? permalink award report block reply\nknnbccb 1 points 5 days ago Trump had the foresight to leave that shithole years ago. permalink award report block reply\nbarryb0nds 1 points 5 days ago I expect to see NYC go the way of Detroit in my lifetime. You can't be hostile to the tiny percentage of people who pay half of the income tax in NYC and expect it to go well. permalink award report block reply\nBasedMillennial 1 points 5 days ago DeSantis should continue with the plan to eliminate property taxes, except for new residents coming from out of state. permalink award report block reply\nAppalachianTactical 1 points 5 days ago Sure they are.\nMamdani was installed to scare the right back into the arms of Israel. Dudes in pictures wearing fucking yarmulkes. Gay muslim dude with a beard wife wearing a yarmulke and taking soros money. permalink award report block reply\nHenkZeilstra 1 points 4 days ago Dont let that cancer in permalink award report block reply\nZytos 1 points 5 days ago Long Island suburbs of NYC are doing just fine. permalink award report block reply\nDrVSGGEOTUSPhD 1 points 5 days ago Did Florida real-estate ever not surge in recent years? permalink award report block reply\nNomad899 1 points 5 days ago Is that his hooker beard next to him or a niece? permalink award report block reply\ngezadreamsheets2 1 points 5 days ago Free, free, free permalink award report block reply\npatrioticwinning3 1 points 5 days ago His wife is ugly :p permalink award report block reply\nauntjemima 1 points 5 days ago poor florida.... permalink award report block reply\nstillbringingitback 1 points 5 days ago Can someone plz explain to me where the fuck this guys campaign/persona/eligibility came from?  Like what about this guy is just so amazing that differentiates him from any other retard that could take his place and say the same stupid stuff? permalink award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply"
}