{
  "id": "1ARK9nQBI8",
  "url": "https://patriots.win/p/1ARK9nQBI8/yeah-no-shit-latest-epstein-emai/c",
  "content": "871 Yeah, no shit. Latest Epstein Emails About Trump Appear To Be Just Another Misleading Democrat Info Op (thefederalist.com) posted 3 hours ago by Sea_Still 199 comments award share report block Latest Epstein Emails About Trump Appear To Be Another Dem Op Democrats appear to be obviously hiding exculpatory information about Trump in another media-spread smear campaign. thefederalist.com\n199 comments Sort by Top Top New Worst Old Save spezisacuckold 93 points 3 hours ago This is true. President Trump should also release the Epstein list. permalink award report block reply Simple_Doot 32 points 3 hours ago There is nothing worth protecting that makes keeping them sealed worth continuing.  It literally does not matter what happens to who if released and the only way forward is to disclose it all.  Zero alternative ways forward. permalink parent award report block reply AlohaChris 42 points 3 hours ago Epstein and Maxwell sexually trafficked children to…nobody permalink parent award report block reply ParmesanCartel 21 points 3 hours ago Weird how she met with trumps personal lawyer and was then moved to a more luxurious correctional facility permalink parent award report block reply KrakenWakin4JoeBacon 15 points 2 hours ago Horrible look & feel to reading that Maxwell is “much happier now” that she’s been moved to a different facility. Some victims claim she was a bigger psychopath & more cruel than Epstein. It’s also messed up that all of the male pedos involved are getting a pass, as if Maxwell’s sentence fully represents justice. permalink parent award report block reply view 3 more comments... KernalMustard 1 points 2 hours ago Wouldnt any approval have to go through Bondi? permalink parent award report block reply hansgruber7 1 points 28 minutes ago Joined 92 days ago. permalink parent award report block reply Rudy_DankMemer 3 points 53 minutes ago Epstein and Maxwell sexually trafficked children to…nobody INB4 faggots and shills run in to shout that \"Epstein never mixed business with pleasure\" and my favorite one: \"G-Max was convicted of supplying girls to ONLY Eggstein hur dur\" permalink parent award report block reply Klaus73 1 points 5 minutes ago Aye...Andrew lost his title purely due to random lotto draw...or something. permalink parent award report block reply LabTech 7 points 2 hours ago I've always conjectured that the reason he held onto them was to have leverage against the Elites that ARE on it, in order to make them do the things he wants them to do to further his agenda. I guess we'll know if that's the case if he does release them, and then he automatically starts getting problems from certain high-power groups.  Releasing the files might add some speedbumps to Trump's agenda. They probably should get released, but if they are being used as leverage, we may get a slowdown on other items. permalink parent award report block reply the-new-style 5 points 2 hours ago So why isn't it working? permalink parent award report block reply fat50 3 points 2 hours ago Exactly. They're fighting him every step of the way. permalink parent award report block reply LabTech 2 points 2 hours ago To continue the speculation... how would you know if it wasn't? All of this stuff is happening in the background, and I suspect the whole point would be to make it invisible.  We'll only know it was in effect if there's a sudden uptick in interference in the America First agenda after the release; that difference would've been from the people who were under duress. permalink parent award report block reply view 7 more comments... Millie1234 2 points 56 minutes ago Those elites can't be left in place, even to do Trump's bidding. Once he's gone, they'll carry on. permalink parent award report block reply LabTech 1 points 29 minutes ago I'm not saying they should, I'm just assuming Trump has a plan, because he obviously knows more than any of us. One would imagine the leverage is short-term, and once he figured he can do an end around and expose them after that point, he will. permalink parent award report block reply cchris_39 0 points 1 hour ago Exactly.  This requires people to have intelligence based on more than their fee fees so no liberal will ever understand or believe it. permalink parent award report block reply LabTech 2 points 25 minutes ago The problem is that society's been groomed for immediate impulse satisfaction, so few people can grasp delayed gratification. If it takes Trump 6 months to unfurl a scheme to get one item or another on the agenda accomplished, the doomers on this site and elsewhere make like he's somehow caved. These people are also apparently unaware of the fact that Trump MUST drain the Swamp by the time his term is over, because if one of their creatures gets into office after him, him and his entire bloodline as well as friends/associates are FUCKED... because it'll be constant lawfare and violence until the end of their days.  Trump MUST smash this machine, out of purely self-preservation reasons. permalink parent award report block reply DefinitelyNotFed 14 points 3 hours ago This would give him back the support of the people but he would lose most of his big donors. Pretty obvious which he values more. permalink parent award report block reply ParmesanCartel 12 points 3 hours ago Big time. Anything short of flipping the table won't save the support of the people now. But he's gone full retard unfortunately. He toasted the midterms. permalink parent award report block reply RememberCharlieKirk 10 points 2 hours ago And what a terrible choice he has made! President Trump already won re-election. He does not require donors for any future election, unless he is hoping for funding for his children's political careers or joint business endeavors. As for Congressional elections, the senators and representatives are hardly aligned with President Trump's agenda (filibuster?), so why should he need to sacrifice his soul for those politicians. permalink parent award report block reply UsernameChexOut 5 points 2 hours ago But that's why I think this goes beyond just the donors. There's gotta be something bigger in play here. I'm not a legal scholar here but I imagine it's not going to be a pretty situation if it turns out that another \"ally\" of ours is blackmailing and controlling our government. I'm not saying that that's 100% the case, but I imagine that if with all the backlash Trump is still protecting the files, there's gotta be some really insidious shit in there. permalink parent award report block reply hansgruber7 0 points 26 minutes ago Joined 6 days ago. permalink parent award report block reply GlorpLorp 1 points 18 minutes ago Brother shut the fuck up about account age. These are valid questions and statements. permalink parent award report block reply Dangerous 6 points 2 hours ago And his big donors are all anti-MAGA parasites, either from the Tech sector that was virulently anti Trump before 2023 or connected to AIPAC/Israel who have a history of backing Trump challengers. permalink parent award report block reply flashersenpai 0 points 1 hour ago People should look into the 3 big donors spending millions trying to unseat Thomas Massie if they haven't already. They fit this description perfectly. permalink parent award report block reply UsernameChexOut 3 points 2 hours ago He would lose his big donors and big nose donors as well permalink parent award report block reply try4gain PRO 14 points 3 hours ago Epstein Files are the new JFK files permalink parent award report block reply hansgruber7 4 points 2 hours ago Why does anyone think the Democrats left an incriminating Epstein list for Trump to find?  Anyone who believes that is a naive retard. permalink parent award report block reply ravonaf 5 points 2 hours ago There is no list, there never was a list. What they have are people scatter throughout reams of evidence who were targeted by the Intelligent Agencies via Epstein. There are LOTS of innocent people who did nothing wrong. As well as people who did, I'm sure. But there is no way to separate the 2 without dragging innocent people through the mud. Why should anyone have their lives ruined because they were targeted by Deep State Intelligent Agencies? permalink parent award report block reply flashersenpai 0 points 1 hour ago RFK explicitly said yes he was on Epstein's plane, said what the circumstances were and said release the files. Anyone who can't do that has something to hide. Fuck them. permalink parent award report block reply flashersenpai -1 points 1 hour ago Epstein has been around the globe mediating intel/security deals between Israel and various shithole countries. The Deep State cares more about exposure than about child safety. That's what I think is the reason for hiding the files. permalink parent award report block reply booblitchutz 1 points 2 hours ago Not that I know for sure, but I strongly suspect that Trump not releasing the Epstein list is the only way he can ever get ANYTHING through the senate for the next 3 years. permalink parent award report block reply load 3 more comments... nakedjay 49 points 3 hours ago It's all Dems have, projection and disinformation. permalink award report block reply Pied-Trumper 14 points 3 hours ago Glad that’s settled. Now let’s get back to giving H1Bs citizenship, let illegals working at hotels continue doing their jobs, import all the Chinese to compete with our students, and give our children 50-year mortgages and 15-year car loans. There’s now affordability crisis! Things are amazing! Waarrrrr, we need waaarr! permalink parent award report block reply flashersenpai 3 points 1 hour ago They wouldn't have this disinfo option if the files were released. permalink parent award report block reply leakmouth 2 points 2 hours ago The best thing about fake news is watching the libtards get their hopes up over and over again and then watching those hopes get destroyed every single time permalink parent award report block reply TrumpTurd69 -2 points 3 hours ago Comment removed upon the user being banned. permalink parent award report block reply Than0sIII 38 points 3 hours ago If they truly had anything it would've been 2024's October surprise, if not used sooner to indict Trump on conspiracy/aiding sex trafficking. permalink award report block reply ChrisSuperDude 19 points 3 hours ago My whole thing is that they would’ve used it in 2015-2016 when he was first getting momentum. Or even in 2020 after Epstein died and was in the news cycle. permalink parent award report block reply BidensBodyDouble 4 points 2 hours ago And you can tell in those emails with Wolff that that plan was on the table for them too permalink parent award report block reply Ostia 1 points 3 hours ago Not if their big names are in it too. permalink parent award report block reply Dangerous 10 points 2 hours ago They have selectively released information before. That's all they had to do, block out anything not related to Trump and quash all attempts at further unsealings This line of argument has always been faulty permalink parent award report block reply Than0sIII 1 points 58 minutes ago Exactly.  I don't get why people are pretending there's some world where they wouldn't selectively pull out damning pieces of evidence against Trump.  People don't really want to think, they just want to have their biases confirmed. permalink parent award report block reply Ostia -3 points 2 hours ago Then why haven't we released the parts pertaining to them? I'm mean, by the same token, if Clinton, Roberts, and half of the democrat congress is in there, why haven't we used it? I mean, if they're just selectively leaving all the incriminating stuff about themselves out? permalink parent award report block reply emorphia 4 points 2 hours ago and i bet they are.  but we will never find out sadly. permalink parent award report block reply Aquamine-Amarine 1 points 2 hours ago All they had was the pussy tape. That's it. permalink parent award report block reply Goodgoodygoodgood 1 points 2 hours ago I have a theory they didn’t release them because they have just as much to lose. I expect them to have more to lose permalink parent award report block reply JDVance4President28 27 points 3 hours ago Trump's response to the Epstein stuff was very suspicious tho permalink award report block reply Simple_Doot 19 points 3 hours ago Definitely.  If he is not playing some crazy \"5D\" chess Q plan then he has failed us completely.  And if he IS playing some 5D chess then he is intentionally saying the stupidest shit possible which justifies our outrage.  So being pissed about it is the correct way to be. permalink parent award report block reply Area82 9 points 3 hours ago Heard on a couple of podcasts lately that Epstein's main gig was money laundering and arms deals for various gubmints since the 80s.   I wonder if that is true? permalink parent award report block reply flashersenpai 1 points 1 hour ago Epstein was mediating surveillance state deals between Israel and Cote de'Ivore. I'd be more surprised if he wasn't a money laundering govt asset. permalink parent award report block reply PhoneBandit 1 points 1 hour ago It definitely seems like the case as his account is still seeing transactions apparently. I read that Trump was also a money launderer for the feds and that's why he was aware of Epstein's sex business. They have leverage on him just like Epstein which is why he's playing ball. permalink parent award report block reply LordKuroTheGreat 7 points 2 hours ago The whole operation looks very Mossad, so hopefully it's just that he can't bear to call out Israel for once. Either way, he couldn't have handled the situation worse if he tried. permalink parent award report block reply sorrytodisagree 5 points 3 hours ago He wouldn't spend years campaigning for their release to his own detriment.  The only thing that makes any sense is they've been deliberately spoiled while SDNY had them.  Seeded with manufactured falsehoods as a poison chalice.  Proving the tampering won't convince doubters and makes all the rest suspect and inadmissible.  Withholding the fakes is easily exposed by the perpetrators as a \"coverup worse than the crime\" Watergate scenario.  For them better than deleting it all.  simply destroying the evidence incriminates themselves and they can't be sure copies won't surface.  This way releasing it is a lose/lose, eliminates it's criminal evidence and political value, but maintains it's blackmail value for intelligence agencies. permalink parent award report block reply JDVance4President28 11 points 3 hours ago Well then arrest those responsible for the corruption. Surly the full weight of the DOJ could sort it out. The most sophisticated spying apparatus in human history isn't useless here unless it's intentional. permalink parent award report block reply sorrytodisagree 3 points 2 hours ago Nobody said it wasn't an intentional act by deep stater's in that DOJ and spying apparatus.  Even if they screwed up and you can prove their tampering the fakes come out and are believed by democrats and idiots anyway. permalink parent award report block reply Ostia 6 points 2 hours ago He wouldn't spend years campaigning for their release to his own detriment. He never campaigned on their release. We just projected what we wanted to hear on to someone who was never saying it. permalink parent award report block reply rebuildingMyself 3 points 2 hours ago He did say he would release it when baited by a reporter in an interview, but yes it wasn't some big action item in the campaign that I can recall permalink parent award report block reply Ostia 2 points 2 hours ago Once, after this election, and then waffled on that answer even after saying, yes I guess so. permalink parent award report block reply AuAgCuPb 0 points 2 hours ago All I ever remember him saying when asked about \"releasing the Epstein files\" if he became president was, \"We'll look into it.\"\nWell, they DID look into it, and guess what?  they decided to not release them.  So he DID fulfill his campaign promise of \"looking into it\".  😆 permalink parent award report block reply ImClearlyLost 2 points 2 hours ago Trump never spent years campaigning for their release.  He only reluctantly answered once he was directly asked, he never brought it up on his own volition ever. permalink parent award report block reply sorrytodisagree 1 points 2 hours ago And he did his best to put Epstein behind bars years before he ran for President.  Not something you do if somebody had files on you to present at trial... https://x.com/rawsalerts/status/1964068279292399961 https://dailycaller.com/2024/01/02/brad-edwards-jeffrey-epstein-victim-attorney-donald-trump-mar-a-lago/ permalink parent award report block reply Corse46 3 points 3 hours ago So true, unfortunately permalink parent award report block reply load 3 more comments... LostElf 20 points 3 hours ago Good GOD. If they had anything it would've been all over the place ages ago. permalink award report block reply Corse46 9 points 3 hours ago I agree. But that doesn’t answer why the President is running an Epstein pedophilia coverup permalink parent award report block reply Oldman1945 11 points 2 hours ago He should have released all files the morning after Epstein was found dead. All of this should have been released in Trump’s first term, at that exact moment. Saving it to win the election is fine, but not if that promise is broken. Release all files!! permalink parent award report block reply JanOctSept 1 points 2 hours ago In all fairness the Hillary emails about Russiagate in the Turducken safe existed under Trump too, meaning I don’t think the FBI was particularly loyal to him. permalink parent award report block reply MakeCaliforniaRED 1 points 1 hour ago It still isn’t. permalink parent award report block reply referencevariable 2 points 2 hours ago Because a deal was made in return for assistance getting his agenda accomplished. See here: https://patriots.win/p/19BZphlAOd/unfortunately-a-deal-was-made/c permalink parent award report block reply LostElf 1 points 3 hours ago The files are likely infested with false information targeting innocent people. That's what happens when an investigation is so thoroughly corrupted. permalink parent award report block reply flashersenpai 2 points 59 minutes ago the surest way to expose false information is to allow the internet to fact check it we got podesta's emails and we should get the epstein files too permalink parent award report block reply KernalMustard 1 points 27 minutes ago So if you were guilty wouldn't you declare its all false. Use your head people. The left doesnt use it because whats left would also take down their house of cards. Its  MAD files. permalink parent award report block reply TennesseeBorn 0 points 1 hour ago They 100 percent poisoned them. Why wouldn't they? permalink parent award report block reply KekistaniMemeLord 0 points 2 hours ago extremely dishonest framing. Literally no one here knows what is going on with the Epstein case and investigation atm. Immediately assuming Trump is running cover for pedo's or trying to protect them is some MSM scumbag level shit. permalink parent award report block reply emorphia 2 points 2 hours ago it does not matter if any of it is real , the left will gobble up anything the dems say about Trump.  they say it so it is true for them. permalink parent award report block reply Ostia 1 points 2 hours ago Not if their big names are in it too. Mutually assured destruction is a very real and viable tactic for blackmail and control. permalink parent award report block reply sorrytodisagree 2 points 2 hours ago And when people are brainwashed into thinking the worst about Trump and ignoring his history all they need to do is fake the other sides big names in the files if need be.  Fake dossiers have proven enough to impeach as far as democrats are concerned. permalink parent award report block reply Ostia -2 points 2 hours ago Son, stop sending me the damn huffington post and acting like it's proof the democrats are squeaky clean. I'm not a child that just swallows anything that tells me what I want to hear. I can think critically. If they were faking their names, then why haven't WE released it since we're so confident they're there? permalink parent award report block reply sorrytodisagree 1 points 2 hours ago You're literally the only one invoking huffington post and also pretending I'm defending democrats?  Retarded or just trying to spin? permalink parent award report block reply view 5 more comments... sorrytodisagree 1 points 2 hours ago Yep.  Trump is still president.  That is proof they had nothing but their fake persecutions to dissuade him from running again. permalink parent award report block reply EyesSewnShut 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply BidenSniffsLittleKid 16 points 3 hours ago Oh yeah? Release the Epstein files then permalink award report block reply sorrytodisagree -9 points 3 hours ago They've been spoiled.  Seeded with manufactured falsehoods as a poison chalice.  Proving the tampering won't convince doubters and makes all the rest suspect and inadmissible.  Withholding the fakes is easily exposed by the perpetrators as a \"coverup worse than the crime\" Watergate scenario. permalink parent award report block reply Corse46 9 points 3 hours ago How do you know? Did you read them before and after? permalink parent award report block reply bumpman 1 points 17 minutes ago Because we know the Biden officials are corrupt as all hell.. permalink parent award report block reply sorrytodisagree -4 points 3 hours ago Doesn't matter.  Fake is real and real is fake as far as democrats and idiots are concerned. I know Trump did not suddenly do a 180 because he woke up one day remembering he was in on it. permalink parent award report block reply Dangerous 2 points 2 hours ago fake is real and real is fake Always has been. You don't get to suggest that continuing this charade by hiding information suddenly changes things for the worse permalink parent award report block reply Ostia 0 points 2 hours ago He didn't do a 180. He's never really said anything at all about epstein short of trying to distance himself from him, ever. Even when he was murdered in prison under our watch. He's asking us to do a 180 because the issue has finally caught up to the times. permalink parent award report block reply view 2 more comments... Simple_Doot 2 points 3 hours ago This argument is absolutely unacceptable.  Release and let the chips fall where they may.  If all it takes to completely give up on an issue is the potential that someone has maybe lied about evidence then we will get buried faster and faster by more lies from our leaders.  Absurd! permalink parent award report block reply full_of_shot 2 points 3 hours ago My God, you'll believe anything Daddy Trump tells you. permalink parent award report block reply TrumpyMadeThemGrumpy -1 points 2 hours ago fuk off back to Reddit. permalink parent award report block reply ThorsonTT 16 points 3 hours ago The redacted VICTIM is Virginia Giuffre.  She has made statements that she never saw Trump do anything wrong.  The emails are complaining that Trump, basically, isn't falling into their trap. permalink award report block reply PhoneBandit 1 points 1 hour ago Yes. The only conclusion you can draw from this is that Trump knew of the sex business but was not making a huge stink over it. That doesn't implicate him to me. I'm sure there are hundreds of government officials aware of heinous crimes that they turn a blind eye to. permalink parent award report block reply ThorsonTT 2 points 1 hour ago I'd bet that so much evidence has been destroyed or polluted that not enough remains to give to a grand jury with any hope of a conviction. permalink parent award report block reply Kricket 12 points 3 hours ago If they had anything real, they would have burned him well before now. permalink award report block reply liberalshitlord -2 points 3 hours ago Him and Clinton kek, kek, kek permalink parent award report block reply guywholikesDjtof2024 9 points 3 hours ago But remember, QUESTION if a thing is real or fake. Never forget Charlie Kirk. permalink award report block reply Oldman1945 4 points 2 hours ago There were suspicious Google trends searches from Israel right before Charlie's murder. Had to be an Op. permalink parent award report block reply TrumpTurd69 -1 points 3 hours ago Comment removed upon the user being banned. permalink parent award report block reply shialecuck007 7 points 3 hours ago Democrats had all this information when they had their investigations subcommittee under Biden. Durbin himself had the flight logs and refused to release those under pressure.\nIF the Democrats had ANYTHING they would have thrown those cards out on the table long ago to burn Trump.\nIT'S A NOTHING BURGER! permalink award report block reply FusionBlack 7 points 3 hours ago They failed on the shutdown so they will throw anything aginst the wall. permalink award report block reply Mobmando 5 points 3 hours ago Did they though? I hear it's the biden agreement so conservatives won nothing, having not actually needed the votes.  They had the 51 required to make it happen. Also, my understanding is that the resolution is for 3 months only. permalink parent award report block reply lostmyoldpassword 6 points 3 hours ago Actual human being makes post critical of Trump - deleted almost instantly - 12 super organic threads no one gives a fuck about immediately pop up.  This shit is downright fascinating to watch. permalink award report block reply DT170x 10 points 3 hours ago I see alot of posts of users being critical of Trump and not be blocked or banned. Then again forum sliders is going to forum slide. permalink parent award report block reply doug2 4 points 3 hours ago Read the rules dude permalink parent award report block reply BidenSniffsLittleKid -6 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply DT170x -2 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply BidenSniffsLittleKid -3 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments... Kricket 8 points 3 hours ago This ain’t Reddit, champ. No one cares about your posts or stickies or upvotes or whatever other gay shit you’re on about. Rule 1: be here for Trump and MAGA or GTFO. permalink parent award report block reply AVeryNakedMan 3 points 3 hours ago be here for Trump and MAGA The problem is that lately Trump has been doing some non-MAGA things, like refusing to release the Epstein files, or defending H1B. permalink parent award report block reply flashersenpai 1 points 57 minutes ago agree \"and MAGA\" is the important part why would I be here, for example, if Trump signed the Super NFA to confiscate everyone's guns? permalink parent award report block reply lostmyoldpassword 2 points 3 hours ago Read the room - go talk to your fucking neighbors.  The winds have shifted, buck-o. permalink parent award report block reply markolbb 5 points 3 hours ago There always have been and always will be some people here who worship Trump more than they believe in MAGA. He could literally piss in their face and they would say it's based. I think that this is a fairly small percentage of users, probably half of the interactions I have are with legitimately thinking people who can use their brains and be rightfully critical of a man who is still a politician at the end of the day. Some people here are actually the cultists that the left thinks we all are, though. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago I started reading through his post history - and he's a self righteous douchebag anyway.  So everything checks out. permalink parent award report block reply KekistaniMemeLord 1 points 2 hours ago Reddit fag language detected. Nobody fucking \"worships\" him you moron. He has literally proven himself by fighting for MAGA for 10 damn years and almost getting killed for the effort. I don't see thoughtful critique of our president, I see the absolute dumbest fucks abandoning all critical thought to attack him no different than a lefty would. It's sickening. permalink parent award report block reply view 2 more comments... Kricket 4 points 3 hours ago trust me bro You lost? MAGA OR GTFO. We all see you. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago Please man, I'm reading your post history - you are clearly an actual human being who seems relatively intelligent.  I would love to actually talk to you man. permalink parent award report block reply lostmyoldpassword 0 points 3 hours ago Or maybe you aren't.  Or maybe you are just scared, and don't know how to react to Trump doing this shit.  Whatever - message me whenever if you want. permalink parent award report block reply TrumpyMadeThemGrumpy 0 points 2 hours ago Winds haven't shifted at all.  America still hates the terrorists, pedophiles, and anti-white racist BLMers on the left.  Time for you to read the room and talk to people outside your bubble. permalink parent award report block reply lostmyoldpassword 1 points 2 hours ago Anywhere in fucking anything I said - did I elude to my hatred for those people going away? Why are you trying to put shit in my mouth?  Why do you boil everything down to red vs blue, us vs. them - the fuck is your problem? permalink parent award report block reply lostmyoldpassword -2 points 3 hours ago You know what I don't want to fight with you.  I think you might be an actual human being.  Maybe.  I'm sorry my post has angered you - but come on man.  What the fuck is he doing?  Don't just reflexively yell shit at me. Talk to me. permalink parent award report block reply lostmyoldpassword -2 points 3 hours ago srsly man, read my history - pls, talk to me about this shit permalink parent award report block reply KernalMustard 1 points 21 minutes ago Stop being a Ostrich. permalink parent award report block reply KekistaniMemeLord 1 points 2 hours ago was the post a thoughtful critique of Trump or was it just ouright demonizing him or claiming he's compromised based on absolutely nothing? permalink parent award report block reply lostmyoldpassword 1 points 2 hours ago It was a man screaming out in pain, one who I'm pretty sure wasn't a bot or a shill or a handshake.  We can't just immediately shit on these people - not with everything going on. permalink parent award report block reply lostmyoldpassword -7 points 3 hours ago And it gets stickied - just fucking wow. permalink parent award report block reply bck- 1 points 3 hours ago Comment removed by community filter. permalink parent award report block reply Sanitas 6 points 3 hours ago How can democrats hide exculpatory information? The Trump admin has access to fucking EVERYTHING. Just exculpate Trump yourselves! permalink award report block reply Aggrieved03 5 points 2 hours ago Friendly reminder, Epstein didn't kill himself. permalink award report block reply friarfox 4 points 2 hours ago No one cares about disclosure. It's about prosecutions. Children were raped and abused be powerful men and that's the point.I don't care if you were Jewish, Christian or Muslim. You tortured kids for your pleasure. I want fucking prosecutions. If you can't give me that then you are complicit and every bit as guilty. permalink award report block reply Morokei 4 points 3 hours ago Just one of many reasons we should have taken the lead on records disclosure not belittled it and insulted those of us arguing for this. permalink award report block reply Snivelingsnitches1 4 points 3 hours ago Easy as pie, just release all the files so we can all see Trump isn’t in them! Problem solved. permalink award report block reply SocraticMethod1 4 points 3 hours ago At this point,  release it ALL UNREDACTED, this drip feed shit is way worse than the blowback that just releasing it would do. permalink award report block reply TrumpRideorDie74 1 points 2 hours ago There's a drip feed on the epstein files? I'd like to see any of that. permalink parent award report block reply Frix 3 points 2 hours ago Ok, sure the Federalist is going to set the record straight, when 1000s of media organizations, and millions of drunk wine mom harpies take to X and spread this. Welcome to the next gay dem psyop. permalink award report block reply drmrboy 3 points 3 hours ago If the current theory by most is that the dems altered the docs during the Biden years, knowing Trump would release them ... then the good guys need to find the originals and release those.  Something needs to be released to find out who has been blackmailed by Israel and be held to justice.  🤓 permalink award report block reply sorrytodisagree 4 points 3 hours ago You're on the right track, but the tail doesn't wag the dog.  To the deep state Israel's mossad are just subcontractors and a rounding error in the CIA's budget. Epstein was handling CIA covert funds since 1983. permalink parent award report block reply conservativefrank 3 points 2 hours ago It doesn't matter. The vast majority of Americans see the headlines and stories, and they won't dig further. To most Americans, this is the truth - Trump had sex with underage people on Epstein's island. permalink award report block reply GuerillaYourDreams 3 points 3 hours ago Their entire \"Katie Johnson\" bullshit scenario is all lies, too. If Trump was guilty of these things, there is no way they wouldn't have used it against him during the Biden fiasco years. permalink award report block reply RyanKeyOh 2 points 1 hour ago We don’t hate the media enough. Big headline, photo with Epstein Actual email content: Trump asks Epstein to stay away for Mar a lago (only member ever asked to resign) and asks Maxwell to stop offering him girls permalink award report block reply KernalMustard 1 points 9 minutes ago They were running a honeypot operation for blackmail. Dude had money coming out his ears. The only thing left is being the man behind the curtian. He didnt do this alone. He passed it along and used it for blackmail. There isnt any doubt thats what he did. This is why it hasnt been released. Its a giant fucking bomb permalink parent award report block reply ceva 2 points 3 hours ago RELEASE THE EPSTEIN FILES permalink award report block reply IvIA6A 2 points 2 hours ago Once again, if there was anything there, you think Obama or Biden wouldn't have released it during the campaign? permalink award report block reply TrumpRideorDie74 1 points 2 hours ago When Trump ran for re-election in 2020 I didn't understand why he never commercialized the mountain of clips showing Biden acting strange with little girls. He was sniffing their hair and touching them in ways only a parent should which caused these kids to react in a way where they wanted to be anywhere else. Every fuckin thing they try to get Trump on was all fabricated bullshit while all have access to the Biden tapes which seem to have been swept under the rug. This pede remembers. permalink parent award report block reply sod_off_shotgun 1 points 2 hours ago It's the same with the first impeachment. Imagine Bidet openly discussing, some might say bragging, about a quid pro quo in Ukraine. Now imagine he did that in a very public way that is available to view by anyone.  What's that you say? It actually happened? Quick let's impeach Trump for it. permalink parent award report block reply Snivelingsnitches1 2 points 3 hours ago Just release all the files and we can decide for ourselves! permalink award report block reply Mhmm2MoreWeeks 2 points 2 hours ago Not only is it not going away, but its continuing to be used to undermine Trump. He handled it so badly. Much like his choice of AG. permalink award report block reply MySidesGoUp 2 points 1 hour ago Trump gave them all the space in the world after calling Epstein a hoax…. permalink award report block reply mikethemarine 2 points 3 hours ago Don't these MF dems have any fucking morals at all to ever tell the truth about ANY FUCKING THING, it say in the bible that the devil knows how to lie. They are all demons, yep I guess they are all demons. Yes, the Bible states that the devil is a liar. A key verse is\nJohn 8:44, where Jesus refers to the devil as \"a murderer from the beginning\" and a liar who does not stand in the truth because \"there is no truth in him.\" This verse says that when he lies, he speaks out of his own character because he is a liar and the father of lies, according to Open Bible Info and Open the Bible. Yes, the Bible states that demons know how to lie, with the most prominent example being Satan being called \"the father of lies\" in John 8:44. Demons are portrayed as being masters of deception, using lies as a primary tactic to mislead people. permalink award report block reply ThouShallNotSteal 2 points 2 hours ago Well we all know 1 thing for sure...Bill Clinton is a rapist. permalink award report block reply sod_off_shotgun 2 points 2 hours ago Normies need to exercise some common sense. If there was anything incriminating regarding Trump and victims, it would have been leaked years ago. Sure, his name is mentioned at various points, but never anything related to him acting improperly. I know there will be zero evidence of that, because the dems would have already used it. permalink award report block reply South_Florida_Guy 2 points 3 hours ago If any of it were ever true they would have used it a LONG time ago before he got elected not once but twice. You'd have to be retarded to think otherwise. permalink award report block reply Snivelingsnitches1 2 points 3 hours ago Cool release the files then so we can see for ourselves! Tick tock… permalink parent award report block reply Steve56775 2 points 2 hours ago Isn’t there a second binder on Bondis desk waiting to be released? permalink parent award report block reply MAGAnificent700 2 points 2 hours ago Always is.  If there was anything there, they would have got him already. Now sue all the publications that ran with that garbage. permalink award report block reply TrumpRideorDie74 2 points 2 hours ago That's the real answer. The dems have thrown everything and the kitchen sink against him and still can't find anything to persecute him on so they create lies, hoaxes and misdirection. They're at the point where they're throwing everything against the wall and hoping anything sticks. Newsflash: nothing will stick because if they had anything worth a damn he'd be in jail by now. permalink parent award report block reply sod_off_shotgun 2 points 2 hours ago That's what I said in another comment. The fact that there has been no leak linking Trump to sex trafficking confirms there aren't any, as the dems would have used it already permalink parent award report block reply MAGAnificent700 1 points 1 hour ago Sue and add ANOTHER wing to the White House using the money.   Drives the liberals nuts when he does something magnanimous. permalink parent award report block reply Returningtogod 2 points 2 hours ago Altogether now:  NO SHIT SHERLOCK. permalink award report block reply NYforTrump 1 points 1 minute ago You know there is nothing actually damning in that Epstein crap about Trump since it would have been leaked during Biden. permalink award report block reply fat50 1 points 2 hours ago They have so much \"evidence\" against Trump, they failed to use it to smear him during 3 elections and numerous fake lawsuits. permalink award report block reply mikejones 1 points 2 hours ago We stall and waste time permalink award report block reply stroemia 1 points 21 minutes ago IT WAS HILLARY, BILL AND TED. THATS WHO SOLD US OUT. permalink award report block reply auntjemima 1 points 3 hours ago Weird ass comments in this one popcorn permalink award report block reply SmellyButtFart 1 points 57 minutes ago Trump pouched a real estate deal Epstein was putting together at the same time he banned him from Trump properties.  Trump made millions of dollars by snatching the opportunity away from him. The real estate deal was actually kind of unethical. He bought a mansion with a lot of land and then subdivided the property, built more mansions and sold it all off.  I HATE SUBDIVIDERS permalink award report block reply hairless_ap3 1 points 2 hours ago No shit really permalink award report block reply M-m-m-my-corona 1 points 3 hours ago Well if Trump would just release the docs then we could read them and know the truth.  But he won't. permalink award report block reply mightyclaw 1 points 3 hours ago Ace of Spades provides a good breakdown as well: https://acecomments.mu.nu/?post=417280 permalink award report block reply MageGills 1 points 17 minutes ago It's simply a distraction from his atrocious interview last night. permalink award report block reply SigSauer1776 -1 points 3 hours ago Trump was 100% involved permalink award report block reply lostmyoldpassword -2 points 3 hours ago ITT - all of the mods doing all of the things. permalink award report block reply TiggerLovingPooh -5 points 3 hours ago Yeah, shit is fake as the holocaust. permalink award report block reply Snivelingsnitches1 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply\nspezisacuckold 93 points 3 hours ago This is true. President Trump should also release the Epstein list. permalink award report block reply Simple_Doot 32 points 3 hours ago There is nothing worth protecting that makes keeping them sealed worth continuing.  It literally does not matter what happens to who if released and the only way forward is to disclose it all.  Zero alternative ways forward. permalink parent award report block reply AlohaChris 42 points 3 hours ago Epstein and Maxwell sexually trafficked children to…nobody permalink parent award report block reply ParmesanCartel 21 points 3 hours ago Weird how she met with trumps personal lawyer and was then moved to a more luxurious correctional facility permalink parent award report block reply KrakenWakin4JoeBacon 15 points 2 hours ago Horrible look & feel to reading that Maxwell is “much happier now” that she’s been moved to a different facility. Some victims claim she was a bigger psychopath & more cruel than Epstein. It’s also messed up that all of the male pedos involved are getting a pass, as if Maxwell’s sentence fully represents justice. permalink parent award report block reply view 3 more comments... KernalMustard 1 points 2 hours ago Wouldnt any approval have to go through Bondi? permalink parent award report block reply hansgruber7 1 points 28 minutes ago Joined 92 days ago. permalink parent award report block reply Rudy_DankMemer 3 points 53 minutes ago Epstein and Maxwell sexually trafficked children to…nobody INB4 faggots and shills run in to shout that \"Epstein never mixed business with pleasure\" and my favorite one: \"G-Max was convicted of supplying girls to ONLY Eggstein hur dur\" permalink parent award report block reply Klaus73 1 points 5 minutes ago Aye...Andrew lost his title purely due to random lotto draw...or something. permalink parent award report block reply LabTech 7 points 2 hours ago I've always conjectured that the reason he held onto them was to have leverage against the Elites that ARE on it, in order to make them do the things he wants them to do to further his agenda. I guess we'll know if that's the case if he does release them, and then he automatically starts getting problems from certain high-power groups.  Releasing the files might add some speedbumps to Trump's agenda. They probably should get released, but if they are being used as leverage, we may get a slowdown on other items. permalink parent award report block reply the-new-style 5 points 2 hours ago So why isn't it working? permalink parent award report block reply fat50 3 points 2 hours ago Exactly. They're fighting him every step of the way. permalink parent award report block reply LabTech 2 points 2 hours ago To continue the speculation... how would you know if it wasn't? All of this stuff is happening in the background, and I suspect the whole point would be to make it invisible.  We'll only know it was in effect if there's a sudden uptick in interference in the America First agenda after the release; that difference would've been from the people who were under duress. permalink parent award report block reply view 7 more comments... Millie1234 2 points 56 minutes ago Those elites can't be left in place, even to do Trump's bidding. Once he's gone, they'll carry on. permalink parent award report block reply LabTech 1 points 29 minutes ago I'm not saying they should, I'm just assuming Trump has a plan, because he obviously knows more than any of us. One would imagine the leverage is short-term, and once he figured he can do an end around and expose them after that point, he will. permalink parent award report block reply cchris_39 0 points 1 hour ago Exactly.  This requires people to have intelligence based on more than their fee fees so no liberal will ever understand or believe it. permalink parent award report block reply LabTech 2 points 25 minutes ago The problem is that society's been groomed for immediate impulse satisfaction, so few people can grasp delayed gratification. If it takes Trump 6 months to unfurl a scheme to get one item or another on the agenda accomplished, the doomers on this site and elsewhere make like he's somehow caved. These people are also apparently unaware of the fact that Trump MUST drain the Swamp by the time his term is over, because if one of their creatures gets into office after him, him and his entire bloodline as well as friends/associates are FUCKED... because it'll be constant lawfare and violence until the end of their days.  Trump MUST smash this machine, out of purely self-preservation reasons. permalink parent award report block reply DefinitelyNotFed 14 points 3 hours ago This would give him back the support of the people but he would lose most of his big donors. Pretty obvious which he values more. permalink parent award report block reply ParmesanCartel 12 points 3 hours ago Big time. Anything short of flipping the table won't save the support of the people now. But he's gone full retard unfortunately. He toasted the midterms. permalink parent award report block reply RememberCharlieKirk 10 points 2 hours ago And what a terrible choice he has made! President Trump already won re-election. He does not require donors for any future election, unless he is hoping for funding for his children's political careers or joint business endeavors. As for Congressional elections, the senators and representatives are hardly aligned with President Trump's agenda (filibuster?), so why should he need to sacrifice his soul for those politicians. permalink parent award report block reply UsernameChexOut 5 points 2 hours ago But that's why I think this goes beyond just the donors. There's gotta be something bigger in play here. I'm not a legal scholar here but I imagine it's not going to be a pretty situation if it turns out that another \"ally\" of ours is blackmailing and controlling our government. I'm not saying that that's 100% the case, but I imagine that if with all the backlash Trump is still protecting the files, there's gotta be some really insidious shit in there. permalink parent award report block reply hansgruber7 0 points 26 minutes ago Joined 6 days ago. permalink parent award report block reply GlorpLorp 1 points 18 minutes ago Brother shut the fuck up about account age. These are valid questions and statements. permalink parent award report block reply Dangerous 6 points 2 hours ago And his big donors are all anti-MAGA parasites, either from the Tech sector that was virulently anti Trump before 2023 or connected to AIPAC/Israel who have a history of backing Trump challengers. permalink parent award report block reply flashersenpai 0 points 1 hour ago People should look into the 3 big donors spending millions trying to unseat Thomas Massie if they haven't already. They fit this description perfectly. permalink parent award report block reply UsernameChexOut 3 points 2 hours ago He would lose his big donors and big nose donors as well permalink parent award report block reply try4gain PRO 14 points 3 hours ago Epstein Files are the new JFK files permalink parent award report block reply hansgruber7 4 points 2 hours ago Why does anyone think the Democrats left an incriminating Epstein list for Trump to find?  Anyone who believes that is a naive retard. permalink parent award report block reply ravonaf 5 points 2 hours ago There is no list, there never was a list. What they have are people scatter throughout reams of evidence who were targeted by the Intelligent Agencies via Epstein. There are LOTS of innocent people who did nothing wrong. As well as people who did, I'm sure. But there is no way to separate the 2 without dragging innocent people through the mud. Why should anyone have their lives ruined because they were targeted by Deep State Intelligent Agencies? permalink parent award report block reply flashersenpai 0 points 1 hour ago RFK explicitly said yes he was on Epstein's plane, said what the circumstances were and said release the files. Anyone who can't do that has something to hide. Fuck them. permalink parent award report block reply flashersenpai -1 points 1 hour ago Epstein has been around the globe mediating intel/security deals between Israel and various shithole countries. The Deep State cares more about exposure than about child safety. That's what I think is the reason for hiding the files. permalink parent award report block reply booblitchutz 1 points 2 hours ago Not that I know for sure, but I strongly suspect that Trump not releasing the Epstein list is the only way he can ever get ANYTHING through the senate for the next 3 years. permalink parent award report block reply load 3 more comments...\nSimple_Doot 32 points 3 hours ago There is nothing worth protecting that makes keeping them sealed worth continuing.  It literally does not matter what happens to who if released and the only way forward is to disclose it all.  Zero alternative ways forward. permalink parent award report block reply AlohaChris 42 points 3 hours ago Epstein and Maxwell sexually trafficked children to…nobody permalink parent award report block reply ParmesanCartel 21 points 3 hours ago Weird how she met with trumps personal lawyer and was then moved to a more luxurious correctional facility permalink parent award report block reply KrakenWakin4JoeBacon 15 points 2 hours ago Horrible look & feel to reading that Maxwell is “much happier now” that she’s been moved to a different facility. Some victims claim she was a bigger psychopath & more cruel than Epstein. It’s also messed up that all of the male pedos involved are getting a pass, as if Maxwell’s sentence fully represents justice. permalink parent award report block reply view 3 more comments... KernalMustard 1 points 2 hours ago Wouldnt any approval have to go through Bondi? permalink parent award report block reply hansgruber7 1 points 28 minutes ago Joined 92 days ago. permalink parent award report block reply Rudy_DankMemer 3 points 53 minutes ago Epstein and Maxwell sexually trafficked children to…nobody INB4 faggots and shills run in to shout that \"Epstein never mixed business with pleasure\" and my favorite one: \"G-Max was convicted of supplying girls to ONLY Eggstein hur dur\" permalink parent award report block reply Klaus73 1 points 5 minutes ago Aye...Andrew lost his title purely due to random lotto draw...or something. permalink parent award report block reply LabTech 7 points 2 hours ago I've always conjectured that the reason he held onto them was to have leverage against the Elites that ARE on it, in order to make them do the things he wants them to do to further his agenda. I guess we'll know if that's the case if he does release them, and then he automatically starts getting problems from certain high-power groups.  Releasing the files might add some speedbumps to Trump's agenda. They probably should get released, but if they are being used as leverage, we may get a slowdown on other items. permalink parent award report block reply the-new-style 5 points 2 hours ago So why isn't it working? permalink parent award report block reply fat50 3 points 2 hours ago Exactly. They're fighting him every step of the way. permalink parent award report block reply LabTech 2 points 2 hours ago To continue the speculation... how would you know if it wasn't? All of this stuff is happening in the background, and I suspect the whole point would be to make it invisible.  We'll only know it was in effect if there's a sudden uptick in interference in the America First agenda after the release; that difference would've been from the people who were under duress. permalink parent award report block reply view 7 more comments... Millie1234 2 points 56 minutes ago Those elites can't be left in place, even to do Trump's bidding. Once he's gone, they'll carry on. permalink parent award report block reply LabTech 1 points 29 minutes ago I'm not saying they should, I'm just assuming Trump has a plan, because he obviously knows more than any of us. One would imagine the leverage is short-term, and once he figured he can do an end around and expose them after that point, he will. permalink parent award report block reply cchris_39 0 points 1 hour ago Exactly.  This requires people to have intelligence based on more than their fee fees so no liberal will ever understand or believe it. permalink parent award report block reply LabTech 2 points 25 minutes ago The problem is that society's been groomed for immediate impulse satisfaction, so few people can grasp delayed gratification. If it takes Trump 6 months to unfurl a scheme to get one item or another on the agenda accomplished, the doomers on this site and elsewhere make like he's somehow caved. These people are also apparently unaware of the fact that Trump MUST drain the Swamp by the time his term is over, because if one of their creatures gets into office after him, him and his entire bloodline as well as friends/associates are FUCKED... because it'll be constant lawfare and violence until the end of their days.  Trump MUST smash this machine, out of purely self-preservation reasons. permalink parent award report block reply\nAlohaChris 42 points 3 hours ago Epstein and Maxwell sexually trafficked children to…nobody permalink parent award report block reply ParmesanCartel 21 points 3 hours ago Weird how she met with trumps personal lawyer and was then moved to a more luxurious correctional facility permalink parent award report block reply KrakenWakin4JoeBacon 15 points 2 hours ago Horrible look & feel to reading that Maxwell is “much happier now” that she’s been moved to a different facility. Some victims claim she was a bigger psychopath & more cruel than Epstein. It’s also messed up that all of the male pedos involved are getting a pass, as if Maxwell’s sentence fully represents justice. permalink parent award report block reply view 3 more comments... KernalMustard 1 points 2 hours ago Wouldnt any approval have to go through Bondi? permalink parent award report block reply hansgruber7 1 points 28 minutes ago Joined 92 days ago. permalink parent award report block reply Rudy_DankMemer 3 points 53 minutes ago Epstein and Maxwell sexually trafficked children to…nobody INB4 faggots and shills run in to shout that \"Epstein never mixed business with pleasure\" and my favorite one: \"G-Max was convicted of supplying girls to ONLY Eggstein hur dur\" permalink parent award report block reply Klaus73 1 points 5 minutes ago Aye...Andrew lost his title purely due to random lotto draw...or something. permalink parent award report block reply\nParmesanCartel 21 points 3 hours ago Weird how she met with trumps personal lawyer and was then moved to a more luxurious correctional facility permalink parent award report block reply KrakenWakin4JoeBacon 15 points 2 hours ago Horrible look & feel to reading that Maxwell is “much happier now” that she’s been moved to a different facility. Some victims claim she was a bigger psychopath & more cruel than Epstein. It’s also messed up that all of the male pedos involved are getting a pass, as if Maxwell’s sentence fully represents justice. permalink parent award report block reply view 3 more comments... KernalMustard 1 points 2 hours ago Wouldnt any approval have to go through Bondi? permalink parent award report block reply hansgruber7 1 points 28 minutes ago Joined 92 days ago. permalink parent award report block reply\nKrakenWakin4JoeBacon 15 points 2 hours ago Horrible look & feel to reading that Maxwell is “much happier now” that she’s been moved to a different facility. Some victims claim she was a bigger psychopath & more cruel than Epstein. It’s also messed up that all of the male pedos involved are getting a pass, as if Maxwell’s sentence fully represents justice. permalink parent award report block reply view 3 more comments...\nKernalMustard 1 points 2 hours ago Wouldnt any approval have to go through Bondi? permalink parent award report block reply\nhansgruber7 1 points 28 minutes ago Joined 92 days ago. permalink parent award report block reply\nRudy_DankMemer 3 points 53 minutes ago Epstein and Maxwell sexually trafficked children to…nobody INB4 faggots and shills run in to shout that \"Epstein never mixed business with pleasure\" and my favorite one: \"G-Max was convicted of supplying girls to ONLY Eggstein hur dur\" permalink parent award report block reply\nKlaus73 1 points 5 minutes ago Aye...Andrew lost his title purely due to random lotto draw...or something. permalink parent award report block reply\nLabTech 7 points 2 hours ago I've always conjectured that the reason he held onto them was to have leverage against the Elites that ARE on it, in order to make them do the things he wants them to do to further his agenda. I guess we'll know if that's the case if he does release them, and then he automatically starts getting problems from certain high-power groups.  Releasing the files might add some speedbumps to Trump's agenda. They probably should get released, but if they are being used as leverage, we may get a slowdown on other items. permalink parent award report block reply the-new-style 5 points 2 hours ago So why isn't it working? permalink parent award report block reply fat50 3 points 2 hours ago Exactly. They're fighting him every step of the way. permalink parent award report block reply LabTech 2 points 2 hours ago To continue the speculation... how would you know if it wasn't? All of this stuff is happening in the background, and I suspect the whole point would be to make it invisible.  We'll only know it was in effect if there's a sudden uptick in interference in the America First agenda after the release; that difference would've been from the people who were under duress. permalink parent award report block reply view 7 more comments... Millie1234 2 points 56 minutes ago Those elites can't be left in place, even to do Trump's bidding. Once he's gone, they'll carry on. permalink parent award report block reply LabTech 1 points 29 minutes ago I'm not saying they should, I'm just assuming Trump has a plan, because he obviously knows more than any of us. One would imagine the leverage is short-term, and once he figured he can do an end around and expose them after that point, he will. permalink parent award report block reply cchris_39 0 points 1 hour ago Exactly.  This requires people to have intelligence based on more than their fee fees so no liberal will ever understand or believe it. permalink parent award report block reply LabTech 2 points 25 minutes ago The problem is that society's been groomed for immediate impulse satisfaction, so few people can grasp delayed gratification. If it takes Trump 6 months to unfurl a scheme to get one item or another on the agenda accomplished, the doomers on this site and elsewhere make like he's somehow caved. These people are also apparently unaware of the fact that Trump MUST drain the Swamp by the time his term is over, because if one of their creatures gets into office after him, him and his entire bloodline as well as friends/associates are FUCKED... because it'll be constant lawfare and violence until the end of their days.  Trump MUST smash this machine, out of purely self-preservation reasons. permalink parent award report block reply\nthe-new-style 5 points 2 hours ago So why isn't it working? permalink parent award report block reply fat50 3 points 2 hours ago Exactly. They're fighting him every step of the way. permalink parent award report block reply LabTech 2 points 2 hours ago To continue the speculation... how would you know if it wasn't? All of this stuff is happening in the background, and I suspect the whole point would be to make it invisible.  We'll only know it was in effect if there's a sudden uptick in interference in the America First agenda after the release; that difference would've been from the people who were under duress. permalink parent award report block reply view 7 more comments...\nfat50 3 points 2 hours ago Exactly. They're fighting him every step of the way. permalink parent award report block reply\nLabTech 2 points 2 hours ago To continue the speculation... how would you know if it wasn't? All of this stuff is happening in the background, and I suspect the whole point would be to make it invisible.  We'll only know it was in effect if there's a sudden uptick in interference in the America First agenda after the release; that difference would've been from the people who were under duress. permalink parent award report block reply view 7 more comments...\nMillie1234 2 points 56 minutes ago Those elites can't be left in place, even to do Trump's bidding. Once he's gone, they'll carry on. permalink parent award report block reply LabTech 1 points 29 minutes ago I'm not saying they should, I'm just assuming Trump has a plan, because he obviously knows more than any of us. One would imagine the leverage is short-term, and once he figured he can do an end around and expose them after that point, he will. permalink parent award report block reply\nLabTech 1 points 29 minutes ago I'm not saying they should, I'm just assuming Trump has a plan, because he obviously knows more than any of us. One would imagine the leverage is short-term, and once he figured he can do an end around and expose them after that point, he will. permalink parent award report block reply\ncchris_39 0 points 1 hour ago Exactly.  This requires people to have intelligence based on more than their fee fees so no liberal will ever understand or believe it. permalink parent award report block reply LabTech 2 points 25 minutes ago The problem is that society's been groomed for immediate impulse satisfaction, so few people can grasp delayed gratification. If it takes Trump 6 months to unfurl a scheme to get one item or another on the agenda accomplished, the doomers on this site and elsewhere make like he's somehow caved. These people are also apparently unaware of the fact that Trump MUST drain the Swamp by the time his term is over, because if one of their creatures gets into office after him, him and his entire bloodline as well as friends/associates are FUCKED... because it'll be constant lawfare and violence until the end of their days.  Trump MUST smash this machine, out of purely self-preservation reasons. permalink parent award report block reply\nLabTech 2 points 25 minutes ago The problem is that society's been groomed for immediate impulse satisfaction, so few people can grasp delayed gratification. If it takes Trump 6 months to unfurl a scheme to get one item or another on the agenda accomplished, the doomers on this site and elsewhere make like he's somehow caved. These people are also apparently unaware of the fact that Trump MUST drain the Swamp by the time his term is over, because if one of their creatures gets into office after him, him and his entire bloodline as well as friends/associates are FUCKED... because it'll be constant lawfare and violence until the end of their days.  Trump MUST smash this machine, out of purely self-preservation reasons. permalink parent award report block reply\nDefinitelyNotFed 14 points 3 hours ago This would give him back the support of the people but he would lose most of his big donors. Pretty obvious which he values more. permalink parent award report block reply ParmesanCartel 12 points 3 hours ago Big time. Anything short of flipping the table won't save the support of the people now. But he's gone full retard unfortunately. He toasted the midterms. permalink parent award report block reply RememberCharlieKirk 10 points 2 hours ago And what a terrible choice he has made! President Trump already won re-election. He does not require donors for any future election, unless he is hoping for funding for his children's political careers or joint business endeavors. As for Congressional elections, the senators and representatives are hardly aligned with President Trump's agenda (filibuster?), so why should he need to sacrifice his soul for those politicians. permalink parent award report block reply UsernameChexOut 5 points 2 hours ago But that's why I think this goes beyond just the donors. There's gotta be something bigger in play here. I'm not a legal scholar here but I imagine it's not going to be a pretty situation if it turns out that another \"ally\" of ours is blackmailing and controlling our government. I'm not saying that that's 100% the case, but I imagine that if with all the backlash Trump is still protecting the files, there's gotta be some really insidious shit in there. permalink parent award report block reply hansgruber7 0 points 26 minutes ago Joined 6 days ago. permalink parent award report block reply GlorpLorp 1 points 18 minutes ago Brother shut the fuck up about account age. These are valid questions and statements. permalink parent award report block reply Dangerous 6 points 2 hours ago And his big donors are all anti-MAGA parasites, either from the Tech sector that was virulently anti Trump before 2023 or connected to AIPAC/Israel who have a history of backing Trump challengers. permalink parent award report block reply flashersenpai 0 points 1 hour ago People should look into the 3 big donors spending millions trying to unseat Thomas Massie if they haven't already. They fit this description perfectly. permalink parent award report block reply UsernameChexOut 3 points 2 hours ago He would lose his big donors and big nose donors as well permalink parent award report block reply\nParmesanCartel 12 points 3 hours ago Big time. Anything short of flipping the table won't save the support of the people now. But he's gone full retard unfortunately. He toasted the midterms. permalink parent award report block reply\nRememberCharlieKirk 10 points 2 hours ago And what a terrible choice he has made! President Trump already won re-election. He does not require donors for any future election, unless he is hoping for funding for his children's political careers or joint business endeavors. As for Congressional elections, the senators and representatives are hardly aligned with President Trump's agenda (filibuster?), so why should he need to sacrifice his soul for those politicians. permalink parent award report block reply UsernameChexOut 5 points 2 hours ago But that's why I think this goes beyond just the donors. There's gotta be something bigger in play here. I'm not a legal scholar here but I imagine it's not going to be a pretty situation if it turns out that another \"ally\" of ours is blackmailing and controlling our government. I'm not saying that that's 100% the case, but I imagine that if with all the backlash Trump is still protecting the files, there's gotta be some really insidious shit in there. permalink parent award report block reply hansgruber7 0 points 26 minutes ago Joined 6 days ago. permalink parent award report block reply GlorpLorp 1 points 18 minutes ago Brother shut the fuck up about account age. These are valid questions and statements. permalink parent award report block reply\nUsernameChexOut 5 points 2 hours ago But that's why I think this goes beyond just the donors. There's gotta be something bigger in play here. I'm not a legal scholar here but I imagine it's not going to be a pretty situation if it turns out that another \"ally\" of ours is blackmailing and controlling our government. I'm not saying that that's 100% the case, but I imagine that if with all the backlash Trump is still protecting the files, there's gotta be some really insidious shit in there. permalink parent award report block reply\nhansgruber7 0 points 26 minutes ago Joined 6 days ago. permalink parent award report block reply GlorpLorp 1 points 18 minutes ago Brother shut the fuck up about account age. These are valid questions and statements. permalink parent award report block reply\nGlorpLorp 1 points 18 minutes ago Brother shut the fuck up about account age. These are valid questions and statements. permalink parent award report block reply\nDangerous 6 points 2 hours ago And his big donors are all anti-MAGA parasites, either from the Tech sector that was virulently anti Trump before 2023 or connected to AIPAC/Israel who have a history of backing Trump challengers. permalink parent award report block reply flashersenpai 0 points 1 hour ago People should look into the 3 big donors spending millions trying to unseat Thomas Massie if they haven't already. They fit this description perfectly. permalink parent award report block reply\nflashersenpai 0 points 1 hour ago People should look into the 3 big donors spending millions trying to unseat Thomas Massie if they haven't already. They fit this description perfectly. permalink parent award report block reply\nUsernameChexOut 3 points 2 hours ago He would lose his big donors and big nose donors as well permalink parent award report block reply\ntry4gain PRO 14 points 3 hours ago Epstein Files are the new JFK files permalink parent award report block reply\nhansgruber7 4 points 2 hours ago Why does anyone think the Democrats left an incriminating Epstein list for Trump to find?  Anyone who believes that is a naive retard. permalink parent award report block reply ravonaf 5 points 2 hours ago There is no list, there never was a list. What they have are people scatter throughout reams of evidence who were targeted by the Intelligent Agencies via Epstein. There are LOTS of innocent people who did nothing wrong. As well as people who did, I'm sure. But there is no way to separate the 2 without dragging innocent people through the mud. Why should anyone have their lives ruined because they were targeted by Deep State Intelligent Agencies? permalink parent award report block reply flashersenpai 0 points 1 hour ago RFK explicitly said yes he was on Epstein's plane, said what the circumstances were and said release the files. Anyone who can't do that has something to hide. Fuck them. permalink parent award report block reply flashersenpai -1 points 1 hour ago Epstein has been around the globe mediating intel/security deals between Israel and various shithole countries. The Deep State cares more about exposure than about child safety. That's what I think is the reason for hiding the files. permalink parent award report block reply\nravonaf 5 points 2 hours ago There is no list, there never was a list. What they have are people scatter throughout reams of evidence who were targeted by the Intelligent Agencies via Epstein. There are LOTS of innocent people who did nothing wrong. As well as people who did, I'm sure. But there is no way to separate the 2 without dragging innocent people through the mud. Why should anyone have their lives ruined because they were targeted by Deep State Intelligent Agencies? permalink parent award report block reply flashersenpai 0 points 1 hour ago RFK explicitly said yes he was on Epstein's plane, said what the circumstances were and said release the files. Anyone who can't do that has something to hide. Fuck them. permalink parent award report block reply\nflashersenpai 0 points 1 hour ago RFK explicitly said yes he was on Epstein's plane, said what the circumstances were and said release the files. Anyone who can't do that has something to hide. Fuck them. permalink parent award report block reply\nflashersenpai -1 points 1 hour ago Epstein has been around the globe mediating intel/security deals between Israel and various shithole countries. The Deep State cares more about exposure than about child safety. That's what I think is the reason for hiding the files. permalink parent award report block reply\nbooblitchutz 1 points 2 hours ago Not that I know for sure, but I strongly suspect that Trump not releasing the Epstein list is the only way he can ever get ANYTHING through the senate for the next 3 years. permalink parent award report block reply\nnakedjay 49 points 3 hours ago It's all Dems have, projection and disinformation. permalink award report block reply Pied-Trumper 14 points 3 hours ago Glad that’s settled. Now let’s get back to giving H1Bs citizenship, let illegals working at hotels continue doing their jobs, import all the Chinese to compete with our students, and give our children 50-year mortgages and 15-year car loans. There’s now affordability crisis! Things are amazing! Waarrrrr, we need waaarr! permalink parent award report block reply flashersenpai 3 points 1 hour ago They wouldn't have this disinfo option if the files were released. permalink parent award report block reply leakmouth 2 points 2 hours ago The best thing about fake news is watching the libtards get their hopes up over and over again and then watching those hopes get destroyed every single time permalink parent award report block reply TrumpTurd69 -2 points 3 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nPied-Trumper 14 points 3 hours ago Glad that’s settled. Now let’s get back to giving H1Bs citizenship, let illegals working at hotels continue doing their jobs, import all the Chinese to compete with our students, and give our children 50-year mortgages and 15-year car loans. There’s now affordability crisis! Things are amazing! Waarrrrr, we need waaarr! permalink parent award report block reply\nflashersenpai 3 points 1 hour ago They wouldn't have this disinfo option if the files were released. permalink parent award report block reply\nleakmouth 2 points 2 hours ago The best thing about fake news is watching the libtards get their hopes up over and over again and then watching those hopes get destroyed every single time permalink parent award report block reply\nTrumpTurd69 -2 points 3 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nThan0sIII 38 points 3 hours ago If they truly had anything it would've been 2024's October surprise, if not used sooner to indict Trump on conspiracy/aiding sex trafficking. permalink award report block reply ChrisSuperDude 19 points 3 hours ago My whole thing is that they would’ve used it in 2015-2016 when he was first getting momentum. Or even in 2020 after Epstein died and was in the news cycle. permalink parent award report block reply BidensBodyDouble 4 points 2 hours ago And you can tell in those emails with Wolff that that plan was on the table for them too permalink parent award report block reply Ostia 1 points 3 hours ago Not if their big names are in it too. permalink parent award report block reply Dangerous 10 points 2 hours ago They have selectively released information before. That's all they had to do, block out anything not related to Trump and quash all attempts at further unsealings This line of argument has always been faulty permalink parent award report block reply Than0sIII 1 points 58 minutes ago Exactly.  I don't get why people are pretending there's some world where they wouldn't selectively pull out damning pieces of evidence against Trump.  People don't really want to think, they just want to have their biases confirmed. permalink parent award report block reply Ostia -3 points 2 hours ago Then why haven't we released the parts pertaining to them? I'm mean, by the same token, if Clinton, Roberts, and half of the democrat congress is in there, why haven't we used it? I mean, if they're just selectively leaving all the incriminating stuff about themselves out? permalink parent award report block reply emorphia 4 points 2 hours ago and i bet they are.  but we will never find out sadly. permalink parent award report block reply Aquamine-Amarine 1 points 2 hours ago All they had was the pussy tape. That's it. permalink parent award report block reply Goodgoodygoodgood 1 points 2 hours ago I have a theory they didn’t release them because they have just as much to lose. I expect them to have more to lose permalink parent award report block reply\nChrisSuperDude 19 points 3 hours ago My whole thing is that they would’ve used it in 2015-2016 when he was first getting momentum. Or even in 2020 after Epstein died and was in the news cycle. permalink parent award report block reply BidensBodyDouble 4 points 2 hours ago And you can tell in those emails with Wolff that that plan was on the table for them too permalink parent award report block reply\nBidensBodyDouble 4 points 2 hours ago And you can tell in those emails with Wolff that that plan was on the table for them too permalink parent award report block reply\nOstia 1 points 3 hours ago Not if their big names are in it too. permalink parent award report block reply Dangerous 10 points 2 hours ago They have selectively released information before. That's all they had to do, block out anything not related to Trump and quash all attempts at further unsealings This line of argument has always been faulty permalink parent award report block reply Than0sIII 1 points 58 minutes ago Exactly.  I don't get why people are pretending there's some world where they wouldn't selectively pull out damning pieces of evidence against Trump.  People don't really want to think, they just want to have their biases confirmed. permalink parent award report block reply Ostia -3 points 2 hours ago Then why haven't we released the parts pertaining to them? I'm mean, by the same token, if Clinton, Roberts, and half of the democrat congress is in there, why haven't we used it? I mean, if they're just selectively leaving all the incriminating stuff about themselves out? permalink parent award report block reply emorphia 4 points 2 hours ago and i bet they are.  but we will never find out sadly. permalink parent award report block reply\nDangerous 10 points 2 hours ago They have selectively released information before. That's all they had to do, block out anything not related to Trump and quash all attempts at further unsealings This line of argument has always been faulty permalink parent award report block reply Than0sIII 1 points 58 minutes ago Exactly.  I don't get why people are pretending there's some world where they wouldn't selectively pull out damning pieces of evidence against Trump.  People don't really want to think, they just want to have their biases confirmed. permalink parent award report block reply Ostia -3 points 2 hours ago Then why haven't we released the parts pertaining to them? I'm mean, by the same token, if Clinton, Roberts, and half of the democrat congress is in there, why haven't we used it? I mean, if they're just selectively leaving all the incriminating stuff about themselves out? permalink parent award report block reply\nThan0sIII 1 points 58 minutes ago Exactly.  I don't get why people are pretending there's some world where they wouldn't selectively pull out damning pieces of evidence against Trump.  People don't really want to think, they just want to have their biases confirmed. permalink parent award report block reply\nOstia -3 points 2 hours ago Then why haven't we released the parts pertaining to them? I'm mean, by the same token, if Clinton, Roberts, and half of the democrat congress is in there, why haven't we used it? I mean, if they're just selectively leaving all the incriminating stuff about themselves out? permalink parent award report block reply\nemorphia 4 points 2 hours ago and i bet they are.  but we will never find out sadly. permalink parent award report block reply\nAquamine-Amarine 1 points 2 hours ago All they had was the pussy tape. That's it. permalink parent award report block reply\nGoodgoodygoodgood 1 points 2 hours ago I have a theory they didn’t release them because they have just as much to lose. I expect them to have more to lose permalink parent award report block reply\nJDVance4President28 27 points 3 hours ago Trump's response to the Epstein stuff was very suspicious tho permalink award report block reply Simple_Doot 19 points 3 hours ago Definitely.  If he is not playing some crazy \"5D\" chess Q plan then he has failed us completely.  And if he IS playing some 5D chess then he is intentionally saying the stupidest shit possible which justifies our outrage.  So being pissed about it is the correct way to be. permalink parent award report block reply Area82 9 points 3 hours ago Heard on a couple of podcasts lately that Epstein's main gig was money laundering and arms deals for various gubmints since the 80s.   I wonder if that is true? permalink parent award report block reply flashersenpai 1 points 1 hour ago Epstein was mediating surveillance state deals between Israel and Cote de'Ivore. I'd be more surprised if he wasn't a money laundering govt asset. permalink parent award report block reply PhoneBandit 1 points 1 hour ago It definitely seems like the case as his account is still seeing transactions apparently. I read that Trump was also a money launderer for the feds and that's why he was aware of Epstein's sex business. They have leverage on him just like Epstein which is why he's playing ball. permalink parent award report block reply LordKuroTheGreat 7 points 2 hours ago The whole operation looks very Mossad, so hopefully it's just that he can't bear to call out Israel for once. Either way, he couldn't have handled the situation worse if he tried. permalink parent award report block reply sorrytodisagree 5 points 3 hours ago He wouldn't spend years campaigning for their release to his own detriment.  The only thing that makes any sense is they've been deliberately spoiled while SDNY had them.  Seeded with manufactured falsehoods as a poison chalice.  Proving the tampering won't convince doubters and makes all the rest suspect and inadmissible.  Withholding the fakes is easily exposed by the perpetrators as a \"coverup worse than the crime\" Watergate scenario.  For them better than deleting it all.  simply destroying the evidence incriminates themselves and they can't be sure copies won't surface.  This way releasing it is a lose/lose, eliminates it's criminal evidence and political value, but maintains it's blackmail value for intelligence agencies. permalink parent award report block reply JDVance4President28 11 points 3 hours ago Well then arrest those responsible for the corruption. Surly the full weight of the DOJ could sort it out. The most sophisticated spying apparatus in human history isn't useless here unless it's intentional. permalink parent award report block reply sorrytodisagree 3 points 2 hours ago Nobody said it wasn't an intentional act by deep stater's in that DOJ and spying apparatus.  Even if they screwed up and you can prove their tampering the fakes come out and are believed by democrats and idiots anyway. permalink parent award report block reply Ostia 6 points 2 hours ago He wouldn't spend years campaigning for their release to his own detriment. He never campaigned on their release. We just projected what we wanted to hear on to someone who was never saying it. permalink parent award report block reply rebuildingMyself 3 points 2 hours ago He did say he would release it when baited by a reporter in an interview, but yes it wasn't some big action item in the campaign that I can recall permalink parent award report block reply Ostia 2 points 2 hours ago Once, after this election, and then waffled on that answer even after saying, yes I guess so. permalink parent award report block reply AuAgCuPb 0 points 2 hours ago All I ever remember him saying when asked about \"releasing the Epstein files\" if he became president was, \"We'll look into it.\"\nWell, they DID look into it, and guess what?  they decided to not release them.  So he DID fulfill his campaign promise of \"looking into it\".  😆 permalink parent award report block reply ImClearlyLost 2 points 2 hours ago Trump never spent years campaigning for their release.  He only reluctantly answered once he was directly asked, he never brought it up on his own volition ever. permalink parent award report block reply sorrytodisagree 1 points 2 hours ago And he did his best to put Epstein behind bars years before he ran for President.  Not something you do if somebody had files on you to present at trial... https://x.com/rawsalerts/status/1964068279292399961 https://dailycaller.com/2024/01/02/brad-edwards-jeffrey-epstein-victim-attorney-donald-trump-mar-a-lago/ permalink parent award report block reply Corse46 3 points 3 hours ago So true, unfortunately permalink parent award report block reply load 3 more comments...\nSimple_Doot 19 points 3 hours ago Definitely.  If he is not playing some crazy \"5D\" chess Q plan then he has failed us completely.  And if he IS playing some 5D chess then he is intentionally saying the stupidest shit possible which justifies our outrage.  So being pissed about it is the correct way to be. permalink parent award report block reply\nArea82 9 points 3 hours ago Heard on a couple of podcasts lately that Epstein's main gig was money laundering and arms deals for various gubmints since the 80s.   I wonder if that is true? permalink parent award report block reply flashersenpai 1 points 1 hour ago Epstein was mediating surveillance state deals between Israel and Cote de'Ivore. I'd be more surprised if he wasn't a money laundering govt asset. permalink parent award report block reply PhoneBandit 1 points 1 hour ago It definitely seems like the case as his account is still seeing transactions apparently. I read that Trump was also a money launderer for the feds and that's why he was aware of Epstein's sex business. They have leverage on him just like Epstein which is why he's playing ball. permalink parent award report block reply\nflashersenpai 1 points 1 hour ago Epstein was mediating surveillance state deals between Israel and Cote de'Ivore. I'd be more surprised if he wasn't a money laundering govt asset. permalink parent award report block reply\nPhoneBandit 1 points 1 hour ago It definitely seems like the case as his account is still seeing transactions apparently. I read that Trump was also a money launderer for the feds and that's why he was aware of Epstein's sex business. They have leverage on him just like Epstein which is why he's playing ball. permalink parent award report block reply\nLordKuroTheGreat 7 points 2 hours ago The whole operation looks very Mossad, so hopefully it's just that he can't bear to call out Israel for once. Either way, he couldn't have handled the situation worse if he tried. permalink parent award report block reply\nsorrytodisagree 5 points 3 hours ago He wouldn't spend years campaigning for their release to his own detriment.  The only thing that makes any sense is they've been deliberately spoiled while SDNY had them.  Seeded with manufactured falsehoods as a poison chalice.  Proving the tampering won't convince doubters and makes all the rest suspect and inadmissible.  Withholding the fakes is easily exposed by the perpetrators as a \"coverup worse than the crime\" Watergate scenario.  For them better than deleting it all.  simply destroying the evidence incriminates themselves and they can't be sure copies won't surface.  This way releasing it is a lose/lose, eliminates it's criminal evidence and political value, but maintains it's blackmail value for intelligence agencies. permalink parent award report block reply JDVance4President28 11 points 3 hours ago Well then arrest those responsible for the corruption. Surly the full weight of the DOJ could sort it out. The most sophisticated spying apparatus in human history isn't useless here unless it's intentional. permalink parent award report block reply sorrytodisagree 3 points 2 hours ago Nobody said it wasn't an intentional act by deep stater's in that DOJ and spying apparatus.  Even if they screwed up and you can prove their tampering the fakes come out and are believed by democrats and idiots anyway. permalink parent award report block reply Ostia 6 points 2 hours ago He wouldn't spend years campaigning for their release to his own detriment. He never campaigned on their release. We just projected what we wanted to hear on to someone who was never saying it. permalink parent award report block reply rebuildingMyself 3 points 2 hours ago He did say he would release it when baited by a reporter in an interview, but yes it wasn't some big action item in the campaign that I can recall permalink parent award report block reply Ostia 2 points 2 hours ago Once, after this election, and then waffled on that answer even after saying, yes I guess so. permalink parent award report block reply AuAgCuPb 0 points 2 hours ago All I ever remember him saying when asked about \"releasing the Epstein files\" if he became president was, \"We'll look into it.\"\nWell, they DID look into it, and guess what?  they decided to not release them.  So he DID fulfill his campaign promise of \"looking into it\".  😆 permalink parent award report block reply ImClearlyLost 2 points 2 hours ago Trump never spent years campaigning for their release.  He only reluctantly answered once he was directly asked, he never brought it up on his own volition ever. permalink parent award report block reply sorrytodisagree 1 points 2 hours ago And he did his best to put Epstein behind bars years before he ran for President.  Not something you do if somebody had files on you to present at trial... https://x.com/rawsalerts/status/1964068279292399961 https://dailycaller.com/2024/01/02/brad-edwards-jeffrey-epstein-victim-attorney-donald-trump-mar-a-lago/ permalink parent award report block reply\nJDVance4President28 11 points 3 hours ago Well then arrest those responsible for the corruption. Surly the full weight of the DOJ could sort it out. The most sophisticated spying apparatus in human history isn't useless here unless it's intentional. permalink parent award report block reply sorrytodisagree 3 points 2 hours ago Nobody said it wasn't an intentional act by deep stater's in that DOJ and spying apparatus.  Even if they screwed up and you can prove their tampering the fakes come out and are believed by democrats and idiots anyway. permalink parent award report block reply\nsorrytodisagree 3 points 2 hours ago Nobody said it wasn't an intentional act by deep stater's in that DOJ and spying apparatus.  Even if they screwed up and you can prove their tampering the fakes come out and are believed by democrats and idiots anyway. permalink parent award report block reply\nOstia 6 points 2 hours ago He wouldn't spend years campaigning for their release to his own detriment. He never campaigned on their release. We just projected what we wanted to hear on to someone who was never saying it. permalink parent award report block reply rebuildingMyself 3 points 2 hours ago He did say he would release it when baited by a reporter in an interview, but yes it wasn't some big action item in the campaign that I can recall permalink parent award report block reply Ostia 2 points 2 hours ago Once, after this election, and then waffled on that answer even after saying, yes I guess so. permalink parent award report block reply AuAgCuPb 0 points 2 hours ago All I ever remember him saying when asked about \"releasing the Epstein files\" if he became president was, \"We'll look into it.\"\nWell, they DID look into it, and guess what?  they decided to not release them.  So he DID fulfill his campaign promise of \"looking into it\".  😆 permalink parent award report block reply\nrebuildingMyself 3 points 2 hours ago He did say he would release it when baited by a reporter in an interview, but yes it wasn't some big action item in the campaign that I can recall permalink parent award report block reply Ostia 2 points 2 hours ago Once, after this election, and then waffled on that answer even after saying, yes I guess so. permalink parent award report block reply\nOstia 2 points 2 hours ago Once, after this election, and then waffled on that answer even after saying, yes I guess so. permalink parent award report block reply\nAuAgCuPb 0 points 2 hours ago All I ever remember him saying when asked about \"releasing the Epstein files\" if he became president was, \"We'll look into it.\"\nWell, they DID look into it, and guess what?  they decided to not release them.  So he DID fulfill his campaign promise of \"looking into it\".  😆 permalink parent award report block reply\nImClearlyLost 2 points 2 hours ago Trump never spent years campaigning for their release.  He only reluctantly answered once he was directly asked, he never brought it up on his own volition ever. permalink parent award report block reply sorrytodisagree 1 points 2 hours ago And he did his best to put Epstein behind bars years before he ran for President.  Not something you do if somebody had files on you to present at trial... https://x.com/rawsalerts/status/1964068279292399961 https://dailycaller.com/2024/01/02/brad-edwards-jeffrey-epstein-victim-attorney-donald-trump-mar-a-lago/ permalink parent award report block reply\nsorrytodisagree 1 points 2 hours ago And he did his best to put Epstein behind bars years before he ran for President.  Not something you do if somebody had files on you to present at trial... https://x.com/rawsalerts/status/1964068279292399961 https://dailycaller.com/2024/01/02/brad-edwards-jeffrey-epstein-victim-attorney-donald-trump-mar-a-lago/ permalink parent award report block reply\nCorse46 3 points 3 hours ago So true, unfortunately permalink parent award report block reply\nLostElf 20 points 3 hours ago Good GOD. If they had anything it would've been all over the place ages ago. permalink award report block reply Corse46 9 points 3 hours ago I agree. But that doesn’t answer why the President is running an Epstein pedophilia coverup permalink parent award report block reply Oldman1945 11 points 2 hours ago He should have released all files the morning after Epstein was found dead. All of this should have been released in Trump’s first term, at that exact moment. Saving it to win the election is fine, but not if that promise is broken. Release all files!! permalink parent award report block reply JanOctSept 1 points 2 hours ago In all fairness the Hillary emails about Russiagate in the Turducken safe existed under Trump too, meaning I don’t think the FBI was particularly loyal to him. permalink parent award report block reply MakeCaliforniaRED 1 points 1 hour ago It still isn’t. permalink parent award report block reply referencevariable 2 points 2 hours ago Because a deal was made in return for assistance getting his agenda accomplished. See here: https://patriots.win/p/19BZphlAOd/unfortunately-a-deal-was-made/c permalink parent award report block reply LostElf 1 points 3 hours ago The files are likely infested with false information targeting innocent people. That's what happens when an investigation is so thoroughly corrupted. permalink parent award report block reply flashersenpai 2 points 59 minutes ago the surest way to expose false information is to allow the internet to fact check it we got podesta's emails and we should get the epstein files too permalink parent award report block reply KernalMustard 1 points 27 minutes ago So if you were guilty wouldn't you declare its all false. Use your head people. The left doesnt use it because whats left would also take down their house of cards. Its  MAD files. permalink parent award report block reply TennesseeBorn 0 points 1 hour ago They 100 percent poisoned them. Why wouldn't they? permalink parent award report block reply KekistaniMemeLord 0 points 2 hours ago extremely dishonest framing. Literally no one here knows what is going on with the Epstein case and investigation atm. Immediately assuming Trump is running cover for pedo's or trying to protect them is some MSM scumbag level shit. permalink parent award report block reply emorphia 2 points 2 hours ago it does not matter if any of it is real , the left will gobble up anything the dems say about Trump.  they say it so it is true for them. permalink parent award report block reply Ostia 1 points 2 hours ago Not if their big names are in it too. Mutually assured destruction is a very real and viable tactic for blackmail and control. permalink parent award report block reply sorrytodisagree 2 points 2 hours ago And when people are brainwashed into thinking the worst about Trump and ignoring his history all they need to do is fake the other sides big names in the files if need be.  Fake dossiers have proven enough to impeach as far as democrats are concerned. permalink parent award report block reply Ostia -2 points 2 hours ago Son, stop sending me the damn huffington post and acting like it's proof the democrats are squeaky clean. I'm not a child that just swallows anything that tells me what I want to hear. I can think critically. If they were faking their names, then why haven't WE released it since we're so confident they're there? permalink parent award report block reply sorrytodisagree 1 points 2 hours ago You're literally the only one invoking huffington post and also pretending I'm defending democrats?  Retarded or just trying to spin? permalink parent award report block reply view 5 more comments... sorrytodisagree 1 points 2 hours ago Yep.  Trump is still president.  That is proof they had nothing but their fake persecutions to dissuade him from running again. permalink parent award report block reply EyesSewnShut 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nCorse46 9 points 3 hours ago I agree. But that doesn’t answer why the President is running an Epstein pedophilia coverup permalink parent award report block reply Oldman1945 11 points 2 hours ago He should have released all files the morning after Epstein was found dead. All of this should have been released in Trump’s first term, at that exact moment. Saving it to win the election is fine, but not if that promise is broken. Release all files!! permalink parent award report block reply JanOctSept 1 points 2 hours ago In all fairness the Hillary emails about Russiagate in the Turducken safe existed under Trump too, meaning I don’t think the FBI was particularly loyal to him. permalink parent award report block reply MakeCaliforniaRED 1 points 1 hour ago It still isn’t. permalink parent award report block reply referencevariable 2 points 2 hours ago Because a deal was made in return for assistance getting his agenda accomplished. See here: https://patriots.win/p/19BZphlAOd/unfortunately-a-deal-was-made/c permalink parent award report block reply LostElf 1 points 3 hours ago The files are likely infested with false information targeting innocent people. That's what happens when an investigation is so thoroughly corrupted. permalink parent award report block reply flashersenpai 2 points 59 minutes ago the surest way to expose false information is to allow the internet to fact check it we got podesta's emails and we should get the epstein files too permalink parent award report block reply KernalMustard 1 points 27 minutes ago So if you were guilty wouldn't you declare its all false. Use your head people. The left doesnt use it because whats left would also take down their house of cards. Its  MAD files. permalink parent award report block reply TennesseeBorn 0 points 1 hour ago They 100 percent poisoned them. Why wouldn't they? permalink parent award report block reply KekistaniMemeLord 0 points 2 hours ago extremely dishonest framing. Literally no one here knows what is going on with the Epstein case and investigation atm. Immediately assuming Trump is running cover for pedo's or trying to protect them is some MSM scumbag level shit. permalink parent award report block reply\nOldman1945 11 points 2 hours ago He should have released all files the morning after Epstein was found dead. All of this should have been released in Trump’s first term, at that exact moment. Saving it to win the election is fine, but not if that promise is broken. Release all files!! permalink parent award report block reply JanOctSept 1 points 2 hours ago In all fairness the Hillary emails about Russiagate in the Turducken safe existed under Trump too, meaning I don’t think the FBI was particularly loyal to him. permalink parent award report block reply MakeCaliforniaRED 1 points 1 hour ago It still isn’t. permalink parent award report block reply\nJanOctSept 1 points 2 hours ago In all fairness the Hillary emails about Russiagate in the Turducken safe existed under Trump too, meaning I don’t think the FBI was particularly loyal to him. permalink parent award report block reply MakeCaliforniaRED 1 points 1 hour ago It still isn’t. permalink parent award report block reply\nMakeCaliforniaRED 1 points 1 hour ago It still isn’t. permalink parent award report block reply\nreferencevariable 2 points 2 hours ago Because a deal was made in return for assistance getting his agenda accomplished. See here: https://patriots.win/p/19BZphlAOd/unfortunately-a-deal-was-made/c permalink parent award report block reply\nLostElf 1 points 3 hours ago The files are likely infested with false information targeting innocent people. That's what happens when an investigation is so thoroughly corrupted. permalink parent award report block reply flashersenpai 2 points 59 minutes ago the surest way to expose false information is to allow the internet to fact check it we got podesta's emails and we should get the epstein files too permalink parent award report block reply KernalMustard 1 points 27 minutes ago So if you were guilty wouldn't you declare its all false. Use your head people. The left doesnt use it because whats left would also take down their house of cards. Its  MAD files. permalink parent award report block reply TennesseeBorn 0 points 1 hour ago They 100 percent poisoned them. Why wouldn't they? permalink parent award report block reply\nflashersenpai 2 points 59 minutes ago the surest way to expose false information is to allow the internet to fact check it we got podesta's emails and we should get the epstein files too permalink parent award report block reply\nKernalMustard 1 points 27 minutes ago So if you were guilty wouldn't you declare its all false. Use your head people. The left doesnt use it because whats left would also take down their house of cards. Its  MAD files. permalink parent award report block reply\nTennesseeBorn 0 points 1 hour ago They 100 percent poisoned them. Why wouldn't they? permalink parent award report block reply\nKekistaniMemeLord 0 points 2 hours ago extremely dishonest framing. Literally no one here knows what is going on with the Epstein case and investigation atm. Immediately assuming Trump is running cover for pedo's or trying to protect them is some MSM scumbag level shit. permalink parent award report block reply\nemorphia 2 points 2 hours ago it does not matter if any of it is real , the left will gobble up anything the dems say about Trump.  they say it so it is true for them. permalink parent award report block reply\nOstia 1 points 2 hours ago Not if their big names are in it too. Mutually assured destruction is a very real and viable tactic for blackmail and control. permalink parent award report block reply sorrytodisagree 2 points 2 hours ago And when people are brainwashed into thinking the worst about Trump and ignoring his history all they need to do is fake the other sides big names in the files if need be.  Fake dossiers have proven enough to impeach as far as democrats are concerned. permalink parent award report block reply Ostia -2 points 2 hours ago Son, stop sending me the damn huffington post and acting like it's proof the democrats are squeaky clean. I'm not a child that just swallows anything that tells me what I want to hear. I can think critically. If they were faking their names, then why haven't WE released it since we're so confident they're there? permalink parent award report block reply sorrytodisagree 1 points 2 hours ago You're literally the only one invoking huffington post and also pretending I'm defending democrats?  Retarded or just trying to spin? permalink parent award report block reply view 5 more comments...\nsorrytodisagree 2 points 2 hours ago And when people are brainwashed into thinking the worst about Trump and ignoring his history all they need to do is fake the other sides big names in the files if need be.  Fake dossiers have proven enough to impeach as far as democrats are concerned. permalink parent award report block reply Ostia -2 points 2 hours ago Son, stop sending me the damn huffington post and acting like it's proof the democrats are squeaky clean. I'm not a child that just swallows anything that tells me what I want to hear. I can think critically. If they were faking their names, then why haven't WE released it since we're so confident they're there? permalink parent award report block reply sorrytodisagree 1 points 2 hours ago You're literally the only one invoking huffington post and also pretending I'm defending democrats?  Retarded or just trying to spin? permalink parent award report block reply view 5 more comments...\nOstia -2 points 2 hours ago Son, stop sending me the damn huffington post and acting like it's proof the democrats are squeaky clean. I'm not a child that just swallows anything that tells me what I want to hear. I can think critically. If they were faking their names, then why haven't WE released it since we're so confident they're there? permalink parent award report block reply sorrytodisagree 1 points 2 hours ago You're literally the only one invoking huffington post and also pretending I'm defending democrats?  Retarded or just trying to spin? permalink parent award report block reply view 5 more comments...\nsorrytodisagree 1 points 2 hours ago You're literally the only one invoking huffington post and also pretending I'm defending democrats?  Retarded or just trying to spin? permalink parent award report block reply view 5 more comments...\nsorrytodisagree 1 points 2 hours ago Yep.  Trump is still president.  That is proof they had nothing but their fake persecutions to dissuade him from running again. permalink parent award report block reply\nEyesSewnShut 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nBidenSniffsLittleKid 16 points 3 hours ago Oh yeah? Release the Epstein files then permalink award report block reply sorrytodisagree -9 points 3 hours ago They've been spoiled.  Seeded with manufactured falsehoods as a poison chalice.  Proving the tampering won't convince doubters and makes all the rest suspect and inadmissible.  Withholding the fakes is easily exposed by the perpetrators as a \"coverup worse than the crime\" Watergate scenario. permalink parent award report block reply Corse46 9 points 3 hours ago How do you know? Did you read them before and after? permalink parent award report block reply bumpman 1 points 17 minutes ago Because we know the Biden officials are corrupt as all hell.. permalink parent award report block reply sorrytodisagree -4 points 3 hours ago Doesn't matter.  Fake is real and real is fake as far as democrats and idiots are concerned. I know Trump did not suddenly do a 180 because he woke up one day remembering he was in on it. permalink parent award report block reply Dangerous 2 points 2 hours ago fake is real and real is fake Always has been. You don't get to suggest that continuing this charade by hiding information suddenly changes things for the worse permalink parent award report block reply Ostia 0 points 2 hours ago He didn't do a 180. He's never really said anything at all about epstein short of trying to distance himself from him, ever. Even when he was murdered in prison under our watch. He's asking us to do a 180 because the issue has finally caught up to the times. permalink parent award report block reply view 2 more comments... Simple_Doot 2 points 3 hours ago This argument is absolutely unacceptable.  Release and let the chips fall where they may.  If all it takes to completely give up on an issue is the potential that someone has maybe lied about evidence then we will get buried faster and faster by more lies from our leaders.  Absurd! permalink parent award report block reply full_of_shot 2 points 3 hours ago My God, you'll believe anything Daddy Trump tells you. permalink parent award report block reply TrumpyMadeThemGrumpy -1 points 2 hours ago fuk off back to Reddit. permalink parent award report block reply\nsorrytodisagree -9 points 3 hours ago They've been spoiled.  Seeded with manufactured falsehoods as a poison chalice.  Proving the tampering won't convince doubters and makes all the rest suspect and inadmissible.  Withholding the fakes is easily exposed by the perpetrators as a \"coverup worse than the crime\" Watergate scenario. permalink parent award report block reply Corse46 9 points 3 hours ago How do you know? Did you read them before and after? permalink parent award report block reply bumpman 1 points 17 minutes ago Because we know the Biden officials are corrupt as all hell.. permalink parent award report block reply sorrytodisagree -4 points 3 hours ago Doesn't matter.  Fake is real and real is fake as far as democrats and idiots are concerned. I know Trump did not suddenly do a 180 because he woke up one day remembering he was in on it. permalink parent award report block reply Dangerous 2 points 2 hours ago fake is real and real is fake Always has been. You don't get to suggest that continuing this charade by hiding information suddenly changes things for the worse permalink parent award report block reply Ostia 0 points 2 hours ago He didn't do a 180. He's never really said anything at all about epstein short of trying to distance himself from him, ever. Even when he was murdered in prison under our watch. He's asking us to do a 180 because the issue has finally caught up to the times. permalink parent award report block reply view 2 more comments... Simple_Doot 2 points 3 hours ago This argument is absolutely unacceptable.  Release and let the chips fall where they may.  If all it takes to completely give up on an issue is the potential that someone has maybe lied about evidence then we will get buried faster and faster by more lies from our leaders.  Absurd! permalink parent award report block reply full_of_shot 2 points 3 hours ago My God, you'll believe anything Daddy Trump tells you. permalink parent award report block reply TrumpyMadeThemGrumpy -1 points 2 hours ago fuk off back to Reddit. permalink parent award report block reply\nCorse46 9 points 3 hours ago How do you know? Did you read them before and after? permalink parent award report block reply bumpman 1 points 17 minutes ago Because we know the Biden officials are corrupt as all hell.. permalink parent award report block reply sorrytodisagree -4 points 3 hours ago Doesn't matter.  Fake is real and real is fake as far as democrats and idiots are concerned. I know Trump did not suddenly do a 180 because he woke up one day remembering he was in on it. permalink parent award report block reply Dangerous 2 points 2 hours ago fake is real and real is fake Always has been. You don't get to suggest that continuing this charade by hiding information suddenly changes things for the worse permalink parent award report block reply Ostia 0 points 2 hours ago He didn't do a 180. He's never really said anything at all about epstein short of trying to distance himself from him, ever. Even when he was murdered in prison under our watch. He's asking us to do a 180 because the issue has finally caught up to the times. permalink parent award report block reply view 2 more comments...\nbumpman 1 points 17 minutes ago Because we know the Biden officials are corrupt as all hell.. permalink parent award report block reply\nsorrytodisagree -4 points 3 hours ago Doesn't matter.  Fake is real and real is fake as far as democrats and idiots are concerned. I know Trump did not suddenly do a 180 because he woke up one day remembering he was in on it. permalink parent award report block reply Dangerous 2 points 2 hours ago fake is real and real is fake Always has been. You don't get to suggest that continuing this charade by hiding information suddenly changes things for the worse permalink parent award report block reply Ostia 0 points 2 hours ago He didn't do a 180. He's never really said anything at all about epstein short of trying to distance himself from him, ever. Even when he was murdered in prison under our watch. He's asking us to do a 180 because the issue has finally caught up to the times. permalink parent award report block reply view 2 more comments...\nDangerous 2 points 2 hours ago fake is real and real is fake Always has been. You don't get to suggest that continuing this charade by hiding information suddenly changes things for the worse permalink parent award report block reply\nOstia 0 points 2 hours ago He didn't do a 180. He's never really said anything at all about epstein short of trying to distance himself from him, ever. Even when he was murdered in prison under our watch. He's asking us to do a 180 because the issue has finally caught up to the times. permalink parent award report block reply view 2 more comments...\nSimple_Doot 2 points 3 hours ago This argument is absolutely unacceptable.  Release and let the chips fall where they may.  If all it takes to completely give up on an issue is the potential that someone has maybe lied about evidence then we will get buried faster and faster by more lies from our leaders.  Absurd! permalink parent award report block reply\nfull_of_shot 2 points 3 hours ago My God, you'll believe anything Daddy Trump tells you. permalink parent award report block reply TrumpyMadeThemGrumpy -1 points 2 hours ago fuk off back to Reddit. permalink parent award report block reply\nTrumpyMadeThemGrumpy -1 points 2 hours ago fuk off back to Reddit. permalink parent award report block reply\nThorsonTT 16 points 3 hours ago The redacted VICTIM is Virginia Giuffre.  She has made statements that she never saw Trump do anything wrong.  The emails are complaining that Trump, basically, isn't falling into their trap. permalink award report block reply PhoneBandit 1 points 1 hour ago Yes. The only conclusion you can draw from this is that Trump knew of the sex business but was not making a huge stink over it. That doesn't implicate him to me. I'm sure there are hundreds of government officials aware of heinous crimes that they turn a blind eye to. permalink parent award report block reply ThorsonTT 2 points 1 hour ago I'd bet that so much evidence has been destroyed or polluted that not enough remains to give to a grand jury with any hope of a conviction. permalink parent award report block reply\nPhoneBandit 1 points 1 hour ago Yes. The only conclusion you can draw from this is that Trump knew of the sex business but was not making a huge stink over it. That doesn't implicate him to me. I'm sure there are hundreds of government officials aware of heinous crimes that they turn a blind eye to. permalink parent award report block reply ThorsonTT 2 points 1 hour ago I'd bet that so much evidence has been destroyed or polluted that not enough remains to give to a grand jury with any hope of a conviction. permalink parent award report block reply\nThorsonTT 2 points 1 hour ago I'd bet that so much evidence has been destroyed or polluted that not enough remains to give to a grand jury with any hope of a conviction. permalink parent award report block reply\nKricket 12 points 3 hours ago If they had anything real, they would have burned him well before now. permalink award report block reply liberalshitlord -2 points 3 hours ago Him and Clinton kek, kek, kek permalink parent award report block reply\nliberalshitlord -2 points 3 hours ago Him and Clinton kek, kek, kek permalink parent award report block reply\nguywholikesDjtof2024 9 points 3 hours ago But remember, QUESTION if a thing is real or fake. Never forget Charlie Kirk. permalink award report block reply Oldman1945 4 points 2 hours ago There were suspicious Google trends searches from Israel right before Charlie's murder. Had to be an Op. permalink parent award report block reply TrumpTurd69 -1 points 3 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nOldman1945 4 points 2 hours ago There were suspicious Google trends searches from Israel right before Charlie's murder. Had to be an Op. permalink parent award report block reply\nTrumpTurd69 -1 points 3 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nshialecuck007 7 points 3 hours ago Democrats had all this information when they had their investigations subcommittee under Biden. Durbin himself had the flight logs and refused to release those under pressure.\nIF the Democrats had ANYTHING they would have thrown those cards out on the table long ago to burn Trump.\nIT'S A NOTHING BURGER! permalink award report block reply\nFusionBlack 7 points 3 hours ago They failed on the shutdown so they will throw anything aginst the wall. permalink award report block reply Mobmando 5 points 3 hours ago Did they though? I hear it's the biden agreement so conservatives won nothing, having not actually needed the votes.  They had the 51 required to make it happen. Also, my understanding is that the resolution is for 3 months only. permalink parent award report block reply\nMobmando 5 points 3 hours ago Did they though? I hear it's the biden agreement so conservatives won nothing, having not actually needed the votes.  They had the 51 required to make it happen. Also, my understanding is that the resolution is for 3 months only. permalink parent award report block reply\nlostmyoldpassword 6 points 3 hours ago Actual human being makes post critical of Trump - deleted almost instantly - 12 super organic threads no one gives a fuck about immediately pop up.  This shit is downright fascinating to watch. permalink award report block reply DT170x 10 points 3 hours ago I see alot of posts of users being critical of Trump and not be blocked or banned. Then again forum sliders is going to forum slide. permalink parent award report block reply doug2 4 points 3 hours ago Read the rules dude permalink parent award report block reply BidenSniffsLittleKid -6 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply DT170x -2 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply BidenSniffsLittleKid -3 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments... Kricket 8 points 3 hours ago This ain’t Reddit, champ. No one cares about your posts or stickies or upvotes or whatever other gay shit you’re on about. Rule 1: be here for Trump and MAGA or GTFO. permalink parent award report block reply AVeryNakedMan 3 points 3 hours ago be here for Trump and MAGA The problem is that lately Trump has been doing some non-MAGA things, like refusing to release the Epstein files, or defending H1B. permalink parent award report block reply flashersenpai 1 points 57 minutes ago agree \"and MAGA\" is the important part why would I be here, for example, if Trump signed the Super NFA to confiscate everyone's guns? permalink parent award report block reply lostmyoldpassword 2 points 3 hours ago Read the room - go talk to your fucking neighbors.  The winds have shifted, buck-o. permalink parent award report block reply markolbb 5 points 3 hours ago There always have been and always will be some people here who worship Trump more than they believe in MAGA. He could literally piss in their face and they would say it's based. I think that this is a fairly small percentage of users, probably half of the interactions I have are with legitimately thinking people who can use their brains and be rightfully critical of a man who is still a politician at the end of the day. Some people here are actually the cultists that the left thinks we all are, though. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago I started reading through his post history - and he's a self righteous douchebag anyway.  So everything checks out. permalink parent award report block reply KekistaniMemeLord 1 points 2 hours ago Reddit fag language detected. Nobody fucking \"worships\" him you moron. He has literally proven himself by fighting for MAGA for 10 damn years and almost getting killed for the effort. I don't see thoughtful critique of our president, I see the absolute dumbest fucks abandoning all critical thought to attack him no different than a lefty would. It's sickening. permalink parent award report block reply view 2 more comments... Kricket 4 points 3 hours ago trust me bro You lost? MAGA OR GTFO. We all see you. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago Please man, I'm reading your post history - you are clearly an actual human being who seems relatively intelligent.  I would love to actually talk to you man. permalink parent award report block reply lostmyoldpassword 0 points 3 hours ago Or maybe you aren't.  Or maybe you are just scared, and don't know how to react to Trump doing this shit.  Whatever - message me whenever if you want. permalink parent award report block reply TrumpyMadeThemGrumpy 0 points 2 hours ago Winds haven't shifted at all.  America still hates the terrorists, pedophiles, and anti-white racist BLMers on the left.  Time for you to read the room and talk to people outside your bubble. permalink parent award report block reply lostmyoldpassword 1 points 2 hours ago Anywhere in fucking anything I said - did I elude to my hatred for those people going away? Why are you trying to put shit in my mouth?  Why do you boil everything down to red vs blue, us vs. them - the fuck is your problem? permalink parent award report block reply lostmyoldpassword -2 points 3 hours ago You know what I don't want to fight with you.  I think you might be an actual human being.  Maybe.  I'm sorry my post has angered you - but come on man.  What the fuck is he doing?  Don't just reflexively yell shit at me. Talk to me. permalink parent award report block reply lostmyoldpassword -2 points 3 hours ago srsly man, read my history - pls, talk to me about this shit permalink parent award report block reply KernalMustard 1 points 21 minutes ago Stop being a Ostrich. permalink parent award report block reply KekistaniMemeLord 1 points 2 hours ago was the post a thoughtful critique of Trump or was it just ouright demonizing him or claiming he's compromised based on absolutely nothing? permalink parent award report block reply lostmyoldpassword 1 points 2 hours ago It was a man screaming out in pain, one who I'm pretty sure wasn't a bot or a shill or a handshake.  We can't just immediately shit on these people - not with everything going on. permalink parent award report block reply lostmyoldpassword -7 points 3 hours ago And it gets stickied - just fucking wow. permalink parent award report block reply bck- 1 points 3 hours ago Comment removed by community filter. permalink parent award report block reply\nDT170x 10 points 3 hours ago I see alot of posts of users being critical of Trump and not be blocked or banned. Then again forum sliders is going to forum slide. permalink parent award report block reply doug2 4 points 3 hours ago Read the rules dude permalink parent award report block reply BidenSniffsLittleKid -6 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply DT170x -2 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply BidenSniffsLittleKid -3 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments...\ndoug2 4 points 3 hours ago Read the rules dude permalink parent award report block reply\nBidenSniffsLittleKid -6 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply DT170x -2 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply BidenSniffsLittleKid -3 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments...\nDT170x -2 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply BidenSniffsLittleKid -3 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments...\nBidenSniffsLittleKid -3 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply view 1 more comments...\nKricket 8 points 3 hours ago This ain’t Reddit, champ. No one cares about your posts or stickies or upvotes or whatever other gay shit you’re on about. Rule 1: be here for Trump and MAGA or GTFO. permalink parent award report block reply AVeryNakedMan 3 points 3 hours ago be here for Trump and MAGA The problem is that lately Trump has been doing some non-MAGA things, like refusing to release the Epstein files, or defending H1B. permalink parent award report block reply flashersenpai 1 points 57 minutes ago agree \"and MAGA\" is the important part why would I be here, for example, if Trump signed the Super NFA to confiscate everyone's guns? permalink parent award report block reply lostmyoldpassword 2 points 3 hours ago Read the room - go talk to your fucking neighbors.  The winds have shifted, buck-o. permalink parent award report block reply markolbb 5 points 3 hours ago There always have been and always will be some people here who worship Trump more than they believe in MAGA. He could literally piss in their face and they would say it's based. I think that this is a fairly small percentage of users, probably half of the interactions I have are with legitimately thinking people who can use their brains and be rightfully critical of a man who is still a politician at the end of the day. Some people here are actually the cultists that the left thinks we all are, though. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago I started reading through his post history - and he's a self righteous douchebag anyway.  So everything checks out. permalink parent award report block reply KekistaniMemeLord 1 points 2 hours ago Reddit fag language detected. Nobody fucking \"worships\" him you moron. He has literally proven himself by fighting for MAGA for 10 damn years and almost getting killed for the effort. I don't see thoughtful critique of our president, I see the absolute dumbest fucks abandoning all critical thought to attack him no different than a lefty would. It's sickening. permalink parent award report block reply view 2 more comments... Kricket 4 points 3 hours ago trust me bro You lost? MAGA OR GTFO. We all see you. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago Please man, I'm reading your post history - you are clearly an actual human being who seems relatively intelligent.  I would love to actually talk to you man. permalink parent award report block reply lostmyoldpassword 0 points 3 hours ago Or maybe you aren't.  Or maybe you are just scared, and don't know how to react to Trump doing this shit.  Whatever - message me whenever if you want. permalink parent award report block reply TrumpyMadeThemGrumpy 0 points 2 hours ago Winds haven't shifted at all.  America still hates the terrorists, pedophiles, and anti-white racist BLMers on the left.  Time for you to read the room and talk to people outside your bubble. permalink parent award report block reply lostmyoldpassword 1 points 2 hours ago Anywhere in fucking anything I said - did I elude to my hatred for those people going away? Why are you trying to put shit in my mouth?  Why do you boil everything down to red vs blue, us vs. them - the fuck is your problem? permalink parent award report block reply lostmyoldpassword -2 points 3 hours ago You know what I don't want to fight with you.  I think you might be an actual human being.  Maybe.  I'm sorry my post has angered you - but come on man.  What the fuck is he doing?  Don't just reflexively yell shit at me. Talk to me. permalink parent award report block reply lostmyoldpassword -2 points 3 hours ago srsly man, read my history - pls, talk to me about this shit permalink parent award report block reply KernalMustard 1 points 21 minutes ago Stop being a Ostrich. permalink parent award report block reply\nAVeryNakedMan 3 points 3 hours ago be here for Trump and MAGA The problem is that lately Trump has been doing some non-MAGA things, like refusing to release the Epstein files, or defending H1B. permalink parent award report block reply flashersenpai 1 points 57 minutes ago agree \"and MAGA\" is the important part why would I be here, for example, if Trump signed the Super NFA to confiscate everyone's guns? permalink parent award report block reply\nflashersenpai 1 points 57 minutes ago agree \"and MAGA\" is the important part why would I be here, for example, if Trump signed the Super NFA to confiscate everyone's guns? permalink parent award report block reply\nlostmyoldpassword 2 points 3 hours ago Read the room - go talk to your fucking neighbors.  The winds have shifted, buck-o. permalink parent award report block reply markolbb 5 points 3 hours ago There always have been and always will be some people here who worship Trump more than they believe in MAGA. He could literally piss in their face and they would say it's based. I think that this is a fairly small percentage of users, probably half of the interactions I have are with legitimately thinking people who can use their brains and be rightfully critical of a man who is still a politician at the end of the day. Some people here are actually the cultists that the left thinks we all are, though. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago I started reading through his post history - and he's a self righteous douchebag anyway.  So everything checks out. permalink parent award report block reply KekistaniMemeLord 1 points 2 hours ago Reddit fag language detected. Nobody fucking \"worships\" him you moron. He has literally proven himself by fighting for MAGA for 10 damn years and almost getting killed for the effort. I don't see thoughtful critique of our president, I see the absolute dumbest fucks abandoning all critical thought to attack him no different than a lefty would. It's sickening. permalink parent award report block reply view 2 more comments... Kricket 4 points 3 hours ago trust me bro You lost? MAGA OR GTFO. We all see you. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago Please man, I'm reading your post history - you are clearly an actual human being who seems relatively intelligent.  I would love to actually talk to you man. permalink parent award report block reply lostmyoldpassword 0 points 3 hours ago Or maybe you aren't.  Or maybe you are just scared, and don't know how to react to Trump doing this shit.  Whatever - message me whenever if you want. permalink parent award report block reply TrumpyMadeThemGrumpy 0 points 2 hours ago Winds haven't shifted at all.  America still hates the terrorists, pedophiles, and anti-white racist BLMers on the left.  Time for you to read the room and talk to people outside your bubble. permalink parent award report block reply lostmyoldpassword 1 points 2 hours ago Anywhere in fucking anything I said - did I elude to my hatred for those people going away? Why are you trying to put shit in my mouth?  Why do you boil everything down to red vs blue, us vs. them - the fuck is your problem? permalink parent award report block reply lostmyoldpassword -2 points 3 hours ago You know what I don't want to fight with you.  I think you might be an actual human being.  Maybe.  I'm sorry my post has angered you - but come on man.  What the fuck is he doing?  Don't just reflexively yell shit at me. Talk to me. permalink parent award report block reply lostmyoldpassword -2 points 3 hours ago srsly man, read my history - pls, talk to me about this shit permalink parent award report block reply\nmarkolbb 5 points 3 hours ago There always have been and always will be some people here who worship Trump more than they believe in MAGA. He could literally piss in their face and they would say it's based. I think that this is a fairly small percentage of users, probably half of the interactions I have are with legitimately thinking people who can use their brains and be rightfully critical of a man who is still a politician at the end of the day. Some people here are actually the cultists that the left thinks we all are, though. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago I started reading through his post history - and he's a self righteous douchebag anyway.  So everything checks out. permalink parent award report block reply KekistaniMemeLord 1 points 2 hours ago Reddit fag language detected. Nobody fucking \"worships\" him you moron. He has literally proven himself by fighting for MAGA for 10 damn years and almost getting killed for the effort. I don't see thoughtful critique of our president, I see the absolute dumbest fucks abandoning all critical thought to attack him no different than a lefty would. It's sickening. permalink parent award report block reply view 2 more comments...\nlostmyoldpassword 1 points 3 hours ago I started reading through his post history - and he's a self righteous douchebag anyway.  So everything checks out. permalink parent award report block reply\nKekistaniMemeLord 1 points 2 hours ago Reddit fag language detected. Nobody fucking \"worships\" him you moron. He has literally proven himself by fighting for MAGA for 10 damn years and almost getting killed for the effort. I don't see thoughtful critique of our president, I see the absolute dumbest fucks abandoning all critical thought to attack him no different than a lefty would. It's sickening. permalink parent award report block reply view 2 more comments...\nKricket 4 points 3 hours ago trust me bro You lost? MAGA OR GTFO. We all see you. permalink parent award report block reply lostmyoldpassword 1 points 3 hours ago Please man, I'm reading your post history - you are clearly an actual human being who seems relatively intelligent.  I would love to actually talk to you man. permalink parent award report block reply lostmyoldpassword 0 points 3 hours ago Or maybe you aren't.  Or maybe you are just scared, and don't know how to react to Trump doing this shit.  Whatever - message me whenever if you want. permalink parent award report block reply\nlostmyoldpassword 1 points 3 hours ago Please man, I'm reading your post history - you are clearly an actual human being who seems relatively intelligent.  I would love to actually talk to you man. permalink parent award report block reply\nlostmyoldpassword 0 points 3 hours ago Or maybe you aren't.  Or maybe you are just scared, and don't know how to react to Trump doing this shit.  Whatever - message me whenever if you want. permalink parent award report block reply\nTrumpyMadeThemGrumpy 0 points 2 hours ago Winds haven't shifted at all.  America still hates the terrorists, pedophiles, and anti-white racist BLMers on the left.  Time for you to read the room and talk to people outside your bubble. permalink parent award report block reply lostmyoldpassword 1 points 2 hours ago Anywhere in fucking anything I said - did I elude to my hatred for those people going away? Why are you trying to put shit in my mouth?  Why do you boil everything down to red vs blue, us vs. them - the fuck is your problem? permalink parent award report block reply\nlostmyoldpassword 1 points 2 hours ago Anywhere in fucking anything I said - did I elude to my hatred for those people going away? Why are you trying to put shit in my mouth?  Why do you boil everything down to red vs blue, us vs. them - the fuck is your problem? permalink parent award report block reply\nlostmyoldpassword -2 points 3 hours ago You know what I don't want to fight with you.  I think you might be an actual human being.  Maybe.  I'm sorry my post has angered you - but come on man.  What the fuck is he doing?  Don't just reflexively yell shit at me. Talk to me. permalink parent award report block reply lostmyoldpassword -2 points 3 hours ago srsly man, read my history - pls, talk to me about this shit permalink parent award report block reply\nlostmyoldpassword -2 points 3 hours ago srsly man, read my history - pls, talk to me about this shit permalink parent award report block reply\nKernalMustard 1 points 21 minutes ago Stop being a Ostrich. permalink parent award report block reply\nKekistaniMemeLord 1 points 2 hours ago was the post a thoughtful critique of Trump or was it just ouright demonizing him or claiming he's compromised based on absolutely nothing? permalink parent award report block reply lostmyoldpassword 1 points 2 hours ago It was a man screaming out in pain, one who I'm pretty sure wasn't a bot or a shill or a handshake.  We can't just immediately shit on these people - not with everything going on. permalink parent award report block reply\nlostmyoldpassword 1 points 2 hours ago It was a man screaming out in pain, one who I'm pretty sure wasn't a bot or a shill or a handshake.  We can't just immediately shit on these people - not with everything going on. permalink parent award report block reply\nlostmyoldpassword -7 points 3 hours ago And it gets stickied - just fucking wow. permalink parent award report block reply\nbck- 1 points 3 hours ago Comment removed by community filter. permalink parent award report block reply\nSanitas 6 points 3 hours ago How can democrats hide exculpatory information? The Trump admin has access to fucking EVERYTHING. Just exculpate Trump yourselves! permalink award report block reply\nAggrieved03 5 points 2 hours ago Friendly reminder, Epstein didn't kill himself. permalink award report block reply\nfriarfox 4 points 2 hours ago No one cares about disclosure. It's about prosecutions. Children were raped and abused be powerful men and that's the point.I don't care if you were Jewish, Christian or Muslim. You tortured kids for your pleasure. I want fucking prosecutions. If you can't give me that then you are complicit and every bit as guilty. permalink award report block reply\nMorokei 4 points 3 hours ago Just one of many reasons we should have taken the lead on records disclosure not belittled it and insulted those of us arguing for this. permalink award report block reply\nSnivelingsnitches1 4 points 3 hours ago Easy as pie, just release all the files so we can all see Trump isn’t in them! Problem solved. permalink award report block reply\nSocraticMethod1 4 points 3 hours ago At this point,  release it ALL UNREDACTED, this drip feed shit is way worse than the blowback that just releasing it would do. permalink award report block reply TrumpRideorDie74 1 points 2 hours ago There's a drip feed on the epstein files? I'd like to see any of that. permalink parent award report block reply\nTrumpRideorDie74 1 points 2 hours ago There's a drip feed on the epstein files? I'd like to see any of that. permalink parent award report block reply\nFrix 3 points 2 hours ago Ok, sure the Federalist is going to set the record straight, when 1000s of media organizations, and millions of drunk wine mom harpies take to X and spread this. Welcome to the next gay dem psyop. permalink award report block reply\ndrmrboy 3 points 3 hours ago If the current theory by most is that the dems altered the docs during the Biden years, knowing Trump would release them ... then the good guys need to find the originals and release those.  Something needs to be released to find out who has been blackmailed by Israel and be held to justice.  🤓 permalink award report block reply sorrytodisagree 4 points 3 hours ago You're on the right track, but the tail doesn't wag the dog.  To the deep state Israel's mossad are just subcontractors and a rounding error in the CIA's budget. Epstein was handling CIA covert funds since 1983. permalink parent award report block reply\nsorrytodisagree 4 points 3 hours ago You're on the right track, but the tail doesn't wag the dog.  To the deep state Israel's mossad are just subcontractors and a rounding error in the CIA's budget. Epstein was handling CIA covert funds since 1983. permalink parent award report block reply\nconservativefrank 3 points 2 hours ago It doesn't matter. The vast majority of Americans see the headlines and stories, and they won't dig further. To most Americans, this is the truth - Trump had sex with underage people on Epstein's island. permalink award report block reply\nGuerillaYourDreams 3 points 3 hours ago Their entire \"Katie Johnson\" bullshit scenario is all lies, too. If Trump was guilty of these things, there is no way they wouldn't have used it against him during the Biden fiasco years. permalink award report block reply\nRyanKeyOh 2 points 1 hour ago We don’t hate the media enough. Big headline, photo with Epstein Actual email content: Trump asks Epstein to stay away for Mar a lago (only member ever asked to resign) and asks Maxwell to stop offering him girls permalink award report block reply KernalMustard 1 points 9 minutes ago They were running a honeypot operation for blackmail. Dude had money coming out his ears. The only thing left is being the man behind the curtian. He didnt do this alone. He passed it along and used it for blackmail. There isnt any doubt thats what he did. This is why it hasnt been released. Its a giant fucking bomb permalink parent award report block reply\nKernalMustard 1 points 9 minutes ago They were running a honeypot operation for blackmail. Dude had money coming out his ears. The only thing left is being the man behind the curtian. He didnt do this alone. He passed it along and used it for blackmail. There isnt any doubt thats what he did. This is why it hasnt been released. Its a giant fucking bomb permalink parent award report block reply\nceva 2 points 3 hours ago RELEASE THE EPSTEIN FILES permalink award report block reply\nIvIA6A 2 points 2 hours ago Once again, if there was anything there, you think Obama or Biden wouldn't have released it during the campaign? permalink award report block reply TrumpRideorDie74 1 points 2 hours ago When Trump ran for re-election in 2020 I didn't understand why he never commercialized the mountain of clips showing Biden acting strange with little girls. He was sniffing their hair and touching them in ways only a parent should which caused these kids to react in a way where they wanted to be anywhere else. Every fuckin thing they try to get Trump on was all fabricated bullshit while all have access to the Biden tapes which seem to have been swept under the rug. This pede remembers. permalink parent award report block reply sod_off_shotgun 1 points 2 hours ago It's the same with the first impeachment. Imagine Bidet openly discussing, some might say bragging, about a quid pro quo in Ukraine. Now imagine he did that in a very public way that is available to view by anyone.  What's that you say? It actually happened? Quick let's impeach Trump for it. permalink parent award report block reply\nTrumpRideorDie74 1 points 2 hours ago When Trump ran for re-election in 2020 I didn't understand why he never commercialized the mountain of clips showing Biden acting strange with little girls. He was sniffing their hair and touching them in ways only a parent should which caused these kids to react in a way where they wanted to be anywhere else. Every fuckin thing they try to get Trump on was all fabricated bullshit while all have access to the Biden tapes which seem to have been swept under the rug. This pede remembers. permalink parent award report block reply sod_off_shotgun 1 points 2 hours ago It's the same with the first impeachment. Imagine Bidet openly discussing, some might say bragging, about a quid pro quo in Ukraine. Now imagine he did that in a very public way that is available to view by anyone.  What's that you say? It actually happened? Quick let's impeach Trump for it. permalink parent award report block reply\nsod_off_shotgun 1 points 2 hours ago It's the same with the first impeachment. Imagine Bidet openly discussing, some might say bragging, about a quid pro quo in Ukraine. Now imagine he did that in a very public way that is available to view by anyone.  What's that you say? It actually happened? Quick let's impeach Trump for it. permalink parent award report block reply\nSnivelingsnitches1 2 points 3 hours ago Just release all the files and we can decide for ourselves! permalink award report block reply\nMhmm2MoreWeeks 2 points 2 hours ago Not only is it not going away, but its continuing to be used to undermine Trump. He handled it so badly. Much like his choice of AG. permalink award report block reply\nMySidesGoUp 2 points 1 hour ago Trump gave them all the space in the world after calling Epstein a hoax…. permalink award report block reply\nmikethemarine 2 points 3 hours ago Don't these MF dems have any fucking morals at all to ever tell the truth about ANY FUCKING THING, it say in the bible that the devil knows how to lie. They are all demons, yep I guess they are all demons. Yes, the Bible states that the devil is a liar. A key verse is\nJohn 8:44, where Jesus refers to the devil as \"a murderer from the beginning\" and a liar who does not stand in the truth because \"there is no truth in him.\" This verse says that when he lies, he speaks out of his own character because he is a liar and the father of lies, according to Open Bible Info and Open the Bible. Yes, the Bible states that demons know how to lie, with the most prominent example being Satan being called \"the father of lies\" in John 8:44. Demons are portrayed as being masters of deception, using lies as a primary tactic to mislead people. permalink award report block reply\nThouShallNotSteal 2 points 2 hours ago Well we all know 1 thing for sure...Bill Clinton is a rapist. permalink award report block reply\nsod_off_shotgun 2 points 2 hours ago Normies need to exercise some common sense. If there was anything incriminating regarding Trump and victims, it would have been leaked years ago. Sure, his name is mentioned at various points, but never anything related to him acting improperly. I know there will be zero evidence of that, because the dems would have already used it. permalink award report block reply\nSouth_Florida_Guy 2 points 3 hours ago If any of it were ever true they would have used it a LONG time ago before he got elected not once but twice. You'd have to be retarded to think otherwise. permalink award report block reply Snivelingsnitches1 2 points 3 hours ago Cool release the files then so we can see for ourselves! Tick tock… permalink parent award report block reply Steve56775 2 points 2 hours ago Isn’t there a second binder on Bondis desk waiting to be released? permalink parent award report block reply\nSnivelingsnitches1 2 points 3 hours ago Cool release the files then so we can see for ourselves! Tick tock… permalink parent award report block reply Steve56775 2 points 2 hours ago Isn’t there a second binder on Bondis desk waiting to be released? permalink parent award report block reply\nSteve56775 2 points 2 hours ago Isn’t there a second binder on Bondis desk waiting to be released? permalink parent award report block reply\nMAGAnificent700 2 points 2 hours ago Always is.  If there was anything there, they would have got him already. Now sue all the publications that ran with that garbage. permalink award report block reply TrumpRideorDie74 2 points 2 hours ago That's the real answer. The dems have thrown everything and the kitchen sink against him and still can't find anything to persecute him on so they create lies, hoaxes and misdirection. They're at the point where they're throwing everything against the wall and hoping anything sticks. Newsflash: nothing will stick because if they had anything worth a damn he'd be in jail by now. permalink parent award report block reply sod_off_shotgun 2 points 2 hours ago That's what I said in another comment. The fact that there has been no leak linking Trump to sex trafficking confirms there aren't any, as the dems would have used it already permalink parent award report block reply MAGAnificent700 1 points 1 hour ago Sue and add ANOTHER wing to the White House using the money.   Drives the liberals nuts when he does something magnanimous. permalink parent award report block reply\nTrumpRideorDie74 2 points 2 hours ago That's the real answer. The dems have thrown everything and the kitchen sink against him and still can't find anything to persecute him on so they create lies, hoaxes and misdirection. They're at the point where they're throwing everything against the wall and hoping anything sticks. Newsflash: nothing will stick because if they had anything worth a damn he'd be in jail by now. permalink parent award report block reply sod_off_shotgun 2 points 2 hours ago That's what I said in another comment. The fact that there has been no leak linking Trump to sex trafficking confirms there aren't any, as the dems would have used it already permalink parent award report block reply MAGAnificent700 1 points 1 hour ago Sue and add ANOTHER wing to the White House using the money.   Drives the liberals nuts when he does something magnanimous. permalink parent award report block reply\nsod_off_shotgun 2 points 2 hours ago That's what I said in another comment. The fact that there has been no leak linking Trump to sex trafficking confirms there aren't any, as the dems would have used it already permalink parent award report block reply\nMAGAnificent700 1 points 1 hour ago Sue and add ANOTHER wing to the White House using the money.   Drives the liberals nuts when he does something magnanimous. permalink parent award report block reply\nReturningtogod 2 points 2 hours ago Altogether now:  NO SHIT SHERLOCK. permalink award report block reply\nNYforTrump 1 points 1 minute ago You know there is nothing actually damning in that Epstein crap about Trump since it would have been leaked during Biden. permalink award report block reply\nfat50 1 points 2 hours ago They have so much \"evidence\" against Trump, they failed to use it to smear him during 3 elections and numerous fake lawsuits. permalink award report block reply\nmikejones 1 points 2 hours ago We stall and waste time permalink award report block reply\nstroemia 1 points 21 minutes ago IT WAS HILLARY, BILL AND TED. THATS WHO SOLD US OUT. permalink award report block reply\nauntjemima 1 points 3 hours ago Weird ass comments in this one popcorn permalink award report block reply\nSmellyButtFart 1 points 57 minutes ago Trump pouched a real estate deal Epstein was putting together at the same time he banned him from Trump properties.  Trump made millions of dollars by snatching the opportunity away from him. The real estate deal was actually kind of unethical. He bought a mansion with a lot of land and then subdivided the property, built more mansions and sold it all off.  I HATE SUBDIVIDERS permalink award report block reply\nhairless_ap3 1 points 2 hours ago No shit really permalink award report block reply\nM-m-m-my-corona 1 points 3 hours ago Well if Trump would just release the docs then we could read them and know the truth.  But he won't. permalink award report block reply\nmightyclaw 1 points 3 hours ago Ace of Spades provides a good breakdown as well: https://acecomments.mu.nu/?post=417280 permalink award report block reply\nMageGills 1 points 17 minutes ago It's simply a distraction from his atrocious interview last night. permalink award report block reply\nSigSauer1776 -1 points 3 hours ago Trump was 100% involved permalink award report block reply\nlostmyoldpassword -2 points 3 hours ago ITT - all of the mods doing all of the things. permalink award report block reply\nTiggerLovingPooh -5 points 3 hours ago Yeah, shit is fake as the holocaust. permalink award report block reply\nSnivelingsnitches1 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:04:55.691725Z"
}