{
  "id": "8178242",
  "title": "1456FBI-MANIPULATED A US ELECTION: The Pipe Bomber’s Actions Were Necessary to Enable Speaker Pelosi",
  "url": "https://patriots.win/p/1ARK5A8CJe/fbimanipulated-a-us-election-the/c",
  "content": "1456 FBI-MANIPULATED A US ELECTION: The Pipe Bomber’s Actions Were Necessary to Enable Speaker Pelosi to Certify the 2020 Election for Joe Biden (joehoft.com) posted 3 days ago by 5DchessWatch 96 comments award share report block EXCLUSIVE: The Pipe Bomber’s Actions Were Necessary to Enable Speaker Pelosi to Certify the 2020 Election for Joe Biden | Joe Ho... The pipe bomber's actions were necessary to enable Speaker Pelosi to certify the 2020 Election for Joe Biden. It turns out that the pipe bomber on Jan 6 was not a man, as had been assumed for more than four years. Reports over the past 48 hours claim that ... joehoft.com\n96 comments Sort by Top Top New Worst Old Save yepyep 78 points 3 days ago Lindsey Graham is weak and comprised. permalink award report block reply Hanging_Chad 40 points 3 days ago his colon is compromised permalink parent award report block reply TooBright 6 points 3 days ago By COBRA! HAIL COBRA! Cobra runs the Muslims! Cobra runs the CIA. Cobra runs it all.\nYo Joe!\nDeath and destruction! forced inoculations! HAIL COBRA! permalink parent award report block reply Retardloserimsogay 3 points 3 days ago You have Tourette's too? permalink parent award report block reply TooBright 1 points 3 days ago The high energy needs to go somewhere. Old Alex Infometal. https://youtu.be/wuNgCrafpkE permalink parent award report block reply duznmatter 2 points 3 days ago Would that be sodomized as well? permalink parent award report block reply AwShitHereWeGoAgain 3 points 3 days ago Miss Lynsey has always been a commie kid-fucker. permalink parent award report block reply MemeLawd 2 points 3 days ago And a faggot permalink parent award report block reply TEXinLA 44 points 3 days ago LOCK HER UP. Then Squeeze Her Until She Sings... Rinse and Reeeeeepeat... permalink award report block reply 5DchessWatch OP 33 points 3 days ago We need to know who put her up to it.  That capuchin monkey faced cop would not have done this on her own.  She looks like about 100 IQ, and yet the CIA hired her right after (translation: the pipe bomb hoax was a gang initiation ritual to join cia). She's prob a janitor there or mailroom guy now.  She doesn't look smart enough to do anything useful.  Maybe they'll have her looking at sat images and finding buildings. permalink parent award report block reply drattastic1 12 points 3 days ago She's a good little order follower who'll arrest you and take you to the gulag or put a bullet in your head standing in front of a mass grave. Lefties get off on being evil and they don't want the brightest for the dirty work just the sickest. permalink parent award report block reply TEXinLA 10 points 3 days ago Absolutely. The former DC police chief was in on it too... permalink parent award report block reply 2020Gop 7 points 3 days ago Never Forget- Seth Rich permalink parent award report block reply TEXinLA 1 points 22 hours ago F permalink parent award report block reply HumblePepe 3 points 3 days ago She was the first to open fire into the crowd. She later testified against J6 hostages calling them traitors to the country. Just the gall of it. permalink parent award report block reply FusionBlack 39 points 3 days ago So, where the Hell is Bondi on this? permalink award report block reply harryparatestes 48 points 3 days ago She's on Fox. permalink parent award report block reply 5DchessWatch OP 16 points 3 days ago Sean, we at the justice department are outraged, and we're taking immediate action to bring justice to this matter <Leaves Fox Studio, Drives up to Chick Fil A line, waits 25 minute to place order> permalink parent award report block reply gravenspine 7 points 3 days ago This story is unrealistic. Chic fil a service is much faster. permalink parent award report block reply OrangeManBadasss 8 points 3 days ago Plus today is Sunday permalink parent award report block reply thrakaa40k 1 points 3 days ago Fast food chains are different depending on where you are.  I personally have sat in a chick-fil-a drive through for more than 25 minutes in San Jose, CA.  Chick-fil-a in CA is generally meh, but the Chick-fil-a in Kirkland, WA was great.  Mod Pizza in the Bay area is generally pretty bad (employees hate their job); but, Mod Pizza in the surrounding Seattle area is pretty good.  McDonalds in Woodinville, WA is probably the worst McDonalds I have ever been too (rich area, hardly anyone there, cant keep employees, food never fresh).  McDonalds in Everett, WA is one of the better ones (poor area, high crime rate, but always busy so food is always fresh). permalink parent award report block reply drattastic1 1 points 3 days ago Chick-fil-a is the fastest fast food in the business, try another franchise for your story. permalink parent award report block reply HumblePepe 1 points 3 days ago She's needs to go after college students criticizing Israel. permalink parent award report block reply jdemarco2014 9 points 3 days ago Scam bondi don’t care permalink parent award report block reply hillaryforprison 5 points 3 days ago She's busy doing her makeup and shopping at Kohl's. permalink parent award report block reply JimRaynor 4 points 3 days ago The folder is on her desk permalink parent award report block reply SaltySilverback13 2 points 3 days ago Busy drafting a strongly worded letter that will end up in the circular file. permalink parent award report block reply load 2 more comments... friedchicken 24 points 3 days ago Nothing else really matters that's posted here. The 2020 election was stolen, and it's an issue for ALL AMERICANS permalink award report block reply sovereign_citizen 3 points 3 days ago Bellwether counties suddenly stop being bellwether counties despite decades of near 100% consistency ( source ) Trump won key bellwether battleground states like Ohio and Florida and won them easily but lost just enough battleground states (where the rigged cities are located) to put him under 270 ( source ) Rigged cities produced implausibly high urban turnout but demographically identical cities in neighboring battleground states had normal urban turnout ( source ) Implausibly high number of Biden-only ballots (no down ballot selections) but the same phenomenon not seen with Trump ballots ( source ) Trump was only the 3rd incumbent president in US history to gain votes in each and every state from their first election. The other 2 were Nixon and Reagan, both were 49 state landslides! First “president” to magically get over 80 million “votes” when no one before had over 69. First “president” to have his opponent gain in popularity. First “president” to lose all bellwether counties outside his home state. First “president” to lose badly on election day and miraculously find votes in the days afterwards. First “president” to lose Iowa and Florida and Ohio in like 60 years. First “president” to magically outperform his political party in forever. First “president” to bomb in all his primary performance. Suspicious activity going on in these “rigged” cities... such as; blocking poll watchers... stopping the count late on election night with Trump in the lead but then resume counting hours later with huge statistically impossible spikes for Biden Vote counting was halted the night of the election in many swing states with no reason given or fake reasons supplied (water main, just toilet overflow) Votes flipped in real time on television, we even have recordings of them ( source ), which the media then deleted ( source ) with no explanation given as to why or how, and yet we saw a red wave, such as Rs flipping 12 seats & winning all 27 toss ups, while Ds had a dismal election night performance despite Biden shattering records Hundreds of eyewitnesses gave sworn testimony and affidavits at multiple states' legislative sessions detailing the election crimes Video evidence showing concealed cases of ballots being pulled out and scanned repeatedly in Georgia after the poll watchers were removed due to the \"water main leak\" which proved to be a lie. ( source Ballots were shown on video being counted multiple times (which CoO to GA Secretary of State, Gabriel Sterling said DID NOT HAPPEN as they were removed) and yet we find ballots with the exact same markings counted. ( source NY Times ran a smear article ( source ) about True the Vote who claimed poll data was sent to China then the next day the CEO of the company suing True the Vote was arrested for just that. ( source ) Google rigged the elections by censoring and blacklisting damaging articles from search results ( source ) Half a billion \"Zuckerbucks\" illegally drove Democrat get-out-the-vote efforts, mass mail-in voting, and ballot “curing,” whereby election workers “fix” mail-in ballot problems after the ballot has been submitted in rigged cities ( source ) Governors of rigged states illegally used executive orders to mass mailout ballots despite courts acknowledging it required the legislatures authority to authorize ( source ) Voters identified as indefinitely confined to illegally receive absentee ballots even though they are young and healthy ( source ) Ballots for voters under the age of 18 were counted ( source ) Voters submitted multiple ballots in the same state or across multiple states Voters submitted ballots in states they do not live in Ballots from nursing home residents who say they did not vote and some who are mentally unable to vote (Wayne County, MI Psychiatric Hospital) Ballots from non-existent addresses Thousands of ballots received hours after polls closed ( source ) Poll watchers illegally removed from polling places for questioning fraudulent vote counting Absentee ballots counted even though voters never requested or filled them out Forensic audit of the voting machines used in rigged cities produced unexplainably high error rates and the edit logs were nowhere to be found because they had been wiped ( source ). Video evidence of the person who wiped them was turned over to the AZ Attorney General Mark Brnovich and he did nothing. Ballot images were manipulated ( source ) because it's super easy for election supervisors ( source ) Vote counting machines had overridden vote selection percentages above 60% in some counties, and FAR above normal ranges in many others (Antrim county machine audit) Vote counting machines had the overridden vote selection logs wiped for 2020, but previous years' log data was still there (Antrim county machine audit) ( source ) Iranian hackers demonstrated how they could obtain military ballots and submit them. ( Source ). Two different people have executed the hack to prove it as a legitimate method to obtain ballots and instead of fixing the issue they were arrested. ( Source ) Thousands of individuals repeatedly dropped off multiple ballots into drop boxes violating the law. The total number of these ballots alone is enough to shift the result of the election. ( 2000 Mules Documentary ) Video footage of drop boxes was destroyed (102 counties in GA alone), millions of ballot images were destroyed, both in violation of state law, making verification impossible. ( source ) Mesa County, Colorado County Clerk, and Gold Star Mom, Tina Peters was arrested on process crimes after she attempted to investigate the fraud in her county ( Selection Code documentary ) AZ woman, Guillermina Fuentes, plead guilty to \"sophisticated operation using her status as a well-known Democratic operative in the border city of San Luis to persuade voters to let her gather and fill out their ballots.\" ( Source ) Former Orange County, FL Commissioner candidate, Cynthia Harris, a Democrat, signed a sworn affidavit that details a long-running, widespread ballot harvesting operation run by Democrats in the African-American communities in the critical area of central Florida. Harvesters were paid $10 per ballot. Dishonorable FBI Agent Tim Thibault, who opened Trump investigation to illegally raid Mar-a-lago, was also the Assistant Agent in Charge of investigating the 2020 election fraud ( source ) Election Fraud Pennsylvania Summary ( source ) Election Fraud Wisconsin Summary ( source ) Election Fraud Michigan Summary ( source ) Election Fraud Georgia Summary ( source ) THE 2020 ELECTION WAS A COMPLETE FRAUD!!! permalink parent award report block reply Long_time_lurker 2 points 3 days ago They've been doing this crap since Nixon. permalink parent award report block reply Retardloserimsogay 3 points 3 days ago This site used to be fully dedicated to 2020, it was all that was posted here for about a year or more. What happened? I get people lost interest over time, but it's the key to taking it all down. permalink parent award report block reply Sgt_Hulka 10 points 3 days ago People here cant do it. Trump was elected to do it. He appointed two morons, in Tits Jim Jordan and Kash App, both who talked tough before getting confirmed and now just gaslight us and do what they are told by whoever pulls their strings. It’s almost 2026.  Dems abused Republicans a week ago at the ballot box.  A party with record low approval still somehow beat the shit out of republicans at the polls.  How?  Cheating perhaps? No one in power seems to care.  Why should we? I’m tired, boss. permalink parent award report block reply Retardloserimsogay 1 points 3 days ago I don't find the elections last week to be telling of much of anything. Solid blue shithole cities electing blue candidates isn't retribution of President Trump. permalink parent award report block reply Burneraccountno4 7 points 3 days ago It tells me no progress has been made on election integrity. permalink parent award report block reply view 1 more comments... HumblePepe 1 points 3 days ago You also have to take into account Charlie Kirk was shot. In their demented minds, people wanted that and voted for it. Now they're emboldened. permalink parent award report block reply friedchicken 1 points 3 days ago No one in power seems to care. Why should we? Power is never given up willingly. The spy apparatus of the government, the election theft apparatus, the MSM manipulation.  It's horrible while used against you, but once it acts in your favor.... why would you destroy the ring? permalink parent award report block reply HumblePepe 1 points 3 days ago They shot and killed Charlie Kirk and won an election for it. Kash and Bongino have done nothing against these trannie terrorists. Now shits about to get real. permalink parent award report block reply USDMaga 17 points 3 days ago They know who she is, she even works in a federal building in DC so finding her is trivial. Not locked up, not even questioned. Kash and Bongino are in on the coverup. permalink award report block reply mohel 0 points 3 days ago How did we end up with these amateurs? They have no idea about anything. permalink parent award report block reply booblitchutz 7 points 3 days ago As if this is accidental… permalink parent award report block reply KernalMustard 5 points 3 days ago Happens when you employ grifters permalink parent award report block reply USDMaga 3 points 3 days ago They can literally send an agent down the street, arrest her and question her. They know, they are covering it up. permalink parent award report block reply Cuntgoblin 11 points 3 days ago So guilty of a seditious conspiracy to commit treason and they should all be hanged according to US code. permalink award report block reply 0111000001100101 8 points 3 days ago How do we make actual arrests happen?  It's so easy for the cabal to build up a fake candidate and tell us what we want to hear, and zero accountability once they get in. permalink parent award report block reply KernalMustard 3 points 3 days ago Shhhh. You're letting the secret out. permalink parent award report block reply 0111000001100101 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply drattastic1 -1 points 3 days ago I firmly believe you and others have infiltrated this site to spread misery and weaken resolve. Go away Fed.. permalink parent award report block reply 0111000001100101 2 points 3 days ago Why?  It's honestly not that hard to arrest Mike Pence for example.  We all saw him get the challenge coin.  Trump saw.  There are a dozen such arrests that could have been made six months ago. permalink parent award report block reply 0111000001100101 2 points 3 days ago Nancy Pelosi. Obvious and easy to take down!  So at what point do you start to think the team is compromised? permalink parent award report block reply ProbablyASockAccount 8 points 3 days ago The real question is...how many senate and congress knew all along what the ruse was and failed to report the truth, and even were actively complicit in the lie... \"See the entire FBI and Capitol Police are behind us, who are you to stand against the intelligence community?\" It would be nice if the conversation was all that. In reality it was probably a $10k stack and a \"here's whats happening shut the fuck up about it.\" permalink award report block reply DeplorableRJ 8 points 3 days ago You could start with anyone that gave a \" I can't believe what just happened, this is a threat to our democracy, I wholly condemn the actions the the rioters\" completely \"off the cuff\" speech, leading up to the confirmation vote. permalink parent award report block reply ProbablyASockAccount 1 points 3 days ago They should all be \"in the cuffs\" for it now permalink parent award report block reply booblitchutz 3 points 3 days ago It’s a relatively tiny club and you & I ain’t in it. permalink parent award report block reply ProbablyASockAccount 3 points 3 days ago I wouldn't want to be in their faggot circle jerk club if they paid me to be. I'll take being a free citizen over a leveraged stooge any day. permalink parent award report block reply Wozzing 3 points 3 days ago I’m sure they did it to save the world from Donald Trump permalink parent award report block reply Bigdeal 8 points 3 days ago And yet nothing will happen, when heads should roll for this. permalink award report block reply Alldayeveryday 6 points 3 days ago Not a damn thing will happen to anyone permalink award report block reply Induceddrag 6 points 3 days ago That certification was going to happen anyway.  The whole idea was to create the narrative that Trump was trying to violently thwart the “peaceful transfer of power.”  Like most democrats fuck-ups they underachieved on some fronts and overachieved on others permalink award report block reply FractalRoar2 7 points 3 days ago Not so. There were motions challenging the irregularities in six states ready to be filed. It was the pipe bombs pre-placed in the Capitol itself that allowed Pelosi to adjourn the session and reconvene later under Emergency Rules that forbade motions from being filed. Had any motion been made it would have given legal standing to other legal challenges. The motions would have sent dual electors back to the states to sort out. permalink parent award report block reply onesummerdream 1 points 2 days ago 👆👆👆👍 this! There was a timeline issue that required the crowd to breach the Capitol prior to the challenge motions being filed. This is the KEY reason the crowd was flashbanged, pepper sprayed and shot with paint balls, barriers opened and given police escorts once they were let into the building. The peaceful crowd needed to be motivated to keep that timeline so Pelosi could adjourn the session and reconvene. The magic magnetic doors didn’t just open on their own for no reason. permalink parent award report block reply AfterGlow 6 points 3 days ago At the time that picture was taken, there's probably 500 people in DC who know exactly who it is. Many more now. permalink award report block reply rocco_saint 5 points 3 days ago \"joehoft.com\" did the gateway pundit change their name? permalink award report block reply 5DchessWatch OP 6 points 3 days ago No its a different website, his (Jim's) identical twin brother Joe's website that apparently isn't interested in ad revenue.  (Jim runs gateway and has his bro guest post some times) permalink parent award report block reply patrick_tribett 4 points 3 days ago Wake me when Bondi makes an arrest. permalink award report block reply KernalMustard 3 points 3 days ago Its been 84 years. permalink parent award report block reply Sgt_Hulka 2 points 3 days ago At this point, I’d be less surprised if we got to see her OnlyFans page. permalink parent award report block reply Greenhills 4 points 3 days ago No excuse me, you could tell that pipe bomber was a woman on the very first public video. permalink award report block reply Skogin 4 points 3 days ago WTF, we could tell it was a stocky woman the whole time. permalink award report block reply Rucktoe 3 points 3 days ago Without judas pence, I wonder how far they would have taken this? permalink award report block reply ckover9000 3 points 3 days ago We have to be weak and ineffective and not take any real action otherwise it will jeopardize midterms. At least that's their excuse for being weak and ineffective and not taking any real action. As long as these people keep sitting there kissing Trump's ass during televised cabinet meetings I'm afraid he's going to remain soft on them and all we're getting is tariffs and deportations. permalink award report block reply Fine_Kentucky_Jenkum 4 points 3 days ago What is their excuse for being “weak and ineffective and not taking any real action” for the last 50 years? permalink parent award report block reply Sgt_Hulka 3 points 3 days ago There is always an election less than 2 years away. That, and the videos of them diddling children. permalink parent award report block reply SavingPrivateGrace 3 points 3 days ago There weren't enough Republicans with integrity on Jan 6th and the aftermath.  What's worse is they still hold high political positions. permalink award report block reply ConsrvspkgNJ 3 points 3 days ago I think this is going to be big. No hopium here, just pure politics. Bongino has been talking about this just about longer than anybody and he even had a name but he never aired it as he was entering federal service. No, I think this dyke is going to get squeezed. She knows if she is scooped up that she can't eat the whole meal so she will absolutely sing. I wouldn't be surprised if we read a report that there was a tragic traffic accident and thankfully hers was the only car involved and no one else was hurt. If she lives and sings, this whole thing comes crashing down. Combine this dyke with the subpoenas going out and the Democrat strategy of shutting down the government makes sense....... permalink award report block reply YodaBannon 2 points 3 days ago real and wray permalink award report block reply Crappydatum 2 points 3 days ago Could by 99% certainty, and that remainder is Plenty for an Obama appointed judge to disallow permalink award report block reply Snowdone 2 points 3 days ago This came out a year after the coup. https://theconservativetreehouse.com/blog/2023/03/12/the-parliamentary-motive-behind-the-j6-fedsurrection/ I watched as Arizona made an objection and all of a sudden the  Capital is being “breached”. Don’t forget Pence being handed a note right before the process. We. An all guess what was in it. permalink award report block reply DJT4MoreYears 2 points 3 days ago EXCLUSIVE: BREAKING: BOMBSHELL: LOL Any arrests would be amazing. permalink award report block reply OG_BACONndEGGs 2 points 3 days ago Firing squad now I'll donate the ammo permalink award report block reply Seeing_Red 2 points 3 days ago wut permalink award report block reply MAGA_mantis 2 points 3 days ago Dam. This sounds illegal? permalink award report block reply f_bastiat 2 points 3 days ago It wasn't \"necessary\" and wasn't the thing that \"enabled\" anything. It was one of many things they did to try to insure that if there were no violent trump supporters that day, they could use this among other things to give the illusion that there was. If there was no pipe bomber situation absolutely nothing would have changed about that day and everything that followed. permalink award report block reply RhodesianRidgeback 2 points 3 days ago And nothing will come of this. permalink award report block reply ACActual 2 points 3 days ago This is literally Treason.  If we don't get Hangings were a banana republic permalink award report block reply ingrowntoenail 1 points 3 days ago Could this be related to Nancy's retirement announcement? permalink award report block reply Brundlefly78 1 points 3 days ago Another liberal bull dyke. permalink award report block reply Retardloserimsogay 1 points 3 days ago I think it was always assumed (at least here) to be a female. Hell the left kept pointing to the shoes to say it was MTG. From the beginning. permalink award report block reply asiatrails 1 points 3 days ago Probably now working for a 3 letter agency permalink award report block reply HumblePepe 1 points 3 days ago Where is the arrest? permalink award report block reply RizzlieDoodad 1 points 3 days ago Any nothing will come from this. This administration is the Temu version permalink award report block reply corntortilla 1 points 3 days ago The speaker of the house doesn’t certify squat. Take a civics class. permalink award report block reply spinometer2 1 points 3 days ago the bricks in that photo make it possible to know the precise height permalink award report block reply bubadmt 1 points 3 days ago What a garbage sitte. permalink award report block reply patrioticwinning3 1 points 3 days ago ARRESTS WHEN!? permalink award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nyepyep 78 points 3 days ago Lindsey Graham is weak and comprised. permalink award report block reply Hanging_Chad 40 points 3 days ago his colon is compromised permalink parent award report block reply TooBright 6 points 3 days ago By COBRA! HAIL COBRA! Cobra runs the Muslims! Cobra runs the CIA. Cobra runs it all.\nYo Joe!\nDeath and destruction! forced inoculations! HAIL COBRA! permalink parent award report block reply Retardloserimsogay 3 points 3 days ago You have Tourette's too? permalink parent award report block reply TooBright 1 points 3 days ago The high energy needs to go somewhere. Old Alex Infometal. https://youtu.be/wuNgCrafpkE permalink parent award report block reply duznmatter 2 points 3 days ago Would that be sodomized as well? permalink parent award report block reply AwShitHereWeGoAgain 3 points 3 days ago Miss Lynsey has always been a commie kid-fucker. permalink parent award report block reply MemeLawd 2 points 3 days ago And a faggot permalink parent award report block reply\nHanging_Chad 40 points 3 days ago his colon is compromised permalink parent award report block reply TooBright 6 points 3 days ago By COBRA! HAIL COBRA! Cobra runs the Muslims! Cobra runs the CIA. Cobra runs it all.\nYo Joe!\nDeath and destruction! forced inoculations! HAIL COBRA! permalink parent award report block reply Retardloserimsogay 3 points 3 days ago You have Tourette's too? permalink parent award report block reply TooBright 1 points 3 days ago The high energy needs to go somewhere. Old Alex Infometal. https://youtu.be/wuNgCrafpkE permalink parent award report block reply duznmatter 2 points 3 days ago Would that be sodomized as well? permalink parent award report block reply\nTooBright 6 points 3 days ago By COBRA! HAIL COBRA! Cobra runs the Muslims! Cobra runs the CIA. Cobra runs it all.\nYo Joe!\nDeath and destruction! forced inoculations! HAIL COBRA! permalink parent award report block reply Retardloserimsogay 3 points 3 days ago You have Tourette's too? permalink parent award report block reply TooBright 1 points 3 days ago The high energy needs to go somewhere. Old Alex Infometal. https://youtu.be/wuNgCrafpkE permalink parent award report block reply\nRetardloserimsogay 3 points 3 days ago You have Tourette's too? permalink parent award report block reply TooBright 1 points 3 days ago The high energy needs to go somewhere. Old Alex Infometal. https://youtu.be/wuNgCrafpkE permalink parent award report block reply\nTooBright 1 points 3 days ago The high energy needs to go somewhere. Old Alex Infometal. https://youtu.be/wuNgCrafpkE permalink parent award report block reply\nduznmatter 2 points 3 days ago Would that be sodomized as well? permalink parent award report block reply\nAwShitHereWeGoAgain 3 points 3 days ago Miss Lynsey has always been a commie kid-fucker. permalink parent award report block reply\nMemeLawd 2 points 3 days ago And a faggot permalink parent award report block reply\nTEXinLA 44 points 3 days ago LOCK HER UP. Then Squeeze Her Until She Sings... Rinse and Reeeeeepeat... permalink award report block reply 5DchessWatch OP 33 points 3 days ago We need to know who put her up to it.  That capuchin monkey faced cop would not have done this on her own.  She looks like about 100 IQ, and yet the CIA hired her right after (translation: the pipe bomb hoax was a gang initiation ritual to join cia). She's prob a janitor there or mailroom guy now.  She doesn't look smart enough to do anything useful.  Maybe they'll have her looking at sat images and finding buildings. permalink parent award report block reply drattastic1 12 points 3 days ago She's a good little order follower who'll arrest you and take you to the gulag or put a bullet in your head standing in front of a mass grave. Lefties get off on being evil and they don't want the brightest for the dirty work just the sickest. permalink parent award report block reply TEXinLA 10 points 3 days ago Absolutely. The former DC police chief was in on it too... permalink parent award report block reply 2020Gop 7 points 3 days ago Never Forget- Seth Rich permalink parent award report block reply TEXinLA 1 points 22 hours ago F permalink parent award report block reply HumblePepe 3 points 3 days ago She was the first to open fire into the crowd. She later testified against J6 hostages calling them traitors to the country. Just the gall of it. permalink parent award report block reply\n5DchessWatch OP 33 points 3 days ago We need to know who put her up to it.  That capuchin monkey faced cop would not have done this on her own.  She looks like about 100 IQ, and yet the CIA hired her right after (translation: the pipe bomb hoax was a gang initiation ritual to join cia). She's prob a janitor there or mailroom guy now.  She doesn't look smart enough to do anything useful.  Maybe they'll have her looking at sat images and finding buildings. permalink parent award report block reply drattastic1 12 points 3 days ago She's a good little order follower who'll arrest you and take you to the gulag or put a bullet in your head standing in front of a mass grave. Lefties get off on being evil and they don't want the brightest for the dirty work just the sickest. permalink parent award report block reply TEXinLA 10 points 3 days ago Absolutely. The former DC police chief was in on it too... permalink parent award report block reply 2020Gop 7 points 3 days ago Never Forget- Seth Rich permalink parent award report block reply TEXinLA 1 points 22 hours ago F permalink parent award report block reply HumblePepe 3 points 3 days ago She was the first to open fire into the crowd. She later testified against J6 hostages calling them traitors to the country. Just the gall of it. permalink parent award report block reply\ndrattastic1 12 points 3 days ago She's a good little order follower who'll arrest you and take you to the gulag or put a bullet in your head standing in front of a mass grave. Lefties get off on being evil and they don't want the brightest for the dirty work just the sickest. permalink parent award report block reply\nTEXinLA 10 points 3 days ago Absolutely. The former DC police chief was in on it too... permalink parent award report block reply 2020Gop 7 points 3 days ago Never Forget- Seth Rich permalink parent award report block reply TEXinLA 1 points 22 hours ago F permalink parent award report block reply\n2020Gop 7 points 3 days ago Never Forget- Seth Rich permalink parent award report block reply TEXinLA 1 points 22 hours ago F permalink parent award report block reply\nTEXinLA 1 points 22 hours ago F permalink parent award report block reply\nHumblePepe 3 points 3 days ago She was the first to open fire into the crowd. She later testified against J6 hostages calling them traitors to the country. Just the gall of it. permalink parent award report block reply\nFusionBlack 39 points 3 days ago So, where the Hell is Bondi on this? permalink award report block reply harryparatestes 48 points 3 days ago She's on Fox. permalink parent award report block reply 5DchessWatch OP 16 points 3 days ago Sean, we at the justice department are outraged, and we're taking immediate action to bring justice to this matter <Leaves Fox Studio, Drives up to Chick Fil A line, waits 25 minute to place order> permalink parent award report block reply gravenspine 7 points 3 days ago This story is unrealistic. Chic fil a service is much faster. permalink parent award report block reply OrangeManBadasss 8 points 3 days ago Plus today is Sunday permalink parent award report block reply thrakaa40k 1 points 3 days ago Fast food chains are different depending on where you are.  I personally have sat in a chick-fil-a drive through for more than 25 minutes in San Jose, CA.  Chick-fil-a in CA is generally meh, but the Chick-fil-a in Kirkland, WA was great.  Mod Pizza in the Bay area is generally pretty bad (employees hate their job); but, Mod Pizza in the surrounding Seattle area is pretty good.  McDonalds in Woodinville, WA is probably the worst McDonalds I have ever been too (rich area, hardly anyone there, cant keep employees, food never fresh).  McDonalds in Everett, WA is one of the better ones (poor area, high crime rate, but always busy so food is always fresh). permalink parent award report block reply drattastic1 1 points 3 days ago Chick-fil-a is the fastest fast food in the business, try another franchise for your story. permalink parent award report block reply HumblePepe 1 points 3 days ago She's needs to go after college students criticizing Israel. permalink parent award report block reply jdemarco2014 9 points 3 days ago Scam bondi don’t care permalink parent award report block reply hillaryforprison 5 points 3 days ago She's busy doing her makeup and shopping at Kohl's. permalink parent award report block reply JimRaynor 4 points 3 days ago The folder is on her desk permalink parent award report block reply SaltySilverback13 2 points 3 days ago Busy drafting a strongly worded letter that will end up in the circular file. permalink parent award report block reply load 2 more comments...\nharryparatestes 48 points 3 days ago She's on Fox. permalink parent award report block reply 5DchessWatch OP 16 points 3 days ago Sean, we at the justice department are outraged, and we're taking immediate action to bring justice to this matter <Leaves Fox Studio, Drives up to Chick Fil A line, waits 25 minute to place order> permalink parent award report block reply gravenspine 7 points 3 days ago This story is unrealistic. Chic fil a service is much faster. permalink parent award report block reply OrangeManBadasss 8 points 3 days ago Plus today is Sunday permalink parent award report block reply thrakaa40k 1 points 3 days ago Fast food chains are different depending on where you are.  I personally have sat in a chick-fil-a drive through for more than 25 minutes in San Jose, CA.  Chick-fil-a in CA is generally meh, but the Chick-fil-a in Kirkland, WA was great.  Mod Pizza in the Bay area is generally pretty bad (employees hate their job); but, Mod Pizza in the surrounding Seattle area is pretty good.  McDonalds in Woodinville, WA is probably the worst McDonalds I have ever been too (rich area, hardly anyone there, cant keep employees, food never fresh).  McDonalds in Everett, WA is one of the better ones (poor area, high crime rate, but always busy so food is always fresh). permalink parent award report block reply drattastic1 1 points 3 days ago Chick-fil-a is the fastest fast food in the business, try another franchise for your story. permalink parent award report block reply HumblePepe 1 points 3 days ago She's needs to go after college students criticizing Israel. permalink parent award report block reply\n5DchessWatch OP 16 points 3 days ago Sean, we at the justice department are outraged, and we're taking immediate action to bring justice to this matter <Leaves Fox Studio, Drives up to Chick Fil A line, waits 25 minute to place order> permalink parent award report block reply gravenspine 7 points 3 days ago This story is unrealistic. Chic fil a service is much faster. permalink parent award report block reply OrangeManBadasss 8 points 3 days ago Plus today is Sunday permalink parent award report block reply thrakaa40k 1 points 3 days ago Fast food chains are different depending on where you are.  I personally have sat in a chick-fil-a drive through for more than 25 minutes in San Jose, CA.  Chick-fil-a in CA is generally meh, but the Chick-fil-a in Kirkland, WA was great.  Mod Pizza in the Bay area is generally pretty bad (employees hate their job); but, Mod Pizza in the surrounding Seattle area is pretty good.  McDonalds in Woodinville, WA is probably the worst McDonalds I have ever been too (rich area, hardly anyone there, cant keep employees, food never fresh).  McDonalds in Everett, WA is one of the better ones (poor area, high crime rate, but always busy so food is always fresh). permalink parent award report block reply drattastic1 1 points 3 days ago Chick-fil-a is the fastest fast food in the business, try another franchise for your story. permalink parent award report block reply\ngravenspine 7 points 3 days ago This story is unrealistic. Chic fil a service is much faster. permalink parent award report block reply OrangeManBadasss 8 points 3 days ago Plus today is Sunday permalink parent award report block reply thrakaa40k 1 points 3 days ago Fast food chains are different depending on where you are.  I personally have sat in a chick-fil-a drive through for more than 25 minutes in San Jose, CA.  Chick-fil-a in CA is generally meh, but the Chick-fil-a in Kirkland, WA was great.  Mod Pizza in the Bay area is generally pretty bad (employees hate their job); but, Mod Pizza in the surrounding Seattle area is pretty good.  McDonalds in Woodinville, WA is probably the worst McDonalds I have ever been too (rich area, hardly anyone there, cant keep employees, food never fresh).  McDonalds in Everett, WA is one of the better ones (poor area, high crime rate, but always busy so food is always fresh). permalink parent award report block reply\nOrangeManBadasss 8 points 3 days ago Plus today is Sunday permalink parent award report block reply\nthrakaa40k 1 points 3 days ago Fast food chains are different depending on where you are.  I personally have sat in a chick-fil-a drive through for more than 25 minutes in San Jose, CA.  Chick-fil-a in CA is generally meh, but the Chick-fil-a in Kirkland, WA was great.  Mod Pizza in the Bay area is generally pretty bad (employees hate their job); but, Mod Pizza in the surrounding Seattle area is pretty good.  McDonalds in Woodinville, WA is probably the worst McDonalds I have ever been too (rich area, hardly anyone there, cant keep employees, food never fresh).  McDonalds in Everett, WA is one of the better ones (poor area, high crime rate, but always busy so food is always fresh). permalink parent award report block reply\ndrattastic1 1 points 3 days ago Chick-fil-a is the fastest fast food in the business, try another franchise for your story. permalink parent award report block reply\nHumblePepe 1 points 3 days ago She's needs to go after college students criticizing Israel. permalink parent award report block reply\njdemarco2014 9 points 3 days ago Scam bondi don’t care permalink parent award report block reply\nhillaryforprison 5 points 3 days ago She's busy doing her makeup and shopping at Kohl's. permalink parent award report block reply\nJimRaynor 4 points 3 days ago The folder is on her desk permalink parent award report block reply\nSaltySilverback13 2 points 3 days ago Busy drafting a strongly worded letter that will end up in the circular file. permalink parent award report block reply\nfriedchicken 24 points 3 days ago Nothing else really matters that's posted here. The 2020 election was stolen, and it's an issue for ALL AMERICANS permalink award report block reply sovereign_citizen 3 points 3 days ago Bellwether counties suddenly stop being bellwether counties despite decades of near 100% consistency ( source ) Trump won key bellwether battleground states like Ohio and Florida and won them easily but lost just enough battleground states (where the rigged cities are located) to put him under 270 ( source ) Rigged cities produced implausibly high urban turnout but demographically identical cities in neighboring battleground states had normal urban turnout ( source ) Implausibly high number of Biden-only ballots (no down ballot selections) but the same phenomenon not seen with Trump ballots ( source ) Trump was only the 3rd incumbent president in US history to gain votes in each and every state from their first election. The other 2 were Nixon and Reagan, both were 49 state landslides! First “president” to magically get over 80 million “votes” when no one before had over 69. First “president” to have his opponent gain in popularity. First “president” to lose all bellwether counties outside his home state. First “president” to lose badly on election day and miraculously find votes in the days afterwards. First “president” to lose Iowa and Florida and Ohio in like 60 years. First “president” to magically outperform his political party in forever. First “president” to bomb in all his primary performance. Suspicious activity going on in these “rigged” cities... such as; blocking poll watchers... stopping the count late on election night with Trump in the lead but then resume counting hours later with huge statistically impossible spikes for Biden Vote counting was halted the night of the election in many swing states with no reason given or fake reasons supplied (water main, just toilet overflow) Votes flipped in real time on television, we even have recordings of them ( source ), which the media then deleted ( source ) with no explanation given as to why or how, and yet we saw a red wave, such as Rs flipping 12 seats & winning all 27 toss ups, while Ds had a dismal election night performance despite Biden shattering records Hundreds of eyewitnesses gave sworn testimony and affidavits at multiple states' legislative sessions detailing the election crimes Video evidence showing concealed cases of ballots being pulled out and scanned repeatedly in Georgia after the poll watchers were removed due to the \"water main leak\" which proved to be a lie. ( source Ballots were shown on video being counted multiple times (which CoO to GA Secretary of State, Gabriel Sterling said DID NOT HAPPEN as they were removed) and yet we find ballots with the exact same markings counted. ( source NY Times ran a smear article ( source ) about True the Vote who claimed poll data was sent to China then the next day the CEO of the company suing True the Vote was arrested for just that. ( source ) Google rigged the elections by censoring and blacklisting damaging articles from search results ( source ) Half a billion \"Zuckerbucks\" illegally drove Democrat get-out-the-vote efforts, mass mail-in voting, and ballot “curing,” whereby election workers “fix” mail-in ballot problems after the ballot has been submitted in rigged cities ( source ) Governors of rigged states illegally used executive orders to mass mailout ballots despite courts acknowledging it required the legislatures authority to authorize ( source ) Voters identified as indefinitely confined to illegally receive absentee ballots even though they are young and healthy ( source ) Ballots for voters under the age of 18 were counted ( source ) Voters submitted multiple ballots in the same state or across multiple states Voters submitted ballots in states they do not live in Ballots from nursing home residents who say they did not vote and some who are mentally unable to vote (Wayne County, MI Psychiatric Hospital) Ballots from non-existent addresses Thousands of ballots received hours after polls closed ( source ) Poll watchers illegally removed from polling places for questioning fraudulent vote counting Absentee ballots counted even though voters never requested or filled them out Forensic audit of the voting machines used in rigged cities produced unexplainably high error rates and the edit logs were nowhere to be found because they had been wiped ( source ). Video evidence of the person who wiped them was turned over to the AZ Attorney General Mark Brnovich and he did nothing. Ballot images were manipulated ( source ) because it's super easy for election supervisors ( source ) Vote counting machines had overridden vote selection percentages above 60% in some counties, and FAR above normal ranges in many others (Antrim county machine audit) Vote counting machines had the overridden vote selection logs wiped for 2020, but previous years' log data was still there (Antrim county machine audit) ( source ) Iranian hackers demonstrated how they could obtain military ballots and submit them. ( Source ). Two different people have executed the hack to prove it as a legitimate method to obtain ballots and instead of fixing the issue they were arrested. ( Source ) Thousands of individuals repeatedly dropped off multiple ballots into drop boxes violating the law. The total number of these ballots alone is enough to shift the result of the election. ( 2000 Mules Documentary ) Video footage of drop boxes was destroyed (102 counties in GA alone), millions of ballot images were destroyed, both in violation of state law, making verification impossible. ( source ) Mesa County, Colorado County Clerk, and Gold Star Mom, Tina Peters was arrested on process crimes after she attempted to investigate the fraud in her county ( Selection Code documentary ) AZ woman, Guillermina Fuentes, plead guilty to \"sophisticated operation using her status as a well-known Democratic operative in the border city of San Luis to persuade voters to let her gather and fill out their ballots.\" ( Source ) Former Orange County, FL Commissioner candidate, Cynthia Harris, a Democrat, signed a sworn affidavit that details a long-running, widespread ballot harvesting operation run by Democrats in the African-American communities in the critical area of central Florida. Harvesters were paid $10 per ballot. Dishonorable FBI Agent Tim Thibault, who opened Trump investigation to illegally raid Mar-a-lago, was also the Assistant Agent in Charge of investigating the 2020 election fraud ( source ) Election Fraud Pennsylvania Summary ( source ) Election Fraud Wisconsin Summary ( source ) Election Fraud Michigan Summary ( source ) Election Fraud Georgia Summary ( source ) THE 2020 ELECTION WAS A COMPLETE FRAUD!!! permalink parent award report block reply Long_time_lurker 2 points 3 days ago They've been doing this crap since Nixon. permalink parent award report block reply Retardloserimsogay 3 points 3 days ago This site used to be fully dedicated to 2020, it was all that was posted here for about a year or more. What happened? I get people lost interest over time, but it's the key to taking it all down. permalink parent award report block reply Sgt_Hulka 10 points 3 days ago People here cant do it. Trump was elected to do it. He appointed two morons, in Tits Jim Jordan and Kash App, both who talked tough before getting confirmed and now just gaslight us and do what they are told by whoever pulls their strings. It’s almost 2026.  Dems abused Republicans a week ago at the ballot box.  A party with record low approval still somehow beat the shit out of republicans at the polls.  How?  Cheating perhaps? No one in power seems to care.  Why should we? I’m tired, boss. permalink parent award report block reply Retardloserimsogay 1 points 3 days ago I don't find the elections last week to be telling of much of anything. Solid blue shithole cities electing blue candidates isn't retribution of President Trump. permalink parent award report block reply Burneraccountno4 7 points 3 days ago It tells me no progress has been made on election integrity. permalink parent award report block reply view 1 more comments... HumblePepe 1 points 3 days ago You also have to take into account Charlie Kirk was shot. In their demented minds, people wanted that and voted for it. Now they're emboldened. permalink parent award report block reply friedchicken 1 points 3 days ago No one in power seems to care. Why should we? Power is never given up willingly. The spy apparatus of the government, the election theft apparatus, the MSM manipulation.  It's horrible while used against you, but once it acts in your favor.... why would you destroy the ring? permalink parent award report block reply HumblePepe 1 points 3 days ago They shot and killed Charlie Kirk and won an election for it. Kash and Bongino have done nothing against these trannie terrorists. Now shits about to get real. permalink parent award report block reply\nsovereign_citizen 3 points 3 days ago Bellwether counties suddenly stop being bellwether counties despite decades of near 100% consistency ( source ) Trump won key bellwether battleground states like Ohio and Florida and won them easily but lost just enough battleground states (where the rigged cities are located) to put him under 270 ( source ) Rigged cities produced implausibly high urban turnout but demographically identical cities in neighboring battleground states had normal urban turnout ( source ) Implausibly high number of Biden-only ballots (no down ballot selections) but the same phenomenon not seen with Trump ballots ( source ) Trump was only the 3rd incumbent president in US history to gain votes in each and every state from their first election. The other 2 were Nixon and Reagan, both were 49 state landslides! First “president” to magically get over 80 million “votes” when no one before had over 69. First “president” to have his opponent gain in popularity. First “president” to lose all bellwether counties outside his home state. First “president” to lose badly on election day and miraculously find votes in the days afterwards. First “president” to lose Iowa and Florida and Ohio in like 60 years. First “president” to magically outperform his political party in forever. First “president” to bomb in all his primary performance. Suspicious activity going on in these “rigged” cities... such as; blocking poll watchers... stopping the count late on election night with Trump in the lead but then resume counting hours later with huge statistically impossible spikes for Biden Vote counting was halted the night of the election in many swing states with no reason given or fake reasons supplied (water main, just toilet overflow) Votes flipped in real time on television, we even have recordings of them ( source ), which the media then deleted ( source ) with no explanation given as to why or how, and yet we saw a red wave, such as Rs flipping 12 seats & winning all 27 toss ups, while Ds had a dismal election night performance despite Biden shattering records Hundreds of eyewitnesses gave sworn testimony and affidavits at multiple states' legislative sessions detailing the election crimes Video evidence showing concealed cases of ballots being pulled out and scanned repeatedly in Georgia after the poll watchers were removed due to the \"water main leak\" which proved to be a lie. ( source Ballots were shown on video being counted multiple times (which CoO to GA Secretary of State, Gabriel Sterling said DID NOT HAPPEN as they were removed) and yet we find ballots with the exact same markings counted. ( source NY Times ran a smear article ( source ) about True the Vote who claimed poll data was sent to China then the next day the CEO of the company suing True the Vote was arrested for just that. ( source ) Google rigged the elections by censoring and blacklisting damaging articles from search results ( source ) Half a billion \"Zuckerbucks\" illegally drove Democrat get-out-the-vote efforts, mass mail-in voting, and ballot “curing,” whereby election workers “fix” mail-in ballot problems after the ballot has been submitted in rigged cities ( source ) Governors of rigged states illegally used executive orders to mass mailout ballots despite courts acknowledging it required the legislatures authority to authorize ( source ) Voters identified as indefinitely confined to illegally receive absentee ballots even though they are young and healthy ( source ) Ballots for voters under the age of 18 were counted ( source ) Voters submitted multiple ballots in the same state or across multiple states Voters submitted ballots in states they do not live in Ballots from nursing home residents who say they did not vote and some who are mentally unable to vote (Wayne County, MI Psychiatric Hospital) Ballots from non-existent addresses Thousands of ballots received hours after polls closed ( source ) Poll watchers illegally removed from polling places for questioning fraudulent vote counting Absentee ballots counted even though voters never requested or filled them out Forensic audit of the voting machines used in rigged cities produced unexplainably high error rates and the edit logs were nowhere to be found because they had been wiped ( source ). Video evidence of the person who wiped them was turned over to the AZ Attorney General Mark Brnovich and he did nothing. Ballot images were manipulated ( source ) because it's super easy for election supervisors ( source ) Vote counting machines had overridden vote selection percentages above 60% in some counties, and FAR above normal ranges in many others (Antrim county machine audit) Vote counting machines had the overridden vote selection logs wiped for 2020, but previous years' log data was still there (Antrim county machine audit) ( source ) Iranian hackers demonstrated how they could obtain military ballots and submit them. ( Source ). Two different people have executed the hack to prove it as a legitimate method to obtain ballots and instead of fixing the issue they were arrested. ( Source ) Thousands of individuals repeatedly dropped off multiple ballots into drop boxes violating the law. The total number of these ballots alone is enough to shift the result of the election. ( 2000 Mules Documentary ) Video footage of drop boxes was destroyed (102 counties in GA alone), millions of ballot images were destroyed, both in violation of state law, making verification impossible. ( source ) Mesa County, Colorado County Clerk, and Gold Star Mom, Tina Peters was arrested on process crimes after she attempted to investigate the fraud in her county ( Selection Code documentary ) AZ woman, Guillermina Fuentes, plead guilty to \"sophisticated operation using her status as a well-known Democratic operative in the border city of San Luis to persuade voters to let her gather and fill out their ballots.\" ( Source ) Former Orange County, FL Commissioner candidate, Cynthia Harris, a Democrat, signed a sworn affidavit that details a long-running, widespread ballot harvesting operation run by Democrats in the African-American communities in the critical area of central Florida. Harvesters were paid $10 per ballot. Dishonorable FBI Agent Tim Thibault, who opened Trump investigation to illegally raid Mar-a-lago, was also the Assistant Agent in Charge of investigating the 2020 election fraud ( source ) Election Fraud Pennsylvania Summary ( source ) Election Fraud Wisconsin Summary ( source ) Election Fraud Michigan Summary ( source ) Election Fraud Georgia Summary ( source ) THE 2020 ELECTION WAS A COMPLETE FRAUD!!! permalink parent award report block reply Long_time_lurker 2 points 3 days ago They've been doing this crap since Nixon. permalink parent award report block reply\nLong_time_lurker 2 points 3 days ago They've been doing this crap since Nixon. permalink parent award report block reply\nRetardloserimsogay 3 points 3 days ago This site used to be fully dedicated to 2020, it was all that was posted here for about a year or more. What happened? I get people lost interest over time, but it's the key to taking it all down. permalink parent award report block reply Sgt_Hulka 10 points 3 days ago People here cant do it. Trump was elected to do it. He appointed two morons, in Tits Jim Jordan and Kash App, both who talked tough before getting confirmed and now just gaslight us and do what they are told by whoever pulls their strings. It’s almost 2026.  Dems abused Republicans a week ago at the ballot box.  A party with record low approval still somehow beat the shit out of republicans at the polls.  How?  Cheating perhaps? No one in power seems to care.  Why should we? I’m tired, boss. permalink parent award report block reply Retardloserimsogay 1 points 3 days ago I don't find the elections last week to be telling of much of anything. Solid blue shithole cities electing blue candidates isn't retribution of President Trump. permalink parent award report block reply Burneraccountno4 7 points 3 days ago It tells me no progress has been made on election integrity. permalink parent award report block reply view 1 more comments... HumblePepe 1 points 3 days ago You also have to take into account Charlie Kirk was shot. In their demented minds, people wanted that and voted for it. Now they're emboldened. permalink parent award report block reply friedchicken 1 points 3 days ago No one in power seems to care. Why should we? Power is never given up willingly. The spy apparatus of the government, the election theft apparatus, the MSM manipulation.  It's horrible while used against you, but once it acts in your favor.... why would you destroy the ring? permalink parent award report block reply HumblePepe 1 points 3 days ago They shot and killed Charlie Kirk and won an election for it. Kash and Bongino have done nothing against these trannie terrorists. Now shits about to get real. permalink parent award report block reply\nSgt_Hulka 10 points 3 days ago People here cant do it. Trump was elected to do it. He appointed two morons, in Tits Jim Jordan and Kash App, both who talked tough before getting confirmed and now just gaslight us and do what they are told by whoever pulls their strings. It’s almost 2026.  Dems abused Republicans a week ago at the ballot box.  A party with record low approval still somehow beat the shit out of republicans at the polls.  How?  Cheating perhaps? No one in power seems to care.  Why should we? I’m tired, boss. permalink parent award report block reply Retardloserimsogay 1 points 3 days ago I don't find the elections last week to be telling of much of anything. Solid blue shithole cities electing blue candidates isn't retribution of President Trump. permalink parent award report block reply Burneraccountno4 7 points 3 days ago It tells me no progress has been made on election integrity. permalink parent award report block reply view 1 more comments... HumblePepe 1 points 3 days ago You also have to take into account Charlie Kirk was shot. In their demented minds, people wanted that and voted for it. Now they're emboldened. permalink parent award report block reply friedchicken 1 points 3 days ago No one in power seems to care. Why should we? Power is never given up willingly. The spy apparatus of the government, the election theft apparatus, the MSM manipulation.  It's horrible while used against you, but once it acts in your favor.... why would you destroy the ring? permalink parent award report block reply HumblePepe 1 points 3 days ago They shot and killed Charlie Kirk and won an election for it. Kash and Bongino have done nothing against these trannie terrorists. Now shits about to get real. permalink parent award report block reply\nRetardloserimsogay 1 points 3 days ago I don't find the elections last week to be telling of much of anything. Solid blue shithole cities electing blue candidates isn't retribution of President Trump. permalink parent award report block reply Burneraccountno4 7 points 3 days ago It tells me no progress has been made on election integrity. permalink parent award report block reply view 1 more comments... HumblePepe 1 points 3 days ago You also have to take into account Charlie Kirk was shot. In their demented minds, people wanted that and voted for it. Now they're emboldened. permalink parent award report block reply\nBurneraccountno4 7 points 3 days ago It tells me no progress has been made on election integrity. permalink parent award report block reply view 1 more comments...\nHumblePepe 1 points 3 days ago You also have to take into account Charlie Kirk was shot. In their demented minds, people wanted that and voted for it. Now they're emboldened. permalink parent award report block reply\nfriedchicken 1 points 3 days ago No one in power seems to care. Why should we? Power is never given up willingly. The spy apparatus of the government, the election theft apparatus, the MSM manipulation.  It's horrible while used against you, but once it acts in your favor.... why would you destroy the ring? permalink parent award report block reply\nHumblePepe 1 points 3 days ago They shot and killed Charlie Kirk and won an election for it. Kash and Bongino have done nothing against these trannie terrorists. Now shits about to get real. permalink parent award report block reply\nUSDMaga 17 points 3 days ago They know who she is, she even works in a federal building in DC so finding her is trivial. Not locked up, not even questioned. Kash and Bongino are in on the coverup. permalink award report block reply mohel 0 points 3 days ago How did we end up with these amateurs? They have no idea about anything. permalink parent award report block reply booblitchutz 7 points 3 days ago As if this is accidental… permalink parent award report block reply KernalMustard 5 points 3 days ago Happens when you employ grifters permalink parent award report block reply USDMaga 3 points 3 days ago They can literally send an agent down the street, arrest her and question her. They know, they are covering it up. permalink parent award report block reply\nmohel 0 points 3 days ago How did we end up with these amateurs? They have no idea about anything. permalink parent award report block reply booblitchutz 7 points 3 days ago As if this is accidental… permalink parent award report block reply KernalMustard 5 points 3 days ago Happens when you employ grifters permalink parent award report block reply USDMaga 3 points 3 days ago They can literally send an agent down the street, arrest her and question her. They know, they are covering it up. permalink parent award report block reply\nbooblitchutz 7 points 3 days ago As if this is accidental… permalink parent award report block reply\nKernalMustard 5 points 3 days ago Happens when you employ grifters permalink parent award report block reply\nUSDMaga 3 points 3 days ago They can literally send an agent down the street, arrest her and question her. They know, they are covering it up. permalink parent award report block reply\nCuntgoblin 11 points 3 days ago So guilty of a seditious conspiracy to commit treason and they should all be hanged according to US code. permalink award report block reply 0111000001100101 8 points 3 days ago How do we make actual arrests happen?  It's so easy for the cabal to build up a fake candidate and tell us what we want to hear, and zero accountability once they get in. permalink parent award report block reply KernalMustard 3 points 3 days ago Shhhh. You're letting the secret out. permalink parent award report block reply 0111000001100101 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply drattastic1 -1 points 3 days ago I firmly believe you and others have infiltrated this site to spread misery and weaken resolve. Go away Fed.. permalink parent award report block reply 0111000001100101 2 points 3 days ago Why?  It's honestly not that hard to arrest Mike Pence for example.  We all saw him get the challenge coin.  Trump saw.  There are a dozen such arrests that could have been made six months ago. permalink parent award report block reply 0111000001100101 2 points 3 days ago Nancy Pelosi. Obvious and easy to take down!  So at what point do you start to think the team is compromised? permalink parent award report block reply\n0111000001100101 8 points 3 days ago How do we make actual arrests happen?  It's so easy for the cabal to build up a fake candidate and tell us what we want to hear, and zero accountability once they get in. permalink parent award report block reply KernalMustard 3 points 3 days ago Shhhh. You're letting the secret out. permalink parent award report block reply 0111000001100101 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply drattastic1 -1 points 3 days ago I firmly believe you and others have infiltrated this site to spread misery and weaken resolve. Go away Fed.. permalink parent award report block reply 0111000001100101 2 points 3 days ago Why?  It's honestly not that hard to arrest Mike Pence for example.  We all saw him get the challenge coin.  Trump saw.  There are a dozen such arrests that could have been made six months ago. permalink parent award report block reply 0111000001100101 2 points 3 days ago Nancy Pelosi. Obvious and easy to take down!  So at what point do you start to think the team is compromised? permalink parent award report block reply\nKernalMustard 3 points 3 days ago Shhhh. You're letting the secret out. permalink parent award report block reply 0111000001100101 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\n0111000001100101 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\ndrattastic1 -1 points 3 days ago I firmly believe you and others have infiltrated this site to spread misery and weaken resolve. Go away Fed.. permalink parent award report block reply 0111000001100101 2 points 3 days ago Why?  It's honestly not that hard to arrest Mike Pence for example.  We all saw him get the challenge coin.  Trump saw.  There are a dozen such arrests that could have been made six months ago. permalink parent award report block reply 0111000001100101 2 points 3 days ago Nancy Pelosi. Obvious and easy to take down!  So at what point do you start to think the team is compromised? permalink parent award report block reply\n0111000001100101 2 points 3 days ago Why?  It's honestly not that hard to arrest Mike Pence for example.  We all saw him get the challenge coin.  Trump saw.  There are a dozen such arrests that could have been made six months ago. permalink parent award report block reply\n0111000001100101 2 points 3 days ago Nancy Pelosi. Obvious and easy to take down!  So at what point do you start to think the team is compromised? permalink parent award report block reply\nProbablyASockAccount 8 points 3 days ago The real question is...how many senate and congress knew all along what the ruse was and failed to report the truth, and even were actively complicit in the lie... \"See the entire FBI and Capitol Police are behind us, who are you to stand against the intelligence community?\" It would be nice if the conversation was all that. In reality it was probably a $10k stack and a \"here's whats happening shut the fuck up about it.\" permalink award report block reply DeplorableRJ 8 points 3 days ago You could start with anyone that gave a \" I can't believe what just happened, this is a threat to our democracy, I wholly condemn the actions the the rioters\" completely \"off the cuff\" speech, leading up to the confirmation vote. permalink parent award report block reply ProbablyASockAccount 1 points 3 days ago They should all be \"in the cuffs\" for it now permalink parent award report block reply booblitchutz 3 points 3 days ago It’s a relatively tiny club and you & I ain’t in it. permalink parent award report block reply ProbablyASockAccount 3 points 3 days ago I wouldn't want to be in their faggot circle jerk club if they paid me to be. I'll take being a free citizen over a leveraged stooge any day. permalink parent award report block reply Wozzing 3 points 3 days ago I’m sure they did it to save the world from Donald Trump permalink parent award report block reply\nDeplorableRJ 8 points 3 days ago You could start with anyone that gave a \" I can't believe what just happened, this is a threat to our democracy, I wholly condemn the actions the the rioters\" completely \"off the cuff\" speech, leading up to the confirmation vote. permalink parent award report block reply ProbablyASockAccount 1 points 3 days ago They should all be \"in the cuffs\" for it now permalink parent award report block reply\nProbablyASockAccount 1 points 3 days ago They should all be \"in the cuffs\" for it now permalink parent award report block reply\nbooblitchutz 3 points 3 days ago It’s a relatively tiny club and you & I ain’t in it. permalink parent award report block reply ProbablyASockAccount 3 points 3 days ago I wouldn't want to be in their faggot circle jerk club if they paid me to be. I'll take being a free citizen over a leveraged stooge any day. permalink parent award report block reply\nProbablyASockAccount 3 points 3 days ago I wouldn't want to be in their faggot circle jerk club if they paid me to be. I'll take being a free citizen over a leveraged stooge any day. permalink parent award report block reply\nWozzing 3 points 3 days ago I’m sure they did it to save the world from Donald Trump permalink parent award report block reply\nBigdeal 8 points 3 days ago And yet nothing will happen, when heads should roll for this. permalink award report block reply\nAlldayeveryday 6 points 3 days ago Not a damn thing will happen to anyone permalink award report block reply\nInduceddrag 6 points 3 days ago That certification was going to happen anyway.  The whole idea was to create the narrative that Trump was trying to violently thwart the “peaceful transfer of power.”  Like most democrats fuck-ups they underachieved on some fronts and overachieved on others permalink award report block reply FractalRoar2 7 points 3 days ago Not so. There were motions challenging the irregularities in six states ready to be filed. It was the pipe bombs pre-placed in the Capitol itself that allowed Pelosi to adjourn the session and reconvene later under Emergency Rules that forbade motions from being filed. Had any motion been made it would have given legal standing to other legal challenges. The motions would have sent dual electors back to the states to sort out. permalink parent award report block reply onesummerdream 1 points 2 days ago 👆👆👆👍 this! There was a timeline issue that required the crowd to breach the Capitol prior to the challenge motions being filed. This is the KEY reason the crowd was flashbanged, pepper sprayed and shot with paint balls, barriers opened and given police escorts once they were let into the building. The peaceful crowd needed to be motivated to keep that timeline so Pelosi could adjourn the session and reconvene. The magic magnetic doors didn’t just open on their own for no reason. permalink parent award report block reply\nFractalRoar2 7 points 3 days ago Not so. There were motions challenging the irregularities in six states ready to be filed. It was the pipe bombs pre-placed in the Capitol itself that allowed Pelosi to adjourn the session and reconvene later under Emergency Rules that forbade motions from being filed. Had any motion been made it would have given legal standing to other legal challenges. The motions would have sent dual electors back to the states to sort out. permalink parent award report block reply onesummerdream 1 points 2 days ago 👆👆👆👍 this! There was a timeline issue that required the crowd to breach the Capitol prior to the challenge motions being filed. This is the KEY reason the crowd was flashbanged, pepper sprayed and shot with paint balls, barriers opened and given police escorts once they were let into the building. The peaceful crowd needed to be motivated to keep that timeline so Pelosi could adjourn the session and reconvene. The magic magnetic doors didn’t just open on their own for no reason. permalink parent award report block reply\nonesummerdream 1 points 2 days ago 👆👆👆👍 this! There was a timeline issue that required the crowd to breach the Capitol prior to the challenge motions being filed. This is the KEY reason the crowd was flashbanged, pepper sprayed and shot with paint balls, barriers opened and given police escorts once they were let into the building. The peaceful crowd needed to be motivated to keep that timeline so Pelosi could adjourn the session and reconvene. The magic magnetic doors didn’t just open on their own for no reason. permalink parent award report block reply\nAfterGlow 6 points 3 days ago At the time that picture was taken, there's probably 500 people in DC who know exactly who it is. Many more now. permalink award report block reply\nrocco_saint 5 points 3 days ago \"joehoft.com\" did the gateway pundit change their name? permalink award report block reply 5DchessWatch OP 6 points 3 days ago No its a different website, his (Jim's) identical twin brother Joe's website that apparently isn't interested in ad revenue.  (Jim runs gateway and has his bro guest post some times) permalink parent award report block reply\n5DchessWatch OP 6 points 3 days ago No its a different website, his (Jim's) identical twin brother Joe's website that apparently isn't interested in ad revenue.  (Jim runs gateway and has his bro guest post some times) permalink parent award report block reply\npatrick_tribett 4 points 3 days ago Wake me when Bondi makes an arrest. permalink award report block reply KernalMustard 3 points 3 days ago Its been 84 years. permalink parent award report block reply Sgt_Hulka 2 points 3 days ago At this point, I’d be less surprised if we got to see her OnlyFans page. permalink parent award report block reply\nKernalMustard 3 points 3 days ago Its been 84 years. permalink parent award report block reply\nSgt_Hulka 2 points 3 days ago At this point, I’d be less surprised if we got to see her OnlyFans page. permalink parent award report block reply\nGreenhills 4 points 3 days ago No excuse me, you could tell that pipe bomber was a woman on the very first public video. permalink award report block reply\nSkogin 4 points 3 days ago WTF, we could tell it was a stocky woman the whole time. permalink award report block reply\nRucktoe 3 points 3 days ago Without judas pence, I wonder how far they would have taken this? permalink award report block reply\nckover9000 3 points 3 days ago We have to be weak and ineffective and not take any real action otherwise it will jeopardize midterms. At least that's their excuse for being weak and ineffective and not taking any real action. As long as these people keep sitting there kissing Trump's ass during televised cabinet meetings I'm afraid he's going to remain soft on them and all we're getting is tariffs and deportations. permalink award report block reply Fine_Kentucky_Jenkum 4 points 3 days ago What is their excuse for being “weak and ineffective and not taking any real action” for the last 50 years? permalink parent award report block reply Sgt_Hulka 3 points 3 days ago There is always an election less than 2 years away. That, and the videos of them diddling children. permalink parent award report block reply\nFine_Kentucky_Jenkum 4 points 3 days ago What is their excuse for being “weak and ineffective and not taking any real action” for the last 50 years? permalink parent award report block reply Sgt_Hulka 3 points 3 days ago There is always an election less than 2 years away. That, and the videos of them diddling children. permalink parent award report block reply\nSgt_Hulka 3 points 3 days ago There is always an election less than 2 years away. That, and the videos of them diddling children. permalink parent award report block reply\nSavingPrivateGrace 3 points 3 days ago There weren't enough Republicans with integrity on Jan 6th and the aftermath.  What's worse is they still hold high political positions. permalink award report block reply\nConsrvspkgNJ 3 points 3 days ago I think this is going to be big. No hopium here, just pure politics. Bongino has been talking about this just about longer than anybody and he even had a name but he never aired it as he was entering federal service. No, I think this dyke is going to get squeezed. She knows if she is scooped up that she can't eat the whole meal so she will absolutely sing. I wouldn't be surprised if we read a report that there was a tragic traffic accident and thankfully hers was the only car involved and no one else was hurt. If she lives and sings, this whole thing comes crashing down. Combine this dyke with the subpoenas going out and the Democrat strategy of shutting down the government makes sense....... permalink award report block reply\nYodaBannon 2 points 3 days ago real and wray permalink award report block reply\nCrappydatum 2 points 3 days ago Could by 99% certainty, and that remainder is Plenty for an Obama appointed judge to disallow permalink award report block reply\nSnowdone 2 points 3 days ago This came out a year after the coup. https://theconservativetreehouse.com/blog/2023/03/12/the-parliamentary-motive-behind-the-j6-fedsurrection/ I watched as Arizona made an objection and all of a sudden the  Capital is being “breached”. Don’t forget Pence being handed a note right before the process. We. An all guess what was in it. permalink award report block reply\nDJT4MoreYears 2 points 3 days ago EXCLUSIVE: BREAKING: BOMBSHELL: LOL Any arrests would be amazing. permalink award report block reply\nOG_BACONndEGGs 2 points 3 days ago Firing squad now I'll donate the ammo permalink award report block reply\nSeeing_Red 2 points 3 days ago wut permalink award report block reply\nMAGA_mantis 2 points 3 days ago Dam. This sounds illegal? permalink award report block reply\nf_bastiat 2 points 3 days ago It wasn't \"necessary\" and wasn't the thing that \"enabled\" anything. It was one of many things they did to try to insure that if there were no violent trump supporters that day, they could use this among other things to give the illusion that there was. If there was no pipe bomber situation absolutely nothing would have changed about that day and everything that followed. permalink award report block reply\nRhodesianRidgeback 2 points 3 days ago And nothing will come of this. permalink award report block reply\nACActual 2 points 3 days ago This is literally Treason.  If we don't get Hangings were a banana republic permalink award report block reply\ningrowntoenail 1 points 3 days ago Could this be related to Nancy's retirement announcement? permalink award report block reply\nBrundlefly78 1 points 3 days ago Another liberal bull dyke. permalink award report block reply\nRetardloserimsogay 1 points 3 days ago I think it was always assumed (at least here) to be a female. Hell the left kept pointing to the shoes to say it was MTG. From the beginning. permalink award report block reply\nasiatrails 1 points 3 days ago Probably now working for a 3 letter agency permalink award report block reply\nHumblePepe 1 points 3 days ago Where is the arrest? permalink award report block reply\nRizzlieDoodad 1 points 3 days ago Any nothing will come from this. This administration is the Temu version permalink award report block reply\ncorntortilla 1 points 3 days ago The speaker of the house doesn’t certify squat. Take a civics class. permalink award report block reply\nspinometer2 1 points 3 days ago the bricks in that photo make it possible to know the precise height permalink award report block reply\nbubadmt 1 points 3 days ago What a garbage sitte. permalink award report block reply\npatrioticwinning3 1 points 3 days ago ARRESTS WHEN!? permalink award report block reply\nTheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:03:58.457283Z"
}