{
  "id": "1ARK55cGSg",
  "url": "https://patriots.win/p/1ARK55cGSg/the-face-you-make-when-youre-jus/c",
  "content": "265 The Face You Make When You're Just Fucking Done With It. YOU GUYS ARE GAY posted 5 days ago by mydogma8yourkarma 5 comments award share download report block\n5 comments Sort by Top Top New Worst Old Save _Sully_ 4 points 5 days ago I try talking to my Aunt who is a boomer liberal and she just openly says the most vile shit like she thinks everyone agrees with her. Lady, if the people around you all say shit like that then you hang out with pieces of shit. I simply told her I was moving to Florida and she got so upset and then asked if I was a republican. I said \"no, why\". And she just went off saying every made up bullshit. It's worse than talking to some racist ass brother who thinks the South is a death sentence for black people --\"Do you know where the most black people live?\" I had her ear for a moment when she talked about the \"Don't Say Gay bill\" but I told her it's literally not called that. She couldn't even function. These people need to take meds or something because they've completely lost the plot and I honestly believe at this point that it isn't ridiculous to say that they'd all suffocate if Trump said oxygen is good. permalink award report block reply SanityGumby 4 points 5 days ago I'm pretty lucky. My wife is the least based in all of my family but my pimp hand is strong and she just takes my lead now and if she isn't going to vote MAGA she doesn't vote. Though, none of them are at my power level. My father in law is the closest but he is still a boomer listens to Fox Nation. permalink parent award report block reply Ritchie_Blackadder 2 points 5 days ago She really tells it like it ain't permalink parent award report block reply SicSemperTyrannis2 2 points 4 days ago Meds won't help them. Yuri Bezmenov told us what they need. permalink parent award report block reply MasterChief -7 points 5 days ago ok boomer permalink award report block reply\n_Sully_ 4 points 5 days ago I try talking to my Aunt who is a boomer liberal and she just openly says the most vile shit like she thinks everyone agrees with her. Lady, if the people around you all say shit like that then you hang out with pieces of shit. I simply told her I was moving to Florida and she got so upset and then asked if I was a republican. I said \"no, why\". And she just went off saying every made up bullshit. It's worse than talking to some racist ass brother who thinks the South is a death sentence for black people --\"Do you know where the most black people live?\" I had her ear for a moment when she talked about the \"Don't Say Gay bill\" but I told her it's literally not called that. She couldn't even function. These people need to take meds or something because they've completely lost the plot and I honestly believe at this point that it isn't ridiculous to say that they'd all suffocate if Trump said oxygen is good. permalink award report block reply SanityGumby 4 points 5 days ago I'm pretty lucky. My wife is the least based in all of my family but my pimp hand is strong and she just takes my lead now and if she isn't going to vote MAGA she doesn't vote. Though, none of them are at my power level. My father in law is the closest but he is still a boomer listens to Fox Nation. permalink parent award report block reply Ritchie_Blackadder 2 points 5 days ago She really tells it like it ain't permalink parent award report block reply SicSemperTyrannis2 2 points 4 days ago Meds won't help them. Yuri Bezmenov told us what they need. permalink parent award report block reply\nSanityGumby 4 points 5 days ago I'm pretty lucky. My wife is the least based in all of my family but my pimp hand is strong and she just takes my lead now and if she isn't going to vote MAGA she doesn't vote. Though, none of them are at my power level. My father in law is the closest but he is still a boomer listens to Fox Nation. permalink parent award report block reply\nRitchie_Blackadder 2 points 5 days ago She really tells it like it ain't permalink parent award report block reply\nSicSemperTyrannis2 2 points 4 days ago Meds won't help them. Yuri Bezmenov told us what they need. permalink parent award report block reply\nMasterChief -7 points 5 days ago ok boomer permalink award report block reply",
  "fetched_at": "2025-11-12T21:00:51.364888Z"
}