{
  "id": "1ARK54SUti",
  "url": "https://patriots.win/p/1ARK54SUti/trumps-border-policy-delivers-ze/c",
  "content": "1236 Trump’s Border Policy Delivers: Zero Illegal Alien Releases for 6th Month, Record-Low Apprehensions in October (www.breitbart.com) AMERICA        FIRST posted 5 days ago by TEXinLA 53 comments award share report block Trump’s Border Policy Delivers: Zero Migrant Releases for 6th Month, Record-Low Apprehensions in October The Trump administration’s border crackdown is delivering results: October 2025 marked the lowest number of illegal border crossings in CBP history, and it was the sixth straight month of zero releases by U.S. Border Patrol. With just 30,561 encounters nat... www.breitbart.com\n53 comments Sort by Top Top New Worst Old Save MissingTrump 50 points 5 days ago Good. Now ship back the ones that are already here. permalink award report block reply GoUSA 25 points 5 days ago Exactly. It's a start, but our administration has clearly given a sign to corporate America that they get to keep their 50 million indentured servants . It would only take one perp walked CEO, before they send them all back. permalink parent award report block reply BeauHD 11 points 5 days ago Homan is doing what Homan is able to do. permalink parent award report block reply YouEssAye 4 points 5 days ago If he's doing all that he can do, and that's not even close to being enough, at what point can we hold him or his boss accountable? permalink parent award report block reply YodaBannon 1 points 5 days ago You got to know when to HOMAN, know when to fold em. 🍻 permalink parent award report block reply KernalMustard 2 points 5 days ago So know when to bluff or show your cards even though its a losing hand? I think you didnt think that through permalink parent award report block reply tt777 3 points 5 days ago There need to be a heavy fine for each illegal employed by a company. permalink parent award report block reply FatigueIsReal -1 points 5 days ago So then what about these CEOs that have been arrested.  You said one is all it takes right? Andy Ha, Owner/CEO of Prosperity Services Inc. Leonardo Baez-Lara and Nora Alicia Avila-Guel, Owners of Abby's Bakery Zhu \"George\" Chen, Owner of Wellmade Industries Robert Clouston and Brenda Clouston, Owners of Colt Grill John Washburn, General Manager of San Diego Powder & Protective Coatings Edit: MTG could be perp walked.  She claimed in an interview that she owns a construction company and that construction companies rely on illegals. permalink parent award report block reply AwShitHereWeGoAgain 6 points 5 days ago You're goddamn right!  Pump up those numbers! permalink parent award report block reply TEXinLA OP 2 points 3 days ago ^^THIS^^ permalink parent award report block reply TEXinLA OP 18 points 5 days ago From the article: During the month of October, Border Patrol agents apprehended approximately 8,000 migrants who illegally crossed the border between ports of entry. Officials say this represents an arrest rate of 258 illegal aliens per day — less than 11 per hour. During the Biden administration, agents were overwhelmed with an average apprehension rate of more than 5,100 per day. One year ago, agents apprehended more than 300 illegal aliens every four hours. permalink award report block reply bigdickhangsright 18 points 5 days ago It's... almost... as if border control works for sovereign countries and the Democrats intentionally tried to destroy our nation. permalink award report block reply Oleander 8 points 5 days ago They succeeded in doing so. Things are going to get a lot worse before they get better, far too many were already let in. That's not to mention border security is now a political issue instead of bipartisan, so Democrats will do their best to reverse all security once they get back in, possibly even do mass amnesty. permalink parent award report block reply TEXinLA OP 1 points 3 days ago WEIRD HUH? permalink parent award report block reply RandyMoss 9 points 5 days ago I'm at the DMV right now. Rural MN. 50% of the people here don't speak English. Trump isn't doing shit. It's all optics. permalink award report block reply UCantStumpTheTrump 0 points 5 days ago lol bitch some more doomer, Trump is currently doing the biggest deportation and immigration enforcement operations in our lifetimes, and it’s not good enough for you. You know what was optics? When Obama changed the definition of “deported” to include those simply turned away at the border, so they could inflate their deportation statistics permalink parent award report block reply RandyMoss 1 points 5 days ago That isn't really saying anything, sadly. In defense of Trump it may take time to build the systems and infrastructure to accommodate the numbers that need deporting.  That's an optimistic view.\nA pessimistic view (doomer if you insist) recognizes that branding and noise are what Trump specializes in. Results? A lot less. Is it his fault? Ultimately yes because he keeps trying to work with the traitor RINOs instead of demanding they work with him or get the boot. Trump has really lost me when he picks fights with Massie and Paul on legislation that was WRITTEN BY THE BIDEN ADMINISTRATION!!!  How do you reconcile that? permalink parent award report block reply UCantStumpTheTrump 1 points 5 days ago Literally no other GOP politician even had the political will to touch the idea of a border wall or deportations with a ten foot pole, much less actually get those efforts underway. Once again, your claim of “no results” is provably false. Speaking in sweeping absolutes just makes you look like a concern troll shill. permalink parent award report block reply RandyMoss 2 points 4 days ago Fair point on the border wall. Deportations has yet to be determined. I will believe it when I don't see DMV workers happily helping illegals get drivers licenses. It was literally half of the people there. Easy pickings for a serious deportation effort. permalink parent award report block reply YesImWhite 8 points 5 days ago Charge Mayorkas with TREASON. It was THIS EASY. permalink award report block reply TEXinLA OP 1 points 3 days ago EXACTLY permalink parent award report block reply Roadpower 6 points 5 days ago The changes need to be cemented, just having a back and forth with each change of administration is not going to save us. I'm not saying that I'm not grateful but without locked down changes the importers of the third world will eventually win with their Zerg tactics and they know it. permalink award report block reply TEXinLA OP 2 points 3 days ago Agreed permalink parent award report block reply Klown_Kutz 5 points 5 days ago Great.  Now MORE deportations.  I don't see enough liberal white women crying about their precious proto-humans. permalink award report block reply TEXinLA OP 1 points 3 days ago Exactly permalink parent award report block reply MythArcana 5 points 5 days ago Round 'em up, move 'em out, Rawhide!    🐂💨 permalink award report block reply TEXinLA OP 2 points 3 days ago Roll 'em Roll 'em Roll 'em permalink parent award report block reply Knockoff 5 points 5 days ago It wasn’t impossible nor was it hard. Our laws weren’t “broken.”The invasion was deliberate. It was treason. permalink award report block reply TEXinLA OP 1 points 3 days ago Exactly. ROPE permalink parent award report block reply Couchbeer69 4 points 5 days ago Remember when democrats and a few stooges like Oklahoma's james lankford tried to tell us they needed to pass a book a new bill to secure the border? permalink award report block reply TEXinLA OP 1 points 3 days ago Uniparty Fucks permalink parent award report block reply LearnAboutRoaches 4 points 5 days ago I support zero releases https://www.youtube.com/watch?v=qpZIb5io1K8 permalink award report block reply RockyBalboa 3 points 5 days ago Great start.  How many miles of southern  border wall remain to be built? permalink award report block reply TEXinLA OP 1 points 3 days ago IDK; hopefully not much permalink parent award report block reply VanDeKoik 3 points 5 days ago 0? Yet some people here: Trump isnt doing anything!!! permalink award report block reply UCantStumpTheTrump 1 points 5 days ago The site currently is flooded with Redditors pretending to be upset Trump supporters because he’s not doing enough, fast enough permalink parent award report block reply TEXinLA OP 1 points 3 days ago God Bless and Protect Our GEOTUS permalink parent award report block reply NickAtNight 3 points 5 days ago God bless you President Trump and all the border agents ! permalink award report block reply TEXinLA OP 1 points 3 days ago ^^THIS^^ permalink parent award report block reply Bullet3250 3 points 5 days ago Joe Biden should be put in JAIL. permalink award report block reply TEXinLA OP 2 points 3 days ago Along with everyone else involved in the destruction of America permalink parent award report block reply 2scoops2peachmints 2 points 5 days ago It doesn’t help that they’re already here. Makes sense crossings are down with the flood over the last 4 years permalink award report block reply TEXinLA OP 1 points 3 days ago More Deep State permalink parent award report block reply swimmer75 2 points 5 days ago Now, deny any muslim entry to America. permalink award report block reply JoePlumber 2 points 5 days ago On pace to deport 4m out of 10m that came in under Biden, out of 100m that are here illegally total.n permalink award report block reply TEXinLA OP 1 points 3 days ago Time to turn the screws. Start with the illegals using the greatest amount of taxpayer money. There's illegals in the CA health care system that suck up several million dollars a year. permalink parent award report block reply JoePlumber 3 points 3 days ago I'm tired of the \"start with these\" argument that's how we wound up here, 10 months in with only 600k deported. We need to crank it up across the board. Every single workplace should be investigated and raided. Every single illegal needs to be round up and shipped back. The deportation strategy needs to change too..no more 3 ICE agents wrestling one Mexican into handcuffs for 15 minutes. Spot an illegal, taze the fuck out of them, put a bag over their head and drive them immediately to the closest air force base where a c-130 is waiting. Fill the c-130. They wait there with the bags on their heads until the c-130 is filled then it immediately takes off and they're deported. Rinse and repeat. No housing, no beds, no food or water just straight from arrest to the plane to some shit hole country. That's the way it should be going. permalink parent award report block reply TEXinLA OP 1 points 3 days ago Agreed... Way Too Many RINOs are stopping this.. permalink parent award report block reply NoMoreShinesBilly 1 points 5 days ago if the gov says it's 10 million invaders under tater, it's 25 million at a minimum. permalink parent award report block reply OnlyTrump20 2 points 5 days ago The best deterrent is to end free handouts to foreigners who want to take our money.   Once they realize just how expensive it is to live in the US they'll see their home countries as the better place.   The illegal Mexicans in the US already consider Mexico better as they keep waving their flag around.  Why bother with the US at all. permalink award report block reply TEXinLA OP 1 points 3 days ago Agreed. Immediate deportation, lifetime tab kept for deportation costs and any government services used. permalink parent award report block reply SaltyTitties4 1 points 5 days ago … that they’re telling us about. permalink award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nMissingTrump 50 points 5 days ago Good. Now ship back the ones that are already here. permalink award report block reply GoUSA 25 points 5 days ago Exactly. It's a start, but our administration has clearly given a sign to corporate America that they get to keep their 50 million indentured servants . It would only take one perp walked CEO, before they send them all back. permalink parent award report block reply BeauHD 11 points 5 days ago Homan is doing what Homan is able to do. permalink parent award report block reply YouEssAye 4 points 5 days ago If he's doing all that he can do, and that's not even close to being enough, at what point can we hold him or his boss accountable? permalink parent award report block reply YodaBannon 1 points 5 days ago You got to know when to HOMAN, know when to fold em. 🍻 permalink parent award report block reply KernalMustard 2 points 5 days ago So know when to bluff or show your cards even though its a losing hand? I think you didnt think that through permalink parent award report block reply tt777 3 points 5 days ago There need to be a heavy fine for each illegal employed by a company. permalink parent award report block reply FatigueIsReal -1 points 5 days ago So then what about these CEOs that have been arrested.  You said one is all it takes right? Andy Ha, Owner/CEO of Prosperity Services Inc. Leonardo Baez-Lara and Nora Alicia Avila-Guel, Owners of Abby's Bakery Zhu \"George\" Chen, Owner of Wellmade Industries Robert Clouston and Brenda Clouston, Owners of Colt Grill John Washburn, General Manager of San Diego Powder & Protective Coatings Edit: MTG could be perp walked.  She claimed in an interview that she owns a construction company and that construction companies rely on illegals. permalink parent award report block reply AwShitHereWeGoAgain 6 points 5 days ago You're goddamn right!  Pump up those numbers! permalink parent award report block reply TEXinLA OP 2 points 3 days ago ^^THIS^^ permalink parent award report block reply\nGoUSA 25 points 5 days ago Exactly. It's a start, but our administration has clearly given a sign to corporate America that they get to keep their 50 million indentured servants . It would only take one perp walked CEO, before they send them all back. permalink parent award report block reply BeauHD 11 points 5 days ago Homan is doing what Homan is able to do. permalink parent award report block reply YouEssAye 4 points 5 days ago If he's doing all that he can do, and that's not even close to being enough, at what point can we hold him or his boss accountable? permalink parent award report block reply YodaBannon 1 points 5 days ago You got to know when to HOMAN, know when to fold em. 🍻 permalink parent award report block reply KernalMustard 2 points 5 days ago So know when to bluff or show your cards even though its a losing hand? I think you didnt think that through permalink parent award report block reply tt777 3 points 5 days ago There need to be a heavy fine for each illegal employed by a company. permalink parent award report block reply FatigueIsReal -1 points 5 days ago So then what about these CEOs that have been arrested.  You said one is all it takes right? Andy Ha, Owner/CEO of Prosperity Services Inc. Leonardo Baez-Lara and Nora Alicia Avila-Guel, Owners of Abby's Bakery Zhu \"George\" Chen, Owner of Wellmade Industries Robert Clouston and Brenda Clouston, Owners of Colt Grill John Washburn, General Manager of San Diego Powder & Protective Coatings Edit: MTG could be perp walked.  She claimed in an interview that she owns a construction company and that construction companies rely on illegals. permalink parent award report block reply\nBeauHD 11 points 5 days ago Homan is doing what Homan is able to do. permalink parent award report block reply YouEssAye 4 points 5 days ago If he's doing all that he can do, and that's not even close to being enough, at what point can we hold him or his boss accountable? permalink parent award report block reply YodaBannon 1 points 5 days ago You got to know when to HOMAN, know when to fold em. 🍻 permalink parent award report block reply KernalMustard 2 points 5 days ago So know when to bluff or show your cards even though its a losing hand? I think you didnt think that through permalink parent award report block reply\nYouEssAye 4 points 5 days ago If he's doing all that he can do, and that's not even close to being enough, at what point can we hold him or his boss accountable? permalink parent award report block reply\nYodaBannon 1 points 5 days ago You got to know when to HOMAN, know when to fold em. 🍻 permalink parent award report block reply KernalMustard 2 points 5 days ago So know when to bluff or show your cards even though its a losing hand? I think you didnt think that through permalink parent award report block reply\nKernalMustard 2 points 5 days ago So know when to bluff or show your cards even though its a losing hand? I think you didnt think that through permalink parent award report block reply\ntt777 3 points 5 days ago There need to be a heavy fine for each illegal employed by a company. permalink parent award report block reply\nFatigueIsReal -1 points 5 days ago So then what about these CEOs that have been arrested.  You said one is all it takes right? Andy Ha, Owner/CEO of Prosperity Services Inc. Leonardo Baez-Lara and Nora Alicia Avila-Guel, Owners of Abby's Bakery Zhu \"George\" Chen, Owner of Wellmade Industries Robert Clouston and Brenda Clouston, Owners of Colt Grill John Washburn, General Manager of San Diego Powder & Protective Coatings Edit: MTG could be perp walked.  She claimed in an interview that she owns a construction company and that construction companies rely on illegals. permalink parent award report block reply\nAwShitHereWeGoAgain 6 points 5 days ago You're goddamn right!  Pump up those numbers! permalink parent award report block reply\nTEXinLA OP 2 points 3 days ago ^^THIS^^ permalink parent award report block reply\nTEXinLA OP 18 points 5 days ago From the article: During the month of October, Border Patrol agents apprehended approximately 8,000 migrants who illegally crossed the border between ports of entry. Officials say this represents an arrest rate of 258 illegal aliens per day — less than 11 per hour. During the Biden administration, agents were overwhelmed with an average apprehension rate of more than 5,100 per day. One year ago, agents apprehended more than 300 illegal aliens every four hours. permalink award report block reply\nbigdickhangsright 18 points 5 days ago It's... almost... as if border control works for sovereign countries and the Democrats intentionally tried to destroy our nation. permalink award report block reply Oleander 8 points 5 days ago They succeeded in doing so. Things are going to get a lot worse before they get better, far too many were already let in. That's not to mention border security is now a political issue instead of bipartisan, so Democrats will do their best to reverse all security once they get back in, possibly even do mass amnesty. permalink parent award report block reply TEXinLA OP 1 points 3 days ago WEIRD HUH? permalink parent award report block reply\nOleander 8 points 5 days ago They succeeded in doing so. Things are going to get a lot worse before they get better, far too many were already let in. That's not to mention border security is now a political issue instead of bipartisan, so Democrats will do their best to reverse all security once they get back in, possibly even do mass amnesty. permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago WEIRD HUH? permalink parent award report block reply\nRandyMoss 9 points 5 days ago I'm at the DMV right now. Rural MN. 50% of the people here don't speak English. Trump isn't doing shit. It's all optics. permalink award report block reply UCantStumpTheTrump 0 points 5 days ago lol bitch some more doomer, Trump is currently doing the biggest deportation and immigration enforcement operations in our lifetimes, and it’s not good enough for you. You know what was optics? When Obama changed the definition of “deported” to include those simply turned away at the border, so they could inflate their deportation statistics permalink parent award report block reply RandyMoss 1 points 5 days ago That isn't really saying anything, sadly. In defense of Trump it may take time to build the systems and infrastructure to accommodate the numbers that need deporting.  That's an optimistic view.\nA pessimistic view (doomer if you insist) recognizes that branding and noise are what Trump specializes in. Results? A lot less. Is it his fault? Ultimately yes because he keeps trying to work with the traitor RINOs instead of demanding they work with him or get the boot. Trump has really lost me when he picks fights with Massie and Paul on legislation that was WRITTEN BY THE BIDEN ADMINISTRATION!!!  How do you reconcile that? permalink parent award report block reply UCantStumpTheTrump 1 points 5 days ago Literally no other GOP politician even had the political will to touch the idea of a border wall or deportations with a ten foot pole, much less actually get those efforts underway. Once again, your claim of “no results” is provably false. Speaking in sweeping absolutes just makes you look like a concern troll shill. permalink parent award report block reply RandyMoss 2 points 4 days ago Fair point on the border wall. Deportations has yet to be determined. I will believe it when I don't see DMV workers happily helping illegals get drivers licenses. It was literally half of the people there. Easy pickings for a serious deportation effort. permalink parent award report block reply\nUCantStumpTheTrump 0 points 5 days ago lol bitch some more doomer, Trump is currently doing the biggest deportation and immigration enforcement operations in our lifetimes, and it’s not good enough for you. You know what was optics? When Obama changed the definition of “deported” to include those simply turned away at the border, so they could inflate their deportation statistics permalink parent award report block reply RandyMoss 1 points 5 days ago That isn't really saying anything, sadly. In defense of Trump it may take time to build the systems and infrastructure to accommodate the numbers that need deporting.  That's an optimistic view.\nA pessimistic view (doomer if you insist) recognizes that branding and noise are what Trump specializes in. Results? A lot less. Is it his fault? Ultimately yes because he keeps trying to work with the traitor RINOs instead of demanding they work with him or get the boot. Trump has really lost me when he picks fights with Massie and Paul on legislation that was WRITTEN BY THE BIDEN ADMINISTRATION!!!  How do you reconcile that? permalink parent award report block reply UCantStumpTheTrump 1 points 5 days ago Literally no other GOP politician even had the political will to touch the idea of a border wall or deportations with a ten foot pole, much less actually get those efforts underway. Once again, your claim of “no results” is provably false. Speaking in sweeping absolutes just makes you look like a concern troll shill. permalink parent award report block reply RandyMoss 2 points 4 days ago Fair point on the border wall. Deportations has yet to be determined. I will believe it when I don't see DMV workers happily helping illegals get drivers licenses. It was literally half of the people there. Easy pickings for a serious deportation effort. permalink parent award report block reply\nRandyMoss 1 points 5 days ago That isn't really saying anything, sadly. In defense of Trump it may take time to build the systems and infrastructure to accommodate the numbers that need deporting.  That's an optimistic view.\nA pessimistic view (doomer if you insist) recognizes that branding and noise are what Trump specializes in. Results? A lot less. Is it his fault? Ultimately yes because he keeps trying to work with the traitor RINOs instead of demanding they work with him or get the boot. Trump has really lost me when he picks fights with Massie and Paul on legislation that was WRITTEN BY THE BIDEN ADMINISTRATION!!!  How do you reconcile that? permalink parent award report block reply UCantStumpTheTrump 1 points 5 days ago Literally no other GOP politician even had the political will to touch the idea of a border wall or deportations with a ten foot pole, much less actually get those efforts underway. Once again, your claim of “no results” is provably false. Speaking in sweeping absolutes just makes you look like a concern troll shill. permalink parent award report block reply RandyMoss 2 points 4 days ago Fair point on the border wall. Deportations has yet to be determined. I will believe it when I don't see DMV workers happily helping illegals get drivers licenses. It was literally half of the people there. Easy pickings for a serious deportation effort. permalink parent award report block reply\nUCantStumpTheTrump 1 points 5 days ago Literally no other GOP politician even had the political will to touch the idea of a border wall or deportations with a ten foot pole, much less actually get those efforts underway. Once again, your claim of “no results” is provably false. Speaking in sweeping absolutes just makes you look like a concern troll shill. permalink parent award report block reply RandyMoss 2 points 4 days ago Fair point on the border wall. Deportations has yet to be determined. I will believe it when I don't see DMV workers happily helping illegals get drivers licenses. It was literally half of the people there. Easy pickings for a serious deportation effort. permalink parent award report block reply\nRandyMoss 2 points 4 days ago Fair point on the border wall. Deportations has yet to be determined. I will believe it when I don't see DMV workers happily helping illegals get drivers licenses. It was literally half of the people there. Easy pickings for a serious deportation effort. permalink parent award report block reply\nYesImWhite 8 points 5 days ago Charge Mayorkas with TREASON. It was THIS EASY. permalink award report block reply TEXinLA OP 1 points 3 days ago EXACTLY permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago EXACTLY permalink parent award report block reply\nRoadpower 6 points 5 days ago The changes need to be cemented, just having a back and forth with each change of administration is not going to save us. I'm not saying that I'm not grateful but without locked down changes the importers of the third world will eventually win with their Zerg tactics and they know it. permalink award report block reply TEXinLA OP 2 points 3 days ago Agreed permalink parent award report block reply\nTEXinLA OP 2 points 3 days ago Agreed permalink parent award report block reply\nKlown_Kutz 5 points 5 days ago Great.  Now MORE deportations.  I don't see enough liberal white women crying about their precious proto-humans. permalink award report block reply TEXinLA OP 1 points 3 days ago Exactly permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago Exactly permalink parent award report block reply\nMythArcana 5 points 5 days ago Round 'em up, move 'em out, Rawhide!    🐂💨 permalink award report block reply TEXinLA OP 2 points 3 days ago Roll 'em Roll 'em Roll 'em permalink parent award report block reply\nTEXinLA OP 2 points 3 days ago Roll 'em Roll 'em Roll 'em permalink parent award report block reply\nKnockoff 5 points 5 days ago It wasn’t impossible nor was it hard. Our laws weren’t “broken.”The invasion was deliberate. It was treason. permalink award report block reply TEXinLA OP 1 points 3 days ago Exactly. ROPE permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago Exactly. ROPE permalink parent award report block reply\nCouchbeer69 4 points 5 days ago Remember when democrats and a few stooges like Oklahoma's james lankford tried to tell us they needed to pass a book a new bill to secure the border? permalink award report block reply TEXinLA OP 1 points 3 days ago Uniparty Fucks permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago Uniparty Fucks permalink parent award report block reply\nLearnAboutRoaches 4 points 5 days ago I support zero releases https://www.youtube.com/watch?v=qpZIb5io1K8 permalink award report block reply\nRockyBalboa 3 points 5 days ago Great start.  How many miles of southern  border wall remain to be built? permalink award report block reply TEXinLA OP 1 points 3 days ago IDK; hopefully not much permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago IDK; hopefully not much permalink parent award report block reply\nVanDeKoik 3 points 5 days ago 0? Yet some people here: Trump isnt doing anything!!! permalink award report block reply UCantStumpTheTrump 1 points 5 days ago The site currently is flooded with Redditors pretending to be upset Trump supporters because he’s not doing enough, fast enough permalink parent award report block reply TEXinLA OP 1 points 3 days ago God Bless and Protect Our GEOTUS permalink parent award report block reply\nUCantStumpTheTrump 1 points 5 days ago The site currently is flooded with Redditors pretending to be upset Trump supporters because he’s not doing enough, fast enough permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago God Bless and Protect Our GEOTUS permalink parent award report block reply\nNickAtNight 3 points 5 days ago God bless you President Trump and all the border agents ! permalink award report block reply TEXinLA OP 1 points 3 days ago ^^THIS^^ permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago ^^THIS^^ permalink parent award report block reply\nBullet3250 3 points 5 days ago Joe Biden should be put in JAIL. permalink award report block reply TEXinLA OP 2 points 3 days ago Along with everyone else involved in the destruction of America permalink parent award report block reply\nTEXinLA OP 2 points 3 days ago Along with everyone else involved in the destruction of America permalink parent award report block reply\n2scoops2peachmints 2 points 5 days ago It doesn’t help that they’re already here. Makes sense crossings are down with the flood over the last 4 years permalink award report block reply TEXinLA OP 1 points 3 days ago More Deep State permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago More Deep State permalink parent award report block reply\nswimmer75 2 points 5 days ago Now, deny any muslim entry to America. permalink award report block reply\nJoePlumber 2 points 5 days ago On pace to deport 4m out of 10m that came in under Biden, out of 100m that are here illegally total.n permalink award report block reply TEXinLA OP 1 points 3 days ago Time to turn the screws. Start with the illegals using the greatest amount of taxpayer money. There's illegals in the CA health care system that suck up several million dollars a year. permalink parent award report block reply JoePlumber 3 points 3 days ago I'm tired of the \"start with these\" argument that's how we wound up here, 10 months in with only 600k deported. We need to crank it up across the board. Every single workplace should be investigated and raided. Every single illegal needs to be round up and shipped back. The deportation strategy needs to change too..no more 3 ICE agents wrestling one Mexican into handcuffs for 15 minutes. Spot an illegal, taze the fuck out of them, put a bag over their head and drive them immediately to the closest air force base where a c-130 is waiting. Fill the c-130. They wait there with the bags on their heads until the c-130 is filled then it immediately takes off and they're deported. Rinse and repeat. No housing, no beds, no food or water just straight from arrest to the plane to some shit hole country. That's the way it should be going. permalink parent award report block reply TEXinLA OP 1 points 3 days ago Agreed... Way Too Many RINOs are stopping this.. permalink parent award report block reply NoMoreShinesBilly 1 points 5 days ago if the gov says it's 10 million invaders under tater, it's 25 million at a minimum. permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago Time to turn the screws. Start with the illegals using the greatest amount of taxpayer money. There's illegals in the CA health care system that suck up several million dollars a year. permalink parent award report block reply JoePlumber 3 points 3 days ago I'm tired of the \"start with these\" argument that's how we wound up here, 10 months in with only 600k deported. We need to crank it up across the board. Every single workplace should be investigated and raided. Every single illegal needs to be round up and shipped back. The deportation strategy needs to change too..no more 3 ICE agents wrestling one Mexican into handcuffs for 15 minutes. Spot an illegal, taze the fuck out of them, put a bag over their head and drive them immediately to the closest air force base where a c-130 is waiting. Fill the c-130. They wait there with the bags on their heads until the c-130 is filled then it immediately takes off and they're deported. Rinse and repeat. No housing, no beds, no food or water just straight from arrest to the plane to some shit hole country. That's the way it should be going. permalink parent award report block reply TEXinLA OP 1 points 3 days ago Agreed... Way Too Many RINOs are stopping this.. permalink parent award report block reply\nJoePlumber 3 points 3 days ago I'm tired of the \"start with these\" argument that's how we wound up here, 10 months in with only 600k deported. We need to crank it up across the board. Every single workplace should be investigated and raided. Every single illegal needs to be round up and shipped back. The deportation strategy needs to change too..no more 3 ICE agents wrestling one Mexican into handcuffs for 15 minutes. Spot an illegal, taze the fuck out of them, put a bag over their head and drive them immediately to the closest air force base where a c-130 is waiting. Fill the c-130. They wait there with the bags on their heads until the c-130 is filled then it immediately takes off and they're deported. Rinse and repeat. No housing, no beds, no food or water just straight from arrest to the plane to some shit hole country. That's the way it should be going. permalink parent award report block reply TEXinLA OP 1 points 3 days ago Agreed... Way Too Many RINOs are stopping this.. permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago Agreed... Way Too Many RINOs are stopping this.. permalink parent award report block reply\nNoMoreShinesBilly 1 points 5 days ago if the gov says it's 10 million invaders under tater, it's 25 million at a minimum. permalink parent award report block reply\nOnlyTrump20 2 points 5 days ago The best deterrent is to end free handouts to foreigners who want to take our money.   Once they realize just how expensive it is to live in the US they'll see their home countries as the better place.   The illegal Mexicans in the US already consider Mexico better as they keep waving their flag around.  Why bother with the US at all. permalink award report block reply TEXinLA OP 1 points 3 days ago Agreed. Immediate deportation, lifetime tab kept for deportation costs and any government services used. permalink parent award report block reply\nTEXinLA OP 1 points 3 days ago Agreed. Immediate deportation, lifetime tab kept for deportation costs and any government services used. permalink parent award report block reply\nSaltyTitties4 1 points 5 days ago … that they’re telling us about. permalink award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:55:35.915591Z"
}