{
  "id": "1ARK5BIFKV",
  "url": "https://patriots.win/p/1ARK5BIFKV/president-trump-pardons-rudy-giu/c",
  "content": "1652 President Trump PARDONS Rudy Giuliani GEOTUS posted 3 days ago by I-am-Orlando PRO 124 comments award share download report block\n124 comments Sort by Top Top New Worst Old Save eclectic22 227 points 3 days ago They deserve not only the pardon, but the full restitution of the legal expenses they have incurred. permalink award report block reply Blackmore 110 points 3 days ago They need or deserve their life back. permalink parent award report block reply UCantStumpTheTrump 93 points 3 days ago Rudy as AG. permalink parent award report block reply jedfag 33 points 3 days ago Fuck YEAH! permalink parent award report block reply posedgeclk 7 points 2 days ago I am 100% for it. Guliani has my respect for being so firm and never caving. He and Trump are in this together. Who needs a law license anyway? permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 2 more comments... PatriotSam 21 points 3 days ago He's gotten too senile unfortunately. Not quite Joe Biden level but he's way up there in age permalink parent award report block reply PiratePatriot 17 points 3 days ago this. I didn't notice Rudi so much when he was younger, seeing him targetted made me go back to his earlier years. The guy cleaned up New York, did great things. Seeing the relentless lawfare against him was disgusting. he could have retired gracefully into a peaceful life in a remote area, away from those who hunted him. But no, he stood his ground while they attacked. permalink parent award report block reply view 4 more comments... KarlHungus53 2 points 2 days ago Ever see the one interview he did with Bannon where he goes on a rant about playing in a pro-am golf event with Michelle Wie and talks about checking out her panties?  Steve was mortified. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago U/maverick202 is a shill who is a self-admitted “troll” who comes here to insult this community, and also believes Joe Biden won 81 million votes lmfao permalink parent award report block reply maverick202 0 points 2 days ago Right. Let him ride it out in peace. He has done his work. permalink parent award report block reply view 1 more comments... Hanging_Chad 6 points 3 days ago this is the way permalink parent award report block reply Hawksendoom 2 points 3 days ago this is the way permalink parent award report block reply Deportthemall23 3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply BlackPilledMAGA 3 points 3 days ago Rudy would go guns blazing no fucks given he's old and he's angry and he's not trying to climb the political ladders like Pam Blondi is. He would not be diplomatic or gentle in hopes of currying favor, he would be out for the blood of the swamp. He is exactly what we need as AG. So he's getting old.. so what. He's more than capable of assigning cases and ordering investigations. Pam Blondi will never do anything except go on TV and talk, and talk and talk to no end. permalink parent award report block reply snoopy3210 2 points 2 days ago Seriously he knows where the bodies are buried. Starting with Biden’ money transfers to his family members via shell companies and 50% for the big guy (it wasn’t 10% that was a comment from a stranger, Hunter said he was giving 50% to father Joe! He paid his father’ mortgage with that foreign money!) permalink parent award report block reply load 1 more comments... Wtf_socialismreally 38 points 3 days ago Paid for by the criminals who pursued them, not by the U.S. government preferably. permalink parent award report block reply Mungo 19 points 3 days ago One of the few things I’d be ok with my tax dollars going to. permalink parent award report block reply Wtf_socialismreally 22 points 3 days ago Sure, sure. But I'd be even more okay if we punished the people. permalink parent award report block reply Mungo 7 points 3 days ago Agreed permalink parent award report block reply Mr_Rightside 16 points 3 days ago $17.76 million each should cover it. The DNC can pay for it. permalink parent award report block reply Hawksendoom 1 points 3 days ago no more us aid though... maybe soros? permalink parent award report block reply Nomad899 9 points 3 days ago Paid by the commie clowns whom went after them permalink parent award report block reply projectarcturus1 2 points 3 days ago I agree. The democrats who did it should pay for it and then go to prison for their crimes. permalink parent award report block reply HockeyMom4Trump 2 points 3 days ago For sure. permalink parent award report block reply load 4 more comments... DT170x 68 points 3 days ago Deport the Kebab Mayor and Reinstall Rudy Giuliani as the mayor of NYC. permalink award report block reply SPEDMan64 35 points 3 days ago I got to experience the Rudy Era during my time in NYC, but then Bloomberg came along and took a big shit on everything. permalink parent award report block reply IvIA6A 3 points 2 days ago Bloomberg was a swiss picnic compared to what they have now, Adams, and deblassio permalink parent award report block reply pollsarefake -1 points 2 days ago The infiltrator mayor is a satanic pedo Trump is chosen by God to eradicate the satanic pedo cabal Giuliani is a loyal lieutenant to Trump God wins in the end which means Trump wins permalink parent award report block reply Klaus73 1 points 2 days ago Unless your on the Epstien list. permalink parent award report block reply pollsarefake 1 points 2 days ago Epstein is a demoncrat hoax just like Russia Russia Russia permalink parent award report block reply Klaus73 1 points 2 days ago What exactly were the democrats claiming Trump was going to do for Russia? permalink parent award report block reply Hanging_Chad 41 points 3 days ago will he be dis-disbarred? permalink award report block reply Blackmore 27 points 3 days ago That’s another department so rigged for sure. permalink parent award report block reply Mathelm 13 points 3 days ago No, in a totally bullshit regulatory system. The Appellate Division of the new[sic] york[sic] Supreme Court controls who gets to be an attorney in new york. (Supreme Court is the Regular Trial Court, Court of Appeals is \"highest\" in new york) they will not reinstate him. Should be like every other regulatory body (rules by the legislature, administrated by the executive, adjudicated by the courts) permalink parent award report block reply Hawksendoom 6 points 3 days ago annnnd i hate how you are fucking right. :D permalink parent award report block reply Mathelm 4 points 3 days ago anytime, you aren't the first to say that. permalink parent award report block reply BarneyFrank 2 points 3 days ago Re-barred? Like concrete…the kind that jet fuel can’t melt. permalink parent award report block reply Hawksendoom 3 points 3 days ago 9/11 thermite has left the chat.... XD permalink parent award report block reply Klaus73 3 points 2 days ago Along with the gold permalink parent award report block reply couranto 28 points 3 days ago Hopefully he didn’t pardon the one bitch who turned on him and worked a deal. permalink award report block reply MasterChief08 21 points 3 days ago Unfortunately he did. Trump is wayyy too nice permalink parent award report block reply Apersonofinterest 9 points 3 days ago Trump is leaving no man behind. He came back for the J6’ers, he came back for his friends and the people who supported and defended him. That’s the kind of leader I will go to war with. permalink parent award report block reply Trollasaurus 4 points 2 days ago She didn’t support him she turned on him and went on a media parade backstabbing him permalink parent award report block reply RedCalifornia 3 points 2 days ago Jenna Ellis? Yeah pretty sure she was compromised from the start. Who benefitted from the chaos of the 2020 election? permalink parent award report block reply RedCalifornia 1 points 2 days ago If there aren’t arrests or trials, even for the monster who murdered Ashli, he’s not “leaving no man behind” permalink parent award report block reply Apersonofinterest 1 points 2 days ago I’m talking about his supporters that were punished for supporting him. That’s what “leave no man behind” means. You’re changing the subject to shit on Trump some more. Everyone can see what you people are doing. permalink parent award report block reply TheRedPike 3 points 2 days ago The smooth brains that gave her the deal eventually figured out she was of zero use to them. permalink parent award report block reply darkmodeforgotpass 19 points 3 days ago What about all the shit they robbed and thieved from him like the thugs they are? permalink award report block reply progressives4Trump 15 points 3 days ago Mike lindell? permalink award report block reply phibetared 7 points 3 days ago Don't know, can't find.  But Sydney Powell has been pardoned by Trump. permalink parent award report block reply progressives4Trump 1 points 2 days ago Thanks for looking, I didn't find it either.  But he did say it was not an exhaustive list. permalink parent award report block reply _Sully_ 13 points 3 days ago John Eastman was absolutely railroaded. The people who did this no shit need to go to Gitmo. permalink award report block reply pedeypete 12 points 3 days ago I'm used to a machine holding a pen for pardons, what is this sorcery? permalink award report block reply TruthyBrat 2 points 3 days ago Underrated comment, and who the Hell downvoted this!? Clueless or needs deporting. permalink parent award report block reply Apersonofinterest 2 points 3 days ago Trump is violating NORMS!!! Reeeee permalink parent award report block reply Klaus73 1 points 2 days ago Ask the CEO of Binance. Apparently the machine is still working just fine... permalink parent award report block reply I-am-Orlando OP PRO 11 points 3 days ago Link https://x.com/EricLDaugh/status/1987746295097041404?s=20 permalink award report block reply KEK_1776_KEK 10 points 3 days ago Fuck you Democrats permalink award report block reply covok48 10 points 3 days ago Close the gate after the horses left. permalink award report block reply newuser8 9 points 3 days ago He's broke, right? permalink award report block reply TheEdgeOfTheEarth 5 points 3 days ago https://scored.co/c/TheDonald/p/19BtBk7PcK/ permalink parent award report block reply josiborg 7 points 3 days ago Why did it take so long? permalink award report block reply WarGreymon77 6 points 3 days ago It's horrible what they did to Rudy. permalink award report block reply ALEXNEGO8 6 points 3 days ago Fantastic, and his legal fees are included in the pardon.\nThey really look to drive Giuliani and all Trump‘s associates into bankruptcy. permalink award report block reply LLegendary 6 points 3 days ago Pardon them for everything for their entire lives..... permalink award report block reply Cowboy888 4 points 3 days ago Time to shove their Russia, Russia, up their lazy sorry asses. permalink award report block reply N14205ST205 3 points 3 days ago Yesssssss! Another win. permalink award report block reply Live_free_or_die_55 3 points 2 days ago And should hang the traitors who did this! permalink award report block reply Dualsporter 3 points 2 days ago They shouldn't need pardoned. They did nothing wrong. 2020 needs to be exposed for the treasonous stolen election that it was. These people need to be fully vindicated as the heroes they are. permalink award report block reply Piglips 3 points 2 days ago Tina Peters? permalink award report block reply FlyCatcher94 2 points 2 days ago Unfortunately she was convicted of state crimes which he has no jurisdiction over. permalink parent award report block reply Piglips 1 points 2 days ago Yeah, i know, but im still ragging on it. All he has to do is give the word. permalink parent award report block reply FlyCatcher94 2 points 1 day ago Totally agree, it’s fucking bullshit permalink parent award report block reply Smurfection 3 points 2 days ago It's about time.  None of these cases should ever even have been brought. permalink award report block reply DCYR66 3 points 2 days ago Long overdue! God bless Rudy! permalink award report block reply SaltyCamaro 3 points 2 days ago Now arrest Ruby Freeman for election interference permalink award report block reply Michalusmichalus 3 points 2 days ago I want Rudy to get his watches back. permalink award report block reply raptormissle 3 points 3 days ago I can't wait for the criminals who abused their position and broke laws to target conservatives to get indicted. permalink award report block reply Apersonofinterest 1 points 3 days ago That would be the only thing I want for Christmas and I would be good for the rest of my life permalink parent award report block reply Rydanovich 2 points 2 days ago This is what I voted for. permalink award report block reply rangooooo 2 points 3 days ago Nominate him to Supreme Court permalink award report block reply Italianshamrock 2 points 2 days ago Should’ve happened sooner in my opinion. permalink award report block reply KarlHungus53 1 points 2 days ago What took so long? permalink award report block reply EXT_Finn 1 points 3 days ago Not autopen this time. permalink award report block reply Dr_Phil 1 points 2 days ago Epshteyn permalink award report block reply TheSwampThang 1 points 3 days ago I would pardon Jenna's booty permalink award report block reply Klaus73 1 points 2 days ago Shes a servant of Christ...do not spare the rod...spoil her. permalink parent award report block reply LogicCircuits 1 points 3 days ago This is about to get spicy permalink award report block reply T_Hed 1 points 2 days ago WOW, He even pardoned Jenna Ellis who turned out to be such a shitbird to him.\nI would have left her off the list. permalink award report block reply y_do_i_need_to_hide 1 points 2 days ago I do not know if this is good, yet. permalink award report block reply CanadianMeathead 1 points 3 days ago Are those state crimes? Can he pardon for those? permalink award report block reply MasterChief08 11 points 3 days ago It means the federal government can never again try to go after them. They were trying to elevate everything to the feds. The Georgia cases are dead. The state legislature and higher courts pretty much put an end to it after Fanni got caught sleeping with the head attorney. You're right that he can't pardon state crimes but Georgia is over. permalink parent award report block reply Aisle-is-closed 1 points 2 days ago Tiny Peters? Or are those charges all state level? permalink award report block reply DenturesNancy 1 points 2 days ago didn't Boris Ephstein jump ship and joined the Ron DeSantis failed wagon? permalink award report block reply Crappydatum 1 points 2 days ago But not Tina Peters, sadly permalink award report block reply Klaus73 1 points 2 days ago How did this take a YEAR? permalink award report block reply dataonly 1 points 2 days ago Wait... A president can directly sign a pardon?  Thought the vast majority were products of the \"autopen\"? Who knew? permalink award report block reply Klaus73 1 points 2 days ago Apparently without even knowing whom he is pardoning.. permalink parent award report block reply Overtaxed 1 points 2 days ago What took so long? permalink award report block reply Klaus73 2 points 2 days ago Aye seems weird it took over a year given the J6 pardons were like 2 months. permalink parent award report block reply SaltyTitties4 1 points 2 days ago Mark Meadows is a lying spy for China. permalink award report block reply maverick202 0 points 2 days ago Based!! No one deserved to be pardoned more than Giuliani! permalink award report block reply UCantStumpTheTrump 1 points 2 days ago U/maverick202 is a shill who is a self-admitted “troll” who comes here to insult this community, and also believes Joe Biden won 81 million votes lmfao. He occasionally posts normal takes to blend in permalink parent award report block reply PKC_MAN -5 points 3 days ago Why did he wait 1 year to do that? permalink award report block reply Apersonofinterest 9 points 3 days ago He’s busy. He’s got a lot of shit going on ya know? Complicated business. Too many people don’t seem to appreciate the miracle we have right now. It’s never good enough. If he does a thing, it wasn’t fast enough or what about this other thing he didn’t do? He’s a sell out!!! Reeee… permalink parent award report block reply Klaus73 1 points 2 days ago Well no - its a question; stop taking everything as an attack. Like was there some sort of pushback? Some sort of reason?\nConsider this - dude chose to go play golf multiple times rather then stop his most ardent supporters from rotting in prison; if the reason is \"he was just too darn busy\". I suspect there were other reasons; given how fast the j6 pardons came its actually a question worth asking especially when most of the legalese shit should have been able to be handled by Pam \"Heels up on her desk\" Bondi. permalink parent award report block reply NYforTrump 2 points 3 days ago Yeah he should have just done it back in January when he did the J6 cases. permalink parent award report block reply EyesSewnShut 0 points 3 days ago Comment removed by community moderators. permalink award report block reply\neclectic22 227 points 3 days ago They deserve not only the pardon, but the full restitution of the legal expenses they have incurred. permalink award report block reply Blackmore 110 points 3 days ago They need or deserve their life back. permalink parent award report block reply UCantStumpTheTrump 93 points 3 days ago Rudy as AG. permalink parent award report block reply jedfag 33 points 3 days ago Fuck YEAH! permalink parent award report block reply posedgeclk 7 points 2 days ago I am 100% for it. Guliani has my respect for being so firm and never caving. He and Trump are in this together. Who needs a law license anyway? permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 2 more comments... PatriotSam 21 points 3 days ago He's gotten too senile unfortunately. Not quite Joe Biden level but he's way up there in age permalink parent award report block reply PiratePatriot 17 points 3 days ago this. I didn't notice Rudi so much when he was younger, seeing him targetted made me go back to his earlier years. The guy cleaned up New York, did great things. Seeing the relentless lawfare against him was disgusting. he could have retired gracefully into a peaceful life in a remote area, away from those who hunted him. But no, he stood his ground while they attacked. permalink parent award report block reply view 4 more comments... KarlHungus53 2 points 2 days ago Ever see the one interview he did with Bannon where he goes on a rant about playing in a pro-am golf event with Michelle Wie and talks about checking out her panties?  Steve was mortified. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago U/maverick202 is a shill who is a self-admitted “troll” who comes here to insult this community, and also believes Joe Biden won 81 million votes lmfao permalink parent award report block reply maverick202 0 points 2 days ago Right. Let him ride it out in peace. He has done his work. permalink parent award report block reply view 1 more comments... Hanging_Chad 6 points 3 days ago this is the way permalink parent award report block reply Hawksendoom 2 points 3 days ago this is the way permalink parent award report block reply Deportthemall23 3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply BlackPilledMAGA 3 points 3 days ago Rudy would go guns blazing no fucks given he's old and he's angry and he's not trying to climb the political ladders like Pam Blondi is. He would not be diplomatic or gentle in hopes of currying favor, he would be out for the blood of the swamp. He is exactly what we need as AG. So he's getting old.. so what. He's more than capable of assigning cases and ordering investigations. Pam Blondi will never do anything except go on TV and talk, and talk and talk to no end. permalink parent award report block reply snoopy3210 2 points 2 days ago Seriously he knows where the bodies are buried. Starting with Biden’ money transfers to his family members via shell companies and 50% for the big guy (it wasn’t 10% that was a comment from a stranger, Hunter said he was giving 50% to father Joe! He paid his father’ mortgage with that foreign money!) permalink parent award report block reply load 1 more comments... Wtf_socialismreally 38 points 3 days ago Paid for by the criminals who pursued them, not by the U.S. government preferably. permalink parent award report block reply Mungo 19 points 3 days ago One of the few things I’d be ok with my tax dollars going to. permalink parent award report block reply Wtf_socialismreally 22 points 3 days ago Sure, sure. But I'd be even more okay if we punished the people. permalink parent award report block reply Mungo 7 points 3 days ago Agreed permalink parent award report block reply Mr_Rightside 16 points 3 days ago $17.76 million each should cover it. The DNC can pay for it. permalink parent award report block reply Hawksendoom 1 points 3 days ago no more us aid though... maybe soros? permalink parent award report block reply Nomad899 9 points 3 days ago Paid by the commie clowns whom went after them permalink parent award report block reply projectarcturus1 2 points 3 days ago I agree. The democrats who did it should pay for it and then go to prison for their crimes. permalink parent award report block reply HockeyMom4Trump 2 points 3 days ago For sure. permalink parent award report block reply load 4 more comments...\nBlackmore 110 points 3 days ago They need or deserve their life back. permalink parent award report block reply UCantStumpTheTrump 93 points 3 days ago Rudy as AG. permalink parent award report block reply jedfag 33 points 3 days ago Fuck YEAH! permalink parent award report block reply posedgeclk 7 points 2 days ago I am 100% for it. Guliani has my respect for being so firm and never caving. He and Trump are in this together. Who needs a law license anyway? permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 2 more comments... PatriotSam 21 points 3 days ago He's gotten too senile unfortunately. Not quite Joe Biden level but he's way up there in age permalink parent award report block reply PiratePatriot 17 points 3 days ago this. I didn't notice Rudi so much when he was younger, seeing him targetted made me go back to his earlier years. The guy cleaned up New York, did great things. Seeing the relentless lawfare against him was disgusting. he could have retired gracefully into a peaceful life in a remote area, away from those who hunted him. But no, he stood his ground while they attacked. permalink parent award report block reply view 4 more comments... KarlHungus53 2 points 2 days ago Ever see the one interview he did with Bannon where he goes on a rant about playing in a pro-am golf event with Michelle Wie and talks about checking out her panties?  Steve was mortified. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago U/maverick202 is a shill who is a self-admitted “troll” who comes here to insult this community, and also believes Joe Biden won 81 million votes lmfao permalink parent award report block reply maverick202 0 points 2 days ago Right. Let him ride it out in peace. He has done his work. permalink parent award report block reply view 1 more comments... Hanging_Chad 6 points 3 days ago this is the way permalink parent award report block reply Hawksendoom 2 points 3 days ago this is the way permalink parent award report block reply Deportthemall23 3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply BlackPilledMAGA 3 points 3 days ago Rudy would go guns blazing no fucks given he's old and he's angry and he's not trying to climb the political ladders like Pam Blondi is. He would not be diplomatic or gentle in hopes of currying favor, he would be out for the blood of the swamp. He is exactly what we need as AG. So he's getting old.. so what. He's more than capable of assigning cases and ordering investigations. Pam Blondi will never do anything except go on TV and talk, and talk and talk to no end. permalink parent award report block reply snoopy3210 2 points 2 days ago Seriously he knows where the bodies are buried. Starting with Biden’ money transfers to his family members via shell companies and 50% for the big guy (it wasn’t 10% that was a comment from a stranger, Hunter said he was giving 50% to father Joe! He paid his father’ mortgage with that foreign money!) permalink parent award report block reply load 1 more comments...\nUCantStumpTheTrump 93 points 3 days ago Rudy as AG. permalink parent award report block reply jedfag 33 points 3 days ago Fuck YEAH! permalink parent award report block reply posedgeclk 7 points 2 days ago I am 100% for it. Guliani has my respect for being so firm and never caving. He and Trump are in this together. Who needs a law license anyway? permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 2 more comments... PatriotSam 21 points 3 days ago He's gotten too senile unfortunately. Not quite Joe Biden level but he's way up there in age permalink parent award report block reply PiratePatriot 17 points 3 days ago this. I didn't notice Rudi so much when he was younger, seeing him targetted made me go back to his earlier years. The guy cleaned up New York, did great things. Seeing the relentless lawfare against him was disgusting. he could have retired gracefully into a peaceful life in a remote area, away from those who hunted him. But no, he stood his ground while they attacked. permalink parent award report block reply view 4 more comments... KarlHungus53 2 points 2 days ago Ever see the one interview he did with Bannon where he goes on a rant about playing in a pro-am golf event with Michelle Wie and talks about checking out her panties?  Steve was mortified. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago U/maverick202 is a shill who is a self-admitted “troll” who comes here to insult this community, and also believes Joe Biden won 81 million votes lmfao permalink parent award report block reply maverick202 0 points 2 days ago Right. Let him ride it out in peace. He has done his work. permalink parent award report block reply view 1 more comments... Hanging_Chad 6 points 3 days ago this is the way permalink parent award report block reply Hawksendoom 2 points 3 days ago this is the way permalink parent award report block reply Deportthemall23 3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply BlackPilledMAGA 3 points 3 days ago Rudy would go guns blazing no fucks given he's old and he's angry and he's not trying to climb the political ladders like Pam Blondi is. He would not be diplomatic or gentle in hopes of currying favor, he would be out for the blood of the swamp. He is exactly what we need as AG. So he's getting old.. so what. He's more than capable of assigning cases and ordering investigations. Pam Blondi will never do anything except go on TV and talk, and talk and talk to no end. permalink parent award report block reply snoopy3210 2 points 2 days ago Seriously he knows where the bodies are buried. Starting with Biden’ money transfers to his family members via shell companies and 50% for the big guy (it wasn’t 10% that was a comment from a stranger, Hunter said he was giving 50% to father Joe! He paid his father’ mortgage with that foreign money!) permalink parent award report block reply load 1 more comments...\njedfag 33 points 3 days ago Fuck YEAH! permalink parent award report block reply posedgeclk 7 points 2 days ago I am 100% for it. Guliani has my respect for being so firm and never caving. He and Trump are in this together. Who needs a law license anyway? permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 2 more comments...\nposedgeclk 7 points 2 days ago I am 100% for it. Guliani has my respect for being so firm and never caving. He and Trump are in this together. Who needs a law license anyway? permalink parent award report block reply\nDeportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 2 more comments...\nPatriotSam 21 points 3 days ago He's gotten too senile unfortunately. Not quite Joe Biden level but he's way up there in age permalink parent award report block reply PiratePatriot 17 points 3 days ago this. I didn't notice Rudi so much when he was younger, seeing him targetted made me go back to his earlier years. The guy cleaned up New York, did great things. Seeing the relentless lawfare against him was disgusting. he could have retired gracefully into a peaceful life in a remote area, away from those who hunted him. But no, he stood his ground while they attacked. permalink parent award report block reply view 4 more comments... KarlHungus53 2 points 2 days ago Ever see the one interview he did with Bannon where he goes on a rant about playing in a pro-am golf event with Michelle Wie and talks about checking out her panties?  Steve was mortified. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago U/maverick202 is a shill who is a self-admitted “troll” who comes here to insult this community, and also believes Joe Biden won 81 million votes lmfao permalink parent award report block reply maverick202 0 points 2 days ago Right. Let him ride it out in peace. He has done his work. permalink parent award report block reply view 1 more comments...\nPiratePatriot 17 points 3 days ago this. I didn't notice Rudi so much when he was younger, seeing him targetted made me go back to his earlier years. The guy cleaned up New York, did great things. Seeing the relentless lawfare against him was disgusting. he could have retired gracefully into a peaceful life in a remote area, away from those who hunted him. But no, he stood his ground while they attacked. permalink parent award report block reply view 4 more comments...\nKarlHungus53 2 points 2 days ago Ever see the one interview he did with Bannon where he goes on a rant about playing in a pro-am golf event with Michelle Wie and talks about checking out her panties?  Steve was mortified. permalink parent award report block reply\nUCantStumpTheTrump 1 points 2 days ago U/maverick202 is a shill who is a self-admitted “troll” who comes here to insult this community, and also believes Joe Biden won 81 million votes lmfao permalink parent award report block reply\nmaverick202 0 points 2 days ago Right. Let him ride it out in peace. He has done his work. permalink parent award report block reply view 1 more comments...\nHanging_Chad 6 points 3 days ago this is the way permalink parent award report block reply Hawksendoom 2 points 3 days ago this is the way permalink parent award report block reply Deportthemall23 3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nHawksendoom 2 points 3 days ago this is the way permalink parent award report block reply\nDeportthemall23 3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBlackPilledMAGA 3 points 3 days ago Rudy would go guns blazing no fucks given he's old and he's angry and he's not trying to climb the political ladders like Pam Blondi is. He would not be diplomatic or gentle in hopes of currying favor, he would be out for the blood of the swamp. He is exactly what we need as AG. So he's getting old.. so what. He's more than capable of assigning cases and ordering investigations. Pam Blondi will never do anything except go on TV and talk, and talk and talk to no end. permalink parent award report block reply\nsnoopy3210 2 points 2 days ago Seriously he knows where the bodies are buried. Starting with Biden’ money transfers to his family members via shell companies and 50% for the big guy (it wasn’t 10% that was a comment from a stranger, Hunter said he was giving 50% to father Joe! He paid his father’ mortgage with that foreign money!) permalink parent award report block reply\nWtf_socialismreally 38 points 3 days ago Paid for by the criminals who pursued them, not by the U.S. government preferably. permalink parent award report block reply Mungo 19 points 3 days ago One of the few things I’d be ok with my tax dollars going to. permalink parent award report block reply Wtf_socialismreally 22 points 3 days ago Sure, sure. But I'd be even more okay if we punished the people. permalink parent award report block reply Mungo 7 points 3 days ago Agreed permalink parent award report block reply Mr_Rightside 16 points 3 days ago $17.76 million each should cover it. The DNC can pay for it. permalink parent award report block reply Hawksendoom 1 points 3 days ago no more us aid though... maybe soros? permalink parent award report block reply\nMungo 19 points 3 days ago One of the few things I’d be ok with my tax dollars going to. permalink parent award report block reply Wtf_socialismreally 22 points 3 days ago Sure, sure. But I'd be even more okay if we punished the people. permalink parent award report block reply Mungo 7 points 3 days ago Agreed permalink parent award report block reply\nWtf_socialismreally 22 points 3 days ago Sure, sure. But I'd be even more okay if we punished the people. permalink parent award report block reply Mungo 7 points 3 days ago Agreed permalink parent award report block reply\nMungo 7 points 3 days ago Agreed permalink parent award report block reply\nMr_Rightside 16 points 3 days ago $17.76 million each should cover it. The DNC can pay for it. permalink parent award report block reply Hawksendoom 1 points 3 days ago no more us aid though... maybe soros? permalink parent award report block reply\nHawksendoom 1 points 3 days ago no more us aid though... maybe soros? permalink parent award report block reply\nNomad899 9 points 3 days ago Paid by the commie clowns whom went after them permalink parent award report block reply\nprojectarcturus1 2 points 3 days ago I agree. The democrats who did it should pay for it and then go to prison for their crimes. permalink parent award report block reply\nHockeyMom4Trump 2 points 3 days ago For sure. permalink parent award report block reply\nDT170x 68 points 3 days ago Deport the Kebab Mayor and Reinstall Rudy Giuliani as the mayor of NYC. permalink award report block reply SPEDMan64 35 points 3 days ago I got to experience the Rudy Era during my time in NYC, but then Bloomberg came along and took a big shit on everything. permalink parent award report block reply IvIA6A 3 points 2 days ago Bloomberg was a swiss picnic compared to what they have now, Adams, and deblassio permalink parent award report block reply pollsarefake -1 points 2 days ago The infiltrator mayor is a satanic pedo Trump is chosen by God to eradicate the satanic pedo cabal Giuliani is a loyal lieutenant to Trump God wins in the end which means Trump wins permalink parent award report block reply Klaus73 1 points 2 days ago Unless your on the Epstien list. permalink parent award report block reply pollsarefake 1 points 2 days ago Epstein is a demoncrat hoax just like Russia Russia Russia permalink parent award report block reply Klaus73 1 points 2 days ago What exactly were the democrats claiming Trump was going to do for Russia? permalink parent award report block reply\nSPEDMan64 35 points 3 days ago I got to experience the Rudy Era during my time in NYC, but then Bloomberg came along and took a big shit on everything. permalink parent award report block reply IvIA6A 3 points 2 days ago Bloomberg was a swiss picnic compared to what they have now, Adams, and deblassio permalink parent award report block reply\nIvIA6A 3 points 2 days ago Bloomberg was a swiss picnic compared to what they have now, Adams, and deblassio permalink parent award report block reply\npollsarefake -1 points 2 days ago The infiltrator mayor is a satanic pedo Trump is chosen by God to eradicate the satanic pedo cabal Giuliani is a loyal lieutenant to Trump God wins in the end which means Trump wins permalink parent award report block reply Klaus73 1 points 2 days ago Unless your on the Epstien list. permalink parent award report block reply pollsarefake 1 points 2 days ago Epstein is a demoncrat hoax just like Russia Russia Russia permalink parent award report block reply Klaus73 1 points 2 days ago What exactly were the democrats claiming Trump was going to do for Russia? permalink parent award report block reply\nKlaus73 1 points 2 days ago Unless your on the Epstien list. permalink parent award report block reply pollsarefake 1 points 2 days ago Epstein is a demoncrat hoax just like Russia Russia Russia permalink parent award report block reply Klaus73 1 points 2 days ago What exactly were the democrats claiming Trump was going to do for Russia? permalink parent award report block reply\npollsarefake 1 points 2 days ago Epstein is a demoncrat hoax just like Russia Russia Russia permalink parent award report block reply Klaus73 1 points 2 days ago What exactly were the democrats claiming Trump was going to do for Russia? permalink parent award report block reply\nKlaus73 1 points 2 days ago What exactly were the democrats claiming Trump was going to do for Russia? permalink parent award report block reply\nHanging_Chad 41 points 3 days ago will he be dis-disbarred? permalink award report block reply Blackmore 27 points 3 days ago That’s another department so rigged for sure. permalink parent award report block reply Mathelm 13 points 3 days ago No, in a totally bullshit regulatory system. The Appellate Division of the new[sic] york[sic] Supreme Court controls who gets to be an attorney in new york. (Supreme Court is the Regular Trial Court, Court of Appeals is \"highest\" in new york) they will not reinstate him. Should be like every other regulatory body (rules by the legislature, administrated by the executive, adjudicated by the courts) permalink parent award report block reply Hawksendoom 6 points 3 days ago annnnd i hate how you are fucking right. :D permalink parent award report block reply Mathelm 4 points 3 days ago anytime, you aren't the first to say that. permalink parent award report block reply BarneyFrank 2 points 3 days ago Re-barred? Like concrete…the kind that jet fuel can’t melt. permalink parent award report block reply Hawksendoom 3 points 3 days ago 9/11 thermite has left the chat.... XD permalink parent award report block reply Klaus73 3 points 2 days ago Along with the gold permalink parent award report block reply\nBlackmore 27 points 3 days ago That’s another department so rigged for sure. permalink parent award report block reply\nMathelm 13 points 3 days ago No, in a totally bullshit regulatory system. The Appellate Division of the new[sic] york[sic] Supreme Court controls who gets to be an attorney in new york. (Supreme Court is the Regular Trial Court, Court of Appeals is \"highest\" in new york) they will not reinstate him. Should be like every other regulatory body (rules by the legislature, administrated by the executive, adjudicated by the courts) permalink parent award report block reply Hawksendoom 6 points 3 days ago annnnd i hate how you are fucking right. :D permalink parent award report block reply Mathelm 4 points 3 days ago anytime, you aren't the first to say that. permalink parent award report block reply\nHawksendoom 6 points 3 days ago annnnd i hate how you are fucking right. :D permalink parent award report block reply Mathelm 4 points 3 days ago anytime, you aren't the first to say that. permalink parent award report block reply\nMathelm 4 points 3 days ago anytime, you aren't the first to say that. permalink parent award report block reply\nBarneyFrank 2 points 3 days ago Re-barred? Like concrete…the kind that jet fuel can’t melt. permalink parent award report block reply Hawksendoom 3 points 3 days ago 9/11 thermite has left the chat.... XD permalink parent award report block reply Klaus73 3 points 2 days ago Along with the gold permalink parent award report block reply\nHawksendoom 3 points 3 days ago 9/11 thermite has left the chat.... XD permalink parent award report block reply Klaus73 3 points 2 days ago Along with the gold permalink parent award report block reply\nKlaus73 3 points 2 days ago Along with the gold permalink parent award report block reply\ncouranto 28 points 3 days ago Hopefully he didn’t pardon the one bitch who turned on him and worked a deal. permalink award report block reply MasterChief08 21 points 3 days ago Unfortunately he did. Trump is wayyy too nice permalink parent award report block reply Apersonofinterest 9 points 3 days ago Trump is leaving no man behind. He came back for the J6’ers, he came back for his friends and the people who supported and defended him. That’s the kind of leader I will go to war with. permalink parent award report block reply Trollasaurus 4 points 2 days ago She didn’t support him she turned on him and went on a media parade backstabbing him permalink parent award report block reply RedCalifornia 3 points 2 days ago Jenna Ellis? Yeah pretty sure she was compromised from the start. Who benefitted from the chaos of the 2020 election? permalink parent award report block reply RedCalifornia 1 points 2 days ago If there aren’t arrests or trials, even for the monster who murdered Ashli, he’s not “leaving no man behind” permalink parent award report block reply Apersonofinterest 1 points 2 days ago I’m talking about his supporters that were punished for supporting him. That’s what “leave no man behind” means. You’re changing the subject to shit on Trump some more. Everyone can see what you people are doing. permalink parent award report block reply TheRedPike 3 points 2 days ago The smooth brains that gave her the deal eventually figured out she was of zero use to them. permalink parent award report block reply\nMasterChief08 21 points 3 days ago Unfortunately he did. Trump is wayyy too nice permalink parent award report block reply Apersonofinterest 9 points 3 days ago Trump is leaving no man behind. He came back for the J6’ers, he came back for his friends and the people who supported and defended him. That’s the kind of leader I will go to war with. permalink parent award report block reply Trollasaurus 4 points 2 days ago She didn’t support him she turned on him and went on a media parade backstabbing him permalink parent award report block reply RedCalifornia 3 points 2 days ago Jenna Ellis? Yeah pretty sure she was compromised from the start. Who benefitted from the chaos of the 2020 election? permalink parent award report block reply RedCalifornia 1 points 2 days ago If there aren’t arrests or trials, even for the monster who murdered Ashli, he’s not “leaving no man behind” permalink parent award report block reply Apersonofinterest 1 points 2 days ago I’m talking about his supporters that were punished for supporting him. That’s what “leave no man behind” means. You’re changing the subject to shit on Trump some more. Everyone can see what you people are doing. permalink parent award report block reply\nApersonofinterest 9 points 3 days ago Trump is leaving no man behind. He came back for the J6’ers, he came back for his friends and the people who supported and defended him. That’s the kind of leader I will go to war with. permalink parent award report block reply Trollasaurus 4 points 2 days ago She didn’t support him she turned on him and went on a media parade backstabbing him permalink parent award report block reply RedCalifornia 3 points 2 days ago Jenna Ellis? Yeah pretty sure she was compromised from the start. Who benefitted from the chaos of the 2020 election? permalink parent award report block reply RedCalifornia 1 points 2 days ago If there aren’t arrests or trials, even for the monster who murdered Ashli, he’s not “leaving no man behind” permalink parent award report block reply Apersonofinterest 1 points 2 days ago I’m talking about his supporters that were punished for supporting him. That’s what “leave no man behind” means. You’re changing the subject to shit on Trump some more. Everyone can see what you people are doing. permalink parent award report block reply\nTrollasaurus 4 points 2 days ago She didn’t support him she turned on him and went on a media parade backstabbing him permalink parent award report block reply RedCalifornia 3 points 2 days ago Jenna Ellis? Yeah pretty sure she was compromised from the start. Who benefitted from the chaos of the 2020 election? permalink parent award report block reply\nRedCalifornia 3 points 2 days ago Jenna Ellis? Yeah pretty sure she was compromised from the start. Who benefitted from the chaos of the 2020 election? permalink parent award report block reply\nRedCalifornia 1 points 2 days ago If there aren’t arrests or trials, even for the monster who murdered Ashli, he’s not “leaving no man behind” permalink parent award report block reply Apersonofinterest 1 points 2 days ago I’m talking about his supporters that were punished for supporting him. That’s what “leave no man behind” means. You’re changing the subject to shit on Trump some more. Everyone can see what you people are doing. permalink parent award report block reply\nApersonofinterest 1 points 2 days ago I’m talking about his supporters that were punished for supporting him. That’s what “leave no man behind” means. You’re changing the subject to shit on Trump some more. Everyone can see what you people are doing. permalink parent award report block reply\nTheRedPike 3 points 2 days ago The smooth brains that gave her the deal eventually figured out she was of zero use to them. permalink parent award report block reply\ndarkmodeforgotpass 19 points 3 days ago What about all the shit they robbed and thieved from him like the thugs they are? permalink award report block reply\nprogressives4Trump 15 points 3 days ago Mike lindell? permalink award report block reply phibetared 7 points 3 days ago Don't know, can't find.  But Sydney Powell has been pardoned by Trump. permalink parent award report block reply progressives4Trump 1 points 2 days ago Thanks for looking, I didn't find it either.  But he did say it was not an exhaustive list. permalink parent award report block reply\nphibetared 7 points 3 days ago Don't know, can't find.  But Sydney Powell has been pardoned by Trump. permalink parent award report block reply progressives4Trump 1 points 2 days ago Thanks for looking, I didn't find it either.  But he did say it was not an exhaustive list. permalink parent award report block reply\nprogressives4Trump 1 points 2 days ago Thanks for looking, I didn't find it either.  But he did say it was not an exhaustive list. permalink parent award report block reply\n_Sully_ 13 points 3 days ago John Eastman was absolutely railroaded. The people who did this no shit need to go to Gitmo. permalink award report block reply\npedeypete 12 points 3 days ago I'm used to a machine holding a pen for pardons, what is this sorcery? permalink award report block reply TruthyBrat 2 points 3 days ago Underrated comment, and who the Hell downvoted this!? Clueless or needs deporting. permalink parent award report block reply Apersonofinterest 2 points 3 days ago Trump is violating NORMS!!! Reeeee permalink parent award report block reply Klaus73 1 points 2 days ago Ask the CEO of Binance. Apparently the machine is still working just fine... permalink parent award report block reply\nTruthyBrat 2 points 3 days ago Underrated comment, and who the Hell downvoted this!? Clueless or needs deporting. permalink parent award report block reply\nApersonofinterest 2 points 3 days ago Trump is violating NORMS!!! Reeeee permalink parent award report block reply\nKlaus73 1 points 2 days ago Ask the CEO of Binance. Apparently the machine is still working just fine... permalink parent award report block reply\nI-am-Orlando OP PRO 11 points 3 days ago Link https://x.com/EricLDaugh/status/1987746295097041404?s=20 permalink award report block reply\nKEK_1776_KEK 10 points 3 days ago Fuck you Democrats permalink award report block reply\ncovok48 10 points 3 days ago Close the gate after the horses left. permalink award report block reply\nnewuser8 9 points 3 days ago He's broke, right? permalink award report block reply TheEdgeOfTheEarth 5 points 3 days ago https://scored.co/c/TheDonald/p/19BtBk7PcK/ permalink parent award report block reply\nTheEdgeOfTheEarth 5 points 3 days ago https://scored.co/c/TheDonald/p/19BtBk7PcK/ permalink parent award report block reply\njosiborg 7 points 3 days ago Why did it take so long? permalink award report block reply\nWarGreymon77 6 points 3 days ago It's horrible what they did to Rudy. permalink award report block reply\nALEXNEGO8 6 points 3 days ago Fantastic, and his legal fees are included in the pardon.\nThey really look to drive Giuliani and all Trump‘s associates into bankruptcy. permalink award report block reply\nLLegendary 6 points 3 days ago Pardon them for everything for their entire lives..... permalink award report block reply\nCowboy888 4 points 3 days ago Time to shove their Russia, Russia, up their lazy sorry asses. permalink award report block reply\nN14205ST205 3 points 3 days ago Yesssssss! Another win. permalink award report block reply\nLive_free_or_die_55 3 points 2 days ago And should hang the traitors who did this! permalink award report block reply\nDualsporter 3 points 2 days ago They shouldn't need pardoned. They did nothing wrong. 2020 needs to be exposed for the treasonous stolen election that it was. These people need to be fully vindicated as the heroes they are. permalink award report block reply\nPiglips 3 points 2 days ago Tina Peters? permalink award report block reply FlyCatcher94 2 points 2 days ago Unfortunately she was convicted of state crimes which he has no jurisdiction over. permalink parent award report block reply Piglips 1 points 2 days ago Yeah, i know, but im still ragging on it. All he has to do is give the word. permalink parent award report block reply FlyCatcher94 2 points 1 day ago Totally agree, it’s fucking bullshit permalink parent award report block reply\nFlyCatcher94 2 points 2 days ago Unfortunately she was convicted of state crimes which he has no jurisdiction over. permalink parent award report block reply Piglips 1 points 2 days ago Yeah, i know, but im still ragging on it. All he has to do is give the word. permalink parent award report block reply FlyCatcher94 2 points 1 day ago Totally agree, it’s fucking bullshit permalink parent award report block reply\nPiglips 1 points 2 days ago Yeah, i know, but im still ragging on it. All he has to do is give the word. permalink parent award report block reply FlyCatcher94 2 points 1 day ago Totally agree, it’s fucking bullshit permalink parent award report block reply\nFlyCatcher94 2 points 1 day ago Totally agree, it’s fucking bullshit permalink parent award report block reply\nSmurfection 3 points 2 days ago It's about time.  None of these cases should ever even have been brought. permalink award report block reply\nDCYR66 3 points 2 days ago Long overdue! God bless Rudy! permalink award report block reply\nSaltyCamaro 3 points 2 days ago Now arrest Ruby Freeman for election interference permalink award report block reply\nMichalusmichalus 3 points 2 days ago I want Rudy to get his watches back. permalink award report block reply\nraptormissle 3 points 3 days ago I can't wait for the criminals who abused their position and broke laws to target conservatives to get indicted. permalink award report block reply Apersonofinterest 1 points 3 days ago That would be the only thing I want for Christmas and I would be good for the rest of my life permalink parent award report block reply\nApersonofinterest 1 points 3 days ago That would be the only thing I want for Christmas and I would be good for the rest of my life permalink parent award report block reply\nRydanovich 2 points 2 days ago This is what I voted for. permalink award report block reply\nrangooooo 2 points 3 days ago Nominate him to Supreme Court permalink award report block reply\nItalianshamrock 2 points 2 days ago Should’ve happened sooner in my opinion. permalink award report block reply\nKarlHungus53 1 points 2 days ago What took so long? permalink award report block reply\nEXT_Finn 1 points 3 days ago Not autopen this time. permalink award report block reply\nDr_Phil 1 points 2 days ago Epshteyn permalink award report block reply\nTheSwampThang 1 points 3 days ago I would pardon Jenna's booty permalink award report block reply Klaus73 1 points 2 days ago Shes a servant of Christ...do not spare the rod...spoil her. permalink parent award report block reply\nKlaus73 1 points 2 days ago Shes a servant of Christ...do not spare the rod...spoil her. permalink parent award report block reply\nLogicCircuits 1 points 3 days ago This is about to get spicy permalink award report block reply\nT_Hed 1 points 2 days ago WOW, He even pardoned Jenna Ellis who turned out to be such a shitbird to him.\nI would have left her off the list. permalink award report block reply\ny_do_i_need_to_hide 1 points 2 days ago I do not know if this is good, yet. permalink award report block reply\nCanadianMeathead 1 points 3 days ago Are those state crimes? Can he pardon for those? permalink award report block reply MasterChief08 11 points 3 days ago It means the federal government can never again try to go after them. They were trying to elevate everything to the feds. The Georgia cases are dead. The state legislature and higher courts pretty much put an end to it after Fanni got caught sleeping with the head attorney. You're right that he can't pardon state crimes but Georgia is over. permalink parent award report block reply\nMasterChief08 11 points 3 days ago It means the federal government can never again try to go after them. They were trying to elevate everything to the feds. The Georgia cases are dead. The state legislature and higher courts pretty much put an end to it after Fanni got caught sleeping with the head attorney. You're right that he can't pardon state crimes but Georgia is over. permalink parent award report block reply\nAisle-is-closed 1 points 2 days ago Tiny Peters? Or are those charges all state level? permalink award report block reply\nDenturesNancy 1 points 2 days ago didn't Boris Ephstein jump ship and joined the Ron DeSantis failed wagon? permalink award report block reply\nCrappydatum 1 points 2 days ago But not Tina Peters, sadly permalink award report block reply\nKlaus73 1 points 2 days ago How did this take a YEAR? permalink award report block reply\ndataonly 1 points 2 days ago Wait... A president can directly sign a pardon?  Thought the vast majority were products of the \"autopen\"? Who knew? permalink award report block reply Klaus73 1 points 2 days ago Apparently without even knowing whom he is pardoning.. permalink parent award report block reply\nKlaus73 1 points 2 days ago Apparently without even knowing whom he is pardoning.. permalink parent award report block reply\nOvertaxed 1 points 2 days ago What took so long? permalink award report block reply Klaus73 2 points 2 days ago Aye seems weird it took over a year given the J6 pardons were like 2 months. permalink parent award report block reply\nKlaus73 2 points 2 days ago Aye seems weird it took over a year given the J6 pardons were like 2 months. permalink parent award report block reply\nSaltyTitties4 1 points 2 days ago Mark Meadows is a lying spy for China. permalink award report block reply\nmaverick202 0 points 2 days ago Based!! No one deserved to be pardoned more than Giuliani! permalink award report block reply UCantStumpTheTrump 1 points 2 days ago U/maverick202 is a shill who is a self-admitted “troll” who comes here to insult this community, and also believes Joe Biden won 81 million votes lmfao. He occasionally posts normal takes to blend in permalink parent award report block reply\nUCantStumpTheTrump 1 points 2 days ago U/maverick202 is a shill who is a self-admitted “troll” who comes here to insult this community, and also believes Joe Biden won 81 million votes lmfao. He occasionally posts normal takes to blend in permalink parent award report block reply\nPKC_MAN -5 points 3 days ago Why did he wait 1 year to do that? permalink award report block reply Apersonofinterest 9 points 3 days ago He’s busy. He’s got a lot of shit going on ya know? Complicated business. Too many people don’t seem to appreciate the miracle we have right now. It’s never good enough. If he does a thing, it wasn’t fast enough or what about this other thing he didn’t do? He’s a sell out!!! Reeee… permalink parent award report block reply Klaus73 1 points 2 days ago Well no - its a question; stop taking everything as an attack. Like was there some sort of pushback? Some sort of reason?\nConsider this - dude chose to go play golf multiple times rather then stop his most ardent supporters from rotting in prison; if the reason is \"he was just too darn busy\". I suspect there were other reasons; given how fast the j6 pardons came its actually a question worth asking especially when most of the legalese shit should have been able to be handled by Pam \"Heels up on her desk\" Bondi. permalink parent award report block reply NYforTrump 2 points 3 days ago Yeah he should have just done it back in January when he did the J6 cases. permalink parent award report block reply\nApersonofinterest 9 points 3 days ago He’s busy. He’s got a lot of shit going on ya know? Complicated business. Too many people don’t seem to appreciate the miracle we have right now. It’s never good enough. If he does a thing, it wasn’t fast enough or what about this other thing he didn’t do? He’s a sell out!!! Reeee… permalink parent award report block reply Klaus73 1 points 2 days ago Well no - its a question; stop taking everything as an attack. Like was there some sort of pushback? Some sort of reason?\nConsider this - dude chose to go play golf multiple times rather then stop his most ardent supporters from rotting in prison; if the reason is \"he was just too darn busy\". I suspect there were other reasons; given how fast the j6 pardons came its actually a question worth asking especially when most of the legalese shit should have been able to be handled by Pam \"Heels up on her desk\" Bondi. permalink parent award report block reply\nKlaus73 1 points 2 days ago Well no - its a question; stop taking everything as an attack. Like was there some sort of pushback? Some sort of reason?\nConsider this - dude chose to go play golf multiple times rather then stop his most ardent supporters from rotting in prison; if the reason is \"he was just too darn busy\". I suspect there were other reasons; given how fast the j6 pardons came its actually a question worth asking especially when most of the legalese shit should have been able to be handled by Pam \"Heels up on her desk\" Bondi. permalink parent award report block reply\nNYforTrump 2 points 3 days ago Yeah he should have just done it back in January when he did the J6 cases. permalink parent award report block reply\nEyesSewnShut 0 points 3 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T22:58:48.599594Z"
}