{
  "id": "8173033",
  "title": "1188This and announcing retirement. Long week for Nancy.posted5 days agobyWaylan39 commentsawardshar",
  "url": "https://patriots.win/p/1ARK54RfYB/this-and-announcing-retirement-l/c",
  "content": "1188 This and announcing retirement. Long week for Nancy. posted 5 days ago by Waylan 39 comments award share download report block\n39 comments Sort by Top Top New Worst Old Save DeusVult1096 43 points 5 days ago She will never truly retire. This hag will keep working behind the scenes like Obama. permalink award report block reply LabTech 13 points 5 days ago Right, if anything this signals an uptick in activity for her, because she needs to spend the next year doing everything she can to destroy the country in the leadup to the Midterms, and can't be bothered with that pesky distraction of running the country. If the Dems lose the MIdterms, they're basically finished as a national party on the Federal level, and they'd be lucky to be left with the rotting urban core enclaves they've held for decades.  The Dems who are coming up through the system to replace the Boomers are true believers who don't understand that the woke crap was just a scam to get the public compliant, not an actual philosophy to live their lives by.  Once the last of her generation are gone, and it frankly can't come soon enough, they won't be able to even wipe their own rears. permalink parent award report block reply ckover9000 4 points 5 days ago Exactly. This only means she has some shit planned that she can't be under the constraints of being a \"public servant.\" Not that that ever mattered to her, if that tells you anything about what she'll be doing. permalink parent award report block reply monkadelic 4 points 5 days ago I think its better news than that.  Shes 85, its going to be like Biden, in 5 months we will find out she's got a terminal illness.  They never EVER release power willingly. permalink parent award report block reply Sparks1017 1 points 5 days ago True, but she's she'll be 86 in March, how long can she last? And she's not as sharp as she used to be, just a slurring drunk shell permalink parent award report block reply COLDWARPATRIOT55 1 points 5 days ago Even after she dies. permalink parent award report block reply Polarix 19 points 5 days ago Dirtiest Bitch to EVER hold office. permalink award report block reply Aggrieved03 7 points 5 days ago Ever heard of Killary? permalink parent award report block reply joggin_noggin 5 points 5 days ago Clinton wasn't in bed with Jim Jones. permalink parent award report block reply Rock9Head 4 points 5 days ago Giving bitches a bad name. permalink parent award report block reply Taqiyya_Mockingbird 14 points 5 days ago They’re normalizing throwing food which can camouflage poisonous toxins or longer incubation bioweapons permalink award report block reply BruddahIz 2 points 5 days ago Subway - throw fresh.   McD - Throw Poison. permalink parent award report block reply deleted 2 points 5 days ago llirrem 1 points 5 days ago They didn't legalize shit, this was a case of jury nullification, it does not set precedent in any way shape or form. That's like saying they legalized murdering your wife when OJ got off permalink parent award report block reply gezadreamsheets2 9 points 5 days ago She must be dealing with serious health issues, she would have never announce this! permalink award report block reply Awan-CIA-Car-Lot 7 points 5 days ago Once an old person breaks a hip, they never really get over it. She tried to put on a good show by getting back into Congress on her walker almost immediately, but she wasn't fooling anyone. permalink parent award report block reply MR__K 4 points 5 days ago Liver damage permalink parent award report block reply BirthHole 3 points 5 days ago Nancy fell and broke her hip in Dec, 2024 and had immediate hip replacement surgery.   There is no way at her age she could make a full recovery.   But with her state of absolute power-madness, I find it hard to believe she's voluntarily giving up her seat & seniority. permalink parent award report block reply monkadelic 3 points 5 days ago She's not. Nobody EVER does.  We will know the truth soon, or just the news shes gone. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 5 days ago They say that once an elderly woman breaks a hip, she'll be dead from something or other within a year. permalink parent award report block reply Scot 8 points 5 days ago How about throwing sandwiches at politicians then? permalink award report block reply Sparks1017 8 points 5 days ago Fucking drunk corrupt hag. I imagine the DC liquor stores will have a hard time now permalink award report block reply Aggrieved03 7 points 5 days ago The one in the capitol we pay for? permalink parent award report block reply MR__K 6 points 5 days ago She was the capital liquor store permalink parent award report block reply Sparks1017 1 points 5 days ago Exactly permalink parent award report block reply DenturesNancy 4 points 5 days ago we'll see if this precedent holds up when the demons are in charge.  I bet $1million I don't have that one would serve 20years to life for the same act permalink award report block reply llirrem 1 points 5 days ago There is no precedent, this is just a case of jury nullification permalink parent award report block reply NonbinaryPotatohead 3 points 5 days ago She made so much money insider trading she exhausted her system of being the best trader to have ever existed on planet Earth and is ready to eat the ice cream in her industrial freezers. permalink award report block reply greatpumpkin 3 points 5 days ago I see the next shortage happening before our eyes.  ~ Protestors ~ Paid (D)s throwing sandwich fixings at officers. The Great Food Fight. Not only will covering riot masks in mustand and relish make it harder to see through, but the dry cleaning will bankrupt smaller depts. Diabolical. permalink award report block reply pedeypete 3 points 5 days ago It's cool, federal agents should then throw a sandwich back. It consists of tasty layers of lead, brass and gunpowder. permalink award report block reply TheWhitestOfFangs 1 points 5 days ago Or judges. Should be equally legal to throw sandwiches at judges for ummm... protesting for illegal's legal rights or something permalink parent award report block reply YearninNation 2 points 5 days ago San Francisco Democrats in the 1970s had significant political ties to Jim Jones, the leader of the Peoples Temple, which later ended in the mass suicide at Jonestown in 1978.\nJones cultivated strong relationships with prominent Democratic figures, leveraging his ability to deliver large numbers of followers for rallies, campaign work, and voter turnout, which made him a valuable political ally. Mayor George Moscone, whose 1975 mayoral victory was allegedly aided by voter fraud involving Peoples Temple members bused in to vote multiple times, appointed Jones to the San Francisco Housing Authority Commission and later made him its chairman, effectively making Jones the city’s largest landlord.\nMoscone likely owed his election to Jones and the Temple’s political support. Other key Democrats also embraced Jones. Assemblyman Willie Brown, who later became Speaker of the California Assembly and mayor of San Francisco, compared Jones to Martin Luther King Jr., Mahatma Gandhi, and Chairman Mao, calling him a “close personal friend and a highly trusted brother in the struggle for liberation”.\nHarvey Milk, the city supervisor and gay rights activist, wrote Jones a letter expressing deep admiration, stating, “The first time I heard you, you made a statement: ‘Take one of us, and you must take all of us.’ Please add my name”.\nMilk referred to Jones as having “greatness” and actively sought his political endorsement. Dianne Feinstein, then a member of the San Francisco Board of Supervisors, joined her colleagues in honoring Jones “in recognition of his guidance and inspiration” in advancing humanitarian programs.\nNancy Pelosi, who was then the chair of the California Democratic Party for Northern California, was also part of the political circle that supported Jones. At the national level, Jones met privately with Rosalynn Carter during the 1976 presidential campaign and introduced her at a campaign event.\nVice-presidential candidate Walter Mondale also held a private meeting with Jones upon landing in San Francisco. permalink award report block reply Seruna_Kanus 1 points 5 days ago I would imagine subway would love short stocks. permalink award report block reply Speedgraphic69 1 points 5 days ago Water skiing on the Lake of Fire with John McCain and Dickhead Cheney permalink award report block reply Aggrieved03 1 points 5 days ago Pajeet owned. permalink award report block reply Thunnus73 1 points 5 days ago Bela Pelosi's House On The Hill https://www.youtube.com/watch?v=i043gWMKAVg permalink award report block reply USNVET71 -1 points 5 days ago What a disgusting evil cunt permalink award report block reply SteveBannonsNckbeard -2 points 5 days ago Pretty low effort/retarded meme. Agree w the spirit of it of course but its some leftist level humor permalink award report block reply Govtizbad 9 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nDeusVult1096 43 points 5 days ago She will never truly retire. This hag will keep working behind the scenes like Obama. permalink award report block reply LabTech 13 points 5 days ago Right, if anything this signals an uptick in activity for her, because she needs to spend the next year doing everything she can to destroy the country in the leadup to the Midterms, and can't be bothered with that pesky distraction of running the country. If the Dems lose the MIdterms, they're basically finished as a national party on the Federal level, and they'd be lucky to be left with the rotting urban core enclaves they've held for decades.  The Dems who are coming up through the system to replace the Boomers are true believers who don't understand that the woke crap was just a scam to get the public compliant, not an actual philosophy to live their lives by.  Once the last of her generation are gone, and it frankly can't come soon enough, they won't be able to even wipe their own rears. permalink parent award report block reply ckover9000 4 points 5 days ago Exactly. This only means she has some shit planned that she can't be under the constraints of being a \"public servant.\" Not that that ever mattered to her, if that tells you anything about what she'll be doing. permalink parent award report block reply monkadelic 4 points 5 days ago I think its better news than that.  Shes 85, its going to be like Biden, in 5 months we will find out she's got a terminal illness.  They never EVER release power willingly. permalink parent award report block reply Sparks1017 1 points 5 days ago True, but she's she'll be 86 in March, how long can she last? And she's not as sharp as she used to be, just a slurring drunk shell permalink parent award report block reply COLDWARPATRIOT55 1 points 5 days ago Even after she dies. permalink parent award report block reply\nLabTech 13 points 5 days ago Right, if anything this signals an uptick in activity for her, because she needs to spend the next year doing everything she can to destroy the country in the leadup to the Midterms, and can't be bothered with that pesky distraction of running the country. If the Dems lose the MIdterms, they're basically finished as a national party on the Federal level, and they'd be lucky to be left with the rotting urban core enclaves they've held for decades.  The Dems who are coming up through the system to replace the Boomers are true believers who don't understand that the woke crap was just a scam to get the public compliant, not an actual philosophy to live their lives by.  Once the last of her generation are gone, and it frankly can't come soon enough, they won't be able to even wipe their own rears. permalink parent award report block reply\nckover9000 4 points 5 days ago Exactly. This only means she has some shit planned that she can't be under the constraints of being a \"public servant.\" Not that that ever mattered to her, if that tells you anything about what she'll be doing. permalink parent award report block reply monkadelic 4 points 5 days ago I think its better news than that.  Shes 85, its going to be like Biden, in 5 months we will find out she's got a terminal illness.  They never EVER release power willingly. permalink parent award report block reply\nmonkadelic 4 points 5 days ago I think its better news than that.  Shes 85, its going to be like Biden, in 5 months we will find out she's got a terminal illness.  They never EVER release power willingly. permalink parent award report block reply\nSparks1017 1 points 5 days ago True, but she's she'll be 86 in March, how long can she last? And she's not as sharp as she used to be, just a slurring drunk shell permalink parent award report block reply\nCOLDWARPATRIOT55 1 points 5 days ago Even after she dies. permalink parent award report block reply\nPolarix 19 points 5 days ago Dirtiest Bitch to EVER hold office. permalink award report block reply Aggrieved03 7 points 5 days ago Ever heard of Killary? permalink parent award report block reply joggin_noggin 5 points 5 days ago Clinton wasn't in bed with Jim Jones. permalink parent award report block reply Rock9Head 4 points 5 days ago Giving bitches a bad name. permalink parent award report block reply\nAggrieved03 7 points 5 days ago Ever heard of Killary? permalink parent award report block reply joggin_noggin 5 points 5 days ago Clinton wasn't in bed with Jim Jones. permalink parent award report block reply\njoggin_noggin 5 points 5 days ago Clinton wasn't in bed with Jim Jones. permalink parent award report block reply\nRock9Head 4 points 5 days ago Giving bitches a bad name. permalink parent award report block reply\nTaqiyya_Mockingbird 14 points 5 days ago They’re normalizing throwing food which can camouflage poisonous toxins or longer incubation bioweapons permalink award report block reply BruddahIz 2 points 5 days ago Subway - throw fresh.   McD - Throw Poison. permalink parent award report block reply deleted 2 points 5 days ago llirrem 1 points 5 days ago They didn't legalize shit, this was a case of jury nullification, it does not set precedent in any way shape or form. That's like saying they legalized murdering your wife when OJ got off permalink parent award report block reply\nBruddahIz 2 points 5 days ago Subway - throw fresh.   McD - Throw Poison. permalink parent award report block reply\ndeleted 2 points 5 days ago llirrem 1 points 5 days ago They didn't legalize shit, this was a case of jury nullification, it does not set precedent in any way shape or form. That's like saying they legalized murdering your wife when OJ got off permalink parent award report block reply\nllirrem 1 points 5 days ago They didn't legalize shit, this was a case of jury nullification, it does not set precedent in any way shape or form. That's like saying they legalized murdering your wife when OJ got off permalink parent award report block reply\ngezadreamsheets2 9 points 5 days ago She must be dealing with serious health issues, she would have never announce this! permalink award report block reply Awan-CIA-Car-Lot 7 points 5 days ago Once an old person breaks a hip, they never really get over it. She tried to put on a good show by getting back into Congress on her walker almost immediately, but she wasn't fooling anyone. permalink parent award report block reply MR__K 4 points 5 days ago Liver damage permalink parent award report block reply BirthHole 3 points 5 days ago Nancy fell and broke her hip in Dec, 2024 and had immediate hip replacement surgery.   There is no way at her age she could make a full recovery.   But with her state of absolute power-madness, I find it hard to believe she's voluntarily giving up her seat & seniority. permalink parent award report block reply monkadelic 3 points 5 days ago She's not. Nobody EVER does.  We will know the truth soon, or just the news shes gone. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 5 days ago They say that once an elderly woman breaks a hip, she'll be dead from something or other within a year. permalink parent award report block reply\nAwan-CIA-Car-Lot 7 points 5 days ago Once an old person breaks a hip, they never really get over it. She tried to put on a good show by getting back into Congress on her walker almost immediately, but she wasn't fooling anyone. permalink parent award report block reply\nMR__K 4 points 5 days ago Liver damage permalink parent award report block reply\nBirthHole 3 points 5 days ago Nancy fell and broke her hip in Dec, 2024 and had immediate hip replacement surgery.   There is no way at her age she could make a full recovery.   But with her state of absolute power-madness, I find it hard to believe she's voluntarily giving up her seat & seniority. permalink parent award report block reply monkadelic 3 points 5 days ago She's not. Nobody EVER does.  We will know the truth soon, or just the news shes gone. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 5 days ago They say that once an elderly woman breaks a hip, she'll be dead from something or other within a year. permalink parent award report block reply\nmonkadelic 3 points 5 days ago She's not. Nobody EVER does.  We will know the truth soon, or just the news shes gone. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 5 days ago They say that once an elderly woman breaks a hip, she'll be dead from something or other within a year. permalink parent award report block reply\nAwan-CIA-Car-Lot 3 points 5 days ago They say that once an elderly woman breaks a hip, she'll be dead from something or other within a year. permalink parent award report block reply\nScot 8 points 5 days ago How about throwing sandwiches at politicians then? permalink award report block reply\nSparks1017 8 points 5 days ago Fucking drunk corrupt hag. I imagine the DC liquor stores will have a hard time now permalink award report block reply Aggrieved03 7 points 5 days ago The one in the capitol we pay for? permalink parent award report block reply MR__K 6 points 5 days ago She was the capital liquor store permalink parent award report block reply Sparks1017 1 points 5 days ago Exactly permalink parent award report block reply\nAggrieved03 7 points 5 days ago The one in the capitol we pay for? permalink parent award report block reply MR__K 6 points 5 days ago She was the capital liquor store permalink parent award report block reply Sparks1017 1 points 5 days ago Exactly permalink parent award report block reply\nMR__K 6 points 5 days ago She was the capital liquor store permalink parent award report block reply\nSparks1017 1 points 5 days ago Exactly permalink parent award report block reply\nDenturesNancy 4 points 5 days ago we'll see if this precedent holds up when the demons are in charge.  I bet $1million I don't have that one would serve 20years to life for the same act permalink award report block reply llirrem 1 points 5 days ago There is no precedent, this is just a case of jury nullification permalink parent award report block reply\nllirrem 1 points 5 days ago There is no precedent, this is just a case of jury nullification permalink parent award report block reply\nNonbinaryPotatohead 3 points 5 days ago She made so much money insider trading she exhausted her system of being the best trader to have ever existed on planet Earth and is ready to eat the ice cream in her industrial freezers. permalink award report block reply\ngreatpumpkin 3 points 5 days ago I see the next shortage happening before our eyes.  ~ Protestors ~ Paid (D)s throwing sandwich fixings at officers. The Great Food Fight. Not only will covering riot masks in mustand and relish make it harder to see through, but the dry cleaning will bankrupt smaller depts. Diabolical. permalink award report block reply\npedeypete 3 points 5 days ago It's cool, federal agents should then throw a sandwich back. It consists of tasty layers of lead, brass and gunpowder. permalink award report block reply TheWhitestOfFangs 1 points 5 days ago Or judges. Should be equally legal to throw sandwiches at judges for ummm... protesting for illegal's legal rights or something permalink parent award report block reply\nTheWhitestOfFangs 1 points 5 days ago Or judges. Should be equally legal to throw sandwiches at judges for ummm... protesting for illegal's legal rights or something permalink parent award report block reply\nYearninNation 2 points 5 days ago San Francisco Democrats in the 1970s had significant political ties to Jim Jones, the leader of the Peoples Temple, which later ended in the mass suicide at Jonestown in 1978.\nJones cultivated strong relationships with prominent Democratic figures, leveraging his ability to deliver large numbers of followers for rallies, campaign work, and voter turnout, which made him a valuable political ally. Mayor George Moscone, whose 1975 mayoral victory was allegedly aided by voter fraud involving Peoples Temple members bused in to vote multiple times, appointed Jones to the San Francisco Housing Authority Commission and later made him its chairman, effectively making Jones the city’s largest landlord.\nMoscone likely owed his election to Jones and the Temple’s political support. Other key Democrats also embraced Jones. Assemblyman Willie Brown, who later became Speaker of the California Assembly and mayor of San Francisco, compared Jones to Martin Luther King Jr., Mahatma Gandhi, and Chairman Mao, calling him a “close personal friend and a highly trusted brother in the struggle for liberation”.\nHarvey Milk, the city supervisor and gay rights activist, wrote Jones a letter expressing deep admiration, stating, “The first time I heard you, you made a statement: ‘Take one of us, and you must take all of us.’ Please add my name”.\nMilk referred to Jones as having “greatness” and actively sought his political endorsement. Dianne Feinstein, then a member of the San Francisco Board of Supervisors, joined her colleagues in honoring Jones “in recognition of his guidance and inspiration” in advancing humanitarian programs.\nNancy Pelosi, who was then the chair of the California Democratic Party for Northern California, was also part of the political circle that supported Jones. At the national level, Jones met privately with Rosalynn Carter during the 1976 presidential campaign and introduced her at a campaign event.\nVice-presidential candidate Walter Mondale also held a private meeting with Jones upon landing in San Francisco. permalink award report block reply\nSeruna_Kanus 1 points 5 days ago I would imagine subway would love short stocks. permalink award report block reply\nSpeedgraphic69 1 points 5 days ago Water skiing on the Lake of Fire with John McCain and Dickhead Cheney permalink award report block reply\nAggrieved03 1 points 5 days ago Pajeet owned. permalink award report block reply\nThunnus73 1 points 5 days ago Bela Pelosi's House On The Hill https://www.youtube.com/watch?v=i043gWMKAVg permalink award report block reply\nUSNVET71 -1 points 5 days ago What a disgusting evil cunt permalink award report block reply\nSteveBannonsNckbeard -2 points 5 days ago Pretty low effort/retarded meme. Agree w the spirit of it of course but its some leftist level humor permalink award report block reply\nGovtizbad 9 points 5 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T20:16:50.864164Z"
}