{
  "id": "1ARK514PCK",
  "url": "https://patriots.win/p/1ARK514PCK/breaking-hungary-just-blocked-eu/c",
  "content": "390 BREAKING: Hungary just BLOCKED EU security guarantees for Ukraine and new military aid! posted 6 days ago by Trump2024Train 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save What Made Him Walk Away? The Shocking Truth Is Out Read More Ads by Ad.Style Be_The_Change 8 points 6 days ago Orban = THE MAN permalink award report block reply rebuildingMyself 4 points 6 days ago They need to leave the EU as with any other actual remaining country that hasn't sold its soul to the Woke Gods permalink award report block reply KarameloKamala 3 points 6 days ago Poland and Hungary should just start a slavic union already.  Exclude Ukraine's and any of the ones who didnt already have enough communism and tell the west to suck rocks permalink parent award report block reply snoopy3210 1 points 6 days ago Ukraine should wake the F up to what Blackrock and the Swiss IMF is doing to them permalink parent award report block reply KarameloKamala 1 points 6 days ago They are, they just have a dictator ruling them.  Question is, why does the west support that dictator. permalink parent award report block reply 2025WhatIsTrue 2 points 6 days ago LOL! permalink award report block reply\nBe_The_Change 8 points 6 days ago Orban = THE MAN permalink award report block reply\nrebuildingMyself 4 points 6 days ago They need to leave the EU as with any other actual remaining country that hasn't sold its soul to the Woke Gods permalink award report block reply KarameloKamala 3 points 6 days ago Poland and Hungary should just start a slavic union already.  Exclude Ukraine's and any of the ones who didnt already have enough communism and tell the west to suck rocks permalink parent award report block reply snoopy3210 1 points 6 days ago Ukraine should wake the F up to what Blackrock and the Swiss IMF is doing to them permalink parent award report block reply KarameloKamala 1 points 6 days ago They are, they just have a dictator ruling them.  Question is, why does the west support that dictator. permalink parent award report block reply\nKarameloKamala 3 points 6 days ago Poland and Hungary should just start a slavic union already.  Exclude Ukraine's and any of the ones who didnt already have enough communism and tell the west to suck rocks permalink parent award report block reply snoopy3210 1 points 6 days ago Ukraine should wake the F up to what Blackrock and the Swiss IMF is doing to them permalink parent award report block reply KarameloKamala 1 points 6 days ago They are, they just have a dictator ruling them.  Question is, why does the west support that dictator. permalink parent award report block reply\nsnoopy3210 1 points 6 days ago Ukraine should wake the F up to what Blackrock and the Swiss IMF is doing to them permalink parent award report block reply KarameloKamala 1 points 6 days ago They are, they just have a dictator ruling them.  Question is, why does the west support that dictator. permalink parent award report block reply\nKarameloKamala 1 points 6 days ago They are, they just have a dictator ruling them.  Question is, why does the west support that dictator. permalink parent award report block reply\n2025WhatIsTrue 2 points 6 days ago LOL! permalink award report block reply",
  "fetched_at": "2025-11-12T20:51:56.554744Z"
}