{
  "id": "1ARK591j4S",
  "url": "https://patriots.win/p/1ARK591j4S/the-irony/c",
  "content": "496 The irony... posted 3 days ago by KuzoKevin 10 comments award share report block Bill Ackman @BillAckman • 4d\n10 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Dwoj 16 points 3 days ago Hilarious!! I’m so sorry that these people are so stupid. permalink award report block reply Bullwinkle 11 points 3 days ago Courtesy of the schools and Fake News permalink parent award report block reply DeportThemAllForever 0 points 3 days ago Our party gives people no reason to vote for it, we are the stupid once just as much. permalink parent award report block reply Bullet3250 9 points 3 days ago KEK permalink award report block reply Somebody157 8 points 3 days ago Sorry, we are closed. NO SOUP FOR YOU! permalink award report block reply Paralax 6 points 3 days ago The irony of being Jewish, supporting that side of the political spectrum, and then being surprised by the results… permalink award report block reply PearlyGaits57 3 points 3 days ago You can't fix stupid. permalink award report block reply lispboy 3 points 3 days ago Wasn't this guy one of the first to grovel at Madame? He is not MAGA, he is a weasel. permalink award report block reply barwhack 2 points 3 days ago You don't understand. These \"voters\" were going to steal the groceries in EVERY case . permalink award report block reply Gnometard 1 points 3 days ago It's like demanding more laws to stop the left... permalink award report block reply\nDwoj 16 points 3 days ago Hilarious!! I’m so sorry that these people are so stupid. permalink award report block reply Bullwinkle 11 points 3 days ago Courtesy of the schools and Fake News permalink parent award report block reply DeportThemAllForever 0 points 3 days ago Our party gives people no reason to vote for it, we are the stupid once just as much. permalink parent award report block reply\nBullwinkle 11 points 3 days ago Courtesy of the schools and Fake News permalink parent award report block reply\nDeportThemAllForever 0 points 3 days ago Our party gives people no reason to vote for it, we are the stupid once just as much. permalink parent award report block reply\nBullet3250 9 points 3 days ago KEK permalink award report block reply\nSomebody157 8 points 3 days ago Sorry, we are closed. NO SOUP FOR YOU! permalink award report block reply\nParalax 6 points 3 days ago The irony of being Jewish, supporting that side of the political spectrum, and then being surprised by the results… permalink award report block reply\nPearlyGaits57 3 points 3 days ago You can't fix stupid. permalink award report block reply\nlispboy 3 points 3 days ago Wasn't this guy one of the first to grovel at Madame? He is not MAGA, he is a weasel. permalink award report block reply\nbarwhack 2 points 3 days ago You don't understand. These \"voters\" were going to steal the groceries in EVERY case . permalink award report block reply\nGnometard 1 points 3 days ago It's like demanding more laws to stop the left... permalink award report block reply",
  "fetched_at": "2025-11-12T22:58:15.287376Z"
}