{
  "id": "8181548",
  "url": "https://patriots.win/p/1ARK9irV16/x/c",
  "content": "1210 🇺🇲 posted 2 days ago by Looniz74 PRO 41 comments award share report block Steak 'n Shake @SteaknShake • 2d Proud to raise the American flag at our Mattoon, Illinois location. We thank you for your continued patronage!\n41 comments Sort by Top Top New Worst Old Save UH69MAGA 35 points 2 days ago SEMPER FI permalink award report block reply Burisma 9 points 2 days ago No half-mast for Cheney permalink parent award report block reply Please_Clap -13 points 2 days ago It's still junk food that will lead to an early and expensive death. Delete ALL processed foods, fast food, alcohol, and sugar from your diet!!!!!!!! permalink parent award report block reply HoganT 16 points 2 days ago And no fun either! You will have no fun, and be happy. permalink parent award report block reply Aambrick 1 points 2 days ago Well, technically, if you prefer the highs and rushes then sure it's no fun. permalink parent award report block reply Please_Clap -17 points 2 days ago Absolutely the dumbest response possible. permalink parent award report block reply HoganT 19 points 2 days ago Oh loosen up, straight edge. permalink parent award report block reply view 11 more comments... Sgt_Hulka 3 points 2 days ago Lighten up, Francis. permalink parent award report block reply ionian 2 points 1 day ago Name checks out permalink parent award report block reply Tcrlaf1 -1 points 2 days ago You have never actually visited a Steak and Shake, have you…. permalink parent award report block reply duehuckleberry 29 points 2 days ago I will continue to patronize restaurants that are proud to be American. permalink award report block reply Looniz74 OP PRO 10 points 2 days ago https://x.com/SteaknShake/status/1988034172284440855?s=20 permalink award report block reply Retardloserimsogay 8 points 2 days ago Great town! permalink award report block reply NotNSA 7 points 2 days ago Outside of Chicago, Illinois is mostly good to go. permalink award report block reply Toohershat 4 points 2 days ago It's a great state when you get past the burbs (some of the burbs are ok) permalink parent award report block reply TennesseeScorpio 5 points 2 days ago 🇺🇸🫡 permalink award report block reply MemeWarsVet 5 points 2 days ago YUGE permalink award report block reply YaharaRiver 4 points 2 days ago ok, that is L A R G E!! 👍 permalink award report block reply blue5707 3 points 1 day ago THE MORE YOU KNOW: Sardar Biglari is an American entrepreneur who founded and serves as chairman and CEO of Biglari Holdings. He is also the chairman and CEO of Steak 'n Shake. Biglari is the founder, chairman and CEO of Biglari Capital, the general partner to The Lion Fund. Wikipedia\nBorn: 1977 (age 48 years), Tehran, Iran permalink award report block reply anotherthing 2 points 1 day ago I'm not sure that many people know that the CEO of Steak n Shake's an Iranian immigrant. Of course, given that this guy does things like this and also smacked down the CEO of Cracker Barrel over the retarded rebrand she was doing, he seems like a based immigrant. permalink parent award report block reply chadthunder 2 points 2 days ago The Steak n Shake near my house closed in the last couple of years.  It was horribly managed, always dirty and woefully understaffed.  Too bad.  Their burgers are delicious, but I just couldn’t go there anymore permalink award report block reply L-Train 2 points 2 days ago 😳🤯Who are you and where do you live?! You wrote my experience with Steak and Shake exactly here in Vincennes. I miss the \"Happy Hour \" half priced shakes from 2-5 the most, Cotton Candy shakes. 😭 It was like liquid Crack in the hot summer's. permalink parent award report block reply Givesgunstogrannies 2 points 2 days ago Been our new favorite restaurant lately.  Tallow fries and if you buy the \"bitcoin\" burger, you get $5 in CIA controlled cryptocurrency.  The also sell jars of tallow. permalink award report block reply Mungo 2 points 2 days ago Wish I was near one. permalink award report block reply BetterNameUnfound 2 points 2 days ago I finally got a chance to eat at one of these recently. Absolutely delicious. You need to try it at least once. Weird that you need to scan a receipt QR code to get your drink and get refills...but the food was great. permalink award report block reply L-Train 1 points 2 days ago Wendy's just dropped to #2 permalink award report block reply Samsons_Mullet 1 points 1 day ago I’m want a Steak and Shake near me but this town has too many fast food places as it is. permalink award report block reply MasterChief 1 points 2 days ago they only started doing this when they were on the verge of bankruptcy, this is desperation not patriotism permalink award report block reply anotherthing 1 points 1 day ago The CEO of Steak n Shake was also very publicly critical of the Cracker Barrel rebrand before that picked up traction with the masses. His company also owns a decent stake in Cracker Barrel. permalink parent award report block reply Combat_Hamster 1 points 2 days ago I know their fries are cooked in beef tallow but I'm curious whether any pede knows, did they ever say whether their other foods are also cooked with beef tallow? permalink award report block reply HoganT -1 points 2 days ago Ballroom dimensions and proportions. Lol permalink award report block reply\nUH69MAGA 35 points 2 days ago SEMPER FI permalink award report block reply Burisma 9 points 2 days ago No half-mast for Cheney permalink parent award report block reply Please_Clap -13 points 2 days ago It's still junk food that will lead to an early and expensive death. Delete ALL processed foods, fast food, alcohol, and sugar from your diet!!!!!!!! permalink parent award report block reply HoganT 16 points 2 days ago And no fun either! You will have no fun, and be happy. permalink parent award report block reply Aambrick 1 points 2 days ago Well, technically, if you prefer the highs and rushes then sure it's no fun. permalink parent award report block reply Please_Clap -17 points 2 days ago Absolutely the dumbest response possible. permalink parent award report block reply HoganT 19 points 2 days ago Oh loosen up, straight edge. permalink parent award report block reply view 11 more comments... Sgt_Hulka 3 points 2 days ago Lighten up, Francis. permalink parent award report block reply ionian 2 points 1 day ago Name checks out permalink parent award report block reply Tcrlaf1 -1 points 2 days ago You have never actually visited a Steak and Shake, have you…. permalink parent award report block reply\nBurisma 9 points 2 days ago No half-mast for Cheney permalink parent award report block reply\nPlease_Clap -13 points 2 days ago It's still junk food that will lead to an early and expensive death. Delete ALL processed foods, fast food, alcohol, and sugar from your diet!!!!!!!! permalink parent award report block reply HoganT 16 points 2 days ago And no fun either! You will have no fun, and be happy. permalink parent award report block reply Aambrick 1 points 2 days ago Well, technically, if you prefer the highs and rushes then sure it's no fun. permalink parent award report block reply Please_Clap -17 points 2 days ago Absolutely the dumbest response possible. permalink parent award report block reply HoganT 19 points 2 days ago Oh loosen up, straight edge. permalink parent award report block reply view 11 more comments... Sgt_Hulka 3 points 2 days ago Lighten up, Francis. permalink parent award report block reply ionian 2 points 1 day ago Name checks out permalink parent award report block reply Tcrlaf1 -1 points 2 days ago You have never actually visited a Steak and Shake, have you…. permalink parent award report block reply\nHoganT 16 points 2 days ago And no fun either! You will have no fun, and be happy. permalink parent award report block reply Aambrick 1 points 2 days ago Well, technically, if you prefer the highs and rushes then sure it's no fun. permalink parent award report block reply Please_Clap -17 points 2 days ago Absolutely the dumbest response possible. permalink parent award report block reply HoganT 19 points 2 days ago Oh loosen up, straight edge. permalink parent award report block reply view 11 more comments...\nAambrick 1 points 2 days ago Well, technically, if you prefer the highs and rushes then sure it's no fun. permalink parent award report block reply\nPlease_Clap -17 points 2 days ago Absolutely the dumbest response possible. permalink parent award report block reply HoganT 19 points 2 days ago Oh loosen up, straight edge. permalink parent award report block reply view 11 more comments...\nHoganT 19 points 2 days ago Oh loosen up, straight edge. permalink parent award report block reply view 11 more comments...\nSgt_Hulka 3 points 2 days ago Lighten up, Francis. permalink parent award report block reply ionian 2 points 1 day ago Name checks out permalink parent award report block reply\nionian 2 points 1 day ago Name checks out permalink parent award report block reply\nTcrlaf1 -1 points 2 days ago You have never actually visited a Steak and Shake, have you…. permalink parent award report block reply\nduehuckleberry 29 points 2 days ago I will continue to patronize restaurants that are proud to be American. permalink award report block reply\nLooniz74 OP PRO 10 points 2 days ago https://x.com/SteaknShake/status/1988034172284440855?s=20 permalink award report block reply\nRetardloserimsogay 8 points 2 days ago Great town! permalink award report block reply\nNotNSA 7 points 2 days ago Outside of Chicago, Illinois is mostly good to go. permalink award report block reply Toohershat 4 points 2 days ago It's a great state when you get past the burbs (some of the burbs are ok) permalink parent award report block reply\nToohershat 4 points 2 days ago It's a great state when you get past the burbs (some of the burbs are ok) permalink parent award report block reply\nTennesseeScorpio 5 points 2 days ago 🇺🇸🫡 permalink award report block reply\nMemeWarsVet 5 points 2 days ago YUGE permalink award report block reply\nYaharaRiver 4 points 2 days ago ok, that is L A R G E!! 👍 permalink award report block reply\nblue5707 3 points 1 day ago THE MORE YOU KNOW: Sardar Biglari is an American entrepreneur who founded and serves as chairman and CEO of Biglari Holdings. He is also the chairman and CEO of Steak 'n Shake. Biglari is the founder, chairman and CEO of Biglari Capital, the general partner to The Lion Fund. Wikipedia\nBorn: 1977 (age 48 years), Tehran, Iran permalink award report block reply anotherthing 2 points 1 day ago I'm not sure that many people know that the CEO of Steak n Shake's an Iranian immigrant. Of course, given that this guy does things like this and also smacked down the CEO of Cracker Barrel over the retarded rebrand she was doing, he seems like a based immigrant. permalink parent award report block reply\nanotherthing 2 points 1 day ago I'm not sure that many people know that the CEO of Steak n Shake's an Iranian immigrant. Of course, given that this guy does things like this and also smacked down the CEO of Cracker Barrel over the retarded rebrand she was doing, he seems like a based immigrant. permalink parent award report block reply\nchadthunder 2 points 2 days ago The Steak n Shake near my house closed in the last couple of years.  It was horribly managed, always dirty and woefully understaffed.  Too bad.  Their burgers are delicious, but I just couldn’t go there anymore permalink award report block reply L-Train 2 points 2 days ago 😳🤯Who are you and where do you live?! You wrote my experience with Steak and Shake exactly here in Vincennes. I miss the \"Happy Hour \" half priced shakes from 2-5 the most, Cotton Candy shakes. 😭 It was like liquid Crack in the hot summer's. permalink parent award report block reply\nL-Train 2 points 2 days ago 😳🤯Who are you and where do you live?! You wrote my experience with Steak and Shake exactly here in Vincennes. I miss the \"Happy Hour \" half priced shakes from 2-5 the most, Cotton Candy shakes. 😭 It was like liquid Crack in the hot summer's. permalink parent award report block reply\nGivesgunstogrannies 2 points 2 days ago Been our new favorite restaurant lately.  Tallow fries and if you buy the \"bitcoin\" burger, you get $5 in CIA controlled cryptocurrency.  The also sell jars of tallow. permalink award report block reply\nMungo 2 points 2 days ago Wish I was near one. permalink award report block reply\nBetterNameUnfound 2 points 2 days ago I finally got a chance to eat at one of these recently. Absolutely delicious. You need to try it at least once. Weird that you need to scan a receipt QR code to get your drink and get refills...but the food was great. permalink award report block reply\nL-Train 1 points 2 days ago Wendy's just dropped to #2 permalink award report block reply\nSamsons_Mullet 1 points 1 day ago I’m want a Steak and Shake near me but this town has too many fast food places as it is. permalink award report block reply\nMasterChief 1 points 2 days ago they only started doing this when they were on the verge of bankruptcy, this is desperation not patriotism permalink award report block reply anotherthing 1 points 1 day ago The CEO of Steak n Shake was also very publicly critical of the Cracker Barrel rebrand before that picked up traction with the masses. His company also owns a decent stake in Cracker Barrel. permalink parent award report block reply\nanotherthing 1 points 1 day ago The CEO of Steak n Shake was also very publicly critical of the Cracker Barrel rebrand before that picked up traction with the masses. His company also owns a decent stake in Cracker Barrel. permalink parent award report block reply\nCombat_Hamster 1 points 2 days ago I know their fries are cooked in beef tallow but I'm curious whether any pede knows, did they ever say whether their other foods are also cooked with beef tallow? permalink award report block reply\nHoganT -1 points 2 days ago Ballroom dimensions and proportions. Lol permalink award report block reply",
  "title": "1210🇺🇲posted2 days agobyLooniz74PRO41 commentsawardsharereportblock"
}