{
  "id": "1ARK9jztbS",
  "url": "https://patriots.win/p/1ARK9jztbS/breaking-doge-has-discovered-tha/c",
  "content": "1159 BREAKING: DOGE has discovered that there are 394 million Social Security recipients in the U.S. posted 1 day ago by wst4 87 comments award share report block Right Scope 🇺🇸 @RightScopee • 2d 🚨BREAKING: DOGE has discovered that there are 394 million Social Security recipients in the U.S. There are only 334 million citizens in the U.S What's your reaction?\n87 comments Sort by Top Top New Worst Old Save Around the Web Bullet3250 100 points 1 day ago 394 million Social Security 'NUMBER' recipients... permalink award report block reply RED_WAVE 21 points 1 day ago Hijacking the top comment to add this:\nGetting a SSN is just the tip of the iceberg.  Lots of Govt subsidies require a SSN, doesn't matter how you got it or if you are 200 years old.  The databases don't check that part, just if you have a valid SSN. So the fraudsters take the valid SSN and go sign up for medicaid or EBT, etc, and make bank. What this tells me is that there are a minimum of 60,000,000 fraudulent recipients of govt handouts. permalink parent award report block reply AstroturfedInNJ 3 points 1 day ago That makes item 772,176 that NOTHING will be done about. SO much fun. permalink parent award report block reply ForgottenUsername 1 points 1 day ago And all this time I thought they were stealing identities to get ss numbers.   Because I know it's hard as hell to find work without one.    One time I washed dishes for $5/hr when I lost my card.    There aren't many jobs available that will pay cash under the table, because I hate taxes as much as anyone and I've tried.      The only thing is I wonder for many of the discrepancy come from dead people who haven't been cancelled out of the system yet, and perhaps still have leech children chasing their checks. permalink parent award report block reply Retard_Strength 72 points 1 day ago damn, clickbait doesn't work so well when there's a community-provided context following it permalink award report block reply Bullet3250 49 points 1 day ago The follow up here is \"How many of those with SS Numbers are NOT US CITIZENS?\" Because Elon has spoken to this - and it is a massive problem. permalink parent award report block reply HunterBidensPC 17 points 1 day ago Exactly. Millions more numbers than citizens and they’re all fraudulent and likely collecting permalink parent award report block reply Standingoak 3 points 1 day ago Obumer has at least two and neither is his. permalink parent award report block reply bill_in_texas 3 points 1 day ago Green card holders have SS numbers and can collect if they've paid in the minimum 40 quarters.  Pretty sure about that.  I'm guessing they gave SS numbers to a bunch of others, though....DACA, TPS, bullshit asylum seekers, etc.  We need to be deporting those who can be deported.  TPS = temporary, meaning, they have to eventually go back, why not go back now? permalink parent award report block reply breadbaker 5 points 1 day ago One explainable reason for more SS numbers than residents is that every permanent resident is that they get a SS number and pay into medicare and SS when they earn. When they leave, they still use the SS to get retirement payments for the money they paid out. That might also be true for H1B and H-4 dependents. SS number is not the same as a resident id or citizen id number. Biden at the end handed out SS number to illegal border crossers who were paroled into the US. permalink parent award report block reply imnotdeadyet 5 points 1 day ago Added context - To clarify: About 69 million people receive Social Security benefits in the US. The 394 million figure refers to total Social Security numbers (SSNs) issued since 1936, not active recipients. This distinguishes between issued numbers and benefit payments. permalink parent award report block reply breadbaker 1 points 20 hours ago If 394 million have been issued since 1939 a lot of people up until may be (guessing) the 1970's never had a SS number, which is wild to think about. permalink parent award report block reply TruthyBrat 3 points 1 day ago You missed that it gives Dem states the ability to allow foreigners to vote in U.S. elections. permalink parent award report block reply breadbaker 1 points 20 hours ago No, dude I did not miss anything. It's the administrative procedure to allow legal residents to work, pay into a retirement system, and get a deserved retirement. The fact that any state has such a low bar of voter registration is completely irrelevant to the legality of issuing SS numbers to people to use the SS system. Please go back to hating on everything you don't understand. permalink parent award report block reply schiff_for_brains 2 points 1 day ago At least 60 million.  The math is easy. permalink parent award report block reply Throwingway22 1 points 1 day ago Do we have a proper understanding of the SS Number process for issuance, too? Are the people that issue them able to essentially grant the paperwork for citizenship? permalink parent award report block reply Deplora 5 points 1 day ago Citizenship is not required for social security numbers, so getting a social security number does not involve any process that confers citizenship or enables someone to fraudulently claim citizenship. Non-citizens legally working in the US need social security numbers. https://www.ssa.gov/pubs/EN-05-10096.pdf Some noncitizens who are legally present in the US are eligible to receive SSI payments: https://www.ssa.gov/ssi/spotlights/spot-non-citizens.htm u/Bullet3250 u/PlantTrees permalink parent award report block reply PlantTrees 1 points 10 hours ago I am old enough to remember when non-citizens were required to get a tax id number [ITIN] and were not eligible for an SS number. Then in the early 2000s my employer had a guy from Mexico living in the US long term as a perm res /green card with an ITIN and he also was given 'food stamps' for himself and family. His 'family members' were going back and forth [doing what?] but he sent most of his earnings to MX... very shady how 'authorities' were supporting non-citizens even then, unless they were lying to get benes. The corrupt govt machine/congress/immigration looseners have muddied so many things for so long that it is going to be a big mess to sort out. permalink parent award report block reply view 1 more comments... Bullet3250 1 points 1 day ago when is getting a SS# a criminal activity? permalink parent award report block reply view 1 more comments... RonPaulWasRight 11 points 1 day ago Doesn't stop the mods from pinning this garbage. permalink parent award report block reply South_Florida_Guy 8 points 1 day ago Ah, so not only fake but also gay permalink parent award report block reply halfstep 3 points 1 day ago I dunno, 404 retards still upvoted it permalink parent award report block reply Deplora 0 points 1 day ago A lot of PDW retards upvote every post they see. permalink parent award report block reply HOSEQ 1 points 1 day ago I don't believe there are 334 Million U.S. Citizens, I think that Number is about 40 Million too high, possibly even as much as 60 Million too high.... permalink parent award report block reply load 1 more comments... ElevenMile 33 points 1 day ago What's your reaction? Posts begging me to interact with them are usually garbage permalink award report block reply aoneleggedduck 12 points 1 day ago Engagement Farmer: \"it ain't much, but it's dishonest work.\" permalink parent award report block reply linthat22 19 points 1 day ago The extra 60 million are back up voters. permalink award report block reply BillGateCanSuckIt 13 points 1 day ago Put social security on the block chain. I want transparency permalink award report block reply MastaJoda 8 points 1 day ago Sorry best we can get is neverending Iron Dome funding. permalink parent award report block reply BillGateCanSuckIt 3 points 1 day ago Is that what they call a tiny hat which is metal? permalink parent award report block reply PepeMania 11 points 1 day ago \"Readers added context\nTo clarify: About 69 million people receive Social Security benefits in the US. The 394 million figure refers to total Social Security numbers (SSNs) issued since 1936, not active recipients. This distinguishes between issued numbers and benefit payments. ssa.gov/policy/docs/qu… ssa.gov/policy/docs/ss… factcheck.org/2025/02/online…\" permalink award report block reply PlantTrees 9 points 1 day ago Proof that previous administrations DID give SS to non-citizens, contrary to what some trolls here have tried to push. Traitors and leeches ... Apparently non-citizens can receive SS disability, and can even get it outside of the US... SSI is for aliens [WTF?].     SO, DOGE should also check out where SSD and SSI payments are being sent and why.    I previously read that groups of people outside the US [in regime change countries?] were getting payments of some sort. UNHCR supports refugees in various countries, primarily Ukraine and primarily funded by US - the great migration/refugee crap is a destabilization tactic and the UNHCR should be defunded. permalink award report block reply MuslimsWorshipSatan 9 points 1 day ago My reaction is the same as everything else. Something designed to make me feel outrage while nothing is being done about it is just pointless and bad for one's health. Let me know when it's time for rifles or when rich and famous people start seeing the insides of jail cells. Until then, there's no real reason for me to care beyond \"yep, another reason why this country is finished\". permalink award report block reply suckmycorona 5 points 1 day ago BREAKING permalink award report block reply aqua27 4 points 1 day ago You need fraud in the numbers so illegals can fraudulently work using them and collect benefits. The truth is the government has gotten so big it can't be managed. permalink award report block reply rivetjoint2 4 points 1 day ago Impossible. permalink award report block reply God-is-good 3 points 1 day ago I wonder how amazing life could be if there was no fraud and theft in the system. permalink award report block reply FuckU/Spez 3 points 1 day ago Didn't they just purge millions of SS numbers recently. permalink award report block reply Deplora 1 points 1 day ago They don't (and shouldn't) purge numbers.  That master list needs to remain available for reference.  What they did was add a deceased classification to a lot of names/numbers with birth dates that made it impossible for them to still be alive.  This never had anything to do with people actually receiving benefits.  Historically, the deceased notation was only added when the SSA received formal notification of a death.  In the early years of SS number issuance, there was still no systematic reporting of deaths from counties/states to the federal government (and indeed, a lot of people in rural areas died without any formal notification being made to the county or state).  There are probably still a significant number of people who die while living outside the US, whose deaths are not reported on a timely basis, or ever. So the presence of a lot of names/numbers on the master list of names/numbers (not a list of people getting payments, or who had ever gotten payments) with birth dates that obviously confirmed they were no longer living, was not evidence of fraud. permalink parent award report block reply Antenna 3 points 1 day ago DOGE is still in operation?? I don't understand. permalink award report block reply someguy7738 2 points 1 day ago Breaking? Wasn't this from like the first week of this current term? permalink award report block reply Deplora 2 points 1 day ago Yes, and it also wasn't/isn't true. permalink parent award report block reply Michalusmichalus 2 points 1 day ago My son had his social security number stolen. I called the police, and told them the restaurant name, and address. Those idiots called the restaurant, and asked them if my underage child was working there, and then acted surprised when the illegal working there under my child's social wasn't there when they finally decided to go. After all that then the social security office refused to change my son's social security number. If the people having their identies stolen have to do everything, and still nothing gets resolved of course it's not going to stop. The people hiring illegals need to have legal consequences too. permalink award report block reply BillPigg 2 points 1 day ago THIS IS CLICKBAIT BULLSHIT. The number of SS numbers ISSUED since 1936. permalink award report block reply Goozmania 2 points 1 day ago This is obviously a lie permalink award report block reply The_Yakuza 2 points 1 day ago Whats with all the clickbait here. It’s been getting worse.. These are number recipients. Which includes dead people from the master death file (or whatever it’s called now). permalink award report block reply JustInTime2_ 2 points 1 day ago Hades. I am too young to receive Social Security and so is half the country. permalink award report block reply Glenlaw 2 points 1 day ago My response is “I call bullshit” and respectfully ask you to provide a source for your claim. permalink award report block reply Smurfection 1 points 1 day ago It makes me very upset that Mitt Romney and Paul Ryan won the Republican party and I voted for them because they were better than Obama. For all that talk about Paul Ryan being a budget wunderkin, how come he didn't notice this? permalink award report block reply WanderingStar 1 points 1 day ago WTF! permalink award report block reply RolandDelacroix 1 points 1 day ago That few? permalink award report block reply mailinvoter 1 points 1 day ago Just like in real life, the community is retarded.  Everyone with a SS# is a social security recipient. They may not all get benefits now, but they're in the system to get them. permalink award report block reply SurveilThis 1 points 1 day ago Woo-Hoo! 60 million potential Dem voters and embezzlement tools. permalink award report block reply Califunya 1 points 1 day ago Voting in USA says “Hold my beer ssn” permalink award report block reply Comeon4954 1 points 1 day ago Find them and use corporeal punishment. Period. permalink award report block reply vongregormench 1 points 1 day ago This is always the result of someone not able to read properly and then spreading the information of what they misread, like a game of telephone with autistic kids. permalink award report block reply AcAirman 1 points 1 day ago Community note  ----  To clarify: About 69 million people receive Social Security benefits in the US. The 394 million figure refers to total Social Security numbers (SSNs) issued since 1936, not active recipients. This distinguishes between issued numbers and benefit payments. permalink award report block reply Chachiex 1 points 1 day ago Is it the case you only need to brute force SSN's to get a permanent second income? permalink award report block reply Wallllllllllllllllll 1 points 1 day ago I don't care. DOGE does nothing. They just point and say big numbers, expecting the rest of us to give a shit. But DOGE never actually gets anything done. permalink award report block reply HunterBidensPC 1 points 1 day ago By this math with the grok correction-there are 60 million possibly fraudulent (and collecting) SSNs, assuming everyone fraudulent number was made specifically to collect, that assumes 9 million Americans on social security and 60 million fraudulent collections permalink award report block reply Briben 1 points 1 day ago There’s been an average of 3.8 million births every year since 1936.  The population of the country in 1936 was 128 million people.  If everyone is issued a SS number at birth or naturalization and only 394 million were issued since 1936 it suggests that at least 67 million people never got a SS number, and that we have had zero net migration in the last 90 years.  If only 69 million people get benefits then added to those born 64 years ago to now, that suggests that 312 million people currently hold S.S. Numbers. permalink award report block reply Sdtor 1 points 1 day ago If they aren't going to fix it. Then give me some free money permalink award report block reply South_Florida_Guy 1 points 1 day ago Not surprised at all. permalink award report block reply Redeemable 1 points 1 day ago No reaction without a legitimate source for this claim. permalink award report block reply dburt2 1 points 1 day ago How many of those fuckers get to vote? permalink award report block reply lispboy 1 points 1 day ago Cut all the outliers immediately, if any are legit, open a case with SSA. permalink award report block reply trumpdagoat 1 points 1 day ago There’s FRAUD going in our country? Color me shocked! insert eye roll here permalink award report block reply ChyNahAzzWhole1 1 points 1 day ago Lots of duplicates. Hmmmm. Like say a meat packing plant submitting the same ssn fot multiple invaders? permalink award report block reply mass55th 1 points 1 day ago How many of them are dead? permalink award report block reply Ch3f4554551n 1 points 1 day ago \"Say a number to me on the phone and we will steal for you forever.\" Our actual system of government. permalink award report block reply Seruna_Kanus 1 points 1 day ago So, the OG title wasn't the best written which gives the other side a strawman to attack. permalink award report block reply MAGALADON9 1 points 1 day ago Fake & gay Check.before you rant permalink award report block reply mydogma8yourkarma 1 points 20 hours ago Ok so where is my cut? permalink award report block reply BusterHyman99 1 points 1 day ago 325 million fake ballots you mean permalink award report block reply Pissonit 1 points 1 day ago And, moving on to the next post....... permalink award report block reply MAGALADON9 1 points 1 day ago Hey beep.boop check this out No, DOGE Did Not \"Uncover\" 394 Million Social Security Recipients\nThe claim circulating on social media (including recent X posts today) that the Department of Government Efficiency (DOGE), led by Elon Musk and Vivek Ramaswamy, has \"discovered\" 394 million active Social Security recipients—exceeding the U.S. population of about 334–342 million—is false and debunked. It's a viral exaggeration that confuses total Social Security numbers (SSNs) ever issued (or records in the database) with active benefit recipients. DOGE has been involved in auditing and cleaning Social Security Administration (SSA) data for fraud and errors, but nothing like this sensational figure. permalink award report block reply rextexMG 1 points 1 day ago Well ain’t that just amazing since we only have 330m actual citizens permalink award report block reply Owmyballz 1 points 1 day ago We pay out SS to foreign nationals who pay US taxes and work here.   It's not the grand slam as presented.  We would need to see the list of foreign nationals who have worked here and subtract that from the list.  It's likely there are 20+ fraudulent SS beneficiaries after that. permalink award report block reply bratt 1 points 1 day ago What is my reaction? 60 million phantom Social Security recipients are also voting. permalink award report block reply Squentin 1 points 1 day ago Need details permalink award report block reply SoLberserker 0 points 1 day ago 30-50 million easy are illegal invaders permalink award report block reply dburt2 0 points 1 day ago We need to go back to if you are a MAN and you have property, you can vote. When people who have no skin in the game can vote themselves anything they want. permalink award report block reply The_RedWolf 0 points 24 hours ago Gut feeling the SS Office is stupidly slow at purging people off the list fully when they die and a large chunk of these have disbursement amounts of $0. but that doesnt make a good headline. I'm sure theres tons of fraud, but there's definitely a far more boring reason too. permalink award report block reply\nBullet3250 100 points 1 day ago 394 million Social Security 'NUMBER' recipients... permalink award report block reply RED_WAVE 21 points 1 day ago Hijacking the top comment to add this:\nGetting a SSN is just the tip of the iceberg.  Lots of Govt subsidies require a SSN, doesn't matter how you got it or if you are 200 years old.  The databases don't check that part, just if you have a valid SSN. So the fraudsters take the valid SSN and go sign up for medicaid or EBT, etc, and make bank. What this tells me is that there are a minimum of 60,000,000 fraudulent recipients of govt handouts. permalink parent award report block reply AstroturfedInNJ 3 points 1 day ago That makes item 772,176 that NOTHING will be done about. SO much fun. permalink parent award report block reply ForgottenUsername 1 points 1 day ago And all this time I thought they were stealing identities to get ss numbers.   Because I know it's hard as hell to find work without one.    One time I washed dishes for $5/hr when I lost my card.    There aren't many jobs available that will pay cash under the table, because I hate taxes as much as anyone and I've tried.      The only thing is I wonder for many of the discrepancy come from dead people who haven't been cancelled out of the system yet, and perhaps still have leech children chasing their checks. permalink parent award report block reply\nRED_WAVE 21 points 1 day ago Hijacking the top comment to add this:\nGetting a SSN is just the tip of the iceberg.  Lots of Govt subsidies require a SSN, doesn't matter how you got it or if you are 200 years old.  The databases don't check that part, just if you have a valid SSN. So the fraudsters take the valid SSN and go sign up for medicaid or EBT, etc, and make bank. What this tells me is that there are a minimum of 60,000,000 fraudulent recipients of govt handouts. permalink parent award report block reply AstroturfedInNJ 3 points 1 day ago That makes item 772,176 that NOTHING will be done about. SO much fun. permalink parent award report block reply ForgottenUsername 1 points 1 day ago And all this time I thought they were stealing identities to get ss numbers.   Because I know it's hard as hell to find work without one.    One time I washed dishes for $5/hr when I lost my card.    There aren't many jobs available that will pay cash under the table, because I hate taxes as much as anyone and I've tried.      The only thing is I wonder for many of the discrepancy come from dead people who haven't been cancelled out of the system yet, and perhaps still have leech children chasing their checks. permalink parent award report block reply\nAstroturfedInNJ 3 points 1 day ago That makes item 772,176 that NOTHING will be done about. SO much fun. permalink parent award report block reply\nForgottenUsername 1 points 1 day ago And all this time I thought they were stealing identities to get ss numbers.   Because I know it's hard as hell to find work without one.    One time I washed dishes for $5/hr when I lost my card.    There aren't many jobs available that will pay cash under the table, because I hate taxes as much as anyone and I've tried.      The only thing is I wonder for many of the discrepancy come from dead people who haven't been cancelled out of the system yet, and perhaps still have leech children chasing their checks. permalink parent award report block reply\nRetard_Strength 72 points 1 day ago damn, clickbait doesn't work so well when there's a community-provided context following it permalink award report block reply Bullet3250 49 points 1 day ago The follow up here is \"How many of those with SS Numbers are NOT US CITIZENS?\" Because Elon has spoken to this - and it is a massive problem. permalink parent award report block reply HunterBidensPC 17 points 1 day ago Exactly. Millions more numbers than citizens and they’re all fraudulent and likely collecting permalink parent award report block reply Standingoak 3 points 1 day ago Obumer has at least two and neither is his. permalink parent award report block reply bill_in_texas 3 points 1 day ago Green card holders have SS numbers and can collect if they've paid in the minimum 40 quarters.  Pretty sure about that.  I'm guessing they gave SS numbers to a bunch of others, though....DACA, TPS, bullshit asylum seekers, etc.  We need to be deporting those who can be deported.  TPS = temporary, meaning, they have to eventually go back, why not go back now? permalink parent award report block reply breadbaker 5 points 1 day ago One explainable reason for more SS numbers than residents is that every permanent resident is that they get a SS number and pay into medicare and SS when they earn. When they leave, they still use the SS to get retirement payments for the money they paid out. That might also be true for H1B and H-4 dependents. SS number is not the same as a resident id or citizen id number. Biden at the end handed out SS number to illegal border crossers who were paroled into the US. permalink parent award report block reply imnotdeadyet 5 points 1 day ago Added context - To clarify: About 69 million people receive Social Security benefits in the US. The 394 million figure refers to total Social Security numbers (SSNs) issued since 1936, not active recipients. This distinguishes between issued numbers and benefit payments. permalink parent award report block reply breadbaker 1 points 20 hours ago If 394 million have been issued since 1939 a lot of people up until may be (guessing) the 1970's never had a SS number, which is wild to think about. permalink parent award report block reply TruthyBrat 3 points 1 day ago You missed that it gives Dem states the ability to allow foreigners to vote in U.S. elections. permalink parent award report block reply breadbaker 1 points 20 hours ago No, dude I did not miss anything. It's the administrative procedure to allow legal residents to work, pay into a retirement system, and get a deserved retirement. The fact that any state has such a low bar of voter registration is completely irrelevant to the legality of issuing SS numbers to people to use the SS system. Please go back to hating on everything you don't understand. permalink parent award report block reply schiff_for_brains 2 points 1 day ago At least 60 million.  The math is easy. permalink parent award report block reply Throwingway22 1 points 1 day ago Do we have a proper understanding of the SS Number process for issuance, too? Are the people that issue them able to essentially grant the paperwork for citizenship? permalink parent award report block reply Deplora 5 points 1 day ago Citizenship is not required for social security numbers, so getting a social security number does not involve any process that confers citizenship or enables someone to fraudulently claim citizenship. Non-citizens legally working in the US need social security numbers. https://www.ssa.gov/pubs/EN-05-10096.pdf Some noncitizens who are legally present in the US are eligible to receive SSI payments: https://www.ssa.gov/ssi/spotlights/spot-non-citizens.htm u/Bullet3250 u/PlantTrees permalink parent award report block reply PlantTrees 1 points 10 hours ago I am old enough to remember when non-citizens were required to get a tax id number [ITIN] and were not eligible for an SS number. Then in the early 2000s my employer had a guy from Mexico living in the US long term as a perm res /green card with an ITIN and he also was given 'food stamps' for himself and family. His 'family members' were going back and forth [doing what?] but he sent most of his earnings to MX... very shady how 'authorities' were supporting non-citizens even then, unless they were lying to get benes. The corrupt govt machine/congress/immigration looseners have muddied so many things for so long that it is going to be a big mess to sort out. permalink parent award report block reply view 1 more comments... Bullet3250 1 points 1 day ago when is getting a SS# a criminal activity? permalink parent award report block reply view 1 more comments... RonPaulWasRight 11 points 1 day ago Doesn't stop the mods from pinning this garbage. permalink parent award report block reply South_Florida_Guy 8 points 1 day ago Ah, so not only fake but also gay permalink parent award report block reply halfstep 3 points 1 day ago I dunno, 404 retards still upvoted it permalink parent award report block reply Deplora 0 points 1 day ago A lot of PDW retards upvote every post they see. permalink parent award report block reply HOSEQ 1 points 1 day ago I don't believe there are 334 Million U.S. Citizens, I think that Number is about 40 Million too high, possibly even as much as 60 Million too high.... permalink parent award report block reply load 1 more comments...\nBullet3250 49 points 1 day ago The follow up here is \"How many of those with SS Numbers are NOT US CITIZENS?\" Because Elon has spoken to this - and it is a massive problem. permalink parent award report block reply HunterBidensPC 17 points 1 day ago Exactly. Millions more numbers than citizens and they’re all fraudulent and likely collecting permalink parent award report block reply Standingoak 3 points 1 day ago Obumer has at least two and neither is his. permalink parent award report block reply bill_in_texas 3 points 1 day ago Green card holders have SS numbers and can collect if they've paid in the minimum 40 quarters.  Pretty sure about that.  I'm guessing they gave SS numbers to a bunch of others, though....DACA, TPS, bullshit asylum seekers, etc.  We need to be deporting those who can be deported.  TPS = temporary, meaning, they have to eventually go back, why not go back now? permalink parent award report block reply breadbaker 5 points 1 day ago One explainable reason for more SS numbers than residents is that every permanent resident is that they get a SS number and pay into medicare and SS when they earn. When they leave, they still use the SS to get retirement payments for the money they paid out. That might also be true for H1B and H-4 dependents. SS number is not the same as a resident id or citizen id number. Biden at the end handed out SS number to illegal border crossers who were paroled into the US. permalink parent award report block reply imnotdeadyet 5 points 1 day ago Added context - To clarify: About 69 million people receive Social Security benefits in the US. The 394 million figure refers to total Social Security numbers (SSNs) issued since 1936, not active recipients. This distinguishes between issued numbers and benefit payments. permalink parent award report block reply breadbaker 1 points 20 hours ago If 394 million have been issued since 1939 a lot of people up until may be (guessing) the 1970's never had a SS number, which is wild to think about. permalink parent award report block reply TruthyBrat 3 points 1 day ago You missed that it gives Dem states the ability to allow foreigners to vote in U.S. elections. permalink parent award report block reply breadbaker 1 points 20 hours ago No, dude I did not miss anything. It's the administrative procedure to allow legal residents to work, pay into a retirement system, and get a deserved retirement. The fact that any state has such a low bar of voter registration is completely irrelevant to the legality of issuing SS numbers to people to use the SS system. Please go back to hating on everything you don't understand. permalink parent award report block reply schiff_for_brains 2 points 1 day ago At least 60 million.  The math is easy. permalink parent award report block reply Throwingway22 1 points 1 day ago Do we have a proper understanding of the SS Number process for issuance, too? Are the people that issue them able to essentially grant the paperwork for citizenship? permalink parent award report block reply Deplora 5 points 1 day ago Citizenship is not required for social security numbers, so getting a social security number does not involve any process that confers citizenship or enables someone to fraudulently claim citizenship. Non-citizens legally working in the US need social security numbers. https://www.ssa.gov/pubs/EN-05-10096.pdf Some noncitizens who are legally present in the US are eligible to receive SSI payments: https://www.ssa.gov/ssi/spotlights/spot-non-citizens.htm u/Bullet3250 u/PlantTrees permalink parent award report block reply PlantTrees 1 points 10 hours ago I am old enough to remember when non-citizens were required to get a tax id number [ITIN] and were not eligible for an SS number. Then in the early 2000s my employer had a guy from Mexico living in the US long term as a perm res /green card with an ITIN and he also was given 'food stamps' for himself and family. His 'family members' were going back and forth [doing what?] but he sent most of his earnings to MX... very shady how 'authorities' were supporting non-citizens even then, unless they were lying to get benes. The corrupt govt machine/congress/immigration looseners have muddied so many things for so long that it is going to be a big mess to sort out. permalink parent award report block reply view 1 more comments... Bullet3250 1 points 1 day ago when is getting a SS# a criminal activity? permalink parent award report block reply view 1 more comments...\nHunterBidensPC 17 points 1 day ago Exactly. Millions more numbers than citizens and they’re all fraudulent and likely collecting permalink parent award report block reply Standingoak 3 points 1 day ago Obumer has at least two and neither is his. permalink parent award report block reply bill_in_texas 3 points 1 day ago Green card holders have SS numbers and can collect if they've paid in the minimum 40 quarters.  Pretty sure about that.  I'm guessing they gave SS numbers to a bunch of others, though....DACA, TPS, bullshit asylum seekers, etc.  We need to be deporting those who can be deported.  TPS = temporary, meaning, they have to eventually go back, why not go back now? permalink parent award report block reply\nStandingoak 3 points 1 day ago Obumer has at least two and neither is his. permalink parent award report block reply\nbill_in_texas 3 points 1 day ago Green card holders have SS numbers and can collect if they've paid in the minimum 40 quarters.  Pretty sure about that.  I'm guessing they gave SS numbers to a bunch of others, though....DACA, TPS, bullshit asylum seekers, etc.  We need to be deporting those who can be deported.  TPS = temporary, meaning, they have to eventually go back, why not go back now? permalink parent award report block reply\nbreadbaker 5 points 1 day ago One explainable reason for more SS numbers than residents is that every permanent resident is that they get a SS number and pay into medicare and SS when they earn. When they leave, they still use the SS to get retirement payments for the money they paid out. That might also be true for H1B and H-4 dependents. SS number is not the same as a resident id or citizen id number. Biden at the end handed out SS number to illegal border crossers who were paroled into the US. permalink parent award report block reply imnotdeadyet 5 points 1 day ago Added context - To clarify: About 69 million people receive Social Security benefits in the US. The 394 million figure refers to total Social Security numbers (SSNs) issued since 1936, not active recipients. This distinguishes between issued numbers and benefit payments. permalink parent award report block reply breadbaker 1 points 20 hours ago If 394 million have been issued since 1939 a lot of people up until may be (guessing) the 1970's never had a SS number, which is wild to think about. permalink parent award report block reply TruthyBrat 3 points 1 day ago You missed that it gives Dem states the ability to allow foreigners to vote in U.S. elections. permalink parent award report block reply breadbaker 1 points 20 hours ago No, dude I did not miss anything. It's the administrative procedure to allow legal residents to work, pay into a retirement system, and get a deserved retirement. The fact that any state has such a low bar of voter registration is completely irrelevant to the legality of issuing SS numbers to people to use the SS system. Please go back to hating on everything you don't understand. permalink parent award report block reply\nimnotdeadyet 5 points 1 day ago Added context - To clarify: About 69 million people receive Social Security benefits in the US. The 394 million figure refers to total Social Security numbers (SSNs) issued since 1936, not active recipients. This distinguishes between issued numbers and benefit payments. permalink parent award report block reply breadbaker 1 points 20 hours ago If 394 million have been issued since 1939 a lot of people up until may be (guessing) the 1970's never had a SS number, which is wild to think about. permalink parent award report block reply\nbreadbaker 1 points 20 hours ago If 394 million have been issued since 1939 a lot of people up until may be (guessing) the 1970's never had a SS number, which is wild to think about. permalink parent award report block reply\nTruthyBrat 3 points 1 day ago You missed that it gives Dem states the ability to allow foreigners to vote in U.S. elections. permalink parent award report block reply breadbaker 1 points 20 hours ago No, dude I did not miss anything. It's the administrative procedure to allow legal residents to work, pay into a retirement system, and get a deserved retirement. The fact that any state has such a low bar of voter registration is completely irrelevant to the legality of issuing SS numbers to people to use the SS system. Please go back to hating on everything you don't understand. permalink parent award report block reply\nbreadbaker 1 points 20 hours ago No, dude I did not miss anything. It's the administrative procedure to allow legal residents to work, pay into a retirement system, and get a deserved retirement. The fact that any state has such a low bar of voter registration is completely irrelevant to the legality of issuing SS numbers to people to use the SS system. Please go back to hating on everything you don't understand. permalink parent award report block reply\nschiff_for_brains 2 points 1 day ago At least 60 million.  The math is easy. permalink parent award report block reply\nThrowingway22 1 points 1 day ago Do we have a proper understanding of the SS Number process for issuance, too? Are the people that issue them able to essentially grant the paperwork for citizenship? permalink parent award report block reply Deplora 5 points 1 day ago Citizenship is not required for social security numbers, so getting a social security number does not involve any process that confers citizenship or enables someone to fraudulently claim citizenship. Non-citizens legally working in the US need social security numbers. https://www.ssa.gov/pubs/EN-05-10096.pdf Some noncitizens who are legally present in the US are eligible to receive SSI payments: https://www.ssa.gov/ssi/spotlights/spot-non-citizens.htm u/Bullet3250 u/PlantTrees permalink parent award report block reply PlantTrees 1 points 10 hours ago I am old enough to remember when non-citizens were required to get a tax id number [ITIN] and were not eligible for an SS number. Then in the early 2000s my employer had a guy from Mexico living in the US long term as a perm res /green card with an ITIN and he also was given 'food stamps' for himself and family. His 'family members' were going back and forth [doing what?] but he sent most of his earnings to MX... very shady how 'authorities' were supporting non-citizens even then, unless they were lying to get benes. The corrupt govt machine/congress/immigration looseners have muddied so many things for so long that it is going to be a big mess to sort out. permalink parent award report block reply view 1 more comments... Bullet3250 1 points 1 day ago when is getting a SS# a criminal activity? permalink parent award report block reply view 1 more comments...\nDeplora 5 points 1 day ago Citizenship is not required for social security numbers, so getting a social security number does not involve any process that confers citizenship or enables someone to fraudulently claim citizenship. Non-citizens legally working in the US need social security numbers. https://www.ssa.gov/pubs/EN-05-10096.pdf Some noncitizens who are legally present in the US are eligible to receive SSI payments: https://www.ssa.gov/ssi/spotlights/spot-non-citizens.htm u/Bullet3250 u/PlantTrees permalink parent award report block reply PlantTrees 1 points 10 hours ago I am old enough to remember when non-citizens were required to get a tax id number [ITIN] and were not eligible for an SS number. Then in the early 2000s my employer had a guy from Mexico living in the US long term as a perm res /green card with an ITIN and he also was given 'food stamps' for himself and family. His 'family members' were going back and forth [doing what?] but he sent most of his earnings to MX... very shady how 'authorities' were supporting non-citizens even then, unless they were lying to get benes. The corrupt govt machine/congress/immigration looseners have muddied so many things for so long that it is going to be a big mess to sort out. permalink parent award report block reply view 1 more comments... Bullet3250 1 points 1 day ago when is getting a SS# a criminal activity? permalink parent award report block reply view 1 more comments...\nPlantTrees 1 points 10 hours ago I am old enough to remember when non-citizens were required to get a tax id number [ITIN] and were not eligible for an SS number. Then in the early 2000s my employer had a guy from Mexico living in the US long term as a perm res /green card with an ITIN and he also was given 'food stamps' for himself and family. His 'family members' were going back and forth [doing what?] but he sent most of his earnings to MX... very shady how 'authorities' were supporting non-citizens even then, unless they were lying to get benes. The corrupt govt machine/congress/immigration looseners have muddied so many things for so long that it is going to be a big mess to sort out. permalink parent award report block reply view 1 more comments...\nBullet3250 1 points 1 day ago when is getting a SS# a criminal activity? permalink parent award report block reply view 1 more comments...\nRonPaulWasRight 11 points 1 day ago Doesn't stop the mods from pinning this garbage. permalink parent award report block reply\nSouth_Florida_Guy 8 points 1 day ago Ah, so not only fake but also gay permalink parent award report block reply\nhalfstep 3 points 1 day ago I dunno, 404 retards still upvoted it permalink parent award report block reply Deplora 0 points 1 day ago A lot of PDW retards upvote every post they see. permalink parent award report block reply\nDeplora 0 points 1 day ago A lot of PDW retards upvote every post they see. permalink parent award report block reply\nHOSEQ 1 points 1 day ago I don't believe there are 334 Million U.S. Citizens, I think that Number is about 40 Million too high, possibly even as much as 60 Million too high.... permalink parent award report block reply\nElevenMile 33 points 1 day ago What's your reaction? Posts begging me to interact with them are usually garbage permalink award report block reply aoneleggedduck 12 points 1 day ago Engagement Farmer: \"it ain't much, but it's dishonest work.\" permalink parent award report block reply\naoneleggedduck 12 points 1 day ago Engagement Farmer: \"it ain't much, but it's dishonest work.\" permalink parent award report block reply\nlinthat22 19 points 1 day ago The extra 60 million are back up voters. permalink award report block reply\nBillGateCanSuckIt 13 points 1 day ago Put social security on the block chain. I want transparency permalink award report block reply MastaJoda 8 points 1 day ago Sorry best we can get is neverending Iron Dome funding. permalink parent award report block reply BillGateCanSuckIt 3 points 1 day ago Is that what they call a tiny hat which is metal? permalink parent award report block reply\nMastaJoda 8 points 1 day ago Sorry best we can get is neverending Iron Dome funding. permalink parent award report block reply BillGateCanSuckIt 3 points 1 day ago Is that what they call a tiny hat which is metal? permalink parent award report block reply\nBillGateCanSuckIt 3 points 1 day ago Is that what they call a tiny hat which is metal? permalink parent award report block reply\nPepeMania 11 points 1 day ago \"Readers added context\nTo clarify: About 69 million people receive Social Security benefits in the US. The 394 million figure refers to total Social Security numbers (SSNs) issued since 1936, not active recipients. This distinguishes between issued numbers and benefit payments. ssa.gov/policy/docs/qu… ssa.gov/policy/docs/ss… factcheck.org/2025/02/online…\" permalink award report block reply\nPlantTrees 9 points 1 day ago Proof that previous administrations DID give SS to non-citizens, contrary to what some trolls here have tried to push. Traitors and leeches ... Apparently non-citizens can receive SS disability, and can even get it outside of the US... SSI is for aliens [WTF?].     SO, DOGE should also check out where SSD and SSI payments are being sent and why.    I previously read that groups of people outside the US [in regime change countries?] were getting payments of some sort. UNHCR supports refugees in various countries, primarily Ukraine and primarily funded by US - the great migration/refugee crap is a destabilization tactic and the UNHCR should be defunded. permalink award report block reply\nMuslimsWorshipSatan 9 points 1 day ago My reaction is the same as everything else. Something designed to make me feel outrage while nothing is being done about it is just pointless and bad for one's health. Let me know when it's time for rifles or when rich and famous people start seeing the insides of jail cells. Until then, there's no real reason for me to care beyond \"yep, another reason why this country is finished\". permalink award report block reply\nsuckmycorona 5 points 1 day ago BREAKING permalink award report block reply\naqua27 4 points 1 day ago You need fraud in the numbers so illegals can fraudulently work using them and collect benefits. The truth is the government has gotten so big it can't be managed. permalink award report block reply\nrivetjoint2 4 points 1 day ago Impossible. permalink award report block reply\nGod-is-good 3 points 1 day ago I wonder how amazing life could be if there was no fraud and theft in the system. permalink award report block reply\nFuckU/Spez 3 points 1 day ago Didn't they just purge millions of SS numbers recently. permalink award report block reply Deplora 1 points 1 day ago They don't (and shouldn't) purge numbers.  That master list needs to remain available for reference.  What they did was add a deceased classification to a lot of names/numbers with birth dates that made it impossible for them to still be alive.  This never had anything to do with people actually receiving benefits.  Historically, the deceased notation was only added when the SSA received formal notification of a death.  In the early years of SS number issuance, there was still no systematic reporting of deaths from counties/states to the federal government (and indeed, a lot of people in rural areas died without any formal notification being made to the county or state).  There are probably still a significant number of people who die while living outside the US, whose deaths are not reported on a timely basis, or ever. So the presence of a lot of names/numbers on the master list of names/numbers (not a list of people getting payments, or who had ever gotten payments) with birth dates that obviously confirmed they were no longer living, was not evidence of fraud. permalink parent award report block reply\nDeplora 1 points 1 day ago They don't (and shouldn't) purge numbers.  That master list needs to remain available for reference.  What they did was add a deceased classification to a lot of names/numbers with birth dates that made it impossible for them to still be alive.  This never had anything to do with people actually receiving benefits.  Historically, the deceased notation was only added when the SSA received formal notification of a death.  In the early years of SS number issuance, there was still no systematic reporting of deaths from counties/states to the federal government (and indeed, a lot of people in rural areas died without any formal notification being made to the county or state).  There are probably still a significant number of people who die while living outside the US, whose deaths are not reported on a timely basis, or ever. So the presence of a lot of names/numbers on the master list of names/numbers (not a list of people getting payments, or who had ever gotten payments) with birth dates that obviously confirmed they were no longer living, was not evidence of fraud. permalink parent award report block reply\nAntenna 3 points 1 day ago DOGE is still in operation?? I don't understand. permalink award report block reply\nsomeguy7738 2 points 1 day ago Breaking? Wasn't this from like the first week of this current term? permalink award report block reply Deplora 2 points 1 day ago Yes, and it also wasn't/isn't true. permalink parent award report block reply\nDeplora 2 points 1 day ago Yes, and it also wasn't/isn't true. permalink parent award report block reply\nMichalusmichalus 2 points 1 day ago My son had his social security number stolen. I called the police, and told them the restaurant name, and address. Those idiots called the restaurant, and asked them if my underage child was working there, and then acted surprised when the illegal working there under my child's social wasn't there when they finally decided to go. After all that then the social security office refused to change my son's social security number. If the people having their identies stolen have to do everything, and still nothing gets resolved of course it's not going to stop. The people hiring illegals need to have legal consequences too. permalink award report block reply\nBillPigg 2 points 1 day ago THIS IS CLICKBAIT BULLSHIT. The number of SS numbers ISSUED since 1936. permalink award report block reply\nGoozmania 2 points 1 day ago This is obviously a lie permalink award report block reply\nThe_Yakuza 2 points 1 day ago Whats with all the clickbait here. It’s been getting worse.. These are number recipients. Which includes dead people from the master death file (or whatever it’s called now). permalink award report block reply\nJustInTime2_ 2 points 1 day ago Hades. I am too young to receive Social Security and so is half the country. permalink award report block reply\nGlenlaw 2 points 1 day ago My response is “I call bullshit” and respectfully ask you to provide a source for your claim. permalink award report block reply\nSmurfection 1 points 1 day ago It makes me very upset that Mitt Romney and Paul Ryan won the Republican party and I voted for them because they were better than Obama. For all that talk about Paul Ryan being a budget wunderkin, how come he didn't notice this? permalink award report block reply\nWanderingStar 1 points 1 day ago WTF! permalink award report block reply\nRolandDelacroix 1 points 1 day ago That few? permalink award report block reply\nmailinvoter 1 points 1 day ago Just like in real life, the community is retarded.  Everyone with a SS# is a social security recipient. They may not all get benefits now, but they're in the system to get them. permalink award report block reply\nSurveilThis 1 points 1 day ago Woo-Hoo! 60 million potential Dem voters and embezzlement tools. permalink award report block reply\nCalifunya 1 points 1 day ago Voting in USA says “Hold my beer ssn” permalink award report block reply\nComeon4954 1 points 1 day ago Find them and use corporeal punishment. Period. permalink award report block reply\nvongregormench 1 points 1 day ago This is always the result of someone not able to read properly and then spreading the information of what they misread, like a game of telephone with autistic kids. permalink award report block reply\nAcAirman 1 points 1 day ago Community note  ----  To clarify: About 69 million people receive Social Security benefits in the US. The 394 million figure refers to total Social Security numbers (SSNs) issued since 1936, not active recipients. This distinguishes between issued numbers and benefit payments. permalink award report block reply\nChachiex 1 points 1 day ago Is it the case you only need to brute force SSN's to get a permanent second income? permalink award report block reply\nWallllllllllllllllll 1 points 1 day ago I don't care. DOGE does nothing. They just point and say big numbers, expecting the rest of us to give a shit. But DOGE never actually gets anything done. permalink award report block reply\nHunterBidensPC 1 points 1 day ago By this math with the grok correction-there are 60 million possibly fraudulent (and collecting) SSNs, assuming everyone fraudulent number was made specifically to collect, that assumes 9 million Americans on social security and 60 million fraudulent collections permalink award report block reply\nBriben 1 points 1 day ago There’s been an average of 3.8 million births every year since 1936.  The population of the country in 1936 was 128 million people.  If everyone is issued a SS number at birth or naturalization and only 394 million were issued since 1936 it suggests that at least 67 million people never got a SS number, and that we have had zero net migration in the last 90 years.  If only 69 million people get benefits then added to those born 64 years ago to now, that suggests that 312 million people currently hold S.S. Numbers. permalink award report block reply\nSdtor 1 points 1 day ago If they aren't going to fix it. Then give me some free money permalink award report block reply\nSouth_Florida_Guy 1 points 1 day ago Not surprised at all. permalink award report block reply\nRedeemable 1 points 1 day ago No reaction without a legitimate source for this claim. permalink award report block reply\ndburt2 1 points 1 day ago How many of those fuckers get to vote? permalink award report block reply\nlispboy 1 points 1 day ago Cut all the outliers immediately, if any are legit, open a case with SSA. permalink award report block reply\ntrumpdagoat 1 points 1 day ago There’s FRAUD going in our country? Color me shocked! insert eye roll here permalink award report block reply\nChyNahAzzWhole1 1 points 1 day ago Lots of duplicates. Hmmmm. Like say a meat packing plant submitting the same ssn fot multiple invaders? permalink award report block reply\nmass55th 1 points 1 day ago How many of them are dead? permalink award report block reply\nCh3f4554551n 1 points 1 day ago \"Say a number to me on the phone and we will steal for you forever.\" Our actual system of government. permalink award report block reply\nSeruna_Kanus 1 points 1 day ago So, the OG title wasn't the best written which gives the other side a strawman to attack. permalink award report block reply\nMAGALADON9 1 points 1 day ago Fake & gay Check.before you rant permalink award report block reply\nmydogma8yourkarma 1 points 20 hours ago Ok so where is my cut? permalink award report block reply\nBusterHyman99 1 points 1 day ago 325 million fake ballots you mean permalink award report block reply\nPissonit 1 points 1 day ago And, moving on to the next post....... permalink award report block reply\nMAGALADON9 1 points 1 day ago Hey beep.boop check this out No, DOGE Did Not \"Uncover\" 394 Million Social Security Recipients\nThe claim circulating on social media (including recent X posts today) that the Department of Government Efficiency (DOGE), led by Elon Musk and Vivek Ramaswamy, has \"discovered\" 394 million active Social Security recipients—exceeding the U.S. population of about 334–342 million—is false and debunked. It's a viral exaggeration that confuses total Social Security numbers (SSNs) ever issued (or records in the database) with active benefit recipients. DOGE has been involved in auditing and cleaning Social Security Administration (SSA) data for fraud and errors, but nothing like this sensational figure. permalink award report block reply\nrextexMG 1 points 1 day ago Well ain’t that just amazing since we only have 330m actual citizens permalink award report block reply\nOwmyballz 1 points 1 day ago We pay out SS to foreign nationals who pay US taxes and work here.   It's not the grand slam as presented.  We would need to see the list of foreign nationals who have worked here and subtract that from the list.  It's likely there are 20+ fraudulent SS beneficiaries after that. permalink award report block reply\nbratt 1 points 1 day ago What is my reaction? 60 million phantom Social Security recipients are also voting. permalink award report block reply\nSquentin 1 points 1 day ago Need details permalink award report block reply\nSoLberserker 0 points 1 day ago 30-50 million easy are illegal invaders permalink award report block reply\ndburt2 0 points 1 day ago We need to go back to if you are a MAN and you have property, you can vote. When people who have no skin in the game can vote themselves anything they want. permalink award report block reply\nThe_RedWolf 0 points 24 hours ago Gut feeling the SS Office is stupidly slow at purging people off the list fully when they die and a large chunk of these have disbursement amounts of $0. but that doesnt make a good headline. I'm sure theres tons of fraud, but there's definitely a far more boring reason too. permalink award report block reply",
  "fetched_at": "2025-11-12T23:05:25.078872Z"
}