{
  "id": "1ARK9nPdOa",
  "url": "https://patriots.win/p/1ARK9nPdOa/were-done-with-the-90foot-hindu-/c",
  "content": "181 We’re done with the 90-foot Hindu monkey god statues. We’re done with the Diwali greetings. We’re done with the retarded truck drivers. We don’t have anything in common with these people. We’re not backing down on H1Bs. posted 4 hours ago by Thatunknownguy 10 comments award share report block BowTiedRanger @BowTiedRanger • 19h We’re done with the 90-foot Hindu monkey god statues. We’re done with the Diwali greetings. We’re done with the retarded truck drivers. We don’t have anything in common with these people. We’re not backing down on H1Bs.\n10 comments Sort by Top Top New Worst Old Save liberalshitlord 9 points 4 hours ago Don’t tell Kash……. permalink award report block reply bill_in_texas 8 points 3 hours ago Or Trump, who held a 'Diwali' event at the White House. permalink parent award report block reply SirPokeSmottington 1 points 1 hour ago We’re not backing down on H1Bs. Lol, what's the faggot think he's going to do? Stop working in protest? That's as gutless as telling a supermodel she'll be sorry for not dating you. permalink parent award report block reply M-m-m-my-corona 7 points 3 hours ago FUENTES FOR PRESIDENT permalink award report block reply genericamerican69 1 points 2 hours ago They need to be forcibly removed and I have been saying this for 10 years!!!!!! permalink award report block reply seeyouinvalhalla 1 points 31 minutes ago Don’t tell the vice president permalink award report block reply Thereisnogodbutgoat 0 points 4 hours ago Now do the Muslims Muslim being a New York mayor Muslim governing  Dearborn MI Muslim ruling Minneapolis Ok with churches being turned into mosques Ok with sharia law Ok with Muslim only townships OK with brother fucker in our senate Ok with Muslim refugees being on SNAP Ok  Muslims taking over every street in US to pray Ok with Muslims calling out for prayer over microphones Children not being able to eat bacon in school because Muslims get offended Halal food cart in every street in NYC Muslim only sharia patrols permalink award report block reply South_Florida_Guy 7 points 3 hours ago quit topic sliding you one issue faggot from tel aviv, keep your ethnic land disputes to yourself over there shlomo you faggot baby dick sucking freak permalink parent award report block reply Thatunknownguy OP 5 points 4 hours ago I dont care about your ethnic feuds with pakistan you jeet youre both going back to the shitholes you came from permalink parent award report block reply wharfthrowaway 5 points 4 hours ago Deport anyone who votes democrat and the problem sorts itself out permalink parent award report block reply\nliberalshitlord 9 points 4 hours ago Don’t tell Kash……. permalink award report block reply bill_in_texas 8 points 3 hours ago Or Trump, who held a 'Diwali' event at the White House. permalink parent award report block reply SirPokeSmottington 1 points 1 hour ago We’re not backing down on H1Bs. Lol, what's the faggot think he's going to do? Stop working in protest? That's as gutless as telling a supermodel she'll be sorry for not dating you. permalink parent award report block reply\nbill_in_texas 8 points 3 hours ago Or Trump, who held a 'Diwali' event at the White House. permalink parent award report block reply\nSirPokeSmottington 1 points 1 hour ago We’re not backing down on H1Bs. Lol, what's the faggot think he's going to do? Stop working in protest? That's as gutless as telling a supermodel she'll be sorry for not dating you. permalink parent award report block reply\nM-m-m-my-corona 7 points 3 hours ago FUENTES FOR PRESIDENT permalink award report block reply\ngenericamerican69 1 points 2 hours ago They need to be forcibly removed and I have been saying this for 10 years!!!!!! permalink award report block reply\nseeyouinvalhalla 1 points 31 minutes ago Don’t tell the vice president permalink award report block reply\nThereisnogodbutgoat 0 points 4 hours ago Now do the Muslims Muslim being a New York mayor Muslim governing  Dearborn MI Muslim ruling Minneapolis Ok with churches being turned into mosques Ok with sharia law Ok with Muslim only townships OK with brother fucker in our senate Ok with Muslim refugees being on SNAP Ok  Muslims taking over every street in US to pray Ok with Muslims calling out for prayer over microphones Children not being able to eat bacon in school because Muslims get offended Halal food cart in every street in NYC Muslim only sharia patrols permalink award report block reply South_Florida_Guy 7 points 3 hours ago quit topic sliding you one issue faggot from tel aviv, keep your ethnic land disputes to yourself over there shlomo you faggot baby dick sucking freak permalink parent award report block reply Thatunknownguy OP 5 points 4 hours ago I dont care about your ethnic feuds with pakistan you jeet youre both going back to the shitholes you came from permalink parent award report block reply wharfthrowaway 5 points 4 hours ago Deport anyone who votes democrat and the problem sorts itself out permalink parent award report block reply\nSouth_Florida_Guy 7 points 3 hours ago quit topic sliding you one issue faggot from tel aviv, keep your ethnic land disputes to yourself over there shlomo you faggot baby dick sucking freak permalink parent award report block reply\nThatunknownguy OP 5 points 4 hours ago I dont care about your ethnic feuds with pakistan you jeet youre both going back to the shitholes you came from permalink parent award report block reply\nwharfthrowaway 5 points 4 hours ago Deport anyone who votes democrat and the problem sorts itself out permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:00:41.225353Z"
}