{
  "id": "8185540",
  "title": "79JESSE KELLY - \"I am NOT saying I have intel on this because I have none. But a horrifying thought ",
  "url": "https://patriots.win/p/1ARK9nP560/jesse-kelly--i-am-not-saying-i-h/c",
  "content": "79 JESSE KELLY - \"I am NOT saying I have intel on this because I have none. But a horrifying thought just went through my head. \n\nWhat if all this “We need more H1B!” talk is them prepping the ground for a coming immigration bill we’re not gonna like? \n\nThat…better not happen.\" posted 2 hours ago by bleeje 14 comments award share report block Jesse Kelly @JesseKellyDC • 3h I am NOT saying I have intel on this because I have none. But a horrifying thought just went through my head. What if all this “We need more H1B!” talk is them prepping the ground for a coming immigration bill we’re not gonna like? That…better not happen.\n14 comments Sort by Top Top New Worst Old Save CommieCrats 6 points 1 hour ago Amenesty for all brown invaders, kill whitey! permalink award report block reply GatoradeJeb 2 points 1 hour ago And then theyll brainwash all White woman to racemix permalink parent award report block reply CommieCrats 3 points 60 minutes ago Already there permalink parent award report block reply Greenhills 5 points 2 hours ago I’ll have those jeets voting Republican for the next 200 years. permalink award report block reply NoahGav 2 points 2 hours ago In that case I'll take it. You know I love my based replacements. permalink parent award report block reply Lurker404 2 points 1 hour ago Except they overwhelmingly vote Dem. permalink parent award report block reply GatoradeJeb 2 points 1 hour ago More lile he wants White man huniliated by making us watch White woman brainwashed to mudshark with these street shitters permalink parent award report block reply MAGALADON9 1 points 1 hour ago Bodies permalink award report block reply Jack_NC 1 points 1 hour ago Then that is war. With all the horrors it entails. permalink award report block reply Grindelwald -4 points 2 hours ago If we take their best and brightest for our benefit, then return them or have them assimilate as we send back the 30,000,000 illegals that are wandering around criminally or sucking down welfare benefits and never assimilating, what is wrong with that? Our educational system has not produced enough of the right talent to meet our needs.  Fix that and make America so great that other countries are trying to recruit them to their lands. permalink award report block reply GatoradeJeb 3 points 60 minutes ago How did that work out for california after reagan gave latinos amnesty? permalink parent award report block reply Petiteputnam1 -5 points 2 hours ago Or on the flip side (where I also have no intel and am just saying shit to say shit) what if all this we need more H1B talk is Trump tricking the other govts into thinking they can't lose their best people so they criminalize immigrating elsewhere permalink award report block reply MastaJoda 3 points 1 hour ago thats some real 95D checkers there. Dont eat the crayons bro permalink parent award report block reply GatoradeJeb 2 points 60 minutes ago Or its more plainly more antiWhitism permalink parent award report block reply\nCommieCrats 6 points 1 hour ago Amenesty for all brown invaders, kill whitey! permalink award report block reply GatoradeJeb 2 points 1 hour ago And then theyll brainwash all White woman to racemix permalink parent award report block reply CommieCrats 3 points 60 minutes ago Already there permalink parent award report block reply\nGatoradeJeb 2 points 1 hour ago And then theyll brainwash all White woman to racemix permalink parent award report block reply CommieCrats 3 points 60 minutes ago Already there permalink parent award report block reply\nCommieCrats 3 points 60 minutes ago Already there permalink parent award report block reply\nGreenhills 5 points 2 hours ago I’ll have those jeets voting Republican for the next 200 years. permalink award report block reply NoahGav 2 points 2 hours ago In that case I'll take it. You know I love my based replacements. permalink parent award report block reply Lurker404 2 points 1 hour ago Except they overwhelmingly vote Dem. permalink parent award report block reply GatoradeJeb 2 points 1 hour ago More lile he wants White man huniliated by making us watch White woman brainwashed to mudshark with these street shitters permalink parent award report block reply\nNoahGav 2 points 2 hours ago In that case I'll take it. You know I love my based replacements. permalink parent award report block reply Lurker404 2 points 1 hour ago Except they overwhelmingly vote Dem. permalink parent award report block reply\nLurker404 2 points 1 hour ago Except they overwhelmingly vote Dem. permalink parent award report block reply\nGatoradeJeb 2 points 1 hour ago More lile he wants White man huniliated by making us watch White woman brainwashed to mudshark with these street shitters permalink parent award report block reply\nMAGALADON9 1 points 1 hour ago Bodies permalink award report block reply\nJack_NC 1 points 1 hour ago Then that is war. With all the horrors it entails. permalink award report block reply\nGrindelwald -4 points 2 hours ago If we take their best and brightest for our benefit, then return them or have them assimilate as we send back the 30,000,000 illegals that are wandering around criminally or sucking down welfare benefits and never assimilating, what is wrong with that? Our educational system has not produced enough of the right talent to meet our needs.  Fix that and make America so great that other countries are trying to recruit them to their lands. permalink award report block reply GatoradeJeb 3 points 60 minutes ago How did that work out for california after reagan gave latinos amnesty? permalink parent award report block reply\nGatoradeJeb 3 points 60 minutes ago How did that work out for california after reagan gave latinos amnesty? permalink parent award report block reply\nPetiteputnam1 -5 points 2 hours ago Or on the flip side (where I also have no intel and am just saying shit to say shit) what if all this we need more H1B talk is Trump tricking the other govts into thinking they can't lose their best people so they criminalize immigrating elsewhere permalink award report block reply MastaJoda 3 points 1 hour ago thats some real 95D checkers there. Dont eat the crayons bro permalink parent award report block reply GatoradeJeb 2 points 60 minutes ago Or its more plainly more antiWhitism permalink parent award report block reply\nMastaJoda 3 points 1 hour ago thats some real 95D checkers there. Dont eat the crayons bro permalink parent award report block reply\nGatoradeJeb 2 points 60 minutes ago Or its more plainly more antiWhitism permalink parent award report block reply"
}