{
  "id": "1ARK56k6x4",
  "url": "https://patriots.win/p/1ARK56k6x4/she-divorced-her-husband-then-fo/c",
  "content": "295 She divorced her husband then found out he doesn't have to pay child support posted 5 days ago by TrumpCare 24 comments award share report block Clip Insanity @ClipInsanity • 5d She divorced her husband then found out he doesn't have to pay child support\n24 comments Sort by Top Top New Worst Old Save Around the Web Hairloss After 40 Linked to 1 Common Thing (Stop Doing This) HaloGrow WeaponizedSmirk 45 points 4 days ago If you think she's actually on the phone with someone and didn't know all of this before she started recording, you are a fucking retard. permalink award report block reply patrioticwinning3 16 points 4 days ago Seems fake and ghey... permalink parent award report block reply trumpORbust 5 points 4 days ago As is everything permalink parent award report block reply HockeyMom4Trump 4 points 4 days ago Yep. Rage bait. permalink parent award report block reply ElevenMile 25 points 5 days ago \"Im officially primary custodian of the kids!  ... What?! I have to take care of them?! This is FUCKED UP!\" permalink award report block reply ColonelKlink 22 points 5 days ago Were the kids not his? permalink award report block reply Meister_Bockmist 25 points 4 days ago At this point, we're not even sure if the kids are really hers. permalink parent award report block reply Powhattan 3 points 4 days ago Does she even have kids? permalink parent award report block reply AutPaxAutBellum300 2 points 4 days ago She probably has several, started when she was 13 permalink parent award report block reply EDDIT_IS_CUCKED 1 points 4 days ago But I'm sure she started practicing even earlier and with multiple partners. permalink parent award report block reply Calumet57 9 points 5 days ago Do not be forlorn! There is WIC. In December 2000, the White House issued an executive memorandum authorizing the WIC program to begin screening clients for childhood immunization status. The motivation for this was that WIC had the access to the greatest number of low-income children and thus had the greatest potential for helping immunization rates. They also directed that immunization screening and referral become a standard part of WIC certification. It mentioned that the new WIC minimum immunization screening and referral is only for use in the WIC program. Across WIC programs, it has become standardized as an accurate, efficient and appropriate screening and referral process. WIC state and local agencies must coordinate with the providers of immunization screening. Bill Clinton's final weeks in office  EO. https://en.wikipedia.org/wiki/WIC_program#History permalink award report block reply crashdaddy 7 points 4 days ago Seems like a lot of work for a skit, but she might get some offers. permalink award report block reply Powhattan 4 points 4 days ago Bitches ain’t shit but hoes and tricks. Lick on these nuts and suck that dick. permalink parent award report block reply CasuallyObservant 4 points 4 days ago Looks like he's spent enough on those bouncing bullets on her chest, her lashes, nails, Brazilian Butt lift and weave, not to mention that spacious house she lives in.   And, I bet he knows those kids are not his. permalink award report block reply okboomer59 5 points 4 days ago The mop bucket and traffic cone make me suspect this is some kind of building lobby. permalink parent award report block reply FireTheCannons1776 4 points 4 days ago TV studio.  The producers in a corner, sets, dressing room, green room.  Real House Wives of Ghettoville, maybe? permalink parent award report block reply presticus 3 points 4 days ago From what i read the ex was the stepfather, of course he wouldn't be on the hook for child support. permalink award report block reply TrumpVoter1 1 points 4 days ago Still funny she thought she would get support. permalink parent award report block reply TearsAficionado 2 points 4 days ago Monkeys gonna monk permalink award report block reply kornesque 2 points 4 days ago Disgusting. permalink award report block reply Ice_Joker 2 points 4 days ago That's easy: Give him the children. permalink award report block reply AgnesDomini 1 points 4 days ago Seems suss. permalink award report block reply YaharaRiver 1 points 4 days ago Muslim ex-husband. Explains everything, esp the thrill of being rid of him. permalink award report block reply TheGoyimWhisperer 2 points 4 days ago Comment removed upon the user being banned. permalink award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nWeaponizedSmirk 45 points 4 days ago If you think she's actually on the phone with someone and didn't know all of this before she started recording, you are a fucking retard. permalink award report block reply patrioticwinning3 16 points 4 days ago Seems fake and ghey... permalink parent award report block reply trumpORbust 5 points 4 days ago As is everything permalink parent award report block reply HockeyMom4Trump 4 points 4 days ago Yep. Rage bait. permalink parent award report block reply\npatrioticwinning3 16 points 4 days ago Seems fake and ghey... permalink parent award report block reply trumpORbust 5 points 4 days ago As is everything permalink parent award report block reply\ntrumpORbust 5 points 4 days ago As is everything permalink parent award report block reply\nHockeyMom4Trump 4 points 4 days ago Yep. Rage bait. permalink parent award report block reply\nElevenMile 25 points 5 days ago \"Im officially primary custodian of the kids!  ... What?! I have to take care of them?! This is FUCKED UP!\" permalink award report block reply\nColonelKlink 22 points 5 days ago Were the kids not his? permalink award report block reply Meister_Bockmist 25 points 4 days ago At this point, we're not even sure if the kids are really hers. permalink parent award report block reply Powhattan 3 points 4 days ago Does she even have kids? permalink parent award report block reply AutPaxAutBellum300 2 points 4 days ago She probably has several, started when she was 13 permalink parent award report block reply EDDIT_IS_CUCKED 1 points 4 days ago But I'm sure she started practicing even earlier and with multiple partners. permalink parent award report block reply\nMeister_Bockmist 25 points 4 days ago At this point, we're not even sure if the kids are really hers. permalink parent award report block reply Powhattan 3 points 4 days ago Does she even have kids? permalink parent award report block reply AutPaxAutBellum300 2 points 4 days ago She probably has several, started when she was 13 permalink parent award report block reply EDDIT_IS_CUCKED 1 points 4 days ago But I'm sure she started practicing even earlier and with multiple partners. permalink parent award report block reply\nPowhattan 3 points 4 days ago Does she even have kids? permalink parent award report block reply AutPaxAutBellum300 2 points 4 days ago She probably has several, started when she was 13 permalink parent award report block reply EDDIT_IS_CUCKED 1 points 4 days ago But I'm sure she started practicing even earlier and with multiple partners. permalink parent award report block reply\nAutPaxAutBellum300 2 points 4 days ago She probably has several, started when she was 13 permalink parent award report block reply EDDIT_IS_CUCKED 1 points 4 days ago But I'm sure she started practicing even earlier and with multiple partners. permalink parent award report block reply\nEDDIT_IS_CUCKED 1 points 4 days ago But I'm sure she started practicing even earlier and with multiple partners. permalink parent award report block reply\nCalumet57 9 points 5 days ago Do not be forlorn! There is WIC. In December 2000, the White House issued an executive memorandum authorizing the WIC program to begin screening clients for childhood immunization status. The motivation for this was that WIC had the access to the greatest number of low-income children and thus had the greatest potential for helping immunization rates. They also directed that immunization screening and referral become a standard part of WIC certification. It mentioned that the new WIC minimum immunization screening and referral is only for use in the WIC program. Across WIC programs, it has become standardized as an accurate, efficient and appropriate screening and referral process. WIC state and local agencies must coordinate with the providers of immunization screening. Bill Clinton's final weeks in office  EO. https://en.wikipedia.org/wiki/WIC_program#History permalink award report block reply\ncrashdaddy 7 points 4 days ago Seems like a lot of work for a skit, but she might get some offers. permalink award report block reply Powhattan 4 points 4 days ago Bitches ain’t shit but hoes and tricks. Lick on these nuts and suck that dick. permalink parent award report block reply\nPowhattan 4 points 4 days ago Bitches ain’t shit but hoes and tricks. Lick on these nuts and suck that dick. permalink parent award report block reply\nCasuallyObservant 4 points 4 days ago Looks like he's spent enough on those bouncing bullets on her chest, her lashes, nails, Brazilian Butt lift and weave, not to mention that spacious house she lives in.   And, I bet he knows those kids are not his. permalink award report block reply okboomer59 5 points 4 days ago The mop bucket and traffic cone make me suspect this is some kind of building lobby. permalink parent award report block reply FireTheCannons1776 4 points 4 days ago TV studio.  The producers in a corner, sets, dressing room, green room.  Real House Wives of Ghettoville, maybe? permalink parent award report block reply\nokboomer59 5 points 4 days ago The mop bucket and traffic cone make me suspect this is some kind of building lobby. permalink parent award report block reply FireTheCannons1776 4 points 4 days ago TV studio.  The producers in a corner, sets, dressing room, green room.  Real House Wives of Ghettoville, maybe? permalink parent award report block reply\nFireTheCannons1776 4 points 4 days ago TV studio.  The producers in a corner, sets, dressing room, green room.  Real House Wives of Ghettoville, maybe? permalink parent award report block reply\npresticus 3 points 4 days ago From what i read the ex was the stepfather, of course he wouldn't be on the hook for child support. permalink award report block reply TrumpVoter1 1 points 4 days ago Still funny she thought she would get support. permalink parent award report block reply\nTrumpVoter1 1 points 4 days ago Still funny she thought she would get support. permalink parent award report block reply\nTearsAficionado 2 points 4 days ago Monkeys gonna monk permalink award report block reply\nkornesque 2 points 4 days ago Disgusting. permalink award report block reply\nIce_Joker 2 points 4 days ago That's easy: Give him the children. permalink award report block reply\nAgnesDomini 1 points 4 days ago Seems suss. permalink award report block reply\nYaharaRiver 1 points 4 days ago Muslim ex-husband. Explains everything, esp the thrill of being rid of him. permalink award report block reply\nTheGoyimWhisperer 2 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:18:07.426714Z"
}