{
  "id": "8175811",
  "title": "1408Communists Then And Nowposted4 days agobyhecubus68 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK56keqf/communists-then-and-now/c",
  "content": "1408 Communists Then And Now posted 4 days ago by hecubus 68 comments award share download report block\n68 comments Sort by Top Top New Worst Old Save loosemoose 79 points 4 days ago They have always been gay. permalink award report block reply HuggableBear 30 points 4 days ago Marx was just Engels' \"friend\" who lived in his house and didn't pay any bills. Totally not his fuck toy. permalink parent award report block reply Prussian_Pepe 25 points 4 days ago He was covered in boils, and impregnated the help, then disowned the babies he spawned. But I mean he was a goblin spawn married into Rothschild blood. So I'm sure he swung whatever way he needed to as his satan worshiping ways demanded. permalink parent award report block reply chickeninoven 5 points 4 days ago He came from a very long line of prominent rabbis. Oh wait, you did say goblin spawn. My bad. permalink parent award report block reply Error404 1 points 4 days ago In some respects, aren't they the same thing? permalink parent award report block reply Nomad899 1 points 4 days ago Monkey pox before it became a thing permalink parent award report block reply The_Return_of_User_x 12 points 4 days ago Its the failsafe. The always engineer the dangerous viruses to not reproduce. permalink parent award report block reply TheOneWhoKnocks 8 points 4 days ago The leaders of communism are always weak little bitches. The problem is that they weasel their way into the positions of power when things are good and normal and, for some fucking reason, stronger men than they are then take them seriously. Look at the cops that we know will simply follow the orders to arrest or even kill regular citizens. The average cop could break the average commie bitch in half, but they'll still take orders from them. The most important lesson for humanity, that we keep learning the hard way and then forgetting as soon as things get easy, is that you never let weak bitches get into positions of power or authority. But all we have now is weak bitches in control. permalink parent award report block reply sordfysh PRO 1 points 4 days ago Even the East German Stasi was well known to be full of gays. They actually recruited the gays by threatening to out them if they didn't work for the Stasi and they rewarded their loyal gays with hedonism. This is how they even got Western Europeans to join the Stasi. permalink parent award report block reply Be_The_Change 0 points 4 days ago Why nominate a Communist for Secretary of Treasury? permalink parent award report block reply MillionsAndMillions 27 points 4 days ago Back then, people had no data about communism. No results. We now have 200 years of data and they are still not learning. Communism has a success rate of zero percent. permalink award report block reply MrCuriousGuy513 17 points 4 days ago Disagree, we have more history on Communism if you’ve read The Bible or simply studied ancient cultures.\nThe same exact thing happens, thus one of Communism distinct features is always the targeting and elimination of old people first.\nWhy? It isn’t because Old people are virtuous but the fact they can say “We’ve tried it before, it doesn’t work.”\nNotice, how it’s always sold to the youth in marketing campaigns.\n“This time is different…” permalink parent award report block reply Prussian_Pepe 9 points 4 days ago Correct. It's always been satanic. It took the idea of Jesus telling you to care for others. And twisted it into a scheme to get plebs to destroy the government with the enteral carrot on the stick (\"we just haven't gotten there yet, looks like the government will just have to keep unlimited control until everyone is equal\"). And then once they displace the government the elite locus come in, take over and steal everything and starve the people to death. It's goal was always to deceive. To lure emotionally thinking people into falling in a trap about \"caring for others\". But it's really about playing them like a fiddle and putting a bullet through their head after they have been used like a cheap whore. permalink parent award report block reply MrCuriousGuy513 3 points 4 days ago Exactly, your whole post. permalink parent award report block reply Error404 1 points 4 days ago The people that wanted to destroy Jesus... are you saying they're still doing the very same thing today?  Am I noticing it correctly? permalink parent award report block reply deeluna 3 points 4 days ago When the pilgrams landed in America, the first couple years were harsh, why? It wasn't the land, it was fertile. It was that they were trying to take communistic/socialistic control over the crops grown and they were discovering that everyone was functionally doing the bare minimum to make what was expected of them since everything they grew was taken away from them and redistributed. After several years of suffering, they decided to follow the natives example and drop the socialistic methods grow what was needed for each family and then trade the excess. There's more to that story but that's the short version of it. permalink parent award report block reply CommonSenseAmerican 2 points 4 days ago They succeed at being a subservient cheap workforce to Capitalists like China are with the USA. permalink parent award report block reply NerdRage 1 points 4 days ago they are still not learning They don't want to learn. There's plenty of data available and they'd rather turn their eyes away. Lefties would rather be seduced by a beautiful lie than to face the realities of an ugly truth. permalink parent award report block reply GoneViking 1 points 4 days ago Depends on what you see as success. Communism has a very high success rate for those in control. Death and misery for everyone else IS success to them. permalink parent award report block reply ApplyingForce 1 points 4 days ago socialism is not new or post American. Socialism pre existed America and our power structure of private property and jointly owned public property was determined superior. permalink parent award report block reply Cubey 13 points 4 days ago Nothing ever changes, from 14th century adamites in Bohemia to the useless fools of today. permalink award report block reply Retard_Strength 12 points 4 days ago Gay… Gay never changes permalink parent award report block reply TheRedPike 2 points 4 days ago They will do anything to defend what they do with their buttholes.  And they see no shame in that. permalink parent award report block reply snoopy3210 2 points 4 days ago Smelly permalink parent award report block reply Michalusmichalus 13 points 4 days ago This is why history was removed from schools. So it can be repeated. permalink award report block reply XxxRDTPRNxxX 9 points 4 days ago Add \"race traitor\". permalink award report block reply tarballs 5 points 4 days ago I gave you le upvote but, in my limited experience hanging out with genz, the nonjewish lefties tend to be the ones keeping it White with actual hairstyles and not broccoli. The world is full of irony and \"conservative\" women mixing it up is one of them. permalink parent award report block reply learntocode 9 points 4 days ago Communists are simply one edge of the same weapon, with the British \"free-trade\" system as the other edge. Both are \"oppossed\" to the other  but in reality both centralize control in the hands of unelected technocrats. Communism is used to suppress and destroy and \"free markets\" are used to extract and divide. There is an alternative - the American System as developed by Alexander Hamilton, used by Lincoln, McKinley and now Trump (he is trying to get it started again). Communism was funded and supported by the same people that developed the \"free-trade\" system. They are the same system. The American System stands apart, and is a viable alternative. permalink award report block reply Mortal_Wombat 6 points 4 days ago Moving up in the world Going down on the world. permalink award report block reply MrCuriousGuy513 0 points 4 days ago Is that a sex joke? I think they would say that was the intent along. permalink parent award report block reply kwakkles 5 points 4 days ago The goal of socialism is communism. permalink award report block reply Calumet57 4 points 4 days ago Closeted - Gay permalink award report block reply tribunabessica 3 points 4 days ago In Marx's defense, he advocated for wealth redistribution from capitalists to the working class, and never from the middle class TO THE NEVER-WORKED-IN-THEIR-ENTIRE-LIVES PARASITIC CLASS, and their gay trans leaders. permalink award report block reply Error404 1 points 4 days ago The issue today is that capitalists/the extremely filthy rich have manipulated the system.. it's completely cancerous.  It'll be interesting to see how the use bitcoin strategic reserves can be a vehicle to decouple us from the cancer.. letting the cancer die out, while also not destroying the dollar.  Gonna be a bumpy ride. permalink parent award report block reply Tyrant37 1 points 4 days ago Issue new reserve currency...rip the bandaid off all at once and be done with the parasites. permalink parent award report block reply Spellmonger 3 points 4 days ago Broke, entitled, Lazy, Narcissistic, sociopathic, mass starvation, gay. During the hight of Covid someone observed the behavior of some of our population and made a diagnosis of \" Mass _ ? psychosis .  That diagnosis sent the powers that be, and people with TDS, into a tizzy, and it got memory-holed. Feb 26, 2021 — A mass psychosis is an epidemic of madness, and it occurs when a large portion of a society loses touch with reality and descends into delusions. While I was searching for the middle word in that diagnosis, look at what I found over on PubMed Central (PMC) in just a few minutes - but I never found the middle word - does anyone remember the exact term? Viral respiratory infections and psychosis: A review of the literature and the implications of COVID-19 https://pmc.ncbi.nlm.nih.gov/articles/PMC9616688/#:~:text=Several%20human%20coronaviruses%20(HCoVs)%20have,to%20those%20of%20other%20HCoVs . - and - Psychosis during the COVID-19 pandemic: A systematic review of case reports and case series https://pmc.ncbi.nlm.nih.gov/articles/PMC9248300/ - and - COVID-19 and New-Onset Psychosis: A Comprehensive Review https://pmc.ncbi.nlm.nih.gov/articles/PMC9865730/#:~:text=The%20majority%20of%20patients%20had,the%20most%20common%20psychotic%20symptoms . permalink award report block reply Error404 2 points 4 days ago Mattias Desmet.  He's the one that created the term \"mass formation\" permalink parent award report block reply Tyrant37 2 points 4 days ago https://youtu.be/TCaGA-1neoI?si=KHIC6NoazD1jfT5b permalink parent award report block reply Crappydatum 2 points 4 days ago You're looking for Mass Formation Psychosis I believe permalink parent award report block reply Error404 2 points 4 days ago Mattias Desmet coined the term \"mass formation\".  It went pretty viral right away.. kind of telephone-game turned into 'mass formation psychosis' permalink parent award report block reply BoricuaPede 3 points 4 days ago Karl Marx had a string of male lovers, including Engels. You ever wonder why Engels paid all his bills for decades? permalink award report block reply kristal 3 points 4 days ago Dirty communists are so cheap they only buy IittIe hats. permalink award report block reply PatriotSkorzeny 2 points 4 days ago They have badges and QI. permalink award report block reply Dudemanfoo 2 points 4 days ago Somebody left gay off of the left side list by mistake permalink award report block reply highenergywinning 2 points 4 days ago You forgot trans permalink award report block reply ingrowntoenail 1 points 4 days ago Add trans to the Now side. permalink award report block reply Givesgunstogrannies 1 points 4 days ago 🤣 This is great permalink award report block reply ChilledCovfefe 1 points 4 days ago Need to add crossdressers!\nHonestly though I think a lot of them were gay back in the old days too. permalink award report block reply SuperHonkey 1 points 4 days ago And FUGLY permalink award report block reply MocksFordComma 1 points 4 days ago You can add \"prob gay\" to the left column. permalink award report block reply jiujiujiu 1 points 4 days ago An entire philosophy built on envy permalink award report block reply Samsonlike 1 points 4 days ago Jewish.  You forgot Jewish. permalink award report block reply mohel 1 points 4 days ago Communism with tits permalink award report block reply RadicalCovfefe 1 points 4 days ago I want Marx to die again permalink award report block reply Pappy_Gunn 1 points 4 days ago Don't forget banging his maid. permalink award report block reply AlohaSnackbar 1 points 4 days ago Everyone is mistaken about communism/socialism failing.  It works perfectly, every single time.  It works amazingly well, better than any other system really, when it comes to separating the elite from the undesirables and quickly turning the undesirables into slaves and/or fertilizer. permalink award report block reply Maga305_47 1 points 4 days ago Che Guevara and deviant flag permalink award report block reply Kilroy 1 points 4 days ago Actually, the Communist have used the perversion of sexual identity since day one, it's just not widespread public knowledge of it. permalink award report block reply Rock9Head 1 points 4 days ago Marx was a flamer. permalink award report block reply hamajun 1 points 4 days ago and Pedophile too permalink award report block reply Bonusjohn28 0 points 4 days ago Turbo gay permalink award report block reply lispboy 0 points 4 days ago They were gay then too, just not so outwardly. permalink award report block reply Tao_Pai 0 points 4 days ago …and retarded. permalink award report block reply TheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply CocaineNewsome 1 points 4 days ago Comment removed by community filter, pending further review. permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nloosemoose 79 points 4 days ago They have always been gay. permalink award report block reply HuggableBear 30 points 4 days ago Marx was just Engels' \"friend\" who lived in his house and didn't pay any bills. Totally not his fuck toy. permalink parent award report block reply Prussian_Pepe 25 points 4 days ago He was covered in boils, and impregnated the help, then disowned the babies he spawned. But I mean he was a goblin spawn married into Rothschild blood. So I'm sure he swung whatever way he needed to as his satan worshiping ways demanded. permalink parent award report block reply chickeninoven 5 points 4 days ago He came from a very long line of prominent rabbis. Oh wait, you did say goblin spawn. My bad. permalink parent award report block reply Error404 1 points 4 days ago In some respects, aren't they the same thing? permalink parent award report block reply Nomad899 1 points 4 days ago Monkey pox before it became a thing permalink parent award report block reply The_Return_of_User_x 12 points 4 days ago Its the failsafe. The always engineer the dangerous viruses to not reproduce. permalink parent award report block reply TheOneWhoKnocks 8 points 4 days ago The leaders of communism are always weak little bitches. The problem is that they weasel their way into the positions of power when things are good and normal and, for some fucking reason, stronger men than they are then take them seriously. Look at the cops that we know will simply follow the orders to arrest or even kill regular citizens. The average cop could break the average commie bitch in half, but they'll still take orders from them. The most important lesson for humanity, that we keep learning the hard way and then forgetting as soon as things get easy, is that you never let weak bitches get into positions of power or authority. But all we have now is weak bitches in control. permalink parent award report block reply sordfysh PRO 1 points 4 days ago Even the East German Stasi was well known to be full of gays. They actually recruited the gays by threatening to out them if they didn't work for the Stasi and they rewarded their loyal gays with hedonism. This is how they even got Western Europeans to join the Stasi. permalink parent award report block reply Be_The_Change 0 points 4 days ago Why nominate a Communist for Secretary of Treasury? permalink parent award report block reply\nHuggableBear 30 points 4 days ago Marx was just Engels' \"friend\" who lived in his house and didn't pay any bills. Totally not his fuck toy. permalink parent award report block reply Prussian_Pepe 25 points 4 days ago He was covered in boils, and impregnated the help, then disowned the babies he spawned. But I mean he was a goblin spawn married into Rothschild blood. So I'm sure he swung whatever way he needed to as his satan worshiping ways demanded. permalink parent award report block reply chickeninoven 5 points 4 days ago He came from a very long line of prominent rabbis. Oh wait, you did say goblin spawn. My bad. permalink parent award report block reply Error404 1 points 4 days ago In some respects, aren't they the same thing? permalink parent award report block reply Nomad899 1 points 4 days ago Monkey pox before it became a thing permalink parent award report block reply\nPrussian_Pepe 25 points 4 days ago He was covered in boils, and impregnated the help, then disowned the babies he spawned. But I mean he was a goblin spawn married into Rothschild blood. So I'm sure he swung whatever way he needed to as his satan worshiping ways demanded. permalink parent award report block reply chickeninoven 5 points 4 days ago He came from a very long line of prominent rabbis. Oh wait, you did say goblin spawn. My bad. permalink parent award report block reply Error404 1 points 4 days ago In some respects, aren't they the same thing? permalink parent award report block reply Nomad899 1 points 4 days ago Monkey pox before it became a thing permalink parent award report block reply\nchickeninoven 5 points 4 days ago He came from a very long line of prominent rabbis. Oh wait, you did say goblin spawn. My bad. permalink parent award report block reply Error404 1 points 4 days ago In some respects, aren't they the same thing? permalink parent award report block reply\nError404 1 points 4 days ago In some respects, aren't they the same thing? permalink parent award report block reply\nNomad899 1 points 4 days ago Monkey pox before it became a thing permalink parent award report block reply\nThe_Return_of_User_x 12 points 4 days ago Its the failsafe. The always engineer the dangerous viruses to not reproduce. permalink parent award report block reply\nTheOneWhoKnocks 8 points 4 days ago The leaders of communism are always weak little bitches. The problem is that they weasel their way into the positions of power when things are good and normal and, for some fucking reason, stronger men than they are then take them seriously. Look at the cops that we know will simply follow the orders to arrest or even kill regular citizens. The average cop could break the average commie bitch in half, but they'll still take orders from them. The most important lesson for humanity, that we keep learning the hard way and then forgetting as soon as things get easy, is that you never let weak bitches get into positions of power or authority. But all we have now is weak bitches in control. permalink parent award report block reply\nsordfysh PRO 1 points 4 days ago Even the East German Stasi was well known to be full of gays. They actually recruited the gays by threatening to out them if they didn't work for the Stasi and they rewarded their loyal gays with hedonism. This is how they even got Western Europeans to join the Stasi. permalink parent award report block reply\nBe_The_Change 0 points 4 days ago Why nominate a Communist for Secretary of Treasury? permalink parent award report block reply\nMillionsAndMillions 27 points 4 days ago Back then, people had no data about communism. No results. We now have 200 years of data and they are still not learning. Communism has a success rate of zero percent. permalink award report block reply MrCuriousGuy513 17 points 4 days ago Disagree, we have more history on Communism if you’ve read The Bible or simply studied ancient cultures.\nThe same exact thing happens, thus one of Communism distinct features is always the targeting and elimination of old people first.\nWhy? It isn’t because Old people are virtuous but the fact they can say “We’ve tried it before, it doesn’t work.”\nNotice, how it’s always sold to the youth in marketing campaigns.\n“This time is different…” permalink parent award report block reply Prussian_Pepe 9 points 4 days ago Correct. It's always been satanic. It took the idea of Jesus telling you to care for others. And twisted it into a scheme to get plebs to destroy the government with the enteral carrot on the stick (\"we just haven't gotten there yet, looks like the government will just have to keep unlimited control until everyone is equal\"). And then once they displace the government the elite locus come in, take over and steal everything and starve the people to death. It's goal was always to deceive. To lure emotionally thinking people into falling in a trap about \"caring for others\". But it's really about playing them like a fiddle and putting a bullet through their head after they have been used like a cheap whore. permalink parent award report block reply MrCuriousGuy513 3 points 4 days ago Exactly, your whole post. permalink parent award report block reply Error404 1 points 4 days ago The people that wanted to destroy Jesus... are you saying they're still doing the very same thing today?  Am I noticing it correctly? permalink parent award report block reply deeluna 3 points 4 days ago When the pilgrams landed in America, the first couple years were harsh, why? It wasn't the land, it was fertile. It was that they were trying to take communistic/socialistic control over the crops grown and they were discovering that everyone was functionally doing the bare minimum to make what was expected of them since everything they grew was taken away from them and redistributed. After several years of suffering, they decided to follow the natives example and drop the socialistic methods grow what was needed for each family and then trade the excess. There's more to that story but that's the short version of it. permalink parent award report block reply CommonSenseAmerican 2 points 4 days ago They succeed at being a subservient cheap workforce to Capitalists like China are with the USA. permalink parent award report block reply NerdRage 1 points 4 days ago they are still not learning They don't want to learn. There's plenty of data available and they'd rather turn their eyes away. Lefties would rather be seduced by a beautiful lie than to face the realities of an ugly truth. permalink parent award report block reply GoneViking 1 points 4 days ago Depends on what you see as success. Communism has a very high success rate for those in control. Death and misery for everyone else IS success to them. permalink parent award report block reply ApplyingForce 1 points 4 days ago socialism is not new or post American. Socialism pre existed America and our power structure of private property and jointly owned public property was determined superior. permalink parent award report block reply\nMrCuriousGuy513 17 points 4 days ago Disagree, we have more history on Communism if you’ve read The Bible or simply studied ancient cultures.\nThe same exact thing happens, thus one of Communism distinct features is always the targeting and elimination of old people first.\nWhy? It isn’t because Old people are virtuous but the fact they can say “We’ve tried it before, it doesn’t work.”\nNotice, how it’s always sold to the youth in marketing campaigns.\n“This time is different…” permalink parent award report block reply Prussian_Pepe 9 points 4 days ago Correct. It's always been satanic. It took the idea of Jesus telling you to care for others. And twisted it into a scheme to get plebs to destroy the government with the enteral carrot on the stick (\"we just haven't gotten there yet, looks like the government will just have to keep unlimited control until everyone is equal\"). And then once they displace the government the elite locus come in, take over and steal everything and starve the people to death. It's goal was always to deceive. To lure emotionally thinking people into falling in a trap about \"caring for others\". But it's really about playing them like a fiddle and putting a bullet through their head after they have been used like a cheap whore. permalink parent award report block reply MrCuriousGuy513 3 points 4 days ago Exactly, your whole post. permalink parent award report block reply Error404 1 points 4 days ago The people that wanted to destroy Jesus... are you saying they're still doing the very same thing today?  Am I noticing it correctly? permalink parent award report block reply deeluna 3 points 4 days ago When the pilgrams landed in America, the first couple years were harsh, why? It wasn't the land, it was fertile. It was that they were trying to take communistic/socialistic control over the crops grown and they were discovering that everyone was functionally doing the bare minimum to make what was expected of them since everything they grew was taken away from them and redistributed. After several years of suffering, they decided to follow the natives example and drop the socialistic methods grow what was needed for each family and then trade the excess. There's more to that story but that's the short version of it. permalink parent award report block reply\nPrussian_Pepe 9 points 4 days ago Correct. It's always been satanic. It took the idea of Jesus telling you to care for others. And twisted it into a scheme to get plebs to destroy the government with the enteral carrot on the stick (\"we just haven't gotten there yet, looks like the government will just have to keep unlimited control until everyone is equal\"). And then once they displace the government the elite locus come in, take over and steal everything and starve the people to death. It's goal was always to deceive. To lure emotionally thinking people into falling in a trap about \"caring for others\". But it's really about playing them like a fiddle and putting a bullet through their head after they have been used like a cheap whore. permalink parent award report block reply MrCuriousGuy513 3 points 4 days ago Exactly, your whole post. permalink parent award report block reply Error404 1 points 4 days ago The people that wanted to destroy Jesus... are you saying they're still doing the very same thing today?  Am I noticing it correctly? permalink parent award report block reply\nMrCuriousGuy513 3 points 4 days ago Exactly, your whole post. permalink parent award report block reply\nError404 1 points 4 days ago The people that wanted to destroy Jesus... are you saying they're still doing the very same thing today?  Am I noticing it correctly? permalink parent award report block reply\ndeeluna 3 points 4 days ago When the pilgrams landed in America, the first couple years were harsh, why? It wasn't the land, it was fertile. It was that they were trying to take communistic/socialistic control over the crops grown and they were discovering that everyone was functionally doing the bare minimum to make what was expected of them since everything they grew was taken away from them and redistributed. After several years of suffering, they decided to follow the natives example and drop the socialistic methods grow what was needed for each family and then trade the excess. There's more to that story but that's the short version of it. permalink parent award report block reply\nCommonSenseAmerican 2 points 4 days ago They succeed at being a subservient cheap workforce to Capitalists like China are with the USA. permalink parent award report block reply\nNerdRage 1 points 4 days ago they are still not learning They don't want to learn. There's plenty of data available and they'd rather turn their eyes away. Lefties would rather be seduced by a beautiful lie than to face the realities of an ugly truth. permalink parent award report block reply\nGoneViking 1 points 4 days ago Depends on what you see as success. Communism has a very high success rate for those in control. Death and misery for everyone else IS success to them. permalink parent award report block reply\nApplyingForce 1 points 4 days ago socialism is not new or post American. Socialism pre existed America and our power structure of private property and jointly owned public property was determined superior. permalink parent award report block reply\nCubey 13 points 4 days ago Nothing ever changes, from 14th century adamites in Bohemia to the useless fools of today. permalink award report block reply Retard_Strength 12 points 4 days ago Gay… Gay never changes permalink parent award report block reply TheRedPike 2 points 4 days ago They will do anything to defend what they do with their buttholes.  And they see no shame in that. permalink parent award report block reply snoopy3210 2 points 4 days ago Smelly permalink parent award report block reply\nRetard_Strength 12 points 4 days ago Gay… Gay never changes permalink parent award report block reply\nTheRedPike 2 points 4 days ago They will do anything to defend what they do with their buttholes.  And they see no shame in that. permalink parent award report block reply\nsnoopy3210 2 points 4 days ago Smelly permalink parent award report block reply\nMichalusmichalus 13 points 4 days ago This is why history was removed from schools. So it can be repeated. permalink award report block reply\nXxxRDTPRNxxX 9 points 4 days ago Add \"race traitor\". permalink award report block reply tarballs 5 points 4 days ago I gave you le upvote but, in my limited experience hanging out with genz, the nonjewish lefties tend to be the ones keeping it White with actual hairstyles and not broccoli. The world is full of irony and \"conservative\" women mixing it up is one of them. permalink parent award report block reply\ntarballs 5 points 4 days ago I gave you le upvote but, in my limited experience hanging out with genz, the nonjewish lefties tend to be the ones keeping it White with actual hairstyles and not broccoli. The world is full of irony and \"conservative\" women mixing it up is one of them. permalink parent award report block reply\nlearntocode 9 points 4 days ago Communists are simply one edge of the same weapon, with the British \"free-trade\" system as the other edge. Both are \"oppossed\" to the other  but in reality both centralize control in the hands of unelected technocrats. Communism is used to suppress and destroy and \"free markets\" are used to extract and divide. There is an alternative - the American System as developed by Alexander Hamilton, used by Lincoln, McKinley and now Trump (he is trying to get it started again). Communism was funded and supported by the same people that developed the \"free-trade\" system. They are the same system. The American System stands apart, and is a viable alternative. permalink award report block reply\nMortal_Wombat 6 points 4 days ago Moving up in the world Going down on the world. permalink award report block reply MrCuriousGuy513 0 points 4 days ago Is that a sex joke? I think they would say that was the intent along. permalink parent award report block reply\nMrCuriousGuy513 0 points 4 days ago Is that a sex joke? I think they would say that was the intent along. permalink parent award report block reply\nkwakkles 5 points 4 days ago The goal of socialism is communism. permalink award report block reply\nCalumet57 4 points 4 days ago Closeted - Gay permalink award report block reply\ntribunabessica 3 points 4 days ago In Marx's defense, he advocated for wealth redistribution from capitalists to the working class, and never from the middle class TO THE NEVER-WORKED-IN-THEIR-ENTIRE-LIVES PARASITIC CLASS, and their gay trans leaders. permalink award report block reply Error404 1 points 4 days ago The issue today is that capitalists/the extremely filthy rich have manipulated the system.. it's completely cancerous.  It'll be interesting to see how the use bitcoin strategic reserves can be a vehicle to decouple us from the cancer.. letting the cancer die out, while also not destroying the dollar.  Gonna be a bumpy ride. permalink parent award report block reply Tyrant37 1 points 4 days ago Issue new reserve currency...rip the bandaid off all at once and be done with the parasites. permalink parent award report block reply\nError404 1 points 4 days ago The issue today is that capitalists/the extremely filthy rich have manipulated the system.. it's completely cancerous.  It'll be interesting to see how the use bitcoin strategic reserves can be a vehicle to decouple us from the cancer.. letting the cancer die out, while also not destroying the dollar.  Gonna be a bumpy ride. permalink parent award report block reply Tyrant37 1 points 4 days ago Issue new reserve currency...rip the bandaid off all at once and be done with the parasites. permalink parent award report block reply\nTyrant37 1 points 4 days ago Issue new reserve currency...rip the bandaid off all at once and be done with the parasites. permalink parent award report block reply\nSpellmonger 3 points 4 days ago Broke, entitled, Lazy, Narcissistic, sociopathic, mass starvation, gay. During the hight of Covid someone observed the behavior of some of our population and made a diagnosis of \" Mass _ ? psychosis .  That diagnosis sent the powers that be, and people with TDS, into a tizzy, and it got memory-holed. Feb 26, 2021 — A mass psychosis is an epidemic of madness, and it occurs when a large portion of a society loses touch with reality and descends into delusions. While I was searching for the middle word in that diagnosis, look at what I found over on PubMed Central (PMC) in just a few minutes - but I never found the middle word - does anyone remember the exact term? Viral respiratory infections and psychosis: A review of the literature and the implications of COVID-19 https://pmc.ncbi.nlm.nih.gov/articles/PMC9616688/#:~:text=Several%20human%20coronaviruses%20(HCoVs)%20have,to%20those%20of%20other%20HCoVs . - and - Psychosis during the COVID-19 pandemic: A systematic review of case reports and case series https://pmc.ncbi.nlm.nih.gov/articles/PMC9248300/ - and - COVID-19 and New-Onset Psychosis: A Comprehensive Review https://pmc.ncbi.nlm.nih.gov/articles/PMC9865730/#:~:text=The%20majority%20of%20patients%20had,the%20most%20common%20psychotic%20symptoms . permalink award report block reply Error404 2 points 4 days ago Mattias Desmet.  He's the one that created the term \"mass formation\" permalink parent award report block reply Tyrant37 2 points 4 days ago https://youtu.be/TCaGA-1neoI?si=KHIC6NoazD1jfT5b permalink parent award report block reply Crappydatum 2 points 4 days ago You're looking for Mass Formation Psychosis I believe permalink parent award report block reply Error404 2 points 4 days ago Mattias Desmet coined the term \"mass formation\".  It went pretty viral right away.. kind of telephone-game turned into 'mass formation psychosis' permalink parent award report block reply\nError404 2 points 4 days ago Mattias Desmet.  He's the one that created the term \"mass formation\" permalink parent award report block reply\nTyrant37 2 points 4 days ago https://youtu.be/TCaGA-1neoI?si=KHIC6NoazD1jfT5b permalink parent award report block reply\nCrappydatum 2 points 4 days ago You're looking for Mass Formation Psychosis I believe permalink parent award report block reply Error404 2 points 4 days ago Mattias Desmet coined the term \"mass formation\".  It went pretty viral right away.. kind of telephone-game turned into 'mass formation psychosis' permalink parent award report block reply\nError404 2 points 4 days ago Mattias Desmet coined the term \"mass formation\".  It went pretty viral right away.. kind of telephone-game turned into 'mass formation psychosis' permalink parent award report block reply\nBoricuaPede 3 points 4 days ago Karl Marx had a string of male lovers, including Engels. You ever wonder why Engels paid all his bills for decades? permalink award report block reply\nkristal 3 points 4 days ago Dirty communists are so cheap they only buy IittIe hats. permalink award report block reply\nPatriotSkorzeny 2 points 4 days ago They have badges and QI. permalink award report block reply\nDudemanfoo 2 points 4 days ago Somebody left gay off of the left side list by mistake permalink award report block reply\nhighenergywinning 2 points 4 days ago You forgot trans permalink award report block reply\ningrowntoenail 1 points 4 days ago Add trans to the Now side. permalink award report block reply\nGivesgunstogrannies 1 points 4 days ago 🤣 This is great permalink award report block reply\nChilledCovfefe 1 points 4 days ago Need to add crossdressers!\nHonestly though I think a lot of them were gay back in the old days too. permalink award report block reply\nSuperHonkey 1 points 4 days ago And FUGLY permalink award report block reply\nMocksFordComma 1 points 4 days ago You can add \"prob gay\" to the left column. permalink award report block reply\njiujiujiu 1 points 4 days ago An entire philosophy built on envy permalink award report block reply\nSamsonlike 1 points 4 days ago Jewish.  You forgot Jewish. permalink award report block reply\nmohel 1 points 4 days ago Communism with tits permalink award report block reply\nRadicalCovfefe 1 points 4 days ago I want Marx to die again permalink award report block reply\nPappy_Gunn 1 points 4 days ago Don't forget banging his maid. permalink award report block reply\nAlohaSnackbar 1 points 4 days ago Everyone is mistaken about communism/socialism failing.  It works perfectly, every single time.  It works amazingly well, better than any other system really, when it comes to separating the elite from the undesirables and quickly turning the undesirables into slaves and/or fertilizer. permalink award report block reply\nMaga305_47 1 points 4 days ago Che Guevara and deviant flag permalink award report block reply\nKilroy 1 points 4 days ago Actually, the Communist have used the perversion of sexual identity since day one, it's just not widespread public knowledge of it. permalink award report block reply\nRock9Head 1 points 4 days ago Marx was a flamer. permalink award report block reply\nhamajun 1 points 4 days ago and Pedophile too permalink award report block reply\nBonusjohn28 0 points 4 days ago Turbo gay permalink award report block reply\nlispboy 0 points 4 days ago They were gay then too, just not so outwardly. permalink award report block reply\nTao_Pai 0 points 4 days ago …and retarded. permalink award report block reply\nTheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nCocaineNewsome 1 points 4 days ago Comment removed by community filter, pending further review. permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply"
}