{
  "id": "1ARK9k0AJo",
  "url": "https://patriots.win/p/1ARK9k0AJo/sexual-preferences-and-sexual-fe/c",
  "content": "765 Sexual preferences and sexual fetishes are not the same.  This dike nails it. posted 1 day ago by KuzoKevin 113 comments award share report block Concerned Citizen @BGatesIsaPyscho • 2d “I’m an OG Lesbian” “LGBT Serves a Dark Agenda” “Gay Rights have been hijacked by the TQ+” One of the best take downs of the Marxist Grooming Cult you will ever hear.\n113 comments Sort by Top Top New Worst Old Save Mount_10_ear 55 points 1 day ago No such thing as \" gay rights\"  , its just another form of mental illness .. permalink award report block reply HunterBidensPC 36 points 1 day ago The right to marry other men in the eyes of God is abhorrent. Why should i care that the TQ+ highjacked their movement? It was a degenerate movement based in self interest of course it was doomed to turn into what it is now permalink parent award report block reply ViagraFalls 11 points 1 day ago Well first heterosexuals started having gay sex. Then gay sex became okay to them. What I mean is that sex became for fun and promiscuity abounded like fa66ots do. Any procreation was often an unwanted side effect. permalink parent award report block reply kornesque 5 points 1 day ago This. Notice they started by normalizing birth control. Abhorrent in the eyes of God and the springboard to everything else. Once it became culturally acceptable to view sex as primarily for pleasure rather procreation, then it became an outrage to restrict people who wanted sex for pleasure without procreation for any reason. The TQ+ is just a more positive range on the numberline of degeneracy that LGB already lands on. permalink parent award report block reply sun_wolf 4 points 1 day ago The main difference between straight people and gay people is if a straight dude is a foot fetishist and needs to rub on a foot to get off, he knows that’s a mis-use of the human body for sexual gratification and that if every other human being was like him, no more human beings would be created. Gay people don’t seem capable of this same insight. If you ask a gay person if the world would be better if ALL people were gay, shooting their semen into men’s buttholes or getting screwed by plastic dildos made in China, they would say yes. But that would be the end of human procreation because you can’t make a baby in a man’s butthole and you can’t make a baby from a hunk of rainbow plastic. permalink parent award report block reply view 1 more comments... MAGAMight 9 points 1 day ago Ironic that the degenerates are calling out  degenerates as being too degenerate permalink parent award report block reply Threaper666 3 points 21 hours ago Exactly.  They laid the ground work.  They created the Map.  No pun intended. permalink parent award report block reply HunterBidensPC 2 points 21 hours ago Underrated comment since they literally did create the MAPs permalink parent award report block reply booblitchutz 6 points 1 day ago No such thing as a “lesbian”. Every one I’ve ever met was a woman hurt by men who just noped out of normal relationships as a result. The most honest lesbian I ever met said that it’s all just playing house and partnering with each other for companionship and protection. She said that she has never actually been “attracted” sexually to her “partner”. And that’s true. Women cannot sexually attract each other, it’s a biological impossibility. Men can’t either, but men are driven by the urge to ejaculate which is stronger than the woman’s urge to climax. permalink parent award report block reply sun_wolf 4 points 1 day ago They also repeat the exact same dynamic of heterosexual relationships (one butch, one femme) within their lesbian relationships, which is an obvious giveaway that homosexuality is a fetish, not an identity. They can’t even PRETEND to be gay very well, and their inherent biology still presents itself. permalink parent award report block reply Now_On_to_Mars 2 points 1 day ago Which is ironic cause abusive lesbian relationships are all too common permalink parent award report block reply booblitchutz 3 points 1 day ago Yes, well imagine the frustration of a “marriage” completely void of sexual chemistry, and when you do “have sex” its unsatisfying biologically. After a while it’s hard not to resent your roommate in that scenario. permalink parent award report block reply DManthey 3 points 1 day ago And discrimination. Why do they have more rights than the rest of us? permalink parent award report block reply Dev404 2 points 1 day ago The only thing I can remember that gays were excluded from was the military. However, it's not like they went checking if you were gay by running a complete background check of your sexual history, you could just say you weren't and don't give any obvious signs. Apart from that, I don't recall gays being disallowed from anything by law or policy. The gay rights thing is an exaggerated issue brought on by feminists - again. The entire existence of feminism was unnecessary and was nothing more than the biggest cultural weapon psyop ever created and massively succeeded in demoralizing every country it touched. permalink parent award report block reply vote_for_MAGA_2020 29 points 1 day ago \"gay rights\" should never have been a thing, so whatever she's saying is stupid This is not a \"takedown\" permalink award report block reply KuzoKevin OP 7 points 1 day ago I don't think gays should get special treatment under the guise of \"rights\", but I think they should be left alone. permalink parent award report block reply peterthegreen 30 points 1 day ago They need to leave the kids alone. permalink parent award report block reply airborne3502 15 points 1 day ago That's the big one. The LGB community also has an issue with grooming and recruitment. That's why so many want to be teachers, scout leaders, youth ministers and other positions of authority that put them in contact with minors. permalink parent award report block reply Floppybutthole 2 points 21 hours ago If gays looked at themselves long and hard and understood pedophilia wasn't cool maybe I'd accept them.   But just hop into any random gay bar and see how many 16 y/o kids are with 40 y/o men. So yeah fuck off faggots your entire gay culture is degenerate bullshit and you need to be beat back into the shadows.   Fucking rainbow flags and shit in the class room wtf is wring with you all. permalink parent award report block reply ancillasedet 1 points 1 day ago That's what she said. permalink parent award report block reply Mortal_Wombat 8 points 1 day ago If they didn't flaunt it around how would anyone really know? If they dressed normal and acted normal they wouldn't have any problems. It's the attention seeking behavior that gets them attention...many times negative. permalink parent award report block reply vote_for_MAGA_2020 7 points 1 day ago They need to be shoved back into the closet. Too many militant gays trying to push their lifestyle on children and not enough so-called \"silent majority\" gays not saying anything. This gay shit is what led us to trannies, men in women's sports, etc. permalink parent award report block reply ViagraFalls 4 points 1 day ago Gays should be low status people that reside in some dark corner of society. The only reason I say that is people’s kids can turn out being gay. You can’t really control it out absolutely prevent it. permalink parent award report block reply booblitchutz 2 points 1 day ago The Borg won’t stay on deck 15. permalink parent award report block reply load 9 more comments... MissileToad 25 points 1 day ago The entire point of made-up terms like \"sexual preference\" and \"sexual orientation\" is to take  unhealthy twisted perversions of sex and make them sound like normal viable options. From \"undocumented immigrant\" to \"products of conception\", you are swimming in language carefully designed to make you only think thoughts in one certain direction. permalink award report block reply Klaus73 7 points 1 day ago I remember when \"sex\" and \"gender\" were the same thing. permalink parent award report block reply bill_in_texas 19 points 1 day ago I mean, they are all deviants, her argument is, well, we're not as deviant as those people.  Maybe not, but you're still deviants, and you paved the way for more deviancy, so really, it's your fault, it's your bed you made. permalink award report block reply booblitchutz 3 points 1 day ago It’s a spectrum. Gay or lez is just a stop along the way to trans. Trans is taking the mindset of being gay or lez to its logical conclusion. You reject your sexual role, that makes you gay or lez. You further reject your sex, that makes you trans. It’s all just degrees. permalink parent award report block reply deleted 15 points 1 day ago lul_cheto 4 points 1 day ago Or theyre just degenerate faggots who are responsible for their own life choices. permalink parent award report block reply booblitchutz 2 points 1 day ago I think lots of things can cause severe self-loathing. That’s really what can manifest as gay-> trans. You hate yourself so much you reject your own identity. permalink parent award report block reply UncleSlayton 4 points 24 hours ago When a boy is entering puberty and he's sexualized by a grown man it rewires his pleasure/reward and ties it to men.  It's straight out of Pavlov. This is why gays abuse boys at such a high rate.  They were almost always abused at that age themselves. permalink parent award report block reply BillGateCanSuckIt 14 points 1 day ago Exactly how environmentalism has been hijacked by the climate change cult. permalink award report block reply glow-operator-2-0 2 points 1 day ago Ssshhh. The Sierra Club is destroyed now. Ssshhh. permalink parent award report block reply papa_newguineapig 14 points 1 day ago Homosexuality is an abomination to Christ. Change my mind. permalink award report block reply glow-operator-2-0 9 points 1 day ago Homosexual practices do not propagate, except through parasitism. permalink parent award report block reply papa_newguineapig 1 points 1 day ago So why are there more today? Your point is 100% valid, yet here we are. permalink parent award report block reply WoeToYou 3 points 1 day ago Amen. The Left is a cult of death. Nothing they promote brings forth good or life. permalink parent award report block reply FuzzAldrin -3 points 1 day ago Adultery is an abomination and a violation of the Ten Commandments. None of President Trump's wives died before he married a new wife. President Trump had three living wives at one point. If MAGA fails maybe it will be God's punishment on the USA for electing an adulterous man who took three wives. permalink parent award report block reply sun_wolf 4 points 1 day ago President Trump doesn’t promote adultery though. And adulterers do not get a month of celebration and a parade where the whole world comes together to promote adultery to schoolchildren. There is no adultery flag. There are no hiring quotas where a certain percentage of your employees need to be adulterers. There is no adulterer history month. Adulterers don’t go to public libraries to read the steamiest chapters of Lady Chatterley’s Lover to toddlers. permalink parent award report block reply Glory-Unto-God 1 points 1 day ago Adultery is actually never referred to as an abomination in the bible. permalink parent award report block reply lul_cheto 12 points 1 day ago Op is a retard, and everyone trying to rehabilitate these perverts is our enemy. permalink award report block reply 2008RonPaul2012 11 points 1 day ago The tq+ is the acceleration that proves the slippery slope is real. Sorry dikes, you've been exposed. permalink award report block reply Truthisunpopular 4 points 1 day ago Yup, she helped create the slippery slope so she deserves to fight and die on it with the rest of the degenerate freaks. permalink parent award report block reply rebuildingMyself 3 points 1 day ago And if she's gay she's probably a feminazi, which blurred gender definitions a generation ago so they could have women invade male spaces while preserving their own. permalink parent award report block reply reversethefraud 9 points 1 day ago \"TQ+ is a trojan horse to mainstream their degeneracy\" Now do gay marriage. permalink award report block reply RaginJake379 2 points 1 day ago The pot calling the kettle a faggot permalink parent award report block reply rebuildingMyself 2 points 1 day ago Muh slippery slope got pretty damn slippery permalink parent award report block reply 7h3RussianHacker 9 points 1 day ago I don't care. If you don't know where to stick you genitals you have a mental illness brought on by trauma or parasitic infection. Get Ivermectin, Fenbendazole and take it for two weeks. Find a Bible believing church and seek Jesus. permalink award report block reply GodIsPerfect 8 points 1 day ago Nah, they’re all gay. There are no other letters. Outlaw it all. permalink award report block reply Psalm-118_24 8 points 1 day ago Why even LGB, why not call yourself homosexual?  Then refer to God's word. permalink award report block reply that_sound 3 points 1 day ago Always worth noting that the B for Bisexual implies that there are only 2 genders. permalink parent award report block reply WoeToYou 6 points 1 day ago Yea, keep screaming into the abyss. Guys like me lost family and friends 25 years ago when I was a teenager for telling you stupid fuckers this is exactly where you would wind up. You’re all degenerate faggots. No quarter. permalink award report block reply lul_cheto 5 points 1 day ago Cause wearing a strap on and pretending your a man totally ain't a fetish... permalink award report block reply sun_wolf 4 points 1 day ago They are SO disgusted by men and male sexuality that… they need their female sex partners to strap on a photo-realistic plastic dick to have sex with them. permalink parent award report block reply PositiveEnergy2 5 points 1 day ago All homosexuality is a sin. “Or do you not know that the unrighteous will not inherit the kingdom of God? Do not be deceived: neither the sexually immoral, nor idolaters, nor adulterers, nor men who practice homosexuality, nor thieves, nor the greedy, nor drunkards, nor revilers, nor swindlers will inherit the kingdom of God.” permalink award report block reply 67Vert 1 points 1 day ago We are all sinners. People focus on homosexuality because it’s the only sin they didn’t commit.    Are Lesbos on the clear? permalink parent award report block reply Perseverant 3 points 1 day ago You're correct that we're all sinners who have fallen short of the glory of God.  That's why we need Jesus' sacrifice on the cross - only a perfect son can reconcile a broken humanity with a perfect father. That passage, from 1 Corinthians chapter 6, is talking about the consequences of sin.  OP left off the critically important verse 11, which immediately follows that quotation \"And such were some of you. But you were washed, you were sanctified, you were justified in the name of the Lord Jesus Christ and by the Spirit of our God.\" The key is \"such were some of you.\"  The distinction being made is old vs. new.  Before vs. after.  \"Before you openly indulged in all of these sins worthy of hell.  Now you know Jesus and have turned away from them, and Jesus covers them.\" So, if we live in open rebellion against God by going our own way, whether living in homosexuality or indulging in fornication, or thieving or murdering or whatever else - yeah - that verse is a warning sign of the consequences.  We must turn away from sin and follow Jesus. John 14:23-24 says \"Jesus replied, 'Anyone who loves me will obey my teaching. My Father will love them, and we will come to them and make our home with them. Anyone who does not love me will not obey my teaching. These words you hear are not my own; they belong to the Father who sent me.'\" permalink parent award report block reply Steve56775 1 points 1 day ago Damn the kingdom must be just about empty, no wonder Satan is so strong. permalink parent award report block reply RudeFrog 3 points 1 day ago Sorry you don't get to separate your evil from this other evil, the acceptance of your evil is what spawned the new evil, in other words, trans fags are your lesbian agenda babies. permalink award report block reply DeplorableLA 3 points 1 day ago Agree with her.  TQ+ needs to be watched closely by us all and never encouraged. permalink award report block reply WoeToYou 5 points 1 day ago Shame all of it, even LGB, because it’s all degenerate faggotry. permalink parent award report block reply DebbieinDallas 3 points 1 day ago Everything changed around 1976 when the American Psych Assoc ruled that homosexuality was not a mental illness.  Prior to that the homos stayed in the closet and we didnt have all these sex pervert issues.  I remember this. permalink award report block reply Thefrogeatsfree 3 points 1 day ago Accurate and old. Remember seeing this 2 years ago. So how's it going for them permalink award report block reply Workmore2 3 points 1 day ago The problem that none of these \"OG\" gays and lesbian ever see is this.    They paved the way.   It wasn't enough that they could do what they wanted behind closed doors.  They needed to be \"out and proud!\".  They needed to be socially accepted.  So they had their parades and protests.   Now all the other freaks have seen this and said \"what about us?\". permalink award report block reply MAGAMight 3 points 1 day ago Why do we accept the word \"gay\"? Gay means happy.  I want that word back. The word is homosexual or homo for short. permalink award report block reply cbonez416 3 points 1 day ago So the LBG who are mentally sick don't want anything to do with TQ+ because they are even more mentally sick than them!! Thanks. You're all sick. Make insane asylum's great again. permalink award report block reply RandoMando2A 2 points 17 hours ago All the Lmnop’s need to go back into the closet permanently. permalink award report block reply knnbccb 2 points 1 day ago Simple. They do not reproduce. They need to recruit and convert. They need fresh meat. That's the way of the sodomite. permalink award report block reply lifeisahologram 2 points 1 day ago You were the slippery slope you fucking lesbo. You needed to be arrested for sexual deviancy or hide in a straight relationship out of fear of being arrested. permalink award report block reply LadyPede23 2 points 19 hours ago LezbiaAn permalink award report block reply Cool_Coolidge 2 points 1 day ago These idiots don’t realize they are all just on a continuum of moral depravity. Sin darkens the intellect. permalink award report block reply COLDWARPATRIOT55 2 points 1 day ago She’s spot on. permalink award report block reply Tiberius1 2 points 1 day ago This is the very thing conservatives warned you about 20 years ago with gay marriage. Once you open that doorway, it can't be closed.  You were too stupid of a bitch to see it then and you are too stupid of a bitch to see today that you are 20 years too late. At this point fuck off and I hope in another 3 years we abolish gay marriage entirely and put you all into mental institutions. permalink award report block reply VaultdwelIer 2 points 1 day ago who gives a shit they're all deranged permalink award report block reply 67Vert 2 points 1 day ago It’s about time.  More homos are speaking out. permalink award report block reply PensivePatriot 2 points 1 day ago The real evil in this is that somehow gayness is seen as a mitigating (and thus preferable) outcome comparative to trans. That’s what’s truly fucked up. permalink award report block reply PhilipeNegro 2 points 1 day ago She can go on the wood pile, too permalink award report block reply donteatthat 2 points 1 day ago I don't like any of them permalink award report block reply AccelerateAlready 2 points 1 day ago Don't care what this creature has to say; sin is sin, burn in hellfire. permalink award report block reply Pappy_Gunn 2 points 1 day ago Oy Carpet Muncher, you are all depraved degenerates in my book.  You don't like men perving on women in locker rooms?  I know a bunch of women who don't like dykes sizing them up in locker rooms, but they get cancelled by the likes of you when they complain.  Now STFU. permalink award report block reply blueballs43 2 points 21 hours ago good for her she spoke the truth! permalink award report block reply DJT4MoreYears 2 points 1 day ago Yeah but all of you gay and lesbians were loving the TQ+ when it came out. They were loving the attention, awareness and the momentum to their movement. And now that they've lost control they want to get rid of them. Sorry, but you're stuck married for life with those degenerates...because your lifestyle is frankly degenerate as well. permalink award report block reply thisguy883 2 points 1 day ago dont care. they all get the rope. permalink award report block reply Skogin 2 points 1 day ago OG British articulation is a worthy aspiration. permalink award report block reply Brother_Bill 2 points 24 hours ago cry me a river. as you have sown, so shall you reap. permalink award report block reply n3IVI0 2 points 1 day ago Yes they are. Just because a pack of heathen degenerate faggots don't like how far society has fallen (and they helped push), they don't get to act like they had no part in its destruction. This is EXACTLY where their faggotry was always going to take us. permalink award report block reply Trump2024_LetsGOO 2 points 1 day ago No such thing as gay. Just mental illness. permalink award report block reply f_bastiat 1 points 1 day ago Based faggot. permalink award report block reply Djohnsonsgagreflex 1 points 1 day ago The only constant in the Marxists agenda is the revolution.  It’s why people who would otherwise hate and kill each other team up for the nebulous omni-cause of the left to fight against “the man”.  Once the revolution ends, suddenly they’re enemies and the new revolutionary cause and recruitment begins. permalink award report block reply Chuj 1 points 1 day ago She makes a great deal of sense. Splitting LGB from QT+ would fracture that collection as they fought amongst themselves. We should support opinions like this old L espouses permalink award report block reply SmokeyAF 1 points 1 day ago 100% permalink award report block reply pugsan 1 points 20 hours ago At one of it's finally understanding. permalink award report block reply Agent_86 1 points 1 day ago DFV!! permalink award report block reply So_Much_Happening 1 points 1 day ago LGBT rhymes with POOPY!  LGB rhymes with poopy, LG rhymes with poopy, but not L!  She wins! lol permalink award report block reply PowerOfBlues 1 points 1 day ago It wasn't a legitimate civil rights movement... and it wasn't hijacked..... It was created by the wealthy and the powerful ... and people like this lady were recruited to serve as it's useful idiots decades ago.... In order to give this movement the facade of legitimacy....to help them to eventually get to where we are now This lady ought to ask herself why so many powerful institutions ....who held back on giving full-throated support to gay rights for many decades... are so gung-ho about pushing the tranny stuff now? Because gay rights was never a grassroots movement...... They just took great pains to make it appear that way... while they were waiting for several generations of socially conservative geezers to die off and simultaneously indoctrinating several new generations into a leftist worldview All these powerful institutions have now revealed their true agenda all along....They're not pandering under pressure ....they're just ripping off the mask that they've been wearing this whole time permalink award report block reply btntx 0 points 1 day ago They were accepted. No one cared if their neighbor or aunt or uncle was gay - shit, they threw the best parties. They fucked up by letting these lunatics hijack their identity. Now they’re all considered to be mentally ill degenerate predators. permalink award report block reply Elencher 6 points 1 day ago Apparently we should have cared and we could have avoided our current social decay. permalink parent award report block reply thisguy883 5 points 1 day ago This. Its the mere fact that we even allowed gays to be gay in public, is the reason we are in this mess. Now we have child predators everywhere and gays fucking each other in congress on camera. All gays get the rope, no exceptions. permalink parent award report block reply lul_cheto 4 points 1 day ago Oh well, if they throw a good party then.... 🤡 permalink parent award report block reply Be_The_Change 1 points 1 day ago Comment removed by community moderators. permalink award report block reply KuzoKevin OP 0 points 1 day ago I don't think a gay man should have kids with a hetero wife to maintain the nuclear family, and there was never any forced demolition. I don't mind gays being couples, but I oppose gay marriage. permalink parent award report block reply Be_The_Change 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nMount_10_ear 55 points 1 day ago No such thing as \" gay rights\"  , its just another form of mental illness .. permalink award report block reply HunterBidensPC 36 points 1 day ago The right to marry other men in the eyes of God is abhorrent. Why should i care that the TQ+ highjacked their movement? It was a degenerate movement based in self interest of course it was doomed to turn into what it is now permalink parent award report block reply ViagraFalls 11 points 1 day ago Well first heterosexuals started having gay sex. Then gay sex became okay to them. What I mean is that sex became for fun and promiscuity abounded like fa66ots do. Any procreation was often an unwanted side effect. permalink parent award report block reply kornesque 5 points 1 day ago This. Notice they started by normalizing birth control. Abhorrent in the eyes of God and the springboard to everything else. Once it became culturally acceptable to view sex as primarily for pleasure rather procreation, then it became an outrage to restrict people who wanted sex for pleasure without procreation for any reason. The TQ+ is just a more positive range on the numberline of degeneracy that LGB already lands on. permalink parent award report block reply sun_wolf 4 points 1 day ago The main difference between straight people and gay people is if a straight dude is a foot fetishist and needs to rub on a foot to get off, he knows that’s a mis-use of the human body for sexual gratification and that if every other human being was like him, no more human beings would be created. Gay people don’t seem capable of this same insight. If you ask a gay person if the world would be better if ALL people were gay, shooting their semen into men’s buttholes or getting screwed by plastic dildos made in China, they would say yes. But that would be the end of human procreation because you can’t make a baby in a man’s butthole and you can’t make a baby from a hunk of rainbow plastic. permalink parent award report block reply view 1 more comments... MAGAMight 9 points 1 day ago Ironic that the degenerates are calling out  degenerates as being too degenerate permalink parent award report block reply Threaper666 3 points 21 hours ago Exactly.  They laid the ground work.  They created the Map.  No pun intended. permalink parent award report block reply HunterBidensPC 2 points 21 hours ago Underrated comment since they literally did create the MAPs permalink parent award report block reply booblitchutz 6 points 1 day ago No such thing as a “lesbian”. Every one I’ve ever met was a woman hurt by men who just noped out of normal relationships as a result. The most honest lesbian I ever met said that it’s all just playing house and partnering with each other for companionship and protection. She said that she has never actually been “attracted” sexually to her “partner”. And that’s true. Women cannot sexually attract each other, it’s a biological impossibility. Men can’t either, but men are driven by the urge to ejaculate which is stronger than the woman’s urge to climax. permalink parent award report block reply sun_wolf 4 points 1 day ago They also repeat the exact same dynamic of heterosexual relationships (one butch, one femme) within their lesbian relationships, which is an obvious giveaway that homosexuality is a fetish, not an identity. They can’t even PRETEND to be gay very well, and their inherent biology still presents itself. permalink parent award report block reply Now_On_to_Mars 2 points 1 day ago Which is ironic cause abusive lesbian relationships are all too common permalink parent award report block reply booblitchutz 3 points 1 day ago Yes, well imagine the frustration of a “marriage” completely void of sexual chemistry, and when you do “have sex” its unsatisfying biologically. After a while it’s hard not to resent your roommate in that scenario. permalink parent award report block reply DManthey 3 points 1 day ago And discrimination. Why do they have more rights than the rest of us? permalink parent award report block reply Dev404 2 points 1 day ago The only thing I can remember that gays were excluded from was the military. However, it's not like they went checking if you were gay by running a complete background check of your sexual history, you could just say you weren't and don't give any obvious signs. Apart from that, I don't recall gays being disallowed from anything by law or policy. The gay rights thing is an exaggerated issue brought on by feminists - again. The entire existence of feminism was unnecessary and was nothing more than the biggest cultural weapon psyop ever created and massively succeeded in demoralizing every country it touched. permalink parent award report block reply\nHunterBidensPC 36 points 1 day ago The right to marry other men in the eyes of God is abhorrent. Why should i care that the TQ+ highjacked their movement? It was a degenerate movement based in self interest of course it was doomed to turn into what it is now permalink parent award report block reply ViagraFalls 11 points 1 day ago Well first heterosexuals started having gay sex. Then gay sex became okay to them. What I mean is that sex became for fun and promiscuity abounded like fa66ots do. Any procreation was often an unwanted side effect. permalink parent award report block reply kornesque 5 points 1 day ago This. Notice they started by normalizing birth control. Abhorrent in the eyes of God and the springboard to everything else. Once it became culturally acceptable to view sex as primarily for pleasure rather procreation, then it became an outrage to restrict people who wanted sex for pleasure without procreation for any reason. The TQ+ is just a more positive range on the numberline of degeneracy that LGB already lands on. permalink parent award report block reply sun_wolf 4 points 1 day ago The main difference between straight people and gay people is if a straight dude is a foot fetishist and needs to rub on a foot to get off, he knows that’s a mis-use of the human body for sexual gratification and that if every other human being was like him, no more human beings would be created. Gay people don’t seem capable of this same insight. If you ask a gay person if the world would be better if ALL people were gay, shooting their semen into men’s buttholes or getting screwed by plastic dildos made in China, they would say yes. But that would be the end of human procreation because you can’t make a baby in a man’s butthole and you can’t make a baby from a hunk of rainbow plastic. permalink parent award report block reply view 1 more comments... MAGAMight 9 points 1 day ago Ironic that the degenerates are calling out  degenerates as being too degenerate permalink parent award report block reply Threaper666 3 points 21 hours ago Exactly.  They laid the ground work.  They created the Map.  No pun intended. permalink parent award report block reply HunterBidensPC 2 points 21 hours ago Underrated comment since they literally did create the MAPs permalink parent award report block reply\nViagraFalls 11 points 1 day ago Well first heterosexuals started having gay sex. Then gay sex became okay to them. What I mean is that sex became for fun and promiscuity abounded like fa66ots do. Any procreation was often an unwanted side effect. permalink parent award report block reply kornesque 5 points 1 day ago This. Notice they started by normalizing birth control. Abhorrent in the eyes of God and the springboard to everything else. Once it became culturally acceptable to view sex as primarily for pleasure rather procreation, then it became an outrage to restrict people who wanted sex for pleasure without procreation for any reason. The TQ+ is just a more positive range on the numberline of degeneracy that LGB already lands on. permalink parent award report block reply sun_wolf 4 points 1 day ago The main difference between straight people and gay people is if a straight dude is a foot fetishist and needs to rub on a foot to get off, he knows that’s a mis-use of the human body for sexual gratification and that if every other human being was like him, no more human beings would be created. Gay people don’t seem capable of this same insight. If you ask a gay person if the world would be better if ALL people were gay, shooting their semen into men’s buttholes or getting screwed by plastic dildos made in China, they would say yes. But that would be the end of human procreation because you can’t make a baby in a man’s butthole and you can’t make a baby from a hunk of rainbow plastic. permalink parent award report block reply view 1 more comments...\nkornesque 5 points 1 day ago This. Notice they started by normalizing birth control. Abhorrent in the eyes of God and the springboard to everything else. Once it became culturally acceptable to view sex as primarily for pleasure rather procreation, then it became an outrage to restrict people who wanted sex for pleasure without procreation for any reason. The TQ+ is just a more positive range on the numberline of degeneracy that LGB already lands on. permalink parent award report block reply sun_wolf 4 points 1 day ago The main difference between straight people and gay people is if a straight dude is a foot fetishist and needs to rub on a foot to get off, he knows that’s a mis-use of the human body for sexual gratification and that if every other human being was like him, no more human beings would be created. Gay people don’t seem capable of this same insight. If you ask a gay person if the world would be better if ALL people were gay, shooting their semen into men’s buttholes or getting screwed by plastic dildos made in China, they would say yes. But that would be the end of human procreation because you can’t make a baby in a man’s butthole and you can’t make a baby from a hunk of rainbow plastic. permalink parent award report block reply view 1 more comments...\nsun_wolf 4 points 1 day ago The main difference between straight people and gay people is if a straight dude is a foot fetishist and needs to rub on a foot to get off, he knows that’s a mis-use of the human body for sexual gratification and that if every other human being was like him, no more human beings would be created. Gay people don’t seem capable of this same insight. If you ask a gay person if the world would be better if ALL people were gay, shooting their semen into men’s buttholes or getting screwed by plastic dildos made in China, they would say yes. But that would be the end of human procreation because you can’t make a baby in a man’s butthole and you can’t make a baby from a hunk of rainbow plastic. permalink parent award report block reply view 1 more comments...\nMAGAMight 9 points 1 day ago Ironic that the degenerates are calling out  degenerates as being too degenerate permalink parent award report block reply\nThreaper666 3 points 21 hours ago Exactly.  They laid the ground work.  They created the Map.  No pun intended. permalink parent award report block reply HunterBidensPC 2 points 21 hours ago Underrated comment since they literally did create the MAPs permalink parent award report block reply\nHunterBidensPC 2 points 21 hours ago Underrated comment since they literally did create the MAPs permalink parent award report block reply\nbooblitchutz 6 points 1 day ago No such thing as a “lesbian”. Every one I’ve ever met was a woman hurt by men who just noped out of normal relationships as a result. The most honest lesbian I ever met said that it’s all just playing house and partnering with each other for companionship and protection. She said that she has never actually been “attracted” sexually to her “partner”. And that’s true. Women cannot sexually attract each other, it’s a biological impossibility. Men can’t either, but men are driven by the urge to ejaculate which is stronger than the woman’s urge to climax. permalink parent award report block reply sun_wolf 4 points 1 day ago They also repeat the exact same dynamic of heterosexual relationships (one butch, one femme) within their lesbian relationships, which is an obvious giveaway that homosexuality is a fetish, not an identity. They can’t even PRETEND to be gay very well, and their inherent biology still presents itself. permalink parent award report block reply Now_On_to_Mars 2 points 1 day ago Which is ironic cause abusive lesbian relationships are all too common permalink parent award report block reply booblitchutz 3 points 1 day ago Yes, well imagine the frustration of a “marriage” completely void of sexual chemistry, and when you do “have sex” its unsatisfying biologically. After a while it’s hard not to resent your roommate in that scenario. permalink parent award report block reply\nsun_wolf 4 points 1 day ago They also repeat the exact same dynamic of heterosexual relationships (one butch, one femme) within their lesbian relationships, which is an obvious giveaway that homosexuality is a fetish, not an identity. They can’t even PRETEND to be gay very well, and their inherent biology still presents itself. permalink parent award report block reply\nNow_On_to_Mars 2 points 1 day ago Which is ironic cause abusive lesbian relationships are all too common permalink parent award report block reply booblitchutz 3 points 1 day ago Yes, well imagine the frustration of a “marriage” completely void of sexual chemistry, and when you do “have sex” its unsatisfying biologically. After a while it’s hard not to resent your roommate in that scenario. permalink parent award report block reply\nbooblitchutz 3 points 1 day ago Yes, well imagine the frustration of a “marriage” completely void of sexual chemistry, and when you do “have sex” its unsatisfying biologically. After a while it’s hard not to resent your roommate in that scenario. permalink parent award report block reply\nDManthey 3 points 1 day ago And discrimination. Why do they have more rights than the rest of us? permalink parent award report block reply\nDev404 2 points 1 day ago The only thing I can remember that gays were excluded from was the military. However, it's not like they went checking if you were gay by running a complete background check of your sexual history, you could just say you weren't and don't give any obvious signs. Apart from that, I don't recall gays being disallowed from anything by law or policy. The gay rights thing is an exaggerated issue brought on by feminists - again. The entire existence of feminism was unnecessary and was nothing more than the biggest cultural weapon psyop ever created and massively succeeded in demoralizing every country it touched. permalink parent award report block reply\nvote_for_MAGA_2020 29 points 1 day ago \"gay rights\" should never have been a thing, so whatever she's saying is stupid This is not a \"takedown\" permalink award report block reply KuzoKevin OP 7 points 1 day ago I don't think gays should get special treatment under the guise of \"rights\", but I think they should be left alone. permalink parent award report block reply peterthegreen 30 points 1 day ago They need to leave the kids alone. permalink parent award report block reply airborne3502 15 points 1 day ago That's the big one. The LGB community also has an issue with grooming and recruitment. That's why so many want to be teachers, scout leaders, youth ministers and other positions of authority that put them in contact with minors. permalink parent award report block reply Floppybutthole 2 points 21 hours ago If gays looked at themselves long and hard and understood pedophilia wasn't cool maybe I'd accept them.   But just hop into any random gay bar and see how many 16 y/o kids are with 40 y/o men. So yeah fuck off faggots your entire gay culture is degenerate bullshit and you need to be beat back into the shadows.   Fucking rainbow flags and shit in the class room wtf is wring with you all. permalink parent award report block reply ancillasedet 1 points 1 day ago That's what she said. permalink parent award report block reply Mortal_Wombat 8 points 1 day ago If they didn't flaunt it around how would anyone really know? If they dressed normal and acted normal they wouldn't have any problems. It's the attention seeking behavior that gets them attention...many times negative. permalink parent award report block reply vote_for_MAGA_2020 7 points 1 day ago They need to be shoved back into the closet. Too many militant gays trying to push their lifestyle on children and not enough so-called \"silent majority\" gays not saying anything. This gay shit is what led us to trannies, men in women's sports, etc. permalink parent award report block reply ViagraFalls 4 points 1 day ago Gays should be low status people that reside in some dark corner of society. The only reason I say that is people’s kids can turn out being gay. You can’t really control it out absolutely prevent it. permalink parent award report block reply booblitchutz 2 points 1 day ago The Borg won’t stay on deck 15. permalink parent award report block reply load 9 more comments...\nKuzoKevin OP 7 points 1 day ago I don't think gays should get special treatment under the guise of \"rights\", but I think they should be left alone. permalink parent award report block reply peterthegreen 30 points 1 day ago They need to leave the kids alone. permalink parent award report block reply airborne3502 15 points 1 day ago That's the big one. The LGB community also has an issue with grooming and recruitment. That's why so many want to be teachers, scout leaders, youth ministers and other positions of authority that put them in contact with minors. permalink parent award report block reply Floppybutthole 2 points 21 hours ago If gays looked at themselves long and hard and understood pedophilia wasn't cool maybe I'd accept them.   But just hop into any random gay bar and see how many 16 y/o kids are with 40 y/o men. So yeah fuck off faggots your entire gay culture is degenerate bullshit and you need to be beat back into the shadows.   Fucking rainbow flags and shit in the class room wtf is wring with you all. permalink parent award report block reply ancillasedet 1 points 1 day ago That's what she said. permalink parent award report block reply Mortal_Wombat 8 points 1 day ago If they didn't flaunt it around how would anyone really know? If they dressed normal and acted normal they wouldn't have any problems. It's the attention seeking behavior that gets them attention...many times negative. permalink parent award report block reply vote_for_MAGA_2020 7 points 1 day ago They need to be shoved back into the closet. Too many militant gays trying to push their lifestyle on children and not enough so-called \"silent majority\" gays not saying anything. This gay shit is what led us to trannies, men in women's sports, etc. permalink parent award report block reply ViagraFalls 4 points 1 day ago Gays should be low status people that reside in some dark corner of society. The only reason I say that is people’s kids can turn out being gay. You can’t really control it out absolutely prevent it. permalink parent award report block reply booblitchutz 2 points 1 day ago The Borg won’t stay on deck 15. permalink parent award report block reply load 9 more comments...\npeterthegreen 30 points 1 day ago They need to leave the kids alone. permalink parent award report block reply airborne3502 15 points 1 day ago That's the big one. The LGB community also has an issue with grooming and recruitment. That's why so many want to be teachers, scout leaders, youth ministers and other positions of authority that put them in contact with minors. permalink parent award report block reply Floppybutthole 2 points 21 hours ago If gays looked at themselves long and hard and understood pedophilia wasn't cool maybe I'd accept them.   But just hop into any random gay bar and see how many 16 y/o kids are with 40 y/o men. So yeah fuck off faggots your entire gay culture is degenerate bullshit and you need to be beat back into the shadows.   Fucking rainbow flags and shit in the class room wtf is wring with you all. permalink parent award report block reply ancillasedet 1 points 1 day ago That's what she said. permalink parent award report block reply\nairborne3502 15 points 1 day ago That's the big one. The LGB community also has an issue with grooming and recruitment. That's why so many want to be teachers, scout leaders, youth ministers and other positions of authority that put them in contact with minors. permalink parent award report block reply\nFloppybutthole 2 points 21 hours ago If gays looked at themselves long and hard and understood pedophilia wasn't cool maybe I'd accept them.   But just hop into any random gay bar and see how many 16 y/o kids are with 40 y/o men. So yeah fuck off faggots your entire gay culture is degenerate bullshit and you need to be beat back into the shadows.   Fucking rainbow flags and shit in the class room wtf is wring with you all. permalink parent award report block reply\nancillasedet 1 points 1 day ago That's what she said. permalink parent award report block reply\nMortal_Wombat 8 points 1 day ago If they didn't flaunt it around how would anyone really know? If they dressed normal and acted normal they wouldn't have any problems. It's the attention seeking behavior that gets them attention...many times negative. permalink parent award report block reply\nvote_for_MAGA_2020 7 points 1 day ago They need to be shoved back into the closet. Too many militant gays trying to push their lifestyle on children and not enough so-called \"silent majority\" gays not saying anything. This gay shit is what led us to trannies, men in women's sports, etc. permalink parent award report block reply\nViagraFalls 4 points 1 day ago Gays should be low status people that reside in some dark corner of society. The only reason I say that is people’s kids can turn out being gay. You can’t really control it out absolutely prevent it. permalink parent award report block reply\nbooblitchutz 2 points 1 day ago The Borg won’t stay on deck 15. permalink parent award report block reply\nMissileToad 25 points 1 day ago The entire point of made-up terms like \"sexual preference\" and \"sexual orientation\" is to take  unhealthy twisted perversions of sex and make them sound like normal viable options. From \"undocumented immigrant\" to \"products of conception\", you are swimming in language carefully designed to make you only think thoughts in one certain direction. permalink award report block reply Klaus73 7 points 1 day ago I remember when \"sex\" and \"gender\" were the same thing. permalink parent award report block reply\nKlaus73 7 points 1 day ago I remember when \"sex\" and \"gender\" were the same thing. permalink parent award report block reply\nbill_in_texas 19 points 1 day ago I mean, they are all deviants, her argument is, well, we're not as deviant as those people.  Maybe not, but you're still deviants, and you paved the way for more deviancy, so really, it's your fault, it's your bed you made. permalink award report block reply booblitchutz 3 points 1 day ago It’s a spectrum. Gay or lez is just a stop along the way to trans. Trans is taking the mindset of being gay or lez to its logical conclusion. You reject your sexual role, that makes you gay or lez. You further reject your sex, that makes you trans. It’s all just degrees. permalink parent award report block reply\nbooblitchutz 3 points 1 day ago It’s a spectrum. Gay or lez is just a stop along the way to trans. Trans is taking the mindset of being gay or lez to its logical conclusion. You reject your sexual role, that makes you gay or lez. You further reject your sex, that makes you trans. It’s all just degrees. permalink parent award report block reply\ndeleted 15 points 1 day ago lul_cheto 4 points 1 day ago Or theyre just degenerate faggots who are responsible for their own life choices. permalink parent award report block reply booblitchutz 2 points 1 day ago I think lots of things can cause severe self-loathing. That’s really what can manifest as gay-> trans. You hate yourself so much you reject your own identity. permalink parent award report block reply UncleSlayton 4 points 24 hours ago When a boy is entering puberty and he's sexualized by a grown man it rewires his pleasure/reward and ties it to men.  It's straight out of Pavlov. This is why gays abuse boys at such a high rate.  They were almost always abused at that age themselves. permalink parent award report block reply\nlul_cheto 4 points 1 day ago Or theyre just degenerate faggots who are responsible for their own life choices. permalink parent award report block reply\nbooblitchutz 2 points 1 day ago I think lots of things can cause severe self-loathing. That’s really what can manifest as gay-> trans. You hate yourself so much you reject your own identity. permalink parent award report block reply UncleSlayton 4 points 24 hours ago When a boy is entering puberty and he's sexualized by a grown man it rewires his pleasure/reward and ties it to men.  It's straight out of Pavlov. This is why gays abuse boys at such a high rate.  They were almost always abused at that age themselves. permalink parent award report block reply\nUncleSlayton 4 points 24 hours ago When a boy is entering puberty and he's sexualized by a grown man it rewires his pleasure/reward and ties it to men.  It's straight out of Pavlov. This is why gays abuse boys at such a high rate.  They were almost always abused at that age themselves. permalink parent award report block reply\nBillGateCanSuckIt 14 points 1 day ago Exactly how environmentalism has been hijacked by the climate change cult. permalink award report block reply glow-operator-2-0 2 points 1 day ago Ssshhh. The Sierra Club is destroyed now. Ssshhh. permalink parent award report block reply\nglow-operator-2-0 2 points 1 day ago Ssshhh. The Sierra Club is destroyed now. Ssshhh. permalink parent award report block reply\npapa_newguineapig 14 points 1 day ago Homosexuality is an abomination to Christ. Change my mind. permalink award report block reply glow-operator-2-0 9 points 1 day ago Homosexual practices do not propagate, except through parasitism. permalink parent award report block reply papa_newguineapig 1 points 1 day ago So why are there more today? Your point is 100% valid, yet here we are. permalink parent award report block reply WoeToYou 3 points 1 day ago Amen. The Left is a cult of death. Nothing they promote brings forth good or life. permalink parent award report block reply FuzzAldrin -3 points 1 day ago Adultery is an abomination and a violation of the Ten Commandments. None of President Trump's wives died before he married a new wife. President Trump had three living wives at one point. If MAGA fails maybe it will be God's punishment on the USA for electing an adulterous man who took three wives. permalink parent award report block reply sun_wolf 4 points 1 day ago President Trump doesn’t promote adultery though. And adulterers do not get a month of celebration and a parade where the whole world comes together to promote adultery to schoolchildren. There is no adultery flag. There are no hiring quotas where a certain percentage of your employees need to be adulterers. There is no adulterer history month. Adulterers don’t go to public libraries to read the steamiest chapters of Lady Chatterley’s Lover to toddlers. permalink parent award report block reply Glory-Unto-God 1 points 1 day ago Adultery is actually never referred to as an abomination in the bible. permalink parent award report block reply\nglow-operator-2-0 9 points 1 day ago Homosexual practices do not propagate, except through parasitism. permalink parent award report block reply papa_newguineapig 1 points 1 day ago So why are there more today? Your point is 100% valid, yet here we are. permalink parent award report block reply\npapa_newguineapig 1 points 1 day ago So why are there more today? Your point is 100% valid, yet here we are. permalink parent award report block reply\nWoeToYou 3 points 1 day ago Amen. The Left is a cult of death. Nothing they promote brings forth good or life. permalink parent award report block reply\nFuzzAldrin -3 points 1 day ago Adultery is an abomination and a violation of the Ten Commandments. None of President Trump's wives died before he married a new wife. President Trump had three living wives at one point. If MAGA fails maybe it will be God's punishment on the USA for electing an adulterous man who took three wives. permalink parent award report block reply sun_wolf 4 points 1 day ago President Trump doesn’t promote adultery though. And adulterers do not get a month of celebration and a parade where the whole world comes together to promote adultery to schoolchildren. There is no adultery flag. There are no hiring quotas where a certain percentage of your employees need to be adulterers. There is no adulterer history month. Adulterers don’t go to public libraries to read the steamiest chapters of Lady Chatterley’s Lover to toddlers. permalink parent award report block reply Glory-Unto-God 1 points 1 day ago Adultery is actually never referred to as an abomination in the bible. permalink parent award report block reply\nsun_wolf 4 points 1 day ago President Trump doesn’t promote adultery though. And adulterers do not get a month of celebration and a parade where the whole world comes together to promote adultery to schoolchildren. There is no adultery flag. There are no hiring quotas where a certain percentage of your employees need to be adulterers. There is no adulterer history month. Adulterers don’t go to public libraries to read the steamiest chapters of Lady Chatterley’s Lover to toddlers. permalink parent award report block reply\nGlory-Unto-God 1 points 1 day ago Adultery is actually never referred to as an abomination in the bible. permalink parent award report block reply\nlul_cheto 12 points 1 day ago Op is a retard, and everyone trying to rehabilitate these perverts is our enemy. permalink award report block reply\n2008RonPaul2012 11 points 1 day ago The tq+ is the acceleration that proves the slippery slope is real. Sorry dikes, you've been exposed. permalink award report block reply Truthisunpopular 4 points 1 day ago Yup, she helped create the slippery slope so she deserves to fight and die on it with the rest of the degenerate freaks. permalink parent award report block reply rebuildingMyself 3 points 1 day ago And if she's gay she's probably a feminazi, which blurred gender definitions a generation ago so they could have women invade male spaces while preserving their own. permalink parent award report block reply\nTruthisunpopular 4 points 1 day ago Yup, she helped create the slippery slope so she deserves to fight and die on it with the rest of the degenerate freaks. permalink parent award report block reply rebuildingMyself 3 points 1 day ago And if she's gay she's probably a feminazi, which blurred gender definitions a generation ago so they could have women invade male spaces while preserving their own. permalink parent award report block reply\nrebuildingMyself 3 points 1 day ago And if she's gay she's probably a feminazi, which blurred gender definitions a generation ago so they could have women invade male spaces while preserving their own. permalink parent award report block reply\nreversethefraud 9 points 1 day ago \"TQ+ is a trojan horse to mainstream their degeneracy\" Now do gay marriage. permalink award report block reply RaginJake379 2 points 1 day ago The pot calling the kettle a faggot permalink parent award report block reply rebuildingMyself 2 points 1 day ago Muh slippery slope got pretty damn slippery permalink parent award report block reply\nRaginJake379 2 points 1 day ago The pot calling the kettle a faggot permalink parent award report block reply\nrebuildingMyself 2 points 1 day ago Muh slippery slope got pretty damn slippery permalink parent award report block reply\n7h3RussianHacker 9 points 1 day ago I don't care. If you don't know where to stick you genitals you have a mental illness brought on by trauma or parasitic infection. Get Ivermectin, Fenbendazole and take it for two weeks. Find a Bible believing church and seek Jesus. permalink award report block reply\nGodIsPerfect 8 points 1 day ago Nah, they’re all gay. There are no other letters. Outlaw it all. permalink award report block reply\nPsalm-118_24 8 points 1 day ago Why even LGB, why not call yourself homosexual?  Then refer to God's word. permalink award report block reply that_sound 3 points 1 day ago Always worth noting that the B for Bisexual implies that there are only 2 genders. permalink parent award report block reply\nthat_sound 3 points 1 day ago Always worth noting that the B for Bisexual implies that there are only 2 genders. permalink parent award report block reply\nWoeToYou 6 points 1 day ago Yea, keep screaming into the abyss. Guys like me lost family and friends 25 years ago when I was a teenager for telling you stupid fuckers this is exactly where you would wind up. You’re all degenerate faggots. No quarter. permalink award report block reply\nlul_cheto 5 points 1 day ago Cause wearing a strap on and pretending your a man totally ain't a fetish... permalink award report block reply sun_wolf 4 points 1 day ago They are SO disgusted by men and male sexuality that… they need their female sex partners to strap on a photo-realistic plastic dick to have sex with them. permalink parent award report block reply\nsun_wolf 4 points 1 day ago They are SO disgusted by men and male sexuality that… they need their female sex partners to strap on a photo-realistic plastic dick to have sex with them. permalink parent award report block reply\nPositiveEnergy2 5 points 1 day ago All homosexuality is a sin. “Or do you not know that the unrighteous will not inherit the kingdom of God? Do not be deceived: neither the sexually immoral, nor idolaters, nor adulterers, nor men who practice homosexuality, nor thieves, nor the greedy, nor drunkards, nor revilers, nor swindlers will inherit the kingdom of God.” permalink award report block reply 67Vert 1 points 1 day ago We are all sinners. People focus on homosexuality because it’s the only sin they didn’t commit.    Are Lesbos on the clear? permalink parent award report block reply Perseverant 3 points 1 day ago You're correct that we're all sinners who have fallen short of the glory of God.  That's why we need Jesus' sacrifice on the cross - only a perfect son can reconcile a broken humanity with a perfect father. That passage, from 1 Corinthians chapter 6, is talking about the consequences of sin.  OP left off the critically important verse 11, which immediately follows that quotation \"And such were some of you. But you were washed, you were sanctified, you were justified in the name of the Lord Jesus Christ and by the Spirit of our God.\" The key is \"such were some of you.\"  The distinction being made is old vs. new.  Before vs. after.  \"Before you openly indulged in all of these sins worthy of hell.  Now you know Jesus and have turned away from them, and Jesus covers them.\" So, if we live in open rebellion against God by going our own way, whether living in homosexuality or indulging in fornication, or thieving or murdering or whatever else - yeah - that verse is a warning sign of the consequences.  We must turn away from sin and follow Jesus. John 14:23-24 says \"Jesus replied, 'Anyone who loves me will obey my teaching. My Father will love them, and we will come to them and make our home with them. Anyone who does not love me will not obey my teaching. These words you hear are not my own; they belong to the Father who sent me.'\" permalink parent award report block reply Steve56775 1 points 1 day ago Damn the kingdom must be just about empty, no wonder Satan is so strong. permalink parent award report block reply\n67Vert 1 points 1 day ago We are all sinners. People focus on homosexuality because it’s the only sin they didn’t commit.    Are Lesbos on the clear? permalink parent award report block reply Perseverant 3 points 1 day ago You're correct that we're all sinners who have fallen short of the glory of God.  That's why we need Jesus' sacrifice on the cross - only a perfect son can reconcile a broken humanity with a perfect father. That passage, from 1 Corinthians chapter 6, is talking about the consequences of sin.  OP left off the critically important verse 11, which immediately follows that quotation \"And such were some of you. But you were washed, you were sanctified, you were justified in the name of the Lord Jesus Christ and by the Spirit of our God.\" The key is \"such were some of you.\"  The distinction being made is old vs. new.  Before vs. after.  \"Before you openly indulged in all of these sins worthy of hell.  Now you know Jesus and have turned away from them, and Jesus covers them.\" So, if we live in open rebellion against God by going our own way, whether living in homosexuality or indulging in fornication, or thieving or murdering or whatever else - yeah - that verse is a warning sign of the consequences.  We must turn away from sin and follow Jesus. John 14:23-24 says \"Jesus replied, 'Anyone who loves me will obey my teaching. My Father will love them, and we will come to them and make our home with them. Anyone who does not love me will not obey my teaching. These words you hear are not my own; they belong to the Father who sent me.'\" permalink parent award report block reply\nPerseverant 3 points 1 day ago You're correct that we're all sinners who have fallen short of the glory of God.  That's why we need Jesus' sacrifice on the cross - only a perfect son can reconcile a broken humanity with a perfect father. That passage, from 1 Corinthians chapter 6, is talking about the consequences of sin.  OP left off the critically important verse 11, which immediately follows that quotation \"And such were some of you. But you were washed, you were sanctified, you were justified in the name of the Lord Jesus Christ and by the Spirit of our God.\" The key is \"such were some of you.\"  The distinction being made is old vs. new.  Before vs. after.  \"Before you openly indulged in all of these sins worthy of hell.  Now you know Jesus and have turned away from them, and Jesus covers them.\" So, if we live in open rebellion against God by going our own way, whether living in homosexuality or indulging in fornication, or thieving or murdering or whatever else - yeah - that verse is a warning sign of the consequences.  We must turn away from sin and follow Jesus. John 14:23-24 says \"Jesus replied, 'Anyone who loves me will obey my teaching. My Father will love them, and we will come to them and make our home with them. Anyone who does not love me will not obey my teaching. These words you hear are not my own; they belong to the Father who sent me.'\" permalink parent award report block reply\nSteve56775 1 points 1 day ago Damn the kingdom must be just about empty, no wonder Satan is so strong. permalink parent award report block reply\nRudeFrog 3 points 1 day ago Sorry you don't get to separate your evil from this other evil, the acceptance of your evil is what spawned the new evil, in other words, trans fags are your lesbian agenda babies. permalink award report block reply\nDeplorableLA 3 points 1 day ago Agree with her.  TQ+ needs to be watched closely by us all and never encouraged. permalink award report block reply WoeToYou 5 points 1 day ago Shame all of it, even LGB, because it’s all degenerate faggotry. permalink parent award report block reply\nWoeToYou 5 points 1 day ago Shame all of it, even LGB, because it’s all degenerate faggotry. permalink parent award report block reply\nDebbieinDallas 3 points 1 day ago Everything changed around 1976 when the American Psych Assoc ruled that homosexuality was not a mental illness.  Prior to that the homos stayed in the closet and we didnt have all these sex pervert issues.  I remember this. permalink award report block reply\nThefrogeatsfree 3 points 1 day ago Accurate and old. Remember seeing this 2 years ago. So how's it going for them permalink award report block reply\nWorkmore2 3 points 1 day ago The problem that none of these \"OG\" gays and lesbian ever see is this.    They paved the way.   It wasn't enough that they could do what they wanted behind closed doors.  They needed to be \"out and proud!\".  They needed to be socially accepted.  So they had their parades and protests.   Now all the other freaks have seen this and said \"what about us?\". permalink award report block reply\nMAGAMight 3 points 1 day ago Why do we accept the word \"gay\"? Gay means happy.  I want that word back. The word is homosexual or homo for short. permalink award report block reply\ncbonez416 3 points 1 day ago So the LBG who are mentally sick don't want anything to do with TQ+ because they are even more mentally sick than them!! Thanks. You're all sick. Make insane asylum's great again. permalink award report block reply\nRandoMando2A 2 points 17 hours ago All the Lmnop’s need to go back into the closet permanently. permalink award report block reply\nknnbccb 2 points 1 day ago Simple. They do not reproduce. They need to recruit and convert. They need fresh meat. That's the way of the sodomite. permalink award report block reply\nlifeisahologram 2 points 1 day ago You were the slippery slope you fucking lesbo. You needed to be arrested for sexual deviancy or hide in a straight relationship out of fear of being arrested. permalink award report block reply\nLadyPede23 2 points 19 hours ago LezbiaAn permalink award report block reply\nCool_Coolidge 2 points 1 day ago These idiots don’t realize they are all just on a continuum of moral depravity. Sin darkens the intellect. permalink award report block reply\nCOLDWARPATRIOT55 2 points 1 day ago She’s spot on. permalink award report block reply\nTiberius1 2 points 1 day ago This is the very thing conservatives warned you about 20 years ago with gay marriage. Once you open that doorway, it can't be closed.  You were too stupid of a bitch to see it then and you are too stupid of a bitch to see today that you are 20 years too late. At this point fuck off and I hope in another 3 years we abolish gay marriage entirely and put you all into mental institutions. permalink award report block reply\nVaultdwelIer 2 points 1 day ago who gives a shit they're all deranged permalink award report block reply\n67Vert 2 points 1 day ago It’s about time.  More homos are speaking out. permalink award report block reply\nPensivePatriot 2 points 1 day ago The real evil in this is that somehow gayness is seen as a mitigating (and thus preferable) outcome comparative to trans. That’s what’s truly fucked up. permalink award report block reply\nPhilipeNegro 2 points 1 day ago She can go on the wood pile, too permalink award report block reply\ndonteatthat 2 points 1 day ago I don't like any of them permalink award report block reply\nAccelerateAlready 2 points 1 day ago Don't care what this creature has to say; sin is sin, burn in hellfire. permalink award report block reply\nPappy_Gunn 2 points 1 day ago Oy Carpet Muncher, you are all depraved degenerates in my book.  You don't like men perving on women in locker rooms?  I know a bunch of women who don't like dykes sizing them up in locker rooms, but they get cancelled by the likes of you when they complain.  Now STFU. permalink award report block reply\nblueballs43 2 points 21 hours ago good for her she spoke the truth! permalink award report block reply\nDJT4MoreYears 2 points 1 day ago Yeah but all of you gay and lesbians were loving the TQ+ when it came out. They were loving the attention, awareness and the momentum to their movement. And now that they've lost control they want to get rid of them. Sorry, but you're stuck married for life with those degenerates...because your lifestyle is frankly degenerate as well. permalink award report block reply\nthisguy883 2 points 1 day ago dont care. they all get the rope. permalink award report block reply\nSkogin 2 points 1 day ago OG British articulation is a worthy aspiration. permalink award report block reply\nBrother_Bill 2 points 24 hours ago cry me a river. as you have sown, so shall you reap. permalink award report block reply\nn3IVI0 2 points 1 day ago Yes they are. Just because a pack of heathen degenerate faggots don't like how far society has fallen (and they helped push), they don't get to act like they had no part in its destruction. This is EXACTLY where their faggotry was always going to take us. permalink award report block reply\nTrump2024_LetsGOO 2 points 1 day ago No such thing as gay. Just mental illness. permalink award report block reply\nf_bastiat 1 points 1 day ago Based faggot. permalink award report block reply\nDjohnsonsgagreflex 1 points 1 day ago The only constant in the Marxists agenda is the revolution.  It’s why people who would otherwise hate and kill each other team up for the nebulous omni-cause of the left to fight against “the man”.  Once the revolution ends, suddenly they’re enemies and the new revolutionary cause and recruitment begins. permalink award report block reply\nChuj 1 points 1 day ago She makes a great deal of sense. Splitting LGB from QT+ would fracture that collection as they fought amongst themselves. We should support opinions like this old L espouses permalink award report block reply\nSmokeyAF 1 points 1 day ago 100% permalink award report block reply\npugsan 1 points 20 hours ago At one of it's finally understanding. permalink award report block reply\nAgent_86 1 points 1 day ago DFV!! permalink award report block reply\nSo_Much_Happening 1 points 1 day ago LGBT rhymes with POOPY!  LGB rhymes with poopy, LG rhymes with poopy, but not L!  She wins! lol permalink award report block reply\nPowerOfBlues 1 points 1 day ago It wasn't a legitimate civil rights movement... and it wasn't hijacked..... It was created by the wealthy and the powerful ... and people like this lady were recruited to serve as it's useful idiots decades ago.... In order to give this movement the facade of legitimacy....to help them to eventually get to where we are now This lady ought to ask herself why so many powerful institutions ....who held back on giving full-throated support to gay rights for many decades... are so gung-ho about pushing the tranny stuff now? Because gay rights was never a grassroots movement...... They just took great pains to make it appear that way... while they were waiting for several generations of socially conservative geezers to die off and simultaneously indoctrinating several new generations into a leftist worldview All these powerful institutions have now revealed their true agenda all along....They're not pandering under pressure ....they're just ripping off the mask that they've been wearing this whole time permalink award report block reply\nbtntx 0 points 1 day ago They were accepted. No one cared if their neighbor or aunt or uncle was gay - shit, they threw the best parties. They fucked up by letting these lunatics hijack their identity. Now they’re all considered to be mentally ill degenerate predators. permalink award report block reply Elencher 6 points 1 day ago Apparently we should have cared and we could have avoided our current social decay. permalink parent award report block reply thisguy883 5 points 1 day ago This. Its the mere fact that we even allowed gays to be gay in public, is the reason we are in this mess. Now we have child predators everywhere and gays fucking each other in congress on camera. All gays get the rope, no exceptions. permalink parent award report block reply lul_cheto 4 points 1 day ago Oh well, if they throw a good party then.... 🤡 permalink parent award report block reply\nElencher 6 points 1 day ago Apparently we should have cared and we could have avoided our current social decay. permalink parent award report block reply thisguy883 5 points 1 day ago This. Its the mere fact that we even allowed gays to be gay in public, is the reason we are in this mess. Now we have child predators everywhere and gays fucking each other in congress on camera. All gays get the rope, no exceptions. permalink parent award report block reply\nthisguy883 5 points 1 day ago This. Its the mere fact that we even allowed gays to be gay in public, is the reason we are in this mess. Now we have child predators everywhere and gays fucking each other in congress on camera. All gays get the rope, no exceptions. permalink parent award report block reply\nlul_cheto 4 points 1 day ago Oh well, if they throw a good party then.... 🤡 permalink parent award report block reply\nBe_The_Change 1 points 1 day ago Comment removed by community moderators. permalink award report block reply KuzoKevin OP 0 points 1 day ago I don't think a gay man should have kids with a hetero wife to maintain the nuclear family, and there was never any forced demolition. I don't mind gays being couples, but I oppose gay marriage. permalink parent award report block reply Be_The_Change 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nKuzoKevin OP 0 points 1 day ago I don't think a gay man should have kids with a hetero wife to maintain the nuclear family, and there was never any forced demolition. I don't mind gays being couples, but I oppose gay marriage. permalink parent award report block reply Be_The_Change 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nBe_The_Change 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:03:28.590144Z"
}