{
  "id": "1ARK9irVLe",
  "url": "https://patriots.win/p/1ARK9irVLe/progressivism-will-hollow-out-yo/c",
  "content": "296 Progressivism will hollow out your religion and wear its skin like a trophy posted 2 days ago by CounterStrike 28 comments award share download report block\n28 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style ColonelKlink 19 points 2 days ago They are demons that infiltrate and destroy from within. permalink award report block reply Friendly_B 5 points 2 days ago This happens and is real, but sadly they're not always demons.  We're looking at the fallen nature of man. permalink parent award report block reply SwampRangers 1 points 1 day ago Another Python sketch becomes reality. permalink parent award report block reply Filo76 10 points 2 days ago I thought she became married TO four men But it’s somehow worse… she married four dudes to each other. permalink award report block reply Friendly_B 10 points 2 days ago Oh you're right, I didn't get that at first from the wording. I'm not sure it's worse.  The Bible says that two men having sex is an abomination.  It says that a man who goes back to an ex-wife who has been with another man is an abomination. In either case it's an abomination. permalink parent award report block reply BidenShowerDrool 3 points 2 days ago It says that a man who goes back to an ex-wife who has been with another man is an abomination. Islam insists upon it and will not marry them unless the ex-wife has been nutted by some other Muslim. (This is just another  indicator it's a religion of Satan, only a demon revels in such degeneracy) permalink parent award report block reply Smurfection 2 points 2 days ago umm, no.  The Bibles says about marriage \"Let no man rip asunder what God has joined\".   Christian marriage is lifelong.   There aren't any ex wives or ex husbands among Christians who are married to Christians.    Divorce and remarriage is not acceptable. permalink parent award report block reply lifeisahologram 2 points 2 days ago And those 4 “married” dudes all went back to their home to have a massive orgy with 16 more random dudes they invited via an open house on Craigslist. permalink parent award report block reply SpellingContable 1 points 2 days ago If those 4 men form a train (likely) there would be 3 'wives' and 3 'husbands'. 'Crazy lady is pastor of a church' would be a better headline for the article. permalink parent award report block reply LaptopDied 5 points 2 days ago Genesis 2:24. permalink award report block reply Friendly_B 4 points 2 days ago Leviticus 20:13 permalink parent award report block reply twentytwentyfourr 4 points 2 days ago I dunno pastor, maybe crack that bible open from time to time permalink award report block reply mykillk 4 points 2 days ago Reformation was a mistake permalink award report block reply Friendly_B 3 points 2 days ago https://www.ncronline.org/vatican/vatican-news/vatican-approves-document-allowing-gay-men-become-priests-italy permalink parent award report block reply Smurfection 3 points 2 days ago Nope.  It was a provisional document by a couple of Italian bishops, not even cardinals and not a single one of them was part of the Vatican Curia. According to the 2005 Vatican instruction by the Vatican Congregation for Catholic Education, \"while the church deeply respects the people in question, it cannot admit to the seminary or to Holy Orders those who practice homosexuality, have deeply rooted homosexual tendencies or support the so-called gay culture.\" ^^^ That is not overturned by a handful of Italian bishops.  I will repeat AntiPope Francis' words that he said twice \"There is too much faggotry in the Church\".  It doesn't sound to me like faggotry is accepted.  It's still one of the five sins crying to Heaven for Vengeance.  The Catechism, every version since Trent, says homosexual actions are mortal sins. permalink parent award report block reply DelendaEstMarxismo 1 points 2 days ago Right and everyone should have stayed in the church where 58% of the clergy are gay and 80% in their most holy city are gay. 🙄 \"first take the log out of your own eye, and then you will see clearly to take the speck out of your brother’s eye.\" https://nypost.com/2019/02/14/80-percent-of-priests-in-the-vatican-are-gay-new-book/ https://www.usnews.com/news/articles/2013/07/29/catholic-priests-its-empirical-fact-that-many-clergy-are-gay permalink parent award report block reply Smurfection 3 points 2 days ago The book with that statistic was written by an old gay man.   I do not doubt that 80% of the curia is gay and there's a high rate of faggots in the bishoprics of Italy, especially around Rome, but that does not extend to the entire Catholic Church or even most bishops or priests.  It's well known that almost all big cities in western Europe, Canada and the U.S. have faggot bishops and cardinals but they are not the majority.   They are not the majority in their respective countries nor are they a majority worldwide. permalink parent award report block reply Rubicon47 1 points 1 day ago When Protestants say the Lord’s Prayer they end it with “For Yours is the kingdom, and the power, and the glory, forever and ever.” Catholics do not say this EXCEPT while at Mass (it is said by the Priest). They (of course) pilfered from the Catholic Mass, misinterpreted and made an error,  then call it their own. It was mistranslated into the KJV during the reformation and it stuck. I think this is hilarious and the joke that is the reformation! permalink parent award report block reply Smurfection 4 points 2 days ago Pastorella, wearing an alligator stole, marries four men.    St.Paul warned about this. permalink award report block reply _Sully_ 3 points 2 days ago And it's always this child-like shallow sentiment. permalink award report block reply Smurfection 3 points 2 days ago She's a pastorella wearing an alligator stole as if a stole is some cheeky piece of fashion accessory and not a religious symbol. permalink parent award report block reply Shmioighan 3 points 2 days ago When the woman who is pretending to be a pastor says \"God\", she is referring to herself, her only god. permalink award report block reply TrumpAndGodWin 2 points 2 days ago Or the god of the earth the devil. Sad. permalink parent award report block reply America_No_1 3 points 2 days ago Maybe we are in the end of times permalink award report block reply patrioticwinning3 2 points 2 days ago Now I get why people were always so dead set against whamen preachers... permalink award report block reply Rubicon47 2 points 1 day ago https://protestia.com/2025/11/10/protestant-pastor-announces-he-has-two-wives-claims-polygamy-is-biblical/ permalink parent award report block reply briansoprano 2 points 2 days ago No wonder Germans are into shit & piss porn permalink award report block reply CounterStrike OP 1 points 2 days ago https://x.com/AuronMacintyre/status/1987899460131659794#m https://nitter.net/AuronMacintyre/status/1987899460131659794 permalink award report block reply\nColonelKlink 19 points 2 days ago They are demons that infiltrate and destroy from within. permalink award report block reply Friendly_B 5 points 2 days ago This happens and is real, but sadly they're not always demons.  We're looking at the fallen nature of man. permalink parent award report block reply SwampRangers 1 points 1 day ago Another Python sketch becomes reality. permalink parent award report block reply\nFriendly_B 5 points 2 days ago This happens and is real, but sadly they're not always demons.  We're looking at the fallen nature of man. permalink parent award report block reply SwampRangers 1 points 1 day ago Another Python sketch becomes reality. permalink parent award report block reply\nSwampRangers 1 points 1 day ago Another Python sketch becomes reality. permalink parent award report block reply\nFilo76 10 points 2 days ago I thought she became married TO four men But it’s somehow worse… she married four dudes to each other. permalink award report block reply Friendly_B 10 points 2 days ago Oh you're right, I didn't get that at first from the wording. I'm not sure it's worse.  The Bible says that two men having sex is an abomination.  It says that a man who goes back to an ex-wife who has been with another man is an abomination. In either case it's an abomination. permalink parent award report block reply BidenShowerDrool 3 points 2 days ago It says that a man who goes back to an ex-wife who has been with another man is an abomination. Islam insists upon it and will not marry them unless the ex-wife has been nutted by some other Muslim. (This is just another  indicator it's a religion of Satan, only a demon revels in such degeneracy) permalink parent award report block reply Smurfection 2 points 2 days ago umm, no.  The Bibles says about marriage \"Let no man rip asunder what God has joined\".   Christian marriage is lifelong.   There aren't any ex wives or ex husbands among Christians who are married to Christians.    Divorce and remarriage is not acceptable. permalink parent award report block reply lifeisahologram 2 points 2 days ago And those 4 “married” dudes all went back to their home to have a massive orgy with 16 more random dudes they invited via an open house on Craigslist. permalink parent award report block reply SpellingContable 1 points 2 days ago If those 4 men form a train (likely) there would be 3 'wives' and 3 'husbands'. 'Crazy lady is pastor of a church' would be a better headline for the article. permalink parent award report block reply\nFriendly_B 10 points 2 days ago Oh you're right, I didn't get that at first from the wording. I'm not sure it's worse.  The Bible says that two men having sex is an abomination.  It says that a man who goes back to an ex-wife who has been with another man is an abomination. In either case it's an abomination. permalink parent award report block reply BidenShowerDrool 3 points 2 days ago It says that a man who goes back to an ex-wife who has been with another man is an abomination. Islam insists upon it and will not marry them unless the ex-wife has been nutted by some other Muslim. (This is just another  indicator it's a religion of Satan, only a demon revels in such degeneracy) permalink parent award report block reply Smurfection 2 points 2 days ago umm, no.  The Bibles says about marriage \"Let no man rip asunder what God has joined\".   Christian marriage is lifelong.   There aren't any ex wives or ex husbands among Christians who are married to Christians.    Divorce and remarriage is not acceptable. permalink parent award report block reply\nBidenShowerDrool 3 points 2 days ago It says that a man who goes back to an ex-wife who has been with another man is an abomination. Islam insists upon it and will not marry them unless the ex-wife has been nutted by some other Muslim. (This is just another  indicator it's a religion of Satan, only a demon revels in such degeneracy) permalink parent award report block reply\nSmurfection 2 points 2 days ago umm, no.  The Bibles says about marriage \"Let no man rip asunder what God has joined\".   Christian marriage is lifelong.   There aren't any ex wives or ex husbands among Christians who are married to Christians.    Divorce and remarriage is not acceptable. permalink parent award report block reply\nlifeisahologram 2 points 2 days ago And those 4 “married” dudes all went back to their home to have a massive orgy with 16 more random dudes they invited via an open house on Craigslist. permalink parent award report block reply\nSpellingContable 1 points 2 days ago If those 4 men form a train (likely) there would be 3 'wives' and 3 'husbands'. 'Crazy lady is pastor of a church' would be a better headline for the article. permalink parent award report block reply\nLaptopDied 5 points 2 days ago Genesis 2:24. permalink award report block reply Friendly_B 4 points 2 days ago Leviticus 20:13 permalink parent award report block reply\nFriendly_B 4 points 2 days ago Leviticus 20:13 permalink parent award report block reply\ntwentytwentyfourr 4 points 2 days ago I dunno pastor, maybe crack that bible open from time to time permalink award report block reply\nmykillk 4 points 2 days ago Reformation was a mistake permalink award report block reply Friendly_B 3 points 2 days ago https://www.ncronline.org/vatican/vatican-news/vatican-approves-document-allowing-gay-men-become-priests-italy permalink parent award report block reply Smurfection 3 points 2 days ago Nope.  It was a provisional document by a couple of Italian bishops, not even cardinals and not a single one of them was part of the Vatican Curia. According to the 2005 Vatican instruction by the Vatican Congregation for Catholic Education, \"while the church deeply respects the people in question, it cannot admit to the seminary or to Holy Orders those who practice homosexuality, have deeply rooted homosexual tendencies or support the so-called gay culture.\" ^^^ That is not overturned by a handful of Italian bishops.  I will repeat AntiPope Francis' words that he said twice \"There is too much faggotry in the Church\".  It doesn't sound to me like faggotry is accepted.  It's still one of the five sins crying to Heaven for Vengeance.  The Catechism, every version since Trent, says homosexual actions are mortal sins. permalink parent award report block reply DelendaEstMarxismo 1 points 2 days ago Right and everyone should have stayed in the church where 58% of the clergy are gay and 80% in their most holy city are gay. 🙄 \"first take the log out of your own eye, and then you will see clearly to take the speck out of your brother’s eye.\" https://nypost.com/2019/02/14/80-percent-of-priests-in-the-vatican-are-gay-new-book/ https://www.usnews.com/news/articles/2013/07/29/catholic-priests-its-empirical-fact-that-many-clergy-are-gay permalink parent award report block reply Smurfection 3 points 2 days ago The book with that statistic was written by an old gay man.   I do not doubt that 80% of the curia is gay and there's a high rate of faggots in the bishoprics of Italy, especially around Rome, but that does not extend to the entire Catholic Church or even most bishops or priests.  It's well known that almost all big cities in western Europe, Canada and the U.S. have faggot bishops and cardinals but they are not the majority.   They are not the majority in their respective countries nor are they a majority worldwide. permalink parent award report block reply Rubicon47 1 points 1 day ago When Protestants say the Lord’s Prayer they end it with “For Yours is the kingdom, and the power, and the glory, forever and ever.” Catholics do not say this EXCEPT while at Mass (it is said by the Priest). They (of course) pilfered from the Catholic Mass, misinterpreted and made an error,  then call it their own. It was mistranslated into the KJV during the reformation and it stuck. I think this is hilarious and the joke that is the reformation! permalink parent award report block reply\nFriendly_B 3 points 2 days ago https://www.ncronline.org/vatican/vatican-news/vatican-approves-document-allowing-gay-men-become-priests-italy permalink parent award report block reply Smurfection 3 points 2 days ago Nope.  It was a provisional document by a couple of Italian bishops, not even cardinals and not a single one of them was part of the Vatican Curia. According to the 2005 Vatican instruction by the Vatican Congregation for Catholic Education, \"while the church deeply respects the people in question, it cannot admit to the seminary or to Holy Orders those who practice homosexuality, have deeply rooted homosexual tendencies or support the so-called gay culture.\" ^^^ That is not overturned by a handful of Italian bishops.  I will repeat AntiPope Francis' words that he said twice \"There is too much faggotry in the Church\".  It doesn't sound to me like faggotry is accepted.  It's still one of the five sins crying to Heaven for Vengeance.  The Catechism, every version since Trent, says homosexual actions are mortal sins. permalink parent award report block reply\nSmurfection 3 points 2 days ago Nope.  It was a provisional document by a couple of Italian bishops, not even cardinals and not a single one of them was part of the Vatican Curia. According to the 2005 Vatican instruction by the Vatican Congregation for Catholic Education, \"while the church deeply respects the people in question, it cannot admit to the seminary or to Holy Orders those who practice homosexuality, have deeply rooted homosexual tendencies or support the so-called gay culture.\" ^^^ That is not overturned by a handful of Italian bishops.  I will repeat AntiPope Francis' words that he said twice \"There is too much faggotry in the Church\".  It doesn't sound to me like faggotry is accepted.  It's still one of the five sins crying to Heaven for Vengeance.  The Catechism, every version since Trent, says homosexual actions are mortal sins. permalink parent award report block reply\nDelendaEstMarxismo 1 points 2 days ago Right and everyone should have stayed in the church where 58% of the clergy are gay and 80% in their most holy city are gay. 🙄 \"first take the log out of your own eye, and then you will see clearly to take the speck out of your brother’s eye.\" https://nypost.com/2019/02/14/80-percent-of-priests-in-the-vatican-are-gay-new-book/ https://www.usnews.com/news/articles/2013/07/29/catholic-priests-its-empirical-fact-that-many-clergy-are-gay permalink parent award report block reply Smurfection 3 points 2 days ago The book with that statistic was written by an old gay man.   I do not doubt that 80% of the curia is gay and there's a high rate of faggots in the bishoprics of Italy, especially around Rome, but that does not extend to the entire Catholic Church or even most bishops or priests.  It's well known that almost all big cities in western Europe, Canada and the U.S. have faggot bishops and cardinals but they are not the majority.   They are not the majority in their respective countries nor are they a majority worldwide. permalink parent award report block reply\nSmurfection 3 points 2 days ago The book with that statistic was written by an old gay man.   I do not doubt that 80% of the curia is gay and there's a high rate of faggots in the bishoprics of Italy, especially around Rome, but that does not extend to the entire Catholic Church or even most bishops or priests.  It's well known that almost all big cities in western Europe, Canada and the U.S. have faggot bishops and cardinals but they are not the majority.   They are not the majority in their respective countries nor are they a majority worldwide. permalink parent award report block reply\nRubicon47 1 points 1 day ago When Protestants say the Lord’s Prayer they end it with “For Yours is the kingdom, and the power, and the glory, forever and ever.” Catholics do not say this EXCEPT while at Mass (it is said by the Priest). They (of course) pilfered from the Catholic Mass, misinterpreted and made an error,  then call it their own. It was mistranslated into the KJV during the reformation and it stuck. I think this is hilarious and the joke that is the reformation! permalink parent award report block reply\nSmurfection 4 points 2 days ago Pastorella, wearing an alligator stole, marries four men.    St.Paul warned about this. permalink award report block reply\n_Sully_ 3 points 2 days ago And it's always this child-like shallow sentiment. permalink award report block reply Smurfection 3 points 2 days ago She's a pastorella wearing an alligator stole as if a stole is some cheeky piece of fashion accessory and not a religious symbol. permalink parent award report block reply\nSmurfection 3 points 2 days ago She's a pastorella wearing an alligator stole as if a stole is some cheeky piece of fashion accessory and not a religious symbol. permalink parent award report block reply\nShmioighan 3 points 2 days ago When the woman who is pretending to be a pastor says \"God\", she is referring to herself, her only god. permalink award report block reply TrumpAndGodWin 2 points 2 days ago Or the god of the earth the devil. Sad. permalink parent award report block reply\nTrumpAndGodWin 2 points 2 days ago Or the god of the earth the devil. Sad. permalink parent award report block reply\nAmerica_No_1 3 points 2 days ago Maybe we are in the end of times permalink award report block reply\npatrioticwinning3 2 points 2 days ago Now I get why people were always so dead set against whamen preachers... permalink award report block reply Rubicon47 2 points 1 day ago https://protestia.com/2025/11/10/protestant-pastor-announces-he-has-two-wives-claims-polygamy-is-biblical/ permalink parent award report block reply\nRubicon47 2 points 1 day ago https://protestia.com/2025/11/10/protestant-pastor-announces-he-has-two-wives-claims-polygamy-is-biblical/ permalink parent award report block reply\nbriansoprano 2 points 2 days ago No wonder Germans are into shit & piss porn permalink award report block reply\nCounterStrike OP 1 points 2 days ago https://x.com/AuronMacintyre/status/1987899460131659794#m https://nitter.net/AuronMacintyre/status/1987899460131659794 permalink award report block reply",
  "fetched_at": "2025-11-12T21:24:00.269248Z"
}