{
  "id": "8173767",
  "title": "1568Who ever would have ever guessed that such a lovely woman could be capable of such degeneracy.po",
  "url": "https://patriots.win/p/1ARK54Tb5r/who-ever-would-have-ever-guessed/c",
  "content": "1568 Who ever would have ever guessed that such a lovely woman could be capable of such degeneracy. posted 5 days ago by KuzoKevin 167 comments award share report block Libs of TikTok @libsoftiktok • 5d BREAKING: New Hampshire’s first transgender elected Rep. Stacie Laughton, pleaded guilty to child exploitation charges. He reportly asked his partner who worked in a daycare to send him nude photos of kids. Eric Swalwell campaigned with him.\n167 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Bullet3250 121 points 5 days ago not even human, no soul left ... demon possessed. permalink award report block reply Please_Clap 50 points 5 days ago Democrat leadership's goal is to empower the mentally weak, professionally incapable, and nurtures them into power. That is one critical way the Dems are collapsing this country. Think Maxine Waters, AOC, Illhan Omar, Swalwell, Beto, and the list goes on and on. This is a major Democrat strategy to topple our nation. permalink parent award report block reply Here_we_go 23 points 5 days ago HIJACK COMMENT WHAT ABOUT HIS PARTNER INVOLVED????????? OBVIOUSLY  THEY BOTH WERE INTO IT. Sorry this is fucking sick. permalink parent award report block reply Luvs_2_Bop 13 points 5 days ago Burn them both with fire. permalink parent award report block reply Here_we_go 7 points 5 days ago This permalink parent award report block reply view 1 more comments... SPEDMan64 2 points 5 days ago Not enough to end them outright; enough to make them linger for days afterward in agony until death saves them. permalink parent award report block reply view 1 more comments... HockeyMom4Trump 6 points 5 days ago Yes. Disgusting. If my husband ever asked for anything like that he would be my ex -husband and in jail! Terrible! permalink parent award report block reply Govtizbad 11 points 5 days ago Transgenderism is a fetish heavily linked to pedophilia Homosexuality in general is more likely to be pedophiles but especially transgenderism edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply DanIsSwell 1 points 5 days ago The partner works in a daycare? You know they’re both into cp together, if he feels comfortable asking for nude kid pictures. Every parent with a kid there better be aware of this. They have to be retarded liberals to drop their kids off with that guy in the first place. permalink parent award report block reply Bullet3250 6 points 5 days ago When you see Kamala - running for Presidency of the USA - and she can't even complete a full sentence, and dives into circular logic ALL THE TIME... AND THEN SHE GETS 75 MILLION VOTES - I am worried for this Nation in more ways than one. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago Successful nations used to practice exile of incompatible dangers to a country. permalink parent award report block reply Mr_Rightside 16 points 5 days ago New Hampshire transgender Rep Barry \"Stacie\" Laughton just pleaded guilty to child exploitation charges. He will be sentenced in February and faces up to 30 years in prison. He posted this deranged video running away from police claiming they won’t catch him. This didn’t age well! https://x.com/libsoftiktok/status/1986822538496733600 New Hampshire transgender Rep Stacie Laughton just pleaded guilty to child exploitation charges. He will be sentenced in February and faces up to 30 years in prison. He posted this deranged video running away from police claiming they won’t catch him. This didn’t age well! He was first elected to the Nashua Board of Selectmen in 2012, becoming the first transgender elected official in New Hampshire. Criminal History and Resignations : In 2012, Laughton resigned from the New Hampshire House of Representatives after it was revealed he had a felony conviction and had not completed his sentence, making him ineligible to hold office. He was later arrested in 2015 for making a bomb threat to Southern New Hampshire Medical Center, receiving a six-month jail sentence. In 2021, he was arrested for sending false emergency texts to the Nashua 911 system. 2022 Stalking Charges : Laughton was arrested in November 2022 for violating a restraining order against a woman, leading to his resignation from the state legislature just days after re-election. The incident involved repeated attempts to contact the victim despite the court order. 2023 Child Pornography Charges : On June 23, 2023, Laughton was arrested on charges of distributing sexually explicit images of children.\nThe investigation began after a report of a juvenile incident, leading to a search of his residence and his subsequent arrest.\nHe was also charged with aiding and abetting in the sexual exploitation of children. As of July 2023, he was held in preventive detention and scheduled for arraignment. permalink parent award report block reply SaltyTitties4 11 points 5 days ago If this doesn’t show yall that ALL elections are fixed, I don’t know what will. permalink parent award report block reply Sgt_Hulka 8 points 5 days ago Fuck every democrat and New Hampshire moron who votes blue no matter who. I hate the left. permalink parent award report block reply anotherthing 2 points 5 days ago I would have thought \"no matter who\" would have some limitations, but here we are. permalink parent award report block reply gustodog 5 points 5 days ago His original felony conviction was seemingly for credit card fraud. https://patch.com/new-hampshire/nashua/newly-elected-nashua-rep-served-time-in-laconia permalink parent award report block reply Twitter 7 points 5 days ago the fucking gay rainbow mask is using all it's faggot energy like captain planet to not rip  on that land demons face, ripping a vortex right through the space time continuum. permalink parent award report block reply NotYourMan 3 points 5 days ago And we are not surprised.  If liberals are paying attention then they realize why we were against the trans-movement.  Of course stealing children from their parents and forcing them to take pre-puberty blockers and get trans surgery was also a big deal. permalink parent award report block reply Psarg 2 points 5 days ago He's wearing a badge that says \"Clergy\" permalink parent award report block reply SPEDMan64 1 points 5 days ago Church of Satan. permalink parent award report block reply load 1 more comments... KuzoKevin OP 85 points 5 days ago He looks exactly like what a tranny child molester should look like. permalink award report block reply RedStoneDeepState 53 points 5 days ago He looks alive, so I disagree permalink parent award report block reply Hckyhillbilly 14 points 5 days ago Comment of the day. Well done rsds. permalink parent award report block reply MAGABOND 5 points 5 days ago Yeah, he’s not feeding enough worms in these pics. permalink parent award report block reply imnotdeadyet 1 points 5 days ago If he ends up in male prison, his worm eating will begin shorty. permalink parent award report block reply MAGABOND 1 points 5 days ago Not worm eating, he needs to be worm feeding. permalink parent award report block reply view 1 more comments... Quietam_Unum 1 points 5 days ago \"Buzzards got to eat same as worms.\"  -- The Outlaw Josie Wales permalink parent award report block reply Breacherbear 1 points 5 days ago Insert gigachad meme permalink parent award report block reply B-2StealthTrump 16 points 5 days ago That faggot has a “Clergy” badge on in the second pic… investigate that pedo “church”. permalink parent award report block reply TruthyBrat 8 points 5 days ago Probably Unitarians or similar. permalink parent award report block reply TrumpAndGodWin 1 points 5 days ago Or Lutherans or maybe the L stands for Luciferian church. permalink parent award report block reply TruthyBrat 2 points 5 days ago Oh, I missed that, mea culpa. Yeah, the Leftist Lutherans aren't far from Unitarians these days. Might as well be Lucifarian. permalink parent award report block reply ListenToSavage 3 points 5 days ago It's that bs Universal Life Church online thing you can pay like 50 bucks to become an \"ordained minister\" so that you can officiate a wedding. permalink parent award report block reply TheMostUselessFeeder 9 points 5 days ago This post needed at least three layers of warnings/spoilers. My eyes 😭 permalink parent award report block reply Lady_MaGa 2 points 5 days ago He looks like the Dexter character to me. permalink parent award report block reply Induceddrag 51 points 5 days ago Elected three times, resigned twice due to legal issues.  Makes one wonder about the voters in that district. permalink award report block reply KuzoKevin OP 23 points 5 days ago Virtue points. permalink parent award report block reply War_Hamster 7 points 5 days ago That's about 50 miles from me, and I thought all the freaks were here. permalink parent award report block reply YT45 28 points 5 days ago I’m noticing a trend with “trans women…” permalink award report block reply memechallenger33 14 points 5 days ago They all have… um… female pattern baldness? permalink parent award report block reply YT45 4 points 5 days ago Among other things… permalink parent award report block reply BigMikesSwingingCock 5 points 5 days ago Normally, I would make a tranny remark, or joke, but that is the ugliest motherfucker I've ever seen. Actually a deformed freak that's too ugly for the circus. permalink parent award report block reply anotherthing 1 points 5 days ago If Buffalo Bill were played by Sloth from Goonies. permalink parent award report block reply AynRand22 18 points 5 days ago Not surprised permalink award report block reply RizzlieDoodad 15 points 5 days ago That's a demon, not a person permalink award report block reply Dev404 14 points 5 days ago Democrats are pedophiles and pedophile enablers. The pattern continues. permalink award report block reply RedditStillSucks 14 points 5 days ago 100% of the time. No exception. Just those that haven't been caught yet. permalink award report block reply WanderingStar 11 points 5 days ago I'm sure Eric has carnal knowledge. permalink award report block reply Meister_Bockmist 2 points 5 days ago Eric's favorite hobby? Pegging in Bejing. permalink parent award report block reply Lol_Garrus 11 points 5 days ago physiognomy rarely lies. permalink award report block reply RememberCharlieKirk 4 points 5 days ago I do wonder... Does the wickedness of a person create the unpleasant physiognomy or does the unpleasant physiognomy assist in creating the wickedness? Wicked thoughts morph the face into ugliness Or an ugly face morphs the thoughts into wickedness permalink parent award report block reply Lol_Garrus 8 points 5 days ago I believe its the wickedness. When you void your soul of the Holy Spirit, you don't have the Holy Spirit's lifeforce within you. Thus, your body ages and degenerates much faster, you lose interest in taking care of your body, no self-respect, etc. I have the Holy Spirit within my body and soul, and He limit-breaks my immune system, allowing it to go Super Saiyan. permalink parent award report block reply RememberCharlieKirk 6 points 5 days ago I agree. Compare pictures of younger Victoria Nuland to current pictures of her. She, an architect of the troubles plaguing Ukraine, must bear plenty of wickedness -- and her uglification shows it. And I commend you on your fantastic immune system! permalink parent award report block reply Lol_Garrus 5 points 5 days ago Haven't been sick (for real) in years! ✝️🏋️ But even my health were to fall, it's all good. My soul belongs to Christ. permalink parent award report block reply view 2 more comments... TruthyBrat 4 points 5 days ago Find the recent back then vs. now thread of Stormy Daniels. As someone noted, she hit the wall at 100 mph! Ping to u/Lol_Garrus permalink parent award report block reply TrumpAndGodWin 2 points 5 days ago Nulands's communist family has a blood feud vs Russia. permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Same with Clinton permalink parent award report block reply view 3 more comments... AmarilloArmadillo 4 points 5 days ago I think the second point has merit, but I'd word it differently. I don't think being ugly makes them evil, but being a certain kind of ugly may be associated with a certain predisposition to evil. I think evil changes the outward to match the inward (eventually anyway) too, so it might be a distinction without a difference. I don't trust people that look like this, and they'll never be near my kids even if they aren't evil. I also just generally don't trust my kids to anyone but immediate family. permalink parent award report block reply Decepticons-superior 2 points 5 days ago This is like when Palpatine became deformed while fighting Mace Windu. I always wondered if he was hiding his true face or if the evil of what he was doing in that moment mutated him. permalink parent award report block reply RememberCharlieKirk 3 points 5 days ago Like with his refusal in naming Yoda's alien species, George Lucas will probably never provide clarification on Palpatine's transformation. The actor who played the role, Ian McDiarmid, seems to agree with your first option: The uglier form of Palpatine was \"what he always looked like\" due to his evilness; the kind, non-disfigured-looking form was a disguise that was no longer needed upon his ascension to the throne. permalink parent award report block reply Yignuced 10 points 5 days ago Shocked permalink award report block reply tt777 2 points 5 days ago Not shocked. permalink parent award report block reply toofdood1993 9 points 5 days ago woman? that's a fucking dude, call it what it is, not what it wants to be this is why you don't let these faggots around your children. If this creature had a significant other, I'm sure it didn't look much different than this Jaba the hut lookin ass. permalink award report block reply Helldiver 7 points 5 days ago Clergy badge? What the fuck? Church of Satan no doubt. permalink award report block reply KuzoKevin OP 4 points 5 days ago I've got the same badge..  It costs about $35 to become a minister on line. permalink parent award report block reply Filo76 6 points 5 days ago 🤢 🤮 permalink award report block reply roflcopt0rz_returns 6 points 5 days ago Why are so many trannies fat, ugly, balding white guys? A lot of it starts with how the left demonizes white men as the root of all evil (heaven forbid you’re straight, Christian, etc.). High T men can block out the noise and live their own lives, but weak white men cannot live their lives through the shame and insults, and so they turn to transgenderism as a way to virtue signal. permalink award report block reply anotherrandomname 1 points 5 days ago They're degenerate fetishists. Can't get any in real life because they're disgusting freaks so they descend into a deviant porn induced psychosis. Also explains why troons hate women so much, because they're butthurt about not getting laid. \"Suck the girl dick, bigot!\" they screech at actually female lesbians... lol. permalink parent award report block reply Formerlurker92 5 points 5 days ago Do we expect anything less? permalink award report block reply SweetBeef 4 points 5 days ago WTF... Swallwell is a California representative. He had to reach out to get tangled up with a PDF troon in the northeast. permalink award report block reply Formerlurker92 4 points 5 days ago How soon till some biden appointee pardons them without a trial permalink award report block reply PeaceMakerDJT 4 points 5 days ago Unfortunately, our politicians and people in high positions are being blackmailed by these materials permalink award report block reply TheRPatriot 4 points 5 days ago What in the actual fuck is going on in this country. How in the world could that freakazoid be elected in NEW HAMPSHIRE of all states. Supposedly the last state in New England with a semblance of conservatism permalink award report block reply KuzoKevin OP 1 points 5 days ago Nashua. permalink parent award report block reply Brookes 4 points 5 days ago We’re gonna need a bigger wood chipper permalink award report block reply Icekickass 4 points 5 days ago Costanza must have fallen pretty hard after the Vandelay industries buy out permalink award report block reply jsphere256 3 points 5 days ago partner Not even once permalink award report block reply EdBuck 3 points 5 days ago Fucking gross permalink award report block reply cyberwar 3 points 5 days ago and yet he would still win an election if allowed to run permalink award report block reply TheMrStone 3 points 5 days ago Edit: My honest reaction to that... thing https://www.youtube.com/watch?v=tbHxwsE2ZAI permalink award report block reply Repentnow 1 points 5 days ago If you're going to post a YouTube link, at least post a one liner descriptions.  I'm not clicking on any friggin YouTube link without knowing what's there. permalink parent award report block reply TheMrStone 2 points 5 days ago Oh, fair. I just felt the link spoke for itself. permalink parent award report block reply Agent_86 3 points 5 days ago Deleted from view permalink award report block reply uxername27 1 points 5 days ago I see you post this comment from time to time. What does it mean? permalink parent award report block reply ythehorses 2 points 5 days ago They are ALL freaking perverts. permalink award report block reply Alldayeveryday 2 points 5 days ago Just despose of these pieces garbage permalink award report block reply gorilla_grip 2 points 5 days ago There’s a tranny running for governor in Idaho as a socialist, it would be a shame if someone looked at his computer for cp permalink award report block reply ChyNahAzzWhole1 2 points 5 days ago CLERGY?!? permalink award report block reply Afeazo 2 points 5 days ago You know there are men out there who do look feminine, so why does it always seem to be the most buttfuck ugly, fat, male pattern baldness dudes are always the ones who claim to be women? permalink award report block reply Repentnow 2 points 5 days ago Ugly on the outside = ugly in the soul. permalink award report block reply Hydris 2 points 5 days ago It’s not a matter of IF they are, it’s WHEN they are exposed. permalink award report block reply HockeyMom4Trump 2 points 5 days ago Mentally ill. I am\nFatigued. permalink award report block reply TruculentGoose 2 points 5 days ago Swallowswell looks 1000 times gayer standing next to it permalink award report block reply goatnuts 2 points 5 days ago You can spot these fucking freaks from across the room. This is the low hanging fruit, how these people get away with it for so long I'm baffled. permalink award report block reply f_bastiat 2 points 5 days ago The wiki page is killing me, they keep switching from he and she in the same sentence and it's so confusing. https://en.wikipedia.org/wiki/Stacie-Marie_Laughton permalink award report block reply Pappy_Gunn 1 points 5 days ago Played a game  (Xcom chimera squad) where you were forced to play diverse characters.  Most of them girlboss wahmyn with they/them pronouns.  It was next to impossible to make senses of the captions or descriptions.  You didn't know if they were talking about the platoon, a group of people/aliens or an individual.   Some people had regular pronounds just to screw things up more. permalink parent award report block reply f_bastiat 1 points 5 days ago I believe it, woke kills everything it touches. I never played the newer xcom but I used to play X-Com Terror From the Deep in elementary school. That was back when games were very unforgiving. permalink parent award report block reply Pappy_Gunn 1 points 5 days ago TFTD was hard and creepy.  Especially when they took over your soldiers and the squad would just melt away. permalink parent award report block reply DontTreadOnSnek 2 points 5 days ago Faggots should not be anywhere near children, especially daycare. permalink award report block reply Zippythekid 2 points 5 days ago Gross permalink award report block reply DT170x 2 points 5 days ago This is my surprise face. 😐 Notice it not even surprised at all. permalink award report block reply ConfusedAngryArmed 1 points 5 days ago Ears below the eyeline, weak jaw, receding hairline, faggoty ass glasses. It's so predictable that it's laughable. permalink award report block reply IAmDisappoint 1 points 5 days ago Woodchipper permalink award report block reply TheSonOfGadsden 1 points 5 days ago Pedo fag deserves to go feet first into the wood chipper permalink award report block reply Deplorable_in_PA 1 points 5 days ago \"Stacy\" might want to start stocking up on Rogaine.  And Dafuq is wrong with NH that they allow his partner to work in a day care center? permalink award report block reply 24NoMoreBullshit 1 points 5 days ago Bucks County better be on watch with their new tranny just elected. permalink award report block reply Mungo 1 points 5 days ago Kill it permalink award report block reply asdrubael_was_right 1 points 5 days ago This story is gross. This things partner worked in daycare and took kids to the bathroom to photograph them and text the pics to him. permalink award report block reply anti_masker 1 points 5 days ago dude is full on balding lol permalink award report block reply BigPoppaPossum 1 points 5 days ago Oh... I'm shocked... That thing that they say doesn't happen, happened again... never would've thought a tranny would be a pedophile */s permalink award report block reply thisisatestof2 1 points 5 days ago Im beginning to see a pattern here. permalink award report block reply quiznossucks 1 points 5 days ago Gee...I am surprised... permalink award report block reply WarViper1337 1 points 5 days ago Why do they always look like this. Must be some kind of built in genetic warning or something. permalink award report block reply SaltyTitties4 1 points 5 days ago He’s wearing a “Clergy” badge. permalink award report block reply FuckU/Spez 1 points 5 days ago While I would never bend a knee to islame, they do make a very good case for tossing them from rooftops... permalink award report block reply kobe525z 1 points 5 days ago Wow I’m shocked who would have thought a degenerate freakazoid would engage in degenerate behavior ! permalink award report block reply Spacemonkey 1 points 5 days ago The only cure for degenerate faggots is death permalink award report block reply donkeyKang 1 points 5 days ago Handsome even! LOLOLOL permalink award report block reply GoldwaterVoter 1 points 5 days ago Scroll down the comments and see the INCREDIBLE CRIMINAL history BEFORE he was elected or \"transitioned\". https://xcancel.com/libsoftiktok/status/1986822538496733600 Both Beto and Swallowell could have and should have done background check on him BEFORE they campaigned for him. Campaign pics in the extended X post. permalink award report block reply NonbinaryPotatohead 1 points 5 days ago the fuckin hairline on that thing permalink award report block reply TrumpIsTheVictor 1 points 5 days ago What the fuck is that? permalink award report block reply blueeyephoto 1 points 5 days ago which one? permalink award report block reply Fourtyandfourtyfive 1 points 5 days ago Worse case of male pattern baldness I’ve seen in a woman. permalink award report block reply Megabrain1960 1 points 5 days ago Does it know it's bald? permalink award report block reply cd3dog 1 points 5 days ago Amazing what can get elected these days. permalink award report block reply geckofishknight 1 points 5 days ago nurgling permalink award report block reply seattlerunner 1 points 5 days ago What a FREAK permalink award report block reply RememberCharlieKirk 1 points 5 days ago Eric Swalwell uses \"Stacie\" Laughton as his wingman, because even a weird-looking guy like Swalwell looks better when standing next to a freak like Laughton. permalink award report block reply True_Curmudgeon 1 points 5 days ago Execute permalink award report block reply LibertyFox 1 points 4 days ago His copious flop sweat would provide ample lubrication for the woodchipper. permalink award report block reply IllKissYourBoobies 1 points 5 days ago It's Riff Raff. permalink award report block reply Retard_Strength 1 points 5 days ago any parents who knowingly left their child with this freak should also face charges permalink award report block reply Lorrainer 1 points 5 days ago He looks vaxxed. permalink award report block reply donteatthat 1 points 5 days ago DEATH permalink award report block reply BlueKentuckyGirl 1 points 5 days ago Nasty. Looks like the same house swindling Andy Beshear was in the other day. The Beshear family here in KY were in big time on the Medicaid expansion grift. permalink award report block reply Krampus5150 1 points 5 days ago Kill it permalink award report block reply dtrap 1 points 5 days ago Breaking news! The mentally disturbed do disturbing things! News at 11! permalink award report block reply LearnAboutRoaches 1 points 5 days ago Reportly lol. Big boned breaking news permalink award report block reply Pappy_Gunn 1 points 5 days ago Pedos go where the kids are.  Parents that put their kids in daycares with weirdos as staff are just not paying attention. permalink award report block reply Roadpower 1 points 5 days ago A troon is going to troon but really the major problem here is the judgment of Swalwell. With a judgment that bad he should be nowhere near a position of power and influence. permalink award report block reply mykillk 1 points 5 days ago How do you look at that thing and go \"yeah, that's what I want representing my interests in state government\"? permalink award report block reply throttlejohnson 1 points 5 days ago ewe...just threw up some permalink award report block reply someguy7738 1 points 5 days ago What, a disgusting troon is a child molester? Who could possibly have seen this coming?? :O permalink award report block reply alucard13mmfmj 1 points 5 days ago Study is right where if you see 2 men kissing, it illicits the same reaction as a writhing blob of maggots on rotten meat. Now multiply that 100x.. with dog shit, agent orange and dish water. permalink award report block reply Motownmow 1 points 5 days ago I hate that faggot. Also the laughton dude permalink award report block reply Rydanovich 1 points 5 days ago Reddit is pissed about this. Not because of the actual crime, but because riGhT wRInGers WIlL uSe ThiS To DemoNiZe TraNs permalink award report block reply Maenard 1 points 5 days ago Laughton... Laugh ton.  A fat freak is hilarious. permalink award report block reply The_Morrow_Outlander 1 points 5 days ago Like... he's not even trying to look like a woman. I'm one of the more open-minded people here on the subject of intersex conditions, but if you're not compelled to actually act or at least make yourself look like the well-adjusted members of your alleged sex, you're just a cross-dressing pervert. A HEALTHY woman with a hairline anywhere close to that bad and a stature like this would get called a dude, and not out of malice. permalink award report block reply AwShitHereWeGoAgain 1 points 5 days ago Woodchipper.  Immediately. permalink award report block reply bluewhiteandred 1 points 5 days ago will never be an woman permalink award report block reply SaltExtractor 1 points 5 days ago Imagine how shocked I am....not. permalink award report block reply hellokutie 1 points 5 days ago What a surprise!  I've never guess by looking at \"it\". permalink award report block reply AnAmishWithATude 1 points 5 days ago No woman in this post. permalink award report block reply Jmricht 1 points 5 days ago That’s no woman permalink award report block reply RememberCharlieKirk 1 points 5 days ago Two pictures that just carry a stench to them. \"Imagine the smell.\" permalink award report block reply barefootozark 1 points 5 days ago His badge says \"Clergy\".  JFC. permalink award report block reply bubadmt 0 points 5 days ago Hey, cool it with the antisemitism and antitrans. permalink award report block reply Toddyoungsvagina 0 points 5 days ago 5 head permalink award report block reply maverick202 -1 points 5 days ago Yikes white troon caught doing pedo stuff again.. Paging u/UCantStumpTheTrump permalink award report block reply UCantStumpTheTrump 1 points 5 days ago u/maverick202 is a self-described troll who comes here to insult this community and call people \"white trash\" and \"incels\" - hit that deport button! permalink parent award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nBullet3250 121 points 5 days ago not even human, no soul left ... demon possessed. permalink award report block reply Please_Clap 50 points 5 days ago Democrat leadership's goal is to empower the mentally weak, professionally incapable, and nurtures them into power. That is one critical way the Dems are collapsing this country. Think Maxine Waters, AOC, Illhan Omar, Swalwell, Beto, and the list goes on and on. This is a major Democrat strategy to topple our nation. permalink parent award report block reply Here_we_go 23 points 5 days ago HIJACK COMMENT WHAT ABOUT HIS PARTNER INVOLVED????????? OBVIOUSLY  THEY BOTH WERE INTO IT. Sorry this is fucking sick. permalink parent award report block reply Luvs_2_Bop 13 points 5 days ago Burn them both with fire. permalink parent award report block reply Here_we_go 7 points 5 days ago This permalink parent award report block reply view 1 more comments... SPEDMan64 2 points 5 days ago Not enough to end them outright; enough to make them linger for days afterward in agony until death saves them. permalink parent award report block reply view 1 more comments... HockeyMom4Trump 6 points 5 days ago Yes. Disgusting. If my husband ever asked for anything like that he would be my ex -husband and in jail! Terrible! permalink parent award report block reply Govtizbad 11 points 5 days ago Transgenderism is a fetish heavily linked to pedophilia Homosexuality in general is more likely to be pedophiles but especially transgenderism edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply DanIsSwell 1 points 5 days ago The partner works in a daycare? You know they’re both into cp together, if he feels comfortable asking for nude kid pictures. Every parent with a kid there better be aware of this. They have to be retarded liberals to drop their kids off with that guy in the first place. permalink parent award report block reply Bullet3250 6 points 5 days ago When you see Kamala - running for Presidency of the USA - and she can't even complete a full sentence, and dives into circular logic ALL THE TIME... AND THEN SHE GETS 75 MILLION VOTES - I am worried for this Nation in more ways than one. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago Successful nations used to practice exile of incompatible dangers to a country. permalink parent award report block reply Mr_Rightside 16 points 5 days ago New Hampshire transgender Rep Barry \"Stacie\" Laughton just pleaded guilty to child exploitation charges. He will be sentenced in February and faces up to 30 years in prison. He posted this deranged video running away from police claiming they won’t catch him. This didn’t age well! https://x.com/libsoftiktok/status/1986822538496733600 New Hampshire transgender Rep Stacie Laughton just pleaded guilty to child exploitation charges. He will be sentenced in February and faces up to 30 years in prison. He posted this deranged video running away from police claiming they won’t catch him. This didn’t age well! He was first elected to the Nashua Board of Selectmen in 2012, becoming the first transgender elected official in New Hampshire. Criminal History and Resignations : In 2012, Laughton resigned from the New Hampshire House of Representatives after it was revealed he had a felony conviction and had not completed his sentence, making him ineligible to hold office. He was later arrested in 2015 for making a bomb threat to Southern New Hampshire Medical Center, receiving a six-month jail sentence. In 2021, he was arrested for sending false emergency texts to the Nashua 911 system. 2022 Stalking Charges : Laughton was arrested in November 2022 for violating a restraining order against a woman, leading to his resignation from the state legislature just days after re-election. The incident involved repeated attempts to contact the victim despite the court order. 2023 Child Pornography Charges : On June 23, 2023, Laughton was arrested on charges of distributing sexually explicit images of children.\nThe investigation began after a report of a juvenile incident, leading to a search of his residence and his subsequent arrest.\nHe was also charged with aiding and abetting in the sexual exploitation of children. As of July 2023, he was held in preventive detention and scheduled for arraignment. permalink parent award report block reply SaltyTitties4 11 points 5 days ago If this doesn’t show yall that ALL elections are fixed, I don’t know what will. permalink parent award report block reply Sgt_Hulka 8 points 5 days ago Fuck every democrat and New Hampshire moron who votes blue no matter who. I hate the left. permalink parent award report block reply anotherthing 2 points 5 days ago I would have thought \"no matter who\" would have some limitations, but here we are. permalink parent award report block reply gustodog 5 points 5 days ago His original felony conviction was seemingly for credit card fraud. https://patch.com/new-hampshire/nashua/newly-elected-nashua-rep-served-time-in-laconia permalink parent award report block reply Twitter 7 points 5 days ago the fucking gay rainbow mask is using all it's faggot energy like captain planet to not rip  on that land demons face, ripping a vortex right through the space time continuum. permalink parent award report block reply NotYourMan 3 points 5 days ago And we are not surprised.  If liberals are paying attention then they realize why we were against the trans-movement.  Of course stealing children from their parents and forcing them to take pre-puberty blockers and get trans surgery was also a big deal. permalink parent award report block reply Psarg 2 points 5 days ago He's wearing a badge that says \"Clergy\" permalink parent award report block reply SPEDMan64 1 points 5 days ago Church of Satan. permalink parent award report block reply load 1 more comments...\nPlease_Clap 50 points 5 days ago Democrat leadership's goal is to empower the mentally weak, professionally incapable, and nurtures them into power. That is one critical way the Dems are collapsing this country. Think Maxine Waters, AOC, Illhan Omar, Swalwell, Beto, and the list goes on and on. This is a major Democrat strategy to topple our nation. permalink parent award report block reply Here_we_go 23 points 5 days ago HIJACK COMMENT WHAT ABOUT HIS PARTNER INVOLVED????????? OBVIOUSLY  THEY BOTH WERE INTO IT. Sorry this is fucking sick. permalink parent award report block reply Luvs_2_Bop 13 points 5 days ago Burn them both with fire. permalink parent award report block reply Here_we_go 7 points 5 days ago This permalink parent award report block reply view 1 more comments... SPEDMan64 2 points 5 days ago Not enough to end them outright; enough to make them linger for days afterward in agony until death saves them. permalink parent award report block reply view 1 more comments... HockeyMom4Trump 6 points 5 days ago Yes. Disgusting. If my husband ever asked for anything like that he would be my ex -husband and in jail! Terrible! permalink parent award report block reply Govtizbad 11 points 5 days ago Transgenderism is a fetish heavily linked to pedophilia Homosexuality in general is more likely to be pedophiles but especially transgenderism edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply DanIsSwell 1 points 5 days ago The partner works in a daycare? You know they’re both into cp together, if he feels comfortable asking for nude kid pictures. Every parent with a kid there better be aware of this. They have to be retarded liberals to drop their kids off with that guy in the first place. permalink parent award report block reply Bullet3250 6 points 5 days ago When you see Kamala - running for Presidency of the USA - and she can't even complete a full sentence, and dives into circular logic ALL THE TIME... AND THEN SHE GETS 75 MILLION VOTES - I am worried for this Nation in more ways than one. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago Successful nations used to practice exile of incompatible dangers to a country. permalink parent award report block reply\nHere_we_go 23 points 5 days ago HIJACK COMMENT WHAT ABOUT HIS PARTNER INVOLVED????????? OBVIOUSLY  THEY BOTH WERE INTO IT. Sorry this is fucking sick. permalink parent award report block reply Luvs_2_Bop 13 points 5 days ago Burn them both with fire. permalink parent award report block reply Here_we_go 7 points 5 days ago This permalink parent award report block reply view 1 more comments... SPEDMan64 2 points 5 days ago Not enough to end them outright; enough to make them linger for days afterward in agony until death saves them. permalink parent award report block reply view 1 more comments... HockeyMom4Trump 6 points 5 days ago Yes. Disgusting. If my husband ever asked for anything like that he would be my ex -husband and in jail! Terrible! permalink parent award report block reply Govtizbad 11 points 5 days ago Transgenderism is a fetish heavily linked to pedophilia Homosexuality in general is more likely to be pedophiles but especially transgenderism edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply DanIsSwell 1 points 5 days ago The partner works in a daycare? You know they’re both into cp together, if he feels comfortable asking for nude kid pictures. Every parent with a kid there better be aware of this. They have to be retarded liberals to drop their kids off with that guy in the first place. permalink parent award report block reply\nLuvs_2_Bop 13 points 5 days ago Burn them both with fire. permalink parent award report block reply Here_we_go 7 points 5 days ago This permalink parent award report block reply view 1 more comments... SPEDMan64 2 points 5 days ago Not enough to end them outright; enough to make them linger for days afterward in agony until death saves them. permalink parent award report block reply view 1 more comments...\nHere_we_go 7 points 5 days ago This permalink parent award report block reply view 1 more comments...\nSPEDMan64 2 points 5 days ago Not enough to end them outright; enough to make them linger for days afterward in agony until death saves them. permalink parent award report block reply view 1 more comments...\nHockeyMom4Trump 6 points 5 days ago Yes. Disgusting. If my husband ever asked for anything like that he would be my ex -husband and in jail! Terrible! permalink parent award report block reply Govtizbad 11 points 5 days ago Transgenderism is a fetish heavily linked to pedophilia Homosexuality in general is more likely to be pedophiles but especially transgenderism edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply\nGovtizbad 11 points 5 days ago Transgenderism is a fetish heavily linked to pedophilia Homosexuality in general is more likely to be pedophiles but especially transgenderism edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply\nDanIsSwell 1 points 5 days ago The partner works in a daycare? You know they’re both into cp together, if he feels comfortable asking for nude kid pictures. Every parent with a kid there better be aware of this. They have to be retarded liberals to drop their kids off with that guy in the first place. permalink parent award report block reply\nBullet3250 6 points 5 days ago When you see Kamala - running for Presidency of the USA - and she can't even complete a full sentence, and dives into circular logic ALL THE TIME... AND THEN SHE GETS 75 MILLION VOTES - I am worried for this Nation in more ways than one. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago Successful nations used to practice exile of incompatible dangers to a country. permalink parent award report block reply\nTrumpAndGodWin 3 points 5 days ago Successful nations used to practice exile of incompatible dangers to a country. permalink parent award report block reply\nMr_Rightside 16 points 5 days ago New Hampshire transgender Rep Barry \"Stacie\" Laughton just pleaded guilty to child exploitation charges. He will be sentenced in February and faces up to 30 years in prison. He posted this deranged video running away from police claiming they won’t catch him. This didn’t age well! https://x.com/libsoftiktok/status/1986822538496733600 New Hampshire transgender Rep Stacie Laughton just pleaded guilty to child exploitation charges. He will be sentenced in February and faces up to 30 years in prison. He posted this deranged video running away from police claiming they won’t catch him. This didn’t age well! He was first elected to the Nashua Board of Selectmen in 2012, becoming the first transgender elected official in New Hampshire. Criminal History and Resignations : In 2012, Laughton resigned from the New Hampshire House of Representatives after it was revealed he had a felony conviction and had not completed his sentence, making him ineligible to hold office. He was later arrested in 2015 for making a bomb threat to Southern New Hampshire Medical Center, receiving a six-month jail sentence. In 2021, he was arrested for sending false emergency texts to the Nashua 911 system. 2022 Stalking Charges : Laughton was arrested in November 2022 for violating a restraining order against a woman, leading to his resignation from the state legislature just days after re-election. The incident involved repeated attempts to contact the victim despite the court order. 2023 Child Pornography Charges : On June 23, 2023, Laughton was arrested on charges of distributing sexually explicit images of children.\nThe investigation began after a report of a juvenile incident, leading to a search of his residence and his subsequent arrest.\nHe was also charged with aiding and abetting in the sexual exploitation of children. As of July 2023, he was held in preventive detention and scheduled for arraignment. permalink parent award report block reply SaltyTitties4 11 points 5 days ago If this doesn’t show yall that ALL elections are fixed, I don’t know what will. permalink parent award report block reply Sgt_Hulka 8 points 5 days ago Fuck every democrat and New Hampshire moron who votes blue no matter who. I hate the left. permalink parent award report block reply anotherthing 2 points 5 days ago I would have thought \"no matter who\" would have some limitations, but here we are. permalink parent award report block reply gustodog 5 points 5 days ago His original felony conviction was seemingly for credit card fraud. https://patch.com/new-hampshire/nashua/newly-elected-nashua-rep-served-time-in-laconia permalink parent award report block reply\nSaltyTitties4 11 points 5 days ago If this doesn’t show yall that ALL elections are fixed, I don’t know what will. permalink parent award report block reply\nSgt_Hulka 8 points 5 days ago Fuck every democrat and New Hampshire moron who votes blue no matter who. I hate the left. permalink parent award report block reply anotherthing 2 points 5 days ago I would have thought \"no matter who\" would have some limitations, but here we are. permalink parent award report block reply\nanotherthing 2 points 5 days ago I would have thought \"no matter who\" would have some limitations, but here we are. permalink parent award report block reply\ngustodog 5 points 5 days ago His original felony conviction was seemingly for credit card fraud. https://patch.com/new-hampshire/nashua/newly-elected-nashua-rep-served-time-in-laconia permalink parent award report block reply\nTwitter 7 points 5 days ago the fucking gay rainbow mask is using all it's faggot energy like captain planet to not rip  on that land demons face, ripping a vortex right through the space time continuum. permalink parent award report block reply\nNotYourMan 3 points 5 days ago And we are not surprised.  If liberals are paying attention then they realize why we were against the trans-movement.  Of course stealing children from their parents and forcing them to take pre-puberty blockers and get trans surgery was also a big deal. permalink parent award report block reply\nPsarg 2 points 5 days ago He's wearing a badge that says \"Clergy\" permalink parent award report block reply SPEDMan64 1 points 5 days ago Church of Satan. permalink parent award report block reply\nSPEDMan64 1 points 5 days ago Church of Satan. permalink parent award report block reply\nKuzoKevin OP 85 points 5 days ago He looks exactly like what a tranny child molester should look like. permalink award report block reply RedStoneDeepState 53 points 5 days ago He looks alive, so I disagree permalink parent award report block reply Hckyhillbilly 14 points 5 days ago Comment of the day. Well done rsds. permalink parent award report block reply MAGABOND 5 points 5 days ago Yeah, he’s not feeding enough worms in these pics. permalink parent award report block reply imnotdeadyet 1 points 5 days ago If he ends up in male prison, his worm eating will begin shorty. permalink parent award report block reply MAGABOND 1 points 5 days ago Not worm eating, he needs to be worm feeding. permalink parent award report block reply view 1 more comments... Quietam_Unum 1 points 5 days ago \"Buzzards got to eat same as worms.\"  -- The Outlaw Josie Wales permalink parent award report block reply Breacherbear 1 points 5 days ago Insert gigachad meme permalink parent award report block reply B-2StealthTrump 16 points 5 days ago That faggot has a “Clergy” badge on in the second pic… investigate that pedo “church”. permalink parent award report block reply TruthyBrat 8 points 5 days ago Probably Unitarians or similar. permalink parent award report block reply TrumpAndGodWin 1 points 5 days ago Or Lutherans or maybe the L stands for Luciferian church. permalink parent award report block reply TruthyBrat 2 points 5 days ago Oh, I missed that, mea culpa. Yeah, the Leftist Lutherans aren't far from Unitarians these days. Might as well be Lucifarian. permalink parent award report block reply ListenToSavage 3 points 5 days ago It's that bs Universal Life Church online thing you can pay like 50 bucks to become an \"ordained minister\" so that you can officiate a wedding. permalink parent award report block reply TheMostUselessFeeder 9 points 5 days ago This post needed at least three layers of warnings/spoilers. My eyes 😭 permalink parent award report block reply Lady_MaGa 2 points 5 days ago He looks like the Dexter character to me. permalink parent award report block reply\nRedStoneDeepState 53 points 5 days ago He looks alive, so I disagree permalink parent award report block reply Hckyhillbilly 14 points 5 days ago Comment of the day. Well done rsds. permalink parent award report block reply MAGABOND 5 points 5 days ago Yeah, he’s not feeding enough worms in these pics. permalink parent award report block reply imnotdeadyet 1 points 5 days ago If he ends up in male prison, his worm eating will begin shorty. permalink parent award report block reply MAGABOND 1 points 5 days ago Not worm eating, he needs to be worm feeding. permalink parent award report block reply view 1 more comments... Quietam_Unum 1 points 5 days ago \"Buzzards got to eat same as worms.\"  -- The Outlaw Josie Wales permalink parent award report block reply Breacherbear 1 points 5 days ago Insert gigachad meme permalink parent award report block reply\nHckyhillbilly 14 points 5 days ago Comment of the day. Well done rsds. permalink parent award report block reply\nMAGABOND 5 points 5 days ago Yeah, he’s not feeding enough worms in these pics. permalink parent award report block reply imnotdeadyet 1 points 5 days ago If he ends up in male prison, his worm eating will begin shorty. permalink parent award report block reply MAGABOND 1 points 5 days ago Not worm eating, he needs to be worm feeding. permalink parent award report block reply view 1 more comments... Quietam_Unum 1 points 5 days ago \"Buzzards got to eat same as worms.\"  -- The Outlaw Josie Wales permalink parent award report block reply\nimnotdeadyet 1 points 5 days ago If he ends up in male prison, his worm eating will begin shorty. permalink parent award report block reply MAGABOND 1 points 5 days ago Not worm eating, he needs to be worm feeding. permalink parent award report block reply view 1 more comments...\nMAGABOND 1 points 5 days ago Not worm eating, he needs to be worm feeding. permalink parent award report block reply view 1 more comments...\nQuietam_Unum 1 points 5 days ago \"Buzzards got to eat same as worms.\"  -- The Outlaw Josie Wales permalink parent award report block reply\nBreacherbear 1 points 5 days ago Insert gigachad meme permalink parent award report block reply\nB-2StealthTrump 16 points 5 days ago That faggot has a “Clergy” badge on in the second pic… investigate that pedo “church”. permalink parent award report block reply TruthyBrat 8 points 5 days ago Probably Unitarians or similar. permalink parent award report block reply TrumpAndGodWin 1 points 5 days ago Or Lutherans or maybe the L stands for Luciferian church. permalink parent award report block reply TruthyBrat 2 points 5 days ago Oh, I missed that, mea culpa. Yeah, the Leftist Lutherans aren't far from Unitarians these days. Might as well be Lucifarian. permalink parent award report block reply ListenToSavage 3 points 5 days ago It's that bs Universal Life Church online thing you can pay like 50 bucks to become an \"ordained minister\" so that you can officiate a wedding. permalink parent award report block reply\nTruthyBrat 8 points 5 days ago Probably Unitarians or similar. permalink parent award report block reply TrumpAndGodWin 1 points 5 days ago Or Lutherans or maybe the L stands for Luciferian church. permalink parent award report block reply TruthyBrat 2 points 5 days ago Oh, I missed that, mea culpa. Yeah, the Leftist Lutherans aren't far from Unitarians these days. Might as well be Lucifarian. permalink parent award report block reply\nTrumpAndGodWin 1 points 5 days ago Or Lutherans or maybe the L stands for Luciferian church. permalink parent award report block reply TruthyBrat 2 points 5 days ago Oh, I missed that, mea culpa. Yeah, the Leftist Lutherans aren't far from Unitarians these days. Might as well be Lucifarian. permalink parent award report block reply\nTruthyBrat 2 points 5 days ago Oh, I missed that, mea culpa. Yeah, the Leftist Lutherans aren't far from Unitarians these days. Might as well be Lucifarian. permalink parent award report block reply\nListenToSavage 3 points 5 days ago It's that bs Universal Life Church online thing you can pay like 50 bucks to become an \"ordained minister\" so that you can officiate a wedding. permalink parent award report block reply\nTheMostUselessFeeder 9 points 5 days ago This post needed at least three layers of warnings/spoilers. My eyes 😭 permalink parent award report block reply\nLady_MaGa 2 points 5 days ago He looks like the Dexter character to me. permalink parent award report block reply\nInduceddrag 51 points 5 days ago Elected three times, resigned twice due to legal issues.  Makes one wonder about the voters in that district. permalink award report block reply KuzoKevin OP 23 points 5 days ago Virtue points. permalink parent award report block reply War_Hamster 7 points 5 days ago That's about 50 miles from me, and I thought all the freaks were here. permalink parent award report block reply\nKuzoKevin OP 23 points 5 days ago Virtue points. permalink parent award report block reply\nWar_Hamster 7 points 5 days ago That's about 50 miles from me, and I thought all the freaks were here. permalink parent award report block reply\nYT45 28 points 5 days ago I’m noticing a trend with “trans women…” permalink award report block reply memechallenger33 14 points 5 days ago They all have… um… female pattern baldness? permalink parent award report block reply YT45 4 points 5 days ago Among other things… permalink parent award report block reply BigMikesSwingingCock 5 points 5 days ago Normally, I would make a tranny remark, or joke, but that is the ugliest motherfucker I've ever seen. Actually a deformed freak that's too ugly for the circus. permalink parent award report block reply anotherthing 1 points 5 days ago If Buffalo Bill were played by Sloth from Goonies. permalink parent award report block reply\nmemechallenger33 14 points 5 days ago They all have… um… female pattern baldness? permalink parent award report block reply YT45 4 points 5 days ago Among other things… permalink parent award report block reply\nYT45 4 points 5 days ago Among other things… permalink parent award report block reply\nBigMikesSwingingCock 5 points 5 days ago Normally, I would make a tranny remark, or joke, but that is the ugliest motherfucker I've ever seen. Actually a deformed freak that's too ugly for the circus. permalink parent award report block reply anotherthing 1 points 5 days ago If Buffalo Bill were played by Sloth from Goonies. permalink parent award report block reply\nanotherthing 1 points 5 days ago If Buffalo Bill were played by Sloth from Goonies. permalink parent award report block reply\nAynRand22 18 points 5 days ago Not surprised permalink award report block reply\nRizzlieDoodad 15 points 5 days ago That's a demon, not a person permalink award report block reply\nDev404 14 points 5 days ago Democrats are pedophiles and pedophile enablers. The pattern continues. permalink award report block reply\nRedditStillSucks 14 points 5 days ago 100% of the time. No exception. Just those that haven't been caught yet. permalink award report block reply\nWanderingStar 11 points 5 days ago I'm sure Eric has carnal knowledge. permalink award report block reply Meister_Bockmist 2 points 5 days ago Eric's favorite hobby? Pegging in Bejing. permalink parent award report block reply\nMeister_Bockmist 2 points 5 days ago Eric's favorite hobby? Pegging in Bejing. permalink parent award report block reply\nLol_Garrus 11 points 5 days ago physiognomy rarely lies. permalink award report block reply RememberCharlieKirk 4 points 5 days ago I do wonder... Does the wickedness of a person create the unpleasant physiognomy or does the unpleasant physiognomy assist in creating the wickedness? Wicked thoughts morph the face into ugliness Or an ugly face morphs the thoughts into wickedness permalink parent award report block reply Lol_Garrus 8 points 5 days ago I believe its the wickedness. When you void your soul of the Holy Spirit, you don't have the Holy Spirit's lifeforce within you. Thus, your body ages and degenerates much faster, you lose interest in taking care of your body, no self-respect, etc. I have the Holy Spirit within my body and soul, and He limit-breaks my immune system, allowing it to go Super Saiyan. permalink parent award report block reply RememberCharlieKirk 6 points 5 days ago I agree. Compare pictures of younger Victoria Nuland to current pictures of her. She, an architect of the troubles plaguing Ukraine, must bear plenty of wickedness -- and her uglification shows it. And I commend you on your fantastic immune system! permalink parent award report block reply Lol_Garrus 5 points 5 days ago Haven't been sick (for real) in years! ✝️🏋️ But even my health were to fall, it's all good. My soul belongs to Christ. permalink parent award report block reply view 2 more comments... TruthyBrat 4 points 5 days ago Find the recent back then vs. now thread of Stormy Daniels. As someone noted, she hit the wall at 100 mph! Ping to u/Lol_Garrus permalink parent award report block reply TrumpAndGodWin 2 points 5 days ago Nulands's communist family has a blood feud vs Russia. permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Same with Clinton permalink parent award report block reply view 3 more comments... AmarilloArmadillo 4 points 5 days ago I think the second point has merit, but I'd word it differently. I don't think being ugly makes them evil, but being a certain kind of ugly may be associated with a certain predisposition to evil. I think evil changes the outward to match the inward (eventually anyway) too, so it might be a distinction without a difference. I don't trust people that look like this, and they'll never be near my kids even if they aren't evil. I also just generally don't trust my kids to anyone but immediate family. permalink parent award report block reply Decepticons-superior 2 points 5 days ago This is like when Palpatine became deformed while fighting Mace Windu. I always wondered if he was hiding his true face or if the evil of what he was doing in that moment mutated him. permalink parent award report block reply RememberCharlieKirk 3 points 5 days ago Like with his refusal in naming Yoda's alien species, George Lucas will probably never provide clarification on Palpatine's transformation. The actor who played the role, Ian McDiarmid, seems to agree with your first option: The uglier form of Palpatine was \"what he always looked like\" due to his evilness; the kind, non-disfigured-looking form was a disguise that was no longer needed upon his ascension to the throne. permalink parent award report block reply\nRememberCharlieKirk 4 points 5 days ago I do wonder... Does the wickedness of a person create the unpleasant physiognomy or does the unpleasant physiognomy assist in creating the wickedness? Wicked thoughts morph the face into ugliness Or an ugly face morphs the thoughts into wickedness permalink parent award report block reply Lol_Garrus 8 points 5 days ago I believe its the wickedness. When you void your soul of the Holy Spirit, you don't have the Holy Spirit's lifeforce within you. Thus, your body ages and degenerates much faster, you lose interest in taking care of your body, no self-respect, etc. I have the Holy Spirit within my body and soul, and He limit-breaks my immune system, allowing it to go Super Saiyan. permalink parent award report block reply RememberCharlieKirk 6 points 5 days ago I agree. Compare pictures of younger Victoria Nuland to current pictures of her. She, an architect of the troubles plaguing Ukraine, must bear plenty of wickedness -- and her uglification shows it. And I commend you on your fantastic immune system! permalink parent award report block reply Lol_Garrus 5 points 5 days ago Haven't been sick (for real) in years! ✝️🏋️ But even my health were to fall, it's all good. My soul belongs to Christ. permalink parent award report block reply view 2 more comments... TruthyBrat 4 points 5 days ago Find the recent back then vs. now thread of Stormy Daniels. As someone noted, she hit the wall at 100 mph! Ping to u/Lol_Garrus permalink parent award report block reply TrumpAndGodWin 2 points 5 days ago Nulands's communist family has a blood feud vs Russia. permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Same with Clinton permalink parent award report block reply view 3 more comments... AmarilloArmadillo 4 points 5 days ago I think the second point has merit, but I'd word it differently. I don't think being ugly makes them evil, but being a certain kind of ugly may be associated with a certain predisposition to evil. I think evil changes the outward to match the inward (eventually anyway) too, so it might be a distinction without a difference. I don't trust people that look like this, and they'll never be near my kids even if they aren't evil. I also just generally don't trust my kids to anyone but immediate family. permalink parent award report block reply Decepticons-superior 2 points 5 days ago This is like when Palpatine became deformed while fighting Mace Windu. I always wondered if he was hiding his true face or if the evil of what he was doing in that moment mutated him. permalink parent award report block reply RememberCharlieKirk 3 points 5 days ago Like with his refusal in naming Yoda's alien species, George Lucas will probably never provide clarification on Palpatine's transformation. The actor who played the role, Ian McDiarmid, seems to agree with your first option: The uglier form of Palpatine was \"what he always looked like\" due to his evilness; the kind, non-disfigured-looking form was a disguise that was no longer needed upon his ascension to the throne. permalink parent award report block reply\nLol_Garrus 8 points 5 days ago I believe its the wickedness. When you void your soul of the Holy Spirit, you don't have the Holy Spirit's lifeforce within you. Thus, your body ages and degenerates much faster, you lose interest in taking care of your body, no self-respect, etc. I have the Holy Spirit within my body and soul, and He limit-breaks my immune system, allowing it to go Super Saiyan. permalink parent award report block reply RememberCharlieKirk 6 points 5 days ago I agree. Compare pictures of younger Victoria Nuland to current pictures of her. She, an architect of the troubles plaguing Ukraine, must bear plenty of wickedness -- and her uglification shows it. And I commend you on your fantastic immune system! permalink parent award report block reply Lol_Garrus 5 points 5 days ago Haven't been sick (for real) in years! ✝️🏋️ But even my health were to fall, it's all good. My soul belongs to Christ. permalink parent award report block reply view 2 more comments... TruthyBrat 4 points 5 days ago Find the recent back then vs. now thread of Stormy Daniels. As someone noted, she hit the wall at 100 mph! Ping to u/Lol_Garrus permalink parent award report block reply TrumpAndGodWin 2 points 5 days ago Nulands's communist family has a blood feud vs Russia. permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Same with Clinton permalink parent award report block reply view 3 more comments...\nRememberCharlieKirk 6 points 5 days ago I agree. Compare pictures of younger Victoria Nuland to current pictures of her. She, an architect of the troubles plaguing Ukraine, must bear plenty of wickedness -- and her uglification shows it. And I commend you on your fantastic immune system! permalink parent award report block reply Lol_Garrus 5 points 5 days ago Haven't been sick (for real) in years! ✝️🏋️ But even my health were to fall, it's all good. My soul belongs to Christ. permalink parent award report block reply view 2 more comments... TruthyBrat 4 points 5 days ago Find the recent back then vs. now thread of Stormy Daniels. As someone noted, she hit the wall at 100 mph! Ping to u/Lol_Garrus permalink parent award report block reply TrumpAndGodWin 2 points 5 days ago Nulands's communist family has a blood feud vs Russia. permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Same with Clinton permalink parent award report block reply view 3 more comments...\nLol_Garrus 5 points 5 days ago Haven't been sick (for real) in years! ✝️🏋️ But even my health were to fall, it's all good. My soul belongs to Christ. permalink parent award report block reply view 2 more comments...\nTruthyBrat 4 points 5 days ago Find the recent back then vs. now thread of Stormy Daniels. As someone noted, she hit the wall at 100 mph! Ping to u/Lol_Garrus permalink parent award report block reply\nTrumpAndGodWin 2 points 5 days ago Nulands's communist family has a blood feud vs Russia. permalink parent award report block reply\nPappy_Gunn 2 points 5 days ago Same with Clinton permalink parent award report block reply view 3 more comments...\nAmarilloArmadillo 4 points 5 days ago I think the second point has merit, but I'd word it differently. I don't think being ugly makes them evil, but being a certain kind of ugly may be associated with a certain predisposition to evil. I think evil changes the outward to match the inward (eventually anyway) too, so it might be a distinction without a difference. I don't trust people that look like this, and they'll never be near my kids even if they aren't evil. I also just generally don't trust my kids to anyone but immediate family. permalink parent award report block reply\nDecepticons-superior 2 points 5 days ago This is like when Palpatine became deformed while fighting Mace Windu. I always wondered if he was hiding his true face or if the evil of what he was doing in that moment mutated him. permalink parent award report block reply RememberCharlieKirk 3 points 5 days ago Like with his refusal in naming Yoda's alien species, George Lucas will probably never provide clarification on Palpatine's transformation. The actor who played the role, Ian McDiarmid, seems to agree with your first option: The uglier form of Palpatine was \"what he always looked like\" due to his evilness; the kind, non-disfigured-looking form was a disguise that was no longer needed upon his ascension to the throne. permalink parent award report block reply\nRememberCharlieKirk 3 points 5 days ago Like with his refusal in naming Yoda's alien species, George Lucas will probably never provide clarification on Palpatine's transformation. The actor who played the role, Ian McDiarmid, seems to agree with your first option: The uglier form of Palpatine was \"what he always looked like\" due to his evilness; the kind, non-disfigured-looking form was a disguise that was no longer needed upon his ascension to the throne. permalink parent award report block reply\nYignuced 10 points 5 days ago Shocked permalink award report block reply tt777 2 points 5 days ago Not shocked. permalink parent award report block reply\ntt777 2 points 5 days ago Not shocked. permalink parent award report block reply\ntoofdood1993 9 points 5 days ago woman? that's a fucking dude, call it what it is, not what it wants to be this is why you don't let these faggots around your children. If this creature had a significant other, I'm sure it didn't look much different than this Jaba the hut lookin ass. permalink award report block reply\nHelldiver 7 points 5 days ago Clergy badge? What the fuck? Church of Satan no doubt. permalink award report block reply KuzoKevin OP 4 points 5 days ago I've got the same badge..  It costs about $35 to become a minister on line. permalink parent award report block reply\nKuzoKevin OP 4 points 5 days ago I've got the same badge..  It costs about $35 to become a minister on line. permalink parent award report block reply\nFilo76 6 points 5 days ago 🤢 🤮 permalink award report block reply\nroflcopt0rz_returns 6 points 5 days ago Why are so many trannies fat, ugly, balding white guys? A lot of it starts with how the left demonizes white men as the root of all evil (heaven forbid you’re straight, Christian, etc.). High T men can block out the noise and live their own lives, but weak white men cannot live their lives through the shame and insults, and so they turn to transgenderism as a way to virtue signal. permalink award report block reply anotherrandomname 1 points 5 days ago They're degenerate fetishists. Can't get any in real life because they're disgusting freaks so they descend into a deviant porn induced psychosis. Also explains why troons hate women so much, because they're butthurt about not getting laid. \"Suck the girl dick, bigot!\" they screech at actually female lesbians... lol. permalink parent award report block reply\nanotherrandomname 1 points 5 days ago They're degenerate fetishists. Can't get any in real life because they're disgusting freaks so they descend into a deviant porn induced psychosis. Also explains why troons hate women so much, because they're butthurt about not getting laid. \"Suck the girl dick, bigot!\" they screech at actually female lesbians... lol. permalink parent award report block reply\nFormerlurker92 5 points 5 days ago Do we expect anything less? permalink award report block reply\nSweetBeef 4 points 5 days ago WTF... Swallwell is a California representative. He had to reach out to get tangled up with a PDF troon in the northeast. permalink award report block reply\nFormerlurker92 4 points 5 days ago How soon till some biden appointee pardons them without a trial permalink award report block reply\nPeaceMakerDJT 4 points 5 days ago Unfortunately, our politicians and people in high positions are being blackmailed by these materials permalink award report block reply\nTheRPatriot 4 points 5 days ago What in the actual fuck is going on in this country. How in the world could that freakazoid be elected in NEW HAMPSHIRE of all states. Supposedly the last state in New England with a semblance of conservatism permalink award report block reply KuzoKevin OP 1 points 5 days ago Nashua. permalink parent award report block reply\nKuzoKevin OP 1 points 5 days ago Nashua. permalink parent award report block reply\nBrookes 4 points 5 days ago We’re gonna need a bigger wood chipper permalink award report block reply\nIcekickass 4 points 5 days ago Costanza must have fallen pretty hard after the Vandelay industries buy out permalink award report block reply\njsphere256 3 points 5 days ago partner Not even once permalink award report block reply\nEdBuck 3 points 5 days ago Fucking gross permalink award report block reply\ncyberwar 3 points 5 days ago and yet he would still win an election if allowed to run permalink award report block reply\nTheMrStone 3 points 5 days ago Edit: My honest reaction to that... thing https://www.youtube.com/watch?v=tbHxwsE2ZAI permalink award report block reply Repentnow 1 points 5 days ago If you're going to post a YouTube link, at least post a one liner descriptions.  I'm not clicking on any friggin YouTube link without knowing what's there. permalink parent award report block reply TheMrStone 2 points 5 days ago Oh, fair. I just felt the link spoke for itself. permalink parent award report block reply\nRepentnow 1 points 5 days ago If you're going to post a YouTube link, at least post a one liner descriptions.  I'm not clicking on any friggin YouTube link without knowing what's there. permalink parent award report block reply TheMrStone 2 points 5 days ago Oh, fair. I just felt the link spoke for itself. permalink parent award report block reply\nTheMrStone 2 points 5 days ago Oh, fair. I just felt the link spoke for itself. permalink parent award report block reply\nAgent_86 3 points 5 days ago Deleted from view permalink award report block reply uxername27 1 points 5 days ago I see you post this comment from time to time. What does it mean? permalink parent award report block reply\nuxername27 1 points 5 days ago I see you post this comment from time to time. What does it mean? permalink parent award report block reply\nythehorses 2 points 5 days ago They are ALL freaking perverts. permalink award report block reply\nAlldayeveryday 2 points 5 days ago Just despose of these pieces garbage permalink award report block reply\ngorilla_grip 2 points 5 days ago There’s a tranny running for governor in Idaho as a socialist, it would be a shame if someone looked at his computer for cp permalink award report block reply\nChyNahAzzWhole1 2 points 5 days ago CLERGY?!? permalink award report block reply\nAfeazo 2 points 5 days ago You know there are men out there who do look feminine, so why does it always seem to be the most buttfuck ugly, fat, male pattern baldness dudes are always the ones who claim to be women? permalink award report block reply\nRepentnow 2 points 5 days ago Ugly on the outside = ugly in the soul. permalink award report block reply\nHydris 2 points 5 days ago It’s not a matter of IF they are, it’s WHEN they are exposed. permalink award report block reply\nHockeyMom4Trump 2 points 5 days ago Mentally ill. I am\nFatigued. permalink award report block reply\nTruculentGoose 2 points 5 days ago Swallowswell looks 1000 times gayer standing next to it permalink award report block reply\ngoatnuts 2 points 5 days ago You can spot these fucking freaks from across the room. This is the low hanging fruit, how these people get away with it for so long I'm baffled. permalink award report block reply\nf_bastiat 2 points 5 days ago The wiki page is killing me, they keep switching from he and she in the same sentence and it's so confusing. https://en.wikipedia.org/wiki/Stacie-Marie_Laughton permalink award report block reply Pappy_Gunn 1 points 5 days ago Played a game  (Xcom chimera squad) where you were forced to play diverse characters.  Most of them girlboss wahmyn with they/them pronouns.  It was next to impossible to make senses of the captions or descriptions.  You didn't know if they were talking about the platoon, a group of people/aliens or an individual.   Some people had regular pronounds just to screw things up more. permalink parent award report block reply f_bastiat 1 points 5 days ago I believe it, woke kills everything it touches. I never played the newer xcom but I used to play X-Com Terror From the Deep in elementary school. That was back when games were very unforgiving. permalink parent award report block reply Pappy_Gunn 1 points 5 days ago TFTD was hard and creepy.  Especially when they took over your soldiers and the squad would just melt away. permalink parent award report block reply\nPappy_Gunn 1 points 5 days ago Played a game  (Xcom chimera squad) where you were forced to play diverse characters.  Most of them girlboss wahmyn with they/them pronouns.  It was next to impossible to make senses of the captions or descriptions.  You didn't know if they were talking about the platoon, a group of people/aliens or an individual.   Some people had regular pronounds just to screw things up more. permalink parent award report block reply f_bastiat 1 points 5 days ago I believe it, woke kills everything it touches. I never played the newer xcom but I used to play X-Com Terror From the Deep in elementary school. That was back when games were very unforgiving. permalink parent award report block reply Pappy_Gunn 1 points 5 days ago TFTD was hard and creepy.  Especially when they took over your soldiers and the squad would just melt away. permalink parent award report block reply\nf_bastiat 1 points 5 days ago I believe it, woke kills everything it touches. I never played the newer xcom but I used to play X-Com Terror From the Deep in elementary school. That was back when games were very unforgiving. permalink parent award report block reply Pappy_Gunn 1 points 5 days ago TFTD was hard and creepy.  Especially when they took over your soldiers and the squad would just melt away. permalink parent award report block reply\nPappy_Gunn 1 points 5 days ago TFTD was hard and creepy.  Especially when they took over your soldiers and the squad would just melt away. permalink parent award report block reply\nDontTreadOnSnek 2 points 5 days ago Faggots should not be anywhere near children, especially daycare. permalink award report block reply\nZippythekid 2 points 5 days ago Gross permalink award report block reply\nDT170x 2 points 5 days ago This is my surprise face. 😐 Notice it not even surprised at all. permalink award report block reply\nConfusedAngryArmed 1 points 5 days ago Ears below the eyeline, weak jaw, receding hairline, faggoty ass glasses. It's so predictable that it's laughable. permalink award report block reply\nIAmDisappoint 1 points 5 days ago Woodchipper permalink award report block reply\nTheSonOfGadsden 1 points 5 days ago Pedo fag deserves to go feet first into the wood chipper permalink award report block reply\nDeplorable_in_PA 1 points 5 days ago \"Stacy\" might want to start stocking up on Rogaine.  And Dafuq is wrong with NH that they allow his partner to work in a day care center? permalink award report block reply\n24NoMoreBullshit 1 points 5 days ago Bucks County better be on watch with their new tranny just elected. permalink award report block reply\nMungo 1 points 5 days ago Kill it permalink award report block reply\nasdrubael_was_right 1 points 5 days ago This story is gross. This things partner worked in daycare and took kids to the bathroom to photograph them and text the pics to him. permalink award report block reply\nanti_masker 1 points 5 days ago dude is full on balding lol permalink award report block reply\nBigPoppaPossum 1 points 5 days ago Oh... I'm shocked... That thing that they say doesn't happen, happened again... never would've thought a tranny would be a pedophile */s permalink award report block reply\nthisisatestof2 1 points 5 days ago Im beginning to see a pattern here. permalink award report block reply\nquiznossucks 1 points 5 days ago Gee...I am surprised... permalink award report block reply\nWarViper1337 1 points 5 days ago Why do they always look like this. Must be some kind of built in genetic warning or something. permalink award report block reply\nSaltyTitties4 1 points 5 days ago He’s wearing a “Clergy” badge. permalink award report block reply\nFuckU/Spez 1 points 5 days ago While I would never bend a knee to islame, they do make a very good case for tossing them from rooftops... permalink award report block reply\nkobe525z 1 points 5 days ago Wow I’m shocked who would have thought a degenerate freakazoid would engage in degenerate behavior ! permalink award report block reply\nSpacemonkey 1 points 5 days ago The only cure for degenerate faggots is death permalink award report block reply\ndonkeyKang 1 points 5 days ago Handsome even! LOLOLOL permalink award report block reply\nGoldwaterVoter 1 points 5 days ago Scroll down the comments and see the INCREDIBLE CRIMINAL history BEFORE he was elected or \"transitioned\". https://xcancel.com/libsoftiktok/status/1986822538496733600 Both Beto and Swallowell could have and should have done background check on him BEFORE they campaigned for him. Campaign pics in the extended X post. permalink award report block reply\nNonbinaryPotatohead 1 points 5 days ago the fuckin hairline on that thing permalink award report block reply\nTrumpIsTheVictor 1 points 5 days ago What the fuck is that? permalink award report block reply\nblueeyephoto 1 points 5 days ago which one? permalink award report block reply\nFourtyandfourtyfive 1 points 5 days ago Worse case of male pattern baldness I’ve seen in a woman. permalink award report block reply\nMegabrain1960 1 points 5 days ago Does it know it's bald? permalink award report block reply\ncd3dog 1 points 5 days ago Amazing what can get elected these days. permalink award report block reply\ngeckofishknight 1 points 5 days ago nurgling permalink award report block reply\nseattlerunner 1 points 5 days ago What a FREAK permalink award report block reply\nRememberCharlieKirk 1 points 5 days ago Eric Swalwell uses \"Stacie\" Laughton as his wingman, because even a weird-looking guy like Swalwell looks better when standing next to a freak like Laughton. permalink award report block reply\nTrue_Curmudgeon 1 points 5 days ago Execute permalink award report block reply\nLibertyFox 1 points 4 days ago His copious flop sweat would provide ample lubrication for the woodchipper. permalink award report block reply\nIllKissYourBoobies 1 points 5 days ago It's Riff Raff. permalink award report block reply\nRetard_Strength 1 points 5 days ago any parents who knowingly left their child with this freak should also face charges permalink award report block reply\nLorrainer 1 points 5 days ago He looks vaxxed. permalink award report block reply\ndonteatthat 1 points 5 days ago DEATH permalink award report block reply\nBlueKentuckyGirl 1 points 5 days ago Nasty. Looks like the same house swindling Andy Beshear was in the other day. The Beshear family here in KY were in big time on the Medicaid expansion grift. permalink award report block reply\nKrampus5150 1 points 5 days ago Kill it permalink award report block reply\ndtrap 1 points 5 days ago Breaking news! The mentally disturbed do disturbing things! News at 11! permalink award report block reply\nLearnAboutRoaches 1 points 5 days ago Reportly lol. Big boned breaking news permalink award report block reply\nPappy_Gunn 1 points 5 days ago Pedos go where the kids are.  Parents that put their kids in daycares with weirdos as staff are just not paying attention. permalink award report block reply\nRoadpower 1 points 5 days ago A troon is going to troon but really the major problem here is the judgment of Swalwell. With a judgment that bad he should be nowhere near a position of power and influence. permalink award report block reply\nmykillk 1 points 5 days ago How do you look at that thing and go \"yeah, that's what I want representing my interests in state government\"? permalink award report block reply\nthrottlejohnson 1 points 5 days ago ewe...just threw up some permalink award report block reply\nsomeguy7738 1 points 5 days ago What, a disgusting troon is a child molester? Who could possibly have seen this coming?? :O permalink award report block reply\nalucard13mmfmj 1 points 5 days ago Study is right where if you see 2 men kissing, it illicits the same reaction as a writhing blob of maggots on rotten meat. Now multiply that 100x.. with dog shit, agent orange and dish water. permalink award report block reply\nMotownmow 1 points 5 days ago I hate that faggot. Also the laughton dude permalink award report block reply\nRydanovich 1 points 5 days ago Reddit is pissed about this. Not because of the actual crime, but because riGhT wRInGers WIlL uSe ThiS To DemoNiZe TraNs permalink award report block reply\nMaenard 1 points 5 days ago Laughton... Laugh ton.  A fat freak is hilarious. permalink award report block reply\nThe_Morrow_Outlander 1 points 5 days ago Like... he's not even trying to look like a woman. I'm one of the more open-minded people here on the subject of intersex conditions, but if you're not compelled to actually act or at least make yourself look like the well-adjusted members of your alleged sex, you're just a cross-dressing pervert. A HEALTHY woman with a hairline anywhere close to that bad and a stature like this would get called a dude, and not out of malice. permalink award report block reply\nAwShitHereWeGoAgain 1 points 5 days ago Woodchipper.  Immediately. permalink award report block reply\nbluewhiteandred 1 points 5 days ago will never be an woman permalink award report block reply\nSaltExtractor 1 points 5 days ago Imagine how shocked I am....not. permalink award report block reply\nhellokutie 1 points 5 days ago What a surprise!  I've never guess by looking at \"it\". permalink award report block reply\nAnAmishWithATude 1 points 5 days ago No woman in this post. permalink award report block reply\nJmricht 1 points 5 days ago That’s no woman permalink award report block reply\nRememberCharlieKirk 1 points 5 days ago Two pictures that just carry a stench to them. \"Imagine the smell.\" permalink award report block reply\nbarefootozark 1 points 5 days ago His badge says \"Clergy\".  JFC. permalink award report block reply\nbubadmt 0 points 5 days ago Hey, cool it with the antisemitism and antitrans. permalink award report block reply\nToddyoungsvagina 0 points 5 days ago 5 head permalink award report block reply\nmaverick202 -1 points 5 days ago Yikes white troon caught doing pedo stuff again.. Paging u/UCantStumpTheTrump permalink award report block reply UCantStumpTheTrump 1 points 5 days ago u/maverick202 is a self-described troll who comes here to insult this community and call people \"white trash\" and \"incels\" - hit that deport button! permalink parent award report block reply\nUCantStumpTheTrump 1 points 5 days ago u/maverick202 is a self-described troll who comes here to insult this community and call people \"white trash\" and \"incels\" - hit that deport button! permalink parent award report block reply\nHoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:00:40.897365Z"
}