{
  "id": "1ARK52B9cn",
  "url": "https://patriots.win/p/1ARK52B9cn/im-closer-to-the-second-than-the/c",
  "content": "336 I'm closer to the second than the first, but I will never vote left.  Accelerating the problem for short-term relief is no solution. posted 6 days ago by Electricutie 19 comments award share download report block\n19 comments Sort by Top Top New Worst Old Save MrMcGreenGenes 19 points 6 days ago Rocking the boat. Trump's either got to fire up opportunities for Americans or else it only gets worse. permalink award report block reply ReleasetheList 19 points 6 days ago Probably shouldn't have put carveouts and loopholes in the H1B 100k executive order. permalink parent award report block reply OTher55 15 points 6 days ago Kids have no great war. No great depression. Their great war is a spiritual war, and their great depression is their lives. permalink award report block reply BarrysOFace 7 points 6 days ago You do not talk about fight club! permalink parent award report block reply LiteraIIyHitIer 1 points 6 days ago I can see by all the new faces here tonight that many of you have been breaking the first two rules of Fight Club. permalink parent award report block reply Pede 11 points 6 days ago Correct. Young people are indoctrinated into leftist ideology, but the only reason it works is the job market is terrible for them. It looks to them like the only young people doing well are streamers. permalink award report block reply Nellie_the_Beaut 3 points 6 days ago And those with rich parents and generational wealth.  The ones whose parents give them one of their “extra” houses, condos or air bnbs to live in free, with paid utilities, as long as they want. permalink parent award report block reply UltraMagaWA 8 points 6 days ago Trump still listening to globalists permalink award report block reply tw0scoops 8 points 6 days ago Not wrong. Every week its been this company or that with lay offs followed up with hiring over seas. permalink award report block reply Aggrieved03 6 points 6 days ago They got fooled and fled. permalink award report block reply Nellie_the_Beaut 6 points 6 days ago I’m in California. FOUR friends of my gen z kids just moved to Indiana to find work and attend vocational school and colleges that they can afford. They have all tried for nearly 5 years to begin their adult lives out here and finally realized there’s no jobs, opportunities or way for them to even get started. Cost of living is too prohibitive and they can’t afford to live here, especially if they want to go to school to get a degree or trade. And those who are honest will admit that unless you’re an illegal or minority, you aren’t getting any help with any of it and good luck finding a decent, reliable job.  There’s a huge midwest migration going on that people their age are calling the Reverse Dustbowl.  Opportunities and the chance for a self sustaining, dignified, useful life for American born Gen Z have dried up completely in the western /coastal and northeast/east coast U.S.  Trump and his admin, and the GOP need to address this NOW. permalink award report block reply 24601 1 points 6 days ago No... it's natural migration. All your 4 friends... and you too by the way... should move to a Deep Red area, have 10 babies each... encourage all your babies to have more babies and also vote MAGA. All Trump has to do is deport 40 million illegals, and in 20 years or so, the USA is permanently MAGA with Deep Red areas sucking up all the US House seats. permalink parent award report block reply _Sully_ 5 points 6 days ago Well of course they are. If your girlfriend sees some dude spending every penny he can on frills and sugary drinks she'll scoff at your legitimate planned budget to save for the future. It doesn't matter if the fun won't last she'll just find another simp. permalink award report block reply WooseTheMoose 2 points 6 days ago I know a buddy that happened to. His girlfriend is an absolute gem but he's young and can't provide so he has to save up so she just leaves him for a guy who has slightly more. Very sad. permalink parent award report block reply _Sully_ 2 points 6 days ago Hell, it happened to me. The dude was in his 50s though. She turned out to be a meth addicted whore who sucked dick on camera. I think I lucked out. permalink parent award report block reply Trump454748 1 points 6 days ago Stop talking about our former vice president like that! permalink parent award report block reply Cville123 3 points 6 days ago It’s a no brainer.  State no renewal of any H1 visas and tell people to get their affairs in order or at least 100,000 for renewal. permalink award report block reply Formerlurker92 1 points 6 days ago A bad solution is better than no solution, if you don't know it's a bad solution. And thanks to the thrilling work of the department of education, they don't permalink award report block reply lizardo221 1 points 6 days ago End the filibuster! Do your jobs! permalink award report block reply TheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nMrMcGreenGenes 19 points 6 days ago Rocking the boat. Trump's either got to fire up opportunities for Americans or else it only gets worse. permalink award report block reply ReleasetheList 19 points 6 days ago Probably shouldn't have put carveouts and loopholes in the H1B 100k executive order. permalink parent award report block reply\nReleasetheList 19 points 6 days ago Probably shouldn't have put carveouts and loopholes in the H1B 100k executive order. permalink parent award report block reply\nOTher55 15 points 6 days ago Kids have no great war. No great depression. Their great war is a spiritual war, and their great depression is their lives. permalink award report block reply BarrysOFace 7 points 6 days ago You do not talk about fight club! permalink parent award report block reply LiteraIIyHitIer 1 points 6 days ago I can see by all the new faces here tonight that many of you have been breaking the first two rules of Fight Club. permalink parent award report block reply\nBarrysOFace 7 points 6 days ago You do not talk about fight club! permalink parent award report block reply LiteraIIyHitIer 1 points 6 days ago I can see by all the new faces here tonight that many of you have been breaking the first two rules of Fight Club. permalink parent award report block reply\nLiteraIIyHitIer 1 points 6 days ago I can see by all the new faces here tonight that many of you have been breaking the first two rules of Fight Club. permalink parent award report block reply\nPede 11 points 6 days ago Correct. Young people are indoctrinated into leftist ideology, but the only reason it works is the job market is terrible for them. It looks to them like the only young people doing well are streamers. permalink award report block reply Nellie_the_Beaut 3 points 6 days ago And those with rich parents and generational wealth.  The ones whose parents give them one of their “extra” houses, condos or air bnbs to live in free, with paid utilities, as long as they want. permalink parent award report block reply\nNellie_the_Beaut 3 points 6 days ago And those with rich parents and generational wealth.  The ones whose parents give them one of their “extra” houses, condos or air bnbs to live in free, with paid utilities, as long as they want. permalink parent award report block reply\nUltraMagaWA 8 points 6 days ago Trump still listening to globalists permalink award report block reply\ntw0scoops 8 points 6 days ago Not wrong. Every week its been this company or that with lay offs followed up with hiring over seas. permalink award report block reply\nAggrieved03 6 points 6 days ago They got fooled and fled. permalink award report block reply\nNellie_the_Beaut 6 points 6 days ago I’m in California. FOUR friends of my gen z kids just moved to Indiana to find work and attend vocational school and colleges that they can afford. They have all tried for nearly 5 years to begin their adult lives out here and finally realized there’s no jobs, opportunities or way for them to even get started. Cost of living is too prohibitive and they can’t afford to live here, especially if they want to go to school to get a degree or trade. And those who are honest will admit that unless you’re an illegal or minority, you aren’t getting any help with any of it and good luck finding a decent, reliable job.  There’s a huge midwest migration going on that people their age are calling the Reverse Dustbowl.  Opportunities and the chance for a self sustaining, dignified, useful life for American born Gen Z have dried up completely in the western /coastal and northeast/east coast U.S.  Trump and his admin, and the GOP need to address this NOW. permalink award report block reply 24601 1 points 6 days ago No... it's natural migration. All your 4 friends... and you too by the way... should move to a Deep Red area, have 10 babies each... encourage all your babies to have more babies and also vote MAGA. All Trump has to do is deport 40 million illegals, and in 20 years or so, the USA is permanently MAGA with Deep Red areas sucking up all the US House seats. permalink parent award report block reply\n24601 1 points 6 days ago No... it's natural migration. All your 4 friends... and you too by the way... should move to a Deep Red area, have 10 babies each... encourage all your babies to have more babies and also vote MAGA. All Trump has to do is deport 40 million illegals, and in 20 years or so, the USA is permanently MAGA with Deep Red areas sucking up all the US House seats. permalink parent award report block reply\n_Sully_ 5 points 6 days ago Well of course they are. If your girlfriend sees some dude spending every penny he can on frills and sugary drinks she'll scoff at your legitimate planned budget to save for the future. It doesn't matter if the fun won't last she'll just find another simp. permalink award report block reply WooseTheMoose 2 points 6 days ago I know a buddy that happened to. His girlfriend is an absolute gem but he's young and can't provide so he has to save up so she just leaves him for a guy who has slightly more. Very sad. permalink parent award report block reply _Sully_ 2 points 6 days ago Hell, it happened to me. The dude was in his 50s though. She turned out to be a meth addicted whore who sucked dick on camera. I think I lucked out. permalink parent award report block reply Trump454748 1 points 6 days ago Stop talking about our former vice president like that! permalink parent award report block reply\nWooseTheMoose 2 points 6 days ago I know a buddy that happened to. His girlfriend is an absolute gem but he's young and can't provide so he has to save up so she just leaves him for a guy who has slightly more. Very sad. permalink parent award report block reply _Sully_ 2 points 6 days ago Hell, it happened to me. The dude was in his 50s though. She turned out to be a meth addicted whore who sucked dick on camera. I think I lucked out. permalink parent award report block reply Trump454748 1 points 6 days ago Stop talking about our former vice president like that! permalink parent award report block reply\n_Sully_ 2 points 6 days ago Hell, it happened to me. The dude was in his 50s though. She turned out to be a meth addicted whore who sucked dick on camera. I think I lucked out. permalink parent award report block reply Trump454748 1 points 6 days ago Stop talking about our former vice president like that! permalink parent award report block reply\nTrump454748 1 points 6 days ago Stop talking about our former vice president like that! permalink parent award report block reply\nCville123 3 points 6 days ago It’s a no brainer.  State no renewal of any H1 visas and tell people to get their affairs in order or at least 100,000 for renewal. permalink award report block reply\nFormerlurker92 1 points 6 days ago A bad solution is better than no solution, if you don't know it's a bad solution. And thanks to the thrilling work of the department of education, they don't permalink award report block reply\nlizardo221 1 points 6 days ago End the filibuster! Do your jobs! permalink award report block reply\nTheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:44:19.480273Z"
}