{
  "id": "8180196",
  "title": "1344How much money has Coca-Cola made off of SNAP recipients?posted2 days agobyblue5707113 commentsa",
  "url": "https://patriots.win/p/1ARK9hi0dK/how-much-money-has-cocacola-made/c",
  "content": "1344 How much money has Coca-Cola made off of SNAP recipients? posted 2 days ago by blue5707 113 comments award share report block Libs of TikTok @libsoftiktok • 3d EXCLUSIVE ALLEGED DISCRIMINATORY HIRING PRACTICES AT COCA-COLA AGAINST WHITE PEOPLE An individual named \"David\" sent in a job application to @CocaCola, citing 20 YEARS of experience in the industry. His application was REJECTED the next day. He then sent in another\n113 comments Sort by Top Top New Worst Old Save Raetchel 152 points 2 days ago it's not \"off of snap recipients\" snap people have no money it is 'how much money has coca-cola fleeced the us taxpayer'? that's the fuckin' question permalink award report block reply mikethemarine 7 points 2 days ago he wasn't hired by color, he was hired by the name that goes buy color, I worked in a job that was licensed by the state and I was continuously denied my license and had to reapply multiple times with added information and finally got it, years later they hired another person in the same job, without ANY of the qualifications I needed to get licensed  and his name was Jamal and he got his license immediately,But 6 months after getting it the states found out he was white and they took it away from him. DAMN, RIGHT? permalink parent award report block reply WhiteGhost 6 points 2 days ago And they still keep doing it. Always putting Didn't Earn It faggots first. permalink parent award report block reply cyberrigger 4 points 2 days ago Not including Donald Trump's consumption of Diet Coke. permalink parent award report block reply Raetchel 2 points 2 days ago it's 'UGE permalink parent award report block reply jermzdeejd 2 points 2 days ago When you can buy the small bottle that fits in a fridge for almost the same price as a liter.....ya know your profit margins are pretty strong. permalink parent award report block reply conservativefrank 2 points 2 days ago BINGO...and Bingo was his name-o. permalink parent award report block reply load 22 more comments... Trooph-Hurts 36 points 2 days ago Govt is just a pass through process for corporate rape……. Corporations can’t tax you but the govt can… take Obamacare, it’s a specific tax that mandates you buy a specific product from insurance companies which are corporate!…. Snap, pharma, software, pretty much everything govt does they just hand the money over to a corporation….. or don’t forget NGO’s! permalink award report block reply Elencher 16 points 2 days ago Yep this is why they love the poor and the retarded. For every million you see some retarded light bulb head Somali stealing somebody in power is stealing twice that through them. permalink parent award report block reply NonbinaryPotatohead 4 points 2 days ago Welcome to the United States Corporation permalink parent award report block reply HunterBidensPC 33 points 2 days ago This isn’t new I’m still boycotting them for their anti white training material from 5 years ago permalink award report block reply LampshadeDisco 10 points 2 days ago Keep going!! I've only been in Walmart twice in 20 years because fuck them and the way they treat their emps and take over small towns, etc. permalink parent award report block reply Prussian_Pepe 5 points 2 days ago It's been longer for me. Their connection to Killary. Their fucking over american industry/small business, driving everything to china ect. I've loathed them and spit on them for 30 years. It's amassing how low info everyone is about them. They are huge reason China stole our industry, and became a paper tiger power house. They were the ones pushing the market. I remember at least 20something years ago. When they were #1 king (amazon took a lot of their glory, especially post covid). The #2 in sales was target. But Walmart made more in 1 week than target made in an entire year. Walmart had stolen like 86% of the market. And everyone lined up like a fucking communist bread line to shop there. It's disgusting... Everything about them has been. Also their groceries are jacked up higher than a grocery store, but idiots are brainwashed into the \"ALWAYS LOW PRICES!! ALWAYS!!!!!!!!!!!\" and they don't have a brain to double check. permalink parent award report block reply LampshadeDisco 0 points 2 days ago Word. permalink parent award report block reply God-is-good 6 points 2 days ago They didn’t say “try to be less white” out of kindness. 2021 https://www.fox32chicago.com/news/coca-cola-staff-told-in-online-training-seminar-try-to-be-less-white.amp permalink parent award report block reply WhicketFahts 26 points 2 days ago Hey. They did say to be less White. permalink award report block reply 1_Badcop 15 points 2 days ago I thought that just meant it's ok to steal Coca-Cola products? permalink parent award report block reply bill_in_texas 5 points 2 days ago Unless you're hijacking the Coca Cola delivery trucks you're not hurting Coca Cola, you're hurting a retailer who bought the Coke and is reselling it to others.  Note that I am against hijacking trucks, too. I rarely drink anything but water and black coffee anymore, so while I can't be less White, I can steer clear of Coke products. permalink parent award report block reply 1_Badcop 4 points 2 days ago I am White, so I'm not endorsing nor do I participate in thievery. I was simply observing that one could be \"less White\" by participating in such anti-social behavior. I regret being unclear. permalink parent award report block reply ingrowntoenail 4 points 2 days ago I also mostly drink water and black coffee.  My wife insists on having sweet tea regularly but sometimes I don't drink a drop out of that gallon pitcher.  We were regular drinkers of coke for a long time but starting cutting down several years ago and now we rarely buy it. permalink parent award report block reply Gnometard 19 points 2 days ago I qualified for food stamps years ago for about 3 months. I felt guilty, which resulted in me only buying good quality food Soda and junk food weren't even a consideration in my mind I lost my $180/month in food stamps because my monthly income increased by $150. permalink award report block reply utfanx2 12 points 2 days ago That's ok, I'm not buying that garbage. permalink award report block reply SqRt7744 16 points 2 days ago You are though, through EBT which is subsidy to the corporate food industry. permalink parent award report block reply God-is-good 3 points 2 days ago If Taxing soda was racist, I wonder what they would push not to lose their government cattle. Cocalcola advised of posting naacp to abuse soda tax of racism https://patriots.win/p/16ZqUI8gza/cocacola-accused-of-paying-naacp/c/ permalink parent award report block reply Nerdrem3 12 points 2 days ago White people should start naming their kids black names to troll the whole system. permalink award report block reply Nibba2 15 points 2 days ago That’s cruelty. permalink parent award report block reply Rob_Belmonte 1 points 2 days ago N permalink parent award report block reply NewJigger504 8 points 2 days ago Companies HATE people with experience. They prefer people who are coachable in new methods and can pay them LESS permalink award report block reply DeePlorable 3 points 2 days ago You are right. I once took a part time job as a cashier in a big box store to make a little mad money because I was a housewife. They fired all the 40-50+ something year old experienced store managers across my region. Then they hired all young 20 something year olds fresh out of college to be the new managers in all the local chains. Some of the old, loyal managers they tossed out were great and had over 25+ year store managerial experience and the stores were clean, stocked right and well run. I knew they did that so they could pay half the salary to make more profit. I was in my late 40s at the time. The new 23 year old store manager took me on the side and said \"Not to be ageist, but if I had a choice I would only hire 18-20 year olds with no prior work experience because they can be molded into what we want them to be\". I was taken aback as she also retorted that people my age or older were set in their ways and could not be taught to drink the corporate cool aid. She then told me if I weren't already hired she would have never hired me. All my co-workers were lazy kids who every other day would call out sick and they would hide and vape weed in the back all day while I did the work of 3 people, but was not appreciated. I quit and the store went to shit. The Yelp reviews after the newbies and young kids were running the stores were all 1 star complaints about rudeness, lack of customer service, dirty stores, no stock on the shelves, etc. permalink parent award report block reply frothy 1 points 2 days ago Came here to say similar.  If he had just changed the name and the experience up / down a year, then he'd have better proof of his claim. But changing 20 years to 5 years... 5 years = They see someone they can mold and will be a go getter, and will stick around. 20 years experience = Someone typically ingrained in their ways, probably looking towards retirement in 5 - 10 years. The company doesn't want to invest in someone that's going to be out the door sooner and / or someone that just does just above the minimal amount of work because they are 'over' working, just cruising to retirement. permalink parent award report block reply JimmyRussler 8 points 2 days ago Its been shit since they took the cocaine out of it anyway. permalink award report block reply NoMaskNoMaster 8 points 2 days ago They only buy grape drank A subsidiary of DOW chemical permalink award report block reply TiggerLovingPooh 7 points 2 days ago Cocer-Coler These racists deserve that hard R. permalink award report block reply SuperHonkey 7 points 2 days ago DaShawn 🦍 permalink award report block reply RedStoneDeepState 7 points 2 days ago Every job application I submit is as Hispanic. permalink award report block reply DeePlorable 2 points 2 days ago My best friend checked off African American on her high school valedictorian son's college application and they offered him a $12,000 scholarship. She figured since her Italian grandfather was born in Africa and immigrated up to Italy, before coming to the USA, it's not lying. When they met him and saw he was pasty white, suddenly they did not have enough money in the \"budget\" and rescinded. She called them out and said they were racists and suddenly they found $2,000 they could afford to get from their \"budget\". permalink parent award report block reply Redeemable 1 points 2 days ago Do you have Hispanic heritage? permalink parent award report block reply worldowedexplanation 8 points 2 days ago If men can be women then we’re all Indigenous BIPOC whatever the fucks now permalink parent award report block reply RedStoneDeepState 8 points 2 days ago My grandmother's German birth certificate says she was born in Cuba to parents that were in the German Army in 1942. Due to that I claim diversity. permalink parent award report block reply Lovethatorangeman 6 points 2 days ago Didn't Coke run an ad saying \"be less white\"? Or maybe it was a text from an employee? I don't remember the details, just that the phrase was used. permalink award report block reply Prandogolio 6 points 2 days ago It was not an ad.  It was a leaked internal memo. permalink parent award report block reply FusionBlack 6 points 2 days ago This culture derives from its corporate location. Atlanta. The anus of Georgia. permalink award report block reply beansieman1911 5 points 2 days ago Still trying to be less white permalink award report block reply DeplorableDC 4 points 2 days ago Title is snap and post is coke atill being the ‘be less white’ cola... If tour going to srink cola fren raise the Royal Crown permalink award report block reply Light_HIV_Effect 3 points 2 days ago All these big companies were set up to favor hiring minorities, if not outright reject white candidates. permalink award report block reply journalist 3 points 2 days ago never drink soda-pop permalink award report block reply parttimefed 3 points 2 days ago They didn't want to hire white David because he was white nessiarly, but because a 20 years experience applicant would expect more starting pay than a 5 year experienced applicant. Middle management and HR are territorial and bringing in someone with 20 years experience risk that person being set in their ways and will try to bring that 20 years of his way to the job.  5 year DEI guy just says \"wat do\" and gets paid allot less permalink award report block reply Nibba2 6 points 2 days ago Nice try coke PR handshake. They know he will cost more but a good portion of the time they will still get an interview to find out if they are set in their ways and how much they will cost. If it’s too high they simply state that. permalink parent award report block reply parttimefed 1 points 20 hours ago they know how much they will cost because they know what positions like that at that level of years commands. AND what ever that number is its certainly way less that 5 year guy. permalink parent award report block reply Nibba2 1 points 19 hours ago Sure thing, Coca-Cola PR handshake. permalink parent award report block reply parttimefed 1 points 18 hours ago Comment removed by community moderators. permalink parent award report block reply MAGAJuice 3 points 2 days ago I pull the ol' Pocahontas tactic these days and tell companies I am half-Native American. I mean, I am a native to America, but I'm not American Indian! That's a big difference and they're too stupid to realize the difference. permalink award report block reply PatriotDescendant 3 points 2 days ago This, to my mind, would be a lawsuit. Who knows labor law? permalink award report block reply Froynlavenfroynlaven 5 points 2 days ago Coke can just say he's overqualified, and that's that.  And not being hired for that reason is a real thing. This experiment went wrong when he used different experience amounts. permalink parent award report block reply Rydanovich 3 points 2 days ago Basically everyone I roomed with in the shelter had snap, the amount of people I saw dropping $300 on mountain dew was staggering. The only goody I ever bought were tea bags and french vanilla creamer. Otherwise I got ground beef, eggs, sausages, bread and potatoes. permalink award report block reply Antenna 3 points 2 days ago And how 'bout WALMART? All those videos of people walking through completely empty Walmarts because the EBTs were shut off. permalink award report block reply PleaseHonk 3 points 2 days ago Their try hard effort to use soda euphemisms is ULTRA gay permalink award report block reply MondayCoupleIsDead 2 points 2 days ago David should've shown up in blackface permalink award report block reply Oodles 2 points 2 days ago There is ZERO reason why deadbeat hamplanets should be allowed to buy this diabetes syrup with our money permalink award report block reply Memeoverlord 2 points 2 days ago Every single coke rep that comes into my store is black, every single one. permalink award report block reply daveyistheman 2 points 2 days ago Couple hundred probably permalink award report block reply Dev404 2 points 2 days ago Their liquid gut rot has likely caused more health issues related to diabetes, kidney and liver damage, and obesity than any other brand on the market. permalink award report block reply blackswans 2 points 2 days ago Does Coca-Cola sell Grape Drank? permalink award report block reply Texar1991 2 points 2 days ago ‪I quit diet woke years ago when they said to be less white. Diet Dr. Pepper for me!! ‬ permalink award report block reply uxername27 -1 points 2 days ago Just drink water, it's better for you health and cheaper. permalink parent award report block reply FlyCatcher94 1 points 2 days ago Why even bother. They hire those low IQ people the company will tank. permalink award report block reply Fromseatoshinningsea 1 points 2 days ago Atl: CNN Turner Hanoi Jane links are obvious.  Corruption in GA politics is also obvious, and irreversible. Turner and the coca cola executives will watch from their ivory towers as Atlanta becomes a crime ridden haven for what ails the US, until the US is no more permalink award report block reply LiteraIIyHitIer 1 points 2 days ago So the thread title is about SNAP recipients, but the actual post is about hiring practices. Uh, well done? permalink award report block reply Smashley 1 points 2 days ago And then had to pay for the healthcare of these unhealthy people.. permalink award report block reply Magastreammedia 1 points 2 days ago \"be less white\" permalink award report block reply TheGunFairy 1 points 2 days ago 40% of Coca Colas yearly sales is EBT and SNAP permalink award report block reply Choomly 1 points 2 days ago Too much permalink award report block reply Shitsbrokeyo 1 points 2 days ago I looked this up the other day 12.5% of their income and they spend 1.7 million a year on lobbyists permalink award report block reply TheFozz 1 points 2 days ago We know Coke is extremely racist against White People, what can we do about it? permalink award report block reply conservativefrank 1 points 2 days ago They don't make money from the recipients. Coke makes money from the tax payers who pay. permalink award report block reply Spellmonger 1 points 2 days ago Finding out how incompetent and even coordinated swindling in the food stamp program is one of the reasons the Democrats want to end the shutdown.  That and the fact that President Trump was getting close to getting the filibuster nuked, and we might end up with real election reform. permalink award report block reply Sunnybats2 1 points 2 days ago Hadn't Bobby cut that out now? permalink award report block reply HockeyMom4Trump 1 points 2 days ago Sue them. I am no Elizabeth Warren fan, but she played the right move with Harvard. permalink award report block reply NonbinaryPotatohead 1 points 2 days ago Now let's see sugar laced cereals. permalink award report block reply redditadminssuckit 1 points 2 days ago We should've picked our own cotton permalink award report block reply LibsRcrazy 1 points 2 days ago Stopped buying Coke when they put: \"Try to be less white\" on their cans. FUCK COKE. permalink award report block reply PlanetBrain 1 points 2 days ago Well, it's \"Be Less white\" coca-cola, what do you expect? permalink award report block reply Jappletime 1 points 2 days ago I would call the EEOC and file a complaint. After my hearing I would hire me a fat lawyer and sue the fuck out coke. Never drank their product. That commerical”I’d like to teach the world to sing in different hominy. BULLSHIT. permalink award report block reply Crappydatum 1 points 2 days ago The exact opposite of the narrative? Say it ain't so, Joe permalink award report block reply HoganP 1 points 2 days ago DeShawn lel permalink award report block reply stagolee 0 points 2 days ago Yeah...but you can also have too much experience for a job position.  I've turned people down for that reason.  They need to do a more level comparison between people with the same experience level. permalink award report block reply Executarian2 -1 points 2 days ago Seems like libelous rage bait meant to further divide us, which is a classic move from this Jew. I’d love to see the actual application, because this would be very easy to fake. permalink award report block reply FatigueIsReal 3 points 2 days ago I'll bet this one is true.  Here's why. https://findjustice.com/cases/the-coca-cola-company/ permalink parent award report block reply HoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply KennyKetchem 1 points 2 days ago Comment removed by community filter. permalink award report block reply\nRaetchel 152 points 2 days ago it's not \"off of snap recipients\" snap people have no money it is 'how much money has coca-cola fleeced the us taxpayer'? that's the fuckin' question permalink award report block reply mikethemarine 7 points 2 days ago he wasn't hired by color, he was hired by the name that goes buy color, I worked in a job that was licensed by the state and I was continuously denied my license and had to reapply multiple times with added information and finally got it, years later they hired another person in the same job, without ANY of the qualifications I needed to get licensed  and his name was Jamal and he got his license immediately,But 6 months after getting it the states found out he was white and they took it away from him. DAMN, RIGHT? permalink parent award report block reply WhiteGhost 6 points 2 days ago And they still keep doing it. Always putting Didn't Earn It faggots first. permalink parent award report block reply cyberrigger 4 points 2 days ago Not including Donald Trump's consumption of Diet Coke. permalink parent award report block reply Raetchel 2 points 2 days ago it's 'UGE permalink parent award report block reply jermzdeejd 2 points 2 days ago When you can buy the small bottle that fits in a fridge for almost the same price as a liter.....ya know your profit margins are pretty strong. permalink parent award report block reply conservativefrank 2 points 2 days ago BINGO...and Bingo was his name-o. permalink parent award report block reply load 22 more comments...\nmikethemarine 7 points 2 days ago he wasn't hired by color, he was hired by the name that goes buy color, I worked in a job that was licensed by the state and I was continuously denied my license and had to reapply multiple times with added information and finally got it, years later they hired another person in the same job, without ANY of the qualifications I needed to get licensed  and his name was Jamal and he got his license immediately,But 6 months after getting it the states found out he was white and they took it away from him. DAMN, RIGHT? permalink parent award report block reply\nWhiteGhost 6 points 2 days ago And they still keep doing it. Always putting Didn't Earn It faggots first. permalink parent award report block reply\ncyberrigger 4 points 2 days ago Not including Donald Trump's consumption of Diet Coke. permalink parent award report block reply Raetchel 2 points 2 days ago it's 'UGE permalink parent award report block reply\nRaetchel 2 points 2 days ago it's 'UGE permalink parent award report block reply\njermzdeejd 2 points 2 days ago When you can buy the small bottle that fits in a fridge for almost the same price as a liter.....ya know your profit margins are pretty strong. permalink parent award report block reply\nconservativefrank 2 points 2 days ago BINGO...and Bingo was his name-o. permalink parent award report block reply\nTrooph-Hurts 36 points 2 days ago Govt is just a pass through process for corporate rape……. Corporations can’t tax you but the govt can… take Obamacare, it’s a specific tax that mandates you buy a specific product from insurance companies which are corporate!…. Snap, pharma, software, pretty much everything govt does they just hand the money over to a corporation….. or don’t forget NGO’s! permalink award report block reply Elencher 16 points 2 days ago Yep this is why they love the poor and the retarded. For every million you see some retarded light bulb head Somali stealing somebody in power is stealing twice that through them. permalink parent award report block reply NonbinaryPotatohead 4 points 2 days ago Welcome to the United States Corporation permalink parent award report block reply\nElencher 16 points 2 days ago Yep this is why they love the poor and the retarded. For every million you see some retarded light bulb head Somali stealing somebody in power is stealing twice that through them. permalink parent award report block reply\nNonbinaryPotatohead 4 points 2 days ago Welcome to the United States Corporation permalink parent award report block reply\nHunterBidensPC 33 points 2 days ago This isn’t new I’m still boycotting them for their anti white training material from 5 years ago permalink award report block reply LampshadeDisco 10 points 2 days ago Keep going!! I've only been in Walmart twice in 20 years because fuck them and the way they treat their emps and take over small towns, etc. permalink parent award report block reply Prussian_Pepe 5 points 2 days ago It's been longer for me. Their connection to Killary. Their fucking over american industry/small business, driving everything to china ect. I've loathed them and spit on them for 30 years. It's amassing how low info everyone is about them. They are huge reason China stole our industry, and became a paper tiger power house. They were the ones pushing the market. I remember at least 20something years ago. When they were #1 king (amazon took a lot of their glory, especially post covid). The #2 in sales was target. But Walmart made more in 1 week than target made in an entire year. Walmart had stolen like 86% of the market. And everyone lined up like a fucking communist bread line to shop there. It's disgusting... Everything about them has been. Also their groceries are jacked up higher than a grocery store, but idiots are brainwashed into the \"ALWAYS LOW PRICES!! ALWAYS!!!!!!!!!!!\" and they don't have a brain to double check. permalink parent award report block reply LampshadeDisco 0 points 2 days ago Word. permalink parent award report block reply God-is-good 6 points 2 days ago They didn’t say “try to be less white” out of kindness. 2021 https://www.fox32chicago.com/news/coca-cola-staff-told-in-online-training-seminar-try-to-be-less-white.amp permalink parent award report block reply\nLampshadeDisco 10 points 2 days ago Keep going!! I've only been in Walmart twice in 20 years because fuck them and the way they treat their emps and take over small towns, etc. permalink parent award report block reply Prussian_Pepe 5 points 2 days ago It's been longer for me. Their connection to Killary. Their fucking over american industry/small business, driving everything to china ect. I've loathed them and spit on them for 30 years. It's amassing how low info everyone is about them. They are huge reason China stole our industry, and became a paper tiger power house. They were the ones pushing the market. I remember at least 20something years ago. When they were #1 king (amazon took a lot of their glory, especially post covid). The #2 in sales was target. But Walmart made more in 1 week than target made in an entire year. Walmart had stolen like 86% of the market. And everyone lined up like a fucking communist bread line to shop there. It's disgusting... Everything about them has been. Also their groceries are jacked up higher than a grocery store, but idiots are brainwashed into the \"ALWAYS LOW PRICES!! ALWAYS!!!!!!!!!!!\" and they don't have a brain to double check. permalink parent award report block reply LampshadeDisco 0 points 2 days ago Word. permalink parent award report block reply\nPrussian_Pepe 5 points 2 days ago It's been longer for me. Their connection to Killary. Their fucking over american industry/small business, driving everything to china ect. I've loathed them and spit on them for 30 years. It's amassing how low info everyone is about them. They are huge reason China stole our industry, and became a paper tiger power house. They were the ones pushing the market. I remember at least 20something years ago. When they were #1 king (amazon took a lot of their glory, especially post covid). The #2 in sales was target. But Walmart made more in 1 week than target made in an entire year. Walmart had stolen like 86% of the market. And everyone lined up like a fucking communist bread line to shop there. It's disgusting... Everything about them has been. Also their groceries are jacked up higher than a grocery store, but idiots are brainwashed into the \"ALWAYS LOW PRICES!! ALWAYS!!!!!!!!!!!\" and they don't have a brain to double check. permalink parent award report block reply LampshadeDisco 0 points 2 days ago Word. permalink parent award report block reply\nLampshadeDisco 0 points 2 days ago Word. permalink parent award report block reply\nGod-is-good 6 points 2 days ago They didn’t say “try to be less white” out of kindness. 2021 https://www.fox32chicago.com/news/coca-cola-staff-told-in-online-training-seminar-try-to-be-less-white.amp permalink parent award report block reply\nWhicketFahts 26 points 2 days ago Hey. They did say to be less White. permalink award report block reply 1_Badcop 15 points 2 days ago I thought that just meant it's ok to steal Coca-Cola products? permalink parent award report block reply bill_in_texas 5 points 2 days ago Unless you're hijacking the Coca Cola delivery trucks you're not hurting Coca Cola, you're hurting a retailer who bought the Coke and is reselling it to others.  Note that I am against hijacking trucks, too. I rarely drink anything but water and black coffee anymore, so while I can't be less White, I can steer clear of Coke products. permalink parent award report block reply 1_Badcop 4 points 2 days ago I am White, so I'm not endorsing nor do I participate in thievery. I was simply observing that one could be \"less White\" by participating in such anti-social behavior. I regret being unclear. permalink parent award report block reply ingrowntoenail 4 points 2 days ago I also mostly drink water and black coffee.  My wife insists on having sweet tea regularly but sometimes I don't drink a drop out of that gallon pitcher.  We were regular drinkers of coke for a long time but starting cutting down several years ago and now we rarely buy it. permalink parent award report block reply\n1_Badcop 15 points 2 days ago I thought that just meant it's ok to steal Coca-Cola products? permalink parent award report block reply bill_in_texas 5 points 2 days ago Unless you're hijacking the Coca Cola delivery trucks you're not hurting Coca Cola, you're hurting a retailer who bought the Coke and is reselling it to others.  Note that I am against hijacking trucks, too. I rarely drink anything but water and black coffee anymore, so while I can't be less White, I can steer clear of Coke products. permalink parent award report block reply 1_Badcop 4 points 2 days ago I am White, so I'm not endorsing nor do I participate in thievery. I was simply observing that one could be \"less White\" by participating in such anti-social behavior. I regret being unclear. permalink parent award report block reply ingrowntoenail 4 points 2 days ago I also mostly drink water and black coffee.  My wife insists on having sweet tea regularly but sometimes I don't drink a drop out of that gallon pitcher.  We were regular drinkers of coke for a long time but starting cutting down several years ago and now we rarely buy it. permalink parent award report block reply\nbill_in_texas 5 points 2 days ago Unless you're hijacking the Coca Cola delivery trucks you're not hurting Coca Cola, you're hurting a retailer who bought the Coke and is reselling it to others.  Note that I am against hijacking trucks, too. I rarely drink anything but water and black coffee anymore, so while I can't be less White, I can steer clear of Coke products. permalink parent award report block reply 1_Badcop 4 points 2 days ago I am White, so I'm not endorsing nor do I participate in thievery. I was simply observing that one could be \"less White\" by participating in such anti-social behavior. I regret being unclear. permalink parent award report block reply ingrowntoenail 4 points 2 days ago I also mostly drink water and black coffee.  My wife insists on having sweet tea regularly but sometimes I don't drink a drop out of that gallon pitcher.  We were regular drinkers of coke for a long time but starting cutting down several years ago and now we rarely buy it. permalink parent award report block reply\n1_Badcop 4 points 2 days ago I am White, so I'm not endorsing nor do I participate in thievery. I was simply observing that one could be \"less White\" by participating in such anti-social behavior. I regret being unclear. permalink parent award report block reply\ningrowntoenail 4 points 2 days ago I also mostly drink water and black coffee.  My wife insists on having sweet tea regularly but sometimes I don't drink a drop out of that gallon pitcher.  We were regular drinkers of coke for a long time but starting cutting down several years ago and now we rarely buy it. permalink parent award report block reply\nGnometard 19 points 2 days ago I qualified for food stamps years ago for about 3 months. I felt guilty, which resulted in me only buying good quality food Soda and junk food weren't even a consideration in my mind I lost my $180/month in food stamps because my monthly income increased by $150. permalink award report block reply\nutfanx2 12 points 2 days ago That's ok, I'm not buying that garbage. permalink award report block reply SqRt7744 16 points 2 days ago You are though, through EBT which is subsidy to the corporate food industry. permalink parent award report block reply God-is-good 3 points 2 days ago If Taxing soda was racist, I wonder what they would push not to lose their government cattle. Cocalcola advised of posting naacp to abuse soda tax of racism https://patriots.win/p/16ZqUI8gza/cocacola-accused-of-paying-naacp/c/ permalink parent award report block reply\nSqRt7744 16 points 2 days ago You are though, through EBT which is subsidy to the corporate food industry. permalink parent award report block reply God-is-good 3 points 2 days ago If Taxing soda was racist, I wonder what they would push not to lose their government cattle. Cocalcola advised of posting naacp to abuse soda tax of racism https://patriots.win/p/16ZqUI8gza/cocacola-accused-of-paying-naacp/c/ permalink parent award report block reply\nGod-is-good 3 points 2 days ago If Taxing soda was racist, I wonder what they would push not to lose their government cattle. Cocalcola advised of posting naacp to abuse soda tax of racism https://patriots.win/p/16ZqUI8gza/cocacola-accused-of-paying-naacp/c/ permalink parent award report block reply\nNerdrem3 12 points 2 days ago White people should start naming their kids black names to troll the whole system. permalink award report block reply Nibba2 15 points 2 days ago That’s cruelty. permalink parent award report block reply Rob_Belmonte 1 points 2 days ago N permalink parent award report block reply\nNibba2 15 points 2 days ago That’s cruelty. permalink parent award report block reply\nRob_Belmonte 1 points 2 days ago N permalink parent award report block reply\nNewJigger504 8 points 2 days ago Companies HATE people with experience. They prefer people who are coachable in new methods and can pay them LESS permalink award report block reply DeePlorable 3 points 2 days ago You are right. I once took a part time job as a cashier in a big box store to make a little mad money because I was a housewife. They fired all the 40-50+ something year old experienced store managers across my region. Then they hired all young 20 something year olds fresh out of college to be the new managers in all the local chains. Some of the old, loyal managers they tossed out were great and had over 25+ year store managerial experience and the stores were clean, stocked right and well run. I knew they did that so they could pay half the salary to make more profit. I was in my late 40s at the time. The new 23 year old store manager took me on the side and said \"Not to be ageist, but if I had a choice I would only hire 18-20 year olds with no prior work experience because they can be molded into what we want them to be\". I was taken aback as she also retorted that people my age or older were set in their ways and could not be taught to drink the corporate cool aid. She then told me if I weren't already hired she would have never hired me. All my co-workers were lazy kids who every other day would call out sick and they would hide and vape weed in the back all day while I did the work of 3 people, but was not appreciated. I quit and the store went to shit. The Yelp reviews after the newbies and young kids were running the stores were all 1 star complaints about rudeness, lack of customer service, dirty stores, no stock on the shelves, etc. permalink parent award report block reply frothy 1 points 2 days ago Came here to say similar.  If he had just changed the name and the experience up / down a year, then he'd have better proof of his claim. But changing 20 years to 5 years... 5 years = They see someone they can mold and will be a go getter, and will stick around. 20 years experience = Someone typically ingrained in their ways, probably looking towards retirement in 5 - 10 years. The company doesn't want to invest in someone that's going to be out the door sooner and / or someone that just does just above the minimal amount of work because they are 'over' working, just cruising to retirement. permalink parent award report block reply\nDeePlorable 3 points 2 days ago You are right. I once took a part time job as a cashier in a big box store to make a little mad money because I was a housewife. They fired all the 40-50+ something year old experienced store managers across my region. Then they hired all young 20 something year olds fresh out of college to be the new managers in all the local chains. Some of the old, loyal managers they tossed out were great and had over 25+ year store managerial experience and the stores were clean, stocked right and well run. I knew they did that so they could pay half the salary to make more profit. I was in my late 40s at the time. The new 23 year old store manager took me on the side and said \"Not to be ageist, but if I had a choice I would only hire 18-20 year olds with no prior work experience because they can be molded into what we want them to be\". I was taken aback as she also retorted that people my age or older were set in their ways and could not be taught to drink the corporate cool aid. She then told me if I weren't already hired she would have never hired me. All my co-workers were lazy kids who every other day would call out sick and they would hide and vape weed in the back all day while I did the work of 3 people, but was not appreciated. I quit and the store went to shit. The Yelp reviews after the newbies and young kids were running the stores were all 1 star complaints about rudeness, lack of customer service, dirty stores, no stock on the shelves, etc. permalink parent award report block reply\nfrothy 1 points 2 days ago Came here to say similar.  If he had just changed the name and the experience up / down a year, then he'd have better proof of his claim. But changing 20 years to 5 years... 5 years = They see someone they can mold and will be a go getter, and will stick around. 20 years experience = Someone typically ingrained in their ways, probably looking towards retirement in 5 - 10 years. The company doesn't want to invest in someone that's going to be out the door sooner and / or someone that just does just above the minimal amount of work because they are 'over' working, just cruising to retirement. permalink parent award report block reply\nJimmyRussler 8 points 2 days ago Its been shit since they took the cocaine out of it anyway. permalink award report block reply\nNoMaskNoMaster 8 points 2 days ago They only buy grape drank A subsidiary of DOW chemical permalink award report block reply\nTiggerLovingPooh 7 points 2 days ago Cocer-Coler These racists deserve that hard R. permalink award report block reply\nSuperHonkey 7 points 2 days ago DaShawn 🦍 permalink award report block reply\nRedStoneDeepState 7 points 2 days ago Every job application I submit is as Hispanic. permalink award report block reply DeePlorable 2 points 2 days ago My best friend checked off African American on her high school valedictorian son's college application and they offered him a $12,000 scholarship. She figured since her Italian grandfather was born in Africa and immigrated up to Italy, before coming to the USA, it's not lying. When they met him and saw he was pasty white, suddenly they did not have enough money in the \"budget\" and rescinded. She called them out and said they were racists and suddenly they found $2,000 they could afford to get from their \"budget\". permalink parent award report block reply Redeemable 1 points 2 days ago Do you have Hispanic heritage? permalink parent award report block reply worldowedexplanation 8 points 2 days ago If men can be women then we’re all Indigenous BIPOC whatever the fucks now permalink parent award report block reply RedStoneDeepState 8 points 2 days ago My grandmother's German birth certificate says she was born in Cuba to parents that were in the German Army in 1942. Due to that I claim diversity. permalink parent award report block reply\nDeePlorable 2 points 2 days ago My best friend checked off African American on her high school valedictorian son's college application and they offered him a $12,000 scholarship. She figured since her Italian grandfather was born in Africa and immigrated up to Italy, before coming to the USA, it's not lying. When they met him and saw he was pasty white, suddenly they did not have enough money in the \"budget\" and rescinded. She called them out and said they were racists and suddenly they found $2,000 they could afford to get from their \"budget\". permalink parent award report block reply\nRedeemable 1 points 2 days ago Do you have Hispanic heritage? permalink parent award report block reply worldowedexplanation 8 points 2 days ago If men can be women then we’re all Indigenous BIPOC whatever the fucks now permalink parent award report block reply RedStoneDeepState 8 points 2 days ago My grandmother's German birth certificate says she was born in Cuba to parents that were in the German Army in 1942. Due to that I claim diversity. permalink parent award report block reply\nworldowedexplanation 8 points 2 days ago If men can be women then we’re all Indigenous BIPOC whatever the fucks now permalink parent award report block reply\nRedStoneDeepState 8 points 2 days ago My grandmother's German birth certificate says she was born in Cuba to parents that were in the German Army in 1942. Due to that I claim diversity. permalink parent award report block reply\nLovethatorangeman 6 points 2 days ago Didn't Coke run an ad saying \"be less white\"? Or maybe it was a text from an employee? I don't remember the details, just that the phrase was used. permalink award report block reply Prandogolio 6 points 2 days ago It was not an ad.  It was a leaked internal memo. permalink parent award report block reply\nPrandogolio 6 points 2 days ago It was not an ad.  It was a leaked internal memo. permalink parent award report block reply\nFusionBlack 6 points 2 days ago This culture derives from its corporate location. Atlanta. The anus of Georgia. permalink award report block reply\nbeansieman1911 5 points 2 days ago Still trying to be less white permalink award report block reply\nDeplorableDC 4 points 2 days ago Title is snap and post is coke atill being the ‘be less white’ cola... If tour going to srink cola fren raise the Royal Crown permalink award report block reply\nLight_HIV_Effect 3 points 2 days ago All these big companies were set up to favor hiring minorities, if not outright reject white candidates. permalink award report block reply\njournalist 3 points 2 days ago never drink soda-pop permalink award report block reply\nparttimefed 3 points 2 days ago They didn't want to hire white David because he was white nessiarly, but because a 20 years experience applicant would expect more starting pay than a 5 year experienced applicant. Middle management and HR are territorial and bringing in someone with 20 years experience risk that person being set in their ways and will try to bring that 20 years of his way to the job.  5 year DEI guy just says \"wat do\" and gets paid allot less permalink award report block reply Nibba2 6 points 2 days ago Nice try coke PR handshake. They know he will cost more but a good portion of the time they will still get an interview to find out if they are set in their ways and how much they will cost. If it’s too high they simply state that. permalink parent award report block reply parttimefed 1 points 20 hours ago they know how much they will cost because they know what positions like that at that level of years commands. AND what ever that number is its certainly way less that 5 year guy. permalink parent award report block reply Nibba2 1 points 19 hours ago Sure thing, Coca-Cola PR handshake. permalink parent award report block reply parttimefed 1 points 18 hours ago Comment removed by community moderators. permalink parent award report block reply\nNibba2 6 points 2 days ago Nice try coke PR handshake. They know he will cost more but a good portion of the time they will still get an interview to find out if they are set in their ways and how much they will cost. If it’s too high they simply state that. permalink parent award report block reply parttimefed 1 points 20 hours ago they know how much they will cost because they know what positions like that at that level of years commands. AND what ever that number is its certainly way less that 5 year guy. permalink parent award report block reply Nibba2 1 points 19 hours ago Sure thing, Coca-Cola PR handshake. permalink parent award report block reply parttimefed 1 points 18 hours ago Comment removed by community moderators. permalink parent award report block reply\nparttimefed 1 points 20 hours ago they know how much they will cost because they know what positions like that at that level of years commands. AND what ever that number is its certainly way less that 5 year guy. permalink parent award report block reply Nibba2 1 points 19 hours ago Sure thing, Coca-Cola PR handshake. permalink parent award report block reply parttimefed 1 points 18 hours ago Comment removed by community moderators. permalink parent award report block reply\nNibba2 1 points 19 hours ago Sure thing, Coca-Cola PR handshake. permalink parent award report block reply parttimefed 1 points 18 hours ago Comment removed by community moderators. permalink parent award report block reply\nparttimefed 1 points 18 hours ago Comment removed by community moderators. permalink parent award report block reply\nMAGAJuice 3 points 2 days ago I pull the ol' Pocahontas tactic these days and tell companies I am half-Native American. I mean, I am a native to America, but I'm not American Indian! That's a big difference and they're too stupid to realize the difference. permalink award report block reply\nPatriotDescendant 3 points 2 days ago This, to my mind, would be a lawsuit. Who knows labor law? permalink award report block reply Froynlavenfroynlaven 5 points 2 days ago Coke can just say he's overqualified, and that's that.  And not being hired for that reason is a real thing. This experiment went wrong when he used different experience amounts. permalink parent award report block reply\nFroynlavenfroynlaven 5 points 2 days ago Coke can just say he's overqualified, and that's that.  And not being hired for that reason is a real thing. This experiment went wrong when he used different experience amounts. permalink parent award report block reply\nRydanovich 3 points 2 days ago Basically everyone I roomed with in the shelter had snap, the amount of people I saw dropping $300 on mountain dew was staggering. The only goody I ever bought were tea bags and french vanilla creamer. Otherwise I got ground beef, eggs, sausages, bread and potatoes. permalink award report block reply\nAntenna 3 points 2 days ago And how 'bout WALMART? All those videos of people walking through completely empty Walmarts because the EBTs were shut off. permalink award report block reply\nPleaseHonk 3 points 2 days ago Their try hard effort to use soda euphemisms is ULTRA gay permalink award report block reply\nMondayCoupleIsDead 2 points 2 days ago David should've shown up in blackface permalink award report block reply\nOodles 2 points 2 days ago There is ZERO reason why deadbeat hamplanets should be allowed to buy this diabetes syrup with our money permalink award report block reply\nMemeoverlord 2 points 2 days ago Every single coke rep that comes into my store is black, every single one. permalink award report block reply\ndaveyistheman 2 points 2 days ago Couple hundred probably permalink award report block reply\nDev404 2 points 2 days ago Their liquid gut rot has likely caused more health issues related to diabetes, kidney and liver damage, and obesity than any other brand on the market. permalink award report block reply\nblackswans 2 points 2 days ago Does Coca-Cola sell Grape Drank? permalink award report block reply\nTexar1991 2 points 2 days ago ‪I quit diet woke years ago when they said to be less white. Diet Dr. Pepper for me!! ‬ permalink award report block reply uxername27 -1 points 2 days ago Just drink water, it's better for you health and cheaper. permalink parent award report block reply\nuxername27 -1 points 2 days ago Just drink water, it's better for you health and cheaper. permalink parent award report block reply\nFlyCatcher94 1 points 2 days ago Why even bother. They hire those low IQ people the company will tank. permalink award report block reply\nFromseatoshinningsea 1 points 2 days ago Atl: CNN Turner Hanoi Jane links are obvious.  Corruption in GA politics is also obvious, and irreversible. Turner and the coca cola executives will watch from their ivory towers as Atlanta becomes a crime ridden haven for what ails the US, until the US is no more permalink award report block reply\nLiteraIIyHitIer 1 points 2 days ago So the thread title is about SNAP recipients, but the actual post is about hiring practices. Uh, well done? permalink award report block reply\nSmashley 1 points 2 days ago And then had to pay for the healthcare of these unhealthy people.. permalink award report block reply\nMagastreammedia 1 points 2 days ago \"be less white\" permalink award report block reply\nTheGunFairy 1 points 2 days ago 40% of Coca Colas yearly sales is EBT and SNAP permalink award report block reply\nChoomly 1 points 2 days ago Too much permalink award report block reply\nShitsbrokeyo 1 points 2 days ago I looked this up the other day 12.5% of their income and they spend 1.7 million a year on lobbyists permalink award report block reply\nTheFozz 1 points 2 days ago We know Coke is extremely racist against White People, what can we do about it? permalink award report block reply\nconservativefrank 1 points 2 days ago They don't make money from the recipients. Coke makes money from the tax payers who pay. permalink award report block reply\nSpellmonger 1 points 2 days ago Finding out how incompetent and even coordinated swindling in the food stamp program is one of the reasons the Democrats want to end the shutdown.  That and the fact that President Trump was getting close to getting the filibuster nuked, and we might end up with real election reform. permalink award report block reply\nSunnybats2 1 points 2 days ago Hadn't Bobby cut that out now? permalink award report block reply\nHockeyMom4Trump 1 points 2 days ago Sue them. I am no Elizabeth Warren fan, but she played the right move with Harvard. permalink award report block reply\nNonbinaryPotatohead 1 points 2 days ago Now let's see sugar laced cereals. permalink award report block reply\nredditadminssuckit 1 points 2 days ago We should've picked our own cotton permalink award report block reply\nLibsRcrazy 1 points 2 days ago Stopped buying Coke when they put: \"Try to be less white\" on their cans. FUCK COKE. permalink award report block reply\nPlanetBrain 1 points 2 days ago Well, it's \"Be Less white\" coca-cola, what do you expect? permalink award report block reply\nJappletime 1 points 2 days ago I would call the EEOC and file a complaint. After my hearing I would hire me a fat lawyer and sue the fuck out coke. Never drank their product. That commerical”I’d like to teach the world to sing in different hominy. BULLSHIT. permalink award report block reply\nCrappydatum 1 points 2 days ago The exact opposite of the narrative? Say it ain't so, Joe permalink award report block reply\nHoganP 1 points 2 days ago DeShawn lel permalink award report block reply\nstagolee 0 points 2 days ago Yeah...but you can also have too much experience for a job position.  I've turned people down for that reason.  They need to do a more level comparison between people with the same experience level. permalink award report block reply\nExecutarian2 -1 points 2 days ago Seems like libelous rage bait meant to further divide us, which is a classic move from this Jew. I’d love to see the actual application, because this would be very easy to fake. permalink award report block reply FatigueIsReal 3 points 2 days ago I'll bet this one is true.  Here's why. https://findjustice.com/cases/the-coca-cola-company/ permalink parent award report block reply\nFatigueIsReal 3 points 2 days ago I'll bet this one is true.  Here's why. https://findjustice.com/cases/the-coca-cola-company/ permalink parent award report block reply\nHoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nKennyKetchem 1 points 2 days ago Comment removed by community filter. permalink award report block reply",
  "fetched_at": "2025-11-12T20:08:07.061534Z"
}