{
  "id": "1ARK9l8q1K",
  "url": "https://patriots.win/p/1ARK9l8q1K/nyt-israels-military-response-in/c",
  "content": "823 NYT: Israel’s Military Response ‘Inevitable’ As Iran Restores Nuke Facilities, Ramps Up Missile Production (legalinsurrection.com) posted 24 hours ago by PiratePatriotParrot 286 comments award share report block NYT: Israel's Military Response 'Inevitable' as Iran Restores Nuke Facilities, Ramps up Missile Production 'nother outbreak of war between Israel and Iran is only a matter of time.' legalinsurrection.com\n286 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget snakeoil 159 points 24 hours ago Hey I've seen this movie over and over again since the 90s permalink award report block reply ragnarokrobo 79 points 24 hours ago THEYRE (INSERT SCARY TIME FRAME) FROM MAKING A NUKE. AGAIN. permalink parent award report block reply TheTelltaleFly 67 points 23 hours ago Charlie Kirk did a lot of heavy lifting last time to convince Trump not to take us to war with Iran. Now that that variable has been conveniently removed I guess they are going to try to run this play again. It’s absolutely loathsome. permalink parent award report block reply Viewer01 35 points 23 hours ago I said this the other day. Elons gen z and America first sorts probably rebelled when they first tried it. So what did the Zionist boomers do? Purged them all. Elons gone and we got gay ass woke cancel culture leaking texts and whatever else. All by Jew. permalink parent award report block reply Aoikaze2000 5 points 23 hours ago The boomers really are the worst generation, aren't they? permalink parent award report block reply view 1 more comments... The_Return_of_User_x 7 points 23 hours ago What if... We Nuke their nuke? Wouldn't that make their nuke unnukable? permalink parent award report block reply Meddlesom 5 points 23 hours ago There's a snuke in hilldawg's snizz! permalink parent award report block reply view 2 more comments... snoopy3210 2 points 17 hours ago The NYT is lying, trying to destroy Trump’s ceasefire with Iran. The fordo mountaintop blew up, they don’t even have the converters to make a nuke, let alone the fragile centrifuges all messed up. It’s all fake and gay like the looner at DIA who made the initial fraudulent report. He said nuke in two weeks. permalink parent award report block reply Tellman125 1 points 11 hours ago I'll de-slang-ify your comment: What if... We Microwave their microwave? Wouldn't that make their microwave unmicrowaveable? It's crazy how much news there's written about microwaves. permalink parent award report block reply ughicanteven 1 points 21 hours ago stop getting outraged over shit that hasn't even happened. we aren't at war with iran permalink parent award report block reply SicSemperTyrannis2 -1 points 16 hours ago It's not that big a deal. Obviously Iran's nuclear program was not removed, just the specific areas attacked were substantially demolished. Allow Iran to rebuild, Israel takes out their air defenses, and we spend 30 minutes safe in Iranian air space. Iran can't afford to keep doing that, they can't even get water to their people. permalink parent award report block reply RedStoneDeepState -16 points 23 hours ago The USA cannot put boots on the ground in Iran. That would be a horrible idea. The USA can and should do more tactical bombing and at least consider strategic bombing. permalink parent award report block reply KungPaoMcChicken 20 points 23 hours ago Let Israel do the heavy lifting here. permalink parent award report block reply view 5 more comments... FrmrAmericanRepublic 17 points 23 hours ago .... or the USA could just let the retards in the middle east glass each other, and then we'd save a fuckload of time and money not bothering with the sub80's in the first place. permalink parent award report block reply view 7 more comments... MAGALADON9 -1 points 21 hours ago The terrain of Iran will be like a Vietnam with mountains permalink parent award report block reply Here_we_go 33 points 23 hours ago Again a rerun from the 90s. But it works to extract trillions from us iver the years. 109 baby. 109. permalink parent award report block reply drattastic1 9 points 23 hours ago Needs to be 110 permalink parent award report block reply Porkbut 2 points 23 hours ago Lol this is indian clickbait youre all dooming over. https://legalinsurrection.com/author/uniyal/ permalink parent award report block reply Awan-CIA-Car-Lot 6 points 23 hours ago Yes, I knew the title was bullshit, not only because it's the NYT, but because I'm sure Trump wiped out those facilities permalink parent award report block reply view 2 more comments... Thermopylae_MMXX 14 points 23 hours ago still waiting to see those WMDs u know the ones that were an entire prelude for a nation to fly across the entire planet to invade another nation that has nothing to do with them instead all we got is LMDs - Lies of Mass Dissimulation - everyday, everywhere permalink parent award report block reply Esadah1 2 points 23 hours ago It is the NYT for gosh sakes. permalink parent award report block reply mikethemarine 2 points 20 hours ago before Trump bombed them the last time, they were saying Iran was 3-5 years away from getting a NUKE, so after the bombing less than 6 months ago they now will have a NUKE, help make this make sense, the bombing cause them to be able to make a nuke 3-5 years sooner? Lets bomb the big pharma, maybe they will find a cure for cancer right after it permalink parent award report block reply load 11 more comments... OrdJFellow 61 points 23 hours ago Israel's like that crazy bitch at the bar that's constantly trying to get her boyfriend to fight other men. And we put up with it because Ben Shapiro's sister has great tits. permalink parent award report block reply IncredibleMrE1 24 points 23 hours ago Kek permalink parent award report block reply GA_Logic 19 points 23 hours ago That is a fair analogy. permalink parent award report block reply Aggrieved03 15 points 23 hours ago Lmfao permalink parent award report block reply TrumpAndGodWin 2 points 21 hours ago They're even bigger now since she's put on weight. permalink parent award report block reply shadypollster 2 points 23 hours ago They are impressive. permalink parent award report block reply load 21 more comments... Wtf_socialismreally 33 points 24 hours ago Yeah, and here I was told that the strikes were final. permalink parent award report block reply GA_Logic 20 points 23 hours ago \"Iran has nukes\" is the new subscription fee that US taxpayers foot the bill for. permalink parent award report block reply RedStoneDeepState -9 points 23 hours ago Soviets were trying to fuck with Iran since the 40s and the modern version of this issue has been constant since 1979. permalink parent award report block reply MehNahMehNah 3 points 20 hours ago Then by extension Saudi Arabia are as close an ally than Israel. And our meddling in not just Iran (the Shah) then propping up/taking out Saddam was perfectly okay because Iraq was at war with Iran. Hell, that would justify our Afghanistan occupation in spite of Bin Laden chilling in Pakistan- we're taking turns with Russia. permalink parent award report block reply view 1 more comments... LiterallyKaiser 18 points 23 hours ago Trump said he wanted regime change after getting hundreds of millions in donations from the Israel lobby. It was never just one strike. That was a lie to boil the frog and get you okay with further escalation. permalink parent award report block reply Wtf_socialismreally 8 points 23 hours ago There is a reason why I am mocking the people who said this and called people doomer for not believing it. permalink parent award report block reply SicSemperTyrannis2 1 points 16 hours ago Surely you knew better. permalink parent award report block reply TrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply patrioticwinning3 11 points 23 hours ago We just lived it a few months ago... permalink parent award report block reply GA_Logic 10 points 23 hours ago US taxpayer is seeing another shake down when the USA citizens need help! permalink parent award report block reply ColonelKlink 4 points 23 hours ago I don't want to pay for it or send any troops. permalink parent award report block reply load 9 more comments... Atlis34 76 points 24 hours ago Shapiro and Mark Levin just did the gayest high-five in human history. permalink award report block reply GA_Logic 30 points 24 hours ago They missed to connect because Levin was full of rage and Shapiro was too short. permalink parent award report block reply Here_we_go 18 points 23 hours ago They high fived with their pee shooters again. permalink parent award report block reply Brock_Shithouse 5 points 23 hours ago Yes, but that was before they heard the news. permalink parent award report block reply GA_Logic 4 points 23 hours ago That is indeed a Kodak moment. permalink parent award report block reply flashersenpai 11 points 24 hours ago ew permalink parent award report block reply Mellop 9 points 23 hours ago Well, jews built the (literally) gayest country in all of human history, so that's rather fitting. permalink parent award report block reply starjello 1 points 20 hours ago It's only gay if their balls touch. Neither of those two have any so it wasn't really good I guess permalink parent award report block reply GA_Logic 59 points 24 hours ago Not our problem. We need to fix USA FIRST.  American citizens need help! permalink award report block reply LiterallyKaiser 40 points 23 hours ago Wow. What an antisemitic thing to say. I’m going to have to report you to Mark Levin at the new dinner he’s hosting at Heritage Foundation. permalink parent award report block reply KernalMustard 0 points 23 hours ago Thats Gay as fuck. permalink parent award report block reply RedStoneDeepState -22 points 23 hours ago Our problem. American citizens can get a good job building bombs in Camden Arkansas. permalink parent award report block reply Judenfrei 18 points 23 hours ago your kippah is showing. permalink parent award report block reply RedStoneDeepState -15 points 23 hours ago I hate Iran due to it being a Soviet backed puppet who killed hundreds of US citizens. Nothing to do with Israel. permalink parent award report block reply Judenfrei 16 points 23 hours ago When did Iran kill hundreds of US citizens? permalink parent award report block reply view 15 more comments... DITTOPatriot 13 points 23 hours ago 7k bot. permalink parent award report block reply view 2 more comments... flashersenpai 13 points 23 hours ago ok boomer eat your pudding you've done enough damage already permalink parent award report block reply view 3 more comments... UncleSlayton 7 points 23 hours ago Agreed.  Not a reason to get tied up in bloodshed there. Also, we should be allies with Russia.  We WOULD be allies with Russia if not for Israeli meddling. permalink parent award report block reply view 3 more comments... GA_Logic 13 points 23 hours ago Lindsey Graham is that you? Welcome to Patriots/win permalink parent award report block reply RedStoneDeepState -11 points 23 hours ago My family is a bunch of Naval Academy grads, with that my family personally cares a lot about the Iranian attacks in Lebanon back in 1983 permalink parent award report block reply UncleSlayton 13 points 23 hours ago As an old Marine, eat shit. Beirut was the fault of the assholes who sent our good people into a place they didn't need to be with almost no support. permalink parent award report block reply view 3 more comments... flashersenpai 7 points 23 hours ago 1983 Fuck you and your ancient blood feuds. permalink parent award report block reply view 1 more comments... 45fan 5 points 23 hours ago So wait your family was involved in securing the exit for the Palestinian Liberation Organization from Beirut in 1983? A civil war we should not have been involved in and an organization we should have been, if anything, shooting ourselves? Maybe you and your family should sit this one out. permalink parent award report block reply JimmyRussler 9 points 23 hours ago $7000 permalink parent award report block reply RedStoneDeepState -9 points 23 hours ago I donate to AIPAC, I dont receive anything. permalink parent award report block reply JimmyRussler 8 points 23 hours ago $7000 permalink parent award report block reply BeauHD 0 points 23 hours ago Docker containers can't consent to paying organizations. Enough with the Israel hate. permalink parent award report block reply view 2 more comments... ReleasetheList 39 points 24 hours ago If they want to kill each other so be it. Not a single US dollar or asset should go to either side. Let them continue their never ending war without our involvement. permalink award report block reply Here_we_go 8 points 23 hours ago After awhile roi isnt worth a shekel. permalink parent award report block reply SwedishChainsaw2 0 points 22 hours ago We should buy the last F-14s back before they fight again. [Dead serious Anakin Skywalker face] permalink parent award report block reply SicSemperTyrannis2 -1 points 16 hours ago Nuclear capability is 100% our concern. permalink parent award report block reply RedStoneDeepState -27 points 23 hours ago Iran is our war more so than Israel's permalink parent award report block reply ReleasetheList 15 points 23 hours ago No it isn't. It's been part of the Greater Israel Project, a US foreign policy since at least the 90's. Probably even at least as far back as the 70's considering our CIA replaced Iran's leadership with Islamist extremists in 1979. permalink parent award report block reply RedStoneDeepState -8 points 23 hours ago Probably even at least as far back as the 70's considering our CIA replaced Iran's leadership with Islamist extremists in 1979. That was the Soviet Union, not the CIA. permalink parent award report block reply TheTelltaleFly 7 points 23 hours ago That was the Soviet Union, not the CIA. Lol permalink parent award report block reply DeaduponArousal 30 points 23 hours ago Just wait until the noticing reaches such peak levels they pull a new 9/11 with a dirty bomb and plant Iranian nuke proof passports at the bomb site. permalink award report block reply TrumpAndGodWin 3 points 21 hours ago Mike Flynn is predicting something bigger than 9/11 in the coming months. He was on the AJ show recently. permalink parent award report block reply lul_cheto 2 points 21 hours ago Even if they did everyone would blame ben shapiro... permalink parent award report block reply MegoThor 25 points 23 hours ago Who says that Iran is doing that? permalink award report block reply ImYourHuckleberry24 29 points 23 hours ago \"Experts say...\" permalink parent award report block reply MegoThor 18 points 23 hours ago “Top. Men.” permalink parent award report block reply LiterallyKaiser 17 points 23 hours ago Trumps new in-laws. permalink parent award report block reply GA_Logic 8 points 23 hours ago Kek. permalink parent award report block reply TurdFergusen 6 points 23 hours ago Ben Shapiro probably permalink parent award report block reply UsernameChexOut 22 points 23 hours ago No \"greatest ally\" = no taxpayer money wasted, just saying... permalink award report block reply RedStoneDeepState -14 points 23 hours ago Explain how Iran wouldnt be a bother without Israel. permalink parent award report block reply UsernameChexOut 13 points 23 hours ago Gas station nachos are also \"a bother\", but we shouldn't be risking WW3 over them. permalink parent award report block reply RedStoneDeepState -7 points 23 hours ago You got caught in a lie and are choosing to evade. Our issues with Iran exist independent of Israel. No Israel, and Iran's first priority would be to target the USA instead of Israel. If anything Israel is acting as a decoy. permalink parent award report block reply savman 6 points 23 hours ago \"Our\" permalink parent award report block reply view 1 more comments... UsernameChexOut 5 points 23 hours ago ROFL, not sure how you could realistically call what I said \"a lie\" but I'll pick your shit apart. If you are willing to start wars over someone who \"bothers you\", I don't know if you're a rational human. If that's your threshold for conflict, I would recommend anger management. It becomes far worse when a nuclear conflict can be potentially on the line. How would Iran attack us if Israel was not there? With what technology? Please present examples. Have you thought maybe people don't like us cause we keep bombing them? I have this radical idea... Why don't we just stop getting into wars and bombing people halfway across the world? What does it get us? It's dumb. It wastes our money and it makes people hate us. permalink parent award report block reply view 5 more comments... lul_cheto 3 points 21 hours ago Dumb take. What issue would iran have with us if we weren't meddling in the middle east for azzreal? Let me guess. \"They hate us cause we're free!\" permalink parent award report block reply view 2 more comments... tiamat 19 points 23 hours ago Israel didn't need help, leave us out of it permalink award report block reply GA_Logic 13 points 23 hours ago Agreed. Israel is a high tech nation that receives billions in US aid.  And they are a full fledged nation state that can take care of business in their own backyard. permalink parent award report block reply steini1904 2 points 22 hours ago can take care of business in their own backyard. Considering the involuntary quest mobs have been running the terrorist-faction starter village in their own damn backyard for 77 years now: Sadly, that's probably a lie. This world's oldest civilized culture really needs to learn that you can have some pride in your survival skills without making yourself suffer through yet another existential crisis... permalink parent award report block reply RedStoneDeepState -11 points 23 hours ago Iran is our war more so than Israel's permalink parent award report block reply KernalMustard 7 points 23 hours ago Oh fuck off. permalink parent award report block reply steini1904 1 points 21 hours ago Only if you want to turn them into a shortcut into the Caspian. Which is only under consideration because Russia looked at the second backbone of its economy, the UDWS and thought to itself: \"Just how much maintenance could a river possibly need.\" And since Putin finally gave the restoration of its canals a high priority in 2014 and the other Caspian countries never stopped nagging, Iran is pretty much back to loosing the same old battle that always plagued this region: https://www.youtube.com/watch?v=K44DriPrLUk permalink parent award report block reply Internet_hugs 19 points 23 hours ago Let's look at some of those favorites from yesteryear! 1992 Netanyahu told the Knesset that Iran was “within three to five years” of becoming autonomous in its ability to develop and produce a nuclear bomb. 1995 Netanyahu wrote in his book Fighting Terrorism that Iran would be capable of producing nuclear bombs within three to five years. 1996 Israeli Foreign Minister Ehud Barak told the UN Security Council that Iran would be able to produce nuclear weapons within eight years. 1999 Israel warned that unless pressure was applied, Iran would possess a nuclear capability within five years. 2003 Israeli Foreign Minister Silvan Shalom said Israel’s estimate was that Iran would have a bomb around 2009-11, and “six to nine months” for the know-how to produce a bomb from the enrichment stage. 2004 Israel’s Military Intelligence estimated that once Iran had the ability to produce sufficient enriched uranium, the first bomb could follow within 1-3 years. 2009 Netanyahu said that “our experts” believed Iran was probably only one to two years away from a nuclear weapons capability. 2012 At the UN General Assembly, Netanyahu displayed a cartoon bomb and claimed Iran was “very close” and would finish the medium-enrichment step by next spring/next summer and move on to the final stage. 2014 Netanyahu told the American Israel Public Affairs Committee (AIPAC) that Iran must be stripped of all technologies with bomb-making potential; implied that Iran was close to crossing threshold. 2015 Netanyahu told the US Congress that Iran was weeks away from having enough fissile material for an entire arsenal of nuclear bombs. 2018 Netanyahu presented purported evidence of Iran’s continued weapons effort (the “AMAD project”), saying Iran had preserved the knowledge to make a bomb very quickly. 2021 Israeli Energy Minister Yuval Steinitz said Iran’s breakout time (for enough fissile material) was around six months; for an actual weapon “around one or two years”. 2025 Netanyahu publicly stated that if not stopped, Iran “could produce a nuclear weapon in a very short time” (months or even less) and declared an Israeli operation to pre-empt this. permalink award report block reply GA_Logic 8 points 23 hours ago Putting the US taxpayer on a subscription plan...very clever indeed. permalink parent award report block reply KernalMustard 4 points 23 hours ago Bookmark this post permalink parent award report block reply RedStoneDeepState -10 points 23 hours ago Is it wrong? We actively had to obstruct Iran from getting a nuke. permalink parent award report block reply savman 6 points 23 hours ago Sand ni**er & jew fatigue is real. permalink parent award report block reply -Evspra 1 points 20 hours ago no thanks. i want them to blow themselves and their neighbors up. permalink parent award report block reply SicSemperTyrannis2 2 points 16 hours ago Nukes don't work that way, they don't stay local. Duh permalink parent award report block reply -Evspra -1 points 16 hours ago sounds like a problem for after they nuke each other permalink parent award report block reply view 6 more comments... flashersenpai 10 points 23 hours ago shit gay This whole thing is nuclear armed countries roaming the planet bullying non-nuclear countries, not just Iran. You know who doesn't have a problem with globalists doing color revolutions and getting bombed every year? North Korea. They got to walk the DMZ with Trump. PEACE So why exactly SHOULDNT a country want nukes when the nuclear armed countries are trying to instigate WW3 (NATO/EU) or have spent trillions bombing the Middle East (US/Israel)? I bet you Venezuela wouldn't be in the same position if they had nukes. So if everything you do is getting you to the opposite of what you say you want, then you're full of shit. They create the conditions for Iran to want nukes, then bomb them for trying to get them. Guess what? They just want to bomb and kill more people. They just want to bomb Iran. They just want a regime change. It's not about defending americans. All of this America last forever war bullshit creates more pointless death, more poverty at home, and MORE NUKES. permalink award report block reply RedStoneDeepState -8 points 23 hours ago Iran has never had a weapon they refuse to use. permalink parent award report block reply savman 3 points 23 hours ago Just like Israel. permalink parent award report block reply RedStoneDeepState 0 points 14 hours ago No. Israel has had nukes for decades and hasn't used them you fucking idiot permalink parent award report block reply T_BigD1745 2 points 12 hours ago Wierd if they have nukes why arent they forced to follow the same nuclear agreement that every other nation (including Iran) is regulated by? pissrael are the instigators and aggressors, their only goal is to annex more territory. permalink parent award report block reply view 1 more comments... DoMe22 9 points 23 hours ago Wow. Losers in the middle of the desert are trying to kill each other. It'd be a real shame if we would just let them fucking kill each other. permalink award report block reply DT170x 9 points 23 hours ago Ain't Iran is in a 6 year long drought. Why not build some reservoirs and desalination plants. Not resuming your Weapon Grade Nuclear weapons. Also it NYT I need more reliable information and if they go to exchange missiles again. I say watch from afar. Also I think what Iran and Israel doing is trying to get Trump involved again. permalink award report block reply flashersenpai 3 points 23 hours ago Why not build some reservoirs and desalination plants. Not resuming your Weapon Grade Nuclear weapons. Because you have to figure out how to stop getting blown up before you can focus on infrastructure. Achieving nuclear deterrence frees them up to actually improve their country. And no, they won't stop getting blown up if they agree to not build nukes. Some deep stater will just claim they are lying and produce some more BS \"officials say\" leaks. permalink parent award report block reply 1776er 0 points 17 hours ago Horse shit, Iran isn’t building infrastructure because their government are radical islamists hellbent on destroying Israel by any means necessary.  Nobody is blowing up their civilian infrastructure.  They don’t want nukes for deterrence, they nukes to destroy Israel. If you don’t care about that, that’s fine, you don’t have to.  But let’s not pretend they are a reasonable country trying to join the cool kids nuke club for deterrence permalink parent award report block reply SicSemperTyrannis2 0 points 16 hours ago It's not just Israel that Iran wants to nuke. Even North Korea can reach DC with their missiles. permalink parent award report block reply The_Emperor 0 points 19 hours ago Because since I was born, Iran has been a shit place run by shit shiaites who., like Hamas, puts money into killing instead of into building a peaceful economy.   When the Shah is gone, then I'll welcome Iranians.  Otherwise,  they wanna fight. permalink parent award report block reply RedStoneDeepState -5 points 23 hours ago Why not build some reservoirs They have excessive unregulated dams which is causing most of their issues and desalination plants. All the world leading technical experts on desalination plant design are Israelis. permalink parent award report block reply JimmyRussler 7 points 23 hours ago On today's episode of not our fucking problem. permalink award report block reply lurkwellmyfriends 7 points 23 hours ago More Israel shit. Great. permalink award report block reply DITTOPatriot 6 points 23 hours ago Well, who had that one on their bingo card? permalink award report block reply KernalMustard 6 points 22 hours ago I did. Did I win anything? permalink parent award report block reply DITTOPatriot 1 points 4 hours ago Stay strong Fren. permalink parent award report block reply TrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply Donger-Lord 6 points 23 hours ago Fuck off. I didn’t vote for trump to be doing israels bidding. Fuck israel and fuck the Iranians as well. permalink award report block reply KernalMustard 6 points 23 hours ago ............... ............... ............... ............... ............... Told ya so. permalink award report block reply savman 5 points 23 hours ago I vote for Iran nuking Israel, then the USA nuking Iran—problem solved. permalink award report block reply cjcivicx 5 points 23 hours ago LITERALLY wouldn't care if the entire middle east and Israel was nuked tomorrow. permalink award report block reply KeepingAmericaGreat 5 points 23 hours ago \"We need Tomahawks for the United States of America too. We have a lot of them but we need them. I mean, we can't deplete our country. You know, they're very vital. They're very powerful. They're very accurate. They're very good. But we need them too,\" President Trump three weeks ago. permalink award report block reply GA_Logic 1 points 23 hours ago Russia has to hold back too because sending hypersonic daggers against Ukraine might deplete their stockpile too. permalink parent award report block reply thelastlast 5 points 22 hours ago Jew York Times: FIGHT GOYIM FIGHT permalink award report block reply Smashley 4 points 23 hours ago FFS. permalink award report block reply try4gain PRO 4 points 23 hours ago good luck have fun .  lose my number permalink award report block reply boogeyman420 4 points 23 hours ago Someone just glass that whole area plz permalink award report block reply explodejoystick 4 points 23 hours ago It reminds me of the kids that would knock over the same ant hill every day at recess. permalink award report block reply FatigueIsReal 4 points 23 hours ago \"Two countries that don't know what the fuck they're doing.\" permalink award report block reply AbrahamLincoln 3 points 22 hours ago Just nuke both of them and be done with it. permalink award report block reply Formerlurker92 3 points 22 hours ago That was a quick peace. Back to business af usual permalink award report block reply Smurfection 3 points 22 hours ago Oh look! TheNews™ is trying to rile us up about the Sand War. Deport more Muslims! permalink award report block reply Prof_Smith 3 points 23 hours ago NYT…. So all garbage. permalink award report block reply FKH2 3 points 23 hours ago Iran's nuclear capabilities were completely obliterated for atleast a thousand years permalink award report block reply throttlejohnson 3 points 23 hours ago wait. I thought we destroyed their capability? weird. permalink award report block reply HuntersCrackDealer69 2 points 22 hours ago Israel's response inevitable as it gets kicked out 109 countries... permalink award report block reply hannahb 2 points 20 hours ago I'm so over hearing about Israel. permalink award report block reply MediaBro 1 points 15 hours ago I hate to say this but this isnt so much to help Israel but rather to help Saudi Arabia. Bringing down the Iranian Mullahs is a way for the Saudi Wahhabis to finally take control of Iran and build up their mosques across the country. That's what this is. You'll aren't doing Israel's bidding. You'll are doing Saudis bidding. permalink award report block reply Treefiddydiddy 1 points 13 hours ago oh noes , net and yahoo better just flatten them like gaza then ......because GOD FORBID the greater isreal project is delayed permalink award report block reply shadypollster 1 points 22 hours ago Ah shit here we go again. permalink award report block reply blueeyephoto 1 points 23 hours ago no water, but Iran can do this? permalink award report block reply FusionBlack 1 points 20 hours ago Maybe instead of the horrible \"feed the Holocaust survivors commercials\" this Christmas it will be bombs for BiBi. permalink award report block reply Pats5x 1 points 9 hours ago When history is written about the time of Trump, truthtellers will say support of Israel split and then killed the maga movement permalink award report block reply MySidesGoUp 1 points 22 hours ago We did it-  World Peace!!…. turkey gobbling and Yiddish screams ensue Queue the CJ gif… permalink award report block reply BTWiuseArch25 1 points 23 hours ago So . . .  nothing ever happens?? permalink award report block reply KennyKetchem 1 points 22 hours ago They haven't restored shit. permalink award report block reply T_BigD1745 1 points 12 hours ago HERE WE GO fuck all you faggots who called me a doomer for calling out this zionist forever war back when it first started. permalink award report block reply Tacitus1963 1 points 14 hours ago I'm sick of us being Israel's bitch.\nLet them fight Iran on their own. permalink award report block reply NoticesBugleOWO -1 points 23 hours ago Hopefully Israel whacks the ayatollah so that shithole can just implode on itself and we won't have to deal with them anymore. permalink award report block reply atomicpower -1 points 22 hours ago NYT fake news trying to drive the wedge further into the MAGA coalition. permalink award report block reply DiamondDroid -3 points 23 hours ago Just glass Iran and be done with. They hate you anyway, might as well finish it. permalink award report block reply RedStoneDeepState -11 points 24 hours ago Bomb bomb bomb, bomb bomb Iran Bomb bomb bomb, bomb bomb Iran Let's take a stand Bomb bomb bomb, bomb bomb Iran Bomb bomb bomb, bomb bomb Iran Our country's got a feelin' Really hit the ceilin', bomb Iran permalink award report block reply KernalMustard 5 points 22 hours ago Hows hell treating you McCain? permalink parent award report block reply UH69MAGA -19 points 24 hours ago Time to turn Iran into G L A S S permalink award report block reply TheTelltaleFly 22 points 24 hours ago Hey guys I found Lindsey Graham. permalink parent award report block reply Here_we_go 9 points 23 hours ago Thats Miss Lyndsay bub. permalink parent award report block reply GA_Logic 18 points 23 hours ago Iran is a waste of time. Meanwhile UK has been Islamified and they have nukes 100% for sure. permalink parent award report block reply Dangerous 3 points 23 hours ago Yeah but ultimately no matter the level of islamification in the UK they are run by jews and Iran isn't So we have to go to war with Iran. permalink parent award report block reply RedStoneDeepState -6 points 23 hours ago An ounce of prevention is worth a pound of cure. permalink parent award report block reply ZohanDvir -8 points 23 hours ago Lots of Iranian and Qatari bots here, getting upset over Iran. Who has attacked America, stolen American secrets, and has killed Americans. This place is cooked. Full of anti-America. permalink parent award report block reply flashersenpai 8 points 23 hours ago omg qatar Trump loves Qatar and works with them on military and diplomatic issues. Do you want to call him a bot too? permalink parent award report block reply ZohanDvir -3 points 23 hours ago He is working diplomatically, but does not mean he likes them. Especially when Qatar funds a lot of anti-America activities and bots. permalink parent award report block reply flashersenpai 2 points 20 hours ago Has Qatar filed FARA disclosures that they are spending hundreds of millions to target Christian Churches with influence operations? A certain country has. permalink parent award report block reply view 1 more comments... RejectoftheRepublic 4 points 23 hours ago There are also a lot of Israel shills here. You know who else has attacked America, stolen American secrets, and killed Americans? Our \"Greatest Ally\"\nBeing against foreign wars is not anti- American. Being for them is. Especially when they are behalf of another country who has done similar things permalink parent award report block reply RedStoneDeepState 1 points 14 hours ago Screeching about Israel is retarded permalink parent award report block reply ZohanDvir -4 points 23 hours ago When did Israel do that? USS Liberty? Yes, we know, and it has been debunked multiple times, Israel apologized and paid reparations multiple times permalink parent award report block reply flashersenpai 2 points 20 hours ago Israelis stole US nuclear assets. permalink parent award report block reply view 1 more comments... staroframphansbhole 2 points 23 hours ago Oh yeah I remember when Iran sank the USS Liberty, sad day permalink parent award report block reply RedStoneDeepState 0 points 14 hours ago Why do you care about a minor friendly fire incident during a hot war 50+ years ago but don't give a shit about Iran having bounties against US soldiers right now? permalink parent award report block reply staroframphansbhole 1 points 5 hours ago Why do you write off 30+ Americans being killed by a supposed ally as a \"minor friendly fire incident\"? permalink parent award report block reply view 1 more comments... ZohanDvir -2 points 23 hours ago Yes, I remember Iran killing Americans a few years ago, also funded terror who bombed American ships, and destroyed embassies. They also kidnapped Americans and left them in hostage status for years. Remember that? USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. permalink parent award report block reply staroframphansbhole 0 points 5 hours ago USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. Ah tell me my faggot Christ-killer, why would Pissfake pay reparations for something that was debunked? permalink parent award report block reply view 1 more comments... DT170x 1 points 23 hours ago Certain topics the shills will decend. Given it a Iran vs Israel topic. The shills are in force. 61 comments in 20 minutes. I wish we get this type of activity on all threads, but no it only certain \"Topics\". permalink parent award report block reply ZohanDvir 0 points 23 hours ago That is very true. I see those words in a title and I know the quality of the comments will be down. permalink parent award report block reply\nsnakeoil 159 points 24 hours ago Hey I've seen this movie over and over again since the 90s permalink award report block reply ragnarokrobo 79 points 24 hours ago THEYRE (INSERT SCARY TIME FRAME) FROM MAKING A NUKE. AGAIN. permalink parent award report block reply TheTelltaleFly 67 points 23 hours ago Charlie Kirk did a lot of heavy lifting last time to convince Trump not to take us to war with Iran. Now that that variable has been conveniently removed I guess they are going to try to run this play again. It’s absolutely loathsome. permalink parent award report block reply Viewer01 35 points 23 hours ago I said this the other day. Elons gen z and America first sorts probably rebelled when they first tried it. So what did the Zionist boomers do? Purged them all. Elons gone and we got gay ass woke cancel culture leaking texts and whatever else. All by Jew. permalink parent award report block reply Aoikaze2000 5 points 23 hours ago The boomers really are the worst generation, aren't they? permalink parent award report block reply view 1 more comments... The_Return_of_User_x 7 points 23 hours ago What if... We Nuke their nuke? Wouldn't that make their nuke unnukable? permalink parent award report block reply Meddlesom 5 points 23 hours ago There's a snuke in hilldawg's snizz! permalink parent award report block reply view 2 more comments... snoopy3210 2 points 17 hours ago The NYT is lying, trying to destroy Trump’s ceasefire with Iran. The fordo mountaintop blew up, they don’t even have the converters to make a nuke, let alone the fragile centrifuges all messed up. It’s all fake and gay like the looner at DIA who made the initial fraudulent report. He said nuke in two weeks. permalink parent award report block reply Tellman125 1 points 11 hours ago I'll de-slang-ify your comment: What if... We Microwave their microwave? Wouldn't that make their microwave unmicrowaveable? It's crazy how much news there's written about microwaves. permalink parent award report block reply ughicanteven 1 points 21 hours ago stop getting outraged over shit that hasn't even happened. we aren't at war with iran permalink parent award report block reply SicSemperTyrannis2 -1 points 16 hours ago It's not that big a deal. Obviously Iran's nuclear program was not removed, just the specific areas attacked were substantially demolished. Allow Iran to rebuild, Israel takes out their air defenses, and we spend 30 minutes safe in Iranian air space. Iran can't afford to keep doing that, they can't even get water to their people. permalink parent award report block reply RedStoneDeepState -16 points 23 hours ago The USA cannot put boots on the ground in Iran. That would be a horrible idea. The USA can and should do more tactical bombing and at least consider strategic bombing. permalink parent award report block reply KungPaoMcChicken 20 points 23 hours ago Let Israel do the heavy lifting here. permalink parent award report block reply view 5 more comments... FrmrAmericanRepublic 17 points 23 hours ago .... or the USA could just let the retards in the middle east glass each other, and then we'd save a fuckload of time and money not bothering with the sub80's in the first place. permalink parent award report block reply view 7 more comments... MAGALADON9 -1 points 21 hours ago The terrain of Iran will be like a Vietnam with mountains permalink parent award report block reply Here_we_go 33 points 23 hours ago Again a rerun from the 90s. But it works to extract trillions from us iver the years. 109 baby. 109. permalink parent award report block reply drattastic1 9 points 23 hours ago Needs to be 110 permalink parent award report block reply Porkbut 2 points 23 hours ago Lol this is indian clickbait youre all dooming over. https://legalinsurrection.com/author/uniyal/ permalink parent award report block reply Awan-CIA-Car-Lot 6 points 23 hours ago Yes, I knew the title was bullshit, not only because it's the NYT, but because I'm sure Trump wiped out those facilities permalink parent award report block reply view 2 more comments... Thermopylae_MMXX 14 points 23 hours ago still waiting to see those WMDs u know the ones that were an entire prelude for a nation to fly across the entire planet to invade another nation that has nothing to do with them instead all we got is LMDs - Lies of Mass Dissimulation - everyday, everywhere permalink parent award report block reply Esadah1 2 points 23 hours ago It is the NYT for gosh sakes. permalink parent award report block reply mikethemarine 2 points 20 hours ago before Trump bombed them the last time, they were saying Iran was 3-5 years away from getting a NUKE, so after the bombing less than 6 months ago they now will have a NUKE, help make this make sense, the bombing cause them to be able to make a nuke 3-5 years sooner? Lets bomb the big pharma, maybe they will find a cure for cancer right after it permalink parent award report block reply load 11 more comments... OrdJFellow 61 points 23 hours ago Israel's like that crazy bitch at the bar that's constantly trying to get her boyfriend to fight other men. And we put up with it because Ben Shapiro's sister has great tits. permalink parent award report block reply IncredibleMrE1 24 points 23 hours ago Kek permalink parent award report block reply GA_Logic 19 points 23 hours ago That is a fair analogy. permalink parent award report block reply Aggrieved03 15 points 23 hours ago Lmfao permalink parent award report block reply TrumpAndGodWin 2 points 21 hours ago They're even bigger now since she's put on weight. permalink parent award report block reply shadypollster 2 points 23 hours ago They are impressive. permalink parent award report block reply load 21 more comments... Wtf_socialismreally 33 points 24 hours ago Yeah, and here I was told that the strikes were final. permalink parent award report block reply GA_Logic 20 points 23 hours ago \"Iran has nukes\" is the new subscription fee that US taxpayers foot the bill for. permalink parent award report block reply RedStoneDeepState -9 points 23 hours ago Soviets were trying to fuck with Iran since the 40s and the modern version of this issue has been constant since 1979. permalink parent award report block reply MehNahMehNah 3 points 20 hours ago Then by extension Saudi Arabia are as close an ally than Israel. And our meddling in not just Iran (the Shah) then propping up/taking out Saddam was perfectly okay because Iraq was at war with Iran. Hell, that would justify our Afghanistan occupation in spite of Bin Laden chilling in Pakistan- we're taking turns with Russia. permalink parent award report block reply view 1 more comments... LiterallyKaiser 18 points 23 hours ago Trump said he wanted regime change after getting hundreds of millions in donations from the Israel lobby. It was never just one strike. That was a lie to boil the frog and get you okay with further escalation. permalink parent award report block reply Wtf_socialismreally 8 points 23 hours ago There is a reason why I am mocking the people who said this and called people doomer for not believing it. permalink parent award report block reply SicSemperTyrannis2 1 points 16 hours ago Surely you knew better. permalink parent award report block reply TrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply patrioticwinning3 11 points 23 hours ago We just lived it a few months ago... permalink parent award report block reply GA_Logic 10 points 23 hours ago US taxpayer is seeing another shake down when the USA citizens need help! permalink parent award report block reply ColonelKlink 4 points 23 hours ago I don't want to pay for it or send any troops. permalink parent award report block reply load 9 more comments...\nragnarokrobo 79 points 24 hours ago THEYRE (INSERT SCARY TIME FRAME) FROM MAKING A NUKE. AGAIN. permalink parent award report block reply TheTelltaleFly 67 points 23 hours ago Charlie Kirk did a lot of heavy lifting last time to convince Trump not to take us to war with Iran. Now that that variable has been conveniently removed I guess they are going to try to run this play again. It’s absolutely loathsome. permalink parent award report block reply Viewer01 35 points 23 hours ago I said this the other day. Elons gen z and America first sorts probably rebelled when they first tried it. So what did the Zionist boomers do? Purged them all. Elons gone and we got gay ass woke cancel culture leaking texts and whatever else. All by Jew. permalink parent award report block reply Aoikaze2000 5 points 23 hours ago The boomers really are the worst generation, aren't they? permalink parent award report block reply view 1 more comments... The_Return_of_User_x 7 points 23 hours ago What if... We Nuke their nuke? Wouldn't that make their nuke unnukable? permalink parent award report block reply Meddlesom 5 points 23 hours ago There's a snuke in hilldawg's snizz! permalink parent award report block reply view 2 more comments... snoopy3210 2 points 17 hours ago The NYT is lying, trying to destroy Trump’s ceasefire with Iran. The fordo mountaintop blew up, they don’t even have the converters to make a nuke, let alone the fragile centrifuges all messed up. It’s all fake and gay like the looner at DIA who made the initial fraudulent report. He said nuke in two weeks. permalink parent award report block reply Tellman125 1 points 11 hours ago I'll de-slang-ify your comment: What if... We Microwave their microwave? Wouldn't that make their microwave unmicrowaveable? It's crazy how much news there's written about microwaves. permalink parent award report block reply ughicanteven 1 points 21 hours ago stop getting outraged over shit that hasn't even happened. we aren't at war with iran permalink parent award report block reply SicSemperTyrannis2 -1 points 16 hours ago It's not that big a deal. Obviously Iran's nuclear program was not removed, just the specific areas attacked were substantially demolished. Allow Iran to rebuild, Israel takes out their air defenses, and we spend 30 minutes safe in Iranian air space. Iran can't afford to keep doing that, they can't even get water to their people. permalink parent award report block reply RedStoneDeepState -16 points 23 hours ago The USA cannot put boots on the ground in Iran. That would be a horrible idea. The USA can and should do more tactical bombing and at least consider strategic bombing. permalink parent award report block reply KungPaoMcChicken 20 points 23 hours ago Let Israel do the heavy lifting here. permalink parent award report block reply view 5 more comments... FrmrAmericanRepublic 17 points 23 hours ago .... or the USA could just let the retards in the middle east glass each other, and then we'd save a fuckload of time and money not bothering with the sub80's in the first place. permalink parent award report block reply view 7 more comments... MAGALADON9 -1 points 21 hours ago The terrain of Iran will be like a Vietnam with mountains permalink parent award report block reply Here_we_go 33 points 23 hours ago Again a rerun from the 90s. But it works to extract trillions from us iver the years. 109 baby. 109. permalink parent award report block reply drattastic1 9 points 23 hours ago Needs to be 110 permalink parent award report block reply Porkbut 2 points 23 hours ago Lol this is indian clickbait youre all dooming over. https://legalinsurrection.com/author/uniyal/ permalink parent award report block reply Awan-CIA-Car-Lot 6 points 23 hours ago Yes, I knew the title was bullshit, not only because it's the NYT, but because I'm sure Trump wiped out those facilities permalink parent award report block reply view 2 more comments... Thermopylae_MMXX 14 points 23 hours ago still waiting to see those WMDs u know the ones that were an entire prelude for a nation to fly across the entire planet to invade another nation that has nothing to do with them instead all we got is LMDs - Lies of Mass Dissimulation - everyday, everywhere permalink parent award report block reply Esadah1 2 points 23 hours ago It is the NYT for gosh sakes. permalink parent award report block reply mikethemarine 2 points 20 hours ago before Trump bombed them the last time, they were saying Iran was 3-5 years away from getting a NUKE, so after the bombing less than 6 months ago they now will have a NUKE, help make this make sense, the bombing cause them to be able to make a nuke 3-5 years sooner? Lets bomb the big pharma, maybe they will find a cure for cancer right after it permalink parent award report block reply load 11 more comments...\nTheTelltaleFly 67 points 23 hours ago Charlie Kirk did a lot of heavy lifting last time to convince Trump not to take us to war with Iran. Now that that variable has been conveniently removed I guess they are going to try to run this play again. It’s absolutely loathsome. permalink parent award report block reply Viewer01 35 points 23 hours ago I said this the other day. Elons gen z and America first sorts probably rebelled when they first tried it. So what did the Zionist boomers do? Purged them all. Elons gone and we got gay ass woke cancel culture leaking texts and whatever else. All by Jew. permalink parent award report block reply Aoikaze2000 5 points 23 hours ago The boomers really are the worst generation, aren't they? permalink parent award report block reply view 1 more comments... The_Return_of_User_x 7 points 23 hours ago What if... We Nuke their nuke? Wouldn't that make their nuke unnukable? permalink parent award report block reply Meddlesom 5 points 23 hours ago There's a snuke in hilldawg's snizz! permalink parent award report block reply view 2 more comments... snoopy3210 2 points 17 hours ago The NYT is lying, trying to destroy Trump’s ceasefire with Iran. The fordo mountaintop blew up, they don’t even have the converters to make a nuke, let alone the fragile centrifuges all messed up. It’s all fake and gay like the looner at DIA who made the initial fraudulent report. He said nuke in two weeks. permalink parent award report block reply Tellman125 1 points 11 hours ago I'll de-slang-ify your comment: What if... We Microwave their microwave? Wouldn't that make their microwave unmicrowaveable? It's crazy how much news there's written about microwaves. permalink parent award report block reply ughicanteven 1 points 21 hours ago stop getting outraged over shit that hasn't even happened. we aren't at war with iran permalink parent award report block reply SicSemperTyrannis2 -1 points 16 hours ago It's not that big a deal. Obviously Iran's nuclear program was not removed, just the specific areas attacked were substantially demolished. Allow Iran to rebuild, Israel takes out their air defenses, and we spend 30 minutes safe in Iranian air space. Iran can't afford to keep doing that, they can't even get water to their people. permalink parent award report block reply RedStoneDeepState -16 points 23 hours ago The USA cannot put boots on the ground in Iran. That would be a horrible idea. The USA can and should do more tactical bombing and at least consider strategic bombing. permalink parent award report block reply KungPaoMcChicken 20 points 23 hours ago Let Israel do the heavy lifting here. permalink parent award report block reply view 5 more comments... FrmrAmericanRepublic 17 points 23 hours ago .... or the USA could just let the retards in the middle east glass each other, and then we'd save a fuckload of time and money not bothering with the sub80's in the first place. permalink parent award report block reply view 7 more comments... MAGALADON9 -1 points 21 hours ago The terrain of Iran will be like a Vietnam with mountains permalink parent award report block reply\nViewer01 35 points 23 hours ago I said this the other day. Elons gen z and America first sorts probably rebelled when they first tried it. So what did the Zionist boomers do? Purged them all. Elons gone and we got gay ass woke cancel culture leaking texts and whatever else. All by Jew. permalink parent award report block reply Aoikaze2000 5 points 23 hours ago The boomers really are the worst generation, aren't they? permalink parent award report block reply view 1 more comments...\nAoikaze2000 5 points 23 hours ago The boomers really are the worst generation, aren't they? permalink parent award report block reply view 1 more comments...\nThe_Return_of_User_x 7 points 23 hours ago What if... We Nuke their nuke? Wouldn't that make their nuke unnukable? permalink parent award report block reply Meddlesom 5 points 23 hours ago There's a snuke in hilldawg's snizz! permalink parent award report block reply view 2 more comments... snoopy3210 2 points 17 hours ago The NYT is lying, trying to destroy Trump’s ceasefire with Iran. The fordo mountaintop blew up, they don’t even have the converters to make a nuke, let alone the fragile centrifuges all messed up. It’s all fake and gay like the looner at DIA who made the initial fraudulent report. He said nuke in two weeks. permalink parent award report block reply Tellman125 1 points 11 hours ago I'll de-slang-ify your comment: What if... We Microwave their microwave? Wouldn't that make their microwave unmicrowaveable? It's crazy how much news there's written about microwaves. permalink parent award report block reply\nMeddlesom 5 points 23 hours ago There's a snuke in hilldawg's snizz! permalink parent award report block reply view 2 more comments...\nsnoopy3210 2 points 17 hours ago The NYT is lying, trying to destroy Trump’s ceasefire with Iran. The fordo mountaintop blew up, they don’t even have the converters to make a nuke, let alone the fragile centrifuges all messed up. It’s all fake and gay like the looner at DIA who made the initial fraudulent report. He said nuke in two weeks. permalink parent award report block reply\nTellman125 1 points 11 hours ago I'll de-slang-ify your comment: What if... We Microwave their microwave? Wouldn't that make their microwave unmicrowaveable? It's crazy how much news there's written about microwaves. permalink parent award report block reply\nughicanteven 1 points 21 hours ago stop getting outraged over shit that hasn't even happened. we aren't at war with iran permalink parent award report block reply\nSicSemperTyrannis2 -1 points 16 hours ago It's not that big a deal. Obviously Iran's nuclear program was not removed, just the specific areas attacked were substantially demolished. Allow Iran to rebuild, Israel takes out their air defenses, and we spend 30 minutes safe in Iranian air space. Iran can't afford to keep doing that, they can't even get water to their people. permalink parent award report block reply\nRedStoneDeepState -16 points 23 hours ago The USA cannot put boots on the ground in Iran. That would be a horrible idea. The USA can and should do more tactical bombing and at least consider strategic bombing. permalink parent award report block reply KungPaoMcChicken 20 points 23 hours ago Let Israel do the heavy lifting here. permalink parent award report block reply view 5 more comments... FrmrAmericanRepublic 17 points 23 hours ago .... or the USA could just let the retards in the middle east glass each other, and then we'd save a fuckload of time and money not bothering with the sub80's in the first place. permalink parent award report block reply view 7 more comments... MAGALADON9 -1 points 21 hours ago The terrain of Iran will be like a Vietnam with mountains permalink parent award report block reply\nKungPaoMcChicken 20 points 23 hours ago Let Israel do the heavy lifting here. permalink parent award report block reply view 5 more comments...\nFrmrAmericanRepublic 17 points 23 hours ago .... or the USA could just let the retards in the middle east glass each other, and then we'd save a fuckload of time and money not bothering with the sub80's in the first place. permalink parent award report block reply view 7 more comments...\nMAGALADON9 -1 points 21 hours ago The terrain of Iran will be like a Vietnam with mountains permalink parent award report block reply\nHere_we_go 33 points 23 hours ago Again a rerun from the 90s. But it works to extract trillions from us iver the years. 109 baby. 109. permalink parent award report block reply drattastic1 9 points 23 hours ago Needs to be 110 permalink parent award report block reply Porkbut 2 points 23 hours ago Lol this is indian clickbait youre all dooming over. https://legalinsurrection.com/author/uniyal/ permalink parent award report block reply Awan-CIA-Car-Lot 6 points 23 hours ago Yes, I knew the title was bullshit, not only because it's the NYT, but because I'm sure Trump wiped out those facilities permalink parent award report block reply view 2 more comments...\ndrattastic1 9 points 23 hours ago Needs to be 110 permalink parent award report block reply\nPorkbut 2 points 23 hours ago Lol this is indian clickbait youre all dooming over. https://legalinsurrection.com/author/uniyal/ permalink parent award report block reply Awan-CIA-Car-Lot 6 points 23 hours ago Yes, I knew the title was bullshit, not only because it's the NYT, but because I'm sure Trump wiped out those facilities permalink parent award report block reply view 2 more comments...\nAwan-CIA-Car-Lot 6 points 23 hours ago Yes, I knew the title was bullshit, not only because it's the NYT, but because I'm sure Trump wiped out those facilities permalink parent award report block reply view 2 more comments...\nThermopylae_MMXX 14 points 23 hours ago still waiting to see those WMDs u know the ones that were an entire prelude for a nation to fly across the entire planet to invade another nation that has nothing to do with them instead all we got is LMDs - Lies of Mass Dissimulation - everyday, everywhere permalink parent award report block reply\nEsadah1 2 points 23 hours ago It is the NYT for gosh sakes. permalink parent award report block reply\nmikethemarine 2 points 20 hours ago before Trump bombed them the last time, they were saying Iran was 3-5 years away from getting a NUKE, so after the bombing less than 6 months ago they now will have a NUKE, help make this make sense, the bombing cause them to be able to make a nuke 3-5 years sooner? Lets bomb the big pharma, maybe they will find a cure for cancer right after it permalink parent award report block reply\nOrdJFellow 61 points 23 hours ago Israel's like that crazy bitch at the bar that's constantly trying to get her boyfriend to fight other men. And we put up with it because Ben Shapiro's sister has great tits. permalink parent award report block reply IncredibleMrE1 24 points 23 hours ago Kek permalink parent award report block reply GA_Logic 19 points 23 hours ago That is a fair analogy. permalink parent award report block reply Aggrieved03 15 points 23 hours ago Lmfao permalink parent award report block reply TrumpAndGodWin 2 points 21 hours ago They're even bigger now since she's put on weight. permalink parent award report block reply shadypollster 2 points 23 hours ago They are impressive. permalink parent award report block reply load 21 more comments...\nIncredibleMrE1 24 points 23 hours ago Kek permalink parent award report block reply\nGA_Logic 19 points 23 hours ago That is a fair analogy. permalink parent award report block reply\nAggrieved03 15 points 23 hours ago Lmfao permalink parent award report block reply\nTrumpAndGodWin 2 points 21 hours ago They're even bigger now since she's put on weight. permalink parent award report block reply\nshadypollster 2 points 23 hours ago They are impressive. permalink parent award report block reply\nWtf_socialismreally 33 points 24 hours ago Yeah, and here I was told that the strikes were final. permalink parent award report block reply GA_Logic 20 points 23 hours ago \"Iran has nukes\" is the new subscription fee that US taxpayers foot the bill for. permalink parent award report block reply RedStoneDeepState -9 points 23 hours ago Soviets were trying to fuck with Iran since the 40s and the modern version of this issue has been constant since 1979. permalink parent award report block reply MehNahMehNah 3 points 20 hours ago Then by extension Saudi Arabia are as close an ally than Israel. And our meddling in not just Iran (the Shah) then propping up/taking out Saddam was perfectly okay because Iraq was at war with Iran. Hell, that would justify our Afghanistan occupation in spite of Bin Laden chilling in Pakistan- we're taking turns with Russia. permalink parent award report block reply view 1 more comments... LiterallyKaiser 18 points 23 hours ago Trump said he wanted regime change after getting hundreds of millions in donations from the Israel lobby. It was never just one strike. That was a lie to boil the frog and get you okay with further escalation. permalink parent award report block reply Wtf_socialismreally 8 points 23 hours ago There is a reason why I am mocking the people who said this and called people doomer for not believing it. permalink parent award report block reply SicSemperTyrannis2 1 points 16 hours ago Surely you knew better. permalink parent award report block reply TrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nGA_Logic 20 points 23 hours ago \"Iran has nukes\" is the new subscription fee that US taxpayers foot the bill for. permalink parent award report block reply RedStoneDeepState -9 points 23 hours ago Soviets were trying to fuck with Iran since the 40s and the modern version of this issue has been constant since 1979. permalink parent award report block reply MehNahMehNah 3 points 20 hours ago Then by extension Saudi Arabia are as close an ally than Israel. And our meddling in not just Iran (the Shah) then propping up/taking out Saddam was perfectly okay because Iraq was at war with Iran. Hell, that would justify our Afghanistan occupation in spite of Bin Laden chilling in Pakistan- we're taking turns with Russia. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState -9 points 23 hours ago Soviets were trying to fuck with Iran since the 40s and the modern version of this issue has been constant since 1979. permalink parent award report block reply MehNahMehNah 3 points 20 hours ago Then by extension Saudi Arabia are as close an ally than Israel. And our meddling in not just Iran (the Shah) then propping up/taking out Saddam was perfectly okay because Iraq was at war with Iran. Hell, that would justify our Afghanistan occupation in spite of Bin Laden chilling in Pakistan- we're taking turns with Russia. permalink parent award report block reply view 1 more comments...\nMehNahMehNah 3 points 20 hours ago Then by extension Saudi Arabia are as close an ally than Israel. And our meddling in not just Iran (the Shah) then propping up/taking out Saddam was perfectly okay because Iraq was at war with Iran. Hell, that would justify our Afghanistan occupation in spite of Bin Laden chilling in Pakistan- we're taking turns with Russia. permalink parent award report block reply view 1 more comments...\nLiterallyKaiser 18 points 23 hours ago Trump said he wanted regime change after getting hundreds of millions in donations from the Israel lobby. It was never just one strike. That was a lie to boil the frog and get you okay with further escalation. permalink parent award report block reply Wtf_socialismreally 8 points 23 hours ago There is a reason why I am mocking the people who said this and called people doomer for not believing it. permalink parent award report block reply\nWtf_socialismreally 8 points 23 hours ago There is a reason why I am mocking the people who said this and called people doomer for not believing it. permalink parent award report block reply\nSicSemperTyrannis2 1 points 16 hours ago Surely you knew better. permalink parent award report block reply\nTrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply\npatrioticwinning3 11 points 23 hours ago We just lived it a few months ago... permalink parent award report block reply GA_Logic 10 points 23 hours ago US taxpayer is seeing another shake down when the USA citizens need help! permalink parent award report block reply\nGA_Logic 10 points 23 hours ago US taxpayer is seeing another shake down when the USA citizens need help! permalink parent award report block reply\nColonelKlink 4 points 23 hours ago I don't want to pay for it or send any troops. permalink parent award report block reply\nAtlis34 76 points 24 hours ago Shapiro and Mark Levin just did the gayest high-five in human history. permalink award report block reply GA_Logic 30 points 24 hours ago They missed to connect because Levin was full of rage and Shapiro was too short. permalink parent award report block reply Here_we_go 18 points 23 hours ago They high fived with their pee shooters again. permalink parent award report block reply Brock_Shithouse 5 points 23 hours ago Yes, but that was before they heard the news. permalink parent award report block reply GA_Logic 4 points 23 hours ago That is indeed a Kodak moment. permalink parent award report block reply flashersenpai 11 points 24 hours ago ew permalink parent award report block reply Mellop 9 points 23 hours ago Well, jews built the (literally) gayest country in all of human history, so that's rather fitting. permalink parent award report block reply starjello 1 points 20 hours ago It's only gay if their balls touch. Neither of those two have any so it wasn't really good I guess permalink parent award report block reply\nGA_Logic 30 points 24 hours ago They missed to connect because Levin was full of rage and Shapiro was too short. permalink parent award report block reply Here_we_go 18 points 23 hours ago They high fived with their pee shooters again. permalink parent award report block reply Brock_Shithouse 5 points 23 hours ago Yes, but that was before they heard the news. permalink parent award report block reply GA_Logic 4 points 23 hours ago That is indeed a Kodak moment. permalink parent award report block reply\nHere_we_go 18 points 23 hours ago They high fived with their pee shooters again. permalink parent award report block reply Brock_Shithouse 5 points 23 hours ago Yes, but that was before they heard the news. permalink parent award report block reply GA_Logic 4 points 23 hours ago That is indeed a Kodak moment. permalink parent award report block reply\nBrock_Shithouse 5 points 23 hours ago Yes, but that was before they heard the news. permalink parent award report block reply\nGA_Logic 4 points 23 hours ago That is indeed a Kodak moment. permalink parent award report block reply\nflashersenpai 11 points 24 hours ago ew permalink parent award report block reply\nMellop 9 points 23 hours ago Well, jews built the (literally) gayest country in all of human history, so that's rather fitting. permalink parent award report block reply\nstarjello 1 points 20 hours ago It's only gay if their balls touch. Neither of those two have any so it wasn't really good I guess permalink parent award report block reply\nGA_Logic 59 points 24 hours ago Not our problem. We need to fix USA FIRST.  American citizens need help! permalink award report block reply LiterallyKaiser 40 points 23 hours ago Wow. What an antisemitic thing to say. I’m going to have to report you to Mark Levin at the new dinner he’s hosting at Heritage Foundation. permalink parent award report block reply KernalMustard 0 points 23 hours ago Thats Gay as fuck. permalink parent award report block reply RedStoneDeepState -22 points 23 hours ago Our problem. American citizens can get a good job building bombs in Camden Arkansas. permalink parent award report block reply Judenfrei 18 points 23 hours ago your kippah is showing. permalink parent award report block reply RedStoneDeepState -15 points 23 hours ago I hate Iran due to it being a Soviet backed puppet who killed hundreds of US citizens. Nothing to do with Israel. permalink parent award report block reply Judenfrei 16 points 23 hours ago When did Iran kill hundreds of US citizens? permalink parent award report block reply view 15 more comments... DITTOPatriot 13 points 23 hours ago 7k bot. permalink parent award report block reply view 2 more comments... flashersenpai 13 points 23 hours ago ok boomer eat your pudding you've done enough damage already permalink parent award report block reply view 3 more comments... UncleSlayton 7 points 23 hours ago Agreed.  Not a reason to get tied up in bloodshed there. Also, we should be allies with Russia.  We WOULD be allies with Russia if not for Israeli meddling. permalink parent award report block reply view 3 more comments... GA_Logic 13 points 23 hours ago Lindsey Graham is that you? Welcome to Patriots/win permalink parent award report block reply RedStoneDeepState -11 points 23 hours ago My family is a bunch of Naval Academy grads, with that my family personally cares a lot about the Iranian attacks in Lebanon back in 1983 permalink parent award report block reply UncleSlayton 13 points 23 hours ago As an old Marine, eat shit. Beirut was the fault of the assholes who sent our good people into a place they didn't need to be with almost no support. permalink parent award report block reply view 3 more comments... flashersenpai 7 points 23 hours ago 1983 Fuck you and your ancient blood feuds. permalink parent award report block reply view 1 more comments... 45fan 5 points 23 hours ago So wait your family was involved in securing the exit for the Palestinian Liberation Organization from Beirut in 1983? A civil war we should not have been involved in and an organization we should have been, if anything, shooting ourselves? Maybe you and your family should sit this one out. permalink parent award report block reply JimmyRussler 9 points 23 hours ago $7000 permalink parent award report block reply RedStoneDeepState -9 points 23 hours ago I donate to AIPAC, I dont receive anything. permalink parent award report block reply JimmyRussler 8 points 23 hours ago $7000 permalink parent award report block reply BeauHD 0 points 23 hours ago Docker containers can't consent to paying organizations. Enough with the Israel hate. permalink parent award report block reply view 2 more comments...\nLiterallyKaiser 40 points 23 hours ago Wow. What an antisemitic thing to say. I’m going to have to report you to Mark Levin at the new dinner he’s hosting at Heritage Foundation. permalink parent award report block reply KernalMustard 0 points 23 hours ago Thats Gay as fuck. permalink parent award report block reply\nKernalMustard 0 points 23 hours ago Thats Gay as fuck. permalink parent award report block reply\nRedStoneDeepState -22 points 23 hours ago Our problem. American citizens can get a good job building bombs in Camden Arkansas. permalink parent award report block reply Judenfrei 18 points 23 hours ago your kippah is showing. permalink parent award report block reply RedStoneDeepState -15 points 23 hours ago I hate Iran due to it being a Soviet backed puppet who killed hundreds of US citizens. Nothing to do with Israel. permalink parent award report block reply Judenfrei 16 points 23 hours ago When did Iran kill hundreds of US citizens? permalink parent award report block reply view 15 more comments... DITTOPatriot 13 points 23 hours ago 7k bot. permalink parent award report block reply view 2 more comments... flashersenpai 13 points 23 hours ago ok boomer eat your pudding you've done enough damage already permalink parent award report block reply view 3 more comments... UncleSlayton 7 points 23 hours ago Agreed.  Not a reason to get tied up in bloodshed there. Also, we should be allies with Russia.  We WOULD be allies with Russia if not for Israeli meddling. permalink parent award report block reply view 3 more comments... GA_Logic 13 points 23 hours ago Lindsey Graham is that you? Welcome to Patriots/win permalink parent award report block reply RedStoneDeepState -11 points 23 hours ago My family is a bunch of Naval Academy grads, with that my family personally cares a lot about the Iranian attacks in Lebanon back in 1983 permalink parent award report block reply UncleSlayton 13 points 23 hours ago As an old Marine, eat shit. Beirut was the fault of the assholes who sent our good people into a place they didn't need to be with almost no support. permalink parent award report block reply view 3 more comments... flashersenpai 7 points 23 hours ago 1983 Fuck you and your ancient blood feuds. permalink parent award report block reply view 1 more comments... 45fan 5 points 23 hours ago So wait your family was involved in securing the exit for the Palestinian Liberation Organization from Beirut in 1983? A civil war we should not have been involved in and an organization we should have been, if anything, shooting ourselves? Maybe you and your family should sit this one out. permalink parent award report block reply JimmyRussler 9 points 23 hours ago $7000 permalink parent award report block reply RedStoneDeepState -9 points 23 hours ago I donate to AIPAC, I dont receive anything. permalink parent award report block reply JimmyRussler 8 points 23 hours ago $7000 permalink parent award report block reply BeauHD 0 points 23 hours ago Docker containers can't consent to paying organizations. Enough with the Israel hate. permalink parent award report block reply view 2 more comments...\nJudenfrei 18 points 23 hours ago your kippah is showing. permalink parent award report block reply RedStoneDeepState -15 points 23 hours ago I hate Iran due to it being a Soviet backed puppet who killed hundreds of US citizens. Nothing to do with Israel. permalink parent award report block reply Judenfrei 16 points 23 hours ago When did Iran kill hundreds of US citizens? permalink parent award report block reply view 15 more comments... DITTOPatriot 13 points 23 hours ago 7k bot. permalink parent award report block reply view 2 more comments... flashersenpai 13 points 23 hours ago ok boomer eat your pudding you've done enough damage already permalink parent award report block reply view 3 more comments... UncleSlayton 7 points 23 hours ago Agreed.  Not a reason to get tied up in bloodshed there. Also, we should be allies with Russia.  We WOULD be allies with Russia if not for Israeli meddling. permalink parent award report block reply view 3 more comments...\nRedStoneDeepState -15 points 23 hours ago I hate Iran due to it being a Soviet backed puppet who killed hundreds of US citizens. Nothing to do with Israel. permalink parent award report block reply Judenfrei 16 points 23 hours ago When did Iran kill hundreds of US citizens? permalink parent award report block reply view 15 more comments... DITTOPatriot 13 points 23 hours ago 7k bot. permalink parent award report block reply view 2 more comments... flashersenpai 13 points 23 hours ago ok boomer eat your pudding you've done enough damage already permalink parent award report block reply view 3 more comments... UncleSlayton 7 points 23 hours ago Agreed.  Not a reason to get tied up in bloodshed there. Also, we should be allies with Russia.  We WOULD be allies with Russia if not for Israeli meddling. permalink parent award report block reply view 3 more comments...\nJudenfrei 16 points 23 hours ago When did Iran kill hundreds of US citizens? permalink parent award report block reply view 15 more comments...\nDITTOPatriot 13 points 23 hours ago 7k bot. permalink parent award report block reply view 2 more comments...\nflashersenpai 13 points 23 hours ago ok boomer eat your pudding you've done enough damage already permalink parent award report block reply view 3 more comments...\nUncleSlayton 7 points 23 hours ago Agreed.  Not a reason to get tied up in bloodshed there. Also, we should be allies with Russia.  We WOULD be allies with Russia if not for Israeli meddling. permalink parent award report block reply view 3 more comments...\nGA_Logic 13 points 23 hours ago Lindsey Graham is that you? Welcome to Patriots/win permalink parent award report block reply RedStoneDeepState -11 points 23 hours ago My family is a bunch of Naval Academy grads, with that my family personally cares a lot about the Iranian attacks in Lebanon back in 1983 permalink parent award report block reply UncleSlayton 13 points 23 hours ago As an old Marine, eat shit. Beirut was the fault of the assholes who sent our good people into a place they didn't need to be with almost no support. permalink parent award report block reply view 3 more comments... flashersenpai 7 points 23 hours ago 1983 Fuck you and your ancient blood feuds. permalink parent award report block reply view 1 more comments... 45fan 5 points 23 hours ago So wait your family was involved in securing the exit for the Palestinian Liberation Organization from Beirut in 1983? A civil war we should not have been involved in and an organization we should have been, if anything, shooting ourselves? Maybe you and your family should sit this one out. permalink parent award report block reply\nRedStoneDeepState -11 points 23 hours ago My family is a bunch of Naval Academy grads, with that my family personally cares a lot about the Iranian attacks in Lebanon back in 1983 permalink parent award report block reply UncleSlayton 13 points 23 hours ago As an old Marine, eat shit. Beirut was the fault of the assholes who sent our good people into a place they didn't need to be with almost no support. permalink parent award report block reply view 3 more comments... flashersenpai 7 points 23 hours ago 1983 Fuck you and your ancient blood feuds. permalink parent award report block reply view 1 more comments... 45fan 5 points 23 hours ago So wait your family was involved in securing the exit for the Palestinian Liberation Organization from Beirut in 1983? A civil war we should not have been involved in and an organization we should have been, if anything, shooting ourselves? Maybe you and your family should sit this one out. permalink parent award report block reply\nUncleSlayton 13 points 23 hours ago As an old Marine, eat shit. Beirut was the fault of the assholes who sent our good people into a place they didn't need to be with almost no support. permalink parent award report block reply view 3 more comments...\nflashersenpai 7 points 23 hours ago 1983 Fuck you and your ancient blood feuds. permalink parent award report block reply view 1 more comments...\n45fan 5 points 23 hours ago So wait your family was involved in securing the exit for the Palestinian Liberation Organization from Beirut in 1983? A civil war we should not have been involved in and an organization we should have been, if anything, shooting ourselves? Maybe you and your family should sit this one out. permalink parent award report block reply\nJimmyRussler 9 points 23 hours ago $7000 permalink parent award report block reply RedStoneDeepState -9 points 23 hours ago I donate to AIPAC, I dont receive anything. permalink parent award report block reply JimmyRussler 8 points 23 hours ago $7000 permalink parent award report block reply BeauHD 0 points 23 hours ago Docker containers can't consent to paying organizations. Enough with the Israel hate. permalink parent award report block reply view 2 more comments...\nRedStoneDeepState -9 points 23 hours ago I donate to AIPAC, I dont receive anything. permalink parent award report block reply JimmyRussler 8 points 23 hours ago $7000 permalink parent award report block reply BeauHD 0 points 23 hours ago Docker containers can't consent to paying organizations. Enough with the Israel hate. permalink parent award report block reply view 2 more comments...\nJimmyRussler 8 points 23 hours ago $7000 permalink parent award report block reply\nBeauHD 0 points 23 hours ago Docker containers can't consent to paying organizations. Enough with the Israel hate. permalink parent award report block reply view 2 more comments...\nReleasetheList 39 points 24 hours ago If they want to kill each other so be it. Not a single US dollar or asset should go to either side. Let them continue their never ending war without our involvement. permalink award report block reply Here_we_go 8 points 23 hours ago After awhile roi isnt worth a shekel. permalink parent award report block reply SwedishChainsaw2 0 points 22 hours ago We should buy the last F-14s back before they fight again. [Dead serious Anakin Skywalker face] permalink parent award report block reply SicSemperTyrannis2 -1 points 16 hours ago Nuclear capability is 100% our concern. permalink parent award report block reply RedStoneDeepState -27 points 23 hours ago Iran is our war more so than Israel's permalink parent award report block reply ReleasetheList 15 points 23 hours ago No it isn't. It's been part of the Greater Israel Project, a US foreign policy since at least the 90's. Probably even at least as far back as the 70's considering our CIA replaced Iran's leadership with Islamist extremists in 1979. permalink parent award report block reply RedStoneDeepState -8 points 23 hours ago Probably even at least as far back as the 70's considering our CIA replaced Iran's leadership with Islamist extremists in 1979. That was the Soviet Union, not the CIA. permalink parent award report block reply TheTelltaleFly 7 points 23 hours ago That was the Soviet Union, not the CIA. Lol permalink parent award report block reply\nHere_we_go 8 points 23 hours ago After awhile roi isnt worth a shekel. permalink parent award report block reply\nSwedishChainsaw2 0 points 22 hours ago We should buy the last F-14s back before they fight again. [Dead serious Anakin Skywalker face] permalink parent award report block reply\nSicSemperTyrannis2 -1 points 16 hours ago Nuclear capability is 100% our concern. permalink parent award report block reply\nRedStoneDeepState -27 points 23 hours ago Iran is our war more so than Israel's permalink parent award report block reply ReleasetheList 15 points 23 hours ago No it isn't. It's been part of the Greater Israel Project, a US foreign policy since at least the 90's. Probably even at least as far back as the 70's considering our CIA replaced Iran's leadership with Islamist extremists in 1979. permalink parent award report block reply RedStoneDeepState -8 points 23 hours ago Probably even at least as far back as the 70's considering our CIA replaced Iran's leadership with Islamist extremists in 1979. That was the Soviet Union, not the CIA. permalink parent award report block reply TheTelltaleFly 7 points 23 hours ago That was the Soviet Union, not the CIA. Lol permalink parent award report block reply\nReleasetheList 15 points 23 hours ago No it isn't. It's been part of the Greater Israel Project, a US foreign policy since at least the 90's. Probably even at least as far back as the 70's considering our CIA replaced Iran's leadership with Islamist extremists in 1979. permalink parent award report block reply RedStoneDeepState -8 points 23 hours ago Probably even at least as far back as the 70's considering our CIA replaced Iran's leadership with Islamist extremists in 1979. That was the Soviet Union, not the CIA. permalink parent award report block reply TheTelltaleFly 7 points 23 hours ago That was the Soviet Union, not the CIA. Lol permalink parent award report block reply\nRedStoneDeepState -8 points 23 hours ago Probably even at least as far back as the 70's considering our CIA replaced Iran's leadership with Islamist extremists in 1979. That was the Soviet Union, not the CIA. permalink parent award report block reply TheTelltaleFly 7 points 23 hours ago That was the Soviet Union, not the CIA. Lol permalink parent award report block reply\nTheTelltaleFly 7 points 23 hours ago That was the Soviet Union, not the CIA. Lol permalink parent award report block reply\nDeaduponArousal 30 points 23 hours ago Just wait until the noticing reaches such peak levels they pull a new 9/11 with a dirty bomb and plant Iranian nuke proof passports at the bomb site. permalink award report block reply TrumpAndGodWin 3 points 21 hours ago Mike Flynn is predicting something bigger than 9/11 in the coming months. He was on the AJ show recently. permalink parent award report block reply lul_cheto 2 points 21 hours ago Even if they did everyone would blame ben shapiro... permalink parent award report block reply\nTrumpAndGodWin 3 points 21 hours ago Mike Flynn is predicting something bigger than 9/11 in the coming months. He was on the AJ show recently. permalink parent award report block reply\nlul_cheto 2 points 21 hours ago Even if they did everyone would blame ben shapiro... permalink parent award report block reply\nMegoThor 25 points 23 hours ago Who says that Iran is doing that? permalink award report block reply ImYourHuckleberry24 29 points 23 hours ago \"Experts say...\" permalink parent award report block reply MegoThor 18 points 23 hours ago “Top. Men.” permalink parent award report block reply LiterallyKaiser 17 points 23 hours ago Trumps new in-laws. permalink parent award report block reply GA_Logic 8 points 23 hours ago Kek. permalink parent award report block reply TurdFergusen 6 points 23 hours ago Ben Shapiro probably permalink parent award report block reply\nImYourHuckleberry24 29 points 23 hours ago \"Experts say...\" permalink parent award report block reply MegoThor 18 points 23 hours ago “Top. Men.” permalink parent award report block reply\nMegoThor 18 points 23 hours ago “Top. Men.” permalink parent award report block reply\nLiterallyKaiser 17 points 23 hours ago Trumps new in-laws. permalink parent award report block reply GA_Logic 8 points 23 hours ago Kek. permalink parent award report block reply\nGA_Logic 8 points 23 hours ago Kek. permalink parent award report block reply\nTurdFergusen 6 points 23 hours ago Ben Shapiro probably permalink parent award report block reply\nUsernameChexOut 22 points 23 hours ago No \"greatest ally\" = no taxpayer money wasted, just saying... permalink award report block reply RedStoneDeepState -14 points 23 hours ago Explain how Iran wouldnt be a bother without Israel. permalink parent award report block reply UsernameChexOut 13 points 23 hours ago Gas station nachos are also \"a bother\", but we shouldn't be risking WW3 over them. permalink parent award report block reply RedStoneDeepState -7 points 23 hours ago You got caught in a lie and are choosing to evade. Our issues with Iran exist independent of Israel. No Israel, and Iran's first priority would be to target the USA instead of Israel. If anything Israel is acting as a decoy. permalink parent award report block reply savman 6 points 23 hours ago \"Our\" permalink parent award report block reply view 1 more comments... UsernameChexOut 5 points 23 hours ago ROFL, not sure how you could realistically call what I said \"a lie\" but I'll pick your shit apart. If you are willing to start wars over someone who \"bothers you\", I don't know if you're a rational human. If that's your threshold for conflict, I would recommend anger management. It becomes far worse when a nuclear conflict can be potentially on the line. How would Iran attack us if Israel was not there? With what technology? Please present examples. Have you thought maybe people don't like us cause we keep bombing them? I have this radical idea... Why don't we just stop getting into wars and bombing people halfway across the world? What does it get us? It's dumb. It wastes our money and it makes people hate us. permalink parent award report block reply view 5 more comments... lul_cheto 3 points 21 hours ago Dumb take. What issue would iran have with us if we weren't meddling in the middle east for azzreal? Let me guess. \"They hate us cause we're free!\" permalink parent award report block reply view 2 more comments...\nRedStoneDeepState -14 points 23 hours ago Explain how Iran wouldnt be a bother without Israel. permalink parent award report block reply UsernameChexOut 13 points 23 hours ago Gas station nachos are also \"a bother\", but we shouldn't be risking WW3 over them. permalink parent award report block reply RedStoneDeepState -7 points 23 hours ago You got caught in a lie and are choosing to evade. Our issues with Iran exist independent of Israel. No Israel, and Iran's first priority would be to target the USA instead of Israel. If anything Israel is acting as a decoy. permalink parent award report block reply savman 6 points 23 hours ago \"Our\" permalink parent award report block reply view 1 more comments... UsernameChexOut 5 points 23 hours ago ROFL, not sure how you could realistically call what I said \"a lie\" but I'll pick your shit apart. If you are willing to start wars over someone who \"bothers you\", I don't know if you're a rational human. If that's your threshold for conflict, I would recommend anger management. It becomes far worse when a nuclear conflict can be potentially on the line. How would Iran attack us if Israel was not there? With what technology? Please present examples. Have you thought maybe people don't like us cause we keep bombing them? I have this radical idea... Why don't we just stop getting into wars and bombing people halfway across the world? What does it get us? It's dumb. It wastes our money and it makes people hate us. permalink parent award report block reply view 5 more comments... lul_cheto 3 points 21 hours ago Dumb take. What issue would iran have with us if we weren't meddling in the middle east for azzreal? Let me guess. \"They hate us cause we're free!\" permalink parent award report block reply view 2 more comments...\nUsernameChexOut 13 points 23 hours ago Gas station nachos are also \"a bother\", but we shouldn't be risking WW3 over them. permalink parent award report block reply RedStoneDeepState -7 points 23 hours ago You got caught in a lie and are choosing to evade. Our issues with Iran exist independent of Israel. No Israel, and Iran's first priority would be to target the USA instead of Israel. If anything Israel is acting as a decoy. permalink parent award report block reply savman 6 points 23 hours ago \"Our\" permalink parent award report block reply view 1 more comments... UsernameChexOut 5 points 23 hours ago ROFL, not sure how you could realistically call what I said \"a lie\" but I'll pick your shit apart. If you are willing to start wars over someone who \"bothers you\", I don't know if you're a rational human. If that's your threshold for conflict, I would recommend anger management. It becomes far worse when a nuclear conflict can be potentially on the line. How would Iran attack us if Israel was not there? With what technology? Please present examples. Have you thought maybe people don't like us cause we keep bombing them? I have this radical idea... Why don't we just stop getting into wars and bombing people halfway across the world? What does it get us? It's dumb. It wastes our money and it makes people hate us. permalink parent award report block reply view 5 more comments... lul_cheto 3 points 21 hours ago Dumb take. What issue would iran have with us if we weren't meddling in the middle east for azzreal? Let me guess. \"They hate us cause we're free!\" permalink parent award report block reply view 2 more comments...\nRedStoneDeepState -7 points 23 hours ago You got caught in a lie and are choosing to evade. Our issues with Iran exist independent of Israel. No Israel, and Iran's first priority would be to target the USA instead of Israel. If anything Israel is acting as a decoy. permalink parent award report block reply savman 6 points 23 hours ago \"Our\" permalink parent award report block reply view 1 more comments... UsernameChexOut 5 points 23 hours ago ROFL, not sure how you could realistically call what I said \"a lie\" but I'll pick your shit apart. If you are willing to start wars over someone who \"bothers you\", I don't know if you're a rational human. If that's your threshold for conflict, I would recommend anger management. It becomes far worse when a nuclear conflict can be potentially on the line. How would Iran attack us if Israel was not there? With what technology? Please present examples. Have you thought maybe people don't like us cause we keep bombing them? I have this radical idea... Why don't we just stop getting into wars and bombing people halfway across the world? What does it get us? It's dumb. It wastes our money and it makes people hate us. permalink parent award report block reply view 5 more comments... lul_cheto 3 points 21 hours ago Dumb take. What issue would iran have with us if we weren't meddling in the middle east for azzreal? Let me guess. \"They hate us cause we're free!\" permalink parent award report block reply view 2 more comments...\nsavman 6 points 23 hours ago \"Our\" permalink parent award report block reply view 1 more comments...\nUsernameChexOut 5 points 23 hours ago ROFL, not sure how you could realistically call what I said \"a lie\" but I'll pick your shit apart. If you are willing to start wars over someone who \"bothers you\", I don't know if you're a rational human. If that's your threshold for conflict, I would recommend anger management. It becomes far worse when a nuclear conflict can be potentially on the line. How would Iran attack us if Israel was not there? With what technology? Please present examples. Have you thought maybe people don't like us cause we keep bombing them? I have this radical idea... Why don't we just stop getting into wars and bombing people halfway across the world? What does it get us? It's dumb. It wastes our money and it makes people hate us. permalink parent award report block reply view 5 more comments...\nlul_cheto 3 points 21 hours ago Dumb take. What issue would iran have with us if we weren't meddling in the middle east for azzreal? Let me guess. \"They hate us cause we're free!\" permalink parent award report block reply view 2 more comments...\ntiamat 19 points 23 hours ago Israel didn't need help, leave us out of it permalink award report block reply GA_Logic 13 points 23 hours ago Agreed. Israel is a high tech nation that receives billions in US aid.  And they are a full fledged nation state that can take care of business in their own backyard. permalink parent award report block reply steini1904 2 points 22 hours ago can take care of business in their own backyard. Considering the involuntary quest mobs have been running the terrorist-faction starter village in their own damn backyard for 77 years now: Sadly, that's probably a lie. This world's oldest civilized culture really needs to learn that you can have some pride in your survival skills without making yourself suffer through yet another existential crisis... permalink parent award report block reply RedStoneDeepState -11 points 23 hours ago Iran is our war more so than Israel's permalink parent award report block reply KernalMustard 7 points 23 hours ago Oh fuck off. permalink parent award report block reply steini1904 1 points 21 hours ago Only if you want to turn them into a shortcut into the Caspian. Which is only under consideration because Russia looked at the second backbone of its economy, the UDWS and thought to itself: \"Just how much maintenance could a river possibly need.\" And since Putin finally gave the restoration of its canals a high priority in 2014 and the other Caspian countries never stopped nagging, Iran is pretty much back to loosing the same old battle that always plagued this region: https://www.youtube.com/watch?v=K44DriPrLUk permalink parent award report block reply\nGA_Logic 13 points 23 hours ago Agreed. Israel is a high tech nation that receives billions in US aid.  And they are a full fledged nation state that can take care of business in their own backyard. permalink parent award report block reply steini1904 2 points 22 hours ago can take care of business in their own backyard. Considering the involuntary quest mobs have been running the terrorist-faction starter village in their own damn backyard for 77 years now: Sadly, that's probably a lie. This world's oldest civilized culture really needs to learn that you can have some pride in your survival skills without making yourself suffer through yet another existential crisis... permalink parent award report block reply\nsteini1904 2 points 22 hours ago can take care of business in their own backyard. Considering the involuntary quest mobs have been running the terrorist-faction starter village in their own damn backyard for 77 years now: Sadly, that's probably a lie. This world's oldest civilized culture really needs to learn that you can have some pride in your survival skills without making yourself suffer through yet another existential crisis... permalink parent award report block reply\nRedStoneDeepState -11 points 23 hours ago Iran is our war more so than Israel's permalink parent award report block reply KernalMustard 7 points 23 hours ago Oh fuck off. permalink parent award report block reply steini1904 1 points 21 hours ago Only if you want to turn them into a shortcut into the Caspian. Which is only under consideration because Russia looked at the second backbone of its economy, the UDWS and thought to itself: \"Just how much maintenance could a river possibly need.\" And since Putin finally gave the restoration of its canals a high priority in 2014 and the other Caspian countries never stopped nagging, Iran is pretty much back to loosing the same old battle that always plagued this region: https://www.youtube.com/watch?v=K44DriPrLUk permalink parent award report block reply\nKernalMustard 7 points 23 hours ago Oh fuck off. permalink parent award report block reply\nsteini1904 1 points 21 hours ago Only if you want to turn them into a shortcut into the Caspian. Which is only under consideration because Russia looked at the second backbone of its economy, the UDWS and thought to itself: \"Just how much maintenance could a river possibly need.\" And since Putin finally gave the restoration of its canals a high priority in 2014 and the other Caspian countries never stopped nagging, Iran is pretty much back to loosing the same old battle that always plagued this region: https://www.youtube.com/watch?v=K44DriPrLUk permalink parent award report block reply\nInternet_hugs 19 points 23 hours ago Let's look at some of those favorites from yesteryear! 1992 Netanyahu told the Knesset that Iran was “within three to five years” of becoming autonomous in its ability to develop and produce a nuclear bomb. 1995 Netanyahu wrote in his book Fighting Terrorism that Iran would be capable of producing nuclear bombs within three to five years. 1996 Israeli Foreign Minister Ehud Barak told the UN Security Council that Iran would be able to produce nuclear weapons within eight years. 1999 Israel warned that unless pressure was applied, Iran would possess a nuclear capability within five years. 2003 Israeli Foreign Minister Silvan Shalom said Israel’s estimate was that Iran would have a bomb around 2009-11, and “six to nine months” for the know-how to produce a bomb from the enrichment stage. 2004 Israel’s Military Intelligence estimated that once Iran had the ability to produce sufficient enriched uranium, the first bomb could follow within 1-3 years. 2009 Netanyahu said that “our experts” believed Iran was probably only one to two years away from a nuclear weapons capability. 2012 At the UN General Assembly, Netanyahu displayed a cartoon bomb and claimed Iran was “very close” and would finish the medium-enrichment step by next spring/next summer and move on to the final stage. 2014 Netanyahu told the American Israel Public Affairs Committee (AIPAC) that Iran must be stripped of all technologies with bomb-making potential; implied that Iran was close to crossing threshold. 2015 Netanyahu told the US Congress that Iran was weeks away from having enough fissile material for an entire arsenal of nuclear bombs. 2018 Netanyahu presented purported evidence of Iran’s continued weapons effort (the “AMAD project”), saying Iran had preserved the knowledge to make a bomb very quickly. 2021 Israeli Energy Minister Yuval Steinitz said Iran’s breakout time (for enough fissile material) was around six months; for an actual weapon “around one or two years”. 2025 Netanyahu publicly stated that if not stopped, Iran “could produce a nuclear weapon in a very short time” (months or even less) and declared an Israeli operation to pre-empt this. permalink award report block reply GA_Logic 8 points 23 hours ago Putting the US taxpayer on a subscription plan...very clever indeed. permalink parent award report block reply KernalMustard 4 points 23 hours ago Bookmark this post permalink parent award report block reply RedStoneDeepState -10 points 23 hours ago Is it wrong? We actively had to obstruct Iran from getting a nuke. permalink parent award report block reply savman 6 points 23 hours ago Sand ni**er & jew fatigue is real. permalink parent award report block reply -Evspra 1 points 20 hours ago no thanks. i want them to blow themselves and their neighbors up. permalink parent award report block reply SicSemperTyrannis2 2 points 16 hours ago Nukes don't work that way, they don't stay local. Duh permalink parent award report block reply -Evspra -1 points 16 hours ago sounds like a problem for after they nuke each other permalink parent award report block reply view 6 more comments...\nGA_Logic 8 points 23 hours ago Putting the US taxpayer on a subscription plan...very clever indeed. permalink parent award report block reply\nKernalMustard 4 points 23 hours ago Bookmark this post permalink parent award report block reply\nRedStoneDeepState -10 points 23 hours ago Is it wrong? We actively had to obstruct Iran from getting a nuke. permalink parent award report block reply savman 6 points 23 hours ago Sand ni**er & jew fatigue is real. permalink parent award report block reply -Evspra 1 points 20 hours ago no thanks. i want them to blow themselves and their neighbors up. permalink parent award report block reply SicSemperTyrannis2 2 points 16 hours ago Nukes don't work that way, they don't stay local. Duh permalink parent award report block reply -Evspra -1 points 16 hours ago sounds like a problem for after they nuke each other permalink parent award report block reply view 6 more comments...\nsavman 6 points 23 hours ago Sand ni**er & jew fatigue is real. permalink parent award report block reply\n-Evspra 1 points 20 hours ago no thanks. i want them to blow themselves and their neighbors up. permalink parent award report block reply SicSemperTyrannis2 2 points 16 hours ago Nukes don't work that way, they don't stay local. Duh permalink parent award report block reply -Evspra -1 points 16 hours ago sounds like a problem for after they nuke each other permalink parent award report block reply view 6 more comments...\nSicSemperTyrannis2 2 points 16 hours ago Nukes don't work that way, they don't stay local. Duh permalink parent award report block reply -Evspra -1 points 16 hours ago sounds like a problem for after they nuke each other permalink parent award report block reply view 6 more comments...\n-Evspra -1 points 16 hours ago sounds like a problem for after they nuke each other permalink parent award report block reply view 6 more comments...\nflashersenpai 10 points 23 hours ago shit gay This whole thing is nuclear armed countries roaming the planet bullying non-nuclear countries, not just Iran. You know who doesn't have a problem with globalists doing color revolutions and getting bombed every year? North Korea. They got to walk the DMZ with Trump. PEACE So why exactly SHOULDNT a country want nukes when the nuclear armed countries are trying to instigate WW3 (NATO/EU) or have spent trillions bombing the Middle East (US/Israel)? I bet you Venezuela wouldn't be in the same position if they had nukes. So if everything you do is getting you to the opposite of what you say you want, then you're full of shit. They create the conditions for Iran to want nukes, then bomb them for trying to get them. Guess what? They just want to bomb and kill more people. They just want to bomb Iran. They just want a regime change. It's not about defending americans. All of this America last forever war bullshit creates more pointless death, more poverty at home, and MORE NUKES. permalink award report block reply RedStoneDeepState -8 points 23 hours ago Iran has never had a weapon they refuse to use. permalink parent award report block reply savman 3 points 23 hours ago Just like Israel. permalink parent award report block reply RedStoneDeepState 0 points 14 hours ago No. Israel has had nukes for decades and hasn't used them you fucking idiot permalink parent award report block reply T_BigD1745 2 points 12 hours ago Wierd if they have nukes why arent they forced to follow the same nuclear agreement that every other nation (including Iran) is regulated by? pissrael are the instigators and aggressors, their only goal is to annex more territory. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState -8 points 23 hours ago Iran has never had a weapon they refuse to use. permalink parent award report block reply savman 3 points 23 hours ago Just like Israel. permalink parent award report block reply RedStoneDeepState 0 points 14 hours ago No. Israel has had nukes for decades and hasn't used them you fucking idiot permalink parent award report block reply T_BigD1745 2 points 12 hours ago Wierd if they have nukes why arent they forced to follow the same nuclear agreement that every other nation (including Iran) is regulated by? pissrael are the instigators and aggressors, their only goal is to annex more territory. permalink parent award report block reply view 1 more comments...\nsavman 3 points 23 hours ago Just like Israel. permalink parent award report block reply RedStoneDeepState 0 points 14 hours ago No. Israel has had nukes for decades and hasn't used them you fucking idiot permalink parent award report block reply T_BigD1745 2 points 12 hours ago Wierd if they have nukes why arent they forced to follow the same nuclear agreement that every other nation (including Iran) is regulated by? pissrael are the instigators and aggressors, their only goal is to annex more territory. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 0 points 14 hours ago No. Israel has had nukes for decades and hasn't used them you fucking idiot permalink parent award report block reply T_BigD1745 2 points 12 hours ago Wierd if they have nukes why arent they forced to follow the same nuclear agreement that every other nation (including Iran) is regulated by? pissrael are the instigators and aggressors, their only goal is to annex more territory. permalink parent award report block reply view 1 more comments...\nT_BigD1745 2 points 12 hours ago Wierd if they have nukes why arent they forced to follow the same nuclear agreement that every other nation (including Iran) is regulated by? pissrael are the instigators and aggressors, their only goal is to annex more territory. permalink parent award report block reply view 1 more comments...\nDoMe22 9 points 23 hours ago Wow. Losers in the middle of the desert are trying to kill each other. It'd be a real shame if we would just let them fucking kill each other. permalink award report block reply\nDT170x 9 points 23 hours ago Ain't Iran is in a 6 year long drought. Why not build some reservoirs and desalination plants. Not resuming your Weapon Grade Nuclear weapons. Also it NYT I need more reliable information and if they go to exchange missiles again. I say watch from afar. Also I think what Iran and Israel doing is trying to get Trump involved again. permalink award report block reply flashersenpai 3 points 23 hours ago Why not build some reservoirs and desalination plants. Not resuming your Weapon Grade Nuclear weapons. Because you have to figure out how to stop getting blown up before you can focus on infrastructure. Achieving nuclear deterrence frees them up to actually improve their country. And no, they won't stop getting blown up if they agree to not build nukes. Some deep stater will just claim they are lying and produce some more BS \"officials say\" leaks. permalink parent award report block reply 1776er 0 points 17 hours ago Horse shit, Iran isn’t building infrastructure because their government are radical islamists hellbent on destroying Israel by any means necessary.  Nobody is blowing up their civilian infrastructure.  They don’t want nukes for deterrence, they nukes to destroy Israel. If you don’t care about that, that’s fine, you don’t have to.  But let’s not pretend they are a reasonable country trying to join the cool kids nuke club for deterrence permalink parent award report block reply SicSemperTyrannis2 0 points 16 hours ago It's not just Israel that Iran wants to nuke. Even North Korea can reach DC with their missiles. permalink parent award report block reply The_Emperor 0 points 19 hours ago Because since I was born, Iran has been a shit place run by shit shiaites who., like Hamas, puts money into killing instead of into building a peaceful economy.   When the Shah is gone, then I'll welcome Iranians.  Otherwise,  they wanna fight. permalink parent award report block reply RedStoneDeepState -5 points 23 hours ago Why not build some reservoirs They have excessive unregulated dams which is causing most of their issues and desalination plants. All the world leading technical experts on desalination plant design are Israelis. permalink parent award report block reply\nflashersenpai 3 points 23 hours ago Why not build some reservoirs and desalination plants. Not resuming your Weapon Grade Nuclear weapons. Because you have to figure out how to stop getting blown up before you can focus on infrastructure. Achieving nuclear deterrence frees them up to actually improve their country. And no, they won't stop getting blown up if they agree to not build nukes. Some deep stater will just claim they are lying and produce some more BS \"officials say\" leaks. permalink parent award report block reply 1776er 0 points 17 hours ago Horse shit, Iran isn’t building infrastructure because their government are radical islamists hellbent on destroying Israel by any means necessary.  Nobody is blowing up their civilian infrastructure.  They don’t want nukes for deterrence, they nukes to destroy Israel. If you don’t care about that, that’s fine, you don’t have to.  But let’s not pretend they are a reasonable country trying to join the cool kids nuke club for deterrence permalink parent award report block reply SicSemperTyrannis2 0 points 16 hours ago It's not just Israel that Iran wants to nuke. Even North Korea can reach DC with their missiles. permalink parent award report block reply The_Emperor 0 points 19 hours ago Because since I was born, Iran has been a shit place run by shit shiaites who., like Hamas, puts money into killing instead of into building a peaceful economy.   When the Shah is gone, then I'll welcome Iranians.  Otherwise,  they wanna fight. permalink parent award report block reply\n1776er 0 points 17 hours ago Horse shit, Iran isn’t building infrastructure because their government are radical islamists hellbent on destroying Israel by any means necessary.  Nobody is blowing up their civilian infrastructure.  They don’t want nukes for deterrence, they nukes to destroy Israel. If you don’t care about that, that’s fine, you don’t have to.  But let’s not pretend they are a reasonable country trying to join the cool kids nuke club for deterrence permalink parent award report block reply SicSemperTyrannis2 0 points 16 hours ago It's not just Israel that Iran wants to nuke. Even North Korea can reach DC with their missiles. permalink parent award report block reply\nSicSemperTyrannis2 0 points 16 hours ago It's not just Israel that Iran wants to nuke. Even North Korea can reach DC with their missiles. permalink parent award report block reply\nThe_Emperor 0 points 19 hours ago Because since I was born, Iran has been a shit place run by shit shiaites who., like Hamas, puts money into killing instead of into building a peaceful economy.   When the Shah is gone, then I'll welcome Iranians.  Otherwise,  they wanna fight. permalink parent award report block reply\nRedStoneDeepState -5 points 23 hours ago Why not build some reservoirs They have excessive unregulated dams which is causing most of their issues and desalination plants. All the world leading technical experts on desalination plant design are Israelis. permalink parent award report block reply\nJimmyRussler 7 points 23 hours ago On today's episode of not our fucking problem. permalink award report block reply\nlurkwellmyfriends 7 points 23 hours ago More Israel shit. Great. permalink award report block reply\nDITTOPatriot 6 points 23 hours ago Well, who had that one on their bingo card? permalink award report block reply KernalMustard 6 points 22 hours ago I did. Did I win anything? permalink parent award report block reply DITTOPatriot 1 points 4 hours ago Stay strong Fren. permalink parent award report block reply TrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nKernalMustard 6 points 22 hours ago I did. Did I win anything? permalink parent award report block reply DITTOPatriot 1 points 4 hours ago Stay strong Fren. permalink parent award report block reply\nDITTOPatriot 1 points 4 hours ago Stay strong Fren. permalink parent award report block reply\nTrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nDonger-Lord 6 points 23 hours ago Fuck off. I didn’t vote for trump to be doing israels bidding. Fuck israel and fuck the Iranians as well. permalink award report block reply\nKernalMustard 6 points 23 hours ago ............... ............... ............... ............... ............... Told ya so. permalink award report block reply\nsavman 5 points 23 hours ago I vote for Iran nuking Israel, then the USA nuking Iran—problem solved. permalink award report block reply\ncjcivicx 5 points 23 hours ago LITERALLY wouldn't care if the entire middle east and Israel was nuked tomorrow. permalink award report block reply\nKeepingAmericaGreat 5 points 23 hours ago \"We need Tomahawks for the United States of America too. We have a lot of them but we need them. I mean, we can't deplete our country. You know, they're very vital. They're very powerful. They're very accurate. They're very good. But we need them too,\" President Trump three weeks ago. permalink award report block reply GA_Logic 1 points 23 hours ago Russia has to hold back too because sending hypersonic daggers against Ukraine might deplete their stockpile too. permalink parent award report block reply\nGA_Logic 1 points 23 hours ago Russia has to hold back too because sending hypersonic daggers against Ukraine might deplete their stockpile too. permalink parent award report block reply\nthelastlast 5 points 22 hours ago Jew York Times: FIGHT GOYIM FIGHT permalink award report block reply\nSmashley 4 points 23 hours ago FFS. permalink award report block reply\ntry4gain PRO 4 points 23 hours ago good luck have fun .  lose my number permalink award report block reply\nboogeyman420 4 points 23 hours ago Someone just glass that whole area plz permalink award report block reply\nexplodejoystick 4 points 23 hours ago It reminds me of the kids that would knock over the same ant hill every day at recess. permalink award report block reply\nFatigueIsReal 4 points 23 hours ago \"Two countries that don't know what the fuck they're doing.\" permalink award report block reply\nAbrahamLincoln 3 points 22 hours ago Just nuke both of them and be done with it. permalink award report block reply\nFormerlurker92 3 points 22 hours ago That was a quick peace. Back to business af usual permalink award report block reply\nSmurfection 3 points 22 hours ago Oh look! TheNews™ is trying to rile us up about the Sand War. Deport more Muslims! permalink award report block reply\nProf_Smith 3 points 23 hours ago NYT…. So all garbage. permalink award report block reply\nFKH2 3 points 23 hours ago Iran's nuclear capabilities were completely obliterated for atleast a thousand years permalink award report block reply\nthrottlejohnson 3 points 23 hours ago wait. I thought we destroyed their capability? weird. permalink award report block reply\nHuntersCrackDealer69 2 points 22 hours ago Israel's response inevitable as it gets kicked out 109 countries... permalink award report block reply\nhannahb 2 points 20 hours ago I'm so over hearing about Israel. permalink award report block reply\nMediaBro 1 points 15 hours ago I hate to say this but this isnt so much to help Israel but rather to help Saudi Arabia. Bringing down the Iranian Mullahs is a way for the Saudi Wahhabis to finally take control of Iran and build up their mosques across the country. That's what this is. You'll aren't doing Israel's bidding. You'll are doing Saudis bidding. permalink award report block reply\nTreefiddydiddy 1 points 13 hours ago oh noes , net and yahoo better just flatten them like gaza then ......because GOD FORBID the greater isreal project is delayed permalink award report block reply\nshadypollster 1 points 22 hours ago Ah shit here we go again. permalink award report block reply\nblueeyephoto 1 points 23 hours ago no water, but Iran can do this? permalink award report block reply\nFusionBlack 1 points 20 hours ago Maybe instead of the horrible \"feed the Holocaust survivors commercials\" this Christmas it will be bombs for BiBi. permalink award report block reply\nPats5x 1 points 9 hours ago When history is written about the time of Trump, truthtellers will say support of Israel split and then killed the maga movement permalink award report block reply\nMySidesGoUp 1 points 22 hours ago We did it-  World Peace!!…. turkey gobbling and Yiddish screams ensue Queue the CJ gif… permalink award report block reply\nBTWiuseArch25 1 points 23 hours ago So . . .  nothing ever happens?? permalink award report block reply\nKennyKetchem 1 points 22 hours ago They haven't restored shit. permalink award report block reply\nT_BigD1745 1 points 12 hours ago HERE WE GO fuck all you faggots who called me a doomer for calling out this zionist forever war back when it first started. permalink award report block reply\nTacitus1963 1 points 14 hours ago I'm sick of us being Israel's bitch.\nLet them fight Iran on their own. permalink award report block reply\nNoticesBugleOWO -1 points 23 hours ago Hopefully Israel whacks the ayatollah so that shithole can just implode on itself and we won't have to deal with them anymore. permalink award report block reply\natomicpower -1 points 22 hours ago NYT fake news trying to drive the wedge further into the MAGA coalition. permalink award report block reply\nDiamondDroid -3 points 23 hours ago Just glass Iran and be done with. They hate you anyway, might as well finish it. permalink award report block reply\nRedStoneDeepState -11 points 24 hours ago Bomb bomb bomb, bomb bomb Iran Bomb bomb bomb, bomb bomb Iran Let's take a stand Bomb bomb bomb, bomb bomb Iran Bomb bomb bomb, bomb bomb Iran Our country's got a feelin' Really hit the ceilin', bomb Iran permalink award report block reply KernalMustard 5 points 22 hours ago Hows hell treating you McCain? permalink parent award report block reply\nKernalMustard 5 points 22 hours ago Hows hell treating you McCain? permalink parent award report block reply\nUH69MAGA -19 points 24 hours ago Time to turn Iran into G L A S S permalink award report block reply TheTelltaleFly 22 points 24 hours ago Hey guys I found Lindsey Graham. permalink parent award report block reply Here_we_go 9 points 23 hours ago Thats Miss Lyndsay bub. permalink parent award report block reply GA_Logic 18 points 23 hours ago Iran is a waste of time. Meanwhile UK has been Islamified and they have nukes 100% for sure. permalink parent award report block reply Dangerous 3 points 23 hours ago Yeah but ultimately no matter the level of islamification in the UK they are run by jews and Iran isn't So we have to go to war with Iran. permalink parent award report block reply RedStoneDeepState -6 points 23 hours ago An ounce of prevention is worth a pound of cure. permalink parent award report block reply ZohanDvir -8 points 23 hours ago Lots of Iranian and Qatari bots here, getting upset over Iran. Who has attacked America, stolen American secrets, and has killed Americans. This place is cooked. Full of anti-America. permalink parent award report block reply flashersenpai 8 points 23 hours ago omg qatar Trump loves Qatar and works with them on military and diplomatic issues. Do you want to call him a bot too? permalink parent award report block reply ZohanDvir -3 points 23 hours ago He is working diplomatically, but does not mean he likes them. Especially when Qatar funds a lot of anti-America activities and bots. permalink parent award report block reply flashersenpai 2 points 20 hours ago Has Qatar filed FARA disclosures that they are spending hundreds of millions to target Christian Churches with influence operations? A certain country has. permalink parent award report block reply view 1 more comments... RejectoftheRepublic 4 points 23 hours ago There are also a lot of Israel shills here. You know who else has attacked America, stolen American secrets, and killed Americans? Our \"Greatest Ally\"\nBeing against foreign wars is not anti- American. Being for them is. Especially when they are behalf of another country who has done similar things permalink parent award report block reply RedStoneDeepState 1 points 14 hours ago Screeching about Israel is retarded permalink parent award report block reply ZohanDvir -4 points 23 hours ago When did Israel do that? USS Liberty? Yes, we know, and it has been debunked multiple times, Israel apologized and paid reparations multiple times permalink parent award report block reply flashersenpai 2 points 20 hours ago Israelis stole US nuclear assets. permalink parent award report block reply view 1 more comments... staroframphansbhole 2 points 23 hours ago Oh yeah I remember when Iran sank the USS Liberty, sad day permalink parent award report block reply RedStoneDeepState 0 points 14 hours ago Why do you care about a minor friendly fire incident during a hot war 50+ years ago but don't give a shit about Iran having bounties against US soldiers right now? permalink parent award report block reply staroframphansbhole 1 points 5 hours ago Why do you write off 30+ Americans being killed by a supposed ally as a \"minor friendly fire incident\"? permalink parent award report block reply view 1 more comments... ZohanDvir -2 points 23 hours ago Yes, I remember Iran killing Americans a few years ago, also funded terror who bombed American ships, and destroyed embassies. They also kidnapped Americans and left them in hostage status for years. Remember that? USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. permalink parent award report block reply staroframphansbhole 0 points 5 hours ago USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. Ah tell me my faggot Christ-killer, why would Pissfake pay reparations for something that was debunked? permalink parent award report block reply view 1 more comments... DT170x 1 points 23 hours ago Certain topics the shills will decend. Given it a Iran vs Israel topic. The shills are in force. 61 comments in 20 minutes. I wish we get this type of activity on all threads, but no it only certain \"Topics\". permalink parent award report block reply ZohanDvir 0 points 23 hours ago That is very true. I see those words in a title and I know the quality of the comments will be down. permalink parent award report block reply\nTheTelltaleFly 22 points 24 hours ago Hey guys I found Lindsey Graham. permalink parent award report block reply Here_we_go 9 points 23 hours ago Thats Miss Lyndsay bub. permalink parent award report block reply\nHere_we_go 9 points 23 hours ago Thats Miss Lyndsay bub. permalink parent award report block reply\nGA_Logic 18 points 23 hours ago Iran is a waste of time. Meanwhile UK has been Islamified and they have nukes 100% for sure. permalink parent award report block reply Dangerous 3 points 23 hours ago Yeah but ultimately no matter the level of islamification in the UK they are run by jews and Iran isn't So we have to go to war with Iran. permalink parent award report block reply RedStoneDeepState -6 points 23 hours ago An ounce of prevention is worth a pound of cure. permalink parent award report block reply\nDangerous 3 points 23 hours ago Yeah but ultimately no matter the level of islamification in the UK they are run by jews and Iran isn't So we have to go to war with Iran. permalink parent award report block reply\nRedStoneDeepState -6 points 23 hours ago An ounce of prevention is worth a pound of cure. permalink parent award report block reply\nZohanDvir -8 points 23 hours ago Lots of Iranian and Qatari bots here, getting upset over Iran. Who has attacked America, stolen American secrets, and has killed Americans. This place is cooked. Full of anti-America. permalink parent award report block reply flashersenpai 8 points 23 hours ago omg qatar Trump loves Qatar and works with them on military and diplomatic issues. Do you want to call him a bot too? permalink parent award report block reply ZohanDvir -3 points 23 hours ago He is working diplomatically, but does not mean he likes them. Especially when Qatar funds a lot of anti-America activities and bots. permalink parent award report block reply flashersenpai 2 points 20 hours ago Has Qatar filed FARA disclosures that they are spending hundreds of millions to target Christian Churches with influence operations? A certain country has. permalink parent award report block reply view 1 more comments... RejectoftheRepublic 4 points 23 hours ago There are also a lot of Israel shills here. You know who else has attacked America, stolen American secrets, and killed Americans? Our \"Greatest Ally\"\nBeing against foreign wars is not anti- American. Being for them is. Especially when they are behalf of another country who has done similar things permalink parent award report block reply RedStoneDeepState 1 points 14 hours ago Screeching about Israel is retarded permalink parent award report block reply ZohanDvir -4 points 23 hours ago When did Israel do that? USS Liberty? Yes, we know, and it has been debunked multiple times, Israel apologized and paid reparations multiple times permalink parent award report block reply flashersenpai 2 points 20 hours ago Israelis stole US nuclear assets. permalink parent award report block reply view 1 more comments... staroframphansbhole 2 points 23 hours ago Oh yeah I remember when Iran sank the USS Liberty, sad day permalink parent award report block reply RedStoneDeepState 0 points 14 hours ago Why do you care about a minor friendly fire incident during a hot war 50+ years ago but don't give a shit about Iran having bounties against US soldiers right now? permalink parent award report block reply staroframphansbhole 1 points 5 hours ago Why do you write off 30+ Americans being killed by a supposed ally as a \"minor friendly fire incident\"? permalink parent award report block reply view 1 more comments... ZohanDvir -2 points 23 hours ago Yes, I remember Iran killing Americans a few years ago, also funded terror who bombed American ships, and destroyed embassies. They also kidnapped Americans and left them in hostage status for years. Remember that? USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. permalink parent award report block reply staroframphansbhole 0 points 5 hours ago USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. Ah tell me my faggot Christ-killer, why would Pissfake pay reparations for something that was debunked? permalink parent award report block reply view 1 more comments... DT170x 1 points 23 hours ago Certain topics the shills will decend. Given it a Iran vs Israel topic. The shills are in force. 61 comments in 20 minutes. I wish we get this type of activity on all threads, but no it only certain \"Topics\". permalink parent award report block reply ZohanDvir 0 points 23 hours ago That is very true. I see those words in a title and I know the quality of the comments will be down. permalink parent award report block reply\nflashersenpai 8 points 23 hours ago omg qatar Trump loves Qatar and works with them on military and diplomatic issues. Do you want to call him a bot too? permalink parent award report block reply ZohanDvir -3 points 23 hours ago He is working diplomatically, but does not mean he likes them. Especially when Qatar funds a lot of anti-America activities and bots. permalink parent award report block reply flashersenpai 2 points 20 hours ago Has Qatar filed FARA disclosures that they are spending hundreds of millions to target Christian Churches with influence operations? A certain country has. permalink parent award report block reply view 1 more comments...\nZohanDvir -3 points 23 hours ago He is working diplomatically, but does not mean he likes them. Especially when Qatar funds a lot of anti-America activities and bots. permalink parent award report block reply flashersenpai 2 points 20 hours ago Has Qatar filed FARA disclosures that they are spending hundreds of millions to target Christian Churches with influence operations? A certain country has. permalink parent award report block reply view 1 more comments...\nflashersenpai 2 points 20 hours ago Has Qatar filed FARA disclosures that they are spending hundreds of millions to target Christian Churches with influence operations? A certain country has. permalink parent award report block reply view 1 more comments...\nRejectoftheRepublic 4 points 23 hours ago There are also a lot of Israel shills here. You know who else has attacked America, stolen American secrets, and killed Americans? Our \"Greatest Ally\"\nBeing against foreign wars is not anti- American. Being for them is. Especially when they are behalf of another country who has done similar things permalink parent award report block reply RedStoneDeepState 1 points 14 hours ago Screeching about Israel is retarded permalink parent award report block reply ZohanDvir -4 points 23 hours ago When did Israel do that? USS Liberty? Yes, we know, and it has been debunked multiple times, Israel apologized and paid reparations multiple times permalink parent award report block reply flashersenpai 2 points 20 hours ago Israelis stole US nuclear assets. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 1 points 14 hours ago Screeching about Israel is retarded permalink parent award report block reply\nZohanDvir -4 points 23 hours ago When did Israel do that? USS Liberty? Yes, we know, and it has been debunked multiple times, Israel apologized and paid reparations multiple times permalink parent award report block reply flashersenpai 2 points 20 hours ago Israelis stole US nuclear assets. permalink parent award report block reply view 1 more comments...\nflashersenpai 2 points 20 hours ago Israelis stole US nuclear assets. permalink parent award report block reply view 1 more comments...\nstaroframphansbhole 2 points 23 hours ago Oh yeah I remember when Iran sank the USS Liberty, sad day permalink parent award report block reply RedStoneDeepState 0 points 14 hours ago Why do you care about a minor friendly fire incident during a hot war 50+ years ago but don't give a shit about Iran having bounties against US soldiers right now? permalink parent award report block reply staroframphansbhole 1 points 5 hours ago Why do you write off 30+ Americans being killed by a supposed ally as a \"minor friendly fire incident\"? permalink parent award report block reply view 1 more comments... ZohanDvir -2 points 23 hours ago Yes, I remember Iran killing Americans a few years ago, also funded terror who bombed American ships, and destroyed embassies. They also kidnapped Americans and left them in hostage status for years. Remember that? USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. permalink parent award report block reply staroframphansbhole 0 points 5 hours ago USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. Ah tell me my faggot Christ-killer, why would Pissfake pay reparations for something that was debunked? permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 0 points 14 hours ago Why do you care about a minor friendly fire incident during a hot war 50+ years ago but don't give a shit about Iran having bounties against US soldiers right now? permalink parent award report block reply staroframphansbhole 1 points 5 hours ago Why do you write off 30+ Americans being killed by a supposed ally as a \"minor friendly fire incident\"? permalink parent award report block reply view 1 more comments...\nstaroframphansbhole 1 points 5 hours ago Why do you write off 30+ Americans being killed by a supposed ally as a \"minor friendly fire incident\"? permalink parent award report block reply view 1 more comments...\nZohanDvir -2 points 23 hours ago Yes, I remember Iran killing Americans a few years ago, also funded terror who bombed American ships, and destroyed embassies. They also kidnapped Americans and left them in hostage status for years. Remember that? USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. permalink parent award report block reply staroframphansbhole 0 points 5 hours ago USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. Ah tell me my faggot Christ-killer, why would Pissfake pay reparations for something that was debunked? permalink parent award report block reply view 1 more comments...\nstaroframphansbhole 0 points 5 hours ago USS Liberty has been debunked, only iranian or qatari bots are obsessed with a closed matter. Especially when Israel paid reparation multiple times for it. Ah tell me my faggot Christ-killer, why would Pissfake pay reparations for something that was debunked? permalink parent award report block reply view 1 more comments...\nDT170x 1 points 23 hours ago Certain topics the shills will decend. Given it a Iran vs Israel topic. The shills are in force. 61 comments in 20 minutes. I wish we get this type of activity on all threads, but no it only certain \"Topics\". permalink parent award report block reply ZohanDvir 0 points 23 hours ago That is very true. I see those words in a title and I know the quality of the comments will be down. permalink parent award report block reply\nZohanDvir 0 points 23 hours ago That is very true. I see those words in a title and I know the quality of the comments will be down. permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:49:36.462900Z"
}