{
  "id": "1ARK9mHF0a",
  "url": "https://patriots.win/p/1ARK9mHF0a/you-pay-300-for-a-phd-in-india-s/c",
  "content": "304 You pay $300 for a PhD in India so you can get H1B visa as great talent US needs posted 13 hours ago by FuckAllDemocrats 14 comments award share report block PrashantAdvait Foundation @Prashant_Advait • 2d PhD theses are sold for as little as ₹30,000 in Delhi’s markets. Yes, you read that right. From law to geography to social sciences, you can purchase a 𝗿𝗲𝗮𝗱𝘆-𝗺𝗮𝗱𝗲 𝗱𝗼𝗰𝘁𝗼𝗿𝗮𝘁𝗲 in almost any subject. And this isn’t new. Investigations by India Today, The\n14 comments Sort by Top Top New Worst Old Save InterloperKO 11 points 10 hours ago Is this the talent they have that we don't? permalink award report block reply bidensmissingbrain 8 points 10 hours ago If the ability to lie, cheat and steal without conscience is a “talent”, then yes. permalink parent award report block reply Trooph-Hurts 9 points 12 hours ago The claim is that they are so brilliant but even the ones who get degrees in USA, the degree of cheating is off the charts…… everyone needs to understand the the CHEAT INDUSTRY is a well oiled machine… all your home work, all your papers, everything you need to pass college is supported by cheat factories of slave labor in India! permalink award report block reply Calumet57 7 points 12 hours ago How many human resources departments are run by men? permalink award report block reply DeepStateParasite 4 points 10 hours ago The people getting the fake phds may not be smart, but they're smarter than the people making immigration policy in our government. permalink award report block reply rebuildingMyself 3 points 9 hours ago And eventually it'll be the same picture permalink parent award report block reply KarlHungus53 3 points 9 hours ago I've been trying to hire a construction estimator for years, and all of the applications I get have Master's degrees from India. No thanks.  I'd rather have the position vacant. permalink award report block reply SuperDuperBasedMD 2 points 12 hours ago The long term \"necessity\" of H1B's is a lie. An American can be trained for every one of these roles in a short time period. They steal an American's job every single time and depress wages for that role for every other American.\nSuperDuperBasedMD 1 points\n13 seconds ago\nKeep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply booblitchutz 1 points 6 hours ago An American trained to do a job is not required to stay at their job 6 years or risk being thrown out of the country. permalink parent award report block reply Deplora 0 points 10 hours ago The long term \"necessity\" of H1B's is a lie. An American can be trained for every one of these roles in a short time period. They steal an American's job every single time and depress wages for that role for every other American. Depends how you define \"long term\".  I think you're underestimating the damage that has been done to the attitudes and resilience of young and middle-aged American adults by the decades-long combination of pseudo-leftist indoctrination in schools and colleges, and build-up of a huge body of statutory and case law re \"discrimination\". Why pseudo -leftist?  Because real leftism aims to eliminate the masses' belief in personal achievement and resulting rewards as a worthy goal, and replace it with the belief that the only worthy goal for an individual is to contribute as much as they can to the \"greater good\".  Pseudo-leftism simply seeks to weaken and destabilize a society and economy built on pursuit of personal achievement and resulting rewards, by replacing it with a mentality of \"I'm a very special snowflake with infinite value, and I need very special care, and I have a right to be angry and violent if I don't get it\". Those orchestrating the rise of pseudo-leftism understand that they can arrange to personally profit quite handsomely from that destabilization. Few of them actually harbor any longer-term goals of replacing pseudo-leftism with real leftism for the \"greater good\" (though they encourage belief in such goals among their useful idiots). There is now a deeply rooted mentality that everyone has a right to a job that is easy and enjoyable for them, and to unlimited \"accommodations\" for all their real and imagined \"special needs\" and \"identities\", and to plenty of food, shelter, transportation, and medical care regardless of the relationship between how much they contribute to the economy and how much all those plenties cost.  This mentality cannot be dismantled and replaced \"in a short time period\", due to the realities of human nature, and to the lack of a critical mass of people to implement the dismantling process, who are not themselves suffering from this mentality to a significant degree. permalink parent award report block reply SuperDuperBasedMD 2 points 12 hours ago Keep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply cosmos411 1 points 6 hours ago It's a shithole of a country. My brother worked Quality Control for a company. They would measure tolerances of car parts. He had to bring some samples with him to show the difference between pass and fails. The customs in India was not happy with those car part samples. They told him to leave the room and wait outside, but not before motioning to a trash bin and commenting about money. He put whatever money he had in the bin and left the room. 20 minutes later he was given the green light and shown back into the room to get his samples. The trash bin was empty. Shocking .. just shocking from such a pure and noble culture. permalink award report block reply RusherOfDin 1 points 2 hours ago I've been hearing about this since the early 2000s. Managers were bitching about how their Indian employees would go back to India for 3 months and come back with two new degrees and demand raises. And they would get those raises. Meanwhile one of my co-workers busted his ass just to get a masters and they didn't give him any raise or promotion after achieving this at an American University part-time. Ended up quitting and going somewhere else but God knows if he ended up better off than these h-1bs that were just showing up with their diploma mill fakery. permalink award report block reply booblitchutz 1 points 6 hours ago H1Bs are visa slaves. They are not paid significantly lower wages. They cannot be by federal law, in fact. There's no law that dictates YOU cannot be paid below a certain level, mind you. A company can hire an American at any wage they want, but H1Bs have minimums that are actually pretty generous. The benefit of the H1B is they are stuck in the job to hold onto their visa. If they lose that job, they have to go home. If they try to hop to another job, they may not get their new visa approved in time and will have to go home. So the benefit to the company is they are stuck there for 6 years. That's a plus for them. It's not Indian mindset to stay in a job for 6 years, though. In India, turnover for tech jobs (particularly) is so high, it's considered almost unheard of to stay in a job 3 years. If you do, you're a sucker. permalink award report block reply\nInterloperKO 11 points 10 hours ago Is this the talent they have that we don't? permalink award report block reply bidensmissingbrain 8 points 10 hours ago If the ability to lie, cheat and steal without conscience is a “talent”, then yes. permalink parent award report block reply\nbidensmissingbrain 8 points 10 hours ago If the ability to lie, cheat and steal without conscience is a “talent”, then yes. permalink parent award report block reply\nTrooph-Hurts 9 points 12 hours ago The claim is that they are so brilliant but even the ones who get degrees in USA, the degree of cheating is off the charts…… everyone needs to understand the the CHEAT INDUSTRY is a well oiled machine… all your home work, all your papers, everything you need to pass college is supported by cheat factories of slave labor in India! permalink award report block reply\nCalumet57 7 points 12 hours ago How many human resources departments are run by men? permalink award report block reply\nDeepStateParasite 4 points 10 hours ago The people getting the fake phds may not be smart, but they're smarter than the people making immigration policy in our government. permalink award report block reply rebuildingMyself 3 points 9 hours ago And eventually it'll be the same picture permalink parent award report block reply\nrebuildingMyself 3 points 9 hours ago And eventually it'll be the same picture permalink parent award report block reply\nKarlHungus53 3 points 9 hours ago I've been trying to hire a construction estimator for years, and all of the applications I get have Master's degrees from India. No thanks.  I'd rather have the position vacant. permalink award report block reply\nSuperDuperBasedMD 2 points 12 hours ago The long term \"necessity\" of H1B's is a lie. An American can be trained for every one of these roles in a short time period. They steal an American's job every single time and depress wages for that role for every other American.\nSuperDuperBasedMD 1 points\n13 seconds ago\nKeep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply booblitchutz 1 points 6 hours ago An American trained to do a job is not required to stay at their job 6 years or risk being thrown out of the country. permalink parent award report block reply Deplora 0 points 10 hours ago The long term \"necessity\" of H1B's is a lie. An American can be trained for every one of these roles in a short time period. They steal an American's job every single time and depress wages for that role for every other American. Depends how you define \"long term\".  I think you're underestimating the damage that has been done to the attitudes and resilience of young and middle-aged American adults by the decades-long combination of pseudo-leftist indoctrination in schools and colleges, and build-up of a huge body of statutory and case law re \"discrimination\". Why pseudo -leftist?  Because real leftism aims to eliminate the masses' belief in personal achievement and resulting rewards as a worthy goal, and replace it with the belief that the only worthy goal for an individual is to contribute as much as they can to the \"greater good\".  Pseudo-leftism simply seeks to weaken and destabilize a society and economy built on pursuit of personal achievement and resulting rewards, by replacing it with a mentality of \"I'm a very special snowflake with infinite value, and I need very special care, and I have a right to be angry and violent if I don't get it\". Those orchestrating the rise of pseudo-leftism understand that they can arrange to personally profit quite handsomely from that destabilization. Few of them actually harbor any longer-term goals of replacing pseudo-leftism with real leftism for the \"greater good\" (though they encourage belief in such goals among their useful idiots). There is now a deeply rooted mentality that everyone has a right to a job that is easy and enjoyable for them, and to unlimited \"accommodations\" for all their real and imagined \"special needs\" and \"identities\", and to plenty of food, shelter, transportation, and medical care regardless of the relationship between how much they contribute to the economy and how much all those plenties cost.  This mentality cannot be dismantled and replaced \"in a short time period\", due to the realities of human nature, and to the lack of a critical mass of people to implement the dismantling process, who are not themselves suffering from this mentality to a significant degree. permalink parent award report block reply\nbooblitchutz 1 points 6 hours ago An American trained to do a job is not required to stay at their job 6 years or risk being thrown out of the country. permalink parent award report block reply\nDeplora 0 points 10 hours ago The long term \"necessity\" of H1B's is a lie. An American can be trained for every one of these roles in a short time period. They steal an American's job every single time and depress wages for that role for every other American. Depends how you define \"long term\".  I think you're underestimating the damage that has been done to the attitudes and resilience of young and middle-aged American adults by the decades-long combination of pseudo-leftist indoctrination in schools and colleges, and build-up of a huge body of statutory and case law re \"discrimination\". Why pseudo -leftist?  Because real leftism aims to eliminate the masses' belief in personal achievement and resulting rewards as a worthy goal, and replace it with the belief that the only worthy goal for an individual is to contribute as much as they can to the \"greater good\".  Pseudo-leftism simply seeks to weaken and destabilize a society and economy built on pursuit of personal achievement and resulting rewards, by replacing it with a mentality of \"I'm a very special snowflake with infinite value, and I need very special care, and I have a right to be angry and violent if I don't get it\". Those orchestrating the rise of pseudo-leftism understand that they can arrange to personally profit quite handsomely from that destabilization. Few of them actually harbor any longer-term goals of replacing pseudo-leftism with real leftism for the \"greater good\" (though they encourage belief in such goals among their useful idiots). There is now a deeply rooted mentality that everyone has a right to a job that is easy and enjoyable for them, and to unlimited \"accommodations\" for all their real and imagined \"special needs\" and \"identities\", and to plenty of food, shelter, transportation, and medical care regardless of the relationship between how much they contribute to the economy and how much all those plenties cost.  This mentality cannot be dismantled and replaced \"in a short time period\", due to the realities of human nature, and to the lack of a critical mass of people to implement the dismantling process, who are not themselves suffering from this mentality to a significant degree. permalink parent award report block reply\nSuperDuperBasedMD 2 points 12 hours ago Keep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply\ncosmos411 1 points 6 hours ago It's a shithole of a country. My brother worked Quality Control for a company. They would measure tolerances of car parts. He had to bring some samples with him to show the difference between pass and fails. The customs in India was not happy with those car part samples. They told him to leave the room and wait outside, but not before motioning to a trash bin and commenting about money. He put whatever money he had in the bin and left the room. 20 minutes later he was given the green light and shown back into the room to get his samples. The trash bin was empty. Shocking .. just shocking from such a pure and noble culture. permalink award report block reply\nRusherOfDin 1 points 2 hours ago I've been hearing about this since the early 2000s. Managers were bitching about how their Indian employees would go back to India for 3 months and come back with two new degrees and demand raises. And they would get those raises. Meanwhile one of my co-workers busted his ass just to get a masters and they didn't give him any raise or promotion after achieving this at an American University part-time. Ended up quitting and going somewhere else but God knows if he ended up better off than these h-1bs that were just showing up with their diploma mill fakery. permalink award report block reply\nbooblitchutz 1 points 6 hours ago H1Bs are visa slaves. They are not paid significantly lower wages. They cannot be by federal law, in fact. There's no law that dictates YOU cannot be paid below a certain level, mind you. A company can hire an American at any wage they want, but H1Bs have minimums that are actually pretty generous. The benefit of the H1B is they are stuck in the job to hold onto their visa. If they lose that job, they have to go home. If they try to hop to another job, they may not get their new visa approved in time and will have to go home. So the benefit to the company is they are stuck there for 6 years. That's a plus for them. It's not Indian mindset to stay in a job for 6 years, though. In India, turnover for tech jobs (particularly) is so high, it's considered almost unheard of to stay in a job 3 years. If you do, you're a sucker. permalink award report block reply",
  "fetched_at": "2025-11-12T23:13:34.167423Z"
}