{
  "id": "1ARK5A91f6",
  "url": "https://patriots.win/p/1ARK5A91f6/its-not-running-out-of-money--th/c",
  "content": "274 It's not running out of money - They stole it. posted 3 days ago by Crucible 8 comments award share download report block\n8 comments Sort by Top Top New Worst Old Save Lamal 2 points 3 days ago You START by finding the fraud. It's a lot! Next i would include on everyone's SS check exactly how much they paid in and how much they have received. You'd be shocked -- there are plenty of people who only worked a few years in this country and then went on SS. They'll tell you \"I worked so hard back in the old country... I deserve this\" But I would say start giving young people the option of personal accounts. The whole SS system is really a fraud against the American people and promises much more than it takes in. Deficits -> Money printing-> Inflation -> Housing is unaffordable -> Compete against people who live 15 to a house because it's normal where they come from. permalink award report block reply Nibba2 2 points 3 days ago Doesnt help that the government has plundered the fund how many times to fund other pet projects. permalink award report block reply 2FBIAgents1Cup 1 points 3 days ago Heres your flu shot..... permalink award report block reply Shitsbrokeyo 1 points 3 days ago make it a crime for congress to take from it. permalink award report block reply Standingoak 1 points 3 days ago Make Congress use it for their retirement. permalink parent award report block reply amopheldupsidedown 0 points 3 days ago Everyone ineligible, which now should include people under 70. Also, let people opt out of the ponzi scheme. permalink award report block reply corntortilla 1 points 3 days ago Fuck off! I was forced to pay into that shit for 49 years. Next year I’m coming to collect my fucking money bitch. permalink parent award report block reply amopheldupsidedown 1 points 3 days ago Should have voted harder. That's my money you're taking, also your kids' money. Actually, though I am for eliminating it, the original idea here was just raising the retirement age so you don't run out of money when the system runs out of money when you turn 82. permalink parent award report block reply\nLamal 2 points 3 days ago You START by finding the fraud. It's a lot! Next i would include on everyone's SS check exactly how much they paid in and how much they have received. You'd be shocked -- there are plenty of people who only worked a few years in this country and then went on SS. They'll tell you \"I worked so hard back in the old country... I deserve this\" But I would say start giving young people the option of personal accounts. The whole SS system is really a fraud against the American people and promises much more than it takes in. Deficits -> Money printing-> Inflation -> Housing is unaffordable -> Compete against people who live 15 to a house because it's normal where they come from. permalink award report block reply\nNibba2 2 points 3 days ago Doesnt help that the government has plundered the fund how many times to fund other pet projects. permalink award report block reply\n2FBIAgents1Cup 1 points 3 days ago Heres your flu shot..... permalink award report block reply\nShitsbrokeyo 1 points 3 days ago make it a crime for congress to take from it. permalink award report block reply Standingoak 1 points 3 days ago Make Congress use it for their retirement. permalink parent award report block reply\nStandingoak 1 points 3 days ago Make Congress use it for their retirement. permalink parent award report block reply\namopheldupsidedown 0 points 3 days ago Everyone ineligible, which now should include people under 70. Also, let people opt out of the ponzi scheme. permalink award report block reply corntortilla 1 points 3 days ago Fuck off! I was forced to pay into that shit for 49 years. Next year I’m coming to collect my fucking money bitch. permalink parent award report block reply amopheldupsidedown 1 points 3 days ago Should have voted harder. That's my money you're taking, also your kids' money. Actually, though I am for eliminating it, the original idea here was just raising the retirement age so you don't run out of money when the system runs out of money when you turn 82. permalink parent award report block reply\ncorntortilla 1 points 3 days ago Fuck off! I was forced to pay into that shit for 49 years. Next year I’m coming to collect my fucking money bitch. permalink parent award report block reply amopheldupsidedown 1 points 3 days ago Should have voted harder. That's my money you're taking, also your kids' money. Actually, though I am for eliminating it, the original idea here was just raising the retirement age so you don't run out of money when the system runs out of money when you turn 82. permalink parent award report block reply\namopheldupsidedown 1 points 3 days ago Should have voted harder. That's my money you're taking, also your kids' money. Actually, though I am for eliminating it, the original idea here was just raising the retirement age so you don't run out of money when the system runs out of money when you turn 82. permalink parent award report block reply"
}