{
  "id": "1ARK9l9OJs",
  "url": "https://patriots.win/p/1ARK9l9OJs/-elon-musk-just-summed-up-modern/c",
  "content": "685 🔥 Elon Musk just summed up modern slavery in one sentence: “You work. You get taxed. You buy something. You get taxed. You own something. You get taxed again.”It’s the loop of quiet control a system designed to keep you compliant while the government spends your money on causes you never consente t posted 22 hours ago by MEME-SUPREME 14 comments award share report block Jim Ferguson @JimFergusonUK • 2d 🔥 Elon Musk just summed up modern slavery in one sentence: “You work. You get taxed. You buy something. You get taxed. You own something. You get taxed again.” It’s the loop of quiet control — a system designed to keep you compliant while the government spends your money on\n14 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Formerlurker92 11 points 21 hours ago And unless the Republicans offer a solution that is better than the ease and envy of communism, people will choose it as an escape from the cycle permalink award report block reply Pickles76 4 points 18 hours ago Reps won’t do a damn thing!  They are in on it!  Once you realize there is a uniparty (Dems and Reps) and the rest is MAGA (very small percentage of gov)you will realize that they will end nothing that has comfortably lined their pockets for decades! You cannot expect a single politician to do a damn thing for you or your country.  It took two very wealthy business men to shed a light on the abyss that is the uniparty swamp. DC is infested, don’t rely on the vermin to exterminate themselves, and they certainly won’t cut off their lifeline which is your blood, sweat and tears. permalink parent award report block reply Trooph-Hurts 9 points 22 hours ago He forgot the worst one….. you die and they take the rest permalink award report block reply abstr4ct 10 points 21 hours ago the argument for estate tax is that a few families including rothchilds would have ended up owning everything in a short time. ok, fine. So the make the cut off a billion dollars. Once you have a billion dollars estate tax kicks in to rein in monopolistic dynasty's. permalink parent award report block reply Electricutie 7 points 21 hours ago Politicians have discovered the loophole.  Import endless hoards of people who will vote for them and keep them in power, while extracting more and more from the people they're supposed to be representing and protecting.  Demonize all who oppose them as racists and fascists while consolidating more and more power and resources.  It's unsustainable, but they don't care about the long-term, they're old and just need to push off the inevitable until after they've lived out their lives in decadence and splendor. permalink award report block reply TrumpAndGodWin 2 points 20 hours ago They don't plan on dying. Transhumanist satanists want to live forever to escape justice. permalink parent award report block reply Counterwhat 7 points 21 hours ago He's right. I am so done and tired of this shit. We spilled tea for less. permalink award report block reply BetterNameUnfound 5 points 20 hours ago Taxes prevent you from saving Inflation ensures that whatever you do save disappears They don't want you leaving the game permalink award report block reply Filo76 4 points 21 hours ago Causes like importing millions of H1B pajeets who eventually take your job? permalink award report block reply Tacitus1963 3 points 14 hours ago I wish Elon would get back to threatening the RINOs who are phucking around with Trump's agenda, that they will be primaried as he has a massive war chest. permalink award report block reply FearGodTheAlmighty 3 points 16 hours ago Plus all the licensing costs, registrations, fees, charges, etc. permalink award report block reply deepbake 1 points 21 hours ago taxman https://youtu.be/sAvpc4S_Q5s permalink award report block reply BlockWorks 1 points 19 hours ago https://www.adamsmith.org/blog/miscellaneous/the-tax-poem permalink award report block reply Deporter 1 points 13 hours ago Republican voters are bums. I see it every year all around me. I have to shame them and virtually force them to vote. It's tiring. permalink award report block reply\nFormerlurker92 11 points 21 hours ago And unless the Republicans offer a solution that is better than the ease and envy of communism, people will choose it as an escape from the cycle permalink award report block reply Pickles76 4 points 18 hours ago Reps won’t do a damn thing!  They are in on it!  Once you realize there is a uniparty (Dems and Reps) and the rest is MAGA (very small percentage of gov)you will realize that they will end nothing that has comfortably lined their pockets for decades! You cannot expect a single politician to do a damn thing for you or your country.  It took two very wealthy business men to shed a light on the abyss that is the uniparty swamp. DC is infested, don’t rely on the vermin to exterminate themselves, and they certainly won’t cut off their lifeline which is your blood, sweat and tears. permalink parent award report block reply\nPickles76 4 points 18 hours ago Reps won’t do a damn thing!  They are in on it!  Once you realize there is a uniparty (Dems and Reps) and the rest is MAGA (very small percentage of gov)you will realize that they will end nothing that has comfortably lined their pockets for decades! You cannot expect a single politician to do a damn thing for you or your country.  It took two very wealthy business men to shed a light on the abyss that is the uniparty swamp. DC is infested, don’t rely on the vermin to exterminate themselves, and they certainly won’t cut off their lifeline which is your blood, sweat and tears. permalink parent award report block reply\nTrooph-Hurts 9 points 22 hours ago He forgot the worst one….. you die and they take the rest permalink award report block reply abstr4ct 10 points 21 hours ago the argument for estate tax is that a few families including rothchilds would have ended up owning everything in a short time. ok, fine. So the make the cut off a billion dollars. Once you have a billion dollars estate tax kicks in to rein in monopolistic dynasty's. permalink parent award report block reply\nabstr4ct 10 points 21 hours ago the argument for estate tax is that a few families including rothchilds would have ended up owning everything in a short time. ok, fine. So the make the cut off a billion dollars. Once you have a billion dollars estate tax kicks in to rein in monopolistic dynasty's. permalink parent award report block reply\nElectricutie 7 points 21 hours ago Politicians have discovered the loophole.  Import endless hoards of people who will vote for them and keep them in power, while extracting more and more from the people they're supposed to be representing and protecting.  Demonize all who oppose them as racists and fascists while consolidating more and more power and resources.  It's unsustainable, but they don't care about the long-term, they're old and just need to push off the inevitable until after they've lived out their lives in decadence and splendor. permalink award report block reply TrumpAndGodWin 2 points 20 hours ago They don't plan on dying. Transhumanist satanists want to live forever to escape justice. permalink parent award report block reply\nTrumpAndGodWin 2 points 20 hours ago They don't plan on dying. Transhumanist satanists want to live forever to escape justice. permalink parent award report block reply\nCounterwhat 7 points 21 hours ago He's right. I am so done and tired of this shit. We spilled tea for less. permalink award report block reply\nBetterNameUnfound 5 points 20 hours ago Taxes prevent you from saving Inflation ensures that whatever you do save disappears They don't want you leaving the game permalink award report block reply\nFilo76 4 points 21 hours ago Causes like importing millions of H1B pajeets who eventually take your job? permalink award report block reply\nTacitus1963 3 points 14 hours ago I wish Elon would get back to threatening the RINOs who are phucking around with Trump's agenda, that they will be primaried as he has a massive war chest. permalink award report block reply\nFearGodTheAlmighty 3 points 16 hours ago Plus all the licensing costs, registrations, fees, charges, etc. permalink award report block reply\ndeepbake 1 points 21 hours ago taxman https://youtu.be/sAvpc4S_Q5s permalink award report block reply\nBlockWorks 1 points 19 hours ago https://www.adamsmith.org/blog/miscellaneous/the-tax-poem permalink award report block reply\nDeporter 1 points 13 hours ago Republican voters are bums. I see it every year all around me. I have to shame them and virtually force them to vote. It's tiring. permalink award report block reply",
  "fetched_at": "2025-11-12T22:53:47.334696Z"
}