{
  "id": "8174097",
  "title": "1080Muslim Leaders explain how America can become an Islamic State. “That what we as Muslims want to",
  "url": "https://patriots.win/p/1ARK55a4TH/muslim-leaders-explain-how-ameri/c",
  "content": "1080 Muslim Leaders explain how America can become an Islamic State. “That what we as Muslims want to implement here in the United States, we believe the Constitution should be replaced by the Quran” posted 5 days ago by Capoditutticapi1 169 comments award share report block Wall Street Apes @WallStreetApes • 5d Muslim Leaders explain how America can become an Islamic State “That what we as Muslims want to implement here in the United States, we believe the Constitution should be replaced by the Quran” “When it comes to spreading Islam on a state level, on a societal level, that method\n169 comments Sort by Top Top New Worst Old Save Capoditutticapi1 OP 111 points 5 days ago \"BY BALLOT OR BULLET.\"  Deport every single one of them NOW! permalink award report block reply Magma_Biscuit 44 points 5 days ago It ain’t gonna happen by the ballot permalink parent award report block reply Govtizbad 21 points 5 days ago Unfortunately true permalink parent award report block reply NimblePepeCentipede 16 points 5 days ago ....those terms are acceptable. permalink parent award report block reply Cumberbuns 1 points 5 days ago you mean acceptable? permalink parent award report block reply Taylor3006 1 points 5 days ago Ehh maybe Nimble is infantry. Just roll with it, smile, and pat him on the head. It is safer that way. permalink parent award report block reply view 1 more comments... NimblePepeCentipede 1 points 5 days ago ....yes I did, thank you. permalink parent award report block reply mikethemarine -3 points 5 days ago shut up word NAZI, we got the point permalink parent award report block reply view 4 more comments... Threaper666 8 points 5 days ago They shouldn't be in country at all. permalink parent award report block reply brimshae 3 points 5 days ago Hey, remember how we've been getting told for the last 24 years that we need to fight them over there so we don't have to fight them over here? Yeah... permalink parent award report block reply YaharaRiver 1 points 5 days ago Turns out an atomic bomb was probably necessary to prevent the scattering.  They simply refuse to reassess and rebuild their spawning grounds after just an ordinary strike.  It still comes as a surprise to this day how little they respect their home & families. permalink parent award report block reply BlackPilledMAGA 28 points 5 days ago Can we get some leaders with balls again who kill people for making overtures of war like this? Get rid of the constitution?  We need to get rid of the people calling for that. FUCK the Quran and everyone who lives their life by it. permalink parent award report block reply chargebeck23 4 points 5 days ago Before you lose your shit too much, this is the original, unedited version: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply Capoditutticapi1 OP 2 points 5 days ago I bet you can't find the entire video of the interview..., just the few seconds clip.  Why is that? permalink parent award report block reply chargebeck23 3 points 5 days ago Wrong. Here is the unedited video - the relevant section is just after 4 mins in: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 Now that I've done that maybe you should ask yourself why someone would make an edited video to try and fool you? Why is that? permalink parent award report block reply view 1 more comments... Standingoak 11 points 5 days ago All lied on  their immigration documents.  But at least they now admit it:  \"we believe the Constitution should be replaced by the Quran”. I can't imagine why they lie: https://illinoisfamily.org/islam-sharia/knowing-four-arabic-words-may-save-our-civilization-from-islamic-takeover/ permalink parent award report block reply stingyarthropods 8 points 5 days ago deporting is too generous for these goat fucking terrorists. every single muslim needs to be killed. permalink parent award report block reply TwoArizonaPedes 6 points 5 days ago We're already fighting. Join us! permalink parent award report block reply load 5 more comments... Trooph-Hurts 55 points 5 days ago Laughable but VERY SERIOUS…… there should be no islamists in America….. Islam is unconstitutional! permalink award report block reply Zacktopia33 17 points 5 days ago Correct. And oh, BTW, it's also pure demonism. permalink parent award report block reply SneakyWino 7 points 5 days ago You are right.  They are pedophiles.  So sick! permalink parent award report block reply Govtizbad 4 points 5 days ago They CAN replace the Constitution if they replace YOU permalink parent award report block reply Trooph-Hurts 3 points 5 days ago There are politicians who love this idea permalink parent award report block reply TravisRSCX 1 points 5 days ago With the way they breed and government subsidies they get for being here we are shooting ourselves in foot. permalink parent award report block reply YT45 48 points 5 days ago That’s a declaration of hostile intent. permalink award report block reply Govtizbad 19 points 5 days ago They've already imported 5 million of themselves They have 5 kids each That's 2 generations to take over And since they get their wives pregnant at 9 yo that happens quicker than u think permalink parent award report block reply BrainwashedbyTrump 5 points 5 days ago Need to stop federal funding to cities accepting Islamic \"refugees\". Completely shut them off. permalink parent award report block reply Beardholder 4 points 5 days ago Domestic threats. permalink parent award report block reply chargebeck23 -3 points 5 days ago It's too easy to manipulate you. Be smarter. Real video is here: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply Capoditutticapi1 OP 4 points 5 days ago So you provide a link to another edited video without further context. What did the muslim say after that? Provide a link to the full speech... I tried to locate and couldn't find it... permalink parent award report block reply chargebeck23 2 points 5 days ago It was hard to find but here it is: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply Capoditutticapi1 OP 2 points 5 days ago Great work! Impressive that you found it... I had various AI looking for it with no luck... I doubted its existence and suspicious of why it was difficult to find, as in, the rest of the video drove a dark narrative that overshadowed the Huckabee sentence(s). The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? Thanks again for digging that full video up for context... permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 5 days ago I don't TikTok permalink parent award report block reply chargebeck23 2 points 5 days ago Here it is on Youtube. The relevant section is just after 4 mins https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply Capoditutticapi1 OP 1 points 5 days ago Nothing on TikTok, Google, Brave, YT, Rumble, or anywhere else! Not a single second more than a clip... Why is that? permalink parent award report block reply MedicallyReddit 26 points 5 days ago The Quran (Poopran) is a steaming pile of horse shit permalink award report block reply bumpman 5 points 5 days ago Sharia law would be implemented in America if incels were in charge permalink parent award report block reply Moebius 22 points 5 days ago Charge him under 18 U.S.C. § 2385 - Advocating Overthrow of Government permalink award report block reply Magma_Biscuit 4 points 5 days ago The Hawaiian judge says no standing… permalink parent award report block reply Bramage 5 points 5 days ago add him to the charge. permalink parent award report block reply OnlyTrump20 18 points 5 days ago The US isn't a tiny country like England that's easy to flood with migrants.   They are just being stupid.   When they come as migrants to North America, their children will become apostates.   Their faith will become as diluted as it is with Christians in the US.   They'll get invaded by feminism, abortions, homosexuality and more. permalink award report block reply Seeker_17 7 points 5 days ago Yes, 24% of them apostatize, acc. to Pew studies. And 75% of converts leave within a few years. It seems without migration, their religion would fizzle out over here as not even their overall fertility rate, which is just around replacement level, is high enough to compensate for this. permalink parent award report block reply dawah_destroyer 4 points 5 days ago This is why they want to build their own insular mega communities. The children apostatize, specifically the women. One of the problems with Islam is polygamy, which leads to incels. So the religion is designed to handle this problem in a number of ways. Arranged marriage of minors, allowing men to be sexually promiscuous without sin, encouraging inbreeding, and of course the 72 virgins. This is the only reason men don't apostatize as often as women. permalink parent award report block reply TwoArizonaPedes 4 points 5 days ago Muhammad definitely designed his cult to appeal to barbaric men. permalink parent award report block reply Duckanddodge 18 points 5 days ago Do they want to die? permalink award report block reply fskfsk 24 points 5 days ago No, they want YOU to die.  If some of them die in the process of trying to kill you, that's an immediate reward in heaven. permalink parent award report block reply D__1 8 points 5 days ago That depends on how much pigs blood you have... permalink parent award report block reply DT170x 5 points 5 days ago Joke on them For each Breath that a Muslim inhale. A trace amount of atmospheric bacon enter their lungs permalink parent award report block reply deleted 10 points 5 days ago Seeker_17 9 points 5 days ago Exactly. Indeed, the only way for guaranteed salvation, i.e. going to 'paradise', is by dying in jihad. So doing this shit is a win-win for them. If they achieve what they want here, they win. If they die pursuing it, they win. Islam is a dangerous ideology, not a religion, and it needs to be banned. permalink parent award report block reply MedicallyReddit 7 points 5 days ago Actually, yes. They think they get rewarded by allah in heaven. But only after they complete their mission, which is to first kill the infidels. permalink parent award report block reply BidenShowerDrool 5 points 5 days ago it's a death cult. they believe that that the next life will be the \"best one\". permalink parent award report block reply LeeHarveySirhan 16 points 5 days ago There will be blood. permalink award report block reply Beardholder 5 points 5 days ago Hits fast forward button permalink parent award report block reply wilburh09 1 points 5 days ago There wasn't blood in that movie. permalink parent award report block reply blueeyephoto 15 points 5 days ago if that's the case, they cannot legally hold office here as they swear to uphold and defend the Constitution. permalink award report block reply BidenShowerDrool 13 points 5 days ago Takiyya allows them to say whatever they want and since no-one is pulling them up on their bullshit they will keep on manifesting into Koranic demons spouting their diseased book as the future for America. permalink parent award report block reply BlackPilledMAGA 10 points 5 days ago You know how many scumbags in government have taken that \"oath\" and done nothing but attack the constitution? The problem is the \"oath\" is unenforced. There are no consequences for breaking it. Like, ZERO. Tolerance = Death. The end of America will be because we sat back and tolerated far too much in the name of kindness or goodness or whatever you want to call it when you \"live and let live\" with mental illness and evil ideologies like Islam. permalink parent award report block reply Anon1970 1 points 5 days ago Tolerance is the virtue of a man with no convictions. permalink parent award report block reply blitzstrasse 12 points 5 days ago No fuckin' chance. Everyone dies before I give in on this. permalink award report block reply Dev404 11 points 5 days ago The quran is better served as paper to pick up dog shit. permalink award report block reply airborne3502 9 points 5 days ago When Muslims say what their plans are, believe them. permalink award report block reply Silentbutdeadly 8 points 5 days ago I say fuck your Islamic takeover bullshit.  I will NEVER live under Sharia bullshit law-no matter how confident this goat fuckers feel about their chances. permalink award report block reply FuckU/Spez 8 points 5 days ago They will advance their agenda, because if you were to do anything, you are the islamaphobe, they are just victims of your Whiteness.... But if you are a believer, these are things to come, I never imagined who would be the ones cutting heads off in Revelations 20:4, but they seems to be exposing themselves... permalink award report block reply Markosis17 8 points 5 days ago Time to start deporting Muslims. One by one…. See ya! permalink award report block reply Spiritof2015 8 points 5 days ago Islam is a terrrorist organization. permalink award report block reply Oldman1234 8 points 5 days ago The problem with having the Quran as your constitution is that you need to replace the Supreme Court with an Ayatollah who has the last word on everything.  And, we've seen how well that's worked out. permalink award report block reply wilburh09 2 points 5 days ago And they will rape your wife and kill you.  Isis taught us a lot. permalink parent award report block reply Decepticons-superior 8 points 5 days ago Han Solo: Over my dead body. Greedo: That’s the idea. permalink award report block reply TwoArizonaPedes 8 points 5 days ago And Han shot first. permalink parent award report block reply MyNameIsTaxpayer 8 points 5 days ago All I hear is Kill Whites. permalink award report block reply Sparks1017 7 points 5 days ago Get fucked you goat fucking mooselim permalink award report block reply Christineblaseyford 6 points 5 days ago I believe all the Muslims in the US should be replaced by pigs and dogs.  Because those animals are way better than durkadurka's. permalink award report block reply terribletwos 6 points 5 days ago Every area that they got people dropped into will be taken over by them politically. So for example in my state they took over a whole suburb. They weren't here a few years ago and now it's only them. I saw the first ever muslim in my neighborhood for the first time in my life time and the following week there were dozens of them. Every area they take over is a beachhead to import more to take over another area. They will succeed unless there is massive unprecedented action. permalink award report block reply GuidedDisinfo 6 points 5 days ago Deport. permalink award report block reply TheArchAngel 6 points 5 days ago those people shouldn't have their human rights protected by the constitution. permalink award report block reply redditadminssuckit 6 points 5 days ago Kill it now permalink award report block reply Coprolite 6 points 5 days ago I want to sprinkle pigs blood on a Quran. permalink award report block reply Magma_Biscuit 5 points 5 days ago Just burn it permalink parent award report block reply StoopidAsshole69 2 points 5 days ago Better to pretend to read it while laughing to yourself and eating a ham and swiss melt from arby’s permalink parent award report block reply BigMikesSwingingCock 5 points 5 days ago The poor pig's blood being contaminated by that demonic book of horseshit. permalink parent award report block reply Wizard_Glick 5 points 5 days ago Gonna get bloody... permalink award report block reply MehNahMehNah 5 points 5 days ago The Quran is hostile towards Christianity specifically as it reduces Jesus to a prophet. It's blasphemy and should be rejected outright and burned upon contact. There is no turning ge other cheek on this, it calls for the kind of absolute Old Testament devastating action when these forces manifest themselves. Any overt attempt at Islamic proseltyzing should be met with the kind of violence they wish upon non-believers. permalink award report block reply EdBuck 5 points 5 days ago It's been past ti.e to start 86ing those that say this shit permalink award report block reply DefKon1 5 points 5 days ago Well, I believe in the 2nd Amendment of the U.S. Constitution. Just sayin'....For some reason..🤷🇺🇲 permalink award report block reply PensivePatriot 5 points 5 days ago This is why they were literally illegal in this nation before 1967. Their entire system of belief is predicated upon this, and we will not protect the solidarity of the constitution until we deport them whole cloth. permalink award report block reply Induceddrag 5 points 5 days ago Is there anybody else here with the slightest desire in seeing the handmaid’s tale cosplay set forced to wear burkas?  Even for just a day, just in NYC, before things go kinetic? permalink award report block reply Bubbahax 5 points 5 days ago The long game for muslims is to convince Christians that Jesus wasnt the son of God and was just another prophet.  Then Christians can become good little muslims and submit to Sharia.  I highly suspect this will be the false religion that was shown in the Revelation of John. permalink award report block reply Seeker_17 5 points 5 days ago This is a clear threat to national security. WTF is Trump going to do about this? I want to see mass deportations of muslims, denaturalizations and incarcerations. permalink award report block reply TheDarkEmperor 0 points 5 days ago Comment removed by community moderators. permalink parent award report block reply MrCuriousGuy513 5 points 5 days ago Sure, when they explain where the Injeel is and why can’t Allah prevent anyone from corrupting his own words and book. permalink award report block reply SameUnderstanding 4 points 5 days ago Why are these child rapists allowed to even talk? Get them out permalink award report block reply Don-O-Mite 4 points 5 days ago and I think they should be well vaccinated with lead... permalink award report block reply Naught0 4 points 5 days ago They shouldn’t even be sucking air here. permalink award report block reply MAGAnic316 4 points 5 days ago Thanks to every strong feminist and OF whore refusing to breed for making this happen! Demographics = destiny permalink award report block reply duznmatter 4 points 5 days ago If you see the future even a little bit you can see the Left/\nCommies and the Mudslimes combining forces against the American constitution. If this don't get corrected real soon the only thing left is war. Exactly what the democrats and probably half of the republicans want right now anyway. permalink award report block reply auntjemima 4 points 5 days ago get fucked goatfucker permalink award report block reply Krampus5150 4 points 5 days ago You will die raghead. permalink award report block reply learntocode 4 points 5 days ago Fair enough, we can have that argument - but not when foreigners are being subsidized and supported to materially fight that fight against the native born. permalink award report block reply SALTY-OGRE 4 points 5 days ago REMOVE THESE SCUMBAGS AND RETURN THEM TO THEIR MUD HUTS HELD TOGETHER BY SHIT. FUCK ISLAM, CHRIST IS KING! permalink award report block reply Beardholder 4 points 5 days ago Openly admitting to treason. Hang him or kick him the fuck out. permalink award report block reply chargebeck23 -1 points 5 days ago He didn't actually say that though, it's just an edited video Real vid is here: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply SickOfNeoPolitics 4 points 5 days ago Mudshits make for easy targets in the snow. permalink award report block reply MatterThatMetals 4 points 5 days ago Yeah, fuck that idea Omar. permalink award report block reply Constantin2024 4 points 5 days ago Educate yourself. The Quran is literally the Satanic Bible. https://www.youtube.com/watch?v=ctGN1hnRR3Q https://www.youtube.com/watch?v=wy_iD6Lf6MY permalink award report block reply sleepinggiant 4 points 5 days ago A law was repealed in 1992 that prevented muslims from holding office. This was based on islam not holding seperate state and religous afairs. Put the law back on the books. permalink award report block reply Firespawn 4 points 5 days ago We the people are going to have to kill a lot of camel jockeys, it seems. If they aren't deported, war will be on the menu.\nFuck Islam. permalink award report block reply Aggrieved03 3 points 5 days ago How is it any race or group can talk about taking over the government but 2 crackers in a bar mention it and the FBI is all over them? permalink award report block reply Capoditutticapi1 OP 2 points 5 days ago Exactly! Why is that? Maybe we've already been captured and the DS is playing for the other team... permalink parent award report block reply Aggrieved03 4 points 5 days ago Brennan permalink parent award report block reply Formerlurker92 3 points 5 days ago It hasn't even been a quarter century since they flew planes into us, how are people this permissive permalink award report block reply NonbinaryPotatohead 3 points 5 days ago No shit. Islam is an INVASIVE GOVERNMENT disguised as a religion. It's ENTIRE existence is hinged upon the establishment of a centralized GLOBAL caliphate taking place of every government and enforcing shit sharia law in place of your Rule of Law with checks and balances. It was founded by a pedophile warlord and it's all goofy bullshit centered around sex and slavery. permalink award report block reply ACActual 3 points 5 days ago We need leadership with balls.  Yesterday.  Having the cowardly Politicians we do at this moment in time places all Americans in a precarious situation. Real Leadership would start denaturalizing and Deporting every Muslim that talks like this.  FBI infiltrate their ranks to take out entire Mosques at a time.   Imam talks shits?  Entire mosque, including all relations Deported without remorse immediately. Its either this or our kids will be fighting the GWOT every day on American soil. Fucking politicians.  Fight them there then import them here.  Should all be strung up for allowing this permalink award report block reply Trump2020or4eva 3 points 5 days ago They tell us what theyre doing to our faces..... permalink award report block reply Alldayeveryday 3 points 5 days ago It will come to violence before that ever happens permalink award report block reply SaxonRealm 3 points 4 days ago Time for a constitutional amendment banning Islam. Trump should support this, but he doesn’t have the balls for that. permalink award report block reply NotYourMan 3 points 5 days ago Say your are a traitor to the constitution while saying you are a traitor.  Look up the definition of fascism in a 1940 dictionary.  Its very interesting. permalink award report block reply twopoint71 3 points 4 days ago Sedition used to be a crime. permalink award report block reply WelderX 3 points 5 days ago Say when... permalink award report block reply cherbui 3 points 5 days ago can ? it already is got MN NY CA ALL THOSE DEM STATES ?THEIR  quran call for killing their enemies... by enemies it mean  US .. use their own quran law and we exterminate and remove the theat to our Country is poetic justice by their laws  ..  we just apply their quran laws on them .. no need for rights or US Consitution to be given to thse infidel terrorist .. .. that would be a great arguement for our gov. to remove the threate.. their rights and desired we apply their law on them to remove the islamic theat .. in my opinion why bother bowing to islamic like democrats odo..  deport their ass .. ALL OF them permalink award report block reply DontTreadOnLego 3 points 5 days ago DEPORT the sand naggers They keep nagging us about destroying our country. permalink award report block reply BBvarn 3 points 5 days ago Won't work. Not enough goat fuckers in the US. permalink award report block reply Seeker_17 5 points 5 days ago They will try it by getting elected into leading positions and then implement it from the top. They will fail. They are biting off more than they can chew and will get fucked up in the process. permalink parent award report block reply bobbacringo 3 points 5 days ago All brought in by the express wishes of the chosen ones. permalink award report block reply GhostOfMyFormerSelf 3 points 5 days ago Over my melted AR-15. permalink award report block reply Jimmy33 3 points 5 days ago They are serious. permalink award report block reply tired-of-crap 2 points 4 days ago To do that would take the vote of 38 states. They will NEVER get this support. permalink award report block reply GuerillaYourDreams 2 points 5 days ago I'm reading the Qu'ran now. We Christians must know the enemy. permalink award report block reply YaharaRiver 4 points 5 days ago If you can say that without exasperation, you’re lying. The koran is the most unpleasant, difficult, fucked up “book” you will ever struggle to read.  You will constantly put it down to recover. It makes no sense, jumps around without reason, and cites ridiculous and fatal platitudes.  It is entirely without humor or amusement, no wisdom whatsoever, and insufferably bloated with excessive flattery and pompous conceit. Exactly what one would expect.  1/2 star, would not recommend. permalink parent award report block reply GuerillaYourDreams 2 points 5 days ago I’ve been involved in the study of Christian apologetics for a very long time. I actually haven’t read any of the Quran for over 15 years so I wanted to refresh my memory. permalink parent award report block reply YaharaRiver 3 points 5 days ago I would recommend reading the instruction manuals for Russian spacecraft even if that means you have to learn Russian first. MUCH more enjoyable way to spend your time, and when you’re done you can fix Russian spacecrafts! After you’re done with the koran, you have nothing to show for it except killed off brain cells and a heart as hard as a rock. permalink parent award report block reply KungPaoMcChicken 2 points 5 days ago Faggotry... permalink award report block reply LookFatty 2 points 5 days ago How about,  GO FUCK YOUR OWN FACE  !!! permalink award report block reply McLemore800 2 points 5 days ago Once again, founding fathers were short sighted and fucked up royally by granting “freedom of religion” and no national language permalink award report block reply h203h 2 points 5 days ago HAHAHAHAHAHAHAHA THESE GOAT FUCKERS WOULD DIE IN A MILLION PIECES. THEY STAND NO CHANCE permalink award report block reply Tellman125 2 points 5 days ago Now that  Mamdani won won, Trump WANTS to keep him there to use him as the poster boy and punching bag for what the Democrats have become; this is even someone that MSNBC has unhappily foreseen since BEFORE the final votes were cast: https://patriots.win/p/1ARK0Ud0Cf/dems-were-already-having-buyers-/c permalink award report block reply PatriotSkorzeny 1 points 5 days ago Cops will defend the Moslem. 😒 permalink award report block reply DangerousAmerican76 2 points 5 days ago Challenge accepted permalink parent award report block reply TrumpMagaNoBama 2 points 5 days ago It won't matter. permalink parent award report block reply HenkZeilstra 1 points 5 days ago Made possible by the Jews who want to dump even more muslims here so they can have the ME for themselves permalink award report block reply keeptherepublic1776 1 points 5 days ago Thanks for this comment. 100 percent Israel is responsible for installing the NYC mayor. Look no one is talking Israel anymore. permalink parent award report block reply corntortilla 1 points 5 days ago How about NO? And Gfy. permalink award report block reply bananafone 1 points 5 days ago Too bad no one wants to actually \" crusade\" permalink award report block reply jhewish 1 points 5 days ago To be fair the first one supposedly is out of context. \"We believe the constitution should be replaced by the Quran\" Supposedly the entire context is this: “It wasn’t Muslims that said we believe the Constitution should be replaced by the Quran. It was Huckabee who said the Constitution should be replaced by the Bible\" Regardless, the other clips are fucking terrible and totally accurate to what is going on. permalink award report block reply Righteous 1 points 5 days ago I want whoever is responsible for putting this tier content in my feeds (TDW, X, instagram, et al) executed on the spot. This is a pattern and it is traitorously deliberate. permalink award report block reply ParmesanCartel 1 points 5 days ago Hey, what was that oath people take when joining the military? permalink award report block reply TheDarkEmperor 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply gustodog 0 points 5 days ago How did mass migration of Muslims and other problem demographics into the West become a problem when the public are overwhelmingly against it and against mass migration in general? Coordinating a push like this requires planning and resources. \"I think there is a resurgence of anti-semitism, because at this point in time Europe has not yet learned how to be multicultural. And I think we are going to be part of the throes of that transformation, which must take place. Europe is not going to be the monolithic societies that they once were in the last century. Jews are going to be at the centre of that. It's a huge transformation for Europe to make. They are now going into a multicultural mode and Jews will be resented because of our leading role. But without that leading role and without that transformation, Europe will not survive.\" -Barbara Spectre on Israeli TV permalink award report block reply Tiger5468 0 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Kpak76 -2 points 5 days ago Just to be fair, the first guy was taken out of context here.  You can tell what he is saying is spliced. His full statement can be found here https://www.dallasnews.com/opinion/commentary/2025/07/11/omar-suleiman-an-edited-clip-about-me-has-gone-viral/ permalink award report block reply Capoditutticapi1 OP 2 points 5 days ago Granted..., few seconds taken out of context, but where is the full video for complete context? Transcript? Anything? The article is all about the clip NOT a full explanation of his speech nor video, interview, whatever! I want to see/hear the entire video/speech! What else did he say that gives context one way or another of the entirety of the video/speech? Genuinely curious... I tried to find it but nothing comes up, just the clips... permalink parent award report block reply Kpak76 1 points 5 days ago I'm not doubting the guy is a douchebag that wants Sharia law, but we shouldn't take quotes out of context when we complain the media does the exact same thing to us. permalink parent award report block reply Capoditutticapi1 OP 0 points 5 days ago The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? permalink parent award report block reply Kpak76 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply rapskull 0 points 5 days ago Comment removed by community moderators. permalink award report block reply TheDarkEmperor 0 points 5 days ago Comment removed by community moderators. permalink award report block reply\nCapoditutticapi1 OP 111 points 5 days ago \"BY BALLOT OR BULLET.\"  Deport every single one of them NOW! permalink award report block reply Magma_Biscuit 44 points 5 days ago It ain’t gonna happen by the ballot permalink parent award report block reply Govtizbad 21 points 5 days ago Unfortunately true permalink parent award report block reply NimblePepeCentipede 16 points 5 days ago ....those terms are acceptable. permalink parent award report block reply Cumberbuns 1 points 5 days ago you mean acceptable? permalink parent award report block reply Taylor3006 1 points 5 days ago Ehh maybe Nimble is infantry. Just roll with it, smile, and pat him on the head. It is safer that way. permalink parent award report block reply view 1 more comments... NimblePepeCentipede 1 points 5 days ago ....yes I did, thank you. permalink parent award report block reply mikethemarine -3 points 5 days ago shut up word NAZI, we got the point permalink parent award report block reply view 4 more comments... Threaper666 8 points 5 days ago They shouldn't be in country at all. permalink parent award report block reply brimshae 3 points 5 days ago Hey, remember how we've been getting told for the last 24 years that we need to fight them over there so we don't have to fight them over here? Yeah... permalink parent award report block reply YaharaRiver 1 points 5 days ago Turns out an atomic bomb was probably necessary to prevent the scattering.  They simply refuse to reassess and rebuild their spawning grounds after just an ordinary strike.  It still comes as a surprise to this day how little they respect their home & families. permalink parent award report block reply BlackPilledMAGA 28 points 5 days ago Can we get some leaders with balls again who kill people for making overtures of war like this? Get rid of the constitution?  We need to get rid of the people calling for that. FUCK the Quran and everyone who lives their life by it. permalink parent award report block reply chargebeck23 4 points 5 days ago Before you lose your shit too much, this is the original, unedited version: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply Capoditutticapi1 OP 2 points 5 days ago I bet you can't find the entire video of the interview..., just the few seconds clip.  Why is that? permalink parent award report block reply chargebeck23 3 points 5 days ago Wrong. Here is the unedited video - the relevant section is just after 4 mins in: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 Now that I've done that maybe you should ask yourself why someone would make an edited video to try and fool you? Why is that? permalink parent award report block reply view 1 more comments... Standingoak 11 points 5 days ago All lied on  their immigration documents.  But at least they now admit it:  \"we believe the Constitution should be replaced by the Quran”. I can't imagine why they lie: https://illinoisfamily.org/islam-sharia/knowing-four-arabic-words-may-save-our-civilization-from-islamic-takeover/ permalink parent award report block reply stingyarthropods 8 points 5 days ago deporting is too generous for these goat fucking terrorists. every single muslim needs to be killed. permalink parent award report block reply TwoArizonaPedes 6 points 5 days ago We're already fighting. Join us! permalink parent award report block reply load 5 more comments...\nMagma_Biscuit 44 points 5 days ago It ain’t gonna happen by the ballot permalink parent award report block reply Govtizbad 21 points 5 days ago Unfortunately true permalink parent award report block reply NimblePepeCentipede 16 points 5 days ago ....those terms are acceptable. permalink parent award report block reply Cumberbuns 1 points 5 days ago you mean acceptable? permalink parent award report block reply Taylor3006 1 points 5 days ago Ehh maybe Nimble is infantry. Just roll with it, smile, and pat him on the head. It is safer that way. permalink parent award report block reply view 1 more comments... NimblePepeCentipede 1 points 5 days ago ....yes I did, thank you. permalink parent award report block reply mikethemarine -3 points 5 days ago shut up word NAZI, we got the point permalink parent award report block reply view 4 more comments... Threaper666 8 points 5 days ago They shouldn't be in country at all. permalink parent award report block reply brimshae 3 points 5 days ago Hey, remember how we've been getting told for the last 24 years that we need to fight them over there so we don't have to fight them over here? Yeah... permalink parent award report block reply YaharaRiver 1 points 5 days ago Turns out an atomic bomb was probably necessary to prevent the scattering.  They simply refuse to reassess and rebuild their spawning grounds after just an ordinary strike.  It still comes as a surprise to this day how little they respect their home & families. permalink parent award report block reply\nGovtizbad 21 points 5 days ago Unfortunately true permalink parent award report block reply\nNimblePepeCentipede 16 points 5 days ago ....those terms are acceptable. permalink parent award report block reply Cumberbuns 1 points 5 days ago you mean acceptable? permalink parent award report block reply Taylor3006 1 points 5 days ago Ehh maybe Nimble is infantry. Just roll with it, smile, and pat him on the head. It is safer that way. permalink parent award report block reply view 1 more comments... NimblePepeCentipede 1 points 5 days ago ....yes I did, thank you. permalink parent award report block reply mikethemarine -3 points 5 days ago shut up word NAZI, we got the point permalink parent award report block reply view 4 more comments...\nCumberbuns 1 points 5 days ago you mean acceptable? permalink parent award report block reply Taylor3006 1 points 5 days ago Ehh maybe Nimble is infantry. Just roll with it, smile, and pat him on the head. It is safer that way. permalink parent award report block reply view 1 more comments... NimblePepeCentipede 1 points 5 days ago ....yes I did, thank you. permalink parent award report block reply mikethemarine -3 points 5 days ago shut up word NAZI, we got the point permalink parent award report block reply view 4 more comments...\nTaylor3006 1 points 5 days ago Ehh maybe Nimble is infantry. Just roll with it, smile, and pat him on the head. It is safer that way. permalink parent award report block reply view 1 more comments...\nNimblePepeCentipede 1 points 5 days ago ....yes I did, thank you. permalink parent award report block reply\nmikethemarine -3 points 5 days ago shut up word NAZI, we got the point permalink parent award report block reply view 4 more comments...\nThreaper666 8 points 5 days ago They shouldn't be in country at all. permalink parent award report block reply\nbrimshae 3 points 5 days ago Hey, remember how we've been getting told for the last 24 years that we need to fight them over there so we don't have to fight them over here? Yeah... permalink parent award report block reply YaharaRiver 1 points 5 days ago Turns out an atomic bomb was probably necessary to prevent the scattering.  They simply refuse to reassess and rebuild their spawning grounds after just an ordinary strike.  It still comes as a surprise to this day how little they respect their home & families. permalink parent award report block reply\nYaharaRiver 1 points 5 days ago Turns out an atomic bomb was probably necessary to prevent the scattering.  They simply refuse to reassess and rebuild their spawning grounds after just an ordinary strike.  It still comes as a surprise to this day how little they respect their home & families. permalink parent award report block reply\nBlackPilledMAGA 28 points 5 days ago Can we get some leaders with balls again who kill people for making overtures of war like this? Get rid of the constitution?  We need to get rid of the people calling for that. FUCK the Quran and everyone who lives their life by it. permalink parent award report block reply chargebeck23 4 points 5 days ago Before you lose your shit too much, this is the original, unedited version: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply Capoditutticapi1 OP 2 points 5 days ago I bet you can't find the entire video of the interview..., just the few seconds clip.  Why is that? permalink parent award report block reply chargebeck23 3 points 5 days ago Wrong. Here is the unedited video - the relevant section is just after 4 mins in: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 Now that I've done that maybe you should ask yourself why someone would make an edited video to try and fool you? Why is that? permalink parent award report block reply view 1 more comments...\nchargebeck23 4 points 5 days ago Before you lose your shit too much, this is the original, unedited version: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply Capoditutticapi1 OP 2 points 5 days ago I bet you can't find the entire video of the interview..., just the few seconds clip.  Why is that? permalink parent award report block reply chargebeck23 3 points 5 days ago Wrong. Here is the unedited video - the relevant section is just after 4 mins in: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 Now that I've done that maybe you should ask yourself why someone would make an edited video to try and fool you? Why is that? permalink parent award report block reply view 1 more comments...\nCapoditutticapi1 OP 2 points 5 days ago I bet you can't find the entire video of the interview..., just the few seconds clip.  Why is that? permalink parent award report block reply chargebeck23 3 points 5 days ago Wrong. Here is the unedited video - the relevant section is just after 4 mins in: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 Now that I've done that maybe you should ask yourself why someone would make an edited video to try and fool you? Why is that? permalink parent award report block reply view 1 more comments...\nchargebeck23 3 points 5 days ago Wrong. Here is the unedited video - the relevant section is just after 4 mins in: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 Now that I've done that maybe you should ask yourself why someone would make an edited video to try and fool you? Why is that? permalink parent award report block reply view 1 more comments...\nStandingoak 11 points 5 days ago All lied on  their immigration documents.  But at least they now admit it:  \"we believe the Constitution should be replaced by the Quran”. I can't imagine why they lie: https://illinoisfamily.org/islam-sharia/knowing-four-arabic-words-may-save-our-civilization-from-islamic-takeover/ permalink parent award report block reply\nstingyarthropods 8 points 5 days ago deporting is too generous for these goat fucking terrorists. every single muslim needs to be killed. permalink parent award report block reply\nTwoArizonaPedes 6 points 5 days ago We're already fighting. Join us! permalink parent award report block reply\nTrooph-Hurts 55 points 5 days ago Laughable but VERY SERIOUS…… there should be no islamists in America….. Islam is unconstitutional! permalink award report block reply Zacktopia33 17 points 5 days ago Correct. And oh, BTW, it's also pure demonism. permalink parent award report block reply SneakyWino 7 points 5 days ago You are right.  They are pedophiles.  So sick! permalink parent award report block reply Govtizbad 4 points 5 days ago They CAN replace the Constitution if they replace YOU permalink parent award report block reply Trooph-Hurts 3 points 5 days ago There are politicians who love this idea permalink parent award report block reply TravisRSCX 1 points 5 days ago With the way they breed and government subsidies they get for being here we are shooting ourselves in foot. permalink parent award report block reply\nZacktopia33 17 points 5 days ago Correct. And oh, BTW, it's also pure demonism. permalink parent award report block reply SneakyWino 7 points 5 days ago You are right.  They are pedophiles.  So sick! permalink parent award report block reply\nSneakyWino 7 points 5 days ago You are right.  They are pedophiles.  So sick! permalink parent award report block reply\nGovtizbad 4 points 5 days ago They CAN replace the Constitution if they replace YOU permalink parent award report block reply Trooph-Hurts 3 points 5 days ago There are politicians who love this idea permalink parent award report block reply TravisRSCX 1 points 5 days ago With the way they breed and government subsidies they get for being here we are shooting ourselves in foot. permalink parent award report block reply\nTrooph-Hurts 3 points 5 days ago There are politicians who love this idea permalink parent award report block reply\nTravisRSCX 1 points 5 days ago With the way they breed and government subsidies they get for being here we are shooting ourselves in foot. permalink parent award report block reply\nYT45 48 points 5 days ago That’s a declaration of hostile intent. permalink award report block reply Govtizbad 19 points 5 days ago They've already imported 5 million of themselves They have 5 kids each That's 2 generations to take over And since they get their wives pregnant at 9 yo that happens quicker than u think permalink parent award report block reply BrainwashedbyTrump 5 points 5 days ago Need to stop federal funding to cities accepting Islamic \"refugees\". Completely shut them off. permalink parent award report block reply Beardholder 4 points 5 days ago Domestic threats. permalink parent award report block reply chargebeck23 -3 points 5 days ago It's too easy to manipulate you. Be smarter. Real video is here: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply Capoditutticapi1 OP 4 points 5 days ago So you provide a link to another edited video without further context. What did the muslim say after that? Provide a link to the full speech... I tried to locate and couldn't find it... permalink parent award report block reply chargebeck23 2 points 5 days ago It was hard to find but here it is: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply Capoditutticapi1 OP 2 points 5 days ago Great work! Impressive that you found it... I had various AI looking for it with no luck... I doubted its existence and suspicious of why it was difficult to find, as in, the rest of the video drove a dark narrative that overshadowed the Huckabee sentence(s). The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? Thanks again for digging that full video up for context... permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 5 days ago I don't TikTok permalink parent award report block reply chargebeck23 2 points 5 days ago Here it is on Youtube. The relevant section is just after 4 mins https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply Capoditutticapi1 OP 1 points 5 days ago Nothing on TikTok, Google, Brave, YT, Rumble, or anywhere else! Not a single second more than a clip... Why is that? permalink parent award report block reply\nGovtizbad 19 points 5 days ago They've already imported 5 million of themselves They have 5 kids each That's 2 generations to take over And since they get their wives pregnant at 9 yo that happens quicker than u think permalink parent award report block reply BrainwashedbyTrump 5 points 5 days ago Need to stop federal funding to cities accepting Islamic \"refugees\". Completely shut them off. permalink parent award report block reply\nBrainwashedbyTrump 5 points 5 days ago Need to stop federal funding to cities accepting Islamic \"refugees\". Completely shut them off. permalink parent award report block reply\nBeardholder 4 points 5 days ago Domestic threats. permalink parent award report block reply\nchargebeck23 -3 points 5 days ago It's too easy to manipulate you. Be smarter. Real video is here: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply Capoditutticapi1 OP 4 points 5 days ago So you provide a link to another edited video without further context. What did the muslim say after that? Provide a link to the full speech... I tried to locate and couldn't find it... permalink parent award report block reply chargebeck23 2 points 5 days ago It was hard to find but here it is: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply Capoditutticapi1 OP 2 points 5 days ago Great work! Impressive that you found it... I had various AI looking for it with no luck... I doubted its existence and suspicious of why it was difficult to find, as in, the rest of the video drove a dark narrative that overshadowed the Huckabee sentence(s). The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? Thanks again for digging that full video up for context... permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 5 days ago I don't TikTok permalink parent award report block reply chargebeck23 2 points 5 days ago Here it is on Youtube. The relevant section is just after 4 mins https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply Capoditutticapi1 OP 1 points 5 days ago Nothing on TikTok, Google, Brave, YT, Rumble, or anywhere else! Not a single second more than a clip... Why is that? permalink parent award report block reply\nCapoditutticapi1 OP 4 points 5 days ago So you provide a link to another edited video without further context. What did the muslim say after that? Provide a link to the full speech... I tried to locate and couldn't find it... permalink parent award report block reply chargebeck23 2 points 5 days ago It was hard to find but here it is: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply Capoditutticapi1 OP 2 points 5 days ago Great work! Impressive that you found it... I had various AI looking for it with no luck... I doubted its existence and suspicious of why it was difficult to find, as in, the rest of the video drove a dark narrative that overshadowed the Huckabee sentence(s). The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? Thanks again for digging that full video up for context... permalink parent award report block reply view 1 more comments...\nchargebeck23 2 points 5 days ago It was hard to find but here it is: https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply Capoditutticapi1 OP 2 points 5 days ago Great work! Impressive that you found it... I had various AI looking for it with no luck... I doubted its existence and suspicious of why it was difficult to find, as in, the rest of the video drove a dark narrative that overshadowed the Huckabee sentence(s). The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? Thanks again for digging that full video up for context... permalink parent award report block reply view 1 more comments...\nCapoditutticapi1 OP 2 points 5 days ago Great work! Impressive that you found it... I had various AI looking for it with no luck... I doubted its existence and suspicious of why it was difficult to find, as in, the rest of the video drove a dark narrative that overshadowed the Huckabee sentence(s). The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? Thanks again for digging that full video up for context... permalink parent award report block reply view 1 more comments...\nMehNahMehNah 1 points 5 days ago I don't TikTok permalink parent award report block reply chargebeck23 2 points 5 days ago Here it is on Youtube. The relevant section is just after 4 mins https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply Capoditutticapi1 OP 1 points 5 days ago Nothing on TikTok, Google, Brave, YT, Rumble, or anywhere else! Not a single second more than a clip... Why is that? permalink parent award report block reply\nchargebeck23 2 points 5 days ago Here it is on Youtube. The relevant section is just after 4 mins https://youtu.be/3dvU47eInK0?si=obwx59fzgUwz_uvD&t=252 permalink parent award report block reply\nCapoditutticapi1 OP 1 points 5 days ago Nothing on TikTok, Google, Brave, YT, Rumble, or anywhere else! Not a single second more than a clip... Why is that? permalink parent award report block reply\nMedicallyReddit 26 points 5 days ago The Quran (Poopran) is a steaming pile of horse shit permalink award report block reply bumpman 5 points 5 days ago Sharia law would be implemented in America if incels were in charge permalink parent award report block reply\nbumpman 5 points 5 days ago Sharia law would be implemented in America if incels were in charge permalink parent award report block reply\nMoebius 22 points 5 days ago Charge him under 18 U.S.C. § 2385 - Advocating Overthrow of Government permalink award report block reply Magma_Biscuit 4 points 5 days ago The Hawaiian judge says no standing… permalink parent award report block reply Bramage 5 points 5 days ago add him to the charge. permalink parent award report block reply\nMagma_Biscuit 4 points 5 days ago The Hawaiian judge says no standing… permalink parent award report block reply Bramage 5 points 5 days ago add him to the charge. permalink parent award report block reply\nBramage 5 points 5 days ago add him to the charge. permalink parent award report block reply\nOnlyTrump20 18 points 5 days ago The US isn't a tiny country like England that's easy to flood with migrants.   They are just being stupid.   When they come as migrants to North America, their children will become apostates.   Their faith will become as diluted as it is with Christians in the US.   They'll get invaded by feminism, abortions, homosexuality and more. permalink award report block reply Seeker_17 7 points 5 days ago Yes, 24% of them apostatize, acc. to Pew studies. And 75% of converts leave within a few years. It seems without migration, their religion would fizzle out over here as not even their overall fertility rate, which is just around replacement level, is high enough to compensate for this. permalink parent award report block reply dawah_destroyer 4 points 5 days ago This is why they want to build their own insular mega communities. The children apostatize, specifically the women. One of the problems with Islam is polygamy, which leads to incels. So the religion is designed to handle this problem in a number of ways. Arranged marriage of minors, allowing men to be sexually promiscuous without sin, encouraging inbreeding, and of course the 72 virgins. This is the only reason men don't apostatize as often as women. permalink parent award report block reply TwoArizonaPedes 4 points 5 days ago Muhammad definitely designed his cult to appeal to barbaric men. permalink parent award report block reply\nSeeker_17 7 points 5 days ago Yes, 24% of them apostatize, acc. to Pew studies. And 75% of converts leave within a few years. It seems without migration, their religion would fizzle out over here as not even their overall fertility rate, which is just around replacement level, is high enough to compensate for this. permalink parent award report block reply dawah_destroyer 4 points 5 days ago This is why they want to build their own insular mega communities. The children apostatize, specifically the women. One of the problems with Islam is polygamy, which leads to incels. So the religion is designed to handle this problem in a number of ways. Arranged marriage of minors, allowing men to be sexually promiscuous without sin, encouraging inbreeding, and of course the 72 virgins. This is the only reason men don't apostatize as often as women. permalink parent award report block reply TwoArizonaPedes 4 points 5 days ago Muhammad definitely designed his cult to appeal to barbaric men. permalink parent award report block reply\ndawah_destroyer 4 points 5 days ago This is why they want to build their own insular mega communities. The children apostatize, specifically the women. One of the problems with Islam is polygamy, which leads to incels. So the religion is designed to handle this problem in a number of ways. Arranged marriage of minors, allowing men to be sexually promiscuous without sin, encouraging inbreeding, and of course the 72 virgins. This is the only reason men don't apostatize as often as women. permalink parent award report block reply TwoArizonaPedes 4 points 5 days ago Muhammad definitely designed his cult to appeal to barbaric men. permalink parent award report block reply\nTwoArizonaPedes 4 points 5 days ago Muhammad definitely designed his cult to appeal to barbaric men. permalink parent award report block reply\nDuckanddodge 18 points 5 days ago Do they want to die? permalink award report block reply fskfsk 24 points 5 days ago No, they want YOU to die.  If some of them die in the process of trying to kill you, that's an immediate reward in heaven. permalink parent award report block reply D__1 8 points 5 days ago That depends on how much pigs blood you have... permalink parent award report block reply DT170x 5 points 5 days ago Joke on them For each Breath that a Muslim inhale. A trace amount of atmospheric bacon enter their lungs permalink parent award report block reply deleted 10 points 5 days ago Seeker_17 9 points 5 days ago Exactly. Indeed, the only way for guaranteed salvation, i.e. going to 'paradise', is by dying in jihad. So doing this shit is a win-win for them. If they achieve what they want here, they win. If they die pursuing it, they win. Islam is a dangerous ideology, not a religion, and it needs to be banned. permalink parent award report block reply MedicallyReddit 7 points 5 days ago Actually, yes. They think they get rewarded by allah in heaven. But only after they complete their mission, which is to first kill the infidels. permalink parent award report block reply BidenShowerDrool 5 points 5 days ago it's a death cult. they believe that that the next life will be the \"best one\". permalink parent award report block reply\nfskfsk 24 points 5 days ago No, they want YOU to die.  If some of them die in the process of trying to kill you, that's an immediate reward in heaven. permalink parent award report block reply D__1 8 points 5 days ago That depends on how much pigs blood you have... permalink parent award report block reply DT170x 5 points 5 days ago Joke on them For each Breath that a Muslim inhale. A trace amount of atmospheric bacon enter their lungs permalink parent award report block reply\nD__1 8 points 5 days ago That depends on how much pigs blood you have... permalink parent award report block reply DT170x 5 points 5 days ago Joke on them For each Breath that a Muslim inhale. A trace amount of atmospheric bacon enter their lungs permalink parent award report block reply\nDT170x 5 points 5 days ago Joke on them For each Breath that a Muslim inhale. A trace amount of atmospheric bacon enter their lungs permalink parent award report block reply\ndeleted 10 points 5 days ago Seeker_17 9 points 5 days ago Exactly. Indeed, the only way for guaranteed salvation, i.e. going to 'paradise', is by dying in jihad. So doing this shit is a win-win for them. If they achieve what they want here, they win. If they die pursuing it, they win. Islam is a dangerous ideology, not a religion, and it needs to be banned. permalink parent award report block reply\nSeeker_17 9 points 5 days ago Exactly. Indeed, the only way for guaranteed salvation, i.e. going to 'paradise', is by dying in jihad. So doing this shit is a win-win for them. If they achieve what they want here, they win. If they die pursuing it, they win. Islam is a dangerous ideology, not a religion, and it needs to be banned. permalink parent award report block reply\nMedicallyReddit 7 points 5 days ago Actually, yes. They think they get rewarded by allah in heaven. But only after they complete their mission, which is to first kill the infidels. permalink parent award report block reply\nBidenShowerDrool 5 points 5 days ago it's a death cult. they believe that that the next life will be the \"best one\". permalink parent award report block reply\nLeeHarveySirhan 16 points 5 days ago There will be blood. permalink award report block reply Beardholder 5 points 5 days ago Hits fast forward button permalink parent award report block reply wilburh09 1 points 5 days ago There wasn't blood in that movie. permalink parent award report block reply\nBeardholder 5 points 5 days ago Hits fast forward button permalink parent award report block reply wilburh09 1 points 5 days ago There wasn't blood in that movie. permalink parent award report block reply\nwilburh09 1 points 5 days ago There wasn't blood in that movie. permalink parent award report block reply\nblueeyephoto 15 points 5 days ago if that's the case, they cannot legally hold office here as they swear to uphold and defend the Constitution. permalink award report block reply BidenShowerDrool 13 points 5 days ago Takiyya allows them to say whatever they want and since no-one is pulling them up on their bullshit they will keep on manifesting into Koranic demons spouting their diseased book as the future for America. permalink parent award report block reply BlackPilledMAGA 10 points 5 days ago You know how many scumbags in government have taken that \"oath\" and done nothing but attack the constitution? The problem is the \"oath\" is unenforced. There are no consequences for breaking it. Like, ZERO. Tolerance = Death. The end of America will be because we sat back and tolerated far too much in the name of kindness or goodness or whatever you want to call it when you \"live and let live\" with mental illness and evil ideologies like Islam. permalink parent award report block reply Anon1970 1 points 5 days ago Tolerance is the virtue of a man with no convictions. permalink parent award report block reply\nBidenShowerDrool 13 points 5 days ago Takiyya allows them to say whatever they want and since no-one is pulling them up on their bullshit they will keep on manifesting into Koranic demons spouting their diseased book as the future for America. permalink parent award report block reply\nBlackPilledMAGA 10 points 5 days ago You know how many scumbags in government have taken that \"oath\" and done nothing but attack the constitution? The problem is the \"oath\" is unenforced. There are no consequences for breaking it. Like, ZERO. Tolerance = Death. The end of America will be because we sat back and tolerated far too much in the name of kindness or goodness or whatever you want to call it when you \"live and let live\" with mental illness and evil ideologies like Islam. permalink parent award report block reply Anon1970 1 points 5 days ago Tolerance is the virtue of a man with no convictions. permalink parent award report block reply\nAnon1970 1 points 5 days ago Tolerance is the virtue of a man with no convictions. permalink parent award report block reply\nblitzstrasse 12 points 5 days ago No fuckin' chance. Everyone dies before I give in on this. permalink award report block reply\nDev404 11 points 5 days ago The quran is better served as paper to pick up dog shit. permalink award report block reply\nairborne3502 9 points 5 days ago When Muslims say what their plans are, believe them. permalink award report block reply\nSilentbutdeadly 8 points 5 days ago I say fuck your Islamic takeover bullshit.  I will NEVER live under Sharia bullshit law-no matter how confident this goat fuckers feel about their chances. permalink award report block reply\nFuckU/Spez 8 points 5 days ago They will advance their agenda, because if you were to do anything, you are the islamaphobe, they are just victims of your Whiteness.... But if you are a believer, these are things to come, I never imagined who would be the ones cutting heads off in Revelations 20:4, but they seems to be exposing themselves... permalink award report block reply\nMarkosis17 8 points 5 days ago Time to start deporting Muslims. One by one…. See ya! permalink award report block reply\nSpiritof2015 8 points 5 days ago Islam is a terrrorist organization. permalink award report block reply\nOldman1234 8 points 5 days ago The problem with having the Quran as your constitution is that you need to replace the Supreme Court with an Ayatollah who has the last word on everything.  And, we've seen how well that's worked out. permalink award report block reply wilburh09 2 points 5 days ago And they will rape your wife and kill you.  Isis taught us a lot. permalink parent award report block reply\nwilburh09 2 points 5 days ago And they will rape your wife and kill you.  Isis taught us a lot. permalink parent award report block reply\nDecepticons-superior 8 points 5 days ago Han Solo: Over my dead body. Greedo: That’s the idea. permalink award report block reply TwoArizonaPedes 8 points 5 days ago And Han shot first. permalink parent award report block reply\nTwoArizonaPedes 8 points 5 days ago And Han shot first. permalink parent award report block reply\nMyNameIsTaxpayer 8 points 5 days ago All I hear is Kill Whites. permalink award report block reply\nSparks1017 7 points 5 days ago Get fucked you goat fucking mooselim permalink award report block reply\nChristineblaseyford 6 points 5 days ago I believe all the Muslims in the US should be replaced by pigs and dogs.  Because those animals are way better than durkadurka's. permalink award report block reply\nterribletwos 6 points 5 days ago Every area that they got people dropped into will be taken over by them politically. So for example in my state they took over a whole suburb. They weren't here a few years ago and now it's only them. I saw the first ever muslim in my neighborhood for the first time in my life time and the following week there were dozens of them. Every area they take over is a beachhead to import more to take over another area. They will succeed unless there is massive unprecedented action. permalink award report block reply\nGuidedDisinfo 6 points 5 days ago Deport. permalink award report block reply\nTheArchAngel 6 points 5 days ago those people shouldn't have their human rights protected by the constitution. permalink award report block reply\nredditadminssuckit 6 points 5 days ago Kill it now permalink award report block reply\nCoprolite 6 points 5 days ago I want to sprinkle pigs blood on a Quran. permalink award report block reply Magma_Biscuit 5 points 5 days ago Just burn it permalink parent award report block reply StoopidAsshole69 2 points 5 days ago Better to pretend to read it while laughing to yourself and eating a ham and swiss melt from arby’s permalink parent award report block reply BigMikesSwingingCock 5 points 5 days ago The poor pig's blood being contaminated by that demonic book of horseshit. permalink parent award report block reply\nMagma_Biscuit 5 points 5 days ago Just burn it permalink parent award report block reply StoopidAsshole69 2 points 5 days ago Better to pretend to read it while laughing to yourself and eating a ham and swiss melt from arby’s permalink parent award report block reply\nStoopidAsshole69 2 points 5 days ago Better to pretend to read it while laughing to yourself and eating a ham and swiss melt from arby’s permalink parent award report block reply\nBigMikesSwingingCock 5 points 5 days ago The poor pig's blood being contaminated by that demonic book of horseshit. permalink parent award report block reply\nWizard_Glick 5 points 5 days ago Gonna get bloody... permalink award report block reply\nMehNahMehNah 5 points 5 days ago The Quran is hostile towards Christianity specifically as it reduces Jesus to a prophet. It's blasphemy and should be rejected outright and burned upon contact. There is no turning ge other cheek on this, it calls for the kind of absolute Old Testament devastating action when these forces manifest themselves. Any overt attempt at Islamic proseltyzing should be met with the kind of violence they wish upon non-believers. permalink award report block reply\nEdBuck 5 points 5 days ago It's been past ti.e to start 86ing those that say this shit permalink award report block reply\nDefKon1 5 points 5 days ago Well, I believe in the 2nd Amendment of the U.S. Constitution. Just sayin'....For some reason..🤷🇺🇲 permalink award report block reply\nPensivePatriot 5 points 5 days ago This is why they were literally illegal in this nation before 1967. Their entire system of belief is predicated upon this, and we will not protect the solidarity of the constitution until we deport them whole cloth. permalink award report block reply\nInduceddrag 5 points 5 days ago Is there anybody else here with the slightest desire in seeing the handmaid’s tale cosplay set forced to wear burkas?  Even for just a day, just in NYC, before things go kinetic? permalink award report block reply\nBubbahax 5 points 5 days ago The long game for muslims is to convince Christians that Jesus wasnt the son of God and was just another prophet.  Then Christians can become good little muslims and submit to Sharia.  I highly suspect this will be the false religion that was shown in the Revelation of John. permalink award report block reply\nSeeker_17 5 points 5 days ago This is a clear threat to national security. WTF is Trump going to do about this? I want to see mass deportations of muslims, denaturalizations and incarcerations. permalink award report block reply TheDarkEmperor 0 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nTheDarkEmperor 0 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nMrCuriousGuy513 5 points 5 days ago Sure, when they explain where the Injeel is and why can’t Allah prevent anyone from corrupting his own words and book. permalink award report block reply\nSameUnderstanding 4 points 5 days ago Why are these child rapists allowed to even talk? Get them out permalink award report block reply\nDon-O-Mite 4 points 5 days ago and I think they should be well vaccinated with lead... permalink award report block reply\nNaught0 4 points 5 days ago They shouldn’t even be sucking air here. permalink award report block reply\nMAGAnic316 4 points 5 days ago Thanks to every strong feminist and OF whore refusing to breed for making this happen! Demographics = destiny permalink award report block reply\nduznmatter 4 points 5 days ago If you see the future even a little bit you can see the Left/\nCommies and the Mudslimes combining forces against the American constitution. If this don't get corrected real soon the only thing left is war. Exactly what the democrats and probably half of the republicans want right now anyway. permalink award report block reply\nauntjemima 4 points 5 days ago get fucked goatfucker permalink award report block reply\nKrampus5150 4 points 5 days ago You will die raghead. permalink award report block reply\nlearntocode 4 points 5 days ago Fair enough, we can have that argument - but not when foreigners are being subsidized and supported to materially fight that fight against the native born. permalink award report block reply\nSALTY-OGRE 4 points 5 days ago REMOVE THESE SCUMBAGS AND RETURN THEM TO THEIR MUD HUTS HELD TOGETHER BY SHIT. FUCK ISLAM, CHRIST IS KING! permalink award report block reply\nBeardholder 4 points 5 days ago Openly admitting to treason. Hang him or kick him the fuck out. permalink award report block reply chargebeck23 -1 points 5 days ago He didn't actually say that though, it's just an edited video Real vid is here: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply\nchargebeck23 -1 points 5 days ago He didn't actually say that though, it's just an edited video Real vid is here: https://www.tiktok.com/@omarsuleimanofficial/video/7526572745144945951 permalink parent award report block reply\nSickOfNeoPolitics 4 points 5 days ago Mudshits make for easy targets in the snow. permalink award report block reply\nMatterThatMetals 4 points 5 days ago Yeah, fuck that idea Omar. permalink award report block reply\nConstantin2024 4 points 5 days ago Educate yourself. The Quran is literally the Satanic Bible. https://www.youtube.com/watch?v=ctGN1hnRR3Q https://www.youtube.com/watch?v=wy_iD6Lf6MY permalink award report block reply\nsleepinggiant 4 points 5 days ago A law was repealed in 1992 that prevented muslims from holding office. This was based on islam not holding seperate state and religous afairs. Put the law back on the books. permalink award report block reply\nFirespawn 4 points 5 days ago We the people are going to have to kill a lot of camel jockeys, it seems. If they aren't deported, war will be on the menu.\nFuck Islam. permalink award report block reply\nAggrieved03 3 points 5 days ago How is it any race or group can talk about taking over the government but 2 crackers in a bar mention it and the FBI is all over them? permalink award report block reply Capoditutticapi1 OP 2 points 5 days ago Exactly! Why is that? Maybe we've already been captured and the DS is playing for the other team... permalink parent award report block reply Aggrieved03 4 points 5 days ago Brennan permalink parent award report block reply\nCapoditutticapi1 OP 2 points 5 days ago Exactly! Why is that? Maybe we've already been captured and the DS is playing for the other team... permalink parent award report block reply Aggrieved03 4 points 5 days ago Brennan permalink parent award report block reply\nAggrieved03 4 points 5 days ago Brennan permalink parent award report block reply\nFormerlurker92 3 points 5 days ago It hasn't even been a quarter century since they flew planes into us, how are people this permissive permalink award report block reply\nNonbinaryPotatohead 3 points 5 days ago No shit. Islam is an INVASIVE GOVERNMENT disguised as a religion. It's ENTIRE existence is hinged upon the establishment of a centralized GLOBAL caliphate taking place of every government and enforcing shit sharia law in place of your Rule of Law with checks and balances. It was founded by a pedophile warlord and it's all goofy bullshit centered around sex and slavery. permalink award report block reply\nACActual 3 points 5 days ago We need leadership with balls.  Yesterday.  Having the cowardly Politicians we do at this moment in time places all Americans in a precarious situation. Real Leadership would start denaturalizing and Deporting every Muslim that talks like this.  FBI infiltrate their ranks to take out entire Mosques at a time.   Imam talks shits?  Entire mosque, including all relations Deported without remorse immediately. Its either this or our kids will be fighting the GWOT every day on American soil. Fucking politicians.  Fight them there then import them here.  Should all be strung up for allowing this permalink award report block reply\nTrump2020or4eva 3 points 5 days ago They tell us what theyre doing to our faces..... permalink award report block reply\nAlldayeveryday 3 points 5 days ago It will come to violence before that ever happens permalink award report block reply\nSaxonRealm 3 points 4 days ago Time for a constitutional amendment banning Islam. Trump should support this, but he doesn’t have the balls for that. permalink award report block reply\nNotYourMan 3 points 5 days ago Say your are a traitor to the constitution while saying you are a traitor.  Look up the definition of fascism in a 1940 dictionary.  Its very interesting. permalink award report block reply\ntwopoint71 3 points 4 days ago Sedition used to be a crime. permalink award report block reply\nWelderX 3 points 5 days ago Say when... permalink award report block reply\ncherbui 3 points 5 days ago can ? it already is got MN NY CA ALL THOSE DEM STATES ?THEIR  quran call for killing their enemies... by enemies it mean  US .. use their own quran law and we exterminate and remove the theat to our Country is poetic justice by their laws  ..  we just apply their quran laws on them .. no need for rights or US Consitution to be given to thse infidel terrorist .. .. that would be a great arguement for our gov. to remove the threate.. their rights and desired we apply their law on them to remove the islamic theat .. in my opinion why bother bowing to islamic like democrats odo..  deport their ass .. ALL OF them permalink award report block reply\nDontTreadOnLego 3 points 5 days ago DEPORT the sand naggers They keep nagging us about destroying our country. permalink award report block reply\nBBvarn 3 points 5 days ago Won't work. Not enough goat fuckers in the US. permalink award report block reply Seeker_17 5 points 5 days ago They will try it by getting elected into leading positions and then implement it from the top. They will fail. They are biting off more than they can chew and will get fucked up in the process. permalink parent award report block reply\nSeeker_17 5 points 5 days ago They will try it by getting elected into leading positions and then implement it from the top. They will fail. They are biting off more than they can chew and will get fucked up in the process. permalink parent award report block reply\nbobbacringo 3 points 5 days ago All brought in by the express wishes of the chosen ones. permalink award report block reply\nGhostOfMyFormerSelf 3 points 5 days ago Over my melted AR-15. permalink award report block reply\nJimmy33 3 points 5 days ago They are serious. permalink award report block reply\ntired-of-crap 2 points 4 days ago To do that would take the vote of 38 states. They will NEVER get this support. permalink award report block reply\nGuerillaYourDreams 2 points 5 days ago I'm reading the Qu'ran now. We Christians must know the enemy. permalink award report block reply YaharaRiver 4 points 5 days ago If you can say that without exasperation, you’re lying. The koran is the most unpleasant, difficult, fucked up “book” you will ever struggle to read.  You will constantly put it down to recover. It makes no sense, jumps around without reason, and cites ridiculous and fatal platitudes.  It is entirely without humor or amusement, no wisdom whatsoever, and insufferably bloated with excessive flattery and pompous conceit. Exactly what one would expect.  1/2 star, would not recommend. permalink parent award report block reply GuerillaYourDreams 2 points 5 days ago I’ve been involved in the study of Christian apologetics for a very long time. I actually haven’t read any of the Quran for over 15 years so I wanted to refresh my memory. permalink parent award report block reply YaharaRiver 3 points 5 days ago I would recommend reading the instruction manuals for Russian spacecraft even if that means you have to learn Russian first. MUCH more enjoyable way to spend your time, and when you’re done you can fix Russian spacecrafts! After you’re done with the koran, you have nothing to show for it except killed off brain cells and a heart as hard as a rock. permalink parent award report block reply\nYaharaRiver 4 points 5 days ago If you can say that without exasperation, you’re lying. The koran is the most unpleasant, difficult, fucked up “book” you will ever struggle to read.  You will constantly put it down to recover. It makes no sense, jumps around without reason, and cites ridiculous and fatal platitudes.  It is entirely without humor or amusement, no wisdom whatsoever, and insufferably bloated with excessive flattery and pompous conceit. Exactly what one would expect.  1/2 star, would not recommend. permalink parent award report block reply GuerillaYourDreams 2 points 5 days ago I’ve been involved in the study of Christian apologetics for a very long time. I actually haven’t read any of the Quran for over 15 years so I wanted to refresh my memory. permalink parent award report block reply YaharaRiver 3 points 5 days ago I would recommend reading the instruction manuals for Russian spacecraft even if that means you have to learn Russian first. MUCH more enjoyable way to spend your time, and when you’re done you can fix Russian spacecrafts! After you’re done with the koran, you have nothing to show for it except killed off brain cells and a heart as hard as a rock. permalink parent award report block reply\nGuerillaYourDreams 2 points 5 days ago I’ve been involved in the study of Christian apologetics for a very long time. I actually haven’t read any of the Quran for over 15 years so I wanted to refresh my memory. permalink parent award report block reply YaharaRiver 3 points 5 days ago I would recommend reading the instruction manuals for Russian spacecraft even if that means you have to learn Russian first. MUCH more enjoyable way to spend your time, and when you’re done you can fix Russian spacecrafts! After you’re done with the koran, you have nothing to show for it except killed off brain cells and a heart as hard as a rock. permalink parent award report block reply\nYaharaRiver 3 points 5 days ago I would recommend reading the instruction manuals for Russian spacecraft even if that means you have to learn Russian first. MUCH more enjoyable way to spend your time, and when you’re done you can fix Russian spacecrafts! After you’re done with the koran, you have nothing to show for it except killed off brain cells and a heart as hard as a rock. permalink parent award report block reply\nKungPaoMcChicken 2 points 5 days ago Faggotry... permalink award report block reply\nLookFatty 2 points 5 days ago How about,  GO FUCK YOUR OWN FACE  !!! permalink award report block reply\nMcLemore800 2 points 5 days ago Once again, founding fathers were short sighted and fucked up royally by granting “freedom of religion” and no national language permalink award report block reply\nh203h 2 points 5 days ago HAHAHAHAHAHAHAHA THESE GOAT FUCKERS WOULD DIE IN A MILLION PIECES. THEY STAND NO CHANCE permalink award report block reply\nTellman125 2 points 5 days ago Now that  Mamdani won won, Trump WANTS to keep him there to use him as the poster boy and punching bag for what the Democrats have become; this is even someone that MSNBC has unhappily foreseen since BEFORE the final votes were cast: https://patriots.win/p/1ARK0Ud0Cf/dems-were-already-having-buyers-/c permalink award report block reply\nPatriotSkorzeny 1 points 5 days ago Cops will defend the Moslem. 😒 permalink award report block reply DangerousAmerican76 2 points 5 days ago Challenge accepted permalink parent award report block reply TrumpMagaNoBama 2 points 5 days ago It won't matter. permalink parent award report block reply\nDangerousAmerican76 2 points 5 days ago Challenge accepted permalink parent award report block reply\nTrumpMagaNoBama 2 points 5 days ago It won't matter. permalink parent award report block reply\nHenkZeilstra 1 points 5 days ago Made possible by the Jews who want to dump even more muslims here so they can have the ME for themselves permalink award report block reply keeptherepublic1776 1 points 5 days ago Thanks for this comment. 100 percent Israel is responsible for installing the NYC mayor. Look no one is talking Israel anymore. permalink parent award report block reply\nkeeptherepublic1776 1 points 5 days ago Thanks for this comment. 100 percent Israel is responsible for installing the NYC mayor. Look no one is talking Israel anymore. permalink parent award report block reply\ncorntortilla 1 points 5 days ago How about NO? And Gfy. permalink award report block reply\nbananafone 1 points 5 days ago Too bad no one wants to actually \" crusade\" permalink award report block reply\njhewish 1 points 5 days ago To be fair the first one supposedly is out of context. \"We believe the constitution should be replaced by the Quran\" Supposedly the entire context is this: “It wasn’t Muslims that said we believe the Constitution should be replaced by the Quran. It was Huckabee who said the Constitution should be replaced by the Bible\" Regardless, the other clips are fucking terrible and totally accurate to what is going on. permalink award report block reply\nRighteous 1 points 5 days ago I want whoever is responsible for putting this tier content in my feeds (TDW, X, instagram, et al) executed on the spot. This is a pattern and it is traitorously deliberate. permalink award report block reply\nParmesanCartel 1 points 5 days ago Hey, what was that oath people take when joining the military? permalink award report block reply TheDarkEmperor 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nTheDarkEmperor 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\ngustodog 0 points 5 days ago How did mass migration of Muslims and other problem demographics into the West become a problem when the public are overwhelmingly against it and against mass migration in general? Coordinating a push like this requires planning and resources. \"I think there is a resurgence of anti-semitism, because at this point in time Europe has not yet learned how to be multicultural. And I think we are going to be part of the throes of that transformation, which must take place. Europe is not going to be the monolithic societies that they once were in the last century. Jews are going to be at the centre of that. It's a huge transformation for Europe to make. They are now going into a multicultural mode and Jews will be resented because of our leading role. But without that leading role and without that transformation, Europe will not survive.\" -Barbara Spectre on Israeli TV permalink award report block reply Tiger5468 0 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTiger5468 0 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nKpak76 -2 points 5 days ago Just to be fair, the first guy was taken out of context here.  You can tell what he is saying is spliced. His full statement can be found here https://www.dallasnews.com/opinion/commentary/2025/07/11/omar-suleiman-an-edited-clip-about-me-has-gone-viral/ permalink award report block reply Capoditutticapi1 OP 2 points 5 days ago Granted..., few seconds taken out of context, but where is the full video for complete context? Transcript? Anything? The article is all about the clip NOT a full explanation of his speech nor video, interview, whatever! I want to see/hear the entire video/speech! What else did he say that gives context one way or another of the entirety of the video/speech? Genuinely curious... I tried to find it but nothing comes up, just the clips... permalink parent award report block reply Kpak76 1 points 5 days ago I'm not doubting the guy is a douchebag that wants Sharia law, but we shouldn't take quotes out of context when we complain the media does the exact same thing to us. permalink parent award report block reply Capoditutticapi1 OP 0 points 5 days ago The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? permalink parent award report block reply Kpak76 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nCapoditutticapi1 OP 2 points 5 days ago Granted..., few seconds taken out of context, but where is the full video for complete context? Transcript? Anything? The article is all about the clip NOT a full explanation of his speech nor video, interview, whatever! I want to see/hear the entire video/speech! What else did he say that gives context one way or another of the entirety of the video/speech? Genuinely curious... I tried to find it but nothing comes up, just the clips... permalink parent award report block reply Kpak76 1 points 5 days ago I'm not doubting the guy is a douchebag that wants Sharia law, but we shouldn't take quotes out of context when we complain the media does the exact same thing to us. permalink parent award report block reply Capoditutticapi1 OP 0 points 5 days ago The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? permalink parent award report block reply Kpak76 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nKpak76 1 points 5 days ago I'm not doubting the guy is a douchebag that wants Sharia law, but we shouldn't take quotes out of context when we complain the media does the exact same thing to us. permalink parent award report block reply Capoditutticapi1 OP 0 points 5 days ago The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? permalink parent award report block reply Kpak76 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nCapoditutticapi1 OP 0 points 5 days ago The full context of the entire video supports the claim that Suleiman doesn't specifically advocate for replacing the US Constitution with the Quran. That's a semantic win for you and others that challenged the editing of the clips. Can you explain what he means in the last couple of minutes in the video where he says, \"Muslims should be offering number one is that in order to see Sharia for what it truly is you have to see it represented in totality not aspects of it. Surely there are aspects of it that are being implemented in several Muslim countries but never do you see the Sharia as a whole being given okay and although we we acknowledge the good things that will come from many different governments around the world the very idea of having a monarch to implement Sharia contradicts Sharia in and of itself okay so having an unparalleled unquestioned authority contradicts Sharia itself because Sharia has embedded within it checks and balances and so that's the first answer that we have to be able to give is that Sharia is a full system it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in you know in consideration when implementing it on a state level but at the same time we don't see today any government that is implementing Sharia in totality and so it is not our responsibility to defend those governments policies rather we only answer to what the Sharia stands for...\" Explain this: \"Sharia is a full system, it's not exactly democracy it certainly has within elements of taking the opinion of others and those types of things in, you know in consideration when implementing it on a state level...\" Specifically curious about the part \"...implementing it on a state level...\" How is this compatible with the US Constitution when \"they\" only answer to what Sharia stands for? permalink parent award report block reply Kpak76 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nKpak76 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nrapskull 0 points 5 days ago Comment removed by community moderators. permalink award report block reply\nTheDarkEmperor 0 points 5 days ago Comment removed by community moderators. permalink award report block reply"
}