{
  "id": "1ARK5A7vSz",
  "url": "https://patriots.win/p/1ARK5A7vSz/dont-give-me-50-years-deport-50-/c",
  "content": "341 😡😡😡😡😡😡😡😡Don’t give me 50 years, Deport 50 Mill. 🌶️ 🌶️ SPICY 🌶️ 🌶️ posted 3 days ago by GodIsPerfect 24 comments award share report block Wall Street Mav @WallStreetMav • 4d The main winners of a 50 year mortgage are the banks. You pay mostly interest, very little principal on each payment. A better solution is to deport 30 million illegal aliens to bring down rent and housing prices. Andrew Lokenauth | TheFinanceNewsletter.com @FluentInFinance • 4d President Trump’s 50-year mortgage explained:\n24 comments Sort by Top Top New Worst Old Save Covfefebrulee 14 points 3 days ago Yup. A 50-year mortgage is RENTING. permalink award report block reply Pied-Trumper 5 points 3 days ago We voted for deportations, economic corrections, nationalism, etc. We got multiple foreign wars for the benefit of foreign nations, $2k stimulus checks, 50-year mortgages (you pay nearly 1 million in interest on a $300k fixer-upper), and usury. We’re already heading into a recession, along with a likely housing and AI crash. Now we’re gonna try creating more inflation when it’s already out of control, increasing housing costs even more, and handout mortgages that are way worse than any of the subprime loans in 08. Bank of America lost a class action for telling millions of homeowners they needed to MISS PAYMENTS to qualify for refinancing, subsequently foreclosing on their homes anyway in 08. They blatantly stole peoples’ homes from them via fraud, were bailed out by taxpayers, profited, and then only paid around $1,400 to victims. They’re gonna have an even better time taking advantage of this setup. permalink parent award report block reply Covfefebrulee 2 points 3 days ago Grim. permalink parent award report block reply Whereisbiden 2 points 3 days ago not if you have a life insurance that pays it off after you pass away permalink parent award report block reply Seruna_Kanus 10 points 3 days ago It's sickening that interest values can accumulate to more than half the value of the home to begin with. permalink award report block reply Im_RickSteves_bitch 12 points 3 days ago That should fall under the legal definition of usury. permalink parent award report block reply Seruna_Kanus 2 points 3 days ago Same for auto payments.  Why the fuck is it allowed for interest to eat up half the agreed payment plan? permalink parent award report block reply DingleBalls 8 points 3 days ago The crime of home loans is that most money goes to interest and not principal permalink award report block reply newestofnew 4 points 3 days ago they know, its how they have lived for centuries before the use even existed. it didn't exist here, until we \"won\" World War Two, and gave them refuge and well as they say no good deed goes unpunished permalink parent award report block reply Shitsbrokeyo 1 points 3 days ago If you can't do a 15, go into a smaller house to do so, you can build on or trade up later. Much better equity situation. permalink parent award report block reply Gnometard 1 points 3 days ago The crazy thing about debt is you're not capped at what you pay, there's a minimum. If you do the minimum in anything, the cost on you will be higher over time. permalink parent award report block reply CleanUpPhillyTrump24 3 points 3 days ago The issue here is Jerome Foul not lowering interest rates at the Fed, which he can without any negative effect. permalink award report block reply imnotdeadyet 3 points 3 days ago Bingo.  Get the interest rates down and get the illegals out and most of the problem is solved. permalink parent award report block reply Gnometard 3 points 3 days ago We also need folks to understand that with debt, the \"payment\" is the MINIMUM PAYMENT. If that's all you're paying on any debt, you're fucking yourself. Can't afford more than the minimum? YOU CAN'T AFFORD THE DEBT!!!!! I'm ok with an option of 50 years, but I'm sick of trying to fix culture with government. Communism fails and kills BECAUSE you can't control culture with government. permalink award report block reply Im_RickSteves_bitch 2 points 3 days ago At this rate, Trump is going to make people look fondly back on the Biden era as the time when we weren't debt slaves. permalink award report block reply MAGALADON9 1 points 3 days ago The 50s actual monthly is 3,304 per month Total interest paid will be 1,432,772 permalink award report block reply jarasan 1 points 3 days ago It all started in Japan years ago, one could pass the mortgage on to next generations...rent it is rent 50 years is a life time.  Consider yourself lucky if you own anything out right, you'll only have to pay the taxes to keep the right to own your property. F'ing still the greatest......on Earth. permalink award report block reply Kwyjiboy0 1 points 3 days ago Morrgage permalink award report block reply Franklymydear 0 points 3 days ago I’m pretty sure the administration can do both. We’re already on track to deport roughly 12,000,000 in four years Moreover -a 50 year mortgage is no different than a 72 month car loan or an 84 month car loan…. It’s just a tool you can use to finance something that you can’t actually afford, but may be able to based on your economic situation in the future. ie -someone just starting out in a career with rapid advancement could afford to pay off the house well ahead of the 50 year mark Meanwhile, the lower payment affords you the ability to use money elsewhere in the short term It’s just a tool. You don’t have to do a 50 year mortgage FFS I didn’t see anybody here bitching about arms or balloon payments or any other thing that is available currently Newsflash, we also currently have interest only mortgage loans permalink award report block reply ReleasetheList 2 points 3 days ago No we aren't. FOIA requests show actual deportations, not self deportations or turn aways at the border, to be 145k. 14.5k a month isn't going to cut it. permalink parent award report block reply Morokei 1 points 3 days ago Most self deportations or those choosing not to try to illegally enter in the first place are the result of us having effective deportation.  They count just as much. permalink parent award report block reply Franklymydear 1 points 3 days ago Just getting started - BBB will enhance those rates significantly. permalink parent award report block reply Gnometard 1 points 3 days ago Bro, Facebook and reddit circle jerks say differently. I'm gonna trust retards who say things online instead of thinking for myself permalink parent award report block reply\nCovfefebrulee 14 points 3 days ago Yup. A 50-year mortgage is RENTING. permalink award report block reply Pied-Trumper 5 points 3 days ago We voted for deportations, economic corrections, nationalism, etc. We got multiple foreign wars for the benefit of foreign nations, $2k stimulus checks, 50-year mortgages (you pay nearly 1 million in interest on a $300k fixer-upper), and usury. We’re already heading into a recession, along with a likely housing and AI crash. Now we’re gonna try creating more inflation when it’s already out of control, increasing housing costs even more, and handout mortgages that are way worse than any of the subprime loans in 08. Bank of America lost a class action for telling millions of homeowners they needed to MISS PAYMENTS to qualify for refinancing, subsequently foreclosing on their homes anyway in 08. They blatantly stole peoples’ homes from them via fraud, were bailed out by taxpayers, profited, and then only paid around $1,400 to victims. They’re gonna have an even better time taking advantage of this setup. permalink parent award report block reply Covfefebrulee 2 points 3 days ago Grim. permalink parent award report block reply Whereisbiden 2 points 3 days ago not if you have a life insurance that pays it off after you pass away permalink parent award report block reply\nPied-Trumper 5 points 3 days ago We voted for deportations, economic corrections, nationalism, etc. We got multiple foreign wars for the benefit of foreign nations, $2k stimulus checks, 50-year mortgages (you pay nearly 1 million in interest on a $300k fixer-upper), and usury. We’re already heading into a recession, along with a likely housing and AI crash. Now we’re gonna try creating more inflation when it’s already out of control, increasing housing costs even more, and handout mortgages that are way worse than any of the subprime loans in 08. Bank of America lost a class action for telling millions of homeowners they needed to MISS PAYMENTS to qualify for refinancing, subsequently foreclosing on their homes anyway in 08. They blatantly stole peoples’ homes from them via fraud, were bailed out by taxpayers, profited, and then only paid around $1,400 to victims. They’re gonna have an even better time taking advantage of this setup. permalink parent award report block reply Covfefebrulee 2 points 3 days ago Grim. permalink parent award report block reply\nCovfefebrulee 2 points 3 days ago Grim. permalink parent award report block reply\nWhereisbiden 2 points 3 days ago not if you have a life insurance that pays it off after you pass away permalink parent award report block reply\nSeruna_Kanus 10 points 3 days ago It's sickening that interest values can accumulate to more than half the value of the home to begin with. permalink award report block reply Im_RickSteves_bitch 12 points 3 days ago That should fall under the legal definition of usury. permalink parent award report block reply Seruna_Kanus 2 points 3 days ago Same for auto payments.  Why the fuck is it allowed for interest to eat up half the agreed payment plan? permalink parent award report block reply\nIm_RickSteves_bitch 12 points 3 days ago That should fall under the legal definition of usury. permalink parent award report block reply Seruna_Kanus 2 points 3 days ago Same for auto payments.  Why the fuck is it allowed for interest to eat up half the agreed payment plan? permalink parent award report block reply\nSeruna_Kanus 2 points 3 days ago Same for auto payments.  Why the fuck is it allowed for interest to eat up half the agreed payment plan? permalink parent award report block reply\nDingleBalls 8 points 3 days ago The crime of home loans is that most money goes to interest and not principal permalink award report block reply newestofnew 4 points 3 days ago they know, its how they have lived for centuries before the use even existed. it didn't exist here, until we \"won\" World War Two, and gave them refuge and well as they say no good deed goes unpunished permalink parent award report block reply Shitsbrokeyo 1 points 3 days ago If you can't do a 15, go into a smaller house to do so, you can build on or trade up later. Much better equity situation. permalink parent award report block reply Gnometard 1 points 3 days ago The crazy thing about debt is you're not capped at what you pay, there's a minimum. If you do the minimum in anything, the cost on you will be higher over time. permalink parent award report block reply\nnewestofnew 4 points 3 days ago they know, its how they have lived for centuries before the use even existed. it didn't exist here, until we \"won\" World War Two, and gave them refuge and well as they say no good deed goes unpunished permalink parent award report block reply\nShitsbrokeyo 1 points 3 days ago If you can't do a 15, go into a smaller house to do so, you can build on or trade up later. Much better equity situation. permalink parent award report block reply\nGnometard 1 points 3 days ago The crazy thing about debt is you're not capped at what you pay, there's a minimum. If you do the minimum in anything, the cost on you will be higher over time. permalink parent award report block reply\nCleanUpPhillyTrump24 3 points 3 days ago The issue here is Jerome Foul not lowering interest rates at the Fed, which he can without any negative effect. permalink award report block reply imnotdeadyet 3 points 3 days ago Bingo.  Get the interest rates down and get the illegals out and most of the problem is solved. permalink parent award report block reply\nimnotdeadyet 3 points 3 days ago Bingo.  Get the interest rates down and get the illegals out and most of the problem is solved. permalink parent award report block reply\nGnometard 3 points 3 days ago We also need folks to understand that with debt, the \"payment\" is the MINIMUM PAYMENT. If that's all you're paying on any debt, you're fucking yourself. Can't afford more than the minimum? YOU CAN'T AFFORD THE DEBT!!!!! I'm ok with an option of 50 years, but I'm sick of trying to fix culture with government. Communism fails and kills BECAUSE you can't control culture with government. permalink award report block reply\nIm_RickSteves_bitch 2 points 3 days ago At this rate, Trump is going to make people look fondly back on the Biden era as the time when we weren't debt slaves. permalink award report block reply\nMAGALADON9 1 points 3 days ago The 50s actual monthly is 3,304 per month Total interest paid will be 1,432,772 permalink award report block reply\njarasan 1 points 3 days ago It all started in Japan years ago, one could pass the mortgage on to next generations...rent it is rent 50 years is a life time.  Consider yourself lucky if you own anything out right, you'll only have to pay the taxes to keep the right to own your property. F'ing still the greatest......on Earth. permalink award report block reply\nKwyjiboy0 1 points 3 days ago Morrgage permalink award report block reply\nFranklymydear 0 points 3 days ago I’m pretty sure the administration can do both. We’re already on track to deport roughly 12,000,000 in four years Moreover -a 50 year mortgage is no different than a 72 month car loan or an 84 month car loan…. It’s just a tool you can use to finance something that you can’t actually afford, but may be able to based on your economic situation in the future. ie -someone just starting out in a career with rapid advancement could afford to pay off the house well ahead of the 50 year mark Meanwhile, the lower payment affords you the ability to use money elsewhere in the short term It’s just a tool. You don’t have to do a 50 year mortgage FFS I didn’t see anybody here bitching about arms or balloon payments or any other thing that is available currently Newsflash, we also currently have interest only mortgage loans permalink award report block reply ReleasetheList 2 points 3 days ago No we aren't. FOIA requests show actual deportations, not self deportations or turn aways at the border, to be 145k. 14.5k a month isn't going to cut it. permalink parent award report block reply Morokei 1 points 3 days ago Most self deportations or those choosing not to try to illegally enter in the first place are the result of us having effective deportation.  They count just as much. permalink parent award report block reply Franklymydear 1 points 3 days ago Just getting started - BBB will enhance those rates significantly. permalink parent award report block reply Gnometard 1 points 3 days ago Bro, Facebook and reddit circle jerks say differently. I'm gonna trust retards who say things online instead of thinking for myself permalink parent award report block reply\nReleasetheList 2 points 3 days ago No we aren't. FOIA requests show actual deportations, not self deportations or turn aways at the border, to be 145k. 14.5k a month isn't going to cut it. permalink parent award report block reply Morokei 1 points 3 days ago Most self deportations or those choosing not to try to illegally enter in the first place are the result of us having effective deportation.  They count just as much. permalink parent award report block reply Franklymydear 1 points 3 days ago Just getting started - BBB will enhance those rates significantly. permalink parent award report block reply\nMorokei 1 points 3 days ago Most self deportations or those choosing not to try to illegally enter in the first place are the result of us having effective deportation.  They count just as much. permalink parent award report block reply\nFranklymydear 1 points 3 days ago Just getting started - BBB will enhance those rates significantly. permalink parent award report block reply\nGnometard 1 points 3 days ago Bro, Facebook and reddit circle jerks say differently. I'm gonna trust retards who say things online instead of thinking for myself permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:37:46.210302Z"
}