{
  "id": "1ARK52B9xS",
  "url": "https://patriots.win/p/1ARK52B9xS/our-justice-system-is-completely/c",
  "content": "368 Our \"justice\" system is completely fucking broken. posted 6 days ago by KuzoKevin 25 comments award share report block Matt Van Swol @matt_vanswol • 6d 🚨#BREAKING: Dontaveon Craig who has been arrested a MIND-BOGGLING 51 times (!!!) was just arrested AGAIN yesterday for assaulting woman in Charlotte NC. He was released from jail 10 HOURS AGO!!! WHEN WILL THIS STOP?!!!!!!!!!\n25 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget 1True-translation 20 points 6 days ago Arrest that judge permalink award report block reply HOSEQ 2 points 6 days ago There's a very specific reason why the system is called \"\"The Criminal Justice System\"\"..... The socalled \"\"Justice\"\" it dispenses is CRIMINAL in its nature, an was Intended to be that way.... Politicians have been changing our Actual Justice system for as long as America has existed, an now we have to deal with Crime and Criminals in our own separate ways.... permalink parent award report block reply Magma_Biscuit 16 points 6 days ago When we make hanging great again 👍🏼 permalink award report block reply CleanUpPhillyTrump24 9 points 6 days ago The DOJ has to prosecute Democrat officials. permalink award report block reply Formerlurker92 8 points 6 days ago How disheartening must it be to be a cop, knowing that even if you do your job right the scum will be let right out permalink award report block reply BidenShowerDrool 6 points 6 days ago Cops eventually give up as they know the juice isn't worth the squeeze. Paperwork is a pain so they just let it go, the job becomes demoralizing. permalink parent award report block reply Gnatspeeds 7 points 6 days ago That means it's working permalink award report block reply stylecouncilor 6 points 6 days ago Has he been listed as white everytime too? permalink award report block reply Weezinglvl100 4 points 6 days ago Literally find him and handle him sopranos style. permalink award report block reply Oleander 3 points 6 days ago put him down permalink award report block reply LiteraIIyHitIer 3 points 6 days ago Aw, look at that I-don'-giv-no-fucks expression. He's learned his lesson. Let's give him some raparations! permalink award report block reply patrioticwinning3 3 points 6 days ago When will it stop?  When the people at the top are legally and lawfully arrested, given very fair VERY PUBLIC trials, and publicly executed! permalink award report block reply 2025WhatIsTrue 2 points 6 days ago When will judges be held accountable for their mis-judgement??? permalink award report block reply basedboston 2 points 6 days ago It's all in motherfucking CHARLOTTE ?!? permalink award report block reply Trump454748 2 points 6 days ago Don’t worry, when he finally kills somebody, he’ll get a stern talking to. permalink award report block reply Oleander 2 points 6 days ago fuck these violent nggrs, and fuck everyone involved with making us live around them. fuckers have blood on their hands but at least they got to feel like a good fucking person permalink award report block reply Threebabies 2 points 6 days ago Why dont you bigots just give this poor felonious man a chance? One of these times he will turn his life around /s permalink award report block reply R4B1D 2 points 6 days ago WHEN WILL THIS STOP? when he gets lead poisoning permalink award report block reply FrankDuncan 1 points 6 days ago When lynching comes back permalink award report block reply PatriotSkorzeny 1 points 6 days ago It’s what all LE wants. What’s to understand? permalink award report block reply Induceddrag 1 points 6 days ago Then why do they keep arresting him? permalink parent award report block reply PatriotSkorzeny 1 points 6 days ago Stat boosting. Budget begging. They get to have a crime rate that requires the resources, a low prisoner count at any given time, and job security cause they “need cops to keep crooks off the street.” permalink parent award report block reply Induceddrag 1 points 6 days ago The last thing a law enforcement officer wants is recapturing frequent fliers.  It’s dangerous.  Law enforcement can only arrest.  It’s up to the DA and judiciary to follow through. permalink parent award report block reply PatriotSkorzeny 1 points 6 days ago Coulda fooled me. If they didn’t defend the posterboard shitty DA’s wouldn’t be selected. permalink parent award report block reply\n1True-translation 20 points 6 days ago Arrest that judge permalink award report block reply HOSEQ 2 points 6 days ago There's a very specific reason why the system is called \"\"The Criminal Justice System\"\"..... The socalled \"\"Justice\"\" it dispenses is CRIMINAL in its nature, an was Intended to be that way.... Politicians have been changing our Actual Justice system for as long as America has existed, an now we have to deal with Crime and Criminals in our own separate ways.... permalink parent award report block reply\nHOSEQ 2 points 6 days ago There's a very specific reason why the system is called \"\"The Criminal Justice System\"\"..... The socalled \"\"Justice\"\" it dispenses is CRIMINAL in its nature, an was Intended to be that way.... Politicians have been changing our Actual Justice system for as long as America has existed, an now we have to deal with Crime and Criminals in our own separate ways.... permalink parent award report block reply\nMagma_Biscuit 16 points 6 days ago When we make hanging great again 👍🏼 permalink award report block reply\nCleanUpPhillyTrump24 9 points 6 days ago The DOJ has to prosecute Democrat officials. permalink award report block reply\nFormerlurker92 8 points 6 days ago How disheartening must it be to be a cop, knowing that even if you do your job right the scum will be let right out permalink award report block reply BidenShowerDrool 6 points 6 days ago Cops eventually give up as they know the juice isn't worth the squeeze. Paperwork is a pain so they just let it go, the job becomes demoralizing. permalink parent award report block reply\nBidenShowerDrool 6 points 6 days ago Cops eventually give up as they know the juice isn't worth the squeeze. Paperwork is a pain so they just let it go, the job becomes demoralizing. permalink parent award report block reply\nGnatspeeds 7 points 6 days ago That means it's working permalink award report block reply\nstylecouncilor 6 points 6 days ago Has he been listed as white everytime too? permalink award report block reply\nWeezinglvl100 4 points 6 days ago Literally find him and handle him sopranos style. permalink award report block reply\nOleander 3 points 6 days ago put him down permalink award report block reply\nLiteraIIyHitIer 3 points 6 days ago Aw, look at that I-don'-giv-no-fucks expression. He's learned his lesson. Let's give him some raparations! permalink award report block reply\npatrioticwinning3 3 points 6 days ago When will it stop?  When the people at the top are legally and lawfully arrested, given very fair VERY PUBLIC trials, and publicly executed! permalink award report block reply\n2025WhatIsTrue 2 points 6 days ago When will judges be held accountable for their mis-judgement??? permalink award report block reply\nbasedboston 2 points 6 days ago It's all in motherfucking CHARLOTTE ?!? permalink award report block reply\nTrump454748 2 points 6 days ago Don’t worry, when he finally kills somebody, he’ll get a stern talking to. permalink award report block reply\nOleander 2 points 6 days ago fuck these violent nggrs, and fuck everyone involved with making us live around them. fuckers have blood on their hands but at least they got to feel like a good fucking person permalink award report block reply\nThreebabies 2 points 6 days ago Why dont you bigots just give this poor felonious man a chance? One of these times he will turn his life around /s permalink award report block reply\nR4B1D 2 points 6 days ago WHEN WILL THIS STOP? when he gets lead poisoning permalink award report block reply\nFrankDuncan 1 points 6 days ago When lynching comes back permalink award report block reply\nPatriotSkorzeny 1 points 6 days ago It’s what all LE wants. What’s to understand? permalink award report block reply Induceddrag 1 points 6 days ago Then why do they keep arresting him? permalink parent award report block reply PatriotSkorzeny 1 points 6 days ago Stat boosting. Budget begging. They get to have a crime rate that requires the resources, a low prisoner count at any given time, and job security cause they “need cops to keep crooks off the street.” permalink parent award report block reply Induceddrag 1 points 6 days ago The last thing a law enforcement officer wants is recapturing frequent fliers.  It’s dangerous.  Law enforcement can only arrest.  It’s up to the DA and judiciary to follow through. permalink parent award report block reply PatriotSkorzeny 1 points 6 days ago Coulda fooled me. If they didn’t defend the posterboard shitty DA’s wouldn’t be selected. permalink parent award report block reply\nInduceddrag 1 points 6 days ago Then why do they keep arresting him? permalink parent award report block reply PatriotSkorzeny 1 points 6 days ago Stat boosting. Budget begging. They get to have a crime rate that requires the resources, a low prisoner count at any given time, and job security cause they “need cops to keep crooks off the street.” permalink parent award report block reply Induceddrag 1 points 6 days ago The last thing a law enforcement officer wants is recapturing frequent fliers.  It’s dangerous.  Law enforcement can only arrest.  It’s up to the DA and judiciary to follow through. permalink parent award report block reply PatriotSkorzeny 1 points 6 days ago Coulda fooled me. If they didn’t defend the posterboard shitty DA’s wouldn’t be selected. permalink parent award report block reply\nPatriotSkorzeny 1 points 6 days ago Stat boosting. Budget begging. They get to have a crime rate that requires the resources, a low prisoner count at any given time, and job security cause they “need cops to keep crooks off the street.” permalink parent award report block reply Induceddrag 1 points 6 days ago The last thing a law enforcement officer wants is recapturing frequent fliers.  It’s dangerous.  Law enforcement can only arrest.  It’s up to the DA and judiciary to follow through. permalink parent award report block reply PatriotSkorzeny 1 points 6 days ago Coulda fooled me. If they didn’t defend the posterboard shitty DA’s wouldn’t be selected. permalink parent award report block reply\nInduceddrag 1 points 6 days ago The last thing a law enforcement officer wants is recapturing frequent fliers.  It’s dangerous.  Law enforcement can only arrest.  It’s up to the DA and judiciary to follow through. permalink parent award report block reply PatriotSkorzeny 1 points 6 days ago Coulda fooled me. If they didn’t defend the posterboard shitty DA’s wouldn’t be selected. permalink parent award report block reply\nPatriotSkorzeny 1 points 6 days ago Coulda fooled me. If they didn’t defend the posterboard shitty DA’s wouldn’t be selected. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:37:42.298760Z"
}