{
  "id": "8185740",
  "title": "28‘Operation Dirtbag’: Over 150 Illegal Migrant Sexual Predators Apprehended in Florida(www.thegatew",
  "url": "https://patriots.win/p/1ARK9nPdC4/operation-dirtbag-over-150-illeg/c",
  "content": "29 ‘Operation Dirtbag’: Over 150 Illegal Migrant Sexual Predators Apprehended in Florida (www.thegatewaypundit.com) posted 1 hour ago by rdvs34283 5 comments award share report block 'Operation Dirtbag': Over 150 Illegal Migrant Sexual Predators Apprehended in Florida (Video) | The Gateway Pundit | by Margaret... On Wednesday, Homeland Security Secretary Kristi Noem announced that over 150 illegal migrant sexual predators were nabbed in Florida as part of a sweep she dubbed“Operation Dirtbag.” Secretary Noem also noted that working with the DeSantis admin... www.thegatewaypundit.com\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style snakeoil 2 points 1 hour ago Good job now deport all the H-1B visas holders that are f****** up the middle class and also taking all the gig work on the side. permalink award report block reply GA_Logic 2 points 1 hour ago That is very positive news as Florida has many issues with these predators and traffickers. permalink award report block reply airborne3502 2 points 1 hour ago No complaints here. Good job. 👍 permalink award report block reply redditadminssuckit 1 points 1 hour ago I love to see the same enforcement effort directed at members of Congress and Democrat politicians throughout the country permalink award report block reply rapskull 1 points 1 hour ago Comment removed by community moderators. permalink award report block reply\nsnakeoil 2 points 1 hour ago Good job now deport all the H-1B visas holders that are f****** up the middle class and also taking all the gig work on the side. permalink award report block reply\nGA_Logic 2 points 1 hour ago That is very positive news as Florida has many issues with these predators and traffickers. permalink award report block reply\nairborne3502 2 points 1 hour ago No complaints here. Good job. 👍 permalink award report block reply\nredditadminssuckit 1 points 1 hour ago I love to see the same enforcement effort directed at members of Congress and Democrat politicians throughout the country permalink award report block reply\nrapskull 1 points 1 hour ago Comment removed by community moderators. permalink award report block reply"
}