{
  "id": "1ARK514PCQ",
  "url": "https://patriots.win/p/1ARK514PCQ/eric-trump-is-wholly-pissed-off-/c",
  "content": "771 Eric Trump is ‘wholly pissed off’ about his dad’s assassination attempt investigation: ‘nothing about it looks right’ (www.bizpacreview.com) posted 6 days ago by Sea_Still 40 comments award share report block Eric Trump is ‘wholly p*ssed off’ about his dad’s assassination attempt investigation: ‘nothing about it looks right’ Eric Trump expressed frustration this week over a lack of answers regarding the assassination attempt last year against his father. www.bizpacreview.com\n40 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno YearninNation 46 points 6 days ago Pam Bondi will be the reason Trump's second term will be a spectacular failure that gives vote riggers all the power they need to end the American experiment. permalink award report block reply MAG-n-KAG 16 points 6 days ago From what Ive heard, Pam is Suzy Wiles's pick.  And whatever Suzy wants, Suzy gets.  And Suzy says Pam stays. permalink parent award report block reply DJTXLV 17 points 6 days ago Gen. Flynn has been calling out Suzie. Is she another Judas Pence? permalink parent award report block reply MAG-n-KAG 11 points 6 days ago I believe Trump made deals with the devils to get elected, and he's beholden to them.  And we all know who the devils are. I dont think she's another Pence.  Pence was a spy and had Trump fooled all the way to the end.  I think Trump knows who and what Suzy is, but he's beholden to her and her bosses. permalink parent award report block reply Pepe2016_ivotedfTD -3 points 6 days ago Oh bullshit. permalink parent award report block reply BlackPilledMAGA 2 points 6 days ago Why does Suzy get whatever she wants? What the fuck does she know? FIRE them both! permalink parent award report block reply chickeninoven 2 points 6 days ago I got the district impression during Trump's victory speech that Suzie is not a subordinate. permalink parent award report block reply lash 3 points 6 days ago Who is her boss, motherfucker!? permalink parent award report block reply TheDevilMonkey 2 points 6 days ago This place is a cult filled with npcs. permalink parent award report block reply RedCalifornia -9 points 6 days ago The experiment already ended. The boomers destroyed it. permalink parent award report block reply FKH2 25 points 6 days ago Nothing looks right about Charlie Kirk's assassination either to include the investigation into it or lack there of permalink award report block reply Mobmando 8 points 6 days ago It's also revealed the juice right are our enemy as much as the woke left. We defended them for years but they don't care. permalink parent award report block reply lash 3 points 6 days ago They used americans to fight their war for them for ages. They are masters of usury. permalink parent award report block reply hairless_ap3 -1 points 6 days ago It was the dude in the white shirt about 10 ft away from him to his right permalink parent award report block reply Krat 14 points 6 days ago Imagine how the nation feels with the 0 arrests while democrats managed to hunt down and round up thousands of americans and locked unconstitutionally into cells for years permalink award report block reply MemoryHoleyeO 3 points 6 days ago And gain seats permalink parent award report block reply DJTXLV 12 points 6 days ago Eric is the quiet one. I hope Barron is plotting unyielding revenge. permalink award report block reply ReallyGayMods 11 points 6 days ago Never forget a lot of people on this board ATTACKED YOU for expressing the slighest amount of concern about Pam Bondi and her lack of grit to get this job done. The low IQ bootlickers on this website would call you a doomer, a faggot, try to censor you, \"haha u think u know better than trump?????\" - after trump admitted he sucked at picking good people for the job permalink award report block reply TheDevilMonkey 1 points 6 days ago I remind the faggots that they are NPC level faggots as often as possible. permalink parent award report block reply NewGovModOnDutyBans 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply ElectionMeddler 8 points 6 days ago I want a prior 10 year breakdown on the life of both assassins.  I want the family ties investigated.  Where the money came from.  I want all text messages,  phone records, and online communications scrutinized.  I want the discord logs.  Banks have that info, the NSA already has that info. permalink award report block reply CleanUpPhillyTrump24 7 points 6 days ago Perhaps he can give Kash and Pam a call and get the ball rolling again. permalink award report block reply suckmycorona 4 points 6 days ago Best can do is truth social posts. permalink parent award report block reply Dev404 7 points 6 days ago Kash and Bondi have been two duds so far, going nowhere fast and patting themselves on the back. permalink award report block reply Crappydatum 5 points 6 days ago Where's Bongino? permalink parent award report block reply Gyrfalcon 1 points 6 days ago Removed from relevance. No voice. permalink parent award report block reply Handkerchief 5 points 6 days ago Albert Pikes 3 World Wars permalink award report block reply 0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply BitterRoots 4 points 6 days ago Trump is a master showman. And it takes moolah to run this show. That's why I get bombarded with Trump \"give ne money\" texts.  Trouble is, the show doesn't interest me - results do. Not seeing results.... permalink award report block reply TrumpIsTheVictor 4 points 6 days ago What about the Charlie Kirk assassination? Funny how they accept the BS FBI narrative on that one. permalink award report block reply Crappydatum -2 points 6 days ago So you think it was Mossad? Aliens? FBLie sniper drone? All the above? permalink parent award report block reply Mhmm2MoreWeeks 3 points 6 days ago Well if you think that is bad, Trump cannot fulfill promises because Deep State are killers whom would harm his family. So the only way forward is a far more aggressive leader. Trouble with that is if its anyone even remotely racial, they can only bring and stir chaos. And since the lower IQ people are easy to manipulate with emotions and race, conservatives are facing a real problem. We will unlikely be able to keep MAGA together and moving, let alone take more power and bring more change in future. You can choose. MAGA or HATE JEWS. You cannot have both. Test this as hard as you like. It won't change. permalink award report block reply truthjusticetruth 1 points 6 days ago whynotboth.jgp permalink parent award report block reply MisprisionIsEvil 3 points 6 days ago Trump says he caught them and has it all. Time to use it? Time to get nasty? permalink award report block reply hillaryforprison 3 points 6 days ago Feds were in on it that's why. AG and DOJ is failing big time. permalink award report block reply TheGreenDragon 2 points 6 days ago Oh well, he is the only one that can do something about it and he should start with Pam and Kash and get rid of the Bush Rino Susie Wiles.  Trump is making the same mistakes he made in the admin, all this will drag out for 4 years and no one will be arrested or held accountable and we will have the deep state 2.0 coming down on us. permalink award report block reply AngryPoop 1 points 6 days ago They sure as fuck better get charging people. Because if the trial doesn't complete while he's still in office, the next person in office will just pardon them all. permalink award report block reply NeverArgueWithIdiots 1 points 6 days ago Now do Charlie Kirk permalink award report block reply 0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nYearninNation 46 points 6 days ago Pam Bondi will be the reason Trump's second term will be a spectacular failure that gives vote riggers all the power they need to end the American experiment. permalink award report block reply MAG-n-KAG 16 points 6 days ago From what Ive heard, Pam is Suzy Wiles's pick.  And whatever Suzy wants, Suzy gets.  And Suzy says Pam stays. permalink parent award report block reply DJTXLV 17 points 6 days ago Gen. Flynn has been calling out Suzie. Is she another Judas Pence? permalink parent award report block reply MAG-n-KAG 11 points 6 days ago I believe Trump made deals with the devils to get elected, and he's beholden to them.  And we all know who the devils are. I dont think she's another Pence.  Pence was a spy and had Trump fooled all the way to the end.  I think Trump knows who and what Suzy is, but he's beholden to her and her bosses. permalink parent award report block reply Pepe2016_ivotedfTD -3 points 6 days ago Oh bullshit. permalink parent award report block reply BlackPilledMAGA 2 points 6 days ago Why does Suzy get whatever she wants? What the fuck does she know? FIRE them both! permalink parent award report block reply chickeninoven 2 points 6 days ago I got the district impression during Trump's victory speech that Suzie is not a subordinate. permalink parent award report block reply lash 3 points 6 days ago Who is her boss, motherfucker!? permalink parent award report block reply TheDevilMonkey 2 points 6 days ago This place is a cult filled with npcs. permalink parent award report block reply RedCalifornia -9 points 6 days ago The experiment already ended. The boomers destroyed it. permalink parent award report block reply\nMAG-n-KAG 16 points 6 days ago From what Ive heard, Pam is Suzy Wiles's pick.  And whatever Suzy wants, Suzy gets.  And Suzy says Pam stays. permalink parent award report block reply DJTXLV 17 points 6 days ago Gen. Flynn has been calling out Suzie. Is she another Judas Pence? permalink parent award report block reply MAG-n-KAG 11 points 6 days ago I believe Trump made deals with the devils to get elected, and he's beholden to them.  And we all know who the devils are. I dont think she's another Pence.  Pence was a spy and had Trump fooled all the way to the end.  I think Trump knows who and what Suzy is, but he's beholden to her and her bosses. permalink parent award report block reply Pepe2016_ivotedfTD -3 points 6 days ago Oh bullshit. permalink parent award report block reply BlackPilledMAGA 2 points 6 days ago Why does Suzy get whatever she wants? What the fuck does she know? FIRE them both! permalink parent award report block reply chickeninoven 2 points 6 days ago I got the district impression during Trump's victory speech that Suzie is not a subordinate. permalink parent award report block reply\nDJTXLV 17 points 6 days ago Gen. Flynn has been calling out Suzie. Is she another Judas Pence? permalink parent award report block reply MAG-n-KAG 11 points 6 days ago I believe Trump made deals with the devils to get elected, and he's beholden to them.  And we all know who the devils are. I dont think she's another Pence.  Pence was a spy and had Trump fooled all the way to the end.  I think Trump knows who and what Suzy is, but he's beholden to her and her bosses. permalink parent award report block reply Pepe2016_ivotedfTD -3 points 6 days ago Oh bullshit. permalink parent award report block reply\nMAG-n-KAG 11 points 6 days ago I believe Trump made deals with the devils to get elected, and he's beholden to them.  And we all know who the devils are. I dont think she's another Pence.  Pence was a spy and had Trump fooled all the way to the end.  I think Trump knows who and what Suzy is, but he's beholden to her and her bosses. permalink parent award report block reply Pepe2016_ivotedfTD -3 points 6 days ago Oh bullshit. permalink parent award report block reply\nPepe2016_ivotedfTD -3 points 6 days ago Oh bullshit. permalink parent award report block reply\nBlackPilledMAGA 2 points 6 days ago Why does Suzy get whatever she wants? What the fuck does she know? FIRE them both! permalink parent award report block reply chickeninoven 2 points 6 days ago I got the district impression during Trump's victory speech that Suzie is not a subordinate. permalink parent award report block reply\nchickeninoven 2 points 6 days ago I got the district impression during Trump's victory speech that Suzie is not a subordinate. permalink parent award report block reply\nlash 3 points 6 days ago Who is her boss, motherfucker!? permalink parent award report block reply TheDevilMonkey 2 points 6 days ago This place is a cult filled with npcs. permalink parent award report block reply\nTheDevilMonkey 2 points 6 days ago This place is a cult filled with npcs. permalink parent award report block reply\nRedCalifornia -9 points 6 days ago The experiment already ended. The boomers destroyed it. permalink parent award report block reply\nFKH2 25 points 6 days ago Nothing looks right about Charlie Kirk's assassination either to include the investigation into it or lack there of permalink award report block reply Mobmando 8 points 6 days ago It's also revealed the juice right are our enemy as much as the woke left. We defended them for years but they don't care. permalink parent award report block reply lash 3 points 6 days ago They used americans to fight their war for them for ages. They are masters of usury. permalink parent award report block reply hairless_ap3 -1 points 6 days ago It was the dude in the white shirt about 10 ft away from him to his right permalink parent award report block reply\nMobmando 8 points 6 days ago It's also revealed the juice right are our enemy as much as the woke left. We defended them for years but they don't care. permalink parent award report block reply lash 3 points 6 days ago They used americans to fight their war for them for ages. They are masters of usury. permalink parent award report block reply\nlash 3 points 6 days ago They used americans to fight their war for them for ages. They are masters of usury. permalink parent award report block reply\nhairless_ap3 -1 points 6 days ago It was the dude in the white shirt about 10 ft away from him to his right permalink parent award report block reply\nKrat 14 points 6 days ago Imagine how the nation feels with the 0 arrests while democrats managed to hunt down and round up thousands of americans and locked unconstitutionally into cells for years permalink award report block reply MemoryHoleyeO 3 points 6 days ago And gain seats permalink parent award report block reply\nMemoryHoleyeO 3 points 6 days ago And gain seats permalink parent award report block reply\nDJTXLV 12 points 6 days ago Eric is the quiet one. I hope Barron is plotting unyielding revenge. permalink award report block reply\nReallyGayMods 11 points 6 days ago Never forget a lot of people on this board ATTACKED YOU for expressing the slighest amount of concern about Pam Bondi and her lack of grit to get this job done. The low IQ bootlickers on this website would call you a doomer, a faggot, try to censor you, \"haha u think u know better than trump?????\" - after trump admitted he sucked at picking good people for the job permalink award report block reply TheDevilMonkey 1 points 6 days ago I remind the faggots that they are NPC level faggots as often as possible. permalink parent award report block reply NewGovModOnDutyBans 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTheDevilMonkey 1 points 6 days ago I remind the faggots that they are NPC level faggots as often as possible. permalink parent award report block reply\nNewGovModOnDutyBans 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nElectionMeddler 8 points 6 days ago I want a prior 10 year breakdown on the life of both assassins.  I want the family ties investigated.  Where the money came from.  I want all text messages,  phone records, and online communications scrutinized.  I want the discord logs.  Banks have that info, the NSA already has that info. permalink award report block reply\nCleanUpPhillyTrump24 7 points 6 days ago Perhaps he can give Kash and Pam a call and get the ball rolling again. permalink award report block reply suckmycorona 4 points 6 days ago Best can do is truth social posts. permalink parent award report block reply\nsuckmycorona 4 points 6 days ago Best can do is truth social posts. permalink parent award report block reply\nDev404 7 points 6 days ago Kash and Bondi have been two duds so far, going nowhere fast and patting themselves on the back. permalink award report block reply Crappydatum 5 points 6 days ago Where's Bongino? permalink parent award report block reply Gyrfalcon 1 points 6 days ago Removed from relevance. No voice. permalink parent award report block reply\nCrappydatum 5 points 6 days ago Where's Bongino? permalink parent award report block reply Gyrfalcon 1 points 6 days ago Removed from relevance. No voice. permalink parent award report block reply\nGyrfalcon 1 points 6 days ago Removed from relevance. No voice. permalink parent award report block reply\nHandkerchief 5 points 6 days ago Albert Pikes 3 World Wars permalink award report block reply 0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\n0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nBitterRoots 4 points 6 days ago Trump is a master showman. And it takes moolah to run this show. That's why I get bombarded with Trump \"give ne money\" texts.  Trouble is, the show doesn't interest me - results do. Not seeing results.... permalink award report block reply\nTrumpIsTheVictor 4 points 6 days ago What about the Charlie Kirk assassination? Funny how they accept the BS FBI narrative on that one. permalink award report block reply Crappydatum -2 points 6 days ago So you think it was Mossad? Aliens? FBLie sniper drone? All the above? permalink parent award report block reply\nCrappydatum -2 points 6 days ago So you think it was Mossad? Aliens? FBLie sniper drone? All the above? permalink parent award report block reply\nMhmm2MoreWeeks 3 points 6 days ago Well if you think that is bad, Trump cannot fulfill promises because Deep State are killers whom would harm his family. So the only way forward is a far more aggressive leader. Trouble with that is if its anyone even remotely racial, they can only bring and stir chaos. And since the lower IQ people are easy to manipulate with emotions and race, conservatives are facing a real problem. We will unlikely be able to keep MAGA together and moving, let alone take more power and bring more change in future. You can choose. MAGA or HATE JEWS. You cannot have both. Test this as hard as you like. It won't change. permalink award report block reply truthjusticetruth 1 points 6 days ago whynotboth.jgp permalink parent award report block reply\ntruthjusticetruth 1 points 6 days ago whynotboth.jgp permalink parent award report block reply\nMisprisionIsEvil 3 points 6 days ago Trump says he caught them and has it all. Time to use it? Time to get nasty? permalink award report block reply\nhillaryforprison 3 points 6 days ago Feds were in on it that's why. AG and DOJ is failing big time. permalink award report block reply\nTheGreenDragon 2 points 6 days ago Oh well, he is the only one that can do something about it and he should start with Pam and Kash and get rid of the Bush Rino Susie Wiles.  Trump is making the same mistakes he made in the admin, all this will drag out for 4 years and no one will be arrested or held accountable and we will have the deep state 2.0 coming down on us. permalink award report block reply\nAngryPoop 1 points 6 days ago They sure as fuck better get charging people. Because if the trial doesn't complete while he's still in office, the next person in office will just pardon them all. permalink award report block reply\nNeverArgueWithIdiots 1 points 6 days ago Now do Charlie Kirk permalink award report block reply\n0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T21:03:01.046516Z"
}