{
  "id": "1ARK52Bi3c",
  "url": "https://patriots.win/p/1ARK52Bi3c/karoline-leavitt-\nthis-is-what-/c",
  "content": "911 Karoline Leavitt: \nThis is what we are up against! posted 6 days ago by I-am-Orlando PRO 35 comments award share download report block\n35 comments Sort by Top Top New Worst Old Save Deplorable_Yankee 44 points 6 days ago I’m still with Trump but I have a suggestion for him. Perhaps stop worrying about every other country and crack some freaking skulls in Washington DC. You are never going to appease the left snd reconcile the public discourse. EVER. STOP BEING NICE. permalink award report block reply PlzDontSuicideMe 28 points 6 days ago Hey crazy idea maybe repeal the 2012 Smith-Mudnt Act… permalink award report block reply Repentnow 1 points 6 days ago Neither the Smith-Mundt Act nor the Smith-Mundt Modernization Act have anything to do with media bias. permalink parent award report block reply deleted 17 points 6 days ago PeterThielAntiChrist 2 points 6 days ago TRUMP HIMSELF SAYS ITS THE REPUBLICANS FAULT. permalink parent award report block reply FBIAREFAGGOTS 13 points 6 days ago You don't hate the media enough. permalink award report block reply PeterThielAntiChrist -5 points 6 days ago TRUMP HIMSELF SAYS ITS THE REPUBLICANS FAULT. permalink parent award report block reply rickroshi 3 points 6 days ago he is referring to getting rid of the filibuster, this shut down is 100% on dems who voted 13x against a clean continuing resolution bill. permalink parent award report block reply PeterThielAntiChrist 0 points 6 days ago yes i know permalink parent award report block reply Greenhills 13 points 6 days ago Why do republicans care what opinion democrat voters who would vote blue no matter who think of the shutdown? permalink award report block reply newuser8 5 points 6 days ago I don't know one MAGA person who turns on the news. His base is not watching that shit permalink parent award report block reply FightTheSWAMP 2 points 6 days ago Because it's not just them. Believe it or not, there are still plenty of people who don't pay attention to politics/news. They don't pay enough attention to know the media is lying about everything. If they happen to stumble on ABC talking about Republicans shutting down the government, these people don't know any better. permalink parent award report block reply I-am-Orlando OP PRO 9 points 6 days ago Link https://x.com/PressSec/status/1986509121751789710 permalink award report block reply CleanUpPhillyTrump24 6 points 6 days ago Welp Team Trump you guys probably need to do something about that. Such as for example getting our FCC to act. permalink award report block reply pedespeed 5 points 6 days ago Why are they complaining like they are powerless? Can't they repeal the smith-mundt modernization act. permalink award report block reply PedeInADeepBlueSea 2 points 6 days ago Is the government still shut down? I didn't notice (Or at least I wouldn't have if I didn't visit this site so often) permalink award report block reply Stormeyworld13 2 points 6 days ago They need to revoke the licenses of the fake news media. Take them off the air. They are domestic terrorists because they incite violence, create hate and divide the country. They lie about everything. It's time to remove propaganda tv. permalink award report block reply LolitaExpressPilot 2 points 6 days ago And? They knew this all along. Make it impossible for the media to control the narrative. Where are the awesome antics of the Trump campaign to get the message out? permalink award report block reply knnbccb 2 points 6 days ago Precisely, they are not journalists, they are not the Fourth Estate. A little courage and some armed soldiers can end them overnight. permalink award report block reply SnowSnake 2 points 6 days ago My boomer mom thinks the shutdown is Trump's fault. So I mentioned the 60 votes thing in the senate and how after 16+ attempts, all 53 repubs voted yes, and the dims always vote no. I asked her how is that Trump's and the republican's fault?? Her face did the blue-screen-buffering thing. While she was processing I said, the news isn't the news, it's lies. You're parroting bullshit you heard someone else say. Someone with an agenda to omit the whole truth and cultivate fake outrage. permalink award report block reply Smurfection 1 points 6 days ago TheNews™ permalink award report block reply 2FBIAgents1Cup 1 points 6 days ago Hey Karoline.... Smith-Mundt.... permalink award report block reply keeptherepublic1776 1 points 6 days ago Omfg. Hey Blondie go tell your boss to do something. What you ask? Ban big pharma ads number one. permalink award report block reply yummy_yumm_yumms 2 points 6 days ago Am I imagining it or wasnt that supposed to already happen? permalink parent award report block reply SHILL_DETECTOR 1 points 6 days ago THIS!!!!! that would bankrupt them instantly permalink parent award report block reply imnotdeadyet 2 points 6 days ago And cable news! permalink parent award report block reply justinkayz 1 points 6 days ago So what ever happened to banning big pharma ads on television? Oh that's right, big pharma has been hanging around DC a lot lately. permalink award report block reply SALTY-OGRE 1 points 5 days ago Then change the FUCKING LAW on THE USE OF PROPAGANDA on the AMERICAN PUBLIC. This country is LOST AND TRUMP IS LOSING 3 years left and nothing will happen permalink award report block reply FrankDuncan 1 points 6 days ago Smith Mundt permalink award report block reply 2025WhatIsTrue 1 points 6 days ago You just despise the \"media\" enough.  They are sociopathic. permalink award report block reply MarshallB 1 points 6 days ago The Legacy Media. But finally some hope at CBS. Of course our local CBS Broadcaster switched to FOX awhile back. permalink award report block reply grenades_and_ham 1 points 6 days ago Try and keep up please. permalink award report block reply tuaris 0 points 6 days ago Nothing will change for the republican party so long as the news that people receive is bias.  Optics matter even if you don't care about optics. permalink award report block reply PatriotSkorzeny -1 points 6 days ago Wat? We control allll LE. Nothin. 🤣🤡 permalink award report block reply PeterThielAntiChrist -2 points 6 days ago TRUMP HIMSELF SAYS ITS THE REPUBLICANS FAULT. permalink award report block reply\nDeplorable_Yankee 44 points 6 days ago I’m still with Trump but I have a suggestion for him. Perhaps stop worrying about every other country and crack some freaking skulls in Washington DC. You are never going to appease the left snd reconcile the public discourse. EVER. STOP BEING NICE. permalink award report block reply\nPlzDontSuicideMe 28 points 6 days ago Hey crazy idea maybe repeal the 2012 Smith-Mudnt Act… permalink award report block reply Repentnow 1 points 6 days ago Neither the Smith-Mundt Act nor the Smith-Mundt Modernization Act have anything to do with media bias. permalink parent award report block reply\nRepentnow 1 points 6 days ago Neither the Smith-Mundt Act nor the Smith-Mundt Modernization Act have anything to do with media bias. permalink parent award report block reply\ndeleted 17 points 6 days ago PeterThielAntiChrist 2 points 6 days ago TRUMP HIMSELF SAYS ITS THE REPUBLICANS FAULT. permalink parent award report block reply\nPeterThielAntiChrist 2 points 6 days ago TRUMP HIMSELF SAYS ITS THE REPUBLICANS FAULT. permalink parent award report block reply\nFBIAREFAGGOTS 13 points 6 days ago You don't hate the media enough. permalink award report block reply PeterThielAntiChrist -5 points 6 days ago TRUMP HIMSELF SAYS ITS THE REPUBLICANS FAULT. permalink parent award report block reply rickroshi 3 points 6 days ago he is referring to getting rid of the filibuster, this shut down is 100% on dems who voted 13x against a clean continuing resolution bill. permalink parent award report block reply PeterThielAntiChrist 0 points 6 days ago yes i know permalink parent award report block reply\nPeterThielAntiChrist -5 points 6 days ago TRUMP HIMSELF SAYS ITS THE REPUBLICANS FAULT. permalink parent award report block reply rickroshi 3 points 6 days ago he is referring to getting rid of the filibuster, this shut down is 100% on dems who voted 13x against a clean continuing resolution bill. permalink parent award report block reply PeterThielAntiChrist 0 points 6 days ago yes i know permalink parent award report block reply\nrickroshi 3 points 6 days ago he is referring to getting rid of the filibuster, this shut down is 100% on dems who voted 13x against a clean continuing resolution bill. permalink parent award report block reply PeterThielAntiChrist 0 points 6 days ago yes i know permalink parent award report block reply\nPeterThielAntiChrist 0 points 6 days ago yes i know permalink parent award report block reply\nGreenhills 13 points 6 days ago Why do republicans care what opinion democrat voters who would vote blue no matter who think of the shutdown? permalink award report block reply newuser8 5 points 6 days ago I don't know one MAGA person who turns on the news. His base is not watching that shit permalink parent award report block reply FightTheSWAMP 2 points 6 days ago Because it's not just them. Believe it or not, there are still plenty of people who don't pay attention to politics/news. They don't pay enough attention to know the media is lying about everything. If they happen to stumble on ABC talking about Republicans shutting down the government, these people don't know any better. permalink parent award report block reply\nnewuser8 5 points 6 days ago I don't know one MAGA person who turns on the news. His base is not watching that shit permalink parent award report block reply\nFightTheSWAMP 2 points 6 days ago Because it's not just them. Believe it or not, there are still plenty of people who don't pay attention to politics/news. They don't pay enough attention to know the media is lying about everything. If they happen to stumble on ABC talking about Republicans shutting down the government, these people don't know any better. permalink parent award report block reply\nI-am-Orlando OP PRO 9 points 6 days ago Link https://x.com/PressSec/status/1986509121751789710 permalink award report block reply\nCleanUpPhillyTrump24 6 points 6 days ago Welp Team Trump you guys probably need to do something about that. Such as for example getting our FCC to act. permalink award report block reply\npedespeed 5 points 6 days ago Why are they complaining like they are powerless? Can't they repeal the smith-mundt modernization act. permalink award report block reply\nPedeInADeepBlueSea 2 points 6 days ago Is the government still shut down? I didn't notice (Or at least I wouldn't have if I didn't visit this site so often) permalink award report block reply\nStormeyworld13 2 points 6 days ago They need to revoke the licenses of the fake news media. Take them off the air. They are domestic terrorists because they incite violence, create hate and divide the country. They lie about everything. It's time to remove propaganda tv. permalink award report block reply\nLolitaExpressPilot 2 points 6 days ago And? They knew this all along. Make it impossible for the media to control the narrative. Where are the awesome antics of the Trump campaign to get the message out? permalink award report block reply\nknnbccb 2 points 6 days ago Precisely, they are not journalists, they are not the Fourth Estate. A little courage and some armed soldiers can end them overnight. permalink award report block reply\nSnowSnake 2 points 6 days ago My boomer mom thinks the shutdown is Trump's fault. So I mentioned the 60 votes thing in the senate and how after 16+ attempts, all 53 repubs voted yes, and the dims always vote no. I asked her how is that Trump's and the republican's fault?? Her face did the blue-screen-buffering thing. While she was processing I said, the news isn't the news, it's lies. You're parroting bullshit you heard someone else say. Someone with an agenda to omit the whole truth and cultivate fake outrage. permalink award report block reply\nSmurfection 1 points 6 days ago TheNews™ permalink award report block reply\n2FBIAgents1Cup 1 points 6 days ago Hey Karoline.... Smith-Mundt.... permalink award report block reply\nkeeptherepublic1776 1 points 6 days ago Omfg. Hey Blondie go tell your boss to do something. What you ask? Ban big pharma ads number one. permalink award report block reply yummy_yumm_yumms 2 points 6 days ago Am I imagining it or wasnt that supposed to already happen? permalink parent award report block reply SHILL_DETECTOR 1 points 6 days ago THIS!!!!! that would bankrupt them instantly permalink parent award report block reply imnotdeadyet 2 points 6 days ago And cable news! permalink parent award report block reply\nyummy_yumm_yumms 2 points 6 days ago Am I imagining it or wasnt that supposed to already happen? permalink parent award report block reply\nSHILL_DETECTOR 1 points 6 days ago THIS!!!!! that would bankrupt them instantly permalink parent award report block reply imnotdeadyet 2 points 6 days ago And cable news! permalink parent award report block reply\nimnotdeadyet 2 points 6 days ago And cable news! permalink parent award report block reply\njustinkayz 1 points 6 days ago So what ever happened to banning big pharma ads on television? Oh that's right, big pharma has been hanging around DC a lot lately. permalink award report block reply\nSALTY-OGRE 1 points 5 days ago Then change the FUCKING LAW on THE USE OF PROPAGANDA on the AMERICAN PUBLIC. This country is LOST AND TRUMP IS LOSING 3 years left and nothing will happen permalink award report block reply\nFrankDuncan 1 points 6 days ago Smith Mundt permalink award report block reply\n2025WhatIsTrue 1 points 6 days ago You just despise the \"media\" enough.  They are sociopathic. permalink award report block reply\nMarshallB 1 points 6 days ago The Legacy Media. But finally some hope at CBS. Of course our local CBS Broadcaster switched to FOX awhile back. permalink award report block reply\ngrenades_and_ham 1 points 6 days ago Try and keep up please. permalink award report block reply\ntuaris 0 points 6 days ago Nothing will change for the republican party so long as the news that people receive is bias.  Optics matter even if you don't care about optics. permalink award report block reply\nPatriotSkorzeny -1 points 6 days ago Wat? We control allll LE. Nothin. 🤣🤡 permalink award report block reply\nPeterThielAntiChrist -2 points 6 days ago TRUMP HIMSELF SAYS ITS THE REPUBLICANS FAULT. permalink award report block reply",
  "fetched_at": "2025-11-12T20:55:31.922086Z"
}