{
  "id": "1ARK56kOKf",
  "url": "https://patriots.win/p/1ARK56kOKf/one-way-or-another-thune-and-by-/c",
  "content": "303 One way or another Thune (and by extension, the US) is getting screwed by the the Dems. He is going to cave. You know it and I know it. If they had any balls they would kill the filibuster and pass the MAGA agenda before it's too late! posted 4 days ago by Counterwhat 12 comments award share download report block\n12 comments Sort by Top Top New Worst Old Save Taupkek 8 points 4 days ago It isn't about balls and it isn't about intelligence. It's about money. Reps NEED the filibuster in place. That way they can say, \"look, we tried but the evil dems were too strong. Send us more money so we can get 'em next time!\" It's ALWAYS about money. permalink award report block reply MastaJoda 6 points 4 days ago ☝THIS Fuck OPs ''Poor porr widdle Thune. Its the muh evil Democrats fault.'' That shits been played tf out over the last 30+ yrs. Fuck the RINOs who are purposeful losers for us but winners for their personal wealth and donors. The RINO Party fucking HATES conservative Americans to our core. This isnt even up for debate anymore, at all. permalink parent award report block reply Calumet57 6 points 4 days ago Name the most GOP accomplishment, or any accomplishment of Thune.  Don't worry, there's no buzzer, go ahead and research. permalink award report block reply MastaJoda 2 points 4 days ago 🎯 permalink parent award report block reply trumpORbust 3 points 4 days ago Yes - and they can put the fillabuster back when they are done with codifying AF permalink award report block reply BrokenWolf2022 2 points 4 days ago Nah, keep the filibuster. It just gets us closer to a shooting war. permalink award report block reply Deplorable556 2 points 4 days ago thune wearing a headlight to locate democrats micropeen permalink award report block reply rugburnd 1 points 4 days ago Head light! I see what you did there! permalink parent award report block reply Counterwhat OP 0 points 4 days ago Lol permalink parent award report block reply Greenhills 2 points 4 days ago It just doesn’t make sense. Why would Schumer hold the government hostage to make healthcare artificially cheaper when making it more expensive would fuck the republicans in the midterms???? permalink award report block reply Counterwhat OP 2 points 4 days ago Good point. It's a show. They did it to get the thei \"Emotionally driven\" constituency to the polls. They played their base like a piano., and still, the Dems torture their base over illegals. permalink parent award report block reply\nTaupkek 8 points 4 days ago It isn't about balls and it isn't about intelligence. It's about money. Reps NEED the filibuster in place. That way they can say, \"look, we tried but the evil dems were too strong. Send us more money so we can get 'em next time!\" It's ALWAYS about money. permalink award report block reply MastaJoda 6 points 4 days ago ☝THIS Fuck OPs ''Poor porr widdle Thune. Its the muh evil Democrats fault.'' That shits been played tf out over the last 30+ yrs. Fuck the RINOs who are purposeful losers for us but winners for their personal wealth and donors. The RINO Party fucking HATES conservative Americans to our core. This isnt even up for debate anymore, at all. permalink parent award report block reply\nMastaJoda 6 points 4 days ago ☝THIS Fuck OPs ''Poor porr widdle Thune. Its the muh evil Democrats fault.'' That shits been played tf out over the last 30+ yrs. Fuck the RINOs who are purposeful losers for us but winners for their personal wealth and donors. The RINO Party fucking HATES conservative Americans to our core. This isnt even up for debate anymore, at all. permalink parent award report block reply\nCalumet57 6 points 4 days ago Name the most GOP accomplishment, or any accomplishment of Thune.  Don't worry, there's no buzzer, go ahead and research. permalink award report block reply MastaJoda 2 points 4 days ago 🎯 permalink parent award report block reply\nMastaJoda 2 points 4 days ago 🎯 permalink parent award report block reply\ntrumpORbust 3 points 4 days ago Yes - and they can put the fillabuster back when they are done with codifying AF permalink award report block reply\nBrokenWolf2022 2 points 4 days ago Nah, keep the filibuster. It just gets us closer to a shooting war. permalink award report block reply\nDeplorable556 2 points 4 days ago thune wearing a headlight to locate democrats micropeen permalink award report block reply rugburnd 1 points 4 days ago Head light! I see what you did there! permalink parent award report block reply Counterwhat OP 0 points 4 days ago Lol permalink parent award report block reply\nrugburnd 1 points 4 days ago Head light! I see what you did there! permalink parent award report block reply\nCounterwhat OP 0 points 4 days ago Lol permalink parent award report block reply\nGreenhills 2 points 4 days ago It just doesn’t make sense. Why would Schumer hold the government hostage to make healthcare artificially cheaper when making it more expensive would fuck the republicans in the midterms???? permalink award report block reply Counterwhat OP 2 points 4 days ago Good point. It's a show. They did it to get the thei \"Emotionally driven\" constituency to the polls. They played their base like a piano., and still, the Dems torture their base over illegals. permalink parent award report block reply\nCounterwhat OP 2 points 4 days ago Good point. It's a show. They did it to get the thei \"Emotionally driven\" constituency to the polls. They played their base like a piano., and still, the Dems torture their base over illegals. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:13:28.350382Z"
}