{
  "id": "8184866",
  "title": "521Do the Republicans in the Senate realize how fed up we are with their f'ucken a'sses. \n\nJohn Thun",
  "url": "https://patriots.win/p/1ARK9mHVrC/do-the-republicans-in-the-senate/c",
  "content": "522 Do the Republicans in the Senate realize how fed up we are with their f'ucken a'sses. \n\nJohn Thune isn't doing s'hit and Rand Paul is for all practical purposes a Democrat now.\n\nThrow all these bums out if they don't end the filibuster.... every last one, who's with me posted 8 hours ago by StopCorruptionDC 35 comments award share report block @Chicago1Ray 🇺🇸 @Chicago1Ray • 5d Do the Republicans in the Senate realize how fed up we are with their f'ucken a'sses John Thune isn't doing s'hit and Rand Paul is for all practical purposes a Democrat now Throw all these bums out if they don't end the filibuster.... every last one, who's with me\n35 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back I No Matter How Severe The Baldness is HaloGrow RedStoneDeepState 16 points 7 hours ago Rand Paul wants to keep the government shut. I support Rand Paul for that. permalink award report block reply Immafancyboy 11 points 5 hours ago I’m sorry is Rand Paul trying hand out a half million H1-Bs or pass hate speech laws? No. Trumps faggot neocon friends are. permalink parent award report block reply CocaineNewsome 5 points 4 hours ago Rand Paul was the only one blocking the weed ban. Uniparty gotta have it's taxes in mostly blue states. permalink parent award report block reply Tombstone2W 2 points 5 hours ago Sometimes I despise Rand, sometimes I like him. He's not his father but sometimes he lands on the correct side. permalink parent award report block reply the-new-style 10 points 8 hours ago What are you gonna do about it? Vote Democrat? permalink award report block reply Scumbag-reddit 8 points 7 hours ago Based on many shill comments here, that's exactly what they are trying to do...portray Trump as some turncoat and pretend like he's the bad guy doing what democrats would do so might as well vote blue. Pathetic messaging, like it's going to actually do some damage. Gotta be retarded to fall for it permalink parent award report block reply DontTreadOnLego 2 points 4 hours ago Primary them. permalink parent award report block reply Smurfection 1 points 3 hours ago yeah, that's what GOPe said to us conservative voters for decades.  \"you have to vote for us because the alternative is worse\" but it's also the reason why so many conservatives stayed home instead of voting at all. permalink parent award report block reply Yaemz123 8 points 6 hours ago Rand Paul voted against Biden's last budget. The C.R. reopens the government under Biden's last budget. Rand Paul again voted against it.  Be aware. Every Republican blow-hard who originally bloviated about Biden's budget and now voted in favor of it is lying to you. Why do people not understand simple things like this? permalink award report block reply stealthboy 6 points 7 hours ago Who cares?  It's all one big uniparty.  None of this matters. permalink award report block reply PhantomShield72 4 points 6 hours ago It's the only thing that matters in terms of where this country is headed, but people would rather watch grown men play schoolyard sports than focus on the people destroying their lives. permalink parent award report block reply rebuildingMyself 5 points 6 hours ago They WANT to lose so they can sit in the background and complain about how Democrats are destroying everything and to send them money. It's clear they aren't MAGA and what happened was essentially a populist revolt that took over the leadership of the party, but the Uniparty RINOs are riding coattails when talk is cheap (campaigning) but refuse to go along with anything when it is time for action. What is needed is more than just winning the presidency, which in the current system just means RINOs joining the other side just enough to prevent proper bills from going forward or activist judges stalling everything with bullshit rulings. It requires a Congress full of MAGA and zero tolerance for RINO bullshit. As we saw in South America it takes more than an election victory. It required dismantling the cancer in the judicial branch, for example. permalink award report block reply BobrobC 4 points 6 hours ago Thats what happens when you put your faith in people. They will change over time. Put your faith in Jesus and let him show you how it's done right. permalink award report block reply Scot 3 points 7 hours ago I've want to throw them all out since the 1980s permalink award report block reply I_Love_45-70_Gov 3 points 5 hours ago Rand Paul has been a democrat (communist) for well over a decade. permalink award report block reply PhantomShield72 2 points 6 hours ago These people give zero fucks about us and they know they will face zero consequences for anything they do or don't do because they aren't beholden to the US Citizen Voter. permalink award report block reply Rucktoe 2 points 6 hours ago Probably, the thing is...they don't care because there has never been any accountability. permalink award report block reply yummy_yumm_yumms 1 points 3 hours ago Yes they do, and they just don't give a fuck, as usual. permalink award report block reply finnigan 1 points 6 hours ago They know, they just don't care.  Only donors matter to keep the grift going. permalink award report block reply MemoryHoleyeO 1 points 5 hours ago They'll throw out the filibuster and then do nothing until Dems when house and Senate and say, trump's fault. And then go full rino retard permalink award report block reply RandyMoss 1 points 5 hours ago Rand Paul is the only MAGA Senator. He voted against the Biden budget. permalink award report block reply Butttoucha9k 1 points 51 minutes ago What happens when the filibuster is gone? permalink award report block reply Female 1 points 8 hours ago Anti republican maga rally but no feds this time. Free drinks for attendees permalink award report block reply Carmen1956 1 points 7 hours ago I’m with you but it probably won’t change anything! permalink award report block reply PepePinochet 1 points 7 hours ago Idk, I was cook with keeping the government shuttered permalink award report block reply greatpumpkin 1 points 1 hour ago Thune is McConnell's lapdog.  He does as he's told. Want something different?  Pressure McConnell. permalink award report block reply Smurfection 1 points 3 hours ago It won't do us any good to end the filibuster if we don't immediately pass Voter ID laws and end H1B visas and clamp down more on legal and illegal immigration. permalink award report block reply Returningtogod 1 points 4 hours ago THEY DON’T CARE. permalink award report block reply nonrate 1 points 5 hours ago Rand is not a democrat, lol. He opposed opening the government because there is still unnecessary spending in it. Democrats wanted to make sure we were printing new dollars and spending them on useless things. Government shutdown should have gone on longer, I am with Rand on this one. permalink award report block reply DCYR66 1 points 2 hours ago Rand Paul needs a good barber! permalink award report block reply Unboosted 1 points 4 hours ago Throw out how? Voting? Dont make me laugh. Seriously, throw out how? permalink award report block reply starjello 1 points 3 hours ago The republicans in the senate don't care. Their response to you is \"what are you going to fuckin do about it.\" permalink award report block reply someguy7738 1 points 2 hours ago End the filibuster for what? What do you think is going to happen without it? All of a sudden the spineless faggot GOP neocons and MIGA traitors are going to put America first? Why would they do that? The problem isn't that they don't have the power to implement an America first agenda, it's that they don't want to. permalink award report block reply PowerOfBlues 0 points 2 hours ago Red State faggots here yell \"build a wall around New York and don't let anybody out\"..... meanwhile their GOP Senators and Congressmen are worthless kid fuckers.....and their own cities are filled with even trashier Honey Boo Boo blue haired Tik Tokers permalink award report block reply _2022_ 0 points 7 hours ago I wonder why there’s an undercurrent of previously dedicated Republican voters checking out. Weird. permalink award report block reply TrumpBetrays247 1 points 1 hour ago Comment removed by community filter, pending further review. permalink award report block reply\nRedStoneDeepState 16 points 7 hours ago Rand Paul wants to keep the government shut. I support Rand Paul for that. permalink award report block reply Immafancyboy 11 points 5 hours ago I’m sorry is Rand Paul trying hand out a half million H1-Bs or pass hate speech laws? No. Trumps faggot neocon friends are. permalink parent award report block reply CocaineNewsome 5 points 4 hours ago Rand Paul was the only one blocking the weed ban. Uniparty gotta have it's taxes in mostly blue states. permalink parent award report block reply Tombstone2W 2 points 5 hours ago Sometimes I despise Rand, sometimes I like him. He's not his father but sometimes he lands on the correct side. permalink parent award report block reply\nImmafancyboy 11 points 5 hours ago I’m sorry is Rand Paul trying hand out a half million H1-Bs or pass hate speech laws? No. Trumps faggot neocon friends are. permalink parent award report block reply CocaineNewsome 5 points 4 hours ago Rand Paul was the only one blocking the weed ban. Uniparty gotta have it's taxes in mostly blue states. permalink parent award report block reply\nCocaineNewsome 5 points 4 hours ago Rand Paul was the only one blocking the weed ban. Uniparty gotta have it's taxes in mostly blue states. permalink parent award report block reply\nTombstone2W 2 points 5 hours ago Sometimes I despise Rand, sometimes I like him. He's not his father but sometimes he lands on the correct side. permalink parent award report block reply\nthe-new-style 10 points 8 hours ago What are you gonna do about it? Vote Democrat? permalink award report block reply Scumbag-reddit 8 points 7 hours ago Based on many shill comments here, that's exactly what they are trying to do...portray Trump as some turncoat and pretend like he's the bad guy doing what democrats would do so might as well vote blue. Pathetic messaging, like it's going to actually do some damage. Gotta be retarded to fall for it permalink parent award report block reply DontTreadOnLego 2 points 4 hours ago Primary them. permalink parent award report block reply Smurfection 1 points 3 hours ago yeah, that's what GOPe said to us conservative voters for decades.  \"you have to vote for us because the alternative is worse\" but it's also the reason why so many conservatives stayed home instead of voting at all. permalink parent award report block reply\nScumbag-reddit 8 points 7 hours ago Based on many shill comments here, that's exactly what they are trying to do...portray Trump as some turncoat and pretend like he's the bad guy doing what democrats would do so might as well vote blue. Pathetic messaging, like it's going to actually do some damage. Gotta be retarded to fall for it permalink parent award report block reply\nDontTreadOnLego 2 points 4 hours ago Primary them. permalink parent award report block reply\nSmurfection 1 points 3 hours ago yeah, that's what GOPe said to us conservative voters for decades.  \"you have to vote for us because the alternative is worse\" but it's also the reason why so many conservatives stayed home instead of voting at all. permalink parent award report block reply\nYaemz123 8 points 6 hours ago Rand Paul voted against Biden's last budget. The C.R. reopens the government under Biden's last budget. Rand Paul again voted against it.  Be aware. Every Republican blow-hard who originally bloviated about Biden's budget and now voted in favor of it is lying to you. Why do people not understand simple things like this? permalink award report block reply\nstealthboy 6 points 7 hours ago Who cares?  It's all one big uniparty.  None of this matters. permalink award report block reply PhantomShield72 4 points 6 hours ago It's the only thing that matters in terms of where this country is headed, but people would rather watch grown men play schoolyard sports than focus on the people destroying their lives. permalink parent award report block reply\nPhantomShield72 4 points 6 hours ago It's the only thing that matters in terms of where this country is headed, but people would rather watch grown men play schoolyard sports than focus on the people destroying their lives. permalink parent award report block reply\nrebuildingMyself 5 points 6 hours ago They WANT to lose so they can sit in the background and complain about how Democrats are destroying everything and to send them money. It's clear they aren't MAGA and what happened was essentially a populist revolt that took over the leadership of the party, but the Uniparty RINOs are riding coattails when talk is cheap (campaigning) but refuse to go along with anything when it is time for action. What is needed is more than just winning the presidency, which in the current system just means RINOs joining the other side just enough to prevent proper bills from going forward or activist judges stalling everything with bullshit rulings. It requires a Congress full of MAGA and zero tolerance for RINO bullshit. As we saw in South America it takes more than an election victory. It required dismantling the cancer in the judicial branch, for example. permalink award report block reply\nBobrobC 4 points 6 hours ago Thats what happens when you put your faith in people. They will change over time. Put your faith in Jesus and let him show you how it's done right. permalink award report block reply\nScot 3 points 7 hours ago I've want to throw them all out since the 1980s permalink award report block reply\nI_Love_45-70_Gov 3 points 5 hours ago Rand Paul has been a democrat (communist) for well over a decade. permalink award report block reply\nPhantomShield72 2 points 6 hours ago These people give zero fucks about us and they know they will face zero consequences for anything they do or don't do because they aren't beholden to the US Citizen Voter. permalink award report block reply\nRucktoe 2 points 6 hours ago Probably, the thing is...they don't care because there has never been any accountability. permalink award report block reply\nyummy_yumm_yumms 1 points 3 hours ago Yes they do, and they just don't give a fuck, as usual. permalink award report block reply\nfinnigan 1 points 6 hours ago They know, they just don't care.  Only donors matter to keep the grift going. permalink award report block reply\nMemoryHoleyeO 1 points 5 hours ago They'll throw out the filibuster and then do nothing until Dems when house and Senate and say, trump's fault. And then go full rino retard permalink award report block reply\nRandyMoss 1 points 5 hours ago Rand Paul is the only MAGA Senator. He voted against the Biden budget. permalink award report block reply\nButttoucha9k 1 points 51 minutes ago What happens when the filibuster is gone? permalink award report block reply\nFemale 1 points 8 hours ago Anti republican maga rally but no feds this time. Free drinks for attendees permalink award report block reply\nCarmen1956 1 points 7 hours ago I’m with you but it probably won’t change anything! permalink award report block reply\nPepePinochet 1 points 7 hours ago Idk, I was cook with keeping the government shuttered permalink award report block reply\ngreatpumpkin 1 points 1 hour ago Thune is McConnell's lapdog.  He does as he's told. Want something different?  Pressure McConnell. permalink award report block reply\nSmurfection 1 points 3 hours ago It won't do us any good to end the filibuster if we don't immediately pass Voter ID laws and end H1B visas and clamp down more on legal and illegal immigration. permalink award report block reply\nReturningtogod 1 points 4 hours ago THEY DON’T CARE. permalink award report block reply\nnonrate 1 points 5 hours ago Rand is not a democrat, lol. He opposed opening the government because there is still unnecessary spending in it. Democrats wanted to make sure we were printing new dollars and spending them on useless things. Government shutdown should have gone on longer, I am with Rand on this one. permalink award report block reply\nDCYR66 1 points 2 hours ago Rand Paul needs a good barber! permalink award report block reply\nUnboosted 1 points 4 hours ago Throw out how? Voting? Dont make me laugh. Seriously, throw out how? permalink award report block reply\nstarjello 1 points 3 hours ago The republicans in the senate don't care. Their response to you is \"what are you going to fuckin do about it.\" permalink award report block reply\nsomeguy7738 1 points 2 hours ago End the filibuster for what? What do you think is going to happen without it? All of a sudden the spineless faggot GOP neocons and MIGA traitors are going to put America first? Why would they do that? The problem isn't that they don't have the power to implement an America first agenda, it's that they don't want to. permalink award report block reply\nPowerOfBlues 0 points 2 hours ago Red State faggots here yell \"build a wall around New York and don't let anybody out\"..... meanwhile their GOP Senators and Congressmen are worthless kid fuckers.....and their own cities are filled with even trashier Honey Boo Boo blue haired Tik Tokers permalink award report block reply\n_2022_ 0 points 7 hours ago I wonder why there’s an undercurrent of previously dedicated Republican voters checking out. Weird. permalink award report block reply\nTrumpBetrays247 1 points 1 hour ago Comment removed by community filter, pending further review. permalink award report block reply"
}