{
  "id": "1ARK57sEce",
  "url": "https://patriots.win/p/1ARK57sEce/the-democrats-are-cracking-like-/c",
  "content": "1386 The Democrats are cracking like dogs on the Shutdown because they are deathly afraid that I am making progress with the Republicans on TERMINATING THE FILIBUSTER! TRUMP  TRUTH posted 4 days ago by _C_I_A_ 116 comments award share download report block\n116 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Beachboy1b 76 points 4 days ago They NEED to do that at this point. Ol Chuck “Fuck me in my ass” Schumer keeps calling it the “Republican Shutdown”. They are refusing to take responsibility, and WILL keep it shut down even if it meant keeping it shutdown for TRUMP’S ENTIRE TERM. Blow up the filibuster, and get shit done, and make it so they NEVER retake power. Then? It’s never a problem. Easy-fucking-peasy. permalink award report block reply terribletwos 38 points 4 days ago This is what I thought too, and it makes sense in theory that they want to disable Trumps ability to govern. However, based on Elon's Rogan podcast, it seems that the real story is that DOGE caught the fraud that was funding the illegal alien invasion. Now all these democratic states are going bankrupt because they lost their gravy train but still need the money. So them asking for money for illegals directly as part of their demands, instead of using the old method of funneling the money is the only way these states aren't completely fucked. Which means that the power is on our side, not on their side. permalink parent award report block reply Skogin 17 points 4 days ago They are ridiculously overextended, and the music has stopped. permalink parent award report block reply minttea2 5 points 4 days ago CNN: \"So I actually am not going to be a hack for the Democrats or the Republican right now. This is having massive impact. I went and got my eyebrows done the other day, and my eyebrow technician was like, 'They‘re going to fire two technicians from here because all of our clients don‘t have money to come.' She‘s not on SNAP.\" https://news.grabien.com/story/ashley-allison-my-eyebrow-tech-says-they-have-to-let-go-of-techs-becau permalink parent award report block reply Skogin 6 points 4 days ago HONK HONK permalink parent award report block reply AlohaSnackbar 2 points 4 days ago To follow your metaphor, this shows the music slowing, within a week, the music stops, and our losses will dwarf the value of the entire company, by a large margin (call). Ok, so it's not the exact quote, or even close, but it fit the theme. permalink parent award report block reply Viewer01 7 points 4 days ago So we nuke them and leave them to squirm for 10 years. permalink parent award report block reply KernalMustard 3 points 4 days ago Wishful thinking. How they changed how they stole elections once whats her name was removed out of Broward. They will find away. A rat will move to make another nest once found. permalink parent award report block reply Papabravo12 2 points 4 days ago Yeah, and he’s right, they call it “Medicaid” but it’s a giant slush fund scam permalink parent award report block reply Tiredofstupidpeople 2 points 4 days ago It's a lot more insidious than that. It's actually simple. The radicals have taken full control of the democrat party. What they really want is the complete collapse of America. They are going to try to keep the government shut down as long as possible no matter what because that's their goal. permalink parent award report block reply Than0sIII 24 points 4 days ago Yeah this stupid \"oh but they'll do it too to us then if they get back into power\" argument is retarded.  The morality or being \"better\" argument is also dangerously ignorant in the wake of Charlie Kirk's public execution. We know they're going to do that shit no matter what whenever they get into power.  Trump could very well get impeached for real this time if we lose the midterms.  It's insane that we're at this point, but there's no returning things back to sanity when you have a voterbase that is bringing in more and more extreme candidates like Mamdani and Jay Jones. It's now or never to secure our Constitutional Republic.  Otherwise they will force their Multicultural Democracy upon us because they do not give a shit about ethics, morality, or anything of that sort.  History is written by the victors, and they know that full well.  They've already shown that they will rewrite morality, ethics, science, whatever the fuck they need to in order to justify doing what they believe is necessary to win.  And they are not above killing people to get their way, either. So Republicans need to wake up, realize what time it is, and do their fucking job. permalink parent award report block reply Build_Back_Bankrupt 4 points 4 days ago I'm not so sure the country can handle more rounds of impeachment proceedings, and it might be what some of the RINO's want too.  If impeachment succeeds it's going to be bad for the country, and for that reason alone I think they have a duty to end the filibuster to prevent it. Dems are already building a narrative for the next impeachment, and I'm pretty sure it will concern Venezuela. permalink parent award report block reply ReallyGayMods 1 points 4 days ago What law do you want to be passed that would prevent the dems from taking over and impeaching trump in the likely scenario they win the house next year? permalink parent award report block reply Build_Back_Bankrupt 9 points 4 days ago Voter ID and paper ballots would be a good start to prevent potential election fraud that hands them the midterms. Banning illegals from voting and harsh penalties who enable them or enter votes on their behalf.  It's already illegal, but put a finer point on it to shut up dems promoting it. Codifying into law that the cartels as international terrorist organizations would provide impeachment protections for Trump's actions so far in thwarting them. Restoring the Smith-Mundt Modernization Act, and increase penalties for violating it, whether you believe it's part of the problem or not, it draws attention to propaganda issues. Pass laws against media selectively or deceptively editing content that push a biased narrative vs. reporting. Pass laws requiring the media to clearly label their broadcasts as either option or news, laws that define each and establish penalties for violation. None of these are a guarantee, but if passed and the dems take the house they're going to be spinning their wheels trying to undo all of it rather than pushing their BS for a while. permalink parent award report block reply view 3 more comments... FrmrAmericanRepublic 19 points 4 days ago Chuck \"long nose\" Shitbag is such a career politician he doesn't even know how to be honest in anything. I say we keep the fucking thing shut down and then look at what really needs staffing, and starve out the rest of the parasites. permalink parent award report block reply PrairieRaine88 2 points 4 days ago Can we start with the Bureau of Land Management to save the wild horses and burros? permalink parent award report block reply OPsMom 8 points 4 days ago If they ever take power back they will undo everything with autopen then we'll be living in 1984, getting genocided in breadlines. But if we do nothing they will cheat until they get a super majority and it will be the same end result. We need to end the filibuster. Paper ballots. Hang commies. Repeal the 19th amendment. Abolish the IRS and federal reserve. Single tax rate for all and restrict voting to net tax paying citizens only. permalink parent award report block reply Simple_Doot 4 points 4 days ago Republicans are natural born fuck ups and will fumble badly if they pursue that plan.  Democrats will regain control quickly and use those weapons against us.  I mean just look at the latest elections!  Dems fucking mopped the floor with Republicans. permalink parent award report block reply PunishedOrange 3 points 4 days ago they will do it anyway when they win the midterms, make the first move and claim victory permalink parent award report block reply EgregiousPhilbin 1 points 4 days ago But what if they claim victory in response???? permalink parent award report block reply Beachboy1b 1 points 4 days ago In predominantly blue states, which no one expected otherwise. permalink parent award report block reply Simple_Doot 3 points 4 days ago The point is this administration is intentionally either: A) avoiding fulfilling its promises or B) delaying any progress until some certain moment. I admit their is time to turn it around but if we are to take everything at face value, delete the possibility of a \"plan\", then this is a disaster at this moment. permalink parent award report block reply Ghostphaez 0 points 4 days ago Pure cope! Even Trump said it was a terrible result. permalink parent award report block reply permissible_missile 1 points 4 days ago An expected terrible result. You're either shills or faggots with a weak constitution. Which is it? permalink parent award report block reply view 1 more comments... Papabravo12 1 points 4 days ago I mean, I don’t take a ton from off cycle elections in lib tard states but yes you’re right about republicans fucking it up permalink parent award report block reply load 4 more comments... CJ74U2NV 15 points 4 days ago Congressional Republicans are pussies. permalink award report block reply UsernameChexOut 4 points 4 days ago Republicans* permalink parent award report block reply Than0sIII 5 points 4 days ago Republicucks. permalink parent award report block reply ingrowntoenail 3 points 4 days ago Republicants permalink parent award report block reply Viewer01 2 points 4 days ago Man this week I stumbled into Christian X sphere. Christian men have absolutely lost the plot. I deadass got into an argument with a “Christian feminist.” They’ve let their women run wild. Imagine reading the Bible and thinking it doesn’t clearly outline men having dominion over women. permalink parent award report block reply x79q3pb 2 points 4 days ago X You were arguing with a Jeet, guarantee it. permalink parent award report block reply DiamondDroid 8 points 4 days ago There can be no deal with those lairs thieves and murderers. Clean CR or die! And if the filibuster is nuked DO IT ALL right away. One day voting, one day counting, paper ballots, revoke anchor baby status, abolish the FED. And More! Do it ALL and do it so fast even a libtard tsunami of Hawaii judges won't be able keep up. permalink award report block reply Krat 1 points 4 days ago Anything else leaves us enslaved. And while they are trying to catch up pass shit anyways and start acting on the shit thats passed so itll be too late to do anything about it permalink parent award report block reply MemeWarsVet 8 points 4 days ago Doggie crack = zoomies. That's all I got. permalink award report block reply mohel 7 points 4 days ago Only a LOSER Rand Paul enters the chat permalink award report block reply Than0sIII 7 points 4 days ago Nation-wide voter ID for federal elections is the only way we can combat cheating at this point.  And even then, Democrats will sue to make sure they can still rig state elections, as well as do the insane redistricting bullshit. We can't afford to keep playing to a set of arbitrary rules that Democrats haven't been playing by to begin with.  You can't argue morality/ethics with those who will simply redefine those values should they get in power again. permalink award report block reply bearhugprolapse 6 points 4 days ago can i crack dat dawg? permalink award report block reply DingleBalls 5 points 4 days ago Crack that dog! permalink award report block reply bumpman 3 points 4 days ago The filibuster preferably should be ended, if not, there needs to be stronger rules written that the democrats can’t end it next time they are in power. This needs to be settled, we can’t trust democrats permalink award report block reply grad16uc 1 points 4 days ago Let them have it. If whatever they do is a catastrophe, they have to own it then. The filibuster serves literally one purpose for both parties - an excuse to not do anything. permalink parent award report block reply ReallyGayMods 3 points 4 days ago It seems like all of you are saying \"Nuke the filibuster, no more mail ballots, one day voting\" Mail in and voting month is all set by the states, not the federal government. So that won't work. And now dems would have the filibuster gone and once they take over, they have permanent rule Getting rid of the filibuster is a terrible idea permalink award report block reply thunderpussy 3 points 4 days ago Indeed. We don't really even have 50 votes on most issues currently, and believe me, there is at least a third of the Senate that hide behind Murkoski's, Collins, and Paul's, \"no\" votes. permalink parent award report block reply Klaus73 3 points 4 days ago And covers way more then the \"Good shit\" people want. The argument that the dems next win will tear down the fillibuster is an assumption; the reality that tearing down the fillibuster means people will be constantly getting fucked via see-saw however is a certainty. permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago Exactly this. It's been my main point in every argument about the filibuster. Sure, it locks down government on some issues, but it also helps ensure that neither side rams through a bunch of bullshit to fuck over the general populace. Without it, none of us would have guns right now. permalink parent award report block reply True_Curmudgeon 2 points 4 days ago This place isnt suitable for a constitutional republic anymore permalink award report block reply ShotgunParade69x 2 points 4 days ago Everyone contact your representative and DO THIS!!  It’s really our last chance at moving things in the right direction - permalink award report block reply ckover9000 2 points 4 days ago I keep losing track of what side of the filibuster I'm supposed to be on. Since the GOP is actively opening the door to losing the House next year aren't we probably going to need it? I'm not counting on this clownass \"majority\" to get enough done to sit comfy. permalink award report block reply ConfusedAngryArmed 2 points 4 days ago That's been my take as well. permalink parent award report block reply BlackFolk 2 points 4 days ago DO IT ALREADY AND QUIT YAPPING ABOUT IT permalink award report block reply Light_HIV_Effect 2 points 4 days ago I don't know. Do you want to be powerless when democrats take back control of the senate? Of course, none of this would probably be happening now if the leadership in the senate actually supported the candidates from swing states that Trump won. We'd be looking at 58 seats, and I'm sure you could pick off one senator aside from Fetterneck. permalink award report block reply ReallyGayMods 2 points 4 days ago Terminating the filibuster is an awful idea permalink award report block reply TheJakeFroggy 2 points 4 days ago I will continue to scream it from the rooftops: If the Republicans just flat out refuse to work with Trump and enact his agenda, then at that point Trump will have literally no other choice but to invoke the Insurrection Act and get the military to perform a swift takedown of the corrupt people in government. He knows that option exists. He mentioned it in a few interviews last month and even said he'd be up to using it if he had to. And it's why I won't rule it out and believe there may very well be a chance that he uses it as a last resort. permalink award report block reply Ghostphaez 6 points 4 days ago Dude, stop living in fantasy land! Trump will never, ever do this. permalink parent award report block reply noPTSDforMePlease 2 points 4 days ago I.wonder if the filibuster termination is real, or just leverage to get what he wants out of the shut down. Probably a mix of both. permalink award report block reply MAGALADON9 2 points 4 days ago We don't have 51 votes though   😢 permalink award report block reply MasterChief08 2 points 4 days ago ABOLISH THE FILLIBUSTER AND PACK THE COURTS permalink award report block reply 2008RonPaul2012 2 points 4 days ago If there is one things dogs are known for its how often they crack. Really paints the picture in a non-confusing way permalink award report block reply Kilroy 2 points 4 days ago I can't tell you how much I despise the Republican party, I've been watching these clowns for going on 60 years. Trump, watch your back, you're surrounded by ass kissing snakes. Their not to nice, their not stupid, they are evil blood sucking Communist dressed as good Christian conservatives. permalink award report block reply DrVSGGEOTUSPhD 2 points 4 days ago Cracking like dogs? permalink award report block reply AppalachianTactical 2 points 4 days ago Filibuster gone.\nThen they just send every red cent to israel. Id be more willing to support removing it if yhe cucking for israel hadnt been so obvious. permalink award report block reply ConfusedAngryArmed 2 points 4 days ago Agreed. permalink parent award report block reply anotherrandomname 2 points 4 days ago Problem remains that the GOP doesn't actually want to implement Trump's agenda. It's not a matter of figuring out how to do it, they simply don't want to do it. permalink award report block reply BidensPrisonWallet 2 points 4 days ago What position is Cruz/AIPAC Spokesman taking on this ? permalink award report block reply AlvinOfTheTrumpmunks 2 points 4 days ago Still need to deal with the RINOs in the senate. permalink award report block reply Justjayce 1 points 4 days ago Our RINOS will fuck it up even without the filibuster permalink award report block reply Forty_Five 1 points 4 days ago Too bad most of the republicans are losers. permalink award report block reply AVeryNakedMan 1 points 4 days ago If we pass national voter ID and abolish unsolicited mail-in ballots, the entire country will shit towards Republicans, because many Dems are only in power due to fraud. Republicans would get a majority so big throughout the country, we might even be able to pass constitutional amendments and fix some serious problems. permalink award report block reply Tacitus1963 1 points 4 days ago The problem with blowing up the filibuster is that the RINO party is almost as bad as their Demtard buds. They would continue to slow walk all of Trump's agenda. They don't like that he's back in office as it cuts into the status quo of laundering our tax dollars back to all of them. That's the inherent risk in the RINO party getting rid of it.\nThe Demtards will have no problem getting rid of it.\nLook at all the damage they did for 4 years after they stole the election with nary a peep from the RINOs. permalink award report block reply Drdonaldjtrump1776 1 points 4 days ago News flash, the Republicans are stupid permalink award report block reply Silentbutdeadly 1 points 3 days ago The Democrats would do it.  They would do ANYTHING they could think of to gain the advantage and wouldn’t give a shit about the optics or of it hurt Republicans feelings. permalink award report block reply Beardholder 1 points 4 days ago Loser??? Try Traitors Mr president.\nStop calling them out and doing nothing. Send in the dogs (U.S Marshalls) and get them arrested for treason permalink award report block reply AmericanJawa 1 points 4 days ago Can Trump please get to those mass firings first? permalink award report block reply KeepMarxInTheGround 1 points 4 days ago Ironically enough, the GOP is filled with LOSERS. permalink award report block reply KungPaoMcChicken 1 points 4 days ago Can't Democrats just filibuster the vote on getting rid of the filibuster? Explain to me how this works... permalink award report block reply ConfusedAngryArmed 1 points 4 days ago No. Getting rid of the filibuster only requires 51 votes. Getting rid of the \"cloture\" rule requires 60. permalink parent award report block reply mikejones 1 points 4 days ago Trump going to make it so voters have a say again. permalink award report block reply Klaus73 1 points 4 days ago Well...unless you voted for the other guys that won... permalink parent award report block reply possibletower 1 points 4 days ago Murkowski/Collins/Rand Paul will vote no to this though. Hopefully the other 50 GOP senators finally get their heads out of their asses and nuke the filibuster. They only need 50 plus the VP. permalink award report block reply astralentity 1 points 4 days ago This is the way. permalink award report block reply BlueKentuckyGirl 1 points 4 days ago It’s about giving billions to insurance companies money without them competing in the marketplace. Dems commies, Republicans, Adam Smith. Capitalism and competition keeps everyone well. permalink award report block reply Ghostphaez 1 points 4 days ago \"Only a LOSER....\" In other words, 99% of elected \"Republicans\". permalink award report block reply PeaceMakerDJT 1 points 4 days ago What are the odds Trump makes deals with rinos to get this passed? permalink award report block reply BlueKentuckyGirl 1 points 4 days ago Yes Republicans, Thune, no compromise on this issue. permalink award report block reply Krat 1 points 4 days ago Do it anyways like they would permalink award report block reply PatriotSkorzeny 1 points 4 days ago Voter ID wasn’t in the BBB? permalink award report block reply sordfysh PRO 1 points 4 days ago Could the Republicans at least make the Dems filibuster? It's not even the case that they are filibustering. The Republicans are telling us they are filibustering but they are actually just threatening to do so. permalink award report block reply SavingPrivateGrace 1 points 4 days ago Keep it shutdown.  The Republicans should sleep with these mad dogs for at least 30 days.  Hold the line.  No healthcare for illegals period. permalink award report block reply Snerdley 1 points 4 days ago Nuke the filibuster, then immediately pass voting reforms to prevent a democrat (cheating) surge. This HAS to be done just to get the voting reforms. If not, they will eventually cheat and surge and then THEY will nuke the filibuster. Its time has come. Kill it. permalink award report block reply SquirreleeDan 1 points 4 days ago Can anyone care about the class that’s being completely fucked for the last 10 years for fucking once? permalink award report block reply canadianhere 1 points 4 days ago So what happened with that guy who said they were prepared to give the Democrats everything? Is that a different issue? permalink award report block reply DatTrumpDoh 2 points 4 days ago Thune was misquoted by clickbaiting journos. He never said anything like that. permalink parent award report block reply Dangerous 1 points 4 days ago Except they all decided to suddenly really strap in only after allowing Democrats to win several major elections... https://patriots.win/p/1ARK0TSP1Y/-sen-adam-schiff-dca-shutdown-hu/c And here is Trump also warning that a right wing response is inevitable if the left doesn't tamper down its behavior, and that he doesn't want that: https://thehill.com/opinion/lindseys-lens/5523829-escalating-rhetoric-violence-trump/ To me this displays that Trump's GOP coalition is clearly very interested in keeping the same left-right status quo we have had already for the last several decades permalink parent award report block reply warlord30 1 points 4 days ago amen trump! 🙏 permalink award report block reply sir_rockness 1 points 4 days ago The uniparty is without a doubt nothing but losers... America last... all of them permalink award report block reply MAGALADON9 0 points 4 days ago This is like the 48th time he (DJT) was using \"dog\" negatively.  Can someone please tell him to stop that shit. permalink award report block reply YodaBannon 0 points 4 days ago Thank you Mr. President, thank you. permalink award report block reply rightoverthere -1 points 4 days ago we need bigger government. more laws and regulations passed. we don't need any checks and balances. that shit is for before 2020. we just need more and more government asap. the fucking filibuster is like a roadblock that prevents government from growing. remove the roadblock and start passing legislation now! don't think long term think what can be accomplished in 2025 alone permalink award report block reply Klaus73 2 points 4 days ago Aye - unimpeded government is a awesome idea! permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago What could possibly go wrong, right? Right!? permalink parent award report block reply Klaus73 2 points 3 days ago I mean its right up there with essentially insulating the US from the world markets by tossing up massive trade barriers - I mean US deficit on trade is almost 1 Trillion this year...so even if we use the optimistic number that's a 200 billion shortfall after tariffs - and that's only going to worsen. The thing is the government has a really bad habit of not being able to admit when its probably wrong - I don't think the solution is to make it impossible for it to walk back from when it fucks up. Trump isn't infallible and I hate that his solution to his inability to negotiate with the democrats is to simply cut them out of the process entirely - I assumed the US practices democracy but it really does seem more and more like Trump has no time for that. permalink parent award report block reply the_new_one 2 points 4 days ago Comment removed upon the user being banned. permalink award report block reply TheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nBeachboy1b 76 points 4 days ago They NEED to do that at this point. Ol Chuck “Fuck me in my ass” Schumer keeps calling it the “Republican Shutdown”. They are refusing to take responsibility, and WILL keep it shut down even if it meant keeping it shutdown for TRUMP’S ENTIRE TERM. Blow up the filibuster, and get shit done, and make it so they NEVER retake power. Then? It’s never a problem. Easy-fucking-peasy. permalink award report block reply terribletwos 38 points 4 days ago This is what I thought too, and it makes sense in theory that they want to disable Trumps ability to govern. However, based on Elon's Rogan podcast, it seems that the real story is that DOGE caught the fraud that was funding the illegal alien invasion. Now all these democratic states are going bankrupt because they lost their gravy train but still need the money. So them asking for money for illegals directly as part of their demands, instead of using the old method of funneling the money is the only way these states aren't completely fucked. Which means that the power is on our side, not on their side. permalink parent award report block reply Skogin 17 points 4 days ago They are ridiculously overextended, and the music has stopped. permalink parent award report block reply minttea2 5 points 4 days ago CNN: \"So I actually am not going to be a hack for the Democrats or the Republican right now. This is having massive impact. I went and got my eyebrows done the other day, and my eyebrow technician was like, 'They‘re going to fire two technicians from here because all of our clients don‘t have money to come.' She‘s not on SNAP.\" https://news.grabien.com/story/ashley-allison-my-eyebrow-tech-says-they-have-to-let-go-of-techs-becau permalink parent award report block reply Skogin 6 points 4 days ago HONK HONK permalink parent award report block reply AlohaSnackbar 2 points 4 days ago To follow your metaphor, this shows the music slowing, within a week, the music stops, and our losses will dwarf the value of the entire company, by a large margin (call). Ok, so it's not the exact quote, or even close, but it fit the theme. permalink parent award report block reply Viewer01 7 points 4 days ago So we nuke them and leave them to squirm for 10 years. permalink parent award report block reply KernalMustard 3 points 4 days ago Wishful thinking. How they changed how they stole elections once whats her name was removed out of Broward. They will find away. A rat will move to make another nest once found. permalink parent award report block reply Papabravo12 2 points 4 days ago Yeah, and he’s right, they call it “Medicaid” but it’s a giant slush fund scam permalink parent award report block reply Tiredofstupidpeople 2 points 4 days ago It's a lot more insidious than that. It's actually simple. The radicals have taken full control of the democrat party. What they really want is the complete collapse of America. They are going to try to keep the government shut down as long as possible no matter what because that's their goal. permalink parent award report block reply Than0sIII 24 points 4 days ago Yeah this stupid \"oh but they'll do it too to us then if they get back into power\" argument is retarded.  The morality or being \"better\" argument is also dangerously ignorant in the wake of Charlie Kirk's public execution. We know they're going to do that shit no matter what whenever they get into power.  Trump could very well get impeached for real this time if we lose the midterms.  It's insane that we're at this point, but there's no returning things back to sanity when you have a voterbase that is bringing in more and more extreme candidates like Mamdani and Jay Jones. It's now or never to secure our Constitutional Republic.  Otherwise they will force their Multicultural Democracy upon us because they do not give a shit about ethics, morality, or anything of that sort.  History is written by the victors, and they know that full well.  They've already shown that they will rewrite morality, ethics, science, whatever the fuck they need to in order to justify doing what they believe is necessary to win.  And they are not above killing people to get their way, either. So Republicans need to wake up, realize what time it is, and do their fucking job. permalink parent award report block reply Build_Back_Bankrupt 4 points 4 days ago I'm not so sure the country can handle more rounds of impeachment proceedings, and it might be what some of the RINO's want too.  If impeachment succeeds it's going to be bad for the country, and for that reason alone I think they have a duty to end the filibuster to prevent it. Dems are already building a narrative for the next impeachment, and I'm pretty sure it will concern Venezuela. permalink parent award report block reply ReallyGayMods 1 points 4 days ago What law do you want to be passed that would prevent the dems from taking over and impeaching trump in the likely scenario they win the house next year? permalink parent award report block reply Build_Back_Bankrupt 9 points 4 days ago Voter ID and paper ballots would be a good start to prevent potential election fraud that hands them the midterms. Banning illegals from voting and harsh penalties who enable them or enter votes on their behalf.  It's already illegal, but put a finer point on it to shut up dems promoting it. Codifying into law that the cartels as international terrorist organizations would provide impeachment protections for Trump's actions so far in thwarting them. Restoring the Smith-Mundt Modernization Act, and increase penalties for violating it, whether you believe it's part of the problem or not, it draws attention to propaganda issues. Pass laws against media selectively or deceptively editing content that push a biased narrative vs. reporting. Pass laws requiring the media to clearly label their broadcasts as either option or news, laws that define each and establish penalties for violation. None of these are a guarantee, but if passed and the dems take the house they're going to be spinning their wheels trying to undo all of it rather than pushing their BS for a while. permalink parent award report block reply view 3 more comments... FrmrAmericanRepublic 19 points 4 days ago Chuck \"long nose\" Shitbag is such a career politician he doesn't even know how to be honest in anything. I say we keep the fucking thing shut down and then look at what really needs staffing, and starve out the rest of the parasites. permalink parent award report block reply PrairieRaine88 2 points 4 days ago Can we start with the Bureau of Land Management to save the wild horses and burros? permalink parent award report block reply OPsMom 8 points 4 days ago If they ever take power back they will undo everything with autopen then we'll be living in 1984, getting genocided in breadlines. But if we do nothing they will cheat until they get a super majority and it will be the same end result. We need to end the filibuster. Paper ballots. Hang commies. Repeal the 19th amendment. Abolish the IRS and federal reserve. Single tax rate for all and restrict voting to net tax paying citizens only. permalink parent award report block reply Simple_Doot 4 points 4 days ago Republicans are natural born fuck ups and will fumble badly if they pursue that plan.  Democrats will regain control quickly and use those weapons against us.  I mean just look at the latest elections!  Dems fucking mopped the floor with Republicans. permalink parent award report block reply PunishedOrange 3 points 4 days ago they will do it anyway when they win the midterms, make the first move and claim victory permalink parent award report block reply EgregiousPhilbin 1 points 4 days ago But what if they claim victory in response???? permalink parent award report block reply Beachboy1b 1 points 4 days ago In predominantly blue states, which no one expected otherwise. permalink parent award report block reply Simple_Doot 3 points 4 days ago The point is this administration is intentionally either: A) avoiding fulfilling its promises or B) delaying any progress until some certain moment. I admit their is time to turn it around but if we are to take everything at face value, delete the possibility of a \"plan\", then this is a disaster at this moment. permalink parent award report block reply Ghostphaez 0 points 4 days ago Pure cope! Even Trump said it was a terrible result. permalink parent award report block reply permissible_missile 1 points 4 days ago An expected terrible result. You're either shills or faggots with a weak constitution. Which is it? permalink parent award report block reply view 1 more comments... Papabravo12 1 points 4 days ago I mean, I don’t take a ton from off cycle elections in lib tard states but yes you’re right about republicans fucking it up permalink parent award report block reply load 4 more comments...\nterribletwos 38 points 4 days ago This is what I thought too, and it makes sense in theory that they want to disable Trumps ability to govern. However, based on Elon's Rogan podcast, it seems that the real story is that DOGE caught the fraud that was funding the illegal alien invasion. Now all these democratic states are going bankrupt because they lost their gravy train but still need the money. So them asking for money for illegals directly as part of their demands, instead of using the old method of funneling the money is the only way these states aren't completely fucked. Which means that the power is on our side, not on their side. permalink parent award report block reply Skogin 17 points 4 days ago They are ridiculously overextended, and the music has stopped. permalink parent award report block reply minttea2 5 points 4 days ago CNN: \"So I actually am not going to be a hack for the Democrats or the Republican right now. This is having massive impact. I went and got my eyebrows done the other day, and my eyebrow technician was like, 'They‘re going to fire two technicians from here because all of our clients don‘t have money to come.' She‘s not on SNAP.\" https://news.grabien.com/story/ashley-allison-my-eyebrow-tech-says-they-have-to-let-go-of-techs-becau permalink parent award report block reply Skogin 6 points 4 days ago HONK HONK permalink parent award report block reply AlohaSnackbar 2 points 4 days ago To follow your metaphor, this shows the music slowing, within a week, the music stops, and our losses will dwarf the value of the entire company, by a large margin (call). Ok, so it's not the exact quote, or even close, but it fit the theme. permalink parent award report block reply Viewer01 7 points 4 days ago So we nuke them and leave them to squirm for 10 years. permalink parent award report block reply KernalMustard 3 points 4 days ago Wishful thinking. How they changed how they stole elections once whats her name was removed out of Broward. They will find away. A rat will move to make another nest once found. permalink parent award report block reply Papabravo12 2 points 4 days ago Yeah, and he’s right, they call it “Medicaid” but it’s a giant slush fund scam permalink parent award report block reply Tiredofstupidpeople 2 points 4 days ago It's a lot more insidious than that. It's actually simple. The radicals have taken full control of the democrat party. What they really want is the complete collapse of America. They are going to try to keep the government shut down as long as possible no matter what because that's their goal. permalink parent award report block reply\nSkogin 17 points 4 days ago They are ridiculously overextended, and the music has stopped. permalink parent award report block reply minttea2 5 points 4 days ago CNN: \"So I actually am not going to be a hack for the Democrats or the Republican right now. This is having massive impact. I went and got my eyebrows done the other day, and my eyebrow technician was like, 'They‘re going to fire two technicians from here because all of our clients don‘t have money to come.' She‘s not on SNAP.\" https://news.grabien.com/story/ashley-allison-my-eyebrow-tech-says-they-have-to-let-go-of-techs-becau permalink parent award report block reply Skogin 6 points 4 days ago HONK HONK permalink parent award report block reply AlohaSnackbar 2 points 4 days ago To follow your metaphor, this shows the music slowing, within a week, the music stops, and our losses will dwarf the value of the entire company, by a large margin (call). Ok, so it's not the exact quote, or even close, but it fit the theme. permalink parent award report block reply\nminttea2 5 points 4 days ago CNN: \"So I actually am not going to be a hack for the Democrats or the Republican right now. This is having massive impact. I went and got my eyebrows done the other day, and my eyebrow technician was like, 'They‘re going to fire two technicians from here because all of our clients don‘t have money to come.' She‘s not on SNAP.\" https://news.grabien.com/story/ashley-allison-my-eyebrow-tech-says-they-have-to-let-go-of-techs-becau permalink parent award report block reply Skogin 6 points 4 days ago HONK HONK permalink parent award report block reply\nSkogin 6 points 4 days ago HONK HONK permalink parent award report block reply\nAlohaSnackbar 2 points 4 days ago To follow your metaphor, this shows the music slowing, within a week, the music stops, and our losses will dwarf the value of the entire company, by a large margin (call). Ok, so it's not the exact quote, or even close, but it fit the theme. permalink parent award report block reply\nViewer01 7 points 4 days ago So we nuke them and leave them to squirm for 10 years. permalink parent award report block reply\nKernalMustard 3 points 4 days ago Wishful thinking. How they changed how they stole elections once whats her name was removed out of Broward. They will find away. A rat will move to make another nest once found. permalink parent award report block reply\nPapabravo12 2 points 4 days ago Yeah, and he’s right, they call it “Medicaid” but it’s a giant slush fund scam permalink parent award report block reply\nTiredofstupidpeople 2 points 4 days ago It's a lot more insidious than that. It's actually simple. The radicals have taken full control of the democrat party. What they really want is the complete collapse of America. They are going to try to keep the government shut down as long as possible no matter what because that's their goal. permalink parent award report block reply\nThan0sIII 24 points 4 days ago Yeah this stupid \"oh but they'll do it too to us then if they get back into power\" argument is retarded.  The morality or being \"better\" argument is also dangerously ignorant in the wake of Charlie Kirk's public execution. We know they're going to do that shit no matter what whenever they get into power.  Trump could very well get impeached for real this time if we lose the midterms.  It's insane that we're at this point, but there's no returning things back to sanity when you have a voterbase that is bringing in more and more extreme candidates like Mamdani and Jay Jones. It's now or never to secure our Constitutional Republic.  Otherwise they will force their Multicultural Democracy upon us because they do not give a shit about ethics, morality, or anything of that sort.  History is written by the victors, and they know that full well.  They've already shown that they will rewrite morality, ethics, science, whatever the fuck they need to in order to justify doing what they believe is necessary to win.  And they are not above killing people to get their way, either. So Republicans need to wake up, realize what time it is, and do their fucking job. permalink parent award report block reply Build_Back_Bankrupt 4 points 4 days ago I'm not so sure the country can handle more rounds of impeachment proceedings, and it might be what some of the RINO's want too.  If impeachment succeeds it's going to be bad for the country, and for that reason alone I think they have a duty to end the filibuster to prevent it. Dems are already building a narrative for the next impeachment, and I'm pretty sure it will concern Venezuela. permalink parent award report block reply ReallyGayMods 1 points 4 days ago What law do you want to be passed that would prevent the dems from taking over and impeaching trump in the likely scenario they win the house next year? permalink parent award report block reply Build_Back_Bankrupt 9 points 4 days ago Voter ID and paper ballots would be a good start to prevent potential election fraud that hands them the midterms. Banning illegals from voting and harsh penalties who enable them or enter votes on their behalf.  It's already illegal, but put a finer point on it to shut up dems promoting it. Codifying into law that the cartels as international terrorist organizations would provide impeachment protections for Trump's actions so far in thwarting them. Restoring the Smith-Mundt Modernization Act, and increase penalties for violating it, whether you believe it's part of the problem or not, it draws attention to propaganda issues. Pass laws against media selectively or deceptively editing content that push a biased narrative vs. reporting. Pass laws requiring the media to clearly label their broadcasts as either option or news, laws that define each and establish penalties for violation. None of these are a guarantee, but if passed and the dems take the house they're going to be spinning their wheels trying to undo all of it rather than pushing their BS for a while. permalink parent award report block reply view 3 more comments...\nBuild_Back_Bankrupt 4 points 4 days ago I'm not so sure the country can handle more rounds of impeachment proceedings, and it might be what some of the RINO's want too.  If impeachment succeeds it's going to be bad for the country, and for that reason alone I think they have a duty to end the filibuster to prevent it. Dems are already building a narrative for the next impeachment, and I'm pretty sure it will concern Venezuela. permalink parent award report block reply ReallyGayMods 1 points 4 days ago What law do you want to be passed that would prevent the dems from taking over and impeaching trump in the likely scenario they win the house next year? permalink parent award report block reply Build_Back_Bankrupt 9 points 4 days ago Voter ID and paper ballots would be a good start to prevent potential election fraud that hands them the midterms. Banning illegals from voting and harsh penalties who enable them or enter votes on their behalf.  It's already illegal, but put a finer point on it to shut up dems promoting it. Codifying into law that the cartels as international terrorist organizations would provide impeachment protections for Trump's actions so far in thwarting them. Restoring the Smith-Mundt Modernization Act, and increase penalties for violating it, whether you believe it's part of the problem or not, it draws attention to propaganda issues. Pass laws against media selectively or deceptively editing content that push a biased narrative vs. reporting. Pass laws requiring the media to clearly label their broadcasts as either option or news, laws that define each and establish penalties for violation. None of these are a guarantee, but if passed and the dems take the house they're going to be spinning their wheels trying to undo all of it rather than pushing their BS for a while. permalink parent award report block reply view 3 more comments...\nReallyGayMods 1 points 4 days ago What law do you want to be passed that would prevent the dems from taking over and impeaching trump in the likely scenario they win the house next year? permalink parent award report block reply Build_Back_Bankrupt 9 points 4 days ago Voter ID and paper ballots would be a good start to prevent potential election fraud that hands them the midterms. Banning illegals from voting and harsh penalties who enable them or enter votes on their behalf.  It's already illegal, but put a finer point on it to shut up dems promoting it. Codifying into law that the cartels as international terrorist organizations would provide impeachment protections for Trump's actions so far in thwarting them. Restoring the Smith-Mundt Modernization Act, and increase penalties for violating it, whether you believe it's part of the problem or not, it draws attention to propaganda issues. Pass laws against media selectively or deceptively editing content that push a biased narrative vs. reporting. Pass laws requiring the media to clearly label their broadcasts as either option or news, laws that define each and establish penalties for violation. None of these are a guarantee, but if passed and the dems take the house they're going to be spinning their wheels trying to undo all of it rather than pushing their BS for a while. permalink parent award report block reply view 3 more comments...\nBuild_Back_Bankrupt 9 points 4 days ago Voter ID and paper ballots would be a good start to prevent potential election fraud that hands them the midterms. Banning illegals from voting and harsh penalties who enable them or enter votes on their behalf.  It's already illegal, but put a finer point on it to shut up dems promoting it. Codifying into law that the cartels as international terrorist organizations would provide impeachment protections for Trump's actions so far in thwarting them. Restoring the Smith-Mundt Modernization Act, and increase penalties for violating it, whether you believe it's part of the problem or not, it draws attention to propaganda issues. Pass laws against media selectively or deceptively editing content that push a biased narrative vs. reporting. Pass laws requiring the media to clearly label their broadcasts as either option or news, laws that define each and establish penalties for violation. None of these are a guarantee, but if passed and the dems take the house they're going to be spinning their wheels trying to undo all of it rather than pushing their BS for a while. permalink parent award report block reply view 3 more comments...\nFrmrAmericanRepublic 19 points 4 days ago Chuck \"long nose\" Shitbag is such a career politician he doesn't even know how to be honest in anything. I say we keep the fucking thing shut down and then look at what really needs staffing, and starve out the rest of the parasites. permalink parent award report block reply PrairieRaine88 2 points 4 days ago Can we start with the Bureau of Land Management to save the wild horses and burros? permalink parent award report block reply\nPrairieRaine88 2 points 4 days ago Can we start with the Bureau of Land Management to save the wild horses and burros? permalink parent award report block reply\nOPsMom 8 points 4 days ago If they ever take power back they will undo everything with autopen then we'll be living in 1984, getting genocided in breadlines. But if we do nothing they will cheat until they get a super majority and it will be the same end result. We need to end the filibuster. Paper ballots. Hang commies. Repeal the 19th amendment. Abolish the IRS and federal reserve. Single tax rate for all and restrict voting to net tax paying citizens only. permalink parent award report block reply\nSimple_Doot 4 points 4 days ago Republicans are natural born fuck ups and will fumble badly if they pursue that plan.  Democrats will regain control quickly and use those weapons against us.  I mean just look at the latest elections!  Dems fucking mopped the floor with Republicans. permalink parent award report block reply PunishedOrange 3 points 4 days ago they will do it anyway when they win the midterms, make the first move and claim victory permalink parent award report block reply EgregiousPhilbin 1 points 4 days ago But what if they claim victory in response???? permalink parent award report block reply Beachboy1b 1 points 4 days ago In predominantly blue states, which no one expected otherwise. permalink parent award report block reply Simple_Doot 3 points 4 days ago The point is this administration is intentionally either: A) avoiding fulfilling its promises or B) delaying any progress until some certain moment. I admit their is time to turn it around but if we are to take everything at face value, delete the possibility of a \"plan\", then this is a disaster at this moment. permalink parent award report block reply Ghostphaez 0 points 4 days ago Pure cope! Even Trump said it was a terrible result. permalink parent award report block reply permissible_missile 1 points 4 days ago An expected terrible result. You're either shills or faggots with a weak constitution. Which is it? permalink parent award report block reply view 1 more comments... Papabravo12 1 points 4 days ago I mean, I don’t take a ton from off cycle elections in lib tard states but yes you’re right about republicans fucking it up permalink parent award report block reply\nPunishedOrange 3 points 4 days ago they will do it anyway when they win the midterms, make the first move and claim victory permalink parent award report block reply EgregiousPhilbin 1 points 4 days ago But what if they claim victory in response???? permalink parent award report block reply\nEgregiousPhilbin 1 points 4 days ago But what if they claim victory in response???? permalink parent award report block reply\nBeachboy1b 1 points 4 days ago In predominantly blue states, which no one expected otherwise. permalink parent award report block reply Simple_Doot 3 points 4 days ago The point is this administration is intentionally either: A) avoiding fulfilling its promises or B) delaying any progress until some certain moment. I admit their is time to turn it around but if we are to take everything at face value, delete the possibility of a \"plan\", then this is a disaster at this moment. permalink parent award report block reply Ghostphaez 0 points 4 days ago Pure cope! Even Trump said it was a terrible result. permalink parent award report block reply permissible_missile 1 points 4 days ago An expected terrible result. You're either shills or faggots with a weak constitution. Which is it? permalink parent award report block reply view 1 more comments...\nSimple_Doot 3 points 4 days ago The point is this administration is intentionally either: A) avoiding fulfilling its promises or B) delaying any progress until some certain moment. I admit their is time to turn it around but if we are to take everything at face value, delete the possibility of a \"plan\", then this is a disaster at this moment. permalink parent award report block reply\nGhostphaez 0 points 4 days ago Pure cope! Even Trump said it was a terrible result. permalink parent award report block reply permissible_missile 1 points 4 days ago An expected terrible result. You're either shills or faggots with a weak constitution. Which is it? permalink parent award report block reply view 1 more comments...\npermissible_missile 1 points 4 days ago An expected terrible result. You're either shills or faggots with a weak constitution. Which is it? permalink parent award report block reply view 1 more comments...\nPapabravo12 1 points 4 days ago I mean, I don’t take a ton from off cycle elections in lib tard states but yes you’re right about republicans fucking it up permalink parent award report block reply\nCJ74U2NV 15 points 4 days ago Congressional Republicans are pussies. permalink award report block reply UsernameChexOut 4 points 4 days ago Republicans* permalink parent award report block reply Than0sIII 5 points 4 days ago Republicucks. permalink parent award report block reply ingrowntoenail 3 points 4 days ago Republicants permalink parent award report block reply Viewer01 2 points 4 days ago Man this week I stumbled into Christian X sphere. Christian men have absolutely lost the plot. I deadass got into an argument with a “Christian feminist.” They’ve let their women run wild. Imagine reading the Bible and thinking it doesn’t clearly outline men having dominion over women. permalink parent award report block reply x79q3pb 2 points 4 days ago X You were arguing with a Jeet, guarantee it. permalink parent award report block reply\nUsernameChexOut 4 points 4 days ago Republicans* permalink parent award report block reply Than0sIII 5 points 4 days ago Republicucks. permalink parent award report block reply ingrowntoenail 3 points 4 days ago Republicants permalink parent award report block reply\nThan0sIII 5 points 4 days ago Republicucks. permalink parent award report block reply ingrowntoenail 3 points 4 days ago Republicants permalink parent award report block reply\ningrowntoenail 3 points 4 days ago Republicants permalink parent award report block reply\nViewer01 2 points 4 days ago Man this week I stumbled into Christian X sphere. Christian men have absolutely lost the plot. I deadass got into an argument with a “Christian feminist.” They’ve let their women run wild. Imagine reading the Bible and thinking it doesn’t clearly outline men having dominion over women. permalink parent award report block reply x79q3pb 2 points 4 days ago X You were arguing with a Jeet, guarantee it. permalink parent award report block reply\nx79q3pb 2 points 4 days ago X You were arguing with a Jeet, guarantee it. permalink parent award report block reply\nDiamondDroid 8 points 4 days ago There can be no deal with those lairs thieves and murderers. Clean CR or die! And if the filibuster is nuked DO IT ALL right away. One day voting, one day counting, paper ballots, revoke anchor baby status, abolish the FED. And More! Do it ALL and do it so fast even a libtard tsunami of Hawaii judges won't be able keep up. permalink award report block reply Krat 1 points 4 days ago Anything else leaves us enslaved. And while they are trying to catch up pass shit anyways and start acting on the shit thats passed so itll be too late to do anything about it permalink parent award report block reply\nKrat 1 points 4 days ago Anything else leaves us enslaved. And while they are trying to catch up pass shit anyways and start acting on the shit thats passed so itll be too late to do anything about it permalink parent award report block reply\nMemeWarsVet 8 points 4 days ago Doggie crack = zoomies. That's all I got. permalink award report block reply\nmohel 7 points 4 days ago Only a LOSER Rand Paul enters the chat permalink award report block reply\nThan0sIII 7 points 4 days ago Nation-wide voter ID for federal elections is the only way we can combat cheating at this point.  And even then, Democrats will sue to make sure they can still rig state elections, as well as do the insane redistricting bullshit. We can't afford to keep playing to a set of arbitrary rules that Democrats haven't been playing by to begin with.  You can't argue morality/ethics with those who will simply redefine those values should they get in power again. permalink award report block reply\nbearhugprolapse 6 points 4 days ago can i crack dat dawg? permalink award report block reply\nDingleBalls 5 points 4 days ago Crack that dog! permalink award report block reply\nbumpman 3 points 4 days ago The filibuster preferably should be ended, if not, there needs to be stronger rules written that the democrats can’t end it next time they are in power. This needs to be settled, we can’t trust democrats permalink award report block reply grad16uc 1 points 4 days ago Let them have it. If whatever they do is a catastrophe, they have to own it then. The filibuster serves literally one purpose for both parties - an excuse to not do anything. permalink parent award report block reply\ngrad16uc 1 points 4 days ago Let them have it. If whatever they do is a catastrophe, they have to own it then. The filibuster serves literally one purpose for both parties - an excuse to not do anything. permalink parent award report block reply\nReallyGayMods 3 points 4 days ago It seems like all of you are saying \"Nuke the filibuster, no more mail ballots, one day voting\" Mail in and voting month is all set by the states, not the federal government. So that won't work. And now dems would have the filibuster gone and once they take over, they have permanent rule Getting rid of the filibuster is a terrible idea permalink award report block reply thunderpussy 3 points 4 days ago Indeed. We don't really even have 50 votes on most issues currently, and believe me, there is at least a third of the Senate that hide behind Murkoski's, Collins, and Paul's, \"no\" votes. permalink parent award report block reply Klaus73 3 points 4 days ago And covers way more then the \"Good shit\" people want. The argument that the dems next win will tear down the fillibuster is an assumption; the reality that tearing down the fillibuster means people will be constantly getting fucked via see-saw however is a certainty. permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago Exactly this. It's been my main point in every argument about the filibuster. Sure, it locks down government on some issues, but it also helps ensure that neither side rams through a bunch of bullshit to fuck over the general populace. Without it, none of us would have guns right now. permalink parent award report block reply\nthunderpussy 3 points 4 days ago Indeed. We don't really even have 50 votes on most issues currently, and believe me, there is at least a third of the Senate that hide behind Murkoski's, Collins, and Paul's, \"no\" votes. permalink parent award report block reply\nKlaus73 3 points 4 days ago And covers way more then the \"Good shit\" people want. The argument that the dems next win will tear down the fillibuster is an assumption; the reality that tearing down the fillibuster means people will be constantly getting fucked via see-saw however is a certainty. permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago Exactly this. It's been my main point in every argument about the filibuster. Sure, it locks down government on some issues, but it also helps ensure that neither side rams through a bunch of bullshit to fuck over the general populace. Without it, none of us would have guns right now. permalink parent award report block reply\nConfusedAngryArmed 1 points 4 days ago Exactly this. It's been my main point in every argument about the filibuster. Sure, it locks down government on some issues, but it also helps ensure that neither side rams through a bunch of bullshit to fuck over the general populace. Without it, none of us would have guns right now. permalink parent award report block reply\nTrue_Curmudgeon 2 points 4 days ago This place isnt suitable for a constitutional republic anymore permalink award report block reply\nShotgunParade69x 2 points 4 days ago Everyone contact your representative and DO THIS!!  It’s really our last chance at moving things in the right direction - permalink award report block reply\nckover9000 2 points 4 days ago I keep losing track of what side of the filibuster I'm supposed to be on. Since the GOP is actively opening the door to losing the House next year aren't we probably going to need it? I'm not counting on this clownass \"majority\" to get enough done to sit comfy. permalink award report block reply ConfusedAngryArmed 2 points 4 days ago That's been my take as well. permalink parent award report block reply\nConfusedAngryArmed 2 points 4 days ago That's been my take as well. permalink parent award report block reply\nBlackFolk 2 points 4 days ago DO IT ALREADY AND QUIT YAPPING ABOUT IT permalink award report block reply\nLight_HIV_Effect 2 points 4 days ago I don't know. Do you want to be powerless when democrats take back control of the senate? Of course, none of this would probably be happening now if the leadership in the senate actually supported the candidates from swing states that Trump won. We'd be looking at 58 seats, and I'm sure you could pick off one senator aside from Fetterneck. permalink award report block reply\nReallyGayMods 2 points 4 days ago Terminating the filibuster is an awful idea permalink award report block reply\nTheJakeFroggy 2 points 4 days ago I will continue to scream it from the rooftops: If the Republicans just flat out refuse to work with Trump and enact his agenda, then at that point Trump will have literally no other choice but to invoke the Insurrection Act and get the military to perform a swift takedown of the corrupt people in government. He knows that option exists. He mentioned it in a few interviews last month and even said he'd be up to using it if he had to. And it's why I won't rule it out and believe there may very well be a chance that he uses it as a last resort. permalink award report block reply Ghostphaez 6 points 4 days ago Dude, stop living in fantasy land! Trump will never, ever do this. permalink parent award report block reply\nGhostphaez 6 points 4 days ago Dude, stop living in fantasy land! Trump will never, ever do this. permalink parent award report block reply\nnoPTSDforMePlease 2 points 4 days ago I.wonder if the filibuster termination is real, or just leverage to get what he wants out of the shut down. Probably a mix of both. permalink award report block reply\nMAGALADON9 2 points 4 days ago We don't have 51 votes though   😢 permalink award report block reply\nMasterChief08 2 points 4 days ago ABOLISH THE FILLIBUSTER AND PACK THE COURTS permalink award report block reply\n2008RonPaul2012 2 points 4 days ago If there is one things dogs are known for its how often they crack. Really paints the picture in a non-confusing way permalink award report block reply\nKilroy 2 points 4 days ago I can't tell you how much I despise the Republican party, I've been watching these clowns for going on 60 years. Trump, watch your back, you're surrounded by ass kissing snakes. Their not to nice, their not stupid, they are evil blood sucking Communist dressed as good Christian conservatives. permalink award report block reply\nDrVSGGEOTUSPhD 2 points 4 days ago Cracking like dogs? permalink award report block reply\nAppalachianTactical 2 points 4 days ago Filibuster gone.\nThen they just send every red cent to israel. Id be more willing to support removing it if yhe cucking for israel hadnt been so obvious. permalink award report block reply ConfusedAngryArmed 2 points 4 days ago Agreed. permalink parent award report block reply\nConfusedAngryArmed 2 points 4 days ago Agreed. permalink parent award report block reply\nanotherrandomname 2 points 4 days ago Problem remains that the GOP doesn't actually want to implement Trump's agenda. It's not a matter of figuring out how to do it, they simply don't want to do it. permalink award report block reply\nBidensPrisonWallet 2 points 4 days ago What position is Cruz/AIPAC Spokesman taking on this ? permalink award report block reply\nAlvinOfTheTrumpmunks 2 points 4 days ago Still need to deal with the RINOs in the senate. permalink award report block reply\nJustjayce 1 points 4 days ago Our RINOS will fuck it up even without the filibuster permalink award report block reply\nForty_Five 1 points 4 days ago Too bad most of the republicans are losers. permalink award report block reply\nAVeryNakedMan 1 points 4 days ago If we pass national voter ID and abolish unsolicited mail-in ballots, the entire country will shit towards Republicans, because many Dems are only in power due to fraud. Republicans would get a majority so big throughout the country, we might even be able to pass constitutional amendments and fix some serious problems. permalink award report block reply\nTacitus1963 1 points 4 days ago The problem with blowing up the filibuster is that the RINO party is almost as bad as their Demtard buds. They would continue to slow walk all of Trump's agenda. They don't like that he's back in office as it cuts into the status quo of laundering our tax dollars back to all of them. That's the inherent risk in the RINO party getting rid of it.\nThe Demtards will have no problem getting rid of it.\nLook at all the damage they did for 4 years after they stole the election with nary a peep from the RINOs. permalink award report block reply\nDrdonaldjtrump1776 1 points 4 days ago News flash, the Republicans are stupid permalink award report block reply\nSilentbutdeadly 1 points 3 days ago The Democrats would do it.  They would do ANYTHING they could think of to gain the advantage and wouldn’t give a shit about the optics or of it hurt Republicans feelings. permalink award report block reply\nBeardholder 1 points 4 days ago Loser??? Try Traitors Mr president.\nStop calling them out and doing nothing. Send in the dogs (U.S Marshalls) and get them arrested for treason permalink award report block reply\nAmericanJawa 1 points 4 days ago Can Trump please get to those mass firings first? permalink award report block reply\nKeepMarxInTheGround 1 points 4 days ago Ironically enough, the GOP is filled with LOSERS. permalink award report block reply\nKungPaoMcChicken 1 points 4 days ago Can't Democrats just filibuster the vote on getting rid of the filibuster? Explain to me how this works... permalink award report block reply ConfusedAngryArmed 1 points 4 days ago No. Getting rid of the filibuster only requires 51 votes. Getting rid of the \"cloture\" rule requires 60. permalink parent award report block reply\nConfusedAngryArmed 1 points 4 days ago No. Getting rid of the filibuster only requires 51 votes. Getting rid of the \"cloture\" rule requires 60. permalink parent award report block reply\nmikejones 1 points 4 days ago Trump going to make it so voters have a say again. permalink award report block reply Klaus73 1 points 4 days ago Well...unless you voted for the other guys that won... permalink parent award report block reply\nKlaus73 1 points 4 days ago Well...unless you voted for the other guys that won... permalink parent award report block reply\npossibletower 1 points 4 days ago Murkowski/Collins/Rand Paul will vote no to this though. Hopefully the other 50 GOP senators finally get their heads out of their asses and nuke the filibuster. They only need 50 plus the VP. permalink award report block reply\nastralentity 1 points 4 days ago This is the way. permalink award report block reply\nBlueKentuckyGirl 1 points 4 days ago It’s about giving billions to insurance companies money without them competing in the marketplace. Dems commies, Republicans, Adam Smith. Capitalism and competition keeps everyone well. permalink award report block reply\nGhostphaez 1 points 4 days ago \"Only a LOSER....\" In other words, 99% of elected \"Republicans\". permalink award report block reply\nPeaceMakerDJT 1 points 4 days ago What are the odds Trump makes deals with rinos to get this passed? permalink award report block reply\nBlueKentuckyGirl 1 points 4 days ago Yes Republicans, Thune, no compromise on this issue. permalink award report block reply\nKrat 1 points 4 days ago Do it anyways like they would permalink award report block reply\nPatriotSkorzeny 1 points 4 days ago Voter ID wasn’t in the BBB? permalink award report block reply\nsordfysh PRO 1 points 4 days ago Could the Republicans at least make the Dems filibuster? It's not even the case that they are filibustering. The Republicans are telling us they are filibustering but they are actually just threatening to do so. permalink award report block reply\nSavingPrivateGrace 1 points 4 days ago Keep it shutdown.  The Republicans should sleep with these mad dogs for at least 30 days.  Hold the line.  No healthcare for illegals period. permalink award report block reply\nSnerdley 1 points 4 days ago Nuke the filibuster, then immediately pass voting reforms to prevent a democrat (cheating) surge. This HAS to be done just to get the voting reforms. If not, they will eventually cheat and surge and then THEY will nuke the filibuster. Its time has come. Kill it. permalink award report block reply\nSquirreleeDan 1 points 4 days ago Can anyone care about the class that’s being completely fucked for the last 10 years for fucking once? permalink award report block reply\ncanadianhere 1 points 4 days ago So what happened with that guy who said they were prepared to give the Democrats everything? Is that a different issue? permalink award report block reply DatTrumpDoh 2 points 4 days ago Thune was misquoted by clickbaiting journos. He never said anything like that. permalink parent award report block reply Dangerous 1 points 4 days ago Except they all decided to suddenly really strap in only after allowing Democrats to win several major elections... https://patriots.win/p/1ARK0TSP1Y/-sen-adam-schiff-dca-shutdown-hu/c And here is Trump also warning that a right wing response is inevitable if the left doesn't tamper down its behavior, and that he doesn't want that: https://thehill.com/opinion/lindseys-lens/5523829-escalating-rhetoric-violence-trump/ To me this displays that Trump's GOP coalition is clearly very interested in keeping the same left-right status quo we have had already for the last several decades permalink parent award report block reply\nDatTrumpDoh 2 points 4 days ago Thune was misquoted by clickbaiting journos. He never said anything like that. permalink parent award report block reply Dangerous 1 points 4 days ago Except they all decided to suddenly really strap in only after allowing Democrats to win several major elections... https://patriots.win/p/1ARK0TSP1Y/-sen-adam-schiff-dca-shutdown-hu/c And here is Trump also warning that a right wing response is inevitable if the left doesn't tamper down its behavior, and that he doesn't want that: https://thehill.com/opinion/lindseys-lens/5523829-escalating-rhetoric-violence-trump/ To me this displays that Trump's GOP coalition is clearly very interested in keeping the same left-right status quo we have had already for the last several decades permalink parent award report block reply\nDangerous 1 points 4 days ago Except they all decided to suddenly really strap in only after allowing Democrats to win several major elections... https://patriots.win/p/1ARK0TSP1Y/-sen-adam-schiff-dca-shutdown-hu/c And here is Trump also warning that a right wing response is inevitable if the left doesn't tamper down its behavior, and that he doesn't want that: https://thehill.com/opinion/lindseys-lens/5523829-escalating-rhetoric-violence-trump/ To me this displays that Trump's GOP coalition is clearly very interested in keeping the same left-right status quo we have had already for the last several decades permalink parent award report block reply\nwarlord30 1 points 4 days ago amen trump! 🙏 permalink award report block reply\nsir_rockness 1 points 4 days ago The uniparty is without a doubt nothing but losers... America last... all of them permalink award report block reply\nMAGALADON9 0 points 4 days ago This is like the 48th time he (DJT) was using \"dog\" negatively.  Can someone please tell him to stop that shit. permalink award report block reply\nYodaBannon 0 points 4 days ago Thank you Mr. President, thank you. permalink award report block reply\nrightoverthere -1 points 4 days ago we need bigger government. more laws and regulations passed. we don't need any checks and balances. that shit is for before 2020. we just need more and more government asap. the fucking filibuster is like a roadblock that prevents government from growing. remove the roadblock and start passing legislation now! don't think long term think what can be accomplished in 2025 alone permalink award report block reply Klaus73 2 points 4 days ago Aye - unimpeded government is a awesome idea! permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago What could possibly go wrong, right? Right!? permalink parent award report block reply Klaus73 2 points 3 days ago I mean its right up there with essentially insulating the US from the world markets by tossing up massive trade barriers - I mean US deficit on trade is almost 1 Trillion this year...so even if we use the optimistic number that's a 200 billion shortfall after tariffs - and that's only going to worsen. The thing is the government has a really bad habit of not being able to admit when its probably wrong - I don't think the solution is to make it impossible for it to walk back from when it fucks up. Trump isn't infallible and I hate that his solution to his inability to negotiate with the democrats is to simply cut them out of the process entirely - I assumed the US practices democracy but it really does seem more and more like Trump has no time for that. permalink parent award report block reply\nKlaus73 2 points 4 days ago Aye - unimpeded government is a awesome idea! permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago What could possibly go wrong, right? Right!? permalink parent award report block reply Klaus73 2 points 3 days ago I mean its right up there with essentially insulating the US from the world markets by tossing up massive trade barriers - I mean US deficit on trade is almost 1 Trillion this year...so even if we use the optimistic number that's a 200 billion shortfall after tariffs - and that's only going to worsen. The thing is the government has a really bad habit of not being able to admit when its probably wrong - I don't think the solution is to make it impossible for it to walk back from when it fucks up. Trump isn't infallible and I hate that his solution to his inability to negotiate with the democrats is to simply cut them out of the process entirely - I assumed the US practices democracy but it really does seem more and more like Trump has no time for that. permalink parent award report block reply\nConfusedAngryArmed 1 points 4 days ago What could possibly go wrong, right? Right!? permalink parent award report block reply Klaus73 2 points 3 days ago I mean its right up there with essentially insulating the US from the world markets by tossing up massive trade barriers - I mean US deficit on trade is almost 1 Trillion this year...so even if we use the optimistic number that's a 200 billion shortfall after tariffs - and that's only going to worsen. The thing is the government has a really bad habit of not being able to admit when its probably wrong - I don't think the solution is to make it impossible for it to walk back from when it fucks up. Trump isn't infallible and I hate that his solution to his inability to negotiate with the democrats is to simply cut them out of the process entirely - I assumed the US practices democracy but it really does seem more and more like Trump has no time for that. permalink parent award report block reply\nKlaus73 2 points 3 days ago I mean its right up there with essentially insulating the US from the world markets by tossing up massive trade barriers - I mean US deficit on trade is almost 1 Trillion this year...so even if we use the optimistic number that's a 200 billion shortfall after tariffs - and that's only going to worsen. The thing is the government has a really bad habit of not being able to admit when its probably wrong - I don't think the solution is to make it impossible for it to walk back from when it fucks up. Trump isn't infallible and I hate that his solution to his inability to negotiate with the democrats is to simply cut them out of the process entirely - I assumed the US practices democracy but it really does seem more and more like Trump has no time for that. permalink parent award report block reply\nthe_new_one 2 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nTheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:03:48.506171Z"
}