{
  "id": "1ARK9nNz2H",
  "url": "https://patriots.win/p/1ARK9nNz2H/good-morning-my-fellow-americans/c",
  "content": "437 Good morning my fellow Americans posted 7 hours ago by DeepStateEnemy 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save Pepbrandt 19 points 7 hours ago H1Bs, the new HIVs. permalink award report block reply MastaJoda 12 points 6 hours ago Bro, we can take 18 yr olds out of HS, give them 1.5 yrs of training and have them working on nuclear subs in the military, but we cant educate our population to fill high tech jobs in America? Dude, FUCK TRUMP. permalink parent award report block reply ReleasetheList 12 points 6 hours ago How did America ever become the world's superpower when we had a 90%+ white demographic if we need poopjeets to train our retarded asses? permalink award report block reply LostElf 4 points 7 hours ago Sweeping gallantly across the oceans wide to show us how it's done. permalink award report block reply Hikedelics 3 points 5 hours ago I’ve been both disheartened and fucking pissed at the Bush, Obama, and Biden admins, but I can say I’m not sure if I’ve ever been insulted as I am from what he said last night. What in the fuck.. permalink award report block reply DeepStateParasite 2 points 2 hours ago The non-English-speaking idiots working at the airports driving the electric carts, pushing wheelchairs, etc.  it's frightening to think how far we'd fall without them.  (My parents comment that flying feels like you're visiting a 3rd world country now...) permalink award report block reply R3tro 2 points 2 hours ago Funny Story… last night after leaving from teaching my college class (yes , some of us based bastards due teach college)… i stopped off at trumps favorite place (Mc Donalds) to grab an ice coffee for the 45 minute ride home.  So as I stop off, a guy with a think indian accent chimes in, takes my order and tells me to pull up.  When I pull to the window, in his rough english , recites a different order.  After correcting him that the coffee shouldn’t be $21.50, the other guy ( a Guatemalan I believe) steps in and corrects the Indian.  The Guatemalan tells the indian to get my coffee while the Guatemalan cashes me out.   I get my coffee, the indian guy heads back to the other drive through window, and the Guatemalan says to me in his spanish accent “ these indian guys… can understand them, can’t train them either”…. I laughed so hard at this, where the guy thought I was laughing at his joke , when in fact I was laughing at the irony of the entire situation. Simply wild…. permalink award report block reply cosmos411 1 points 4 hours ago Just don't forget how to shower or wash your ass .. you might not like their approach. permalink award report block reply happyfave -17 points 6 hours ago Pretty sure we took all the best scientists from Germany after WW2 as well.  There is nothing wrong with bringing actual smart people into the country.  Everyone needs to fucking relax.  The people who help build missiles aren't the ones shitting in the streets and eating with their hands.    Should we limit immigration by 99% yep, but there are still skilled people we should target.  Fucking cry fest in here lately. permalink award report block reply YouEssAye 16 points 6 hours ago Germans =/= Indians We already have the O-1 visa and EB-1 visa programs for extraordinarily talented individuals. Stop defending the destruction of your country, leave the cult and think for yourself. Edit: Also Operation Paperclip only brought over like 1600 German scientists. permalink parent award report block reply AK_lurker_not_a_glow 3 points 6 hours ago And yet we got bill gates and communist professors from that small amount permalink parent award report block reply JBlaze056 4 points 5 hours ago The work we are importing people to do runs the full spectrum of job opportunities.  \"Bringing in actual smart people\" has not been the standard for quite some time (the mid 60's). permalink parent award report block reply Awakened 4 points 5 hours ago Ya gotta go back, Raj. permalink parent award report block reply LiquidSun 3 points 6 hours ago We can't source them from a white country? permalink parent award report block reply RedStoneDeepState -5 points 6 hours ago Europeans are deindustrialized. No. They are absolutely worthless as engineers for the most part. permalink parent award report block reply HumblePepe 3 points 5 hours ago America was a melting pot for WHITE peoples of different cultures, putting down their centuries or even millennia grudges to create a nation that we enjoy to this day. Indians can't even make India great. What makes anyone believe they'll make our country better? permalink parent award report block reply load 1 more comments...\nPepbrandt 19 points 7 hours ago H1Bs, the new HIVs. permalink award report block reply MastaJoda 12 points 6 hours ago Bro, we can take 18 yr olds out of HS, give them 1.5 yrs of training and have them working on nuclear subs in the military, but we cant educate our population to fill high tech jobs in America? Dude, FUCK TRUMP. permalink parent award report block reply\nMastaJoda 12 points 6 hours ago Bro, we can take 18 yr olds out of HS, give them 1.5 yrs of training and have them working on nuclear subs in the military, but we cant educate our population to fill high tech jobs in America? Dude, FUCK TRUMP. permalink parent award report block reply\nReleasetheList 12 points 6 hours ago How did America ever become the world's superpower when we had a 90%+ white demographic if we need poopjeets to train our retarded asses? permalink award report block reply\nLostElf 4 points 7 hours ago Sweeping gallantly across the oceans wide to show us how it's done. permalink award report block reply\nHikedelics 3 points 5 hours ago I’ve been both disheartened and fucking pissed at the Bush, Obama, and Biden admins, but I can say I’m not sure if I’ve ever been insulted as I am from what he said last night. What in the fuck.. permalink award report block reply\nDeepStateParasite 2 points 2 hours ago The non-English-speaking idiots working at the airports driving the electric carts, pushing wheelchairs, etc.  it's frightening to think how far we'd fall without them.  (My parents comment that flying feels like you're visiting a 3rd world country now...) permalink award report block reply\nR3tro 2 points 2 hours ago Funny Story… last night after leaving from teaching my college class (yes , some of us based bastards due teach college)… i stopped off at trumps favorite place (Mc Donalds) to grab an ice coffee for the 45 minute ride home.  So as I stop off, a guy with a think indian accent chimes in, takes my order and tells me to pull up.  When I pull to the window, in his rough english , recites a different order.  After correcting him that the coffee shouldn’t be $21.50, the other guy ( a Guatemalan I believe) steps in and corrects the Indian.  The Guatemalan tells the indian to get my coffee while the Guatemalan cashes me out.   I get my coffee, the indian guy heads back to the other drive through window, and the Guatemalan says to me in his spanish accent “ these indian guys… can understand them, can’t train them either”…. I laughed so hard at this, where the guy thought I was laughing at his joke , when in fact I was laughing at the irony of the entire situation. Simply wild…. permalink award report block reply\ncosmos411 1 points 4 hours ago Just don't forget how to shower or wash your ass .. you might not like their approach. permalink award report block reply\nhappyfave -17 points 6 hours ago Pretty sure we took all the best scientists from Germany after WW2 as well.  There is nothing wrong with bringing actual smart people into the country.  Everyone needs to fucking relax.  The people who help build missiles aren't the ones shitting in the streets and eating with their hands.    Should we limit immigration by 99% yep, but there are still skilled people we should target.  Fucking cry fest in here lately. permalink award report block reply YouEssAye 16 points 6 hours ago Germans =/= Indians We already have the O-1 visa and EB-1 visa programs for extraordinarily talented individuals. Stop defending the destruction of your country, leave the cult and think for yourself. Edit: Also Operation Paperclip only brought over like 1600 German scientists. permalink parent award report block reply AK_lurker_not_a_glow 3 points 6 hours ago And yet we got bill gates and communist professors from that small amount permalink parent award report block reply JBlaze056 4 points 5 hours ago The work we are importing people to do runs the full spectrum of job opportunities.  \"Bringing in actual smart people\" has not been the standard for quite some time (the mid 60's). permalink parent award report block reply Awakened 4 points 5 hours ago Ya gotta go back, Raj. permalink parent award report block reply LiquidSun 3 points 6 hours ago We can't source them from a white country? permalink parent award report block reply RedStoneDeepState -5 points 6 hours ago Europeans are deindustrialized. No. They are absolutely worthless as engineers for the most part. permalink parent award report block reply HumblePepe 3 points 5 hours ago America was a melting pot for WHITE peoples of different cultures, putting down their centuries or even millennia grudges to create a nation that we enjoy to this day. Indians can't even make India great. What makes anyone believe they'll make our country better? permalink parent award report block reply load 1 more comments...\nYouEssAye 16 points 6 hours ago Germans =/= Indians We already have the O-1 visa and EB-1 visa programs for extraordinarily talented individuals. Stop defending the destruction of your country, leave the cult and think for yourself. Edit: Also Operation Paperclip only brought over like 1600 German scientists. permalink parent award report block reply AK_lurker_not_a_glow 3 points 6 hours ago And yet we got bill gates and communist professors from that small amount permalink parent award report block reply\nAK_lurker_not_a_glow 3 points 6 hours ago And yet we got bill gates and communist professors from that small amount permalink parent award report block reply\nJBlaze056 4 points 5 hours ago The work we are importing people to do runs the full spectrum of job opportunities.  \"Bringing in actual smart people\" has not been the standard for quite some time (the mid 60's). permalink parent award report block reply\nAwakened 4 points 5 hours ago Ya gotta go back, Raj. permalink parent award report block reply\nLiquidSun 3 points 6 hours ago We can't source them from a white country? permalink parent award report block reply RedStoneDeepState -5 points 6 hours ago Europeans are deindustrialized. No. They are absolutely worthless as engineers for the most part. permalink parent award report block reply\nRedStoneDeepState -5 points 6 hours ago Europeans are deindustrialized. No. They are absolutely worthless as engineers for the most part. permalink parent award report block reply\nHumblePepe 3 points 5 hours ago America was a melting pot for WHITE peoples of different cultures, putting down their centuries or even millennia grudges to create a nation that we enjoy to this day. Indians can't even make India great. What makes anyone believe they'll make our country better? permalink parent award report block reply",
  "fetched_at": "2025-11-12T21:06:23.948357Z"
}