{
  "id": "1ARK9l8IFv",
  "url": "https://patriots.win/p/1ARK9l8IFv/the-shutdown-was-always-going-to/c",
  "content": "1153 The Shutdown Was Always Going To End With Democrats Caving And Looking Ridiculous (thefederalist.com) posted 1 day ago by Sea_Still 52 comments award share report block Shutdown Was Always Going To End With Ridiculous Dems Caving Even after some modest electoral victories just last week, the Democrat Party is still a ridiculous, anti-American organization. thefederalist.com\n52 comments Sort by Top Top New Worst Old Save Spawnlingman 53 points 1 day ago We all look ridiculous while we're still paying taxes. The rest of this is theater. permalink award report block reply Run_over_Antifa 26 points 1 day ago We are the losers in all this, at least Shanequa and Jaquarias will get to buy candy and soda again on my dime. permalink parent award report block reply JBlaze056 15 points 1 day ago It is about time for another tax revolt from those of us who actually pay for everything.   The gib takers and those who offer to gib them all our taxes have become way to emboldened. permalink parent award report block reply utfanx2 5 points 24 hours ago Waiting on a small town to declare themselves a sanctuary city against federal taxes. Property values would quadruple overnight. permalink parent award report block reply Repentnow 2 points 20 hours ago Until the houses are sold off in an IRS auction. permalink parent award report block reply view 1 more comments... JesusTheOnlyWay 1 points 21 hours ago It's so far beyond the time, it's beyond description permalink parent award report block reply UsernameChexOut -5 points 1 day ago Don't forget that they'll also get that sweet, sweet tariff check while we, the people who actually paid the tariff tax, will get fucked again as usual. Thanks Comrade Donald for the great wealth redistribution of 2025! permalink parent award report block reply possibletower -8 points 1 day ago Cope, stormfag 🤣 It says a lot that you fags are angrier about Americans getting EBTs than illegal aliens getting it. Better yet why don't you stormfags move back to Europe since you faggots always talk about how amazing Europe is? You fuckers always bitch about America. How about just move back to Europe, the creators and home of socialism? permalink parent award report block reply m0ntsta 6 points 1 day ago Is it weird growing up not knowing your father, Tyrone? permalink parent award report block reply RomanCatholicPatriot 4 points 1 day ago It's anaconda aka maltese-poodle aka makersmarx aka grapefruitsheep aka applebandicoot (and M-A-N-Y others) permalink parent award report block reply RomanCatholicPatriot 3 points 1 day ago mangokiwi permalink parent award report block reply Run_over_Antifa 6 points 1 day ago I know what a \"stormfag\" is from this page, it's funny how when you have no argument its \"stomrfag\" \"doomer.\" I don't want anyone to get EBT, at all. Local churches should feed the poor. I am am not a \"stormfag\" but you are an actual faggot. permalink parent award report block reply Coprolite 2 points 1 day ago Gibs me dat. permalink parent award report block reply AccelerateAlready 1 points 19 hours ago \"Americans\" permalink parent award report block reply Pongpagongbatibot -2 points 1 day ago This is a typical iranian groyper response. Pretends to be America first, Trump-hate is implied (look at the replies below by fellow Iranian groypers), has all the up-votes. Yep, the comment is made from iran permalink parent award report block reply Spawnlingman 1 points 21 hours ago Hmm looks like USA and white kids outside my windows to me. 🤷‍♂️ permalink parent award report block reply possibletower -4 points 1 day ago Cope, faggot. Everytime Nick Fuentes crashes out is a beautiful moment. Now he and his fellow faggots like you can't blame Trump for everything related to the shutdown so you fags shift the goalposts and still try to blame Trump for something. permalink parent award report block reply Appeal2Heaven98 -3 points 23 hours ago Here's your daily reminder that questioning Israel's incentives, even being anti-Israel, is not antisemitic. permalink parent award report block reply MewThat 15 points 1 day ago They look ridiculous?  Aren't we hiring back all the fed fat we just fired?  with back pay? permalink award report block reply RedStoneDeepState 8 points 1 day ago They weren't fired they were furloughed. permalink parent award report block reply anotherthing 3 points 1 day ago Keep in mind this will be the second time we've continued the Biden era spending budget when the GOP has Congress and the Presidency. So, I don't see how the Democrats are looking ridiculous when they have the GOP demanding the spending levels they were mad about a year ago. permalink parent award report block reply ConfusedAngryArmed 1 points 18 hours ago They're also getting a vote on Obamacare. permalink parent award report block reply Yawnz13 1 points 1 day ago No?  It's only passed in the Senate.  It still has to pass the House and be signed by Trump. permalink parent award report block reply DeportThemAllForever 0 points 23 hours ago It’s rediculous because that photo has no sombrero.  Missed opportunity. permalink parent award report block reply keeman 14 points 1 day ago What we republicans accomplished was to re-authorize Biden's budget without adding even more ridiculous spending.  All branches of government are R controlled and the best they can do is kick the can down the road and keep the drunken sailor levels of spending going.  Yay... permalink award report block reply Aggrieved03 5 points 1 day ago Many here are idiots. We're cheering on our own destruction. permalink parent award report block reply RedStoneDeepState 3 points 1 day ago Up until the end of the year. permalink parent award report block reply Choppermagic 5 points 1 day ago honestly, the Republicans in congress are so weak, the dems strategy of making them give up through the media has been proven over time permalink award report block reply larrry 3 points 1 day ago If you are still a democrat you need to examine yourself and figure what went wrong, maybe your parents were cousins permalink award report block reply GTHAYS 3 points 1 day ago Tim KAINE always looks like he's found another kid in his closet. permalink award report block reply GunsWithGooglyEyes 3 points 1 day ago Actual moloch worshipping retarded faggots look ridiculous, yes. When have they not? permalink award report block reply YodaBannon 3 points 1 day ago dems have been lookin ridiculous for the last decade, thanks DJT permalink award report block reply TrumpChampBelt 3 points 1 day ago it is insane to me that a group of people could fuck up so badly so often and still be within reach of any political leadership anywhere on this planet. people are fucking retarded. permalink award report block reply PhantomShield72 2 points 1 day ago They will reject the reality that they look ridiculous. Their supporters will reject the reality that they look ridiculous. The Media will PROJECT the false reality that they don't look ridiculous. The Left will still somehow gain ground despite absolutely failing. Rinse, Repeat. permalink award report block reply The_RedWolf 2 points 24 hours ago NGL though, I did expect the Democrats to get something more, its rarely such a flat out victory. permalink award report block reply IvIA6A 2 points 1 day ago The demands were unserious from the beginning, and they were going to win in the blue states anyway, so I don't know what it was all for. It's more TDS \"resistance\" movement, and frankly the Senate should know better permalink award report block reply JBlaze056 1 points 1 day ago I’m not as sure about that as the media was doing their best to convince the general public this was all the GOP’s fault because they “control all of Congress and the WH”.  They really think people are stupid because the senate cannot be controlled unless there is a party with 67 members voting in lock step, and they were right that many people out there are stupid.   Luckily there is a big enough coalition of people in society that know about the nature of the liars in the media. permalink award report block reply MisprisionIsEvil 1 points 22 hours ago The Democrats I know think the Democrats are the good guys and the shutdown was done by the Republicans to starve people. permalink award report block reply ShekelJa 1 points 22 hours ago They control the flow of information, so it will end with according to whatever they want it to end, just ask any retard how it went down and you will understand what I mean. permalink award report block reply RobinNet 1 points 1 day ago Didn't Timmy K used to sniff Killary's cabbage farts on the campaign bus? Can't look more ridiculous than that. permalink award report block reply BadBrainsBuzzcocks 1 points 1 day ago Part of the deal was rehiring every government worker that was laid off. WTH? That was the one thing I was fairly excited about. Actually shrinking the government workforce. permalink award report block reply Krat 2 points 1 day ago Its a form of universal basic income.... its not the function of their job or that anyone of really does anything..... its an excuse for giving your money to someone else basically permalink parent award report block reply JoinTheDiscussion 1 points 23 hours ago Just in time for the RINOs not to go the nuclear option.. How fucking convenient!! permalink award report block reply GreyKnight 1 points 1 day ago They were apparently just waiting until after some elections…and their voters will forget by the time of the next elections…and they don’t care about our opinions on them… Just another month for fat cats in government. permalink award report block reply mohel 1 points 18 hours ago What did RINOs gain? permalink award report block reply politicsaside 1 points 1 day ago It should've ended with us going nuclear, taking credit for saving the country, then passing the MAGA agenda, but congress is a bunch of pussies. permalink award report block reply clownworld30330 1 points 1 day ago What matters is what normies perceive. I don’t think normies perceive the dems as looking ridiculous. permalink award report block reply dr_gonzo 0 points 22 hours ago Ya, now that we've reopened history's largest and most expensive government, we really showed those lefty Democrats didn't we? 🤪 permalink award report block reply f_bastiat -2 points 23 hours ago From literally everything I have read and heard, red team caved hard. Are all these posts some sort of psyop? permalink award report block reply SomeGuyOnTheInternet -3 points 1 day ago Yeah, but they swept the elections so I imagine they deem it worth it. permalink award report block reply Corse46 -3 points 1 day ago They blew us out in the elections, and we are still \"continuing\" Nancy Pelosi's budget from 2022, after holding the House since 2023 and the White House and Senate since 2025. If you think this is a win, you are retarded. permalink award report block reply\nSpawnlingman 53 points 1 day ago We all look ridiculous while we're still paying taxes. The rest of this is theater. permalink award report block reply Run_over_Antifa 26 points 1 day ago We are the losers in all this, at least Shanequa and Jaquarias will get to buy candy and soda again on my dime. permalink parent award report block reply JBlaze056 15 points 1 day ago It is about time for another tax revolt from those of us who actually pay for everything.   The gib takers and those who offer to gib them all our taxes have become way to emboldened. permalink parent award report block reply utfanx2 5 points 24 hours ago Waiting on a small town to declare themselves a sanctuary city against federal taxes. Property values would quadruple overnight. permalink parent award report block reply Repentnow 2 points 20 hours ago Until the houses are sold off in an IRS auction. permalink parent award report block reply view 1 more comments... JesusTheOnlyWay 1 points 21 hours ago It's so far beyond the time, it's beyond description permalink parent award report block reply UsernameChexOut -5 points 1 day ago Don't forget that they'll also get that sweet, sweet tariff check while we, the people who actually paid the tariff tax, will get fucked again as usual. Thanks Comrade Donald for the great wealth redistribution of 2025! permalink parent award report block reply possibletower -8 points 1 day ago Cope, stormfag 🤣 It says a lot that you fags are angrier about Americans getting EBTs than illegal aliens getting it. Better yet why don't you stormfags move back to Europe since you faggots always talk about how amazing Europe is? You fuckers always bitch about America. How about just move back to Europe, the creators and home of socialism? permalink parent award report block reply m0ntsta 6 points 1 day ago Is it weird growing up not knowing your father, Tyrone? permalink parent award report block reply RomanCatholicPatriot 4 points 1 day ago It's anaconda aka maltese-poodle aka makersmarx aka grapefruitsheep aka applebandicoot (and M-A-N-Y others) permalink parent award report block reply RomanCatholicPatriot 3 points 1 day ago mangokiwi permalink parent award report block reply Run_over_Antifa 6 points 1 day ago I know what a \"stormfag\" is from this page, it's funny how when you have no argument its \"stomrfag\" \"doomer.\" I don't want anyone to get EBT, at all. Local churches should feed the poor. I am am not a \"stormfag\" but you are an actual faggot. permalink parent award report block reply Coprolite 2 points 1 day ago Gibs me dat. permalink parent award report block reply AccelerateAlready 1 points 19 hours ago \"Americans\" permalink parent award report block reply Pongpagongbatibot -2 points 1 day ago This is a typical iranian groyper response. Pretends to be America first, Trump-hate is implied (look at the replies below by fellow Iranian groypers), has all the up-votes. Yep, the comment is made from iran permalink parent award report block reply Spawnlingman 1 points 21 hours ago Hmm looks like USA and white kids outside my windows to me. 🤷‍♂️ permalink parent award report block reply possibletower -4 points 1 day ago Cope, faggot. Everytime Nick Fuentes crashes out is a beautiful moment. Now he and his fellow faggots like you can't blame Trump for everything related to the shutdown so you fags shift the goalposts and still try to blame Trump for something. permalink parent award report block reply Appeal2Heaven98 -3 points 23 hours ago Here's your daily reminder that questioning Israel's incentives, even being anti-Israel, is not antisemitic. permalink parent award report block reply\nRun_over_Antifa 26 points 1 day ago We are the losers in all this, at least Shanequa and Jaquarias will get to buy candy and soda again on my dime. permalink parent award report block reply JBlaze056 15 points 1 day ago It is about time for another tax revolt from those of us who actually pay for everything.   The gib takers and those who offer to gib them all our taxes have become way to emboldened. permalink parent award report block reply utfanx2 5 points 24 hours ago Waiting on a small town to declare themselves a sanctuary city against federal taxes. Property values would quadruple overnight. permalink parent award report block reply Repentnow 2 points 20 hours ago Until the houses are sold off in an IRS auction. permalink parent award report block reply view 1 more comments... JesusTheOnlyWay 1 points 21 hours ago It's so far beyond the time, it's beyond description permalink parent award report block reply UsernameChexOut -5 points 1 day ago Don't forget that they'll also get that sweet, sweet tariff check while we, the people who actually paid the tariff tax, will get fucked again as usual. Thanks Comrade Donald for the great wealth redistribution of 2025! permalink parent award report block reply possibletower -8 points 1 day ago Cope, stormfag 🤣 It says a lot that you fags are angrier about Americans getting EBTs than illegal aliens getting it. Better yet why don't you stormfags move back to Europe since you faggots always talk about how amazing Europe is? You fuckers always bitch about America. How about just move back to Europe, the creators and home of socialism? permalink parent award report block reply m0ntsta 6 points 1 day ago Is it weird growing up not knowing your father, Tyrone? permalink parent award report block reply RomanCatholicPatriot 4 points 1 day ago It's anaconda aka maltese-poodle aka makersmarx aka grapefruitsheep aka applebandicoot (and M-A-N-Y others) permalink parent award report block reply RomanCatholicPatriot 3 points 1 day ago mangokiwi permalink parent award report block reply Run_over_Antifa 6 points 1 day ago I know what a \"stormfag\" is from this page, it's funny how when you have no argument its \"stomrfag\" \"doomer.\" I don't want anyone to get EBT, at all. Local churches should feed the poor. I am am not a \"stormfag\" but you are an actual faggot. permalink parent award report block reply Coprolite 2 points 1 day ago Gibs me dat. permalink parent award report block reply AccelerateAlready 1 points 19 hours ago \"Americans\" permalink parent award report block reply\nJBlaze056 15 points 1 day ago It is about time for another tax revolt from those of us who actually pay for everything.   The gib takers and those who offer to gib them all our taxes have become way to emboldened. permalink parent award report block reply utfanx2 5 points 24 hours ago Waiting on a small town to declare themselves a sanctuary city against federal taxes. Property values would quadruple overnight. permalink parent award report block reply Repentnow 2 points 20 hours ago Until the houses are sold off in an IRS auction. permalink parent award report block reply view 1 more comments... JesusTheOnlyWay 1 points 21 hours ago It's so far beyond the time, it's beyond description permalink parent award report block reply\nutfanx2 5 points 24 hours ago Waiting on a small town to declare themselves a sanctuary city against federal taxes. Property values would quadruple overnight. permalink parent award report block reply Repentnow 2 points 20 hours ago Until the houses are sold off in an IRS auction. permalink parent award report block reply view 1 more comments...\nRepentnow 2 points 20 hours ago Until the houses are sold off in an IRS auction. permalink parent award report block reply view 1 more comments...\nJesusTheOnlyWay 1 points 21 hours ago It's so far beyond the time, it's beyond description permalink parent award report block reply\nUsernameChexOut -5 points 1 day ago Don't forget that they'll also get that sweet, sweet tariff check while we, the people who actually paid the tariff tax, will get fucked again as usual. Thanks Comrade Donald for the great wealth redistribution of 2025! permalink parent award report block reply\npossibletower -8 points 1 day ago Cope, stormfag 🤣 It says a lot that you fags are angrier about Americans getting EBTs than illegal aliens getting it. Better yet why don't you stormfags move back to Europe since you faggots always talk about how amazing Europe is? You fuckers always bitch about America. How about just move back to Europe, the creators and home of socialism? permalink parent award report block reply m0ntsta 6 points 1 day ago Is it weird growing up not knowing your father, Tyrone? permalink parent award report block reply RomanCatholicPatriot 4 points 1 day ago It's anaconda aka maltese-poodle aka makersmarx aka grapefruitsheep aka applebandicoot (and M-A-N-Y others) permalink parent award report block reply RomanCatholicPatriot 3 points 1 day ago mangokiwi permalink parent award report block reply Run_over_Antifa 6 points 1 day ago I know what a \"stormfag\" is from this page, it's funny how when you have no argument its \"stomrfag\" \"doomer.\" I don't want anyone to get EBT, at all. Local churches should feed the poor. I am am not a \"stormfag\" but you are an actual faggot. permalink parent award report block reply Coprolite 2 points 1 day ago Gibs me dat. permalink parent award report block reply AccelerateAlready 1 points 19 hours ago \"Americans\" permalink parent award report block reply\nm0ntsta 6 points 1 day ago Is it weird growing up not knowing your father, Tyrone? permalink parent award report block reply RomanCatholicPatriot 4 points 1 day ago It's anaconda aka maltese-poodle aka makersmarx aka grapefruitsheep aka applebandicoot (and M-A-N-Y others) permalink parent award report block reply RomanCatholicPatriot 3 points 1 day ago mangokiwi permalink parent award report block reply\nRomanCatholicPatriot 4 points 1 day ago It's anaconda aka maltese-poodle aka makersmarx aka grapefruitsheep aka applebandicoot (and M-A-N-Y others) permalink parent award report block reply\nRomanCatholicPatriot 3 points 1 day ago mangokiwi permalink parent award report block reply\nRun_over_Antifa 6 points 1 day ago I know what a \"stormfag\" is from this page, it's funny how when you have no argument its \"stomrfag\" \"doomer.\" I don't want anyone to get EBT, at all. Local churches should feed the poor. I am am not a \"stormfag\" but you are an actual faggot. permalink parent award report block reply\nCoprolite 2 points 1 day ago Gibs me dat. permalink parent award report block reply\nAccelerateAlready 1 points 19 hours ago \"Americans\" permalink parent award report block reply\nPongpagongbatibot -2 points 1 day ago This is a typical iranian groyper response. Pretends to be America first, Trump-hate is implied (look at the replies below by fellow Iranian groypers), has all the up-votes. Yep, the comment is made from iran permalink parent award report block reply Spawnlingman 1 points 21 hours ago Hmm looks like USA and white kids outside my windows to me. 🤷‍♂️ permalink parent award report block reply\nSpawnlingman 1 points 21 hours ago Hmm looks like USA and white kids outside my windows to me. 🤷‍♂️ permalink parent award report block reply\npossibletower -4 points 1 day ago Cope, faggot. Everytime Nick Fuentes crashes out is a beautiful moment. Now he and his fellow faggots like you can't blame Trump for everything related to the shutdown so you fags shift the goalposts and still try to blame Trump for something. permalink parent award report block reply Appeal2Heaven98 -3 points 23 hours ago Here's your daily reminder that questioning Israel's incentives, even being anti-Israel, is not antisemitic. permalink parent award report block reply\nAppeal2Heaven98 -3 points 23 hours ago Here's your daily reminder that questioning Israel's incentives, even being anti-Israel, is not antisemitic. permalink parent award report block reply\nMewThat 15 points 1 day ago They look ridiculous?  Aren't we hiring back all the fed fat we just fired?  with back pay? permalink award report block reply RedStoneDeepState 8 points 1 day ago They weren't fired they were furloughed. permalink parent award report block reply anotherthing 3 points 1 day ago Keep in mind this will be the second time we've continued the Biden era spending budget when the GOP has Congress and the Presidency. So, I don't see how the Democrats are looking ridiculous when they have the GOP demanding the spending levels they were mad about a year ago. permalink parent award report block reply ConfusedAngryArmed 1 points 18 hours ago They're also getting a vote on Obamacare. permalink parent award report block reply Yawnz13 1 points 1 day ago No?  It's only passed in the Senate.  It still has to pass the House and be signed by Trump. permalink parent award report block reply DeportThemAllForever 0 points 23 hours ago It’s rediculous because that photo has no sombrero.  Missed opportunity. permalink parent award report block reply\nRedStoneDeepState 8 points 1 day ago They weren't fired they were furloughed. permalink parent award report block reply\nanotherthing 3 points 1 day ago Keep in mind this will be the second time we've continued the Biden era spending budget when the GOP has Congress and the Presidency. So, I don't see how the Democrats are looking ridiculous when they have the GOP demanding the spending levels they were mad about a year ago. permalink parent award report block reply ConfusedAngryArmed 1 points 18 hours ago They're also getting a vote on Obamacare. permalink parent award report block reply\nConfusedAngryArmed 1 points 18 hours ago They're also getting a vote on Obamacare. permalink parent award report block reply\nYawnz13 1 points 1 day ago No?  It's only passed in the Senate.  It still has to pass the House and be signed by Trump. permalink parent award report block reply\nDeportThemAllForever 0 points 23 hours ago It’s rediculous because that photo has no sombrero.  Missed opportunity. permalink parent award report block reply\nkeeman 14 points 1 day ago What we republicans accomplished was to re-authorize Biden's budget without adding even more ridiculous spending.  All branches of government are R controlled and the best they can do is kick the can down the road and keep the drunken sailor levels of spending going.  Yay... permalink award report block reply Aggrieved03 5 points 1 day ago Many here are idiots. We're cheering on our own destruction. permalink parent award report block reply RedStoneDeepState 3 points 1 day ago Up until the end of the year. permalink parent award report block reply\nAggrieved03 5 points 1 day ago Many here are idiots. We're cheering on our own destruction. permalink parent award report block reply\nRedStoneDeepState 3 points 1 day ago Up until the end of the year. permalink parent award report block reply\nChoppermagic 5 points 1 day ago honestly, the Republicans in congress are so weak, the dems strategy of making them give up through the media has been proven over time permalink award report block reply\nlarrry 3 points 1 day ago If you are still a democrat you need to examine yourself and figure what went wrong, maybe your parents were cousins permalink award report block reply\nGTHAYS 3 points 1 day ago Tim KAINE always looks like he's found another kid in his closet. permalink award report block reply\nGunsWithGooglyEyes 3 points 1 day ago Actual moloch worshipping retarded faggots look ridiculous, yes. When have they not? permalink award report block reply\nYodaBannon 3 points 1 day ago dems have been lookin ridiculous for the last decade, thanks DJT permalink award report block reply\nTrumpChampBelt 3 points 1 day ago it is insane to me that a group of people could fuck up so badly so often and still be within reach of any political leadership anywhere on this planet. people are fucking retarded. permalink award report block reply\nPhantomShield72 2 points 1 day ago They will reject the reality that they look ridiculous. Their supporters will reject the reality that they look ridiculous. The Media will PROJECT the false reality that they don't look ridiculous. The Left will still somehow gain ground despite absolutely failing. Rinse, Repeat. permalink award report block reply\nThe_RedWolf 2 points 24 hours ago NGL though, I did expect the Democrats to get something more, its rarely such a flat out victory. permalink award report block reply\nIvIA6A 2 points 1 day ago The demands were unserious from the beginning, and they were going to win in the blue states anyway, so I don't know what it was all for. It's more TDS \"resistance\" movement, and frankly the Senate should know better permalink award report block reply\nJBlaze056 1 points 1 day ago I’m not as sure about that as the media was doing their best to convince the general public this was all the GOP’s fault because they “control all of Congress and the WH”.  They really think people are stupid because the senate cannot be controlled unless there is a party with 67 members voting in lock step, and they were right that many people out there are stupid.   Luckily there is a big enough coalition of people in society that know about the nature of the liars in the media. permalink award report block reply\nMisprisionIsEvil 1 points 22 hours ago The Democrats I know think the Democrats are the good guys and the shutdown was done by the Republicans to starve people. permalink award report block reply\nShekelJa 1 points 22 hours ago They control the flow of information, so it will end with according to whatever they want it to end, just ask any retard how it went down and you will understand what I mean. permalink award report block reply\nRobinNet 1 points 1 day ago Didn't Timmy K used to sniff Killary's cabbage farts on the campaign bus? Can't look more ridiculous than that. permalink award report block reply\nBadBrainsBuzzcocks 1 points 1 day ago Part of the deal was rehiring every government worker that was laid off. WTH? That was the one thing I was fairly excited about. Actually shrinking the government workforce. permalink award report block reply Krat 2 points 1 day ago Its a form of universal basic income.... its not the function of their job or that anyone of really does anything..... its an excuse for giving your money to someone else basically permalink parent award report block reply\nKrat 2 points 1 day ago Its a form of universal basic income.... its not the function of their job or that anyone of really does anything..... its an excuse for giving your money to someone else basically permalink parent award report block reply\nJoinTheDiscussion 1 points 23 hours ago Just in time for the RINOs not to go the nuclear option.. How fucking convenient!! permalink award report block reply\nGreyKnight 1 points 1 day ago They were apparently just waiting until after some elections…and their voters will forget by the time of the next elections…and they don’t care about our opinions on them… Just another month for fat cats in government. permalink award report block reply\nmohel 1 points 18 hours ago What did RINOs gain? permalink award report block reply\npoliticsaside 1 points 1 day ago It should've ended with us going nuclear, taking credit for saving the country, then passing the MAGA agenda, but congress is a bunch of pussies. permalink award report block reply\nclownworld30330 1 points 1 day ago What matters is what normies perceive. I don’t think normies perceive the dems as looking ridiculous. permalink award report block reply\ndr_gonzo 0 points 22 hours ago Ya, now that we've reopened history's largest and most expensive government, we really showed those lefty Democrats didn't we? 🤪 permalink award report block reply\nf_bastiat -2 points 23 hours ago From literally everything I have read and heard, red team caved hard. Are all these posts some sort of psyop? permalink award report block reply\nSomeGuyOnTheInternet -3 points 1 day ago Yeah, but they swept the elections so I imagine they deem it worth it. permalink award report block reply\nCorse46 -3 points 1 day ago They blew us out in the elections, and we are still \"continuing\" Nancy Pelosi's budget from 2022, after holding the House since 2023 and the White House and Senate since 2025. If you think this is a win, you are retarded. permalink award report block reply",
  "fetched_at": "2025-11-12T23:09:58.972241Z"
}