{
  "id": "1ARK9nOoNf",
  "url": "https://patriots.win/p/1ARK9nOoNf/rich-baris-stop-being-a-doomer-b/c",
  "content": "148 Rich Baris: \"Stop being a doomer bro!\" Stop being delulu and come see me when Democrats are running \"America Doesn't Have Talent\" ads all across the country next year. Anyone who isn't as stupid as a Republican consultant could have a field day with that one. That shit writes itself.\" posted 5 hours ago by raptoris2 12 comments award share report block Rich Baris The People's Pundit @Peoples_Pundit • 5h \"Stop being a doomer bro!\" Stop being delulu and come see me when Democrats are running \"America Doesn't Have Talent\" ads all across the country next year. Anyone who isn't as stupid as a Republican consultant could have a field day with that one. That shit writes itself.\n12 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style BerettaStroker 11 points 5 hours ago He ain't wrong. permalink award report block reply 27Sandino 1 points 3 hours ago He's wrong only because people have short memories, running this ad next year is the equivalent of running anti Trump ads about nfts and Trump shoes A million things will come and go by mid terms permalink parent award report block reply TGNX -1 points 4 hours ago He is wrong. Dooming isn't criticism. Dooming is \"give up, nothing will change, accept it.\" Dooming is a psyop. Criticism is not. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago The whole point of his tweet was to shit on the “don’t be a doomer bro” line of bullshit. permalink parent award report block reply TGNX 1 points 3 hours ago The point of his tweet is not understanding what dooming is. Dooming is \"everything is bad, nothing will be fixed, give up.\" Dooming is not valid criticism, it is a psyop designed to demoralize. permalink parent award report block reply BerettaStroker 3 points 4 hours ago Where is his post did it say he wants people to give up? permalink parent award report block reply TGNX 1 points 3 hours ago I didn't say he did. I'm saying he's wrong about what dooming is. permalink parent award report block reply Awakened 7 points 4 hours ago They better listen to Baris. His polling hits more than it misses. He would know Trump's actual numbers. They will be below 40 by this time next week. permalink award report block reply angryrhino83 4 points 4 hours ago Yep, Trump fucked up bigly with that comment. There was so much opportunity to make this country great again and it's all being flushed away. I guess it's time to accelerate at this point. permalink award report block reply TheTelltaleFly 2 points 4 hours ago I am so sad for my kids. permalink parent award report block reply BerettaStroker 2 points 4 hours ago Don't be sad for them. Teach them who sold their birthright and equip them so they are prepared to wrest it back when the time comes. permalink parent award report block reply Senaleb 3 points 4 hours ago I'll be honest, I want to hear what JD Vance has to say, because I want to make a decision if he's even worth voting for. If he's supporting this shit, he's not getting my vote. Nothing I can do to stop what Trump is doing now...600k chinese coming to the US is unfuckingbelievable. permalink award report block reply Be_The_Change 1 points 5 hours ago Comment removed by community moderators. permalink award report block reply\nBerettaStroker 11 points 5 hours ago He ain't wrong. permalink award report block reply 27Sandino 1 points 3 hours ago He's wrong only because people have short memories, running this ad next year is the equivalent of running anti Trump ads about nfts and Trump shoes A million things will come and go by mid terms permalink parent award report block reply TGNX -1 points 4 hours ago He is wrong. Dooming isn't criticism. Dooming is \"give up, nothing will change, accept it.\" Dooming is a psyop. Criticism is not. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago The whole point of his tweet was to shit on the “don’t be a doomer bro” line of bullshit. permalink parent award report block reply TGNX 1 points 3 hours ago The point of his tweet is not understanding what dooming is. Dooming is \"everything is bad, nothing will be fixed, give up.\" Dooming is not valid criticism, it is a psyop designed to demoralize. permalink parent award report block reply BerettaStroker 3 points 4 hours ago Where is his post did it say he wants people to give up? permalink parent award report block reply TGNX 1 points 3 hours ago I didn't say he did. I'm saying he's wrong about what dooming is. permalink parent award report block reply\n27Sandino 1 points 3 hours ago He's wrong only because people have short memories, running this ad next year is the equivalent of running anti Trump ads about nfts and Trump shoes A million things will come and go by mid terms permalink parent award report block reply\nTGNX -1 points 4 hours ago He is wrong. Dooming isn't criticism. Dooming is \"give up, nothing will change, accept it.\" Dooming is a psyop. Criticism is not. permalink parent award report block reply TheTelltaleFly 6 points 4 hours ago The whole point of his tweet was to shit on the “don’t be a doomer bro” line of bullshit. permalink parent award report block reply TGNX 1 points 3 hours ago The point of his tweet is not understanding what dooming is. Dooming is \"everything is bad, nothing will be fixed, give up.\" Dooming is not valid criticism, it is a psyop designed to demoralize. permalink parent award report block reply BerettaStroker 3 points 4 hours ago Where is his post did it say he wants people to give up? permalink parent award report block reply TGNX 1 points 3 hours ago I didn't say he did. I'm saying he's wrong about what dooming is. permalink parent award report block reply\nTheTelltaleFly 6 points 4 hours ago The whole point of his tweet was to shit on the “don’t be a doomer bro” line of bullshit. permalink parent award report block reply TGNX 1 points 3 hours ago The point of his tweet is not understanding what dooming is. Dooming is \"everything is bad, nothing will be fixed, give up.\" Dooming is not valid criticism, it is a psyop designed to demoralize. permalink parent award report block reply\nTGNX 1 points 3 hours ago The point of his tweet is not understanding what dooming is. Dooming is \"everything is bad, nothing will be fixed, give up.\" Dooming is not valid criticism, it is a psyop designed to demoralize. permalink parent award report block reply\nBerettaStroker 3 points 4 hours ago Where is his post did it say he wants people to give up? permalink parent award report block reply TGNX 1 points 3 hours ago I didn't say he did. I'm saying he's wrong about what dooming is. permalink parent award report block reply\nTGNX 1 points 3 hours ago I didn't say he did. I'm saying he's wrong about what dooming is. permalink parent award report block reply\nAwakened 7 points 4 hours ago They better listen to Baris. His polling hits more than it misses. He would know Trump's actual numbers. They will be below 40 by this time next week. permalink award report block reply\nangryrhino83 4 points 4 hours ago Yep, Trump fucked up bigly with that comment. There was so much opportunity to make this country great again and it's all being flushed away. I guess it's time to accelerate at this point. permalink award report block reply TheTelltaleFly 2 points 4 hours ago I am so sad for my kids. permalink parent award report block reply BerettaStroker 2 points 4 hours ago Don't be sad for them. Teach them who sold their birthright and equip them so they are prepared to wrest it back when the time comes. permalink parent award report block reply\nTheTelltaleFly 2 points 4 hours ago I am so sad for my kids. permalink parent award report block reply BerettaStroker 2 points 4 hours ago Don't be sad for them. Teach them who sold their birthright and equip them so they are prepared to wrest it back when the time comes. permalink parent award report block reply\nBerettaStroker 2 points 4 hours ago Don't be sad for them. Teach them who sold their birthright and equip them so they are prepared to wrest it back when the time comes. permalink parent award report block reply\nSenaleb 3 points 4 hours ago I'll be honest, I want to hear what JD Vance has to say, because I want to make a decision if he's even worth voting for. If he's supporting this shit, he's not getting my vote. Nothing I can do to stop what Trump is doing now...600k chinese coming to the US is unfuckingbelievable. permalink award report block reply\nBe_The_Change 1 points 5 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:24:21.647450Z"
}