{
  "id": "1ARK9nOFwx",
  "url": "https://patriots.win/p/1ARK9nOFwx/new-h1b-stance-proves-this-admin/c",
  "content": "150 New H1B stance proves this ADMIN WILL NEVER REMOVE ILLEGALS…. They are ONLY TARGETING CRIMINALS…. This is AMNESTY… H1B is the RETURN TO INVASION….. THIS ADMIN HAS BEEN HIGH-JACKED! Fck them all! posted 6 hours ago by Trooph-Hurts 29 comments award share report block I’m sick of these elitist scum!\n29 comments Sort by Top Top New Worst Old Save Cville123 17 points 5 hours ago Starting to feel that way. permalink award report block reply Bball-gurl 12 points 5 hours ago I've felt this way since muh operation warp speed, and each new day is further confirmation that Trump is totally compromised. Feelsbadman.jpeg permalink parent award report block reply GatoradeJeb 3 points 2 hours ago They worship browns, blacks, asians while demonizing White man. Obama started the replacement. Biden hit the gas and noe ZionDon is finishing it off. They want White man replaced and humiliated as we see White woman racemixing with the brown filth permalink parent award report block reply Trooph-Hurts OP 1 points 2 hours ago There is a reason we have NO arrests! Growing the economy means keeping workers and attracting more workers!…. None of us approved this betrayal! permalink parent award report block reply Lamal 0 points 1 hour ago This is just concern trolling. This president has delivered more than any president in the last 100 years. We have massive deportations, restriction on H1B, elimination of USAID, CPB, no more funding of NPR. We have stopped funding wars. We have our federal agencies spreading based pro USA messages, we have trade policy massively shifted in our favor -- defacto moving towards national sales tax via tariffs (where criminals and cheats would also pay). We have trillions promised in US investments. The only major blockages are caused by partisan judges. We have the fastest deployment of our objectives consistent with the rule of law. HOW MUCH OF THIS DID YOU GET WITH ANY PREVIOUS PRESIDENT? permalink award report block reply Lamal 0 points 1 hour ago most people here have no idea what it takes to turn this massive ship around. We have to largely sway public opinion -- for now that means focusing on criminals so that antifa confrontations don't turn into propaganda wins for the left. Once they burn out that energy you'll see more enforcement across the board. OP's concern trolling here doesn't help anything. permalink parent award report block reply LiteraIIyHitIer 1 points 17 minutes ago You forget to switch accounts before replying to yourself? permalink parent award report block reply SpaceWizard -10 points 6 hours ago Just throw the baby out with the bath water because a couple things aren't going your way. Grow up. permalink award report block reply Trooph-Hurts OP 10 points 6 hours ago This is the ISLAMIC TAKEOVER! Get on your fcking knees SLAVE permalink parent award report block reply happyfave 2 points 5 hours ago Wow, dramatic permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Ho I'm a brainwashed retard permalink parent award report block reply SCP0073 1 points 1 hour ago Yep. Totally Islam taking over. I’m already… on my my knees permalink parent award report block reply GatoradeJeb 1 points 2 hours ago This ones not islamic. This ones streetshitter and brown invasion to replace White man permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Yep give it 5 to 10 years and they will vote to trash the entire constitution permalink parent award report block reply SpaceWizard -1 points 6 hours ago NO permalink parent award report block reply ReleasetheList 9 points 6 hours ago Yeah. It's no big deal if you and your children are a minority in your own country. permalink parent award report block reply GatoradeJeb 2 points 2 hours ago Even worse seeing how many young White woman are race traitor  mudsharks permalink parent award report block reply happyfave 1 points 5 hours ago Yawn permalink parent award report block reply keeptherepublic1776 2 points 5 hours ago Retard alert permalink parent award report block reply SpaceWizard -3 points 6 hours ago That is a big deal but things take time. It took decades to get us here, and people expect evrything to be fixed in a year. Unreal. permalink parent award report block reply mlp67 7 points 5 hours ago So fixing it is continuing the Great Replacement? This is why this will all collapse and former believers will cheer for its downfall. This how you create extremism permalink parent award report block reply RudeFrog 4 points 5 hours ago No we've had enough of the acceptance of the slow walk back to the same place we started permalink parent award report block reply MastaJoda 1 points 5 hours ago ☝Jesus was a rebel, not a cucked out bootlicker. permalink parent award report block reply Porkbut 1 points 5 hours ago Most of these bots are just democrat npcs, they arent MAGA and they werent going to vote for Trump candidates anyway. Does everyone have amnesia and forget the bots did this exact same thing in 2016 and 2024? The sky is always falling, thats the point with NPC bots. Just ask them to explain their current TDS manifestation and watch them sperg like emotional trannies. permalink parent award report block reply keeptherepublic1776 3 points 5 hours ago Brainwashed. H1B and illegals are literally everything. permalink parent award report block reply happyfave -10 points 5 hours ago No it doesn't doomer permalink award report block reply keeptherepublic1776 5 points 5 hours ago WOW. Brainwashed like the left permalink parent award report block reply TheThreeSeashells 2 points 4 hours ago Comments like that other guy are probably coming from people who are hiring them. permalink parent award report block reply BubbaSawyer4Trump 1 points 5 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nCville123 17 points 5 hours ago Starting to feel that way. permalink award report block reply Bball-gurl 12 points 5 hours ago I've felt this way since muh operation warp speed, and each new day is further confirmation that Trump is totally compromised. Feelsbadman.jpeg permalink parent award report block reply GatoradeJeb 3 points 2 hours ago They worship browns, blacks, asians while demonizing White man. Obama started the replacement. Biden hit the gas and noe ZionDon is finishing it off. They want White man replaced and humiliated as we see White woman racemixing with the brown filth permalink parent award report block reply Trooph-Hurts OP 1 points 2 hours ago There is a reason we have NO arrests! Growing the economy means keeping workers and attracting more workers!…. None of us approved this betrayal! permalink parent award report block reply\nBball-gurl 12 points 5 hours ago I've felt this way since muh operation warp speed, and each new day is further confirmation that Trump is totally compromised. Feelsbadman.jpeg permalink parent award report block reply GatoradeJeb 3 points 2 hours ago They worship browns, blacks, asians while demonizing White man. Obama started the replacement. Biden hit the gas and noe ZionDon is finishing it off. They want White man replaced and humiliated as we see White woman racemixing with the brown filth permalink parent award report block reply\nGatoradeJeb 3 points 2 hours ago They worship browns, blacks, asians while demonizing White man. Obama started the replacement. Biden hit the gas and noe ZionDon is finishing it off. They want White man replaced and humiliated as we see White woman racemixing with the brown filth permalink parent award report block reply\nTrooph-Hurts OP 1 points 2 hours ago There is a reason we have NO arrests! Growing the economy means keeping workers and attracting more workers!…. None of us approved this betrayal! permalink parent award report block reply\nLamal 0 points 1 hour ago This is just concern trolling. This president has delivered more than any president in the last 100 years. We have massive deportations, restriction on H1B, elimination of USAID, CPB, no more funding of NPR. We have stopped funding wars. We have our federal agencies spreading based pro USA messages, we have trade policy massively shifted in our favor -- defacto moving towards national sales tax via tariffs (where criminals and cheats would also pay). We have trillions promised in US investments. The only major blockages are caused by partisan judges. We have the fastest deployment of our objectives consistent with the rule of law. HOW MUCH OF THIS DID YOU GET WITH ANY PREVIOUS PRESIDENT? permalink award report block reply Lamal 0 points 1 hour ago most people here have no idea what it takes to turn this massive ship around. We have to largely sway public opinion -- for now that means focusing on criminals so that antifa confrontations don't turn into propaganda wins for the left. Once they burn out that energy you'll see more enforcement across the board. OP's concern trolling here doesn't help anything. permalink parent award report block reply LiteraIIyHitIer 1 points 17 minutes ago You forget to switch accounts before replying to yourself? permalink parent award report block reply\nLamal 0 points 1 hour ago most people here have no idea what it takes to turn this massive ship around. We have to largely sway public opinion -- for now that means focusing on criminals so that antifa confrontations don't turn into propaganda wins for the left. Once they burn out that energy you'll see more enforcement across the board. OP's concern trolling here doesn't help anything. permalink parent award report block reply LiteraIIyHitIer 1 points 17 minutes ago You forget to switch accounts before replying to yourself? permalink parent award report block reply\nLiteraIIyHitIer 1 points 17 minutes ago You forget to switch accounts before replying to yourself? permalink parent award report block reply\nSpaceWizard -10 points 6 hours ago Just throw the baby out with the bath water because a couple things aren't going your way. Grow up. permalink award report block reply Trooph-Hurts OP 10 points 6 hours ago This is the ISLAMIC TAKEOVER! Get on your fcking knees SLAVE permalink parent award report block reply happyfave 2 points 5 hours ago Wow, dramatic permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Ho I'm a brainwashed retard permalink parent award report block reply SCP0073 1 points 1 hour ago Yep. Totally Islam taking over. I’m already… on my my knees permalink parent award report block reply GatoradeJeb 1 points 2 hours ago This ones not islamic. This ones streetshitter and brown invasion to replace White man permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Yep give it 5 to 10 years and they will vote to trash the entire constitution permalink parent award report block reply SpaceWizard -1 points 6 hours ago NO permalink parent award report block reply ReleasetheList 9 points 6 hours ago Yeah. It's no big deal if you and your children are a minority in your own country. permalink parent award report block reply GatoradeJeb 2 points 2 hours ago Even worse seeing how many young White woman are race traitor  mudsharks permalink parent award report block reply happyfave 1 points 5 hours ago Yawn permalink parent award report block reply keeptherepublic1776 2 points 5 hours ago Retard alert permalink parent award report block reply SpaceWizard -3 points 6 hours ago That is a big deal but things take time. It took decades to get us here, and people expect evrything to be fixed in a year. Unreal. permalink parent award report block reply mlp67 7 points 5 hours ago So fixing it is continuing the Great Replacement? This is why this will all collapse and former believers will cheer for its downfall. This how you create extremism permalink parent award report block reply RudeFrog 4 points 5 hours ago No we've had enough of the acceptance of the slow walk back to the same place we started permalink parent award report block reply MastaJoda 1 points 5 hours ago ☝Jesus was a rebel, not a cucked out bootlicker. permalink parent award report block reply Porkbut 1 points 5 hours ago Most of these bots are just democrat npcs, they arent MAGA and they werent going to vote for Trump candidates anyway. Does everyone have amnesia and forget the bots did this exact same thing in 2016 and 2024? The sky is always falling, thats the point with NPC bots. Just ask them to explain their current TDS manifestation and watch them sperg like emotional trannies. permalink parent award report block reply keeptherepublic1776 3 points 5 hours ago Brainwashed. H1B and illegals are literally everything. permalink parent award report block reply\nTrooph-Hurts OP 10 points 6 hours ago This is the ISLAMIC TAKEOVER! Get on your fcking knees SLAVE permalink parent award report block reply happyfave 2 points 5 hours ago Wow, dramatic permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Ho I'm a brainwashed retard permalink parent award report block reply SCP0073 1 points 1 hour ago Yep. Totally Islam taking over. I’m already… on my my knees permalink parent award report block reply GatoradeJeb 1 points 2 hours ago This ones not islamic. This ones streetshitter and brown invasion to replace White man permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Yep give it 5 to 10 years and they will vote to trash the entire constitution permalink parent award report block reply SpaceWizard -1 points 6 hours ago NO permalink parent award report block reply\nhappyfave 2 points 5 hours ago Wow, dramatic permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Ho I'm a brainwashed retard permalink parent award report block reply\nkeeptherepublic1776 1 points 5 hours ago Ho I'm a brainwashed retard permalink parent award report block reply\nSCP0073 1 points 1 hour ago Yep. Totally Islam taking over. I’m already… on my my knees permalink parent award report block reply\nGatoradeJeb 1 points 2 hours ago This ones not islamic. This ones streetshitter and brown invasion to replace White man permalink parent award report block reply\nkeeptherepublic1776 1 points 5 hours ago Yep give it 5 to 10 years and they will vote to trash the entire constitution permalink parent award report block reply\nSpaceWizard -1 points 6 hours ago NO permalink parent award report block reply\nReleasetheList 9 points 6 hours ago Yeah. It's no big deal if you and your children are a minority in your own country. permalink parent award report block reply GatoradeJeb 2 points 2 hours ago Even worse seeing how many young White woman are race traitor  mudsharks permalink parent award report block reply happyfave 1 points 5 hours ago Yawn permalink parent award report block reply keeptherepublic1776 2 points 5 hours ago Retard alert permalink parent award report block reply SpaceWizard -3 points 6 hours ago That is a big deal but things take time. It took decades to get us here, and people expect evrything to be fixed in a year. Unreal. permalink parent award report block reply mlp67 7 points 5 hours ago So fixing it is continuing the Great Replacement? This is why this will all collapse and former believers will cheer for its downfall. This how you create extremism permalink parent award report block reply RudeFrog 4 points 5 hours ago No we've had enough of the acceptance of the slow walk back to the same place we started permalink parent award report block reply MastaJoda 1 points 5 hours ago ☝Jesus was a rebel, not a cucked out bootlicker. permalink parent award report block reply Porkbut 1 points 5 hours ago Most of these bots are just democrat npcs, they arent MAGA and they werent going to vote for Trump candidates anyway. Does everyone have amnesia and forget the bots did this exact same thing in 2016 and 2024? The sky is always falling, thats the point with NPC bots. Just ask them to explain their current TDS manifestation and watch them sperg like emotional trannies. permalink parent award report block reply\nGatoradeJeb 2 points 2 hours ago Even worse seeing how many young White woman are race traitor  mudsharks permalink parent award report block reply\nhappyfave 1 points 5 hours ago Yawn permalink parent award report block reply keeptherepublic1776 2 points 5 hours ago Retard alert permalink parent award report block reply\nkeeptherepublic1776 2 points 5 hours ago Retard alert permalink parent award report block reply\nSpaceWizard -3 points 6 hours ago That is a big deal but things take time. It took decades to get us here, and people expect evrything to be fixed in a year. Unreal. permalink parent award report block reply mlp67 7 points 5 hours ago So fixing it is continuing the Great Replacement? This is why this will all collapse and former believers will cheer for its downfall. This how you create extremism permalink parent award report block reply RudeFrog 4 points 5 hours ago No we've had enough of the acceptance of the slow walk back to the same place we started permalink parent award report block reply MastaJoda 1 points 5 hours ago ☝Jesus was a rebel, not a cucked out bootlicker. permalink parent award report block reply Porkbut 1 points 5 hours ago Most of these bots are just democrat npcs, they arent MAGA and they werent going to vote for Trump candidates anyway. Does everyone have amnesia and forget the bots did this exact same thing in 2016 and 2024? The sky is always falling, thats the point with NPC bots. Just ask them to explain their current TDS manifestation and watch them sperg like emotional trannies. permalink parent award report block reply\nmlp67 7 points 5 hours ago So fixing it is continuing the Great Replacement? This is why this will all collapse and former believers will cheer for its downfall. This how you create extremism permalink parent award report block reply\nRudeFrog 4 points 5 hours ago No we've had enough of the acceptance of the slow walk back to the same place we started permalink parent award report block reply MastaJoda 1 points 5 hours ago ☝Jesus was a rebel, not a cucked out bootlicker. permalink parent award report block reply\nMastaJoda 1 points 5 hours ago ☝Jesus was a rebel, not a cucked out bootlicker. permalink parent award report block reply\nPorkbut 1 points 5 hours ago Most of these bots are just democrat npcs, they arent MAGA and they werent going to vote for Trump candidates anyway. Does everyone have amnesia and forget the bots did this exact same thing in 2016 and 2024? The sky is always falling, thats the point with NPC bots. Just ask them to explain their current TDS manifestation and watch them sperg like emotional trannies. permalink parent award report block reply\nkeeptherepublic1776 3 points 5 hours ago Brainwashed. H1B and illegals are literally everything. permalink parent award report block reply\nhappyfave -10 points 5 hours ago No it doesn't doomer permalink award report block reply keeptherepublic1776 5 points 5 hours ago WOW. Brainwashed like the left permalink parent award report block reply TheThreeSeashells 2 points 4 hours ago Comments like that other guy are probably coming from people who are hiring them. permalink parent award report block reply\nkeeptherepublic1776 5 points 5 hours ago WOW. Brainwashed like the left permalink parent award report block reply TheThreeSeashells 2 points 4 hours ago Comments like that other guy are probably coming from people who are hiring them. permalink parent award report block reply\nTheThreeSeashells 2 points 4 hours ago Comments like that other guy are probably coming from people who are hiring them. permalink parent award report block reply\nBubbaSawyer4Trump 1 points 5 hours ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T20:41:38.801770Z"
}