{
  "id": "1ARK9nPuRc",
  "url": "https://patriots.win/p/1ARK9nPuRc/were-going-to-lose-so-much-youre/c",
  "content": "46 We’re going to lose so much, you’re going to be so sick and tired of losing, you’re going to come to me and go ‘Please, please, we can’t lose anymore.’  You’ll say ‘Please, Mr. President, we beg you sir, we don’t want to lose anymore. It’s too much.”  MIGA posted 2 hours ago by BidenSniffsLittleKid 11 comments award share download report block\n11 comments Sort by Top Top New Worst Old Save Bruno 4 points 19 minutes ago There’ve been lots of good things. But it’s been a bad week. Let’s hope he reverses course on H1-B. permalink award report block reply patriotjoe 2 points 6 minutes ago Border and MAHA are wins. Besides that, yeah, Great-esque permalink award report block reply happyfave -1 points 1 hour ago Trump's actual presidency has been full of winning almost non stop.  The shills are really Reeing hard today. permalink award report block reply BidenSniffsLittleKid OP 4 points 1 hour ago It’s true H1Bs are more talented than us permalink parent award report block reply TGNX 1 points 10 minutes ago Yeah they are. So hard that the instant you notice that Trump was talking about tech that got offshored by Clinton in the 90s and thus no one in the US has expertise anymore, and show it here, the leftoid shills screech in pain. permalink parent award report block reply CaptainChewbacca 0 points 24 minutes ago They think there's an opening with the 'talent' and are trying to open a gap. They do it every time. permalink parent award report block reply TGNX -2 points 12 minutes ago Deport this faggot. permalink award report block reply BrewSwillis -1 points 22 minutes ago Would have been better off with Kamala, huh? permalink award report block reply BidenSniffsLittleKid OP 1 points 20 minutes ago Giant douche or turd sandwich at this point permalink parent award report block reply ParmesanCartel 1 points 13 minutes ago Would it be different? permalink parent award report block reply Bullet_Tooth_Tony 2 points 8 minutes ago Yes, we would already be in camps. Now with Trump we get an extra four years before being sent to them lol permalink parent award report block reply\nBruno 4 points 19 minutes ago There’ve been lots of good things. But it’s been a bad week. Let’s hope he reverses course on H1-B. permalink award report block reply\npatriotjoe 2 points 6 minutes ago Border and MAHA are wins. Besides that, yeah, Great-esque permalink award report block reply\nhappyfave -1 points 1 hour ago Trump's actual presidency has been full of winning almost non stop.  The shills are really Reeing hard today. permalink award report block reply BidenSniffsLittleKid OP 4 points 1 hour ago It’s true H1Bs are more talented than us permalink parent award report block reply TGNX 1 points 10 minutes ago Yeah they are. So hard that the instant you notice that Trump was talking about tech that got offshored by Clinton in the 90s and thus no one in the US has expertise anymore, and show it here, the leftoid shills screech in pain. permalink parent award report block reply CaptainChewbacca 0 points 24 minutes ago They think there's an opening with the 'talent' and are trying to open a gap. They do it every time. permalink parent award report block reply\nBidenSniffsLittleKid OP 4 points 1 hour ago It’s true H1Bs are more talented than us permalink parent award report block reply\nTGNX 1 points 10 minutes ago Yeah they are. So hard that the instant you notice that Trump was talking about tech that got offshored by Clinton in the 90s and thus no one in the US has expertise anymore, and show it here, the leftoid shills screech in pain. permalink parent award report block reply\nCaptainChewbacca 0 points 24 minutes ago They think there's an opening with the 'talent' and are trying to open a gap. They do it every time. permalink parent award report block reply\nTGNX -2 points 12 minutes ago Deport this faggot. permalink award report block reply\nBrewSwillis -1 points 22 minutes ago Would have been better off with Kamala, huh? permalink award report block reply BidenSniffsLittleKid OP 1 points 20 minutes ago Giant douche or turd sandwich at this point permalink parent award report block reply ParmesanCartel 1 points 13 minutes ago Would it be different? permalink parent award report block reply Bullet_Tooth_Tony 2 points 8 minutes ago Yes, we would already be in camps. Now with Trump we get an extra four years before being sent to them lol permalink parent award report block reply\nBidenSniffsLittleKid OP 1 points 20 minutes ago Giant douche or turd sandwich at this point permalink parent award report block reply\nParmesanCartel 1 points 13 minutes ago Would it be different? permalink parent award report block reply Bullet_Tooth_Tony 2 points 8 minutes ago Yes, we would already be in camps. Now with Trump we get an extra four years before being sent to them lol permalink parent award report block reply\nBullet_Tooth_Tony 2 points 8 minutes ago Yes, we would already be in camps. Now with Trump we get an extra four years before being sent to them lol permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:53:41.806211Z"
}