{
  "id": "1ARK9mGgZq",
  "url": "https://patriots.win/p/1ARK9mGgZq/every-muslim-needs-to-be-removed/c",
  "content": "431 Every Muslim needs to be removed from this country. posted 18 hours ago by HeavenlyTrumpets 39 comments award share report block Anyone who thinks that is too extreme is not paying attention.\n39 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style ConfusedAngryArmed 8 points 17 hours ago No thanks! Impale them all! Create a forest of rotting, dead, and dying Muslims! permalink award report block reply BlokeyMcBlokeFace 6 points 17 hours ago Vlad the Impaler Righteous permalink parent award report block reply Shih_Tabed 2 points 17 hours ago Vlad was the last person that had the balls to do so. permalink parent award report block reply SicSemperTyrannis2 -2 points 16 hours ago Your history sux. He died 1477 at the latest. permalink parent award report block reply Shih_Tabed 2 points 16 hours ago Yeah, he is the last person who had the balls to go against the muslims, then called the Ottomans.  You saying that didn't happen? permalink parent award report block reply view 7 more comments... Hanging_Chad 4 points 18 hours ago keep deporting people until I can relax permalink award report block reply The_Bloofy_Bullshark 4 points 17 hours ago The ☪️ancer needs to be eradicated from this planet completely. permalink award report block reply hazelknut 2 points 17 hours ago they don't belong here and aren't welcome. permalink award report block reply whatsupup 1 points 18 hours ago all you need to do is get 1 or 2 people to go to church and they should do the same. nobody else going to solve it for you, MAGA would have to do it themselves permalink award report block reply Diversity_Fire 1 points 12 hours ago Every last one.  and then force Canada and Mexico to do the same with Pajeets and Muslims as well. permalink award report block reply red_holiday2 1 points 6 hours ago All J e ws, Muslism, Hindus, Buhdists and all other non Christian bullshit needs to be removed. permalink award report block reply MakinBacon 1 points 18 hours ago and then some permalink award report block reply Unboosted 1 points 7 hours ago Islam is incompatible with the west. Deport or execute permalink award report block reply OMC-RADIO 1 points 11 hours ago Don’t forget all the arrogant idiots from India either.  They’re worse than roaches. permalink award report block reply Givesgunstogrannies 1 points 9 hours ago Yes.  We support a true Muslim ban, and won't apologize for it. permalink award report block reply fskfsk -6 points 18 hours ago There is no feasible way to achieve that goal, unfortunately. permalink award report block reply RINO_fatigue 13 points 18 hours ago yes there is hassan, sorry if that upsets you permalink parent award report block reply fskfsk -4 points 18 hours ago OK, what's your plan? permalink parent award report block reply HeavenlyTrumpets OP 9 points 18 hours ago Remove them. They can go peaceably or they can die for their \"cause\" instead but one way or another, they have to go. And we absolutely do have the ability to utterly and completely overpower them. We simply don't have leadership directing that. permalink parent award report block reply fskfsk 0 points 18 hours ago What's your plan for getting leadership that aren't cucks?  Even if you could get the right \"leadership\", now the Supreme Court says you can't deport a Muslim who's a citizen.  Now what do you do? permalink parent award report block reply view 6 more comments... RINO_fatigue 4 points 18 hours ago total tmd, not giving you the details hassan permalink parent award report block reply HeavenlyTrumpets OP 7 points 18 hours ago There is a feasible way to achieve any such goal. We have the military might, the technical capability, and the man power. The only thing we don't have is leadership willing to do what needs to be done. permalink parent award report block reply fskfsk 0 points 18 hours ago We can't stop a gang of Antifa from assaulting ICE or a right-wing event.  How are you going to deport millions of Muslims, many of whom already have citizenship? How are we going to get \"leadership\"?  What exactly are we going to get as leadership that's better than Trump? The current leaders are the ones who sold out the country for Great Replacement. permalink parent award report block reply HeavenlyTrumpets OP 4 points 18 hours ago So maybe that's the answer. The current leadership has to go. permalink parent award report block reply fskfsk 0 points 18 hours ago What's the plan for removing them?  Vote harder? permalink parent award report block reply view 1 more comments... discoelmo 1 points 16 hours ago Comment removed by community moderators. permalink award report block reply\nConfusedAngryArmed 8 points 17 hours ago No thanks! Impale them all! Create a forest of rotting, dead, and dying Muslims! permalink award report block reply BlokeyMcBlokeFace 6 points 17 hours ago Vlad the Impaler Righteous permalink parent award report block reply Shih_Tabed 2 points 17 hours ago Vlad was the last person that had the balls to do so. permalink parent award report block reply SicSemperTyrannis2 -2 points 16 hours ago Your history sux. He died 1477 at the latest. permalink parent award report block reply Shih_Tabed 2 points 16 hours ago Yeah, he is the last person who had the balls to go against the muslims, then called the Ottomans.  You saying that didn't happen? permalink parent award report block reply view 7 more comments...\nBlokeyMcBlokeFace 6 points 17 hours ago Vlad the Impaler Righteous permalink parent award report block reply Shih_Tabed 2 points 17 hours ago Vlad was the last person that had the balls to do so. permalink parent award report block reply SicSemperTyrannis2 -2 points 16 hours ago Your history sux. He died 1477 at the latest. permalink parent award report block reply Shih_Tabed 2 points 16 hours ago Yeah, he is the last person who had the balls to go against the muslims, then called the Ottomans.  You saying that didn't happen? permalink parent award report block reply view 7 more comments...\nShih_Tabed 2 points 17 hours ago Vlad was the last person that had the balls to do so. permalink parent award report block reply SicSemperTyrannis2 -2 points 16 hours ago Your history sux. He died 1477 at the latest. permalink parent award report block reply Shih_Tabed 2 points 16 hours ago Yeah, he is the last person who had the balls to go against the muslims, then called the Ottomans.  You saying that didn't happen? permalink parent award report block reply view 7 more comments...\nSicSemperTyrannis2 -2 points 16 hours ago Your history sux. He died 1477 at the latest. permalink parent award report block reply Shih_Tabed 2 points 16 hours ago Yeah, he is the last person who had the balls to go against the muslims, then called the Ottomans.  You saying that didn't happen? permalink parent award report block reply view 7 more comments...\nShih_Tabed 2 points 16 hours ago Yeah, he is the last person who had the balls to go against the muslims, then called the Ottomans.  You saying that didn't happen? permalink parent award report block reply view 7 more comments...\nHanging_Chad 4 points 18 hours ago keep deporting people until I can relax permalink award report block reply\nThe_Bloofy_Bullshark 4 points 17 hours ago The ☪️ancer needs to be eradicated from this planet completely. permalink award report block reply\nhazelknut 2 points 17 hours ago they don't belong here and aren't welcome. permalink award report block reply\nwhatsupup 1 points 18 hours ago all you need to do is get 1 or 2 people to go to church and they should do the same. nobody else going to solve it for you, MAGA would have to do it themselves permalink award report block reply\nDiversity_Fire 1 points 12 hours ago Every last one.  and then force Canada and Mexico to do the same with Pajeets and Muslims as well. permalink award report block reply\nred_holiday2 1 points 6 hours ago All J e ws, Muslism, Hindus, Buhdists and all other non Christian bullshit needs to be removed. permalink award report block reply\nMakinBacon 1 points 18 hours ago and then some permalink award report block reply\nUnboosted 1 points 7 hours ago Islam is incompatible with the west. Deport or execute permalink award report block reply\nOMC-RADIO 1 points 11 hours ago Don’t forget all the arrogant idiots from India either.  They’re worse than roaches. permalink award report block reply\nGivesgunstogrannies 1 points 9 hours ago Yes.  We support a true Muslim ban, and won't apologize for it. permalink award report block reply\nfskfsk -6 points 18 hours ago There is no feasible way to achieve that goal, unfortunately. permalink award report block reply RINO_fatigue 13 points 18 hours ago yes there is hassan, sorry if that upsets you permalink parent award report block reply fskfsk -4 points 18 hours ago OK, what's your plan? permalink parent award report block reply HeavenlyTrumpets OP 9 points 18 hours ago Remove them. They can go peaceably or they can die for their \"cause\" instead but one way or another, they have to go. And we absolutely do have the ability to utterly and completely overpower them. We simply don't have leadership directing that. permalink parent award report block reply fskfsk 0 points 18 hours ago What's your plan for getting leadership that aren't cucks?  Even if you could get the right \"leadership\", now the Supreme Court says you can't deport a Muslim who's a citizen.  Now what do you do? permalink parent award report block reply view 6 more comments... RINO_fatigue 4 points 18 hours ago total tmd, not giving you the details hassan permalink parent award report block reply HeavenlyTrumpets OP 7 points 18 hours ago There is a feasible way to achieve any such goal. We have the military might, the technical capability, and the man power. The only thing we don't have is leadership willing to do what needs to be done. permalink parent award report block reply fskfsk 0 points 18 hours ago We can't stop a gang of Antifa from assaulting ICE or a right-wing event.  How are you going to deport millions of Muslims, many of whom already have citizenship? How are we going to get \"leadership\"?  What exactly are we going to get as leadership that's better than Trump? The current leaders are the ones who sold out the country for Great Replacement. permalink parent award report block reply HeavenlyTrumpets OP 4 points 18 hours ago So maybe that's the answer. The current leadership has to go. permalink parent award report block reply fskfsk 0 points 18 hours ago What's the plan for removing them?  Vote harder? permalink parent award report block reply view 1 more comments...\nRINO_fatigue 13 points 18 hours ago yes there is hassan, sorry if that upsets you permalink parent award report block reply fskfsk -4 points 18 hours ago OK, what's your plan? permalink parent award report block reply HeavenlyTrumpets OP 9 points 18 hours ago Remove them. They can go peaceably or they can die for their \"cause\" instead but one way or another, they have to go. And we absolutely do have the ability to utterly and completely overpower them. We simply don't have leadership directing that. permalink parent award report block reply fskfsk 0 points 18 hours ago What's your plan for getting leadership that aren't cucks?  Even if you could get the right \"leadership\", now the Supreme Court says you can't deport a Muslim who's a citizen.  Now what do you do? permalink parent award report block reply view 6 more comments... RINO_fatigue 4 points 18 hours ago total tmd, not giving you the details hassan permalink parent award report block reply\nfskfsk -4 points 18 hours ago OK, what's your plan? permalink parent award report block reply HeavenlyTrumpets OP 9 points 18 hours ago Remove them. They can go peaceably or they can die for their \"cause\" instead but one way or another, they have to go. And we absolutely do have the ability to utterly and completely overpower them. We simply don't have leadership directing that. permalink parent award report block reply fskfsk 0 points 18 hours ago What's your plan for getting leadership that aren't cucks?  Even if you could get the right \"leadership\", now the Supreme Court says you can't deport a Muslim who's a citizen.  Now what do you do? permalink parent award report block reply view 6 more comments... RINO_fatigue 4 points 18 hours ago total tmd, not giving you the details hassan permalink parent award report block reply\nHeavenlyTrumpets OP 9 points 18 hours ago Remove them. They can go peaceably or they can die for their \"cause\" instead but one way or another, they have to go. And we absolutely do have the ability to utterly and completely overpower them. We simply don't have leadership directing that. permalink parent award report block reply fskfsk 0 points 18 hours ago What's your plan for getting leadership that aren't cucks?  Even if you could get the right \"leadership\", now the Supreme Court says you can't deport a Muslim who's a citizen.  Now what do you do? permalink parent award report block reply view 6 more comments...\nfskfsk 0 points 18 hours ago What's your plan for getting leadership that aren't cucks?  Even if you could get the right \"leadership\", now the Supreme Court says you can't deport a Muslim who's a citizen.  Now what do you do? permalink parent award report block reply view 6 more comments...\nRINO_fatigue 4 points 18 hours ago total tmd, not giving you the details hassan permalink parent award report block reply\nHeavenlyTrumpets OP 7 points 18 hours ago There is a feasible way to achieve any such goal. We have the military might, the technical capability, and the man power. The only thing we don't have is leadership willing to do what needs to be done. permalink parent award report block reply fskfsk 0 points 18 hours ago We can't stop a gang of Antifa from assaulting ICE or a right-wing event.  How are you going to deport millions of Muslims, many of whom already have citizenship? How are we going to get \"leadership\"?  What exactly are we going to get as leadership that's better than Trump? The current leaders are the ones who sold out the country for Great Replacement. permalink parent award report block reply HeavenlyTrumpets OP 4 points 18 hours ago So maybe that's the answer. The current leadership has to go. permalink parent award report block reply fskfsk 0 points 18 hours ago What's the plan for removing them?  Vote harder? permalink parent award report block reply view 1 more comments...\nfskfsk 0 points 18 hours ago We can't stop a gang of Antifa from assaulting ICE or a right-wing event.  How are you going to deport millions of Muslims, many of whom already have citizenship? How are we going to get \"leadership\"?  What exactly are we going to get as leadership that's better than Trump? The current leaders are the ones who sold out the country for Great Replacement. permalink parent award report block reply HeavenlyTrumpets OP 4 points 18 hours ago So maybe that's the answer. The current leadership has to go. permalink parent award report block reply fskfsk 0 points 18 hours ago What's the plan for removing them?  Vote harder? permalink parent award report block reply view 1 more comments...\nHeavenlyTrumpets OP 4 points 18 hours ago So maybe that's the answer. The current leadership has to go. permalink parent award report block reply fskfsk 0 points 18 hours ago What's the plan for removing them?  Vote harder? permalink parent award report block reply view 1 more comments...\nfskfsk 0 points 18 hours ago What's the plan for removing them?  Vote harder? permalink parent award report block reply view 1 more comments...\ndiscoelmo 1 points 16 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:21.543427Z"
}