{
  "id": "1ARK9mFaBF",
  "url": "https://patriots.win/p/1ARK9mFaBF/steven-crowder\n\nkeep-in-mind-600/c",
  "content": "312 Steven Crowder\n:\nKeep in mind, 600K Chinese students means:\n\n- 600K potential spies\n- Inflated tuition\n- Decreased opportunities for American students\n- Training our primary geopolitical threat in fields most crucial to our national security posted 19 hours ago by PiratePatriotParrot 19 comments award share report block Steven Crowder @scrowder • 24h Keep in mind, 600K Chinese students means: - 600K potential spies - Inflated tuition - Decreased opportunities for American students - Training our primary geopolitical threat in fields most crucial to our national security Brilliant. Disclose.tv @disclosetv • 3M NOW - Trump says he'll allow 600,000 Chinese students into the U.S.\n19 comments Sort by Top Top New Worst Old Save MAGALADON9 11 points 18 hours ago JD will be worse. His life long democrat until recently wife he calls guru has her indian claws in him. Elon has like.4 kids that are Punjabi Indian. The we got barely disguised anti white Kash & vivek permalink award report block reply Oleander 7 points 18 hours ago White people have no one representing their interests in this country. If a new Hitler doesn't rise soon, Whites are done, there's no possible way to survive when most of your own race is working towards their own extinction (in cooperation with our enemies, aka the rest of the world). permalink parent award report block reply Aisle-is-closed 11 points 18 hours ago My only hope (which I have little of these days) is when Trump says something so colossally stupid, our collective outrage is so loud and strong that it actually makes it through his handlers and he changes his mind. It’s happened before, please let it happen again. permalink award report block reply Jack_NC 9 points 19 hours ago EVERY foreign student is interviewed by an information officer when they return to China. Every student is a spy, to one degree or another. permalink award report block reply MemoryHoleyeO 2 points 12 hours ago They also are given laptops that are turned into their local ups and given a new one once a semester permalink parent award report block reply Mortal_Wombat 2 points 12 hours ago We have any sauce on this? Sounds interesting... permalink parent award report block reply Aggrieved03 9 points 18 hours ago Midterms will be a bloodbath. permalink award report block reply GoldenSpirals 8 points 18 hours ago Anyone remember the story about chinese police active in the US and keep tabs on their CCP citizens over here? Even in the US the chinese people can still get \"disappeared\" permalink award report block reply morememesplz 4 points 14 hours ago I would be ok with Chinese foreigners spending tons of money in the US if they can only enroll in useless degrees like studio art, theatre, or social science - no STEM degree. And no marriage visa or anchor babies. permalink award report block reply turdinthepunch 2 points 18 hours ago if this is part of the broader trade deal with china, just say so.  then we can say no fuck off. permalink award report block reply imnotdeadyet 3 points 18 hours ago I suspect there is more to this.  More people are deciding not to go to college.  More people are going to trade schools, expecially young men.  If schools are not getting enough US students, they will need to bring in foreigners to fill those spots.  The truth is, there are too many colleges in the US and many of them suck and are extremely expensive.  We can afford to have many of them belly up! permalink parent award report block reply Ganeshshu 1 points 11 hours ago All for a shit college that needs to fail! permalink award report block reply NoticesBugleOWO 1 points 13 hours ago I don't worry too much about student \"spies\". They're pretty inept. permalink award report block reply chinigga 1 points 5 hours ago 600,000 guaranteed spies permalink award report block reply based_trekkie 1 points 18 hours ago Plot twist, they can only attend prager-U. permalink award report block reply BenjaminLWillard 1 points 14 hours ago China has the full support of the American Fifth Column and can do no wrong. permalink award report block reply YaharaRiver 1 points 19 hours ago There’s a string attached.  GEOTUS doesn’t ’share resources’, he strikes deals . Wonder what it is??  Must be REALLY BIG. permalink award report block reply MAGALADON9 1 points 18 hours ago No he lost 5 steps. He doesn't have it anymore. permalink parent award report block reply MAGALADON9 0 points 18 hours ago Dementia? permalink award report block reply\nMAGALADON9 11 points 18 hours ago JD will be worse. His life long democrat until recently wife he calls guru has her indian claws in him. Elon has like.4 kids that are Punjabi Indian. The we got barely disguised anti white Kash & vivek permalink award report block reply Oleander 7 points 18 hours ago White people have no one representing their interests in this country. If a new Hitler doesn't rise soon, Whites are done, there's no possible way to survive when most of your own race is working towards their own extinction (in cooperation with our enemies, aka the rest of the world). permalink parent award report block reply\nOleander 7 points 18 hours ago White people have no one representing their interests in this country. If a new Hitler doesn't rise soon, Whites are done, there's no possible way to survive when most of your own race is working towards their own extinction (in cooperation with our enemies, aka the rest of the world). permalink parent award report block reply\nAisle-is-closed 11 points 18 hours ago My only hope (which I have little of these days) is when Trump says something so colossally stupid, our collective outrage is so loud and strong that it actually makes it through his handlers and he changes his mind. It’s happened before, please let it happen again. permalink award report block reply\nJack_NC 9 points 19 hours ago EVERY foreign student is interviewed by an information officer when they return to China. Every student is a spy, to one degree or another. permalink award report block reply MemoryHoleyeO 2 points 12 hours ago They also are given laptops that are turned into their local ups and given a new one once a semester permalink parent award report block reply Mortal_Wombat 2 points 12 hours ago We have any sauce on this? Sounds interesting... permalink parent award report block reply\nMemoryHoleyeO 2 points 12 hours ago They also are given laptops that are turned into their local ups and given a new one once a semester permalink parent award report block reply Mortal_Wombat 2 points 12 hours ago We have any sauce on this? Sounds interesting... permalink parent award report block reply\nMortal_Wombat 2 points 12 hours ago We have any sauce on this? Sounds interesting... permalink parent award report block reply\nAggrieved03 9 points 18 hours ago Midterms will be a bloodbath. permalink award report block reply\nGoldenSpirals 8 points 18 hours ago Anyone remember the story about chinese police active in the US and keep tabs on their CCP citizens over here? Even in the US the chinese people can still get \"disappeared\" permalink award report block reply\nmorememesplz 4 points 14 hours ago I would be ok with Chinese foreigners spending tons of money in the US if they can only enroll in useless degrees like studio art, theatre, or social science - no STEM degree. And no marriage visa or anchor babies. permalink award report block reply\nturdinthepunch 2 points 18 hours ago if this is part of the broader trade deal with china, just say so.  then we can say no fuck off. permalink award report block reply imnotdeadyet 3 points 18 hours ago I suspect there is more to this.  More people are deciding not to go to college.  More people are going to trade schools, expecially young men.  If schools are not getting enough US students, they will need to bring in foreigners to fill those spots.  The truth is, there are too many colleges in the US and many of them suck and are extremely expensive.  We can afford to have many of them belly up! permalink parent award report block reply\nimnotdeadyet 3 points 18 hours ago I suspect there is more to this.  More people are deciding not to go to college.  More people are going to trade schools, expecially young men.  If schools are not getting enough US students, they will need to bring in foreigners to fill those spots.  The truth is, there are too many colleges in the US and many of them suck and are extremely expensive.  We can afford to have many of them belly up! permalink parent award report block reply\nGaneshshu 1 points 11 hours ago All for a shit college that needs to fail! permalink award report block reply\nNoticesBugleOWO 1 points 13 hours ago I don't worry too much about student \"spies\". They're pretty inept. permalink award report block reply\nchinigga 1 points 5 hours ago 600,000 guaranteed spies permalink award report block reply\nbased_trekkie 1 points 18 hours ago Plot twist, they can only attend prager-U. permalink award report block reply\nBenjaminLWillard 1 points 14 hours ago China has the full support of the American Fifth Column and can do no wrong. permalink award report block reply\nYaharaRiver 1 points 19 hours ago There’s a string attached.  GEOTUS doesn’t ’share resources’, he strikes deals . Wonder what it is??  Must be REALLY BIG. permalink award report block reply MAGALADON9 1 points 18 hours ago No he lost 5 steps. He doesn't have it anymore. permalink parent award report block reply\nMAGALADON9 1 points 18 hours ago No he lost 5 steps. He doesn't have it anymore. permalink parent award report block reply\nMAGALADON9 0 points 18 hours ago Dementia? permalink award report block reply",
  "fetched_at": "2025-11-12T20:54:07.456109Z"
}