{
  "id": "1ARK56kO07",
  "url": "https://patriots.win/p/1ARK56kO07/redheadranting-it-took-me-59-yea/c",
  "content": "335 @redheadranting: It took me 59 years, two failed marriages, endless bad dates, raising two kids, caring for both my parents, all the cancellations during Covid and (mostly) menopause to reach this level of unbothered Sydney Sweeney seems to have been BORN WITH. 🔥🗑️ ️ GARBAGE PEOPLE  🗑️🔥 posted 4 days ago by blue5707 16 comments award share report block Redhead Ranting™ @redheadranting • 5d It took me 59 years, two failed marriages, endless bad dates, raising two kids, caring for both my parents, all the cancellations during Covid and (mostly) menopause to reach this level of unbothered Sydney Sweeney seems to have been born with.\n16 comments Sort by Top Top New Worst Old Save 2Fangz 9 points 4 days ago Good quip, but that's the only face with which to fire back at that smug GQ troll. You can see the panic set in behind that troll's eyes. 'Shit, she's not tripping over herself. She's not handing me poorly thought out quotes to eviscerate. I thought she was supposed to be some blonde bimbo. Fuck!' permalink award report block reply SicSemperTyrannis2 3 points 4 days ago This pic is apparently a still from an interview? Got a link to it? permalink parent award report block reply SirPokeSmottington 1 points 4 days ago It took me 59 years, two failed marriages, endless bad dates, raising two kids, caring for both my parents, all the cancellations during Covid and (mostly) menopause Yeah... She's unbothered because she's 59, unfuckable and nobody wants to talk to her, so she's resigned to her loneliness. Sydney is none of those things. [btw, not a Sydney goon... she's a strong 7 all day long] permalink parent award report block reply airborne3502 8 points 4 days ago Best exchange I've read on there in a while: \"Two failed marriages, what's wrong with you?\" \"Lots\" permalink award report block reply SanityGumby 6 points 4 days ago Probably because of being so terrible at making life choices permalink award report block reply doodaddy 5 points 4 days ago Exactly.  I'm going to guess she still doesn't have the Sweeney Swagger; just wishes she did. permalink parent award report block reply bejeavis 5 points 4 days ago Twice divorced weird flex but OK permalink award report block reply YaharaRiver 3 points 4 days ago People Pleasing! and Serving Others! 👍 … is circling the drain. Responsibility and Accountability rising up. permalink award report block reply Kpak76 3 points 4 days ago I don't understand why this woman is advertising her failures in life. permalink award report block reply HaSumBro 0 points 4 days ago It's not a woman you idiot, the G.I.R.L. (guy in real life) is LARPing. Most of the people here are LARPers.... permalink parent award report block reply Kpak76 2 points 4 days ago Lmao go fuck yourself clown.  You don't even know what the conversation is about.  Why are you so angry little troll?  Did your daddy take away your anal beads again? permalink parent award report block reply HaSumBro 0 points 4 days ago K permalink parent award report block reply HocusLocus 2 points 4 days ago It takes Grumpy Cat to bring the ACTUAL INTERVIEW to this thread? permalink award report block reply goatnuts 2 points 4 days ago She's an actor and she's acting. permalink award report block reply Nellie_the_Beaut 1 points 4 days ago YES!!! permalink award report block reply Dwoj 1 points 4 days ago Yeah, that’s a long time to wake up. Glad you’re here with us now. permalink award report block reply\n2Fangz 9 points 4 days ago Good quip, but that's the only face with which to fire back at that smug GQ troll. You can see the panic set in behind that troll's eyes. 'Shit, she's not tripping over herself. She's not handing me poorly thought out quotes to eviscerate. I thought she was supposed to be some blonde bimbo. Fuck!' permalink award report block reply SicSemperTyrannis2 3 points 4 days ago This pic is apparently a still from an interview? Got a link to it? permalink parent award report block reply SirPokeSmottington 1 points 4 days ago It took me 59 years, two failed marriages, endless bad dates, raising two kids, caring for both my parents, all the cancellations during Covid and (mostly) menopause Yeah... She's unbothered because she's 59, unfuckable and nobody wants to talk to her, so she's resigned to her loneliness. Sydney is none of those things. [btw, not a Sydney goon... she's a strong 7 all day long] permalink parent award report block reply\nSicSemperTyrannis2 3 points 4 days ago This pic is apparently a still from an interview? Got a link to it? permalink parent award report block reply\nSirPokeSmottington 1 points 4 days ago It took me 59 years, two failed marriages, endless bad dates, raising two kids, caring for both my parents, all the cancellations during Covid and (mostly) menopause Yeah... She's unbothered because she's 59, unfuckable and nobody wants to talk to her, so she's resigned to her loneliness. Sydney is none of those things. [btw, not a Sydney goon... she's a strong 7 all day long] permalink parent award report block reply\nairborne3502 8 points 4 days ago Best exchange I've read on there in a while: \"Two failed marriages, what's wrong with you?\" \"Lots\" permalink award report block reply\nSanityGumby 6 points 4 days ago Probably because of being so terrible at making life choices permalink award report block reply doodaddy 5 points 4 days ago Exactly.  I'm going to guess she still doesn't have the Sweeney Swagger; just wishes she did. permalink parent award report block reply\ndoodaddy 5 points 4 days ago Exactly.  I'm going to guess she still doesn't have the Sweeney Swagger; just wishes she did. permalink parent award report block reply\nbejeavis 5 points 4 days ago Twice divorced weird flex but OK permalink award report block reply\nYaharaRiver 3 points 4 days ago People Pleasing! and Serving Others! 👍 … is circling the drain. Responsibility and Accountability rising up. permalink award report block reply\nKpak76 3 points 4 days ago I don't understand why this woman is advertising her failures in life. permalink award report block reply HaSumBro 0 points 4 days ago It's not a woman you idiot, the G.I.R.L. (guy in real life) is LARPing. Most of the people here are LARPers.... permalink parent award report block reply Kpak76 2 points 4 days ago Lmao go fuck yourself clown.  You don't even know what the conversation is about.  Why are you so angry little troll?  Did your daddy take away your anal beads again? permalink parent award report block reply HaSumBro 0 points 4 days ago K permalink parent award report block reply\nHaSumBro 0 points 4 days ago It's not a woman you idiot, the G.I.R.L. (guy in real life) is LARPing. Most of the people here are LARPers.... permalink parent award report block reply Kpak76 2 points 4 days ago Lmao go fuck yourself clown.  You don't even know what the conversation is about.  Why are you so angry little troll?  Did your daddy take away your anal beads again? permalink parent award report block reply HaSumBro 0 points 4 days ago K permalink parent award report block reply\nKpak76 2 points 4 days ago Lmao go fuck yourself clown.  You don't even know what the conversation is about.  Why are you so angry little troll?  Did your daddy take away your anal beads again? permalink parent award report block reply HaSumBro 0 points 4 days ago K permalink parent award report block reply\nHaSumBro 0 points 4 days ago K permalink parent award report block reply\nHocusLocus 2 points 4 days ago It takes Grumpy Cat to bring the ACTUAL INTERVIEW to this thread? permalink award report block reply\ngoatnuts 2 points 4 days ago She's an actor and she's acting. permalink award report block reply\nNellie_the_Beaut 1 points 4 days ago YES!!! permalink award report block reply\nDwoj 1 points 4 days ago Yeah, that’s a long time to wake up. Glad you’re here with us now. permalink award report block reply",
  "fetched_at": "2025-11-12T21:02:21.422809Z"
}