{
  "id": "1ARK9hiHgK",
  "url": "https://patriots.win/p/1ARK9hiHgK/olympics-set-to-ban-all-transgen/c",
  "content": "441 Olympics set to ban ALL transgender athletes (www.dailymail.co.uk) posted 2 days ago by rdvs34283 19 comments award share report block Olympics set to ban ALL transgender athletes in female events Transgender athletes and those with differences of sexual development (DSD) will reportedly be banned from competing in female competitions at the Olympics from early next year. www.dailymail.co.uk\n19 comments Sort by Top Top New Worst Old Save LostElf 8 points 2 days ago They can hold their own Troonlympics for nobody to watch because they are pathetic mentally ill freaks. permalink award report block reply Whoopies_tds 10 points 2 days ago Isn't that what the WNBA is? permalink parent award report block reply LostElf 1 points 2 days ago YES permalink parent award report block reply Transparency 1 points 2 days ago Same with women's soccer and pretty much every other female sport. The players dress the way they do in things like female volley ball to attract viewers, because men are pervs. permalink parent award report block reply donteatthat 2 points 2 days ago Yo the college softball games are great. They all got ass. permalink parent award report block reply Transparency 2 points 2 days ago They can hold their own Troonlympics Right. We don't mix the Olympics with the Special Olympics, so why should we mix it with the Troonlympics ??? permalink parent award report block reply South_Florida_Guy 7 points 2 days ago They gonna give that Italian boxer girl her gold medal then? permalink award report block reply Beat_to_Quarters 5 points 2 days ago It only took a man punching the shit out of women in boxing on a global stage and winning a gold medal and then the IOC getting caught covering up they knew it was a dude all along for the change to happen. permalink award report block reply Snek_Plissken 1 points 2 days ago The liberals screeched non-stop when I said it was a man. He is a dude that had a girlfriend. He doesn’t even have any fucked up chromosomes to fall back on that shit. Straight up dude with massive testosterone. Anyhow, let men take over womens sports until they realize we took all of their opportunities. permalink parent award report block reply TearsAficionado 3 points 2 days ago \"Set to\"??? Just do it already. Can't stand these fucking media headlines. permalink award report block reply TrustYourself 3 points 2 days ago Cheers fags. permalink award report block reply 4886Battery 2 points 2 days ago Uh oh, 2028 Olympics are set for Los Angeles... permalink award report block reply FattestConsequence 2 points 2 days ago Let's see some butchered women show up in men's categories! The Olympics could use some laughs. permalink award report block reply iamimaginos 1 points 2 days ago Somebody tell Planet Fitness permalink award report block reply booblitchutz 1 points 2 days ago Well, that creates a \"gray zone\" for them. Imane may or may not be specifically \"trans\", right? permalink award report block reply clownworld30330 1 points 2 days ago For now. Then when the Dems steal the presidency next… permalink award report block reply JimRaynor 1 points 2 days ago They can always try to compete against men in \"open\" criteria. Even women can compete there. (except they know they'll lose against other men) permalink award report block reply\nLostElf 8 points 2 days ago They can hold their own Troonlympics for nobody to watch because they are pathetic mentally ill freaks. permalink award report block reply Whoopies_tds 10 points 2 days ago Isn't that what the WNBA is? permalink parent award report block reply LostElf 1 points 2 days ago YES permalink parent award report block reply Transparency 1 points 2 days ago Same with women's soccer and pretty much every other female sport. The players dress the way they do in things like female volley ball to attract viewers, because men are pervs. permalink parent award report block reply donteatthat 2 points 2 days ago Yo the college softball games are great. They all got ass. permalink parent award report block reply Transparency 2 points 2 days ago They can hold their own Troonlympics Right. We don't mix the Olympics with the Special Olympics, so why should we mix it with the Troonlympics ??? permalink parent award report block reply\nWhoopies_tds 10 points 2 days ago Isn't that what the WNBA is? permalink parent award report block reply LostElf 1 points 2 days ago YES permalink parent award report block reply Transparency 1 points 2 days ago Same with women's soccer and pretty much every other female sport. The players dress the way they do in things like female volley ball to attract viewers, because men are pervs. permalink parent award report block reply donteatthat 2 points 2 days ago Yo the college softball games are great. They all got ass. permalink parent award report block reply\nLostElf 1 points 2 days ago YES permalink parent award report block reply\nTransparency 1 points 2 days ago Same with women's soccer and pretty much every other female sport. The players dress the way they do in things like female volley ball to attract viewers, because men are pervs. permalink parent award report block reply donteatthat 2 points 2 days ago Yo the college softball games are great. They all got ass. permalink parent award report block reply\ndonteatthat 2 points 2 days ago Yo the college softball games are great. They all got ass. permalink parent award report block reply\nTransparency 2 points 2 days ago They can hold their own Troonlympics Right. We don't mix the Olympics with the Special Olympics, so why should we mix it with the Troonlympics ??? permalink parent award report block reply\nSouth_Florida_Guy 7 points 2 days ago They gonna give that Italian boxer girl her gold medal then? permalink award report block reply\nBeat_to_Quarters 5 points 2 days ago It only took a man punching the shit out of women in boxing on a global stage and winning a gold medal and then the IOC getting caught covering up they knew it was a dude all along for the change to happen. permalink award report block reply Snek_Plissken 1 points 2 days ago The liberals screeched non-stop when I said it was a man. He is a dude that had a girlfriend. He doesn’t even have any fucked up chromosomes to fall back on that shit. Straight up dude with massive testosterone. Anyhow, let men take over womens sports until they realize we took all of their opportunities. permalink parent award report block reply\nSnek_Plissken 1 points 2 days ago The liberals screeched non-stop when I said it was a man. He is a dude that had a girlfriend. He doesn’t even have any fucked up chromosomes to fall back on that shit. Straight up dude with massive testosterone. Anyhow, let men take over womens sports until they realize we took all of their opportunities. permalink parent award report block reply\nTearsAficionado 3 points 2 days ago \"Set to\"??? Just do it already. Can't stand these fucking media headlines. permalink award report block reply\nTrustYourself 3 points 2 days ago Cheers fags. permalink award report block reply\n4886Battery 2 points 2 days ago Uh oh, 2028 Olympics are set for Los Angeles... permalink award report block reply\nFattestConsequence 2 points 2 days ago Let's see some butchered women show up in men's categories! The Olympics could use some laughs. permalink award report block reply\niamimaginos 1 points 2 days ago Somebody tell Planet Fitness permalink award report block reply\nbooblitchutz 1 points 2 days ago Well, that creates a \"gray zone\" for them. Imane may or may not be specifically \"trans\", right? permalink award report block reply\nclownworld30330 1 points 2 days ago For now. Then when the Dems steal the presidency next… permalink award report block reply\nJimRaynor 1 points 2 days ago They can always try to compete against men in \"open\" criteria. Even women can compete there. (except they know they'll lose against other men) permalink award report block reply",
  "fetched_at": "2025-11-12T22:57:25.159021Z"
}