{
  "id": "1ARK9jztKw",
  "url": "https://patriots.win/p/1ARK9jztKw/trump-says-us-would-need-to-pay-/c",
  "content": "273 Trump Says US Would Need to Pay Back OVER $2 TRILLION in Tariff Revenue and Investments if SCOTUS Rules Against Tariffs – “A National Security Catastrophe” (www.thegatewaypundit.com) posted 1 day ago by friarfox 12 comments award share report block Trump Says US Would Need to Pay Back OVER $2 TRILLION in Tariff Revenue and Investments if SCOTUS Rules Against Tariffs - \"A Nat... President Trump on Monday said the United States would lose $2 trillion if the Supreme Court does not rule in his favor in a lawsuit challenging his authority to impose sweeping tariffs under the International Emergency Economic Powers Act of 197... www.thegatewaypundit.com\n12 comments Sort by Top Top New Worst Old Save FusionBlack 15 points 1 day ago Send the bill to SCOTUS. Not a joke. Start sending the bill to these judges that make financial decisions. They are responsible for their actions. permalink award report block reply blueeyephoto 12 points 1 day ago congress has authority to levy taxes against citizens. the President has the authority to levy tariffs against other nations. permalink award report block reply tralbolh 9 points 1 day ago If they rule the law granting the president the ability to lower tariffs is \"congress abdicating their powers\" like SCOTUS did with the Line-Item veto, shouldn't the tariffs go back to the levels they were at when the 'International Emergency Economic Powers Act of 1977' was enacted? Which were probably way higher than today in many cases. Seems like most of these plaintiffs should be unironically dismissed for lack of standing if they, being importers of a good tariffed at a higher rate now than 2015, are challenging a percentage set by the president that is lower than the 1976 levels. permalink award report block reply BillGateCanSuckIt 6 points 1 day ago So even though there is years and years of precedent the Dems are playing the game of we need to define what powers the president actually has. Corrupt motherf-ers. They were 100% ok with the autopen permalink award report block reply PatriotSkorzeny 3 points 1 day ago Pay back means borrowed. Wtf permalink award report block reply Bramage 2 points 1 day ago Overstepping judges.  IGNORE. permalink award report block reply NoMaskNoMaster -6 points 1 day ago How about you pay back the US citizens that paid the tariffs? permalink award report block reply CLF3 7 points 1 day ago Nobody forces you to not buy American.  There should be a 500% tariff on everything not made by American hands.  Fuck the rest of the world and fuck you for not supporting americans with your buying. permalink parent award report block reply NoMaskNoMaster -10 points 1 day ago Nice try little dick hebrew/pajeet shill. Maybe if you turds didn't destroy our soil our butter would actually have flavor? I buy grass-fed butter from Ireland and Finland because the butter here is BLAND. permalink parent award report block reply axiy 4 points 1 day ago I don’t think Jews and Indians are trying to force you to eat American butter. That’s the most moronic thing I’ve read If a simple task in supporting the country you live in is too much, then you should consider leaving the US to get tastier butter. Otherwise suck it up permalink parent award report block reply NoMaskNoMaster -2 points 1 day ago You're missing the point, dipshit. EVERYTHING has been outsourced to other countries at this point. We don't HAVE any products made in America anymore. Fucking imbecile. permalink parent award report block reply view 1 more comments...\nFusionBlack 15 points 1 day ago Send the bill to SCOTUS. Not a joke. Start sending the bill to these judges that make financial decisions. They are responsible for their actions. permalink award report block reply\nblueeyephoto 12 points 1 day ago congress has authority to levy taxes against citizens. the President has the authority to levy tariffs against other nations. permalink award report block reply\ntralbolh 9 points 1 day ago If they rule the law granting the president the ability to lower tariffs is \"congress abdicating their powers\" like SCOTUS did with the Line-Item veto, shouldn't the tariffs go back to the levels they were at when the 'International Emergency Economic Powers Act of 1977' was enacted? Which were probably way higher than today in many cases. Seems like most of these plaintiffs should be unironically dismissed for lack of standing if they, being importers of a good tariffed at a higher rate now than 2015, are challenging a percentage set by the president that is lower than the 1976 levels. permalink award report block reply\nBillGateCanSuckIt 6 points 1 day ago So even though there is years and years of precedent the Dems are playing the game of we need to define what powers the president actually has. Corrupt motherf-ers. They were 100% ok with the autopen permalink award report block reply\nPatriotSkorzeny 3 points 1 day ago Pay back means borrowed. Wtf permalink award report block reply\nBramage 2 points 1 day ago Overstepping judges.  IGNORE. permalink award report block reply\nNoMaskNoMaster -6 points 1 day ago How about you pay back the US citizens that paid the tariffs? permalink award report block reply CLF3 7 points 1 day ago Nobody forces you to not buy American.  There should be a 500% tariff on everything not made by American hands.  Fuck the rest of the world and fuck you for not supporting americans with your buying. permalink parent award report block reply NoMaskNoMaster -10 points 1 day ago Nice try little dick hebrew/pajeet shill. Maybe if you turds didn't destroy our soil our butter would actually have flavor? I buy grass-fed butter from Ireland and Finland because the butter here is BLAND. permalink parent award report block reply axiy 4 points 1 day ago I don’t think Jews and Indians are trying to force you to eat American butter. That’s the most moronic thing I’ve read If a simple task in supporting the country you live in is too much, then you should consider leaving the US to get tastier butter. Otherwise suck it up permalink parent award report block reply NoMaskNoMaster -2 points 1 day ago You're missing the point, dipshit. EVERYTHING has been outsourced to other countries at this point. We don't HAVE any products made in America anymore. Fucking imbecile. permalink parent award report block reply view 1 more comments...\nCLF3 7 points 1 day ago Nobody forces you to not buy American.  There should be a 500% tariff on everything not made by American hands.  Fuck the rest of the world and fuck you for not supporting americans with your buying. permalink parent award report block reply NoMaskNoMaster -10 points 1 day ago Nice try little dick hebrew/pajeet shill. Maybe if you turds didn't destroy our soil our butter would actually have flavor? I buy grass-fed butter from Ireland and Finland because the butter here is BLAND. permalink parent award report block reply axiy 4 points 1 day ago I don’t think Jews and Indians are trying to force you to eat American butter. That’s the most moronic thing I’ve read If a simple task in supporting the country you live in is too much, then you should consider leaving the US to get tastier butter. Otherwise suck it up permalink parent award report block reply NoMaskNoMaster -2 points 1 day ago You're missing the point, dipshit. EVERYTHING has been outsourced to other countries at this point. We don't HAVE any products made in America anymore. Fucking imbecile. permalink parent award report block reply view 1 more comments...\nNoMaskNoMaster -10 points 1 day ago Nice try little dick hebrew/pajeet shill. Maybe if you turds didn't destroy our soil our butter would actually have flavor? I buy grass-fed butter from Ireland and Finland because the butter here is BLAND. permalink parent award report block reply axiy 4 points 1 day ago I don’t think Jews and Indians are trying to force you to eat American butter. That’s the most moronic thing I’ve read If a simple task in supporting the country you live in is too much, then you should consider leaving the US to get tastier butter. Otherwise suck it up permalink parent award report block reply NoMaskNoMaster -2 points 1 day ago You're missing the point, dipshit. EVERYTHING has been outsourced to other countries at this point. We don't HAVE any products made in America anymore. Fucking imbecile. permalink parent award report block reply view 1 more comments...\naxiy 4 points 1 day ago I don’t think Jews and Indians are trying to force you to eat American butter. That’s the most moronic thing I’ve read If a simple task in supporting the country you live in is too much, then you should consider leaving the US to get tastier butter. Otherwise suck it up permalink parent award report block reply NoMaskNoMaster -2 points 1 day ago You're missing the point, dipshit. EVERYTHING has been outsourced to other countries at this point. We don't HAVE any products made in America anymore. Fucking imbecile. permalink parent award report block reply view 1 more comments...\nNoMaskNoMaster -2 points 1 day ago You're missing the point, dipshit. EVERYTHING has been outsourced to other countries at this point. We don't HAVE any products made in America anymore. Fucking imbecile. permalink parent award report block reply view 1 more comments...",
  "fetched_at": "2025-11-12T20:48:56.919156Z"
}