{
  "id": "1ARK57r8QS",
  "url": "https://patriots.win/p/1ARK57r8QS/welp-time-to-start-arresting-the/c",
  "content": "1042 Welp! Time to start arresting the rape whistle brigade REEEEEEE! posted 4 days ago by SuperHonkey 146 comments award share report block johnny maga @_johnnymaga • 5d Chicago women are spending their days walking around with whistles so they can alert illegals of ICE activity in the area. They’re quite literally trying to save convicted sex offenders from being taken out of their neighborhoods. They should absolutely be arrested for this.\n146 comments Sort by Top Top New Worst Old Save FusionBlack 83 points 4 days ago I am beginning to think something akin to the \"Havana Syndrome\" has been used on large potions of the population primary cites. The insanity and non use of critical thinking has exploded recently. permalink award report block reply MasterChief 44 points 4 days ago It's the slop. AI slop, social media slop, MSM slop, political slop, educational slop, slop diets, slop exercise, slop social lives, slop life experiences, slop quality everything. Hardly anyone does their homework, or fact checks or ever calls bullshit in real life. We are zombie walking into a Idiocracy/Wall-E future, with our heads in the sand. We are being influenced by foreign parties and lobbyists more than ever before, and there is no escaping it other than getting off-grid and disappearing  into the woods permalink parent award report block reply henri_derelicte 19 points 4 days ago It’s straight up disinformation too. Folks in Chicago think ICE is arresting “day care teachers” when in reality it was an illegal who tried to hide in a day care to avoid arrest permalink parent award report block reply imnotdeadyet 10 points 4 days ago Exactly.  There needs to be pain for running a false story. permalink parent award report block reply henri_derelicte 9 points 4 days ago If I was Trump, I would have invoked the insurrection act against Chicago already. JB Pritzker and Brandon Johnson would have been cuffed and perp walked by now, and then beaten and brutalized in custody permalink parent award report block reply view 3 more comments... RiolindasReturn 5 points 4 days ago Arrest the Karens… someone draft Karen’s law lol. permalink parent award report block reply FusionBlack 14 points 4 days ago You are correct. In the local rag comment section where I live is nothing more than canned AI copy and paste responses. Even most of my friends use AI for everything work related. Its dumbing down thier brains. permalink parent award report block reply TheThreeSeashells 4 points 4 days ago The work thing with AI is really bothering me.  Of course, most of the time it's the women embracing that garbage. I recently had an example where a woman I work with was explaining how to do something with AI to edit some text provided by a client.  She went on for about five minutes on creating the right query and then tweaking it get the right result.  Meanwhile, I pasted it into Notepad, did a search and replace, and it was done in 5 seconds. Every time I bring up the fact that there are better tools than AI for most jobs, they act like I'm telling them their outfit makes them look fat. permalink parent award report block reply SanityGumby 4 points 4 days ago Their outfit doesn’t make them look fat. Them being fat makes them look fat permalink parent award report block reply FusionBlack 2 points 4 days ago Lazy. That's all it is and what's funny is that they will spend more time on a time saver. permalink parent award report block reply CleanUpPhillyTrump24 4 points 4 days ago Wow. permalink parent award report block reply The_Emperor 2 points 4 days ago You are correct except about slop exercise and diets\nThe brilliant founders, many of whom like John Adam's was not a big exercise, or partook of drinking (Sam Adams) and many were diseased (Washington). Brains still were present.   So let's focus on retards being retarded,  and not wast energy sending retards to PE or to eating kale and protein to get smarter. permalink parent award report block reply FrmrAmericanRepublic 1 points 4 days ago It started before AI tools were created, just all the other slop you mentioned was enough. AI just accelerates the rate at which propaganda can be made, which is a big fucking problem - but we can't stuff the cat back in the bag now. Wall-E is a good comparison, because \"Buy N Large\" kind of mentality, Idiocracy-style mobile hover-lounges while continuously snacking and screen-zombed is alarmingly close to current reality. \"News\" cycle accelerates because TikTok and other platforms train the retards to have sub-minute attention spans. Not ideal, and I like technology, just not how its being used. permalink parent award report block reply Transparency 1 points 4 days ago Yup. Garbage-in = Garbage-out. permalink parent award report block reply GatoradeJeb 22 points 4 days ago Its hollywood racemix propaganda brainwashing White woman. Look how every movie/ad now has White woman with brown vermin. Irl White woman have integrated this which is why you see race traitor White woman defending illegals and brown criminals permalink parent award report block reply CleanUpPhillyTrump24 14 points 4 days ago I mean a lot of the anti-ICE Karen brigades are lesbians, trannies, gay men in social services/health care, or other alphabets who work for the black money funded NGOs and leftist church/synogogues that are just CCP fronts for anarcho-tyranny implementation on domestic soil. How do I know for sure? In Philly, these \"church\" groups and \"reform temples\" (aka Jews who are not even remotely Jewish) backed off all at once, like they were taking orders from above, in Philly from blocking highways, harassing people in the street, vandalizing things, doing graffiti \"for the cause.\" IOW they morphed from their hardcore BurnLootMurdering as Antifa after Antifa was made a domestic terror group. So the rationale for this professional leftism is these were the kids that got non-useful degrees that had a minor in leftist indoctrination. They're unemployable, and can't even maintain things like group houses for themselves because they can't stand living with each other. Unless they get work as wait staff/baristas or other food trade work, there're few bosses who want to deal with their dysthymic crap. It's a doom loop created by leftism that is strongly contributing to drug use/ETOH addiction, and being unemployable in the normal world, so they can only do gig work or work in restaurants, cafes, diners, clubs. There's a whole ecosystem of these in Philly. What they don't realize is that they really are a tiny minority of the true population. But they get all their info from the MSM and social media. permalink parent award report block reply ancroidubh 5 points 4 days ago Top marks for pinning a diagnosis on the left as “dysthemic”. Upvote for you! permalink parent award report block reply orcwordlaugh 7 points 4 days ago Try asking someone, not in the know, what percentage of the USA population is black. From my experience, the saturation of them in media will have many people give a number near 50%. permalink parent award report block reply shadypollster 3 points 4 days ago Britain noticed finally. permalink parent award report block reply KartoffelPuffer 2 points 4 days ago Ask an affluent Karen living in a 94% White area the same question.  She'll insist she's in a \"highly diverse\" area with at least 50% minorities.   She knows it's true because she always \"notices that one Black woman at the grocery store\" and her nail tech is \"Chinese?/Vietnamese?/Korean?/Filipino?/ something Asian for certain.\" permalink parent award report block reply basedboston 7 points 4 days ago She doesn't have any babies, so she weaponizes her fading motherly instincts to protect people. permalink parent award report block reply SuperHonkey OP 6 points 4 days ago killed her babies permalink parent award report block reply booblitchutz 1 points 4 days ago “Burgers?” permalink parent award report block reply NotYourMan 9 points 4 days ago These are women who watch MSM stories about ICE taking families (distorted reality to make Trump look bad) and completely miss the result that ICE is taking away murderers, gang members, and rapists.  The echo chamber is not reality. permalink parent award report block reply Spicy_cat 2 points 4 days ago Remember the Rocky and Bullwinkle episode with the goof gas? permalink parent award report block reply load 4 more comments... Justlooking250 23 points 4 days ago Ok cool now I think everyone else should go around with whistles and just sound them in random places at random times for no reason so it creates a 'cry wolf' effect then people will eventually ignore it permalink award report block reply booblitchutz 9 points 4 days ago It’s way more coordinated than that. They are told exactly where and when to show up. I wouldn’t doubt if they were given reimbursements or just straight up CTA cards to get them where they need to go. Once they get there they’re given souvenirs like t shirts and whistles and if they post on social media and tag the event they get tons of botted likes and followers in exchange. Nobody just goes where they hear whistles. How do they know where to show up? Elementary. They are tipped off by moles in ICE and CPD. permalink parent award report block reply TheThreeSeashells 2 points 4 days ago Exactly.  It's time to start feeding false information within the ranks to root them out.  I would have assumed this was already being done, but given the coordination of these assholes, knowing exactly when and where to show up when there's no reason on Earth they would possibly know otherwise, nor be in these neighborhoods otherwise, it doesn't seem like the higher-ups have picked up on the fact that information is being leaked. permalink parent award report block reply booblitchutz 1 points 4 days ago They most certainly have enough presence on the inside to be tipped off on that, too. permalink parent award report block reply TheThreeSeashells 1 points 2 days ago That's fine.  Eventually they would figure out where the leaks are coming from. permalink parent award report block reply RealTXPatriot 3 points 4 days ago BINGO permalink parent award report block reply God-is-good 15 points 4 days ago Rape whistle irony... unexpected. permalink award report block reply SteveRogers42 1 points 4 days ago It’s as if O Henry and Alannis Morisette had a baby and named her Rape Whistle. permalink parent award report block reply dburt2 13 points 4 days ago Women can relieve 95% of their stress and anxiety by sitting on a mans face. permalink award report block reply SuperHonkey OP 20 points 4 days ago You don't want old Suzie Rottencrotch anywhere near your face bud permalink parent award report block reply Appeal2Heaven98 7 points 4 days ago Sydney Sweeney? Maybe. But not this liberal crotch rocket. permalink parent award report block reply RealTXPatriot 1 points 4 days ago Don't talk about motorcycles like that. Cmon they're fun. permalink parent award report block reply GdotLee 5 points 4 days ago imagine the beef curtains draping your cheeks. permalink parent award report block reply McFatty7 3 points 4 days ago But not this woman and women like her. They’re crazy enough to try to suffocate the men. permalink parent award report block reply booblitchutz 3 points 4 days ago The woman in this video is a straight up howler. The woman in this video is almost guaranteed to be a “lesbian”. permalink parent award report block reply load 2 more comments... GatoradeJeb 12 points 4 days ago I want these race trairor White woman executed. The biggest hreat to White man is these race traitor White woman who mudshark with these brown scum permalink award report block reply booblitchutz 11 points 4 days ago I know a woman who lives in Chicago and posts this red whistle crap. She’s a real piece of work. Failed marriage, no kids, has always been a weird fag hag, now claims to be a “lesbian”, is post menopausal now and alone and just neck deep in this crap. She’s always posting pics of her and some creepy fag or massive bull dyke doing the soy face. I can just feel the sadness oozing from her. permalink parent award report block reply PM_ME_UR_MAGIC_CARDS 6 points 4 days ago Just goes to show you don't need to die to go to hell, some people live in it permalink parent award report block reply booblitchutz 2 points 4 days ago 100% of this is just her living in an impenetrable far left bubble her entire adult life. She’s been fed a steady diet of toxic programming non stop. In spite of everything that is clearly broken in her life, she truly believes she is a hero. But she also believes she’s been a victim her whole life, too. That’s what the programming does to them. It convinces them they are moral heroes and at the same time convinces them everything wrong in their lives is driven by external factors. permalink parent award report block reply SteveRogers42 2 points 4 days ago Like that bitch interviewer trying to trip up Sydney Sweeney. permalink parent award report block reply RIPcharlie 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply Wizard_Glick 12 points 4 days ago Flood the zone, buy a whistle and blow it all the time... permalink award report block reply Zacktopia33 8 points 4 days ago Exactly. See a whistle, blow a whistle. permalink parent award report block reply Settin 12 points 4 days ago You’re telling me I can blow a whistle everywhere I go and the illegals will flee? permalink award report block reply TheMostUselessFeeder 10 points 4 days ago Some days I feel like the post-wall eggless liberal white woman epidemic is actually the biggest problem the nation faces... 🤦‍♂️ In many ways, they seem to hate the country more than any of the invaders. permalink award report block reply SanityGumby 3 points 4 days ago It is and that alone should be enough to repeal the 19th. It’s failed. permalink parent award report block reply SpellingContable 1 points 4 days ago They are whistling out a patriarchal society, to whistle in a rapey society. But why? Why would they do that? The desirability level is greater in a rapey society. The raping hoards dont call them eggless wrinkled old windbags. The rapists will rape anyone. permalink parent award report block reply MehNahMehNah 9 points 4 days ago Or drown them out. I wonder if you can get musical car horns from JC Whitney that play 'la cucuracha' still? permalink award report block reply SuperHonkey OP 3 points 4 days ago What kind of shithole society would make a song about vermin? Spez: https://a.co/d/6qoZyRV permalink parent award report block reply Appeal2Heaven98 6 points 4 days ago White liberal women have been and will continue to be the ruin of this nation. I should know. Minnesota is the whitest liberal state in the United States. permalink award report block reply Pepe_longcockings 5 points 4 days ago They want their rape fantasies fulfilled permalink award report block reply Taqiyya_Mockingbird 4 points 4 days ago What’s the difference between rape and football? Feminists don’t fantasize about football. permalink parent award report block reply Skogin 1 points 4 days ago But the frustration continues. permalink parent award report block reply stagolee 5 points 4 days ago Not THEIR neighborhoods.  They're going into other people's neighborhoods and doing it there.  Fucking scum. permalink award report block reply RealTXPatriot 5 points 4 days ago I'd abuse this.... Every time I went to a grocery store I would drive around the parking lot blowing the whistle.... watch them all run.... then do it again in a minute or two. After that the lines and crowds should be fewer. permalink award report block reply SuperHonkey OP 1 points 4 days ago Maybe even setup some autonomous whistle bots and place them discreetly in parking lots around town at home depot, guwalmart, etc to go off every hour, but only for a few seconds so as to evade detection 😎 permalink parent award report block reply Michalusmichalus 1 points 4 days ago There are already videos of that. About long lines. permalink parent award report block reply SuperHonkey OP 5 points 4 days ago Fastest sticky in the west! 😎 permalink award report block reply henri_derelicte 5 points 4 days ago This. These dipshits are blowing their whistles and honking their car horns whenever ICE is in the area. I want to emphasize this is NOT normal. Immigration enforcement is facing extraordinarily high resistance in Chicago, and if the administration can win there, I think we can break the left nationwide and convince them that resistance is futile permalink award report block reply indigo_truther 4 points 4 days ago They should also decide on a whistle pattern for \"getting raped by a migrant\" to help avoid confusion with their one long whistle \"ICE detention\" and 3 short blasts for \"ICE in the area\" permalink award report block reply SuperHonkey OP 2 points 4 days ago To the beat of 'la cucaracha' permalink parent award report block reply Moebius 4 points 4 days ago Aiding and Abetting permalink award report block reply TerrorOfLiberals 4 points 4 days ago So now when you are getting raped by black guys and Muslims, you can blow your rape whistle and all the Mexicans will run away. Good thinking, ladies. permalink award report block reply Gfloydvotestrump 3 points 4 days ago Does the whistle blow in Spanish? permalink award report block reply SuperHonkey OP 3 points 4 days ago ¿Que? permalink parent award report block reply marlenaa315 3 points 4 days ago Shorter video “I’m a snitch” permalink award report block reply DITTOPatriot 3 points 4 days ago I don’t personally support it, but it is a First Amendment right that is enshrined and codified. Never give your rights up, never, no matter how your opponent may wield them to their benefit. permalink award report block reply spinometer2 3 points 4 days ago these women are so dumb. the whistle is meant to protect THEM. now no one will care when they hear a frantic whistle. permalink award report block reply SuperHonkey OP 1 points 4 days ago Good! permalink parent award report block reply spinometer2 1 points 4 days ago I have a daughter who walks several miles a day through a big city, I'm not happy about this permalink parent award report block reply Maxdady01 3 points 4 days ago \"Suicidal Empathy\" - Asmongold permalink award report block reply Rudy_DankMemer 3 points 4 days ago insane. These broads are walking around, virtue whistling, secretly hoping, trying to get raped by one of the invaders.  Clown world is real.🤡 permalink award report block reply Female 3 points 4 days ago Woman getting raped, blows the rape whistle; bystander in the area: eh she's just calling about ice The lass Who Cried Wolf permalink award report block reply donteatthat 3 points 4 days ago Let them get stabbed and raped. Who gives a shit permalink award report block reply jonnyuno 3 points 4 days ago Would be funny if it ended up a dog whistle for the perps. permalink award report block reply terribletwos 3 points 4 days ago Nah, you just boy who cried wolf that shit. Get a bunch of your friends together and just wander around these areas blowing your whistles all day. permalink award report block reply bluewhiteandred 3 points 4 days ago obstruction permalink award report block reply TheFozz 2 points 4 days ago Americans are so gaslit, we're basically beyond saving. Liberals would happily give their neck to a Muslim with a Machete. There's nothing that can save them at this point. permalink award report block reply rocco_saint 2 points 4 days ago So let me get this straight.  Women have adopted a \"rape whistle\" to hopefully keep them safe in the event they are attacked and raped.  Now they are using this symbolic alarm to draw attention and prevent illegals from being deported. Do you think any of them realize the \"boy who cried wolf\" situation here by mingling the two purposes?  Or are they really that dumb?  And I'm not even talking about the higher than normal illegal rape statistics.  I'm talking about the whistles being ignored..... permalink award report block reply SuperHonkey OP 3 points 4 days ago Of course they're that dumb, we're talking about AWFLs here permalink parent award report block reply 4886Battery 2 points 4 days ago Hook up some drones with whistles and buzz them around town. permalink award report block reply redditadminssuckit 2 points 4 days ago Great way to clear out the crowds in the emergency room permalink award report block reply RedFoxOnFire 2 points 4 days ago Using rape whistles to save convicted sex offenders. I'd say it's ironic, but I've glimpsed at what fetishist women read. permalink award report block reply Tao_Pai 2 points 4 days ago …and they rejoice in killing babies. These people are sociopaths. permalink award report block reply Pelosi_Halitosis 2 points 4 days ago Why do they all look like this? permalink award report block reply Steve56775 2 points 4 days ago She forgot her nose ring today. permalink parent award report block reply Trumpdeasses 2 points 4 days ago Fast way to neutralize that is cry wolf . All you Magas in the area just start blowing whistles all day . The bean jumpers won't know whether to shit or go Blind. permalink award report block reply PatriotSkorzeny 2 points 4 days ago Why’s the illegal there for her to blow a whistle about?? Never that. Never…that. permalink award report block reply Mike_Hoxbigg 2 points 4 days ago Send her to Somalia, and she can blow her whistle all the while the local boys are running a train on her. permalink award report block reply GreyGooseDown 2 points 4 days ago Terrible mommy milkers. permalink award report block reply Christineblaseyford 2 points 4 days ago Chicago Patriots, buy rape whistles, blow them often permalink award report block reply rumplestiltzkin2 2 points 4 days ago rape whistles to warn the rapists the police are coming permalink award report block reply Pwrxs 2 points 4 days ago Women use rape whistles to protect rapists.  Insanity. permalink award report block reply DudeNoOne 2 points 4 days ago Obstruction is the surest way to make you attorney’s week difficult. permalink award report block reply bobbacringo 2 points 4 days ago Women should not be allowed to vote or work. permalink award report block reply Tunk 2 points 4 days ago Honestly a few ice raids need to head out with additional patrols that cover surrounding streets. Moment the crowd forms and starts interfering, arrest and charge them ALL with providing aid to the illegal aliens. None of this assaulting federal officer, interfering, etc stuff. Charge them with the crime they are committing and haul them off. Make sure the prosecutors are fully on board with it and ram it through, and sweep up as many as possible in the first 10-20 tag and bag raids of people aiding illegals. Try as hard as possible to get them the J6 treatment, when folks start going to jail for aiding illegals, this shit will become public knowledge that helping illegals is illegal, radioactive and prohibitively expensive, shit will stop. And the ones that don't stop, well they stop once in jail. permalink award report block reply JoinTheDiscussion 2 points 4 days ago Arrests... Now that's funny permalink award report block reply onesummerdream 2 points 4 days ago Seems to me a pede could disrupt a lot of industry and construction sites with just a whistle lol. permalink award report block reply True_Curmudgeon 2 points 4 days ago Gross permalink award report block reply Lower 2 points 4 days ago I hope that whistle comes in handy to defend her from the immigrant rape. permalink award report block reply nomoreprinkles 2 points 4 days ago Never help a white woman permalink award report block reply 2025WhatIsTrue 2 points 4 days ago These pathetic, angry lib nitwit women are self-loathing...they hate the type of person they are.  They are always angry, sad, lonely and without anything positive in their wasting lives. Men with any positive sense of self avoid these wretches like the plague.  Some weak men will dip into them for brief periods of time but will quickly disengage and not have a long term relationship with them. These pathetic women fear the truth that their cats will not resolve their loneliness and calm their hatreds.  They are doomed to be themselves...always self-loathing, perpetual life losers who die by themselves locked in their apartments with their hungry cats waiting. permalink award report block reply SuperHonkey OP 1 points 4 days ago Can't wait for that bitch to shut up so we can eat her 😸 permalink parent award report block reply Induceddrag 2 points 4 days ago Don’t they have houses to clean and kids to take care of? permalink award report block reply SuperHonkey OP 3 points 4 days ago Nope, just cats... Lots and lots of pissy unwashed cats. permalink parent award report block reply Induceddrag 1 points 4 days ago Looking up recipes for 1. permalink parent award report block reply A_Colostomy_Bag 2 points 3 days ago Now women being raped by illegals will be ignored because people will assume it's just some lefty AFWL c*** virtue signaling. permalink award report block reply SavingPrivateGrace 1 points 4 days ago The Bear mace I carry has a red whistle attached just like that ICE alert.  Now that the leftist woman ruined it's intention a dog whistle would be better protection. permalink award report block reply Amway 1 points 4 days ago Well, there goes the bad guy, guess I'll arrest his wife, grandmother, and uncle.  Or better yet, let's go to the local day care center and arrest those teachers. permalink award report block reply ceva 1 points 4 days ago I don’t get how this is supposedly saving convicted sex offenders permalink award report block reply ApplyingForce 1 points 4 days ago Trespasser whistle permalink award report block reply ancroidubh 1 points 4 days ago Good luck prosecuting this. It willl be shown to be akin to flashing your high beams to warn oncoming traffic about a speed  or DUI trap. Attempts to control it will be seen to be prior restraint. The blowers, however, could be responsible if their actions result in harm to people or damage to property. The answer is better security on the part of ICE. permalink award report block reply Aambrick 1 points 4 days ago Nah. Surround those neighborhoods, take every male and child out, and leave those women inside with the illegals. Let them experience the enrichment with nobody coming to save them. permalink award report block reply GrizzlyT55 1 points 4 days ago I mean...they will need those whistles in those neighborhoods. Maybe this'll be a good learnin' lesson. permalink award report block reply AccipiterQ 1 points 4 days ago \"stay safe out there\"....yes, you would be, if you let illegal alien rapists get deported. permalink award report block reply OhhhhNooooThatSucks 1 points 4 days ago soooo obstruction of justice k permalink award report block reply PepesJusticeBoner 1 points 4 days ago An illegal alien or some dindu is going to use that whistle lanyard to choke this Karen while he rips off her clothes and demonstrates why roaming Chicago alone is a bad idea. permalink award report block reply no_antifa 1 points 4 days ago Online bots + 24/7 propaganda hijacks the female inclination toward egalitarianism permalink award report block reply mightyclaw 1 points 4 days ago So go around wherever you see suspicious activity blowing your whistle. Or just anywhere. permalink award report block reply KilroyJCNJ 1 points 4 days ago Better would be for them to be “culturally enriched “ permalink award report block reply VirTW 1 points 4 days ago rape whistles to save those who rape..... permalink award report block reply CleanUpPhillyTrump24 1 points 4 days ago Lulz that is so dumb. permalink award report block reply Trajano 1 points 4 days ago Those activists have a lot of free time. We need to investigate the NGOs financially supporting them and defunding all of them (100% guaranteed that our taxes are paying for this). permalink award report block reply CaptainTrouble 1 points 4 days ago In my opinion and I'm actually dead serious about this. All women who support non-White immigration should have their protection from being raped recinded. Anyone can rape them without fear of the law coming after them. permalink award report block reply EyesSewnShut 0 points 4 days ago God why are women such garbage. permalink award report block reply guywholikesDjtof2024 1 points 1 hour ago which god? thor? odin? permalink parent award report block reply EyesSewnShut 2 points 21 minutes ago The only God. The Holy Trinity. God, Jesus, and the Holy Spirit. permalink parent award report block reply guywholikesDjtof2024 1 points 18 minutes ago Is Genesis true? Also, respect The Name. https://AnswersinGenesis.org https://Creation.com permalink parent award report block reply South_Florida_Guy 0 points 4 days ago Having the rapists around is the only way these harpies will ever get any action permalink award report block reply GodKingHarambe 0 points 4 days ago LOL at her chapped lips permalink award report block reply the_new_one 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nFusionBlack 83 points 4 days ago I am beginning to think something akin to the \"Havana Syndrome\" has been used on large potions of the population primary cites. The insanity and non use of critical thinking has exploded recently. permalink award report block reply MasterChief 44 points 4 days ago It's the slop. AI slop, social media slop, MSM slop, political slop, educational slop, slop diets, slop exercise, slop social lives, slop life experiences, slop quality everything. Hardly anyone does their homework, or fact checks or ever calls bullshit in real life. We are zombie walking into a Idiocracy/Wall-E future, with our heads in the sand. We are being influenced by foreign parties and lobbyists more than ever before, and there is no escaping it other than getting off-grid and disappearing  into the woods permalink parent award report block reply henri_derelicte 19 points 4 days ago It’s straight up disinformation too. Folks in Chicago think ICE is arresting “day care teachers” when in reality it was an illegal who tried to hide in a day care to avoid arrest permalink parent award report block reply imnotdeadyet 10 points 4 days ago Exactly.  There needs to be pain for running a false story. permalink parent award report block reply henri_derelicte 9 points 4 days ago If I was Trump, I would have invoked the insurrection act against Chicago already. JB Pritzker and Brandon Johnson would have been cuffed and perp walked by now, and then beaten and brutalized in custody permalink parent award report block reply view 3 more comments... RiolindasReturn 5 points 4 days ago Arrest the Karens… someone draft Karen’s law lol. permalink parent award report block reply FusionBlack 14 points 4 days ago You are correct. In the local rag comment section where I live is nothing more than canned AI copy and paste responses. Even most of my friends use AI for everything work related. Its dumbing down thier brains. permalink parent award report block reply TheThreeSeashells 4 points 4 days ago The work thing with AI is really bothering me.  Of course, most of the time it's the women embracing that garbage. I recently had an example where a woman I work with was explaining how to do something with AI to edit some text provided by a client.  She went on for about five minutes on creating the right query and then tweaking it get the right result.  Meanwhile, I pasted it into Notepad, did a search and replace, and it was done in 5 seconds. Every time I bring up the fact that there are better tools than AI for most jobs, they act like I'm telling them their outfit makes them look fat. permalink parent award report block reply SanityGumby 4 points 4 days ago Their outfit doesn’t make them look fat. Them being fat makes them look fat permalink parent award report block reply FusionBlack 2 points 4 days ago Lazy. That's all it is and what's funny is that they will spend more time on a time saver. permalink parent award report block reply CleanUpPhillyTrump24 4 points 4 days ago Wow. permalink parent award report block reply The_Emperor 2 points 4 days ago You are correct except about slop exercise and diets\nThe brilliant founders, many of whom like John Adam's was not a big exercise, or partook of drinking (Sam Adams) and many were diseased (Washington). Brains still were present.   So let's focus on retards being retarded,  and not wast energy sending retards to PE or to eating kale and protein to get smarter. permalink parent award report block reply FrmrAmericanRepublic 1 points 4 days ago It started before AI tools were created, just all the other slop you mentioned was enough. AI just accelerates the rate at which propaganda can be made, which is a big fucking problem - but we can't stuff the cat back in the bag now. Wall-E is a good comparison, because \"Buy N Large\" kind of mentality, Idiocracy-style mobile hover-lounges while continuously snacking and screen-zombed is alarmingly close to current reality. \"News\" cycle accelerates because TikTok and other platforms train the retards to have sub-minute attention spans. Not ideal, and I like technology, just not how its being used. permalink parent award report block reply Transparency 1 points 4 days ago Yup. Garbage-in = Garbage-out. permalink parent award report block reply GatoradeJeb 22 points 4 days ago Its hollywood racemix propaganda brainwashing White woman. Look how every movie/ad now has White woman with brown vermin. Irl White woman have integrated this which is why you see race traitor White woman defending illegals and brown criminals permalink parent award report block reply CleanUpPhillyTrump24 14 points 4 days ago I mean a lot of the anti-ICE Karen brigades are lesbians, trannies, gay men in social services/health care, or other alphabets who work for the black money funded NGOs and leftist church/synogogues that are just CCP fronts for anarcho-tyranny implementation on domestic soil. How do I know for sure? In Philly, these \"church\" groups and \"reform temples\" (aka Jews who are not even remotely Jewish) backed off all at once, like they were taking orders from above, in Philly from blocking highways, harassing people in the street, vandalizing things, doing graffiti \"for the cause.\" IOW they morphed from their hardcore BurnLootMurdering as Antifa after Antifa was made a domestic terror group. So the rationale for this professional leftism is these were the kids that got non-useful degrees that had a minor in leftist indoctrination. They're unemployable, and can't even maintain things like group houses for themselves because they can't stand living with each other. Unless they get work as wait staff/baristas or other food trade work, there're few bosses who want to deal with their dysthymic crap. It's a doom loop created by leftism that is strongly contributing to drug use/ETOH addiction, and being unemployable in the normal world, so they can only do gig work or work in restaurants, cafes, diners, clubs. There's a whole ecosystem of these in Philly. What they don't realize is that they really are a tiny minority of the true population. But they get all their info from the MSM and social media. permalink parent award report block reply ancroidubh 5 points 4 days ago Top marks for pinning a diagnosis on the left as “dysthemic”. Upvote for you! permalink parent award report block reply orcwordlaugh 7 points 4 days ago Try asking someone, not in the know, what percentage of the USA population is black. From my experience, the saturation of them in media will have many people give a number near 50%. permalink parent award report block reply shadypollster 3 points 4 days ago Britain noticed finally. permalink parent award report block reply KartoffelPuffer 2 points 4 days ago Ask an affluent Karen living in a 94% White area the same question.  She'll insist she's in a \"highly diverse\" area with at least 50% minorities.   She knows it's true because she always \"notices that one Black woman at the grocery store\" and her nail tech is \"Chinese?/Vietnamese?/Korean?/Filipino?/ something Asian for certain.\" permalink parent award report block reply basedboston 7 points 4 days ago She doesn't have any babies, so she weaponizes her fading motherly instincts to protect people. permalink parent award report block reply SuperHonkey OP 6 points 4 days ago killed her babies permalink parent award report block reply booblitchutz 1 points 4 days ago “Burgers?” permalink parent award report block reply NotYourMan 9 points 4 days ago These are women who watch MSM stories about ICE taking families (distorted reality to make Trump look bad) and completely miss the result that ICE is taking away murderers, gang members, and rapists.  The echo chamber is not reality. permalink parent award report block reply Spicy_cat 2 points 4 days ago Remember the Rocky and Bullwinkle episode with the goof gas? permalink parent award report block reply load 4 more comments...\nMasterChief 44 points 4 days ago It's the slop. AI slop, social media slop, MSM slop, political slop, educational slop, slop diets, slop exercise, slop social lives, slop life experiences, slop quality everything. Hardly anyone does their homework, or fact checks or ever calls bullshit in real life. We are zombie walking into a Idiocracy/Wall-E future, with our heads in the sand. We are being influenced by foreign parties and lobbyists more than ever before, and there is no escaping it other than getting off-grid and disappearing  into the woods permalink parent award report block reply henri_derelicte 19 points 4 days ago It’s straight up disinformation too. Folks in Chicago think ICE is arresting “day care teachers” when in reality it was an illegal who tried to hide in a day care to avoid arrest permalink parent award report block reply imnotdeadyet 10 points 4 days ago Exactly.  There needs to be pain for running a false story. permalink parent award report block reply henri_derelicte 9 points 4 days ago If I was Trump, I would have invoked the insurrection act against Chicago already. JB Pritzker and Brandon Johnson would have been cuffed and perp walked by now, and then beaten and brutalized in custody permalink parent award report block reply view 3 more comments... RiolindasReturn 5 points 4 days ago Arrest the Karens… someone draft Karen’s law lol. permalink parent award report block reply FusionBlack 14 points 4 days ago You are correct. In the local rag comment section where I live is nothing more than canned AI copy and paste responses. Even most of my friends use AI for everything work related. Its dumbing down thier brains. permalink parent award report block reply TheThreeSeashells 4 points 4 days ago The work thing with AI is really bothering me.  Of course, most of the time it's the women embracing that garbage. I recently had an example where a woman I work with was explaining how to do something with AI to edit some text provided by a client.  She went on for about five minutes on creating the right query and then tweaking it get the right result.  Meanwhile, I pasted it into Notepad, did a search and replace, and it was done in 5 seconds. Every time I bring up the fact that there are better tools than AI for most jobs, they act like I'm telling them their outfit makes them look fat. permalink parent award report block reply SanityGumby 4 points 4 days ago Their outfit doesn’t make them look fat. Them being fat makes them look fat permalink parent award report block reply FusionBlack 2 points 4 days ago Lazy. That's all it is and what's funny is that they will spend more time on a time saver. permalink parent award report block reply CleanUpPhillyTrump24 4 points 4 days ago Wow. permalink parent award report block reply The_Emperor 2 points 4 days ago You are correct except about slop exercise and diets\nThe brilliant founders, many of whom like John Adam's was not a big exercise, or partook of drinking (Sam Adams) and many were diseased (Washington). Brains still were present.   So let's focus on retards being retarded,  and not wast energy sending retards to PE or to eating kale and protein to get smarter. permalink parent award report block reply FrmrAmericanRepublic 1 points 4 days ago It started before AI tools were created, just all the other slop you mentioned was enough. AI just accelerates the rate at which propaganda can be made, which is a big fucking problem - but we can't stuff the cat back in the bag now. Wall-E is a good comparison, because \"Buy N Large\" kind of mentality, Idiocracy-style mobile hover-lounges while continuously snacking and screen-zombed is alarmingly close to current reality. \"News\" cycle accelerates because TikTok and other platforms train the retards to have sub-minute attention spans. Not ideal, and I like technology, just not how its being used. permalink parent award report block reply Transparency 1 points 4 days ago Yup. Garbage-in = Garbage-out. permalink parent award report block reply\nhenri_derelicte 19 points 4 days ago It’s straight up disinformation too. Folks in Chicago think ICE is arresting “day care teachers” when in reality it was an illegal who tried to hide in a day care to avoid arrest permalink parent award report block reply imnotdeadyet 10 points 4 days ago Exactly.  There needs to be pain for running a false story. permalink parent award report block reply henri_derelicte 9 points 4 days ago If I was Trump, I would have invoked the insurrection act against Chicago already. JB Pritzker and Brandon Johnson would have been cuffed and perp walked by now, and then beaten and brutalized in custody permalink parent award report block reply view 3 more comments... RiolindasReturn 5 points 4 days ago Arrest the Karens… someone draft Karen’s law lol. permalink parent award report block reply\nimnotdeadyet 10 points 4 days ago Exactly.  There needs to be pain for running a false story. permalink parent award report block reply henri_derelicte 9 points 4 days ago If I was Trump, I would have invoked the insurrection act against Chicago already. JB Pritzker and Brandon Johnson would have been cuffed and perp walked by now, and then beaten and brutalized in custody permalink parent award report block reply view 3 more comments...\nhenri_derelicte 9 points 4 days ago If I was Trump, I would have invoked the insurrection act against Chicago already. JB Pritzker and Brandon Johnson would have been cuffed and perp walked by now, and then beaten and brutalized in custody permalink parent award report block reply view 3 more comments...\nRiolindasReturn 5 points 4 days ago Arrest the Karens… someone draft Karen’s law lol. permalink parent award report block reply\nFusionBlack 14 points 4 days ago You are correct. In the local rag comment section where I live is nothing more than canned AI copy and paste responses. Even most of my friends use AI for everything work related. Its dumbing down thier brains. permalink parent award report block reply TheThreeSeashells 4 points 4 days ago The work thing with AI is really bothering me.  Of course, most of the time it's the women embracing that garbage. I recently had an example where a woman I work with was explaining how to do something with AI to edit some text provided by a client.  She went on for about five minutes on creating the right query and then tweaking it get the right result.  Meanwhile, I pasted it into Notepad, did a search and replace, and it was done in 5 seconds. Every time I bring up the fact that there are better tools than AI for most jobs, they act like I'm telling them their outfit makes them look fat. permalink parent award report block reply SanityGumby 4 points 4 days ago Their outfit doesn’t make them look fat. Them being fat makes them look fat permalink parent award report block reply FusionBlack 2 points 4 days ago Lazy. That's all it is and what's funny is that they will spend more time on a time saver. permalink parent award report block reply CleanUpPhillyTrump24 4 points 4 days ago Wow. permalink parent award report block reply The_Emperor 2 points 4 days ago You are correct except about slop exercise and diets\nThe brilliant founders, many of whom like John Adam's was not a big exercise, or partook of drinking (Sam Adams) and many were diseased (Washington). Brains still were present.   So let's focus on retards being retarded,  and not wast energy sending retards to PE or to eating kale and protein to get smarter. permalink parent award report block reply\nTheThreeSeashells 4 points 4 days ago The work thing with AI is really bothering me.  Of course, most of the time it's the women embracing that garbage. I recently had an example where a woman I work with was explaining how to do something with AI to edit some text provided by a client.  She went on for about five minutes on creating the right query and then tweaking it get the right result.  Meanwhile, I pasted it into Notepad, did a search and replace, and it was done in 5 seconds. Every time I bring up the fact that there are better tools than AI for most jobs, they act like I'm telling them their outfit makes them look fat. permalink parent award report block reply SanityGumby 4 points 4 days ago Their outfit doesn’t make them look fat. Them being fat makes them look fat permalink parent award report block reply FusionBlack 2 points 4 days ago Lazy. That's all it is and what's funny is that they will spend more time on a time saver. permalink parent award report block reply\nSanityGumby 4 points 4 days ago Their outfit doesn’t make them look fat. Them being fat makes them look fat permalink parent award report block reply\nFusionBlack 2 points 4 days ago Lazy. That's all it is and what's funny is that they will spend more time on a time saver. permalink parent award report block reply\nCleanUpPhillyTrump24 4 points 4 days ago Wow. permalink parent award report block reply\nThe_Emperor 2 points 4 days ago You are correct except about slop exercise and diets\nThe brilliant founders, many of whom like John Adam's was not a big exercise, or partook of drinking (Sam Adams) and many were diseased (Washington). Brains still were present.   So let's focus on retards being retarded,  and not wast energy sending retards to PE or to eating kale and protein to get smarter. permalink parent award report block reply\nFrmrAmericanRepublic 1 points 4 days ago It started before AI tools were created, just all the other slop you mentioned was enough. AI just accelerates the rate at which propaganda can be made, which is a big fucking problem - but we can't stuff the cat back in the bag now. Wall-E is a good comparison, because \"Buy N Large\" kind of mentality, Idiocracy-style mobile hover-lounges while continuously snacking and screen-zombed is alarmingly close to current reality. \"News\" cycle accelerates because TikTok and other platforms train the retards to have sub-minute attention spans. Not ideal, and I like technology, just not how its being used. permalink parent award report block reply\nTransparency 1 points 4 days ago Yup. Garbage-in = Garbage-out. permalink parent award report block reply\nGatoradeJeb 22 points 4 days ago Its hollywood racemix propaganda brainwashing White woman. Look how every movie/ad now has White woman with brown vermin. Irl White woman have integrated this which is why you see race traitor White woman defending illegals and brown criminals permalink parent award report block reply CleanUpPhillyTrump24 14 points 4 days ago I mean a lot of the anti-ICE Karen brigades are lesbians, trannies, gay men in social services/health care, or other alphabets who work for the black money funded NGOs and leftist church/synogogues that are just CCP fronts for anarcho-tyranny implementation on domestic soil. How do I know for sure? In Philly, these \"church\" groups and \"reform temples\" (aka Jews who are not even remotely Jewish) backed off all at once, like they were taking orders from above, in Philly from blocking highways, harassing people in the street, vandalizing things, doing graffiti \"for the cause.\" IOW they morphed from their hardcore BurnLootMurdering as Antifa after Antifa was made a domestic terror group. So the rationale for this professional leftism is these were the kids that got non-useful degrees that had a minor in leftist indoctrination. They're unemployable, and can't even maintain things like group houses for themselves because they can't stand living with each other. Unless they get work as wait staff/baristas or other food trade work, there're few bosses who want to deal with their dysthymic crap. It's a doom loop created by leftism that is strongly contributing to drug use/ETOH addiction, and being unemployable in the normal world, so they can only do gig work or work in restaurants, cafes, diners, clubs. There's a whole ecosystem of these in Philly. What they don't realize is that they really are a tiny minority of the true population. But they get all their info from the MSM and social media. permalink parent award report block reply ancroidubh 5 points 4 days ago Top marks for pinning a diagnosis on the left as “dysthemic”. Upvote for you! permalink parent award report block reply orcwordlaugh 7 points 4 days ago Try asking someone, not in the know, what percentage of the USA population is black. From my experience, the saturation of them in media will have many people give a number near 50%. permalink parent award report block reply shadypollster 3 points 4 days ago Britain noticed finally. permalink parent award report block reply KartoffelPuffer 2 points 4 days ago Ask an affluent Karen living in a 94% White area the same question.  She'll insist she's in a \"highly diverse\" area with at least 50% minorities.   She knows it's true because she always \"notices that one Black woman at the grocery store\" and her nail tech is \"Chinese?/Vietnamese?/Korean?/Filipino?/ something Asian for certain.\" permalink parent award report block reply basedboston 7 points 4 days ago She doesn't have any babies, so she weaponizes her fading motherly instincts to protect people. permalink parent award report block reply SuperHonkey OP 6 points 4 days ago killed her babies permalink parent award report block reply booblitchutz 1 points 4 days ago “Burgers?” permalink parent award report block reply\nCleanUpPhillyTrump24 14 points 4 days ago I mean a lot of the anti-ICE Karen brigades are lesbians, trannies, gay men in social services/health care, or other alphabets who work for the black money funded NGOs and leftist church/synogogues that are just CCP fronts for anarcho-tyranny implementation on domestic soil. How do I know for sure? In Philly, these \"church\" groups and \"reform temples\" (aka Jews who are not even remotely Jewish) backed off all at once, like they were taking orders from above, in Philly from blocking highways, harassing people in the street, vandalizing things, doing graffiti \"for the cause.\" IOW they morphed from their hardcore BurnLootMurdering as Antifa after Antifa was made a domestic terror group. So the rationale for this professional leftism is these were the kids that got non-useful degrees that had a minor in leftist indoctrination. They're unemployable, and can't even maintain things like group houses for themselves because they can't stand living with each other. Unless they get work as wait staff/baristas or other food trade work, there're few bosses who want to deal with their dysthymic crap. It's a doom loop created by leftism that is strongly contributing to drug use/ETOH addiction, and being unemployable in the normal world, so they can only do gig work or work in restaurants, cafes, diners, clubs. There's a whole ecosystem of these in Philly. What they don't realize is that they really are a tiny minority of the true population. But they get all their info from the MSM and social media. permalink parent award report block reply ancroidubh 5 points 4 days ago Top marks for pinning a diagnosis on the left as “dysthemic”. Upvote for you! permalink parent award report block reply\nancroidubh 5 points 4 days ago Top marks for pinning a diagnosis on the left as “dysthemic”. Upvote for you! permalink parent award report block reply\norcwordlaugh 7 points 4 days ago Try asking someone, not in the know, what percentage of the USA population is black. From my experience, the saturation of them in media will have many people give a number near 50%. permalink parent award report block reply shadypollster 3 points 4 days ago Britain noticed finally. permalink parent award report block reply KartoffelPuffer 2 points 4 days ago Ask an affluent Karen living in a 94% White area the same question.  She'll insist she's in a \"highly diverse\" area with at least 50% minorities.   She knows it's true because she always \"notices that one Black woman at the grocery store\" and her nail tech is \"Chinese?/Vietnamese?/Korean?/Filipino?/ something Asian for certain.\" permalink parent award report block reply\nshadypollster 3 points 4 days ago Britain noticed finally. permalink parent award report block reply\nKartoffelPuffer 2 points 4 days ago Ask an affluent Karen living in a 94% White area the same question.  She'll insist she's in a \"highly diverse\" area with at least 50% minorities.   She knows it's true because she always \"notices that one Black woman at the grocery store\" and her nail tech is \"Chinese?/Vietnamese?/Korean?/Filipino?/ something Asian for certain.\" permalink parent award report block reply\nbasedboston 7 points 4 days ago She doesn't have any babies, so she weaponizes her fading motherly instincts to protect people. permalink parent award report block reply SuperHonkey OP 6 points 4 days ago killed her babies permalink parent award report block reply\nSuperHonkey OP 6 points 4 days ago killed her babies permalink parent award report block reply\nbooblitchutz 1 points 4 days ago “Burgers?” permalink parent award report block reply\nNotYourMan 9 points 4 days ago These are women who watch MSM stories about ICE taking families (distorted reality to make Trump look bad) and completely miss the result that ICE is taking away murderers, gang members, and rapists.  The echo chamber is not reality. permalink parent award report block reply\nSpicy_cat 2 points 4 days ago Remember the Rocky and Bullwinkle episode with the goof gas? permalink parent award report block reply\nJustlooking250 23 points 4 days ago Ok cool now I think everyone else should go around with whistles and just sound them in random places at random times for no reason so it creates a 'cry wolf' effect then people will eventually ignore it permalink award report block reply booblitchutz 9 points 4 days ago It’s way more coordinated than that. They are told exactly where and when to show up. I wouldn’t doubt if they were given reimbursements or just straight up CTA cards to get them where they need to go. Once they get there they’re given souvenirs like t shirts and whistles and if they post on social media and tag the event they get tons of botted likes and followers in exchange. Nobody just goes where they hear whistles. How do they know where to show up? Elementary. They are tipped off by moles in ICE and CPD. permalink parent award report block reply TheThreeSeashells 2 points 4 days ago Exactly.  It's time to start feeding false information within the ranks to root them out.  I would have assumed this was already being done, but given the coordination of these assholes, knowing exactly when and where to show up when there's no reason on Earth they would possibly know otherwise, nor be in these neighborhoods otherwise, it doesn't seem like the higher-ups have picked up on the fact that information is being leaked. permalink parent award report block reply booblitchutz 1 points 4 days ago They most certainly have enough presence on the inside to be tipped off on that, too. permalink parent award report block reply TheThreeSeashells 1 points 2 days ago That's fine.  Eventually they would figure out where the leaks are coming from. permalink parent award report block reply RealTXPatriot 3 points 4 days ago BINGO permalink parent award report block reply\nbooblitchutz 9 points 4 days ago It’s way more coordinated than that. They are told exactly where and when to show up. I wouldn’t doubt if they were given reimbursements or just straight up CTA cards to get them where they need to go. Once they get there they’re given souvenirs like t shirts and whistles and if they post on social media and tag the event they get tons of botted likes and followers in exchange. Nobody just goes where they hear whistles. How do they know where to show up? Elementary. They are tipped off by moles in ICE and CPD. permalink parent award report block reply TheThreeSeashells 2 points 4 days ago Exactly.  It's time to start feeding false information within the ranks to root them out.  I would have assumed this was already being done, but given the coordination of these assholes, knowing exactly when and where to show up when there's no reason on Earth they would possibly know otherwise, nor be in these neighborhoods otherwise, it doesn't seem like the higher-ups have picked up on the fact that information is being leaked. permalink parent award report block reply booblitchutz 1 points 4 days ago They most certainly have enough presence on the inside to be tipped off on that, too. permalink parent award report block reply TheThreeSeashells 1 points 2 days ago That's fine.  Eventually they would figure out where the leaks are coming from. permalink parent award report block reply\nTheThreeSeashells 2 points 4 days ago Exactly.  It's time to start feeding false information within the ranks to root them out.  I would have assumed this was already being done, but given the coordination of these assholes, knowing exactly when and where to show up when there's no reason on Earth they would possibly know otherwise, nor be in these neighborhoods otherwise, it doesn't seem like the higher-ups have picked up on the fact that information is being leaked. permalink parent award report block reply booblitchutz 1 points 4 days ago They most certainly have enough presence on the inside to be tipped off on that, too. permalink parent award report block reply TheThreeSeashells 1 points 2 days ago That's fine.  Eventually they would figure out where the leaks are coming from. permalink parent award report block reply\nbooblitchutz 1 points 4 days ago They most certainly have enough presence on the inside to be tipped off on that, too. permalink parent award report block reply TheThreeSeashells 1 points 2 days ago That's fine.  Eventually they would figure out where the leaks are coming from. permalink parent award report block reply\nTheThreeSeashells 1 points 2 days ago That's fine.  Eventually they would figure out where the leaks are coming from. permalink parent award report block reply\nRealTXPatriot 3 points 4 days ago BINGO permalink parent award report block reply\nGod-is-good 15 points 4 days ago Rape whistle irony... unexpected. permalink award report block reply SteveRogers42 1 points 4 days ago It’s as if O Henry and Alannis Morisette had a baby and named her Rape Whistle. permalink parent award report block reply\nSteveRogers42 1 points 4 days ago It’s as if O Henry and Alannis Morisette had a baby and named her Rape Whistle. permalink parent award report block reply\ndburt2 13 points 4 days ago Women can relieve 95% of their stress and anxiety by sitting on a mans face. permalink award report block reply SuperHonkey OP 20 points 4 days ago You don't want old Suzie Rottencrotch anywhere near your face bud permalink parent award report block reply Appeal2Heaven98 7 points 4 days ago Sydney Sweeney? Maybe. But not this liberal crotch rocket. permalink parent award report block reply RealTXPatriot 1 points 4 days ago Don't talk about motorcycles like that. Cmon they're fun. permalink parent award report block reply GdotLee 5 points 4 days ago imagine the beef curtains draping your cheeks. permalink parent award report block reply McFatty7 3 points 4 days ago But not this woman and women like her. They’re crazy enough to try to suffocate the men. permalink parent award report block reply booblitchutz 3 points 4 days ago The woman in this video is a straight up howler. The woman in this video is almost guaranteed to be a “lesbian”. permalink parent award report block reply load 2 more comments...\nSuperHonkey OP 20 points 4 days ago You don't want old Suzie Rottencrotch anywhere near your face bud permalink parent award report block reply\nAppeal2Heaven98 7 points 4 days ago Sydney Sweeney? Maybe. But not this liberal crotch rocket. permalink parent award report block reply RealTXPatriot 1 points 4 days ago Don't talk about motorcycles like that. Cmon they're fun. permalink parent award report block reply\nRealTXPatriot 1 points 4 days ago Don't talk about motorcycles like that. Cmon they're fun. permalink parent award report block reply\nGdotLee 5 points 4 days ago imagine the beef curtains draping your cheeks. permalink parent award report block reply\nMcFatty7 3 points 4 days ago But not this woman and women like her. They’re crazy enough to try to suffocate the men. permalink parent award report block reply\nbooblitchutz 3 points 4 days ago The woman in this video is a straight up howler. The woman in this video is almost guaranteed to be a “lesbian”. permalink parent award report block reply\nGatoradeJeb 12 points 4 days ago I want these race trairor White woman executed. The biggest hreat to White man is these race traitor White woman who mudshark with these brown scum permalink award report block reply booblitchutz 11 points 4 days ago I know a woman who lives in Chicago and posts this red whistle crap. She’s a real piece of work. Failed marriage, no kids, has always been a weird fag hag, now claims to be a “lesbian”, is post menopausal now and alone and just neck deep in this crap. She’s always posting pics of her and some creepy fag or massive bull dyke doing the soy face. I can just feel the sadness oozing from her. permalink parent award report block reply PM_ME_UR_MAGIC_CARDS 6 points 4 days ago Just goes to show you don't need to die to go to hell, some people live in it permalink parent award report block reply booblitchutz 2 points 4 days ago 100% of this is just her living in an impenetrable far left bubble her entire adult life. She’s been fed a steady diet of toxic programming non stop. In spite of everything that is clearly broken in her life, she truly believes she is a hero. But she also believes she’s been a victim her whole life, too. That’s what the programming does to them. It convinces them they are moral heroes and at the same time convinces them everything wrong in their lives is driven by external factors. permalink parent award report block reply SteveRogers42 2 points 4 days ago Like that bitch interviewer trying to trip up Sydney Sweeney. permalink parent award report block reply RIPcharlie 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nbooblitchutz 11 points 4 days ago I know a woman who lives in Chicago and posts this red whistle crap. She’s a real piece of work. Failed marriage, no kids, has always been a weird fag hag, now claims to be a “lesbian”, is post menopausal now and alone and just neck deep in this crap. She’s always posting pics of her and some creepy fag or massive bull dyke doing the soy face. I can just feel the sadness oozing from her. permalink parent award report block reply PM_ME_UR_MAGIC_CARDS 6 points 4 days ago Just goes to show you don't need to die to go to hell, some people live in it permalink parent award report block reply booblitchutz 2 points 4 days ago 100% of this is just her living in an impenetrable far left bubble her entire adult life. She’s been fed a steady diet of toxic programming non stop. In spite of everything that is clearly broken in her life, she truly believes she is a hero. But she also believes she’s been a victim her whole life, too. That’s what the programming does to them. It convinces them they are moral heroes and at the same time convinces them everything wrong in their lives is driven by external factors. permalink parent award report block reply SteveRogers42 2 points 4 days ago Like that bitch interviewer trying to trip up Sydney Sweeney. permalink parent award report block reply\nPM_ME_UR_MAGIC_CARDS 6 points 4 days ago Just goes to show you don't need to die to go to hell, some people live in it permalink parent award report block reply booblitchutz 2 points 4 days ago 100% of this is just her living in an impenetrable far left bubble her entire adult life. She’s been fed a steady diet of toxic programming non stop. In spite of everything that is clearly broken in her life, she truly believes she is a hero. But she also believes she’s been a victim her whole life, too. That’s what the programming does to them. It convinces them they are moral heroes and at the same time convinces them everything wrong in their lives is driven by external factors. permalink parent award report block reply\nbooblitchutz 2 points 4 days ago 100% of this is just her living in an impenetrable far left bubble her entire adult life. She’s been fed a steady diet of toxic programming non stop. In spite of everything that is clearly broken in her life, she truly believes she is a hero. But she also believes she’s been a victim her whole life, too. That’s what the programming does to them. It convinces them they are moral heroes and at the same time convinces them everything wrong in their lives is driven by external factors. permalink parent award report block reply\nSteveRogers42 2 points 4 days ago Like that bitch interviewer trying to trip up Sydney Sweeney. permalink parent award report block reply\nRIPcharlie 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nWizard_Glick 12 points 4 days ago Flood the zone, buy a whistle and blow it all the time... permalink award report block reply Zacktopia33 8 points 4 days ago Exactly. See a whistle, blow a whistle. permalink parent award report block reply\nZacktopia33 8 points 4 days ago Exactly. See a whistle, blow a whistle. permalink parent award report block reply\nSettin 12 points 4 days ago You’re telling me I can blow a whistle everywhere I go and the illegals will flee? permalink award report block reply\nTheMostUselessFeeder 10 points 4 days ago Some days I feel like the post-wall eggless liberal white woman epidemic is actually the biggest problem the nation faces... 🤦‍♂️ In many ways, they seem to hate the country more than any of the invaders. permalink award report block reply SanityGumby 3 points 4 days ago It is and that alone should be enough to repeal the 19th. It’s failed. permalink parent award report block reply SpellingContable 1 points 4 days ago They are whistling out a patriarchal society, to whistle in a rapey society. But why? Why would they do that? The desirability level is greater in a rapey society. The raping hoards dont call them eggless wrinkled old windbags. The rapists will rape anyone. permalink parent award report block reply\nSanityGumby 3 points 4 days ago It is and that alone should be enough to repeal the 19th. It’s failed. permalink parent award report block reply\nSpellingContable 1 points 4 days ago They are whistling out a patriarchal society, to whistle in a rapey society. But why? Why would they do that? The desirability level is greater in a rapey society. The raping hoards dont call them eggless wrinkled old windbags. The rapists will rape anyone. permalink parent award report block reply\nMehNahMehNah 9 points 4 days ago Or drown them out. I wonder if you can get musical car horns from JC Whitney that play 'la cucuracha' still? permalink award report block reply SuperHonkey OP 3 points 4 days ago What kind of shithole society would make a song about vermin? Spez: https://a.co/d/6qoZyRV permalink parent award report block reply\nSuperHonkey OP 3 points 4 days ago What kind of shithole society would make a song about vermin? Spez: https://a.co/d/6qoZyRV permalink parent award report block reply\nAppeal2Heaven98 6 points 4 days ago White liberal women have been and will continue to be the ruin of this nation. I should know. Minnesota is the whitest liberal state in the United States. permalink award report block reply\nPepe_longcockings 5 points 4 days ago They want their rape fantasies fulfilled permalink award report block reply Taqiyya_Mockingbird 4 points 4 days ago What’s the difference between rape and football? Feminists don’t fantasize about football. permalink parent award report block reply Skogin 1 points 4 days ago But the frustration continues. permalink parent award report block reply\nTaqiyya_Mockingbird 4 points 4 days ago What’s the difference between rape and football? Feminists don’t fantasize about football. permalink parent award report block reply\nSkogin 1 points 4 days ago But the frustration continues. permalink parent award report block reply\nstagolee 5 points 4 days ago Not THEIR neighborhoods.  They're going into other people's neighborhoods and doing it there.  Fucking scum. permalink award report block reply\nRealTXPatriot 5 points 4 days ago I'd abuse this.... Every time I went to a grocery store I would drive around the parking lot blowing the whistle.... watch them all run.... then do it again in a minute or two. After that the lines and crowds should be fewer. permalink award report block reply SuperHonkey OP 1 points 4 days ago Maybe even setup some autonomous whistle bots and place them discreetly in parking lots around town at home depot, guwalmart, etc to go off every hour, but only for a few seconds so as to evade detection 😎 permalink parent award report block reply Michalusmichalus 1 points 4 days ago There are already videos of that. About long lines. permalink parent award report block reply\nSuperHonkey OP 1 points 4 days ago Maybe even setup some autonomous whistle bots and place them discreetly in parking lots around town at home depot, guwalmart, etc to go off every hour, but only for a few seconds so as to evade detection 😎 permalink parent award report block reply\nMichalusmichalus 1 points 4 days ago There are already videos of that. About long lines. permalink parent award report block reply\nSuperHonkey OP 5 points 4 days ago Fastest sticky in the west! 😎 permalink award report block reply\nhenri_derelicte 5 points 4 days ago This. These dipshits are blowing their whistles and honking their car horns whenever ICE is in the area. I want to emphasize this is NOT normal. Immigration enforcement is facing extraordinarily high resistance in Chicago, and if the administration can win there, I think we can break the left nationwide and convince them that resistance is futile permalink award report block reply\nindigo_truther 4 points 4 days ago They should also decide on a whistle pattern for \"getting raped by a migrant\" to help avoid confusion with their one long whistle \"ICE detention\" and 3 short blasts for \"ICE in the area\" permalink award report block reply SuperHonkey OP 2 points 4 days ago To the beat of 'la cucaracha' permalink parent award report block reply\nSuperHonkey OP 2 points 4 days ago To the beat of 'la cucaracha' permalink parent award report block reply\nMoebius 4 points 4 days ago Aiding and Abetting permalink award report block reply\nTerrorOfLiberals 4 points 4 days ago So now when you are getting raped by black guys and Muslims, you can blow your rape whistle and all the Mexicans will run away. Good thinking, ladies. permalink award report block reply\nGfloydvotestrump 3 points 4 days ago Does the whistle blow in Spanish? permalink award report block reply SuperHonkey OP 3 points 4 days ago ¿Que? permalink parent award report block reply\nSuperHonkey OP 3 points 4 days ago ¿Que? permalink parent award report block reply\nmarlenaa315 3 points 4 days ago Shorter video “I’m a snitch” permalink award report block reply\nDITTOPatriot 3 points 4 days ago I don’t personally support it, but it is a First Amendment right that is enshrined and codified. Never give your rights up, never, no matter how your opponent may wield them to their benefit. permalink award report block reply\nspinometer2 3 points 4 days ago these women are so dumb. the whistle is meant to protect THEM. now no one will care when they hear a frantic whistle. permalink award report block reply SuperHonkey OP 1 points 4 days ago Good! permalink parent award report block reply spinometer2 1 points 4 days ago I have a daughter who walks several miles a day through a big city, I'm not happy about this permalink parent award report block reply\nSuperHonkey OP 1 points 4 days ago Good! permalink parent award report block reply spinometer2 1 points 4 days ago I have a daughter who walks several miles a day through a big city, I'm not happy about this permalink parent award report block reply\nspinometer2 1 points 4 days ago I have a daughter who walks several miles a day through a big city, I'm not happy about this permalink parent award report block reply\nMaxdady01 3 points 4 days ago \"Suicidal Empathy\" - Asmongold permalink award report block reply\nRudy_DankMemer 3 points 4 days ago insane. These broads are walking around, virtue whistling, secretly hoping, trying to get raped by one of the invaders.  Clown world is real.🤡 permalink award report block reply\nFemale 3 points 4 days ago Woman getting raped, blows the rape whistle; bystander in the area: eh she's just calling about ice The lass Who Cried Wolf permalink award report block reply\ndonteatthat 3 points 4 days ago Let them get stabbed and raped. Who gives a shit permalink award report block reply\njonnyuno 3 points 4 days ago Would be funny if it ended up a dog whistle for the perps. permalink award report block reply\nterribletwos 3 points 4 days ago Nah, you just boy who cried wolf that shit. Get a bunch of your friends together and just wander around these areas blowing your whistles all day. permalink award report block reply\nbluewhiteandred 3 points 4 days ago obstruction permalink award report block reply\nTheFozz 2 points 4 days ago Americans are so gaslit, we're basically beyond saving. Liberals would happily give their neck to a Muslim with a Machete. There's nothing that can save them at this point. permalink award report block reply\nrocco_saint 2 points 4 days ago So let me get this straight.  Women have adopted a \"rape whistle\" to hopefully keep them safe in the event they are attacked and raped.  Now they are using this symbolic alarm to draw attention and prevent illegals from being deported. Do you think any of them realize the \"boy who cried wolf\" situation here by mingling the two purposes?  Or are they really that dumb?  And I'm not even talking about the higher than normal illegal rape statistics.  I'm talking about the whistles being ignored..... permalink award report block reply SuperHonkey OP 3 points 4 days ago Of course they're that dumb, we're talking about AWFLs here permalink parent award report block reply\nSuperHonkey OP 3 points 4 days ago Of course they're that dumb, we're talking about AWFLs here permalink parent award report block reply\n4886Battery 2 points 4 days ago Hook up some drones with whistles and buzz them around town. permalink award report block reply\nredditadminssuckit 2 points 4 days ago Great way to clear out the crowds in the emergency room permalink award report block reply\nRedFoxOnFire 2 points 4 days ago Using rape whistles to save convicted sex offenders. I'd say it's ironic, but I've glimpsed at what fetishist women read. permalink award report block reply\nTao_Pai 2 points 4 days ago …and they rejoice in killing babies. These people are sociopaths. permalink award report block reply\nPelosi_Halitosis 2 points 4 days ago Why do they all look like this? permalink award report block reply Steve56775 2 points 4 days ago She forgot her nose ring today. permalink parent award report block reply\nSteve56775 2 points 4 days ago She forgot her nose ring today. permalink parent award report block reply\nTrumpdeasses 2 points 4 days ago Fast way to neutralize that is cry wolf . All you Magas in the area just start blowing whistles all day . The bean jumpers won't know whether to shit or go Blind. permalink award report block reply\nPatriotSkorzeny 2 points 4 days ago Why’s the illegal there for her to blow a whistle about?? Never that. Never…that. permalink award report block reply\nMike_Hoxbigg 2 points 4 days ago Send her to Somalia, and she can blow her whistle all the while the local boys are running a train on her. permalink award report block reply\nGreyGooseDown 2 points 4 days ago Terrible mommy milkers. permalink award report block reply\nChristineblaseyford 2 points 4 days ago Chicago Patriots, buy rape whistles, blow them often permalink award report block reply\nrumplestiltzkin2 2 points 4 days ago rape whistles to warn the rapists the police are coming permalink award report block reply\nPwrxs 2 points 4 days ago Women use rape whistles to protect rapists.  Insanity. permalink award report block reply\nDudeNoOne 2 points 4 days ago Obstruction is the surest way to make you attorney’s week difficult. permalink award report block reply\nbobbacringo 2 points 4 days ago Women should not be allowed to vote or work. permalink award report block reply\nTunk 2 points 4 days ago Honestly a few ice raids need to head out with additional patrols that cover surrounding streets. Moment the crowd forms and starts interfering, arrest and charge them ALL with providing aid to the illegal aliens. None of this assaulting federal officer, interfering, etc stuff. Charge them with the crime they are committing and haul them off. Make sure the prosecutors are fully on board with it and ram it through, and sweep up as many as possible in the first 10-20 tag and bag raids of people aiding illegals. Try as hard as possible to get them the J6 treatment, when folks start going to jail for aiding illegals, this shit will become public knowledge that helping illegals is illegal, radioactive and prohibitively expensive, shit will stop. And the ones that don't stop, well they stop once in jail. permalink award report block reply\nJoinTheDiscussion 2 points 4 days ago Arrests... Now that's funny permalink award report block reply\nonesummerdream 2 points 4 days ago Seems to me a pede could disrupt a lot of industry and construction sites with just a whistle lol. permalink award report block reply\nTrue_Curmudgeon 2 points 4 days ago Gross permalink award report block reply\nLower 2 points 4 days ago I hope that whistle comes in handy to defend her from the immigrant rape. permalink award report block reply\nnomoreprinkles 2 points 4 days ago Never help a white woman permalink award report block reply\n2025WhatIsTrue 2 points 4 days ago These pathetic, angry lib nitwit women are self-loathing...they hate the type of person they are.  They are always angry, sad, lonely and without anything positive in their wasting lives. Men with any positive sense of self avoid these wretches like the plague.  Some weak men will dip into them for brief periods of time but will quickly disengage and not have a long term relationship with them. These pathetic women fear the truth that their cats will not resolve their loneliness and calm their hatreds.  They are doomed to be themselves...always self-loathing, perpetual life losers who die by themselves locked in their apartments with their hungry cats waiting. permalink award report block reply SuperHonkey OP 1 points 4 days ago Can't wait for that bitch to shut up so we can eat her 😸 permalink parent award report block reply\nSuperHonkey OP 1 points 4 days ago Can't wait for that bitch to shut up so we can eat her 😸 permalink parent award report block reply\nInduceddrag 2 points 4 days ago Don’t they have houses to clean and kids to take care of? permalink award report block reply SuperHonkey OP 3 points 4 days ago Nope, just cats... Lots and lots of pissy unwashed cats. permalink parent award report block reply Induceddrag 1 points 4 days ago Looking up recipes for 1. permalink parent award report block reply\nSuperHonkey OP 3 points 4 days ago Nope, just cats... Lots and lots of pissy unwashed cats. permalink parent award report block reply Induceddrag 1 points 4 days ago Looking up recipes for 1. permalink parent award report block reply\nInduceddrag 1 points 4 days ago Looking up recipes for 1. permalink parent award report block reply\nA_Colostomy_Bag 2 points 3 days ago Now women being raped by illegals will be ignored because people will assume it's just some lefty AFWL c*** virtue signaling. permalink award report block reply\nSavingPrivateGrace 1 points 4 days ago The Bear mace I carry has a red whistle attached just like that ICE alert.  Now that the leftist woman ruined it's intention a dog whistle would be better protection. permalink award report block reply\nAmway 1 points 4 days ago Well, there goes the bad guy, guess I'll arrest his wife, grandmother, and uncle.  Or better yet, let's go to the local day care center and arrest those teachers. permalink award report block reply\nceva 1 points 4 days ago I don’t get how this is supposedly saving convicted sex offenders permalink award report block reply\nApplyingForce 1 points 4 days ago Trespasser whistle permalink award report block reply\nancroidubh 1 points 4 days ago Good luck prosecuting this. It willl be shown to be akin to flashing your high beams to warn oncoming traffic about a speed  or DUI trap. Attempts to control it will be seen to be prior restraint. The blowers, however, could be responsible if their actions result in harm to people or damage to property. The answer is better security on the part of ICE. permalink award report block reply\nAambrick 1 points 4 days ago Nah. Surround those neighborhoods, take every male and child out, and leave those women inside with the illegals. Let them experience the enrichment with nobody coming to save them. permalink award report block reply\nGrizzlyT55 1 points 4 days ago I mean...they will need those whistles in those neighborhoods. Maybe this'll be a good learnin' lesson. permalink award report block reply\nAccipiterQ 1 points 4 days ago \"stay safe out there\"....yes, you would be, if you let illegal alien rapists get deported. permalink award report block reply\nOhhhhNooooThatSucks 1 points 4 days ago soooo obstruction of justice k permalink award report block reply\nPepesJusticeBoner 1 points 4 days ago An illegal alien or some dindu is going to use that whistle lanyard to choke this Karen while he rips off her clothes and demonstrates why roaming Chicago alone is a bad idea. permalink award report block reply\nno_antifa 1 points 4 days ago Online bots + 24/7 propaganda hijacks the female inclination toward egalitarianism permalink award report block reply\nmightyclaw 1 points 4 days ago So go around wherever you see suspicious activity blowing your whistle. Or just anywhere. permalink award report block reply\nKilroyJCNJ 1 points 4 days ago Better would be for them to be “culturally enriched “ permalink award report block reply\nVirTW 1 points 4 days ago rape whistles to save those who rape..... permalink award report block reply\nCleanUpPhillyTrump24 1 points 4 days ago Lulz that is so dumb. permalink award report block reply\nTrajano 1 points 4 days ago Those activists have a lot of free time. We need to investigate the NGOs financially supporting them and defunding all of them (100% guaranteed that our taxes are paying for this). permalink award report block reply\nCaptainTrouble 1 points 4 days ago In my opinion and I'm actually dead serious about this. All women who support non-White immigration should have their protection from being raped recinded. Anyone can rape them without fear of the law coming after them. permalink award report block reply\nEyesSewnShut 0 points 4 days ago God why are women such garbage. permalink award report block reply guywholikesDjtof2024 1 points 1 hour ago which god? thor? odin? permalink parent award report block reply EyesSewnShut 2 points 21 minutes ago The only God. The Holy Trinity. God, Jesus, and the Holy Spirit. permalink parent award report block reply guywholikesDjtof2024 1 points 18 minutes ago Is Genesis true? Also, respect The Name. https://AnswersinGenesis.org https://Creation.com permalink parent award report block reply\nguywholikesDjtof2024 1 points 1 hour ago which god? thor? odin? permalink parent award report block reply EyesSewnShut 2 points 21 minutes ago The only God. The Holy Trinity. God, Jesus, and the Holy Spirit. permalink parent award report block reply guywholikesDjtof2024 1 points 18 minutes ago Is Genesis true? Also, respect The Name. https://AnswersinGenesis.org https://Creation.com permalink parent award report block reply\nEyesSewnShut 2 points 21 minutes ago The only God. The Holy Trinity. God, Jesus, and the Holy Spirit. permalink parent award report block reply guywholikesDjtof2024 1 points 18 minutes ago Is Genesis true? Also, respect The Name. https://AnswersinGenesis.org https://Creation.com permalink parent award report block reply\nguywholikesDjtof2024 1 points 18 minutes ago Is Genesis true? Also, respect The Name. https://AnswersinGenesis.org https://Creation.com permalink parent award report block reply\nSouth_Florida_Guy 0 points 4 days ago Having the rapists around is the only way these harpies will ever get any action permalink award report block reply\nGodKingHarambe 0 points 4 days ago LOL at her chapped lips permalink award report block reply\nthe_new_one 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T22:54:00.633809Z"
}