{
  "id": "1ARK9nPu6t",
  "url": "https://patriots.win/p/1ARK9nPu6t/is-base5-binary-a-thing/c",
  "content": "15 Is base5 binary a thing? posted 4 hours ago by blockchain-the-vote 4 comments award share report block New York Post @nypost • 5h US Mint in Philadelphia set to press the last-ever penny as coin gets canceled https://t.co/RRQDWsdPli\n4 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow SHILL_DETECTOR 2 points 4 hours ago i imagine pennies will still be used in price values everywhere you just wont be able to use cash unless you have pennies or there is some round up / round down thing permalink award report block reply HeDinduNuffin 1 points 4 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply stealthboy 2 points 3 hours ago \"base5 binary\"? Binary means base 2 (zeroes and ones).  Not sure what you mean here. permalink award report block reply blitzkrieg1 1 points 3 hours ago As out fake fiat currency goes to zero coins will not be needed anyway. permalink award report block reply\nSHILL_DETECTOR 2 points 4 hours ago i imagine pennies will still be used in price values everywhere you just wont be able to use cash unless you have pennies or there is some round up / round down thing permalink award report block reply HeDinduNuffin 1 points 4 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nHeDinduNuffin 1 points 4 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nstealthboy 2 points 3 hours ago \"base5 binary\"? Binary means base 2 (zeroes and ones).  Not sure what you mean here. permalink award report block reply\nblitzkrieg1 1 points 3 hours ago As out fake fiat currency goes to zero coins will not be needed anyway. permalink award report block reply",
  "fetched_at": "2025-11-12T23:26:47.119492Z"
}