{
  "id": "8185712",
  "title": "44“No Talent” will be Trump’s “Basket of Deplorables”  moment if he’s not careful. Better right this",
  "url": "https://patriots.win/p/1ARK9nPczi/no-talent-will-be-trumps-basket-/c",
  "content": "50 “No Talent” will be Trump’s “Basket of Deplorables”  moment if he’s not careful. Better right this ship or we’ll sink it. posted 1 hour ago by JoeMcCarthyWasRight 10 comments award share download report block\n10 comments Sort by Top Top New Worst Old Save whatsupup 3 points 1 hour ago i'm not sure he cares, he got his 2 terms so he's in the history books. now all he would focus on is making his family extremely wealthy and ensure they have a place in the new world, whatever that may be. permalink award report block reply War_Hamster 2 points 9 minutes ago If Trump fails to do what we voted for him to do, that new world will be a permanent technocracy. People need to get much more familiar with that word because we're on the precipice. permalink parent award report block reply Wrexxis780 1 points 9 minutes ago Does he not know democrats will take everything from his family in revenge if they win? permalink parent award report block reply whatsupup 3 points 7 minutes ago revenge? what has he done to them? no arrests, nada, called them some bad names, that's just showmanship to entertain the masses permalink parent award report block reply blitzkrieg1 1 points 1 hour ago Try this. https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply Whoopies_tds -2 points 1 hour ago Except like a low IQ retard you're taking it out of context and have no clue that the United States does NOT have a monopoly on the brightest minds in the world. permalink award report block reply wharfthrowaway 6 points 1 hour ago We have an O-1 visa for geniuses. H1B visas are just to import grunt workers for cheap at the expense of displacing capable Americans. permalink parent award report block reply Whoopies_tds 1 points 56 minutes ago H1B used to require the person to demonstrate that they had rare and hard to find/train skills. I agree the government got lazy and went overboard and lowered the standards to the floor....actually dug a ditch for the bar. Purge the generic and keep the top 1-5% permalink parent award report block reply whatsupup 2 points 47 minutes ago Its not even about that anymore. companies will overlook a qualified American and hire a less qualified H1B b/c they cost less. permalink parent award report block reply Appeal2Heaven98 1 points 4 minutes ago Trump saying we don't have the \"talent\" needed in America and we need to import it is not \"America First.\" It's also demoralizing as hell hearing him say that. No matter how you spin it, that's the reality. permalink parent award report block reply\nwhatsupup 3 points 1 hour ago i'm not sure he cares, he got his 2 terms so he's in the history books. now all he would focus on is making his family extremely wealthy and ensure they have a place in the new world, whatever that may be. permalink award report block reply War_Hamster 2 points 9 minutes ago If Trump fails to do what we voted for him to do, that new world will be a permanent technocracy. People need to get much more familiar with that word because we're on the precipice. permalink parent award report block reply Wrexxis780 1 points 9 minutes ago Does he not know democrats will take everything from his family in revenge if they win? permalink parent award report block reply whatsupup 3 points 7 minutes ago revenge? what has he done to them? no arrests, nada, called them some bad names, that's just showmanship to entertain the masses permalink parent award report block reply\nWar_Hamster 2 points 9 minutes ago If Trump fails to do what we voted for him to do, that new world will be a permanent technocracy. People need to get much more familiar with that word because we're on the precipice. permalink parent award report block reply\nWrexxis780 1 points 9 minutes ago Does he not know democrats will take everything from his family in revenge if they win? permalink parent award report block reply whatsupup 3 points 7 minutes ago revenge? what has he done to them? no arrests, nada, called them some bad names, that's just showmanship to entertain the masses permalink parent award report block reply\nwhatsupup 3 points 7 minutes ago revenge? what has he done to them? no arrests, nada, called them some bad names, that's just showmanship to entertain the masses permalink parent award report block reply\nblitzkrieg1 1 points 1 hour ago Try this. https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply\nWhoopies_tds -2 points 1 hour ago Except like a low IQ retard you're taking it out of context and have no clue that the United States does NOT have a monopoly on the brightest minds in the world. permalink award report block reply wharfthrowaway 6 points 1 hour ago We have an O-1 visa for geniuses. H1B visas are just to import grunt workers for cheap at the expense of displacing capable Americans. permalink parent award report block reply Whoopies_tds 1 points 56 minutes ago H1B used to require the person to demonstrate that they had rare and hard to find/train skills. I agree the government got lazy and went overboard and lowered the standards to the floor....actually dug a ditch for the bar. Purge the generic and keep the top 1-5% permalink parent award report block reply whatsupup 2 points 47 minutes ago Its not even about that anymore. companies will overlook a qualified American and hire a less qualified H1B b/c they cost less. permalink parent award report block reply Appeal2Heaven98 1 points 4 minutes ago Trump saying we don't have the \"talent\" needed in America and we need to import it is not \"America First.\" It's also demoralizing as hell hearing him say that. No matter how you spin it, that's the reality. permalink parent award report block reply\nwharfthrowaway 6 points 1 hour ago We have an O-1 visa for geniuses. H1B visas are just to import grunt workers for cheap at the expense of displacing capable Americans. permalink parent award report block reply Whoopies_tds 1 points 56 minutes ago H1B used to require the person to demonstrate that they had rare and hard to find/train skills. I agree the government got lazy and went overboard and lowered the standards to the floor....actually dug a ditch for the bar. Purge the generic and keep the top 1-5% permalink parent award report block reply\nWhoopies_tds 1 points 56 minutes ago H1B used to require the person to demonstrate that they had rare and hard to find/train skills. I agree the government got lazy and went overboard and lowered the standards to the floor....actually dug a ditch for the bar. Purge the generic and keep the top 1-5% permalink parent award report block reply\nwhatsupup 2 points 47 minutes ago Its not even about that anymore. companies will overlook a qualified American and hire a less qualified H1B b/c they cost less. permalink parent award report block reply\nAppeal2Heaven98 1 points 4 minutes ago Trump saying we don't have the \"talent\" needed in America and we need to import it is not \"America First.\" It's also demoralizing as hell hearing him say that. No matter how you spin it, that's the reality. permalink parent award report block reply"
}