{
  "id": "1ARK0UankA",
  "url": "https://patriots.win/p/1ARK0UankA/democrats-have-never-been-more-u/c",
  "content": "1059 \"Democrats have never been more unpopular. Yet, magically, they are still able to flip districts Trump won just 1 year ago and run CIA agents who win by 15 points.\n\nIt’s a mystery!\" posted 7 days ago by ncswicn 63 comments award share download report block\n63 comments Sort by Top Top New Worst Old Save patrioticwinning3 113 points 7 days ago Zero rigger arrests = zero incentive not to rig. permalink award report block reply ncswicn OP 46 points 7 days ago 🎯🎯🎯 permalink parent award report block reply Govtizbad 6 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply suckmycorona 22 points 7 days ago It’s why I never voted ever until 2016.  Growing up the 51/49 everytime for the least likable candidate was just to obvious.  Selected not elected so what’s the point.  2016 voted for the first time, 2020 second and we know how that went, literally statistically impossible but nothing happened other than the whistle blowers got in trouble.  This election cycle was the two steps back for me because nothing that has happened since 2020 change our rigged elections.  New York City elects a Muslim mayor what the ever loving fuck! permalink parent award report block reply A_Colostomy_Bag 13 points 7 days ago You don't believe the amazing Joe Biden got 81 million votes?  More votes than anyone in US history.... more black votes than Barack Obama... all while never leaving his basement! permalink parent award report block reply suckmycorona 4 points 7 days ago Weird right? permalink parent award report block reply UCantStumpTheTrump 3 points 7 days ago Bingo. The odds of EVERY RACE coming down to a razor thin 51/49 margin are ZERO. Nobody in their right mind believes that people are split 50-50 on the future direction of our country. It’s all rigging permalink parent award report block reply Friendly_B 5 points 7 days ago I believed this 51/49 fallacy for most of my life. 2020 really dropped the scales from the eyes of many of us. permalink parent award report block reply spezisacuckold 7 points 7 days ago Don't worry sleep well at night President Trump has a thing for Bondi and he says she's doing a great job at doing nothing. permalink parent award report block reply Prussian_Pepe 8 points 7 days ago The system will never fix itself. Especially when it's had over a century of being enslaved and rewritten to work for the cartel our ancestors tried to escape from so long ago in Europe. There is no were to run anymore. Time to face the puppet masters or bow to their wishes. permalink parent award report block reply Friendly_B 2 points 7 days ago My ancestors fled Europe and came to America to avoid being murdered by the Catholic Church. permalink parent award report block reply PowerOfBlues -7 points 7 days ago Fuck off you dooming piece nothingness permalink parent award report block reply henri_derelicte 51 points 7 days ago Isn’t it odd that the Dems always seem to overperform? permalink award report block reply ncswicn OP 24 points 7 days ago Amazing, isn't it?!😉 permalink parent award report block reply lixa 7 points 7 days ago To be fair: Mostly blue states. The left has billions for voter outreach, and the GOP does not and does nothing with what they have. We don't turn out for off year elections and especially when the candidates suck (see above). permalink parent award report block reply DickTick PRO 6 points 7 days ago Run multiple boring candidates for multiple parties and make sure that it splits our vote even just a little bit and, boom, you automatically win in almost every state Expect the exact same shenanigans during midterms permalink parent award report block reply Grindelwald 31 points 7 days ago Because elections are run by democrats. permalink award report block reply ncswicn OP 17 points 7 days ago 🎯 permalink parent award report block reply SummTingWong 17 points 7 days ago Some of the dissatisfaction is from people who think they are not far left enough.  These party approval ratings only tell so much. permalink award report block reply ncswicn OP 7 points 7 days ago True dat! permalink parent award report block reply tribunabessica 13 points 7 days ago That's what America First rhetoric and Israel First policies will do to a motherfucker. permalink award report block reply NadlersNads 12 points 7 days ago Burn it all down permalink award report block reply Stanwyk74 11 points 7 days ago Never going to get a real election again until mail in voting ends permalink award report block reply Riggergonarig 10 points 7 days ago It's because it's in the rights DNA to check out. We want left alone and want to leave others alone. So the right checks out in races that are not for president. The leadership needs to market the midterms that if you don't show up then you are voting for trans in women's sports and trans kids and all of the other things that lost the left the presidency. People need to know that if they don't vote then they are voting for the lefts ideology permalink award report block reply Aggrieved03 9 points 7 days ago Republicunts are equally unpopular but I definitely agree theft happened. permalink award report block reply 1_Badcop 7 points 7 days ago Why shouldn't democrats steal elections? The republicans have everything they need to establish election integrity, but they have done nothing. permalink award report block reply Mhmm2MoreWeeks 7 points 7 days ago Its no mystery. Pam Bondi either 1. Cannot prosecute Traitors or 2. Will not prosecute Traitors. permalink award report block reply daveyistheman 7 points 7 days ago Look at PA voting numbers. NOBODY who leans right even bothered to vote. The Dems have one thing going for them. That 33% of democrat voters would literally have their arm amputated to vote against Trump. The Dems have riled their hardcore base up that much over the past 10 years. The sane people only show up after the left start ruining the country. Republicans are absolute dogshit turning out the vote. And the middle of the road people who only show up for presidential elections will be the death of this country. I honestly am starting to think Australia has it right. Make voting day a national holiday, and make it a requirement to vote. I don't see any other solution to this problem. permalink award report block reply Krat 5 points 7 days ago Thats because its not Americans vote here, its foreigners through mail in ballot.... did the pollsters poll the magic poorscrapers filled with invaders that are decimating all the natural beauty of towns across America? No? Ok then permalink award report block reply ncswicn OP 5 points 7 days ago https://truthsocial.com/@realLizUSA/posts/115498519029916902 permalink award report block reply Dallasguy 4 points 7 days ago Yeah, they count the votes and Trump doesn't put them in jail. Funny how that works. permalink award report block reply Repentnow 3 points 7 days ago What districts specifically? All I see is blue wins in blue districts that were Kamala wins. permalink award report block reply GreyKnight 3 points 7 days ago Just like Newsom losing massive party support but winning the recall… permalink award report block reply ncswicn OP 2 points 7 days ago Yeah, what a miracle. 😜 permalink parent award report block reply userwhoisathome 2 points 7 days ago Trump doesn't see it as a priority to secure elections what can go wrong permalink award report block reply bluewhiteandred 2 points 7 days ago The mail in vote fraud is too easy and pretty obvious but how do we ban it or prevent future abuse Edit: I guess we must get TOO BIG TO RIG for future permalink award report block reply Klown_Kutz 2 points 7 days ago We overcame it last year. permalink parent award report block reply jermzdeejd 2 points 6 days ago Gotta remember...these people that vote for Democrats will complain about everything and still vote Democrat for 2 decades. The polls dont change the nature of the animal. permalink award report block reply budgsxr 2 points 7 days ago The Dems used the EBT apocalypse to get out the vote. I’m telling you it got the basketball Americans along with the rest of the freebeecrats off the couch to vote. Can’t be losing those freebees permalink award report block reply FrankDuncan 3 points 7 days ago And the GOP was either too lazy or stupid to get out the message that it's the Dems that are continuing to keep things shut down permalink parent award report block reply AstroLonghorn 2 points 7 days ago Yea well a couple factors -Winsome Sears was a shit candidate. It’s really hard to run a black woman on a non DEI platform. Not only that she didn’t have the zing that Youngkin did -Spanberger ran to the right of her party, touting constantly that she was a federal agent and was good with police. It’s an obvious lie if you look at he voting record how much she truly bucks her party, but still -The seats of officials one year after the presidential tend to go the other direction than that of the president. This is mainly based on enthusiasm. Republicans felt complacent, Dems felt like they had to get some kind of win permalink award report block reply HenkZeilstra 2 points 7 days ago 0 arrests, ZERO ARRESTS. Nothing has been done to prevent another fraud like in 2020. It is rotten to the core permalink award report block reply BlackLabsMatter 2 points 7 days ago There is another side to this coin that is not mentioned.  In a political race that you actually vote on, you may well hate the person you vote for.  You also will 100% hate the opponent of that person more.   I recall two votes cast against Obama for candidates I detested.  Hatred of one does not mean support for another. permalink award report block reply MemoryHoleyeO 2 points 7 days ago Lowest rating since 2008; I remember something happening that year for them permalink award report block reply knnbccb 2 points 7 days ago All things are possible by the grace of voting machines. Amen. permalink award report block reply doomerglowie2 1 points 6 days ago This sort of observation does not work in a political climate where the sitting President and his supporters  spent about 8 years spamming \"fake polls\". Add that to fake news, and you get a population that is so desensitized to statistical data that trying to use it in an argument or debate is worthless. The cabals have successfully turned the entire internet into one big wikipedia so that everyone can access all the information but none of that information is certain. permalink award report block reply FrankDuncan 1 points 7 days ago If your rating is 2 and there's is one, they still win if the 2voters stay home permalink award report block reply RealmanPwns 1 points 6 days ago Unfavorable Rating of Democrat Party DOES NOT translate to More Favorable to Republicans permalink award report block reply ProsecuteTreason 1 points 7 days ago Trump did say \"they learned a lot\" last night. 🤔 permalink award report block reply FerkenBlerkin 1 points 7 days ago Thats what happens when the CIA changes the votes in real time. I'm leaning towards this, especially with that CIA tranny that won the Virginia Governor's race permalink award report block reply BidenCrimeSyndicate 1 points 7 days ago What cia agent permalink award report block reply ncswicn OP 2 points 7 days ago \"\"Abigail Spanberger served as an operations officer at the Central Intelligence Agency (CIA) from 2006 to 2014.\" https://search.brave.com/search?q=abigail+spanberger+was+cia&spellcheck=0&source=alteredQuery&conversation=231f6b14cb4c75da857754&summary=1 permalink parent award report block reply DITTOPatriot 1 points 7 days ago You haven't figured it out yet. Get a side few of the canadiates,there you go,now do you see it? permalink award report block reply Purple_Drank 1 points 7 days ago Nothing matters until we fix elections permalink award report block reply Klown_Kutz 1 points 7 days ago Women voted. Good men sat it out. permalink award report block reply Spellmonger 1 points 6 days ago We The People have to take the task of securing our election into our own hands. You just heard \" Senator \" John Thune reply to President Trump's request to end the filibuster and pass bills to secure our elections, he replied:  \"NOT HAPPENING\". Today, they will try to distract us by making a statement about how ending the filibuster will destroy our democracy. The \" Senators \" could just as blithely say - we can't divert the flooding river because the tranmyrmecologist lobby has warned us that it will harm the habitat of the yellow meadow ant, while pretending they aren't aware that the raging river will destroy the lives and homes of people for at least 100 miles downstream and it could be easily and harmlessly be diverted. permalink award report block reply RandyMoss 1 points 6 days ago There will be cucks in the comments \"rationalizing\" how and why this is reasonable and not fraud.  They are faggots permalink award report block reply TPMJB 1 points 6 days ago I think it's far more nuanced than \"They're cheating!\" The vast majority of people cannot plan their finances for the week. They exist only in the moment. They believe whatever they hear on TV. Red person is in power and bad thing happen \"Oh noes I should vote blue.\" Blue person is in power and bad thing happen \"Oh noes I should vote red.\" It's that simple. A lot of the reason voting signs work is because the voter didn't even know who was running in that category and now they recognize a name . You guys have to understand...the vast, overwhelming majority of people are not up to date on politics. They vote with feelings. People still see high grocery prices and salaries not keeping up with inflation. Also high home prices. It's that simple. permalink award report block reply possibletower 1 points 7 days ago Hey retarded OP, their voters hate them but they will never vote GOP. You also have to add the number of Republicans leaving blue states which will make it worse and worse for us every passing year who follow elections in blue states. You are one of those retards on the right who keep LARPing that there are so many \"based MAGA country\" in blue states, aren't you? permalink award report block reply Nomad2013 1 points 7 days ago Comment removed by community moderators. permalink award report block reply\npatrioticwinning3 113 points 7 days ago Zero rigger arrests = zero incentive not to rig. permalink award report block reply ncswicn OP 46 points 7 days ago 🎯🎯🎯 permalink parent award report block reply Govtizbad 6 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply suckmycorona 22 points 7 days ago It’s why I never voted ever until 2016.  Growing up the 51/49 everytime for the least likable candidate was just to obvious.  Selected not elected so what’s the point.  2016 voted for the first time, 2020 second and we know how that went, literally statistically impossible but nothing happened other than the whistle blowers got in trouble.  This election cycle was the two steps back for me because nothing that has happened since 2020 change our rigged elections.  New York City elects a Muslim mayor what the ever loving fuck! permalink parent award report block reply A_Colostomy_Bag 13 points 7 days ago You don't believe the amazing Joe Biden got 81 million votes?  More votes than anyone in US history.... more black votes than Barack Obama... all while never leaving his basement! permalink parent award report block reply suckmycorona 4 points 7 days ago Weird right? permalink parent award report block reply UCantStumpTheTrump 3 points 7 days ago Bingo. The odds of EVERY RACE coming down to a razor thin 51/49 margin are ZERO. Nobody in their right mind believes that people are split 50-50 on the future direction of our country. It’s all rigging permalink parent award report block reply Friendly_B 5 points 7 days ago I believed this 51/49 fallacy for most of my life. 2020 really dropped the scales from the eyes of many of us. permalink parent award report block reply spezisacuckold 7 points 7 days ago Don't worry sleep well at night President Trump has a thing for Bondi and he says she's doing a great job at doing nothing. permalink parent award report block reply Prussian_Pepe 8 points 7 days ago The system will never fix itself. Especially when it's had over a century of being enslaved and rewritten to work for the cartel our ancestors tried to escape from so long ago in Europe. There is no were to run anymore. Time to face the puppet masters or bow to their wishes. permalink parent award report block reply Friendly_B 2 points 7 days ago My ancestors fled Europe and came to America to avoid being murdered by the Catholic Church. permalink parent award report block reply PowerOfBlues -7 points 7 days ago Fuck off you dooming piece nothingness permalink parent award report block reply\nncswicn OP 46 points 7 days ago 🎯🎯🎯 permalink parent award report block reply Govtizbad 6 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nGovtizbad 6 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nsuckmycorona 22 points 7 days ago It’s why I never voted ever until 2016.  Growing up the 51/49 everytime for the least likable candidate was just to obvious.  Selected not elected so what’s the point.  2016 voted for the first time, 2020 second and we know how that went, literally statistically impossible but nothing happened other than the whistle blowers got in trouble.  This election cycle was the two steps back for me because nothing that has happened since 2020 change our rigged elections.  New York City elects a Muslim mayor what the ever loving fuck! permalink parent award report block reply A_Colostomy_Bag 13 points 7 days ago You don't believe the amazing Joe Biden got 81 million votes?  More votes than anyone in US history.... more black votes than Barack Obama... all while never leaving his basement! permalink parent award report block reply suckmycorona 4 points 7 days ago Weird right? permalink parent award report block reply UCantStumpTheTrump 3 points 7 days ago Bingo. The odds of EVERY RACE coming down to a razor thin 51/49 margin are ZERO. Nobody in their right mind believes that people are split 50-50 on the future direction of our country. It’s all rigging permalink parent award report block reply Friendly_B 5 points 7 days ago I believed this 51/49 fallacy for most of my life. 2020 really dropped the scales from the eyes of many of us. permalink parent award report block reply\nA_Colostomy_Bag 13 points 7 days ago You don't believe the amazing Joe Biden got 81 million votes?  More votes than anyone in US history.... more black votes than Barack Obama... all while never leaving his basement! permalink parent award report block reply suckmycorona 4 points 7 days ago Weird right? permalink parent award report block reply\nsuckmycorona 4 points 7 days ago Weird right? permalink parent award report block reply\nUCantStumpTheTrump 3 points 7 days ago Bingo. The odds of EVERY RACE coming down to a razor thin 51/49 margin are ZERO. Nobody in their right mind believes that people are split 50-50 on the future direction of our country. It’s all rigging permalink parent award report block reply Friendly_B 5 points 7 days ago I believed this 51/49 fallacy for most of my life. 2020 really dropped the scales from the eyes of many of us. permalink parent award report block reply\nFriendly_B 5 points 7 days ago I believed this 51/49 fallacy for most of my life. 2020 really dropped the scales from the eyes of many of us. permalink parent award report block reply\nspezisacuckold 7 points 7 days ago Don't worry sleep well at night President Trump has a thing for Bondi and he says she's doing a great job at doing nothing. permalink parent award report block reply Prussian_Pepe 8 points 7 days ago The system will never fix itself. Especially when it's had over a century of being enslaved and rewritten to work for the cartel our ancestors tried to escape from so long ago in Europe. There is no were to run anymore. Time to face the puppet masters or bow to their wishes. permalink parent award report block reply Friendly_B 2 points 7 days ago My ancestors fled Europe and came to America to avoid being murdered by the Catholic Church. permalink parent award report block reply PowerOfBlues -7 points 7 days ago Fuck off you dooming piece nothingness permalink parent award report block reply\nPrussian_Pepe 8 points 7 days ago The system will never fix itself. Especially when it's had over a century of being enslaved and rewritten to work for the cartel our ancestors tried to escape from so long ago in Europe. There is no were to run anymore. Time to face the puppet masters or bow to their wishes. permalink parent award report block reply Friendly_B 2 points 7 days ago My ancestors fled Europe and came to America to avoid being murdered by the Catholic Church. permalink parent award report block reply\nFriendly_B 2 points 7 days ago My ancestors fled Europe and came to America to avoid being murdered by the Catholic Church. permalink parent award report block reply\nPowerOfBlues -7 points 7 days ago Fuck off you dooming piece nothingness permalink parent award report block reply\nhenri_derelicte 51 points 7 days ago Isn’t it odd that the Dems always seem to overperform? permalink award report block reply ncswicn OP 24 points 7 days ago Amazing, isn't it?!😉 permalink parent award report block reply lixa 7 points 7 days ago To be fair: Mostly blue states. The left has billions for voter outreach, and the GOP does not and does nothing with what they have. We don't turn out for off year elections and especially when the candidates suck (see above). permalink parent award report block reply DickTick PRO 6 points 7 days ago Run multiple boring candidates for multiple parties and make sure that it splits our vote even just a little bit and, boom, you automatically win in almost every state Expect the exact same shenanigans during midterms permalink parent award report block reply\nncswicn OP 24 points 7 days ago Amazing, isn't it?!😉 permalink parent award report block reply\nlixa 7 points 7 days ago To be fair: Mostly blue states. The left has billions for voter outreach, and the GOP does not and does nothing with what they have. We don't turn out for off year elections and especially when the candidates suck (see above). permalink parent award report block reply DickTick PRO 6 points 7 days ago Run multiple boring candidates for multiple parties and make sure that it splits our vote even just a little bit and, boom, you automatically win in almost every state Expect the exact same shenanigans during midterms permalink parent award report block reply\nDickTick PRO 6 points 7 days ago Run multiple boring candidates for multiple parties and make sure that it splits our vote even just a little bit and, boom, you automatically win in almost every state Expect the exact same shenanigans during midterms permalink parent award report block reply\nGrindelwald 31 points 7 days ago Because elections are run by democrats. permalink award report block reply ncswicn OP 17 points 7 days ago 🎯 permalink parent award report block reply\nncswicn OP 17 points 7 days ago 🎯 permalink parent award report block reply\nSummTingWong 17 points 7 days ago Some of the dissatisfaction is from people who think they are not far left enough.  These party approval ratings only tell so much. permalink award report block reply ncswicn OP 7 points 7 days ago True dat! permalink parent award report block reply\nncswicn OP 7 points 7 days ago True dat! permalink parent award report block reply\ntribunabessica 13 points 7 days ago That's what America First rhetoric and Israel First policies will do to a motherfucker. permalink award report block reply\nNadlersNads 12 points 7 days ago Burn it all down permalink award report block reply\nStanwyk74 11 points 7 days ago Never going to get a real election again until mail in voting ends permalink award report block reply\nRiggergonarig 10 points 7 days ago It's because it's in the rights DNA to check out. We want left alone and want to leave others alone. So the right checks out in races that are not for president. The leadership needs to market the midterms that if you don't show up then you are voting for trans in women's sports and trans kids and all of the other things that lost the left the presidency. People need to know that if they don't vote then they are voting for the lefts ideology permalink award report block reply\nAggrieved03 9 points 7 days ago Republicunts are equally unpopular but I definitely agree theft happened. permalink award report block reply\n1_Badcop 7 points 7 days ago Why shouldn't democrats steal elections? The republicans have everything they need to establish election integrity, but they have done nothing. permalink award report block reply\nMhmm2MoreWeeks 7 points 7 days ago Its no mystery. Pam Bondi either 1. Cannot prosecute Traitors or 2. Will not prosecute Traitors. permalink award report block reply\ndaveyistheman 7 points 7 days ago Look at PA voting numbers. NOBODY who leans right even bothered to vote. The Dems have one thing going for them. That 33% of democrat voters would literally have their arm amputated to vote against Trump. The Dems have riled their hardcore base up that much over the past 10 years. The sane people only show up after the left start ruining the country. Republicans are absolute dogshit turning out the vote. And the middle of the road people who only show up for presidential elections will be the death of this country. I honestly am starting to think Australia has it right. Make voting day a national holiday, and make it a requirement to vote. I don't see any other solution to this problem. permalink award report block reply\nKrat 5 points 7 days ago Thats because its not Americans vote here, its foreigners through mail in ballot.... did the pollsters poll the magic poorscrapers filled with invaders that are decimating all the natural beauty of towns across America? No? Ok then permalink award report block reply\nncswicn OP 5 points 7 days ago https://truthsocial.com/@realLizUSA/posts/115498519029916902 permalink award report block reply\nDallasguy 4 points 7 days ago Yeah, they count the votes and Trump doesn't put them in jail. Funny how that works. permalink award report block reply\nRepentnow 3 points 7 days ago What districts specifically? All I see is blue wins in blue districts that were Kamala wins. permalink award report block reply\nGreyKnight 3 points 7 days ago Just like Newsom losing massive party support but winning the recall… permalink award report block reply ncswicn OP 2 points 7 days ago Yeah, what a miracle. 😜 permalink parent award report block reply\nncswicn OP 2 points 7 days ago Yeah, what a miracle. 😜 permalink parent award report block reply\nuserwhoisathome 2 points 7 days ago Trump doesn't see it as a priority to secure elections what can go wrong permalink award report block reply\nbluewhiteandred 2 points 7 days ago The mail in vote fraud is too easy and pretty obvious but how do we ban it or prevent future abuse Edit: I guess we must get TOO BIG TO RIG for future permalink award report block reply Klown_Kutz 2 points 7 days ago We overcame it last year. permalink parent award report block reply\nKlown_Kutz 2 points 7 days ago We overcame it last year. permalink parent award report block reply\njermzdeejd 2 points 6 days ago Gotta remember...these people that vote for Democrats will complain about everything and still vote Democrat for 2 decades. The polls dont change the nature of the animal. permalink award report block reply\nbudgsxr 2 points 7 days ago The Dems used the EBT apocalypse to get out the vote. I’m telling you it got the basketball Americans along with the rest of the freebeecrats off the couch to vote. Can’t be losing those freebees permalink award report block reply FrankDuncan 3 points 7 days ago And the GOP was either too lazy or stupid to get out the message that it's the Dems that are continuing to keep things shut down permalink parent award report block reply\nFrankDuncan 3 points 7 days ago And the GOP was either too lazy or stupid to get out the message that it's the Dems that are continuing to keep things shut down permalink parent award report block reply\nAstroLonghorn 2 points 7 days ago Yea well a couple factors -Winsome Sears was a shit candidate. It’s really hard to run a black woman on a non DEI platform. Not only that she didn’t have the zing that Youngkin did -Spanberger ran to the right of her party, touting constantly that she was a federal agent and was good with police. It’s an obvious lie if you look at he voting record how much she truly bucks her party, but still -The seats of officials one year after the presidential tend to go the other direction than that of the president. This is mainly based on enthusiasm. Republicans felt complacent, Dems felt like they had to get some kind of win permalink award report block reply\nHenkZeilstra 2 points 7 days ago 0 arrests, ZERO ARRESTS. Nothing has been done to prevent another fraud like in 2020. It is rotten to the core permalink award report block reply\nBlackLabsMatter 2 points 7 days ago There is another side to this coin that is not mentioned.  In a political race that you actually vote on, you may well hate the person you vote for.  You also will 100% hate the opponent of that person more.   I recall two votes cast against Obama for candidates I detested.  Hatred of one does not mean support for another. permalink award report block reply\nMemoryHoleyeO 2 points 7 days ago Lowest rating since 2008; I remember something happening that year for them permalink award report block reply\nknnbccb 2 points 7 days ago All things are possible by the grace of voting machines. Amen. permalink award report block reply\ndoomerglowie2 1 points 6 days ago This sort of observation does not work in a political climate where the sitting President and his supporters  spent about 8 years spamming \"fake polls\". Add that to fake news, and you get a population that is so desensitized to statistical data that trying to use it in an argument or debate is worthless. The cabals have successfully turned the entire internet into one big wikipedia so that everyone can access all the information but none of that information is certain. permalink award report block reply\nFrankDuncan 1 points 7 days ago If your rating is 2 and there's is one, they still win if the 2voters stay home permalink award report block reply\nRealmanPwns 1 points 6 days ago Unfavorable Rating of Democrat Party DOES NOT translate to More Favorable to Republicans permalink award report block reply\nProsecuteTreason 1 points 7 days ago Trump did say \"they learned a lot\" last night. 🤔 permalink award report block reply\nFerkenBlerkin 1 points 7 days ago Thats what happens when the CIA changes the votes in real time. I'm leaning towards this, especially with that CIA tranny that won the Virginia Governor's race permalink award report block reply\nBidenCrimeSyndicate 1 points 7 days ago What cia agent permalink award report block reply ncswicn OP 2 points 7 days ago \"\"Abigail Spanberger served as an operations officer at the Central Intelligence Agency (CIA) from 2006 to 2014.\" https://search.brave.com/search?q=abigail+spanberger+was+cia&spellcheck=0&source=alteredQuery&conversation=231f6b14cb4c75da857754&summary=1 permalink parent award report block reply\nncswicn OP 2 points 7 days ago \"\"Abigail Spanberger served as an operations officer at the Central Intelligence Agency (CIA) from 2006 to 2014.\" https://search.brave.com/search?q=abigail+spanberger+was+cia&spellcheck=0&source=alteredQuery&conversation=231f6b14cb4c75da857754&summary=1 permalink parent award report block reply\nDITTOPatriot 1 points 7 days ago You haven't figured it out yet. Get a side few of the canadiates,there you go,now do you see it? permalink award report block reply\nPurple_Drank 1 points 7 days ago Nothing matters until we fix elections permalink award report block reply\nKlown_Kutz 1 points 7 days ago Women voted. Good men sat it out. permalink award report block reply\nSpellmonger 1 points 6 days ago We The People have to take the task of securing our election into our own hands. You just heard \" Senator \" John Thune reply to President Trump's request to end the filibuster and pass bills to secure our elections, he replied:  \"NOT HAPPENING\". Today, they will try to distract us by making a statement about how ending the filibuster will destroy our democracy. The \" Senators \" could just as blithely say - we can't divert the flooding river because the tranmyrmecologist lobby has warned us that it will harm the habitat of the yellow meadow ant, while pretending they aren't aware that the raging river will destroy the lives and homes of people for at least 100 miles downstream and it could be easily and harmlessly be diverted. permalink award report block reply\nRandyMoss 1 points 6 days ago There will be cucks in the comments \"rationalizing\" how and why this is reasonable and not fraud.  They are faggots permalink award report block reply\nTPMJB 1 points 6 days ago I think it's far more nuanced than \"They're cheating!\" The vast majority of people cannot plan their finances for the week. They exist only in the moment. They believe whatever they hear on TV. Red person is in power and bad thing happen \"Oh noes I should vote blue.\" Blue person is in power and bad thing happen \"Oh noes I should vote red.\" It's that simple. A lot of the reason voting signs work is because the voter didn't even know who was running in that category and now they recognize a name . You guys have to understand...the vast, overwhelming majority of people are not up to date on politics. They vote with feelings. People still see high grocery prices and salaries not keeping up with inflation. Also high home prices. It's that simple. permalink award report block reply\npossibletower 1 points 7 days ago Hey retarded OP, their voters hate them but they will never vote GOP. You also have to add the number of Republicans leaving blue states which will make it worse and worse for us every passing year who follow elections in blue states. You are one of those retards on the right who keep LARPing that there are so many \"based MAGA country\" in blue states, aren't you? permalink award report block reply\nNomad2013 1 points 7 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:06:20.635258Z"
}