{
  "id": "1ARK5BHy9H",
  "url": "https://patriots.win/p/1ARK5BHy9H/muslims-furiously-yelling-lookin/c",
  "content": "1065 Muslims furiously yelling ‘looking for White people’\n\nYelling where’s the rest of you “white fuckers at, huh? Where the rest of you white pieces of shit at”\n\nHe then says “I’ve been waiting for this” posted 3 days ago by PiratePatriotParrot 129 comments award share report block Wall Street Apes @WallStreetApes • 3d Muslims furiously yelling ‘looking for White people’ Yelling where’s the rest of you “white f*ckers at, huh? Where the rest of you white pieces of sh*t at” He then says “I’ve been waiting for this” This is in America. Wake up\n129 comments Sort by Top Top New Worst Old Save Around the Web TheRedPilledArtist 101 points 3 days ago Carry always and always carry... permalink award report block reply Mungo 22 points 3 days ago And practice often. permalink parent award report block reply FusionBlack 4 points 2 days ago People think they can just strap on and go. It took me hours to learn how to draw correctly and consistently in front of a mirror. permalink parent award report block reply Mungo 4 points 2 days ago Agreed. Practice from walking, sitting, in your car, etc. permalink parent award report block reply Wildwind 1 points 2 days ago Of course you practice. Your stupid if you dont train. permalink parent award report block reply CleanUpPhillyTrump24 52 points 3 days ago What is he even talking about? Low IQ stuff. permalink award report block reply wilburh09 38 points 3 days ago He’s Probably looking for a fight where he calls a white person a devil piece of shit then sues when he gets punched.  Typical bum permalink parent award report block reply YesImWhite 23 points 3 days ago can't sue when you're dead. Send him to the virgins permalink parent award report block reply schnazzmizzle 17 points 3 days ago Islamic paradise is a lie.  They'll just be burning with the dead pedo Muhammad in hell. permalink parent award report block reply stevethefish76 6 points 3 days ago ...and Dick Cheney. permalink parent award report block reply Remember_the_Alamo 3 points 2 days ago The al zutt men will sodomize the Muslims because that is their culture. permalink parent award report block reply Shih_Tabed 3 points 2 days ago No, just a half truth.  They do get virgins in the afterlife as promised, they just aren't women. permalink parent award report block reply wilburh09 5 points 3 days ago Seems like something we might be doing in the near future . permalink parent award report block reply Washington_Redskins 4 points 3 days ago We could call it the \"OK Stupid\" programming which provides matchmaking between violent Muslims and their future virgin brides. permalink parent award report block reply Leeboscan 3 points 3 days ago Virgins? Are you sure? I pretty sure those goats have been passed around quite a bit. The four-legged floozies. permalink parent award report block reply Klaus73 1 points 2 days ago A shot from about 700 yrds on a battle rifle ensures \"peace\" and doubtful LEO will put in a great effort to find the shooter. permalink parent award report block reply YesImWhite 1 points 2 days ago imma have to upgrade from 5.56 then permalink parent award report block reply Owmyballz 11 points 3 days ago Missing context.  This is taking place at what appears to be a mosque.  Ask yourself why the Muslim is pissed and the cops are at the mosque in the first place. permalink parent award report block reply Moose_Antlers 11 points 3 days ago We've got a loudmouth preacher in the background clearly antagonizing the guy and trying to pick a fight. The cops are already there, more than one car, so this has been going on for a while before this clip. Black dude's clearly Muslim and racist af as well. A lot of them turn to Islam in some sort of search for identity that's not \"white.\" So, they reject Christianity which they see as white in favor of the Religion of Peace death cult. I hate this kind of video because the context matters and we don't get it. It's ragebait and frankly, I'm getting tired of having my emotions jerked around for likes, clicks, fame/notoriety, or to weaponize my emotions for political purposes. I know this is just 4th generation warfare. It's an information war for hearts and minds being fought on a global level. Trump really is trying to win a war against the Deep State... the real one, the global one. That's why we're seeing this, but still, I want people to deal straight with me. I'm tired of being manipulated. permalink parent award report block reply Leeboscan 10 points 3 days ago I really do believe myself that this is why many blacks convert to islam also. Like \"well it came from Africa, so it MUST be meant for our people\". Not realizing that the koran itself speaks of blacks as lesser people. What a sad irony.  Muslims and Arabs are far more racist toward blacks than any white person I've ever observed. They'd spit right on you if they could. You can see it in their eyes. permalink parent award report block reply view 2 more comments... TruthyBrat 6 points 3 days ago A death cult that enslaved blacks and neutered them. If Kunte Kinte had been sent east instead of west, Roots would have been 1 chapter. permalink parent award report block reply bill_in_texas 2 points 2 days ago Prison convert, probably.  The J6'ers noted that the Moslems were HEAVILY recruiting in the D.C. gulag, encouraged by the guards as well.  No wonder the predominantly White, Christian political prisoners there were treated so horribly. A lesson for all....stay far away from any Moslem controlled area. permalink parent award report block reply boataholic 2 points 2 days ago Heaven forbid we antagonize Muslims.  Almost as bad as Trump antagonizing the left with his tweets. permalink parent award report block reply ConstitutionPatriot -1 points 3 days ago AMEN!!! permalink parent award report block reply wilburh09 5 points 3 days ago Huh? Seems racist either way.  What if a white guy is  screaming and fighting with cops while yelling “where is the brown piece of shit?”   He’d be thrown in jail. permalink parent award report block reply Owmyballz 1 points 3 days ago Not in the States, you can call people whatever name or slur you want.  If the fuckers try to lock you up, sue them to penury. permalink parent award report block reply view 4 more comments... Im_RickSteves_bitch 2 points 2 days ago Because the white guys have a right to be there, they have the right to say whatever they want, and he can’t do anything about it. permalink parent award report block reply trumpORbust 2 points 3 days ago Failed to dentonate permalink parent award report block reply Owmyballz 5 points 3 days ago Nah, they use their 12 year old daughters for that.  Source, saw the report on a 12 year old girl used as a suicide bomber in Iraq.  Fucking animals. permalink parent award report block reply Threaper666 4 points 3 days ago Oh, no.  Some brown piece of shit wanting to get revenge on whitie because he feels inferior.  What's new? permalink parent award report block reply gunzby 1 points 2 days ago One way ticket to Suplex City permalink parent award report block reply Hoshi 16 points 3 days ago I feel more stupid after watching this permalink parent award report block reply fskfsk 10 points 3 days ago There was some fight or altercation beforehand that obviously was edited out. This is what Muslims and commies do.  Go around starting fights, film everything.  Then when other people fight back, post an edited out-of-context video that makes the victim look like the aggressor. I.e., this video shows a White person getting hostile towards a Muslim, but it doesn't show what the Muslim did before the video started to get that reaction. permalink parent award report block reply N0rds 1 points 2 days ago Typical antifa tactic. The fascists use this tactic all the time permalink parent award report block reply Dem_slayer 1 points 2 days ago He's muslim... they all are. They are the most inbred humans on the planet. permalink parent award report block reply GdotLee 30 points 3 days ago IM RIGHT HERE GOAT FUCKER permalink award report block reply cuckerberg2020 9 points 3 days ago Came here to say this permalink parent award report block reply CounterStrike 27 points 3 days ago Where? permalink award report block reply TwoArizonaPedes 25 points 3 days ago Illinois. permalink parent award report block reply Moose_Antlers 8 points 3 days ago Where, in Illinois? permalink parent award report block reply Viewer01 19 points 3 days ago When the last boomer dies Gen z is going to absolutely uncoil on anyone and everyone. permalink award report block reply MediaBro 10 points 3 days ago Gonna be too late by then. I'm seeing the demographics and I think this ends with global annihilation for everyone. permalink parent award report block reply fskfsk 5 points 3 days ago That would be the disaster from which humanity might never recover, if Muslims wound up conquering the world.  On the other hand, if there was a Muslim takeover, eventually there would be collapse of civilization and transport, a massive die-off, and some areas might evolve civilization again. permalink parent award report block reply MediaBro 5 points 3 days ago Your world leaders are clearly on their side. They're investing billions in Saudi Arabia's vanity projects. Millions of working class Brits, Aussies, Kiwis and Americans have made their homes in Saudi Arabia, UAE, Oman, Qatar and Bahrain for decades now. If you're wondering why there are millions of Indians and Muslims with money showing up in your homelands, these places are all tax-free on income and they let you make as much money as possible and they're fully protected by the US and UK military. And they're expanding their protection. Saudis just made a deal with the Pakistanis to protect them militarily. Everyone is extremely connected in this globalised world. permalink parent award report block reply fskfsk 4 points 3 days ago Of course the Deep State is on their side.  That's why they opened the doors to the invaders. The Deep State leaders look at commies (China) and Islam and say \"We wish we had that kind of control and power in the USA.  It would be so much easier to rule if we could just kill anyone we didn't like or send them to death camps!\" They see Islam and China not as \"cautionary tale\" but as \"role model to be followed\". That's how Indonesia got conquered by Islam.  The local leaders in Indonesia decided that Islam let them control their population/slaves better, so they intentionally converted. permalink parent award report block reply view 2 more comments... Wildwind 2 points 2 days ago Let them. Sooner or later these stupid millionaires are going to lose their heads. After they watch their wives and children  raped and killed. permalink parent award report block reply view 1 more comments... FutureFreemason 2 points 2 days ago Problem for them is, that they dont have capacity to out think, plan or coordinate against us. We could be out numbered 5:1 and survive permalink parent award report block reply MediaBro 1 points 2 days ago We'll see. Your quislings have long ago made plans with these ppl. You're a little too late to the party. But hey, best of luck. We're all going to need it. permalink parent award report block reply GaNative52 2 points 3 days ago I’m a boomer and I’d like to stay around long enough to see that! permalink parent award report block reply Oldjeansandbelt -1 points 2 days ago No they won’t try hard Rambo, it would happened by now permalink parent award report block reply projectarcturus1 17 points 3 days ago These 40-50 iq animals need to be deported. permalink award report block reply ConfusedAngryArmed 10 points 3 days ago Nah, I'd rather we do the world a favor and kill them all. permalink parent award report block reply Beardholder 3 points 2 days ago My English is a bit off. By deported for the Muslims does this mean to execute and put in the ground? Because all who worship a false prophet who was an open pedophile and murderer does deserve to be eliminated from earth. permalink parent award report block reply Beelzy 16 points 3 days ago \"I've been waiting for this\"...what a coincidence. I've already had fun with the goat fuckers. They HATE being called that btw. permalink award report block reply ConfusedAngryArmed 7 points 3 days ago They hate it because it's true. Veteran with a Sign has a story about this while in Afghanistan. permalink parent award report block reply Hanging_Chad 13 points 3 days ago deport permalink award report block reply The_Bloofy_Bullshark 13 points 3 days ago Cleanse* permalink parent award report block reply ConfusedAngryArmed 9 points 3 days ago Impale permalink parent award report block reply rebuildingMyself 2 points 2 days ago That's the peaceful option permalink parent award report block reply Sweets 12 points 3 days ago When are we going to start the 5th crusades? permalink award report block reply TwoArizonaPedes 13 points 3 days ago We're already fighting. It begins by getting together a group of like-minded patriots. Start with your church and your friends and grow from there. Set up a phone tree. Use burner phones. Don't text. Organize, coordinate, think, be creative! You already know how to respond to their street-blocking \"prayers.\" Pick a name or organization and get involved. permalink parent award report block reply Than0sIII 11 points 3 days ago Oh so that's why sand is put in front of the N word for them.  Same shit, different region. permalink award report block reply ConfusedAngryArmed 5 points 3 days ago Dune coons. permalink parent award report block reply HoganT 11 points 3 days ago Literally antagonizing people and then criticizing them for responding. permalink award report block reply KekistanPM 22 points 3 days ago They strike you as they cry out in pain. permalink parent award report block reply MediaBro 8 points 3 days ago Think Jews but somehow worse. Somehow even worse than Jeets. permalink parent award report block reply HoganT -4 points 3 days ago We’re the ones crying out in pain after antagonizing here. permalink parent award report block reply Herpawinski 3 points 3 days ago Yes that's their strategy. That was one of the purposes of terrorism. To piss everyone off, then antagonize further by playing the victim when people didn't like getting murdered, then play the victim over people not liking being antagonized. The shitty behavior is called \"dawa\". They say it's just proselytizing but it's also antagonizing, then attacking people for sticking their necks out to complain about it. permalink parent award report block reply Herpawinski 7 points 3 days ago This is the real war. While Al Quada was distracting us with terrorism in worthless shitholes, their bosses, the muslim brotherhood, funneled muslims into our nation, just like they did to Europe. permalink award report block reply impera 5 points 3 days ago I distinctly remember a 'we are fighting them over there so we dont have to fight them over here' line of messaging. And wasn't that just a fucking lie, between then and now millions of hostile terrorists have been imported. permalink parent award report block reply Herpawinski 5 points 3 days ago Yes. The truth is they goaded us to fight them over there, so they could invade us here. permalink parent award report block reply Glory-Unto-God 2 points 2 days ago They have been feeding that same line up until recently about helping israel lmfao permalink parent award report block reply MADASHELLNEWS 7 points 3 days ago It's almost time to play cowboys and towel heads permalink award report block reply you_know_GOAT 6 points 3 days ago Right here. Come and try me. permalink award report block reply cuckerberg2020 3 points 3 days ago I’d say username checks out but I don’t want to you get raped by the goat fuckers permalink parent award report block reply Formerlurker92 6 points 3 days ago They only talk like this cause we aren't fighting yet. When we start it will just be a thousand variations of \"have mercy\" that will fall on deaf ears permalink award report block reply smedleybutleracolite 5 points 3 days ago I'm your Huckleberry permalink award report block reply Trumpluv77 4 points 3 days ago Man.....I never dreamt of having to use my gun, but IF...I had to... these would be the ones... permalink award report block reply ceesco2020 4 points 3 days ago Just fucking kill these things. permalink award report block reply DCYR66 4 points 2 days ago Let these sandnigs find some lead in their asses next. permalink award report block reply Apersonofinterest 4 points 3 days ago Looks like the signal has been given for all of the sleeper cells and radicals Biden smuggled into the country and set up around the nation with free stuff and probably weapons to activate. permalink award report block reply fskfsk 3 points 3 days ago No, the sleeper cells have been given the signal to stay quiet because Great Replacement is such a winning strategy. These are Muslims that are so undisciplined that they're violent anyway. permalink parent award report block reply SanityGumby 1 points 3 days ago Comes with a sub 70 iq permalink parent award report block reply fskfsk 1 points 3 days ago Sub 70 iq, plus a religion that says violence is demanded by Allah (Satan). permalink parent award report block reply tommy3q 3 points 2 days ago Need to take action before it's too late permalink award report block reply plasma 3 points 2 days ago death squads permalink parent award report block reply MAGALADON9 3 points 2 days ago And yet they are considered \"white\" by many standards including the US Census. Middle Eastern people are considered white - and my anthropological observations are that many are, with some unfortunate sub Saharan admixture depending on where they are from. Reminder ISLAM.IS NOT A RACE. It is a political ideology like communism permalink award report block reply yodayoda 3 points 3 days ago kind of dumb that the elites let them in on purpose, then snicker and eat popcorn 🍿 and watch from the sidelines while muslims and christians then kill each other. TARGET THE ELITES. permalink award report block reply behemoth887 3 points 3 days ago there's a cop right there. his purpose is to watch the muslims kill you if they turn violent and arrest you if you try to act first or successfully defend yourself. permalink award report block reply Buff_cousin_Elroy 3 points 3 days ago We arent going anywhere. I dare these goat fucking pedo lovers to try me. I’ll john wick their faggot ass. permalink award report block reply DenturesNancy 3 points 2 days ago that should be an automatic deportation, no matter their immigration or citizenship status.  you hate your host and the country you escaped to, you have no reasons to stay here. permalink award report block reply YesImWhite 3 points 3 days ago those are fighting words to me tbh. Id \"fear for my life and those around me\" if I heard that permalink award report block reply NonbinaryPotatohead 2 points 3 days ago That is a very large bipedal backstop permalink award report block reply Dev404 2 points 2 days ago Brought to you by feminists. Keep being nice to them, and get more illegals threatening to kill you while the government protects and subsidizes them with your money. permalink award report block reply Aoikaze2000 2 points 3 days ago Time to start throwing raw bacon at them. permalink award report block reply Constitution_1788 2 points 2 days ago Fuck no. We concede ZERO to these ‘things.’ In the process of getting my CCL in dirty Jersey. No tolerance for this. permalink award report block reply Wupta PRO 2 points 3 days ago We’re going to crush these useless eaters. Total parasites. permalink award report block reply harryparatestes 2 points 2 days ago This won't stop until Biblical retribution is visited upon these pedo worshipping scum. permalink award report block reply journalist 2 points 3 days ago Where is this?  What city and state? permalink award report block reply Canadiapede7 2 points 2 days ago Looks exactly how you would expect. permalink award report block reply FreeLemons 2 points 3 days ago I'm waiting for Americans to remember what all those guns are for. permalink award report block reply MasterVader2U 2 points 2 days ago Soon he'll get his ignorant wish and weep to his empty god. permalink award report block reply greatpumpkin 2 points 2 days ago 1860 is rapidly reapproaching. permalink award report block reply Chachiex 2 points 2 days ago Needs to go to hajj and eat some crow permalink award report block reply 5121313 2 points 3 days ago He must spend a fortune in Extra Large black bed sheets.. permalink award report block reply JoinTheDiscussion 2 points 3 days ago let them come at you with a fist and pump them full of lead!! permalink award report block reply Judesama 2 points 3 days ago Says the imbecile that worships a sex slave trading pedo incestuous warmonger deathcult leader. permalink award report block reply Im_RickSteves_bitch 2 points 2 days ago Not “Christian.” “White.” permalink award report block reply ancroidubh 2 points 2 days ago Fuck around and find out. “Come see about me”… permalink award report block reply KennyKetchem 1 points 2 days ago I would not miss an opportunity to end that fuckers life in 2 seconds flat. permalink award report block reply gasemall 1 points 3 days ago Point them to the nearest synagogue.  They identify as white, sometimes. permalink award report block reply Txiribiton 1 points 3 days ago Still best country with Israel. /s permalink award report block reply Easzq8 1 points 3 days ago Why put up the flag at their pagan warren? permalink award report block reply Michalusmichalus 1 points 2 days ago The Bible is a violent book. The Quran said ,\" Hold my beer!\". permalink award report block reply AgnesDomini 1 points 3 days ago What a fucking retard.  Moslems are of every race and color. permalink award report block reply Wildwind 1 points 2 days ago I always carry. 2 weapons at all times. In the truck, another 2. What these goat fuckers are saying is their plans to do just that. Kill as many whites as they can. Plus rape white women and children. permalink award report block reply ChyNahAzzWhole1 1 points 3 days ago Pawn. Who has been poking that fat fuck? permalink award report block reply LORDFALCONE 1 points 3 days ago Where is the full video permalink award report block reply xanaxagoras 0 points 3 days ago In five years, this will be the norm. Who’s going to stop it, the Republican Party? permalink award report block reply GreazyCheeks 3 points 3 days ago The Republicans are in on it. Both sides are bought out and destroying us from within. permalink parent award report block reply\nTheRedPilledArtist 101 points 3 days ago Carry always and always carry... permalink award report block reply Mungo 22 points 3 days ago And practice often. permalink parent award report block reply FusionBlack 4 points 2 days ago People think they can just strap on and go. It took me hours to learn how to draw correctly and consistently in front of a mirror. permalink parent award report block reply Mungo 4 points 2 days ago Agreed. Practice from walking, sitting, in your car, etc. permalink parent award report block reply Wildwind 1 points 2 days ago Of course you practice. Your stupid if you dont train. permalink parent award report block reply\nMungo 22 points 3 days ago And practice often. permalink parent award report block reply FusionBlack 4 points 2 days ago People think they can just strap on and go. It took me hours to learn how to draw correctly and consistently in front of a mirror. permalink parent award report block reply Mungo 4 points 2 days ago Agreed. Practice from walking, sitting, in your car, etc. permalink parent award report block reply Wildwind 1 points 2 days ago Of course you practice. Your stupid if you dont train. permalink parent award report block reply\nFusionBlack 4 points 2 days ago People think they can just strap on and go. It took me hours to learn how to draw correctly and consistently in front of a mirror. permalink parent award report block reply Mungo 4 points 2 days ago Agreed. Practice from walking, sitting, in your car, etc. permalink parent award report block reply Wildwind 1 points 2 days ago Of course you practice. Your stupid if you dont train. permalink parent award report block reply\nMungo 4 points 2 days ago Agreed. Practice from walking, sitting, in your car, etc. permalink parent award report block reply\nWildwind 1 points 2 days ago Of course you practice. Your stupid if you dont train. permalink parent award report block reply\nCleanUpPhillyTrump24 52 points 3 days ago What is he even talking about? Low IQ stuff. permalink award report block reply wilburh09 38 points 3 days ago He’s Probably looking for a fight where he calls a white person a devil piece of shit then sues when he gets punched.  Typical bum permalink parent award report block reply YesImWhite 23 points 3 days ago can't sue when you're dead. Send him to the virgins permalink parent award report block reply schnazzmizzle 17 points 3 days ago Islamic paradise is a lie.  They'll just be burning with the dead pedo Muhammad in hell. permalink parent award report block reply stevethefish76 6 points 3 days ago ...and Dick Cheney. permalink parent award report block reply Remember_the_Alamo 3 points 2 days ago The al zutt men will sodomize the Muslims because that is their culture. permalink parent award report block reply Shih_Tabed 3 points 2 days ago No, just a half truth.  They do get virgins in the afterlife as promised, they just aren't women. permalink parent award report block reply wilburh09 5 points 3 days ago Seems like something we might be doing in the near future . permalink parent award report block reply Washington_Redskins 4 points 3 days ago We could call it the \"OK Stupid\" programming which provides matchmaking between violent Muslims and their future virgin brides. permalink parent award report block reply Leeboscan 3 points 3 days ago Virgins? Are you sure? I pretty sure those goats have been passed around quite a bit. The four-legged floozies. permalink parent award report block reply Klaus73 1 points 2 days ago A shot from about 700 yrds on a battle rifle ensures \"peace\" and doubtful LEO will put in a great effort to find the shooter. permalink parent award report block reply YesImWhite 1 points 2 days ago imma have to upgrade from 5.56 then permalink parent award report block reply Owmyballz 11 points 3 days ago Missing context.  This is taking place at what appears to be a mosque.  Ask yourself why the Muslim is pissed and the cops are at the mosque in the first place. permalink parent award report block reply Moose_Antlers 11 points 3 days ago We've got a loudmouth preacher in the background clearly antagonizing the guy and trying to pick a fight. The cops are already there, more than one car, so this has been going on for a while before this clip. Black dude's clearly Muslim and racist af as well. A lot of them turn to Islam in some sort of search for identity that's not \"white.\" So, they reject Christianity which they see as white in favor of the Religion of Peace death cult. I hate this kind of video because the context matters and we don't get it. It's ragebait and frankly, I'm getting tired of having my emotions jerked around for likes, clicks, fame/notoriety, or to weaponize my emotions for political purposes. I know this is just 4th generation warfare. It's an information war for hearts and minds being fought on a global level. Trump really is trying to win a war against the Deep State... the real one, the global one. That's why we're seeing this, but still, I want people to deal straight with me. I'm tired of being manipulated. permalink parent award report block reply Leeboscan 10 points 3 days ago I really do believe myself that this is why many blacks convert to islam also. Like \"well it came from Africa, so it MUST be meant for our people\". Not realizing that the koran itself speaks of blacks as lesser people. What a sad irony.  Muslims and Arabs are far more racist toward blacks than any white person I've ever observed. They'd spit right on you if they could. You can see it in their eyes. permalink parent award report block reply view 2 more comments... TruthyBrat 6 points 3 days ago A death cult that enslaved blacks and neutered them. If Kunte Kinte had been sent east instead of west, Roots would have been 1 chapter. permalink parent award report block reply bill_in_texas 2 points 2 days ago Prison convert, probably.  The J6'ers noted that the Moslems were HEAVILY recruiting in the D.C. gulag, encouraged by the guards as well.  No wonder the predominantly White, Christian political prisoners there were treated so horribly. A lesson for all....stay far away from any Moslem controlled area. permalink parent award report block reply boataholic 2 points 2 days ago Heaven forbid we antagonize Muslims.  Almost as bad as Trump antagonizing the left with his tweets. permalink parent award report block reply ConstitutionPatriot -1 points 3 days ago AMEN!!! permalink parent award report block reply wilburh09 5 points 3 days ago Huh? Seems racist either way.  What if a white guy is  screaming and fighting with cops while yelling “where is the brown piece of shit?”   He’d be thrown in jail. permalink parent award report block reply Owmyballz 1 points 3 days ago Not in the States, you can call people whatever name or slur you want.  If the fuckers try to lock you up, sue them to penury. permalink parent award report block reply view 4 more comments... Im_RickSteves_bitch 2 points 2 days ago Because the white guys have a right to be there, they have the right to say whatever they want, and he can’t do anything about it. permalink parent award report block reply trumpORbust 2 points 3 days ago Failed to dentonate permalink parent award report block reply Owmyballz 5 points 3 days ago Nah, they use their 12 year old daughters for that.  Source, saw the report on a 12 year old girl used as a suicide bomber in Iraq.  Fucking animals. permalink parent award report block reply Threaper666 4 points 3 days ago Oh, no.  Some brown piece of shit wanting to get revenge on whitie because he feels inferior.  What's new? permalink parent award report block reply gunzby 1 points 2 days ago One way ticket to Suplex City permalink parent award report block reply Hoshi 16 points 3 days ago I feel more stupid after watching this permalink parent award report block reply fskfsk 10 points 3 days ago There was some fight or altercation beforehand that obviously was edited out. This is what Muslims and commies do.  Go around starting fights, film everything.  Then when other people fight back, post an edited out-of-context video that makes the victim look like the aggressor. I.e., this video shows a White person getting hostile towards a Muslim, but it doesn't show what the Muslim did before the video started to get that reaction. permalink parent award report block reply N0rds 1 points 2 days ago Typical antifa tactic. The fascists use this tactic all the time permalink parent award report block reply Dem_slayer 1 points 2 days ago He's muslim... they all are. They are the most inbred humans on the planet. permalink parent award report block reply\nwilburh09 38 points 3 days ago He’s Probably looking for a fight where he calls a white person a devil piece of shit then sues when he gets punched.  Typical bum permalink parent award report block reply YesImWhite 23 points 3 days ago can't sue when you're dead. Send him to the virgins permalink parent award report block reply schnazzmizzle 17 points 3 days ago Islamic paradise is a lie.  They'll just be burning with the dead pedo Muhammad in hell. permalink parent award report block reply stevethefish76 6 points 3 days ago ...and Dick Cheney. permalink parent award report block reply Remember_the_Alamo 3 points 2 days ago The al zutt men will sodomize the Muslims because that is their culture. permalink parent award report block reply Shih_Tabed 3 points 2 days ago No, just a half truth.  They do get virgins in the afterlife as promised, they just aren't women. permalink parent award report block reply wilburh09 5 points 3 days ago Seems like something we might be doing in the near future . permalink parent award report block reply Washington_Redskins 4 points 3 days ago We could call it the \"OK Stupid\" programming which provides matchmaking between violent Muslims and their future virgin brides. permalink parent award report block reply Leeboscan 3 points 3 days ago Virgins? Are you sure? I pretty sure those goats have been passed around quite a bit. The four-legged floozies. permalink parent award report block reply Klaus73 1 points 2 days ago A shot from about 700 yrds on a battle rifle ensures \"peace\" and doubtful LEO will put in a great effort to find the shooter. permalink parent award report block reply YesImWhite 1 points 2 days ago imma have to upgrade from 5.56 then permalink parent award report block reply Owmyballz 11 points 3 days ago Missing context.  This is taking place at what appears to be a mosque.  Ask yourself why the Muslim is pissed and the cops are at the mosque in the first place. permalink parent award report block reply Moose_Antlers 11 points 3 days ago We've got a loudmouth preacher in the background clearly antagonizing the guy and trying to pick a fight. The cops are already there, more than one car, so this has been going on for a while before this clip. Black dude's clearly Muslim and racist af as well. A lot of them turn to Islam in some sort of search for identity that's not \"white.\" So, they reject Christianity which they see as white in favor of the Religion of Peace death cult. I hate this kind of video because the context matters and we don't get it. It's ragebait and frankly, I'm getting tired of having my emotions jerked around for likes, clicks, fame/notoriety, or to weaponize my emotions for political purposes. I know this is just 4th generation warfare. It's an information war for hearts and minds being fought on a global level. Trump really is trying to win a war against the Deep State... the real one, the global one. That's why we're seeing this, but still, I want people to deal straight with me. I'm tired of being manipulated. permalink parent award report block reply Leeboscan 10 points 3 days ago I really do believe myself that this is why many blacks convert to islam also. Like \"well it came from Africa, so it MUST be meant for our people\". Not realizing that the koran itself speaks of blacks as lesser people. What a sad irony.  Muslims and Arabs are far more racist toward blacks than any white person I've ever observed. They'd spit right on you if they could. You can see it in their eyes. permalink parent award report block reply view 2 more comments... TruthyBrat 6 points 3 days ago A death cult that enslaved blacks and neutered them. If Kunte Kinte had been sent east instead of west, Roots would have been 1 chapter. permalink parent award report block reply bill_in_texas 2 points 2 days ago Prison convert, probably.  The J6'ers noted that the Moslems were HEAVILY recruiting in the D.C. gulag, encouraged by the guards as well.  No wonder the predominantly White, Christian political prisoners there were treated so horribly. A lesson for all....stay far away from any Moslem controlled area. permalink parent award report block reply boataholic 2 points 2 days ago Heaven forbid we antagonize Muslims.  Almost as bad as Trump antagonizing the left with his tweets. permalink parent award report block reply ConstitutionPatriot -1 points 3 days ago AMEN!!! permalink parent award report block reply wilburh09 5 points 3 days ago Huh? Seems racist either way.  What if a white guy is  screaming and fighting with cops while yelling “where is the brown piece of shit?”   He’d be thrown in jail. permalink parent award report block reply Owmyballz 1 points 3 days ago Not in the States, you can call people whatever name or slur you want.  If the fuckers try to lock you up, sue them to penury. permalink parent award report block reply view 4 more comments... Im_RickSteves_bitch 2 points 2 days ago Because the white guys have a right to be there, they have the right to say whatever they want, and he can’t do anything about it. permalink parent award report block reply trumpORbust 2 points 3 days ago Failed to dentonate permalink parent award report block reply Owmyballz 5 points 3 days ago Nah, they use their 12 year old daughters for that.  Source, saw the report on a 12 year old girl used as a suicide bomber in Iraq.  Fucking animals. permalink parent award report block reply Threaper666 4 points 3 days ago Oh, no.  Some brown piece of shit wanting to get revenge on whitie because he feels inferior.  What's new? permalink parent award report block reply gunzby 1 points 2 days ago One way ticket to Suplex City permalink parent award report block reply\nYesImWhite 23 points 3 days ago can't sue when you're dead. Send him to the virgins permalink parent award report block reply schnazzmizzle 17 points 3 days ago Islamic paradise is a lie.  They'll just be burning with the dead pedo Muhammad in hell. permalink parent award report block reply stevethefish76 6 points 3 days ago ...and Dick Cheney. permalink parent award report block reply Remember_the_Alamo 3 points 2 days ago The al zutt men will sodomize the Muslims because that is their culture. permalink parent award report block reply Shih_Tabed 3 points 2 days ago No, just a half truth.  They do get virgins in the afterlife as promised, they just aren't women. permalink parent award report block reply wilburh09 5 points 3 days ago Seems like something we might be doing in the near future . permalink parent award report block reply Washington_Redskins 4 points 3 days ago We could call it the \"OK Stupid\" programming which provides matchmaking between violent Muslims and their future virgin brides. permalink parent award report block reply Leeboscan 3 points 3 days ago Virgins? Are you sure? I pretty sure those goats have been passed around quite a bit. The four-legged floozies. permalink parent award report block reply Klaus73 1 points 2 days ago A shot from about 700 yrds on a battle rifle ensures \"peace\" and doubtful LEO will put in a great effort to find the shooter. permalink parent award report block reply YesImWhite 1 points 2 days ago imma have to upgrade from 5.56 then permalink parent award report block reply\nschnazzmizzle 17 points 3 days ago Islamic paradise is a lie.  They'll just be burning with the dead pedo Muhammad in hell. permalink parent award report block reply stevethefish76 6 points 3 days ago ...and Dick Cheney. permalink parent award report block reply Remember_the_Alamo 3 points 2 days ago The al zutt men will sodomize the Muslims because that is their culture. permalink parent award report block reply Shih_Tabed 3 points 2 days ago No, just a half truth.  They do get virgins in the afterlife as promised, they just aren't women. permalink parent award report block reply\nstevethefish76 6 points 3 days ago ...and Dick Cheney. permalink parent award report block reply\nRemember_the_Alamo 3 points 2 days ago The al zutt men will sodomize the Muslims because that is their culture. permalink parent award report block reply\nShih_Tabed 3 points 2 days ago No, just a half truth.  They do get virgins in the afterlife as promised, they just aren't women. permalink parent award report block reply\nwilburh09 5 points 3 days ago Seems like something we might be doing in the near future . permalink parent award report block reply Washington_Redskins 4 points 3 days ago We could call it the \"OK Stupid\" programming which provides matchmaking between violent Muslims and their future virgin brides. permalink parent award report block reply\nWashington_Redskins 4 points 3 days ago We could call it the \"OK Stupid\" programming which provides matchmaking between violent Muslims and their future virgin brides. permalink parent award report block reply\nLeeboscan 3 points 3 days ago Virgins? Are you sure? I pretty sure those goats have been passed around quite a bit. The four-legged floozies. permalink parent award report block reply\nKlaus73 1 points 2 days ago A shot from about 700 yrds on a battle rifle ensures \"peace\" and doubtful LEO will put in a great effort to find the shooter. permalink parent award report block reply YesImWhite 1 points 2 days ago imma have to upgrade from 5.56 then permalink parent award report block reply\nYesImWhite 1 points 2 days ago imma have to upgrade from 5.56 then permalink parent award report block reply\nOwmyballz 11 points 3 days ago Missing context.  This is taking place at what appears to be a mosque.  Ask yourself why the Muslim is pissed and the cops are at the mosque in the first place. permalink parent award report block reply Moose_Antlers 11 points 3 days ago We've got a loudmouth preacher in the background clearly antagonizing the guy and trying to pick a fight. The cops are already there, more than one car, so this has been going on for a while before this clip. Black dude's clearly Muslim and racist af as well. A lot of them turn to Islam in some sort of search for identity that's not \"white.\" So, they reject Christianity which they see as white in favor of the Religion of Peace death cult. I hate this kind of video because the context matters and we don't get it. It's ragebait and frankly, I'm getting tired of having my emotions jerked around for likes, clicks, fame/notoriety, or to weaponize my emotions for political purposes. I know this is just 4th generation warfare. It's an information war for hearts and minds being fought on a global level. Trump really is trying to win a war against the Deep State... the real one, the global one. That's why we're seeing this, but still, I want people to deal straight with me. I'm tired of being manipulated. permalink parent award report block reply Leeboscan 10 points 3 days ago I really do believe myself that this is why many blacks convert to islam also. Like \"well it came from Africa, so it MUST be meant for our people\". Not realizing that the koran itself speaks of blacks as lesser people. What a sad irony.  Muslims and Arabs are far more racist toward blacks than any white person I've ever observed. They'd spit right on you if they could. You can see it in their eyes. permalink parent award report block reply view 2 more comments... TruthyBrat 6 points 3 days ago A death cult that enslaved blacks and neutered them. If Kunte Kinte had been sent east instead of west, Roots would have been 1 chapter. permalink parent award report block reply bill_in_texas 2 points 2 days ago Prison convert, probably.  The J6'ers noted that the Moslems were HEAVILY recruiting in the D.C. gulag, encouraged by the guards as well.  No wonder the predominantly White, Christian political prisoners there were treated so horribly. A lesson for all....stay far away from any Moslem controlled area. permalink parent award report block reply boataholic 2 points 2 days ago Heaven forbid we antagonize Muslims.  Almost as bad as Trump antagonizing the left with his tweets. permalink parent award report block reply ConstitutionPatriot -1 points 3 days ago AMEN!!! permalink parent award report block reply wilburh09 5 points 3 days ago Huh? Seems racist either way.  What if a white guy is  screaming and fighting with cops while yelling “where is the brown piece of shit?”   He’d be thrown in jail. permalink parent award report block reply Owmyballz 1 points 3 days ago Not in the States, you can call people whatever name or slur you want.  If the fuckers try to lock you up, sue them to penury. permalink parent award report block reply view 4 more comments... Im_RickSteves_bitch 2 points 2 days ago Because the white guys have a right to be there, they have the right to say whatever they want, and he can’t do anything about it. permalink parent award report block reply trumpORbust 2 points 3 days ago Failed to dentonate permalink parent award report block reply Owmyballz 5 points 3 days ago Nah, they use their 12 year old daughters for that.  Source, saw the report on a 12 year old girl used as a suicide bomber in Iraq.  Fucking animals. permalink parent award report block reply\nMoose_Antlers 11 points 3 days ago We've got a loudmouth preacher in the background clearly antagonizing the guy and trying to pick a fight. The cops are already there, more than one car, so this has been going on for a while before this clip. Black dude's clearly Muslim and racist af as well. A lot of them turn to Islam in some sort of search for identity that's not \"white.\" So, they reject Christianity which they see as white in favor of the Religion of Peace death cult. I hate this kind of video because the context matters and we don't get it. It's ragebait and frankly, I'm getting tired of having my emotions jerked around for likes, clicks, fame/notoriety, or to weaponize my emotions for political purposes. I know this is just 4th generation warfare. It's an information war for hearts and minds being fought on a global level. Trump really is trying to win a war against the Deep State... the real one, the global one. That's why we're seeing this, but still, I want people to deal straight with me. I'm tired of being manipulated. permalink parent award report block reply Leeboscan 10 points 3 days ago I really do believe myself that this is why many blacks convert to islam also. Like \"well it came from Africa, so it MUST be meant for our people\". Not realizing that the koran itself speaks of blacks as lesser people. What a sad irony.  Muslims and Arabs are far more racist toward blacks than any white person I've ever observed. They'd spit right on you if they could. You can see it in their eyes. permalink parent award report block reply view 2 more comments... TruthyBrat 6 points 3 days ago A death cult that enslaved blacks and neutered them. If Kunte Kinte had been sent east instead of west, Roots would have been 1 chapter. permalink parent award report block reply bill_in_texas 2 points 2 days ago Prison convert, probably.  The J6'ers noted that the Moslems were HEAVILY recruiting in the D.C. gulag, encouraged by the guards as well.  No wonder the predominantly White, Christian political prisoners there were treated so horribly. A lesson for all....stay far away from any Moslem controlled area. permalink parent award report block reply boataholic 2 points 2 days ago Heaven forbid we antagonize Muslims.  Almost as bad as Trump antagonizing the left with his tweets. permalink parent award report block reply ConstitutionPatriot -1 points 3 days ago AMEN!!! permalink parent award report block reply\nLeeboscan 10 points 3 days ago I really do believe myself that this is why many blacks convert to islam also. Like \"well it came from Africa, so it MUST be meant for our people\". Not realizing that the koran itself speaks of blacks as lesser people. What a sad irony.  Muslims and Arabs are far more racist toward blacks than any white person I've ever observed. They'd spit right on you if they could. You can see it in their eyes. permalink parent award report block reply view 2 more comments...\nTruthyBrat 6 points 3 days ago A death cult that enslaved blacks and neutered them. If Kunte Kinte had been sent east instead of west, Roots would have been 1 chapter. permalink parent award report block reply\nbill_in_texas 2 points 2 days ago Prison convert, probably.  The J6'ers noted that the Moslems were HEAVILY recruiting in the D.C. gulag, encouraged by the guards as well.  No wonder the predominantly White, Christian political prisoners there were treated so horribly. A lesson for all....stay far away from any Moslem controlled area. permalink parent award report block reply\nboataholic 2 points 2 days ago Heaven forbid we antagonize Muslims.  Almost as bad as Trump antagonizing the left with his tweets. permalink parent award report block reply\nConstitutionPatriot -1 points 3 days ago AMEN!!! permalink parent award report block reply\nwilburh09 5 points 3 days ago Huh? Seems racist either way.  What if a white guy is  screaming and fighting with cops while yelling “where is the brown piece of shit?”   He’d be thrown in jail. permalink parent award report block reply Owmyballz 1 points 3 days ago Not in the States, you can call people whatever name or slur you want.  If the fuckers try to lock you up, sue them to penury. permalink parent award report block reply view 4 more comments...\nOwmyballz 1 points 3 days ago Not in the States, you can call people whatever name or slur you want.  If the fuckers try to lock you up, sue them to penury. permalink parent award report block reply view 4 more comments...\nIm_RickSteves_bitch 2 points 2 days ago Because the white guys have a right to be there, they have the right to say whatever they want, and he can’t do anything about it. permalink parent award report block reply\ntrumpORbust 2 points 3 days ago Failed to dentonate permalink parent award report block reply Owmyballz 5 points 3 days ago Nah, they use their 12 year old daughters for that.  Source, saw the report on a 12 year old girl used as a suicide bomber in Iraq.  Fucking animals. permalink parent award report block reply\nOwmyballz 5 points 3 days ago Nah, they use their 12 year old daughters for that.  Source, saw the report on a 12 year old girl used as a suicide bomber in Iraq.  Fucking animals. permalink parent award report block reply\nThreaper666 4 points 3 days ago Oh, no.  Some brown piece of shit wanting to get revenge on whitie because he feels inferior.  What's new? permalink parent award report block reply\ngunzby 1 points 2 days ago One way ticket to Suplex City permalink parent award report block reply\nHoshi 16 points 3 days ago I feel more stupid after watching this permalink parent award report block reply\nfskfsk 10 points 3 days ago There was some fight or altercation beforehand that obviously was edited out. This is what Muslims and commies do.  Go around starting fights, film everything.  Then when other people fight back, post an edited out-of-context video that makes the victim look like the aggressor. I.e., this video shows a White person getting hostile towards a Muslim, but it doesn't show what the Muslim did before the video started to get that reaction. permalink parent award report block reply N0rds 1 points 2 days ago Typical antifa tactic. The fascists use this tactic all the time permalink parent award report block reply\nN0rds 1 points 2 days ago Typical antifa tactic. The fascists use this tactic all the time permalink parent award report block reply\nDem_slayer 1 points 2 days ago He's muslim... they all are. They are the most inbred humans on the planet. permalink parent award report block reply\nGdotLee 30 points 3 days ago IM RIGHT HERE GOAT FUCKER permalink award report block reply cuckerberg2020 9 points 3 days ago Came here to say this permalink parent award report block reply\ncuckerberg2020 9 points 3 days ago Came here to say this permalink parent award report block reply\nCounterStrike 27 points 3 days ago Where? permalink award report block reply TwoArizonaPedes 25 points 3 days ago Illinois. permalink parent award report block reply Moose_Antlers 8 points 3 days ago Where, in Illinois? permalink parent award report block reply\nTwoArizonaPedes 25 points 3 days ago Illinois. permalink parent award report block reply Moose_Antlers 8 points 3 days ago Where, in Illinois? permalink parent award report block reply\nMoose_Antlers 8 points 3 days ago Where, in Illinois? permalink parent award report block reply\nViewer01 19 points 3 days ago When the last boomer dies Gen z is going to absolutely uncoil on anyone and everyone. permalink award report block reply MediaBro 10 points 3 days ago Gonna be too late by then. I'm seeing the demographics and I think this ends with global annihilation for everyone. permalink parent award report block reply fskfsk 5 points 3 days ago That would be the disaster from which humanity might never recover, if Muslims wound up conquering the world.  On the other hand, if there was a Muslim takeover, eventually there would be collapse of civilization and transport, a massive die-off, and some areas might evolve civilization again. permalink parent award report block reply MediaBro 5 points 3 days ago Your world leaders are clearly on their side. They're investing billions in Saudi Arabia's vanity projects. Millions of working class Brits, Aussies, Kiwis and Americans have made their homes in Saudi Arabia, UAE, Oman, Qatar and Bahrain for decades now. If you're wondering why there are millions of Indians and Muslims with money showing up in your homelands, these places are all tax-free on income and they let you make as much money as possible and they're fully protected by the US and UK military. And they're expanding their protection. Saudis just made a deal with the Pakistanis to protect them militarily. Everyone is extremely connected in this globalised world. permalink parent award report block reply fskfsk 4 points 3 days ago Of course the Deep State is on their side.  That's why they opened the doors to the invaders. The Deep State leaders look at commies (China) and Islam and say \"We wish we had that kind of control and power in the USA.  It would be so much easier to rule if we could just kill anyone we didn't like or send them to death camps!\" They see Islam and China not as \"cautionary tale\" but as \"role model to be followed\". That's how Indonesia got conquered by Islam.  The local leaders in Indonesia decided that Islam let them control their population/slaves better, so they intentionally converted. permalink parent award report block reply view 2 more comments... Wildwind 2 points 2 days ago Let them. Sooner or later these stupid millionaires are going to lose their heads. After they watch their wives and children  raped and killed. permalink parent award report block reply view 1 more comments... FutureFreemason 2 points 2 days ago Problem for them is, that they dont have capacity to out think, plan or coordinate against us. We could be out numbered 5:1 and survive permalink parent award report block reply MediaBro 1 points 2 days ago We'll see. Your quislings have long ago made plans with these ppl. You're a little too late to the party. But hey, best of luck. We're all going to need it. permalink parent award report block reply GaNative52 2 points 3 days ago I’m a boomer and I’d like to stay around long enough to see that! permalink parent award report block reply Oldjeansandbelt -1 points 2 days ago No they won’t try hard Rambo, it would happened by now permalink parent award report block reply\nMediaBro 10 points 3 days ago Gonna be too late by then. I'm seeing the demographics and I think this ends with global annihilation for everyone. permalink parent award report block reply fskfsk 5 points 3 days ago That would be the disaster from which humanity might never recover, if Muslims wound up conquering the world.  On the other hand, if there was a Muslim takeover, eventually there would be collapse of civilization and transport, a massive die-off, and some areas might evolve civilization again. permalink parent award report block reply MediaBro 5 points 3 days ago Your world leaders are clearly on their side. They're investing billions in Saudi Arabia's vanity projects. Millions of working class Brits, Aussies, Kiwis and Americans have made their homes in Saudi Arabia, UAE, Oman, Qatar and Bahrain for decades now. If you're wondering why there are millions of Indians and Muslims with money showing up in your homelands, these places are all tax-free on income and they let you make as much money as possible and they're fully protected by the US and UK military. And they're expanding their protection. Saudis just made a deal with the Pakistanis to protect them militarily. Everyone is extremely connected in this globalised world. permalink parent award report block reply fskfsk 4 points 3 days ago Of course the Deep State is on their side.  That's why they opened the doors to the invaders. The Deep State leaders look at commies (China) and Islam and say \"We wish we had that kind of control and power in the USA.  It would be so much easier to rule if we could just kill anyone we didn't like or send them to death camps!\" They see Islam and China not as \"cautionary tale\" but as \"role model to be followed\". That's how Indonesia got conquered by Islam.  The local leaders in Indonesia decided that Islam let them control their population/slaves better, so they intentionally converted. permalink parent award report block reply view 2 more comments... Wildwind 2 points 2 days ago Let them. Sooner or later these stupid millionaires are going to lose their heads. After they watch their wives and children  raped and killed. permalink parent award report block reply view 1 more comments... FutureFreemason 2 points 2 days ago Problem for them is, that they dont have capacity to out think, plan or coordinate against us. We could be out numbered 5:1 and survive permalink parent award report block reply MediaBro 1 points 2 days ago We'll see. Your quislings have long ago made plans with these ppl. You're a little too late to the party. But hey, best of luck. We're all going to need it. permalink parent award report block reply\nfskfsk 5 points 3 days ago That would be the disaster from which humanity might never recover, if Muslims wound up conquering the world.  On the other hand, if there was a Muslim takeover, eventually there would be collapse of civilization and transport, a massive die-off, and some areas might evolve civilization again. permalink parent award report block reply MediaBro 5 points 3 days ago Your world leaders are clearly on their side. They're investing billions in Saudi Arabia's vanity projects. Millions of working class Brits, Aussies, Kiwis and Americans have made their homes in Saudi Arabia, UAE, Oman, Qatar and Bahrain for decades now. If you're wondering why there are millions of Indians and Muslims with money showing up in your homelands, these places are all tax-free on income and they let you make as much money as possible and they're fully protected by the US and UK military. And they're expanding their protection. Saudis just made a deal with the Pakistanis to protect them militarily. Everyone is extremely connected in this globalised world. permalink parent award report block reply fskfsk 4 points 3 days ago Of course the Deep State is on their side.  That's why they opened the doors to the invaders. The Deep State leaders look at commies (China) and Islam and say \"We wish we had that kind of control and power in the USA.  It would be so much easier to rule if we could just kill anyone we didn't like or send them to death camps!\" They see Islam and China not as \"cautionary tale\" but as \"role model to be followed\". That's how Indonesia got conquered by Islam.  The local leaders in Indonesia decided that Islam let them control their population/slaves better, so they intentionally converted. permalink parent award report block reply view 2 more comments... Wildwind 2 points 2 days ago Let them. Sooner or later these stupid millionaires are going to lose their heads. After they watch their wives and children  raped and killed. permalink parent award report block reply view 1 more comments...\nMediaBro 5 points 3 days ago Your world leaders are clearly on their side. They're investing billions in Saudi Arabia's vanity projects. Millions of working class Brits, Aussies, Kiwis and Americans have made their homes in Saudi Arabia, UAE, Oman, Qatar and Bahrain for decades now. If you're wondering why there are millions of Indians and Muslims with money showing up in your homelands, these places are all tax-free on income and they let you make as much money as possible and they're fully protected by the US and UK military. And they're expanding their protection. Saudis just made a deal with the Pakistanis to protect them militarily. Everyone is extremely connected in this globalised world. permalink parent award report block reply fskfsk 4 points 3 days ago Of course the Deep State is on their side.  That's why they opened the doors to the invaders. The Deep State leaders look at commies (China) and Islam and say \"We wish we had that kind of control and power in the USA.  It would be so much easier to rule if we could just kill anyone we didn't like or send them to death camps!\" They see Islam and China not as \"cautionary tale\" but as \"role model to be followed\". That's how Indonesia got conquered by Islam.  The local leaders in Indonesia decided that Islam let them control their population/slaves better, so they intentionally converted. permalink parent award report block reply view 2 more comments... Wildwind 2 points 2 days ago Let them. Sooner or later these stupid millionaires are going to lose their heads. After they watch their wives and children  raped and killed. permalink parent award report block reply view 1 more comments...\nfskfsk 4 points 3 days ago Of course the Deep State is on their side.  That's why they opened the doors to the invaders. The Deep State leaders look at commies (China) and Islam and say \"We wish we had that kind of control and power in the USA.  It would be so much easier to rule if we could just kill anyone we didn't like or send them to death camps!\" They see Islam and China not as \"cautionary tale\" but as \"role model to be followed\". That's how Indonesia got conquered by Islam.  The local leaders in Indonesia decided that Islam let them control their population/slaves better, so they intentionally converted. permalink parent award report block reply view 2 more comments...\nWildwind 2 points 2 days ago Let them. Sooner or later these stupid millionaires are going to lose their heads. After they watch their wives and children  raped and killed. permalink parent award report block reply view 1 more comments...\nFutureFreemason 2 points 2 days ago Problem for them is, that they dont have capacity to out think, plan or coordinate against us. We could be out numbered 5:1 and survive permalink parent award report block reply MediaBro 1 points 2 days ago We'll see. Your quislings have long ago made plans with these ppl. You're a little too late to the party. But hey, best of luck. We're all going to need it. permalink parent award report block reply\nMediaBro 1 points 2 days ago We'll see. Your quislings have long ago made plans with these ppl. You're a little too late to the party. But hey, best of luck. We're all going to need it. permalink parent award report block reply\nGaNative52 2 points 3 days ago I’m a boomer and I’d like to stay around long enough to see that! permalink parent award report block reply\nOldjeansandbelt -1 points 2 days ago No they won’t try hard Rambo, it would happened by now permalink parent award report block reply\nprojectarcturus1 17 points 3 days ago These 40-50 iq animals need to be deported. permalink award report block reply ConfusedAngryArmed 10 points 3 days ago Nah, I'd rather we do the world a favor and kill them all. permalink parent award report block reply Beardholder 3 points 2 days ago My English is a bit off. By deported for the Muslims does this mean to execute and put in the ground? Because all who worship a false prophet who was an open pedophile and murderer does deserve to be eliminated from earth. permalink parent award report block reply\nConfusedAngryArmed 10 points 3 days ago Nah, I'd rather we do the world a favor and kill them all. permalink parent award report block reply\nBeardholder 3 points 2 days ago My English is a bit off. By deported for the Muslims does this mean to execute and put in the ground? Because all who worship a false prophet who was an open pedophile and murderer does deserve to be eliminated from earth. permalink parent award report block reply\nBeelzy 16 points 3 days ago \"I've been waiting for this\"...what a coincidence. I've already had fun with the goat fuckers. They HATE being called that btw. permalink award report block reply ConfusedAngryArmed 7 points 3 days ago They hate it because it's true. Veteran with a Sign has a story about this while in Afghanistan. permalink parent award report block reply\nConfusedAngryArmed 7 points 3 days ago They hate it because it's true. Veteran with a Sign has a story about this while in Afghanistan. permalink parent award report block reply\nHanging_Chad 13 points 3 days ago deport permalink award report block reply The_Bloofy_Bullshark 13 points 3 days ago Cleanse* permalink parent award report block reply ConfusedAngryArmed 9 points 3 days ago Impale permalink parent award report block reply rebuildingMyself 2 points 2 days ago That's the peaceful option permalink parent award report block reply\nThe_Bloofy_Bullshark 13 points 3 days ago Cleanse* permalink parent award report block reply\nConfusedAngryArmed 9 points 3 days ago Impale permalink parent award report block reply\nrebuildingMyself 2 points 2 days ago That's the peaceful option permalink parent award report block reply\nSweets 12 points 3 days ago When are we going to start the 5th crusades? permalink award report block reply TwoArizonaPedes 13 points 3 days ago We're already fighting. It begins by getting together a group of like-minded patriots. Start with your church and your friends and grow from there. Set up a phone tree. Use burner phones. Don't text. Organize, coordinate, think, be creative! You already know how to respond to their street-blocking \"prayers.\" Pick a name or organization and get involved. permalink parent award report block reply\nTwoArizonaPedes 13 points 3 days ago We're already fighting. It begins by getting together a group of like-minded patriots. Start with your church and your friends and grow from there. Set up a phone tree. Use burner phones. Don't text. Organize, coordinate, think, be creative! You already know how to respond to their street-blocking \"prayers.\" Pick a name or organization and get involved. permalink parent award report block reply\nThan0sIII 11 points 3 days ago Oh so that's why sand is put in front of the N word for them.  Same shit, different region. permalink award report block reply ConfusedAngryArmed 5 points 3 days ago Dune coons. permalink parent award report block reply\nConfusedAngryArmed 5 points 3 days ago Dune coons. permalink parent award report block reply\nHoganT 11 points 3 days ago Literally antagonizing people and then criticizing them for responding. permalink award report block reply KekistanPM 22 points 3 days ago They strike you as they cry out in pain. permalink parent award report block reply MediaBro 8 points 3 days ago Think Jews but somehow worse. Somehow even worse than Jeets. permalink parent award report block reply HoganT -4 points 3 days ago We’re the ones crying out in pain after antagonizing here. permalink parent award report block reply Herpawinski 3 points 3 days ago Yes that's their strategy. That was one of the purposes of terrorism. To piss everyone off, then antagonize further by playing the victim when people didn't like getting murdered, then play the victim over people not liking being antagonized. The shitty behavior is called \"dawa\". They say it's just proselytizing but it's also antagonizing, then attacking people for sticking their necks out to complain about it. permalink parent award report block reply\nKekistanPM 22 points 3 days ago They strike you as they cry out in pain. permalink parent award report block reply MediaBro 8 points 3 days ago Think Jews but somehow worse. Somehow even worse than Jeets. permalink parent award report block reply HoganT -4 points 3 days ago We’re the ones crying out in pain after antagonizing here. permalink parent award report block reply\nMediaBro 8 points 3 days ago Think Jews but somehow worse. Somehow even worse than Jeets. permalink parent award report block reply\nHoganT -4 points 3 days ago We’re the ones crying out in pain after antagonizing here. permalink parent award report block reply\nHerpawinski 3 points 3 days ago Yes that's their strategy. That was one of the purposes of terrorism. To piss everyone off, then antagonize further by playing the victim when people didn't like getting murdered, then play the victim over people not liking being antagonized. The shitty behavior is called \"dawa\". They say it's just proselytizing but it's also antagonizing, then attacking people for sticking their necks out to complain about it. permalink parent award report block reply\nHerpawinski 7 points 3 days ago This is the real war. While Al Quada was distracting us with terrorism in worthless shitholes, their bosses, the muslim brotherhood, funneled muslims into our nation, just like they did to Europe. permalink award report block reply impera 5 points 3 days ago I distinctly remember a 'we are fighting them over there so we dont have to fight them over here' line of messaging. And wasn't that just a fucking lie, between then and now millions of hostile terrorists have been imported. permalink parent award report block reply Herpawinski 5 points 3 days ago Yes. The truth is they goaded us to fight them over there, so they could invade us here. permalink parent award report block reply Glory-Unto-God 2 points 2 days ago They have been feeding that same line up until recently about helping israel lmfao permalink parent award report block reply\nimpera 5 points 3 days ago I distinctly remember a 'we are fighting them over there so we dont have to fight them over here' line of messaging. And wasn't that just a fucking lie, between then and now millions of hostile terrorists have been imported. permalink parent award report block reply Herpawinski 5 points 3 days ago Yes. The truth is they goaded us to fight them over there, so they could invade us here. permalink parent award report block reply Glory-Unto-God 2 points 2 days ago They have been feeding that same line up until recently about helping israel lmfao permalink parent award report block reply\nHerpawinski 5 points 3 days ago Yes. The truth is they goaded us to fight them over there, so they could invade us here. permalink parent award report block reply\nGlory-Unto-God 2 points 2 days ago They have been feeding that same line up until recently about helping israel lmfao permalink parent award report block reply\nMADASHELLNEWS 7 points 3 days ago It's almost time to play cowboys and towel heads permalink award report block reply\nyou_know_GOAT 6 points 3 days ago Right here. Come and try me. permalink award report block reply cuckerberg2020 3 points 3 days ago I’d say username checks out but I don’t want to you get raped by the goat fuckers permalink parent award report block reply\ncuckerberg2020 3 points 3 days ago I’d say username checks out but I don’t want to you get raped by the goat fuckers permalink parent award report block reply\nFormerlurker92 6 points 3 days ago They only talk like this cause we aren't fighting yet. When we start it will just be a thousand variations of \"have mercy\" that will fall on deaf ears permalink award report block reply\nsmedleybutleracolite 5 points 3 days ago I'm your Huckleberry permalink award report block reply\nTrumpluv77 4 points 3 days ago Man.....I never dreamt of having to use my gun, but IF...I had to... these would be the ones... permalink award report block reply\nceesco2020 4 points 3 days ago Just fucking kill these things. permalink award report block reply\nDCYR66 4 points 2 days ago Let these sandnigs find some lead in their asses next. permalink award report block reply\nApersonofinterest 4 points 3 days ago Looks like the signal has been given for all of the sleeper cells and radicals Biden smuggled into the country and set up around the nation with free stuff and probably weapons to activate. permalink award report block reply fskfsk 3 points 3 days ago No, the sleeper cells have been given the signal to stay quiet because Great Replacement is such a winning strategy. These are Muslims that are so undisciplined that they're violent anyway. permalink parent award report block reply SanityGumby 1 points 3 days ago Comes with a sub 70 iq permalink parent award report block reply fskfsk 1 points 3 days ago Sub 70 iq, plus a religion that says violence is demanded by Allah (Satan). permalink parent award report block reply\nfskfsk 3 points 3 days ago No, the sleeper cells have been given the signal to stay quiet because Great Replacement is such a winning strategy. These are Muslims that are so undisciplined that they're violent anyway. permalink parent award report block reply SanityGumby 1 points 3 days ago Comes with a sub 70 iq permalink parent award report block reply fskfsk 1 points 3 days ago Sub 70 iq, plus a religion that says violence is demanded by Allah (Satan). permalink parent award report block reply\nSanityGumby 1 points 3 days ago Comes with a sub 70 iq permalink parent award report block reply fskfsk 1 points 3 days ago Sub 70 iq, plus a religion that says violence is demanded by Allah (Satan). permalink parent award report block reply\nfskfsk 1 points 3 days ago Sub 70 iq, plus a religion that says violence is demanded by Allah (Satan). permalink parent award report block reply\ntommy3q 3 points 2 days ago Need to take action before it's too late permalink award report block reply plasma 3 points 2 days ago death squads permalink parent award report block reply\nplasma 3 points 2 days ago death squads permalink parent award report block reply\nMAGALADON9 3 points 2 days ago And yet they are considered \"white\" by many standards including the US Census. Middle Eastern people are considered white - and my anthropological observations are that many are, with some unfortunate sub Saharan admixture depending on where they are from. Reminder ISLAM.IS NOT A RACE. It is a political ideology like communism permalink award report block reply\nyodayoda 3 points 3 days ago kind of dumb that the elites let them in on purpose, then snicker and eat popcorn 🍿 and watch from the sidelines while muslims and christians then kill each other. TARGET THE ELITES. permalink award report block reply\nbehemoth887 3 points 3 days ago there's a cop right there. his purpose is to watch the muslims kill you if they turn violent and arrest you if you try to act first or successfully defend yourself. permalink award report block reply\nBuff_cousin_Elroy 3 points 3 days ago We arent going anywhere. I dare these goat fucking pedo lovers to try me. I’ll john wick their faggot ass. permalink award report block reply\nDenturesNancy 3 points 2 days ago that should be an automatic deportation, no matter their immigration or citizenship status.  you hate your host and the country you escaped to, you have no reasons to stay here. permalink award report block reply\nYesImWhite 3 points 3 days ago those are fighting words to me tbh. Id \"fear for my life and those around me\" if I heard that permalink award report block reply\nNonbinaryPotatohead 2 points 3 days ago That is a very large bipedal backstop permalink award report block reply\nDev404 2 points 2 days ago Brought to you by feminists. Keep being nice to them, and get more illegals threatening to kill you while the government protects and subsidizes them with your money. permalink award report block reply\nAoikaze2000 2 points 3 days ago Time to start throwing raw bacon at them. permalink award report block reply\nConstitution_1788 2 points 2 days ago Fuck no. We concede ZERO to these ‘things.’ In the process of getting my CCL in dirty Jersey. No tolerance for this. permalink award report block reply\nWupta PRO 2 points 3 days ago We’re going to crush these useless eaters. Total parasites. permalink award report block reply\nharryparatestes 2 points 2 days ago This won't stop until Biblical retribution is visited upon these pedo worshipping scum. permalink award report block reply\njournalist 2 points 3 days ago Where is this?  What city and state? permalink award report block reply\nCanadiapede7 2 points 2 days ago Looks exactly how you would expect. permalink award report block reply\nFreeLemons 2 points 3 days ago I'm waiting for Americans to remember what all those guns are for. permalink award report block reply\nMasterVader2U 2 points 2 days ago Soon he'll get his ignorant wish and weep to his empty god. permalink award report block reply\ngreatpumpkin 2 points 2 days ago 1860 is rapidly reapproaching. permalink award report block reply\nChachiex 2 points 2 days ago Needs to go to hajj and eat some crow permalink award report block reply\n5121313 2 points 3 days ago He must spend a fortune in Extra Large black bed sheets.. permalink award report block reply\nJoinTheDiscussion 2 points 3 days ago let them come at you with a fist and pump them full of lead!! permalink award report block reply\nJudesama 2 points 3 days ago Says the imbecile that worships a sex slave trading pedo incestuous warmonger deathcult leader. permalink award report block reply\nIm_RickSteves_bitch 2 points 2 days ago Not “Christian.” “White.” permalink award report block reply\nancroidubh 2 points 2 days ago Fuck around and find out. “Come see about me”… permalink award report block reply\nKennyKetchem 1 points 2 days ago I would not miss an opportunity to end that fuckers life in 2 seconds flat. permalink award report block reply\ngasemall 1 points 3 days ago Point them to the nearest synagogue.  They identify as white, sometimes. permalink award report block reply\nTxiribiton 1 points 3 days ago Still best country with Israel. /s permalink award report block reply\nEaszq8 1 points 3 days ago Why put up the flag at their pagan warren? permalink award report block reply\nMichalusmichalus 1 points 2 days ago The Bible is a violent book. The Quran said ,\" Hold my beer!\". permalink award report block reply\nAgnesDomini 1 points 3 days ago What a fucking retard.  Moslems are of every race and color. permalink award report block reply\nWildwind 1 points 2 days ago I always carry. 2 weapons at all times. In the truck, another 2. What these goat fuckers are saying is their plans to do just that. Kill as many whites as they can. Plus rape white women and children. permalink award report block reply\nChyNahAzzWhole1 1 points 3 days ago Pawn. Who has been poking that fat fuck? permalink award report block reply\nLORDFALCONE 1 points 3 days ago Where is the full video permalink award report block reply\nxanaxagoras 0 points 3 days ago In five years, this will be the norm. Who’s going to stop it, the Republican Party? permalink award report block reply GreazyCheeks 3 points 3 days ago The Republicans are in on it. Both sides are bought out and destroying us from within. permalink parent award report block reply\nGreazyCheeks 3 points 3 days ago The Republicans are in on it. Both sides are bought out and destroying us from within. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:11:41.648896Z"
}