{
  "id": "1ARK54T2nL",
  "url": "https://patriots.win/p/1ARK54T2nL/scott-presler-finds-election-she/c",
  "content": "349 Scott Presler finds election shenanigans in Chester County, PA. posted 5 days ago by kinbergfan 5 comments award share report block ThePersistence @ScottPresler • 6d ‼️Chester County Scandal‼️ On Election Day — Tuesday, November 4th, 2025 — Chester County, PA, poll books did NOT include independent voters. Voters were told that they had to vote a provisional ballot, despite the fact that they were eligible voters. At some polling\n5 comments Sort by Top Top New Worst Old Save Im_RickSteves_bitch 3 points 5 days ago That's sort of like finding Chinamen in the PRC. permalink award report block reply brewser724 2 points 5 days ago He couldn't have found what we already knew was there... permalink award report block reply TheSwampThang 1 points 5 days ago Unfortunately they're too busy doing things we don't really care about instead of the stuff we actually do care about permalink award report block reply Zhongda 0 points 5 days ago Ok, and?  We still have bullshit from 2016 that is sitting on a desk somewhere.  Shit or get off the pot, enough of this retarded theatre. permalink award report block reply RINO_fatigue -6 points 5 days ago He failed to deliver votes and instead of accepting responsibility for that the faggot is trying to invent schizo conspiracy theories to blame his failure on.    Maybe he should consider not being a repulsive faggot, maybe having a disgusting AIDS infested butt pirate in the GOP get out the vote effort is whats driving voters away permalink award report block reply\nIm_RickSteves_bitch 3 points 5 days ago That's sort of like finding Chinamen in the PRC. permalink award report block reply\nbrewser724 2 points 5 days ago He couldn't have found what we already knew was there... permalink award report block reply\nTheSwampThang 1 points 5 days ago Unfortunately they're too busy doing things we don't really care about instead of the stuff we actually do care about permalink award report block reply\nZhongda 0 points 5 days ago Ok, and?  We still have bullshit from 2016 that is sitting on a desk somewhere.  Shit or get off the pot, enough of this retarded theatre. permalink award report block reply\nRINO_fatigue -6 points 5 days ago He failed to deliver votes and instead of accepting responsibility for that the faggot is trying to invent schizo conspiracy theories to blame his failure on.    Maybe he should consider not being a repulsive faggot, maybe having a disgusting AIDS infested butt pirate in the GOP get out the vote effort is whats driving voters away permalink award report block reply",
  "fetched_at": "2025-11-12T20:39:30.880641Z"
}