{
  "id": "1ARK0Ub4rN",
  "url": "https://patriots.win/p/1ARK0Ub4rN/wow--dr-oz-administrator-for-the/c",
  "content": "534 WOW 🚨 Dr Oz, Administrator for the Centers for Medicare & Medicaid Services, announces they have evidence 6 Democrat states have been stealing federal tax dollars for healthcare for illegals\nOver a billion dollars stolen in just the last few months posted 7 days ago by MEME-SUPREME 22 comments award share report block Wall Street Apes @WallStreetApes • 7d WOW 🚨 Dr Oz, Administrator for the Centers for Medicare & Medicaid Services, announces they have evidence 6 Democrat states have been stealing federal tax dollars for healthcare for illegals Over a billion dollars stolen in just the last few months “We decided to investigate\n22 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style TravisRSCX 14 points 7 days ago People need to be arrested and in jail. So tired of working my tail off for this stuff to happen! permalink award report block reply schism 7 points 7 days ago Best  I can do is a strongly-worded tweet. permalink parent award report block reply ColonelKlink 13 points 7 days ago Arrest and imprison. You know it's a lot more than six states permalink award report block reply Bullwinkle 8 points 7 days ago Let me guess the states: California New York Illinois Oregon Maryland Massachusetts permalink award report block reply BrokenWolf2022 4 points 7 days ago Colorado has to be in there somewhere. permalink parent award report block reply Ligersrule1 7 points 7 days ago Minnesomalia is a contender as well permalink parent award report block reply Losferwords 6 points 7 days ago Who cares. No one is being held accountable. For anything. permalink award report block reply NotYourMan 5 points 7 days ago Arrests?  Law suits to get the money back? permalink award report block reply cpyder 5 points 7 days ago Warrants? Arrests? No? Then shut the fuck up and get back to work.... this is getting tiresome. So much evidence and zero action. permalink award report block reply KeepMarxInTheGround 4 points 7 days ago Looking forward to no one being imprisoned for it. permalink award report block reply schiff_for_brains 4 points 7 days ago And will there be arrests?  I think this deserves arrests. permalink award report block reply GeneralTsoTofu 4 points 7 days ago I'm-a wait here until something happens. permalink award report block reply mlp67 3 points 7 days ago Embarrassing???? It's fucking criminal! God Bondi get off your ass and do something!! permalink award report block reply InfinitesimalOrange 2 points 7 days ago These people misuse, mishandle, and misappropriate more money EVERY SINGLE FUCKING GOD DAM DAY, than most people see in their entire lives. permalink award report block reply BrokenWolf2022 2 points 7 days ago Shame tbere won't be any charges or arrests, but hey, it's nice to know. permalink award report block reply whitman_99 1 points 6 days ago Committees and investigations that go on forever and end as a nothing burger. I am so sick of this 2 week psyop. permalink award report block reply PM-Melania-feet-pics 1 points 6 days ago Arrests? permalink award report block reply TonyTreehouse 1 points 7 days ago Need a bigger boat of this message out there. Trump highlighting it and enmphasizing this is why the deportations are going to continue.  The normies don't think about all the ways the illegals get benefits.  They just think some are working hard making a living. permalink award report block reply Thorgasm 1 points 7 days ago How the hell does that even work?  \"Just take whatever you need! I trust you.\" permalink award report block reply Covfefebrulee 1 points 7 days ago He’s got breasts? permalink award report block reply Blackmore 1 points 6 days ago Where is the jail time to detour the crime going to happen, if none it will get worse the next time. LETS GET GOING<<<<< permalink award report block reply the_new_one 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply\nTravisRSCX 14 points 7 days ago People need to be arrested and in jail. So tired of working my tail off for this stuff to happen! permalink award report block reply schism 7 points 7 days ago Best  I can do is a strongly-worded tweet. permalink parent award report block reply\nschism 7 points 7 days ago Best  I can do is a strongly-worded tweet. permalink parent award report block reply\nColonelKlink 13 points 7 days ago Arrest and imprison. You know it's a lot more than six states permalink award report block reply\nBullwinkle 8 points 7 days ago Let me guess the states: California New York Illinois Oregon Maryland Massachusetts permalink award report block reply BrokenWolf2022 4 points 7 days ago Colorado has to be in there somewhere. permalink parent award report block reply Ligersrule1 7 points 7 days ago Minnesomalia is a contender as well permalink parent award report block reply\nBrokenWolf2022 4 points 7 days ago Colorado has to be in there somewhere. permalink parent award report block reply Ligersrule1 7 points 7 days ago Minnesomalia is a contender as well permalink parent award report block reply\nLigersrule1 7 points 7 days ago Minnesomalia is a contender as well permalink parent award report block reply\nLosferwords 6 points 7 days ago Who cares. No one is being held accountable. For anything. permalink award report block reply\nNotYourMan 5 points 7 days ago Arrests?  Law suits to get the money back? permalink award report block reply\ncpyder 5 points 7 days ago Warrants? Arrests? No? Then shut the fuck up and get back to work.... this is getting tiresome. So much evidence and zero action. permalink award report block reply\nKeepMarxInTheGround 4 points 7 days ago Looking forward to no one being imprisoned for it. permalink award report block reply\nschiff_for_brains 4 points 7 days ago And will there be arrests?  I think this deserves arrests. permalink award report block reply\nGeneralTsoTofu 4 points 7 days ago I'm-a wait here until something happens. permalink award report block reply\nmlp67 3 points 7 days ago Embarrassing???? It's fucking criminal! God Bondi get off your ass and do something!! permalink award report block reply\nInfinitesimalOrange 2 points 7 days ago These people misuse, mishandle, and misappropriate more money EVERY SINGLE FUCKING GOD DAM DAY, than most people see in their entire lives. permalink award report block reply\nBrokenWolf2022 2 points 7 days ago Shame tbere won't be any charges or arrests, but hey, it's nice to know. permalink award report block reply\nwhitman_99 1 points 6 days ago Committees and investigations that go on forever and end as a nothing burger. I am so sick of this 2 week psyop. permalink award report block reply\nPM-Melania-feet-pics 1 points 6 days ago Arrests? permalink award report block reply\nTonyTreehouse 1 points 7 days ago Need a bigger boat of this message out there. Trump highlighting it and enmphasizing this is why the deportations are going to continue.  The normies don't think about all the ways the illegals get benefits.  They just think some are working hard making a living. permalink award report block reply\nThorgasm 1 points 7 days ago How the hell does that even work?  \"Just take whatever you need! I trust you.\" permalink award report block reply\nCovfefebrulee 1 points 7 days ago He’s got breasts? permalink award report block reply\nBlackmore 1 points 6 days ago Where is the jail time to detour the crime going to happen, if none it will get worse the next time. LETS GET GOING<<<<< permalink award report block reply\nthe_new_one 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T20:58:17.176598Z"
}