{
  "id": "1ARK9oW6RG",
  "url": "https://patriots.win/p/1ARK9oW6RG/just-a-reminder-that-retard-find/c",
  "content": "21 Just a reminder that Retard Finder was outted as a non-American. Now look at their latest ploy. Tucker is in the same camp as Mamdani and Somalians? GRAY LIVES MATTER posted 3 hours ago by shadypollster 22 comments award share download report block\n22 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno Patriot4TN 7 points 3 hours ago I did not hear this about Retard Finder. I got a kick out of his posts. permalink award report block reply shadypollster OP 6 points 3 hours ago He outted himself when he said he wasn't an American. Just another grifting poojeet probably. permalink parent award report block reply _Liberty_Prime_ 5 points 3 hours ago Also not pro Trump. He's a New Zealander, I think? permalink parent award report block reply Retard_Antifa_Finder 2 points 2 hours ago he was just a poser anyway permalink parent award report block reply edxzxz 4 points 2 hours ago OK, but then am I also supposed to forget that Tuck the Cuck rabidly reported that the 2020 election was totally legit and all the talk of it being rigged was unfounded?  Or that he was a left wing shill before taking the big money gig at FOX?  I know he says what you want to hear now, but he's proven he'll say whatever gets him paid. permalink award report block reply Porkbut 3 points 2 hours ago He called \"election deniers\" idiots and lunatics. Thats what lost fox the defamation lawsuit against dominion, tucker saying he thought people who believed the election was stolen were morons. permalink parent award report block reply Rumor_HasIt 1 points 1 hour ago Im still mixed on Tucker,, But I do recall some big conspiracy theory etc tying him to being at and active at Ping Ping Pizza  / Dad top See Eye Ayyye in a documentary, right around the time \"pizza gate\" was exploding,,, Then Fox News and crew called the Election in states /cough Arizona in 2020, Then a Censorship happened right around Covid Happened,, weird how many archived and viable sources I lost,, 🤔 Tucker left Fox,  I'm still Watching/Observing him,  but yet still Undecided. 🤷🏼‍♀️ permalink parent award report block reply Stolen 1 points 60 minutes ago I look at Tucker like Rogan, Candice, Shapiro, Fuentes, Levin, Tatum, and Greenwald etc... They are not Rush Limbaugh and they are not MAGA. They got their own schtick and they are looking for clicks. permalink parent award report block reply GuerillaYourDreams 3 points 2 hours ago I can't find where the \"Retard Finder\" was ID'd in any way. permalink award report block reply shadypollster OP 3 points 2 hours ago @IFindDumbPeople is their new handle. He admitted in a comment he made he wasn't American. permalink parent award report block reply GuerillaYourDreams 2 points 2 hours ago Canadian? Where are they from? permalink parent award report block reply shadypollster OP 2 points 2 hours ago No sure. Liberty Prime thinks they are from New Zealand. permalink parent award report block reply GuerillaYourDreams 4 points 2 hours ago New Zealand? Then they have gotten a lot of practice finding them!! permalink parent award report block reply guywholikesDjtof2024 2 points 2 hours ago Where? Need links. permalink parent award report block reply shadypollster OP 2 points 2 hours ago Found one: https://x.com/IfindRetards/status/1983481322111996119 permalink parent award report block reply guywholikesDjtof2024 2 points 2 hours ago ty permalink parent award report block reply view 1 more comments... SavingPrivateGrace 3 points 2 hours ago Find the retard finder and become the retard finder. permalink parent award report block reply breadbaker 3 points 2 hours ago None of these people have anything in particularly close in common politically, except that they are outside the uniparty swamp. permalink award report block reply Retard_Antifa_Finder -2 points 2 hours ago found one permalink parent award report block reply breadbaker 1 points 24 minutes ago RELEASE THE EPSTEIN FILES. ALL OF THEM. ENOUGH PROTECTING THE RICH. not trusting Trump any more = ntta permalink parent award report block reply YaharaRiver 2 points 1 hour ago Family portrait!! 👍 Ilhan not happy because she didn’t marry any of them, so how can they be “family”. permalink award report block reply Butttoucha9k 1 points 2 hours ago Comment removed by community moderators. permalink award report block reply\nPatriot4TN 7 points 3 hours ago I did not hear this about Retard Finder. I got a kick out of his posts. permalink award report block reply shadypollster OP 6 points 3 hours ago He outted himself when he said he wasn't an American. Just another grifting poojeet probably. permalink parent award report block reply _Liberty_Prime_ 5 points 3 hours ago Also not pro Trump. He's a New Zealander, I think? permalink parent award report block reply Retard_Antifa_Finder 2 points 2 hours ago he was just a poser anyway permalink parent award report block reply\nshadypollster OP 6 points 3 hours ago He outted himself when he said he wasn't an American. Just another grifting poojeet probably. permalink parent award report block reply\n_Liberty_Prime_ 5 points 3 hours ago Also not pro Trump. He's a New Zealander, I think? permalink parent award report block reply\nRetard_Antifa_Finder 2 points 2 hours ago he was just a poser anyway permalink parent award report block reply\nedxzxz 4 points 2 hours ago OK, but then am I also supposed to forget that Tuck the Cuck rabidly reported that the 2020 election was totally legit and all the talk of it being rigged was unfounded?  Or that he was a left wing shill before taking the big money gig at FOX?  I know he says what you want to hear now, but he's proven he'll say whatever gets him paid. permalink award report block reply Porkbut 3 points 2 hours ago He called \"election deniers\" idiots and lunatics. Thats what lost fox the defamation lawsuit against dominion, tucker saying he thought people who believed the election was stolen were morons. permalink parent award report block reply Rumor_HasIt 1 points 1 hour ago Im still mixed on Tucker,, But I do recall some big conspiracy theory etc tying him to being at and active at Ping Ping Pizza  / Dad top See Eye Ayyye in a documentary, right around the time \"pizza gate\" was exploding,,, Then Fox News and crew called the Election in states /cough Arizona in 2020, Then a Censorship happened right around Covid Happened,, weird how many archived and viable sources I lost,, 🤔 Tucker left Fox,  I'm still Watching/Observing him,  but yet still Undecided. 🤷🏼‍♀️ permalink parent award report block reply Stolen 1 points 60 minutes ago I look at Tucker like Rogan, Candice, Shapiro, Fuentes, Levin, Tatum, and Greenwald etc... They are not Rush Limbaugh and they are not MAGA. They got their own schtick and they are looking for clicks. permalink parent award report block reply\nPorkbut 3 points 2 hours ago He called \"election deniers\" idiots and lunatics. Thats what lost fox the defamation lawsuit against dominion, tucker saying he thought people who believed the election was stolen were morons. permalink parent award report block reply\nRumor_HasIt 1 points 1 hour ago Im still mixed on Tucker,, But I do recall some big conspiracy theory etc tying him to being at and active at Ping Ping Pizza  / Dad top See Eye Ayyye in a documentary, right around the time \"pizza gate\" was exploding,,, Then Fox News and crew called the Election in states /cough Arizona in 2020, Then a Censorship happened right around Covid Happened,, weird how many archived and viable sources I lost,, 🤔 Tucker left Fox,  I'm still Watching/Observing him,  but yet still Undecided. 🤷🏼‍♀️ permalink parent award report block reply Stolen 1 points 60 minutes ago I look at Tucker like Rogan, Candice, Shapiro, Fuentes, Levin, Tatum, and Greenwald etc... They are not Rush Limbaugh and they are not MAGA. They got their own schtick and they are looking for clicks. permalink parent award report block reply\nStolen 1 points 60 minutes ago I look at Tucker like Rogan, Candice, Shapiro, Fuentes, Levin, Tatum, and Greenwald etc... They are not Rush Limbaugh and they are not MAGA. They got their own schtick and they are looking for clicks. permalink parent award report block reply\nGuerillaYourDreams 3 points 2 hours ago I can't find where the \"Retard Finder\" was ID'd in any way. permalink award report block reply shadypollster OP 3 points 2 hours ago @IFindDumbPeople is their new handle. He admitted in a comment he made he wasn't American. permalink parent award report block reply GuerillaYourDreams 2 points 2 hours ago Canadian? Where are they from? permalink parent award report block reply shadypollster OP 2 points 2 hours ago No sure. Liberty Prime thinks they are from New Zealand. permalink parent award report block reply GuerillaYourDreams 4 points 2 hours ago New Zealand? Then they have gotten a lot of practice finding them!! permalink parent award report block reply guywholikesDjtof2024 2 points 2 hours ago Where? Need links. permalink parent award report block reply shadypollster OP 2 points 2 hours ago Found one: https://x.com/IfindRetards/status/1983481322111996119 permalink parent award report block reply guywholikesDjtof2024 2 points 2 hours ago ty permalink parent award report block reply view 1 more comments... SavingPrivateGrace 3 points 2 hours ago Find the retard finder and become the retard finder. permalink parent award report block reply\nshadypollster OP 3 points 2 hours ago @IFindDumbPeople is their new handle. He admitted in a comment he made he wasn't American. permalink parent award report block reply GuerillaYourDreams 2 points 2 hours ago Canadian? Where are they from? permalink parent award report block reply shadypollster OP 2 points 2 hours ago No sure. Liberty Prime thinks they are from New Zealand. permalink parent award report block reply GuerillaYourDreams 4 points 2 hours ago New Zealand? Then they have gotten a lot of practice finding them!! permalink parent award report block reply guywholikesDjtof2024 2 points 2 hours ago Where? Need links. permalink parent award report block reply shadypollster OP 2 points 2 hours ago Found one: https://x.com/IfindRetards/status/1983481322111996119 permalink parent award report block reply guywholikesDjtof2024 2 points 2 hours ago ty permalink parent award report block reply view 1 more comments...\nGuerillaYourDreams 2 points 2 hours ago Canadian? Where are they from? permalink parent award report block reply shadypollster OP 2 points 2 hours ago No sure. Liberty Prime thinks they are from New Zealand. permalink parent award report block reply GuerillaYourDreams 4 points 2 hours ago New Zealand? Then they have gotten a lot of practice finding them!! permalink parent award report block reply\nshadypollster OP 2 points 2 hours ago No sure. Liberty Prime thinks they are from New Zealand. permalink parent award report block reply GuerillaYourDreams 4 points 2 hours ago New Zealand? Then they have gotten a lot of practice finding them!! permalink parent award report block reply\nGuerillaYourDreams 4 points 2 hours ago New Zealand? Then they have gotten a lot of practice finding them!! permalink parent award report block reply\nguywholikesDjtof2024 2 points 2 hours ago Where? Need links. permalink parent award report block reply shadypollster OP 2 points 2 hours ago Found one: https://x.com/IfindRetards/status/1983481322111996119 permalink parent award report block reply guywholikesDjtof2024 2 points 2 hours ago ty permalink parent award report block reply view 1 more comments...\nshadypollster OP 2 points 2 hours ago Found one: https://x.com/IfindRetards/status/1983481322111996119 permalink parent award report block reply guywholikesDjtof2024 2 points 2 hours ago ty permalink parent award report block reply view 1 more comments...\nguywholikesDjtof2024 2 points 2 hours ago ty permalink parent award report block reply view 1 more comments...\nSavingPrivateGrace 3 points 2 hours ago Find the retard finder and become the retard finder. permalink parent award report block reply\nbreadbaker 3 points 2 hours ago None of these people have anything in particularly close in common politically, except that they are outside the uniparty swamp. permalink award report block reply Retard_Antifa_Finder -2 points 2 hours ago found one permalink parent award report block reply breadbaker 1 points 24 minutes ago RELEASE THE EPSTEIN FILES. ALL OF THEM. ENOUGH PROTECTING THE RICH. not trusting Trump any more = ntta permalink parent award report block reply\nRetard_Antifa_Finder -2 points 2 hours ago found one permalink parent award report block reply breadbaker 1 points 24 minutes ago RELEASE THE EPSTEIN FILES. ALL OF THEM. ENOUGH PROTECTING THE RICH. not trusting Trump any more = ntta permalink parent award report block reply\nbreadbaker 1 points 24 minutes ago RELEASE THE EPSTEIN FILES. ALL OF THEM. ENOUGH PROTECTING THE RICH. not trusting Trump any more = ntta permalink parent award report block reply\nYaharaRiver 2 points 1 hour ago Family portrait!! 👍 Ilhan not happy because she didn’t marry any of them, so how can they be “family”. permalink award report block reply\nButttoucha9k 1 points 2 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:08:15.076677Z"
}