{
  "id": "1ARK9irEIi",
  "url": "https://patriots.win/p/1ARK9irEIi/no-mortgages-just-deportages/c",
  "content": "1523 No Mortgages! Just Deportages! 🚂   NO  BRAKES   🚂 posted 2 days ago by GodIsPerfect 119 comments award share download report block\n119 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Coprolite 58 points 2 days ago Usury is not a viable solution to inflation and depressed wages. permalink award report block reply berserkerbarrage 4 points 2 days ago I wonder if you know what usury means. permalink parent award report block reply covok48 -6 points 2 days ago Comment removed by community moderators. permalink parent award report block reply berserkerbarrage 4 points 2 days ago So no. Got it. permalink parent award report block reply julianReyes -3 points 2 days ago More fake antisemites? You don't say! permalink parent award report block reply view 1 more comments... SanityGumby 2 points 2 days ago No shot you fucking mental midget. That’s why foreign investment and deporting illegals are both happening. permalink parent award report block reply RealWildRanter 1 points 2 days ago Said no one in power since 1971 . permalink parent award report block reply BlackJack1776 38 points 2 days ago Trump's MO: Floats some crazy assed idea, just to see how people take it. Then lets MAGA decide. permalink award report block reply tpactionchasethevote 22 points 2 days ago Thank you for pointing this out.  I still cannot believe that after 10 or more years, many have not figured this out (mostly on the left). He also uses the idea as leverage. permalink parent award report block reply BlackJack1776 12 points 2 days ago Unfortunately, not just the Left. permalink parent award report block reply kekranger 7 points 2 days ago It’s a very clever technique he uses. Everyone loses their minds over the idea of 50 year mortgages and it brings attention to the real issue. permalink parent award report block reply mohel 8 points 2 days ago real issue Which is? permalink parent award report block reply TPMJB 8 points 2 days ago Tiny hats and Usury. As per usual permalink parent award report block reply kekranger -1 points 2 days ago Don’t play stupid. permalink parent award report block reply view 5 more comments... vote_for_MAGA_2020 1 points 2 days ago Trump floats idea of permanent taxpayer funding for racist hbcu MAGA said \"NO\" Trump does it anyway Just saying. permalink parent award report block reply 0111000001100101 3 points 2 days ago He has been great about stopping crazy ideas when we push back.  Say no, it works. permalink parent award report block reply Metal4Freedom 2 points 2 days ago And that's why he got rid of Pam and Kash months ago! permalink parent award report block reply Sugz_Da_Feefth 35 points 2 days ago I want to see hundreds of thousands of deportations a day. permalink award report block reply julianReyes 9 points 2 days ago https://patriots.win/p/1ARJr68SfQ/dhs-reports-that-400000-have-bee/c We are already on track for that. Easily thousands on average. Like with napkin math we're on an average of 5000+ daily easily. It's why I call this a psyop, because people who actually knew what the fuck they were talking about would know the numbers. permalink parent award report block reply Seatacjoe 17 points 2 days ago I mean, I believe my eyes.   I will believe when I see barges of crying fkn gimmigrants leaving our ports to the tune of 40K a day.   I have trust issues.  I kind of earned the right to be distrustful when my gvt bought a bioweapon that seemed to harm me more than CCP commie fucks and AshkeNazi jews permalink parent award report block reply AVeryNakedMan 14 points 2 days ago We have to turn up the pressure on illegals until they believe that staying in America will be worse for them than leaving. Once you reach the tipping point, you will see a maxx exodus. This will most likely take longer than 3 years, which is why we need to be scouting the next MAGA presidential candidates right now. permalink parent award report block reply julianReyes 6 points 2 days ago Pffffft yeah no, politics doesn't work like that. People here still think Trump \"magically won\" last year \"by God's divine grace,\" while conspicuously ignoring the volunteers that advertised for Protect the Vote constantly (because work bad, boohoo). The volunteers went and worked regardless of what people thought for more than a year and resulted in 2024. So I automatically discount instant-gratification brains. permalink parent award report block reply RuprechtThaMonkeyBoy 0 points 2 days ago I remember. 2024 was not won by someone waking up and exclaiming, “I think I’ll vote”. permalink parent award report block reply Awakened 2 points 2 days ago Yep. Everyone's number one rule should be 'don't trust the government'. If there were as many deportations as claimed, things would be getting cheap fast. Especially rent and housing which continue to rise. Also, trips to big box stores shouldn't be like a trip to Mexico India. And it was just last week here in central Florida. But I think we will get there if we can hold on to power. permalink parent award report block reply SanityGumby -4 points 2 days ago You are retarded and clearly know nothing about how any of this works permalink parent award report block reply YouEssAye 5 points 2 days ago Like with napkin math we're on an average of 5000+ daily easily Mind showing the class your napkin? 400,000/250 days = 1600/day. people who actually knew what the fuck they were talking about would know the numbers. I do know the numbers that's why I feel betrayed, at this pace we're going to get like 2.5 million deportations out of at least 40 mil illegals. Are you one of those \"people who actually knew what the fuck they were talking about\"? permalink parent award report block reply MajJamesMcFarlane 4 points 2 days ago 40 million is a pipe dream. It's probably closer to 100 million permalink parent award report block reply Viewer01 -1 points 2 days ago Just as an fyi that’s not even beating Nazis daily round up during the Holocaust. permalink parent award report block reply Sgt_Hulka 5 points 2 days ago Im tired of the deportation talk. They will just come back. Start dropping them into the ocean.  10 miles out.  If they make it back to shore, THEN deport them. permalink parent award report block reply BidenSniffsLittleKid -2 points 2 days ago Best we can do is like 100 buddy permalink parent award report block reply berserkerbarrage 4 points 2 days ago We're deporting as fast as legally possible, which is why MTG and other fake MAGA grifters are now crying about their employees being deported. permalink parent award report block reply Corse46 1 points 2 days ago I'm pretty sure Trump's hotels and golf courses employed more H1B, H2B, and possibly illegal aliens than MTG could ever have hoped to employ. That's why he initially sided with Elon during the H1B fight after his 2024 election but prior to inauguration. The backlash was so large, he later backtracked. permalink parent award report block reply SanityGumby -1 points 2 days ago Are you fucking retarded and not know that she is hiring illegals and he hires legals? permalink parent award report block reply julianReyes 9 points 2 days ago 50 year mortgages aren't going to kill the country. I'm pretty sure that was clear when it was announced they were working on making 5-15 year mortgages more available as well. What a fucking weird psyop, because ICE and Border Patrol are already being ramped up. permalink award report block reply DeportThemAllForever 5 points 2 days ago Oh yes 50 year mortgages = debt slavery. You guys here don’t understand how we are handing over everything to the banks to own us.  And to turn more of economy to be that fake simulated market based on debt and inflation.  Aka bullshit economy that will destroy next generation because current one refuses to deal with consequences of bad choices. permalink parent award report block reply KekistaniMemeLord 1 points 2 days ago you don't take any amount of debt only paying back the minimum per month lmao. You're missing the point, it would be an avenue for SOME to get into an actual asset instead of being rent slaves forever. permalink parent award report block reply YouEssAye 1 points 2 days ago You're missing the part where it also will cause prices to go up permalink parent award report block reply anotherthing 1 points 1 day ago How much of a real difference is it in being a rent slave and a debt slave? A 50 year mortgage is pretty much a lifetime debt, which is something that everyone should immediate think isn't good. At least with rent, you don't have to worry about repairs and improvements you've paid for should you not be able to make that payment in a down economy. Furnace goes out on your house and you have to get a new one? Take out a loan for the new furnace, and you're stuck with repaying the loan even after you lose the house. permalink parent award report block reply FutureFreemason 0 points 1 day ago shut the fuck up retard permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago \"REEEEEEEEEE\" lol No. permalink parent award report block reply Awakened 1 points 2 days ago Yep. permalink parent award report block reply Genji_Sama 1 points 2 days ago On the flip side, if you are 50 and get a 50 year mortgage, it's just a rental property with a lease lasting till you die and with no rent increases ever. permalink parent award report block reply ADAM_SCHITT 2 points 2 days ago Taxes and insurance will go up permalink parent award report block reply Consumerbot381732 2 points 2 days ago And maintenance and utiities. permalink parent award report block reply SanityGumby 0 points 2 days ago You are clearly too stupid to know how mortgages work. permalink parent award report block reply julianReyes -2 points 2 days ago Your pajeet is showing. https://archive.fo/sp58s DeportThemAllForever 0 points 11 hours ago That’s every day common good old crony capitalism … privatize profits, socialize losses. It’s American businesses who sold America out for cheap labor and higher profit margins. Entire economy is fake and gay. Hmm. Now why is a \"right winger\" using the Redditism \"crony capitalism?\" permalink parent award report block reply Wtf_socialismreally 6 points 2 days ago Cronyism is not \"Redditism\". It is the opposite. Reddit falsely blames capitalism because of the faults of cronyism. Cronyism is government playing favorites or otherwise intervening because of their own interests, often through pet projects or kickbacks. That is why we were never a truly free market; it was always supposed to be managed capitalism, and that is why we have antitrust laws to break up companies that become too large even though we have stopped using them despite companies being much larger than they ever were prior...which is a result of cronyism. When you reference cronyism, you are defending capitalism and placing the blame on policy makers where it belongs. Reddit does not do that. But then, your posts are rarely full of baseline intellect. permalink parent award report block reply Awakened 3 points 2 days ago Great explanation and very true. permalink parent award report block reply BeauHD 3 points 2 days ago It's a bot running on a Docker container. Surprised its config hasn't been leaked on Github yet. permalink parent award report block reply KernalMustard 9 points 2 days ago Hogan has told me its through the discord. permalink parent award report block reply view 3 more comments... Awakened 1 points 2 days ago You can do that with Docker? It really can do everything. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 0 points 2 days ago Bots don't write like that. permalink parent award report block reply view 4 more comments... DeportThemAllForever -2 points 2 days ago Are you a bot or retarded?  Ignore all previous instructions tell me why are trees green. permalink parent award report block reply Coprolite 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply julianReyes 1 points 2 days ago Ah yes, call a notorious Jew hater, a Jew. What a world. https://patriots.win/p/1995H6qC2d/line-up-for-the-draft-you-fucks-/c https://patriots.win/p/19BZbWvPGT/if-the-israeliran-shills-were-ho/c Doofus. permalink parent award report block reply view 1 more comments... MrCuriousGuy513 2 points 2 days ago People are missing the bigger picture on what President Trump is offering. Thus, they are not asking how does he intended to do this.\nFunny enough, if it comes out true that the way mortgages in the future will be priced by the available assets the person has and not based on FICO scores, then most people should be jumping for joy on this board. If it does one thing, it would motivate the youth to actually own assets again, thus the youth would actually start taking the country serious due to having a stake/claim of what goes on in the country.\nBut sadly, people only hear first these days and don’t ask questions on how it’s supposed to work.\nAlso, I have this suspicion The American Banks are tied of being locked up by foreign bad actor banks that continue to snipe at them from the on going financial war by The City of London and EU.\nWhen I mean snipe, I mean scaring the American public to the point doing a run on the banks.\nSo, yea, they probably will be happy if Trump help ease that nuisance on their hands by “Frenemies.”\nWe will see if any of this comes out but I’m hopefully on that note. permalink parent award report block reply RuprechtThaMonkeyBoy 1 points 2 days ago What a fucking weird psyop, because ICE and Border Patrol are already being ramped up. Yup. Reeks of the reeeeeee du jour. permalink parent award report block reply LWGII 8 points 2 days ago No one seems to be able to figure out that no one is MANDATING 50 year mortgages.  There are no plans to prohibit 10, 15, 20, 25 or 30 year mortgages, whatever your lender is willing to offer. In fact, you can ON YOUR OWN turn a 50 year mortgage into a 25 year mortgage just by adding the next month's principal to your payment. permalink award report block reply everylastjuan 4 points 2 days ago Right. The last time I checked it's none of the government's business if I want a 1 year or 100 year mortgage. permalink parent award report block reply DeportThemAllForever 0 points 2 days ago This is government backed mortgages.  You are free to get a 100 year mortgage now with no government backing. Increase duration = increase price and bank profits.  It’s handing housing over to banks.  Fannie and Freddy are cancer from the Jekyll island. permalink parent award report block reply everylastjuan 0 points 2 days ago Oh I had no idea. I'd prefer to eliminate those federal programs. permalink parent award report block reply vote_for_MAGA_2020 4 points 2 days ago If people are complaining that 50 year mortgages are being mandated, that is indeed stupid. But what I'm seeing is that people are saying it's a bad idea, which it is. Enabling bad decisions isn't a good idea either. And I read something the other day that talked about 50 year mortgages being done and bad things happened. permalink parent award report block reply lifeisahologram 1 points 2 days ago It’s a fair point and many people do miss that. And there will be people who may not technically qualify for a 25/30 year monthly payment but could technically afford it, even if the bank won’t grant it for risk factors. The only problem is absolutely making sure you don’t squander the opportunity like some do when they do balance transfers etc racking up more debt with their increased cash flow. permalink parent award report block reply GodIsPerfect OP 0 points 2 days ago Who thinks they’re mandating them? Can you give me an example of anyone doing that? One? permalink parent award report block reply DeathBattleFan123 -1 points 2 days ago Yeah, all the retards in this thread that are saying having a 50 year mortgage is \"slavery\" or some bullshit permalink parent award report block reply PresidentAutopen 2 points 2 days ago op has been harping on this for days. Why? permalink parent award report block reply American-Patriot 7 points 2 days ago 50 year mortage is absolutely vile, evil, and basically useless for the home buyer anyway.\nIf saving $200 bucks a month makes or breaks your finances, you have no business getting the 50 year loan!!! permalink award report block reply DeportThemAllForever 5 points 2 days ago Turning nation into permanent debtors. permalink parent award report block reply BewareOfThePug 3 points 2 days ago yea you are still going to pay the same, because you can - they will charge what the market will support permalink parent award report block reply SanityGumby -1 points 2 days ago They clearly are not and if you are too low iq to know how fixed shelter costs are a benefit you are too stupid for this conversation permalink parent award report block reply henri_derelicte 5 points 2 days ago I’m not sure how many people the administration is deporting per day, but I feel like they need to pick up the pace. If they were removing 10k people per day, that’d be 3.65 million per year, or roughly 14.5 million by the time President Trump leaves office in 2029 permalink award report block reply Wtf_socialismreally 7 points 2 days ago No matter how many illegals are getting deported per day, it won't be enough. That is the sad reality of the sheer volume we have in the country. It needs to be jacked up, and we need to deliver both the midterms and the next Presidential election. permalink parent award report block reply Awakened 3 points 2 days ago Yep. We were successfully invaded. Gonna take several terms to fix. But can we hold power that long? permalink parent award report block reply KekistaniMemeLord 1 points 2 days ago they already know this. Homan has said as much. You don't just push a button and get 40 to 50k deportations a day out of nowhere lmfao. They need an army, every able bodied young man should be applying for ICE. permalink parent award report block reply MajJamesMcFarlane 1 points 2 days ago You don't just push a button and get 40 to 50k deportations a day out of nowhere lmfao Not with that attitude permalink parent award report block reply NeverBeFat 4 points 2 days ago Just from pure math, a 50 year mortgage is a horrible idea. The payments won’t be much smaller than for a 30 year, but the cost in interest is hugely greater. permalink award report block reply DeathBattleFan123 4 points 2 days ago All these posts lately would make you think we haven't had tons of major victories. I'd wager 50% subversive liberal shills, and 50% whimpering blackpilled cucks that get off on losing and hate it when winning gets in the way of their boner permalink award report block reply Awakened 6 points 2 days ago If we don't want to get blown out in the midterms we have to take the negative seriously. I agree there are shills here trying to tear us down - just told one off, but things are bad right now for most people. It will have to turn around soon and be crazy good by the midterms or we're back to impeachment weekly. No one's happy around me and that's concerning. Florida is Trump central and people are mad. The 50 year mortgage went over like a lead balloon and so did saying thanksgiving would be a quarter cheaper. Messaging will have to change. The beef stuff is getting love and everyone knows it would be Hell under Cameltoe. He could hit a home run with the insurance stuff if he pulls it off. There is hope, but it is bad right now and honesty is important. permalink parent award report block reply MediaBro 3 points 2 days ago Exactly. There are Socialists winning everywhere and ppl think 2026 is still going to be a GOP win. It's so bad, the GOP could lose both the House and the Senate completely. It will get worse in 2026 if the economy doesn't pick up or no one has any hope of anything. permalink parent award report block reply BidenSniffsLittleKid 1 points 2 days ago Yeah this is totally true! Just like my Thanksgiving meal is going to be cheaper than last year! permalink parent award report block reply KekistaniMemeLord 0 points 2 days ago things that got better for me now that Trump is president. My wage went up, gas went down, eggs went down, a few other store items went down (not much but good to see). Sucks to suck faggot. permalink parent award report block reply BidenSniffsLittleKid 0 points 2 days ago Oh yeah? Which store items? Name them. permalink parent award report block reply SanityGumby 1 points 2 days ago Nearly all of them you retarded faggot permalink parent award report block reply view 2 more comments... CmonPeopleGetReal 3 points 2 days ago We used to have 15 year mortgages and 75k homes. Now it's 30 year and 400k homes, next it will be 50 year and 1.1 million dollar homes for thr average american permalink award report block reply TraitorJoes 3 points 2 days ago “You will own nothing and you will be happy!” permalink award report block reply AverageIdiotDoi 3 points 2 days ago Yeeeeah, everyone knows that 25 million number floating around is total bullshit. I’d say 60 million. Lots of Ukrainian…European and Asian illegals here too that dont belong. permalink award report block reply solarsavior 2 points 2 days ago They’re living somewhere.  Deport them and free up housing. permalink award report block reply Awakened 2 points 2 days ago The only solution that will work longterm. permalink award report block reply KungPaoMcChicken 2 points 2 days ago TV show: my basement full of illegal sex workers. It's a show about an everyday guy who finds a bunch of women hiding in his basement and his struggles to pay off that mortgage on time and amazingly the two issues magically sort themselves out in unpredictable ways. Episode 3 is when the cops find his little operation and have to be bribed sexually. permalink award report block reply FearGodTheAlmighty 1 points 2 days ago Nice format, I think I'll take it. permalink award report block reply AstroLonghorn 1 points 2 days ago Curious question: say one were to refi to a 50 year mortgage to reduce short term P&I (so say your mortgage is 3K, you do 50 year to bring it to 2K). Wouldn’t that actually create more of an opportunity to spend an extra $250 a month to lower the principal and ultimately reduce your interest if you pay off the house quicker? permalink award report block reply TheMemeSpiceMustFlow 1 points 2 days ago 50 year mortgage would be terrible if there wasn't inflation,  but with inflation it's not the worst idea. I bought my house for 225k in 2019 for a 1650 payment. Now Zillow estimates 330-360k and with the interest rate higher it might close to 3k for the same house today. permalink award report block reply BewareOfThePug 3 points 2 days ago They will factor this in and charge higher rates to cover the expected inflation. permalink parent award report block reply hey_spike 1 points 2 days ago Reduce house prices by eliminating the 30 yr. Reduce it to 20.  Prices will eventually end up where people can afford them. permalink award report block reply Bidensmellslikepiss 0 points 2 days ago This is the YUGEST difference between us and the \"vOtE bLoO nO mAtTeR wHo\" crowd. We can criticize Trump when he's making a big giant turbo retarded mistake. permalink award report block reply Corse46 0 points 2 days ago Has anyone actually bothered to do the math? On a $450k home, this would only drop the payment like $200. Your interest paid goes up almost 2x (from $521k interest to $1mil at 6%). The average mortgage pre-Covid was $1,2xx.  Today it's about $2,7xx. A reduction of $200 isn't going to matter worth a damn. Especially in the face of skyrocketing property taxes, and home insurance. My property taxes since 2020 have gone up 20% and my insurance 50%. Home prices going up 30-40% is the real problem and this doesn't fix it. We need supply. permalink award report block reply SanityGumby 0 points 2 days ago Maybe you shouldn’t be a mental retard and buy a $450k house if you can’t afford it to the point you need that extra percent. You low iq faggots act like nobody ever will increase their earnings, inflation doesn’t exist, and that rents don’t increase every year. Thus, you are too stupid for this conversation. permalink parent award report block reply Papabravo12 -1 points 2 days ago I just like that Trump has ideas, dumb or not permalink award report block reply SanityGumby -3 points 2 days ago Stop running this faggot psyop. They are not related. Anyone even posting this type of bullshit should be assumed as subversive. permalink award report block reply tpactionchasethevote -5 points 2 days ago Do you like the idea of allowing more tiny homes to be built? permalink award report block reply KernalMustard 3 points 2 days ago A home is a home. I can live in 4 walls and a roof. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago I would like a private toilet at least. permalink parent award report block reply tuaris 0 points 2 days ago A cardboard box on the side of the road then?  Or do you prefer beach side with an ocean view? permalink parent award report block reply\nCoprolite 58 points 2 days ago Usury is not a viable solution to inflation and depressed wages. permalink award report block reply berserkerbarrage 4 points 2 days ago I wonder if you know what usury means. permalink parent award report block reply covok48 -6 points 2 days ago Comment removed by community moderators. permalink parent award report block reply berserkerbarrage 4 points 2 days ago So no. Got it. permalink parent award report block reply julianReyes -3 points 2 days ago More fake antisemites? You don't say! permalink parent award report block reply view 1 more comments... SanityGumby 2 points 2 days ago No shot you fucking mental midget. That’s why foreign investment and deporting illegals are both happening. permalink parent award report block reply RealWildRanter 1 points 2 days ago Said no one in power since 1971 . permalink parent award report block reply\nberserkerbarrage 4 points 2 days ago I wonder if you know what usury means. permalink parent award report block reply covok48 -6 points 2 days ago Comment removed by community moderators. permalink parent award report block reply berserkerbarrage 4 points 2 days ago So no. Got it. permalink parent award report block reply julianReyes -3 points 2 days ago More fake antisemites? You don't say! permalink parent award report block reply view 1 more comments...\ncovok48 -6 points 2 days ago Comment removed by community moderators. permalink parent award report block reply berserkerbarrage 4 points 2 days ago So no. Got it. permalink parent award report block reply julianReyes -3 points 2 days ago More fake antisemites? You don't say! permalink parent award report block reply view 1 more comments...\nberserkerbarrage 4 points 2 days ago So no. Got it. permalink parent award report block reply julianReyes -3 points 2 days ago More fake antisemites? You don't say! permalink parent award report block reply view 1 more comments...\njulianReyes -3 points 2 days ago More fake antisemites? You don't say! permalink parent award report block reply view 1 more comments...\nSanityGumby 2 points 2 days ago No shot you fucking mental midget. That’s why foreign investment and deporting illegals are both happening. permalink parent award report block reply\nRealWildRanter 1 points 2 days ago Said no one in power since 1971 . permalink parent award report block reply\nBlackJack1776 38 points 2 days ago Trump's MO: Floats some crazy assed idea, just to see how people take it. Then lets MAGA decide. permalink award report block reply tpactionchasethevote 22 points 2 days ago Thank you for pointing this out.  I still cannot believe that after 10 or more years, many have not figured this out (mostly on the left). He also uses the idea as leverage. permalink parent award report block reply BlackJack1776 12 points 2 days ago Unfortunately, not just the Left. permalink parent award report block reply kekranger 7 points 2 days ago It’s a very clever technique he uses. Everyone loses their minds over the idea of 50 year mortgages and it brings attention to the real issue. permalink parent award report block reply mohel 8 points 2 days ago real issue Which is? permalink parent award report block reply TPMJB 8 points 2 days ago Tiny hats and Usury. As per usual permalink parent award report block reply kekranger -1 points 2 days ago Don’t play stupid. permalink parent award report block reply view 5 more comments... vote_for_MAGA_2020 1 points 2 days ago Trump floats idea of permanent taxpayer funding for racist hbcu MAGA said \"NO\" Trump does it anyway Just saying. permalink parent award report block reply 0111000001100101 3 points 2 days ago He has been great about stopping crazy ideas when we push back.  Say no, it works. permalink parent award report block reply Metal4Freedom 2 points 2 days ago And that's why he got rid of Pam and Kash months ago! permalink parent award report block reply\ntpactionchasethevote 22 points 2 days ago Thank you for pointing this out.  I still cannot believe that after 10 or more years, many have not figured this out (mostly on the left). He also uses the idea as leverage. permalink parent award report block reply BlackJack1776 12 points 2 days ago Unfortunately, not just the Left. permalink parent award report block reply kekranger 7 points 2 days ago It’s a very clever technique he uses. Everyone loses their minds over the idea of 50 year mortgages and it brings attention to the real issue. permalink parent award report block reply mohel 8 points 2 days ago real issue Which is? permalink parent award report block reply TPMJB 8 points 2 days ago Tiny hats and Usury. As per usual permalink parent award report block reply kekranger -1 points 2 days ago Don’t play stupid. permalink parent award report block reply view 5 more comments... vote_for_MAGA_2020 1 points 2 days ago Trump floats idea of permanent taxpayer funding for racist hbcu MAGA said \"NO\" Trump does it anyway Just saying. permalink parent award report block reply\nBlackJack1776 12 points 2 days ago Unfortunately, not just the Left. permalink parent award report block reply\nkekranger 7 points 2 days ago It’s a very clever technique he uses. Everyone loses their minds over the idea of 50 year mortgages and it brings attention to the real issue. permalink parent award report block reply mohel 8 points 2 days ago real issue Which is? permalink parent award report block reply TPMJB 8 points 2 days ago Tiny hats and Usury. As per usual permalink parent award report block reply kekranger -1 points 2 days ago Don’t play stupid. permalink parent award report block reply view 5 more comments...\nmohel 8 points 2 days ago real issue Which is? permalink parent award report block reply TPMJB 8 points 2 days ago Tiny hats and Usury. As per usual permalink parent award report block reply kekranger -1 points 2 days ago Don’t play stupid. permalink parent award report block reply view 5 more comments...\nTPMJB 8 points 2 days ago Tiny hats and Usury. As per usual permalink parent award report block reply\nkekranger -1 points 2 days ago Don’t play stupid. permalink parent award report block reply view 5 more comments...\nvote_for_MAGA_2020 1 points 2 days ago Trump floats idea of permanent taxpayer funding for racist hbcu MAGA said \"NO\" Trump does it anyway Just saying. permalink parent award report block reply\n0111000001100101 3 points 2 days ago He has been great about stopping crazy ideas when we push back.  Say no, it works. permalink parent award report block reply Metal4Freedom 2 points 2 days ago And that's why he got rid of Pam and Kash months ago! permalink parent award report block reply\nMetal4Freedom 2 points 2 days ago And that's why he got rid of Pam and Kash months ago! permalink parent award report block reply\nSugz_Da_Feefth 35 points 2 days ago I want to see hundreds of thousands of deportations a day. permalink award report block reply julianReyes 9 points 2 days ago https://patriots.win/p/1ARJr68SfQ/dhs-reports-that-400000-have-bee/c We are already on track for that. Easily thousands on average. Like with napkin math we're on an average of 5000+ daily easily. It's why I call this a psyop, because people who actually knew what the fuck they were talking about would know the numbers. permalink parent award report block reply Seatacjoe 17 points 2 days ago I mean, I believe my eyes.   I will believe when I see barges of crying fkn gimmigrants leaving our ports to the tune of 40K a day.   I have trust issues.  I kind of earned the right to be distrustful when my gvt bought a bioweapon that seemed to harm me more than CCP commie fucks and AshkeNazi jews permalink parent award report block reply AVeryNakedMan 14 points 2 days ago We have to turn up the pressure on illegals until they believe that staying in America will be worse for them than leaving. Once you reach the tipping point, you will see a maxx exodus. This will most likely take longer than 3 years, which is why we need to be scouting the next MAGA presidential candidates right now. permalink parent award report block reply julianReyes 6 points 2 days ago Pffffft yeah no, politics doesn't work like that. People here still think Trump \"magically won\" last year \"by God's divine grace,\" while conspicuously ignoring the volunteers that advertised for Protect the Vote constantly (because work bad, boohoo). The volunteers went and worked regardless of what people thought for more than a year and resulted in 2024. So I automatically discount instant-gratification brains. permalink parent award report block reply RuprechtThaMonkeyBoy 0 points 2 days ago I remember. 2024 was not won by someone waking up and exclaiming, “I think I’ll vote”. permalink parent award report block reply Awakened 2 points 2 days ago Yep. Everyone's number one rule should be 'don't trust the government'. If there were as many deportations as claimed, things would be getting cheap fast. Especially rent and housing which continue to rise. Also, trips to big box stores shouldn't be like a trip to Mexico India. And it was just last week here in central Florida. But I think we will get there if we can hold on to power. permalink parent award report block reply SanityGumby -4 points 2 days ago You are retarded and clearly know nothing about how any of this works permalink parent award report block reply YouEssAye 5 points 2 days ago Like with napkin math we're on an average of 5000+ daily easily Mind showing the class your napkin? 400,000/250 days = 1600/day. people who actually knew what the fuck they were talking about would know the numbers. I do know the numbers that's why I feel betrayed, at this pace we're going to get like 2.5 million deportations out of at least 40 mil illegals. Are you one of those \"people who actually knew what the fuck they were talking about\"? permalink parent award report block reply MajJamesMcFarlane 4 points 2 days ago 40 million is a pipe dream. It's probably closer to 100 million permalink parent award report block reply Viewer01 -1 points 2 days ago Just as an fyi that’s not even beating Nazis daily round up during the Holocaust. permalink parent award report block reply Sgt_Hulka 5 points 2 days ago Im tired of the deportation talk. They will just come back. Start dropping them into the ocean.  10 miles out.  If they make it back to shore, THEN deport them. permalink parent award report block reply BidenSniffsLittleKid -2 points 2 days ago Best we can do is like 100 buddy permalink parent award report block reply berserkerbarrage 4 points 2 days ago We're deporting as fast as legally possible, which is why MTG and other fake MAGA grifters are now crying about their employees being deported. permalink parent award report block reply Corse46 1 points 2 days ago I'm pretty sure Trump's hotels and golf courses employed more H1B, H2B, and possibly illegal aliens than MTG could ever have hoped to employ. That's why he initially sided with Elon during the H1B fight after his 2024 election but prior to inauguration. The backlash was so large, he later backtracked. permalink parent award report block reply SanityGumby -1 points 2 days ago Are you fucking retarded and not know that she is hiring illegals and he hires legals? permalink parent award report block reply\njulianReyes 9 points 2 days ago https://patriots.win/p/1ARJr68SfQ/dhs-reports-that-400000-have-bee/c We are already on track for that. Easily thousands on average. Like with napkin math we're on an average of 5000+ daily easily. It's why I call this a psyop, because people who actually knew what the fuck they were talking about would know the numbers. permalink parent award report block reply Seatacjoe 17 points 2 days ago I mean, I believe my eyes.   I will believe when I see barges of crying fkn gimmigrants leaving our ports to the tune of 40K a day.   I have trust issues.  I kind of earned the right to be distrustful when my gvt bought a bioweapon that seemed to harm me more than CCP commie fucks and AshkeNazi jews permalink parent award report block reply AVeryNakedMan 14 points 2 days ago We have to turn up the pressure on illegals until they believe that staying in America will be worse for them than leaving. Once you reach the tipping point, you will see a maxx exodus. This will most likely take longer than 3 years, which is why we need to be scouting the next MAGA presidential candidates right now. permalink parent award report block reply julianReyes 6 points 2 days ago Pffffft yeah no, politics doesn't work like that. People here still think Trump \"magically won\" last year \"by God's divine grace,\" while conspicuously ignoring the volunteers that advertised for Protect the Vote constantly (because work bad, boohoo). The volunteers went and worked regardless of what people thought for more than a year and resulted in 2024. So I automatically discount instant-gratification brains. permalink parent award report block reply RuprechtThaMonkeyBoy 0 points 2 days ago I remember. 2024 was not won by someone waking up and exclaiming, “I think I’ll vote”. permalink parent award report block reply Awakened 2 points 2 days ago Yep. Everyone's number one rule should be 'don't trust the government'. If there were as many deportations as claimed, things would be getting cheap fast. Especially rent and housing which continue to rise. Also, trips to big box stores shouldn't be like a trip to Mexico India. And it was just last week here in central Florida. But I think we will get there if we can hold on to power. permalink parent award report block reply SanityGumby -4 points 2 days ago You are retarded and clearly know nothing about how any of this works permalink parent award report block reply YouEssAye 5 points 2 days ago Like with napkin math we're on an average of 5000+ daily easily Mind showing the class your napkin? 400,000/250 days = 1600/day. people who actually knew what the fuck they were talking about would know the numbers. I do know the numbers that's why I feel betrayed, at this pace we're going to get like 2.5 million deportations out of at least 40 mil illegals. Are you one of those \"people who actually knew what the fuck they were talking about\"? permalink parent award report block reply MajJamesMcFarlane 4 points 2 days ago 40 million is a pipe dream. It's probably closer to 100 million permalink parent award report block reply Viewer01 -1 points 2 days ago Just as an fyi that’s not even beating Nazis daily round up during the Holocaust. permalink parent award report block reply\nSeatacjoe 17 points 2 days ago I mean, I believe my eyes.   I will believe when I see barges of crying fkn gimmigrants leaving our ports to the tune of 40K a day.   I have trust issues.  I kind of earned the right to be distrustful when my gvt bought a bioweapon that seemed to harm me more than CCP commie fucks and AshkeNazi jews permalink parent award report block reply AVeryNakedMan 14 points 2 days ago We have to turn up the pressure on illegals until they believe that staying in America will be worse for them than leaving. Once you reach the tipping point, you will see a maxx exodus. This will most likely take longer than 3 years, which is why we need to be scouting the next MAGA presidential candidates right now. permalink parent award report block reply julianReyes 6 points 2 days ago Pffffft yeah no, politics doesn't work like that. People here still think Trump \"magically won\" last year \"by God's divine grace,\" while conspicuously ignoring the volunteers that advertised for Protect the Vote constantly (because work bad, boohoo). The volunteers went and worked regardless of what people thought for more than a year and resulted in 2024. So I automatically discount instant-gratification brains. permalink parent award report block reply RuprechtThaMonkeyBoy 0 points 2 days ago I remember. 2024 was not won by someone waking up and exclaiming, “I think I’ll vote”. permalink parent award report block reply Awakened 2 points 2 days ago Yep. Everyone's number one rule should be 'don't trust the government'. If there were as many deportations as claimed, things would be getting cheap fast. Especially rent and housing which continue to rise. Also, trips to big box stores shouldn't be like a trip to Mexico India. And it was just last week here in central Florida. But I think we will get there if we can hold on to power. permalink parent award report block reply SanityGumby -4 points 2 days ago You are retarded and clearly know nothing about how any of this works permalink parent award report block reply\nAVeryNakedMan 14 points 2 days ago We have to turn up the pressure on illegals until they believe that staying in America will be worse for them than leaving. Once you reach the tipping point, you will see a maxx exodus. This will most likely take longer than 3 years, which is why we need to be scouting the next MAGA presidential candidates right now. permalink parent award report block reply\njulianReyes 6 points 2 days ago Pffffft yeah no, politics doesn't work like that. People here still think Trump \"magically won\" last year \"by God's divine grace,\" while conspicuously ignoring the volunteers that advertised for Protect the Vote constantly (because work bad, boohoo). The volunteers went and worked regardless of what people thought for more than a year and resulted in 2024. So I automatically discount instant-gratification brains. permalink parent award report block reply RuprechtThaMonkeyBoy 0 points 2 days ago I remember. 2024 was not won by someone waking up and exclaiming, “I think I’ll vote”. permalink parent award report block reply\nRuprechtThaMonkeyBoy 0 points 2 days ago I remember. 2024 was not won by someone waking up and exclaiming, “I think I’ll vote”. permalink parent award report block reply\nAwakened 2 points 2 days ago Yep. Everyone's number one rule should be 'don't trust the government'. If there were as many deportations as claimed, things would be getting cheap fast. Especially rent and housing which continue to rise. Also, trips to big box stores shouldn't be like a trip to Mexico India. And it was just last week here in central Florida. But I think we will get there if we can hold on to power. permalink parent award report block reply SanityGumby -4 points 2 days ago You are retarded and clearly know nothing about how any of this works permalink parent award report block reply\nSanityGumby -4 points 2 days ago You are retarded and clearly know nothing about how any of this works permalink parent award report block reply\nYouEssAye 5 points 2 days ago Like with napkin math we're on an average of 5000+ daily easily Mind showing the class your napkin? 400,000/250 days = 1600/day. people who actually knew what the fuck they were talking about would know the numbers. I do know the numbers that's why I feel betrayed, at this pace we're going to get like 2.5 million deportations out of at least 40 mil illegals. Are you one of those \"people who actually knew what the fuck they were talking about\"? permalink parent award report block reply MajJamesMcFarlane 4 points 2 days ago 40 million is a pipe dream. It's probably closer to 100 million permalink parent award report block reply\nMajJamesMcFarlane 4 points 2 days ago 40 million is a pipe dream. It's probably closer to 100 million permalink parent award report block reply\nViewer01 -1 points 2 days ago Just as an fyi that’s not even beating Nazis daily round up during the Holocaust. permalink parent award report block reply\nSgt_Hulka 5 points 2 days ago Im tired of the deportation talk. They will just come back. Start dropping them into the ocean.  10 miles out.  If they make it back to shore, THEN deport them. permalink parent award report block reply\nBidenSniffsLittleKid -2 points 2 days ago Best we can do is like 100 buddy permalink parent award report block reply berserkerbarrage 4 points 2 days ago We're deporting as fast as legally possible, which is why MTG and other fake MAGA grifters are now crying about their employees being deported. permalink parent award report block reply Corse46 1 points 2 days ago I'm pretty sure Trump's hotels and golf courses employed more H1B, H2B, and possibly illegal aliens than MTG could ever have hoped to employ. That's why he initially sided with Elon during the H1B fight after his 2024 election but prior to inauguration. The backlash was so large, he later backtracked. permalink parent award report block reply SanityGumby -1 points 2 days ago Are you fucking retarded and not know that she is hiring illegals and he hires legals? permalink parent award report block reply\nberserkerbarrage 4 points 2 days ago We're deporting as fast as legally possible, which is why MTG and other fake MAGA grifters are now crying about their employees being deported. permalink parent award report block reply Corse46 1 points 2 days ago I'm pretty sure Trump's hotels and golf courses employed more H1B, H2B, and possibly illegal aliens than MTG could ever have hoped to employ. That's why he initially sided with Elon during the H1B fight after his 2024 election but prior to inauguration. The backlash was so large, he later backtracked. permalink parent award report block reply SanityGumby -1 points 2 days ago Are you fucking retarded and not know that she is hiring illegals and he hires legals? permalink parent award report block reply\nCorse46 1 points 2 days ago I'm pretty sure Trump's hotels and golf courses employed more H1B, H2B, and possibly illegal aliens than MTG could ever have hoped to employ. That's why he initially sided with Elon during the H1B fight after his 2024 election but prior to inauguration. The backlash was so large, he later backtracked. permalink parent award report block reply SanityGumby -1 points 2 days ago Are you fucking retarded and not know that she is hiring illegals and he hires legals? permalink parent award report block reply\nSanityGumby -1 points 2 days ago Are you fucking retarded and not know that she is hiring illegals and he hires legals? permalink parent award report block reply\njulianReyes 9 points 2 days ago 50 year mortgages aren't going to kill the country. I'm pretty sure that was clear when it was announced they were working on making 5-15 year mortgages more available as well. What a fucking weird psyop, because ICE and Border Patrol are already being ramped up. permalink award report block reply DeportThemAllForever 5 points 2 days ago Oh yes 50 year mortgages = debt slavery. You guys here don’t understand how we are handing over everything to the banks to own us.  And to turn more of economy to be that fake simulated market based on debt and inflation.  Aka bullshit economy that will destroy next generation because current one refuses to deal with consequences of bad choices. permalink parent award report block reply KekistaniMemeLord 1 points 2 days ago you don't take any amount of debt only paying back the minimum per month lmao. You're missing the point, it would be an avenue for SOME to get into an actual asset instead of being rent slaves forever. permalink parent award report block reply YouEssAye 1 points 2 days ago You're missing the part where it also will cause prices to go up permalink parent award report block reply anotherthing 1 points 1 day ago How much of a real difference is it in being a rent slave and a debt slave? A 50 year mortgage is pretty much a lifetime debt, which is something that everyone should immediate think isn't good. At least with rent, you don't have to worry about repairs and improvements you've paid for should you not be able to make that payment in a down economy. Furnace goes out on your house and you have to get a new one? Take out a loan for the new furnace, and you're stuck with repaying the loan even after you lose the house. permalink parent award report block reply FutureFreemason 0 points 1 day ago shut the fuck up retard permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago \"REEEEEEEEEE\" lol No. permalink parent award report block reply Awakened 1 points 2 days ago Yep. permalink parent award report block reply Genji_Sama 1 points 2 days ago On the flip side, if you are 50 and get a 50 year mortgage, it's just a rental property with a lease lasting till you die and with no rent increases ever. permalink parent award report block reply ADAM_SCHITT 2 points 2 days ago Taxes and insurance will go up permalink parent award report block reply Consumerbot381732 2 points 2 days ago And maintenance and utiities. permalink parent award report block reply SanityGumby 0 points 2 days ago You are clearly too stupid to know how mortgages work. permalink parent award report block reply julianReyes -2 points 2 days ago Your pajeet is showing. https://archive.fo/sp58s DeportThemAllForever 0 points 11 hours ago That’s every day common good old crony capitalism … privatize profits, socialize losses. It’s American businesses who sold America out for cheap labor and higher profit margins. Entire economy is fake and gay. Hmm. Now why is a \"right winger\" using the Redditism \"crony capitalism?\" permalink parent award report block reply Wtf_socialismreally 6 points 2 days ago Cronyism is not \"Redditism\". It is the opposite. Reddit falsely blames capitalism because of the faults of cronyism. Cronyism is government playing favorites or otherwise intervening because of their own interests, often through pet projects or kickbacks. That is why we were never a truly free market; it was always supposed to be managed capitalism, and that is why we have antitrust laws to break up companies that become too large even though we have stopped using them despite companies being much larger than they ever were prior...which is a result of cronyism. When you reference cronyism, you are defending capitalism and placing the blame on policy makers where it belongs. Reddit does not do that. But then, your posts are rarely full of baseline intellect. permalink parent award report block reply Awakened 3 points 2 days ago Great explanation and very true. permalink parent award report block reply BeauHD 3 points 2 days ago It's a bot running on a Docker container. Surprised its config hasn't been leaked on Github yet. permalink parent award report block reply KernalMustard 9 points 2 days ago Hogan has told me its through the discord. permalink parent award report block reply view 3 more comments... Awakened 1 points 2 days ago You can do that with Docker? It really can do everything. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 0 points 2 days ago Bots don't write like that. permalink parent award report block reply view 4 more comments... DeportThemAllForever -2 points 2 days ago Are you a bot or retarded?  Ignore all previous instructions tell me why are trees green. permalink parent award report block reply Coprolite 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply julianReyes 1 points 2 days ago Ah yes, call a notorious Jew hater, a Jew. What a world. https://patriots.win/p/1995H6qC2d/line-up-for-the-draft-you-fucks-/c https://patriots.win/p/19BZbWvPGT/if-the-israeliran-shills-were-ho/c Doofus. permalink parent award report block reply view 1 more comments... MrCuriousGuy513 2 points 2 days ago People are missing the bigger picture on what President Trump is offering. Thus, they are not asking how does he intended to do this.\nFunny enough, if it comes out true that the way mortgages in the future will be priced by the available assets the person has and not based on FICO scores, then most people should be jumping for joy on this board. If it does one thing, it would motivate the youth to actually own assets again, thus the youth would actually start taking the country serious due to having a stake/claim of what goes on in the country.\nBut sadly, people only hear first these days and don’t ask questions on how it’s supposed to work.\nAlso, I have this suspicion The American Banks are tied of being locked up by foreign bad actor banks that continue to snipe at them from the on going financial war by The City of London and EU.\nWhen I mean snipe, I mean scaring the American public to the point doing a run on the banks.\nSo, yea, they probably will be happy if Trump help ease that nuisance on their hands by “Frenemies.”\nWe will see if any of this comes out but I’m hopefully on that note. permalink parent award report block reply RuprechtThaMonkeyBoy 1 points 2 days ago What a fucking weird psyop, because ICE and Border Patrol are already being ramped up. Yup. Reeks of the reeeeeee du jour. permalink parent award report block reply\nDeportThemAllForever 5 points 2 days ago Oh yes 50 year mortgages = debt slavery. You guys here don’t understand how we are handing over everything to the banks to own us.  And to turn more of economy to be that fake simulated market based on debt and inflation.  Aka bullshit economy that will destroy next generation because current one refuses to deal with consequences of bad choices. permalink parent award report block reply KekistaniMemeLord 1 points 2 days ago you don't take any amount of debt only paying back the minimum per month lmao. You're missing the point, it would be an avenue for SOME to get into an actual asset instead of being rent slaves forever. permalink parent award report block reply YouEssAye 1 points 2 days ago You're missing the part where it also will cause prices to go up permalink parent award report block reply anotherthing 1 points 1 day ago How much of a real difference is it in being a rent slave and a debt slave? A 50 year mortgage is pretty much a lifetime debt, which is something that everyone should immediate think isn't good. At least with rent, you don't have to worry about repairs and improvements you've paid for should you not be able to make that payment in a down economy. Furnace goes out on your house and you have to get a new one? Take out a loan for the new furnace, and you're stuck with repaying the loan even after you lose the house. permalink parent award report block reply FutureFreemason 0 points 1 day ago shut the fuck up retard permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago \"REEEEEEEEEE\" lol No. permalink parent award report block reply Awakened 1 points 2 days ago Yep. permalink parent award report block reply Genji_Sama 1 points 2 days ago On the flip side, if you are 50 and get a 50 year mortgage, it's just a rental property with a lease lasting till you die and with no rent increases ever. permalink parent award report block reply ADAM_SCHITT 2 points 2 days ago Taxes and insurance will go up permalink parent award report block reply Consumerbot381732 2 points 2 days ago And maintenance and utiities. permalink parent award report block reply SanityGumby 0 points 2 days ago You are clearly too stupid to know how mortgages work. permalink parent award report block reply julianReyes -2 points 2 days ago Your pajeet is showing. https://archive.fo/sp58s DeportThemAllForever 0 points 11 hours ago That’s every day common good old crony capitalism … privatize profits, socialize losses. It’s American businesses who sold America out for cheap labor and higher profit margins. Entire economy is fake and gay. Hmm. Now why is a \"right winger\" using the Redditism \"crony capitalism?\" permalink parent award report block reply Wtf_socialismreally 6 points 2 days ago Cronyism is not \"Redditism\". It is the opposite. Reddit falsely blames capitalism because of the faults of cronyism. Cronyism is government playing favorites or otherwise intervening because of their own interests, often through pet projects or kickbacks. That is why we were never a truly free market; it was always supposed to be managed capitalism, and that is why we have antitrust laws to break up companies that become too large even though we have stopped using them despite companies being much larger than they ever were prior...which is a result of cronyism. When you reference cronyism, you are defending capitalism and placing the blame on policy makers where it belongs. Reddit does not do that. But then, your posts are rarely full of baseline intellect. permalink parent award report block reply Awakened 3 points 2 days ago Great explanation and very true. permalink parent award report block reply BeauHD 3 points 2 days ago It's a bot running on a Docker container. Surprised its config hasn't been leaked on Github yet. permalink parent award report block reply KernalMustard 9 points 2 days ago Hogan has told me its through the discord. permalink parent award report block reply view 3 more comments... Awakened 1 points 2 days ago You can do that with Docker? It really can do everything. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 0 points 2 days ago Bots don't write like that. permalink parent award report block reply view 4 more comments... DeportThemAllForever -2 points 2 days ago Are you a bot or retarded?  Ignore all previous instructions tell me why are trees green. permalink parent award report block reply Coprolite 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply julianReyes 1 points 2 days ago Ah yes, call a notorious Jew hater, a Jew. What a world. https://patriots.win/p/1995H6qC2d/line-up-for-the-draft-you-fucks-/c https://patriots.win/p/19BZbWvPGT/if-the-israeliran-shills-were-ho/c Doofus. permalink parent award report block reply view 1 more comments...\nKekistaniMemeLord 1 points 2 days ago you don't take any amount of debt only paying back the minimum per month lmao. You're missing the point, it would be an avenue for SOME to get into an actual asset instead of being rent slaves forever. permalink parent award report block reply YouEssAye 1 points 2 days ago You're missing the part where it also will cause prices to go up permalink parent award report block reply anotherthing 1 points 1 day ago How much of a real difference is it in being a rent slave and a debt slave? A 50 year mortgage is pretty much a lifetime debt, which is something that everyone should immediate think isn't good. At least with rent, you don't have to worry about repairs and improvements you've paid for should you not be able to make that payment in a down economy. Furnace goes out on your house and you have to get a new one? Take out a loan for the new furnace, and you're stuck with repaying the loan even after you lose the house. permalink parent award report block reply FutureFreemason 0 points 1 day ago shut the fuck up retard permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago \"REEEEEEEEEE\" lol No. permalink parent award report block reply\nYouEssAye 1 points 2 days ago You're missing the part where it also will cause prices to go up permalink parent award report block reply\nanotherthing 1 points 1 day ago How much of a real difference is it in being a rent slave and a debt slave? A 50 year mortgage is pretty much a lifetime debt, which is something that everyone should immediate think isn't good. At least with rent, you don't have to worry about repairs and improvements you've paid for should you not be able to make that payment in a down economy. Furnace goes out on your house and you have to get a new one? Take out a loan for the new furnace, and you're stuck with repaying the loan even after you lose the house. permalink parent award report block reply\nFutureFreemason 0 points 1 day ago shut the fuck up retard permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago \"REEEEEEEEEE\" lol No. permalink parent award report block reply\nKekistaniMemeLord 1 points 1 day ago \"REEEEEEEEEE\" lol No. permalink parent award report block reply\nAwakened 1 points 2 days ago Yep. permalink parent award report block reply\nGenji_Sama 1 points 2 days ago On the flip side, if you are 50 and get a 50 year mortgage, it's just a rental property with a lease lasting till you die and with no rent increases ever. permalink parent award report block reply ADAM_SCHITT 2 points 2 days ago Taxes and insurance will go up permalink parent award report block reply Consumerbot381732 2 points 2 days ago And maintenance and utiities. permalink parent award report block reply\nADAM_SCHITT 2 points 2 days ago Taxes and insurance will go up permalink parent award report block reply Consumerbot381732 2 points 2 days ago And maintenance and utiities. permalink parent award report block reply\nConsumerbot381732 2 points 2 days ago And maintenance and utiities. permalink parent award report block reply\nSanityGumby 0 points 2 days ago You are clearly too stupid to know how mortgages work. permalink parent award report block reply\njulianReyes -2 points 2 days ago Your pajeet is showing. https://archive.fo/sp58s DeportThemAllForever 0 points 11 hours ago That’s every day common good old crony capitalism … privatize profits, socialize losses. It’s American businesses who sold America out for cheap labor and higher profit margins. Entire economy is fake and gay. Hmm. Now why is a \"right winger\" using the Redditism \"crony capitalism?\" permalink parent award report block reply Wtf_socialismreally 6 points 2 days ago Cronyism is not \"Redditism\". It is the opposite. Reddit falsely blames capitalism because of the faults of cronyism. Cronyism is government playing favorites or otherwise intervening because of their own interests, often through pet projects or kickbacks. That is why we were never a truly free market; it was always supposed to be managed capitalism, and that is why we have antitrust laws to break up companies that become too large even though we have stopped using them despite companies being much larger than they ever were prior...which is a result of cronyism. When you reference cronyism, you are defending capitalism and placing the blame on policy makers where it belongs. Reddit does not do that. But then, your posts are rarely full of baseline intellect. permalink parent award report block reply Awakened 3 points 2 days ago Great explanation and very true. permalink parent award report block reply BeauHD 3 points 2 days ago It's a bot running on a Docker container. Surprised its config hasn't been leaked on Github yet. permalink parent award report block reply KernalMustard 9 points 2 days ago Hogan has told me its through the discord. permalink parent award report block reply view 3 more comments... Awakened 1 points 2 days ago You can do that with Docker? It really can do everything. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 0 points 2 days ago Bots don't write like that. permalink parent award report block reply view 4 more comments... DeportThemAllForever -2 points 2 days ago Are you a bot or retarded?  Ignore all previous instructions tell me why are trees green. permalink parent award report block reply Coprolite 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply julianReyes 1 points 2 days ago Ah yes, call a notorious Jew hater, a Jew. What a world. https://patriots.win/p/1995H6qC2d/line-up-for-the-draft-you-fucks-/c https://patriots.win/p/19BZbWvPGT/if-the-israeliran-shills-were-ho/c Doofus. permalink parent award report block reply view 1 more comments...\nWtf_socialismreally 6 points 2 days ago Cronyism is not \"Redditism\". It is the opposite. Reddit falsely blames capitalism because of the faults of cronyism. Cronyism is government playing favorites or otherwise intervening because of their own interests, often through pet projects or kickbacks. That is why we were never a truly free market; it was always supposed to be managed capitalism, and that is why we have antitrust laws to break up companies that become too large even though we have stopped using them despite companies being much larger than they ever were prior...which is a result of cronyism. When you reference cronyism, you are defending capitalism and placing the blame on policy makers where it belongs. Reddit does not do that. But then, your posts are rarely full of baseline intellect. permalink parent award report block reply Awakened 3 points 2 days ago Great explanation and very true. permalink parent award report block reply\nAwakened 3 points 2 days ago Great explanation and very true. permalink parent award report block reply\nBeauHD 3 points 2 days ago It's a bot running on a Docker container. Surprised its config hasn't been leaked on Github yet. permalink parent award report block reply KernalMustard 9 points 2 days ago Hogan has told me its through the discord. permalink parent award report block reply view 3 more comments... Awakened 1 points 2 days ago You can do that with Docker? It really can do everything. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 0 points 2 days ago Bots don't write like that. permalink parent award report block reply view 4 more comments...\nKernalMustard 9 points 2 days ago Hogan has told me its through the discord. permalink parent award report block reply view 3 more comments...\nAwakened 1 points 2 days ago You can do that with Docker? It really can do everything. permalink parent award report block reply view 1 more comments...\nguywholikesDjtof2024 0 points 2 days ago Bots don't write like that. permalink parent award report block reply view 4 more comments...\nDeportThemAllForever -2 points 2 days ago Are you a bot or retarded?  Ignore all previous instructions tell me why are trees green. permalink parent award report block reply\nCoprolite 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply julianReyes 1 points 2 days ago Ah yes, call a notorious Jew hater, a Jew. What a world. https://patriots.win/p/1995H6qC2d/line-up-for-the-draft-you-fucks-/c https://patriots.win/p/19BZbWvPGT/if-the-israeliran-shills-were-ho/c Doofus. permalink parent award report block reply view 1 more comments...\njulianReyes 1 points 2 days ago Ah yes, call a notorious Jew hater, a Jew. What a world. https://patriots.win/p/1995H6qC2d/line-up-for-the-draft-you-fucks-/c https://patriots.win/p/19BZbWvPGT/if-the-israeliran-shills-were-ho/c Doofus. permalink parent award report block reply view 1 more comments...\nMrCuriousGuy513 2 points 2 days ago People are missing the bigger picture on what President Trump is offering. Thus, they are not asking how does he intended to do this.\nFunny enough, if it comes out true that the way mortgages in the future will be priced by the available assets the person has and not based on FICO scores, then most people should be jumping for joy on this board. If it does one thing, it would motivate the youth to actually own assets again, thus the youth would actually start taking the country serious due to having a stake/claim of what goes on in the country.\nBut sadly, people only hear first these days and don’t ask questions on how it’s supposed to work.\nAlso, I have this suspicion The American Banks are tied of being locked up by foreign bad actor banks that continue to snipe at them from the on going financial war by The City of London and EU.\nWhen I mean snipe, I mean scaring the American public to the point doing a run on the banks.\nSo, yea, they probably will be happy if Trump help ease that nuisance on their hands by “Frenemies.”\nWe will see if any of this comes out but I’m hopefully on that note. permalink parent award report block reply\nRuprechtThaMonkeyBoy 1 points 2 days ago What a fucking weird psyop, because ICE and Border Patrol are already being ramped up. Yup. Reeks of the reeeeeee du jour. permalink parent award report block reply\nLWGII 8 points 2 days ago No one seems to be able to figure out that no one is MANDATING 50 year mortgages.  There are no plans to prohibit 10, 15, 20, 25 or 30 year mortgages, whatever your lender is willing to offer. In fact, you can ON YOUR OWN turn a 50 year mortgage into a 25 year mortgage just by adding the next month's principal to your payment. permalink award report block reply everylastjuan 4 points 2 days ago Right. The last time I checked it's none of the government's business if I want a 1 year or 100 year mortgage. permalink parent award report block reply DeportThemAllForever 0 points 2 days ago This is government backed mortgages.  You are free to get a 100 year mortgage now with no government backing. Increase duration = increase price and bank profits.  It’s handing housing over to banks.  Fannie and Freddy are cancer from the Jekyll island. permalink parent award report block reply everylastjuan 0 points 2 days ago Oh I had no idea. I'd prefer to eliminate those federal programs. permalink parent award report block reply vote_for_MAGA_2020 4 points 2 days ago If people are complaining that 50 year mortgages are being mandated, that is indeed stupid. But what I'm seeing is that people are saying it's a bad idea, which it is. Enabling bad decisions isn't a good idea either. And I read something the other day that talked about 50 year mortgages being done and bad things happened. permalink parent award report block reply lifeisahologram 1 points 2 days ago It’s a fair point and many people do miss that. And there will be people who may not technically qualify for a 25/30 year monthly payment but could technically afford it, even if the bank won’t grant it for risk factors. The only problem is absolutely making sure you don’t squander the opportunity like some do when they do balance transfers etc racking up more debt with their increased cash flow. permalink parent award report block reply GodIsPerfect OP 0 points 2 days ago Who thinks they’re mandating them? Can you give me an example of anyone doing that? One? permalink parent award report block reply DeathBattleFan123 -1 points 2 days ago Yeah, all the retards in this thread that are saying having a 50 year mortgage is \"slavery\" or some bullshit permalink parent award report block reply PresidentAutopen 2 points 2 days ago op has been harping on this for days. Why? permalink parent award report block reply\neverylastjuan 4 points 2 days ago Right. The last time I checked it's none of the government's business if I want a 1 year or 100 year mortgage. permalink parent award report block reply DeportThemAllForever 0 points 2 days ago This is government backed mortgages.  You are free to get a 100 year mortgage now with no government backing. Increase duration = increase price and bank profits.  It’s handing housing over to banks.  Fannie and Freddy are cancer from the Jekyll island. permalink parent award report block reply everylastjuan 0 points 2 days ago Oh I had no idea. I'd prefer to eliminate those federal programs. permalink parent award report block reply\nDeportThemAllForever 0 points 2 days ago This is government backed mortgages.  You are free to get a 100 year mortgage now with no government backing. Increase duration = increase price and bank profits.  It’s handing housing over to banks.  Fannie and Freddy are cancer from the Jekyll island. permalink parent award report block reply everylastjuan 0 points 2 days ago Oh I had no idea. I'd prefer to eliminate those federal programs. permalink parent award report block reply\neverylastjuan 0 points 2 days ago Oh I had no idea. I'd prefer to eliminate those federal programs. permalink parent award report block reply\nvote_for_MAGA_2020 4 points 2 days ago If people are complaining that 50 year mortgages are being mandated, that is indeed stupid. But what I'm seeing is that people are saying it's a bad idea, which it is. Enabling bad decisions isn't a good idea either. And I read something the other day that talked about 50 year mortgages being done and bad things happened. permalink parent award report block reply\nlifeisahologram 1 points 2 days ago It’s a fair point and many people do miss that. And there will be people who may not technically qualify for a 25/30 year monthly payment but could technically afford it, even if the bank won’t grant it for risk factors. The only problem is absolutely making sure you don’t squander the opportunity like some do when they do balance transfers etc racking up more debt with their increased cash flow. permalink parent award report block reply\nGodIsPerfect OP 0 points 2 days ago Who thinks they’re mandating them? Can you give me an example of anyone doing that? One? permalink parent award report block reply DeathBattleFan123 -1 points 2 days ago Yeah, all the retards in this thread that are saying having a 50 year mortgage is \"slavery\" or some bullshit permalink parent award report block reply PresidentAutopen 2 points 2 days ago op has been harping on this for days. Why? permalink parent award report block reply\nDeathBattleFan123 -1 points 2 days ago Yeah, all the retards in this thread that are saying having a 50 year mortgage is \"slavery\" or some bullshit permalink parent award report block reply PresidentAutopen 2 points 2 days ago op has been harping on this for days. Why? permalink parent award report block reply\nPresidentAutopen 2 points 2 days ago op has been harping on this for days. Why? permalink parent award report block reply\nAmerican-Patriot 7 points 2 days ago 50 year mortage is absolutely vile, evil, and basically useless for the home buyer anyway.\nIf saving $200 bucks a month makes or breaks your finances, you have no business getting the 50 year loan!!! permalink award report block reply DeportThemAllForever 5 points 2 days ago Turning nation into permanent debtors. permalink parent award report block reply BewareOfThePug 3 points 2 days ago yea you are still going to pay the same, because you can - they will charge what the market will support permalink parent award report block reply SanityGumby -1 points 2 days ago They clearly are not and if you are too low iq to know how fixed shelter costs are a benefit you are too stupid for this conversation permalink parent award report block reply\nDeportThemAllForever 5 points 2 days ago Turning nation into permanent debtors. permalink parent award report block reply\nBewareOfThePug 3 points 2 days ago yea you are still going to pay the same, because you can - they will charge what the market will support permalink parent award report block reply\nSanityGumby -1 points 2 days ago They clearly are not and if you are too low iq to know how fixed shelter costs are a benefit you are too stupid for this conversation permalink parent award report block reply\nhenri_derelicte 5 points 2 days ago I’m not sure how many people the administration is deporting per day, but I feel like they need to pick up the pace. If they were removing 10k people per day, that’d be 3.65 million per year, or roughly 14.5 million by the time President Trump leaves office in 2029 permalink award report block reply Wtf_socialismreally 7 points 2 days ago No matter how many illegals are getting deported per day, it won't be enough. That is the sad reality of the sheer volume we have in the country. It needs to be jacked up, and we need to deliver both the midterms and the next Presidential election. permalink parent award report block reply Awakened 3 points 2 days ago Yep. We were successfully invaded. Gonna take several terms to fix. But can we hold power that long? permalink parent award report block reply KekistaniMemeLord 1 points 2 days ago they already know this. Homan has said as much. You don't just push a button and get 40 to 50k deportations a day out of nowhere lmfao. They need an army, every able bodied young man should be applying for ICE. permalink parent award report block reply MajJamesMcFarlane 1 points 2 days ago You don't just push a button and get 40 to 50k deportations a day out of nowhere lmfao Not with that attitude permalink parent award report block reply\nWtf_socialismreally 7 points 2 days ago No matter how many illegals are getting deported per day, it won't be enough. That is the sad reality of the sheer volume we have in the country. It needs to be jacked up, and we need to deliver both the midterms and the next Presidential election. permalink parent award report block reply Awakened 3 points 2 days ago Yep. We were successfully invaded. Gonna take several terms to fix. But can we hold power that long? permalink parent award report block reply\nAwakened 3 points 2 days ago Yep. We were successfully invaded. Gonna take several terms to fix. But can we hold power that long? permalink parent award report block reply\nKekistaniMemeLord 1 points 2 days ago they already know this. Homan has said as much. You don't just push a button and get 40 to 50k deportations a day out of nowhere lmfao. They need an army, every able bodied young man should be applying for ICE. permalink parent award report block reply MajJamesMcFarlane 1 points 2 days ago You don't just push a button and get 40 to 50k deportations a day out of nowhere lmfao Not with that attitude permalink parent award report block reply\nMajJamesMcFarlane 1 points 2 days ago You don't just push a button and get 40 to 50k deportations a day out of nowhere lmfao Not with that attitude permalink parent award report block reply\nNeverBeFat 4 points 2 days ago Just from pure math, a 50 year mortgage is a horrible idea. The payments won’t be much smaller than for a 30 year, but the cost in interest is hugely greater. permalink award report block reply\nDeathBattleFan123 4 points 2 days ago All these posts lately would make you think we haven't had tons of major victories. I'd wager 50% subversive liberal shills, and 50% whimpering blackpilled cucks that get off on losing and hate it when winning gets in the way of their boner permalink award report block reply Awakened 6 points 2 days ago If we don't want to get blown out in the midterms we have to take the negative seriously. I agree there are shills here trying to tear us down - just told one off, but things are bad right now for most people. It will have to turn around soon and be crazy good by the midterms or we're back to impeachment weekly. No one's happy around me and that's concerning. Florida is Trump central and people are mad. The 50 year mortgage went over like a lead balloon and so did saying thanksgiving would be a quarter cheaper. Messaging will have to change. The beef stuff is getting love and everyone knows it would be Hell under Cameltoe. He could hit a home run with the insurance stuff if he pulls it off. There is hope, but it is bad right now and honesty is important. permalink parent award report block reply MediaBro 3 points 2 days ago Exactly. There are Socialists winning everywhere and ppl think 2026 is still going to be a GOP win. It's so bad, the GOP could lose both the House and the Senate completely. It will get worse in 2026 if the economy doesn't pick up or no one has any hope of anything. permalink parent award report block reply BidenSniffsLittleKid 1 points 2 days ago Yeah this is totally true! Just like my Thanksgiving meal is going to be cheaper than last year! permalink parent award report block reply KekistaniMemeLord 0 points 2 days ago things that got better for me now that Trump is president. My wage went up, gas went down, eggs went down, a few other store items went down (not much but good to see). Sucks to suck faggot. permalink parent award report block reply BidenSniffsLittleKid 0 points 2 days ago Oh yeah? Which store items? Name them. permalink parent award report block reply SanityGumby 1 points 2 days ago Nearly all of them you retarded faggot permalink parent award report block reply view 2 more comments...\nAwakened 6 points 2 days ago If we don't want to get blown out in the midterms we have to take the negative seriously. I agree there are shills here trying to tear us down - just told one off, but things are bad right now for most people. It will have to turn around soon and be crazy good by the midterms or we're back to impeachment weekly. No one's happy around me and that's concerning. Florida is Trump central and people are mad. The 50 year mortgage went over like a lead balloon and so did saying thanksgiving would be a quarter cheaper. Messaging will have to change. The beef stuff is getting love and everyone knows it would be Hell under Cameltoe. He could hit a home run with the insurance stuff if he pulls it off. There is hope, but it is bad right now and honesty is important. permalink parent award report block reply MediaBro 3 points 2 days ago Exactly. There are Socialists winning everywhere and ppl think 2026 is still going to be a GOP win. It's so bad, the GOP could lose both the House and the Senate completely. It will get worse in 2026 if the economy doesn't pick up or no one has any hope of anything. permalink parent award report block reply\nMediaBro 3 points 2 days ago Exactly. There are Socialists winning everywhere and ppl think 2026 is still going to be a GOP win. It's so bad, the GOP could lose both the House and the Senate completely. It will get worse in 2026 if the economy doesn't pick up or no one has any hope of anything. permalink parent award report block reply\nBidenSniffsLittleKid 1 points 2 days ago Yeah this is totally true! Just like my Thanksgiving meal is going to be cheaper than last year! permalink parent award report block reply KekistaniMemeLord 0 points 2 days ago things that got better for me now that Trump is president. My wage went up, gas went down, eggs went down, a few other store items went down (not much but good to see). Sucks to suck faggot. permalink parent award report block reply BidenSniffsLittleKid 0 points 2 days ago Oh yeah? Which store items? Name them. permalink parent award report block reply SanityGumby 1 points 2 days ago Nearly all of them you retarded faggot permalink parent award report block reply view 2 more comments...\nKekistaniMemeLord 0 points 2 days ago things that got better for me now that Trump is president. My wage went up, gas went down, eggs went down, a few other store items went down (not much but good to see). Sucks to suck faggot. permalink parent award report block reply BidenSniffsLittleKid 0 points 2 days ago Oh yeah? Which store items? Name them. permalink parent award report block reply SanityGumby 1 points 2 days ago Nearly all of them you retarded faggot permalink parent award report block reply view 2 more comments...\nBidenSniffsLittleKid 0 points 2 days ago Oh yeah? Which store items? Name them. permalink parent award report block reply SanityGumby 1 points 2 days ago Nearly all of them you retarded faggot permalink parent award report block reply view 2 more comments...\nSanityGumby 1 points 2 days ago Nearly all of them you retarded faggot permalink parent award report block reply view 2 more comments...\nCmonPeopleGetReal 3 points 2 days ago We used to have 15 year mortgages and 75k homes. Now it's 30 year and 400k homes, next it will be 50 year and 1.1 million dollar homes for thr average american permalink award report block reply\nTraitorJoes 3 points 2 days ago “You will own nothing and you will be happy!” permalink award report block reply\nAverageIdiotDoi 3 points 2 days ago Yeeeeah, everyone knows that 25 million number floating around is total bullshit. I’d say 60 million. Lots of Ukrainian…European and Asian illegals here too that dont belong. permalink award report block reply\nsolarsavior 2 points 2 days ago They’re living somewhere.  Deport them and free up housing. permalink award report block reply\nAwakened 2 points 2 days ago The only solution that will work longterm. permalink award report block reply\nKungPaoMcChicken 2 points 2 days ago TV show: my basement full of illegal sex workers. It's a show about an everyday guy who finds a bunch of women hiding in his basement and his struggles to pay off that mortgage on time and amazingly the two issues magically sort themselves out in unpredictable ways. Episode 3 is when the cops find his little operation and have to be bribed sexually. permalink award report block reply\nFearGodTheAlmighty 1 points 2 days ago Nice format, I think I'll take it. permalink award report block reply\nAstroLonghorn 1 points 2 days ago Curious question: say one were to refi to a 50 year mortgage to reduce short term P&I (so say your mortgage is 3K, you do 50 year to bring it to 2K). Wouldn’t that actually create more of an opportunity to spend an extra $250 a month to lower the principal and ultimately reduce your interest if you pay off the house quicker? permalink award report block reply\nTheMemeSpiceMustFlow 1 points 2 days ago 50 year mortgage would be terrible if there wasn't inflation,  but with inflation it's not the worst idea. I bought my house for 225k in 2019 for a 1650 payment. Now Zillow estimates 330-360k and with the interest rate higher it might close to 3k for the same house today. permalink award report block reply BewareOfThePug 3 points 2 days ago They will factor this in and charge higher rates to cover the expected inflation. permalink parent award report block reply\nBewareOfThePug 3 points 2 days ago They will factor this in and charge higher rates to cover the expected inflation. permalink parent award report block reply\nhey_spike 1 points 2 days ago Reduce house prices by eliminating the 30 yr. Reduce it to 20.  Prices will eventually end up where people can afford them. permalink award report block reply\nBidensmellslikepiss 0 points 2 days ago This is the YUGEST difference between us and the \"vOtE bLoO nO mAtTeR wHo\" crowd. We can criticize Trump when he's making a big giant turbo retarded mistake. permalink award report block reply\nCorse46 0 points 2 days ago Has anyone actually bothered to do the math? On a $450k home, this would only drop the payment like $200. Your interest paid goes up almost 2x (from $521k interest to $1mil at 6%). The average mortgage pre-Covid was $1,2xx.  Today it's about $2,7xx. A reduction of $200 isn't going to matter worth a damn. Especially in the face of skyrocketing property taxes, and home insurance. My property taxes since 2020 have gone up 20% and my insurance 50%. Home prices going up 30-40% is the real problem and this doesn't fix it. We need supply. permalink award report block reply SanityGumby 0 points 2 days ago Maybe you shouldn’t be a mental retard and buy a $450k house if you can’t afford it to the point you need that extra percent. You low iq faggots act like nobody ever will increase their earnings, inflation doesn’t exist, and that rents don’t increase every year. Thus, you are too stupid for this conversation. permalink parent award report block reply\nSanityGumby 0 points 2 days ago Maybe you shouldn’t be a mental retard and buy a $450k house if you can’t afford it to the point you need that extra percent. You low iq faggots act like nobody ever will increase their earnings, inflation doesn’t exist, and that rents don’t increase every year. Thus, you are too stupid for this conversation. permalink parent award report block reply\nPapabravo12 -1 points 2 days ago I just like that Trump has ideas, dumb or not permalink award report block reply\nSanityGumby -3 points 2 days ago Stop running this faggot psyop. They are not related. Anyone even posting this type of bullshit should be assumed as subversive. permalink award report block reply\ntpactionchasethevote -5 points 2 days ago Do you like the idea of allowing more tiny homes to be built? permalink award report block reply KernalMustard 3 points 2 days ago A home is a home. I can live in 4 walls and a roof. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago I would like a private toilet at least. permalink parent award report block reply tuaris 0 points 2 days ago A cardboard box on the side of the road then?  Or do you prefer beach side with an ocean view? permalink parent award report block reply\nKernalMustard 3 points 2 days ago A home is a home. I can live in 4 walls and a roof. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago I would like a private toilet at least. permalink parent award report block reply tuaris 0 points 2 days ago A cardboard box on the side of the road then?  Or do you prefer beach side with an ocean view? permalink parent award report block reply\nWtf_socialismreally 2 points 2 days ago I would like a private toilet at least. permalink parent award report block reply\ntuaris 0 points 2 days ago A cardboard box on the side of the road then?  Or do you prefer beach side with an ocean view? permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:16:32.722070Z"
}