{
  "id": "8183024",
  "title": "1208Shutdown Deal Will Allow Senators to Sue Over “Arctic Frost” Probe(thelibertydaily.com)posted1 d",
  "url": "https://patriots.win/p/1ARK9l6ug8/shutdown-deal-will-allow-senator/c",
  "content": "1208 Shutdown Deal Will Allow Senators to Sue Over “Arctic Frost” Probe (thelibertydaily.com) posted 1 day ago by Sea_Still 55 comments award share report block Shutdown Deal Will Allow Senators to Sue Over \"Arctic Frost\" Probe - 🔔 The Liberty Daily If you love the news, check out The Liberty Daily's homepage. (DCNF)—GOP lawmakers secured a provision in the shutdown deal taking aim at the Biden FBI’s “Arctic Frost” surveillance campaign into a vast swath of Republicans and conservative entities. The m... thelibertydaily.com\n55 comments Sort by Top Top New Worst Old Save wharfthrowaway 76 points 1 day ago So the senators will get a payout but no corrupt officials will go to jail is what it seems like. permalink award report block reply BrianOfNazareth 18 points 1 day ago Not even that much, since it’ll likely wind up in the DC circuit. permalink parent award report block reply Deportthemall23 10 points 1 day ago The problem with suing the government is that the government doesn't care because it's not spending its own money.. It's spending YOUR money That's why jail time is more effective.. Every government official wants to spend your money.. none of them wanna go to jail permalink parent award report block reply Deportthemall23 14 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply Gletkin 5 points 1 day ago This is also why public sector unions should not exist. It’s not the workers vs the bosses; it’s the workers vs the taxpayers, where the taxpayers aren’t even allowed twenty miles from the negotiations. permalink parent award report block reply 24601 2 points 1 day ago Death penalty is good too.... However, there is a pathway to financial accountability for Federal Employees.... https://www.doi.gov/ethics/government-wide-ethics-laws The laws are in place.  They just need to be enforced. permalink parent award report block reply MastaJoda 1 points 1 day ago Comment removed because its the obvious position to have in the face of tyranny. permalink parent award report block reply spezisacuckold 1 points 1 day ago That's a huge reason why I'm a huge advocate of mandatory minimum terms of imprisonment, imposed without prosecutorial or judicial discretion to waive or substitute a non-custodial sentence. permalink parent award report block reply BirthHole 1 points 1 day ago If lawmakers were held accountable, then they wouldnt be able to skirt the law and get away with it. permalink parent award report block reply Viewer01 11 points 1 day ago My politics now include hanging traitors on the White House lawn. permalink parent award report block reply MastaJoda 5 points 1 day ago Welcome to party friend. Its a lonely position in world full of vote harders. permalink parent award report block reply Aggrieved03 3 points 1 day ago We'll pay for the lawyers of both sides and any payout. Epic Winning! permalink parent award report block reply Kraken_V_Algorithm 1 points 1 day ago I doubt many will go for it.  Discovery goes both ways. permalink parent award report block reply TheSwampThang 22 points 1 day ago Sure.  Somehow I know there will never be discovery. permalink award report block reply NeverArgueWithIdiots 13 points 1 day ago Its classified. Sources and methods. National Security. permalink parent award report block reply TheSwampThang 5 points 1 day ago Some of the good folk at the doj and fbi could get caught up in accountability. permalink parent award report block reply Fuckwit2023 1 points 18 hours ago Good folks at the FBI????? What the fuck ate you even talking about????? permalink parent award report block reply AbrahamLincoln 21 points 1 day ago Fucking grifters, we don't want fines that go to senators personally, paid with our tax dollars. permalink award report block reply IncredibleMrE1 16 points 1 day ago Isn't it amazing how quickly they can act to protect themselves when they are the victims of Lawfare, while doing nothing except maybe sending a sternly worded letter when the victim is Trump or us? permalink award report block reply PoshityLifeOfTrump 2 points 18 hours ago Yes, no outrage and lawsuits over spying on Americans.\nNo big concessions to destroy the people who ruined the lives of J6ers over nothing.\nBut the privacy of a few elite faggots was invaded? Got to get special concessions and use any available leverage to make that be answered for... permalink parent award report block reply TEXinLA 10 points 1 day ago Popcorn & Beer. permalink award report block reply SisterCovfefeToo 8 points 1 day ago Priorities permalink award report block reply Logan051361 8 points 1 day ago Sue? Toss these crooked fucks in Jail permalink award report block reply Cianevalies 7 points 22 hours ago Yep . Let’s allow Senators to graft from the government just because they had their conversations released. Nothing about this impacts individuals because it’s all taxpayer money. permalink award report block reply OldZilla 5 points 1 day ago Great. More money for the grubbers. How about jail the fucking criminal judges and investigators? Na.... Let's spend more of my tax money making my representatives richer. Fuck that. permalink award report block reply MastaJoda 1 points 1 day ago Uh oh, someone is not MAGAing☝ permalink parent award report block reply heightnoise 4 points 24 hours ago Wonder what this has to do with \"a 'clean' CR to fund the government...\" 😒 permalink award report block reply Yz450f 4 points 1 day ago Who pays when they sue??? The taxpayers? permalink award report block reply CleanUpPhillyTrump24 4 points 1 day ago Uh I think they're \"allowed\" to sue without some kind of special add on to the CR. If they're going to do this then make it possible for every one illegally surveilled to get a half million payout. No more special treatment for Congress. permalink award report block reply _Sully_ 2 points 1 day ago You just need to learn politician speak. This just means they'll allow it without obstructing in exchange for immunity. It's always like a God damn demented genie who grants wishes but they all have a terrible catch that completely ruins the wish if it doesn't just kill you. permalink parent award report block reply Bilbobaggins 3 points 1 day ago SO Senators can sue, but the DOJ libs can still target everyone else? Classic Republicans permalink award report block reply Xtwitter 2 points 1 day ago Sue this sue that everything is sueing permalink award report block reply Shitnooo 2 points 23 hours ago I want Jack Smith to be buried as far down as possible so shit like that never rises again. permalink award report block reply xBigCoffinHunter 2 points 22 hours ago So they took care of themselves, what about some special provisions for the J6 victims? permalink award report block reply JBlaze056 2 points 1 day ago Seems these representatives of the American citizens only seem to care when something personally impacts them. permalink award report block reply gaijin_ronin 2 points 1 day ago 2 more weeks.  Not even remotely funny at this point. permalink award report block reply BusterHyman99 2 points 24 hours ago Sue the taxpayers? Basically permalink award report block reply Dems-R-Dumb 2 points 1 day ago The targeted GOP senators are more interested in getting a payout than seeing corrupt government officials get prosecuted. That is a great example of how our entire government runs today. permalink award report block reply emorphia 2 points 1 day ago it will allow them.  but will they ? , and what obama judge will rule on it ? permalink award report block reply MastaJoda 1 points 1 day ago lol ☝This guy thinks there are two sides in DC permalink parent award report block reply emorphia 1 points 1 day ago if there is only 1 side , then what is MAGA ? , same as uniparty ?  or ? permalink parent award report block reply Mulletgunning 2 points 1 day ago So now that they were spied on its time to get serious? What a fucking joke. They all were part of the illegal invasion,J6 stolen election debacle and prosecution of patriots and Covid theft,murder scam. The Uniparty 535 are our number one enemy. Every last one of them. MAGA AF permalink award report block reply IvIA6A 2 points 1 day ago Sounds like a grift to me. Allows them to sue and get 500k per violation according to the article. Nothing about criminal prosecutions of Jack Smith or his thugs permalink award report block reply mojorisen 1 points 1 day ago Unless you can sue the judges and operatives personally, this is shit.  Why would they give a fuck if the tax payers have to pay for their crimes? permalink award report block reply NewGoldenAge 1 points 1 day ago No wonder they didn't want to reopen. permalink award report block reply Goatboy66 1 points 1 day ago Sue and Criminally Charge the Traitors... permalink award report block reply Dantalian 1 points 23 hours ago I won't hold my breath. permalink award report block reply DrVSGGEOTUSPhD 1 points 1 day ago what did they yell? permalink award report block reply learntocode 1 points 1 day ago Sue the government and collect OUR $$$? Or, sue the perpetrators in civil court? permalink award report block reply Reclaimer69 1 points 1 day ago More excuses for \"representatives\" to take my money. permalink award report block reply Fistfullofgreyhair 1 points 1 day ago WTF.  They don’t need more money, they need to dole out justice to traitors.  This world is fucking toast. permalink award report block reply JoyousMischief 1 points 1 day ago Controlled op act like controlled op. permalink award report block reply Losferwords 1 points 1 day ago It's just another wealth transfer. We are not winning. permalink award report block reply SmellyButtFart 1 points 1 day ago Faaaake.  Shutdown deal prohibits FBI from getting senators phone records in the future permalink award report block reply MastaJoda 1 points 1 day ago while lettings those who were spied on seek civil lawsuits. You fucking lying, bootlicking POS. permalink parent award report block reply Cuntgoblin 1 points 1 day ago US citizens, not so much. permalink award report block reply\nwharfthrowaway 76 points 1 day ago So the senators will get a payout but no corrupt officials will go to jail is what it seems like. permalink award report block reply BrianOfNazareth 18 points 1 day ago Not even that much, since it’ll likely wind up in the DC circuit. permalink parent award report block reply Deportthemall23 10 points 1 day ago The problem with suing the government is that the government doesn't care because it's not spending its own money.. It's spending YOUR money That's why jail time is more effective.. Every government official wants to spend your money.. none of them wanna go to jail permalink parent award report block reply Deportthemall23 14 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply Gletkin 5 points 1 day ago This is also why public sector unions should not exist. It’s not the workers vs the bosses; it’s the workers vs the taxpayers, where the taxpayers aren’t even allowed twenty miles from the negotiations. permalink parent award report block reply 24601 2 points 1 day ago Death penalty is good too.... However, there is a pathway to financial accountability for Federal Employees.... https://www.doi.gov/ethics/government-wide-ethics-laws The laws are in place.  They just need to be enforced. permalink parent award report block reply MastaJoda 1 points 1 day ago Comment removed because its the obvious position to have in the face of tyranny. permalink parent award report block reply spezisacuckold 1 points 1 day ago That's a huge reason why I'm a huge advocate of mandatory minimum terms of imprisonment, imposed without prosecutorial or judicial discretion to waive or substitute a non-custodial sentence. permalink parent award report block reply BirthHole 1 points 1 day ago If lawmakers were held accountable, then they wouldnt be able to skirt the law and get away with it. permalink parent award report block reply Viewer01 11 points 1 day ago My politics now include hanging traitors on the White House lawn. permalink parent award report block reply MastaJoda 5 points 1 day ago Welcome to party friend. Its a lonely position in world full of vote harders. permalink parent award report block reply Aggrieved03 3 points 1 day ago We'll pay for the lawyers of both sides and any payout. Epic Winning! permalink parent award report block reply Kraken_V_Algorithm 1 points 1 day ago I doubt many will go for it.  Discovery goes both ways. permalink parent award report block reply\nBrianOfNazareth 18 points 1 day ago Not even that much, since it’ll likely wind up in the DC circuit. permalink parent award report block reply Deportthemall23 10 points 1 day ago The problem with suing the government is that the government doesn't care because it's not spending its own money.. It's spending YOUR money That's why jail time is more effective.. Every government official wants to spend your money.. none of them wanna go to jail permalink parent award report block reply Deportthemall23 14 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply Gletkin 5 points 1 day ago This is also why public sector unions should not exist. It’s not the workers vs the bosses; it’s the workers vs the taxpayers, where the taxpayers aren’t even allowed twenty miles from the negotiations. permalink parent award report block reply 24601 2 points 1 day ago Death penalty is good too.... However, there is a pathway to financial accountability for Federal Employees.... https://www.doi.gov/ethics/government-wide-ethics-laws The laws are in place.  They just need to be enforced. permalink parent award report block reply MastaJoda 1 points 1 day ago Comment removed because its the obvious position to have in the face of tyranny. permalink parent award report block reply spezisacuckold 1 points 1 day ago That's a huge reason why I'm a huge advocate of mandatory minimum terms of imprisonment, imposed without prosecutorial or judicial discretion to waive or substitute a non-custodial sentence. permalink parent award report block reply BirthHole 1 points 1 day ago If lawmakers were held accountable, then they wouldnt be able to skirt the law and get away with it. permalink parent award report block reply\nDeportthemall23 10 points 1 day ago The problem with suing the government is that the government doesn't care because it's not spending its own money.. It's spending YOUR money That's why jail time is more effective.. Every government official wants to spend your money.. none of them wanna go to jail permalink parent award report block reply\nDeportthemall23 14 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply Gletkin 5 points 1 day ago This is also why public sector unions should not exist. It’s not the workers vs the bosses; it’s the workers vs the taxpayers, where the taxpayers aren’t even allowed twenty miles from the negotiations. permalink parent award report block reply 24601 2 points 1 day ago Death penalty is good too.... However, there is a pathway to financial accountability for Federal Employees.... https://www.doi.gov/ethics/government-wide-ethics-laws The laws are in place.  They just need to be enforced. permalink parent award report block reply MastaJoda 1 points 1 day ago Comment removed because its the obvious position to have in the face of tyranny. permalink parent award report block reply spezisacuckold 1 points 1 day ago That's a huge reason why I'm a huge advocate of mandatory minimum terms of imprisonment, imposed without prosecutorial or judicial discretion to waive or substitute a non-custodial sentence. permalink parent award report block reply BirthHole 1 points 1 day ago If lawmakers were held accountable, then they wouldnt be able to skirt the law and get away with it. permalink parent award report block reply\nGletkin 5 points 1 day ago This is also why public sector unions should not exist. It’s not the workers vs the bosses; it’s the workers vs the taxpayers, where the taxpayers aren’t even allowed twenty miles from the negotiations. permalink parent award report block reply\n24601 2 points 1 day ago Death penalty is good too.... However, there is a pathway to financial accountability for Federal Employees.... https://www.doi.gov/ethics/government-wide-ethics-laws The laws are in place.  They just need to be enforced. permalink parent award report block reply\nMastaJoda 1 points 1 day ago Comment removed because its the obvious position to have in the face of tyranny. permalink parent award report block reply\nspezisacuckold 1 points 1 day ago That's a huge reason why I'm a huge advocate of mandatory minimum terms of imprisonment, imposed without prosecutorial or judicial discretion to waive or substitute a non-custodial sentence. permalink parent award report block reply\nBirthHole 1 points 1 day ago If lawmakers were held accountable, then they wouldnt be able to skirt the law and get away with it. permalink parent award report block reply\nViewer01 11 points 1 day ago My politics now include hanging traitors on the White House lawn. permalink parent award report block reply MastaJoda 5 points 1 day ago Welcome to party friend. Its a lonely position in world full of vote harders. permalink parent award report block reply\nMastaJoda 5 points 1 day ago Welcome to party friend. Its a lonely position in world full of vote harders. permalink parent award report block reply\nAggrieved03 3 points 1 day ago We'll pay for the lawyers of both sides and any payout. Epic Winning! permalink parent award report block reply\nKraken_V_Algorithm 1 points 1 day ago I doubt many will go for it.  Discovery goes both ways. permalink parent award report block reply\nTheSwampThang 22 points 1 day ago Sure.  Somehow I know there will never be discovery. permalink award report block reply NeverArgueWithIdiots 13 points 1 day ago Its classified. Sources and methods. National Security. permalink parent award report block reply TheSwampThang 5 points 1 day ago Some of the good folk at the doj and fbi could get caught up in accountability. permalink parent award report block reply Fuckwit2023 1 points 18 hours ago Good folks at the FBI????? What the fuck ate you even talking about????? permalink parent award report block reply\nNeverArgueWithIdiots 13 points 1 day ago Its classified. Sources and methods. National Security. permalink parent award report block reply TheSwampThang 5 points 1 day ago Some of the good folk at the doj and fbi could get caught up in accountability. permalink parent award report block reply Fuckwit2023 1 points 18 hours ago Good folks at the FBI????? What the fuck ate you even talking about????? permalink parent award report block reply\nTheSwampThang 5 points 1 day ago Some of the good folk at the doj and fbi could get caught up in accountability. permalink parent award report block reply Fuckwit2023 1 points 18 hours ago Good folks at the FBI????? What the fuck ate you even talking about????? permalink parent award report block reply\nFuckwit2023 1 points 18 hours ago Good folks at the FBI????? What the fuck ate you even talking about????? permalink parent award report block reply\nAbrahamLincoln 21 points 1 day ago Fucking grifters, we don't want fines that go to senators personally, paid with our tax dollars. permalink award report block reply\nIncredibleMrE1 16 points 1 day ago Isn't it amazing how quickly they can act to protect themselves when they are the victims of Lawfare, while doing nothing except maybe sending a sternly worded letter when the victim is Trump or us? permalink award report block reply PoshityLifeOfTrump 2 points 18 hours ago Yes, no outrage and lawsuits over spying on Americans.\nNo big concessions to destroy the people who ruined the lives of J6ers over nothing.\nBut the privacy of a few elite faggots was invaded? Got to get special concessions and use any available leverage to make that be answered for... permalink parent award report block reply\nPoshityLifeOfTrump 2 points 18 hours ago Yes, no outrage and lawsuits over spying on Americans.\nNo big concessions to destroy the people who ruined the lives of J6ers over nothing.\nBut the privacy of a few elite faggots was invaded? Got to get special concessions and use any available leverage to make that be answered for... permalink parent award report block reply\nTEXinLA 10 points 1 day ago Popcorn & Beer. permalink award report block reply\nSisterCovfefeToo 8 points 1 day ago Priorities permalink award report block reply\nLogan051361 8 points 1 day ago Sue? Toss these crooked fucks in Jail permalink award report block reply\nCianevalies 7 points 22 hours ago Yep . Let’s allow Senators to graft from the government just because they had their conversations released. Nothing about this impacts individuals because it’s all taxpayer money. permalink award report block reply\nOldZilla 5 points 1 day ago Great. More money for the grubbers. How about jail the fucking criminal judges and investigators? Na.... Let's spend more of my tax money making my representatives richer. Fuck that. permalink award report block reply MastaJoda 1 points 1 day ago Uh oh, someone is not MAGAing☝ permalink parent award report block reply\nMastaJoda 1 points 1 day ago Uh oh, someone is not MAGAing☝ permalink parent award report block reply\nheightnoise 4 points 24 hours ago Wonder what this has to do with \"a 'clean' CR to fund the government...\" 😒 permalink award report block reply\nYz450f 4 points 1 day ago Who pays when they sue??? The taxpayers? permalink award report block reply\nCleanUpPhillyTrump24 4 points 1 day ago Uh I think they're \"allowed\" to sue without some kind of special add on to the CR. If they're going to do this then make it possible for every one illegally surveilled to get a half million payout. No more special treatment for Congress. permalink award report block reply _Sully_ 2 points 1 day ago You just need to learn politician speak. This just means they'll allow it without obstructing in exchange for immunity. It's always like a God damn demented genie who grants wishes but they all have a terrible catch that completely ruins the wish if it doesn't just kill you. permalink parent award report block reply\n_Sully_ 2 points 1 day ago You just need to learn politician speak. This just means they'll allow it without obstructing in exchange for immunity. It's always like a God damn demented genie who grants wishes but they all have a terrible catch that completely ruins the wish if it doesn't just kill you. permalink parent award report block reply\nBilbobaggins 3 points 1 day ago SO Senators can sue, but the DOJ libs can still target everyone else? Classic Republicans permalink award report block reply\nXtwitter 2 points 1 day ago Sue this sue that everything is sueing permalink award report block reply\nShitnooo 2 points 23 hours ago I want Jack Smith to be buried as far down as possible so shit like that never rises again. permalink award report block reply\nxBigCoffinHunter 2 points 22 hours ago So they took care of themselves, what about some special provisions for the J6 victims? permalink award report block reply\nJBlaze056 2 points 1 day ago Seems these representatives of the American citizens only seem to care when something personally impacts them. permalink award report block reply\ngaijin_ronin 2 points 1 day ago 2 more weeks.  Not even remotely funny at this point. permalink award report block reply\nBusterHyman99 2 points 24 hours ago Sue the taxpayers? Basically permalink award report block reply\nDems-R-Dumb 2 points 1 day ago The targeted GOP senators are more interested in getting a payout than seeing corrupt government officials get prosecuted. That is a great example of how our entire government runs today. permalink award report block reply\nemorphia 2 points 1 day ago it will allow them.  but will they ? , and what obama judge will rule on it ? permalink award report block reply MastaJoda 1 points 1 day ago lol ☝This guy thinks there are two sides in DC permalink parent award report block reply emorphia 1 points 1 day ago if there is only 1 side , then what is MAGA ? , same as uniparty ?  or ? permalink parent award report block reply\nMastaJoda 1 points 1 day ago lol ☝This guy thinks there are two sides in DC permalink parent award report block reply emorphia 1 points 1 day ago if there is only 1 side , then what is MAGA ? , same as uniparty ?  or ? permalink parent award report block reply\nemorphia 1 points 1 day ago if there is only 1 side , then what is MAGA ? , same as uniparty ?  or ? permalink parent award report block reply\nMulletgunning 2 points 1 day ago So now that they were spied on its time to get serious? What a fucking joke. They all were part of the illegal invasion,J6 stolen election debacle and prosecution of patriots and Covid theft,murder scam. The Uniparty 535 are our number one enemy. Every last one of them. MAGA AF permalink award report block reply\nIvIA6A 2 points 1 day ago Sounds like a grift to me. Allows them to sue and get 500k per violation according to the article. Nothing about criminal prosecutions of Jack Smith or his thugs permalink award report block reply\nmojorisen 1 points 1 day ago Unless you can sue the judges and operatives personally, this is shit.  Why would they give a fuck if the tax payers have to pay for their crimes? permalink award report block reply\nNewGoldenAge 1 points 1 day ago No wonder they didn't want to reopen. permalink award report block reply\nGoatboy66 1 points 1 day ago Sue and Criminally Charge the Traitors... permalink award report block reply\nDantalian 1 points 23 hours ago I won't hold my breath. permalink award report block reply\nDrVSGGEOTUSPhD 1 points 1 day ago what did they yell? permalink award report block reply\nlearntocode 1 points 1 day ago Sue the government and collect OUR $$$? Or, sue the perpetrators in civil court? permalink award report block reply\nReclaimer69 1 points 1 day ago More excuses for \"representatives\" to take my money. permalink award report block reply\nFistfullofgreyhair 1 points 1 day ago WTF.  They don’t need more money, they need to dole out justice to traitors.  This world is fucking toast. permalink award report block reply\nJoyousMischief 1 points 1 day ago Controlled op act like controlled op. permalink award report block reply\nLosferwords 1 points 1 day ago It's just another wealth transfer. We are not winning. permalink award report block reply\nSmellyButtFart 1 points 1 day ago Faaaake.  Shutdown deal prohibits FBI from getting senators phone records in the future permalink award report block reply MastaJoda 1 points 1 day ago while lettings those who were spied on seek civil lawsuits. You fucking lying, bootlicking POS. permalink parent award report block reply\nMastaJoda 1 points 1 day ago while lettings those who were spied on seek civil lawsuits. You fucking lying, bootlicking POS. permalink parent award report block reply\nCuntgoblin 1 points 1 day ago US citizens, not so much. permalink award report block reply",
  "fetched_at": "2025-11-12T20:14:56.476304Z"
}