{
  "id": "1ARK9hipNg",
  "url": "https://patriots.win/p/1ARK9hipNg/antnio-guterres-has-called-for-t/c",
  "content": "991 António Guterres has called for tighter control of social media, claiming that “false narratives” threaten the UN’s Agenda 2030 goals and global stability. posted 2 days ago by Eruditio 99 comments award share report block Jim Ferguson @JimFergusonUK • 3d 🚨 UN CHIEF DEMANDS CENSORSHIP CRACKDOWN António Guterres has called for tighter control of social media, claiming that “false narratives” threaten the UN’s Agenda 2030 goals and global stability. He condemned what he called “a tsunami of conspiracy theories” and demanded\n99 comments Sort by Top Top New Worst Old Save deleted 95 points 2 days ago D__1 38 points 2 days ago The best way to fight \"false narratives\"  is with transparency and the free and open exchange of information so I'm curious why you'd think you need more censorship... permalink parent award report block reply GatoradeJeb 4 points 2 days ago We have cuckservatives on this forum openly celebrsting and calling for more censorship and online id laws because \"think of muh kids\" and \"dont you dare access muh website\" permalink parent award report block reply Owmyballz -1 points 2 days ago if you are upset about voter id you are in the wrong forum, head over to democunts. permalink parent award report block reply GatoradeJeb 3 points 2 days ago You are retarded if think voter id = online id to view websites permalink parent award report block reply SicSemperTyrannis2 1 points 2 days ago I don't think it's voter ID he's complaining about, but I'll let him clarify that permalink parent award report block reply view 6 more comments... HoganT -10 points 2 days ago Yet you want to revoke media licenses when they say what you don't want to hear. permalink parent award report block reply snoopy3210 7 points 2 days ago For outright fraud, like doctoring a Presidential speech, you moron. Or inciting violence against Republicans and lying about a murder investigation on TV. permalink parent award report block reply they-see-me-trollin 6 points 2 days ago first off, we're not talking about \"what you don't want to hear\".  we're talking about very disprovable lies, of which there is no genuine or legitimate dispute and we're not talking about media licenses... we were talking about broadcast licenses.  ABC and CBS are not just media companies.  they're broadcasters, who have exclusive use over public airwaves.   MSNBC, CNN, and Fox News Channel are free to post absolute drivel on cable and online subject only to defamation laws.  but NBC, ABC, CBS, CW, and Fox Local cannot send out the same over broadcast because they agree not to as part of the broadcast license that gives them exclusive radio waves into your home. and in the UK with the falsified Trump video pushed by BBC, they violated the BBC charter as well as UK law, and there were even internal memos admitting they knew what they were doing was illegal. so no, you have no idea what you're talking about. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago I certainly would revoke this leftist's license from posting here. permalink parent award report block reply snoopy3210 1 points 2 days ago Guterres attacks Bill Gates! 😆 permalink parent award report block reply USDMaga 18 points 2 days ago The UN supports child sex trafficking worldwide.  He doesn't want people saying it. permalink parent award report block reply Granny 9 points 2 days ago Bottom line: with the constant, eternal flow of information among human beings, there is, always has been, and always will be both good and bad information. It's up to the individuals to be discerning, and they must do it themselves - no \"big brothers\" to do it for them!!! permalink parent award report block reply SicSemperTyrannis2 2 points 2 days ago Exactly! Also: I am cornholio, are you threatening me? The UN meets the TP Nazi - no TP for U! (N) permalink parent award report block reply Christineblaseyford 1 points 2 days ago If it weren't true fat boy wouldn't give a fuck about it becoming public. permalink parent award report block reply Trumpwonbidencheated 47 points 2 days ago The UN is a criminal and terrorist organization. permalink award report block reply that_sound 10 points 2 days ago Get the US out of the UN. Get the UN out of the US. permalink parent award report block reply SicSemperTyrannis2 -1 points 2 days ago Has become that way, and continually gets worse. US should've gotten out in the 80's at the latest. permalink parent award report block reply South_Florida_Guy 42 points 2 days ago Remember how they all cried about Trump's big evil agenda 2025 plan? It was always just projection to distract from their own 2030 agenda. permalink award report block reply Chickensaurus 13 points 2 days ago Remember when Obama gave away ICANN? Pepe Farms remembers. permalink parent award report block reply GatoradeJeb 3 points 2 days ago I remember when this forum called out the uk online id tyranny and then cuckservservatives on this forum called for the same laws here for websites becuase \"think of muh kids\" as they dont want to parent permalink parent award report block reply Mortal_Wombat 28 points 2 days ago TL;DL: \"If you love your country and don't want it ruined by people who have zero fucks to give...you're a bigot.\" permalink award report block reply duehuckleberry 28 points 2 days ago He deserves the same answer that 4chan attorneys gave to the UK when they said the same thing: YOU HAVE NO POWER HERE. EAT SHIT. permalink award report block reply Psarg 6 points 2 days ago 4chan is a weird psyop now. permalink parent award report block reply Nibba2 6 points 2 days ago It’s all Indian now. The whole process of shutting down good websites that have good info is stated out on the internet, but the process is to spam it with dumb stuff and make it uninteresting and unusable. Well, Israel moved on from spamming black cocks to spamming Indian nonsense. permalink parent award report block reply HenkZeilstra 21 points 2 days ago Disband the UN, it is the NWO, throw the SDG into the dustbin, fuck them permalink award report block reply rebuildingMyself 7 points 2 days ago All we'd have to do is stop funding our share of it and it would collapse overnight permalink parent award report block reply crashdaddy 18 points 2 days ago The most obvious solution to all those problems he listed is to simply ban the UN. permalink award report block reply MEME-SUPREME 15 points 2 days ago POUND SAND UP YOUR ASS 🖕 permalink award report block reply SomeGuyOnTheInternet 13 points 2 days ago If they didn't run so many conspiracies, we wouldn't need so many theories. permalink award report block reply worldowedexplanation 6 points 2 days ago Need this on a bumper sticker, “I have a lot of theories because the government has a lot of conspiracies” permalink parent award report block reply PRMan 13 points 2 days ago FUCK YOU how bout that and ur global agenda permalink award report block reply Ridiculous_bullshit 13 points 2 days ago I thought Agenda 2030 was a baseless conspiracy theory that just happens to be posted on the UN website. permalink award report block reply Zskills 14 points 2 days ago It's like replacement migration. Literally on their website and it's fine for them to publicly celebrate it but it's a conspiracy theory and problematic if you say they're doing it and you aren't happy about being ethnically cleansed by bioweapons from afghanistan. permalink parent award report block reply GatoradeJeb 5 points 2 days ago Its worse than that they brainwashed White woman to racemix with brown/black turds to humiliate White man more as they make us watch our own replacement both in demographics of the country and our own woman being racemixing race traitors permalink parent award report block reply SicSemperTyrannis2 -1 points 2 days ago Oi, you got a loicense for all that noticing? permalink parent award report block reply DingleBalls 10 points 2 days ago Well rheyre not false and yes part of the point is to undermine Agenda 2030 and anything else the UN tries permalink award report block reply cbonez416 9 points 2 days ago Talked about climate change being under attack. You mean your narratives are under attack. Cuz you're narrative is a fake. Oh by the way, maybe he didn't hear Bill Gates say that climate change isn't a threat and that all climate models were wrong !! permalink award report block reply zooty 6 points 2 days ago To be fair, Bill Gates current bullshit involves using huge amount of energy now so his priorities have changed. But the same applies to when he held the climate change bullshit too. It's a shame the guy will never see the inside of a jail cell for his nonsense and all we'll have is the old mugshot and the pie attack. permalink parent award report block reply cbonez416 4 points 2 days ago The AI is hungry!! Must feed it electric and water!! permalink parent award report block reply zooty 2 points 2 days ago The sooner the bubble bursts, the better. permalink parent award report block reply MeMargie 9 points 2 days ago UN is a terrorist org. defund disband STAT permalink award report block reply TooBright 9 points 2 days ago They say words are violence. I say silencing my words is a transgression upon me. permalink award report block reply Dev404 7 points 2 days ago They have instability because they've funded an invasion of foreigners into their countries for their own profit. Social media has exposed this and they don't like it because people are realizing that they're getting fucked over and the government and their NGOs are the ones behind it all. permalink award report block reply ProfessorJagoff 7 points 2 days ago And he can go straight to hell. permalink award report block reply cd3dog 7 points 2 days ago 'Threaten the UN’s Agenda'....   sounds good to me. permalink award report block reply awsure 7 points 2 days ago I am calling for fewer controls. I’m nobody and suspect I’m more influential than this fuck-face faggot. permalink award report block reply DontTreadOnLego 7 points 2 days ago KICK THE UN OUT OF THE US permalink award report block reply YodaBannon 6 points 2 days ago TRUMP WON BIATCH! permalink award report block reply MythArcana 6 points 2 days ago Agenda 2030 is anti-Trump bullshit, and we aren't doing any of that. Yes, I'm talking about Newsom. permalink award report block reply terribletwos 4 points 2 days ago That's a wild thing to say out loud. permalink award report block reply HenkZeilstra 4 points 2 days ago He does not dare to speak about truth permalink award report block reply greatpumpkin 4 points 2 days ago Translation: The propaganda isn't working; we need to shut up the independents. permalink award report block reply Spellmonger 3 points 2 days ago \"... for I have sworn upon the altar of God eternal hostility against every form of tyranny over the mind of man.\" -Thomas Jefferson permalink award report block reply SicSemperTyrannis2 -1 points 2 days ago Underrated comment of the day! Please make this an OP permalink parent award report block reply barwhack 3 points 2 days ago Opt out of the internet, fren. And fUNck off. permalink award report block reply worldowedexplanation 3 points 2 days ago I can’t even tell Reddit faggots to boost up anymore, they FINALLY caught on and ban me every time. permalink award report block reply GhostOfMyFormerSelf 3 points 2 days ago If public scrutiny and criticism can kill it, it deserves a quick death. permalink award report block reply cherbui 3 points 2 days ago fuck the u.n.  ... u.s. need to heave that corrupt of  organization who think they Own us .. kick them out of the U.S. permalink award report block reply redditadminssuckit 3 points 2 days ago EAT SHIT,  ANTONIO permalink award report block reply hamajun 2 points 2 days ago Crack down this MFer's finace instead. permalink award report block reply Saltish 2 points 2 days ago This man should be arrested. There are no consequences for them acting like this, why wouldn't they continue, and keep pushing? permalink award report block reply mikethemarine 2 points 2 days ago I want this fuck to point out which items are fake or misinformation, this way when we prove it wrong, they won't have anywhere to hide. They can fuck off permalink award report block reply tt777 2 points 2 days ago What a faggot. permalink award report block reply DITTOPatriot 2 points 2 days ago The Levin's want to control your speech. permalink award report block reply Poopyonurface 2 points 2 days ago What an odd thing to say permalink award report block reply AmericanJawa 2 points 2 days ago claiming that “false narratives” threaten the UN’s Agenda 2030 goals Good, we want the 2030 agenda threatened. permalink award report block reply SicSemperTyrannis2 -2 points 2 days ago Nuked from orbit, even permalink parent award report block reply birddogz 2 points 2 days ago Antonio can eat a bag of dicks.  Fuck'em permalink award report block reply Liars-Burn-In-Hell 2 points 2 days ago António Guterres needs to get censored. permalink award report block reply the-new-style 2 points 2 days ago \"global stability\" do as you are told and there won't be any problems permalink award report block reply POTUS_DonnieJ 2 points 2 days ago We need to exit the UN and evict them from American soil. permalink award report block reply SicSemperTyrannis2 -1 points 2 days ago Bigly permalink parent award report block reply Choppermagic 2 points 2 days ago all these lefties always pupsh for censorship but if Trump suggest shutting down news stations that lie, they are go ballistic permalink award report block reply SicSemperTyrannis2 -1 points 2 days ago Info wars permalink parent award report block reply HoganP 1 points 2 days ago Clear and present danger.  Drone them. permalink award report block reply NPC1776 1 points 2 days ago “Come on y’all… TRUST US.” permalink award report block reply mightyclaw 1 points 2 days ago Do I wanna know how much of my money goes to pay the salaries of U.N. dipshits who do nothing but propose totalitarian nonsense for a few hours every week before flying off on luxury vacations with deluxe accommodations and the priciest prostitutes on the planet? For the sake of my blood pressure, probably not. permalink award report block reply SpellingContable 1 points 2 days ago seeking to undermine climate action All of these grubs are the same. -Gets paid exorbitant income -Lives in mansion -Flies private jets around the world -Contributes nothing -Continually tells lies permalink award report block reply mass55th 1 points 2 days ago Get the shithole UN out of the US. permalink award report block reply SavingPrivateGrace 1 points 2 days ago A culture that doesn't openly talk about pedophilia wants tighter control of their people talking. permalink award report block reply nomoreprinkles 1 points 2 days ago They literally said they want to genocide white people and white society. What possible conversation is there to be had. permalink award report block reply MAGAnic316 1 points 2 days ago If you want us to stop calling you a bunch of authoritarian commies, then stop being a bunch of authoritarian commies, cunt permalink award report block reply Easzq8 1 points 2 days ago “Conspiracy Theories” = proven correct next week or two theories permalink award report block reply KarenLukasik 1 points 2 days ago How do I get a hold of him,I have an extremely important message to give him… permalink award report block reply Back4more24 1 points 2 days ago True or not (they're true) if it derails the UN agenda then we need MORE, MORE, MORE! Fuck those commies. permalink award report block reply BurtMcGirt 1 points 2 days ago What are, things a globohomopedo authoritarian would say, Alex? permalink award report block reply DJT4MoreYears 0 points 2 days ago What country is he from? What country does he rule over? If it's not the US then IDGAF. Stop posting these irrelevant clowns. permalink award report block reply Mulletgunning 0 points 2 days ago Blah,blah,blah Fuck off. The UN and the other globalist fags can fuck off. They can leave the easy way or get the Vlad the Chad treatment they deserve.Fucking ghouls. MAGA AF permalink award report block reply Roadpower 0 points 2 days ago If it was possible (it isn't and never will be) to weed out lies of any kind then it might be a real discussion (it isn't, it is a ploy) otherwise this is so massively and fundamentally anti human that really there needs to be vigorous calls for him to step down or for the US to exit the UN. permalink award report block reply Lynnforthetruth 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\ndeleted 95 points 2 days ago D__1 38 points 2 days ago The best way to fight \"false narratives\"  is with transparency and the free and open exchange of information so I'm curious why you'd think you need more censorship... permalink parent award report block reply GatoradeJeb 4 points 2 days ago We have cuckservatives on this forum openly celebrsting and calling for more censorship and online id laws because \"think of muh kids\" and \"dont you dare access muh website\" permalink parent award report block reply Owmyballz -1 points 2 days ago if you are upset about voter id you are in the wrong forum, head over to democunts. permalink parent award report block reply GatoradeJeb 3 points 2 days ago You are retarded if think voter id = online id to view websites permalink parent award report block reply SicSemperTyrannis2 1 points 2 days ago I don't think it's voter ID he's complaining about, but I'll let him clarify that permalink parent award report block reply view 6 more comments... HoganT -10 points 2 days ago Yet you want to revoke media licenses when they say what you don't want to hear. permalink parent award report block reply snoopy3210 7 points 2 days ago For outright fraud, like doctoring a Presidential speech, you moron. Or inciting violence against Republicans and lying about a murder investigation on TV. permalink parent award report block reply they-see-me-trollin 6 points 2 days ago first off, we're not talking about \"what you don't want to hear\".  we're talking about very disprovable lies, of which there is no genuine or legitimate dispute and we're not talking about media licenses... we were talking about broadcast licenses.  ABC and CBS are not just media companies.  they're broadcasters, who have exclusive use over public airwaves.   MSNBC, CNN, and Fox News Channel are free to post absolute drivel on cable and online subject only to defamation laws.  but NBC, ABC, CBS, CW, and Fox Local cannot send out the same over broadcast because they agree not to as part of the broadcast license that gives them exclusive radio waves into your home. and in the UK with the falsified Trump video pushed by BBC, they violated the BBC charter as well as UK law, and there were even internal memos admitting they knew what they were doing was illegal. so no, you have no idea what you're talking about. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago I certainly would revoke this leftist's license from posting here. permalink parent award report block reply snoopy3210 1 points 2 days ago Guterres attacks Bill Gates! 😆 permalink parent award report block reply USDMaga 18 points 2 days ago The UN supports child sex trafficking worldwide.  He doesn't want people saying it. permalink parent award report block reply Granny 9 points 2 days ago Bottom line: with the constant, eternal flow of information among human beings, there is, always has been, and always will be both good and bad information. It's up to the individuals to be discerning, and they must do it themselves - no \"big brothers\" to do it for them!!! permalink parent award report block reply SicSemperTyrannis2 2 points 2 days ago Exactly! Also: I am cornholio, are you threatening me? The UN meets the TP Nazi - no TP for U! (N) permalink parent award report block reply Christineblaseyford 1 points 2 days ago If it weren't true fat boy wouldn't give a fuck about it becoming public. permalink parent award report block reply\nD__1 38 points 2 days ago The best way to fight \"false narratives\"  is with transparency and the free and open exchange of information so I'm curious why you'd think you need more censorship... permalink parent award report block reply GatoradeJeb 4 points 2 days ago We have cuckservatives on this forum openly celebrsting and calling for more censorship and online id laws because \"think of muh kids\" and \"dont you dare access muh website\" permalink parent award report block reply Owmyballz -1 points 2 days ago if you are upset about voter id you are in the wrong forum, head over to democunts. permalink parent award report block reply GatoradeJeb 3 points 2 days ago You are retarded if think voter id = online id to view websites permalink parent award report block reply SicSemperTyrannis2 1 points 2 days ago I don't think it's voter ID he's complaining about, but I'll let him clarify that permalink parent award report block reply view 6 more comments... HoganT -10 points 2 days ago Yet you want to revoke media licenses when they say what you don't want to hear. permalink parent award report block reply snoopy3210 7 points 2 days ago For outright fraud, like doctoring a Presidential speech, you moron. Or inciting violence against Republicans and lying about a murder investigation on TV. permalink parent award report block reply they-see-me-trollin 6 points 2 days ago first off, we're not talking about \"what you don't want to hear\".  we're talking about very disprovable lies, of which there is no genuine or legitimate dispute and we're not talking about media licenses... we were talking about broadcast licenses.  ABC and CBS are not just media companies.  they're broadcasters, who have exclusive use over public airwaves.   MSNBC, CNN, and Fox News Channel are free to post absolute drivel on cable and online subject only to defamation laws.  but NBC, ABC, CBS, CW, and Fox Local cannot send out the same over broadcast because they agree not to as part of the broadcast license that gives them exclusive radio waves into your home. and in the UK with the falsified Trump video pushed by BBC, they violated the BBC charter as well as UK law, and there were even internal memos admitting they knew what they were doing was illegal. so no, you have no idea what you're talking about. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago I certainly would revoke this leftist's license from posting here. permalink parent award report block reply snoopy3210 1 points 2 days ago Guterres attacks Bill Gates! 😆 permalink parent award report block reply\nGatoradeJeb 4 points 2 days ago We have cuckservatives on this forum openly celebrsting and calling for more censorship and online id laws because \"think of muh kids\" and \"dont you dare access muh website\" permalink parent award report block reply Owmyballz -1 points 2 days ago if you are upset about voter id you are in the wrong forum, head over to democunts. permalink parent award report block reply GatoradeJeb 3 points 2 days ago You are retarded if think voter id = online id to view websites permalink parent award report block reply SicSemperTyrannis2 1 points 2 days ago I don't think it's voter ID he's complaining about, but I'll let him clarify that permalink parent award report block reply view 6 more comments...\nOwmyballz -1 points 2 days ago if you are upset about voter id you are in the wrong forum, head over to democunts. permalink parent award report block reply GatoradeJeb 3 points 2 days ago You are retarded if think voter id = online id to view websites permalink parent award report block reply SicSemperTyrannis2 1 points 2 days ago I don't think it's voter ID he's complaining about, but I'll let him clarify that permalink parent award report block reply view 6 more comments...\nGatoradeJeb 3 points 2 days ago You are retarded if think voter id = online id to view websites permalink parent award report block reply\nSicSemperTyrannis2 1 points 2 days ago I don't think it's voter ID he's complaining about, but I'll let him clarify that permalink parent award report block reply view 6 more comments...\nHoganT -10 points 2 days ago Yet you want to revoke media licenses when they say what you don't want to hear. permalink parent award report block reply snoopy3210 7 points 2 days ago For outright fraud, like doctoring a Presidential speech, you moron. Or inciting violence against Republicans and lying about a murder investigation on TV. permalink parent award report block reply they-see-me-trollin 6 points 2 days ago first off, we're not talking about \"what you don't want to hear\".  we're talking about very disprovable lies, of which there is no genuine or legitimate dispute and we're not talking about media licenses... we were talking about broadcast licenses.  ABC and CBS are not just media companies.  they're broadcasters, who have exclusive use over public airwaves.   MSNBC, CNN, and Fox News Channel are free to post absolute drivel on cable and online subject only to defamation laws.  but NBC, ABC, CBS, CW, and Fox Local cannot send out the same over broadcast because they agree not to as part of the broadcast license that gives them exclusive radio waves into your home. and in the UK with the falsified Trump video pushed by BBC, they violated the BBC charter as well as UK law, and there were even internal memos admitting they knew what they were doing was illegal. so no, you have no idea what you're talking about. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago I certainly would revoke this leftist's license from posting here. permalink parent award report block reply snoopy3210 1 points 2 days ago Guterres attacks Bill Gates! 😆 permalink parent award report block reply\nsnoopy3210 7 points 2 days ago For outright fraud, like doctoring a Presidential speech, you moron. Or inciting violence against Republicans and lying about a murder investigation on TV. permalink parent award report block reply\nthey-see-me-trollin 6 points 2 days ago first off, we're not talking about \"what you don't want to hear\".  we're talking about very disprovable lies, of which there is no genuine or legitimate dispute and we're not talking about media licenses... we were talking about broadcast licenses.  ABC and CBS are not just media companies.  they're broadcasters, who have exclusive use over public airwaves.   MSNBC, CNN, and Fox News Channel are free to post absolute drivel on cable and online subject only to defamation laws.  but NBC, ABC, CBS, CW, and Fox Local cannot send out the same over broadcast because they agree not to as part of the broadcast license that gives them exclusive radio waves into your home. and in the UK with the falsified Trump video pushed by BBC, they violated the BBC charter as well as UK law, and there were even internal memos admitting they knew what they were doing was illegal. so no, you have no idea what you're talking about. permalink parent award report block reply\nWtf_socialismreally 2 points 2 days ago I certainly would revoke this leftist's license from posting here. permalink parent award report block reply\nsnoopy3210 1 points 2 days ago Guterres attacks Bill Gates! 😆 permalink parent award report block reply\nUSDMaga 18 points 2 days ago The UN supports child sex trafficking worldwide.  He doesn't want people saying it. permalink parent award report block reply\nGranny 9 points 2 days ago Bottom line: with the constant, eternal flow of information among human beings, there is, always has been, and always will be both good and bad information. It's up to the individuals to be discerning, and they must do it themselves - no \"big brothers\" to do it for them!!! permalink parent award report block reply\nSicSemperTyrannis2 2 points 2 days ago Exactly! Also: I am cornholio, are you threatening me? The UN meets the TP Nazi - no TP for U! (N) permalink parent award report block reply\nChristineblaseyford 1 points 2 days ago If it weren't true fat boy wouldn't give a fuck about it becoming public. permalink parent award report block reply\nTrumpwonbidencheated 47 points 2 days ago The UN is a criminal and terrorist organization. permalink award report block reply that_sound 10 points 2 days ago Get the US out of the UN. Get the UN out of the US. permalink parent award report block reply SicSemperTyrannis2 -1 points 2 days ago Has become that way, and continually gets worse. US should've gotten out in the 80's at the latest. permalink parent award report block reply\nthat_sound 10 points 2 days ago Get the US out of the UN. Get the UN out of the US. permalink parent award report block reply\nSicSemperTyrannis2 -1 points 2 days ago Has become that way, and continually gets worse. US should've gotten out in the 80's at the latest. permalink parent award report block reply\nSouth_Florida_Guy 42 points 2 days ago Remember how they all cried about Trump's big evil agenda 2025 plan? It was always just projection to distract from their own 2030 agenda. permalink award report block reply Chickensaurus 13 points 2 days ago Remember when Obama gave away ICANN? Pepe Farms remembers. permalink parent award report block reply GatoradeJeb 3 points 2 days ago I remember when this forum called out the uk online id tyranny and then cuckservservatives on this forum called for the same laws here for websites becuase \"think of muh kids\" as they dont want to parent permalink parent award report block reply\nChickensaurus 13 points 2 days ago Remember when Obama gave away ICANN? Pepe Farms remembers. permalink parent award report block reply\nGatoradeJeb 3 points 2 days ago I remember when this forum called out the uk online id tyranny and then cuckservservatives on this forum called for the same laws here for websites becuase \"think of muh kids\" as they dont want to parent permalink parent award report block reply\nMortal_Wombat 28 points 2 days ago TL;DL: \"If you love your country and don't want it ruined by people who have zero fucks to give...you're a bigot.\" permalink award report block reply\nduehuckleberry 28 points 2 days ago He deserves the same answer that 4chan attorneys gave to the UK when they said the same thing: YOU HAVE NO POWER HERE. EAT SHIT. permalink award report block reply Psarg 6 points 2 days ago 4chan is a weird psyop now. permalink parent award report block reply Nibba2 6 points 2 days ago It’s all Indian now. The whole process of shutting down good websites that have good info is stated out on the internet, but the process is to spam it with dumb stuff and make it uninteresting and unusable. Well, Israel moved on from spamming black cocks to spamming Indian nonsense. permalink parent award report block reply\nPsarg 6 points 2 days ago 4chan is a weird psyop now. permalink parent award report block reply Nibba2 6 points 2 days ago It’s all Indian now. The whole process of shutting down good websites that have good info is stated out on the internet, but the process is to spam it with dumb stuff and make it uninteresting and unusable. Well, Israel moved on from spamming black cocks to spamming Indian nonsense. permalink parent award report block reply\nNibba2 6 points 2 days ago It’s all Indian now. The whole process of shutting down good websites that have good info is stated out on the internet, but the process is to spam it with dumb stuff and make it uninteresting and unusable. Well, Israel moved on from spamming black cocks to spamming Indian nonsense. permalink parent award report block reply\nHenkZeilstra 21 points 2 days ago Disband the UN, it is the NWO, throw the SDG into the dustbin, fuck them permalink award report block reply rebuildingMyself 7 points 2 days ago All we'd have to do is stop funding our share of it and it would collapse overnight permalink parent award report block reply\nrebuildingMyself 7 points 2 days ago All we'd have to do is stop funding our share of it and it would collapse overnight permalink parent award report block reply\ncrashdaddy 18 points 2 days ago The most obvious solution to all those problems he listed is to simply ban the UN. permalink award report block reply\nMEME-SUPREME 15 points 2 days ago POUND SAND UP YOUR ASS 🖕 permalink award report block reply\nSomeGuyOnTheInternet 13 points 2 days ago If they didn't run so many conspiracies, we wouldn't need so many theories. permalink award report block reply worldowedexplanation 6 points 2 days ago Need this on a bumper sticker, “I have a lot of theories because the government has a lot of conspiracies” permalink parent award report block reply\nworldowedexplanation 6 points 2 days ago Need this on a bumper sticker, “I have a lot of theories because the government has a lot of conspiracies” permalink parent award report block reply\nPRMan 13 points 2 days ago FUCK YOU how bout that and ur global agenda permalink award report block reply\nRidiculous_bullshit 13 points 2 days ago I thought Agenda 2030 was a baseless conspiracy theory that just happens to be posted on the UN website. permalink award report block reply Zskills 14 points 2 days ago It's like replacement migration. Literally on their website and it's fine for them to publicly celebrate it but it's a conspiracy theory and problematic if you say they're doing it and you aren't happy about being ethnically cleansed by bioweapons from afghanistan. permalink parent award report block reply GatoradeJeb 5 points 2 days ago Its worse than that they brainwashed White woman to racemix with brown/black turds to humiliate White man more as they make us watch our own replacement both in demographics of the country and our own woman being racemixing race traitors permalink parent award report block reply SicSemperTyrannis2 -1 points 2 days ago Oi, you got a loicense for all that noticing? permalink parent award report block reply\nZskills 14 points 2 days ago It's like replacement migration. Literally on their website and it's fine for them to publicly celebrate it but it's a conspiracy theory and problematic if you say they're doing it and you aren't happy about being ethnically cleansed by bioweapons from afghanistan. permalink parent award report block reply GatoradeJeb 5 points 2 days ago Its worse than that they brainwashed White woman to racemix with brown/black turds to humiliate White man more as they make us watch our own replacement both in demographics of the country and our own woman being racemixing race traitors permalink parent award report block reply SicSemperTyrannis2 -1 points 2 days ago Oi, you got a loicense for all that noticing? permalink parent award report block reply\nGatoradeJeb 5 points 2 days ago Its worse than that they brainwashed White woman to racemix with brown/black turds to humiliate White man more as they make us watch our own replacement both in demographics of the country and our own woman being racemixing race traitors permalink parent award report block reply\nSicSemperTyrannis2 -1 points 2 days ago Oi, you got a loicense for all that noticing? permalink parent award report block reply\nDingleBalls 10 points 2 days ago Well rheyre not false and yes part of the point is to undermine Agenda 2030 and anything else the UN tries permalink award report block reply\ncbonez416 9 points 2 days ago Talked about climate change being under attack. You mean your narratives are under attack. Cuz you're narrative is a fake. Oh by the way, maybe he didn't hear Bill Gates say that climate change isn't a threat and that all climate models were wrong !! permalink award report block reply zooty 6 points 2 days ago To be fair, Bill Gates current bullshit involves using huge amount of energy now so his priorities have changed. But the same applies to when he held the climate change bullshit too. It's a shame the guy will never see the inside of a jail cell for his nonsense and all we'll have is the old mugshot and the pie attack. permalink parent award report block reply cbonez416 4 points 2 days ago The AI is hungry!! Must feed it electric and water!! permalink parent award report block reply zooty 2 points 2 days ago The sooner the bubble bursts, the better. permalink parent award report block reply\nzooty 6 points 2 days ago To be fair, Bill Gates current bullshit involves using huge amount of energy now so his priorities have changed. But the same applies to when he held the climate change bullshit too. It's a shame the guy will never see the inside of a jail cell for his nonsense and all we'll have is the old mugshot and the pie attack. permalink parent award report block reply cbonez416 4 points 2 days ago The AI is hungry!! Must feed it electric and water!! permalink parent award report block reply zooty 2 points 2 days ago The sooner the bubble bursts, the better. permalink parent award report block reply\ncbonez416 4 points 2 days ago The AI is hungry!! Must feed it electric and water!! permalink parent award report block reply zooty 2 points 2 days ago The sooner the bubble bursts, the better. permalink parent award report block reply\nzooty 2 points 2 days ago The sooner the bubble bursts, the better. permalink parent award report block reply\nMeMargie 9 points 2 days ago UN is a terrorist org. defund disband STAT permalink award report block reply\nTooBright 9 points 2 days ago They say words are violence. I say silencing my words is a transgression upon me. permalink award report block reply\nDev404 7 points 2 days ago They have instability because they've funded an invasion of foreigners into their countries for their own profit. Social media has exposed this and they don't like it because people are realizing that they're getting fucked over and the government and their NGOs are the ones behind it all. permalink award report block reply\nProfessorJagoff 7 points 2 days ago And he can go straight to hell. permalink award report block reply\ncd3dog 7 points 2 days ago 'Threaten the UN’s Agenda'....   sounds good to me. permalink award report block reply\nawsure 7 points 2 days ago I am calling for fewer controls. I’m nobody and suspect I’m more influential than this fuck-face faggot. permalink award report block reply\nDontTreadOnLego 7 points 2 days ago KICK THE UN OUT OF THE US permalink award report block reply\nYodaBannon 6 points 2 days ago TRUMP WON BIATCH! permalink award report block reply\nMythArcana 6 points 2 days ago Agenda 2030 is anti-Trump bullshit, and we aren't doing any of that. Yes, I'm talking about Newsom. permalink award report block reply\nterribletwos 4 points 2 days ago That's a wild thing to say out loud. permalink award report block reply\nHenkZeilstra 4 points 2 days ago He does not dare to speak about truth permalink award report block reply\ngreatpumpkin 4 points 2 days ago Translation: The propaganda isn't working; we need to shut up the independents. permalink award report block reply\nSpellmonger 3 points 2 days ago \"... for I have sworn upon the altar of God eternal hostility against every form of tyranny over the mind of man.\" -Thomas Jefferson permalink award report block reply SicSemperTyrannis2 -1 points 2 days ago Underrated comment of the day! Please make this an OP permalink parent award report block reply\nSicSemperTyrannis2 -1 points 2 days ago Underrated comment of the day! Please make this an OP permalink parent award report block reply\nbarwhack 3 points 2 days ago Opt out of the internet, fren. And fUNck off. permalink award report block reply\nworldowedexplanation 3 points 2 days ago I can’t even tell Reddit faggots to boost up anymore, they FINALLY caught on and ban me every time. permalink award report block reply\nGhostOfMyFormerSelf 3 points 2 days ago If public scrutiny and criticism can kill it, it deserves a quick death. permalink award report block reply\ncherbui 3 points 2 days ago fuck the u.n.  ... u.s. need to heave that corrupt of  organization who think they Own us .. kick them out of the U.S. permalink award report block reply\nredditadminssuckit 3 points 2 days ago EAT SHIT,  ANTONIO permalink award report block reply\nhamajun 2 points 2 days ago Crack down this MFer's finace instead. permalink award report block reply\nSaltish 2 points 2 days ago This man should be arrested. There are no consequences for them acting like this, why wouldn't they continue, and keep pushing? permalink award report block reply\nmikethemarine 2 points 2 days ago I want this fuck to point out which items are fake or misinformation, this way when we prove it wrong, they won't have anywhere to hide. They can fuck off permalink award report block reply\ntt777 2 points 2 days ago What a faggot. permalink award report block reply\nDITTOPatriot 2 points 2 days ago The Levin's want to control your speech. permalink award report block reply\nPoopyonurface 2 points 2 days ago What an odd thing to say permalink award report block reply\nAmericanJawa 2 points 2 days ago claiming that “false narratives” threaten the UN’s Agenda 2030 goals Good, we want the 2030 agenda threatened. permalink award report block reply SicSemperTyrannis2 -2 points 2 days ago Nuked from orbit, even permalink parent award report block reply\nSicSemperTyrannis2 -2 points 2 days ago Nuked from orbit, even permalink parent award report block reply\nbirddogz 2 points 2 days ago Antonio can eat a bag of dicks.  Fuck'em permalink award report block reply\nLiars-Burn-In-Hell 2 points 2 days ago António Guterres needs to get censored. permalink award report block reply\nthe-new-style 2 points 2 days ago \"global stability\" do as you are told and there won't be any problems permalink award report block reply\nPOTUS_DonnieJ 2 points 2 days ago We need to exit the UN and evict them from American soil. permalink award report block reply SicSemperTyrannis2 -1 points 2 days ago Bigly permalink parent award report block reply\nSicSemperTyrannis2 -1 points 2 days ago Bigly permalink parent award report block reply\nChoppermagic 2 points 2 days ago all these lefties always pupsh for censorship but if Trump suggest shutting down news stations that lie, they are go ballistic permalink award report block reply SicSemperTyrannis2 -1 points 2 days ago Info wars permalink parent award report block reply\nSicSemperTyrannis2 -1 points 2 days ago Info wars permalink parent award report block reply\nHoganP 1 points 2 days ago Clear and present danger.  Drone them. permalink award report block reply\nNPC1776 1 points 2 days ago “Come on y’all… TRUST US.” permalink award report block reply\nmightyclaw 1 points 2 days ago Do I wanna know how much of my money goes to pay the salaries of U.N. dipshits who do nothing but propose totalitarian nonsense for a few hours every week before flying off on luxury vacations with deluxe accommodations and the priciest prostitutes on the planet? For the sake of my blood pressure, probably not. permalink award report block reply\nSpellingContable 1 points 2 days ago seeking to undermine climate action All of these grubs are the same. -Gets paid exorbitant income -Lives in mansion -Flies private jets around the world -Contributes nothing -Continually tells lies permalink award report block reply\nmass55th 1 points 2 days ago Get the shithole UN out of the US. permalink award report block reply\nSavingPrivateGrace 1 points 2 days ago A culture that doesn't openly talk about pedophilia wants tighter control of their people talking. permalink award report block reply\nnomoreprinkles 1 points 2 days ago They literally said they want to genocide white people and white society. What possible conversation is there to be had. permalink award report block reply\nMAGAnic316 1 points 2 days ago If you want us to stop calling you a bunch of authoritarian commies, then stop being a bunch of authoritarian commies, cunt permalink award report block reply\nEaszq8 1 points 2 days ago “Conspiracy Theories” = proven correct next week or two theories permalink award report block reply\nKarenLukasik 1 points 2 days ago How do I get a hold of him,I have an extremely important message to give him… permalink award report block reply\nBack4more24 1 points 2 days ago True or not (they're true) if it derails the UN agenda then we need MORE, MORE, MORE! Fuck those commies. permalink award report block reply\nBurtMcGirt 1 points 2 days ago What are, things a globohomopedo authoritarian would say, Alex? permalink award report block reply\nDJT4MoreYears 0 points 2 days ago What country is he from? What country does he rule over? If it's not the US then IDGAF. Stop posting these irrelevant clowns. permalink award report block reply\nMulletgunning 0 points 2 days ago Blah,blah,blah Fuck off. The UN and the other globalist fags can fuck off. They can leave the easy way or get the Vlad the Chad treatment they deserve.Fucking ghouls. MAGA AF permalink award report block reply\nRoadpower 0 points 2 days ago If it was possible (it isn't and never will be) to weed out lies of any kind then it might be a real discussion (it isn't, it is a ploy) otherwise this is so massively and fundamentally anti human that really there needs to be vigorous calls for him to step down or for the US to exit the UN. permalink award report block reply\nLynnforthetruth 1 points 2 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:07:35.200251Z"
}