{
  "id": "1ARK513Iw8",
  "url": "https://patriots.win/p/1ARK513Iw8/dumb-homes-are-the-latest-flex-i/c",
  "content": "281 “Dumb Homes are the Latest Flex.” I don’t know about “flex,” I’d more say it’s just “based” or “sane.” Paying tons of money for shit that doesn’t work and doesn’t make your life easier, but just spies on you all the time, is pretty crazy. (archive.is) posted 6 days ago by flp999 24 comments award share report block archive.is\n24 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style OTher55 12 points 6 days ago I remember hearing about \"smart\" homes in blue states that had remote access to the thermostat. In the Terms of Service Agreements (that no one ever reads) it said the power company would discount your power by a fraction of a % in exchange for being able to remote access your thermostat and shut off the A/C and heat. When the power demand was too high, the power did rolling blackouts, plus shut down A/C in \"smart\" homes. permalink award report block reply UltimatePistachio 13 points 6 days ago I use these things all the time. You just buy one from wherever and install it yourself. You don't enroll it in anything and you can control it. I don't like how it has to phone home into the thermostats servers but there's nothing forcing you to enroll in a power savings program. Now, yes, power companies do offer incentives where they clearly tell you that if you enroll in their program they'll send you one of these thermostats (probably ecobee) where they'll control your AC remotely to save you that money they offer. I never seen that as something trying to be sneaky - I think people just enrolled in this shit only seeing how they're getting FREE SHIT and didn't read the NOT SO FINE print about how they will control the thermostat... permalink parent award report block reply fazaman 7 points 6 days ago Not sure who down voted you, but you're correct. permalink parent award report block reply UltimatePistachio 5 points 6 days ago I know but I think there's a lot of luddites who will just simplify this as \"don't need this shit it's bad\" and don't care to get into the details, which is fine because they're generally right - they probably don't want or care to micromanage their utilities. I have been living across 2 houses for years now - the ecobees help me to manage the heat and AC across them. One is on a natural gas furnace and AC, the other I rigged up to work with a pellet stove and I use Sinope thermostats for the baseboard heaters. They've been working great to save me money since I can turn the heat off when I'm not around, then turn it on as I'm on my way to another house. If one is getting too cold I can bump up the temp. Even if I didn't have more than one house, I'd want to have remote control of all sources of heat and AC because I might be prone to forget to turn something off while I'm out for the day. Savings do add up, even more so for a situation like my own. I'm in the process of getting a new house and I'm probably going to figure out a way to rig my own thermostat that will just talk to my server only - these things are just a thermometer with relays and maybe a nice added humidistat with a display for the time, temperature, and weather. permalink parent award report block reply HiddenDekuScrub 3 points 6 days ago IMO, it's okay to have the gadgets if you know what you're getting into. I think many of them were just made by startups that were thinking along the lines of \"wouldn't it be cool if...?\" IMO, there are no real \"smart houses\". There's an occasional person who falls for the wifi-enabled washer and dryer set. Like, why? It's not like your router is going to get up and load it for you, and I'm still not sold on the concept of personal robots yet. It's not like a personal robot is going to make my house more spacious and give me more storage. Rosie the Robot does not exist, even now. permalink parent award report block reply fazaman 3 points 6 days ago Probably could rig something up with a raspberry pi, or some such. Looks like there's some projects that have been around a while that do that. Not sure how successful they are, though. permalink parent award report block reply view 1 more comments... YaharaRiver 2 points 6 days ago ComfortSync thermostats. Has a dedicated modem and a motion detector (!!).  Creepiest fucking thing you ever hung in the hall. Made in Malaysia by pisslamics. It does not have a setting below 60 degrees.  That’s a huge problem in Wisconsin where a sunny 56 degree day in Spring or Fall calls for every window open!  Guess what?  Your furnace kicks in and literally heats the outdoors unless you remember to shut the system OFF. Put cardboard over it to block its spy camera until my HVAC guys came and de-installed it. (Furnace still under 10 yr warranty) The dedicated modem created quite a bit of work to take out! permalink parent award report block reply UltimatePistachio 2 points 6 days ago That one does sound like something I'd stay away from, sounds on the same sort of tangent as those \"smart meters\" the electric companies use to make absolutely sure they can keep monitoring your meter - they create their own hyper mesh network that ends up talking to them permalink parent award report block reply Transparency 1 points 6 days ago Many, probably all states have that. I had it in Fl years ago. I'd guess it's not quite whatever you are thinking it is. Not cut off for more than 20 or 30 minutes* and normally during the wee-hours of the morning (during winter) when people are asleep in bed. (* It's specified in the agreement.) permalink parent award report block reply OTher55 1 points 6 days ago I didn't say I think it happens. I said I remember hearing about it. Here's the article I read about this happening: https://www.theverge.com/2022/9/5/23337864/xcel-locked-out-customers-smart-thermostats-colorado-heatwave Here's the archive if you don't want to give The Verge a click: https://archive.ph/A0nCV permalink parent award report block reply NamendaBiden -1 points 6 days ago Im not sure how that works but I have a \"smart\" thermostat in the sense that it is connected to the internet and I can control it from anywhere via an app in my phone.  I rarely use that feature and if I dont want people to access it, I can just disconnect it from the wifi.  It will still control the heat/ac if not online. permalink parent award report block reply glow-operator-2-0 2 points 6 days ago You can also not use central heating and cooling and save a shit ton of money. Localized heating / cooling works in some places. permalink parent award report block reply NamendaBiden 2 points 6 days ago I try to heat my home as much as possible with a wood stove and 500w space heaters in the bedrooms.  Cooling season i try to open the windows as much as possible but my wife is addicted to AC. permalink parent award report block reply OTher55 2 points 6 days ago Here's the link (archived, since a fellow man of culture, also posted an archive): https://archive.ph/A0nCV and for those that want to give The Verge a click: https://www.theverge.com/2022/9/5/23337864/xcel-locked-out-customers-smart-thermostats-colorado-heatwave permalink parent award report block reply wlatic 4 points 6 days ago This isnt true. You can buy smart devices that are local only. You can run your own llm to interact with. We dont have to live in the stone age to be MAGA permalink award report block reply ClownWorldYeeHaw 3 points 6 days ago This idea needs more traction.  Not every nerd is a pRedditor. permalink parent award report block reply ThisTrainHasNoBrakes 2 points 6 days ago If you want smart home features but not the terrible stuff that comes with it, you need: A local network.  All “smart” devices should only connect to local network.  it’s fine if things wifi, but said local network  should have no internet access Local server like Home Assistant.  Can connect to closed network and open internet. If you want to control things remotely, VPN in to HA or make it otherwise accessible externally through your firewall. Never connect devices directly to your phone through WiFi or Bluetooth.  Always control devices through HA or other open source equivalent If the above is too technical for you to do or learn to do…skip smart home features if you aren’t okay with the loss of security.  Or do use them in the right context.  Example:  ring cameras and the like give up security but for the convenience/seciriry it’s not bad tradeoff if they are outside your home (my opinion). Edit:  and for crying out loud, don’t have your phones or tablets with you at all times.  Break the addition.  And don’t have internet-connected TVs.  Why the hell do they have microphones, I wonder?  stream from a device without mic if you need that. permalink award report block reply wlatic 2 points 6 days ago Wait until these people learn you can reflash the cheap Chinese crap into local devices! permalink parent award report block reply ThisTrainHasNoBrakes 2 points 6 days ago Gotta start somewhere!  these are just my 4 litmus tests.  I don’t trust any device which is why they don’t get network access.  For all I know though…they do anyway through their own device - like new cars do with a built in SIM. permalink parent award report block reply wlatic 1 points 6 days ago Vlan or ip block? permalink parent award report block reply Jamps 2 points 6 days ago This.  I refuse to deploy anything that can't operate and be set up locally with HA and no internet access.  Wireguard for remote access. permalink parent award report block reply GodKingHarambe 1 points 6 days ago I recalled reading something from Ray Kurzweil back I want to say around 2010 touting home automation, around when the Nest was released I thought if guys like him are touting it, I'm 11 ft. poling it permalink award report block reply Transparency 1 points 6 days ago Agreed, OP. I have a dumb-vehicle with manual locks and windows. Less stuff to break down and cause headaches, imo. permalink award report block reply DeplorableNeandertal 1 points 6 days ago I got mad buying my dishwasher because it has buttons… the cheapest model I could find and it didn’t have a knob it had those weird flat buttons permalink award report block reply\nOTher55 12 points 6 days ago I remember hearing about \"smart\" homes in blue states that had remote access to the thermostat. In the Terms of Service Agreements (that no one ever reads) it said the power company would discount your power by a fraction of a % in exchange for being able to remote access your thermostat and shut off the A/C and heat. When the power demand was too high, the power did rolling blackouts, plus shut down A/C in \"smart\" homes. permalink award report block reply UltimatePistachio 13 points 6 days ago I use these things all the time. You just buy one from wherever and install it yourself. You don't enroll it in anything and you can control it. I don't like how it has to phone home into the thermostats servers but there's nothing forcing you to enroll in a power savings program. Now, yes, power companies do offer incentives where they clearly tell you that if you enroll in their program they'll send you one of these thermostats (probably ecobee) where they'll control your AC remotely to save you that money they offer. I never seen that as something trying to be sneaky - I think people just enrolled in this shit only seeing how they're getting FREE SHIT and didn't read the NOT SO FINE print about how they will control the thermostat... permalink parent award report block reply fazaman 7 points 6 days ago Not sure who down voted you, but you're correct. permalink parent award report block reply UltimatePistachio 5 points 6 days ago I know but I think there's a lot of luddites who will just simplify this as \"don't need this shit it's bad\" and don't care to get into the details, which is fine because they're generally right - they probably don't want or care to micromanage their utilities. I have been living across 2 houses for years now - the ecobees help me to manage the heat and AC across them. One is on a natural gas furnace and AC, the other I rigged up to work with a pellet stove and I use Sinope thermostats for the baseboard heaters. They've been working great to save me money since I can turn the heat off when I'm not around, then turn it on as I'm on my way to another house. If one is getting too cold I can bump up the temp. Even if I didn't have more than one house, I'd want to have remote control of all sources of heat and AC because I might be prone to forget to turn something off while I'm out for the day. Savings do add up, even more so for a situation like my own. I'm in the process of getting a new house and I'm probably going to figure out a way to rig my own thermostat that will just talk to my server only - these things are just a thermometer with relays and maybe a nice added humidistat with a display for the time, temperature, and weather. permalink parent award report block reply HiddenDekuScrub 3 points 6 days ago IMO, it's okay to have the gadgets if you know what you're getting into. I think many of them were just made by startups that were thinking along the lines of \"wouldn't it be cool if...?\" IMO, there are no real \"smart houses\". There's an occasional person who falls for the wifi-enabled washer and dryer set. Like, why? It's not like your router is going to get up and load it for you, and I'm still not sold on the concept of personal robots yet. It's not like a personal robot is going to make my house more spacious and give me more storage. Rosie the Robot does not exist, even now. permalink parent award report block reply fazaman 3 points 6 days ago Probably could rig something up with a raspberry pi, or some such. Looks like there's some projects that have been around a while that do that. Not sure how successful they are, though. permalink parent award report block reply view 1 more comments... YaharaRiver 2 points 6 days ago ComfortSync thermostats. Has a dedicated modem and a motion detector (!!).  Creepiest fucking thing you ever hung in the hall. Made in Malaysia by pisslamics. It does not have a setting below 60 degrees.  That’s a huge problem in Wisconsin where a sunny 56 degree day in Spring or Fall calls for every window open!  Guess what?  Your furnace kicks in and literally heats the outdoors unless you remember to shut the system OFF. Put cardboard over it to block its spy camera until my HVAC guys came and de-installed it. (Furnace still under 10 yr warranty) The dedicated modem created quite a bit of work to take out! permalink parent award report block reply UltimatePistachio 2 points 6 days ago That one does sound like something I'd stay away from, sounds on the same sort of tangent as those \"smart meters\" the electric companies use to make absolutely sure they can keep monitoring your meter - they create their own hyper mesh network that ends up talking to them permalink parent award report block reply Transparency 1 points 6 days ago Many, probably all states have that. I had it in Fl years ago. I'd guess it's not quite whatever you are thinking it is. Not cut off for more than 20 or 30 minutes* and normally during the wee-hours of the morning (during winter) when people are asleep in bed. (* It's specified in the agreement.) permalink parent award report block reply OTher55 1 points 6 days ago I didn't say I think it happens. I said I remember hearing about it. Here's the article I read about this happening: https://www.theverge.com/2022/9/5/23337864/xcel-locked-out-customers-smart-thermostats-colorado-heatwave Here's the archive if you don't want to give The Verge a click: https://archive.ph/A0nCV permalink parent award report block reply NamendaBiden -1 points 6 days ago Im not sure how that works but I have a \"smart\" thermostat in the sense that it is connected to the internet and I can control it from anywhere via an app in my phone.  I rarely use that feature and if I dont want people to access it, I can just disconnect it from the wifi.  It will still control the heat/ac if not online. permalink parent award report block reply glow-operator-2-0 2 points 6 days ago You can also not use central heating and cooling and save a shit ton of money. Localized heating / cooling works in some places. permalink parent award report block reply NamendaBiden 2 points 6 days ago I try to heat my home as much as possible with a wood stove and 500w space heaters in the bedrooms.  Cooling season i try to open the windows as much as possible but my wife is addicted to AC. permalink parent award report block reply OTher55 2 points 6 days ago Here's the link (archived, since a fellow man of culture, also posted an archive): https://archive.ph/A0nCV and for those that want to give The Verge a click: https://www.theverge.com/2022/9/5/23337864/xcel-locked-out-customers-smart-thermostats-colorado-heatwave permalink parent award report block reply\nUltimatePistachio 13 points 6 days ago I use these things all the time. You just buy one from wherever and install it yourself. You don't enroll it in anything and you can control it. I don't like how it has to phone home into the thermostats servers but there's nothing forcing you to enroll in a power savings program. Now, yes, power companies do offer incentives where they clearly tell you that if you enroll in their program they'll send you one of these thermostats (probably ecobee) where they'll control your AC remotely to save you that money they offer. I never seen that as something trying to be sneaky - I think people just enrolled in this shit only seeing how they're getting FREE SHIT and didn't read the NOT SO FINE print about how they will control the thermostat... permalink parent award report block reply fazaman 7 points 6 days ago Not sure who down voted you, but you're correct. permalink parent award report block reply UltimatePistachio 5 points 6 days ago I know but I think there's a lot of luddites who will just simplify this as \"don't need this shit it's bad\" and don't care to get into the details, which is fine because they're generally right - they probably don't want or care to micromanage their utilities. I have been living across 2 houses for years now - the ecobees help me to manage the heat and AC across them. One is on a natural gas furnace and AC, the other I rigged up to work with a pellet stove and I use Sinope thermostats for the baseboard heaters. They've been working great to save me money since I can turn the heat off when I'm not around, then turn it on as I'm on my way to another house. If one is getting too cold I can bump up the temp. Even if I didn't have more than one house, I'd want to have remote control of all sources of heat and AC because I might be prone to forget to turn something off while I'm out for the day. Savings do add up, even more so for a situation like my own. I'm in the process of getting a new house and I'm probably going to figure out a way to rig my own thermostat that will just talk to my server only - these things are just a thermometer with relays and maybe a nice added humidistat with a display for the time, temperature, and weather. permalink parent award report block reply HiddenDekuScrub 3 points 6 days ago IMO, it's okay to have the gadgets if you know what you're getting into. I think many of them were just made by startups that were thinking along the lines of \"wouldn't it be cool if...?\" IMO, there are no real \"smart houses\". There's an occasional person who falls for the wifi-enabled washer and dryer set. Like, why? It's not like your router is going to get up and load it for you, and I'm still not sold on the concept of personal robots yet. It's not like a personal robot is going to make my house more spacious and give me more storage. Rosie the Robot does not exist, even now. permalink parent award report block reply fazaman 3 points 6 days ago Probably could rig something up with a raspberry pi, or some such. Looks like there's some projects that have been around a while that do that. Not sure how successful they are, though. permalink parent award report block reply view 1 more comments... YaharaRiver 2 points 6 days ago ComfortSync thermostats. Has a dedicated modem and a motion detector (!!).  Creepiest fucking thing you ever hung in the hall. Made in Malaysia by pisslamics. It does not have a setting below 60 degrees.  That’s a huge problem in Wisconsin where a sunny 56 degree day in Spring or Fall calls for every window open!  Guess what?  Your furnace kicks in and literally heats the outdoors unless you remember to shut the system OFF. Put cardboard over it to block its spy camera until my HVAC guys came and de-installed it. (Furnace still under 10 yr warranty) The dedicated modem created quite a bit of work to take out! permalink parent award report block reply UltimatePistachio 2 points 6 days ago That one does sound like something I'd stay away from, sounds on the same sort of tangent as those \"smart meters\" the electric companies use to make absolutely sure they can keep monitoring your meter - they create their own hyper mesh network that ends up talking to them permalink parent award report block reply\nfazaman 7 points 6 days ago Not sure who down voted you, but you're correct. permalink parent award report block reply UltimatePistachio 5 points 6 days ago I know but I think there's a lot of luddites who will just simplify this as \"don't need this shit it's bad\" and don't care to get into the details, which is fine because they're generally right - they probably don't want or care to micromanage their utilities. I have been living across 2 houses for years now - the ecobees help me to manage the heat and AC across them. One is on a natural gas furnace and AC, the other I rigged up to work with a pellet stove and I use Sinope thermostats for the baseboard heaters. They've been working great to save me money since I can turn the heat off when I'm not around, then turn it on as I'm on my way to another house. If one is getting too cold I can bump up the temp. Even if I didn't have more than one house, I'd want to have remote control of all sources of heat and AC because I might be prone to forget to turn something off while I'm out for the day. Savings do add up, even more so for a situation like my own. I'm in the process of getting a new house and I'm probably going to figure out a way to rig my own thermostat that will just talk to my server only - these things are just a thermometer with relays and maybe a nice added humidistat with a display for the time, temperature, and weather. permalink parent award report block reply HiddenDekuScrub 3 points 6 days ago IMO, it's okay to have the gadgets if you know what you're getting into. I think many of them were just made by startups that were thinking along the lines of \"wouldn't it be cool if...?\" IMO, there are no real \"smart houses\". There's an occasional person who falls for the wifi-enabled washer and dryer set. Like, why? It's not like your router is going to get up and load it for you, and I'm still not sold on the concept of personal robots yet. It's not like a personal robot is going to make my house more spacious and give me more storage. Rosie the Robot does not exist, even now. permalink parent award report block reply fazaman 3 points 6 days ago Probably could rig something up with a raspberry pi, or some such. Looks like there's some projects that have been around a while that do that. Not sure how successful they are, though. permalink parent award report block reply view 1 more comments...\nUltimatePistachio 5 points 6 days ago I know but I think there's a lot of luddites who will just simplify this as \"don't need this shit it's bad\" and don't care to get into the details, which is fine because they're generally right - they probably don't want or care to micromanage their utilities. I have been living across 2 houses for years now - the ecobees help me to manage the heat and AC across them. One is on a natural gas furnace and AC, the other I rigged up to work with a pellet stove and I use Sinope thermostats for the baseboard heaters. They've been working great to save me money since I can turn the heat off when I'm not around, then turn it on as I'm on my way to another house. If one is getting too cold I can bump up the temp. Even if I didn't have more than one house, I'd want to have remote control of all sources of heat and AC because I might be prone to forget to turn something off while I'm out for the day. Savings do add up, even more so for a situation like my own. I'm in the process of getting a new house and I'm probably going to figure out a way to rig my own thermostat that will just talk to my server only - these things are just a thermometer with relays and maybe a nice added humidistat with a display for the time, temperature, and weather. permalink parent award report block reply HiddenDekuScrub 3 points 6 days ago IMO, it's okay to have the gadgets if you know what you're getting into. I think many of them were just made by startups that were thinking along the lines of \"wouldn't it be cool if...?\" IMO, there are no real \"smart houses\". There's an occasional person who falls for the wifi-enabled washer and dryer set. Like, why? It's not like your router is going to get up and load it for you, and I'm still not sold on the concept of personal robots yet. It's not like a personal robot is going to make my house more spacious and give me more storage. Rosie the Robot does not exist, even now. permalink parent award report block reply fazaman 3 points 6 days ago Probably could rig something up with a raspberry pi, or some such. Looks like there's some projects that have been around a while that do that. Not sure how successful they are, though. permalink parent award report block reply view 1 more comments...\nHiddenDekuScrub 3 points 6 days ago IMO, it's okay to have the gadgets if you know what you're getting into. I think many of them were just made by startups that were thinking along the lines of \"wouldn't it be cool if...?\" IMO, there are no real \"smart houses\". There's an occasional person who falls for the wifi-enabled washer and dryer set. Like, why? It's not like your router is going to get up and load it for you, and I'm still not sold on the concept of personal robots yet. It's not like a personal robot is going to make my house more spacious and give me more storage. Rosie the Robot does not exist, even now. permalink parent award report block reply\nfazaman 3 points 6 days ago Probably could rig something up with a raspberry pi, or some such. Looks like there's some projects that have been around a while that do that. Not sure how successful they are, though. permalink parent award report block reply view 1 more comments...\nYaharaRiver 2 points 6 days ago ComfortSync thermostats. Has a dedicated modem and a motion detector (!!).  Creepiest fucking thing you ever hung in the hall. Made in Malaysia by pisslamics. It does not have a setting below 60 degrees.  That’s a huge problem in Wisconsin where a sunny 56 degree day in Spring or Fall calls for every window open!  Guess what?  Your furnace kicks in and literally heats the outdoors unless you remember to shut the system OFF. Put cardboard over it to block its spy camera until my HVAC guys came and de-installed it. (Furnace still under 10 yr warranty) The dedicated modem created quite a bit of work to take out! permalink parent award report block reply UltimatePistachio 2 points 6 days ago That one does sound like something I'd stay away from, sounds on the same sort of tangent as those \"smart meters\" the electric companies use to make absolutely sure they can keep monitoring your meter - they create their own hyper mesh network that ends up talking to them permalink parent award report block reply\nUltimatePistachio 2 points 6 days ago That one does sound like something I'd stay away from, sounds on the same sort of tangent as those \"smart meters\" the electric companies use to make absolutely sure they can keep monitoring your meter - they create their own hyper mesh network that ends up talking to them permalink parent award report block reply\nTransparency 1 points 6 days ago Many, probably all states have that. I had it in Fl years ago. I'd guess it's not quite whatever you are thinking it is. Not cut off for more than 20 or 30 minutes* and normally during the wee-hours of the morning (during winter) when people are asleep in bed. (* It's specified in the agreement.) permalink parent award report block reply OTher55 1 points 6 days ago I didn't say I think it happens. I said I remember hearing about it. Here's the article I read about this happening: https://www.theverge.com/2022/9/5/23337864/xcel-locked-out-customers-smart-thermostats-colorado-heatwave Here's the archive if you don't want to give The Verge a click: https://archive.ph/A0nCV permalink parent award report block reply\nOTher55 1 points 6 days ago I didn't say I think it happens. I said I remember hearing about it. Here's the article I read about this happening: https://www.theverge.com/2022/9/5/23337864/xcel-locked-out-customers-smart-thermostats-colorado-heatwave Here's the archive if you don't want to give The Verge a click: https://archive.ph/A0nCV permalink parent award report block reply\nNamendaBiden -1 points 6 days ago Im not sure how that works but I have a \"smart\" thermostat in the sense that it is connected to the internet and I can control it from anywhere via an app in my phone.  I rarely use that feature and if I dont want people to access it, I can just disconnect it from the wifi.  It will still control the heat/ac if not online. permalink parent award report block reply glow-operator-2-0 2 points 6 days ago You can also not use central heating and cooling and save a shit ton of money. Localized heating / cooling works in some places. permalink parent award report block reply NamendaBiden 2 points 6 days ago I try to heat my home as much as possible with a wood stove and 500w space heaters in the bedrooms.  Cooling season i try to open the windows as much as possible but my wife is addicted to AC. permalink parent award report block reply OTher55 2 points 6 days ago Here's the link (archived, since a fellow man of culture, also posted an archive): https://archive.ph/A0nCV and for those that want to give The Verge a click: https://www.theverge.com/2022/9/5/23337864/xcel-locked-out-customers-smart-thermostats-colorado-heatwave permalink parent award report block reply\nglow-operator-2-0 2 points 6 days ago You can also not use central heating and cooling and save a shit ton of money. Localized heating / cooling works in some places. permalink parent award report block reply NamendaBiden 2 points 6 days ago I try to heat my home as much as possible with a wood stove and 500w space heaters in the bedrooms.  Cooling season i try to open the windows as much as possible but my wife is addicted to AC. permalink parent award report block reply\nNamendaBiden 2 points 6 days ago I try to heat my home as much as possible with a wood stove and 500w space heaters in the bedrooms.  Cooling season i try to open the windows as much as possible but my wife is addicted to AC. permalink parent award report block reply\nOTher55 2 points 6 days ago Here's the link (archived, since a fellow man of culture, also posted an archive): https://archive.ph/A0nCV and for those that want to give The Verge a click: https://www.theverge.com/2022/9/5/23337864/xcel-locked-out-customers-smart-thermostats-colorado-heatwave permalink parent award report block reply\nwlatic 4 points 6 days ago This isnt true. You can buy smart devices that are local only. You can run your own llm to interact with. We dont have to live in the stone age to be MAGA permalink award report block reply ClownWorldYeeHaw 3 points 6 days ago This idea needs more traction.  Not every nerd is a pRedditor. permalink parent award report block reply\nClownWorldYeeHaw 3 points 6 days ago This idea needs more traction.  Not every nerd is a pRedditor. permalink parent award report block reply\nThisTrainHasNoBrakes 2 points 6 days ago If you want smart home features but not the terrible stuff that comes with it, you need: A local network.  All “smart” devices should only connect to local network.  it’s fine if things wifi, but said local network  should have no internet access Local server like Home Assistant.  Can connect to closed network and open internet. If you want to control things remotely, VPN in to HA or make it otherwise accessible externally through your firewall. Never connect devices directly to your phone through WiFi or Bluetooth.  Always control devices through HA or other open source equivalent If the above is too technical for you to do or learn to do…skip smart home features if you aren’t okay with the loss of security.  Or do use them in the right context.  Example:  ring cameras and the like give up security but for the convenience/seciriry it’s not bad tradeoff if they are outside your home (my opinion). Edit:  and for crying out loud, don’t have your phones or tablets with you at all times.  Break the addition.  And don’t have internet-connected TVs.  Why the hell do they have microphones, I wonder?  stream from a device without mic if you need that. permalink award report block reply wlatic 2 points 6 days ago Wait until these people learn you can reflash the cheap Chinese crap into local devices! permalink parent award report block reply ThisTrainHasNoBrakes 2 points 6 days ago Gotta start somewhere!  these are just my 4 litmus tests.  I don’t trust any device which is why they don’t get network access.  For all I know though…they do anyway through their own device - like new cars do with a built in SIM. permalink parent award report block reply wlatic 1 points 6 days ago Vlan or ip block? permalink parent award report block reply Jamps 2 points 6 days ago This.  I refuse to deploy anything that can't operate and be set up locally with HA and no internet access.  Wireguard for remote access. permalink parent award report block reply\nwlatic 2 points 6 days ago Wait until these people learn you can reflash the cheap Chinese crap into local devices! permalink parent award report block reply ThisTrainHasNoBrakes 2 points 6 days ago Gotta start somewhere!  these are just my 4 litmus tests.  I don’t trust any device which is why they don’t get network access.  For all I know though…they do anyway through their own device - like new cars do with a built in SIM. permalink parent award report block reply wlatic 1 points 6 days ago Vlan or ip block? permalink parent award report block reply\nThisTrainHasNoBrakes 2 points 6 days ago Gotta start somewhere!  these are just my 4 litmus tests.  I don’t trust any device which is why they don’t get network access.  For all I know though…they do anyway through their own device - like new cars do with a built in SIM. permalink parent award report block reply wlatic 1 points 6 days ago Vlan or ip block? permalink parent award report block reply\nwlatic 1 points 6 days ago Vlan or ip block? permalink parent award report block reply\nJamps 2 points 6 days ago This.  I refuse to deploy anything that can't operate and be set up locally with HA and no internet access.  Wireguard for remote access. permalink parent award report block reply\nGodKingHarambe 1 points 6 days ago I recalled reading something from Ray Kurzweil back I want to say around 2010 touting home automation, around when the Nest was released I thought if guys like him are touting it, I'm 11 ft. poling it permalink award report block reply\nTransparency 1 points 6 days ago Agreed, OP. I have a dumb-vehicle with manual locks and windows. Less stuff to break down and cause headaches, imo. permalink award report block reply\nDeplorableNeandertal 1 points 6 days ago I got mad buying my dishwasher because it has buttons… the cheapest model I could find and it didn’t have a knob it had those weird flat buttons permalink award report block reply",
  "fetched_at": "2025-11-12T22:53:49.991225Z"
}