{
  "id": "1ARK9is3Ri",
  "url": "https://patriots.win/p/1ARK9is3Ri/thoughts--prayers-for-these-fron/c",
  "content": "876 Thoughts & prayers for these frontline workers. posted 2 days ago by Whenagain 41 comments award share report block\n41 comments Sort by Top Top New Worst Old Save DT170x 44 points 2 days ago I work part-time at the Garden center at Walmart. The department covered Toys,Garden Center, and Seasonal. EBT unsupervised Crotch Goblins always go to Toys and throws and misplaced merchandise every where and leave Stolen Half eaten foods and drinks everywhere. What make me mad is the unsupervised children and the crying of the babies and if you call them out except a chimp out. Also I found a Lunch Box full of urine once. 😕 permalink award report block reply SteelDriver 23 points 2 days ago Also I found a Lunch Box full of urine once. 😕 🤔😳 permalink parent award report block reply DT170x 12 points 2 days ago I also found feces and bedbugs at toys before. I like the management but the clientele is absolutely garbage. permalink parent award report block reply Hanging_Chad 7 points 2 days ago adult toys? permalink parent award report block reply DT170x 8 points 2 days ago Adult toys is located at Family Planning section at the Pharmacy department. permalink parent award report block reply view 1 more comments... diverscale 4 points 2 days ago Holy shit permalink parent award report block reply Luvs_2_Bop 20 points 2 days ago New. Job. Literally anywhere else. Go somewhere with a different clientele that reduces your daily encounters with Chimpout-prone individuals permalink parent award report block reply DT170x 16 points 2 days ago Well It my Part-Time job. I used to work Full time then I got A much Higher paying job working at Pharmaceuticals. The reason I work at Walmart if I get lay off I got a 100 percent chance to become full time at Walmart while Looking for another job. Also I like the employees at Walmart. Edit: I work one 8 hour shift once a week and I do my once a week shopping after my shift ended. permalink parent award report block reply Im_RickSteves_bitch 13 points 2 days ago God bless you. I couldn't do that. permalink parent award report block reply Tele_Plus 10 points 2 days ago I have noticed the quality of Walmart employees has improved greatly in the past few years.  For a while there they were hiring some rough characters, people who couldn’t care less about appearance, professionalism or customer service.  Now they still have some of those people but also a lot of young people that actually seem motivated and responsible. permalink parent award report block reply ModernKnight 7 points 2 days ago It doesn't really get better.  I worked at a high-end grocery store in my area, and we still got EBT trash goblins coming through.  Being a cashier for them for a few years made me HATE all food stamp recipients.  They'd come through with carts full of sushi, high-end steaks, junk food, and $100+ specialty cakes from the bakery.  They were worse than the CEO's-wife-Karens.  The Chimpout-prone individuals have infested just about everywhere now. permalink parent award report block reply AfrikaanerBoer 14 points 2 days ago FUCKING NI99ERS permalink parent award report block reply ohwell316 6 points 2 days ago GG permalink parent award report block reply Skogin 7 points 2 days ago I’ve learned that job titles are rarely accurate. You are a behavioral psychologist in the field. permalink parent award report block reply ColonelKlink 3 points 2 days ago I knew someone who worked at a gas station and had to clean the bathrooms, as well. The amount of semen in there was ridiculous. Not once, or twice.. but repeatedly. This wasn't even a big city place. People disgust me so much. permalink parent award report block reply RentFree2020 20 points 2 days ago EBT Strikes Back permalink award report block reply IncredibleMrE1 13 points 2 days ago The Walmart Menace Attack of the Food Stamps Revenge of the SNAPs A New Work Requirement The EBT Strikes Back Return of the Job Application permalink parent award report block reply pikX 7 points 2 days ago the sequels dont even get to be a part of the joke, thats how bad they are permalink parent award report block reply IncredibleMrE1 4 points 2 days ago I don't even know their names permalink parent award report block reply diverscale 4 points 2 days ago Return of the job application kek!! permalink parent award report block reply TheRPatriot 2 points 2 days ago LOL permalink parent award report block reply Marianasoctober 12 points 2 days ago I used to work overnight grocery in a super ghetto store in South Carolina in the late 2000’s. The first of the month our trucks were around 2200 cases but closer to the end of the month they’d be around 700. I remember the first of the month every night coming into a ransacked department. The shelves were totally trashed. You’d have to sit there and sort out all the cans and boxes, etc. and don’t get me started on the koolaid packets. Good grief, it was like a hurricane went through. permalink award report block reply monkadelic 10 points 2 days ago literally sugar water.  Why do we have to pay for other people to get diabetes, then pay to treat their diabetes? permalink parent award report block reply DT170x 6 points 2 days ago I remember that AHA was fighting against MAHA for trying to remove Soda and Candy from SNAP. permalink parent award report block reply Marianasoctober 4 points 2 days ago All the sugary cereals, cookies, snack cakes, chips, sodas, etc as well. I was front end in the early 2000’s and sometimes the EBT system would go down for about 10 minutes. People would be losing their minds having to wait a minute for it to reboot. Like chill, lady.. you are getting a heaping basket of groceries for free. You can wait a minute! permalink parent award report block reply Steve56775 1 points 1 day ago Did you work the snack aisle? permalink parent award report block reply Marianasoctober 1 points 1 day ago I worked and/or conditioned all of the center aisles. Some name brand items in sections like sodas, cookies, crackers, snack cakes, chips, etc are stocked by vendors but we still had to condition those aisles. permalink parent award report block reply Lurker404 8 points 2 days ago EBT people could be here. permalink award report block reply Whenagain OP 3 points 2 days ago I'm sure. There are exceptions to every rule. permalink parent award report block reply Lurker404 3 points 1 day ago It's a reference to this meme. You take the euphemism of the day, like \"teens\" or \"joggers\", and add \"could be here.\" Always be on your guard! permalink parent award report block reply vongregormench 3 points 2 days ago Yes, but most of them have a good reason, not just being lazy leeches. permalink parent award report block reply sobriquet 3 points 2 days ago We can't stop here! This is bat ebt country. permalink parent award report block reply ThisTrainHasNoBrakes 5 points 2 days ago Link broken for me. 😓 permalink award report block reply mohel 1 points 2 days ago https://cdn.videy.co/uwSjJsWK1.mp4 permalink parent award report block reply Whenagain OP 1 points 2 days ago Thanks for reporting. Can you try a different browser, device, connection, and report back?\nIt works for most, but I am sure the mods are aware of the issue. permalink parent award report block reply vongregormench 4 points 2 days ago You had to dig up an old version of the movie for that song. permalink award report block reply Whenagain OP 3 points 2 days ago I just stole it, but this music is from the 1990s remaster--not the original song from the 1983 release! The old one was better IMHO. https://youtu.be/TvXm5HuR72k?si=IpDp67M1_qSAqvLP&t=64 permalink parent award report block reply vongregormench 3 points 2 days ago I remembered that after I posted my comment. The original was an Ewok song. permalink parent award report block reply DRKMSTR 1 points 2 days ago I am not \"right wing\" clearly I'm not far right enough. Looking at some of the stuff in the store \"maybe some overtime and I'll put that in the budget!\" only to see people have been using and abusing these systems for years. Just rips my heart out. What's the point of this all? Yeesh, back to work. permalink award report block reply\nDT170x 44 points 2 days ago I work part-time at the Garden center at Walmart. The department covered Toys,Garden Center, and Seasonal. EBT unsupervised Crotch Goblins always go to Toys and throws and misplaced merchandise every where and leave Stolen Half eaten foods and drinks everywhere. What make me mad is the unsupervised children and the crying of the babies and if you call them out except a chimp out. Also I found a Lunch Box full of urine once. 😕 permalink award report block reply SteelDriver 23 points 2 days ago Also I found a Lunch Box full of urine once. 😕 🤔😳 permalink parent award report block reply DT170x 12 points 2 days ago I also found feces and bedbugs at toys before. I like the management but the clientele is absolutely garbage. permalink parent award report block reply Hanging_Chad 7 points 2 days ago adult toys? permalink parent award report block reply DT170x 8 points 2 days ago Adult toys is located at Family Planning section at the Pharmacy department. permalink parent award report block reply view 1 more comments... diverscale 4 points 2 days ago Holy shit permalink parent award report block reply Luvs_2_Bop 20 points 2 days ago New. Job. Literally anywhere else. Go somewhere with a different clientele that reduces your daily encounters with Chimpout-prone individuals permalink parent award report block reply DT170x 16 points 2 days ago Well It my Part-Time job. I used to work Full time then I got A much Higher paying job working at Pharmaceuticals. The reason I work at Walmart if I get lay off I got a 100 percent chance to become full time at Walmart while Looking for another job. Also I like the employees at Walmart. Edit: I work one 8 hour shift once a week and I do my once a week shopping after my shift ended. permalink parent award report block reply Im_RickSteves_bitch 13 points 2 days ago God bless you. I couldn't do that. permalink parent award report block reply Tele_Plus 10 points 2 days ago I have noticed the quality of Walmart employees has improved greatly in the past few years.  For a while there they were hiring some rough characters, people who couldn’t care less about appearance, professionalism or customer service.  Now they still have some of those people but also a lot of young people that actually seem motivated and responsible. permalink parent award report block reply ModernKnight 7 points 2 days ago It doesn't really get better.  I worked at a high-end grocery store in my area, and we still got EBT trash goblins coming through.  Being a cashier for them for a few years made me HATE all food stamp recipients.  They'd come through with carts full of sushi, high-end steaks, junk food, and $100+ specialty cakes from the bakery.  They were worse than the CEO's-wife-Karens.  The Chimpout-prone individuals have infested just about everywhere now. permalink parent award report block reply AfrikaanerBoer 14 points 2 days ago FUCKING NI99ERS permalink parent award report block reply ohwell316 6 points 2 days ago GG permalink parent award report block reply Skogin 7 points 2 days ago I’ve learned that job titles are rarely accurate. You are a behavioral psychologist in the field. permalink parent award report block reply ColonelKlink 3 points 2 days ago I knew someone who worked at a gas station and had to clean the bathrooms, as well. The amount of semen in there was ridiculous. Not once, or twice.. but repeatedly. This wasn't even a big city place. People disgust me so much. permalink parent award report block reply\nSteelDriver 23 points 2 days ago Also I found a Lunch Box full of urine once. 😕 🤔😳 permalink parent award report block reply DT170x 12 points 2 days ago I also found feces and bedbugs at toys before. I like the management but the clientele is absolutely garbage. permalink parent award report block reply Hanging_Chad 7 points 2 days ago adult toys? permalink parent award report block reply DT170x 8 points 2 days ago Adult toys is located at Family Planning section at the Pharmacy department. permalink parent award report block reply view 1 more comments... diverscale 4 points 2 days ago Holy shit permalink parent award report block reply\nDT170x 12 points 2 days ago I also found feces and bedbugs at toys before. I like the management but the clientele is absolutely garbage. permalink parent award report block reply Hanging_Chad 7 points 2 days ago adult toys? permalink parent award report block reply DT170x 8 points 2 days ago Adult toys is located at Family Planning section at the Pharmacy department. permalink parent award report block reply view 1 more comments... diverscale 4 points 2 days ago Holy shit permalink parent award report block reply\nHanging_Chad 7 points 2 days ago adult toys? permalink parent award report block reply DT170x 8 points 2 days ago Adult toys is located at Family Planning section at the Pharmacy department. permalink parent award report block reply view 1 more comments...\nDT170x 8 points 2 days ago Adult toys is located at Family Planning section at the Pharmacy department. permalink parent award report block reply view 1 more comments...\ndiverscale 4 points 2 days ago Holy shit permalink parent award report block reply\nLuvs_2_Bop 20 points 2 days ago New. Job. Literally anywhere else. Go somewhere with a different clientele that reduces your daily encounters with Chimpout-prone individuals permalink parent award report block reply DT170x 16 points 2 days ago Well It my Part-Time job. I used to work Full time then I got A much Higher paying job working at Pharmaceuticals. The reason I work at Walmart if I get lay off I got a 100 percent chance to become full time at Walmart while Looking for another job. Also I like the employees at Walmart. Edit: I work one 8 hour shift once a week and I do my once a week shopping after my shift ended. permalink parent award report block reply Im_RickSteves_bitch 13 points 2 days ago God bless you. I couldn't do that. permalink parent award report block reply Tele_Plus 10 points 2 days ago I have noticed the quality of Walmart employees has improved greatly in the past few years.  For a while there they were hiring some rough characters, people who couldn’t care less about appearance, professionalism or customer service.  Now they still have some of those people but also a lot of young people that actually seem motivated and responsible. permalink parent award report block reply ModernKnight 7 points 2 days ago It doesn't really get better.  I worked at a high-end grocery store in my area, and we still got EBT trash goblins coming through.  Being a cashier for them for a few years made me HATE all food stamp recipients.  They'd come through with carts full of sushi, high-end steaks, junk food, and $100+ specialty cakes from the bakery.  They were worse than the CEO's-wife-Karens.  The Chimpout-prone individuals have infested just about everywhere now. permalink parent award report block reply\nDT170x 16 points 2 days ago Well It my Part-Time job. I used to work Full time then I got A much Higher paying job working at Pharmaceuticals. The reason I work at Walmart if I get lay off I got a 100 percent chance to become full time at Walmart while Looking for another job. Also I like the employees at Walmart. Edit: I work one 8 hour shift once a week and I do my once a week shopping after my shift ended. permalink parent award report block reply Im_RickSteves_bitch 13 points 2 days ago God bless you. I couldn't do that. permalink parent award report block reply Tele_Plus 10 points 2 days ago I have noticed the quality of Walmart employees has improved greatly in the past few years.  For a while there they were hiring some rough characters, people who couldn’t care less about appearance, professionalism or customer service.  Now they still have some of those people but also a lot of young people that actually seem motivated and responsible. permalink parent award report block reply\nIm_RickSteves_bitch 13 points 2 days ago God bless you. I couldn't do that. permalink parent award report block reply\nTele_Plus 10 points 2 days ago I have noticed the quality of Walmart employees has improved greatly in the past few years.  For a while there they were hiring some rough characters, people who couldn’t care less about appearance, professionalism or customer service.  Now they still have some of those people but also a lot of young people that actually seem motivated and responsible. permalink parent award report block reply\nModernKnight 7 points 2 days ago It doesn't really get better.  I worked at a high-end grocery store in my area, and we still got EBT trash goblins coming through.  Being a cashier for them for a few years made me HATE all food stamp recipients.  They'd come through with carts full of sushi, high-end steaks, junk food, and $100+ specialty cakes from the bakery.  They were worse than the CEO's-wife-Karens.  The Chimpout-prone individuals have infested just about everywhere now. permalink parent award report block reply\nAfrikaanerBoer 14 points 2 days ago FUCKING NI99ERS permalink parent award report block reply ohwell316 6 points 2 days ago GG permalink parent award report block reply\nohwell316 6 points 2 days ago GG permalink parent award report block reply\nSkogin 7 points 2 days ago I’ve learned that job titles are rarely accurate. You are a behavioral psychologist in the field. permalink parent award report block reply\nColonelKlink 3 points 2 days ago I knew someone who worked at a gas station and had to clean the bathrooms, as well. The amount of semen in there was ridiculous. Not once, or twice.. but repeatedly. This wasn't even a big city place. People disgust me so much. permalink parent award report block reply\nRentFree2020 20 points 2 days ago EBT Strikes Back permalink award report block reply IncredibleMrE1 13 points 2 days ago The Walmart Menace Attack of the Food Stamps Revenge of the SNAPs A New Work Requirement The EBT Strikes Back Return of the Job Application permalink parent award report block reply pikX 7 points 2 days ago the sequels dont even get to be a part of the joke, thats how bad they are permalink parent award report block reply IncredibleMrE1 4 points 2 days ago I don't even know their names permalink parent award report block reply diverscale 4 points 2 days ago Return of the job application kek!! permalink parent award report block reply TheRPatriot 2 points 2 days ago LOL permalink parent award report block reply\nIncredibleMrE1 13 points 2 days ago The Walmart Menace Attack of the Food Stamps Revenge of the SNAPs A New Work Requirement The EBT Strikes Back Return of the Job Application permalink parent award report block reply pikX 7 points 2 days ago the sequels dont even get to be a part of the joke, thats how bad they are permalink parent award report block reply IncredibleMrE1 4 points 2 days ago I don't even know their names permalink parent award report block reply diverscale 4 points 2 days ago Return of the job application kek!! permalink parent award report block reply TheRPatriot 2 points 2 days ago LOL permalink parent award report block reply\npikX 7 points 2 days ago the sequels dont even get to be a part of the joke, thats how bad they are permalink parent award report block reply IncredibleMrE1 4 points 2 days ago I don't even know their names permalink parent award report block reply\nIncredibleMrE1 4 points 2 days ago I don't even know their names permalink parent award report block reply\ndiverscale 4 points 2 days ago Return of the job application kek!! permalink parent award report block reply\nTheRPatriot 2 points 2 days ago LOL permalink parent award report block reply\nMarianasoctober 12 points 2 days ago I used to work overnight grocery in a super ghetto store in South Carolina in the late 2000’s. The first of the month our trucks were around 2200 cases but closer to the end of the month they’d be around 700. I remember the first of the month every night coming into a ransacked department. The shelves were totally trashed. You’d have to sit there and sort out all the cans and boxes, etc. and don’t get me started on the koolaid packets. Good grief, it was like a hurricane went through. permalink award report block reply monkadelic 10 points 2 days ago literally sugar water.  Why do we have to pay for other people to get diabetes, then pay to treat their diabetes? permalink parent award report block reply DT170x 6 points 2 days ago I remember that AHA was fighting against MAHA for trying to remove Soda and Candy from SNAP. permalink parent award report block reply Marianasoctober 4 points 2 days ago All the sugary cereals, cookies, snack cakes, chips, sodas, etc as well. I was front end in the early 2000’s and sometimes the EBT system would go down for about 10 minutes. People would be losing their minds having to wait a minute for it to reboot. Like chill, lady.. you are getting a heaping basket of groceries for free. You can wait a minute! permalink parent award report block reply Steve56775 1 points 1 day ago Did you work the snack aisle? permalink parent award report block reply Marianasoctober 1 points 1 day ago I worked and/or conditioned all of the center aisles. Some name brand items in sections like sodas, cookies, crackers, snack cakes, chips, etc are stocked by vendors but we still had to condition those aisles. permalink parent award report block reply\nmonkadelic 10 points 2 days ago literally sugar water.  Why do we have to pay for other people to get diabetes, then pay to treat their diabetes? permalink parent award report block reply DT170x 6 points 2 days ago I remember that AHA was fighting against MAHA for trying to remove Soda and Candy from SNAP. permalink parent award report block reply Marianasoctober 4 points 2 days ago All the sugary cereals, cookies, snack cakes, chips, sodas, etc as well. I was front end in the early 2000’s and sometimes the EBT system would go down for about 10 minutes. People would be losing their minds having to wait a minute for it to reboot. Like chill, lady.. you are getting a heaping basket of groceries for free. You can wait a minute! permalink parent award report block reply\nDT170x 6 points 2 days ago I remember that AHA was fighting against MAHA for trying to remove Soda and Candy from SNAP. permalink parent award report block reply\nMarianasoctober 4 points 2 days ago All the sugary cereals, cookies, snack cakes, chips, sodas, etc as well. I was front end in the early 2000’s and sometimes the EBT system would go down for about 10 minutes. People would be losing their minds having to wait a minute for it to reboot. Like chill, lady.. you are getting a heaping basket of groceries for free. You can wait a minute! permalink parent award report block reply\nSteve56775 1 points 1 day ago Did you work the snack aisle? permalink parent award report block reply Marianasoctober 1 points 1 day ago I worked and/or conditioned all of the center aisles. Some name brand items in sections like sodas, cookies, crackers, snack cakes, chips, etc are stocked by vendors but we still had to condition those aisles. permalink parent award report block reply\nMarianasoctober 1 points 1 day ago I worked and/or conditioned all of the center aisles. Some name brand items in sections like sodas, cookies, crackers, snack cakes, chips, etc are stocked by vendors but we still had to condition those aisles. permalink parent award report block reply\nLurker404 8 points 2 days ago EBT people could be here. permalink award report block reply Whenagain OP 3 points 2 days ago I'm sure. There are exceptions to every rule. permalink parent award report block reply Lurker404 3 points 1 day ago It's a reference to this meme. You take the euphemism of the day, like \"teens\" or \"joggers\", and add \"could be here.\" Always be on your guard! permalink parent award report block reply vongregormench 3 points 2 days ago Yes, but most of them have a good reason, not just being lazy leeches. permalink parent award report block reply sobriquet 3 points 2 days ago We can't stop here! This is bat ebt country. permalink parent award report block reply\nWhenagain OP 3 points 2 days ago I'm sure. There are exceptions to every rule. permalink parent award report block reply Lurker404 3 points 1 day ago It's a reference to this meme. You take the euphemism of the day, like \"teens\" or \"joggers\", and add \"could be here.\" Always be on your guard! permalink parent award report block reply\nLurker404 3 points 1 day ago It's a reference to this meme. You take the euphemism of the day, like \"teens\" or \"joggers\", and add \"could be here.\" Always be on your guard! permalink parent award report block reply\nvongregormench 3 points 2 days ago Yes, but most of them have a good reason, not just being lazy leeches. permalink parent award report block reply\nsobriquet 3 points 2 days ago We can't stop here! This is bat ebt country. permalink parent award report block reply\nThisTrainHasNoBrakes 5 points 2 days ago Link broken for me. 😓 permalink award report block reply mohel 1 points 2 days ago https://cdn.videy.co/uwSjJsWK1.mp4 permalink parent award report block reply Whenagain OP 1 points 2 days ago Thanks for reporting. Can you try a different browser, device, connection, and report back?\nIt works for most, but I am sure the mods are aware of the issue. permalink parent award report block reply\nmohel 1 points 2 days ago https://cdn.videy.co/uwSjJsWK1.mp4 permalink parent award report block reply\nWhenagain OP 1 points 2 days ago Thanks for reporting. Can you try a different browser, device, connection, and report back?\nIt works for most, but I am sure the mods are aware of the issue. permalink parent award report block reply\nvongregormench 4 points 2 days ago You had to dig up an old version of the movie for that song. permalink award report block reply Whenagain OP 3 points 2 days ago I just stole it, but this music is from the 1990s remaster--not the original song from the 1983 release! The old one was better IMHO. https://youtu.be/TvXm5HuR72k?si=IpDp67M1_qSAqvLP&t=64 permalink parent award report block reply vongregormench 3 points 2 days ago I remembered that after I posted my comment. The original was an Ewok song. permalink parent award report block reply\nWhenagain OP 3 points 2 days ago I just stole it, but this music is from the 1990s remaster--not the original song from the 1983 release! The old one was better IMHO. https://youtu.be/TvXm5HuR72k?si=IpDp67M1_qSAqvLP&t=64 permalink parent award report block reply vongregormench 3 points 2 days ago I remembered that after I posted my comment. The original was an Ewok song. permalink parent award report block reply\nvongregormench 3 points 2 days ago I remembered that after I posted my comment. The original was an Ewok song. permalink parent award report block reply\nDRKMSTR 1 points 2 days ago I am not \"right wing\" clearly I'm not far right enough. Looking at some of the stuff in the store \"maybe some overtime and I'll put that in the budget!\" only to see people have been using and abusing these systems for years. Just rips my heart out. What's the point of this all? Yeesh, back to work. permalink award report block reply",
  "fetched_at": "2025-11-12T20:39:12.453696Z"
}