{
  "id": "1ARK58zFhK",
  "url": "https://patriots.win/p/1ARK58zFhK/terminate-the-filibuster\n\n\n\n/c",
  "content": "1036 🔴TERMINATE THE FILIBUSTER! TRUMP  TRUTH posted 4 days ago by DeusVult1096 91 comments award share download report block\n91 comments Sort by Top Top New Worst Old Save Prof_Smith 45 points 4 days ago You get rid of the filibuster to just pass a CR may be the dumbest thing ever suggested. If you are going to open that door forever, you have a shit load of bills piled up ready for the senate. Full budget, every Trump executive order, everything piled up for one go. The tool is too important to just piss away on a CR of this shit show of a budget. permalink award report block reply TheJakeFroggy 49 points 4 days ago He's not pushing for the filibuster to get nuked just for the sake of passing a CR. You're not getting it. He has repeatedly acknowledged that he wants the filibuster nuked to enact his agenda as a whole. permalink parent award report block reply Appeal2Heaven98 18 points 4 days ago Yeah. I think he realizes the writing's on the wall. The Democrats will do it in a heartbeat if and when they control all branches of government. He wants the jump on it to minimize the damage. permalink parent award report block reply papa_newguineapig 12 points 4 days ago And that day will be the end of our Nation as we know it. Better act fast, this Country is slipping away under the leadership WE elected. How, I have NO idea. Feckless cowards. The entire lot. permalink parent award report block reply Tacitus1963 2 points 4 days ago It's because most of them are compromised AF. Imagine what must be on the videos that are held over their heads.\nThey are also greedy SOBs who have no issue selling us out for their share of our looted tax dollars. And I'm just talking about the RINOs here. The other side? Well, we know what they are.\nRemember Barry Soetoro had to get rid of Gen Flynn as Flynn knew where all the bodies are buried. https://www.lifesitenews.com/news/gen-michael-flynn-suggests-members-of-congress-are-compromised-due-to-sleeping-with-children/ permalink parent award report block reply SpellingContable 1 points 4 days ago Well see,  they work for themselves first, and the globalists second, and then more localized organized crime third, and then they work you and Trump. permalink parent award report block reply jml1997 1 points 4 days ago The problem is it won't be an \"if\". It's going to happen. They just did a test run of some fraud tactics this past election. This was the ramp up for the mid terms. Don't be surprised when we lose both the House and the Senate. permalink parent award report block reply yodayoda 4 points 4 days ago you must be sadly mistaken. i've been told on these forums 100 times that demonrats will never win another election again, that they have no good ideas or policies, that everyone hates them, yadda yadda. when i retorted that they've never had good ideas or policies but that never stopped them before, that they aren't going anywhere, i was called faggot for my trouble. permalink parent award report block reply KungPaoMcChicken 0 points 4 days ago Filibuster is dumb and has no right to exist. permalink parent award report block reply Prof_Smith 3 points 4 days ago So, your plan is to trust congressional republicans.  Might as well just jump off a cliff ourselves. permalink parent award report block reply popcycle 1 points 4 days ago ok, suppose everything happened exactly as the Republicans would want, and Democrats were put into a situation where they can never catch up again. that's the end of the DEMS, you think.  no, it's also the end of the Republicans, because without being scared of getting voted out, they would do whatever they want, which for most of them, is nothing, or worse. permalink parent award report block reply tpactionchasethevote 1 points 4 days ago Would there then be enough votes to release the Epstein files? permalink parent award report block reply Hanging_Chad 9 points 4 days ago what Epstein files? permalink parent award report block reply stjimmy92 4 points 4 days ago I’m pretty sure there’s not enough votes to pass anything with Murkowski, Collins, Rand, and McConnell permalink parent award report block reply Kraken_V_Algorithm 3 points 4 days ago If the House starts sending single issue bills to the Senate there's a chance to get at least Rand and maybe McConnell on a fair number of them.  Murkowski and Collins will be exposed without the cover of multiple issues to blame their opposition on. permalink parent award report block reply view 3 more comments... keeman 2 points 4 days ago No.  The Epstein files are not at all interesting and implicate exactly zero Israeli government officials.  There is nothing to see there and if you ask about this again you will be investigated for possible terrorism. permalink parent award report block reply keeman 1 points 4 days ago You think the RINOs are gonna do that?  Fuck me you are stupid. permalink parent award report block reply rebuildingMyself 23 points 4 days ago If that happens I still expect enough RINOs to betray the country and keep everything 49-51 permalink parent award report block reply Appeal2Heaven98 5 points 4 days ago This may sadly be a reality. permalink parent award report block reply tpactionchasethevote 1 points 4 days ago 👆 permalink parent award report block reply America_No_1 5 points 4 days ago He listed all the things we could do in a speech just yesterday.  Let's get with the program in this information war, centipede! permalink parent award report block reply Prof_Smith 1 points 4 days ago He can say all he wants.  I don’t see any bills to that end game.  Depend on congressional republicans at your own peril permalink parent award report block reply America_No_1 1 points 4 days ago Thats fair just informing permalink parent award report block reply ConfusedAngryArmed 5 points 4 days ago But muh minority vote! Think of how they need their SNAP gibs! permalink parent award report block reply Prof_Smith 2 points 4 days ago I don’t care if they ever open back up.  SNAP, social security, TsA, air traffic controllers, it all can go away forever for all I care. permalink parent award report block reply ArmsLibertyjUStice 2 points 4 days ago The filibuster 60-vote rule is a senate rule created by the senate in 1972. It can be removed anytime by the senate. If you are suggesting that this traditional formality is somehow long-term protection against democrats, that is naive. Real protection will be when we codify election integrity into law and prevent packing of the Supreme Court by law. The filibuster is likely to prevent that from ever happening. Democrats have already tried to end the filibuster in the past although two of them were against it. Those two are retired now. permalink parent award report block reply Prof_Smith 0 points 3 days ago It also the protection against republicans. The fact that so many people here are willing to trust congressional republicans is disgusting. permalink parent award report block reply anotherthing 0 points 3 days ago The filibuster goes back to the early 1800s. It's changed several times, but it's not something new. Hell, Mr. Smith Goes to Washington was all about the filibuster and that movie was made back in 1939. Great movie from a better time. permalink parent award report block reply load 5 more comments... truthtoday2022 20 points 4 days ago The truth is, the filibuster is the critical tool that GOA has used for years to DEFEAT: Mandatory gun registration Bans on common firearms Crushing restrictions on gun shows National gun confiscation laws And countless other gun-grabbing schemes If the filibuster falls, no matter who demands it, the gun control crowd in Congress will ram every radical gun control bill into law. If the filibuster is nuked, there will be nothing left to stop a flood of anti-gun legislation. permalink award report block reply ConfusedAngryArmed 10 points 4 days ago Exactly this. The only people pushing to nuke the filibuster don't understand the significance of how it's been used to help us more than hinder us. permalink parent award report block reply TheJakeFroggy 13 points 4 days ago If you paid attention to what happened during the Biden years, the Democrats tried to get rid of the filibuster, and the only reason they hadn't succeeded at it was because of Joe Manchin and Kyrsten Sinema. But those two aren't Senators anymore. All the Democrats currently in the Senate are on-board to nuke the filibuster the first chance they get. And so you know damn well they're gonna do it as soon as they get back in power. As of right now in this current term, the filibuster has prevented Trump's agenda from being enacted more than anything, and you can bet that the Democrats love it existing right now. Trump is right to want to get rid of it right now, might as well do it before the Democrats can, and then Trump can get his agenda passed, and because it includes election reform, that'll put the Democrats at a massive disadvantage and likely prevent them from ever getting back into power. Trump knows what's he doing to want to remove the filibuster. permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago Okay, then why haven't they done it? They had 8 years of Obama and 4 of Biden. It's simple, they couldn't. And had it not been for that fact, you'd be here bitching about how they took our guns away among other things. And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. permalink parent award report block reply TheJakeFroggy -1 points 4 days ago And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. You really don't get it, do you? It literally does not fucking matter. If we don't get rid of the filibuster, then the Democrats will get rid of it literally within the first hour as soon as they get back into power. It does not matter if we do it first. Although there's one difference if we were to do it first: If we did it first, it'd then be possible to ram through Trump's whole agenda, and that could stomp all over the Democrats and prevent them from ever getting back into power. I literally already said this in my previous response, but I guess you can't get it through your head. If we don't get rid of the filibuster, they'll do it as soon as they get back into power. Tell me, what do we have to lose by doing it first? Because I well and truly believe we'd have nothing to lose by doing it first. Trump has the right idea in this situation. permalink parent award report block reply view 1 more comments... keeman 1 points 4 days ago At this point they as well do it.  Trump pushing for it makes future Dems  doing the same inevitable.  Trump should have fucking shut his mouth.  But yeah, end it.  Dems will do it anyway.  And then invest in property FAR away from the USA. permalink parent award report block reply popcycle 1 points 4 days ago manchin and cinema was theater set up be the dems themselves, for their own low information voters.  they knew they'd need the fbuster later, like this year. arguing over stupid things is losing us focus permalink parent award report block reply YesImWhite 7 points 4 days ago the fillibuster is used to never get anything done permalink parent award report block reply popcycle 2 points 4 days ago good.  as far as I can see that's most of the point of our republic system. gather up the power hungry people, make them fight each other so the rest of us can live in peace, grow the food, make the steel, raise the families, br left alone. maybe well get lucky and the shutdown never ends.. permalink parent award report block reply Appeal2Heaven98 5 points 4 days ago The Democrats are going to do it anyway as soon as they get power in all three branches of government. I think Trump realizes this, so he wants the jump to push as much legislation as possible. permalink parent award report block reply TheBebop 4 points 4 days ago Pass whatever gun control law they want.... they still would have to come and take them...  End the filibuster permalink parent award report block reply Appeal2Heaven98 8 points 4 days ago If they come to your property to take them, it's already too late. permalink parent award report block reply LordKuroTheGreat 5 points 4 days ago I'd like to say bring it, but after 2020 I doubt we'd get that beautiful fierce self defense of our values that America deserves. Hell, there'd probably be people here saying to go along with it to get some piddling concession or good optics. permalink parent award report block reply anotherthing 1 points 3 days ago Remember how the right was protesting in 2020 over COVID19 mandates and the election? And how that abruptly ended with January 6th? People talk big about how they'll make a stand when the government comes to their door to take their guns. If they won't get out on a street corner and wave a cardboard sign, they'll turn those guns over first thing when there's boots on their porch and tell those government men to have a nice day as they're leaving. permalink parent award report block reply ConfusedAngryArmed 0 points 4 days ago And they will send the very police and federal law enforcement that so many people here support to come kill you, your family, and your dogs over them. permalink parent award report block reply YesImWhite 2 points 4 days ago then we die I guess. permalink parent award report block reply ConfusedAngryArmed 2 points 4 days ago If you're willing to go that far, you should be ready to form organized militias to overthrow the aforementioned tyrannical government. You won't though, and neither will myself or anybody else on this board. Why? Because everyone is too comfortable, and so long as people are comfortable nothing will change. Hell, I just got done arguing with someone else that thinks protesting still matters. No one is willing to risk their life and livelihood, and I don't blame them one bit. Why do that when others aren't willing to do the same for them? At best you'll end up with fringe resistance groups. At worst it will just be random lone wolves throwing their lives away. permalink parent award report block reply view 1 more comments... mikejones 1 points 4 days ago and blackpilled. permalink parent award report block reply Owmyballz 2 points 4 days ago The Democrats that we negotiated with for filibuster no longer exists.  As soon as the Democrat Socialist controlled Democrat party takes power, the filibuster will be removed.  They will wait UNTIL they have the Presidency and Congress to prevent Veto. Meanwhile if we stop them now with removing the filibuster we can require voter ID which will save the union and prevent the Democrats from future gains. permalink parent award report block reply popcycle 1 points 4 days ago the Democrats are about as socialist as they were in 1860 and that includes phony zohran. permalink parent award report block reply ListenJack 1 points 4 days ago Why is this so hard for people to see? Election integrity is all that matters at this point. If Trump can't codify it, then the U.S. is gone the minute Trump leaves office. permalink parent award report block reply papa_newguineapig 1 points 4 days ago You understand the moment the Democrats seize control again, the Filabuster is GONE. And we'll have our guns stripped away, and rounded up into camps, or worse. It's about time we go on the fucking Offensive, to put boot to throat permalink parent award report block reply load 4 more comments... turdinthepunch 16 points 4 days ago They're not gonna do it permalink award report block reply MrMcGreenGenes 4 points 4 days ago If they do, isn't it only 51 votes to reinstate it? Can Filibuster Be Reinstated The Senate filibuster can be reinstated if it is removed, as it is not mandated by the Constitution and has been modified multiple times through simple majority votes The filibuster exists as a procedural rule, and like past changes to Senate rules, its reinstatement would require another majority vote However, there is significant concern that once eliminated, neither party would have an incentive to bring it back while in power, potentially leading to permanent consequences for Senate procedure The rule has already undergone major changes, such as the elimination of the filibuster for executive and judicial nominees by both parties in 2013 and 2017, demonstrating its vulnerability to partisan shifts permalink award report block reply Nomad899 4 points 4 days ago starwars meme…. It’s a trap permalink award report block reply truthtoday2022 5 points 4 days ago PDW would be so much better if we could post images in the comments permalink parent award report block reply EgregiousPhilbin 2 points 4 days ago lol you can't even post Twitter posts in here without half of it getting cut off. It's 2025. permalink parent award report block reply darkmodeforgotpass 1 points 4 days ago It would be no better than cancerous twitch chat and shills would invade to spam stupid jokes instead of trying to convince with words. This place isn't tranny infested /pol/, not gonna happen. permalink parent award report block reply Cablespider 3 points 4 days ago SlipperySlope enters chat permalink award report block reply GreyGooseDown 3 points 4 days ago I hope he has a better argument or plan than this.  Getting rid of this will not be good for the day we don't control the Senate. permalink award report block reply corntortilla 2 points 4 days ago There aren’t enough Republican votes to get rid of it and Trump knows it. permalink award report block reply JohnN 2 points 4 days ago Moot discussion.  There aren't enough RINOs who'd vote to nuke it. permalink award report block reply dude_bro 2 points 4 days ago RICO Soros! permalink award report block reply Dualsporter 2 points 4 days ago DO IT! If we don't, they will. Do it and then run a train of bills over their heads. We are past the time to be \"polite\". Time to step up and show them that we are no longer \"amused\". permalink award report block reply friedchicken 1 points 4 days ago At least the shit-for-brains bureaucracy isn't drumming up fairy tales to come up with and justify retarded laws. Bring back paint strippers that work goddammit. permalink award report block reply ReallyGayMods 1 points 4 days ago No permalink award report block reply yodayoda 1 points 4 days ago filibuster the terminator! permalink award report block reply Michalusmichalus 1 points 4 days ago But, where else where I listen to audio cookbooks? And , the bathroom break betting. That's classic. permalink award report block reply thatsallphoax 1 points 4 days ago CNN: Trump threatens to assassinate Phillip Buster permalink award report block reply Modernturnkey 1 points 4 days ago Are we cooked bros? permalink award report block reply MoreGuns 1 points 4 days ago Fingers crossed 🤞 permalink award report block reply Tookens 1 points 4 days ago The filibuster was fine in it's original form.  A senator could get up at that podium and talk for days to temporarily delay a vote.  But that has little to do with the modern filibuster.  Now, the minority gets to dictate to the majority what can be voted on and what can't be voted on.  It's entirely undemocratic and it HAS to go. permalink award report block reply Taupkek 1 points 4 days ago We are behind you Mr. President! permalink award report block reply JackLemon 1 points 4 days ago NO Eliminating it would be effing insane. A potential nation ending mistake. permalink award report block reply patrioticwinning3 1 points 4 days ago DO IT! permalink award report block reply keeman 0 points 4 days ago The reason we don't have full communism is the filibuster.  So no.  This is a BAD idea.  Next time the Ds take power they will immediately use it. permalink award report block reply NonbinaryPotatohead -1 points 4 days ago NO. You do and say goodbye to your guns. PERIOD. This isn't some game. These democrats and neocons are hellbent on stealing the last fumes of freedom we have left. Last time, it was the democrats that wanted to nuke the filibuster. They failed and we all breathed a sigh of relief. How is it different now? We won't be fooled into supporting bullshit like this. The MAGA base is currently losing steam due to things like the Epstein files debacle, Israel, funding Ukraine and Israel...etc etc etc. You just lost a massive portion of voters ,who flipped from democrat last election after seeing Biden/Kamala failures, due to the optics of this SNAP shit. If it continues and they don't get da gimme datz, the democrats are going to gain back a significant portion of those people and may even gain people from the republican side because they are tired of these fake neocons. We still don't know the aftermath of the ICE op and the real deportation numbers and the effects leading up to the voter base for the next election. Democrats just cleaned the Republican's clocks in the primaries and just took NYC to unprecedented levels of communism. What makes you think they can't win more seats? If MAGA is divided then kiss the next election goodbye.\nWe started out with a great speech during the inauguration about the \"Golden Age of America\", etc. But wtf is this? Is this what the donor is demanding now like the other things they were demanding? WTF is going on? permalink award report block reply\nProf_Smith 45 points 4 days ago You get rid of the filibuster to just pass a CR may be the dumbest thing ever suggested. If you are going to open that door forever, you have a shit load of bills piled up ready for the senate. Full budget, every Trump executive order, everything piled up for one go. The tool is too important to just piss away on a CR of this shit show of a budget. permalink award report block reply TheJakeFroggy 49 points 4 days ago He's not pushing for the filibuster to get nuked just for the sake of passing a CR. You're not getting it. He has repeatedly acknowledged that he wants the filibuster nuked to enact his agenda as a whole. permalink parent award report block reply Appeal2Heaven98 18 points 4 days ago Yeah. I think he realizes the writing's on the wall. The Democrats will do it in a heartbeat if and when they control all branches of government. He wants the jump on it to minimize the damage. permalink parent award report block reply papa_newguineapig 12 points 4 days ago And that day will be the end of our Nation as we know it. Better act fast, this Country is slipping away under the leadership WE elected. How, I have NO idea. Feckless cowards. The entire lot. permalink parent award report block reply Tacitus1963 2 points 4 days ago It's because most of them are compromised AF. Imagine what must be on the videos that are held over their heads.\nThey are also greedy SOBs who have no issue selling us out for their share of our looted tax dollars. And I'm just talking about the RINOs here. The other side? Well, we know what they are.\nRemember Barry Soetoro had to get rid of Gen Flynn as Flynn knew where all the bodies are buried. https://www.lifesitenews.com/news/gen-michael-flynn-suggests-members-of-congress-are-compromised-due-to-sleeping-with-children/ permalink parent award report block reply SpellingContable 1 points 4 days ago Well see,  they work for themselves first, and the globalists second, and then more localized organized crime third, and then they work you and Trump. permalink parent award report block reply jml1997 1 points 4 days ago The problem is it won't be an \"if\". It's going to happen. They just did a test run of some fraud tactics this past election. This was the ramp up for the mid terms. Don't be surprised when we lose both the House and the Senate. permalink parent award report block reply yodayoda 4 points 4 days ago you must be sadly mistaken. i've been told on these forums 100 times that demonrats will never win another election again, that they have no good ideas or policies, that everyone hates them, yadda yadda. when i retorted that they've never had good ideas or policies but that never stopped them before, that they aren't going anywhere, i was called faggot for my trouble. permalink parent award report block reply KungPaoMcChicken 0 points 4 days ago Filibuster is dumb and has no right to exist. permalink parent award report block reply Prof_Smith 3 points 4 days ago So, your plan is to trust congressional republicans.  Might as well just jump off a cliff ourselves. permalink parent award report block reply popcycle 1 points 4 days ago ok, suppose everything happened exactly as the Republicans would want, and Democrats were put into a situation where they can never catch up again. that's the end of the DEMS, you think.  no, it's also the end of the Republicans, because without being scared of getting voted out, they would do whatever they want, which for most of them, is nothing, or worse. permalink parent award report block reply tpactionchasethevote 1 points 4 days ago Would there then be enough votes to release the Epstein files? permalink parent award report block reply Hanging_Chad 9 points 4 days ago what Epstein files? permalink parent award report block reply stjimmy92 4 points 4 days ago I’m pretty sure there’s not enough votes to pass anything with Murkowski, Collins, Rand, and McConnell permalink parent award report block reply Kraken_V_Algorithm 3 points 4 days ago If the House starts sending single issue bills to the Senate there's a chance to get at least Rand and maybe McConnell on a fair number of them.  Murkowski and Collins will be exposed without the cover of multiple issues to blame their opposition on. permalink parent award report block reply view 3 more comments... keeman 2 points 4 days ago No.  The Epstein files are not at all interesting and implicate exactly zero Israeli government officials.  There is nothing to see there and if you ask about this again you will be investigated for possible terrorism. permalink parent award report block reply keeman 1 points 4 days ago You think the RINOs are gonna do that?  Fuck me you are stupid. permalink parent award report block reply rebuildingMyself 23 points 4 days ago If that happens I still expect enough RINOs to betray the country and keep everything 49-51 permalink parent award report block reply Appeal2Heaven98 5 points 4 days ago This may sadly be a reality. permalink parent award report block reply tpactionchasethevote 1 points 4 days ago 👆 permalink parent award report block reply America_No_1 5 points 4 days ago He listed all the things we could do in a speech just yesterday.  Let's get with the program in this information war, centipede! permalink parent award report block reply Prof_Smith 1 points 4 days ago He can say all he wants.  I don’t see any bills to that end game.  Depend on congressional republicans at your own peril permalink parent award report block reply America_No_1 1 points 4 days ago Thats fair just informing permalink parent award report block reply ConfusedAngryArmed 5 points 4 days ago But muh minority vote! Think of how they need their SNAP gibs! permalink parent award report block reply Prof_Smith 2 points 4 days ago I don’t care if they ever open back up.  SNAP, social security, TsA, air traffic controllers, it all can go away forever for all I care. permalink parent award report block reply ArmsLibertyjUStice 2 points 4 days ago The filibuster 60-vote rule is a senate rule created by the senate in 1972. It can be removed anytime by the senate. If you are suggesting that this traditional formality is somehow long-term protection against democrats, that is naive. Real protection will be when we codify election integrity into law and prevent packing of the Supreme Court by law. The filibuster is likely to prevent that from ever happening. Democrats have already tried to end the filibuster in the past although two of them were against it. Those two are retired now. permalink parent award report block reply Prof_Smith 0 points 3 days ago It also the protection against republicans. The fact that so many people here are willing to trust congressional republicans is disgusting. permalink parent award report block reply anotherthing 0 points 3 days ago The filibuster goes back to the early 1800s. It's changed several times, but it's not something new. Hell, Mr. Smith Goes to Washington was all about the filibuster and that movie was made back in 1939. Great movie from a better time. permalink parent award report block reply load 5 more comments...\nTheJakeFroggy 49 points 4 days ago He's not pushing for the filibuster to get nuked just for the sake of passing a CR. You're not getting it. He has repeatedly acknowledged that he wants the filibuster nuked to enact his agenda as a whole. permalink parent award report block reply Appeal2Heaven98 18 points 4 days ago Yeah. I think he realizes the writing's on the wall. The Democrats will do it in a heartbeat if and when they control all branches of government. He wants the jump on it to minimize the damage. permalink parent award report block reply papa_newguineapig 12 points 4 days ago And that day will be the end of our Nation as we know it. Better act fast, this Country is slipping away under the leadership WE elected. How, I have NO idea. Feckless cowards. The entire lot. permalink parent award report block reply Tacitus1963 2 points 4 days ago It's because most of them are compromised AF. Imagine what must be on the videos that are held over their heads.\nThey are also greedy SOBs who have no issue selling us out for their share of our looted tax dollars. And I'm just talking about the RINOs here. The other side? Well, we know what they are.\nRemember Barry Soetoro had to get rid of Gen Flynn as Flynn knew where all the bodies are buried. https://www.lifesitenews.com/news/gen-michael-flynn-suggests-members-of-congress-are-compromised-due-to-sleeping-with-children/ permalink parent award report block reply SpellingContable 1 points 4 days ago Well see,  they work for themselves first, and the globalists second, and then more localized organized crime third, and then they work you and Trump. permalink parent award report block reply jml1997 1 points 4 days ago The problem is it won't be an \"if\". It's going to happen. They just did a test run of some fraud tactics this past election. This was the ramp up for the mid terms. Don't be surprised when we lose both the House and the Senate. permalink parent award report block reply yodayoda 4 points 4 days ago you must be sadly mistaken. i've been told on these forums 100 times that demonrats will never win another election again, that they have no good ideas or policies, that everyone hates them, yadda yadda. when i retorted that they've never had good ideas or policies but that never stopped them before, that they aren't going anywhere, i was called faggot for my trouble. permalink parent award report block reply KungPaoMcChicken 0 points 4 days ago Filibuster is dumb and has no right to exist. permalink parent award report block reply Prof_Smith 3 points 4 days ago So, your plan is to trust congressional republicans.  Might as well just jump off a cliff ourselves. permalink parent award report block reply popcycle 1 points 4 days ago ok, suppose everything happened exactly as the Republicans would want, and Democrats were put into a situation where they can never catch up again. that's the end of the DEMS, you think.  no, it's also the end of the Republicans, because without being scared of getting voted out, they would do whatever they want, which for most of them, is nothing, or worse. permalink parent award report block reply tpactionchasethevote 1 points 4 days ago Would there then be enough votes to release the Epstein files? permalink parent award report block reply Hanging_Chad 9 points 4 days ago what Epstein files? permalink parent award report block reply stjimmy92 4 points 4 days ago I’m pretty sure there’s not enough votes to pass anything with Murkowski, Collins, Rand, and McConnell permalink parent award report block reply Kraken_V_Algorithm 3 points 4 days ago If the House starts sending single issue bills to the Senate there's a chance to get at least Rand and maybe McConnell on a fair number of them.  Murkowski and Collins will be exposed without the cover of multiple issues to blame their opposition on. permalink parent award report block reply view 3 more comments... keeman 2 points 4 days ago No.  The Epstein files are not at all interesting and implicate exactly zero Israeli government officials.  There is nothing to see there and if you ask about this again you will be investigated for possible terrorism. permalink parent award report block reply keeman 1 points 4 days ago You think the RINOs are gonna do that?  Fuck me you are stupid. permalink parent award report block reply\nAppeal2Heaven98 18 points 4 days ago Yeah. I think he realizes the writing's on the wall. The Democrats will do it in a heartbeat if and when they control all branches of government. He wants the jump on it to minimize the damage. permalink parent award report block reply papa_newguineapig 12 points 4 days ago And that day will be the end of our Nation as we know it. Better act fast, this Country is slipping away under the leadership WE elected. How, I have NO idea. Feckless cowards. The entire lot. permalink parent award report block reply Tacitus1963 2 points 4 days ago It's because most of them are compromised AF. Imagine what must be on the videos that are held over their heads.\nThey are also greedy SOBs who have no issue selling us out for their share of our looted tax dollars. And I'm just talking about the RINOs here. The other side? Well, we know what they are.\nRemember Barry Soetoro had to get rid of Gen Flynn as Flynn knew where all the bodies are buried. https://www.lifesitenews.com/news/gen-michael-flynn-suggests-members-of-congress-are-compromised-due-to-sleeping-with-children/ permalink parent award report block reply SpellingContable 1 points 4 days ago Well see,  they work for themselves first, and the globalists second, and then more localized organized crime third, and then they work you and Trump. permalink parent award report block reply jml1997 1 points 4 days ago The problem is it won't be an \"if\". It's going to happen. They just did a test run of some fraud tactics this past election. This was the ramp up for the mid terms. Don't be surprised when we lose both the House and the Senate. permalink parent award report block reply yodayoda 4 points 4 days ago you must be sadly mistaken. i've been told on these forums 100 times that demonrats will never win another election again, that they have no good ideas or policies, that everyone hates them, yadda yadda. when i retorted that they've never had good ideas or policies but that never stopped them before, that they aren't going anywhere, i was called faggot for my trouble. permalink parent award report block reply KungPaoMcChicken 0 points 4 days ago Filibuster is dumb and has no right to exist. permalink parent award report block reply\npapa_newguineapig 12 points 4 days ago And that day will be the end of our Nation as we know it. Better act fast, this Country is slipping away under the leadership WE elected. How, I have NO idea. Feckless cowards. The entire lot. permalink parent award report block reply Tacitus1963 2 points 4 days ago It's because most of them are compromised AF. Imagine what must be on the videos that are held over their heads.\nThey are also greedy SOBs who have no issue selling us out for their share of our looted tax dollars. And I'm just talking about the RINOs here. The other side? Well, we know what they are.\nRemember Barry Soetoro had to get rid of Gen Flynn as Flynn knew where all the bodies are buried. https://www.lifesitenews.com/news/gen-michael-flynn-suggests-members-of-congress-are-compromised-due-to-sleeping-with-children/ permalink parent award report block reply SpellingContable 1 points 4 days ago Well see,  they work for themselves first, and the globalists second, and then more localized organized crime third, and then they work you and Trump. permalink parent award report block reply\nTacitus1963 2 points 4 days ago It's because most of them are compromised AF. Imagine what must be on the videos that are held over their heads.\nThey are also greedy SOBs who have no issue selling us out for their share of our looted tax dollars. And I'm just talking about the RINOs here. The other side? Well, we know what they are.\nRemember Barry Soetoro had to get rid of Gen Flynn as Flynn knew where all the bodies are buried. https://www.lifesitenews.com/news/gen-michael-flynn-suggests-members-of-congress-are-compromised-due-to-sleeping-with-children/ permalink parent award report block reply\nSpellingContable 1 points 4 days ago Well see,  they work for themselves first, and the globalists second, and then more localized organized crime third, and then they work you and Trump. permalink parent award report block reply\njml1997 1 points 4 days ago The problem is it won't be an \"if\". It's going to happen. They just did a test run of some fraud tactics this past election. This was the ramp up for the mid terms. Don't be surprised when we lose both the House and the Senate. permalink parent award report block reply yodayoda 4 points 4 days ago you must be sadly mistaken. i've been told on these forums 100 times that demonrats will never win another election again, that they have no good ideas or policies, that everyone hates them, yadda yadda. when i retorted that they've never had good ideas or policies but that never stopped them before, that they aren't going anywhere, i was called faggot for my trouble. permalink parent award report block reply\nyodayoda 4 points 4 days ago you must be sadly mistaken. i've been told on these forums 100 times that demonrats will never win another election again, that they have no good ideas or policies, that everyone hates them, yadda yadda. when i retorted that they've never had good ideas or policies but that never stopped them before, that they aren't going anywhere, i was called faggot for my trouble. permalink parent award report block reply\nKungPaoMcChicken 0 points 4 days ago Filibuster is dumb and has no right to exist. permalink parent award report block reply\nProf_Smith 3 points 4 days ago So, your plan is to trust congressional republicans.  Might as well just jump off a cliff ourselves. permalink parent award report block reply\npopcycle 1 points 4 days ago ok, suppose everything happened exactly as the Republicans would want, and Democrats were put into a situation where they can never catch up again. that's the end of the DEMS, you think.  no, it's also the end of the Republicans, because without being scared of getting voted out, they would do whatever they want, which for most of them, is nothing, or worse. permalink parent award report block reply\ntpactionchasethevote 1 points 4 days ago Would there then be enough votes to release the Epstein files? permalink parent award report block reply Hanging_Chad 9 points 4 days ago what Epstein files? permalink parent award report block reply stjimmy92 4 points 4 days ago I’m pretty sure there’s not enough votes to pass anything with Murkowski, Collins, Rand, and McConnell permalink parent award report block reply Kraken_V_Algorithm 3 points 4 days ago If the House starts sending single issue bills to the Senate there's a chance to get at least Rand and maybe McConnell on a fair number of them.  Murkowski and Collins will be exposed without the cover of multiple issues to blame their opposition on. permalink parent award report block reply view 3 more comments... keeman 2 points 4 days ago No.  The Epstein files are not at all interesting and implicate exactly zero Israeli government officials.  There is nothing to see there and if you ask about this again you will be investigated for possible terrorism. permalink parent award report block reply\nHanging_Chad 9 points 4 days ago what Epstein files? permalink parent award report block reply\nstjimmy92 4 points 4 days ago I’m pretty sure there’s not enough votes to pass anything with Murkowski, Collins, Rand, and McConnell permalink parent award report block reply Kraken_V_Algorithm 3 points 4 days ago If the House starts sending single issue bills to the Senate there's a chance to get at least Rand and maybe McConnell on a fair number of them.  Murkowski and Collins will be exposed without the cover of multiple issues to blame their opposition on. permalink parent award report block reply view 3 more comments...\nKraken_V_Algorithm 3 points 4 days ago If the House starts sending single issue bills to the Senate there's a chance to get at least Rand and maybe McConnell on a fair number of them.  Murkowski and Collins will be exposed without the cover of multiple issues to blame their opposition on. permalink parent award report block reply view 3 more comments...\nkeeman 2 points 4 days ago No.  The Epstein files are not at all interesting and implicate exactly zero Israeli government officials.  There is nothing to see there and if you ask about this again you will be investigated for possible terrorism. permalink parent award report block reply\nkeeman 1 points 4 days ago You think the RINOs are gonna do that?  Fuck me you are stupid. permalink parent award report block reply\nrebuildingMyself 23 points 4 days ago If that happens I still expect enough RINOs to betray the country and keep everything 49-51 permalink parent award report block reply Appeal2Heaven98 5 points 4 days ago This may sadly be a reality. permalink parent award report block reply tpactionchasethevote 1 points 4 days ago 👆 permalink parent award report block reply\nAppeal2Heaven98 5 points 4 days ago This may sadly be a reality. permalink parent award report block reply\ntpactionchasethevote 1 points 4 days ago 👆 permalink parent award report block reply\nAmerica_No_1 5 points 4 days ago He listed all the things we could do in a speech just yesterday.  Let's get with the program in this information war, centipede! permalink parent award report block reply Prof_Smith 1 points 4 days ago He can say all he wants.  I don’t see any bills to that end game.  Depend on congressional republicans at your own peril permalink parent award report block reply America_No_1 1 points 4 days ago Thats fair just informing permalink parent award report block reply\nProf_Smith 1 points 4 days ago He can say all he wants.  I don’t see any bills to that end game.  Depend on congressional republicans at your own peril permalink parent award report block reply America_No_1 1 points 4 days ago Thats fair just informing permalink parent award report block reply\nAmerica_No_1 1 points 4 days ago Thats fair just informing permalink parent award report block reply\nConfusedAngryArmed 5 points 4 days ago But muh minority vote! Think of how they need their SNAP gibs! permalink parent award report block reply Prof_Smith 2 points 4 days ago I don’t care if they ever open back up.  SNAP, social security, TsA, air traffic controllers, it all can go away forever for all I care. permalink parent award report block reply\nProf_Smith 2 points 4 days ago I don’t care if they ever open back up.  SNAP, social security, TsA, air traffic controllers, it all can go away forever for all I care. permalink parent award report block reply\nArmsLibertyjUStice 2 points 4 days ago The filibuster 60-vote rule is a senate rule created by the senate in 1972. It can be removed anytime by the senate. If you are suggesting that this traditional formality is somehow long-term protection against democrats, that is naive. Real protection will be when we codify election integrity into law and prevent packing of the Supreme Court by law. The filibuster is likely to prevent that from ever happening. Democrats have already tried to end the filibuster in the past although two of them were against it. Those two are retired now. permalink parent award report block reply Prof_Smith 0 points 3 days ago It also the protection against republicans. The fact that so many people here are willing to trust congressional republicans is disgusting. permalink parent award report block reply anotherthing 0 points 3 days ago The filibuster goes back to the early 1800s. It's changed several times, but it's not something new. Hell, Mr. Smith Goes to Washington was all about the filibuster and that movie was made back in 1939. Great movie from a better time. permalink parent award report block reply\nProf_Smith 0 points 3 days ago It also the protection against republicans. The fact that so many people here are willing to trust congressional republicans is disgusting. permalink parent award report block reply\nanotherthing 0 points 3 days ago The filibuster goes back to the early 1800s. It's changed several times, but it's not something new. Hell, Mr. Smith Goes to Washington was all about the filibuster and that movie was made back in 1939. Great movie from a better time. permalink parent award report block reply\ntruthtoday2022 20 points 4 days ago The truth is, the filibuster is the critical tool that GOA has used for years to DEFEAT: Mandatory gun registration Bans on common firearms Crushing restrictions on gun shows National gun confiscation laws And countless other gun-grabbing schemes If the filibuster falls, no matter who demands it, the gun control crowd in Congress will ram every radical gun control bill into law. If the filibuster is nuked, there will be nothing left to stop a flood of anti-gun legislation. permalink award report block reply ConfusedAngryArmed 10 points 4 days ago Exactly this. The only people pushing to nuke the filibuster don't understand the significance of how it's been used to help us more than hinder us. permalink parent award report block reply TheJakeFroggy 13 points 4 days ago If you paid attention to what happened during the Biden years, the Democrats tried to get rid of the filibuster, and the only reason they hadn't succeeded at it was because of Joe Manchin and Kyrsten Sinema. But those two aren't Senators anymore. All the Democrats currently in the Senate are on-board to nuke the filibuster the first chance they get. And so you know damn well they're gonna do it as soon as they get back in power. As of right now in this current term, the filibuster has prevented Trump's agenda from being enacted more than anything, and you can bet that the Democrats love it existing right now. Trump is right to want to get rid of it right now, might as well do it before the Democrats can, and then Trump can get his agenda passed, and because it includes election reform, that'll put the Democrats at a massive disadvantage and likely prevent them from ever getting back into power. Trump knows what's he doing to want to remove the filibuster. permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago Okay, then why haven't they done it? They had 8 years of Obama and 4 of Biden. It's simple, they couldn't. And had it not been for that fact, you'd be here bitching about how they took our guns away among other things. And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. permalink parent award report block reply TheJakeFroggy -1 points 4 days ago And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. You really don't get it, do you? It literally does not fucking matter. If we don't get rid of the filibuster, then the Democrats will get rid of it literally within the first hour as soon as they get back into power. It does not matter if we do it first. Although there's one difference if we were to do it first: If we did it first, it'd then be possible to ram through Trump's whole agenda, and that could stomp all over the Democrats and prevent them from ever getting back into power. I literally already said this in my previous response, but I guess you can't get it through your head. If we don't get rid of the filibuster, they'll do it as soon as they get back into power. Tell me, what do we have to lose by doing it first? Because I well and truly believe we'd have nothing to lose by doing it first. Trump has the right idea in this situation. permalink parent award report block reply view 1 more comments... keeman 1 points 4 days ago At this point they as well do it.  Trump pushing for it makes future Dems  doing the same inevitable.  Trump should have fucking shut his mouth.  But yeah, end it.  Dems will do it anyway.  And then invest in property FAR away from the USA. permalink parent award report block reply popcycle 1 points 4 days ago manchin and cinema was theater set up be the dems themselves, for their own low information voters.  they knew they'd need the fbuster later, like this year. arguing over stupid things is losing us focus permalink parent award report block reply YesImWhite 7 points 4 days ago the fillibuster is used to never get anything done permalink parent award report block reply popcycle 2 points 4 days ago good.  as far as I can see that's most of the point of our republic system. gather up the power hungry people, make them fight each other so the rest of us can live in peace, grow the food, make the steel, raise the families, br left alone. maybe well get lucky and the shutdown never ends.. permalink parent award report block reply Appeal2Heaven98 5 points 4 days ago The Democrats are going to do it anyway as soon as they get power in all three branches of government. I think Trump realizes this, so he wants the jump to push as much legislation as possible. permalink parent award report block reply TheBebop 4 points 4 days ago Pass whatever gun control law they want.... they still would have to come and take them...  End the filibuster permalink parent award report block reply Appeal2Heaven98 8 points 4 days ago If they come to your property to take them, it's already too late. permalink parent award report block reply LordKuroTheGreat 5 points 4 days ago I'd like to say bring it, but after 2020 I doubt we'd get that beautiful fierce self defense of our values that America deserves. Hell, there'd probably be people here saying to go along with it to get some piddling concession or good optics. permalink parent award report block reply anotherthing 1 points 3 days ago Remember how the right was protesting in 2020 over COVID19 mandates and the election? And how that abruptly ended with January 6th? People talk big about how they'll make a stand when the government comes to their door to take their guns. If they won't get out on a street corner and wave a cardboard sign, they'll turn those guns over first thing when there's boots on their porch and tell those government men to have a nice day as they're leaving. permalink parent award report block reply ConfusedAngryArmed 0 points 4 days ago And they will send the very police and federal law enforcement that so many people here support to come kill you, your family, and your dogs over them. permalink parent award report block reply YesImWhite 2 points 4 days ago then we die I guess. permalink parent award report block reply ConfusedAngryArmed 2 points 4 days ago If you're willing to go that far, you should be ready to form organized militias to overthrow the aforementioned tyrannical government. You won't though, and neither will myself or anybody else on this board. Why? Because everyone is too comfortable, and so long as people are comfortable nothing will change. Hell, I just got done arguing with someone else that thinks protesting still matters. No one is willing to risk their life and livelihood, and I don't blame them one bit. Why do that when others aren't willing to do the same for them? At best you'll end up with fringe resistance groups. At worst it will just be random lone wolves throwing their lives away. permalink parent award report block reply view 1 more comments... mikejones 1 points 4 days ago and blackpilled. permalink parent award report block reply Owmyballz 2 points 4 days ago The Democrats that we negotiated with for filibuster no longer exists.  As soon as the Democrat Socialist controlled Democrat party takes power, the filibuster will be removed.  They will wait UNTIL they have the Presidency and Congress to prevent Veto. Meanwhile if we stop them now with removing the filibuster we can require voter ID which will save the union and prevent the Democrats from future gains. permalink parent award report block reply popcycle 1 points 4 days ago the Democrats are about as socialist as they were in 1860 and that includes phony zohran. permalink parent award report block reply ListenJack 1 points 4 days ago Why is this so hard for people to see? Election integrity is all that matters at this point. If Trump can't codify it, then the U.S. is gone the minute Trump leaves office. permalink parent award report block reply papa_newguineapig 1 points 4 days ago You understand the moment the Democrats seize control again, the Filabuster is GONE. And we'll have our guns stripped away, and rounded up into camps, or worse. It's about time we go on the fucking Offensive, to put boot to throat permalink parent award report block reply load 4 more comments...\nConfusedAngryArmed 10 points 4 days ago Exactly this. The only people pushing to nuke the filibuster don't understand the significance of how it's been used to help us more than hinder us. permalink parent award report block reply TheJakeFroggy 13 points 4 days ago If you paid attention to what happened during the Biden years, the Democrats tried to get rid of the filibuster, and the only reason they hadn't succeeded at it was because of Joe Manchin and Kyrsten Sinema. But those two aren't Senators anymore. All the Democrats currently in the Senate are on-board to nuke the filibuster the first chance they get. And so you know damn well they're gonna do it as soon as they get back in power. As of right now in this current term, the filibuster has prevented Trump's agenda from being enacted more than anything, and you can bet that the Democrats love it existing right now. Trump is right to want to get rid of it right now, might as well do it before the Democrats can, and then Trump can get his agenda passed, and because it includes election reform, that'll put the Democrats at a massive disadvantage and likely prevent them from ever getting back into power. Trump knows what's he doing to want to remove the filibuster. permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago Okay, then why haven't they done it? They had 8 years of Obama and 4 of Biden. It's simple, they couldn't. And had it not been for that fact, you'd be here bitching about how they took our guns away among other things. And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. permalink parent award report block reply TheJakeFroggy -1 points 4 days ago And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. You really don't get it, do you? It literally does not fucking matter. If we don't get rid of the filibuster, then the Democrats will get rid of it literally within the first hour as soon as they get back into power. It does not matter if we do it first. Although there's one difference if we were to do it first: If we did it first, it'd then be possible to ram through Trump's whole agenda, and that could stomp all over the Democrats and prevent them from ever getting back into power. I literally already said this in my previous response, but I guess you can't get it through your head. If we don't get rid of the filibuster, they'll do it as soon as they get back into power. Tell me, what do we have to lose by doing it first? Because I well and truly believe we'd have nothing to lose by doing it first. Trump has the right idea in this situation. permalink parent award report block reply view 1 more comments... keeman 1 points 4 days ago At this point they as well do it.  Trump pushing for it makes future Dems  doing the same inevitable.  Trump should have fucking shut his mouth.  But yeah, end it.  Dems will do it anyway.  And then invest in property FAR away from the USA. permalink parent award report block reply popcycle 1 points 4 days ago manchin and cinema was theater set up be the dems themselves, for their own low information voters.  they knew they'd need the fbuster later, like this year. arguing over stupid things is losing us focus permalink parent award report block reply YesImWhite 7 points 4 days ago the fillibuster is used to never get anything done permalink parent award report block reply popcycle 2 points 4 days ago good.  as far as I can see that's most of the point of our republic system. gather up the power hungry people, make them fight each other so the rest of us can live in peace, grow the food, make the steel, raise the families, br left alone. maybe well get lucky and the shutdown never ends.. permalink parent award report block reply\nTheJakeFroggy 13 points 4 days ago If you paid attention to what happened during the Biden years, the Democrats tried to get rid of the filibuster, and the only reason they hadn't succeeded at it was because of Joe Manchin and Kyrsten Sinema. But those two aren't Senators anymore. All the Democrats currently in the Senate are on-board to nuke the filibuster the first chance they get. And so you know damn well they're gonna do it as soon as they get back in power. As of right now in this current term, the filibuster has prevented Trump's agenda from being enacted more than anything, and you can bet that the Democrats love it existing right now. Trump is right to want to get rid of it right now, might as well do it before the Democrats can, and then Trump can get his agenda passed, and because it includes election reform, that'll put the Democrats at a massive disadvantage and likely prevent them from ever getting back into power. Trump knows what's he doing to want to remove the filibuster. permalink parent award report block reply ConfusedAngryArmed 1 points 4 days ago Okay, then why haven't they done it? They had 8 years of Obama and 4 of Biden. It's simple, they couldn't. And had it not been for that fact, you'd be here bitching about how they took our guns away among other things. And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. permalink parent award report block reply TheJakeFroggy -1 points 4 days ago And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. You really don't get it, do you? It literally does not fucking matter. If we don't get rid of the filibuster, then the Democrats will get rid of it literally within the first hour as soon as they get back into power. It does not matter if we do it first. Although there's one difference if we were to do it first: If we did it first, it'd then be possible to ram through Trump's whole agenda, and that could stomp all over the Democrats and prevent them from ever getting back into power. I literally already said this in my previous response, but I guess you can't get it through your head. If we don't get rid of the filibuster, they'll do it as soon as they get back into power. Tell me, what do we have to lose by doing it first? Because I well and truly believe we'd have nothing to lose by doing it first. Trump has the right idea in this situation. permalink parent award report block reply view 1 more comments... keeman 1 points 4 days ago At this point they as well do it.  Trump pushing for it makes future Dems  doing the same inevitable.  Trump should have fucking shut his mouth.  But yeah, end it.  Dems will do it anyway.  And then invest in property FAR away from the USA. permalink parent award report block reply popcycle 1 points 4 days ago manchin and cinema was theater set up be the dems themselves, for their own low information voters.  they knew they'd need the fbuster later, like this year. arguing over stupid things is losing us focus permalink parent award report block reply\nConfusedAngryArmed 1 points 4 days ago Okay, then why haven't they done it? They had 8 years of Obama and 4 of Biden. It's simple, they couldn't. And had it not been for that fact, you'd be here bitching about how they took our guns away among other things. And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. permalink parent award report block reply TheJakeFroggy -1 points 4 days ago And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. You really don't get it, do you? It literally does not fucking matter. If we don't get rid of the filibuster, then the Democrats will get rid of it literally within the first hour as soon as they get back into power. It does not matter if we do it first. Although there's one difference if we were to do it first: If we did it first, it'd then be possible to ram through Trump's whole agenda, and that could stomp all over the Democrats and prevent them from ever getting back into power. I literally already said this in my previous response, but I guess you can't get it through your head. If we don't get rid of the filibuster, they'll do it as soon as they get back into power. Tell me, what do we have to lose by doing it first? Because I well and truly believe we'd have nothing to lose by doing it first. Trump has the right idea in this situation. permalink parent award report block reply view 1 more comments...\nTheJakeFroggy -1 points 4 days ago And I can guarantee that if we do get rid of it, the next time Dems are in power, you'll be bitching about how the filibuster would have stopped their radical agenda. You really don't get it, do you? It literally does not fucking matter. If we don't get rid of the filibuster, then the Democrats will get rid of it literally within the first hour as soon as they get back into power. It does not matter if we do it first. Although there's one difference if we were to do it first: If we did it first, it'd then be possible to ram through Trump's whole agenda, and that could stomp all over the Democrats and prevent them from ever getting back into power. I literally already said this in my previous response, but I guess you can't get it through your head. If we don't get rid of the filibuster, they'll do it as soon as they get back into power. Tell me, what do we have to lose by doing it first? Because I well and truly believe we'd have nothing to lose by doing it first. Trump has the right idea in this situation. permalink parent award report block reply view 1 more comments...\nkeeman 1 points 4 days ago At this point they as well do it.  Trump pushing for it makes future Dems  doing the same inevitable.  Trump should have fucking shut his mouth.  But yeah, end it.  Dems will do it anyway.  And then invest in property FAR away from the USA. permalink parent award report block reply\npopcycle 1 points 4 days ago manchin and cinema was theater set up be the dems themselves, for their own low information voters.  they knew they'd need the fbuster later, like this year. arguing over stupid things is losing us focus permalink parent award report block reply\nYesImWhite 7 points 4 days ago the fillibuster is used to never get anything done permalink parent award report block reply popcycle 2 points 4 days ago good.  as far as I can see that's most of the point of our republic system. gather up the power hungry people, make them fight each other so the rest of us can live in peace, grow the food, make the steel, raise the families, br left alone. maybe well get lucky and the shutdown never ends.. permalink parent award report block reply\npopcycle 2 points 4 days ago good.  as far as I can see that's most of the point of our republic system. gather up the power hungry people, make them fight each other so the rest of us can live in peace, grow the food, make the steel, raise the families, br left alone. maybe well get lucky and the shutdown never ends.. permalink parent award report block reply\nAppeal2Heaven98 5 points 4 days ago The Democrats are going to do it anyway as soon as they get power in all three branches of government. I think Trump realizes this, so he wants the jump to push as much legislation as possible. permalink parent award report block reply\nTheBebop 4 points 4 days ago Pass whatever gun control law they want.... they still would have to come and take them...  End the filibuster permalink parent award report block reply Appeal2Heaven98 8 points 4 days ago If they come to your property to take them, it's already too late. permalink parent award report block reply LordKuroTheGreat 5 points 4 days ago I'd like to say bring it, but after 2020 I doubt we'd get that beautiful fierce self defense of our values that America deserves. Hell, there'd probably be people here saying to go along with it to get some piddling concession or good optics. permalink parent award report block reply anotherthing 1 points 3 days ago Remember how the right was protesting in 2020 over COVID19 mandates and the election? And how that abruptly ended with January 6th? People talk big about how they'll make a stand when the government comes to their door to take their guns. If they won't get out on a street corner and wave a cardboard sign, they'll turn those guns over first thing when there's boots on their porch and tell those government men to have a nice day as they're leaving. permalink parent award report block reply ConfusedAngryArmed 0 points 4 days ago And they will send the very police and federal law enforcement that so many people here support to come kill you, your family, and your dogs over them. permalink parent award report block reply YesImWhite 2 points 4 days ago then we die I guess. permalink parent award report block reply ConfusedAngryArmed 2 points 4 days ago If you're willing to go that far, you should be ready to form organized militias to overthrow the aforementioned tyrannical government. You won't though, and neither will myself or anybody else on this board. Why? Because everyone is too comfortable, and so long as people are comfortable nothing will change. Hell, I just got done arguing with someone else that thinks protesting still matters. No one is willing to risk their life and livelihood, and I don't blame them one bit. Why do that when others aren't willing to do the same for them? At best you'll end up with fringe resistance groups. At worst it will just be random lone wolves throwing their lives away. permalink parent award report block reply view 1 more comments... mikejones 1 points 4 days ago and blackpilled. permalink parent award report block reply\nAppeal2Heaven98 8 points 4 days ago If they come to your property to take them, it's already too late. permalink parent award report block reply LordKuroTheGreat 5 points 4 days ago I'd like to say bring it, but after 2020 I doubt we'd get that beautiful fierce self defense of our values that America deserves. Hell, there'd probably be people here saying to go along with it to get some piddling concession or good optics. permalink parent award report block reply anotherthing 1 points 3 days ago Remember how the right was protesting in 2020 over COVID19 mandates and the election? And how that abruptly ended with January 6th? People talk big about how they'll make a stand when the government comes to their door to take their guns. If they won't get out on a street corner and wave a cardboard sign, they'll turn those guns over first thing when there's boots on their porch and tell those government men to have a nice day as they're leaving. permalink parent award report block reply\nLordKuroTheGreat 5 points 4 days ago I'd like to say bring it, but after 2020 I doubt we'd get that beautiful fierce self defense of our values that America deserves. Hell, there'd probably be people here saying to go along with it to get some piddling concession or good optics. permalink parent award report block reply\nanotherthing 1 points 3 days ago Remember how the right was protesting in 2020 over COVID19 mandates and the election? And how that abruptly ended with January 6th? People talk big about how they'll make a stand when the government comes to their door to take their guns. If they won't get out on a street corner and wave a cardboard sign, they'll turn those guns over first thing when there's boots on their porch and tell those government men to have a nice day as they're leaving. permalink parent award report block reply\nConfusedAngryArmed 0 points 4 days ago And they will send the very police and federal law enforcement that so many people here support to come kill you, your family, and your dogs over them. permalink parent award report block reply YesImWhite 2 points 4 days ago then we die I guess. permalink parent award report block reply ConfusedAngryArmed 2 points 4 days ago If you're willing to go that far, you should be ready to form organized militias to overthrow the aforementioned tyrannical government. You won't though, and neither will myself or anybody else on this board. Why? Because everyone is too comfortable, and so long as people are comfortable nothing will change. Hell, I just got done arguing with someone else that thinks protesting still matters. No one is willing to risk their life and livelihood, and I don't blame them one bit. Why do that when others aren't willing to do the same for them? At best you'll end up with fringe resistance groups. At worst it will just be random lone wolves throwing their lives away. permalink parent award report block reply view 1 more comments... mikejones 1 points 4 days ago and blackpilled. permalink parent award report block reply\nYesImWhite 2 points 4 days ago then we die I guess. permalink parent award report block reply ConfusedAngryArmed 2 points 4 days ago If you're willing to go that far, you should be ready to form organized militias to overthrow the aforementioned tyrannical government. You won't though, and neither will myself or anybody else on this board. Why? Because everyone is too comfortable, and so long as people are comfortable nothing will change. Hell, I just got done arguing with someone else that thinks protesting still matters. No one is willing to risk their life and livelihood, and I don't blame them one bit. Why do that when others aren't willing to do the same for them? At best you'll end up with fringe resistance groups. At worst it will just be random lone wolves throwing their lives away. permalink parent award report block reply view 1 more comments... mikejones 1 points 4 days ago and blackpilled. permalink parent award report block reply\nConfusedAngryArmed 2 points 4 days ago If you're willing to go that far, you should be ready to form organized militias to overthrow the aforementioned tyrannical government. You won't though, and neither will myself or anybody else on this board. Why? Because everyone is too comfortable, and so long as people are comfortable nothing will change. Hell, I just got done arguing with someone else that thinks protesting still matters. No one is willing to risk their life and livelihood, and I don't blame them one bit. Why do that when others aren't willing to do the same for them? At best you'll end up with fringe resistance groups. At worst it will just be random lone wolves throwing their lives away. permalink parent award report block reply view 1 more comments...\nmikejones 1 points 4 days ago and blackpilled. permalink parent award report block reply\nOwmyballz 2 points 4 days ago The Democrats that we negotiated with for filibuster no longer exists.  As soon as the Democrat Socialist controlled Democrat party takes power, the filibuster will be removed.  They will wait UNTIL they have the Presidency and Congress to prevent Veto. Meanwhile if we stop them now with removing the filibuster we can require voter ID which will save the union and prevent the Democrats from future gains. permalink parent award report block reply popcycle 1 points 4 days ago the Democrats are about as socialist as they were in 1860 and that includes phony zohran. permalink parent award report block reply ListenJack 1 points 4 days ago Why is this so hard for people to see? Election integrity is all that matters at this point. If Trump can't codify it, then the U.S. is gone the minute Trump leaves office. permalink parent award report block reply\npopcycle 1 points 4 days ago the Democrats are about as socialist as they were in 1860 and that includes phony zohran. permalink parent award report block reply\nListenJack 1 points 4 days ago Why is this so hard for people to see? Election integrity is all that matters at this point. If Trump can't codify it, then the U.S. is gone the minute Trump leaves office. permalink parent award report block reply\npapa_newguineapig 1 points 4 days ago You understand the moment the Democrats seize control again, the Filabuster is GONE. And we'll have our guns stripped away, and rounded up into camps, or worse. It's about time we go on the fucking Offensive, to put boot to throat permalink parent award report block reply\nturdinthepunch 16 points 4 days ago They're not gonna do it permalink award report block reply\nMrMcGreenGenes 4 points 4 days ago If they do, isn't it only 51 votes to reinstate it? Can Filibuster Be Reinstated The Senate filibuster can be reinstated if it is removed, as it is not mandated by the Constitution and has been modified multiple times through simple majority votes The filibuster exists as a procedural rule, and like past changes to Senate rules, its reinstatement would require another majority vote However, there is significant concern that once eliminated, neither party would have an incentive to bring it back while in power, potentially leading to permanent consequences for Senate procedure The rule has already undergone major changes, such as the elimination of the filibuster for executive and judicial nominees by both parties in 2013 and 2017, demonstrating its vulnerability to partisan shifts permalink award report block reply\nNomad899 4 points 4 days ago starwars meme…. It’s a trap permalink award report block reply truthtoday2022 5 points 4 days ago PDW would be so much better if we could post images in the comments permalink parent award report block reply EgregiousPhilbin 2 points 4 days ago lol you can't even post Twitter posts in here without half of it getting cut off. It's 2025. permalink parent award report block reply darkmodeforgotpass 1 points 4 days ago It would be no better than cancerous twitch chat and shills would invade to spam stupid jokes instead of trying to convince with words. This place isn't tranny infested /pol/, not gonna happen. permalink parent award report block reply\ntruthtoday2022 5 points 4 days ago PDW would be so much better if we could post images in the comments permalink parent award report block reply EgregiousPhilbin 2 points 4 days ago lol you can't even post Twitter posts in here without half of it getting cut off. It's 2025. permalink parent award report block reply darkmodeforgotpass 1 points 4 days ago It would be no better than cancerous twitch chat and shills would invade to spam stupid jokes instead of trying to convince with words. This place isn't tranny infested /pol/, not gonna happen. permalink parent award report block reply\nEgregiousPhilbin 2 points 4 days ago lol you can't even post Twitter posts in here without half of it getting cut off. It's 2025. permalink parent award report block reply\ndarkmodeforgotpass 1 points 4 days ago It would be no better than cancerous twitch chat and shills would invade to spam stupid jokes instead of trying to convince with words. This place isn't tranny infested /pol/, not gonna happen. permalink parent award report block reply\nCablespider 3 points 4 days ago SlipperySlope enters chat permalink award report block reply\nGreyGooseDown 3 points 4 days ago I hope he has a better argument or plan than this.  Getting rid of this will not be good for the day we don't control the Senate. permalink award report block reply\ncorntortilla 2 points 4 days ago There aren’t enough Republican votes to get rid of it and Trump knows it. permalink award report block reply\nJohnN 2 points 4 days ago Moot discussion.  There aren't enough RINOs who'd vote to nuke it. permalink award report block reply\ndude_bro 2 points 4 days ago RICO Soros! permalink award report block reply\nDualsporter 2 points 4 days ago DO IT! If we don't, they will. Do it and then run a train of bills over their heads. We are past the time to be \"polite\". Time to step up and show them that we are no longer \"amused\". permalink award report block reply\nfriedchicken 1 points 4 days ago At least the shit-for-brains bureaucracy isn't drumming up fairy tales to come up with and justify retarded laws. Bring back paint strippers that work goddammit. permalink award report block reply\nReallyGayMods 1 points 4 days ago No permalink award report block reply\nyodayoda 1 points 4 days ago filibuster the terminator! permalink award report block reply\nMichalusmichalus 1 points 4 days ago But, where else where I listen to audio cookbooks? And , the bathroom break betting. That's classic. permalink award report block reply\nthatsallphoax 1 points 4 days ago CNN: Trump threatens to assassinate Phillip Buster permalink award report block reply\nModernturnkey 1 points 4 days ago Are we cooked bros? permalink award report block reply\nMoreGuns 1 points 4 days ago Fingers crossed 🤞 permalink award report block reply\nTookens 1 points 4 days ago The filibuster was fine in it's original form.  A senator could get up at that podium and talk for days to temporarily delay a vote.  But that has little to do with the modern filibuster.  Now, the minority gets to dictate to the majority what can be voted on and what can't be voted on.  It's entirely undemocratic and it HAS to go. permalink award report block reply\nTaupkek 1 points 4 days ago We are behind you Mr. President! permalink award report block reply\nJackLemon 1 points 4 days ago NO Eliminating it would be effing insane. A potential nation ending mistake. permalink award report block reply\npatrioticwinning3 1 points 4 days ago DO IT! permalink award report block reply\nkeeman 0 points 4 days ago The reason we don't have full communism is the filibuster.  So no.  This is a BAD idea.  Next time the Ds take power they will immediately use it. permalink award report block reply\nNonbinaryPotatohead -1 points 4 days ago NO. You do and say goodbye to your guns. PERIOD. This isn't some game. These democrats and neocons are hellbent on stealing the last fumes of freedom we have left. Last time, it was the democrats that wanted to nuke the filibuster. They failed and we all breathed a sigh of relief. How is it different now? We won't be fooled into supporting bullshit like this. The MAGA base is currently losing steam due to things like the Epstein files debacle, Israel, funding Ukraine and Israel...etc etc etc. You just lost a massive portion of voters ,who flipped from democrat last election after seeing Biden/Kamala failures, due to the optics of this SNAP shit. If it continues and they don't get da gimme datz, the democrats are going to gain back a significant portion of those people and may even gain people from the republican side because they are tired of these fake neocons. We still don't know the aftermath of the ICE op and the real deportation numbers and the effects leading up to the voter base for the next election. Democrats just cleaned the Republican's clocks in the primaries and just took NYC to unprecedented levels of communism. What makes you think they can't win more seats? If MAGA is divided then kiss the next election goodbye.\nWe started out with a great speech during the inauguration about the \"Golden Age of America\", etc. But wtf is this? Is this what the donor is demanding now like the other things they were demanding? WTF is going on? permalink award report block reply"
}