{
  "id": "1ARK9hipNf",
  "url": "https://patriots.win/p/1ARK9hipNf/gm/c",
  "content": "674 GM posted 2 days ago by Trick 25 comments award share download report block\n25 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Wexit-Delecto 9 points 2 days ago IMO the Mona Lisa is a picture of Leonardo DaVinci in drag. permalink award report block reply SavingPrivateGrace 5 points 2 days ago Leonardo Da Vinci was commissioned to paint portraits, which was his craft and work.  Mona Lisa was the wife of a wealthy silk merchant, said to be around 24 years old and after the birth of her 5th child.  \"Portrait of a Man In Red Chalk\", his self portrait at 51yrs old and a \"Presumed Self Portrait\" exists when he was younger.  There are many links and YT videos to search for more. permalink parent award report block reply AliceCooperBiden 0 points 2 days ago lol if she wasn’t a real person I would agree. They look quite a lot alike. permalink parent award report block reply Kaputtmacher -2 points 2 days ago It is. He was a flaming faggot. permalink parent award report block reply Wexit-Delecto -1 points 2 days ago Yep it wasn’t “muh mysterious smile” that gave it away, “she” has a broad chest like Hulk Hogan, rest his soul. permalink parent award report block reply MehNahMehNah 9 points 2 days ago Give her a black eye and bloody lip and you have 'culturally enriched Lisa' permalink award report block reply m0ntsta 3 points 2 days ago Mudshark Lisa permalink parent award report block reply TonyIommi123 6 points 2 days ago That's walk of shame Lisa. permalink award report block reply YodaBannon 5 points 2 days ago why permalink award report block reply MythArcana 5 points 2 days ago Was she busy fighting climate change all weekend? permalink award report block reply sixfingerdildo 5 points 2 days ago how dare you! permalink parent award report block reply ThorsonTT 4 points 2 days ago Mondays. Amirite? permalink award report block reply Vice_Ser 2 points 2 days ago What is this? Facebook? permalink award report block reply ActNow 1 points 2 days ago It's good for a chuckle. Better than outrage bait that isn't MAGA content. permalink parent award report block reply GhostOfMyFormerSelf 2 points 2 days ago After the Leonardo Bounce... permalink award report block reply MAGAnic316 2 points 2 days ago I wonder if he Giselled on her Bunchens permalink parent award report block reply Brickwell 1 points 2 days ago Morning Lisa would work as well. permalink award report block reply GuerillaYourDreams 1 points 2 days ago Weird. I thought it was amusing. But now I can’t unsticky it?! permalink award report block reply ActNow 1 points 2 days ago Bedhead is undefeated. permalink parent award report block reply SavingPrivateGrace 1 points 2 days ago GM Monday! permalink award report block reply OrangeManBadasss 1 points 2 days ago Seriously? Stickied? permalink award report block reply DingleBalls -1 points 2 days ago What, upset theres no \"muh epstein\" shit stickied? permalink parent award report block reply South_Florida_Guy 1 points 2 days ago GM permalink award report block reply ncswicn 1 points 2 days ago 🤭🤭🤭 permalink award report block reply IncredibleMrE1 0 points 2 days ago Gm permalink award report block reply\nWexit-Delecto 9 points 2 days ago IMO the Mona Lisa is a picture of Leonardo DaVinci in drag. permalink award report block reply SavingPrivateGrace 5 points 2 days ago Leonardo Da Vinci was commissioned to paint portraits, which was his craft and work.  Mona Lisa was the wife of a wealthy silk merchant, said to be around 24 years old and after the birth of her 5th child.  \"Portrait of a Man In Red Chalk\", his self portrait at 51yrs old and a \"Presumed Self Portrait\" exists when he was younger.  There are many links and YT videos to search for more. permalink parent award report block reply AliceCooperBiden 0 points 2 days ago lol if she wasn’t a real person I would agree. They look quite a lot alike. permalink parent award report block reply Kaputtmacher -2 points 2 days ago It is. He was a flaming faggot. permalink parent award report block reply Wexit-Delecto -1 points 2 days ago Yep it wasn’t “muh mysterious smile” that gave it away, “she” has a broad chest like Hulk Hogan, rest his soul. permalink parent award report block reply\nSavingPrivateGrace 5 points 2 days ago Leonardo Da Vinci was commissioned to paint portraits, which was his craft and work.  Mona Lisa was the wife of a wealthy silk merchant, said to be around 24 years old and after the birth of her 5th child.  \"Portrait of a Man In Red Chalk\", his self portrait at 51yrs old and a \"Presumed Self Portrait\" exists when he was younger.  There are many links and YT videos to search for more. permalink parent award report block reply\nAliceCooperBiden 0 points 2 days ago lol if she wasn’t a real person I would agree. They look quite a lot alike. permalink parent award report block reply\nKaputtmacher -2 points 2 days ago It is. He was a flaming faggot. permalink parent award report block reply Wexit-Delecto -1 points 2 days ago Yep it wasn’t “muh mysterious smile” that gave it away, “she” has a broad chest like Hulk Hogan, rest his soul. permalink parent award report block reply\nWexit-Delecto -1 points 2 days ago Yep it wasn’t “muh mysterious smile” that gave it away, “she” has a broad chest like Hulk Hogan, rest his soul. permalink parent award report block reply\nMehNahMehNah 9 points 2 days ago Give her a black eye and bloody lip and you have 'culturally enriched Lisa' permalink award report block reply m0ntsta 3 points 2 days ago Mudshark Lisa permalink parent award report block reply\nm0ntsta 3 points 2 days ago Mudshark Lisa permalink parent award report block reply\nTonyIommi123 6 points 2 days ago That's walk of shame Lisa. permalink award report block reply\nYodaBannon 5 points 2 days ago why permalink award report block reply\nMythArcana 5 points 2 days ago Was she busy fighting climate change all weekend? permalink award report block reply sixfingerdildo 5 points 2 days ago how dare you! permalink parent award report block reply\nsixfingerdildo 5 points 2 days ago how dare you! permalink parent award report block reply\nThorsonTT 4 points 2 days ago Mondays. Amirite? permalink award report block reply\nVice_Ser 2 points 2 days ago What is this? Facebook? permalink award report block reply ActNow 1 points 2 days ago It's good for a chuckle. Better than outrage bait that isn't MAGA content. permalink parent award report block reply\nActNow 1 points 2 days ago It's good for a chuckle. Better than outrage bait that isn't MAGA content. permalink parent award report block reply\nGhostOfMyFormerSelf 2 points 2 days ago After the Leonardo Bounce... permalink award report block reply MAGAnic316 2 points 2 days ago I wonder if he Giselled on her Bunchens permalink parent award report block reply\nMAGAnic316 2 points 2 days ago I wonder if he Giselled on her Bunchens permalink parent award report block reply\nBrickwell 1 points 2 days ago Morning Lisa would work as well. permalink award report block reply\nGuerillaYourDreams 1 points 2 days ago Weird. I thought it was amusing. But now I can’t unsticky it?! permalink award report block reply ActNow 1 points 2 days ago Bedhead is undefeated. permalink parent award report block reply\nActNow 1 points 2 days ago Bedhead is undefeated. permalink parent award report block reply\nSavingPrivateGrace 1 points 2 days ago GM Monday! permalink award report block reply\nOrangeManBadasss 1 points 2 days ago Seriously? Stickied? permalink award report block reply DingleBalls -1 points 2 days ago What, upset theres no \"muh epstein\" shit stickied? permalink parent award report block reply\nDingleBalls -1 points 2 days ago What, upset theres no \"muh epstein\" shit stickied? permalink parent award report block reply\nSouth_Florida_Guy 1 points 2 days ago GM permalink award report block reply\nncswicn 1 points 2 days ago 🤭🤭🤭 permalink award report block reply\nIncredibleMrE1 0 points 2 days ago Gm permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:14.392902Z"
}