{
  "id": "1ARK9hiYjL",
  "url": "https://patriots.win/p/1ARK9hiYjL/unfreaking-believable-j6-pipe-bo/c",
  "content": "287 UNFREAKING BELIEVABLE... J6 pipe bomb footage released by the FBI was manipulated to downsample the frame rate, making it harder to analyze the suspect's walk. Why did it take Steve Baker, a citizen journolist to get to the bottom of this? Dan??? Kash??? (www.theblaze.com) 🚽   DRAIN THE SWAMP   🚽 posted 2 days ago by Pepbrandt 23 comments award share report block Former Capitol Police officer a forensic match for Jan. 6 pipe bomber, sources say | Blaze Media A computer program that compared the bomb suspect’s gait to that of Shauni Kerkhoff produced a 94% match. www.theblaze.com\n23 comments Sort by Top Top New Worst Old Save Maga305_47 6 points 2 days ago Unless they leaked the information to the journalist then they have yet again proven to be utter disappointments. permalink award report block reply AnonByTheLake 5 points 2 days ago Why did is take a journo to do this?  That's the real question. But I think we already know the answer. permalink award report block reply Magma_Biscuit 4 points 2 days ago I think the only job requirement to work for the federal government is to be incompetent. permalink award report block reply I_Love_45-70_Gov 6 points 2 days ago I think the only job requirement to work for the federal government is to be incompetent a smelly communist. FTFY, Pede. 👍 permalink parent award report block reply prayinpede 3 points 2 days ago It's not incompetence. It's intentional permalink parent award report block reply ACActual 3 points 2 days ago Standard 30 frames per second to 8 fps.  Why?  It made utilizing Biometric Gate Analysis Software impossible.   They knew exactly what they were doing permalink award report block reply Smurfection 2 points 2 days ago k, now I believe the Blaze's article.  I was on the fence about it until the part about FBI released a video that was edited to make the suspect harder to identify.  The only reason to do that is because the FBI doesn't want the suspect caught since they know the suspect is one of them but knew they had to play along with the investigation for optics.    It's like why they had an \"interview\" with Ray Epps.  They know who he is, why he was there on J6 but had to pretend they were taken accusations seriously. permalink award report block reply bananaguard62 1 points 2 days ago Hate to break it to you,  but Epps was not a Fed. There were feds, Epps wasn't one of them. The evidence against him, including the Big Bang Breach Team theory, fizzled. People think he's guilty simply because they want to at this point. permalink parent award report block reply Smurfection 1 points 2 days ago I'm pretty sure he wasn't a careerist in the FBI if that's what you're saying or any other law enforcement.  However, yes, I do think he was working with them as a CHI. permalink parent award report block reply bananaguard62 2 points 2 days ago Well, he wasn't that either. He was just a dude,  saying the same thing that was said all over this site and in DC leading up to the 6th. Protest a stolen election by storming the capital... peacefully. I was next to him on the 5th and 6th, talked with him, and after being arrested used access to discovery to investigate him, hoping to argue entrapment. It was very clear that he is just a dude. Is say to research it, because most of what I saw is public now,  but it's not really worth the effort at this point.  Just know that some random person online said they KNEW he was not a fed or informant of any kind permalink parent award report block reply Smurfection 1 points 2 days ago Link me to the website you think makes the best case for him. permalink parent award report block reply view 4 more comments... FeebleOldMan 2 points 2 days ago Dan talked of this in his podcast.  The framerate was like 3/second.  No camera made in like 100 years is that slow permalink award report block reply greatpumpkin 1 points 2 days ago Are you actually surprised? The FBI protects its own. permalink award report block reply covfefe77 1 points 2 days ago they are busy writing histrionic hallmark platitudes on the internet permalink award report block reply daty_dato 0 points 2 days ago It's like GD wack-a-mole.  Why didn't you solve this, why didn't you solve that? Jump now, this instant and take care of this. Nothing in government works on the timeline people think it should.  Dan/Kash, don't investigate it go arrest her, she obviously did it. Leap now, no need to win a court case or anything..  I get it, I want her arrested if she did it, but let's at least make sure it's accurate and that we can use her to flip on the real criminals. permalink award report block reply corporateshizer 2 points 2 days ago The Feds have had 5 years to arrest one of their own capital-city comrades. This isn't taking a long time, it's a coverup for treason spanning 3 administrations, 2 of which were under Trump. permalink parent award report block reply daty_dato 1 points 2 days ago You think the feds controlled by the DOJ was going to arrest one of their own during the 4 years under Biden? Or the Russia shit? They're all political animals at the top making the decisions. permalink parent award report block reply RINOssuck -2 points 2 days ago Maybe it's because the guy can spend all of his time working on that to have good clickbait.  Kash and Dan have other things going on. permalink award report block reply Pepbrandt OP 1 points 13 hours ago Sorry, what? permalink parent award report block reply\nMaga305_47 6 points 2 days ago Unless they leaked the information to the journalist then they have yet again proven to be utter disappointments. permalink award report block reply\nAnonByTheLake 5 points 2 days ago Why did is take a journo to do this?  That's the real question. But I think we already know the answer. permalink award report block reply\nMagma_Biscuit 4 points 2 days ago I think the only job requirement to work for the federal government is to be incompetent. permalink award report block reply I_Love_45-70_Gov 6 points 2 days ago I think the only job requirement to work for the federal government is to be incompetent a smelly communist. FTFY, Pede. 👍 permalink parent award report block reply prayinpede 3 points 2 days ago It's not incompetence. It's intentional permalink parent award report block reply\nI_Love_45-70_Gov 6 points 2 days ago I think the only job requirement to work for the federal government is to be incompetent a smelly communist. FTFY, Pede. 👍 permalink parent award report block reply\nprayinpede 3 points 2 days ago It's not incompetence. It's intentional permalink parent award report block reply\nACActual 3 points 2 days ago Standard 30 frames per second to 8 fps.  Why?  It made utilizing Biometric Gate Analysis Software impossible.   They knew exactly what they were doing permalink award report block reply\nSmurfection 2 points 2 days ago k, now I believe the Blaze's article.  I was on the fence about it until the part about FBI released a video that was edited to make the suspect harder to identify.  The only reason to do that is because the FBI doesn't want the suspect caught since they know the suspect is one of them but knew they had to play along with the investigation for optics.    It's like why they had an \"interview\" with Ray Epps.  They know who he is, why he was there on J6 but had to pretend they were taken accusations seriously. permalink award report block reply bananaguard62 1 points 2 days ago Hate to break it to you,  but Epps was not a Fed. There were feds, Epps wasn't one of them. The evidence against him, including the Big Bang Breach Team theory, fizzled. People think he's guilty simply because they want to at this point. permalink parent award report block reply Smurfection 1 points 2 days ago I'm pretty sure he wasn't a careerist in the FBI if that's what you're saying or any other law enforcement.  However, yes, I do think he was working with them as a CHI. permalink parent award report block reply bananaguard62 2 points 2 days ago Well, he wasn't that either. He was just a dude,  saying the same thing that was said all over this site and in DC leading up to the 6th. Protest a stolen election by storming the capital... peacefully. I was next to him on the 5th and 6th, talked with him, and after being arrested used access to discovery to investigate him, hoping to argue entrapment. It was very clear that he is just a dude. Is say to research it, because most of what I saw is public now,  but it's not really worth the effort at this point.  Just know that some random person online said they KNEW he was not a fed or informant of any kind permalink parent award report block reply Smurfection 1 points 2 days ago Link me to the website you think makes the best case for him. permalink parent award report block reply view 4 more comments...\nbananaguard62 1 points 2 days ago Hate to break it to you,  but Epps was not a Fed. There were feds, Epps wasn't one of them. The evidence against him, including the Big Bang Breach Team theory, fizzled. People think he's guilty simply because they want to at this point. permalink parent award report block reply Smurfection 1 points 2 days ago I'm pretty sure he wasn't a careerist in the FBI if that's what you're saying or any other law enforcement.  However, yes, I do think he was working with them as a CHI. permalink parent award report block reply bananaguard62 2 points 2 days ago Well, he wasn't that either. He was just a dude,  saying the same thing that was said all over this site and in DC leading up to the 6th. Protest a stolen election by storming the capital... peacefully. I was next to him on the 5th and 6th, talked with him, and after being arrested used access to discovery to investigate him, hoping to argue entrapment. It was very clear that he is just a dude. Is say to research it, because most of what I saw is public now,  but it's not really worth the effort at this point.  Just know that some random person online said they KNEW he was not a fed or informant of any kind permalink parent award report block reply Smurfection 1 points 2 days ago Link me to the website you think makes the best case for him. permalink parent award report block reply view 4 more comments...\nSmurfection 1 points 2 days ago I'm pretty sure he wasn't a careerist in the FBI if that's what you're saying or any other law enforcement.  However, yes, I do think he was working with them as a CHI. permalink parent award report block reply bananaguard62 2 points 2 days ago Well, he wasn't that either. He was just a dude,  saying the same thing that was said all over this site and in DC leading up to the 6th. Protest a stolen election by storming the capital... peacefully. I was next to him on the 5th and 6th, talked with him, and after being arrested used access to discovery to investigate him, hoping to argue entrapment. It was very clear that he is just a dude. Is say to research it, because most of what I saw is public now,  but it's not really worth the effort at this point.  Just know that some random person online said they KNEW he was not a fed or informant of any kind permalink parent award report block reply Smurfection 1 points 2 days ago Link me to the website you think makes the best case for him. permalink parent award report block reply view 4 more comments...\nbananaguard62 2 points 2 days ago Well, he wasn't that either. He was just a dude,  saying the same thing that was said all over this site and in DC leading up to the 6th. Protest a stolen election by storming the capital... peacefully. I was next to him on the 5th and 6th, talked with him, and after being arrested used access to discovery to investigate him, hoping to argue entrapment. It was very clear that he is just a dude. Is say to research it, because most of what I saw is public now,  but it's not really worth the effort at this point.  Just know that some random person online said they KNEW he was not a fed or informant of any kind permalink parent award report block reply Smurfection 1 points 2 days ago Link me to the website you think makes the best case for him. permalink parent award report block reply view 4 more comments...\nSmurfection 1 points 2 days ago Link me to the website you think makes the best case for him. permalink parent award report block reply view 4 more comments...\nFeebleOldMan 2 points 2 days ago Dan talked of this in his podcast.  The framerate was like 3/second.  No camera made in like 100 years is that slow permalink award report block reply\ngreatpumpkin 1 points 2 days ago Are you actually surprised? The FBI protects its own. permalink award report block reply\ncovfefe77 1 points 2 days ago they are busy writing histrionic hallmark platitudes on the internet permalink award report block reply\ndaty_dato 0 points 2 days ago It's like GD wack-a-mole.  Why didn't you solve this, why didn't you solve that? Jump now, this instant and take care of this. Nothing in government works on the timeline people think it should.  Dan/Kash, don't investigate it go arrest her, she obviously did it. Leap now, no need to win a court case or anything..  I get it, I want her arrested if she did it, but let's at least make sure it's accurate and that we can use her to flip on the real criminals. permalink award report block reply corporateshizer 2 points 2 days ago The Feds have had 5 years to arrest one of their own capital-city comrades. This isn't taking a long time, it's a coverup for treason spanning 3 administrations, 2 of which were under Trump. permalink parent award report block reply daty_dato 1 points 2 days ago You think the feds controlled by the DOJ was going to arrest one of their own during the 4 years under Biden? Or the Russia shit? They're all political animals at the top making the decisions. permalink parent award report block reply\ncorporateshizer 2 points 2 days ago The Feds have had 5 years to arrest one of their own capital-city comrades. This isn't taking a long time, it's a coverup for treason spanning 3 administrations, 2 of which were under Trump. permalink parent award report block reply daty_dato 1 points 2 days ago You think the feds controlled by the DOJ was going to arrest one of their own during the 4 years under Biden? Or the Russia shit? They're all political animals at the top making the decisions. permalink parent award report block reply\ndaty_dato 1 points 2 days ago You think the feds controlled by the DOJ was going to arrest one of their own during the 4 years under Biden? Or the Russia shit? They're all political animals at the top making the decisions. permalink parent award report block reply\nRINOssuck -2 points 2 days ago Maybe it's because the guy can spend all of his time working on that to have good clickbait.  Kash and Dan have other things going on. permalink award report block reply Pepbrandt OP 1 points 13 hours ago Sorry, what? permalink parent award report block reply\nPepbrandt OP 1 points 13 hours ago Sorry, what? permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:13:09.864776Z"
}