{
  "id": "1ARK52B9MG",
  "url": "https://patriots.win/p/1ARK52B9MG/82-of-virginia-democrat-voters-k/c",
  "content": "799 82% of Virginia Democrat voters knew about Jay Jones's texts. We are officially at war. posted 6 days ago by PatriotSam 32 comments award share report block Red Eagle Politics @RedEaglePatriot • 7d 82% of Virginians, and close to 80% of his own voters, knew about the Jay Jones texts, per the exit polling. He outperformed Kamala Harris anyways, winning \"moderates\" by 24 points and \"independents\" by 7. Against an inoffensive incumbent, no less.\n32 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno TheJakeFroggy 40 points 6 days ago I have no respect for Democrat voters at this point. Honestly I think every single Democrat voter deserves to be arrested. permalink award report block reply PatriotSam OP 28 points 6 days ago I've had to cut a lot of people out of my life ever since Charlie Kirk, I'm just not going to take it anymore. Should have done it when Trump was shot, but my patience has run out. permalink parent award report block reply 38WendysHamSquare79 19 points 6 days ago No one with an IQ under 100 should vote. Liberals are not even 70. permalink parent award report block reply 45fan 19 points 6 days ago Midwits are a real thing. IQ 75 \"Holy shit git these fucking ni**as outta here!\" IQ 100 \"Jamal just had a rough childhood we should cut him some slack.\" IQ 125 \"It is evident that those of African descent cannot exist peacefully in a developed society.\" permalink parent award report block reply TD_Covfefe_Crusader 5 points 6 days ago They want us dead and they don't even bother pretending otherwise. permalink parent award report block reply Smurfection 2 points 6 days ago I never have.  They're either stupid or evil.  No one votes democrat because they really care about anything.  They just like pretending they do. permalink parent award report block reply turdinthepunch 19 points 6 days ago Turns out, killing Republicans energizes Democrats. Wild. permalink award report block reply TD_Covfefe_Crusader 7 points 6 days ago It's essentially part of their platform now. permalink parent award report block reply rootGoose 2 points 6 days ago It emboldens them to do the same. permalink parent award report block reply Roadpower 15 points 6 days ago And considering all of the physical violence it isn't a cold war either. permalink award report block reply TD_Covfefe_Crusader 9 points 6 days ago It hasn't really heated up yet though, because only one side is doing the violence. Based on history, it will soon escalate into isolated skirmishes. permalink parent award report block reply PapaPepe 15 points 6 days ago They want us dead too permalink award report block reply _Sully_ 3 points 6 days ago But also a very low voter turn out. If you're gonna just look at percentage differences like that then you're tricking yourself. If 80% of the people voted in last year's election then only 20% voted in this one that 24 points is really 6 points and even then you have to consider percentages of party line voting as well. In reality the biggest lesson here is that republicans aren't voting and are likely disillusioned. And of course they are Democrats have the mind melting machine at 11. permalink award report block reply BusterHyman99 3 points 6 days ago I'm not sure because I remember seeing stuff that mainstream media wasn't even reporting on it. So which is it? Who knows. I think Democrats are just plain and simply evil. They want to kill you if you go against them regardless permalink award report block reply billybaldwin2 3 points 6 days ago The weekly protests were effective. Not at overthrowing Trump, but registering voters. permalink award report block reply BlackJack1776 2 points 6 days ago Maybe next time, don't run someone who shit talks Trump? GOPe doesn't run this party anymore. It's Trump's party. Past time to act like it. permalink award report block reply TheTelltaleFly 3 points 6 days ago So democrats supporting the murder of their opponents and their opponents’ children is our fault. Got it. permalink parent award report block reply Thereyago 1 points 6 days ago Did Winsome \"shit talk\" Trump? permalink parent award report block reply spinometer2 2 points 6 days ago now this is terrifying permalink award report block reply Counterwhat 2 points 6 days ago The sign should have been that they killed the debater. If you didn't understand that then, well then you will never understand. permalink award report block reply drmrboy 2 points 6 days ago It was fraud.  🤓 permalink award report block reply PatriotSam OP 9 points 6 days ago Nope, Virginia is filled with immigrants, government workers, and out of touch old rich people that vote Democrat. permalink parent award report block reply Krat 4 points 6 days ago Old people love living their boomer lives while enslaving their futjre generations for their gain. permalink parent award report block reply newestofnew 4 points 6 days ago you're a retard permalink parent award report block reply CaptainJack22 2 points 6 days ago I'm gonna use a couple of Jay's quotes.  When in an argument, I'll just say, \"I'll kill your spouse and kids\" MutherFucker!  I think that's legal in Virginia now. permalink award report block reply Tombstone2W 1 points 6 days ago The hour is late, barbarians are inside the gate and what used to by our countrymen are leading them to our homes. The only way our children survive is if neither of them share our nation. permalink award report block reply 10MeV 1 points 6 days ago They know.  They agree with him! permalink award report block reply lul_cheto 1 points 6 days ago They glorify murderers...\nThe \"were offended\" bit is just to guilt you into not standing in their way as they cut your reality into shreds. permalink award report block reply DITTOPatriot 1 points 6 days ago When your party is MIGA don't be surprised when people notice. People vote on their circumstances, Is your life better today than it was 1/2]/2025 ? permalink award report block reply ShekelJa 1 points 6 days ago Since we are all born yesterday, did you dumb fucks know that they all celebrated Kirk's assassination? permalink award report block reply\nTheJakeFroggy 40 points 6 days ago I have no respect for Democrat voters at this point. Honestly I think every single Democrat voter deserves to be arrested. permalink award report block reply PatriotSam OP 28 points 6 days ago I've had to cut a lot of people out of my life ever since Charlie Kirk, I'm just not going to take it anymore. Should have done it when Trump was shot, but my patience has run out. permalink parent award report block reply 38WendysHamSquare79 19 points 6 days ago No one with an IQ under 100 should vote. Liberals are not even 70. permalink parent award report block reply 45fan 19 points 6 days ago Midwits are a real thing. IQ 75 \"Holy shit git these fucking ni**as outta here!\" IQ 100 \"Jamal just had a rough childhood we should cut him some slack.\" IQ 125 \"It is evident that those of African descent cannot exist peacefully in a developed society.\" permalink parent award report block reply TD_Covfefe_Crusader 5 points 6 days ago They want us dead and they don't even bother pretending otherwise. permalink parent award report block reply Smurfection 2 points 6 days ago I never have.  They're either stupid or evil.  No one votes democrat because they really care about anything.  They just like pretending they do. permalink parent award report block reply\nPatriotSam OP 28 points 6 days ago I've had to cut a lot of people out of my life ever since Charlie Kirk, I'm just not going to take it anymore. Should have done it when Trump was shot, but my patience has run out. permalink parent award report block reply\n38WendysHamSquare79 19 points 6 days ago No one with an IQ under 100 should vote. Liberals are not even 70. permalink parent award report block reply 45fan 19 points 6 days ago Midwits are a real thing. IQ 75 \"Holy shit git these fucking ni**as outta here!\" IQ 100 \"Jamal just had a rough childhood we should cut him some slack.\" IQ 125 \"It is evident that those of African descent cannot exist peacefully in a developed society.\" permalink parent award report block reply\n45fan 19 points 6 days ago Midwits are a real thing. IQ 75 \"Holy shit git these fucking ni**as outta here!\" IQ 100 \"Jamal just had a rough childhood we should cut him some slack.\" IQ 125 \"It is evident that those of African descent cannot exist peacefully in a developed society.\" permalink parent award report block reply\nTD_Covfefe_Crusader 5 points 6 days ago They want us dead and they don't even bother pretending otherwise. permalink parent award report block reply\nSmurfection 2 points 6 days ago I never have.  They're either stupid or evil.  No one votes democrat because they really care about anything.  They just like pretending they do. permalink parent award report block reply\nturdinthepunch 19 points 6 days ago Turns out, killing Republicans energizes Democrats. Wild. permalink award report block reply TD_Covfefe_Crusader 7 points 6 days ago It's essentially part of their platform now. permalink parent award report block reply rootGoose 2 points 6 days ago It emboldens them to do the same. permalink parent award report block reply\nTD_Covfefe_Crusader 7 points 6 days ago It's essentially part of their platform now. permalink parent award report block reply\nrootGoose 2 points 6 days ago It emboldens them to do the same. permalink parent award report block reply\nRoadpower 15 points 6 days ago And considering all of the physical violence it isn't a cold war either. permalink award report block reply TD_Covfefe_Crusader 9 points 6 days ago It hasn't really heated up yet though, because only one side is doing the violence. Based on history, it will soon escalate into isolated skirmishes. permalink parent award report block reply\nTD_Covfefe_Crusader 9 points 6 days ago It hasn't really heated up yet though, because only one side is doing the violence. Based on history, it will soon escalate into isolated skirmishes. permalink parent award report block reply\nPapaPepe 15 points 6 days ago They want us dead too permalink award report block reply\n_Sully_ 3 points 6 days ago But also a very low voter turn out. If you're gonna just look at percentage differences like that then you're tricking yourself. If 80% of the people voted in last year's election then only 20% voted in this one that 24 points is really 6 points and even then you have to consider percentages of party line voting as well. In reality the biggest lesson here is that republicans aren't voting and are likely disillusioned. And of course they are Democrats have the mind melting machine at 11. permalink award report block reply\nBusterHyman99 3 points 6 days ago I'm not sure because I remember seeing stuff that mainstream media wasn't even reporting on it. So which is it? Who knows. I think Democrats are just plain and simply evil. They want to kill you if you go against them regardless permalink award report block reply\nbillybaldwin2 3 points 6 days ago The weekly protests were effective. Not at overthrowing Trump, but registering voters. permalink award report block reply\nBlackJack1776 2 points 6 days ago Maybe next time, don't run someone who shit talks Trump? GOPe doesn't run this party anymore. It's Trump's party. Past time to act like it. permalink award report block reply TheTelltaleFly 3 points 6 days ago So democrats supporting the murder of their opponents and their opponents’ children is our fault. Got it. permalink parent award report block reply Thereyago 1 points 6 days ago Did Winsome \"shit talk\" Trump? permalink parent award report block reply\nTheTelltaleFly 3 points 6 days ago So democrats supporting the murder of their opponents and their opponents’ children is our fault. Got it. permalink parent award report block reply\nThereyago 1 points 6 days ago Did Winsome \"shit talk\" Trump? permalink parent award report block reply\nspinometer2 2 points 6 days ago now this is terrifying permalink award report block reply\nCounterwhat 2 points 6 days ago The sign should have been that they killed the debater. If you didn't understand that then, well then you will never understand. permalink award report block reply\ndrmrboy 2 points 6 days ago It was fraud.  🤓 permalink award report block reply PatriotSam OP 9 points 6 days ago Nope, Virginia is filled with immigrants, government workers, and out of touch old rich people that vote Democrat. permalink parent award report block reply Krat 4 points 6 days ago Old people love living their boomer lives while enslaving their futjre generations for their gain. permalink parent award report block reply newestofnew 4 points 6 days ago you're a retard permalink parent award report block reply\nPatriotSam OP 9 points 6 days ago Nope, Virginia is filled with immigrants, government workers, and out of touch old rich people that vote Democrat. permalink parent award report block reply Krat 4 points 6 days ago Old people love living their boomer lives while enslaving their futjre generations for their gain. permalink parent award report block reply\nKrat 4 points 6 days ago Old people love living their boomer lives while enslaving their futjre generations for their gain. permalink parent award report block reply\nnewestofnew 4 points 6 days ago you're a retard permalink parent award report block reply\nCaptainJack22 2 points 6 days ago I'm gonna use a couple of Jay's quotes.  When in an argument, I'll just say, \"I'll kill your spouse and kids\" MutherFucker!  I think that's legal in Virginia now. permalink award report block reply\nTombstone2W 1 points 6 days ago The hour is late, barbarians are inside the gate and what used to by our countrymen are leading them to our homes. The only way our children survive is if neither of them share our nation. permalink award report block reply\n10MeV 1 points 6 days ago They know.  They agree with him! permalink award report block reply\nlul_cheto 1 points 6 days ago They glorify murderers...\nThe \"were offended\" bit is just to guilt you into not standing in their way as they cut your reality into shreds. permalink award report block reply\nDITTOPatriot 1 points 6 days ago When your party is MIGA don't be surprised when people notice. People vote on their circumstances, Is your life better today than it was 1/2]/2025 ? permalink award report block reply\nShekelJa 1 points 6 days ago Since we are all born yesterday, did you dumb fucks know that they all celebrated Kirk's assassination? permalink award report block reply",
  "fetched_at": "2025-11-12T22:59:30.836726Z"
}