{
  "id": "8185310",
  "title": "51So the propaganda masters get a new powerful tool, the commie indoctrination centers get bailed ou",
  "url": "https://patriots.win/p/1ARK9nOWnY/so-the-propaganda-masters-get-a-/c",
  "content": "51 So the propaganda masters get a new powerful tool, the commie indoctrination centers get bailed out, and we get 600k more commie Chinese spies.  What in the fuck kind of bullshit deal is this? posted 5 hours ago by MAG-n-KAG 5 comments award share report block Jeff Carlson @themarketswork • 1d This was negotiated with China as part of the TikTok sale to Larry Ellison on behalf of Israel. Disclose.tv @disclosetv • 2d NOW - Trump says 600,000 Chinese students coming to the U.S. is a pro-MAGA stance because \"you would have half the colleges in the United States go out of business... I know what MAGA wants better than anybody else.\"\n5 comments Sort by Top Top New Worst Old Save BannedAccount 7 points 4 hours ago If they go out of business because they weren't propped up then they deserve to go out of business so other better schools can rise up to take their place. Bail outs for shit that's \"too big to fail\" is just a weekend at bernies permalink award report block reply PearlyGaits57 4 points 4 hours ago Mr. President, WE DO NOT WAN'T these people here. Let these bastions of left wing/commie indoctrination centers die. Along with the entire CRAP system. Let them fall! Btw, I also know what MAGA wants, it isn't this. permalink award report block reply Iremembermypassword 3 points 4 hours ago If our enemies go bankrupt, we lose!! permalink award report block reply bratt 1 points 3 hours ago you would have half the colleges in the United States go out of business That is a good thing, let me tell you why. . . . permalink award report block reply\nBannedAccount 7 points 4 hours ago If they go out of business because they weren't propped up then they deserve to go out of business so other better schools can rise up to take their place. Bail outs for shit that's \"too big to fail\" is just a weekend at bernies permalink award report block reply\nPearlyGaits57 4 points 4 hours ago Mr. President, WE DO NOT WAN'T these people here. Let these bastions of left wing/commie indoctrination centers die. Along with the entire CRAP system. Let them fall! Btw, I also know what MAGA wants, it isn't this. permalink award report block reply\nIremembermypassword 3 points 4 hours ago If our enemies go bankrupt, we lose!! permalink award report block reply\nbratt 1 points 3 hours ago you would have half the colleges in the United States go out of business That is a good thing, let me tell you why. . . . permalink award report block reply"
}