{
  "id": "1ARK9l8I7l",
  "url": "https://patriots.win/p/1ARK9l8I7l/cant-make-this--up-ithaca-ny-hom/c",
  "content": "1008 Can't make this 💩 up! \"Ithaca, NY, home of Cornell U., does NYC one better and elects an actual Communist\" (justthenews.com) posted 1 day ago by ncswicn 57 comments award share report block Ithaca, NY, home of Cornell U., does NYC one better and elects an actual Communist Shvets has taken part in numerous anti-Israel protests since Hamas’ terrorist attack on the Jewish state on Oct. 7, 2023, according to the CPUSA paper, People’s World, which celebrated her victory. justthenews.com\n57 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Prandogolio 80 points 1 day ago Mamdani is an actual communist too. permalink award report block reply keeman 42 points 1 day ago They all are, including most republicans.  All are implementing Marx's plan for incremental communism. permalink parent award report block reply MAGAPlenty 15 points 1 day ago The voters/people give in one ridiculous change at a time until the past is forgotten permalink parent award report block reply TD_Covfefe_Crusader 7 points 1 day ago Most Democrat voters openly support socialism and communism now. permalink parent award report block reply that_sound 3 points 22 hours ago plan for incremental communism https://en.wikipedia.org/wiki/Fabian_Society Don't know what it's called over here, but people should be familiar with the enemy. permalink parent award report block reply Mortal_Wombat 2 points 14 hours ago And Shvets...has anyone seen a picture of this goblin? https://legalinsurrection.com/2025/11/self-described-communist-and-anti-israel-cornell-student-elected-to-ithaca-common-council/ permalink parent award report block reply CaptainCuomo 2 points 21 hours ago In 2021-- Zohran Mamdani addressed the Democratic Socialists of America. He clearly said-- recorded here on video-- that they should not constrain themselves to socialist policies which have \"popular support\" (such as forgiving student debt)-- things that \"people are ready for\" BUT, rather: \"When we start to accumulate power, when people such as myself are elected\" \"It's critical to remember what we are fighting for\" things that \"we firmly believe in\" \"where we do not have the same level of popular support\" such as the \"End Goal of Seizing The Means of Production.\" permalink parent award report block reply deleted 1 points 1 day ago Freefertilizer 4 points 1 day ago Communism is much worse than that. That is like saying Capitalists just worship money. permalink parent award report block reply Agenda47 1 points 1 day ago Daily reminder the neocons we call RINOs (and honestly most of the GOP) are successors to the school of Fabian Socialists who were basically Trotskyites - the incremental international communists. History is proving the Trotskyites to have been the more successful faction than the Stalinists. permalink parent award report block reply anotherthing 11 points 1 day ago So was Bill DeBlasio. Shit, Vermont keeps electing Bernie Sanders who got kicked out of a commune for being too lazy and honeymooned in the USSR during the Cold War. permalink parent award report block reply NotYourMan 5 points 1 day ago Easiest job in the country is being in the congress. permalink parent award report block reply NotYourMan 9 points 1 day ago Karen Bass (LA mayor) is an actual communist too! permalink parent award report block reply Moose_Antlers 1 points 16 hours ago True story. She actually trained under Castro. permalink parent award report block reply zerk0021 2 points 22 hours ago Berkeley elected  an actual communist mayor way back in the 1970s. His name was Gus Newport and he also called himself a Democratic Socialist. Was a mayor with a foreign policy agenda, several trips to Cuba and negotiated  Havana and Berkeley as sister cities. 'Galloping Gus'  traveled widely while in office including to the USSR and several Warsaw Pact nations. permalink parent award report block reply Iranhasnukes 33 points 1 day ago Republicans need to wake up and start marketing to the pain of under 35ers.  They are voting commies cause they can’t afford to live.  Republicans , including Trump, appear helpless to stop it.  Get better messaging.  Stop the foreign policy crap, and drive pricing downward.  50 year mortgages is not the answer, obviously. permalink award report block reply NotYourMan 10 points 1 day ago This is the reason.  GenZ and millennials are desperate and really angry.  They are willing to do crazy stuff because the system isn't working for them and they see no future.  What they don't realize is the system we have now (expensive houses, no jobs, inflation, massive split between rich and poor) all came from democrats and socialism or communism will make it so much worse. permalink parent award report block reply possibletower -2 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply Krat 3 points 1 day ago This is a very sharp insight... made me think permalink parent award report block reply possibletower -4 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply Aquamine-Amarine 1 points 1 day ago Constantly demonizing young people isn't going to help Republicans. Charlie was effective because he was close in age to them and they listened to him. Out of touch older conservatives don't get it. They're also partly to blame for their kids getting so easily brainwashed by communists in school, and they don't want to admit that or take responsibility for that. permalink parent award report block reply MySidesGoUp 1 points 23 hours ago Hey get gud, kid… That’s been the attitude which is gay and retarded.  There’s an organized effort to keep white men out of work. If Trump wasn’t cucked- he would remove the bullshit diversity tax breaks for hiring. HR depts have become cancer cells that figure out ways to hedge merit for churn. We would need to shake things up at the office too. Get back to professionalism. There’s too much quota hires and leave the fucking gym pants at home ffs…. permalink parent award report block reply possibletower -4 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply GhostOfTheRepublic 18 points 1 day ago Ma’amdani is an actual communist.  He belongs to DSA! permalink award report block reply Redatnight 16 points 1 day ago I was in Ithaca NY attending a week long class at Cornell ornithology and we watched Trump come down the escalator and announce his run. I looked at my wife and said this M’Fer is going to be our next president.\nBeing a born and raised Texan I was so excited.\nThe next day at class it seemed the liberals had already been infected with TDS, they were so angry already and it had only been about 10-12 hours. We left Ithica on Sunday and we stayed in touch with some of the ornithologists and professors for a few years as they increasingly became the mind dead zombies they are today.\nI can’t imagine a more deserving punishment for them than communism. permalink award report block reply possibletower -2 points 1 day ago Are you and your wife bird scientists? That sounds actually pretty interesting permalink parent award report block reply Redatnight 1 points 11 hours ago No we are not. The wife is a teacher and she got a scholarship for the week of classes, I paid my way. We are birding enthusiasts.\nA good way to start is to download the Merlin app by Cornell and then use it to identify birds you see about. The app can recognize birds by sound as well. permalink parent award report block reply Sea_Still 14 points 1 day ago Ithaca is a legit liberal shithole permalink award report block reply RedStoneDeepState 11 points 1 day ago Communist Control Act permalink award report block reply Aambrick 4 points 1 day ago Their rights are not acknowledge. They are property, and until they claim otherwise from Socialism and Communism they are the property of the state which means they have no right to vote as well. permalink parent award report block reply Crappydatum 9 points 1 day ago Seattle enters the chat permalink award report block reply geckogreen 5 points 1 day ago Yep. The Seattle one isn't getting enough national attention. The Democrats have loved ballot counting fraud. Now it is being used against them. permalink parent award report block reply patrioticwinning3 8 points 1 day ago Ithaca is commie central. permalink award report block reply GunsWithGooglyEyes 8 points 1 day ago Both are commies. This headline is bullshit. permalink award report block reply PeregrineFalcon 6 points 1 day ago Ithaca use to be an amazing town, but the Left took it over and made it their little oasis in otherwise Republican upstate and the University ensures it has loopy policies and supports a massive drug and homeless problem. permalink award report block reply Tookens 4 points 1 day ago You should see the socialist idiot we just elected here in Seattle. permalink award report block reply ncswicn OP 2 points 24 hours ago I bet, communists have taken over WA State! permalink parent award report block reply Vorgar 4 points 1 day ago Cornell is a hive of scum and villainy, whores too. permalink award report block reply newestofnew 3 points 1 day ago now they care because they take part in anti tribe protests, a few years ago these people would have taken part in anti white blm protests without notice or care. I guess we're supposed to believe some people are more important than others. permalink award report block reply BadManOrange 3 points 1 day ago Collages and by extension college towns are mostly infested by communism. Do we really expect much else? More reason why we should be restricting who can vote. permalink award report block reply GTHAYS 3 points 1 day ago Never thought I would see a day where I would actually cheer for Governor HOCHUL. permalink award report block reply PowerOfBlues 3 points 1 day ago Communism was invented by the European monarchs as a means of getting the have nots to hate the entrepreneurial middle class There's always been aristocrats and peasants..... There was never an entrepreneurial middle class until the industrial revolution A communist is just an agent of the ruling class doing their part to help the monarchs and aristocrats get every last scrap of economic and political power back that they lost permalink award report block reply cornpop_1988 3 points 1 day ago I'm not surprised. Ithaca is an absolute liberal shithole. permalink award report block reply onesummerdream 3 points 1 day ago \"Don't be fooled by big ol' socialist titties. They're meant to hypnotize, then enslave your ass.\" -Fake Thomas Sowell https://nypost.com/2025/11/10/us-news/communist-student-elected-to-ithaca-common-council/ permalink award report block reply Grimarr 2 points 1 day ago Deport NY permalink award report block reply ragnarokrobo 2 points 1 day ago Shvets, huh.. permalink award report block reply Sumaratran 2 points 20 hours ago STOP NOTICING!!!! permalink parent award report block reply PatrioticVideo 2 points 1 day ago If you can make it there...  you can make it anywhere!  uh.... well.  Stop singing and get back to work or punishment will begin. permalink award report block reply Formerlurker92 2 points 22 hours ago If the Republicans keep pushing absolutely braindead takes like the 50 year mortgage this will not only keep happening, it will get worse, and fast permalink award report block reply Female 2 points 1 day ago Cornell at Ickitha has the largest witchcraft Museum in the U.S.A. permalink award report block reply dtrap 2 points 1 day ago Why is the first sentence about anti-Israel protests? Why? It just doesn't stop. permalink award report block reply McFatty7 2 points 1 day ago Just like during COVID, these Blue States and Cities are going to go for that Blue State bailout when their policies inevitably fail. permalink award report block reply MySidesGoUp 2 points 1 day ago Western ny is loaded with fat assholes and commies/socialists. They love cuse, they love their high carb foods, hell they even love their elephant tranq peddling negroes. Fuck ny. All of it. permalink award report block reply Cowboy888 2 points 18 hours ago Let em starve! permalink award report block reply CanadianMeathead 2 points 1 day ago Seriously feels like cities, states etc are trying to one up each other just for the entertainment of it all. permalink award report block reply TheRedPilledArtist 2 points 1 day ago What is happening to NY? permalink award report block reply MAGAMight 2 points 23 hours ago Because all the normal New Yorkers, which most are, have things call jobs and families and bills and responsibilities and are too busy leading their lives to notice what's happening. And in case you hadn't noticed, it's occurring everywhere. permalink parent award report block reply Female 1 points 1 day ago It done been happening permalink parent award report block reply\nPrandogolio 80 points 1 day ago Mamdani is an actual communist too. permalink award report block reply keeman 42 points 1 day ago They all are, including most republicans.  All are implementing Marx's plan for incremental communism. permalink parent award report block reply MAGAPlenty 15 points 1 day ago The voters/people give in one ridiculous change at a time until the past is forgotten permalink parent award report block reply TD_Covfefe_Crusader 7 points 1 day ago Most Democrat voters openly support socialism and communism now. permalink parent award report block reply that_sound 3 points 22 hours ago plan for incremental communism https://en.wikipedia.org/wiki/Fabian_Society Don't know what it's called over here, but people should be familiar with the enemy. permalink parent award report block reply Mortal_Wombat 2 points 14 hours ago And Shvets...has anyone seen a picture of this goblin? https://legalinsurrection.com/2025/11/self-described-communist-and-anti-israel-cornell-student-elected-to-ithaca-common-council/ permalink parent award report block reply CaptainCuomo 2 points 21 hours ago In 2021-- Zohran Mamdani addressed the Democratic Socialists of America. He clearly said-- recorded here on video-- that they should not constrain themselves to socialist policies which have \"popular support\" (such as forgiving student debt)-- things that \"people are ready for\" BUT, rather: \"When we start to accumulate power, when people such as myself are elected\" \"It's critical to remember what we are fighting for\" things that \"we firmly believe in\" \"where we do not have the same level of popular support\" such as the \"End Goal of Seizing The Means of Production.\" permalink parent award report block reply deleted 1 points 1 day ago Freefertilizer 4 points 1 day ago Communism is much worse than that. That is like saying Capitalists just worship money. permalink parent award report block reply Agenda47 1 points 1 day ago Daily reminder the neocons we call RINOs (and honestly most of the GOP) are successors to the school of Fabian Socialists who were basically Trotskyites - the incremental international communists. History is proving the Trotskyites to have been the more successful faction than the Stalinists. permalink parent award report block reply anotherthing 11 points 1 day ago So was Bill DeBlasio. Shit, Vermont keeps electing Bernie Sanders who got kicked out of a commune for being too lazy and honeymooned in the USSR during the Cold War. permalink parent award report block reply NotYourMan 5 points 1 day ago Easiest job in the country is being in the congress. permalink parent award report block reply NotYourMan 9 points 1 day ago Karen Bass (LA mayor) is an actual communist too! permalink parent award report block reply Moose_Antlers 1 points 16 hours ago True story. She actually trained under Castro. permalink parent award report block reply zerk0021 2 points 22 hours ago Berkeley elected  an actual communist mayor way back in the 1970s. His name was Gus Newport and he also called himself a Democratic Socialist. Was a mayor with a foreign policy agenda, several trips to Cuba and negotiated  Havana and Berkeley as sister cities. 'Galloping Gus'  traveled widely while in office including to the USSR and several Warsaw Pact nations. permalink parent award report block reply\nkeeman 42 points 1 day ago They all are, including most republicans.  All are implementing Marx's plan for incremental communism. permalink parent award report block reply MAGAPlenty 15 points 1 day ago The voters/people give in one ridiculous change at a time until the past is forgotten permalink parent award report block reply TD_Covfefe_Crusader 7 points 1 day ago Most Democrat voters openly support socialism and communism now. permalink parent award report block reply that_sound 3 points 22 hours ago plan for incremental communism https://en.wikipedia.org/wiki/Fabian_Society Don't know what it's called over here, but people should be familiar with the enemy. permalink parent award report block reply Mortal_Wombat 2 points 14 hours ago And Shvets...has anyone seen a picture of this goblin? https://legalinsurrection.com/2025/11/self-described-communist-and-anti-israel-cornell-student-elected-to-ithaca-common-council/ permalink parent award report block reply CaptainCuomo 2 points 21 hours ago In 2021-- Zohran Mamdani addressed the Democratic Socialists of America. He clearly said-- recorded here on video-- that they should not constrain themselves to socialist policies which have \"popular support\" (such as forgiving student debt)-- things that \"people are ready for\" BUT, rather: \"When we start to accumulate power, when people such as myself are elected\" \"It's critical to remember what we are fighting for\" things that \"we firmly believe in\" \"where we do not have the same level of popular support\" such as the \"End Goal of Seizing The Means of Production.\" permalink parent award report block reply deleted 1 points 1 day ago Freefertilizer 4 points 1 day ago Communism is much worse than that. That is like saying Capitalists just worship money. permalink parent award report block reply Agenda47 1 points 1 day ago Daily reminder the neocons we call RINOs (and honestly most of the GOP) are successors to the school of Fabian Socialists who were basically Trotskyites - the incremental international communists. History is proving the Trotskyites to have been the more successful faction than the Stalinists. permalink parent award report block reply\nMAGAPlenty 15 points 1 day ago The voters/people give in one ridiculous change at a time until the past is forgotten permalink parent award report block reply TD_Covfefe_Crusader 7 points 1 day ago Most Democrat voters openly support socialism and communism now. permalink parent award report block reply\nTD_Covfefe_Crusader 7 points 1 day ago Most Democrat voters openly support socialism and communism now. permalink parent award report block reply\nthat_sound 3 points 22 hours ago plan for incremental communism https://en.wikipedia.org/wiki/Fabian_Society Don't know what it's called over here, but people should be familiar with the enemy. permalink parent award report block reply Mortal_Wombat 2 points 14 hours ago And Shvets...has anyone seen a picture of this goblin? https://legalinsurrection.com/2025/11/self-described-communist-and-anti-israel-cornell-student-elected-to-ithaca-common-council/ permalink parent award report block reply\nMortal_Wombat 2 points 14 hours ago And Shvets...has anyone seen a picture of this goblin? https://legalinsurrection.com/2025/11/self-described-communist-and-anti-israel-cornell-student-elected-to-ithaca-common-council/ permalink parent award report block reply\nCaptainCuomo 2 points 21 hours ago In 2021-- Zohran Mamdani addressed the Democratic Socialists of America. He clearly said-- recorded here on video-- that they should not constrain themselves to socialist policies which have \"popular support\" (such as forgiving student debt)-- things that \"people are ready for\" BUT, rather: \"When we start to accumulate power, when people such as myself are elected\" \"It's critical to remember what we are fighting for\" things that \"we firmly believe in\" \"where we do not have the same level of popular support\" such as the \"End Goal of Seizing The Means of Production.\" permalink parent award report block reply\ndeleted 1 points 1 day ago Freefertilizer 4 points 1 day ago Communism is much worse than that. That is like saying Capitalists just worship money. permalink parent award report block reply\nFreefertilizer 4 points 1 day ago Communism is much worse than that. That is like saying Capitalists just worship money. permalink parent award report block reply\nAgenda47 1 points 1 day ago Daily reminder the neocons we call RINOs (and honestly most of the GOP) are successors to the school of Fabian Socialists who were basically Trotskyites - the incremental international communists. History is proving the Trotskyites to have been the more successful faction than the Stalinists. permalink parent award report block reply\nanotherthing 11 points 1 day ago So was Bill DeBlasio. Shit, Vermont keeps electing Bernie Sanders who got kicked out of a commune for being too lazy and honeymooned in the USSR during the Cold War. permalink parent award report block reply NotYourMan 5 points 1 day ago Easiest job in the country is being in the congress. permalink parent award report block reply\nNotYourMan 5 points 1 day ago Easiest job in the country is being in the congress. permalink parent award report block reply\nNotYourMan 9 points 1 day ago Karen Bass (LA mayor) is an actual communist too! permalink parent award report block reply Moose_Antlers 1 points 16 hours ago True story. She actually trained under Castro. permalink parent award report block reply\nMoose_Antlers 1 points 16 hours ago True story. She actually trained under Castro. permalink parent award report block reply\nzerk0021 2 points 22 hours ago Berkeley elected  an actual communist mayor way back in the 1970s. His name was Gus Newport and he also called himself a Democratic Socialist. Was a mayor with a foreign policy agenda, several trips to Cuba and negotiated  Havana and Berkeley as sister cities. 'Galloping Gus'  traveled widely while in office including to the USSR and several Warsaw Pact nations. permalink parent award report block reply\nIranhasnukes 33 points 1 day ago Republicans need to wake up and start marketing to the pain of under 35ers.  They are voting commies cause they can’t afford to live.  Republicans , including Trump, appear helpless to stop it.  Get better messaging.  Stop the foreign policy crap, and drive pricing downward.  50 year mortgages is not the answer, obviously. permalink award report block reply NotYourMan 10 points 1 day ago This is the reason.  GenZ and millennials are desperate and really angry.  They are willing to do crazy stuff because the system isn't working for them and they see no future.  What they don't realize is the system we have now (expensive houses, no jobs, inflation, massive split between rich and poor) all came from democrats and socialism or communism will make it so much worse. permalink parent award report block reply possibletower -2 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply Krat 3 points 1 day ago This is a very sharp insight... made me think permalink parent award report block reply possibletower -4 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply Aquamine-Amarine 1 points 1 day ago Constantly demonizing young people isn't going to help Republicans. Charlie was effective because he was close in age to them and they listened to him. Out of touch older conservatives don't get it. They're also partly to blame for their kids getting so easily brainwashed by communists in school, and they don't want to admit that or take responsibility for that. permalink parent award report block reply MySidesGoUp 1 points 23 hours ago Hey get gud, kid… That’s been the attitude which is gay and retarded.  There’s an organized effort to keep white men out of work. If Trump wasn’t cucked- he would remove the bullshit diversity tax breaks for hiring. HR depts have become cancer cells that figure out ways to hedge merit for churn. We would need to shake things up at the office too. Get back to professionalism. There’s too much quota hires and leave the fucking gym pants at home ffs…. permalink parent award report block reply possibletower -4 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply\nNotYourMan 10 points 1 day ago This is the reason.  GenZ and millennials are desperate and really angry.  They are willing to do crazy stuff because the system isn't working for them and they see no future.  What they don't realize is the system we have now (expensive houses, no jobs, inflation, massive split between rich and poor) all came from democrats and socialism or communism will make it so much worse. permalink parent award report block reply possibletower -2 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply\npossibletower -2 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply\nKrat 3 points 1 day ago This is a very sharp insight... made me think permalink parent award report block reply possibletower -4 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply\npossibletower -4 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply\nAquamine-Amarine 1 points 1 day ago Constantly demonizing young people isn't going to help Republicans. Charlie was effective because he was close in age to them and they listened to him. Out of touch older conservatives don't get it. They're also partly to blame for their kids getting so easily brainwashed by communists in school, and they don't want to admit that or take responsibility for that. permalink parent award report block reply\nMySidesGoUp 1 points 23 hours ago Hey get gud, kid… That’s been the attitude which is gay and retarded.  There’s an organized effort to keep white men out of work. If Trump wasn’t cucked- he would remove the bullshit diversity tax breaks for hiring. HR depts have become cancer cells that figure out ways to hedge merit for churn. We would need to shake things up at the office too. Get back to professionalism. There’s too much quota hires and leave the fucking gym pants at home ffs…. permalink parent award report block reply\npossibletower -4 points 1 day ago Fuck Gen Z. They never supported Trump despite all the LARPing from retards here over 2024. Gen Z did not vote en masse for Trump in 2024 and they are the most commie generation of all time. You do realize that Gen Z's pleas to Trump involves socialist-style reforms like government forcing healthcare and homes to be cheaper which is PRICE CONTROLS. You do realize that, right? permalink parent award report block reply\nGhostOfTheRepublic 18 points 1 day ago Ma’amdani is an actual communist.  He belongs to DSA! permalink award report block reply\nRedatnight 16 points 1 day ago I was in Ithaca NY attending a week long class at Cornell ornithology and we watched Trump come down the escalator and announce his run. I looked at my wife and said this M’Fer is going to be our next president.\nBeing a born and raised Texan I was so excited.\nThe next day at class it seemed the liberals had already been infected with TDS, they were so angry already and it had only been about 10-12 hours. We left Ithica on Sunday and we stayed in touch with some of the ornithologists and professors for a few years as they increasingly became the mind dead zombies they are today.\nI can’t imagine a more deserving punishment for them than communism. permalink award report block reply possibletower -2 points 1 day ago Are you and your wife bird scientists? That sounds actually pretty interesting permalink parent award report block reply Redatnight 1 points 11 hours ago No we are not. The wife is a teacher and she got a scholarship for the week of classes, I paid my way. We are birding enthusiasts.\nA good way to start is to download the Merlin app by Cornell and then use it to identify birds you see about. The app can recognize birds by sound as well. permalink parent award report block reply\npossibletower -2 points 1 day ago Are you and your wife bird scientists? That sounds actually pretty interesting permalink parent award report block reply Redatnight 1 points 11 hours ago No we are not. The wife is a teacher and she got a scholarship for the week of classes, I paid my way. We are birding enthusiasts.\nA good way to start is to download the Merlin app by Cornell and then use it to identify birds you see about. The app can recognize birds by sound as well. permalink parent award report block reply\nRedatnight 1 points 11 hours ago No we are not. The wife is a teacher and she got a scholarship for the week of classes, I paid my way. We are birding enthusiasts.\nA good way to start is to download the Merlin app by Cornell and then use it to identify birds you see about. The app can recognize birds by sound as well. permalink parent award report block reply\nSea_Still 14 points 1 day ago Ithaca is a legit liberal shithole permalink award report block reply\nRedStoneDeepState 11 points 1 day ago Communist Control Act permalink award report block reply Aambrick 4 points 1 day ago Their rights are not acknowledge. They are property, and until they claim otherwise from Socialism and Communism they are the property of the state which means they have no right to vote as well. permalink parent award report block reply\nAambrick 4 points 1 day ago Their rights are not acknowledge. They are property, and until they claim otherwise from Socialism and Communism they are the property of the state which means they have no right to vote as well. permalink parent award report block reply\nCrappydatum 9 points 1 day ago Seattle enters the chat permalink award report block reply geckogreen 5 points 1 day ago Yep. The Seattle one isn't getting enough national attention. The Democrats have loved ballot counting fraud. Now it is being used against them. permalink parent award report block reply\ngeckogreen 5 points 1 day ago Yep. The Seattle one isn't getting enough national attention. The Democrats have loved ballot counting fraud. Now it is being used against them. permalink parent award report block reply\npatrioticwinning3 8 points 1 day ago Ithaca is commie central. permalink award report block reply\nGunsWithGooglyEyes 8 points 1 day ago Both are commies. This headline is bullshit. permalink award report block reply\nPeregrineFalcon 6 points 1 day ago Ithaca use to be an amazing town, but the Left took it over and made it their little oasis in otherwise Republican upstate and the University ensures it has loopy policies and supports a massive drug and homeless problem. permalink award report block reply\nTookens 4 points 1 day ago You should see the socialist idiot we just elected here in Seattle. permalink award report block reply ncswicn OP 2 points 24 hours ago I bet, communists have taken over WA State! permalink parent award report block reply\nncswicn OP 2 points 24 hours ago I bet, communists have taken over WA State! permalink parent award report block reply\nVorgar 4 points 1 day ago Cornell is a hive of scum and villainy, whores too. permalink award report block reply\nnewestofnew 3 points 1 day ago now they care because they take part in anti tribe protests, a few years ago these people would have taken part in anti white blm protests without notice or care. I guess we're supposed to believe some people are more important than others. permalink award report block reply\nBadManOrange 3 points 1 day ago Collages and by extension college towns are mostly infested by communism. Do we really expect much else? More reason why we should be restricting who can vote. permalink award report block reply\nGTHAYS 3 points 1 day ago Never thought I would see a day where I would actually cheer for Governor HOCHUL. permalink award report block reply\nPowerOfBlues 3 points 1 day ago Communism was invented by the European monarchs as a means of getting the have nots to hate the entrepreneurial middle class There's always been aristocrats and peasants..... There was never an entrepreneurial middle class until the industrial revolution A communist is just an agent of the ruling class doing their part to help the monarchs and aristocrats get every last scrap of economic and political power back that they lost permalink award report block reply\ncornpop_1988 3 points 1 day ago I'm not surprised. Ithaca is an absolute liberal shithole. permalink award report block reply\nonesummerdream 3 points 1 day ago \"Don't be fooled by big ol' socialist titties. They're meant to hypnotize, then enslave your ass.\" -Fake Thomas Sowell https://nypost.com/2025/11/10/us-news/communist-student-elected-to-ithaca-common-council/ permalink award report block reply\nGrimarr 2 points 1 day ago Deport NY permalink award report block reply\nragnarokrobo 2 points 1 day ago Shvets, huh.. permalink award report block reply Sumaratran 2 points 20 hours ago STOP NOTICING!!!! permalink parent award report block reply\nSumaratran 2 points 20 hours ago STOP NOTICING!!!! permalink parent award report block reply\nPatrioticVideo 2 points 1 day ago If you can make it there...  you can make it anywhere!  uh.... well.  Stop singing and get back to work or punishment will begin. permalink award report block reply\nFormerlurker92 2 points 22 hours ago If the Republicans keep pushing absolutely braindead takes like the 50 year mortgage this will not only keep happening, it will get worse, and fast permalink award report block reply\nFemale 2 points 1 day ago Cornell at Ickitha has the largest witchcraft Museum in the U.S.A. permalink award report block reply\ndtrap 2 points 1 day ago Why is the first sentence about anti-Israel protests? Why? It just doesn't stop. permalink award report block reply\nMcFatty7 2 points 1 day ago Just like during COVID, these Blue States and Cities are going to go for that Blue State bailout when their policies inevitably fail. permalink award report block reply\nMySidesGoUp 2 points 1 day ago Western ny is loaded with fat assholes and commies/socialists. They love cuse, they love their high carb foods, hell they even love their elephant tranq peddling negroes. Fuck ny. All of it. permalink award report block reply\nCowboy888 2 points 18 hours ago Let em starve! permalink award report block reply\nCanadianMeathead 2 points 1 day ago Seriously feels like cities, states etc are trying to one up each other just for the entertainment of it all. permalink award report block reply\nTheRedPilledArtist 2 points 1 day ago What is happening to NY? permalink award report block reply MAGAMight 2 points 23 hours ago Because all the normal New Yorkers, which most are, have things call jobs and families and bills and responsibilities and are too busy leading their lives to notice what's happening. And in case you hadn't noticed, it's occurring everywhere. permalink parent award report block reply Female 1 points 1 day ago It done been happening permalink parent award report block reply\nMAGAMight 2 points 23 hours ago Because all the normal New Yorkers, which most are, have things call jobs and families and bills and responsibilities and are too busy leading their lives to notice what's happening. And in case you hadn't noticed, it's occurring everywhere. permalink parent award report block reply\nFemale 1 points 1 day ago It done been happening permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:15:05.861433Z"
}