{
  "id": "8168935",
  "title": "1433HUGE development as Rep. Jared Golden (D-Maine 2nd) is NOT seeking reelection. Republican FLIP o",
  "url": "https://patriots.win/p/1ARK0TUsOj/huge-development-as-rep-jared-go/c",
  "content": "1433 HUGE development as Rep. Jared Golden (D-Maine 2nd) is NOT seeking reelection. Republican FLIP opportunity! He BARELY won last time. His District is R+4. posted 7 days ago by Mr_Rightside 62 comments award share download report block\n62 comments Sort by Top Top New Worst Old Save dr_gonzo 41 points 7 days ago He had zero chance of winning. I live in Maine and have family in his district. He constantly tries to make himself seem like some sort of Democrat MAGA because northern Maine is VERY red. It's hard to believe he ever won in the first place. There are MAGA signs everywhere up there. I know some people may have a hard time believing that in Maine, but the only blue area of the state is the southeastern part which has had a massive influx of leftists from NYC and Mass the last 20 years or so. That's where the state is most heavily populated, but the vast majority of the state is conservative geographically. permalink award report block reply realPhantomFuck 27 points 7 days ago That's where the state is most heavily populated, but the vast majority of the state is conservative geographically. The same can be said for pretty much every State in the Union permalink parent award report block reply imnotdeadyet 5 points 7 days ago A shitload of Masshole's have moved to Southern Maine which turned it Deep Blue.  Up north it is very conservative. permalink parent award report block reply Remember_the_Alamo 3 points 7 days ago Liberals are locusts who ruin their homes so they leave to ruin more. permalink parent award report block reply SneakyWino 1 points 7 days ago Yep, commies live in the cities and watch TV and believe it.  Patriots live in the smaller towns and rural areas and practice target shooting.  Too bad the commies in the cities outnumber the patriots. permalink parent award report block reply texas4ever 14 points 7 days ago People don't understand that country people are pretty similar everywhere. Actually went to HS in a small town in Vermont, life was all about big trucks, weekend parties, huntin' an fishin' generally anti-education. Lots of people just want to make enough money to get by they aren't strivers like in the city, it's a totally different outlook. permalink parent award report block reply JohnN 10 points 7 days ago If everything south of the Tappan Zee Bridge in NY State fell into the ocean, the remaining state would be more red than Texas. permalink parent award report block reply TidewaterYank 5 points 7 days ago Was in NYC last week...pleasantly surprised to see the Ch7 weather guy call it The Tappan Zee again...not 'The Gov Mario Cuomo...etc'. Huge scam when Andy Boy renamed it after his faddah.\nAlways The Tap! permalink parent award report block reply JohnN 2 points 7 days ago Excellent.  Yeah, I refuse. permalink parent award report block reply chathorrible 1 points 7 days ago Cough cough...Ithaca permalink parent award report block reply YT45 2 points 7 days ago As a rural (ex-) Californian, I strive to make money to buy more guns and ammo. permalink parent award report block reply prayinpede 2 points 6 days ago After getting my first one, I finally understood women and shoes. permalink parent award report block reply mastermeatlock 5 points 7 days ago I lived in Maine as a kid.  I miss the simplicity of it. permalink parent award report block reply SmellyButtFart 4 points 7 days ago The dems have the somalis in Lewiston and Auburn voting with anonymous absentee ballots permalink parent award report block reply MasterChief08 4 points 7 days ago If you are good at AI, you have a year to make targeted videos at the Democrat candidate. Remember to drop those videos in AUGUST before early voting. Also: create flyers for the Green Party and pass them out. I've done this to my local university for the last 3 elections. I'm very good at 2D design so I've been able to make them almost look professionally done. permalink parent award report block reply load 2 more comments... ColonelKlink 24 points 7 days ago They always have confidence in voter fraud that always favors  them. permalink award report block reply patrioticwinning3 15 points 7 days ago Zero riggers arrested = zero incentive not to rig. permalink parent award report block reply MAGAfarmer 19 points 7 days ago An actual conservative flip, or a Susan Collins lackie flip permalink award report block reply LookFatty 9 points 7 days ago No , former fantastic former Gov Paul LaPage is running against him. He was gonna lose anyway permalink parent award report block reply Tophat9000 13 points 7 days ago Turn out=\nWorking Republicans don't they've got better things to do Crazy cat ladys and deadbeat Democrats do.. they've got nothing better to do It's not if your troops are better in the war It's if your troops show up One crazy cat lady that shows up is worth more then a million Republicans that don't show up That's just math permalink award report block reply RedditIs4Retards 4 points 7 days ago Or... Hear me out... It's rigged permalink parent award report block reply Tophat9000 4 points 7 days ago The rig is away plan B You don't need if plan A ( no turn out) works permalink parent award report block reply RedditIs4Retards 1 points 6 days ago https://patriots.win/c/TheDonald/p/1ARK512UFv You telling me you believe this kinda shit? permalink parent award report block reply RedditIs4Retards 1 points 6 days ago No turn out is how they gaslight you. Keep believing them. permalink parent award report block reply QSWO1 1 points 7 days ago GOP intentionally sucks at marketing. permalink parent award report block reply PatriotGeneral 8 points 7 days ago Time to step up! So many doomers here being Monday morning quarterbacks. Time to knock on doors, volunteer for the campaign, become poll workers.. lots of options permalink award report block reply JoeMcCarthyWasRight -4 points 7 days ago Gotta come up with a name for you dreamers who think everything’s going great here in pretend MAGA land. permalink parent award report block reply M4ster_Yoda 2 points 7 days ago What in the fuck is your problem pal? Please elaborate permalink parent award report block reply PatriotGeneral 1 points 7 days ago Ah fuck you’re right. Time to pack it in, go home and get out the prayer mat. permalink parent award report block reply KernalMustard 0 points 7 days ago Cultists. permalink parent award report block reply cyberwar 7 points 7 days ago look at the Virginia state races, there where R+20 seats that got wiped out. this R+4 means nothing permalink award report block reply RighterThanU 7 points 7 days ago One nobody congressman that Republicans couldn't beat last year retiring is a HUGE Development? permalink award report block reply starjello 2 points 7 days ago The turd polishers around here love their work. Sadly it does not pay well. permalink parent award report block reply Puncake150 7 points 7 days ago Bold of you to assume Republicans want to actually win permalink award report block reply patrioticwinning3 5 points 7 days ago Zero riggers arrested = zero incentive not to rig. permalink award report block reply GayPatriotMAGAUncle 5 points 7 days ago Wake up call for doomers! Yes, Dems won yesterday but technically they didn't. Why? Because all the leftists won in areas leftists were expected to win. We had no actual MAGA candidate in any of these areas. Next year is time to step up our A-game and go out and vote in midterms. For MAGA, for Trump, we will make sure there is no blue wave and maintain the house and senate majority by the end of Trump's term in 2028. permalink award report block reply fac1 5 points 7 days ago Except Virginia.  Republicans won the previous statewide election.  But this time, the leftist governor candidate won by FIFTEEN POINTS!  That's 13 points more than the Republican governor won by, 4 years ago!  What happened? permalink parent award report block reply PatriotGeneral 2 points 7 days ago Republicans just didn’t vote, bitter pill to swallow. We gave it away permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply SowellWasRight 0 points 7 days ago Epstein catastrophe, and MIGA bombing of Iran happened. Neocons are co-opting the movement, so the right-leaning independents and working class MAGA stayed home. permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time... permalink parent award report block reply caKAG -1 points 7 days ago The candidate for the Republicans (Winsome Earle-Sears) was not a good candidate. She was saying back in 2022 she would not support Trump, and nominating her did not do us favors. permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply Crapachino 0 points 7 days ago I didn't have Muslim winning NYC on my bingo permalink parent award report block reply UpdootVeteran 4 points 7 days ago Maine GOP will find a way to fuck this up permalink award report block reply BusterHyman99 4 points 7 days ago Republican flip my ass. More like an islamist flip permalink award report block reply Pats5x 4 points 7 days ago This fucking clown Eric Daugherty is the worst shill of all time.  Fuck him.  He posts nothing but hopium...get him gone along w gunther eagleman permalink award report block reply Bisque 3 points 7 days ago the left will still win permalink award report block reply GayPatriotMAGAUncle 7 points 7 days ago Doomer faggot GTFO! permalink parent award report block reply PatriotGeneral 4 points 7 days ago Low energy! Sounds like you’ll let them permalink parent award report block reply Mr_Rightside OP 3 points 7 days ago https://x.com/EricLDaugh/status/1986164799961498080 https://x.com/golden4congress/status/1986163261696278844 permalink award report block reply mailinvoter 3 points 7 days ago Shit isn't going to get fixed until election theft is dealt with and more pedes get involved in them. permalink award report block reply TurdSammich 2 points 7 days ago Did he not get the memo?  We couldnt even pass voter ID and just voted for red flag laws..     Maine is done. permalink award report block reply MasterChief08 2 points 7 days ago We need to FORTIFY just like Democrats. Obviously don't openly admit on this site what you're going to do but please everyone here needs to look into being an election official permalink award report block reply Pats5x 2 points 7 days ago Lol.  GOP won't flip shit. permalink award report block reply CaliAli 1 points 7 days ago But our Reps must DO SOMETHING to energize our base. permalink award report block reply Ligersrule1 1 points 6 days ago Maine uses ranked choice voting.  This seat ain't flipping red. permalink award report block reply jonnyuno 1 points 7 days ago Prob made his 10M and getting out before Trump investigates corruption. permalink award report block reply Sparks1017 1 points 7 days ago Decades in public service? How old is this picture of him? been in Congress since 2019 WTAF? permalink award report block reply josiborg 1 points 7 days ago And the rigging. Don't forget the rigging. permalink award report block reply MemoryHoleyeO 1 points 7 days ago GOP needs to put ground work in permalink award report block reply psyflux 1 points 6 days ago \"I was told there would be stock tips\" permalink award report block reply SaxonRealm 0 points 7 days ago Sweet! Can’t wait to meet the new Republican cuck. Will they be like Rand, Massie, Collins, Murkowski, Thune or Lindsay? Or a new breed? permalink award report block reply\ndr_gonzo 41 points 7 days ago He had zero chance of winning. I live in Maine and have family in his district. He constantly tries to make himself seem like some sort of Democrat MAGA because northern Maine is VERY red. It's hard to believe he ever won in the first place. There are MAGA signs everywhere up there. I know some people may have a hard time believing that in Maine, but the only blue area of the state is the southeastern part which has had a massive influx of leftists from NYC and Mass the last 20 years or so. That's where the state is most heavily populated, but the vast majority of the state is conservative geographically. permalink award report block reply realPhantomFuck 27 points 7 days ago That's where the state is most heavily populated, but the vast majority of the state is conservative geographically. The same can be said for pretty much every State in the Union permalink parent award report block reply imnotdeadyet 5 points 7 days ago A shitload of Masshole's have moved to Southern Maine which turned it Deep Blue.  Up north it is very conservative. permalink parent award report block reply Remember_the_Alamo 3 points 7 days ago Liberals are locusts who ruin their homes so they leave to ruin more. permalink parent award report block reply SneakyWino 1 points 7 days ago Yep, commies live in the cities and watch TV and believe it.  Patriots live in the smaller towns and rural areas and practice target shooting.  Too bad the commies in the cities outnumber the patriots. permalink parent award report block reply texas4ever 14 points 7 days ago People don't understand that country people are pretty similar everywhere. Actually went to HS in a small town in Vermont, life was all about big trucks, weekend parties, huntin' an fishin' generally anti-education. Lots of people just want to make enough money to get by they aren't strivers like in the city, it's a totally different outlook. permalink parent award report block reply JohnN 10 points 7 days ago If everything south of the Tappan Zee Bridge in NY State fell into the ocean, the remaining state would be more red than Texas. permalink parent award report block reply TidewaterYank 5 points 7 days ago Was in NYC last week...pleasantly surprised to see the Ch7 weather guy call it The Tappan Zee again...not 'The Gov Mario Cuomo...etc'. Huge scam when Andy Boy renamed it after his faddah.\nAlways The Tap! permalink parent award report block reply JohnN 2 points 7 days ago Excellent.  Yeah, I refuse. permalink parent award report block reply chathorrible 1 points 7 days ago Cough cough...Ithaca permalink parent award report block reply YT45 2 points 7 days ago As a rural (ex-) Californian, I strive to make money to buy more guns and ammo. permalink parent award report block reply prayinpede 2 points 6 days ago After getting my first one, I finally understood women and shoes. permalink parent award report block reply mastermeatlock 5 points 7 days ago I lived in Maine as a kid.  I miss the simplicity of it. permalink parent award report block reply SmellyButtFart 4 points 7 days ago The dems have the somalis in Lewiston and Auburn voting with anonymous absentee ballots permalink parent award report block reply MasterChief08 4 points 7 days ago If you are good at AI, you have a year to make targeted videos at the Democrat candidate. Remember to drop those videos in AUGUST before early voting. Also: create flyers for the Green Party and pass them out. I've done this to my local university for the last 3 elections. I'm very good at 2D design so I've been able to make them almost look professionally done. permalink parent award report block reply load 2 more comments...\nrealPhantomFuck 27 points 7 days ago That's where the state is most heavily populated, but the vast majority of the state is conservative geographically. The same can be said for pretty much every State in the Union permalink parent award report block reply imnotdeadyet 5 points 7 days ago A shitload of Masshole's have moved to Southern Maine which turned it Deep Blue.  Up north it is very conservative. permalink parent award report block reply Remember_the_Alamo 3 points 7 days ago Liberals are locusts who ruin their homes so they leave to ruin more. permalink parent award report block reply SneakyWino 1 points 7 days ago Yep, commies live in the cities and watch TV and believe it.  Patriots live in the smaller towns and rural areas and practice target shooting.  Too bad the commies in the cities outnumber the patriots. permalink parent award report block reply\nimnotdeadyet 5 points 7 days ago A shitload of Masshole's have moved to Southern Maine which turned it Deep Blue.  Up north it is very conservative. permalink parent award report block reply\nRemember_the_Alamo 3 points 7 days ago Liberals are locusts who ruin their homes so they leave to ruin more. permalink parent award report block reply\nSneakyWino 1 points 7 days ago Yep, commies live in the cities and watch TV and believe it.  Patriots live in the smaller towns and rural areas and practice target shooting.  Too bad the commies in the cities outnumber the patriots. permalink parent award report block reply\ntexas4ever 14 points 7 days ago People don't understand that country people are pretty similar everywhere. Actually went to HS in a small town in Vermont, life was all about big trucks, weekend parties, huntin' an fishin' generally anti-education. Lots of people just want to make enough money to get by they aren't strivers like in the city, it's a totally different outlook. permalink parent award report block reply JohnN 10 points 7 days ago If everything south of the Tappan Zee Bridge in NY State fell into the ocean, the remaining state would be more red than Texas. permalink parent award report block reply TidewaterYank 5 points 7 days ago Was in NYC last week...pleasantly surprised to see the Ch7 weather guy call it The Tappan Zee again...not 'The Gov Mario Cuomo...etc'. Huge scam when Andy Boy renamed it after his faddah.\nAlways The Tap! permalink parent award report block reply JohnN 2 points 7 days ago Excellent.  Yeah, I refuse. permalink parent award report block reply chathorrible 1 points 7 days ago Cough cough...Ithaca permalink parent award report block reply YT45 2 points 7 days ago As a rural (ex-) Californian, I strive to make money to buy more guns and ammo. permalink parent award report block reply prayinpede 2 points 6 days ago After getting my first one, I finally understood women and shoes. permalink parent award report block reply\nJohnN 10 points 7 days ago If everything south of the Tappan Zee Bridge in NY State fell into the ocean, the remaining state would be more red than Texas. permalink parent award report block reply TidewaterYank 5 points 7 days ago Was in NYC last week...pleasantly surprised to see the Ch7 weather guy call it The Tappan Zee again...not 'The Gov Mario Cuomo...etc'. Huge scam when Andy Boy renamed it after his faddah.\nAlways The Tap! permalink parent award report block reply JohnN 2 points 7 days ago Excellent.  Yeah, I refuse. permalink parent award report block reply chathorrible 1 points 7 days ago Cough cough...Ithaca permalink parent award report block reply\nTidewaterYank 5 points 7 days ago Was in NYC last week...pleasantly surprised to see the Ch7 weather guy call it The Tappan Zee again...not 'The Gov Mario Cuomo...etc'. Huge scam when Andy Boy renamed it after his faddah.\nAlways The Tap! permalink parent award report block reply JohnN 2 points 7 days ago Excellent.  Yeah, I refuse. permalink parent award report block reply\nJohnN 2 points 7 days ago Excellent.  Yeah, I refuse. permalink parent award report block reply\nchathorrible 1 points 7 days ago Cough cough...Ithaca permalink parent award report block reply\nYT45 2 points 7 days ago As a rural (ex-) Californian, I strive to make money to buy more guns and ammo. permalink parent award report block reply prayinpede 2 points 6 days ago After getting my first one, I finally understood women and shoes. permalink parent award report block reply\nprayinpede 2 points 6 days ago After getting my first one, I finally understood women and shoes. permalink parent award report block reply\nmastermeatlock 5 points 7 days ago I lived in Maine as a kid.  I miss the simplicity of it. permalink parent award report block reply\nSmellyButtFart 4 points 7 days ago The dems have the somalis in Lewiston and Auburn voting with anonymous absentee ballots permalink parent award report block reply\nMasterChief08 4 points 7 days ago If you are good at AI, you have a year to make targeted videos at the Democrat candidate. Remember to drop those videos in AUGUST before early voting. Also: create flyers for the Green Party and pass them out. I've done this to my local university for the last 3 elections. I'm very good at 2D design so I've been able to make them almost look professionally done. permalink parent award report block reply\nColonelKlink 24 points 7 days ago They always have confidence in voter fraud that always favors  them. permalink award report block reply patrioticwinning3 15 points 7 days ago Zero riggers arrested = zero incentive not to rig. permalink parent award report block reply\npatrioticwinning3 15 points 7 days ago Zero riggers arrested = zero incentive not to rig. permalink parent award report block reply\nMAGAfarmer 19 points 7 days ago An actual conservative flip, or a Susan Collins lackie flip permalink award report block reply LookFatty 9 points 7 days ago No , former fantastic former Gov Paul LaPage is running against him. He was gonna lose anyway permalink parent award report block reply\nLookFatty 9 points 7 days ago No , former fantastic former Gov Paul LaPage is running against him. He was gonna lose anyway permalink parent award report block reply\nTophat9000 13 points 7 days ago Turn out=\nWorking Republicans don't they've got better things to do Crazy cat ladys and deadbeat Democrats do.. they've got nothing better to do It's not if your troops are better in the war It's if your troops show up One crazy cat lady that shows up is worth more then a million Republicans that don't show up That's just math permalink award report block reply RedditIs4Retards 4 points 7 days ago Or... Hear me out... It's rigged permalink parent award report block reply Tophat9000 4 points 7 days ago The rig is away plan B You don't need if plan A ( no turn out) works permalink parent award report block reply RedditIs4Retards 1 points 6 days ago https://patriots.win/c/TheDonald/p/1ARK512UFv You telling me you believe this kinda shit? permalink parent award report block reply RedditIs4Retards 1 points 6 days ago No turn out is how they gaslight you. Keep believing them. permalink parent award report block reply QSWO1 1 points 7 days ago GOP intentionally sucks at marketing. permalink parent award report block reply\nRedditIs4Retards 4 points 7 days ago Or... Hear me out... It's rigged permalink parent award report block reply Tophat9000 4 points 7 days ago The rig is away plan B You don't need if plan A ( no turn out) works permalink parent award report block reply RedditIs4Retards 1 points 6 days ago https://patriots.win/c/TheDonald/p/1ARK512UFv You telling me you believe this kinda shit? permalink parent award report block reply RedditIs4Retards 1 points 6 days ago No turn out is how they gaslight you. Keep believing them. permalink parent award report block reply\nTophat9000 4 points 7 days ago The rig is away plan B You don't need if plan A ( no turn out) works permalink parent award report block reply RedditIs4Retards 1 points 6 days ago https://patriots.win/c/TheDonald/p/1ARK512UFv You telling me you believe this kinda shit? permalink parent award report block reply RedditIs4Retards 1 points 6 days ago No turn out is how they gaslight you. Keep believing them. permalink parent award report block reply\nRedditIs4Retards 1 points 6 days ago https://patriots.win/c/TheDonald/p/1ARK512UFv You telling me you believe this kinda shit? permalink parent award report block reply\nRedditIs4Retards 1 points 6 days ago No turn out is how they gaslight you. Keep believing them. permalink parent award report block reply\nQSWO1 1 points 7 days ago GOP intentionally sucks at marketing. permalink parent award report block reply\nPatriotGeneral 8 points 7 days ago Time to step up! So many doomers here being Monday morning quarterbacks. Time to knock on doors, volunteer for the campaign, become poll workers.. lots of options permalink award report block reply JoeMcCarthyWasRight -4 points 7 days ago Gotta come up with a name for you dreamers who think everything’s going great here in pretend MAGA land. permalink parent award report block reply M4ster_Yoda 2 points 7 days ago What in the fuck is your problem pal? Please elaborate permalink parent award report block reply PatriotGeneral 1 points 7 days ago Ah fuck you’re right. Time to pack it in, go home and get out the prayer mat. permalink parent award report block reply KernalMustard 0 points 7 days ago Cultists. permalink parent award report block reply\nJoeMcCarthyWasRight -4 points 7 days ago Gotta come up with a name for you dreamers who think everything’s going great here in pretend MAGA land. permalink parent award report block reply M4ster_Yoda 2 points 7 days ago What in the fuck is your problem pal? Please elaborate permalink parent award report block reply PatriotGeneral 1 points 7 days ago Ah fuck you’re right. Time to pack it in, go home and get out the prayer mat. permalink parent award report block reply KernalMustard 0 points 7 days ago Cultists. permalink parent award report block reply\nM4ster_Yoda 2 points 7 days ago What in the fuck is your problem pal? Please elaborate permalink parent award report block reply\nPatriotGeneral 1 points 7 days ago Ah fuck you’re right. Time to pack it in, go home and get out the prayer mat. permalink parent award report block reply\nKernalMustard 0 points 7 days ago Cultists. permalink parent award report block reply\ncyberwar 7 points 7 days ago look at the Virginia state races, there where R+20 seats that got wiped out. this R+4 means nothing permalink award report block reply\nRighterThanU 7 points 7 days ago One nobody congressman that Republicans couldn't beat last year retiring is a HUGE Development? permalink award report block reply starjello 2 points 7 days ago The turd polishers around here love their work. Sadly it does not pay well. permalink parent award report block reply\nstarjello 2 points 7 days ago The turd polishers around here love their work. Sadly it does not pay well. permalink parent award report block reply\nPuncake150 7 points 7 days ago Bold of you to assume Republicans want to actually win permalink award report block reply\npatrioticwinning3 5 points 7 days ago Zero riggers arrested = zero incentive not to rig. permalink award report block reply\nGayPatriotMAGAUncle 5 points 7 days ago Wake up call for doomers! Yes, Dems won yesterday but technically they didn't. Why? Because all the leftists won in areas leftists were expected to win. We had no actual MAGA candidate in any of these areas. Next year is time to step up our A-game and go out and vote in midterms. For MAGA, for Trump, we will make sure there is no blue wave and maintain the house and senate majority by the end of Trump's term in 2028. permalink award report block reply fac1 5 points 7 days ago Except Virginia.  Republicans won the previous statewide election.  But this time, the leftist governor candidate won by FIFTEEN POINTS!  That's 13 points more than the Republican governor won by, 4 years ago!  What happened? permalink parent award report block reply PatriotGeneral 2 points 7 days ago Republicans just didn’t vote, bitter pill to swallow. We gave it away permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply SowellWasRight 0 points 7 days ago Epstein catastrophe, and MIGA bombing of Iran happened. Neocons are co-opting the movement, so the right-leaning independents and working class MAGA stayed home. permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time... permalink parent award report block reply caKAG -1 points 7 days ago The candidate for the Republicans (Winsome Earle-Sears) was not a good candidate. She was saying back in 2022 she would not support Trump, and nominating her did not do us favors. permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply Crapachino 0 points 7 days ago I didn't have Muslim winning NYC on my bingo permalink parent award report block reply\nfac1 5 points 7 days ago Except Virginia.  Republicans won the previous statewide election.  But this time, the leftist governor candidate won by FIFTEEN POINTS!  That's 13 points more than the Republican governor won by, 4 years ago!  What happened? permalink parent award report block reply PatriotGeneral 2 points 7 days ago Republicans just didn’t vote, bitter pill to swallow. We gave it away permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply SowellWasRight 0 points 7 days ago Epstein catastrophe, and MIGA bombing of Iran happened. Neocons are co-opting the movement, so the right-leaning independents and working class MAGA stayed home. permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time... permalink parent award report block reply caKAG -1 points 7 days ago The candidate for the Republicans (Winsome Earle-Sears) was not a good candidate. She was saying back in 2022 she would not support Trump, and nominating her did not do us favors. permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply\nPatriotGeneral 2 points 7 days ago Republicans just didn’t vote, bitter pill to swallow. We gave it away permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply\nfac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply\nSowellWasRight 0 points 7 days ago Epstein catastrophe, and MIGA bombing of Iran happened. Neocons are co-opting the movement, so the right-leaning independents and working class MAGA stayed home. permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time... permalink parent award report block reply\nfac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time... permalink parent award report block reply\ncaKAG -1 points 7 days ago The candidate for the Republicans (Winsome Earle-Sears) was not a good candidate. She was saying back in 2022 she would not support Trump, and nominating her did not do us favors. permalink parent award report block reply fac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply\nfac1 0 points 7 days ago Any conservative or moderate who didn't vote against permanent takeover of VA by the left (through fraud and other tactics enabled by power), just because the opponent \"wasn't MAGA enough\", is a complete moron. I think VA is gone forever this time. permalink parent award report block reply\nCrapachino 0 points 7 days ago I didn't have Muslim winning NYC on my bingo permalink parent award report block reply\nUpdootVeteran 4 points 7 days ago Maine GOP will find a way to fuck this up permalink award report block reply\nBusterHyman99 4 points 7 days ago Republican flip my ass. More like an islamist flip permalink award report block reply\nPats5x 4 points 7 days ago This fucking clown Eric Daugherty is the worst shill of all time.  Fuck him.  He posts nothing but hopium...get him gone along w gunther eagleman permalink award report block reply\nBisque 3 points 7 days ago the left will still win permalink award report block reply GayPatriotMAGAUncle 7 points 7 days ago Doomer faggot GTFO! permalink parent award report block reply PatriotGeneral 4 points 7 days ago Low energy! Sounds like you’ll let them permalink parent award report block reply\nGayPatriotMAGAUncle 7 points 7 days ago Doomer faggot GTFO! permalink parent award report block reply\nPatriotGeneral 4 points 7 days ago Low energy! Sounds like you’ll let them permalink parent award report block reply\nMr_Rightside OP 3 points 7 days ago https://x.com/EricLDaugh/status/1986164799961498080 https://x.com/golden4congress/status/1986163261696278844 permalink award report block reply\nmailinvoter 3 points 7 days ago Shit isn't going to get fixed until election theft is dealt with and more pedes get involved in them. permalink award report block reply\nTurdSammich 2 points 7 days ago Did he not get the memo?  We couldnt even pass voter ID and just voted for red flag laws..     Maine is done. permalink award report block reply\nMasterChief08 2 points 7 days ago We need to FORTIFY just like Democrats. Obviously don't openly admit on this site what you're going to do but please everyone here needs to look into being an election official permalink award report block reply\nPats5x 2 points 7 days ago Lol.  GOP won't flip shit. permalink award report block reply\nCaliAli 1 points 7 days ago But our Reps must DO SOMETHING to energize our base. permalink award report block reply\nLigersrule1 1 points 6 days ago Maine uses ranked choice voting.  This seat ain't flipping red. permalink award report block reply\njonnyuno 1 points 7 days ago Prob made his 10M and getting out before Trump investigates corruption. permalink award report block reply\nSparks1017 1 points 7 days ago Decades in public service? How old is this picture of him? been in Congress since 2019 WTAF? permalink award report block reply\njosiborg 1 points 7 days ago And the rigging. Don't forget the rigging. permalink award report block reply\nMemoryHoleyeO 1 points 7 days ago GOP needs to put ground work in permalink award report block reply\npsyflux 1 points 6 days ago \"I was told there would be stock tips\" permalink award report block reply\nSaxonRealm 0 points 7 days ago Sweet! Can’t wait to meet the new Republican cuck. Will they be like Rand, Massie, Collins, Murkowski, Thune or Lindsay? Or a new breed? permalink award report block reply",
  "fetched_at": "2025-11-12T20:05:20.736012Z"
}