{
  "id": "8182861",
  "title": "1547Haha they're big mad 😆😂posted1 day agobyBusiness-Socks62 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK9k0iob/haha-theyre-big-mad-/c",
  "content": "1547 Haha they're big mad 😆😂 posted 1 day ago by Business-Socks 62 comments award share download report block\n62 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget SHILL_DETECTOR 73 points 1 day ago i like how their little brainwashed followers can have their beliefs flipped 180 degrees in literal hours permalink award report block reply newestofnew 43 points 1 day ago as others have pointed out previously they don't believe in anything but power permalink parent award report block reply TrumpsBigBalls 15 points 1 day ago Not to be \"that guy' especially since these memes are funny as hell, but they don't really convey what happened... The actual reasoning is left out... as in \"The govt should be shutdown until you give illegals healthcare!\" and \"Damnit you opened the gov't without providing illegals healthcare\"... It wasn't REALLY about the govt being open or shutdown and we all do know that. Only reason I bring this up is these memes kind of make us look a little dumb since they don't represent the actual truth when it would be so easy to tweak them a bit to reflect them upset about illegals not getting healthcare. permalink parent award report block reply SicSemperTyrannis2 4 points 1 day ago Can you explain to me how it is in any way a win to restore the government to Biden spending levels? I mean ok pay our troops and air traffic controllers, yes that's important. But how many swamp critters were fired because the government was shutdown long enough to fire at will? permalink parent award report block reply Morokei 3 points 1 day ago Answer:  None permalink parent award report block reply view 2 more comments... STONKATRUCK 2 points 23 hours ago All gov workers will get back pay so none permalink parent award report block reply deaditecoffee 1 points 1 day ago When dealing with Dems and in generally, revolution types, there is always a spread of reasons, and real and fake sympathy, which is the reason this meme feels right. There is a serious sincerity issue, and it's not even a veil slip nowadays, the crazy reps and pundits are saying counter narratives and \"the quiet part out loud\" pretty regularly on all manner of topics. The mockery of the left's inconsistency is funny but doesn't move the needle at all. permalink parent award report block reply SicSemperTyrannis2 1 points 1 day ago Straight out of 1984. permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply mohel 0 points 1 day ago watch and learn permalink parent award report block reply Dev404 11 points 1 day ago They're demoralized into killing babies, mutilating their genitals, and actively supporting foreigners invading our country. These people have been fully indoctrinated by feminists and would try to stop breathing if you reminded them that Trump breathes the same air they do. permalink parent award report block reply rebuildingMyself 6 points 1 day ago Their opinions are assigned to them by their preferred media sources. They have no real thoughts of their own and I bet most don't even have internal monologues permalink parent award report block reply TrumpAndGodWin 2 points 17 hours ago \"Most people are other people. Their thoughts are someone else's opinions, their lives a mimicry, their passions a quotation.\" Oscar Wilde permalink parent award report block reply RizzlieDoodad 4 points 1 day ago Hello pot. Meet kettle. You're cheering for the Senate passing the Biden Budget. The Dems wanted more than Biden level spending. And the Republicans said no we'll keep it the same. Lol, lmao even. Cope harder. This isn't a win permalink parent award report block reply SHILL_DETECTOR 3 points 1 day ago ive ignored the whole thing not suprised that we cant have any cuts to spending, ever. permalink parent award report block reply Klaus73 1 points 1 day ago Essentially - its a house of cards; if you tear out the spending you compromise the whole structure. The only effective way to solve is to either build paralell government and swap to it when its ready...or burn it all down and start over. permalink parent award report block reply starjello 2 points 1 day ago Correct.The democrats wanted this and made demands that they knew would not be met and waited it out for this budget that they always wanted. Republicans were getting nervous after seeing the results of the recent election. The simp cultists will down vote. Reality is not a strong point around here for too many. permalink parent award report block reply Wtf_socialismreally 1 points 1 day ago Personally I would have preferred the shutdown continue, and have remained consistent in that. Acknowledging and laughing at the other side for flipping immediately once told to is not the same as flipping myself. I also remain of the opinion that it is politically advantageous for Trump to have focused on opening up the government while we by and large disagreed with him. I'm just not sure it is as advantageous as I initially believed, because I forgot how the other side will invent entire scenarios different from reality at a whim. permalink parent award report block reply NotYourMan 2 points 1 day ago Democrats are the US division of the liberal fascist movement.  Antifa is the militia created to overthrown the people's movement against an invasion by immigrants.  Liberal fascism is the underlying movement behind the communist attacks on the people. permalink parent award report block reply SicSemperTyrannis2 1 points 1 day ago Pretty good summary! permalink parent award report block reply load 14 more comments... SavingPrivateGrace 13 points 1 day ago Powerless losers, tired of their drama permalink award report block reply SaltyKrakenBalls 3 points 1 day ago They need to be mocked into oblivion permalink parent award report block reply Bidensmellslikepiss 10 points 1 day ago If by \"Trump's fault,\" they mean he wouldn't give $1.5 trillion to undocumented invaders... then yes. It was Trump's fault. I talked to a complete dipshit who believed this and he thought \"Trump should give them what they want so kids don't have to starve in MN.\" Wtf man... I just can't be friends with these people. They're too stupid, immoral or both. Completely went over his head that Schumer was holding the government hostage for illegals. Edit: I'm 95% sure even he knew that \"starving kids in MN\" was utter bullshit. permalink award report block reply Bohemyth_2 7 points 1 day ago believe in nothing, fall for anything No God, no peace. Know God, know peace. permalink award report block reply Bicentennial76 3 points 1 day ago 💯 permalink parent award report block reply SubmarineGuy 5 points 1 day ago This is an AI I came across that was posted here. It mocks the Democrats losing this battle. Why it has not gone viral is shocking to me.  It is too hilarious to disappear into obscurity! https://x.com/MarieIsabellaB/status/1987937641661100174?s=20 permalink award report block reply covok48 2 points 1 day ago Gay. permalink parent award report block reply SubmarineGuy 2 points 1 day ago That is one of the reasons it is so funny. Democrats are the preferred party of queers! permalink parent award report block reply Beat_to_Quarters 4 points 1 day ago \"I don't want solutions. I want to call Trump a fascist.\" permalink award report block reply Easzq8 3 points 1 day ago The answer is always to sperg out. permalink award report block reply lixa 2 points 1 day ago I'm mad too. The uniparty is in charge. They aren't going to pass Trump's legislation. permalink award report block reply TrumpYouMagaFrenner 1 points 1 day ago Yeah right narrative will be trump caved permalink award report block reply SaltyKrakenBalls 1 points 1 day ago Hilarious permalink award report block reply Noseeboh 1 points 21 hours ago If it was Trump's fault, how does Trump doing literally doing nothing but keeping to the origonal bill make the government open? Ergo, the democrats who conceded virtually everything are at fault. permalink award report block reply GabeC1997 1 points 1 day ago Sad it couldn’t stay shutdown longer. permalink award report block reply covok48 1 points 1 day ago I don’t care. It was better when nogs were crying about gibs. permalink award report block reply Bullet3250 1 points 1 day ago Government shuts down... Democrats \"dats' Trumps fault\" Government reopens.... Democrats \"dats' Trumps fault\"! permalink award report block reply Coin-Op 1 points 21 hours ago Off-topic: Invincible is one weird comic book show. It's fairly woke too. permalink award report block reply RightIsMight -1 points 1 day ago This is gonna be you in regards to the filibuster after your football team kills it and the dems take over and take advantage of it. Bookmark this post. permalink award report block reply SubmarineGuy 4 points 1 day ago The Filibuster has been successfully chipped away for a few things. Judges and certain budget bills for example. Rather than kill it completely just make clean Continuing Resolutions immune to debate rules. Since nothing has changed why have the debate ? A simple up or down vote for clean Continuing Resolution bills would solve this issue permalink parent award report block reply RightIsMight 2 points 1 day ago Republicans are paid opposition. Shills running the same play as the democrats meanwhile we all lose. permalink parent award report block reply SubmarineGuy 1 points 1 day ago The reason why it seems we have a Uniparty.  #1 Undeniable truth of life: The worst of the worst want to be politicians first .\nThe kind of person you least want to be given power is the same one who wants to be a politician the most. Trump is the man who just wanted to be left alone. Once he crossed the boundary into politics America won. permalink parent award report block reply RightIsMight 4 points 1 day ago 50 year mortgages 15 year car loans unaffordable healthcare is america winning, kek permalink parent award report block reply truthjusticetruth 1 points 22 hours ago This is a literal meaning of the Parable of the Trees in Judges chapter 9. permalink parent award report block reply Ikon 4 points 1 day ago Dems always get what they want anyways so what changes? What did Biden admin and dems not do to destroy the country as much as possible in 4 years. permalink parent award report block reply TrumpSaysNoMAGA4u 0 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nSHILL_DETECTOR 73 points 1 day ago i like how their little brainwashed followers can have their beliefs flipped 180 degrees in literal hours permalink award report block reply newestofnew 43 points 1 day ago as others have pointed out previously they don't believe in anything but power permalink parent award report block reply TrumpsBigBalls 15 points 1 day ago Not to be \"that guy' especially since these memes are funny as hell, but they don't really convey what happened... The actual reasoning is left out... as in \"The govt should be shutdown until you give illegals healthcare!\" and \"Damnit you opened the gov't without providing illegals healthcare\"... It wasn't REALLY about the govt being open or shutdown and we all do know that. Only reason I bring this up is these memes kind of make us look a little dumb since they don't represent the actual truth when it would be so easy to tweak them a bit to reflect them upset about illegals not getting healthcare. permalink parent award report block reply SicSemperTyrannis2 4 points 1 day ago Can you explain to me how it is in any way a win to restore the government to Biden spending levels? I mean ok pay our troops and air traffic controllers, yes that's important. But how many swamp critters were fired because the government was shutdown long enough to fire at will? permalink parent award report block reply Morokei 3 points 1 day ago Answer:  None permalink parent award report block reply view 2 more comments... STONKATRUCK 2 points 23 hours ago All gov workers will get back pay so none permalink parent award report block reply deaditecoffee 1 points 1 day ago When dealing with Dems and in generally, revolution types, there is always a spread of reasons, and real and fake sympathy, which is the reason this meme feels right. There is a serious sincerity issue, and it's not even a veil slip nowadays, the crazy reps and pundits are saying counter narratives and \"the quiet part out loud\" pretty regularly on all manner of topics. The mockery of the left's inconsistency is funny but doesn't move the needle at all. permalink parent award report block reply SicSemperTyrannis2 1 points 1 day ago Straight out of 1984. permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply mohel 0 points 1 day ago watch and learn permalink parent award report block reply Dev404 11 points 1 day ago They're demoralized into killing babies, mutilating their genitals, and actively supporting foreigners invading our country. These people have been fully indoctrinated by feminists and would try to stop breathing if you reminded them that Trump breathes the same air they do. permalink parent award report block reply rebuildingMyself 6 points 1 day ago Their opinions are assigned to them by their preferred media sources. They have no real thoughts of their own and I bet most don't even have internal monologues permalink parent award report block reply TrumpAndGodWin 2 points 17 hours ago \"Most people are other people. Their thoughts are someone else's opinions, their lives a mimicry, their passions a quotation.\" Oscar Wilde permalink parent award report block reply RizzlieDoodad 4 points 1 day ago Hello pot. Meet kettle. You're cheering for the Senate passing the Biden Budget. The Dems wanted more than Biden level spending. And the Republicans said no we'll keep it the same. Lol, lmao even. Cope harder. This isn't a win permalink parent award report block reply SHILL_DETECTOR 3 points 1 day ago ive ignored the whole thing not suprised that we cant have any cuts to spending, ever. permalink parent award report block reply Klaus73 1 points 1 day ago Essentially - its a house of cards; if you tear out the spending you compromise the whole structure. The only effective way to solve is to either build paralell government and swap to it when its ready...or burn it all down and start over. permalink parent award report block reply starjello 2 points 1 day ago Correct.The democrats wanted this and made demands that they knew would not be met and waited it out for this budget that they always wanted. Republicans were getting nervous after seeing the results of the recent election. The simp cultists will down vote. Reality is not a strong point around here for too many. permalink parent award report block reply Wtf_socialismreally 1 points 1 day ago Personally I would have preferred the shutdown continue, and have remained consistent in that. Acknowledging and laughing at the other side for flipping immediately once told to is not the same as flipping myself. I also remain of the opinion that it is politically advantageous for Trump to have focused on opening up the government while we by and large disagreed with him. I'm just not sure it is as advantageous as I initially believed, because I forgot how the other side will invent entire scenarios different from reality at a whim. permalink parent award report block reply NotYourMan 2 points 1 day ago Democrats are the US division of the liberal fascist movement.  Antifa is the militia created to overthrown the people's movement against an invasion by immigrants.  Liberal fascism is the underlying movement behind the communist attacks on the people. permalink parent award report block reply SicSemperTyrannis2 1 points 1 day ago Pretty good summary! permalink parent award report block reply load 14 more comments...\nnewestofnew 43 points 1 day ago as others have pointed out previously they don't believe in anything but power permalink parent award report block reply TrumpsBigBalls 15 points 1 day ago Not to be \"that guy' especially since these memes are funny as hell, but they don't really convey what happened... The actual reasoning is left out... as in \"The govt should be shutdown until you give illegals healthcare!\" and \"Damnit you opened the gov't without providing illegals healthcare\"... It wasn't REALLY about the govt being open or shutdown and we all do know that. Only reason I bring this up is these memes kind of make us look a little dumb since they don't represent the actual truth when it would be so easy to tweak them a bit to reflect them upset about illegals not getting healthcare. permalink parent award report block reply SicSemperTyrannis2 4 points 1 day ago Can you explain to me how it is in any way a win to restore the government to Biden spending levels? I mean ok pay our troops and air traffic controllers, yes that's important. But how many swamp critters were fired because the government was shutdown long enough to fire at will? permalink parent award report block reply Morokei 3 points 1 day ago Answer:  None permalink parent award report block reply view 2 more comments... STONKATRUCK 2 points 23 hours ago All gov workers will get back pay so none permalink parent award report block reply deaditecoffee 1 points 1 day ago When dealing with Dems and in generally, revolution types, there is always a spread of reasons, and real and fake sympathy, which is the reason this meme feels right. There is a serious sincerity issue, and it's not even a veil slip nowadays, the crazy reps and pundits are saying counter narratives and \"the quiet part out loud\" pretty regularly on all manner of topics. The mockery of the left's inconsistency is funny but doesn't move the needle at all. permalink parent award report block reply SicSemperTyrannis2 1 points 1 day ago Straight out of 1984. permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply mohel 0 points 1 day ago watch and learn permalink parent award report block reply\nTrumpsBigBalls 15 points 1 day ago Not to be \"that guy' especially since these memes are funny as hell, but they don't really convey what happened... The actual reasoning is left out... as in \"The govt should be shutdown until you give illegals healthcare!\" and \"Damnit you opened the gov't without providing illegals healthcare\"... It wasn't REALLY about the govt being open or shutdown and we all do know that. Only reason I bring this up is these memes kind of make us look a little dumb since they don't represent the actual truth when it would be so easy to tweak them a bit to reflect them upset about illegals not getting healthcare. permalink parent award report block reply SicSemperTyrannis2 4 points 1 day ago Can you explain to me how it is in any way a win to restore the government to Biden spending levels? I mean ok pay our troops and air traffic controllers, yes that's important. But how many swamp critters were fired because the government was shutdown long enough to fire at will? permalink parent award report block reply Morokei 3 points 1 day ago Answer:  None permalink parent award report block reply view 2 more comments... STONKATRUCK 2 points 23 hours ago All gov workers will get back pay so none permalink parent award report block reply deaditecoffee 1 points 1 day ago When dealing with Dems and in generally, revolution types, there is always a spread of reasons, and real and fake sympathy, which is the reason this meme feels right. There is a serious sincerity issue, and it's not even a veil slip nowadays, the crazy reps and pundits are saying counter narratives and \"the quiet part out loud\" pretty regularly on all manner of topics. The mockery of the left's inconsistency is funny but doesn't move the needle at all. permalink parent award report block reply\nSicSemperTyrannis2 4 points 1 day ago Can you explain to me how it is in any way a win to restore the government to Biden spending levels? I mean ok pay our troops and air traffic controllers, yes that's important. But how many swamp critters were fired because the government was shutdown long enough to fire at will? permalink parent award report block reply Morokei 3 points 1 day ago Answer:  None permalink parent award report block reply view 2 more comments... STONKATRUCK 2 points 23 hours ago All gov workers will get back pay so none permalink parent award report block reply\nMorokei 3 points 1 day ago Answer:  None permalink parent award report block reply view 2 more comments...\nSTONKATRUCK 2 points 23 hours ago All gov workers will get back pay so none permalink parent award report block reply\ndeaditecoffee 1 points 1 day ago When dealing with Dems and in generally, revolution types, there is always a spread of reasons, and real and fake sympathy, which is the reason this meme feels right. There is a serious sincerity issue, and it's not even a veil slip nowadays, the crazy reps and pundits are saying counter narratives and \"the quiet part out loud\" pretty regularly on all manner of topics. The mockery of the left's inconsistency is funny but doesn't move the needle at all. permalink parent award report block reply\nSicSemperTyrannis2 1 points 1 day ago Straight out of 1984. permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nDeportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nmohel 0 points 1 day ago watch and learn permalink parent award report block reply\nDev404 11 points 1 day ago They're demoralized into killing babies, mutilating their genitals, and actively supporting foreigners invading our country. These people have been fully indoctrinated by feminists and would try to stop breathing if you reminded them that Trump breathes the same air they do. permalink parent award report block reply\nrebuildingMyself 6 points 1 day ago Their opinions are assigned to them by their preferred media sources. They have no real thoughts of their own and I bet most don't even have internal monologues permalink parent award report block reply TrumpAndGodWin 2 points 17 hours ago \"Most people are other people. Their thoughts are someone else's opinions, their lives a mimicry, their passions a quotation.\" Oscar Wilde permalink parent award report block reply\nTrumpAndGodWin 2 points 17 hours ago \"Most people are other people. Their thoughts are someone else's opinions, their lives a mimicry, their passions a quotation.\" Oscar Wilde permalink parent award report block reply\nRizzlieDoodad 4 points 1 day ago Hello pot. Meet kettle. You're cheering for the Senate passing the Biden Budget. The Dems wanted more than Biden level spending. And the Republicans said no we'll keep it the same. Lol, lmao even. Cope harder. This isn't a win permalink parent award report block reply SHILL_DETECTOR 3 points 1 day ago ive ignored the whole thing not suprised that we cant have any cuts to spending, ever. permalink parent award report block reply Klaus73 1 points 1 day ago Essentially - its a house of cards; if you tear out the spending you compromise the whole structure. The only effective way to solve is to either build paralell government and swap to it when its ready...or burn it all down and start over. permalink parent award report block reply starjello 2 points 1 day ago Correct.The democrats wanted this and made demands that they knew would not be met and waited it out for this budget that they always wanted. Republicans were getting nervous after seeing the results of the recent election. The simp cultists will down vote. Reality is not a strong point around here for too many. permalink parent award report block reply Wtf_socialismreally 1 points 1 day ago Personally I would have preferred the shutdown continue, and have remained consistent in that. Acknowledging and laughing at the other side for flipping immediately once told to is not the same as flipping myself. I also remain of the opinion that it is politically advantageous for Trump to have focused on opening up the government while we by and large disagreed with him. I'm just not sure it is as advantageous as I initially believed, because I forgot how the other side will invent entire scenarios different from reality at a whim. permalink parent award report block reply\nSHILL_DETECTOR 3 points 1 day ago ive ignored the whole thing not suprised that we cant have any cuts to spending, ever. permalink parent award report block reply Klaus73 1 points 1 day ago Essentially - its a house of cards; if you tear out the spending you compromise the whole structure. The only effective way to solve is to either build paralell government and swap to it when its ready...or burn it all down and start over. permalink parent award report block reply\nKlaus73 1 points 1 day ago Essentially - its a house of cards; if you tear out the spending you compromise the whole structure. The only effective way to solve is to either build paralell government and swap to it when its ready...or burn it all down and start over. permalink parent award report block reply\nstarjello 2 points 1 day ago Correct.The democrats wanted this and made demands that they knew would not be met and waited it out for this budget that they always wanted. Republicans were getting nervous after seeing the results of the recent election. The simp cultists will down vote. Reality is not a strong point around here for too many. permalink parent award report block reply\nWtf_socialismreally 1 points 1 day ago Personally I would have preferred the shutdown continue, and have remained consistent in that. Acknowledging and laughing at the other side for flipping immediately once told to is not the same as flipping myself. I also remain of the opinion that it is politically advantageous for Trump to have focused on opening up the government while we by and large disagreed with him. I'm just not sure it is as advantageous as I initially believed, because I forgot how the other side will invent entire scenarios different from reality at a whim. permalink parent award report block reply\nNotYourMan 2 points 1 day ago Democrats are the US division of the liberal fascist movement.  Antifa is the militia created to overthrown the people's movement against an invasion by immigrants.  Liberal fascism is the underlying movement behind the communist attacks on the people. permalink parent award report block reply SicSemperTyrannis2 1 points 1 day ago Pretty good summary! permalink parent award report block reply\nSicSemperTyrannis2 1 points 1 day ago Pretty good summary! permalink parent award report block reply\nSavingPrivateGrace 13 points 1 day ago Powerless losers, tired of their drama permalink award report block reply SaltyKrakenBalls 3 points 1 day ago They need to be mocked into oblivion permalink parent award report block reply\nSaltyKrakenBalls 3 points 1 day ago They need to be mocked into oblivion permalink parent award report block reply\nBidensmellslikepiss 10 points 1 day ago If by \"Trump's fault,\" they mean he wouldn't give $1.5 trillion to undocumented invaders... then yes. It was Trump's fault. I talked to a complete dipshit who believed this and he thought \"Trump should give them what they want so kids don't have to starve in MN.\" Wtf man... I just can't be friends with these people. They're too stupid, immoral or both. Completely went over his head that Schumer was holding the government hostage for illegals. Edit: I'm 95% sure even he knew that \"starving kids in MN\" was utter bullshit. permalink award report block reply\nBohemyth_2 7 points 1 day ago believe in nothing, fall for anything No God, no peace. Know God, know peace. permalink award report block reply Bicentennial76 3 points 1 day ago 💯 permalink parent award report block reply\nBicentennial76 3 points 1 day ago 💯 permalink parent award report block reply\nSubmarineGuy 5 points 1 day ago This is an AI I came across that was posted here. It mocks the Democrats losing this battle. Why it has not gone viral is shocking to me.  It is too hilarious to disappear into obscurity! https://x.com/MarieIsabellaB/status/1987937641661100174?s=20 permalink award report block reply covok48 2 points 1 day ago Gay. permalink parent award report block reply SubmarineGuy 2 points 1 day ago That is one of the reasons it is so funny. Democrats are the preferred party of queers! permalink parent award report block reply\ncovok48 2 points 1 day ago Gay. permalink parent award report block reply SubmarineGuy 2 points 1 day ago That is one of the reasons it is so funny. Democrats are the preferred party of queers! permalink parent award report block reply\nSubmarineGuy 2 points 1 day ago That is one of the reasons it is so funny. Democrats are the preferred party of queers! permalink parent award report block reply\nBeat_to_Quarters 4 points 1 day ago \"I don't want solutions. I want to call Trump a fascist.\" permalink award report block reply\nEaszq8 3 points 1 day ago The answer is always to sperg out. permalink award report block reply\nlixa 2 points 1 day ago I'm mad too. The uniparty is in charge. They aren't going to pass Trump's legislation. permalink award report block reply\nTrumpYouMagaFrenner 1 points 1 day ago Yeah right narrative will be trump caved permalink award report block reply\nSaltyKrakenBalls 1 points 1 day ago Hilarious permalink award report block reply\nNoseeboh 1 points 21 hours ago If it was Trump's fault, how does Trump doing literally doing nothing but keeping to the origonal bill make the government open? Ergo, the democrats who conceded virtually everything are at fault. permalink award report block reply\nGabeC1997 1 points 1 day ago Sad it couldn’t stay shutdown longer. permalink award report block reply\ncovok48 1 points 1 day ago I don’t care. It was better when nogs were crying about gibs. permalink award report block reply\nBullet3250 1 points 1 day ago Government shuts down... Democrats \"dats' Trumps fault\" Government reopens.... Democrats \"dats' Trumps fault\"! permalink award report block reply\nCoin-Op 1 points 21 hours ago Off-topic: Invincible is one weird comic book show. It's fairly woke too. permalink award report block reply\nRightIsMight -1 points 1 day ago This is gonna be you in regards to the filibuster after your football team kills it and the dems take over and take advantage of it. Bookmark this post. permalink award report block reply SubmarineGuy 4 points 1 day ago The Filibuster has been successfully chipped away for a few things. Judges and certain budget bills for example. Rather than kill it completely just make clean Continuing Resolutions immune to debate rules. Since nothing has changed why have the debate ? A simple up or down vote for clean Continuing Resolution bills would solve this issue permalink parent award report block reply RightIsMight 2 points 1 day ago Republicans are paid opposition. Shills running the same play as the democrats meanwhile we all lose. permalink parent award report block reply SubmarineGuy 1 points 1 day ago The reason why it seems we have a Uniparty.  #1 Undeniable truth of life: The worst of the worst want to be politicians first .\nThe kind of person you least want to be given power is the same one who wants to be a politician the most. Trump is the man who just wanted to be left alone. Once he crossed the boundary into politics America won. permalink parent award report block reply RightIsMight 4 points 1 day ago 50 year mortgages 15 year car loans unaffordable healthcare is america winning, kek permalink parent award report block reply truthjusticetruth 1 points 22 hours ago This is a literal meaning of the Parable of the Trees in Judges chapter 9. permalink parent award report block reply Ikon 4 points 1 day ago Dems always get what they want anyways so what changes? What did Biden admin and dems not do to destroy the country as much as possible in 4 years. permalink parent award report block reply TrumpSaysNoMAGA4u 0 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nSubmarineGuy 4 points 1 day ago The Filibuster has been successfully chipped away for a few things. Judges and certain budget bills for example. Rather than kill it completely just make clean Continuing Resolutions immune to debate rules. Since nothing has changed why have the debate ? A simple up or down vote for clean Continuing Resolution bills would solve this issue permalink parent award report block reply RightIsMight 2 points 1 day ago Republicans are paid opposition. Shills running the same play as the democrats meanwhile we all lose. permalink parent award report block reply SubmarineGuy 1 points 1 day ago The reason why it seems we have a Uniparty.  #1 Undeniable truth of life: The worst of the worst want to be politicians first .\nThe kind of person you least want to be given power is the same one who wants to be a politician the most. Trump is the man who just wanted to be left alone. Once he crossed the boundary into politics America won. permalink parent award report block reply RightIsMight 4 points 1 day ago 50 year mortgages 15 year car loans unaffordable healthcare is america winning, kek permalink parent award report block reply truthjusticetruth 1 points 22 hours ago This is a literal meaning of the Parable of the Trees in Judges chapter 9. permalink parent award report block reply\nRightIsMight 2 points 1 day ago Republicans are paid opposition. Shills running the same play as the democrats meanwhile we all lose. permalink parent award report block reply SubmarineGuy 1 points 1 day ago The reason why it seems we have a Uniparty.  #1 Undeniable truth of life: The worst of the worst want to be politicians first .\nThe kind of person you least want to be given power is the same one who wants to be a politician the most. Trump is the man who just wanted to be left alone. Once he crossed the boundary into politics America won. permalink parent award report block reply RightIsMight 4 points 1 day ago 50 year mortgages 15 year car loans unaffordable healthcare is america winning, kek permalink parent award report block reply truthjusticetruth 1 points 22 hours ago This is a literal meaning of the Parable of the Trees in Judges chapter 9. permalink parent award report block reply\nSubmarineGuy 1 points 1 day ago The reason why it seems we have a Uniparty.  #1 Undeniable truth of life: The worst of the worst want to be politicians first .\nThe kind of person you least want to be given power is the same one who wants to be a politician the most. Trump is the man who just wanted to be left alone. Once he crossed the boundary into politics America won. permalink parent award report block reply RightIsMight 4 points 1 day ago 50 year mortgages 15 year car loans unaffordable healthcare is america winning, kek permalink parent award report block reply truthjusticetruth 1 points 22 hours ago This is a literal meaning of the Parable of the Trees in Judges chapter 9. permalink parent award report block reply\nRightIsMight 4 points 1 day ago 50 year mortgages 15 year car loans unaffordable healthcare is america winning, kek permalink parent award report block reply\ntruthjusticetruth 1 points 22 hours ago This is a literal meaning of the Parable of the Trees in Judges chapter 9. permalink parent award report block reply\nIkon 4 points 1 day ago Dems always get what they want anyways so what changes? What did Biden admin and dems not do to destroy the country as much as possible in 4 years. permalink parent award report block reply\nTrumpSaysNoMAGA4u 0 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply"
}