{
  "id": "8185508",
  "title": "163U.S. citizens hold 1.81 TRILLION dollars in student loans, and yet we don't have the talent to su",
  "url": "https://patriots.win/p/1ARK9nP4pc/us-citizens-hold-181-trillion-do/c",
  "content": "292 U.S. citizens hold 1.81 TRILLION dollars in student loans, and yet we don't have the talent to support corporate needs AND we need to import 600,000 Chinese students or half of the colleges will go bankrupt?? posted 7 hours ago by Ross190 20 comments award share download report block\n20 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Callsign_Fox1 7 points 7 hours ago Deals a deal. We agreed to import 600k China men so we could take over the Tok and Crack down on well you know. permalink award report block reply sobriquet 6 points 7 hours ago Anti-juden speech?  Speech which is perfectly legitimate and legal under the constitution? Naw, we'll just send more weapons and money. permalink parent award report block reply SanityGumby 1 points 31 minutes ago No, we didn’t. The number never changed. We had 600k when the deal was signed. The only thing remotely tying the deal to it is we promised not to revoke their visas permalink parent award report block reply PapaPepe 6 points 7 hours ago We should not take any foreign students anymore I don't care where they are from. permalink award report block reply greatpumpkin 5 points 5 hours ago There's a certain amount of truth here. Someone with a PhD in interpretive dance theory has about the same employability as a former psychic hotline operator. Having said that, I cannot believe we lack enough home grown young men that, with a little OJT, can do whatever the fuck needs doing. permalink award report block reply tw0scoops 4 points 7 hours ago Colleges wouldn't go bankrupt if they fired all the professors teaching gender nonsense and unicorn farts permalink award report block reply sobriquet 4 points 7 hours ago Someone has been selling the kids a defective product. permalink award report block reply Beat_to_Quarters 3 points 6 hours ago How much of that student debt is from stupid, useless degrees?  Some graduates are absolutely getting screwed over and some have gone into debt to buy a gender studies degree. permalink award report block reply fluffykitten 3 points 6 hours ago How did we get from $100,000 per H1B visa to this? permalink award report block reply SanityGumby 1 points 31 minutes ago We didn’t. Everything is the same permalink parent award report block reply Shitsbrokeyo 2 points 6 hours ago Np need for gender, dei and women's studies in the labor market. Especially tech sector permalink award report block reply someguy7738 2 points 6 hours ago All that student loan debt should simply be canceled and China and India handed the bill. permalink award report block reply Crucible 2 points 7 hours ago At least we got TikTok in the deal. permalink award report block reply LordKuroTheGreat 3 points 6 hours ago And now that we have that, we can make sure it doesn't subvert our own culture or unfairly bias the youth to a foreign nation's preferred way of thinking. snicker permalink parent award report block reply SanityGumby 1 points 30 minutes ago Are you a bot because I keep seeing this retarded statement. We didn’t take in 600k for the deal. The number was already 600k. The only thing with the deal was we promised not to cancel their visas permalink parent award report block reply lizardo221 1 points 4 hours ago This is rather simple to understand: the Chinese students all pay up front typically, no questions asked. It's easy money that feeds all these institutions. permalink award report block reply ACActual 1 points 48 minutes ago Your clearly mistaken.   We would never have gotten to the moon without all those Jeets .  Americans are stupid.  Thank goodness Trump is saving the Colleges from our dumbasses permalink award report block reply mathteach314159 1 points 2 hours ago Fuck the colleges. I really wish Trump seized this opportunity for the racket to go tits up, allowing for something better to fill the space. permalink award report block reply SanityGumby 1 points 32 minutes ago Have you seen v college graduates. You seem retarded permalink award report block reply\nCallsign_Fox1 7 points 7 hours ago Deals a deal. We agreed to import 600k China men so we could take over the Tok and Crack down on well you know. permalink award report block reply sobriquet 6 points 7 hours ago Anti-juden speech?  Speech which is perfectly legitimate and legal under the constitution? Naw, we'll just send more weapons and money. permalink parent award report block reply SanityGumby 1 points 31 minutes ago No, we didn’t. The number never changed. We had 600k when the deal was signed. The only thing remotely tying the deal to it is we promised not to revoke their visas permalink parent award report block reply\nsobriquet 6 points 7 hours ago Anti-juden speech?  Speech which is perfectly legitimate and legal under the constitution? Naw, we'll just send more weapons and money. permalink parent award report block reply\nSanityGumby 1 points 31 minutes ago No, we didn’t. The number never changed. We had 600k when the deal was signed. The only thing remotely tying the deal to it is we promised not to revoke their visas permalink parent award report block reply\nPapaPepe 6 points 7 hours ago We should not take any foreign students anymore I don't care where they are from. permalink award report block reply\ngreatpumpkin 5 points 5 hours ago There's a certain amount of truth here. Someone with a PhD in interpretive dance theory has about the same employability as a former psychic hotline operator. Having said that, I cannot believe we lack enough home grown young men that, with a little OJT, can do whatever the fuck needs doing. permalink award report block reply\ntw0scoops 4 points 7 hours ago Colleges wouldn't go bankrupt if they fired all the professors teaching gender nonsense and unicorn farts permalink award report block reply\nsobriquet 4 points 7 hours ago Someone has been selling the kids a defective product. permalink award report block reply\nBeat_to_Quarters 3 points 6 hours ago How much of that student debt is from stupid, useless degrees?  Some graduates are absolutely getting screwed over and some have gone into debt to buy a gender studies degree. permalink award report block reply\nfluffykitten 3 points 6 hours ago How did we get from $100,000 per H1B visa to this? permalink award report block reply SanityGumby 1 points 31 minutes ago We didn’t. Everything is the same permalink parent award report block reply\nSanityGumby 1 points 31 minutes ago We didn’t. Everything is the same permalink parent award report block reply\nShitsbrokeyo 2 points 6 hours ago Np need for gender, dei and women's studies in the labor market. Especially tech sector permalink award report block reply\nsomeguy7738 2 points 6 hours ago All that student loan debt should simply be canceled and China and India handed the bill. permalink award report block reply\nCrucible 2 points 7 hours ago At least we got TikTok in the deal. permalink award report block reply LordKuroTheGreat 3 points 6 hours ago And now that we have that, we can make sure it doesn't subvert our own culture or unfairly bias the youth to a foreign nation's preferred way of thinking. snicker permalink parent award report block reply SanityGumby 1 points 30 minutes ago Are you a bot because I keep seeing this retarded statement. We didn’t take in 600k for the deal. The number was already 600k. The only thing with the deal was we promised not to cancel their visas permalink parent award report block reply\nLordKuroTheGreat 3 points 6 hours ago And now that we have that, we can make sure it doesn't subvert our own culture or unfairly bias the youth to a foreign nation's preferred way of thinking. snicker permalink parent award report block reply\nSanityGumby 1 points 30 minutes ago Are you a bot because I keep seeing this retarded statement. We didn’t take in 600k for the deal. The number was already 600k. The only thing with the deal was we promised not to cancel their visas permalink parent award report block reply\nlizardo221 1 points 4 hours ago This is rather simple to understand: the Chinese students all pay up front typically, no questions asked. It's easy money that feeds all these institutions. permalink award report block reply\nACActual 1 points 48 minutes ago Your clearly mistaken.   We would never have gotten to the moon without all those Jeets .  Americans are stupid.  Thank goodness Trump is saving the Colleges from our dumbasses permalink award report block reply\nmathteach314159 1 points 2 hours ago Fuck the colleges. I really wish Trump seized this opportunity for the racket to go tits up, allowing for something better to fill the space. permalink award report block reply\nSanityGumby 1 points 32 minutes ago Have you seen v college graduates. You seem retarded permalink award report block reply",
  "fetched_at": "2025-11-12T23:42:43.030311Z"
}