{
  "id": "1ARK9isbLM",
  "url": "https://patriots.win/p/1ARK9isbLM/doge-republicans-had-a-wake-up-c/c",
  "content": "440 DOGE: Republicans had a wake up call on November 4th - their sabotage of Elon Musk's DOGE effort disillusioned scores of voters. The shutdown is proving that we really could run the nation with a much smaller bureaucracy. It is time to revive DOGE. posted 2 days ago by SweetBeef 18 comments award share report block @amuse @amuse • 4d DOGE: Republicans had a wake up call on November 4th - their sabotage of Elon Musk's DOGE effort disillusioned scores of voters. The shutdown is proving that we really could run the nation with a much smaller bureaucracy. It is time to revive DOGE. @amuse @amuse • 4d\n18 comments Sort by Top Top New Worst Old Save hillaryforprison 14 points 2 days ago DOGE still exists. Proof of life: https://x.com/doge permalink award report block reply blitzkrieg1 1 points 2 days ago TY permalink parent award report block reply TakingCoatsWIN 6 points 2 days ago DOGE was started without Elon and continues without Elon. permalink award report block reply BillGateCanSuckIt 3 points 2 days ago But our politicians need to insider trade and get rich so what if they starve millions to achieve this. They deserve it permalink award report block reply Counterwhat 3 points 2 days ago November 4th stil cost us. The damage won't be known for a couple of years, but losing the governorships, mayoral ships, and other elected offices is gonna hurt. We don't know how bad but plenty will be revealed. In Virginia, especially, it's going to be a dark few years. The 2nd admendment will be under attack here shortly. Northam tried it but was swatted back. Spam might try again. She is going to go hard. permalink award report block reply SpeekFreely 3 points 2 days ago The ghost of Curtis Yarvin is getting louder, and more acceptance. permalink award report block reply JoeMcCarthyWasRight 2 points 2 days ago Billions stolen through bullshit Marxist NGOs for decades and not one arrest. Either Trump team is inept or in on it. Elon uncovered unimaginable crimes that should have led to raids hundreds of 2 am raids and billions of assets seized. permalink award report block reply patrioticwinning3 2 points 2 days ago Its time to: CLEAN HOUSE AT DOJ AND FBI, arrest the traitors, and improve economic conditions! permalink award report block reply cbonez416 1 points 1 day ago Doge is still there working? permalink award report block reply JustInTime2_ 1 points 1 day ago Yes it confuse to exist. permalink award report block reply SweetBeef OP 1 points 2 days ago https://x.com/amuse/status/1987267382700876199 permalink award report block reply realPixelDust 0 points 2 days ago False connection. 60% of male republican voters stayed home. That is all there is to it. No one gave a shit in the BLUE AREAS because they knew they could not win anyway. Past is the best predictor of the future. Could have won NJ, though. Could have got those 3 lib judges off the bench in PA. Beat mamdani? No. Texas did pretty good I heard. Also, Amuse is retarded lately. DOGE is still going. Elon stepped away & it is still going - they just do not have anyone high profile to attack anymore. He literally just explained this virally on joe Rogan clip days ago or so. permalink award report block reply texas4ever 2 points 2 days ago That's the only reason we lose, people sit it out which is insane. Something I'll never understand about conservatives. permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply RINO_fatigue 0 points 2 days ago Cutting government waste is good but Musk is a looney tunes retard who claims that global warming is real permalink award report block reply possibletower -1 points 2 days ago Only one DOGE should blame for that shitshow is Elon Cuck for calling Trump a pedo. Fuck Elon permalink award report block reply tingo999 -5 points 2 days ago Elon Musk was the one that sabotaged himself. He's a faggot, sucking the tit of India and China. I know you faggots give him credit for buying Twitter, he didn't buy Twitter a group of investors did. Those investors include the original founder of Twitter Jack Dorsey and a bunch of American hating Muslims. Also, Elon bought twitter ONLY because he was fucking the young writer Ashley St Clair (Jewish) who was working at Babylon Bee (Jewish) at the time it was banned from Twitter. If they didn't ban Babylon Bee he would have never been inspired to buy Twitter. I don't give a fuck about Elon Musk. How come you retards even believe Doge is real? You think it's that easy to audit the federal government finances? gtfo here. permalink award report block reply hillaryforprison 3 points 2 days ago You're right on Elon not being 100% owner or buyer. I don't understand your hate of him though. What is that from? Is it from his unkind words to Trump previously- if so, you know they basically made up, right? Elon has retweeted and shown support in many ways since then. If your hate is based on something else- then what exactly. He has been extremely valuable to people in this world through what he's accomplished. I think your assumption about WHY he bought Twitter is wrong. He tried to back out of it after he found how many fraud accounts there were- but ultimately proceeded. This fact does not align with your assumption about being solely about a girl. You think DOGE is fake? https://x.com/doge - shows their regular progress in finding fraud. Whether something is done to shut down the abuse is up to other branches of government. permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nhillaryforprison 14 points 2 days ago DOGE still exists. Proof of life: https://x.com/doge permalink award report block reply blitzkrieg1 1 points 2 days ago TY permalink parent award report block reply\nblitzkrieg1 1 points 2 days ago TY permalink parent award report block reply\nTakingCoatsWIN 6 points 2 days ago DOGE was started without Elon and continues without Elon. permalink award report block reply\nBillGateCanSuckIt 3 points 2 days ago But our politicians need to insider trade and get rich so what if they starve millions to achieve this. They deserve it permalink award report block reply\nCounterwhat 3 points 2 days ago November 4th stil cost us. The damage won't be known for a couple of years, but losing the governorships, mayoral ships, and other elected offices is gonna hurt. We don't know how bad but plenty will be revealed. In Virginia, especially, it's going to be a dark few years. The 2nd admendment will be under attack here shortly. Northam tried it but was swatted back. Spam might try again. She is going to go hard. permalink award report block reply\nSpeekFreely 3 points 2 days ago The ghost of Curtis Yarvin is getting louder, and more acceptance. permalink award report block reply\nJoeMcCarthyWasRight 2 points 2 days ago Billions stolen through bullshit Marxist NGOs for decades and not one arrest. Either Trump team is inept or in on it. Elon uncovered unimaginable crimes that should have led to raids hundreds of 2 am raids and billions of assets seized. permalink award report block reply\npatrioticwinning3 2 points 2 days ago Its time to: CLEAN HOUSE AT DOJ AND FBI, arrest the traitors, and improve economic conditions! permalink award report block reply\ncbonez416 1 points 1 day ago Doge is still there working? permalink award report block reply\nJustInTime2_ 1 points 1 day ago Yes it confuse to exist. permalink award report block reply\nSweetBeef OP 1 points 2 days ago https://x.com/amuse/status/1987267382700876199 permalink award report block reply\nrealPixelDust 0 points 2 days ago False connection. 60% of male republican voters stayed home. That is all there is to it. No one gave a shit in the BLUE AREAS because they knew they could not win anyway. Past is the best predictor of the future. Could have won NJ, though. Could have got those 3 lib judges off the bench in PA. Beat mamdani? No. Texas did pretty good I heard. Also, Amuse is retarded lately. DOGE is still going. Elon stepped away & it is still going - they just do not have anyone high profile to attack anymore. He literally just explained this virally on joe Rogan clip days ago or so. permalink award report block reply texas4ever 2 points 2 days ago That's the only reason we lose, people sit it out which is insane. Something I'll never understand about conservatives. permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\ntexas4ever 2 points 2 days ago That's the only reason we lose, people sit it out which is insane. Something I'll never understand about conservatives. permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nTrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nRINO_fatigue 0 points 2 days ago Cutting government waste is good but Musk is a looney tunes retard who claims that global warming is real permalink award report block reply\npossibletower -1 points 2 days ago Only one DOGE should blame for that shitshow is Elon Cuck for calling Trump a pedo. Fuck Elon permalink award report block reply\ntingo999 -5 points 2 days ago Elon Musk was the one that sabotaged himself. He's a faggot, sucking the tit of India and China. I know you faggots give him credit for buying Twitter, he didn't buy Twitter a group of investors did. Those investors include the original founder of Twitter Jack Dorsey and a bunch of American hating Muslims. Also, Elon bought twitter ONLY because he was fucking the young writer Ashley St Clair (Jewish) who was working at Babylon Bee (Jewish) at the time it was banned from Twitter. If they didn't ban Babylon Bee he would have never been inspired to buy Twitter. I don't give a fuck about Elon Musk. How come you retards even believe Doge is real? You think it's that easy to audit the federal government finances? gtfo here. permalink award report block reply hillaryforprison 3 points 2 days ago You're right on Elon not being 100% owner or buyer. I don't understand your hate of him though. What is that from? Is it from his unkind words to Trump previously- if so, you know they basically made up, right? Elon has retweeted and shown support in many ways since then. If your hate is based on something else- then what exactly. He has been extremely valuable to people in this world through what he's accomplished. I think your assumption about WHY he bought Twitter is wrong. He tried to back out of it after he found how many fraud accounts there were- but ultimately proceeded. This fact does not align with your assumption about being solely about a girl. You think DOGE is fake? https://x.com/doge - shows their regular progress in finding fraud. Whether something is done to shut down the abuse is up to other branches of government. permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nhillaryforprison 3 points 2 days ago You're right on Elon not being 100% owner or buyer. I don't understand your hate of him though. What is that from? Is it from his unkind words to Trump previously- if so, you know they basically made up, right? Elon has retweeted and shown support in many ways since then. If your hate is based on something else- then what exactly. He has been extremely valuable to people in this world through what he's accomplished. I think your assumption about WHY he bought Twitter is wrong. He tried to back out of it after he found how many fraud accounts there were- but ultimately proceeded. This fact does not align with your assumption about being solely about a girl. You think DOGE is fake? https://x.com/doge - shows their regular progress in finding fraud. Whether something is done to shut down the abuse is up to other branches of government. permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:56:03.906427Z"
}