{
  "id": "1ARK513JKq",
  "url": "https://patriots.win/p/1ARK513JKq/whos-gonna-tell-them/c",
  "content": "1215 Who's Gonna Tell Them BE  LESS  RETARDED posted 6 days ago by hecubus 20 comments award share download report block\n20 comments Sort by Top Top New Worst Old Save Around the Web 5DchessWatch 33 points 6 days ago They won't be happy until there's a daily ration of flamin' hot cheetos kibble dribbling out of a pipe in the wall in their assigned 5x10 vestibule permalink award report block reply 45fan 7 points 6 days ago \"Carl's Jr. believes that no child should go hungry. Your children have now been remanded into the custody of Carl's Jr!\" permalink parent award report block reply Jimmyprawns 1 points 6 days ago \"Carl's jr! Fuck you! I'm eating.\" permalink parent award report block reply 24601 25 points 6 days ago The SNAP anger is not really about food. It's about hair, fingernails, and drugs. permalink award report block reply CKIV 16 points 6 days ago I'm a PO and I JUST got off the phone with a lady that says the reason she's not paying her court fees is because her SNAP got cut. Which really means the public wasn't paying for her food, it was paying the literal (and figurative) penalty for her criminal behavior. permalink parent award report block reply SuperHonkey 6 points 6 days ago Welp, back to jail ya go Shaniqua permalink parent award report block reply Threaper666 7 points 6 days ago Because now they have to use their own money for Food. No extra money to spend on Extra sht. permalink parent award report block reply goatnuts 5 points 6 days ago Yup. Think about how it worked, being underprivileged and needy in the olden days. You went to your church, your community. They took care of you. But under that system, you have to face your people. If they know youre just a leech you won't get shit. Milking the federal bureaucracy comes with the benefit that theres no personal accountability to anyone. Now, you don't even need your community, in fact, you can even create a community of people just like you and nobody in it has to contribute! There are whole friend groups of baby mommas all together complaining about their snap and that their baby daddies ain't shit, right now. Entire communities gutted, strong ties replaced by paperwork, nobody with a sense of duty to their families and communities. But at least they get they hrrrrruh did and snecks for they kids. permalink parent award report block reply MySidesGoUp 2 points 6 days ago A women’s movement permalink parent award report block reply SuperHonkey 1 points 6 days ago This ☝🏻😕 permalink parent award report block reply RizzlieDoodad 6 points 6 days ago They want a change. The average age of being a first time home buyer is 40. In 1990 it was under 30. People have been voting for years and nothing is getting better, so they voted for the person who will flip the table. Yeah it's bad for them, but anything is better than the status quo. Hell I voted for Trump to be a dictator and actually go after the criminals. His first term was a failure. As soon as he got elected, it was oh I'm not gonna go after Hillary. Absolute weakness. And now we're almost a year into his second term and look what we see. Capitulation to Israel. No perp walks or arrests. Absolute weakness. Say what you want about Dems but they actually use power. They charged and arrested Trump's lawyers. They tried to kill Trump multiple times. They murdered Charlie Kirk. Until Trump actually does something, it's just more par for the course. permalink award report block reply knnbccb 5 points 6 days ago Better get used to food, water, electricity and medicine rationing. Reminder: Socialism = HIV positive Communism = full blown AIDS It's only a matter of time before the 'flower' blossoms. permalink award report block reply JoeCubicle 3 points 6 days ago They think they're hungry now... permalink award report block reply covefefe_energy 2 points 6 days ago They don't know what socialism is. They hear it as a trendy anti-MAGA, anti-rightwing label and go balls deep into supporting it on its name alone. permalink award report block reply SuperHonkey 2 points 6 days ago These people are terminally retarded permalink award report block reply monkadelic 2 points 6 days ago Every communist thinks their job will be designing uniforms, or head of public artwork etc.  They don't realize they will be doing hard labor and starving. permalink award report block reply PunishedSnek 2 points 6 days ago Does anyone feel this way ? permalink award report block reply 5854110203868847 2 points 6 days ago Uh, yes.  Every lefty clown who wants communism but also bitches about govt control/regulation Complete retardedness permalink parent award report block reply LostElf 1 points 6 days ago I know! Nobody, because you can't tell leftist retards anything. They are incapable of learning. It's rote or nothing. permalink award report block reply Threaper666 1 points 6 days ago Who the fuck do they think should control it? If it was up to me.  There would be no snap benefits. permalink award report block reply\n5DchessWatch 33 points 6 days ago They won't be happy until there's a daily ration of flamin' hot cheetos kibble dribbling out of a pipe in the wall in their assigned 5x10 vestibule permalink award report block reply 45fan 7 points 6 days ago \"Carl's Jr. believes that no child should go hungry. Your children have now been remanded into the custody of Carl's Jr!\" permalink parent award report block reply Jimmyprawns 1 points 6 days ago \"Carl's jr! Fuck you! I'm eating.\" permalink parent award report block reply\n45fan 7 points 6 days ago \"Carl's Jr. believes that no child should go hungry. Your children have now been remanded into the custody of Carl's Jr!\" permalink parent award report block reply Jimmyprawns 1 points 6 days ago \"Carl's jr! Fuck you! I'm eating.\" permalink parent award report block reply\nJimmyprawns 1 points 6 days ago \"Carl's jr! Fuck you! I'm eating.\" permalink parent award report block reply\n24601 25 points 6 days ago The SNAP anger is not really about food. It's about hair, fingernails, and drugs. permalink award report block reply CKIV 16 points 6 days ago I'm a PO and I JUST got off the phone with a lady that says the reason she's not paying her court fees is because her SNAP got cut. Which really means the public wasn't paying for her food, it was paying the literal (and figurative) penalty for her criminal behavior. permalink parent award report block reply SuperHonkey 6 points 6 days ago Welp, back to jail ya go Shaniqua permalink parent award report block reply Threaper666 7 points 6 days ago Because now they have to use their own money for Food. No extra money to spend on Extra sht. permalink parent award report block reply goatnuts 5 points 6 days ago Yup. Think about how it worked, being underprivileged and needy in the olden days. You went to your church, your community. They took care of you. But under that system, you have to face your people. If they know youre just a leech you won't get shit. Milking the federal bureaucracy comes with the benefit that theres no personal accountability to anyone. Now, you don't even need your community, in fact, you can even create a community of people just like you and nobody in it has to contribute! There are whole friend groups of baby mommas all together complaining about their snap and that their baby daddies ain't shit, right now. Entire communities gutted, strong ties replaced by paperwork, nobody with a sense of duty to their families and communities. But at least they get they hrrrrruh did and snecks for they kids. permalink parent award report block reply MySidesGoUp 2 points 6 days ago A women’s movement permalink parent award report block reply SuperHonkey 1 points 6 days ago This ☝🏻😕 permalink parent award report block reply\nCKIV 16 points 6 days ago I'm a PO and I JUST got off the phone with a lady that says the reason she's not paying her court fees is because her SNAP got cut. Which really means the public wasn't paying for her food, it was paying the literal (and figurative) penalty for her criminal behavior. permalink parent award report block reply SuperHonkey 6 points 6 days ago Welp, back to jail ya go Shaniqua permalink parent award report block reply\nSuperHonkey 6 points 6 days ago Welp, back to jail ya go Shaniqua permalink parent award report block reply\nThreaper666 7 points 6 days ago Because now they have to use their own money for Food. No extra money to spend on Extra sht. permalink parent award report block reply\ngoatnuts 5 points 6 days ago Yup. Think about how it worked, being underprivileged and needy in the olden days. You went to your church, your community. They took care of you. But under that system, you have to face your people. If they know youre just a leech you won't get shit. Milking the federal bureaucracy comes with the benefit that theres no personal accountability to anyone. Now, you don't even need your community, in fact, you can even create a community of people just like you and nobody in it has to contribute! There are whole friend groups of baby mommas all together complaining about their snap and that their baby daddies ain't shit, right now. Entire communities gutted, strong ties replaced by paperwork, nobody with a sense of duty to their families and communities. But at least they get they hrrrrruh did and snecks for they kids. permalink parent award report block reply\nMySidesGoUp 2 points 6 days ago A women’s movement permalink parent award report block reply\nSuperHonkey 1 points 6 days ago This ☝🏻😕 permalink parent award report block reply\nRizzlieDoodad 6 points 6 days ago They want a change. The average age of being a first time home buyer is 40. In 1990 it was under 30. People have been voting for years and nothing is getting better, so they voted for the person who will flip the table. Yeah it's bad for them, but anything is better than the status quo. Hell I voted for Trump to be a dictator and actually go after the criminals. His first term was a failure. As soon as he got elected, it was oh I'm not gonna go after Hillary. Absolute weakness. And now we're almost a year into his second term and look what we see. Capitulation to Israel. No perp walks or arrests. Absolute weakness. Say what you want about Dems but they actually use power. They charged and arrested Trump's lawyers. They tried to kill Trump multiple times. They murdered Charlie Kirk. Until Trump actually does something, it's just more par for the course. permalink award report block reply\nknnbccb 5 points 6 days ago Better get used to food, water, electricity and medicine rationing. Reminder: Socialism = HIV positive Communism = full blown AIDS It's only a matter of time before the 'flower' blossoms. permalink award report block reply\nJoeCubicle 3 points 6 days ago They think they're hungry now... permalink award report block reply\ncovefefe_energy 2 points 6 days ago They don't know what socialism is. They hear it as a trendy anti-MAGA, anti-rightwing label and go balls deep into supporting it on its name alone. permalink award report block reply\nSuperHonkey 2 points 6 days ago These people are terminally retarded permalink award report block reply\nmonkadelic 2 points 6 days ago Every communist thinks their job will be designing uniforms, or head of public artwork etc.  They don't realize they will be doing hard labor and starving. permalink award report block reply\nPunishedSnek 2 points 6 days ago Does anyone feel this way ? permalink award report block reply 5854110203868847 2 points 6 days ago Uh, yes.  Every lefty clown who wants communism but also bitches about govt control/regulation Complete retardedness permalink parent award report block reply\n5854110203868847 2 points 6 days ago Uh, yes.  Every lefty clown who wants communism but also bitches about govt control/regulation Complete retardedness permalink parent award report block reply\nLostElf 1 points 6 days ago I know! Nobody, because you can't tell leftist retards anything. They are incapable of learning. It's rote or nothing. permalink award report block reply\nThreaper666 1 points 6 days ago Who the fuck do they think should control it? If it was up to me.  There would be no snap benefits. permalink award report block reply",
  "fetched_at": "2025-11-12T23:16:50.840853Z"
}