{
  "id": "1ARK5BG34b",
  "url": "https://patriots.win/p/1ARK5BG34b/just-so-we-are-clear--if-a-forei/c",
  "content": "470 “Just so we are CLEAR — if a foreigner comes to your country and demands you accept their culture as your culture, or demands that you change your beliefs for their religious needs? That is NOT an immigrant!” That is an INVADER! 💯 posted 3 days ago by Capoditutticapi1 6 comments award share report block Eric Daugherty @EricLDaugh • 3d 🚨 He NAILED IT: “Just so we are CLEAR — if a foreigner comes to your country and demands you accept their culture as your culture, or demands that you change your beliefs for their religious needs? That is NOT an immigrant!” That is an INVADER! 💯\n6 comments Sort by Top Top New Worst Old Save perma-maga 7 points 3 days ago 100% permalink award report block reply PillarOfWisdom 4 points 3 days ago What's it called when jews do it? permalink award report block reply 1_Badcop 6 points 3 days ago Congress permalink parent award report block reply The_RedWolf 4 points 3 days ago World History? permalink parent award report block reply The_RedWolf 3 points 3 days ago I wouldn't go to Japan and get mad because people are going to a Shinto shrine. permalink award report block reply Protonboy 3 points 3 days ago Aaaaaand...anybody that helps them is a...traitor? Sounds about right. permalink award report block reply\nperma-maga 7 points 3 days ago 100% permalink award report block reply\nPillarOfWisdom 4 points 3 days ago What's it called when jews do it? permalink award report block reply 1_Badcop 6 points 3 days ago Congress permalink parent award report block reply The_RedWolf 4 points 3 days ago World History? permalink parent award report block reply\n1_Badcop 6 points 3 days ago Congress permalink parent award report block reply\nThe_RedWolf 4 points 3 days ago World History? permalink parent award report block reply\nThe_RedWolf 3 points 3 days ago I wouldn't go to Japan and get mad because people are going to a Shinto shrine. permalink award report block reply\nProtonboy 3 points 3 days ago Aaaaaand...anybody that helps them is a...traitor? Sounds about right. permalink award report block reply"
}