{
  "id": "1ARK53JYPf",
  "url": "https://patriots.win/p/1ARK53JYPf/x/c",
  "content": "398 🐋 posted 6 days ago by HappyFunBall 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save tholinz 8 points 6 days ago I wonder if the orcas are still doing this. It was probably because they found it fun. Or amusing. Or a good joke. And that's not me being facetious. Orcas murder things for fun. permalink award report block reply 1MonkeyJr 7 points 6 days ago That’s why they call them killer whales. permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago They have learned boats carry food.  That's all there is to it.  They have adapted.  Initially it was one specific pod of whales permalink parent award report block reply Liberats 1 points 5 days ago 'Scientists'  have also postulated it is play.\nBuy a bigger boat. permalink parent award report block reply punkalicious 5 points 6 days ago Heh, I saw a different version years ago on 4chan. \"Illegal migrants\" lol... sure, I guess that works too. permalink award report block reply patrioticwinning3 5 points 6 days ago So Orcas are smarter than humans, at least liberals :p permalink award report block reply GabeC1997 4 points 6 days ago Easy meal, simple as. permalink award report block reply TrumpWonByALandslide 3 points 6 days ago Orcas like tacos. permalink parent award report block reply we_won_the_war_jack 2 points 6 days ago I would suggest getting on more shitty boats that sink easily. permalink award report block reply\ntholinz 8 points 6 days ago I wonder if the orcas are still doing this. It was probably because they found it fun. Or amusing. Or a good joke. And that's not me being facetious. Orcas murder things for fun. permalink award report block reply 1MonkeyJr 7 points 6 days ago That’s why they call them killer whales. permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago They have learned boats carry food.  That's all there is to it.  They have adapted.  Initially it was one specific pod of whales permalink parent award report block reply Liberats 1 points 5 days ago 'Scientists'  have also postulated it is play.\nBuy a bigger boat. permalink parent award report block reply\n1MonkeyJr 7 points 6 days ago That’s why they call them killer whales. permalink parent award report block reply\nShitsbrokeyo 2 points 5 days ago They have learned boats carry food.  That's all there is to it.  They have adapted.  Initially it was one specific pod of whales permalink parent award report block reply\nLiberats 1 points 5 days ago 'Scientists'  have also postulated it is play.\nBuy a bigger boat. permalink parent award report block reply\npunkalicious 5 points 6 days ago Heh, I saw a different version years ago on 4chan. \"Illegal migrants\" lol... sure, I guess that works too. permalink award report block reply\npatrioticwinning3 5 points 6 days ago So Orcas are smarter than humans, at least liberals :p permalink award report block reply\nGabeC1997 4 points 6 days ago Easy meal, simple as. permalink award report block reply TrumpWonByALandslide 3 points 6 days ago Orcas like tacos. permalink parent award report block reply\nTrumpWonByALandslide 3 points 6 days ago Orcas like tacos. permalink parent award report block reply\nwe_won_the_war_jack 2 points 6 days ago I would suggest getting on more shitty boats that sink easily. permalink award report block reply",
  "fetched_at": "2025-11-12T20:42:06.944987Z"
}