{
  "id": "1ARK5BGapw",
  "url": "https://patriots.win/p/1ARK5BGapw/i-wonder-how-much-the-nfl-will-f/c",
  "content": "259 I wonder how much the NFL will fine them? GEOTUS posted 3 days ago by KilroyJCNJ 8 comments award share report block Libs of TikTok @libsoftiktok • 3d Lions players break out in the iconic Trump dance after scoring a touchdown while President Trump watches! THE PEOPLE LOVE PRESIDENT TRUMP EPIC 🇺🇸🇺🇸🇺🇸\n8 comments Sort by Top Top New Worst Old Save linereddit 13 points 3 days ago Still not over the anthem-kneeling, not even close. But this is good. permalink award report block reply KilroyJCNJ OP 1 points 2 days ago I haven’t watched in over a decade. permalink parent award report block reply xBigCoffinHunter 7 points 3 days ago I don’t watch anymore but that St Brown kid seems like good people. permalink award report block reply South_Florida_Guy 5 points 3 days ago Very solid Christian dude from a good family permalink parent award report block reply NeoDragoon 4 points 3 days ago Even better that the score was against the Commies. permalink award report block reply Lower 2 points 3 days ago Fagball. permalink award report block reply Mpower88 2 points 3 days ago one trillion dollars permalink award report block reply SurrenderFreeman 0 points 3 days ago or was he mocking him? permalink award report block reply\nlinereddit 13 points 3 days ago Still not over the anthem-kneeling, not even close. But this is good. permalink award report block reply KilroyJCNJ OP 1 points 2 days ago I haven’t watched in over a decade. permalink parent award report block reply\nKilroyJCNJ OP 1 points 2 days ago I haven’t watched in over a decade. permalink parent award report block reply\nxBigCoffinHunter 7 points 3 days ago I don’t watch anymore but that St Brown kid seems like good people. permalink award report block reply South_Florida_Guy 5 points 3 days ago Very solid Christian dude from a good family permalink parent award report block reply\nSouth_Florida_Guy 5 points 3 days ago Very solid Christian dude from a good family permalink parent award report block reply\nNeoDragoon 4 points 3 days ago Even better that the score was against the Commies. permalink award report block reply\nLower 2 points 3 days ago Fagball. permalink award report block reply\nMpower88 2 points 3 days ago one trillion dollars permalink award report block reply\nSurrenderFreeman 0 points 3 days ago or was he mocking him? permalink award report block reply",
  "fetched_at": "2025-11-12T20:56:40.397571Z"
}