{
  "id": "1ARK9nOFoe",
  "url": "https://patriots.win/p/1ARK9nOFoe/us-plans-a-500-million-base-near/c",
  "content": "14 US plans a $500 million base near Gaza border, Israeli sources say. According to Israeli officials, the planned US base would house several thousand troops tasked with maintaining the cease-fire between Israel and Hamas. (www.shomrim.news) posted 9 hours ago by Eruditio 10 comments award share report block Shomrim - Exclusive: The United States Plans to Establish a Large Military Base on the Gaza Border US plans a $500 million base near Gaza border, Israeli sources say. According to Israeli officials, the planned US base would house several thousand troops tasked with maintaining the cease-fire between Israel and Hamas; the move signals Washington’s deter... www.shomrim.news\n10 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow onesummerdream 7 points 9 hours ago 1983 Beirut, Lebanon all over again. permalink award report block reply Alpha_Lemming 3 points 9 hours ago Came here to make the same point. I was in boot camp at Parris Island when that happened. Shit got real, real fast. permalink parent award report block reply fforgotpasswordagain 1 points 8 hours ago That's the plan. Another october 7 false flag. permalink parent award report block reply Trooph-Hurts 5 points 9 hours ago That wasn’t the deal that I heard? permalink award report block reply roadrunner0 3 points 9 hours ago If true they will be a stationary target for all the Jihad groups in the are.. permalink award report block reply bill_in_texas 2 points 7 hours ago So, US soldiers as human shields, AGAIN.  I recall doing that to separate the Turks and the Kurds in Syria.  This is NOT what I voted for. permalink award report block reply rightoverthere 2 points 9 hours ago shomrim.news is the best news available. heavy duty investigative joirnalism stuff permalink award report block reply Herpawinski 2 points 9 hours ago To quote Reason Magazine: A great idea! With the best of intentions! What could POSSIBLY go wrong? permalink award report block reply Maganifice7 2 points 9 hours ago Fuck no. Trump has lost his mind. permalink award report block reply medicpatriot 1 points 8 hours ago Fuck you permalink award report block reply\nonesummerdream 7 points 9 hours ago 1983 Beirut, Lebanon all over again. permalink award report block reply Alpha_Lemming 3 points 9 hours ago Came here to make the same point. I was in boot camp at Parris Island when that happened. Shit got real, real fast. permalink parent award report block reply fforgotpasswordagain 1 points 8 hours ago That's the plan. Another october 7 false flag. permalink parent award report block reply\nAlpha_Lemming 3 points 9 hours ago Came here to make the same point. I was in boot camp at Parris Island when that happened. Shit got real, real fast. permalink parent award report block reply\nfforgotpasswordagain 1 points 8 hours ago That's the plan. Another october 7 false flag. permalink parent award report block reply\nTrooph-Hurts 5 points 9 hours ago That wasn’t the deal that I heard? permalink award report block reply\nroadrunner0 3 points 9 hours ago If true they will be a stationary target for all the Jihad groups in the are.. permalink award report block reply\nbill_in_texas 2 points 7 hours ago So, US soldiers as human shields, AGAIN.  I recall doing that to separate the Turks and the Kurds in Syria.  This is NOT what I voted for. permalink award report block reply\nrightoverthere 2 points 9 hours ago shomrim.news is the best news available. heavy duty investigative joirnalism stuff permalink award report block reply\nHerpawinski 2 points 9 hours ago To quote Reason Magazine: A great idea! With the best of intentions! What could POSSIBLY go wrong? permalink award report block reply\nMaganifice7 2 points 9 hours ago Fuck no. Trump has lost his mind. permalink award report block reply\nmedicpatriot 1 points 8 hours ago Fuck you permalink award report block reply",
  "fetched_at": "2025-11-12T23:28:34.241270Z"
}