{
  "id": "1ARK5A9qkA",
  "url": "https://patriots.win/p/1ARK5A9qkA/we-were-lied-to-about-food-no-yo/c",
  "content": "261 We were lied to about food?! No, you don't say. posted 3 days ago by MacGordon 85 comments award share download report block\n85 comments Sort by Top Top New Worst Old Save EastTexasMadLad 22 points 3 days ago I’d like to see you 3-4k calories of meat.  It would be an insane amount. 1000-1200 calories per pound of meat! permalink award report block reply Sodak 15 points 3 days ago Yeah I'm calling complete bullshit there are some meats with fats that'll add some calories but even then your eating like 10 burger parties and two packs of bacon every day. Switch to healthier meat that's like a whole fucking turkey everyday or 4 whole chickens. EVERYDAY bullshit. permalink parent award report block reply NeverInterruptEnemy 10 points 3 days ago 10,000% retard bullshit permalink parent award report block reply SanityGumby 9 points 3 days ago 4k calories of chicken is at least 10 chicken breasts. It might be more like 15. I doubt this guy is eating like 2-3 whole chickens a day. permalink parent award report block reply CucumberExtract 5 points 3 days ago It's not an insane amount if it's fatty. Do you think you could eat 2 single pound ribeye steaks over the course of a day? Congrats, you just hit 3k. permalink parent award report block reply NeverInterruptEnemy 0 points 3 days ago Stfu. 3000 calories of meat alone is 2-3 POUNDS of meat. permalink parent award report block reply CucumberExtract 4 points 3 days ago Stfu. 3000 calories of meat alone is 2-3 POUNDS of meat. Um.... yes... I said that. How much meat do you think is in 2 single pound ribeyes. 2x1lb = 2lb. So you're agreeing with me... permalink parent award report block reply MacGordon OP 1 points 3 days ago Easy mode. I JUST ate a bone in ribeye at Texas Roadhouse and half my wife's filet. permalink parent award report block reply MacGordon OP 4 points 3 days ago Bro, like it or not. I can eat 1500+ in one sitting. 4-5 flying dutchmen from In-n-out, or 2-2.5 low-carb baconators from Burger King. I'm 5'11\" 180. Hell, I just ate 6 eggs, 8 slices of bacon, 4 sausage links and half an avocado. Google puts that at 1550 cals. I said 3000-4000 per day, not in one sitting . permalink parent award report block reply you_know_GOAT 4 points 3 days ago You lost me at eating at In n Out and Burger King. Don't put that shit in your body. permalink parent award report block reply MacGordon OP 1 points 3 days ago Meat is meat. As long as it's cooked in its own fat or broiled, that's beef. When it's just the patty, cheese, maybe bacon on top, that's aint half bad if you're on the go. A la carte is the way to keep this simple and cheap. permalink parent award report block reply The_Bloofy_Bullshark 2 points 3 days ago Exactly, it’s pretty simple. Wife used to compete in women’s physique. Put back a few pounds of steak per day. Made me feel like a fat shit when she was maintaining blocky abs year round on that diet. permalink parent award report block reply MAGALADON9 1 points 3 days ago Ha we are the same size, but you have a half inch on me. Ya bastard.  To make things worse I have short arms, like it's a problem; on the up side at that height and weight i look bigger than if i had long reach. Short neck slightly thicker, with short arms but wide chest/back = appears big. permalink parent award report block reply Hantif 3 points 3 days ago Having been told to leave AYCE buffets before (and weighing less than 200# at 6'1\"), 3-4k calories is nothing. I love seafood and have had meals where the shrimp, crab, and fish added up to 5k. Beef and pork are good, eating a pound of bacon or ham at breakfast is simple. permalink parent award report block reply EastTexasMadLad 2 points 3 days ago He said all meat! permalink parent award report block reply Plots 2 points 3 days ago Fish isn't a vegetable…. permalink parent award report block reply MacGordon OP 2 points 3 days ago Can confirm. permalink parent award report block reply load 5 more comments... YodaBannon 6 points 3 days ago Atherosclerosis permalink award report block reply MacGordon OP 2 points 3 days ago https://www.youtube.com/watch?v=3cVo8fyEPdY https://www.youtube.com/watch?v=08gQrUAZSaE permalink parent award report block reply _Sully_ 6 points 3 days ago I could eat a ribeye every day. You know what, this settles it. I'm gonna eat a ribeye right now. permalink award report block reply MacGordon OP 6 points 3 days ago You son of uh...now I'M going to eat a ribeye tonight! permalink parent award report block reply MacGordon OP 4 points 3 days ago And I did, Texas Roadhouse; bone in. permalink parent award report block reply electricboogaloo 5 points 3 days ago You only eat meat cause… you don’t want insulin to spike? How many calories would you use if you went to the gym 0 times per week? permalink award report block reply lixa 4 points 3 days ago You burn a certain number of calories (a lot) just existing, without any exercise. \"Spiking insulin\" has a lot more to do with what you're eating than how often. And you miss plenty of nutrients on carnivore, esp all meat which is not the right way to even do carnivore. permalink award report block reply MacGordon OP 0 points 3 days ago If you're eating carbs/sugar/starch in your main meals & snacks, you're getting a large insulin response every time. 3-5 times per day. As for nutrient deficiencies, I have my blood labs drawn twice a year (for the past 3.5 years). Only thing I need to bump up is sodium. Vitamin C levels were perfect. When you don't eat the sugars, your body doesn't need a ton vitamin C, and it won't get flushed out of your system. All meat IS the only way to do carnivore. If you introduce vegetation, that's keto. If you are still eating carbs (a synonym of sugar), well, I guess that's just a standard American diet. It's working well for me and a few million here in the US, and the problems I was told when I was young about eating red meat are turning out to be false. I believe fatty ruminant meat to be the pentacle of appropriate human diets. permalink parent award report block reply lixa 1 points 3 days ago Eating carbs with a meal does not give you a \"large insulin response.\" That's just fake. Eating them with a meal of fat and fiber and protein slows the digestion of sugars resulting in less insulin. Potassium found in many carbs drives sugar out of the blood and into the cells for use. Eating too many carbs or carbs away from meals will spike insulin. It's not monolithic. There are also people with low blood sugar or adrenal dysregulation, delicate hormonal balance (women), who benefit from moderate carbs. This doesn't mean you drink juice or eat candy- but complex carbs and whole fruit are beneficial. Produce also has loads of micronutrients you are not getting from carnivore. Many people benefit from keto/carnivore at first and then end up with hormones that suffer because of it down the line. The paleo diet is closest to what we'd eat in the wild, or did eat when we were in the wild. But it's also not for everyone. By all meat I meant muscle tissue as opposed to also organs and cartilage, bone broth, and such. Those have nutrients you'd be missing with just meat. No animal that's carnivorous doesn't also eat the organs. Regular labs (vs functional medicine labs) include sick people in their ranges btw so it's not the best. It also doesn't show what's in the tissues. The body keeps the blood levels good first even if it has to draw from bone. permalink parent award report block reply MacGordon OP 1 points 2 days ago One single noodle, no. A whole American sized serving of carbs, yes...it does. There are no Randomized Control Trial studies proving how effective fiber is in blocking or slowing absorption of glucose, fructose, sucrose. Hell, humans can't even digest it properly and although the 10% factor of nutrients absorbed from fiber, more studies are placing that number at 3%-7%, and that fiber is nothing more than a bulking agent. Systemic review & metanalysis just don't cut it for me. What's moderate carbs, grams per day wise? The biggest myth on sugar is \"Fruit/whole grains is natural sugar and good for you\" and never realizing that all sugar is natural, whether you're eating it from the plant itself, or if a processing plant pulled it from the fruit, beet, cane, grain, etc. Our bodies don't care where it comes from. That's why when my diabetic family member eats an apple and later checks his blood glucose, it's elevated. Apples are full of that fun fiber stuff too. I do not know anyone in my circle, nor any evidence that proves Keto or Carnivore leads one to \"end up with hormones that suffer\", but can admit that one of my friends, a female, has improved her hormonal issues. Nutritionist Gary Brecka is using these diets to help women get pregnant. I think Paleo as well. Paleo is fine, and I fault no one on how they choose to eat. It's not for me. Fiber leads to gastric distress in my system, and Paleo is too lean meat based for my taste. I'm looking to be satiated, and paleo doesn't do it for me. There are no nutrients in plants that I'm not already getting from eating all meat types. It's a common misconception that carnivore will lead to such things as scurvy, but again, that's not happening to the few million of Americans practicing this way of living. Our bodies require less vitamin C, with what little is in meat, and not eating carbs that strip it out, seems to be working quite well. Agree on the \"all meat\" or as we like to refer to it as 'eating nose to tail'. I appreciate the friendly discourse vs all the carb addicts chimping out on me labeling me a \"retard\". Cheers!! permalink parent award report block reply lixa 1 points 2 days ago I won't call you a retard as long as you are civil and not acting like one ;) But thanks I appreciate it too. There is a happy medium between a single noodle and 5 cups of pasta that many people eat. I don't see why anyone would fund a trial to prove fiber slows glucose, but those with blood sugar issues in either direction can attest. Just bec there isn't such a study doesn't make it not true. I happen to have low blood sugar and low Ha1c and don't do well with low carb, but if I say, drink juice on an empty stomach I can feel it and get in trouble pretty easily. If I eat carbs on top of fiber, and esp fat and protein, I have an entirely diff experience. People can take their blood sugar and see the effect in real time, so you don't need a study to show what everyone can see by experience. Fiber isn't meant to be absorbed as a nutrient, it is meant to help cleanse the digestive tract and act as a detoxing agent, and also prebiotic fiber feeds probiotics in your gut which is important. We are not pure carnivores like cats, but we are omnivorous, in the opposite way to monkeys- they need more plants and less meat, we need more meat and less plants, but we still need plants. Our digestive system ratio is opposite as well in terms of size of small intestine to large intestine. Where are you getting all the phytonutrients from like carotenoids, antioxidants, and such? Enough Folate? K? E? Potassium? Magnesium? Iodine? C? Calcium? And don't say you take a supplement, bec that means it's not a natural diet. Talk to registered dietitians who have to see people after their hormones suffer. They understand that eating no carb can lead to issues with adrenal dysregulation and in turn make sex hormones suffer. I know of many such women. I think some of the positive effect you see in hormones is if bec people are removing gluten and soy and many processed foods when they go carnivore, not because produce is bad for you. This is confusing the issue. If fiber leads to distress you prob have some dysbiosis, that isn't normal. Doesn't mean fiber is bad bec your system has something amiss in it that leads to it digesting poorly- I eat plenty of fiber and have zero gas or digestive issues from it. My mom btw has trouble digesting meat- doesn't mean meat is bad, it means something in her particular system is off to result in the issue (prob enzymes, low stomach acid). Btw Paleo doesn't have to be lean, you can include as much fat on it as you want, done right it should have way more fat than carbs, but still include tubers and fruit. In any case, diets aren't OSFA, so do what works for you but once we get into recommending things for other people we should be aware of the possible pitfalls that it can have. Paleo turned out not to be for me bec it was too much iron and too low carb. It actually made me sicker in an effort to use diet to heal health issues. I'm still fine tuning my diet, but I've also found my needs are ever evolving- the diet that worked for me a year ago needs something different now, so I adjust. permalink parent award report block reply view 1 more comments... NotYourMan 3 points 3 days ago Insulin resistance is the killer. permalink award report block reply MAGALADON9 1 points 3 days ago Yeah my brother in law got the bad news but can't do the extreme \"reset\" needed to restart his insulin sensitivity.  He has a small window where he does this basically starvation diet for 6 months or so and is strict on the blood levels - carnivore or at least <15g carbs per day keto. I've found it's easier for me to fast totally than have a small amount. This was confirmed in the late 40s and 50s in starvation studies. Given a small amount of food made the men ravenous, food plagued their every thought.  The first 16-34 hours can be rough but after that switch happens your body is flooded with growth hormone and other feel good chemicals in a desperate attempt to calm you from the starvation it thinks you are unintentionally dealing with.  After 48hr I feel \"high\" i mean... it's crazy i laugh at how.much time i waste thinking and preparing food, I have no hunger unless I think hard about it after that I can go much longer.  My top is 15 days nothing but a vitamin and a pinch of salt substitute (potassium chloride and sodium chloride,  and half a magnesium tab.) And that's it. I see movies where people are lost and start eating moss and grass only to vomit and have diarrhea or poor bastards eating their dead soccer chums. I KNOW I can walk out of the wilderness or a plane crash I just need water. permalink parent award report block reply MacGordon OP 0 points 3 days ago Too right. It's unfortunate that it took this many decades for this to be known, but more & more are starting to realize this. permalink parent award report block reply justicein2020 3 points 3 days ago Not to argue the point.  but \"calories\" is an estimate. a rough estimate. based on guesses and ancient data. You know how we figure out calories? We take a lump of the food and set it on fire. Not exactly precision. permalink award report block reply NeverInterruptEnemy 7 points 3 days ago It’s actually super precision. But ok, weird comment. permalink parent award report block reply SanityGumby 3 points 3 days ago It's almost like it's because you are burning calories by just existing and if you do exercise that much you likely have a higher resting metabolism due to large muscle density. Ignoring the fact those things are not accurate measures of calories burned. permalink award report block reply facesmelt 3 points 3 days ago Dear lord, you’re a grown man and can’t understand BASIC physics? Embarrassing… Just as embarrassingly dumb as believing the Earth is flat. permalink award report block reply Plots 1 points 3 days ago You sound like Fauci telling me to trust the science.\nWhen it turns out that the human body isn't a candle physically burning food and you are as dumb as a climate “scientist” pretending that the earth is a closed environment and therefore CO2 is a problem. permalink parent award report block reply MacGordon OP 0 points 3 days ago You might strike a nerve. lol I'm still trying to understand BASIC physics of lighting food on fire in a metal canister and how that relates to my human digestive system. As I posted on X: I tried to follow the science, but it wasn't there. I then followed the money. That's where I found the science. permalink parent award report block reply facesmelt 0 points 3 days ago I’m still trying to understand BASIC physics Yeah… We can tell! LMAO RETARD permalink parent award report block reply MacGordon OP 0 points 2 days ago Half a quote.\nHalf a truth.\nHalf brained.\nSmooth. permalink parent award report block reply view 4 more comments... 26magarat 2 points 3 days ago Sadly, a lot of women base their self-worth on a number on a scale. Even though your weight varies over just 24 hours. Does that mean you're a \"better\" person in the morning if your weight is a few pounds less than it might be at night? My scale and the doctor's scale never matched. Also to save time, they always weigh me with my clothes and shoes on which is really dumb. permalink award report block reply HobisterCavinboub 2 points 3 days ago Health TIp:  Loose the cell/watch.  And, maybe stop counting things. permalink award report block reply Watermelons 2 points 3 days ago I don't carry it in a holster.  How am I supposed to loose it? permalink parent award report block reply MacGordon OP 1 points 3 days ago You know, I'm completely on your side with this. I no longer use calories to any extent. When you eliminate the foods that were making me fat, it no longer made any sense. Eating just animal fats & proteins, just eat until you're full. Rinse/Repeat permalink parent award report block reply InternationalSpy007 2 points 3 days ago I’m not carnivore, but I am keto and it’s the most important health decision I ever made. After about a year of keto, I added a few MAHA elements, such as removing most artificial ingredients, no seed oil oils, and making sure my fat came primarily from meats, avocado, or olive oil. I avoid most sweeteners, except for a little bit of Stevia, which I allow myself in my coffee, which I also add whole cream and butter to. Almost no carbs, although I do allow myself to have green vegetables, cheeses, probiotics, like sauerkraut, as well as a variety of seafood (eggs, and lots of meat, too). Anyway, once I got used to the idea that I didn’t have to have things like bread, rice, and potatoes with every meal… It’s been the easiest diet of my life. And because a high fat/low carb diet keeps you full for hours I can go between meals for much longer, not even a desire to snack at all. My blood sugar is super stable, I have more energy, I’ve lost the extra weight I was carrying around,and by nearly every metric I feel better. Anyway, do your own research, but if you’re looking to make a change, keto is super satisfying and once you get the hang of it so easy to do. Honestly, high fat meats aren’t the problem. It’s just that a high fat diet and carbohydrates is the problem (the high fat/high carb diet people are the ones with the most serioushealth problems).\nThe establishment medical “experts” blame it on the meat, but it’s not the meat, it’s the meat AND high carb combination that’s deadly. Basically, if you wanna lose weight and be healthy, you can eat all a lot of of meat and a lot of fat, but you just can’t eat many carbs if you’re doing that. Another option, which I don’t do is, you can eat lots of healthy carbs, but avoid almost all fat. This will allow you to lose weight, too.. although the insulin highs and lows will still cause you to crave food every hour or two throughout the day. But a calorie restricted high carb/low fat diet does technically allow you to lose weight.\nIt’s just not the way I want to do it. permalink award report block reply MacGordon OP 4 points 3 days ago I don't know why you got down voted, but what you're saying is good stuff. There's a ton of carb addicts on this site and I've learned they do NOT like it when there's even mention of carb restriction health benefits. I too started off on keto back in Jan of 2022. Heck, I really didn't even know what I was doing, so I labeled it \"dirty keto\". Still lost weight. I refined my way of eating after a good amount of research. I experienced all the same things as you. Oct of '22, I made the change to just meat. I eat a ton of beef, eggs, bacon, hot dogs, burger patties, hard cheeses, and I try for the fattier cuts as they are the most flavorful & satiating. This move came when I found that vegetables with moderate to high fiber was wrecking my system, causing all kinds of digestive tract pain. I agree that losing weight by starving yourself is never a 'preferred' method. :-) permalink parent award report block reply Muttsbitetoo 2 points 3 days ago Hypertrophy changes everything permalink award report block reply BaronFalcon 1 points 3 days ago Hes not wrong about sugar. I eliminated sugar 4 months ago. Lifelong hypoglycemic, gone. brain fog, gone. energy through the roof. Went from 20% BF to 12% in 3 months. Lifting and cardio 6 days a week. Processed food and sugar are literal toxins that cause liver damage, alzheimers. parkinsons, and a host of other issues. sugar destroys gut bacteria. alzheimers is being called type 3 diabetes.  Stop eating processed food and sugar they're killing us with it. permalink award report block reply MAGALADON9 0 points 3 days ago I do right now a keto diet but also 20/4 I.F. If the world ever ends I'm fucked. I'll be eating like 27 squirrels permalink award report block reply CucumberExtract -1 points 3 days ago For people who will try to argue \"but physics\".  Humans are not closed systems. Matter = Energy (w/ conversion rate) Sweat = matter Skin cycling = matter Hair = matter Piss = matter Shit = matter Nails = matter Muscle repair = matter Standard cell shedding/replacement = matter etc permalink award report block reply MacGordon OP -3 points 3 days ago Calories in - Calories out is bullshit. Humans are the only mammals that intentionally starve themselves in the name of \"health\", and then get confused why it nearly always fails. Eat less, workout, get even more hungry, then try to keep from eating again. Crazy. Just eat the foods that not only nourish but satiate. Meat. permalink award report block reply Zskills 11 points 3 days ago CICO is not \"BS\".  It's physics. Calories consumed - BMR - add'l Calories burned = net calories for the day. If this number is chronically negative you will lose weight.  I go through cycles of bulking and cutting to pack on muscle and trim fat, intentionally gaining and losing weight with precision. permalink parent award report block reply Watermelons 3 points 3 days ago Anyone spouting the nonsense of CICO not being correct has no concept of energy systems nor statistics. You can't reliably measure the calories out (work done by the system and waste). All the watch does is do some sort of value based on a model.  It's a decent starting point, but your bodyweight is what determines how to adjust your diet. permalink parent award report block reply Zskills 3 points 3 days ago Oh I don't trust those watches at all.  They have absolutely no idea. What I do is a best estimate of my caloric needs based on lean mass, BF%, and activity level.   Shave off a few hundred, and then stick to it and see what happens. After about a month of monitoring I have a very good idea of what exactly it should be and how much to continue to taper in order to continue to trim fat while retaining as much muscle as possible. I shoot for about 500 kcal initial  deficit to kick off the cut at about 1 lb lost per week, then continue to reduce as the fat comes off and my BMR drops with it. permalink parent award report block reply Watermelons 3 points 3 days ago Yeah.  It's pretty basic.   You start at a point, monitor, and adjust as you go along.  If anyone is spouting the stuff the guy in the tweet said, I just assume they're selling something. permalink parent award report block reply Surfsup 2 points 3 days ago Yes but not the right weight. permalink parent award report block reply Zskills 1 points 3 days ago I'm not sure what you mean? permalink parent award report block reply Surfsup 1 points 3 days ago You'll lose muscle while gaining fat. permalink parent award report block reply view 3 more comments... MacGordon OP 1 points 3 days ago Firstly, my body does not light my food on fire in my digestive organs. I also will repeat, starving yourself to lose weight is a recipe for disaster. But frankly, if you're bulking & cutting, you are getting fat while trying to put on more muscle, only for you to later 'cut' that fat, and I also believe this to be insufficient method. But it gets worse, as there are more studies showing this up and down practice leading to greater cardiac issues. What are yo cutting, and how does it get there? thinking emoji permalink parent award report block reply Zskills 2 points 3 days ago But frankly, if you're bulking & cutting, you are getting fat while trying to put on more muscle, only for you to later 'cut' that fat Yes, correct.   It is very difficult to add muscle without some fat as well. studies showing this up and down practice leading to greater cardiac issues Yeah.  I've heard that that.  Never looked into it, perhaps I will. What are yo cutting, and how does it get there? Mostly fat, and some muscle.  It got there via caloric surplus and progressive overload, respectively. permalink parent award report block reply MacGordon OP 2 points 2 days ago I appreciate you being up front with your response. Give my friend (I wish) Max German a listen. He's carnivore, he lifts, and he scientifically breaks down everything he studies. https://www.youtube.com/watch?v=f61etz8bPlw permalink parent award report block reply view 1 more comments... CucumberExtract -2 points 3 days ago As I said here: https://patriots.win/p/1ARK5A9qkA/x/c/4eXu1qsyynh For people who will try to argue \"but physics\". Humans are not closed systems. Matter = Energy (w/ conversion rate) Sweat = matter Skin cycling = matter Hair = matter Piss = matter Shit = matter Nails = matter Muscle repair = matter Standard cell shedding/replacement = matter etc All of those things are calories out. The amount of resistance something this basic in logic gets means we're really poking at somebody's cash cow with this. permalink parent award report block reply Zskills 3 points 3 days ago Everything you listed is under BMR permalink parent award report block reply CucumberExtract 1 points 3 days ago Everything? Including excrement which can vary greatly based on what you eat and when? That kinda makes BMR sound like quackery doesn't it, so more likely everything I said is not part of that. permalink parent award report block reply NeverInterruptEnemy -1 points 3 days ago You’re a fucking moron bro. permalink parent award report block reply SalteenCracker -4 points 3 days ago Some faggot mod banned me from the reddit The_Donald because I said counting calories in/out was worthless. Some people stick to bullshit \"science\" no matter how bad it makes them stink. Even here. permalink award report block reply MacGordon OP -5 points 3 days ago I got banned from saying the same in r/keto. permalink parent award report block reply NeverInterruptEnemy 2 points 3 days ago You’re both morons and those sound like bullshit but if they were real would be justified permalink parent award report block reply MacGordon OP -1 points 3 days ago I'm fully willing to pull a screen-grab so that I can come back and call you a retard. That is, if you're willing to accept the moniker. permalink parent award report block reply NeverInterruptEnemy 1 points 3 days ago Where do you think you are right now? permalink parent award report block reply view 1 more comments...\nEastTexasMadLad 22 points 3 days ago I’d like to see you 3-4k calories of meat.  It would be an insane amount. 1000-1200 calories per pound of meat! permalink award report block reply Sodak 15 points 3 days ago Yeah I'm calling complete bullshit there are some meats with fats that'll add some calories but even then your eating like 10 burger parties and two packs of bacon every day. Switch to healthier meat that's like a whole fucking turkey everyday or 4 whole chickens. EVERYDAY bullshit. permalink parent award report block reply NeverInterruptEnemy 10 points 3 days ago 10,000% retard bullshit permalink parent award report block reply SanityGumby 9 points 3 days ago 4k calories of chicken is at least 10 chicken breasts. It might be more like 15. I doubt this guy is eating like 2-3 whole chickens a day. permalink parent award report block reply CucumberExtract 5 points 3 days ago It's not an insane amount if it's fatty. Do you think you could eat 2 single pound ribeye steaks over the course of a day? Congrats, you just hit 3k. permalink parent award report block reply NeverInterruptEnemy 0 points 3 days ago Stfu. 3000 calories of meat alone is 2-3 POUNDS of meat. permalink parent award report block reply CucumberExtract 4 points 3 days ago Stfu. 3000 calories of meat alone is 2-3 POUNDS of meat. Um.... yes... I said that. How much meat do you think is in 2 single pound ribeyes. 2x1lb = 2lb. So you're agreeing with me... permalink parent award report block reply MacGordon OP 1 points 3 days ago Easy mode. I JUST ate a bone in ribeye at Texas Roadhouse and half my wife's filet. permalink parent award report block reply MacGordon OP 4 points 3 days ago Bro, like it or not. I can eat 1500+ in one sitting. 4-5 flying dutchmen from In-n-out, or 2-2.5 low-carb baconators from Burger King. I'm 5'11\" 180. Hell, I just ate 6 eggs, 8 slices of bacon, 4 sausage links and half an avocado. Google puts that at 1550 cals. I said 3000-4000 per day, not in one sitting . permalink parent award report block reply you_know_GOAT 4 points 3 days ago You lost me at eating at In n Out and Burger King. Don't put that shit in your body. permalink parent award report block reply MacGordon OP 1 points 3 days ago Meat is meat. As long as it's cooked in its own fat or broiled, that's beef. When it's just the patty, cheese, maybe bacon on top, that's aint half bad if you're on the go. A la carte is the way to keep this simple and cheap. permalink parent award report block reply The_Bloofy_Bullshark 2 points 3 days ago Exactly, it’s pretty simple. Wife used to compete in women’s physique. Put back a few pounds of steak per day. Made me feel like a fat shit when she was maintaining blocky abs year round on that diet. permalink parent award report block reply MAGALADON9 1 points 3 days ago Ha we are the same size, but you have a half inch on me. Ya bastard.  To make things worse I have short arms, like it's a problem; on the up side at that height and weight i look bigger than if i had long reach. Short neck slightly thicker, with short arms but wide chest/back = appears big. permalink parent award report block reply Hantif 3 points 3 days ago Having been told to leave AYCE buffets before (and weighing less than 200# at 6'1\"), 3-4k calories is nothing. I love seafood and have had meals where the shrimp, crab, and fish added up to 5k. Beef and pork are good, eating a pound of bacon or ham at breakfast is simple. permalink parent award report block reply EastTexasMadLad 2 points 3 days ago He said all meat! permalink parent award report block reply Plots 2 points 3 days ago Fish isn't a vegetable…. permalink parent award report block reply MacGordon OP 2 points 3 days ago Can confirm. permalink parent award report block reply load 5 more comments...\nSodak 15 points 3 days ago Yeah I'm calling complete bullshit there are some meats with fats that'll add some calories but even then your eating like 10 burger parties and two packs of bacon every day. Switch to healthier meat that's like a whole fucking turkey everyday or 4 whole chickens. EVERYDAY bullshit. permalink parent award report block reply NeverInterruptEnemy 10 points 3 days ago 10,000% retard bullshit permalink parent award report block reply\nNeverInterruptEnemy 10 points 3 days ago 10,000% retard bullshit permalink parent award report block reply\nSanityGumby 9 points 3 days ago 4k calories of chicken is at least 10 chicken breasts. It might be more like 15. I doubt this guy is eating like 2-3 whole chickens a day. permalink parent award report block reply\nCucumberExtract 5 points 3 days ago It's not an insane amount if it's fatty. Do you think you could eat 2 single pound ribeye steaks over the course of a day? Congrats, you just hit 3k. permalink parent award report block reply NeverInterruptEnemy 0 points 3 days ago Stfu. 3000 calories of meat alone is 2-3 POUNDS of meat. permalink parent award report block reply CucumberExtract 4 points 3 days ago Stfu. 3000 calories of meat alone is 2-3 POUNDS of meat. Um.... yes... I said that. How much meat do you think is in 2 single pound ribeyes. 2x1lb = 2lb. So you're agreeing with me... permalink parent award report block reply MacGordon OP 1 points 3 days ago Easy mode. I JUST ate a bone in ribeye at Texas Roadhouse and half my wife's filet. permalink parent award report block reply\nNeverInterruptEnemy 0 points 3 days ago Stfu. 3000 calories of meat alone is 2-3 POUNDS of meat. permalink parent award report block reply CucumberExtract 4 points 3 days ago Stfu. 3000 calories of meat alone is 2-3 POUNDS of meat. Um.... yes... I said that. How much meat do you think is in 2 single pound ribeyes. 2x1lb = 2lb. So you're agreeing with me... permalink parent award report block reply MacGordon OP 1 points 3 days ago Easy mode. I JUST ate a bone in ribeye at Texas Roadhouse and half my wife's filet. permalink parent award report block reply\nCucumberExtract 4 points 3 days ago Stfu. 3000 calories of meat alone is 2-3 POUNDS of meat. Um.... yes... I said that. How much meat do you think is in 2 single pound ribeyes. 2x1lb = 2lb. So you're agreeing with me... permalink parent award report block reply MacGordon OP 1 points 3 days ago Easy mode. I JUST ate a bone in ribeye at Texas Roadhouse and half my wife's filet. permalink parent award report block reply\nMacGordon OP 1 points 3 days ago Easy mode. I JUST ate a bone in ribeye at Texas Roadhouse and half my wife's filet. permalink parent award report block reply\nMacGordon OP 4 points 3 days ago Bro, like it or not. I can eat 1500+ in one sitting. 4-5 flying dutchmen from In-n-out, or 2-2.5 low-carb baconators from Burger King. I'm 5'11\" 180. Hell, I just ate 6 eggs, 8 slices of bacon, 4 sausage links and half an avocado. Google puts that at 1550 cals. I said 3000-4000 per day, not in one sitting . permalink parent award report block reply you_know_GOAT 4 points 3 days ago You lost me at eating at In n Out and Burger King. Don't put that shit in your body. permalink parent award report block reply MacGordon OP 1 points 3 days ago Meat is meat. As long as it's cooked in its own fat or broiled, that's beef. When it's just the patty, cheese, maybe bacon on top, that's aint half bad if you're on the go. A la carte is the way to keep this simple and cheap. permalink parent award report block reply The_Bloofy_Bullshark 2 points 3 days ago Exactly, it’s pretty simple. Wife used to compete in women’s physique. Put back a few pounds of steak per day. Made me feel like a fat shit when she was maintaining blocky abs year round on that diet. permalink parent award report block reply MAGALADON9 1 points 3 days ago Ha we are the same size, but you have a half inch on me. Ya bastard.  To make things worse I have short arms, like it's a problem; on the up side at that height and weight i look bigger than if i had long reach. Short neck slightly thicker, with short arms but wide chest/back = appears big. permalink parent award report block reply\nyou_know_GOAT 4 points 3 days ago You lost me at eating at In n Out and Burger King. Don't put that shit in your body. permalink parent award report block reply MacGordon OP 1 points 3 days ago Meat is meat. As long as it's cooked in its own fat or broiled, that's beef. When it's just the patty, cheese, maybe bacon on top, that's aint half bad if you're on the go. A la carte is the way to keep this simple and cheap. permalink parent award report block reply\nMacGordon OP 1 points 3 days ago Meat is meat. As long as it's cooked in its own fat or broiled, that's beef. When it's just the patty, cheese, maybe bacon on top, that's aint half bad if you're on the go. A la carte is the way to keep this simple and cheap. permalink parent award report block reply\nThe_Bloofy_Bullshark 2 points 3 days ago Exactly, it’s pretty simple. Wife used to compete in women’s physique. Put back a few pounds of steak per day. Made me feel like a fat shit when she was maintaining blocky abs year round on that diet. permalink parent award report block reply\nMAGALADON9 1 points 3 days ago Ha we are the same size, but you have a half inch on me. Ya bastard.  To make things worse I have short arms, like it's a problem; on the up side at that height and weight i look bigger than if i had long reach. Short neck slightly thicker, with short arms but wide chest/back = appears big. permalink parent award report block reply\nHantif 3 points 3 days ago Having been told to leave AYCE buffets before (and weighing less than 200# at 6'1\"), 3-4k calories is nothing. I love seafood and have had meals where the shrimp, crab, and fish added up to 5k. Beef and pork are good, eating a pound of bacon or ham at breakfast is simple. permalink parent award report block reply EastTexasMadLad 2 points 3 days ago He said all meat! permalink parent award report block reply Plots 2 points 3 days ago Fish isn't a vegetable…. permalink parent award report block reply MacGordon OP 2 points 3 days ago Can confirm. permalink parent award report block reply\nEastTexasMadLad 2 points 3 days ago He said all meat! permalink parent award report block reply Plots 2 points 3 days ago Fish isn't a vegetable…. permalink parent award report block reply MacGordon OP 2 points 3 days ago Can confirm. permalink parent award report block reply\nPlots 2 points 3 days ago Fish isn't a vegetable…. permalink parent award report block reply MacGordon OP 2 points 3 days ago Can confirm. permalink parent award report block reply\nMacGordon OP 2 points 3 days ago Can confirm. permalink parent award report block reply\nYodaBannon 6 points 3 days ago Atherosclerosis permalink award report block reply MacGordon OP 2 points 3 days ago https://www.youtube.com/watch?v=3cVo8fyEPdY https://www.youtube.com/watch?v=08gQrUAZSaE permalink parent award report block reply\nMacGordon OP 2 points 3 days ago https://www.youtube.com/watch?v=3cVo8fyEPdY https://www.youtube.com/watch?v=08gQrUAZSaE permalink parent award report block reply\n_Sully_ 6 points 3 days ago I could eat a ribeye every day. You know what, this settles it. I'm gonna eat a ribeye right now. permalink award report block reply MacGordon OP 6 points 3 days ago You son of uh...now I'M going to eat a ribeye tonight! permalink parent award report block reply MacGordon OP 4 points 3 days ago And I did, Texas Roadhouse; bone in. permalink parent award report block reply\nMacGordon OP 6 points 3 days ago You son of uh...now I'M going to eat a ribeye tonight! permalink parent award report block reply MacGordon OP 4 points 3 days ago And I did, Texas Roadhouse; bone in. permalink parent award report block reply\nMacGordon OP 4 points 3 days ago And I did, Texas Roadhouse; bone in. permalink parent award report block reply\nelectricboogaloo 5 points 3 days ago You only eat meat cause… you don’t want insulin to spike? How many calories would you use if you went to the gym 0 times per week? permalink award report block reply\nlixa 4 points 3 days ago You burn a certain number of calories (a lot) just existing, without any exercise. \"Spiking insulin\" has a lot more to do with what you're eating than how often. And you miss plenty of nutrients on carnivore, esp all meat which is not the right way to even do carnivore. permalink award report block reply MacGordon OP 0 points 3 days ago If you're eating carbs/sugar/starch in your main meals & snacks, you're getting a large insulin response every time. 3-5 times per day. As for nutrient deficiencies, I have my blood labs drawn twice a year (for the past 3.5 years). Only thing I need to bump up is sodium. Vitamin C levels were perfect. When you don't eat the sugars, your body doesn't need a ton vitamin C, and it won't get flushed out of your system. All meat IS the only way to do carnivore. If you introduce vegetation, that's keto. If you are still eating carbs (a synonym of sugar), well, I guess that's just a standard American diet. It's working well for me and a few million here in the US, and the problems I was told when I was young about eating red meat are turning out to be false. I believe fatty ruminant meat to be the pentacle of appropriate human diets. permalink parent award report block reply lixa 1 points 3 days ago Eating carbs with a meal does not give you a \"large insulin response.\" That's just fake. Eating them with a meal of fat and fiber and protein slows the digestion of sugars resulting in less insulin. Potassium found in many carbs drives sugar out of the blood and into the cells for use. Eating too many carbs or carbs away from meals will spike insulin. It's not monolithic. There are also people with low blood sugar or adrenal dysregulation, delicate hormonal balance (women), who benefit from moderate carbs. This doesn't mean you drink juice or eat candy- but complex carbs and whole fruit are beneficial. Produce also has loads of micronutrients you are not getting from carnivore. Many people benefit from keto/carnivore at first and then end up with hormones that suffer because of it down the line. The paleo diet is closest to what we'd eat in the wild, or did eat when we were in the wild. But it's also not for everyone. By all meat I meant muscle tissue as opposed to also organs and cartilage, bone broth, and such. Those have nutrients you'd be missing with just meat. No animal that's carnivorous doesn't also eat the organs. Regular labs (vs functional medicine labs) include sick people in their ranges btw so it's not the best. It also doesn't show what's in the tissues. The body keeps the blood levels good first even if it has to draw from bone. permalink parent award report block reply MacGordon OP 1 points 2 days ago One single noodle, no. A whole American sized serving of carbs, yes...it does. There are no Randomized Control Trial studies proving how effective fiber is in blocking or slowing absorption of glucose, fructose, sucrose. Hell, humans can't even digest it properly and although the 10% factor of nutrients absorbed from fiber, more studies are placing that number at 3%-7%, and that fiber is nothing more than a bulking agent. Systemic review & metanalysis just don't cut it for me. What's moderate carbs, grams per day wise? The biggest myth on sugar is \"Fruit/whole grains is natural sugar and good for you\" and never realizing that all sugar is natural, whether you're eating it from the plant itself, or if a processing plant pulled it from the fruit, beet, cane, grain, etc. Our bodies don't care where it comes from. That's why when my diabetic family member eats an apple and later checks his blood glucose, it's elevated. Apples are full of that fun fiber stuff too. I do not know anyone in my circle, nor any evidence that proves Keto or Carnivore leads one to \"end up with hormones that suffer\", but can admit that one of my friends, a female, has improved her hormonal issues. Nutritionist Gary Brecka is using these diets to help women get pregnant. I think Paleo as well. Paleo is fine, and I fault no one on how they choose to eat. It's not for me. Fiber leads to gastric distress in my system, and Paleo is too lean meat based for my taste. I'm looking to be satiated, and paleo doesn't do it for me. There are no nutrients in plants that I'm not already getting from eating all meat types. It's a common misconception that carnivore will lead to such things as scurvy, but again, that's not happening to the few million of Americans practicing this way of living. Our bodies require less vitamin C, with what little is in meat, and not eating carbs that strip it out, seems to be working quite well. Agree on the \"all meat\" or as we like to refer to it as 'eating nose to tail'. I appreciate the friendly discourse vs all the carb addicts chimping out on me labeling me a \"retard\". Cheers!! permalink parent award report block reply lixa 1 points 2 days ago I won't call you a retard as long as you are civil and not acting like one ;) But thanks I appreciate it too. There is a happy medium between a single noodle and 5 cups of pasta that many people eat. I don't see why anyone would fund a trial to prove fiber slows glucose, but those with blood sugar issues in either direction can attest. Just bec there isn't such a study doesn't make it not true. I happen to have low blood sugar and low Ha1c and don't do well with low carb, but if I say, drink juice on an empty stomach I can feel it and get in trouble pretty easily. If I eat carbs on top of fiber, and esp fat and protein, I have an entirely diff experience. People can take their blood sugar and see the effect in real time, so you don't need a study to show what everyone can see by experience. Fiber isn't meant to be absorbed as a nutrient, it is meant to help cleanse the digestive tract and act as a detoxing agent, and also prebiotic fiber feeds probiotics in your gut which is important. We are not pure carnivores like cats, but we are omnivorous, in the opposite way to monkeys- they need more plants and less meat, we need more meat and less plants, but we still need plants. Our digestive system ratio is opposite as well in terms of size of small intestine to large intestine. Where are you getting all the phytonutrients from like carotenoids, antioxidants, and such? Enough Folate? K? E? Potassium? Magnesium? Iodine? C? Calcium? And don't say you take a supplement, bec that means it's not a natural diet. Talk to registered dietitians who have to see people after their hormones suffer. They understand that eating no carb can lead to issues with adrenal dysregulation and in turn make sex hormones suffer. I know of many such women. I think some of the positive effect you see in hormones is if bec people are removing gluten and soy and many processed foods when they go carnivore, not because produce is bad for you. This is confusing the issue. If fiber leads to distress you prob have some dysbiosis, that isn't normal. Doesn't mean fiber is bad bec your system has something amiss in it that leads to it digesting poorly- I eat plenty of fiber and have zero gas or digestive issues from it. My mom btw has trouble digesting meat- doesn't mean meat is bad, it means something in her particular system is off to result in the issue (prob enzymes, low stomach acid). Btw Paleo doesn't have to be lean, you can include as much fat on it as you want, done right it should have way more fat than carbs, but still include tubers and fruit. In any case, diets aren't OSFA, so do what works for you but once we get into recommending things for other people we should be aware of the possible pitfalls that it can have. Paleo turned out not to be for me bec it was too much iron and too low carb. It actually made me sicker in an effort to use diet to heal health issues. I'm still fine tuning my diet, but I've also found my needs are ever evolving- the diet that worked for me a year ago needs something different now, so I adjust. permalink parent award report block reply view 1 more comments...\nMacGordon OP 0 points 3 days ago If you're eating carbs/sugar/starch in your main meals & snacks, you're getting a large insulin response every time. 3-5 times per day. As for nutrient deficiencies, I have my blood labs drawn twice a year (for the past 3.5 years). Only thing I need to bump up is sodium. Vitamin C levels were perfect. When you don't eat the sugars, your body doesn't need a ton vitamin C, and it won't get flushed out of your system. All meat IS the only way to do carnivore. If you introduce vegetation, that's keto. If you are still eating carbs (a synonym of sugar), well, I guess that's just a standard American diet. It's working well for me and a few million here in the US, and the problems I was told when I was young about eating red meat are turning out to be false. I believe fatty ruminant meat to be the pentacle of appropriate human diets. permalink parent award report block reply lixa 1 points 3 days ago Eating carbs with a meal does not give you a \"large insulin response.\" That's just fake. Eating them with a meal of fat and fiber and protein slows the digestion of sugars resulting in less insulin. Potassium found in many carbs drives sugar out of the blood and into the cells for use. Eating too many carbs or carbs away from meals will spike insulin. It's not monolithic. There are also people with low blood sugar or adrenal dysregulation, delicate hormonal balance (women), who benefit from moderate carbs. This doesn't mean you drink juice or eat candy- but complex carbs and whole fruit are beneficial. Produce also has loads of micronutrients you are not getting from carnivore. Many people benefit from keto/carnivore at first and then end up with hormones that suffer because of it down the line. The paleo diet is closest to what we'd eat in the wild, or did eat when we were in the wild. But it's also not for everyone. By all meat I meant muscle tissue as opposed to also organs and cartilage, bone broth, and such. Those have nutrients you'd be missing with just meat. No animal that's carnivorous doesn't also eat the organs. Regular labs (vs functional medicine labs) include sick people in their ranges btw so it's not the best. It also doesn't show what's in the tissues. The body keeps the blood levels good first even if it has to draw from bone. permalink parent award report block reply MacGordon OP 1 points 2 days ago One single noodle, no. A whole American sized serving of carbs, yes...it does. There are no Randomized Control Trial studies proving how effective fiber is in blocking or slowing absorption of glucose, fructose, sucrose. Hell, humans can't even digest it properly and although the 10% factor of nutrients absorbed from fiber, more studies are placing that number at 3%-7%, and that fiber is nothing more than a bulking agent. Systemic review & metanalysis just don't cut it for me. What's moderate carbs, grams per day wise? The biggest myth on sugar is \"Fruit/whole grains is natural sugar and good for you\" and never realizing that all sugar is natural, whether you're eating it from the plant itself, or if a processing plant pulled it from the fruit, beet, cane, grain, etc. Our bodies don't care where it comes from. That's why when my diabetic family member eats an apple and later checks his blood glucose, it's elevated. Apples are full of that fun fiber stuff too. I do not know anyone in my circle, nor any evidence that proves Keto or Carnivore leads one to \"end up with hormones that suffer\", but can admit that one of my friends, a female, has improved her hormonal issues. Nutritionist Gary Brecka is using these diets to help women get pregnant. I think Paleo as well. Paleo is fine, and I fault no one on how they choose to eat. It's not for me. Fiber leads to gastric distress in my system, and Paleo is too lean meat based for my taste. I'm looking to be satiated, and paleo doesn't do it for me. There are no nutrients in plants that I'm not already getting from eating all meat types. It's a common misconception that carnivore will lead to such things as scurvy, but again, that's not happening to the few million of Americans practicing this way of living. Our bodies require less vitamin C, with what little is in meat, and not eating carbs that strip it out, seems to be working quite well. Agree on the \"all meat\" or as we like to refer to it as 'eating nose to tail'. I appreciate the friendly discourse vs all the carb addicts chimping out on me labeling me a \"retard\". Cheers!! permalink parent award report block reply lixa 1 points 2 days ago I won't call you a retard as long as you are civil and not acting like one ;) But thanks I appreciate it too. There is a happy medium between a single noodle and 5 cups of pasta that many people eat. I don't see why anyone would fund a trial to prove fiber slows glucose, but those with blood sugar issues in either direction can attest. Just bec there isn't such a study doesn't make it not true. I happen to have low blood sugar and low Ha1c and don't do well with low carb, but if I say, drink juice on an empty stomach I can feel it and get in trouble pretty easily. If I eat carbs on top of fiber, and esp fat and protein, I have an entirely diff experience. People can take their blood sugar and see the effect in real time, so you don't need a study to show what everyone can see by experience. Fiber isn't meant to be absorbed as a nutrient, it is meant to help cleanse the digestive tract and act as a detoxing agent, and also prebiotic fiber feeds probiotics in your gut which is important. We are not pure carnivores like cats, but we are omnivorous, in the opposite way to monkeys- they need more plants and less meat, we need more meat and less plants, but we still need plants. Our digestive system ratio is opposite as well in terms of size of small intestine to large intestine. Where are you getting all the phytonutrients from like carotenoids, antioxidants, and such? Enough Folate? K? E? Potassium? Magnesium? Iodine? C? Calcium? And don't say you take a supplement, bec that means it's not a natural diet. Talk to registered dietitians who have to see people after their hormones suffer. They understand that eating no carb can lead to issues with adrenal dysregulation and in turn make sex hormones suffer. I know of many such women. I think some of the positive effect you see in hormones is if bec people are removing gluten and soy and many processed foods when they go carnivore, not because produce is bad for you. This is confusing the issue. If fiber leads to distress you prob have some dysbiosis, that isn't normal. Doesn't mean fiber is bad bec your system has something amiss in it that leads to it digesting poorly- I eat plenty of fiber and have zero gas or digestive issues from it. My mom btw has trouble digesting meat- doesn't mean meat is bad, it means something in her particular system is off to result in the issue (prob enzymes, low stomach acid). Btw Paleo doesn't have to be lean, you can include as much fat on it as you want, done right it should have way more fat than carbs, but still include tubers and fruit. In any case, diets aren't OSFA, so do what works for you but once we get into recommending things for other people we should be aware of the possible pitfalls that it can have. Paleo turned out not to be for me bec it was too much iron and too low carb. It actually made me sicker in an effort to use diet to heal health issues. I'm still fine tuning my diet, but I've also found my needs are ever evolving- the diet that worked for me a year ago needs something different now, so I adjust. permalink parent award report block reply view 1 more comments...\nlixa 1 points 3 days ago Eating carbs with a meal does not give you a \"large insulin response.\" That's just fake. Eating them with a meal of fat and fiber and protein slows the digestion of sugars resulting in less insulin. Potassium found in many carbs drives sugar out of the blood and into the cells for use. Eating too many carbs or carbs away from meals will spike insulin. It's not monolithic. There are also people with low blood sugar or adrenal dysregulation, delicate hormonal balance (women), who benefit from moderate carbs. This doesn't mean you drink juice or eat candy- but complex carbs and whole fruit are beneficial. Produce also has loads of micronutrients you are not getting from carnivore. Many people benefit from keto/carnivore at first and then end up with hormones that suffer because of it down the line. The paleo diet is closest to what we'd eat in the wild, or did eat when we were in the wild. But it's also not for everyone. By all meat I meant muscle tissue as opposed to also organs and cartilage, bone broth, and such. Those have nutrients you'd be missing with just meat. No animal that's carnivorous doesn't also eat the organs. Regular labs (vs functional medicine labs) include sick people in their ranges btw so it's not the best. It also doesn't show what's in the tissues. The body keeps the blood levels good first even if it has to draw from bone. permalink parent award report block reply MacGordon OP 1 points 2 days ago One single noodle, no. A whole American sized serving of carbs, yes...it does. There are no Randomized Control Trial studies proving how effective fiber is in blocking or slowing absorption of glucose, fructose, sucrose. Hell, humans can't even digest it properly and although the 10% factor of nutrients absorbed from fiber, more studies are placing that number at 3%-7%, and that fiber is nothing more than a bulking agent. Systemic review & metanalysis just don't cut it for me. What's moderate carbs, grams per day wise? The biggest myth on sugar is \"Fruit/whole grains is natural sugar and good for you\" and never realizing that all sugar is natural, whether you're eating it from the plant itself, or if a processing plant pulled it from the fruit, beet, cane, grain, etc. Our bodies don't care where it comes from. That's why when my diabetic family member eats an apple and later checks his blood glucose, it's elevated. Apples are full of that fun fiber stuff too. I do not know anyone in my circle, nor any evidence that proves Keto or Carnivore leads one to \"end up with hormones that suffer\", but can admit that one of my friends, a female, has improved her hormonal issues. Nutritionist Gary Brecka is using these diets to help women get pregnant. I think Paleo as well. Paleo is fine, and I fault no one on how they choose to eat. It's not for me. Fiber leads to gastric distress in my system, and Paleo is too lean meat based for my taste. I'm looking to be satiated, and paleo doesn't do it for me. There are no nutrients in plants that I'm not already getting from eating all meat types. It's a common misconception that carnivore will lead to such things as scurvy, but again, that's not happening to the few million of Americans practicing this way of living. Our bodies require less vitamin C, with what little is in meat, and not eating carbs that strip it out, seems to be working quite well. Agree on the \"all meat\" or as we like to refer to it as 'eating nose to tail'. I appreciate the friendly discourse vs all the carb addicts chimping out on me labeling me a \"retard\". Cheers!! permalink parent award report block reply lixa 1 points 2 days ago I won't call you a retard as long as you are civil and not acting like one ;) But thanks I appreciate it too. There is a happy medium between a single noodle and 5 cups of pasta that many people eat. I don't see why anyone would fund a trial to prove fiber slows glucose, but those with blood sugar issues in either direction can attest. Just bec there isn't such a study doesn't make it not true. I happen to have low blood sugar and low Ha1c and don't do well with low carb, but if I say, drink juice on an empty stomach I can feel it and get in trouble pretty easily. If I eat carbs on top of fiber, and esp fat and protein, I have an entirely diff experience. People can take their blood sugar and see the effect in real time, so you don't need a study to show what everyone can see by experience. Fiber isn't meant to be absorbed as a nutrient, it is meant to help cleanse the digestive tract and act as a detoxing agent, and also prebiotic fiber feeds probiotics in your gut which is important. We are not pure carnivores like cats, but we are omnivorous, in the opposite way to monkeys- they need more plants and less meat, we need more meat and less plants, but we still need plants. Our digestive system ratio is opposite as well in terms of size of small intestine to large intestine. Where are you getting all the phytonutrients from like carotenoids, antioxidants, and such? Enough Folate? K? E? Potassium? Magnesium? Iodine? C? Calcium? And don't say you take a supplement, bec that means it's not a natural diet. Talk to registered dietitians who have to see people after their hormones suffer. They understand that eating no carb can lead to issues with adrenal dysregulation and in turn make sex hormones suffer. I know of many such women. I think some of the positive effect you see in hormones is if bec people are removing gluten and soy and many processed foods when they go carnivore, not because produce is bad for you. This is confusing the issue. If fiber leads to distress you prob have some dysbiosis, that isn't normal. Doesn't mean fiber is bad bec your system has something amiss in it that leads to it digesting poorly- I eat plenty of fiber and have zero gas or digestive issues from it. My mom btw has trouble digesting meat- doesn't mean meat is bad, it means something in her particular system is off to result in the issue (prob enzymes, low stomach acid). Btw Paleo doesn't have to be lean, you can include as much fat on it as you want, done right it should have way more fat than carbs, but still include tubers and fruit. In any case, diets aren't OSFA, so do what works for you but once we get into recommending things for other people we should be aware of the possible pitfalls that it can have. Paleo turned out not to be for me bec it was too much iron and too low carb. It actually made me sicker in an effort to use diet to heal health issues. I'm still fine tuning my diet, but I've also found my needs are ever evolving- the diet that worked for me a year ago needs something different now, so I adjust. permalink parent award report block reply view 1 more comments...\nMacGordon OP 1 points 2 days ago One single noodle, no. A whole American sized serving of carbs, yes...it does. There are no Randomized Control Trial studies proving how effective fiber is in blocking or slowing absorption of glucose, fructose, sucrose. Hell, humans can't even digest it properly and although the 10% factor of nutrients absorbed from fiber, more studies are placing that number at 3%-7%, and that fiber is nothing more than a bulking agent. Systemic review & metanalysis just don't cut it for me. What's moderate carbs, grams per day wise? The biggest myth on sugar is \"Fruit/whole grains is natural sugar and good for you\" and never realizing that all sugar is natural, whether you're eating it from the plant itself, or if a processing plant pulled it from the fruit, beet, cane, grain, etc. Our bodies don't care where it comes from. That's why when my diabetic family member eats an apple and later checks his blood glucose, it's elevated. Apples are full of that fun fiber stuff too. I do not know anyone in my circle, nor any evidence that proves Keto or Carnivore leads one to \"end up with hormones that suffer\", but can admit that one of my friends, a female, has improved her hormonal issues. Nutritionist Gary Brecka is using these diets to help women get pregnant. I think Paleo as well. Paleo is fine, and I fault no one on how they choose to eat. It's not for me. Fiber leads to gastric distress in my system, and Paleo is too lean meat based for my taste. I'm looking to be satiated, and paleo doesn't do it for me. There are no nutrients in plants that I'm not already getting from eating all meat types. It's a common misconception that carnivore will lead to such things as scurvy, but again, that's not happening to the few million of Americans practicing this way of living. Our bodies require less vitamin C, with what little is in meat, and not eating carbs that strip it out, seems to be working quite well. Agree on the \"all meat\" or as we like to refer to it as 'eating nose to tail'. I appreciate the friendly discourse vs all the carb addicts chimping out on me labeling me a \"retard\". Cheers!! permalink parent award report block reply lixa 1 points 2 days ago I won't call you a retard as long as you are civil and not acting like one ;) But thanks I appreciate it too. There is a happy medium between a single noodle and 5 cups of pasta that many people eat. I don't see why anyone would fund a trial to prove fiber slows glucose, but those with blood sugar issues in either direction can attest. Just bec there isn't such a study doesn't make it not true. I happen to have low blood sugar and low Ha1c and don't do well with low carb, but if I say, drink juice on an empty stomach I can feel it and get in trouble pretty easily. If I eat carbs on top of fiber, and esp fat and protein, I have an entirely diff experience. People can take their blood sugar and see the effect in real time, so you don't need a study to show what everyone can see by experience. Fiber isn't meant to be absorbed as a nutrient, it is meant to help cleanse the digestive tract and act as a detoxing agent, and also prebiotic fiber feeds probiotics in your gut which is important. We are not pure carnivores like cats, but we are omnivorous, in the opposite way to monkeys- they need more plants and less meat, we need more meat and less plants, but we still need plants. Our digestive system ratio is opposite as well in terms of size of small intestine to large intestine. Where are you getting all the phytonutrients from like carotenoids, antioxidants, and such? Enough Folate? K? E? Potassium? Magnesium? Iodine? C? Calcium? And don't say you take a supplement, bec that means it's not a natural diet. Talk to registered dietitians who have to see people after their hormones suffer. They understand that eating no carb can lead to issues with adrenal dysregulation and in turn make sex hormones suffer. I know of many such women. I think some of the positive effect you see in hormones is if bec people are removing gluten and soy and many processed foods when they go carnivore, not because produce is bad for you. This is confusing the issue. If fiber leads to distress you prob have some dysbiosis, that isn't normal. Doesn't mean fiber is bad bec your system has something amiss in it that leads to it digesting poorly- I eat plenty of fiber and have zero gas or digestive issues from it. My mom btw has trouble digesting meat- doesn't mean meat is bad, it means something in her particular system is off to result in the issue (prob enzymes, low stomach acid). Btw Paleo doesn't have to be lean, you can include as much fat on it as you want, done right it should have way more fat than carbs, but still include tubers and fruit. In any case, diets aren't OSFA, so do what works for you but once we get into recommending things for other people we should be aware of the possible pitfalls that it can have. Paleo turned out not to be for me bec it was too much iron and too low carb. It actually made me sicker in an effort to use diet to heal health issues. I'm still fine tuning my diet, but I've also found my needs are ever evolving- the diet that worked for me a year ago needs something different now, so I adjust. permalink parent award report block reply view 1 more comments...\nlixa 1 points 2 days ago I won't call you a retard as long as you are civil and not acting like one ;) But thanks I appreciate it too. There is a happy medium between a single noodle and 5 cups of pasta that many people eat. I don't see why anyone would fund a trial to prove fiber slows glucose, but those with blood sugar issues in either direction can attest. Just bec there isn't such a study doesn't make it not true. I happen to have low blood sugar and low Ha1c and don't do well with low carb, but if I say, drink juice on an empty stomach I can feel it and get in trouble pretty easily. If I eat carbs on top of fiber, and esp fat and protein, I have an entirely diff experience. People can take their blood sugar and see the effect in real time, so you don't need a study to show what everyone can see by experience. Fiber isn't meant to be absorbed as a nutrient, it is meant to help cleanse the digestive tract and act as a detoxing agent, and also prebiotic fiber feeds probiotics in your gut which is important. We are not pure carnivores like cats, but we are omnivorous, in the opposite way to monkeys- they need more plants and less meat, we need more meat and less plants, but we still need plants. Our digestive system ratio is opposite as well in terms of size of small intestine to large intestine. Where are you getting all the phytonutrients from like carotenoids, antioxidants, and such? Enough Folate? K? E? Potassium? Magnesium? Iodine? C? Calcium? And don't say you take a supplement, bec that means it's not a natural diet. Talk to registered dietitians who have to see people after their hormones suffer. They understand that eating no carb can lead to issues with adrenal dysregulation and in turn make sex hormones suffer. I know of many such women. I think some of the positive effect you see in hormones is if bec people are removing gluten and soy and many processed foods when they go carnivore, not because produce is bad for you. This is confusing the issue. If fiber leads to distress you prob have some dysbiosis, that isn't normal. Doesn't mean fiber is bad bec your system has something amiss in it that leads to it digesting poorly- I eat plenty of fiber and have zero gas or digestive issues from it. My mom btw has trouble digesting meat- doesn't mean meat is bad, it means something in her particular system is off to result in the issue (prob enzymes, low stomach acid). Btw Paleo doesn't have to be lean, you can include as much fat on it as you want, done right it should have way more fat than carbs, but still include tubers and fruit. In any case, diets aren't OSFA, so do what works for you but once we get into recommending things for other people we should be aware of the possible pitfalls that it can have. Paleo turned out not to be for me bec it was too much iron and too low carb. It actually made me sicker in an effort to use diet to heal health issues. I'm still fine tuning my diet, but I've also found my needs are ever evolving- the diet that worked for me a year ago needs something different now, so I adjust. permalink parent award report block reply view 1 more comments...\nNotYourMan 3 points 3 days ago Insulin resistance is the killer. permalink award report block reply MAGALADON9 1 points 3 days ago Yeah my brother in law got the bad news but can't do the extreme \"reset\" needed to restart his insulin sensitivity.  He has a small window where he does this basically starvation diet for 6 months or so and is strict on the blood levels - carnivore or at least <15g carbs per day keto. I've found it's easier for me to fast totally than have a small amount. This was confirmed in the late 40s and 50s in starvation studies. Given a small amount of food made the men ravenous, food plagued their every thought.  The first 16-34 hours can be rough but after that switch happens your body is flooded with growth hormone and other feel good chemicals in a desperate attempt to calm you from the starvation it thinks you are unintentionally dealing with.  After 48hr I feel \"high\" i mean... it's crazy i laugh at how.much time i waste thinking and preparing food, I have no hunger unless I think hard about it after that I can go much longer.  My top is 15 days nothing but a vitamin and a pinch of salt substitute (potassium chloride and sodium chloride,  and half a magnesium tab.) And that's it. I see movies where people are lost and start eating moss and grass only to vomit and have diarrhea or poor bastards eating their dead soccer chums. I KNOW I can walk out of the wilderness or a plane crash I just need water. permalink parent award report block reply MacGordon OP 0 points 3 days ago Too right. It's unfortunate that it took this many decades for this to be known, but more & more are starting to realize this. permalink parent award report block reply\nMAGALADON9 1 points 3 days ago Yeah my brother in law got the bad news but can't do the extreme \"reset\" needed to restart his insulin sensitivity.  He has a small window where he does this basically starvation diet for 6 months or so and is strict on the blood levels - carnivore or at least <15g carbs per day keto. I've found it's easier for me to fast totally than have a small amount. This was confirmed in the late 40s and 50s in starvation studies. Given a small amount of food made the men ravenous, food plagued their every thought.  The first 16-34 hours can be rough but after that switch happens your body is flooded with growth hormone and other feel good chemicals in a desperate attempt to calm you from the starvation it thinks you are unintentionally dealing with.  After 48hr I feel \"high\" i mean... it's crazy i laugh at how.much time i waste thinking and preparing food, I have no hunger unless I think hard about it after that I can go much longer.  My top is 15 days nothing but a vitamin and a pinch of salt substitute (potassium chloride and sodium chloride,  and half a magnesium tab.) And that's it. I see movies where people are lost and start eating moss and grass only to vomit and have diarrhea or poor bastards eating their dead soccer chums. I KNOW I can walk out of the wilderness or a plane crash I just need water. permalink parent award report block reply\nMacGordon OP 0 points 3 days ago Too right. It's unfortunate that it took this many decades for this to be known, but more & more are starting to realize this. permalink parent award report block reply\njusticein2020 3 points 3 days ago Not to argue the point.  but \"calories\" is an estimate. a rough estimate. based on guesses and ancient data. You know how we figure out calories? We take a lump of the food and set it on fire. Not exactly precision. permalink award report block reply NeverInterruptEnemy 7 points 3 days ago It’s actually super precision. But ok, weird comment. permalink parent award report block reply\nNeverInterruptEnemy 7 points 3 days ago It’s actually super precision. But ok, weird comment. permalink parent award report block reply\nSanityGumby 3 points 3 days ago It's almost like it's because you are burning calories by just existing and if you do exercise that much you likely have a higher resting metabolism due to large muscle density. Ignoring the fact those things are not accurate measures of calories burned. permalink award report block reply\nfacesmelt 3 points 3 days ago Dear lord, you’re a grown man and can’t understand BASIC physics? Embarrassing… Just as embarrassingly dumb as believing the Earth is flat. permalink award report block reply Plots 1 points 3 days ago You sound like Fauci telling me to trust the science.\nWhen it turns out that the human body isn't a candle physically burning food and you are as dumb as a climate “scientist” pretending that the earth is a closed environment and therefore CO2 is a problem. permalink parent award report block reply MacGordon OP 0 points 3 days ago You might strike a nerve. lol I'm still trying to understand BASIC physics of lighting food on fire in a metal canister and how that relates to my human digestive system. As I posted on X: I tried to follow the science, but it wasn't there. I then followed the money. That's where I found the science. permalink parent award report block reply facesmelt 0 points 3 days ago I’m still trying to understand BASIC physics Yeah… We can tell! LMAO RETARD permalink parent award report block reply MacGordon OP 0 points 2 days ago Half a quote.\nHalf a truth.\nHalf brained.\nSmooth. permalink parent award report block reply view 4 more comments...\nPlots 1 points 3 days ago You sound like Fauci telling me to trust the science.\nWhen it turns out that the human body isn't a candle physically burning food and you are as dumb as a climate “scientist” pretending that the earth is a closed environment and therefore CO2 is a problem. permalink parent award report block reply MacGordon OP 0 points 3 days ago You might strike a nerve. lol I'm still trying to understand BASIC physics of lighting food on fire in a metal canister and how that relates to my human digestive system. As I posted on X: I tried to follow the science, but it wasn't there. I then followed the money. That's where I found the science. permalink parent award report block reply facesmelt 0 points 3 days ago I’m still trying to understand BASIC physics Yeah… We can tell! LMAO RETARD permalink parent award report block reply MacGordon OP 0 points 2 days ago Half a quote.\nHalf a truth.\nHalf brained.\nSmooth. permalink parent award report block reply view 4 more comments...\nMacGordon OP 0 points 3 days ago You might strike a nerve. lol I'm still trying to understand BASIC physics of lighting food on fire in a metal canister and how that relates to my human digestive system. As I posted on X: I tried to follow the science, but it wasn't there. I then followed the money. That's where I found the science. permalink parent award report block reply facesmelt 0 points 3 days ago I’m still trying to understand BASIC physics Yeah… We can tell! LMAO RETARD permalink parent award report block reply MacGordon OP 0 points 2 days ago Half a quote.\nHalf a truth.\nHalf brained.\nSmooth. permalink parent award report block reply view 4 more comments...\nfacesmelt 0 points 3 days ago I’m still trying to understand BASIC physics Yeah… We can tell! LMAO RETARD permalink parent award report block reply MacGordon OP 0 points 2 days ago Half a quote.\nHalf a truth.\nHalf brained.\nSmooth. permalink parent award report block reply view 4 more comments...\nMacGordon OP 0 points 2 days ago Half a quote.\nHalf a truth.\nHalf brained.\nSmooth. permalink parent award report block reply view 4 more comments...\n26magarat 2 points 3 days ago Sadly, a lot of women base their self-worth on a number on a scale. Even though your weight varies over just 24 hours. Does that mean you're a \"better\" person in the morning if your weight is a few pounds less than it might be at night? My scale and the doctor's scale never matched. Also to save time, they always weigh me with my clothes and shoes on which is really dumb. permalink award report block reply\nHobisterCavinboub 2 points 3 days ago Health TIp:  Loose the cell/watch.  And, maybe stop counting things. permalink award report block reply Watermelons 2 points 3 days ago I don't carry it in a holster.  How am I supposed to loose it? permalink parent award report block reply MacGordon OP 1 points 3 days ago You know, I'm completely on your side with this. I no longer use calories to any extent. When you eliminate the foods that were making me fat, it no longer made any sense. Eating just animal fats & proteins, just eat until you're full. Rinse/Repeat permalink parent award report block reply\nWatermelons 2 points 3 days ago I don't carry it in a holster.  How am I supposed to loose it? permalink parent award report block reply\nMacGordon OP 1 points 3 days ago You know, I'm completely on your side with this. I no longer use calories to any extent. When you eliminate the foods that were making me fat, it no longer made any sense. Eating just animal fats & proteins, just eat until you're full. Rinse/Repeat permalink parent award report block reply\nInternationalSpy007 2 points 3 days ago I’m not carnivore, but I am keto and it’s the most important health decision I ever made. After about a year of keto, I added a few MAHA elements, such as removing most artificial ingredients, no seed oil oils, and making sure my fat came primarily from meats, avocado, or olive oil. I avoid most sweeteners, except for a little bit of Stevia, which I allow myself in my coffee, which I also add whole cream and butter to. Almost no carbs, although I do allow myself to have green vegetables, cheeses, probiotics, like sauerkraut, as well as a variety of seafood (eggs, and lots of meat, too). Anyway, once I got used to the idea that I didn’t have to have things like bread, rice, and potatoes with every meal… It’s been the easiest diet of my life. And because a high fat/low carb diet keeps you full for hours I can go between meals for much longer, not even a desire to snack at all. My blood sugar is super stable, I have more energy, I’ve lost the extra weight I was carrying around,and by nearly every metric I feel better. Anyway, do your own research, but if you’re looking to make a change, keto is super satisfying and once you get the hang of it so easy to do. Honestly, high fat meats aren’t the problem. It’s just that a high fat diet and carbohydrates is the problem (the high fat/high carb diet people are the ones with the most serioushealth problems).\nThe establishment medical “experts” blame it on the meat, but it’s not the meat, it’s the meat AND high carb combination that’s deadly. Basically, if you wanna lose weight and be healthy, you can eat all a lot of of meat and a lot of fat, but you just can’t eat many carbs if you’re doing that. Another option, which I don’t do is, you can eat lots of healthy carbs, but avoid almost all fat. This will allow you to lose weight, too.. although the insulin highs and lows will still cause you to crave food every hour or two throughout the day. But a calorie restricted high carb/low fat diet does technically allow you to lose weight.\nIt’s just not the way I want to do it. permalink award report block reply MacGordon OP 4 points 3 days ago I don't know why you got down voted, but what you're saying is good stuff. There's a ton of carb addicts on this site and I've learned they do NOT like it when there's even mention of carb restriction health benefits. I too started off on keto back in Jan of 2022. Heck, I really didn't even know what I was doing, so I labeled it \"dirty keto\". Still lost weight. I refined my way of eating after a good amount of research. I experienced all the same things as you. Oct of '22, I made the change to just meat. I eat a ton of beef, eggs, bacon, hot dogs, burger patties, hard cheeses, and I try for the fattier cuts as they are the most flavorful & satiating. This move came when I found that vegetables with moderate to high fiber was wrecking my system, causing all kinds of digestive tract pain. I agree that losing weight by starving yourself is never a 'preferred' method. :-) permalink parent award report block reply\nMacGordon OP 4 points 3 days ago I don't know why you got down voted, but what you're saying is good stuff. There's a ton of carb addicts on this site and I've learned they do NOT like it when there's even mention of carb restriction health benefits. I too started off on keto back in Jan of 2022. Heck, I really didn't even know what I was doing, so I labeled it \"dirty keto\". Still lost weight. I refined my way of eating after a good amount of research. I experienced all the same things as you. Oct of '22, I made the change to just meat. I eat a ton of beef, eggs, bacon, hot dogs, burger patties, hard cheeses, and I try for the fattier cuts as they are the most flavorful & satiating. This move came when I found that vegetables with moderate to high fiber was wrecking my system, causing all kinds of digestive tract pain. I agree that losing weight by starving yourself is never a 'preferred' method. :-) permalink parent award report block reply\nMuttsbitetoo 2 points 3 days ago Hypertrophy changes everything permalink award report block reply\nBaronFalcon 1 points 3 days ago Hes not wrong about sugar. I eliminated sugar 4 months ago. Lifelong hypoglycemic, gone. brain fog, gone. energy through the roof. Went from 20% BF to 12% in 3 months. Lifting and cardio 6 days a week. Processed food and sugar are literal toxins that cause liver damage, alzheimers. parkinsons, and a host of other issues. sugar destroys gut bacteria. alzheimers is being called type 3 diabetes.  Stop eating processed food and sugar they're killing us with it. permalink award report block reply\nMAGALADON9 0 points 3 days ago I do right now a keto diet but also 20/4 I.F. If the world ever ends I'm fucked. I'll be eating like 27 squirrels permalink award report block reply\nCucumberExtract -1 points 3 days ago For people who will try to argue \"but physics\".  Humans are not closed systems. Matter = Energy (w/ conversion rate) Sweat = matter Skin cycling = matter Hair = matter Piss = matter Shit = matter Nails = matter Muscle repair = matter Standard cell shedding/replacement = matter etc permalink award report block reply\nMacGordon OP -3 points 3 days ago Calories in - Calories out is bullshit. Humans are the only mammals that intentionally starve themselves in the name of \"health\", and then get confused why it nearly always fails. Eat less, workout, get even more hungry, then try to keep from eating again. Crazy. Just eat the foods that not only nourish but satiate. Meat. permalink award report block reply Zskills 11 points 3 days ago CICO is not \"BS\".  It's physics. Calories consumed - BMR - add'l Calories burned = net calories for the day. If this number is chronically negative you will lose weight.  I go through cycles of bulking and cutting to pack on muscle and trim fat, intentionally gaining and losing weight with precision. permalink parent award report block reply Watermelons 3 points 3 days ago Anyone spouting the nonsense of CICO not being correct has no concept of energy systems nor statistics. You can't reliably measure the calories out (work done by the system and waste). All the watch does is do some sort of value based on a model.  It's a decent starting point, but your bodyweight is what determines how to adjust your diet. permalink parent award report block reply Zskills 3 points 3 days ago Oh I don't trust those watches at all.  They have absolutely no idea. What I do is a best estimate of my caloric needs based on lean mass, BF%, and activity level.   Shave off a few hundred, and then stick to it and see what happens. After about a month of monitoring I have a very good idea of what exactly it should be and how much to continue to taper in order to continue to trim fat while retaining as much muscle as possible. I shoot for about 500 kcal initial  deficit to kick off the cut at about 1 lb lost per week, then continue to reduce as the fat comes off and my BMR drops with it. permalink parent award report block reply Watermelons 3 points 3 days ago Yeah.  It's pretty basic.   You start at a point, monitor, and adjust as you go along.  If anyone is spouting the stuff the guy in the tweet said, I just assume they're selling something. permalink parent award report block reply Surfsup 2 points 3 days ago Yes but not the right weight. permalink parent award report block reply Zskills 1 points 3 days ago I'm not sure what you mean? permalink parent award report block reply Surfsup 1 points 3 days ago You'll lose muscle while gaining fat. permalink parent award report block reply view 3 more comments... MacGordon OP 1 points 3 days ago Firstly, my body does not light my food on fire in my digestive organs. I also will repeat, starving yourself to lose weight is a recipe for disaster. But frankly, if you're bulking & cutting, you are getting fat while trying to put on more muscle, only for you to later 'cut' that fat, and I also believe this to be insufficient method. But it gets worse, as there are more studies showing this up and down practice leading to greater cardiac issues. What are yo cutting, and how does it get there? thinking emoji permalink parent award report block reply Zskills 2 points 3 days ago But frankly, if you're bulking & cutting, you are getting fat while trying to put on more muscle, only for you to later 'cut' that fat Yes, correct.   It is very difficult to add muscle without some fat as well. studies showing this up and down practice leading to greater cardiac issues Yeah.  I've heard that that.  Never looked into it, perhaps I will. What are yo cutting, and how does it get there? Mostly fat, and some muscle.  It got there via caloric surplus and progressive overload, respectively. permalink parent award report block reply MacGordon OP 2 points 2 days ago I appreciate you being up front with your response. Give my friend (I wish) Max German a listen. He's carnivore, he lifts, and he scientifically breaks down everything he studies. https://www.youtube.com/watch?v=f61etz8bPlw permalink parent award report block reply view 1 more comments... CucumberExtract -2 points 3 days ago As I said here: https://patriots.win/p/1ARK5A9qkA/x/c/4eXu1qsyynh For people who will try to argue \"but physics\". Humans are not closed systems. Matter = Energy (w/ conversion rate) Sweat = matter Skin cycling = matter Hair = matter Piss = matter Shit = matter Nails = matter Muscle repair = matter Standard cell shedding/replacement = matter etc All of those things are calories out. The amount of resistance something this basic in logic gets means we're really poking at somebody's cash cow with this. permalink parent award report block reply Zskills 3 points 3 days ago Everything you listed is under BMR permalink parent award report block reply CucumberExtract 1 points 3 days ago Everything? Including excrement which can vary greatly based on what you eat and when? That kinda makes BMR sound like quackery doesn't it, so more likely everything I said is not part of that. permalink parent award report block reply NeverInterruptEnemy -1 points 3 days ago You’re a fucking moron bro. permalink parent award report block reply\nZskills 11 points 3 days ago CICO is not \"BS\".  It's physics. Calories consumed - BMR - add'l Calories burned = net calories for the day. If this number is chronically negative you will lose weight.  I go through cycles of bulking and cutting to pack on muscle and trim fat, intentionally gaining and losing weight with precision. permalink parent award report block reply Watermelons 3 points 3 days ago Anyone spouting the nonsense of CICO not being correct has no concept of energy systems nor statistics. You can't reliably measure the calories out (work done by the system and waste). All the watch does is do some sort of value based on a model.  It's a decent starting point, but your bodyweight is what determines how to adjust your diet. permalink parent award report block reply Zskills 3 points 3 days ago Oh I don't trust those watches at all.  They have absolutely no idea. What I do is a best estimate of my caloric needs based on lean mass, BF%, and activity level.   Shave off a few hundred, and then stick to it and see what happens. After about a month of monitoring I have a very good idea of what exactly it should be and how much to continue to taper in order to continue to trim fat while retaining as much muscle as possible. I shoot for about 500 kcal initial  deficit to kick off the cut at about 1 lb lost per week, then continue to reduce as the fat comes off and my BMR drops with it. permalink parent award report block reply Watermelons 3 points 3 days ago Yeah.  It's pretty basic.   You start at a point, monitor, and adjust as you go along.  If anyone is spouting the stuff the guy in the tweet said, I just assume they're selling something. permalink parent award report block reply Surfsup 2 points 3 days ago Yes but not the right weight. permalink parent award report block reply Zskills 1 points 3 days ago I'm not sure what you mean? permalink parent award report block reply Surfsup 1 points 3 days ago You'll lose muscle while gaining fat. permalink parent award report block reply view 3 more comments... MacGordon OP 1 points 3 days ago Firstly, my body does not light my food on fire in my digestive organs. I also will repeat, starving yourself to lose weight is a recipe for disaster. But frankly, if you're bulking & cutting, you are getting fat while trying to put on more muscle, only for you to later 'cut' that fat, and I also believe this to be insufficient method. But it gets worse, as there are more studies showing this up and down practice leading to greater cardiac issues. What are yo cutting, and how does it get there? thinking emoji permalink parent award report block reply Zskills 2 points 3 days ago But frankly, if you're bulking & cutting, you are getting fat while trying to put on more muscle, only for you to later 'cut' that fat Yes, correct.   It is very difficult to add muscle without some fat as well. studies showing this up and down practice leading to greater cardiac issues Yeah.  I've heard that that.  Never looked into it, perhaps I will. What are yo cutting, and how does it get there? Mostly fat, and some muscle.  It got there via caloric surplus and progressive overload, respectively. permalink parent award report block reply MacGordon OP 2 points 2 days ago I appreciate you being up front with your response. Give my friend (I wish) Max German a listen. He's carnivore, he lifts, and he scientifically breaks down everything he studies. https://www.youtube.com/watch?v=f61etz8bPlw permalink parent award report block reply view 1 more comments... CucumberExtract -2 points 3 days ago As I said here: https://patriots.win/p/1ARK5A9qkA/x/c/4eXu1qsyynh For people who will try to argue \"but physics\". Humans are not closed systems. Matter = Energy (w/ conversion rate) Sweat = matter Skin cycling = matter Hair = matter Piss = matter Shit = matter Nails = matter Muscle repair = matter Standard cell shedding/replacement = matter etc All of those things are calories out. The amount of resistance something this basic in logic gets means we're really poking at somebody's cash cow with this. permalink parent award report block reply Zskills 3 points 3 days ago Everything you listed is under BMR permalink parent award report block reply CucumberExtract 1 points 3 days ago Everything? Including excrement which can vary greatly based on what you eat and when? That kinda makes BMR sound like quackery doesn't it, so more likely everything I said is not part of that. permalink parent award report block reply\nWatermelons 3 points 3 days ago Anyone spouting the nonsense of CICO not being correct has no concept of energy systems nor statistics. You can't reliably measure the calories out (work done by the system and waste). All the watch does is do some sort of value based on a model.  It's a decent starting point, but your bodyweight is what determines how to adjust your diet. permalink parent award report block reply Zskills 3 points 3 days ago Oh I don't trust those watches at all.  They have absolutely no idea. What I do is a best estimate of my caloric needs based on lean mass, BF%, and activity level.   Shave off a few hundred, and then stick to it and see what happens. After about a month of monitoring I have a very good idea of what exactly it should be and how much to continue to taper in order to continue to trim fat while retaining as much muscle as possible. I shoot for about 500 kcal initial  deficit to kick off the cut at about 1 lb lost per week, then continue to reduce as the fat comes off and my BMR drops with it. permalink parent award report block reply Watermelons 3 points 3 days ago Yeah.  It's pretty basic.   You start at a point, monitor, and adjust as you go along.  If anyone is spouting the stuff the guy in the tweet said, I just assume they're selling something. permalink parent award report block reply\nZskills 3 points 3 days ago Oh I don't trust those watches at all.  They have absolutely no idea. What I do is a best estimate of my caloric needs based on lean mass, BF%, and activity level.   Shave off a few hundred, and then stick to it and see what happens. After about a month of monitoring I have a very good idea of what exactly it should be and how much to continue to taper in order to continue to trim fat while retaining as much muscle as possible. I shoot for about 500 kcal initial  deficit to kick off the cut at about 1 lb lost per week, then continue to reduce as the fat comes off and my BMR drops with it. permalink parent award report block reply Watermelons 3 points 3 days ago Yeah.  It's pretty basic.   You start at a point, monitor, and adjust as you go along.  If anyone is spouting the stuff the guy in the tweet said, I just assume they're selling something. permalink parent award report block reply\nWatermelons 3 points 3 days ago Yeah.  It's pretty basic.   You start at a point, monitor, and adjust as you go along.  If anyone is spouting the stuff the guy in the tweet said, I just assume they're selling something. permalink parent award report block reply\nSurfsup 2 points 3 days ago Yes but not the right weight. permalink parent award report block reply Zskills 1 points 3 days ago I'm not sure what you mean? permalink parent award report block reply Surfsup 1 points 3 days ago You'll lose muscle while gaining fat. permalink parent award report block reply view 3 more comments...\nZskills 1 points 3 days ago I'm not sure what you mean? permalink parent award report block reply Surfsup 1 points 3 days ago You'll lose muscle while gaining fat. permalink parent award report block reply view 3 more comments...\nSurfsup 1 points 3 days ago You'll lose muscle while gaining fat. permalink parent award report block reply view 3 more comments...\nMacGordon OP 1 points 3 days ago Firstly, my body does not light my food on fire in my digestive organs. I also will repeat, starving yourself to lose weight is a recipe for disaster. But frankly, if you're bulking & cutting, you are getting fat while trying to put on more muscle, only for you to later 'cut' that fat, and I also believe this to be insufficient method. But it gets worse, as there are more studies showing this up and down practice leading to greater cardiac issues. What are yo cutting, and how does it get there? thinking emoji permalink parent award report block reply Zskills 2 points 3 days ago But frankly, if you're bulking & cutting, you are getting fat while trying to put on more muscle, only for you to later 'cut' that fat Yes, correct.   It is very difficult to add muscle without some fat as well. studies showing this up and down practice leading to greater cardiac issues Yeah.  I've heard that that.  Never looked into it, perhaps I will. What are yo cutting, and how does it get there? Mostly fat, and some muscle.  It got there via caloric surplus and progressive overload, respectively. permalink parent award report block reply MacGordon OP 2 points 2 days ago I appreciate you being up front with your response. Give my friend (I wish) Max German a listen. He's carnivore, he lifts, and he scientifically breaks down everything he studies. https://www.youtube.com/watch?v=f61etz8bPlw permalink parent award report block reply view 1 more comments...\nZskills 2 points 3 days ago But frankly, if you're bulking & cutting, you are getting fat while trying to put on more muscle, only for you to later 'cut' that fat Yes, correct.   It is very difficult to add muscle without some fat as well. studies showing this up and down practice leading to greater cardiac issues Yeah.  I've heard that that.  Never looked into it, perhaps I will. What are yo cutting, and how does it get there? Mostly fat, and some muscle.  It got there via caloric surplus and progressive overload, respectively. permalink parent award report block reply MacGordon OP 2 points 2 days ago I appreciate you being up front with your response. Give my friend (I wish) Max German a listen. He's carnivore, he lifts, and he scientifically breaks down everything he studies. https://www.youtube.com/watch?v=f61etz8bPlw permalink parent award report block reply view 1 more comments...\nMacGordon OP 2 points 2 days ago I appreciate you being up front with your response. Give my friend (I wish) Max German a listen. He's carnivore, he lifts, and he scientifically breaks down everything he studies. https://www.youtube.com/watch?v=f61etz8bPlw permalink parent award report block reply view 1 more comments...\nCucumberExtract -2 points 3 days ago As I said here: https://patriots.win/p/1ARK5A9qkA/x/c/4eXu1qsyynh For people who will try to argue \"but physics\". Humans are not closed systems. Matter = Energy (w/ conversion rate) Sweat = matter Skin cycling = matter Hair = matter Piss = matter Shit = matter Nails = matter Muscle repair = matter Standard cell shedding/replacement = matter etc All of those things are calories out. The amount of resistance something this basic in logic gets means we're really poking at somebody's cash cow with this. permalink parent award report block reply Zskills 3 points 3 days ago Everything you listed is under BMR permalink parent award report block reply CucumberExtract 1 points 3 days ago Everything? Including excrement which can vary greatly based on what you eat and when? That kinda makes BMR sound like quackery doesn't it, so more likely everything I said is not part of that. permalink parent award report block reply\nZskills 3 points 3 days ago Everything you listed is under BMR permalink parent award report block reply CucumberExtract 1 points 3 days ago Everything? Including excrement which can vary greatly based on what you eat and when? That kinda makes BMR sound like quackery doesn't it, so more likely everything I said is not part of that. permalink parent award report block reply\nCucumberExtract 1 points 3 days ago Everything? Including excrement which can vary greatly based on what you eat and when? That kinda makes BMR sound like quackery doesn't it, so more likely everything I said is not part of that. permalink parent award report block reply\nNeverInterruptEnemy -1 points 3 days ago You’re a fucking moron bro. permalink parent award report block reply\nSalteenCracker -4 points 3 days ago Some faggot mod banned me from the reddit The_Donald because I said counting calories in/out was worthless. Some people stick to bullshit \"science\" no matter how bad it makes them stink. Even here. permalink award report block reply MacGordon OP -5 points 3 days ago I got banned from saying the same in r/keto. permalink parent award report block reply NeverInterruptEnemy 2 points 3 days ago You’re both morons and those sound like bullshit but if they were real would be justified permalink parent award report block reply MacGordon OP -1 points 3 days ago I'm fully willing to pull a screen-grab so that I can come back and call you a retard. That is, if you're willing to accept the moniker. permalink parent award report block reply NeverInterruptEnemy 1 points 3 days ago Where do you think you are right now? permalink parent award report block reply view 1 more comments...\nMacGordon OP -5 points 3 days ago I got banned from saying the same in r/keto. permalink parent award report block reply NeverInterruptEnemy 2 points 3 days ago You’re both morons and those sound like bullshit but if they were real would be justified permalink parent award report block reply MacGordon OP -1 points 3 days ago I'm fully willing to pull a screen-grab so that I can come back and call you a retard. That is, if you're willing to accept the moniker. permalink parent award report block reply NeverInterruptEnemy 1 points 3 days ago Where do you think you are right now? permalink parent award report block reply view 1 more comments...\nNeverInterruptEnemy 2 points 3 days ago You’re both morons and those sound like bullshit but if they were real would be justified permalink parent award report block reply MacGordon OP -1 points 3 days ago I'm fully willing to pull a screen-grab so that I can come back and call you a retard. That is, if you're willing to accept the moniker. permalink parent award report block reply NeverInterruptEnemy 1 points 3 days ago Where do you think you are right now? permalink parent award report block reply view 1 more comments...\nMacGordon OP -1 points 3 days ago I'm fully willing to pull a screen-grab so that I can come back and call you a retard. That is, if you're willing to accept the moniker. permalink parent award report block reply NeverInterruptEnemy 1 points 3 days ago Where do you think you are right now? permalink parent award report block reply view 1 more comments...\nNeverInterruptEnemy 1 points 3 days ago Where do you think you are right now? permalink parent award report block reply view 1 more comments...",
  "fetched_at": "2025-11-12T23:15:29.268858Z"
}