{
  "id": "1ARK9nNyli",
  "url": "https://patriots.win/p/1ARK9nNyli/canada-is-a-problem-for-america/c",
  "content": "124 Canada is a problem for America posted 7 hours ago by TexasRepublic 5 comments award share report block DC_Draino @DC_Draino • 2d This is pretty wild. Canadian “CIA” (CSIS) tried to make Lauren Southern an informant to get information on American influencers. They threatened her with criminal prosecutions if she didn’t cooperate and instead she posted the conversation. Canada is fully tyrannical. Lauren Southern @Lauren_Southern • 2d Intelligence agents showed up at my door late last year. I told them to leave. They proceeded to call me from anonymous numbers repeatedly. Contacted my gym. Told me they wouldn’t go away unless I “built a relationship with them” as an asset. “Your audience will never know”\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style FusionBlack 3 points 7 hours ago Same type of thing happened here during covid . The problem is LE and its control by corrupt politicians. This is universal. permalink award report block reply MocksFordComma 2 points 6 hours ago The entirelty of western civilization is run by corrupt officials in critical positions, who pick and choose people to use as levers in critical situations. I think we need an entire reset of people in government. permalink award report block reply elgordo 1 points 5 hours ago When you see ANY politician here or in Canada doing crazy shit that is so out of touch and obviously harming the city, state or country that the politician represents, you know that they probably got one of these calls at some point. Everyone says \"incompetence\" but its not incompetence to actively flood illegals into a country or catch and release literal murderers back onto city streets. Its a plan. permalink award report block reply Samsonlike 0 points 6 hours ago He mentioned Tim Pool. Is Tim Pool compromised by the Intelligence Community? permalink award report block reply YaharaRiver -2 points 5 hours ago She’s always been a smart cookie.  Her content comes in waves, sometimes a lot, sometimes not much. Trolls here were calling her a “whooooooooooooore” permalink award report block reply\nFusionBlack 3 points 7 hours ago Same type of thing happened here during covid . The problem is LE and its control by corrupt politicians. This is universal. permalink award report block reply\nMocksFordComma 2 points 6 hours ago The entirelty of western civilization is run by corrupt officials in critical positions, who pick and choose people to use as levers in critical situations. I think we need an entire reset of people in government. permalink award report block reply\nelgordo 1 points 5 hours ago When you see ANY politician here or in Canada doing crazy shit that is so out of touch and obviously harming the city, state or country that the politician represents, you know that they probably got one of these calls at some point. Everyone says \"incompetence\" but its not incompetence to actively flood illegals into a country or catch and release literal murderers back onto city streets. Its a plan. permalink award report block reply\nSamsonlike 0 points 6 hours ago He mentioned Tim Pool. Is Tim Pool compromised by the Intelligence Community? permalink award report block reply\nYaharaRiver -2 points 5 hours ago She’s always been a smart cookie.  Her content comes in waves, sometimes a lot, sometimes not much. Trolls here were calling her a “whooooooooooooore” permalink award report block reply",
  "fetched_at": "2025-11-12T20:38:50.343826Z"
}