{
  "id": "8185153",
  "title": "189How can we take 600k Chinese students if we can't even deport 600k foreign criminals?BE  LESS  RE",
  "url": "https://patriots.win/p/1ARK9nNyy3/how-can-we-take-600k-chinese-stu/c",
  "content": "189 How can we take 600k Chinese students if we can't even deport 600k foreign criminals? BE  LESS  RETARDED posted 5 hours ago by MemoryHoleyeO 6 comments award share report block Not to include it's out right retarded on training our enemy and taking away opportunity from Americans to fill those spots\n6 comments Sort by Top Top New Worst Old Save Pepbrandt 7 points 5 hours ago Yep, and Trump just doubled down on literally the most retarded comment in political history. \"Well, the President’s point of view is that what would happen if you didn’t have those 600,000 students, is that you’d empty them from the top, all the students would go up to better schools, and the bottom 15% of universities and colleges would go out of business in America.\" Howard Lutnick, the U.S. Secretary of Commerce, Aug 25th, 2025. My question is, why is this Trump's point of view? Where'd he get this retarded idea? permalink award report block reply KartoffelPuffer 4 points 3 hours ago If this is true Trump is a danger to capitalism.  Even the \"best\" US schools are garbage - the last thing we need is the bottom 15% propped up by Communists. permalink parent award report block reply MakeAmericaGreat9 2 points 4 hours ago Rare earths permalink parent award report block reply Shitsbrokeyo 1 points 1 hour ago We already have ro many foreign students. That's a lot of sworn spies. permalink award report block reply blitzkrieg1 1 points 3 hours ago Colleges are demonrat training facilities. I would never want chinks to miss out on that useless shit. permalink award report block reply Reclaimer69 1 points 58 minutes ago How many Chinese Nationals have been caught sneaking in biological agents? Seems like we'll have more soon, so I wouldn't go counting again just yet. permalink award report block reply\nPepbrandt 7 points 5 hours ago Yep, and Trump just doubled down on literally the most retarded comment in political history. \"Well, the President’s point of view is that what would happen if you didn’t have those 600,000 students, is that you’d empty them from the top, all the students would go up to better schools, and the bottom 15% of universities and colleges would go out of business in America.\" Howard Lutnick, the U.S. Secretary of Commerce, Aug 25th, 2025. My question is, why is this Trump's point of view? Where'd he get this retarded idea? permalink award report block reply KartoffelPuffer 4 points 3 hours ago If this is true Trump is a danger to capitalism.  Even the \"best\" US schools are garbage - the last thing we need is the bottom 15% propped up by Communists. permalink parent award report block reply MakeAmericaGreat9 2 points 4 hours ago Rare earths permalink parent award report block reply\nKartoffelPuffer 4 points 3 hours ago If this is true Trump is a danger to capitalism.  Even the \"best\" US schools are garbage - the last thing we need is the bottom 15% propped up by Communists. permalink parent award report block reply\nMakeAmericaGreat9 2 points 4 hours ago Rare earths permalink parent award report block reply\nShitsbrokeyo 1 points 1 hour ago We already have ro many foreign students. That's a lot of sworn spies. permalink award report block reply\nblitzkrieg1 1 points 3 hours ago Colleges are demonrat training facilities. I would never want chinks to miss out on that useless shit. permalink award report block reply\nReclaimer69 1 points 58 minutes ago How many Chinese Nationals have been caught sneaking in biological agents? Seems like we'll have more soon, so I wouldn't go counting again just yet. permalink award report block reply"
}