{
  "id": "1ARK54T2az",
  "url": "https://patriots.win/p/1ARK54T2az/-scott-bessent-is-currently-hold/c",
  "content": "887 🚨 Scott Bessent is currently holding the FIRST USA-produced rare earth magnet in 25 years.\n\n\"We are on our way to SOLVING the Chinese chokehold that they have!\" posted 5 days ago by DeusVult1096 64 comments award share report block Rapid Response 47 @RapidResponse47 • 5d 📍South Carolina: @SecScottBessent hold the first rare-earth magnet produced in the United States in 25 years. \"We are on our way to solving the Chinese chokehold that they have... this is @POTUS' all-hands-on-deck for this national emergency.\"\n64 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget SubmarineGuy 37 points 5 days ago Oddly enough Sweden should be the Rare Earth country of note. Many of the rare earth elements got their name from a mine in Sweden . permalink award report block reply BeauHD 29 points 5 days ago We have rare earth elements in the USA. They just have to be extracted from the ground. permalink parent award report block reply DickTick PRO 11 points 5 days ago Not all things are equal though... there is a big difference between having them and knowing that extracting them either costs way way too much or is way too difficult versus other countries who just have much richer deposits that are for whatever reason more easily mined, accessible and way cheaper because of it Just saying we have them in our own country doesn't mean that they are accessible enough to be able to offset the amount we need now and into the next 10 or 15 years permalink parent award report block reply CS_McFisticuffs_III 11 points 5 days ago The issue, as I understand it, is that processing rare earths creates large amounts of hazardous waste, so countries with low standards for handling that waste have a significant advantage. permalink parent award report block reply goldwater4ever 2 points 5 days ago Maybe since we gave Argentina 40 billion dollars (while DOJ seeks to block SNAP, no less) and started importing their hoof and mouth beef, we could just dump our hazardous rare earth waste somewhere in their country.. permalink parent award report block reply view 3 more comments... Skogin 4 points 5 days ago Rare is accurate. It’s silly to say these elements aren’t rare just because they are everywhere, with concentrations less than one part per billion. permalink parent award report block reply DickTick PRO 6 points 5 days ago Bingo. permalink parent award report block reply GA_Logic 3 points 5 days ago Californian liberals are the roadblock. permalink parent award report block reply LogicCircuits 2 points 5 days ago but you have to destroy a TON of land mining for tiny bits of them permalink parent award report block reply 7PC_Principle -8 points 5 days ago Lol funny except the stock market has been crashing this whole week and tech layoffs are increasing.\nStrong economy my ass!!! permalink parent award report block reply LaMigraEspecial 5 points 5 days ago The AI bubble could be showing its first signs of popping. permalink parent award report block reply 7PC_Principle -2 points 5 days ago Lol NOPE.\nAWS laid off some 14k people to replace them with  AI.\nCheck the Amazon blog posts about that and WARN letters permalink parent award report block reply Yawnz13 4 points 5 days ago Man, it's almost like those tech layoffs might have something to do with the crackdown on H1B visas. permalink parent award report block reply 7PC_Principle -1 points 5 days ago Lmao NO.\nH1B 100k fee doesn't apply to H1Bs that are already here and are working. 100k fee only applies to new applications of H1B. And if you are living under a rock all this time .. Trump promised Modi to give H1B exceptions to India 🤣🤣.. So explain to me why he promised to give exceptions to India for H1B visas??🤣 This is why you should NEVER believe the propaganda bullshit that's coming from Trump and the company.. permalink parent award report block reply view 1 more comments... RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply UsernameChexOut 5 points 5 days ago [insert IKEA joke here] permalink parent award report block reply DT170x 4 points 5 days ago [1x Hex key] permalink parent award report block reply Hamadryad 26 points 5 days ago We need more manufacturing in the US.  It not only brings jobs and less dependent on foreign countries, but the engineering jobs involved brings a more educated populace. permalink award report block reply FatigueIsReal 16 points 5 days ago Manufacturing has been reshoring since Trump's first term. Still a long way to go, but the pendulum is swinging rapidly in our favor. permalink parent award report block reply Skogin 9 points 5 days ago This pendulum has no brakes. permalink parent award report block reply Gandizzle 8 points 5 days ago But I remember a study back in the day that said we will run out of engineers by 2001, so we should have a program that makes sure we get extremely skilled engineers from countries that have piles of garbage in every street view. permalink parent award report block reply JoeBidensDementia1 24 points 5 days ago First rare-earth magnet in 25 years? Created in less than 8 months? This tells me every president before Trump have been slaves to China. permalink award report block reply Skogin 9 points 5 days ago Chynah was the excuse, but regulations were the reason. permalink parent award report block reply KekistanPM 15 points 5 days ago The first in 25 years? I guess you could say that magnet is...rare... permalink award report block reply Skogin 5 points 5 days ago It’s Orange Man’s now. permalink parent award report block reply ltbadpuppy 12 points 5 days ago Mitch McConnel must be furious they're taking away money from his wife's shipping buisness with the CCP. permalink award report block reply O__Q 1 points 5 days ago Not yet, but he certainly will be when his current glitch spree subsides and he comes to. permalink parent award report block reply Datamancer 6 points 5 days ago Very cool.  Getting America back to its detached state of pre-WW I would be a very good thing.  God has given to us in abundance.   We should be grateful, not only in prayer, but in use of the abundance. So Elongated Muscrat, Mr. Trillionare, how about prototyping the retrieval and refining of minerals from the asteroid belts? permalink award report block reply TheSwampThang 6 points 5 days ago Possible Scientific breakthrough that never materialize.  Tomorrow we'll talk about the new cancer cure. permalink award report block reply SedimentTrap 4 points 5 days ago scott's the man! permalink award report block reply RocksCanOnlyWait 3 points 5 days ago It's regulation and cost which is the biggest hurdle to mineral extraction in the US. Some is geography - we don't have many economically viable deposits. permalink award report block reply Awakened 3 points 5 days ago What I don't understand is that they opened a few during his last term. What happened to those? permalink award report block reply Hoshi 2 points 5 days ago Scott Bessent I am sure has all his investments in this with heavy gov subsidies. The guy was a hedge fund manager under Soros and was the guy who stopped Doge from auditing the Fed and Fort Knox. permalink award report block reply DJT4MoreYears 2 points 5 days ago ^^^ This. I warned people about this Soros Bessent stooge in a prior meme. Many \"MAGA\" people in here are fucking clueless and down-vote me. This guy is not MAGA. People need to wake up. permalink parent award report block reply Hoshi 2 points 5 days ago People on here glaze anything Trump like his last term picking mostly backstabbers didn't clue people in. I think the only people worth mentioning actually doing a major good job in the MAGA space is Judicial Watch, OMG Media, Tulsi Gabbard, and RFK Jr. Bondi has been cashing out along with her second in command who doesn't even want to prosecute Comey and Brannon and then we have Cash Patel wanting to be a local super cop flying around with his girlfriend going to party's, and Narco Rubio wants us to invade South America and sabotage Russian peace efforts. The admin has become a shit show and Trump needs to use his brain and listen to the voters again like he was until May and then the Epstein shit happened which started all of this. permalink parent award report block reply BeauHD 2 points 5 days ago hold the first rare-earth magnet produced in the United States in 25 years. That's a giant assumption. permalink award report block reply Elencher 2 points 5 days ago I'm desperately holding onto the hope is that the reason Trump isn't going scorched Earth on China is just buying time until this dependence can get replaced. permalink award report block reply America_No_1 2 points 5 days ago Amazing what a competing nation can do to the world when they arent busy nation building and fighting other country's wars permalink award report block reply MonolitoVeritas 2 points 5 days ago Here in the USA we can get oil from rocks.  It costs and took some know how but we  figured it out. And when oil is 50 bucks a barrel or more it is cheaper for the us to get oil from rocks.  Soooo, we can do the same thing with rare earth elements.  give us some time and it won't matter how hard it was or is for the rest of the world. permalink award report block reply CaliAli 2 points 5 days ago Good, Fuck China and Fuck Eric Swalwell. permalink award report block reply mykillk 1 points 5 days ago Jeez this really hits home how fucked we would be if the globalized manufacturing chain broke down. We didn’t even have the capability to make a high end magnet for the last 25 years. permalink award report block reply asdrubael_was_right 1 points 5 days ago But how do they work? permalink award report block reply Bax101 1 points 5 days ago Sweep the deep ocean for rare earths. permalink award report block reply SteelDriver 1 points 5 days ago OK.  So, it's a start.  We have long way to go to even cut into their monopoly. permalink award report block reply MythArcana 1 points 5 days ago We need a democrat magnet, then throw it into the sea.  🌊 🧲💨 permalink award report block reply ShadowInv 1 points 5 days ago “How do they work?” … little miracles permalink award report block reply jeffwalker1776 -1 points 5 days ago Wow, at the rate of 1 per year we'll beat China by... 20025! permalink award report block reply Krat -1 points 5 days ago 0 arrests permalink award report block reply FatigueIsReal 9 points 5 days ago Who should Scott Bessent be arresting? permalink parent award report block reply Opi33 -10 points 5 days ago Thats cool, how about the Epstein list? permalink award report block reply DT170x 13 points 5 days ago I have Notice something. If Trump is doing something positive. The Froum Sliders will try to spin it into a negative. permalink parent award report block reply hatredcopter 6 points 5 days ago Only just now? Some entire threads turn into this shit. permalink parent award report block reply DT170x 5 points 5 days ago No.  I noticed it since Shortly before Trump got into office. Also Bonus points they start with the words.  Good,Cool,Awesome,or Great before they insert the sliding topic afterwards. permalink parent award report block reply GA_Logic 4 points 5 days ago Liberals do that often when you point out something great about America. permalink parent award report block reply IncredibleMrE1 10 points 5 days ago Last I checked, Bessent runs Treasury not DOJ/FBI. Go bitch to Kashapp and Bill Barrbie instead of forum sliding. permalink parent award report block reply notsuicidalatall 6 points 5 days ago you are on it. permalink parent award report block reply BeauHD 1 points 5 days ago \"Epstein did nothing wrong!\" -- Kash permalink parent award report block reply Datamancer -2 points 5 days ago Along with a dozen of so posters tasked with defending the Mazel Tov line. [EDIT] Looks like I angered them. Thanks for proving my point. permalink parent award report block reply Krat 0 points 5 days ago Trump says it was democrat fake news permalink parent award report block reply load 1 more comments...\nSubmarineGuy 37 points 5 days ago Oddly enough Sweden should be the Rare Earth country of note. Many of the rare earth elements got their name from a mine in Sweden . permalink award report block reply BeauHD 29 points 5 days ago We have rare earth elements in the USA. They just have to be extracted from the ground. permalink parent award report block reply DickTick PRO 11 points 5 days ago Not all things are equal though... there is a big difference between having them and knowing that extracting them either costs way way too much or is way too difficult versus other countries who just have much richer deposits that are for whatever reason more easily mined, accessible and way cheaper because of it Just saying we have them in our own country doesn't mean that they are accessible enough to be able to offset the amount we need now and into the next 10 or 15 years permalink parent award report block reply CS_McFisticuffs_III 11 points 5 days ago The issue, as I understand it, is that processing rare earths creates large amounts of hazardous waste, so countries with low standards for handling that waste have a significant advantage. permalink parent award report block reply goldwater4ever 2 points 5 days ago Maybe since we gave Argentina 40 billion dollars (while DOJ seeks to block SNAP, no less) and started importing their hoof and mouth beef, we could just dump our hazardous rare earth waste somewhere in their country.. permalink parent award report block reply view 3 more comments... Skogin 4 points 5 days ago Rare is accurate. It’s silly to say these elements aren’t rare just because they are everywhere, with concentrations less than one part per billion. permalink parent award report block reply DickTick PRO 6 points 5 days ago Bingo. permalink parent award report block reply GA_Logic 3 points 5 days ago Californian liberals are the roadblock. permalink parent award report block reply LogicCircuits 2 points 5 days ago but you have to destroy a TON of land mining for tiny bits of them permalink parent award report block reply 7PC_Principle -8 points 5 days ago Lol funny except the stock market has been crashing this whole week and tech layoffs are increasing.\nStrong economy my ass!!! permalink parent award report block reply LaMigraEspecial 5 points 5 days ago The AI bubble could be showing its first signs of popping. permalink parent award report block reply 7PC_Principle -2 points 5 days ago Lol NOPE.\nAWS laid off some 14k people to replace them with  AI.\nCheck the Amazon blog posts about that and WARN letters permalink parent award report block reply Yawnz13 4 points 5 days ago Man, it's almost like those tech layoffs might have something to do with the crackdown on H1B visas. permalink parent award report block reply 7PC_Principle -1 points 5 days ago Lmao NO.\nH1B 100k fee doesn't apply to H1Bs that are already here and are working. 100k fee only applies to new applications of H1B. And if you are living under a rock all this time .. Trump promised Modi to give H1B exceptions to India 🤣🤣.. So explain to me why he promised to give exceptions to India for H1B visas??🤣 This is why you should NEVER believe the propaganda bullshit that's coming from Trump and the company.. permalink parent award report block reply view 1 more comments... RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply UsernameChexOut 5 points 5 days ago [insert IKEA joke here] permalink parent award report block reply DT170x 4 points 5 days ago [1x Hex key] permalink parent award report block reply\nBeauHD 29 points 5 days ago We have rare earth elements in the USA. They just have to be extracted from the ground. permalink parent award report block reply DickTick PRO 11 points 5 days ago Not all things are equal though... there is a big difference between having them and knowing that extracting them either costs way way too much or is way too difficult versus other countries who just have much richer deposits that are for whatever reason more easily mined, accessible and way cheaper because of it Just saying we have them in our own country doesn't mean that they are accessible enough to be able to offset the amount we need now and into the next 10 or 15 years permalink parent award report block reply CS_McFisticuffs_III 11 points 5 days ago The issue, as I understand it, is that processing rare earths creates large amounts of hazardous waste, so countries with low standards for handling that waste have a significant advantage. permalink parent award report block reply goldwater4ever 2 points 5 days ago Maybe since we gave Argentina 40 billion dollars (while DOJ seeks to block SNAP, no less) and started importing their hoof and mouth beef, we could just dump our hazardous rare earth waste somewhere in their country.. permalink parent award report block reply view 3 more comments... Skogin 4 points 5 days ago Rare is accurate. It’s silly to say these elements aren’t rare just because they are everywhere, with concentrations less than one part per billion. permalink parent award report block reply DickTick PRO 6 points 5 days ago Bingo. permalink parent award report block reply GA_Logic 3 points 5 days ago Californian liberals are the roadblock. permalink parent award report block reply LogicCircuits 2 points 5 days ago but you have to destroy a TON of land mining for tiny bits of them permalink parent award report block reply 7PC_Principle -8 points 5 days ago Lol funny except the stock market has been crashing this whole week and tech layoffs are increasing.\nStrong economy my ass!!! permalink parent award report block reply LaMigraEspecial 5 points 5 days ago The AI bubble could be showing its first signs of popping. permalink parent award report block reply 7PC_Principle -2 points 5 days ago Lol NOPE.\nAWS laid off some 14k people to replace them with  AI.\nCheck the Amazon blog posts about that and WARN letters permalink parent award report block reply Yawnz13 4 points 5 days ago Man, it's almost like those tech layoffs might have something to do with the crackdown on H1B visas. permalink parent award report block reply 7PC_Principle -1 points 5 days ago Lmao NO.\nH1B 100k fee doesn't apply to H1Bs that are already here and are working. 100k fee only applies to new applications of H1B. And if you are living under a rock all this time .. Trump promised Modi to give H1B exceptions to India 🤣🤣.. So explain to me why he promised to give exceptions to India for H1B visas??🤣 This is why you should NEVER believe the propaganda bullshit that's coming from Trump and the company.. permalink parent award report block reply view 1 more comments... RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nDickTick PRO 11 points 5 days ago Not all things are equal though... there is a big difference between having them and knowing that extracting them either costs way way too much or is way too difficult versus other countries who just have much richer deposits that are for whatever reason more easily mined, accessible and way cheaper because of it Just saying we have them in our own country doesn't mean that they are accessible enough to be able to offset the amount we need now and into the next 10 or 15 years permalink parent award report block reply CS_McFisticuffs_III 11 points 5 days ago The issue, as I understand it, is that processing rare earths creates large amounts of hazardous waste, so countries with low standards for handling that waste have a significant advantage. permalink parent award report block reply goldwater4ever 2 points 5 days ago Maybe since we gave Argentina 40 billion dollars (while DOJ seeks to block SNAP, no less) and started importing their hoof and mouth beef, we could just dump our hazardous rare earth waste somewhere in their country.. permalink parent award report block reply view 3 more comments... Skogin 4 points 5 days ago Rare is accurate. It’s silly to say these elements aren’t rare just because they are everywhere, with concentrations less than one part per billion. permalink parent award report block reply DickTick PRO 6 points 5 days ago Bingo. permalink parent award report block reply\nCS_McFisticuffs_III 11 points 5 days ago The issue, as I understand it, is that processing rare earths creates large amounts of hazardous waste, so countries with low standards for handling that waste have a significant advantage. permalink parent award report block reply goldwater4ever 2 points 5 days ago Maybe since we gave Argentina 40 billion dollars (while DOJ seeks to block SNAP, no less) and started importing their hoof and mouth beef, we could just dump our hazardous rare earth waste somewhere in their country.. permalink parent award report block reply view 3 more comments...\ngoldwater4ever 2 points 5 days ago Maybe since we gave Argentina 40 billion dollars (while DOJ seeks to block SNAP, no less) and started importing their hoof and mouth beef, we could just dump our hazardous rare earth waste somewhere in their country.. permalink parent award report block reply view 3 more comments...\nSkogin 4 points 5 days ago Rare is accurate. It’s silly to say these elements aren’t rare just because they are everywhere, with concentrations less than one part per billion. permalink parent award report block reply DickTick PRO 6 points 5 days ago Bingo. permalink parent award report block reply\nDickTick PRO 6 points 5 days ago Bingo. permalink parent award report block reply\nGA_Logic 3 points 5 days ago Californian liberals are the roadblock. permalink parent award report block reply\nLogicCircuits 2 points 5 days ago but you have to destroy a TON of land mining for tiny bits of them permalink parent award report block reply\n7PC_Principle -8 points 5 days ago Lol funny except the stock market has been crashing this whole week and tech layoffs are increasing.\nStrong economy my ass!!! permalink parent award report block reply LaMigraEspecial 5 points 5 days ago The AI bubble could be showing its first signs of popping. permalink parent award report block reply 7PC_Principle -2 points 5 days ago Lol NOPE.\nAWS laid off some 14k people to replace them with  AI.\nCheck the Amazon blog posts about that and WARN letters permalink parent award report block reply Yawnz13 4 points 5 days ago Man, it's almost like those tech layoffs might have something to do with the crackdown on H1B visas. permalink parent award report block reply 7PC_Principle -1 points 5 days ago Lmao NO.\nH1B 100k fee doesn't apply to H1Bs that are already here and are working. 100k fee only applies to new applications of H1B. And if you are living under a rock all this time .. Trump promised Modi to give H1B exceptions to India 🤣🤣.. So explain to me why he promised to give exceptions to India for H1B visas??🤣 This is why you should NEVER believe the propaganda bullshit that's coming from Trump and the company.. permalink parent award report block reply view 1 more comments... RememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nLaMigraEspecial 5 points 5 days ago The AI bubble could be showing its first signs of popping. permalink parent award report block reply 7PC_Principle -2 points 5 days ago Lol NOPE.\nAWS laid off some 14k people to replace them with  AI.\nCheck the Amazon blog posts about that and WARN letters permalink parent award report block reply\n7PC_Principle -2 points 5 days ago Lol NOPE.\nAWS laid off some 14k people to replace them with  AI.\nCheck the Amazon blog posts about that and WARN letters permalink parent award report block reply\nYawnz13 4 points 5 days ago Man, it's almost like those tech layoffs might have something to do with the crackdown on H1B visas. permalink parent award report block reply 7PC_Principle -1 points 5 days ago Lmao NO.\nH1B 100k fee doesn't apply to H1Bs that are already here and are working. 100k fee only applies to new applications of H1B. And if you are living under a rock all this time .. Trump promised Modi to give H1B exceptions to India 🤣🤣.. So explain to me why he promised to give exceptions to India for H1B visas??🤣 This is why you should NEVER believe the propaganda bullshit that's coming from Trump and the company.. permalink parent award report block reply view 1 more comments...\n7PC_Principle -1 points 5 days ago Lmao NO.\nH1B 100k fee doesn't apply to H1Bs that are already here and are working. 100k fee only applies to new applications of H1B. And if you are living under a rock all this time .. Trump promised Modi to give H1B exceptions to India 🤣🤣.. So explain to me why he promised to give exceptions to India for H1B visas??🤣 This is why you should NEVER believe the propaganda bullshit that's coming from Trump and the company.. permalink parent award report block reply view 1 more comments...\nRememberCharlieKirk 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nUsernameChexOut 5 points 5 days ago [insert IKEA joke here] permalink parent award report block reply DT170x 4 points 5 days ago [1x Hex key] permalink parent award report block reply\nDT170x 4 points 5 days ago [1x Hex key] permalink parent award report block reply\nHamadryad 26 points 5 days ago We need more manufacturing in the US.  It not only brings jobs and less dependent on foreign countries, but the engineering jobs involved brings a more educated populace. permalink award report block reply FatigueIsReal 16 points 5 days ago Manufacturing has been reshoring since Trump's first term. Still a long way to go, but the pendulum is swinging rapidly in our favor. permalink parent award report block reply Skogin 9 points 5 days ago This pendulum has no brakes. permalink parent award report block reply Gandizzle 8 points 5 days ago But I remember a study back in the day that said we will run out of engineers by 2001, so we should have a program that makes sure we get extremely skilled engineers from countries that have piles of garbage in every street view. permalink parent award report block reply\nFatigueIsReal 16 points 5 days ago Manufacturing has been reshoring since Trump's first term. Still a long way to go, but the pendulum is swinging rapidly in our favor. permalink parent award report block reply Skogin 9 points 5 days ago This pendulum has no brakes. permalink parent award report block reply\nSkogin 9 points 5 days ago This pendulum has no brakes. permalink parent award report block reply\nGandizzle 8 points 5 days ago But I remember a study back in the day that said we will run out of engineers by 2001, so we should have a program that makes sure we get extremely skilled engineers from countries that have piles of garbage in every street view. permalink parent award report block reply\nJoeBidensDementia1 24 points 5 days ago First rare-earth magnet in 25 years? Created in less than 8 months? This tells me every president before Trump have been slaves to China. permalink award report block reply Skogin 9 points 5 days ago Chynah was the excuse, but regulations were the reason. permalink parent award report block reply\nSkogin 9 points 5 days ago Chynah was the excuse, but regulations were the reason. permalink parent award report block reply\nKekistanPM 15 points 5 days ago The first in 25 years? I guess you could say that magnet is...rare... permalink award report block reply Skogin 5 points 5 days ago It’s Orange Man’s now. permalink parent award report block reply\nSkogin 5 points 5 days ago It’s Orange Man’s now. permalink parent award report block reply\nltbadpuppy 12 points 5 days ago Mitch McConnel must be furious they're taking away money from his wife's shipping buisness with the CCP. permalink award report block reply O__Q 1 points 5 days ago Not yet, but he certainly will be when his current glitch spree subsides and he comes to. permalink parent award report block reply\nO__Q 1 points 5 days ago Not yet, but he certainly will be when his current glitch spree subsides and he comes to. permalink parent award report block reply\nDatamancer 6 points 5 days ago Very cool.  Getting America back to its detached state of pre-WW I would be a very good thing.  God has given to us in abundance.   We should be grateful, not only in prayer, but in use of the abundance. So Elongated Muscrat, Mr. Trillionare, how about prototyping the retrieval and refining of minerals from the asteroid belts? permalink award report block reply\nTheSwampThang 6 points 5 days ago Possible Scientific breakthrough that never materialize.  Tomorrow we'll talk about the new cancer cure. permalink award report block reply\nSedimentTrap 4 points 5 days ago scott's the man! permalink award report block reply\nRocksCanOnlyWait 3 points 5 days ago It's regulation and cost which is the biggest hurdle to mineral extraction in the US. Some is geography - we don't have many economically viable deposits. permalink award report block reply\nAwakened 3 points 5 days ago What I don't understand is that they opened a few during his last term. What happened to those? permalink award report block reply\nHoshi 2 points 5 days ago Scott Bessent I am sure has all his investments in this with heavy gov subsidies. The guy was a hedge fund manager under Soros and was the guy who stopped Doge from auditing the Fed and Fort Knox. permalink award report block reply DJT4MoreYears 2 points 5 days ago ^^^ This. I warned people about this Soros Bessent stooge in a prior meme. Many \"MAGA\" people in here are fucking clueless and down-vote me. This guy is not MAGA. People need to wake up. permalink parent award report block reply Hoshi 2 points 5 days ago People on here glaze anything Trump like his last term picking mostly backstabbers didn't clue people in. I think the only people worth mentioning actually doing a major good job in the MAGA space is Judicial Watch, OMG Media, Tulsi Gabbard, and RFK Jr. Bondi has been cashing out along with her second in command who doesn't even want to prosecute Comey and Brannon and then we have Cash Patel wanting to be a local super cop flying around with his girlfriend going to party's, and Narco Rubio wants us to invade South America and sabotage Russian peace efforts. The admin has become a shit show and Trump needs to use his brain and listen to the voters again like he was until May and then the Epstein shit happened which started all of this. permalink parent award report block reply\nDJT4MoreYears 2 points 5 days ago ^^^ This. I warned people about this Soros Bessent stooge in a prior meme. Many \"MAGA\" people in here are fucking clueless and down-vote me. This guy is not MAGA. People need to wake up. permalink parent award report block reply Hoshi 2 points 5 days ago People on here glaze anything Trump like his last term picking mostly backstabbers didn't clue people in. I think the only people worth mentioning actually doing a major good job in the MAGA space is Judicial Watch, OMG Media, Tulsi Gabbard, and RFK Jr. Bondi has been cashing out along with her second in command who doesn't even want to prosecute Comey and Brannon and then we have Cash Patel wanting to be a local super cop flying around with his girlfriend going to party's, and Narco Rubio wants us to invade South America and sabotage Russian peace efforts. The admin has become a shit show and Trump needs to use his brain and listen to the voters again like he was until May and then the Epstein shit happened which started all of this. permalink parent award report block reply\nHoshi 2 points 5 days ago People on here glaze anything Trump like his last term picking mostly backstabbers didn't clue people in. I think the only people worth mentioning actually doing a major good job in the MAGA space is Judicial Watch, OMG Media, Tulsi Gabbard, and RFK Jr. Bondi has been cashing out along with her second in command who doesn't even want to prosecute Comey and Brannon and then we have Cash Patel wanting to be a local super cop flying around with his girlfriend going to party's, and Narco Rubio wants us to invade South America and sabotage Russian peace efforts. The admin has become a shit show and Trump needs to use his brain and listen to the voters again like he was until May and then the Epstein shit happened which started all of this. permalink parent award report block reply\nBeauHD 2 points 5 days ago hold the first rare-earth magnet produced in the United States in 25 years. That's a giant assumption. permalink award report block reply\nElencher 2 points 5 days ago I'm desperately holding onto the hope is that the reason Trump isn't going scorched Earth on China is just buying time until this dependence can get replaced. permalink award report block reply\nAmerica_No_1 2 points 5 days ago Amazing what a competing nation can do to the world when they arent busy nation building and fighting other country's wars permalink award report block reply\nMonolitoVeritas 2 points 5 days ago Here in the USA we can get oil from rocks.  It costs and took some know how but we  figured it out. And when oil is 50 bucks a barrel or more it is cheaper for the us to get oil from rocks.  Soooo, we can do the same thing with rare earth elements.  give us some time and it won't matter how hard it was or is for the rest of the world. permalink award report block reply\nCaliAli 2 points 5 days ago Good, Fuck China and Fuck Eric Swalwell. permalink award report block reply\nmykillk 1 points 5 days ago Jeez this really hits home how fucked we would be if the globalized manufacturing chain broke down. We didn’t even have the capability to make a high end magnet for the last 25 years. permalink award report block reply\nasdrubael_was_right 1 points 5 days ago But how do they work? permalink award report block reply\nBax101 1 points 5 days ago Sweep the deep ocean for rare earths. permalink award report block reply\nSteelDriver 1 points 5 days ago OK.  So, it's a start.  We have long way to go to even cut into their monopoly. permalink award report block reply\nMythArcana 1 points 5 days ago We need a democrat magnet, then throw it into the sea.  🌊 🧲💨 permalink award report block reply\nShadowInv 1 points 5 days ago “How do they work?” … little miracles permalink award report block reply\njeffwalker1776 -1 points 5 days ago Wow, at the rate of 1 per year we'll beat China by... 20025! permalink award report block reply\nKrat -1 points 5 days ago 0 arrests permalink award report block reply FatigueIsReal 9 points 5 days ago Who should Scott Bessent be arresting? permalink parent award report block reply\nFatigueIsReal 9 points 5 days ago Who should Scott Bessent be arresting? permalink parent award report block reply\nOpi33 -10 points 5 days ago Thats cool, how about the Epstein list? permalink award report block reply DT170x 13 points 5 days ago I have Notice something. If Trump is doing something positive. The Froum Sliders will try to spin it into a negative. permalink parent award report block reply hatredcopter 6 points 5 days ago Only just now? Some entire threads turn into this shit. permalink parent award report block reply DT170x 5 points 5 days ago No.  I noticed it since Shortly before Trump got into office. Also Bonus points they start with the words.  Good,Cool,Awesome,or Great before they insert the sliding topic afterwards. permalink parent award report block reply GA_Logic 4 points 5 days ago Liberals do that often when you point out something great about America. permalink parent award report block reply IncredibleMrE1 10 points 5 days ago Last I checked, Bessent runs Treasury not DOJ/FBI. Go bitch to Kashapp and Bill Barrbie instead of forum sliding. permalink parent award report block reply notsuicidalatall 6 points 5 days ago you are on it. permalink parent award report block reply BeauHD 1 points 5 days ago \"Epstein did nothing wrong!\" -- Kash permalink parent award report block reply Datamancer -2 points 5 days ago Along with a dozen of so posters tasked with defending the Mazel Tov line. [EDIT] Looks like I angered them. Thanks for proving my point. permalink parent award report block reply Krat 0 points 5 days ago Trump says it was democrat fake news permalink parent award report block reply load 1 more comments...\nDT170x 13 points 5 days ago I have Notice something. If Trump is doing something positive. The Froum Sliders will try to spin it into a negative. permalink parent award report block reply hatredcopter 6 points 5 days ago Only just now? Some entire threads turn into this shit. permalink parent award report block reply DT170x 5 points 5 days ago No.  I noticed it since Shortly before Trump got into office. Also Bonus points they start with the words.  Good,Cool,Awesome,or Great before they insert the sliding topic afterwards. permalink parent award report block reply GA_Logic 4 points 5 days ago Liberals do that often when you point out something great about America. permalink parent award report block reply\nhatredcopter 6 points 5 days ago Only just now? Some entire threads turn into this shit. permalink parent award report block reply DT170x 5 points 5 days ago No.  I noticed it since Shortly before Trump got into office. Also Bonus points they start with the words.  Good,Cool,Awesome,or Great before they insert the sliding topic afterwards. permalink parent award report block reply GA_Logic 4 points 5 days ago Liberals do that often when you point out something great about America. permalink parent award report block reply\nDT170x 5 points 5 days ago No.  I noticed it since Shortly before Trump got into office. Also Bonus points they start with the words.  Good,Cool,Awesome,or Great before they insert the sliding topic afterwards. permalink parent award report block reply GA_Logic 4 points 5 days ago Liberals do that often when you point out something great about America. permalink parent award report block reply\nGA_Logic 4 points 5 days ago Liberals do that often when you point out something great about America. permalink parent award report block reply\nIncredibleMrE1 10 points 5 days ago Last I checked, Bessent runs Treasury not DOJ/FBI. Go bitch to Kashapp and Bill Barrbie instead of forum sliding. permalink parent award report block reply\nnotsuicidalatall 6 points 5 days ago you are on it. permalink parent award report block reply\nBeauHD 1 points 5 days ago \"Epstein did nothing wrong!\" -- Kash permalink parent award report block reply Datamancer -2 points 5 days ago Along with a dozen of so posters tasked with defending the Mazel Tov line. [EDIT] Looks like I angered them. Thanks for proving my point. permalink parent award report block reply\nDatamancer -2 points 5 days ago Along with a dozen of so posters tasked with defending the Mazel Tov line. [EDIT] Looks like I angered them. Thanks for proving my point. permalink parent award report block reply\nKrat 0 points 5 days ago Trump says it was democrat fake news permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:06:25.599975Z"
}