{
  "id": "1ARK9l6v8z",
  "url": "https://patriots.win/p/1ARK9l6v8z/1975-vs-2025/c",
  "content": "251 1975 vs 2025 posted 1 day ago by neosin 24 comments award share download report block\n24 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget NotYourMan 18 points 1 day ago That is inflation.  And inflation benefits who?  The banks. permalink award report block reply neosin OP 14 points 1 day ago and who owns those and the Federal Reserve ? permalink parent award report block reply South_Florida_Guy 5 points 1 day ago Hey knock it off with all that antisemitism there buddy! permalink parent award report block reply YaharaRiver -6 points 1 day ago The Federal Reserve System is not \"owned\" by anyone. It is an independent entity within the government, established by the Federal Reserve Act in 1913, and derives its authority from Congress. permalink parent award report block reply neosin OP 4 points 1 day ago The concept of \"ownership\" needs some explaining here, however. The member banks must by law invest 3 percent of their capital as stock in the Reserve Banks, and they cannot sell or trade their stock or even use that stock as collateral to borrow money. They do receive dividends of 6 percent per year from the Reserve Banks and get to elect each Reserve Bank's board of directors. https://www.atlantafed.org/about/federal-reserve-system/just-the-fed-facts Who owns those banks that are receiving these 6% dividends from the Federal Reserve Banks ? permalink parent award report block reply YaharaRiver -1 points 1 day ago The banks receiving dividends from the Federal Reserve Banks are the member banks of the Federal Reserve System, which include all nationally chartered banks and state-chartered banks that choose to join and meet certain requirements. The exact number of banks currently receiving dividends from the Federal Reserve is not specified in the provided context. However, it is noted that approximately 38% of the nation's more than 8,000 banks are members of the Federal Reserve System and thus eligible to receive dividends on their required stock ownership in their regional Federal Reserve Bank. Are you insinuating something other than these facts? permalink parent award report block reply view 1 more comments... based_trekkie 4 points 1 day ago Inflation is a wealth extraction mechanism. permalink parent award report block reply chickeninoven 0 points 18 hours ago Babylonian money magic. permalink parent award report block reply Standingoak 1 points 14 hours ago A  Ponzi by any other name smells as rank. permalink parent award report block reply AmericanMestizo 1 points 18 hours ago Those who recieve and use the new money first. Which is usually the government, followed by banks, big investors, corporations. Money printing is just a back door tax. The goal of taxation is to increase the goverments share of the wealth. Money printing achieves the same goal without taking your money, but by devaluing it. Their share of the money supply increases while yours shrinks. permalink parent award report block reply Standingoak 1 points 14 hours ago In 1933 a house that is now 1.7 Million was purchased for $6000 11 blocks from Rodeo Drive in Beverly Hills. 400 oz  X  $20 = $8000 . Still pretty accurate at 92 years permalink parent award report block reply BlackPilledMAGA 1 points 1 day ago It benefits \"The Haves\". People with hard assets going up continuously over decades and living off the equity in many cases. All the kids coming up will be debt slaves who can never afford any of it. If they don't inherit anything from their parents, they're fucked. Same shit the government does by printing more money endlessly and giving the bill to the unborn. It's a sick and twisted system that will hit a wall eventually. It's inevitable. permalink parent award report block reply Shih_Tabed 1 points 13 hours ago Maybe it will hit a wall someday, but you play the game as if you are trying to win instead of quitting.  I have a portfolio I am building for a Gen Z relative and I am just living off of the dividend payouts in the meantime so we both win.  When I take the dirt nap that relative will have the opportunity to sell the inheritance for trivial or no taxes due to something called the step-up in cost basis.  So I am at least doing something to help.  In your case, you will have to take a step back from your situation and assess your finances.  You are going to find things you are spending money on that you are not using.  You are going to find things that you are spending too much for because of convenience.  There is your money.  This would be \"Beer money\" for some people, but not you.  Stop paying for things you are not using.  Learn to do things the hard way to eliminate paying a premium for convenience.  Stuff money in a sock until you can get a couple grand.  Open a brokerage account with that and just buy VOO and forget about it.  That is an S&P 500 index fund that is about as safe as you can get.  Get used to dumping that money each month as a bill, but you are paying yourself.  Never sell and continue to accumulate dividends over the years and set those dividends to reinvest into new shares.  Don't touch it, just feed it for 30 years with your beer money, or add more if you get into a fortunate position.  If it is one thing you can learn from the photo it is that you want to hold ASSETS not currency. permalink parent award report block reply fskfsk 10 points 1 day ago It's even more offensive if you compare wages.  $64k was maybe 3x a decent average salary in 1975.  In 2025, $1.3M is 10x+ an average salary. permalink award report block reply Madnote1984 4 points 1 day ago Yeah, in 1970 the median house was about 2x the median salary. Today, it's closer to 5x the median salary. permalink parent award report block reply Oodles 5 points 1 day ago It's invisible taxation on anyone with a job permalink award report block reply artifex_mundi_x 3 points 1 day ago This must be from before the summer, gold is $4100 now not $3300. permalink award report block reply midwestdeplorable 2 points 1 day ago I always use the comparison of a nice suit. An ounce of gold 100 years ago bought a nice suit, and the same holds true today. permalink award report block reply Oback_Barama 1 points 22 hours ago A $20 gold price (about nine tenths of an ounce) in 1900 would buy you a new suit, hat, shoes, and a pocket watch. Everything you need to get an interview for a new job. $20 can’t do that today, but nine tenths of an ounce of gold certainly can. permalink parent award report block reply edxzxz 1 points 1 day ago Yeah, the USD has lost value, but gold does not rise and fall in lockstep with the USD, it is a commodity and its price fluctuates wildly regardless of inflation or currency values.  Gold was $400 an ounce around 2006, shot up to $2,000, then tanked to $1,200, shot up recently and then fell sharply - all without any corresponding rise or fall in the number of or value of the USD.  Silver was $50 an ounce in the 1980's, in 2011 and last month - so cherry picking those dates would seem to prove that the USD has held 100% of its value for over 45 years now. permalink award report block reply HanginChad 1 points 1 day ago That looks like a much nicer house in 2025 though. permalink award report block reply keeman 1 points 19 hours ago But very possibly the same human labor to build.  The house on the left had on-site framed ridgebeam and rafter roof.  In the 70's this got replaced by pre-fab press plate trusses that just drop on.  The joists in the house on the left will be 2x12 solid lumber, but BCI on the right hand house.  Left house has plywood sheathing, right has OSB.  Left house has steel windows, right vinyl.  Left house has wood /brick siding, righ house vinyl and sheet faux stucco.  We have gotten a LOT better at making economical houses than in the early 1970s. permalink parent award report block reply 24601 1 points 24 hours ago The dollar changed value in relation to gold, but that's not a measure of inflation since gold is not needed for life. If the dollar was still tied to gold, the house would now be multiple bars of gold.... and that's inflation. Furthermore, the house in 1975 looks like a dump compared to the house in the 2025 side of pic.... and most people complaining about \"What they took from us\" in 2025 would NEVER BUY the house on the 1975 side of the picture.... \"it's too small.  it has one bathroom.  it's only 2 bedrooms..... blah... blah... blah\" permalink award report block reply\nNotYourMan 18 points 1 day ago That is inflation.  And inflation benefits who?  The banks. permalink award report block reply neosin OP 14 points 1 day ago and who owns those and the Federal Reserve ? permalink parent award report block reply South_Florida_Guy 5 points 1 day ago Hey knock it off with all that antisemitism there buddy! permalink parent award report block reply YaharaRiver -6 points 1 day ago The Federal Reserve System is not \"owned\" by anyone. It is an independent entity within the government, established by the Federal Reserve Act in 1913, and derives its authority from Congress. permalink parent award report block reply neosin OP 4 points 1 day ago The concept of \"ownership\" needs some explaining here, however. The member banks must by law invest 3 percent of their capital as stock in the Reserve Banks, and they cannot sell or trade their stock or even use that stock as collateral to borrow money. They do receive dividends of 6 percent per year from the Reserve Banks and get to elect each Reserve Bank's board of directors. https://www.atlantafed.org/about/federal-reserve-system/just-the-fed-facts Who owns those banks that are receiving these 6% dividends from the Federal Reserve Banks ? permalink parent award report block reply YaharaRiver -1 points 1 day ago The banks receiving dividends from the Federal Reserve Banks are the member banks of the Federal Reserve System, which include all nationally chartered banks and state-chartered banks that choose to join and meet certain requirements. The exact number of banks currently receiving dividends from the Federal Reserve is not specified in the provided context. However, it is noted that approximately 38% of the nation's more than 8,000 banks are members of the Federal Reserve System and thus eligible to receive dividends on their required stock ownership in their regional Federal Reserve Bank. Are you insinuating something other than these facts? permalink parent award report block reply view 1 more comments... based_trekkie 4 points 1 day ago Inflation is a wealth extraction mechanism. permalink parent award report block reply chickeninoven 0 points 18 hours ago Babylonian money magic. permalink parent award report block reply Standingoak 1 points 14 hours ago A  Ponzi by any other name smells as rank. permalink parent award report block reply AmericanMestizo 1 points 18 hours ago Those who recieve and use the new money first. Which is usually the government, followed by banks, big investors, corporations. Money printing is just a back door tax. The goal of taxation is to increase the goverments share of the wealth. Money printing achieves the same goal without taking your money, but by devaluing it. Their share of the money supply increases while yours shrinks. permalink parent award report block reply Standingoak 1 points 14 hours ago In 1933 a house that is now 1.7 Million was purchased for $6000 11 blocks from Rodeo Drive in Beverly Hills. 400 oz  X  $20 = $8000 . Still pretty accurate at 92 years permalink parent award report block reply BlackPilledMAGA 1 points 1 day ago It benefits \"The Haves\". People with hard assets going up continuously over decades and living off the equity in many cases. All the kids coming up will be debt slaves who can never afford any of it. If they don't inherit anything from their parents, they're fucked. Same shit the government does by printing more money endlessly and giving the bill to the unborn. It's a sick and twisted system that will hit a wall eventually. It's inevitable. permalink parent award report block reply Shih_Tabed 1 points 13 hours ago Maybe it will hit a wall someday, but you play the game as if you are trying to win instead of quitting.  I have a portfolio I am building for a Gen Z relative and I am just living off of the dividend payouts in the meantime so we both win.  When I take the dirt nap that relative will have the opportunity to sell the inheritance for trivial or no taxes due to something called the step-up in cost basis.  So I am at least doing something to help.  In your case, you will have to take a step back from your situation and assess your finances.  You are going to find things you are spending money on that you are not using.  You are going to find things that you are spending too much for because of convenience.  There is your money.  This would be \"Beer money\" for some people, but not you.  Stop paying for things you are not using.  Learn to do things the hard way to eliminate paying a premium for convenience.  Stuff money in a sock until you can get a couple grand.  Open a brokerage account with that and just buy VOO and forget about it.  That is an S&P 500 index fund that is about as safe as you can get.  Get used to dumping that money each month as a bill, but you are paying yourself.  Never sell and continue to accumulate dividends over the years and set those dividends to reinvest into new shares.  Don't touch it, just feed it for 30 years with your beer money, or add more if you get into a fortunate position.  If it is one thing you can learn from the photo it is that you want to hold ASSETS not currency. permalink parent award report block reply\nneosin OP 14 points 1 day ago and who owns those and the Federal Reserve ? permalink parent award report block reply South_Florida_Guy 5 points 1 day ago Hey knock it off with all that antisemitism there buddy! permalink parent award report block reply YaharaRiver -6 points 1 day ago The Federal Reserve System is not \"owned\" by anyone. It is an independent entity within the government, established by the Federal Reserve Act in 1913, and derives its authority from Congress. permalink parent award report block reply neosin OP 4 points 1 day ago The concept of \"ownership\" needs some explaining here, however. The member banks must by law invest 3 percent of their capital as stock in the Reserve Banks, and they cannot sell or trade their stock or even use that stock as collateral to borrow money. They do receive dividends of 6 percent per year from the Reserve Banks and get to elect each Reserve Bank's board of directors. https://www.atlantafed.org/about/federal-reserve-system/just-the-fed-facts Who owns those banks that are receiving these 6% dividends from the Federal Reserve Banks ? permalink parent award report block reply YaharaRiver -1 points 1 day ago The banks receiving dividends from the Federal Reserve Banks are the member banks of the Federal Reserve System, which include all nationally chartered banks and state-chartered banks that choose to join and meet certain requirements. The exact number of banks currently receiving dividends from the Federal Reserve is not specified in the provided context. However, it is noted that approximately 38% of the nation's more than 8,000 banks are members of the Federal Reserve System and thus eligible to receive dividends on their required stock ownership in their regional Federal Reserve Bank. Are you insinuating something other than these facts? permalink parent award report block reply view 1 more comments...\nSouth_Florida_Guy 5 points 1 day ago Hey knock it off with all that antisemitism there buddy! permalink parent award report block reply\nYaharaRiver -6 points 1 day ago The Federal Reserve System is not \"owned\" by anyone. It is an independent entity within the government, established by the Federal Reserve Act in 1913, and derives its authority from Congress. permalink parent award report block reply neosin OP 4 points 1 day ago The concept of \"ownership\" needs some explaining here, however. The member banks must by law invest 3 percent of their capital as stock in the Reserve Banks, and they cannot sell or trade their stock or even use that stock as collateral to borrow money. They do receive dividends of 6 percent per year from the Reserve Banks and get to elect each Reserve Bank's board of directors. https://www.atlantafed.org/about/federal-reserve-system/just-the-fed-facts Who owns those banks that are receiving these 6% dividends from the Federal Reserve Banks ? permalink parent award report block reply YaharaRiver -1 points 1 day ago The banks receiving dividends from the Federal Reserve Banks are the member banks of the Federal Reserve System, which include all nationally chartered banks and state-chartered banks that choose to join and meet certain requirements. The exact number of banks currently receiving dividends from the Federal Reserve is not specified in the provided context. However, it is noted that approximately 38% of the nation's more than 8,000 banks are members of the Federal Reserve System and thus eligible to receive dividends on their required stock ownership in their regional Federal Reserve Bank. Are you insinuating something other than these facts? permalink parent award report block reply view 1 more comments...\nneosin OP 4 points 1 day ago The concept of \"ownership\" needs some explaining here, however. The member banks must by law invest 3 percent of their capital as stock in the Reserve Banks, and they cannot sell or trade their stock or even use that stock as collateral to borrow money. They do receive dividends of 6 percent per year from the Reserve Banks and get to elect each Reserve Bank's board of directors. https://www.atlantafed.org/about/federal-reserve-system/just-the-fed-facts Who owns those banks that are receiving these 6% dividends from the Federal Reserve Banks ? permalink parent award report block reply YaharaRiver -1 points 1 day ago The banks receiving dividends from the Federal Reserve Banks are the member banks of the Federal Reserve System, which include all nationally chartered banks and state-chartered banks that choose to join and meet certain requirements. The exact number of banks currently receiving dividends from the Federal Reserve is not specified in the provided context. However, it is noted that approximately 38% of the nation's more than 8,000 banks are members of the Federal Reserve System and thus eligible to receive dividends on their required stock ownership in their regional Federal Reserve Bank. Are you insinuating something other than these facts? permalink parent award report block reply view 1 more comments...\nYaharaRiver -1 points 1 day ago The banks receiving dividends from the Federal Reserve Banks are the member banks of the Federal Reserve System, which include all nationally chartered banks and state-chartered banks that choose to join and meet certain requirements. The exact number of banks currently receiving dividends from the Federal Reserve is not specified in the provided context. However, it is noted that approximately 38% of the nation's more than 8,000 banks are members of the Federal Reserve System and thus eligible to receive dividends on their required stock ownership in their regional Federal Reserve Bank. Are you insinuating something other than these facts? permalink parent award report block reply view 1 more comments...\nbased_trekkie 4 points 1 day ago Inflation is a wealth extraction mechanism. permalink parent award report block reply chickeninoven 0 points 18 hours ago Babylonian money magic. permalink parent award report block reply Standingoak 1 points 14 hours ago A  Ponzi by any other name smells as rank. permalink parent award report block reply\nchickeninoven 0 points 18 hours ago Babylonian money magic. permalink parent award report block reply Standingoak 1 points 14 hours ago A  Ponzi by any other name smells as rank. permalink parent award report block reply\nStandingoak 1 points 14 hours ago A  Ponzi by any other name smells as rank. permalink parent award report block reply\nAmericanMestizo 1 points 18 hours ago Those who recieve and use the new money first. Which is usually the government, followed by banks, big investors, corporations. Money printing is just a back door tax. The goal of taxation is to increase the goverments share of the wealth. Money printing achieves the same goal without taking your money, but by devaluing it. Their share of the money supply increases while yours shrinks. permalink parent award report block reply\nStandingoak 1 points 14 hours ago In 1933 a house that is now 1.7 Million was purchased for $6000 11 blocks from Rodeo Drive in Beverly Hills. 400 oz  X  $20 = $8000 . Still pretty accurate at 92 years permalink parent award report block reply\nBlackPilledMAGA 1 points 1 day ago It benefits \"The Haves\". People with hard assets going up continuously over decades and living off the equity in many cases. All the kids coming up will be debt slaves who can never afford any of it. If they don't inherit anything from their parents, they're fucked. Same shit the government does by printing more money endlessly and giving the bill to the unborn. It's a sick and twisted system that will hit a wall eventually. It's inevitable. permalink parent award report block reply Shih_Tabed 1 points 13 hours ago Maybe it will hit a wall someday, but you play the game as if you are trying to win instead of quitting.  I have a portfolio I am building for a Gen Z relative and I am just living off of the dividend payouts in the meantime so we both win.  When I take the dirt nap that relative will have the opportunity to sell the inheritance for trivial or no taxes due to something called the step-up in cost basis.  So I am at least doing something to help.  In your case, you will have to take a step back from your situation and assess your finances.  You are going to find things you are spending money on that you are not using.  You are going to find things that you are spending too much for because of convenience.  There is your money.  This would be \"Beer money\" for some people, but not you.  Stop paying for things you are not using.  Learn to do things the hard way to eliminate paying a premium for convenience.  Stuff money in a sock until you can get a couple grand.  Open a brokerage account with that and just buy VOO and forget about it.  That is an S&P 500 index fund that is about as safe as you can get.  Get used to dumping that money each month as a bill, but you are paying yourself.  Never sell and continue to accumulate dividends over the years and set those dividends to reinvest into new shares.  Don't touch it, just feed it for 30 years with your beer money, or add more if you get into a fortunate position.  If it is one thing you can learn from the photo it is that you want to hold ASSETS not currency. permalink parent award report block reply\nShih_Tabed 1 points 13 hours ago Maybe it will hit a wall someday, but you play the game as if you are trying to win instead of quitting.  I have a portfolio I am building for a Gen Z relative and I am just living off of the dividend payouts in the meantime so we both win.  When I take the dirt nap that relative will have the opportunity to sell the inheritance for trivial or no taxes due to something called the step-up in cost basis.  So I am at least doing something to help.  In your case, you will have to take a step back from your situation and assess your finances.  You are going to find things you are spending money on that you are not using.  You are going to find things that you are spending too much for because of convenience.  There is your money.  This would be \"Beer money\" for some people, but not you.  Stop paying for things you are not using.  Learn to do things the hard way to eliminate paying a premium for convenience.  Stuff money in a sock until you can get a couple grand.  Open a brokerage account with that and just buy VOO and forget about it.  That is an S&P 500 index fund that is about as safe as you can get.  Get used to dumping that money each month as a bill, but you are paying yourself.  Never sell and continue to accumulate dividends over the years and set those dividends to reinvest into new shares.  Don't touch it, just feed it for 30 years with your beer money, or add more if you get into a fortunate position.  If it is one thing you can learn from the photo it is that you want to hold ASSETS not currency. permalink parent award report block reply\nfskfsk 10 points 1 day ago It's even more offensive if you compare wages.  $64k was maybe 3x a decent average salary in 1975.  In 2025, $1.3M is 10x+ an average salary. permalink award report block reply Madnote1984 4 points 1 day ago Yeah, in 1970 the median house was about 2x the median salary. Today, it's closer to 5x the median salary. permalink parent award report block reply\nMadnote1984 4 points 1 day ago Yeah, in 1970 the median house was about 2x the median salary. Today, it's closer to 5x the median salary. permalink parent award report block reply\nOodles 5 points 1 day ago It's invisible taxation on anyone with a job permalink award report block reply\nartifex_mundi_x 3 points 1 day ago This must be from before the summer, gold is $4100 now not $3300. permalink award report block reply\nmidwestdeplorable 2 points 1 day ago I always use the comparison of a nice suit. An ounce of gold 100 years ago bought a nice suit, and the same holds true today. permalink award report block reply Oback_Barama 1 points 22 hours ago A $20 gold price (about nine tenths of an ounce) in 1900 would buy you a new suit, hat, shoes, and a pocket watch. Everything you need to get an interview for a new job. $20 can’t do that today, but nine tenths of an ounce of gold certainly can. permalink parent award report block reply\nOback_Barama 1 points 22 hours ago A $20 gold price (about nine tenths of an ounce) in 1900 would buy you a new suit, hat, shoes, and a pocket watch. Everything you need to get an interview for a new job. $20 can’t do that today, but nine tenths of an ounce of gold certainly can. permalink parent award report block reply\nedxzxz 1 points 1 day ago Yeah, the USD has lost value, but gold does not rise and fall in lockstep with the USD, it is a commodity and its price fluctuates wildly regardless of inflation or currency values.  Gold was $400 an ounce around 2006, shot up to $2,000, then tanked to $1,200, shot up recently and then fell sharply - all without any corresponding rise or fall in the number of or value of the USD.  Silver was $50 an ounce in the 1980's, in 2011 and last month - so cherry picking those dates would seem to prove that the USD has held 100% of its value for over 45 years now. permalink award report block reply\nHanginChad 1 points 1 day ago That looks like a much nicer house in 2025 though. permalink award report block reply keeman 1 points 19 hours ago But very possibly the same human labor to build.  The house on the left had on-site framed ridgebeam and rafter roof.  In the 70's this got replaced by pre-fab press plate trusses that just drop on.  The joists in the house on the left will be 2x12 solid lumber, but BCI on the right hand house.  Left house has plywood sheathing, right has OSB.  Left house has steel windows, right vinyl.  Left house has wood /brick siding, righ house vinyl and sheet faux stucco.  We have gotten a LOT better at making economical houses than in the early 1970s. permalink parent award report block reply\nkeeman 1 points 19 hours ago But very possibly the same human labor to build.  The house on the left had on-site framed ridgebeam and rafter roof.  In the 70's this got replaced by pre-fab press plate trusses that just drop on.  The joists in the house on the left will be 2x12 solid lumber, but BCI on the right hand house.  Left house has plywood sheathing, right has OSB.  Left house has steel windows, right vinyl.  Left house has wood /brick siding, righ house vinyl and sheet faux stucco.  We have gotten a LOT better at making economical houses than in the early 1970s. permalink parent award report block reply\n24601 1 points 24 hours ago The dollar changed value in relation to gold, but that's not a measure of inflation since gold is not needed for life. If the dollar was still tied to gold, the house would now be multiple bars of gold.... and that's inflation. Furthermore, the house in 1975 looks like a dump compared to the house in the 2025 side of pic.... and most people complaining about \"What they took from us\" in 2025 would NEVER BUY the house on the 1975 side of the picture.... \"it's too small.  it has one bathroom.  it's only 2 bedrooms..... blah... blah... blah\" permalink award report block reply",
  "fetched_at": "2025-11-12T20:43:34.746215Z"
}