{
  "id": "1ARK57smSH",
  "url": "https://patriots.win/p/1ARK57smSH/-breaking-an-antiice-attacker-ju/c",
  "content": "1408 💥 BREAKING: An anti-ICE attacker just OPENED FIRE and AMBUSHED Border Patrol agents in Chicago. Send in the troops! 🔥🏛️ MURDEROUS LEFT 🏛️🔥 posted 4 days ago by TheRedPilledArtist 180 comments award share download report block\n180 comments Sort by Top Top New Worst Old Save mlp67 138 points 4 days ago This is on Bondi and Noem. Those two need to fix this shit. Trump needs to quit putting his agents in danger if he's not gonna have their backs. It's getting out of hand and I'm sick of hearing about the abuse they are taking. permalink award report block reply possibletower 50 points 4 days ago I knew it was really weird when ICE/DHS/DOJ kept overhyping that one illegal faggot caught for throwing a rock at a passing ICE vehicle (that didn't even hurt anybody or cause much damage) and they stayed silent and did NOTHING when the very next day there were around 500 illegal aliens at the top of an overpass bridge dropping fucking 100 bricks and cinderblocks onto 20 LAPD police cars and hitting cops in the heads while escaping their vehicles. I was thinking \"why the fuck are Trump/Noem/Bondi not talking about this and why are they not arresting a single illegal alien that destroyed 20 cop cars and smashed at least 5 cops' heads with those bricks?\" permalink parent award report block reply mlp67 27 points 4 days ago I would not work for ICE if I had take this shit day after day. It's a disgrace. permalink parent award report block reply UCantStumpTheTrump 26 points 4 days ago They are being told to stand down, go try attacking a normal beat cop and see what happens to you. Trump doesn't want to give the left optics of ICE agents brutally crushing the protests, but at this point, it's what's needed because they are going to paint us as Nazis no matter what we do permalink parent award report block reply QueensOwn 22 points 4 days ago Don’t use their “language”. This is NOT a “protest”. Throwing objects, blocking federal officers and shooting guns is a full scale RIOT and just might be an insurrection if this type of violence is permitted l permalink parent award report block reply view 3 more comments... FusionBlack 13 points 4 days ago Optics be damned. Think of the optics when an agent is killed. permalink parent award report block reply view 3 more comments... mlp67 9 points 4 days ago Shitty situation for the ICE agents permalink parent award report block reply swift_water 3 points 4 days ago The propaganda on this is VERY effective. I hear all the time that ICE is roughing up children like wtf lol permalink parent award report block reply Tacitus1963 2 points 4 days ago Trump is allowing himself to be control by the Bushite witch, Susie Wiles.\nShe's his Chief of Staff and lives in his ear.\nAnother horrendous choice like Patel and Scam Blondi. permalink parent award report block reply load 1 more comments... mikejones 9 points 4 days ago It's never ending cause USA has the 3rd most people in a country. Lots depend on the government. How are you going to help broke people with no skills and health problems for the next 60 years and raise kids with dead beat parents. permalink parent award report block reply Wtf_socialismreally 2 points 4 days ago No skills we can work with. Health problems we can figure out something for many. What we can't do is make people want to work, and we also can't make the jobs pop up out of the ether. permalink parent award report block reply view 1 more comments... Govtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply roadrunner0 1 points 4 days ago Think about it, at what point will these actions cross the line of legality so the President can enact Martial Law and rip control out of the hands of the Lefty politicians?? We are starting to get close to open rebellion and that would be the tipping point as would daily acts of Leftist terrorism or foreigners doing it.. permalink parent award report block reply mty_green_go -3 points 4 days ago Because it wasn't a Tesla dealership ?? permalink parent award report block reply TheRedPilledArtist OP 20 points 4 days ago An update at 1539 ET: Suspect(s) NOT apprehended. Manhunt underway. Suspect was seen driving a black Jeep earlier. permalink parent award report block reply Hanging_Chad 7 points 4 days ago he should buy a life insurance policy pronto permalink parent award report block reply Krat 7 points 4 days ago Not like hes gonna get arrested and even if he is some commie judge will just release him permalink parent award report block reply Simple_Doot 1 points 4 days ago Free Subway sandwiches in his future. permalink parent award report block reply Viewer01 16 points 4 days ago Idk if you thought they were going to go quietly. This isn’t surprising. It is actually expected. permalink parent award report block reply RentFree2020 12 points 4 days ago I'd like to see all the public figures that called for this to be arrested as well. permalink parent award report block reply Chickensaurus 10 points 4 days ago Wait until they regain power. permalink parent award report block reply mikejones 8 points 4 days ago That's why you should be preparing. How will things be 5 years from now. Nearly 50 trillion in debt and sending money who knows where. permalink parent award report block reply Simple_Doot -7 points 4 days ago The year is 2030.  Bibi Netanyahu is president of the Northen hemisphere.  Our free government issue Teslas wont drive if we have shown an example wrong think.  My 50 year mortgage has been adjusted to a 75 year mortgage, thanks be to Lord Trump.  The grocery store shelves are filled exclusively with food-paste tubes and you must present your Operation Warpspeed chip, provided by Palantir, to even shop.  Our children are taught by Jeffery Epstien A.I. cloans.  This is my sto...*transmission interrupted* permalink parent award report block reply mlp67 3 points 4 days ago I didn't expect the people who are pushing them to do these raids to fail in protecting them and giving them more resources. permalink parent award report block reply American-Patriot 14 points 4 days ago Never trust a jeet and a woman to do a white man's job permalink parent award report block reply HeavyMetalPatriot 8 points 4 days ago THIS!!!!! permalink parent award report block reply ToxicAvengerOhio 6 points 4 days ago He's scared shitless of optics and going to get these guys killed. We're at the \"get what you fucking deserve\" moment for midterms. Be the retribution you said or gtfo permalink parent award report block reply load 19 more comments... Zhongda 50 points 4 days ago People are going to die and we are still going to continue along like everything is fine. permalink award report block reply possibletower 21 points 4 days ago \"The China virus/poison shots combo killed people and we are still going to continue along like everything is fine\" permalink parent award report block reply Aggrieved03 17 points 4 days ago Tens of millions of foreigners rape our wages and literally kill us and we’ve done nothing but target that absolute worst of the worst. China kills 100,000 Americans a year with fentanyl and we’re targeting cocaine smugglers in Venezuela. permalink parent award report block reply ScamBlondie 1 points 4 days ago Actually that’s not true, we also targeted some grandmas who entered the capital building. permalink parent award report block reply shogun5000 1 points 4 days ago Oh so we better just let the commies do whatever? What a timid fuck. permalink parent award report block reply AppalachianTactical 2 points 4 days ago People are going to die so maga and america firsr right wingers can ve labeled actual fascists and meanwhile the number of illegals removed will barely change. permalink parent award report block reply Krat 0 points 4 days ago 0 arrests and counting ! permalink parent award report block reply PROCIsAsshoe 3 points 4 days ago factually inaccurate and yet I've seen you say it countless times these past few weeks. Comey and Bolton already. Brennan and Clapper coming soon. permalink parent award report block reply Krat 3 points 4 days ago Summer of love arrests ? Fuck... in seattle a guy handed out rifles from a trunk and a black kid was shot. Nobody arrested... what of all the riots? All the insider trading ? The ngo corruption, campaign violations, .... The blatant ignoring of trump orders in his first term? The media lies... covid tyranny...  The violence against ice??  The spying .... the rigging.... The ignoring of laws by democrat commie mayors, the corporate violations of racism in dei and federal laws against discrimination...yet I saw democrats hunt down thousands of americans and locked unconstitutionally in cells for years for following police orders in DC.... WHERE ARE THE ARRESTS ?!?!?\nTeachers, politicians, doctors, officials, media heads, mayors, unions, filthy riggers, all of them WE ARE AT FUCKING 0 ARRESTS compared to the glacier that it should be We cant even arrest kid rapists arrested in Seattle... some have 37+ violent attacks and assaults on others ... dont tell me 0 arrests is innacurate... each category is basically at 0 arrests... permalink parent award report block reply Krat 2 points 4 days ago So 2 out of how many that need to be ? 100,000 ? Its more about the principal than the ampunt ... 2 is effectively 0 permalink parent award report block reply mikejones -3 points 4 days ago 86 cops died so far this year. So every couple days when doing the most dangerous job you expect some live rounds. What do you expect to do. Roll around the USA streets like we're in Afghanistan? permalink parent award report block reply Zhongda 12 points 4 days ago I don't care if illegals get pumped full of lead.  I'm not a retarded overly emotional leftist faggot.  Are you? permalink parent award report block reply Firespawn 6 points 4 days ago If they're killing invaders and terrorists, blast away. Some liberal collateral damage wouldn't hurt my feelings one bit either.\nWe are on a crash course towards war any fucking way. permalink parent award report block reply suckmycorona 4 points 4 days ago Dark Brandon was about to do it. permalink parent award report block reply Wtf_socialismreally 2 points 4 days ago Considering the fact that they are in the dens of terrorists... permalink parent award report block reply TheRedPilledArtist OP 33 points 4 days ago It was only a matter of time. We all knew it would come to this. permalink award report block reply OneTypoComment 17 points 4 days ago honestly surprised it has taken this long for some lunatic to act permalink parent award report block reply SGT_Glowie 7 points 4 days ago For real permalink parent award report block reply Sp3nce321 12 points 4 days ago Did you forget about dallas, and the trans fag who shot 3 illegals trying to ambush ice? permalink parent award report block reply Bythrfruitsyknow 7 points 4 days ago Did YOU forget about the policemen who was shot outside the ICE Detention Center in Alvarado, Texas by 10-12 antifa including heavy-weapon troons in July? permalink parent award report block reply VictoryInDefiance 4 points 4 days ago Did YOU forget the Alamo? permalink parent award report block reply Firespawn 3 points 4 days ago Did YOU forget about the things you said when you were drunk? permalink parent award report block reply view 2 more comments... AppalachianTactical -1 points 4 days ago Fed on fed psyop. Spectactle so media can chug along while no illegals are removed. permalink parent award report block reply SaltiTaralli 1 points 4 days ago You might have become a little too jaded. 😅 permalink parent award report block reply AppalachianTactical 1 points 4 days ago Nah, i think im exactly as jaded as we need to be.\nWe are totally fucked. We are betrayed and our side has become retarded. 9 years ago i was called a nazi and racisr by idiots on the left, now i get called a muslim despute having rhe same principles because our side is betrayed and the idiots have flocked to maga. Maga has moved on the america first and are being attacked be rhe neocons/israelis.\nICE will do more to get the righr labeled as fascist than they will actually remove illegals. Its a set up. permalink parent award report block reply IncredibleMrE1 21 points 4 days ago Should have started shooting back months ago. permalink award report block reply deleted 9 points 4 days ago warlord30 1 points 4 days ago thank you glowpede 🙏 permalink parent award report block reply deleted 2 points 4 days ago warlord30 0 points 4 days ago wow ur mean permalink parent award report block reply Firespawn 1 points 4 days ago At the border, when that decrepit old piece of shit was squatting in Trump's WH. permalink parent award report block reply cptkloss5 18 points 4 days ago Trump's administration is responsible for these people lives - they're advertising and begging people to join ICE. They better have their backs. permalink award report block reply henri_derelicte 1 points 4 days ago The courts are making it very difficult for ICE and the Border Patrol to do their job in Chicago specifically permalink parent award report block reply deleted 7 points 4 days ago henri_derelicte 0 points 4 days ago It would likely trigger a constitutional crisis. And if Trump’s on the losing end, he’ll face impeachment permalink parent award report block reply Lurker6 1 points 3 days ago I hate to spoil this next 3 years for you, but he's going to face impeachment again no matter what he does. permalink parent award report block reply KernalMustard 5 points 4 days ago A deep root is the hardest to pull. permalink parent award report block reply MR__K 1 points 4 days ago Chicago fell a long time ago. Its probably 60 % illegals permalink parent award report block reply spinometer2 -1 points 4 days ago shut up already. there is no President who has had the backs of LEO more than Trump EVER. permalink parent award report block reply Firespawn 1 points 4 days ago \"Trump's Administration\"\nPersonally sure, however, he's had people around him who had/have the ability to do better by all law enforcement but apparently, and unlike Trump, they didn't and don't give 2 shits about them.\nIf they did, they'd send support and also make sure that standing down wouldn't be an issue.\nI doubt anyone is saying that Trump himself doesn't have their backs. Relax a little. permalink parent award report block reply spinometer2 2 points 4 days ago you can see in the videos there are at least 10 very capable and heavily armed men conducting this operation. it would take a small army to truly challenge them. as far as going after the perps afterwards, we all know the justice system is deeply deeply deeply broken. that will not be fixed for many years as the 90% of bad guys either retire or are found out and fired. but get real - that's a 20 year operation. permalink parent award report block reply Firespawn 2 points 4 days ago Couldn't agree with you more.  But the people around Trump have to make that call and let them engage. That's why I say it will be in our hands where we will be the last defense when it's said and done.\nIt's sad what this beautiful country has become. If in the 70s-90s someone would have told me we'd end up here I'd have told that person that they were absolutely insane. permalink parent award report block reply henri_derelicte 16 points 4 days ago SCOTUS is mulling over whether the National Guard is needed. I really hope they consider this event as good cause to let President Trump send them in permalink award report block reply GBA4ever 1 points 4 days ago Chicago fake Dem news still reporting it as an “alleged” attack. permalink parent award report block reply Bruno 14 points 4 days ago Imagine for a moment if all of this were reversed: We killed a leftist speaker on college campus We shot and tried to assassinate a Democrat president We opened fire on federal agents under a Democrat administration We called for more murder and mayhem and had the gall to have multiple NO KINGS protests The imbalance in this country is so astronomically baffling to me that I feel like I'm in an episode of the Twilight Zone. permalink award report block reply TerrorOfLiberals 4 points 4 days ago I see similar imbalances between genders. Men in our society get absolutely trashed at every opportunity, while we worship women like they're gods. As a society, we value womens comfort more than unborn babies lives. Women can literally kill babies, and they do, and the majority of people seem to like that. permalink parent award report block reply current_horror 2 points 4 days ago You’re both describing the same thing. Democrats are the party of feminization. permalink parent award report block reply Klaus73 1 points 4 days ago -Gabrielle Giffords (2011) to say nothing of MLK.\n-JFK\n-Ammon/Ryan Bundy Oregon under the Obama admin\n-I mean if this site in any indication; though republicans are notoriously bad at protesting enmasse; the whole having jobs and families thing sometimes gets in the way. permalink parent award report block reply Hanging_Chad 12 points 4 days ago just kill the attacker permalink award report block reply MedicallyReddit 8 points 4 days ago This. Countless vids of city cops killing people but ICE can’t kill literal terrorists? permalink parent award report block reply Klaus73 2 points 4 days ago You'd think returning fire would be a trained reflex like in the army. permalink parent award report block reply ingrowntoenail 10 points 4 days ago Which is why they need to carry live rounds instead of fucking paint balls.  As soon as shots are fired against these federal agents they should start firing back. permalink award report block reply DefKon1 8 points 4 days ago This reminds me of when I was overseas in the Army and they would send us on guard duty during \"high alert\" to the base perimeter with nothing but a radio. This always made me wonder just how deep a breach in defense would become before an armed response could be made. By my calculations it would have taken a minimum of 5 minutes. A lot of damage can happen in 5 minutes. But...nobody paid me to think, so I guess I was  having illegal thoughts. I'm embarrassed of myself.🤷 permalink parent award report block reply Firespawn 3 points 4 days ago 5 minutes is longer than many people realize. Hand to hand combat can be grueling. 30 seconds, 1 minute, etc... Time flies when we're having fun, but when it's bad, it seems like it takes so much longer. permalink parent award report block reply DefKon1 2 points 4 days ago Yup. 5 minutes unchallenged is long enough to establish a foothold that could last hours or even days. Or worse. permalink parent award report block reply Firespawn 2 points 4 days ago They had live ammo in DC, but obviously never used it. I remember a reddit faggot named \"freebricks4nazis\" having a complete shit fit like an Indian retard over it. 😂 He was so triggered, I was laughing at every post. permalink parent award report block reply PatriotSkorzeny 10 points 4 days ago BP shouldn’t have let the illegal aliens in. It’s been nothing but grief. permalink award report block reply Build_Back_Bankrupt 5 points 4 days ago Mayorkas stood down on purpose and didn't back them, this should be taken to the top, dereliction of duty at the top levels. permalink parent award report block reply ragnarokrobo 5 points 4 days ago And they accepted his orders and executed them with gusto. Including giving out fistbumps to illegals coming across the border and welding gates open for them. permalink parent award report block reply Build_Back_Bankrupt 0 points 4 days ago I remember, a lot of them were worried about losing their jobs and benefits, I'm sure some were glad to do it, but I also remember stories of BP / ICE speaking out and/or quitting. I can't say if the orders were illegal, but it was a dereliction of duty, and was likely coordinated with NGO's which would be a conspiracy, possibly illegal. permalink parent award report block reply ragnarokrobo 4 points 4 days ago Uh huh. The classic cry of law enforcement everywhere while they trample our rights and stab citizens in the back. MUUUH PEENNSIIOOONN!! permalink parent award report block reply view 1 more comments... Aggrieved03 3 points 4 days ago Helped them carry their bags. permalink parent award report block reply PotatusHead 9 points 4 days ago Scramble the SHIT BOMBER! permalink award report block reply RedStoneDeepState 12 points 4 days ago Instructions unclear, A10 Warthog deployed. permalink parent award report block reply PotatusHead 4 points 4 days ago bbbbBBBBBBBBBBBBBRRRRRRRRRRRRRRRRRRRRRRRRRTTTTTTTTTTTT!!! permalink parent award report block reply PhilipeNegro 4 points 4 days ago Ya hear that Bubs? The shithawks are flying low. permalink parent award report block reply donteatthat 3 points 4 days ago Lahey you're a dick permalink parent award report block reply PhilipeNegro 1 points 4 days ago I am the liquor permalink parent award report block reply TheRedPilledArtist OP 9 points 4 days ago SOURCE: https://x.com/GuntherEagleman/status/1987252362059075683 permalink award report block reply Firespawn 2 points 4 days ago I follow him on X but I muted him. Being a small account, I've made several comments in different threads that didn't get much visibility and he'd post my comments as if they were his own words. Of course he'd get a lot of reposts/likes. Not jealous, it's just if we're all patriots, then fucking act like it.\nX is like a pool hall to him where he and a select few are regulars while everyone else are just a bunch of nobodies. His ego is obnoxious. permalink parent award report block reply bluntedaffect 2 points 4 days ago That's not a source. That's a tweet without a source. permalink parent award report block reply OhioRepublic 8 points 4 days ago Send in BORTAC units in fucking Bearcats and subdue these illegals and their accomplices at gunpoint. permalink award report block reply I_Love_45-70_Gov 3 points 4 days ago BOTAC will fuck there shit up. 🤗 permalink parent award report block reply Quiznos585 8 points 4 days ago One of the police officers that responded also got run over , they caught whoever did that part of it https://x.com/ChicagoContrar1/status/1987196299985170745 permalink award report block reply UnapprovedNarrative 5 points 4 days ago We knew this day would come, and so did Trump and his team. Ice now has the predicate to start busting heads and using live ammunition against these terrorists. They literally just guaranteed their own destruction. permalink award report block reply Aggrieved03 5 points 4 days ago But they gave an oral warning to people committing violent crimes, that didn’t protect them? Cops being this hands off comes from the top. permalink award report block reply mikethemarine 4 points 4 days ago don't send in the troops yet, wait till I get there with my weapons, so I get to help out permalink award report block reply VirTW 3 points 4 days ago If the worst happens and an ice agents is killed the right better make the left pay for all their anti ice rhetoric permalink award report block reply SisterCovfefeToo 3 points 4 days ago But but a judge said it wasn't as bad as border patrol said! permalink award report block reply TrumpLandslide20201 3 points 4 days ago I say please, please, please Mr. President unleash the military on the enemy within. permalink award report block reply MADASHELLNEWS 3 points 4 days ago They should block all exits to the city with check points and slowly roll in and deport them all with national guard permalink award report block reply Area82 3 points 4 days ago Biden is a corrupt, lying pedo.  Always has been. permalink award report block reply MidwestZoomer 2 points 4 days ago Day late and a dollar short permalink award report block reply Beardholder 2 points 4 days ago Every Democrat mayor and governor need to be arrested for treason RIGHT NOW! permalink award report block reply Kilroy 2 points 4 days ago Perhaps if princess Bondi held one more press conference and threatened to arrest and prosecute ANYONE who impeded ice or harbored illegal alien's, that would help? /S permalink award report block reply LiberalTearsMiner 2 points 4 days ago This shows how weak republicans are, no matter how bad it gets for us we will never fight. permalink award report block reply weltallic 2 points 4 days ago https://cdn.imgchest.com/files/966df915bd31.PNG permalink award report block reply BlueKentuckyGirl 2 points 4 days ago NOW permalink award report block reply friarfox 2 points 4 days ago And some judge says tear gas can't be used. Go figure. permalink award report block reply SGT_Glowie 2 points 4 days ago plot twist the bullet was actually just a ricochet from black on black crime permalink award report block reply Rock9Head 2 points 4 days ago Was it one of the Biden judges? permalink award report block reply footinmouth 2 points 4 days ago You don't need to arrest criminal aliens, you can just you know, do stuff. permalink award report block reply MEGAWATTMAGASIGN 2 points 4 days ago Don’t forget the tanks! permalink award report block reply RealTXPatriot 2 points 4 days ago Link? permalink award report block reply duznmatter 1 points 4 days ago Just like the 1983 bombing of the Marine barracks in Beirut when the guards were told to stand their guard post with no rounds in their weapon. Just waiting for a disaster. Understand, we have to have a murderous disaster to respond. I mean how can we just start shooting these assholes without a mass shooting of ICE? The MSM will make anyone look like criminals without said disaster. The feeling out there from what I read is \"Don't be found wanting while you still have the chance to prepare\" permalink award report block reply L74ge9wr 1 points 4 days ago If felony charges, lose gun ownership privlege, lose voting rights.  Is that correct? permalink award report block reply knnbccb 1 points 4 days ago Told you that the military needs to get involved. Deportation area = hostile combat zone. Permissible to use lethal force. permalink award report block reply Savage_Patriot_1776 1 points 4 days ago New link please? Not working. permalink award report block reply LePEDES 1 points 4 days ago Trump ain’t doing shit lately democrats have dug in too deep and congress is useless…. permalink award report block reply Ihateallliars 1 points 4 days ago All hail the traitors. Expect To start hearing this. From these communist & Soros (Hidden hand) types. Apparently, simple minds are easy to manipulate. permalink award report block reply iLLNESS 1 points 4 days ago Could you imagine if a right winger was doing 1/100th of the shit that these deranged leftists are doing towards ICE? There'd be 24/7 news about how violent conservatives are based on the actions of 1... Here we are with constant attacks from lefties across the country and silence... This is genuinely infuriating. permalink award report block reply Klaus73 1 points 4 days ago I will wait to see if they find anyone from the drive-by shooting. Seen too many false flags to just be like \"doooy okie!\" permalink award report block reply roadrunner0 1 points 4 days ago Armored stealth minivans with 8 of these firing through gun ports and a pop up rotating turret driving through the mass of Lefty retards.. https://blade-city.com/blogs/gun-knife-blog/the-belt-fed-12-gauge-you-need-to-see-in-action Who needs a minigun when you can throw out thousands of .25 caliber pellets a minute.. permalink award report block reply Alldayeveryday 1 points 4 days ago When they don't arrest these psychopaths it just emboldens them permalink award report block reply JoeBidensDementia1 1 points 4 days ago More pepper rounds! permalink award report block reply Shih_Tabed 1 points 4 days ago Folks need to take more hunting trips to Chicago.  So many interstates to use to get in and out quick. permalink award report block reply NickAtNight 1 points 4 days ago First arrest the Judge permalink award report block reply Narcan 1 points 4 days ago Again? permalink award report block reply YodaBannon 1 points 4 days ago Serious FAF permalink award report block reply gorilla_grip 1 points 4 days ago There has to be a law that they can use to arrest these people. Throwing them on the ground isn’t enough. They need to go spend 10 or 30 days in county lock up minimum permalink award report block reply KarenLukasik 1 points 4 days ago Time for the insurrection Act permalink award report block reply ElectricDragon- 1 points 4 days ago This is libersl radicalization.  I actually can't believe anyone would care about this that much naturally. permalink award report block reply Trumpette1 1 points 4 days ago OMG permalink award report block reply lostremote- 0 points 4 days ago I really need someone here to tell us how this is Israels fault! permalink award report block reply Roadpower 1 points 4 days ago http://en.wikipedia.org/wiki/HIAS You can include Catholic charities as well. They are all forces of destruction upon the west. permalink parent award report block reply lostremote- 1 points 4 days ago that i can agree with permalink parent award report block reply AppalachianTactical 0 points 4 days ago Black jeep. Why are these feds so hard on their fed bros? permalink award report block reply BitterRoots 0 points 4 days ago I've given up expecting President Trump to take decisive steps to back ICE agents risking everything 🙄 permalink award report block reply PoohClimbsTrees 1 points 4 days ago They down voted you, but had no response to your statement. \"When is enough,  enough?\" Is a really good question. permalink parent award report block reply breadbaker 1 points 4 days ago Trump probably isn't. He is either holding violence provoked by ICE and retaliated by lefty radicals as a card until midterm elections or, the exact opposite, Trump doesn't want to inflame things more. The more nuanced approach: they are trying to create under the radar chaos and fear in lives of illegals so they leave and the arrests are as much toward that as get some really bad people out. permalink parent award report block reply spinometer2 -2 points 4 days ago DOOMERS GET OUT permalink award report block reply\nmlp67 138 points 4 days ago This is on Bondi and Noem. Those two need to fix this shit. Trump needs to quit putting his agents in danger if he's not gonna have their backs. It's getting out of hand and I'm sick of hearing about the abuse they are taking. permalink award report block reply possibletower 50 points 4 days ago I knew it was really weird when ICE/DHS/DOJ kept overhyping that one illegal faggot caught for throwing a rock at a passing ICE vehicle (that didn't even hurt anybody or cause much damage) and they stayed silent and did NOTHING when the very next day there were around 500 illegal aliens at the top of an overpass bridge dropping fucking 100 bricks and cinderblocks onto 20 LAPD police cars and hitting cops in the heads while escaping their vehicles. I was thinking \"why the fuck are Trump/Noem/Bondi not talking about this and why are they not arresting a single illegal alien that destroyed 20 cop cars and smashed at least 5 cops' heads with those bricks?\" permalink parent award report block reply mlp67 27 points 4 days ago I would not work for ICE if I had take this shit day after day. It's a disgrace. permalink parent award report block reply UCantStumpTheTrump 26 points 4 days ago They are being told to stand down, go try attacking a normal beat cop and see what happens to you. Trump doesn't want to give the left optics of ICE agents brutally crushing the protests, but at this point, it's what's needed because they are going to paint us as Nazis no matter what we do permalink parent award report block reply QueensOwn 22 points 4 days ago Don’t use their “language”. This is NOT a “protest”. Throwing objects, blocking federal officers and shooting guns is a full scale RIOT and just might be an insurrection if this type of violence is permitted l permalink parent award report block reply view 3 more comments... FusionBlack 13 points 4 days ago Optics be damned. Think of the optics when an agent is killed. permalink parent award report block reply view 3 more comments... mlp67 9 points 4 days ago Shitty situation for the ICE agents permalink parent award report block reply swift_water 3 points 4 days ago The propaganda on this is VERY effective. I hear all the time that ICE is roughing up children like wtf lol permalink parent award report block reply Tacitus1963 2 points 4 days ago Trump is allowing himself to be control by the Bushite witch, Susie Wiles.\nShe's his Chief of Staff and lives in his ear.\nAnother horrendous choice like Patel and Scam Blondi. permalink parent award report block reply load 1 more comments... mikejones 9 points 4 days ago It's never ending cause USA has the 3rd most people in a country. Lots depend on the government. How are you going to help broke people with no skills and health problems for the next 60 years and raise kids with dead beat parents. permalink parent award report block reply Wtf_socialismreally 2 points 4 days ago No skills we can work with. Health problems we can figure out something for many. What we can't do is make people want to work, and we also can't make the jobs pop up out of the ether. permalink parent award report block reply view 1 more comments... Govtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply roadrunner0 1 points 4 days ago Think about it, at what point will these actions cross the line of legality so the President can enact Martial Law and rip control out of the hands of the Lefty politicians?? We are starting to get close to open rebellion and that would be the tipping point as would daily acts of Leftist terrorism or foreigners doing it.. permalink parent award report block reply mty_green_go -3 points 4 days ago Because it wasn't a Tesla dealership ?? permalink parent award report block reply TheRedPilledArtist OP 20 points 4 days ago An update at 1539 ET: Suspect(s) NOT apprehended. Manhunt underway. Suspect was seen driving a black Jeep earlier. permalink parent award report block reply Hanging_Chad 7 points 4 days ago he should buy a life insurance policy pronto permalink parent award report block reply Krat 7 points 4 days ago Not like hes gonna get arrested and even if he is some commie judge will just release him permalink parent award report block reply Simple_Doot 1 points 4 days ago Free Subway sandwiches in his future. permalink parent award report block reply Viewer01 16 points 4 days ago Idk if you thought they were going to go quietly. This isn’t surprising. It is actually expected. permalink parent award report block reply RentFree2020 12 points 4 days ago I'd like to see all the public figures that called for this to be arrested as well. permalink parent award report block reply Chickensaurus 10 points 4 days ago Wait until they regain power. permalink parent award report block reply mikejones 8 points 4 days ago That's why you should be preparing. How will things be 5 years from now. Nearly 50 trillion in debt and sending money who knows where. permalink parent award report block reply Simple_Doot -7 points 4 days ago The year is 2030.  Bibi Netanyahu is president of the Northen hemisphere.  Our free government issue Teslas wont drive if we have shown an example wrong think.  My 50 year mortgage has been adjusted to a 75 year mortgage, thanks be to Lord Trump.  The grocery store shelves are filled exclusively with food-paste tubes and you must present your Operation Warpspeed chip, provided by Palantir, to even shop.  Our children are taught by Jeffery Epstien A.I. cloans.  This is my sto...*transmission interrupted* permalink parent award report block reply mlp67 3 points 4 days ago I didn't expect the people who are pushing them to do these raids to fail in protecting them and giving them more resources. permalink parent award report block reply American-Patriot 14 points 4 days ago Never trust a jeet and a woman to do a white man's job permalink parent award report block reply HeavyMetalPatriot 8 points 4 days ago THIS!!!!! permalink parent award report block reply ToxicAvengerOhio 6 points 4 days ago He's scared shitless of optics and going to get these guys killed. We're at the \"get what you fucking deserve\" moment for midterms. Be the retribution you said or gtfo permalink parent award report block reply load 19 more comments...\npossibletower 50 points 4 days ago I knew it was really weird when ICE/DHS/DOJ kept overhyping that one illegal faggot caught for throwing a rock at a passing ICE vehicle (that didn't even hurt anybody or cause much damage) and they stayed silent and did NOTHING when the very next day there were around 500 illegal aliens at the top of an overpass bridge dropping fucking 100 bricks and cinderblocks onto 20 LAPD police cars and hitting cops in the heads while escaping their vehicles. I was thinking \"why the fuck are Trump/Noem/Bondi not talking about this and why are they not arresting a single illegal alien that destroyed 20 cop cars and smashed at least 5 cops' heads with those bricks?\" permalink parent award report block reply mlp67 27 points 4 days ago I would not work for ICE if I had take this shit day after day. It's a disgrace. permalink parent award report block reply UCantStumpTheTrump 26 points 4 days ago They are being told to stand down, go try attacking a normal beat cop and see what happens to you. Trump doesn't want to give the left optics of ICE agents brutally crushing the protests, but at this point, it's what's needed because they are going to paint us as Nazis no matter what we do permalink parent award report block reply QueensOwn 22 points 4 days ago Don’t use their “language”. This is NOT a “protest”. Throwing objects, blocking federal officers and shooting guns is a full scale RIOT and just might be an insurrection if this type of violence is permitted l permalink parent award report block reply view 3 more comments... FusionBlack 13 points 4 days ago Optics be damned. Think of the optics when an agent is killed. permalink parent award report block reply view 3 more comments... mlp67 9 points 4 days ago Shitty situation for the ICE agents permalink parent award report block reply swift_water 3 points 4 days ago The propaganda on this is VERY effective. I hear all the time that ICE is roughing up children like wtf lol permalink parent award report block reply Tacitus1963 2 points 4 days ago Trump is allowing himself to be control by the Bushite witch, Susie Wiles.\nShe's his Chief of Staff and lives in his ear.\nAnother horrendous choice like Patel and Scam Blondi. permalink parent award report block reply load 1 more comments... mikejones 9 points 4 days ago It's never ending cause USA has the 3rd most people in a country. Lots depend on the government. How are you going to help broke people with no skills and health problems for the next 60 years and raise kids with dead beat parents. permalink parent award report block reply Wtf_socialismreally 2 points 4 days ago No skills we can work with. Health problems we can figure out something for many. What we can't do is make people want to work, and we also can't make the jobs pop up out of the ether. permalink parent award report block reply view 1 more comments... Govtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply roadrunner0 1 points 4 days ago Think about it, at what point will these actions cross the line of legality so the President can enact Martial Law and rip control out of the hands of the Lefty politicians?? We are starting to get close to open rebellion and that would be the tipping point as would daily acts of Leftist terrorism or foreigners doing it.. permalink parent award report block reply mty_green_go -3 points 4 days ago Because it wasn't a Tesla dealership ?? permalink parent award report block reply\nmlp67 27 points 4 days ago I would not work for ICE if I had take this shit day after day. It's a disgrace. permalink parent award report block reply UCantStumpTheTrump 26 points 4 days ago They are being told to stand down, go try attacking a normal beat cop and see what happens to you. Trump doesn't want to give the left optics of ICE agents brutally crushing the protests, but at this point, it's what's needed because they are going to paint us as Nazis no matter what we do permalink parent award report block reply QueensOwn 22 points 4 days ago Don’t use their “language”. This is NOT a “protest”. Throwing objects, blocking federal officers and shooting guns is a full scale RIOT and just might be an insurrection if this type of violence is permitted l permalink parent award report block reply view 3 more comments... FusionBlack 13 points 4 days ago Optics be damned. Think of the optics when an agent is killed. permalink parent award report block reply view 3 more comments... mlp67 9 points 4 days ago Shitty situation for the ICE agents permalink parent award report block reply swift_water 3 points 4 days ago The propaganda on this is VERY effective. I hear all the time that ICE is roughing up children like wtf lol permalink parent award report block reply Tacitus1963 2 points 4 days ago Trump is allowing himself to be control by the Bushite witch, Susie Wiles.\nShe's his Chief of Staff and lives in his ear.\nAnother horrendous choice like Patel and Scam Blondi. permalink parent award report block reply load 1 more comments... mikejones 9 points 4 days ago It's never ending cause USA has the 3rd most people in a country. Lots depend on the government. How are you going to help broke people with no skills and health problems for the next 60 years and raise kids with dead beat parents. permalink parent award report block reply Wtf_socialismreally 2 points 4 days ago No skills we can work with. Health problems we can figure out something for many. What we can't do is make people want to work, and we also can't make the jobs pop up out of the ether. permalink parent award report block reply view 1 more comments... Govtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nUCantStumpTheTrump 26 points 4 days ago They are being told to stand down, go try attacking a normal beat cop and see what happens to you. Trump doesn't want to give the left optics of ICE agents brutally crushing the protests, but at this point, it's what's needed because they are going to paint us as Nazis no matter what we do permalink parent award report block reply QueensOwn 22 points 4 days ago Don’t use their “language”. This is NOT a “protest”. Throwing objects, blocking federal officers and shooting guns is a full scale RIOT and just might be an insurrection if this type of violence is permitted l permalink parent award report block reply view 3 more comments... FusionBlack 13 points 4 days ago Optics be damned. Think of the optics when an agent is killed. permalink parent award report block reply view 3 more comments... mlp67 9 points 4 days ago Shitty situation for the ICE agents permalink parent award report block reply swift_water 3 points 4 days ago The propaganda on this is VERY effective. I hear all the time that ICE is roughing up children like wtf lol permalink parent award report block reply Tacitus1963 2 points 4 days ago Trump is allowing himself to be control by the Bushite witch, Susie Wiles.\nShe's his Chief of Staff and lives in his ear.\nAnother horrendous choice like Patel and Scam Blondi. permalink parent award report block reply load 1 more comments...\nQueensOwn 22 points 4 days ago Don’t use their “language”. This is NOT a “protest”. Throwing objects, blocking federal officers and shooting guns is a full scale RIOT and just might be an insurrection if this type of violence is permitted l permalink parent award report block reply view 3 more comments...\nFusionBlack 13 points 4 days ago Optics be damned. Think of the optics when an agent is killed. permalink parent award report block reply view 3 more comments...\nmlp67 9 points 4 days ago Shitty situation for the ICE agents permalink parent award report block reply\nswift_water 3 points 4 days ago The propaganda on this is VERY effective. I hear all the time that ICE is roughing up children like wtf lol permalink parent award report block reply\nTacitus1963 2 points 4 days ago Trump is allowing himself to be control by the Bushite witch, Susie Wiles.\nShe's his Chief of Staff and lives in his ear.\nAnother horrendous choice like Patel and Scam Blondi. permalink parent award report block reply\nmikejones 9 points 4 days ago It's never ending cause USA has the 3rd most people in a country. Lots depend on the government. How are you going to help broke people with no skills and health problems for the next 60 years and raise kids with dead beat parents. permalink parent award report block reply Wtf_socialismreally 2 points 4 days ago No skills we can work with. Health problems we can figure out something for many. What we can't do is make people want to work, and we also can't make the jobs pop up out of the ether. permalink parent award report block reply view 1 more comments... Govtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nWtf_socialismreally 2 points 4 days ago No skills we can work with. Health problems we can figure out something for many. What we can't do is make people want to work, and we also can't make the jobs pop up out of the ether. permalink parent award report block reply view 1 more comments...\nGovtizbad 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nroadrunner0 1 points 4 days ago Think about it, at what point will these actions cross the line of legality so the President can enact Martial Law and rip control out of the hands of the Lefty politicians?? We are starting to get close to open rebellion and that would be the tipping point as would daily acts of Leftist terrorism or foreigners doing it.. permalink parent award report block reply\nmty_green_go -3 points 4 days ago Because it wasn't a Tesla dealership ?? permalink parent award report block reply\nTheRedPilledArtist OP 20 points 4 days ago An update at 1539 ET: Suspect(s) NOT apprehended. Manhunt underway. Suspect was seen driving a black Jeep earlier. permalink parent award report block reply Hanging_Chad 7 points 4 days ago he should buy a life insurance policy pronto permalink parent award report block reply Krat 7 points 4 days ago Not like hes gonna get arrested and even if he is some commie judge will just release him permalink parent award report block reply Simple_Doot 1 points 4 days ago Free Subway sandwiches in his future. permalink parent award report block reply\nHanging_Chad 7 points 4 days ago he should buy a life insurance policy pronto permalink parent award report block reply Krat 7 points 4 days ago Not like hes gonna get arrested and even if he is some commie judge will just release him permalink parent award report block reply Simple_Doot 1 points 4 days ago Free Subway sandwiches in his future. permalink parent award report block reply\nKrat 7 points 4 days ago Not like hes gonna get arrested and even if he is some commie judge will just release him permalink parent award report block reply Simple_Doot 1 points 4 days ago Free Subway sandwiches in his future. permalink parent award report block reply\nSimple_Doot 1 points 4 days ago Free Subway sandwiches in his future. permalink parent award report block reply\nViewer01 16 points 4 days ago Idk if you thought they were going to go quietly. This isn’t surprising. It is actually expected. permalink parent award report block reply RentFree2020 12 points 4 days ago I'd like to see all the public figures that called for this to be arrested as well. permalink parent award report block reply Chickensaurus 10 points 4 days ago Wait until they regain power. permalink parent award report block reply mikejones 8 points 4 days ago That's why you should be preparing. How will things be 5 years from now. Nearly 50 trillion in debt and sending money who knows where. permalink parent award report block reply Simple_Doot -7 points 4 days ago The year is 2030.  Bibi Netanyahu is president of the Northen hemisphere.  Our free government issue Teslas wont drive if we have shown an example wrong think.  My 50 year mortgage has been adjusted to a 75 year mortgage, thanks be to Lord Trump.  The grocery store shelves are filled exclusively with food-paste tubes and you must present your Operation Warpspeed chip, provided by Palantir, to even shop.  Our children are taught by Jeffery Epstien A.I. cloans.  This is my sto...*transmission interrupted* permalink parent award report block reply mlp67 3 points 4 days ago I didn't expect the people who are pushing them to do these raids to fail in protecting them and giving them more resources. permalink parent award report block reply\nRentFree2020 12 points 4 days ago I'd like to see all the public figures that called for this to be arrested as well. permalink parent award report block reply\nChickensaurus 10 points 4 days ago Wait until they regain power. permalink parent award report block reply mikejones 8 points 4 days ago That's why you should be preparing. How will things be 5 years from now. Nearly 50 trillion in debt and sending money who knows where. permalink parent award report block reply Simple_Doot -7 points 4 days ago The year is 2030.  Bibi Netanyahu is president of the Northen hemisphere.  Our free government issue Teslas wont drive if we have shown an example wrong think.  My 50 year mortgage has been adjusted to a 75 year mortgage, thanks be to Lord Trump.  The grocery store shelves are filled exclusively with food-paste tubes and you must present your Operation Warpspeed chip, provided by Palantir, to even shop.  Our children are taught by Jeffery Epstien A.I. cloans.  This is my sto...*transmission interrupted* permalink parent award report block reply\nmikejones 8 points 4 days ago That's why you should be preparing. How will things be 5 years from now. Nearly 50 trillion in debt and sending money who knows where. permalink parent award report block reply Simple_Doot -7 points 4 days ago The year is 2030.  Bibi Netanyahu is president of the Northen hemisphere.  Our free government issue Teslas wont drive if we have shown an example wrong think.  My 50 year mortgage has been adjusted to a 75 year mortgage, thanks be to Lord Trump.  The grocery store shelves are filled exclusively with food-paste tubes and you must present your Operation Warpspeed chip, provided by Palantir, to even shop.  Our children are taught by Jeffery Epstien A.I. cloans.  This is my sto...*transmission interrupted* permalink parent award report block reply\nSimple_Doot -7 points 4 days ago The year is 2030.  Bibi Netanyahu is president of the Northen hemisphere.  Our free government issue Teslas wont drive if we have shown an example wrong think.  My 50 year mortgage has been adjusted to a 75 year mortgage, thanks be to Lord Trump.  The grocery store shelves are filled exclusively with food-paste tubes and you must present your Operation Warpspeed chip, provided by Palantir, to even shop.  Our children are taught by Jeffery Epstien A.I. cloans.  This is my sto...*transmission interrupted* permalink parent award report block reply\nmlp67 3 points 4 days ago I didn't expect the people who are pushing them to do these raids to fail in protecting them and giving them more resources. permalink parent award report block reply\nAmerican-Patriot 14 points 4 days ago Never trust a jeet and a woman to do a white man's job permalink parent award report block reply HeavyMetalPatriot 8 points 4 days ago THIS!!!!! permalink parent award report block reply\nHeavyMetalPatriot 8 points 4 days ago THIS!!!!! permalink parent award report block reply\nToxicAvengerOhio 6 points 4 days ago He's scared shitless of optics and going to get these guys killed. We're at the \"get what you fucking deserve\" moment for midterms. Be the retribution you said or gtfo permalink parent award report block reply\nZhongda 50 points 4 days ago People are going to die and we are still going to continue along like everything is fine. permalink award report block reply possibletower 21 points 4 days ago \"The China virus/poison shots combo killed people and we are still going to continue along like everything is fine\" permalink parent award report block reply Aggrieved03 17 points 4 days ago Tens of millions of foreigners rape our wages and literally kill us and we’ve done nothing but target that absolute worst of the worst. China kills 100,000 Americans a year with fentanyl and we’re targeting cocaine smugglers in Venezuela. permalink parent award report block reply ScamBlondie 1 points 4 days ago Actually that’s not true, we also targeted some grandmas who entered the capital building. permalink parent award report block reply shogun5000 1 points 4 days ago Oh so we better just let the commies do whatever? What a timid fuck. permalink parent award report block reply AppalachianTactical 2 points 4 days ago People are going to die so maga and america firsr right wingers can ve labeled actual fascists and meanwhile the number of illegals removed will barely change. permalink parent award report block reply Krat 0 points 4 days ago 0 arrests and counting ! permalink parent award report block reply PROCIsAsshoe 3 points 4 days ago factually inaccurate and yet I've seen you say it countless times these past few weeks. Comey and Bolton already. Brennan and Clapper coming soon. permalink parent award report block reply Krat 3 points 4 days ago Summer of love arrests ? Fuck... in seattle a guy handed out rifles from a trunk and a black kid was shot. Nobody arrested... what of all the riots? All the insider trading ? The ngo corruption, campaign violations, .... The blatant ignoring of trump orders in his first term? The media lies... covid tyranny...  The violence against ice??  The spying .... the rigging.... The ignoring of laws by democrat commie mayors, the corporate violations of racism in dei and federal laws against discrimination...yet I saw democrats hunt down thousands of americans and locked unconstitutionally in cells for years for following police orders in DC.... WHERE ARE THE ARRESTS ?!?!?\nTeachers, politicians, doctors, officials, media heads, mayors, unions, filthy riggers, all of them WE ARE AT FUCKING 0 ARRESTS compared to the glacier that it should be We cant even arrest kid rapists arrested in Seattle... some have 37+ violent attacks and assaults on others ... dont tell me 0 arrests is innacurate... each category is basically at 0 arrests... permalink parent award report block reply Krat 2 points 4 days ago So 2 out of how many that need to be ? 100,000 ? Its more about the principal than the ampunt ... 2 is effectively 0 permalink parent award report block reply mikejones -3 points 4 days ago 86 cops died so far this year. So every couple days when doing the most dangerous job you expect some live rounds. What do you expect to do. Roll around the USA streets like we're in Afghanistan? permalink parent award report block reply Zhongda 12 points 4 days ago I don't care if illegals get pumped full of lead.  I'm not a retarded overly emotional leftist faggot.  Are you? permalink parent award report block reply Firespawn 6 points 4 days ago If they're killing invaders and terrorists, blast away. Some liberal collateral damage wouldn't hurt my feelings one bit either.\nWe are on a crash course towards war any fucking way. permalink parent award report block reply suckmycorona 4 points 4 days ago Dark Brandon was about to do it. permalink parent award report block reply Wtf_socialismreally 2 points 4 days ago Considering the fact that they are in the dens of terrorists... permalink parent award report block reply\npossibletower 21 points 4 days ago \"The China virus/poison shots combo killed people and we are still going to continue along like everything is fine\" permalink parent award report block reply Aggrieved03 17 points 4 days ago Tens of millions of foreigners rape our wages and literally kill us and we’ve done nothing but target that absolute worst of the worst. China kills 100,000 Americans a year with fentanyl and we’re targeting cocaine smugglers in Venezuela. permalink parent award report block reply ScamBlondie 1 points 4 days ago Actually that’s not true, we also targeted some grandmas who entered the capital building. permalink parent award report block reply shogun5000 1 points 4 days ago Oh so we better just let the commies do whatever? What a timid fuck. permalink parent award report block reply\nAggrieved03 17 points 4 days ago Tens of millions of foreigners rape our wages and literally kill us and we’ve done nothing but target that absolute worst of the worst. China kills 100,000 Americans a year with fentanyl and we’re targeting cocaine smugglers in Venezuela. permalink parent award report block reply ScamBlondie 1 points 4 days ago Actually that’s not true, we also targeted some grandmas who entered the capital building. permalink parent award report block reply\nScamBlondie 1 points 4 days ago Actually that’s not true, we also targeted some grandmas who entered the capital building. permalink parent award report block reply\nshogun5000 1 points 4 days ago Oh so we better just let the commies do whatever? What a timid fuck. permalink parent award report block reply\nAppalachianTactical 2 points 4 days ago People are going to die so maga and america firsr right wingers can ve labeled actual fascists and meanwhile the number of illegals removed will barely change. permalink parent award report block reply\nKrat 0 points 4 days ago 0 arrests and counting ! permalink parent award report block reply PROCIsAsshoe 3 points 4 days ago factually inaccurate and yet I've seen you say it countless times these past few weeks. Comey and Bolton already. Brennan and Clapper coming soon. permalink parent award report block reply Krat 3 points 4 days ago Summer of love arrests ? Fuck... in seattle a guy handed out rifles from a trunk and a black kid was shot. Nobody arrested... what of all the riots? All the insider trading ? The ngo corruption, campaign violations, .... The blatant ignoring of trump orders in his first term? The media lies... covid tyranny...  The violence against ice??  The spying .... the rigging.... The ignoring of laws by democrat commie mayors, the corporate violations of racism in dei and federal laws against discrimination...yet I saw democrats hunt down thousands of americans and locked unconstitutionally in cells for years for following police orders in DC.... WHERE ARE THE ARRESTS ?!?!?\nTeachers, politicians, doctors, officials, media heads, mayors, unions, filthy riggers, all of them WE ARE AT FUCKING 0 ARRESTS compared to the glacier that it should be We cant even arrest kid rapists arrested in Seattle... some have 37+ violent attacks and assaults on others ... dont tell me 0 arrests is innacurate... each category is basically at 0 arrests... permalink parent award report block reply Krat 2 points 4 days ago So 2 out of how many that need to be ? 100,000 ? Its more about the principal than the ampunt ... 2 is effectively 0 permalink parent award report block reply\nPROCIsAsshoe 3 points 4 days ago factually inaccurate and yet I've seen you say it countless times these past few weeks. Comey and Bolton already. Brennan and Clapper coming soon. permalink parent award report block reply Krat 3 points 4 days ago Summer of love arrests ? Fuck... in seattle a guy handed out rifles from a trunk and a black kid was shot. Nobody arrested... what of all the riots? All the insider trading ? The ngo corruption, campaign violations, .... The blatant ignoring of trump orders in his first term? The media lies... covid tyranny...  The violence against ice??  The spying .... the rigging.... The ignoring of laws by democrat commie mayors, the corporate violations of racism in dei and federal laws against discrimination...yet I saw democrats hunt down thousands of americans and locked unconstitutionally in cells for years for following police orders in DC.... WHERE ARE THE ARRESTS ?!?!?\nTeachers, politicians, doctors, officials, media heads, mayors, unions, filthy riggers, all of them WE ARE AT FUCKING 0 ARRESTS compared to the glacier that it should be We cant even arrest kid rapists arrested in Seattle... some have 37+ violent attacks and assaults on others ... dont tell me 0 arrests is innacurate... each category is basically at 0 arrests... permalink parent award report block reply Krat 2 points 4 days ago So 2 out of how many that need to be ? 100,000 ? Its more about the principal than the ampunt ... 2 is effectively 0 permalink parent award report block reply\nKrat 3 points 4 days ago Summer of love arrests ? Fuck... in seattle a guy handed out rifles from a trunk and a black kid was shot. Nobody arrested... what of all the riots? All the insider trading ? The ngo corruption, campaign violations, .... The blatant ignoring of trump orders in his first term? The media lies... covid tyranny...  The violence against ice??  The spying .... the rigging.... The ignoring of laws by democrat commie mayors, the corporate violations of racism in dei and federal laws against discrimination...yet I saw democrats hunt down thousands of americans and locked unconstitutionally in cells for years for following police orders in DC.... WHERE ARE THE ARRESTS ?!?!?\nTeachers, politicians, doctors, officials, media heads, mayors, unions, filthy riggers, all of them WE ARE AT FUCKING 0 ARRESTS compared to the glacier that it should be We cant even arrest kid rapists arrested in Seattle... some have 37+ violent attacks and assaults on others ... dont tell me 0 arrests is innacurate... each category is basically at 0 arrests... permalink parent award report block reply\nKrat 2 points 4 days ago So 2 out of how many that need to be ? 100,000 ? Its more about the principal than the ampunt ... 2 is effectively 0 permalink parent award report block reply\nmikejones -3 points 4 days ago 86 cops died so far this year. So every couple days when doing the most dangerous job you expect some live rounds. What do you expect to do. Roll around the USA streets like we're in Afghanistan? permalink parent award report block reply Zhongda 12 points 4 days ago I don't care if illegals get pumped full of lead.  I'm not a retarded overly emotional leftist faggot.  Are you? permalink parent award report block reply Firespawn 6 points 4 days ago If they're killing invaders and terrorists, blast away. Some liberal collateral damage wouldn't hurt my feelings one bit either.\nWe are on a crash course towards war any fucking way. permalink parent award report block reply suckmycorona 4 points 4 days ago Dark Brandon was about to do it. permalink parent award report block reply Wtf_socialismreally 2 points 4 days ago Considering the fact that they are in the dens of terrorists... permalink parent award report block reply\nZhongda 12 points 4 days ago I don't care if illegals get pumped full of lead.  I'm not a retarded overly emotional leftist faggot.  Are you? permalink parent award report block reply\nFirespawn 6 points 4 days ago If they're killing invaders and terrorists, blast away. Some liberal collateral damage wouldn't hurt my feelings one bit either.\nWe are on a crash course towards war any fucking way. permalink parent award report block reply\nsuckmycorona 4 points 4 days ago Dark Brandon was about to do it. permalink parent award report block reply\nWtf_socialismreally 2 points 4 days ago Considering the fact that they are in the dens of terrorists... permalink parent award report block reply\nTheRedPilledArtist OP 33 points 4 days ago It was only a matter of time. We all knew it would come to this. permalink award report block reply OneTypoComment 17 points 4 days ago honestly surprised it has taken this long for some lunatic to act permalink parent award report block reply SGT_Glowie 7 points 4 days ago For real permalink parent award report block reply Sp3nce321 12 points 4 days ago Did you forget about dallas, and the trans fag who shot 3 illegals trying to ambush ice? permalink parent award report block reply Bythrfruitsyknow 7 points 4 days ago Did YOU forget about the policemen who was shot outside the ICE Detention Center in Alvarado, Texas by 10-12 antifa including heavy-weapon troons in July? permalink parent award report block reply VictoryInDefiance 4 points 4 days ago Did YOU forget the Alamo? permalink parent award report block reply Firespawn 3 points 4 days ago Did YOU forget about the things you said when you were drunk? permalink parent award report block reply view 2 more comments... AppalachianTactical -1 points 4 days ago Fed on fed psyop. Spectactle so media can chug along while no illegals are removed. permalink parent award report block reply SaltiTaralli 1 points 4 days ago You might have become a little too jaded. 😅 permalink parent award report block reply AppalachianTactical 1 points 4 days ago Nah, i think im exactly as jaded as we need to be.\nWe are totally fucked. We are betrayed and our side has become retarded. 9 years ago i was called a nazi and racisr by idiots on the left, now i get called a muslim despute having rhe same principles because our side is betrayed and the idiots have flocked to maga. Maga has moved on the america first and are being attacked be rhe neocons/israelis.\nICE will do more to get the righr labeled as fascist than they will actually remove illegals. Its a set up. permalink parent award report block reply\nOneTypoComment 17 points 4 days ago honestly surprised it has taken this long for some lunatic to act permalink parent award report block reply SGT_Glowie 7 points 4 days ago For real permalink parent award report block reply\nSGT_Glowie 7 points 4 days ago For real permalink parent award report block reply\nSp3nce321 12 points 4 days ago Did you forget about dallas, and the trans fag who shot 3 illegals trying to ambush ice? permalink parent award report block reply Bythrfruitsyknow 7 points 4 days ago Did YOU forget about the policemen who was shot outside the ICE Detention Center in Alvarado, Texas by 10-12 antifa including heavy-weapon troons in July? permalink parent award report block reply VictoryInDefiance 4 points 4 days ago Did YOU forget the Alamo? permalink parent award report block reply Firespawn 3 points 4 days ago Did YOU forget about the things you said when you were drunk? permalink parent award report block reply view 2 more comments...\nBythrfruitsyknow 7 points 4 days ago Did YOU forget about the policemen who was shot outside the ICE Detention Center in Alvarado, Texas by 10-12 antifa including heavy-weapon troons in July? permalink parent award report block reply VictoryInDefiance 4 points 4 days ago Did YOU forget the Alamo? permalink parent award report block reply Firespawn 3 points 4 days ago Did YOU forget about the things you said when you were drunk? permalink parent award report block reply view 2 more comments...\nVictoryInDefiance 4 points 4 days ago Did YOU forget the Alamo? permalink parent award report block reply Firespawn 3 points 4 days ago Did YOU forget about the things you said when you were drunk? permalink parent award report block reply view 2 more comments...\nFirespawn 3 points 4 days ago Did YOU forget about the things you said when you were drunk? permalink parent award report block reply view 2 more comments...\nAppalachianTactical -1 points 4 days ago Fed on fed psyop. Spectactle so media can chug along while no illegals are removed. permalink parent award report block reply SaltiTaralli 1 points 4 days ago You might have become a little too jaded. 😅 permalink parent award report block reply AppalachianTactical 1 points 4 days ago Nah, i think im exactly as jaded as we need to be.\nWe are totally fucked. We are betrayed and our side has become retarded. 9 years ago i was called a nazi and racisr by idiots on the left, now i get called a muslim despute having rhe same principles because our side is betrayed and the idiots have flocked to maga. Maga has moved on the america first and are being attacked be rhe neocons/israelis.\nICE will do more to get the righr labeled as fascist than they will actually remove illegals. Its a set up. permalink parent award report block reply\nSaltiTaralli 1 points 4 days ago You might have become a little too jaded. 😅 permalink parent award report block reply AppalachianTactical 1 points 4 days ago Nah, i think im exactly as jaded as we need to be.\nWe are totally fucked. We are betrayed and our side has become retarded. 9 years ago i was called a nazi and racisr by idiots on the left, now i get called a muslim despute having rhe same principles because our side is betrayed and the idiots have flocked to maga. Maga has moved on the america first and are being attacked be rhe neocons/israelis.\nICE will do more to get the righr labeled as fascist than they will actually remove illegals. Its a set up. permalink parent award report block reply\nAppalachianTactical 1 points 4 days ago Nah, i think im exactly as jaded as we need to be.\nWe are totally fucked. We are betrayed and our side has become retarded. 9 years ago i was called a nazi and racisr by idiots on the left, now i get called a muslim despute having rhe same principles because our side is betrayed and the idiots have flocked to maga. Maga has moved on the america first and are being attacked be rhe neocons/israelis.\nICE will do more to get the righr labeled as fascist than they will actually remove illegals. Its a set up. permalink parent award report block reply\nIncredibleMrE1 21 points 4 days ago Should have started shooting back months ago. permalink award report block reply deleted 9 points 4 days ago warlord30 1 points 4 days ago thank you glowpede 🙏 permalink parent award report block reply deleted 2 points 4 days ago warlord30 0 points 4 days ago wow ur mean permalink parent award report block reply Firespawn 1 points 4 days ago At the border, when that decrepit old piece of shit was squatting in Trump's WH. permalink parent award report block reply\ndeleted 9 points 4 days ago warlord30 1 points 4 days ago thank you glowpede 🙏 permalink parent award report block reply deleted 2 points 4 days ago warlord30 0 points 4 days ago wow ur mean permalink parent award report block reply\nwarlord30 1 points 4 days ago thank you glowpede 🙏 permalink parent award report block reply deleted 2 points 4 days ago warlord30 0 points 4 days ago wow ur mean permalink parent award report block reply\ndeleted 2 points 4 days ago warlord30 0 points 4 days ago wow ur mean permalink parent award report block reply\nwarlord30 0 points 4 days ago wow ur mean permalink parent award report block reply\nFirespawn 1 points 4 days ago At the border, when that decrepit old piece of shit was squatting in Trump's WH. permalink parent award report block reply\ncptkloss5 18 points 4 days ago Trump's administration is responsible for these people lives - they're advertising and begging people to join ICE. They better have their backs. permalink award report block reply henri_derelicte 1 points 4 days ago The courts are making it very difficult for ICE and the Border Patrol to do their job in Chicago specifically permalink parent award report block reply deleted 7 points 4 days ago henri_derelicte 0 points 4 days ago It would likely trigger a constitutional crisis. And if Trump’s on the losing end, he’ll face impeachment permalink parent award report block reply Lurker6 1 points 3 days ago I hate to spoil this next 3 years for you, but he's going to face impeachment again no matter what he does. permalink parent award report block reply KernalMustard 5 points 4 days ago A deep root is the hardest to pull. permalink parent award report block reply MR__K 1 points 4 days ago Chicago fell a long time ago. Its probably 60 % illegals permalink parent award report block reply spinometer2 -1 points 4 days ago shut up already. there is no President who has had the backs of LEO more than Trump EVER. permalink parent award report block reply Firespawn 1 points 4 days ago \"Trump's Administration\"\nPersonally sure, however, he's had people around him who had/have the ability to do better by all law enforcement but apparently, and unlike Trump, they didn't and don't give 2 shits about them.\nIf they did, they'd send support and also make sure that standing down wouldn't be an issue.\nI doubt anyone is saying that Trump himself doesn't have their backs. Relax a little. permalink parent award report block reply spinometer2 2 points 4 days ago you can see in the videos there are at least 10 very capable and heavily armed men conducting this operation. it would take a small army to truly challenge them. as far as going after the perps afterwards, we all know the justice system is deeply deeply deeply broken. that will not be fixed for many years as the 90% of bad guys either retire or are found out and fired. but get real - that's a 20 year operation. permalink parent award report block reply Firespawn 2 points 4 days ago Couldn't agree with you more.  But the people around Trump have to make that call and let them engage. That's why I say it will be in our hands where we will be the last defense when it's said and done.\nIt's sad what this beautiful country has become. If in the 70s-90s someone would have told me we'd end up here I'd have told that person that they were absolutely insane. permalink parent award report block reply\nhenri_derelicte 1 points 4 days ago The courts are making it very difficult for ICE and the Border Patrol to do their job in Chicago specifically permalink parent award report block reply deleted 7 points 4 days ago henri_derelicte 0 points 4 days ago It would likely trigger a constitutional crisis. And if Trump’s on the losing end, he’ll face impeachment permalink parent award report block reply Lurker6 1 points 3 days ago I hate to spoil this next 3 years for you, but he's going to face impeachment again no matter what he does. permalink parent award report block reply KernalMustard 5 points 4 days ago A deep root is the hardest to pull. permalink parent award report block reply MR__K 1 points 4 days ago Chicago fell a long time ago. Its probably 60 % illegals permalink parent award report block reply\ndeleted 7 points 4 days ago henri_derelicte 0 points 4 days ago It would likely trigger a constitutional crisis. And if Trump’s on the losing end, he’ll face impeachment permalink parent award report block reply Lurker6 1 points 3 days ago I hate to spoil this next 3 years for you, but he's going to face impeachment again no matter what he does. permalink parent award report block reply\nhenri_derelicte 0 points 4 days ago It would likely trigger a constitutional crisis. And if Trump’s on the losing end, he’ll face impeachment permalink parent award report block reply Lurker6 1 points 3 days ago I hate to spoil this next 3 years for you, but he's going to face impeachment again no matter what he does. permalink parent award report block reply\nLurker6 1 points 3 days ago I hate to spoil this next 3 years for you, but he's going to face impeachment again no matter what he does. permalink parent award report block reply\nKernalMustard 5 points 4 days ago A deep root is the hardest to pull. permalink parent award report block reply\nMR__K 1 points 4 days ago Chicago fell a long time ago. Its probably 60 % illegals permalink parent award report block reply\nspinometer2 -1 points 4 days ago shut up already. there is no President who has had the backs of LEO more than Trump EVER. permalink parent award report block reply Firespawn 1 points 4 days ago \"Trump's Administration\"\nPersonally sure, however, he's had people around him who had/have the ability to do better by all law enforcement but apparently, and unlike Trump, they didn't and don't give 2 shits about them.\nIf they did, they'd send support and also make sure that standing down wouldn't be an issue.\nI doubt anyone is saying that Trump himself doesn't have their backs. Relax a little. permalink parent award report block reply spinometer2 2 points 4 days ago you can see in the videos there are at least 10 very capable and heavily armed men conducting this operation. it would take a small army to truly challenge them. as far as going after the perps afterwards, we all know the justice system is deeply deeply deeply broken. that will not be fixed for many years as the 90% of bad guys either retire or are found out and fired. but get real - that's a 20 year operation. permalink parent award report block reply Firespawn 2 points 4 days ago Couldn't agree with you more.  But the people around Trump have to make that call and let them engage. That's why I say it will be in our hands where we will be the last defense when it's said and done.\nIt's sad what this beautiful country has become. If in the 70s-90s someone would have told me we'd end up here I'd have told that person that they were absolutely insane. permalink parent award report block reply\nFirespawn 1 points 4 days ago \"Trump's Administration\"\nPersonally sure, however, he's had people around him who had/have the ability to do better by all law enforcement but apparently, and unlike Trump, they didn't and don't give 2 shits about them.\nIf they did, they'd send support and also make sure that standing down wouldn't be an issue.\nI doubt anyone is saying that Trump himself doesn't have their backs. Relax a little. permalink parent award report block reply spinometer2 2 points 4 days ago you can see in the videos there are at least 10 very capable and heavily armed men conducting this operation. it would take a small army to truly challenge them. as far as going after the perps afterwards, we all know the justice system is deeply deeply deeply broken. that will not be fixed for many years as the 90% of bad guys either retire or are found out and fired. but get real - that's a 20 year operation. permalink parent award report block reply Firespawn 2 points 4 days ago Couldn't agree with you more.  But the people around Trump have to make that call and let them engage. That's why I say it will be in our hands where we will be the last defense when it's said and done.\nIt's sad what this beautiful country has become. If in the 70s-90s someone would have told me we'd end up here I'd have told that person that they were absolutely insane. permalink parent award report block reply\nspinometer2 2 points 4 days ago you can see in the videos there are at least 10 very capable and heavily armed men conducting this operation. it would take a small army to truly challenge them. as far as going after the perps afterwards, we all know the justice system is deeply deeply deeply broken. that will not be fixed for many years as the 90% of bad guys either retire or are found out and fired. but get real - that's a 20 year operation. permalink parent award report block reply Firespawn 2 points 4 days ago Couldn't agree with you more.  But the people around Trump have to make that call and let them engage. That's why I say it will be in our hands where we will be the last defense when it's said and done.\nIt's sad what this beautiful country has become. If in the 70s-90s someone would have told me we'd end up here I'd have told that person that they were absolutely insane. permalink parent award report block reply\nFirespawn 2 points 4 days ago Couldn't agree with you more.  But the people around Trump have to make that call and let them engage. That's why I say it will be in our hands where we will be the last defense when it's said and done.\nIt's sad what this beautiful country has become. If in the 70s-90s someone would have told me we'd end up here I'd have told that person that they were absolutely insane. permalink parent award report block reply\nhenri_derelicte 16 points 4 days ago SCOTUS is mulling over whether the National Guard is needed. I really hope they consider this event as good cause to let President Trump send them in permalink award report block reply GBA4ever 1 points 4 days ago Chicago fake Dem news still reporting it as an “alleged” attack. permalink parent award report block reply\nGBA4ever 1 points 4 days ago Chicago fake Dem news still reporting it as an “alleged” attack. permalink parent award report block reply\nBruno 14 points 4 days ago Imagine for a moment if all of this were reversed: We killed a leftist speaker on college campus We shot and tried to assassinate a Democrat president We opened fire on federal agents under a Democrat administration We called for more murder and mayhem and had the gall to have multiple NO KINGS protests The imbalance in this country is so astronomically baffling to me that I feel like I'm in an episode of the Twilight Zone. permalink award report block reply TerrorOfLiberals 4 points 4 days ago I see similar imbalances between genders. Men in our society get absolutely trashed at every opportunity, while we worship women like they're gods. As a society, we value womens comfort more than unborn babies lives. Women can literally kill babies, and they do, and the majority of people seem to like that. permalink parent award report block reply current_horror 2 points 4 days ago You’re both describing the same thing. Democrats are the party of feminization. permalink parent award report block reply Klaus73 1 points 4 days ago -Gabrielle Giffords (2011) to say nothing of MLK.\n-JFK\n-Ammon/Ryan Bundy Oregon under the Obama admin\n-I mean if this site in any indication; though republicans are notoriously bad at protesting enmasse; the whole having jobs and families thing sometimes gets in the way. permalink parent award report block reply\nTerrorOfLiberals 4 points 4 days ago I see similar imbalances between genders. Men in our society get absolutely trashed at every opportunity, while we worship women like they're gods. As a society, we value womens comfort more than unborn babies lives. Women can literally kill babies, and they do, and the majority of people seem to like that. permalink parent award report block reply current_horror 2 points 4 days ago You’re both describing the same thing. Democrats are the party of feminization. permalink parent award report block reply\ncurrent_horror 2 points 4 days ago You’re both describing the same thing. Democrats are the party of feminization. permalink parent award report block reply\nKlaus73 1 points 4 days ago -Gabrielle Giffords (2011) to say nothing of MLK.\n-JFK\n-Ammon/Ryan Bundy Oregon under the Obama admin\n-I mean if this site in any indication; though republicans are notoriously bad at protesting enmasse; the whole having jobs and families thing sometimes gets in the way. permalink parent award report block reply\nHanging_Chad 12 points 4 days ago just kill the attacker permalink award report block reply MedicallyReddit 8 points 4 days ago This. Countless vids of city cops killing people but ICE can’t kill literal terrorists? permalink parent award report block reply Klaus73 2 points 4 days ago You'd think returning fire would be a trained reflex like in the army. permalink parent award report block reply\nMedicallyReddit 8 points 4 days ago This. Countless vids of city cops killing people but ICE can’t kill literal terrorists? permalink parent award report block reply Klaus73 2 points 4 days ago You'd think returning fire would be a trained reflex like in the army. permalink parent award report block reply\nKlaus73 2 points 4 days ago You'd think returning fire would be a trained reflex like in the army. permalink parent award report block reply\ningrowntoenail 10 points 4 days ago Which is why they need to carry live rounds instead of fucking paint balls.  As soon as shots are fired against these federal agents they should start firing back. permalink award report block reply DefKon1 8 points 4 days ago This reminds me of when I was overseas in the Army and they would send us on guard duty during \"high alert\" to the base perimeter with nothing but a radio. This always made me wonder just how deep a breach in defense would become before an armed response could be made. By my calculations it would have taken a minimum of 5 minutes. A lot of damage can happen in 5 minutes. But...nobody paid me to think, so I guess I was  having illegal thoughts. I'm embarrassed of myself.🤷 permalink parent award report block reply Firespawn 3 points 4 days ago 5 minutes is longer than many people realize. Hand to hand combat can be grueling. 30 seconds, 1 minute, etc... Time flies when we're having fun, but when it's bad, it seems like it takes so much longer. permalink parent award report block reply DefKon1 2 points 4 days ago Yup. 5 minutes unchallenged is long enough to establish a foothold that could last hours or even days. Or worse. permalink parent award report block reply Firespawn 2 points 4 days ago They had live ammo in DC, but obviously never used it. I remember a reddit faggot named \"freebricks4nazis\" having a complete shit fit like an Indian retard over it. 😂 He was so triggered, I was laughing at every post. permalink parent award report block reply\nDefKon1 8 points 4 days ago This reminds me of when I was overseas in the Army and they would send us on guard duty during \"high alert\" to the base perimeter with nothing but a radio. This always made me wonder just how deep a breach in defense would become before an armed response could be made. By my calculations it would have taken a minimum of 5 minutes. A lot of damage can happen in 5 minutes. But...nobody paid me to think, so I guess I was  having illegal thoughts. I'm embarrassed of myself.🤷 permalink parent award report block reply Firespawn 3 points 4 days ago 5 minutes is longer than many people realize. Hand to hand combat can be grueling. 30 seconds, 1 minute, etc... Time flies when we're having fun, but when it's bad, it seems like it takes so much longer. permalink parent award report block reply DefKon1 2 points 4 days ago Yup. 5 minutes unchallenged is long enough to establish a foothold that could last hours or even days. Or worse. permalink parent award report block reply\nFirespawn 3 points 4 days ago 5 minutes is longer than many people realize. Hand to hand combat can be grueling. 30 seconds, 1 minute, etc... Time flies when we're having fun, but when it's bad, it seems like it takes so much longer. permalink parent award report block reply DefKon1 2 points 4 days ago Yup. 5 minutes unchallenged is long enough to establish a foothold that could last hours or even days. Or worse. permalink parent award report block reply\nDefKon1 2 points 4 days ago Yup. 5 minutes unchallenged is long enough to establish a foothold that could last hours or even days. Or worse. permalink parent award report block reply\nFirespawn 2 points 4 days ago They had live ammo in DC, but obviously never used it. I remember a reddit faggot named \"freebricks4nazis\" having a complete shit fit like an Indian retard over it. 😂 He was so triggered, I was laughing at every post. permalink parent award report block reply\nPatriotSkorzeny 10 points 4 days ago BP shouldn’t have let the illegal aliens in. It’s been nothing but grief. permalink award report block reply Build_Back_Bankrupt 5 points 4 days ago Mayorkas stood down on purpose and didn't back them, this should be taken to the top, dereliction of duty at the top levels. permalink parent award report block reply ragnarokrobo 5 points 4 days ago And they accepted his orders and executed them with gusto. Including giving out fistbumps to illegals coming across the border and welding gates open for them. permalink parent award report block reply Build_Back_Bankrupt 0 points 4 days ago I remember, a lot of them were worried about losing their jobs and benefits, I'm sure some were glad to do it, but I also remember stories of BP / ICE speaking out and/or quitting. I can't say if the orders were illegal, but it was a dereliction of duty, and was likely coordinated with NGO's which would be a conspiracy, possibly illegal. permalink parent award report block reply ragnarokrobo 4 points 4 days ago Uh huh. The classic cry of law enforcement everywhere while they trample our rights and stab citizens in the back. MUUUH PEENNSIIOOONN!! permalink parent award report block reply view 1 more comments... Aggrieved03 3 points 4 days ago Helped them carry their bags. permalink parent award report block reply\nBuild_Back_Bankrupt 5 points 4 days ago Mayorkas stood down on purpose and didn't back them, this should be taken to the top, dereliction of duty at the top levels. permalink parent award report block reply ragnarokrobo 5 points 4 days ago And they accepted his orders and executed them with gusto. Including giving out fistbumps to illegals coming across the border and welding gates open for them. permalink parent award report block reply Build_Back_Bankrupt 0 points 4 days ago I remember, a lot of them were worried about losing their jobs and benefits, I'm sure some were glad to do it, but I also remember stories of BP / ICE speaking out and/or quitting. I can't say if the orders were illegal, but it was a dereliction of duty, and was likely coordinated with NGO's which would be a conspiracy, possibly illegal. permalink parent award report block reply ragnarokrobo 4 points 4 days ago Uh huh. The classic cry of law enforcement everywhere while they trample our rights and stab citizens in the back. MUUUH PEENNSIIOOONN!! permalink parent award report block reply view 1 more comments...\nragnarokrobo 5 points 4 days ago And they accepted his orders and executed them with gusto. Including giving out fistbumps to illegals coming across the border and welding gates open for them. permalink parent award report block reply Build_Back_Bankrupt 0 points 4 days ago I remember, a lot of them were worried about losing their jobs and benefits, I'm sure some were glad to do it, but I also remember stories of BP / ICE speaking out and/or quitting. I can't say if the orders were illegal, but it was a dereliction of duty, and was likely coordinated with NGO's which would be a conspiracy, possibly illegal. permalink parent award report block reply ragnarokrobo 4 points 4 days ago Uh huh. The classic cry of law enforcement everywhere while they trample our rights and stab citizens in the back. MUUUH PEENNSIIOOONN!! permalink parent award report block reply view 1 more comments...\nBuild_Back_Bankrupt 0 points 4 days ago I remember, a lot of them were worried about losing their jobs and benefits, I'm sure some were glad to do it, but I also remember stories of BP / ICE speaking out and/or quitting. I can't say if the orders were illegal, but it was a dereliction of duty, and was likely coordinated with NGO's which would be a conspiracy, possibly illegal. permalink parent award report block reply ragnarokrobo 4 points 4 days ago Uh huh. The classic cry of law enforcement everywhere while they trample our rights and stab citizens in the back. MUUUH PEENNSIIOOONN!! permalink parent award report block reply view 1 more comments...\nragnarokrobo 4 points 4 days ago Uh huh. The classic cry of law enforcement everywhere while they trample our rights and stab citizens in the back. MUUUH PEENNSIIOOONN!! permalink parent award report block reply view 1 more comments...\nAggrieved03 3 points 4 days ago Helped them carry their bags. permalink parent award report block reply\nPotatusHead 9 points 4 days ago Scramble the SHIT BOMBER! permalink award report block reply RedStoneDeepState 12 points 4 days ago Instructions unclear, A10 Warthog deployed. permalink parent award report block reply PotatusHead 4 points 4 days ago bbbbBBBBBBBBBBBBBRRRRRRRRRRRRRRRRRRRRRRRRRTTTTTTTTTTTT!!! permalink parent award report block reply PhilipeNegro 4 points 4 days ago Ya hear that Bubs? The shithawks are flying low. permalink parent award report block reply donteatthat 3 points 4 days ago Lahey you're a dick permalink parent award report block reply PhilipeNegro 1 points 4 days ago I am the liquor permalink parent award report block reply\nRedStoneDeepState 12 points 4 days ago Instructions unclear, A10 Warthog deployed. permalink parent award report block reply PotatusHead 4 points 4 days ago bbbbBBBBBBBBBBBBBRRRRRRRRRRRRRRRRRRRRRRRRRTTTTTTTTTTTT!!! permalink parent award report block reply\nPotatusHead 4 points 4 days ago bbbbBBBBBBBBBBBBBRRRRRRRRRRRRRRRRRRRRRRRRRTTTTTTTTTTTT!!! permalink parent award report block reply\nPhilipeNegro 4 points 4 days ago Ya hear that Bubs? The shithawks are flying low. permalink parent award report block reply donteatthat 3 points 4 days ago Lahey you're a dick permalink parent award report block reply PhilipeNegro 1 points 4 days ago I am the liquor permalink parent award report block reply\ndonteatthat 3 points 4 days ago Lahey you're a dick permalink parent award report block reply PhilipeNegro 1 points 4 days ago I am the liquor permalink parent award report block reply\nPhilipeNegro 1 points 4 days ago I am the liquor permalink parent award report block reply\nTheRedPilledArtist OP 9 points 4 days ago SOURCE: https://x.com/GuntherEagleman/status/1987252362059075683 permalink award report block reply Firespawn 2 points 4 days ago I follow him on X but I muted him. Being a small account, I've made several comments in different threads that didn't get much visibility and he'd post my comments as if they were his own words. Of course he'd get a lot of reposts/likes. Not jealous, it's just if we're all patriots, then fucking act like it.\nX is like a pool hall to him where he and a select few are regulars while everyone else are just a bunch of nobodies. His ego is obnoxious. permalink parent award report block reply bluntedaffect 2 points 4 days ago That's not a source. That's a tweet without a source. permalink parent award report block reply\nFirespawn 2 points 4 days ago I follow him on X but I muted him. Being a small account, I've made several comments in different threads that didn't get much visibility and he'd post my comments as if they were his own words. Of course he'd get a lot of reposts/likes. Not jealous, it's just if we're all patriots, then fucking act like it.\nX is like a pool hall to him where he and a select few are regulars while everyone else are just a bunch of nobodies. His ego is obnoxious. permalink parent award report block reply\nbluntedaffect 2 points 4 days ago That's not a source. That's a tweet without a source. permalink parent award report block reply\nOhioRepublic 8 points 4 days ago Send in BORTAC units in fucking Bearcats and subdue these illegals and their accomplices at gunpoint. permalink award report block reply I_Love_45-70_Gov 3 points 4 days ago BOTAC will fuck there shit up. 🤗 permalink parent award report block reply\nI_Love_45-70_Gov 3 points 4 days ago BOTAC will fuck there shit up. 🤗 permalink parent award report block reply\nQuiznos585 8 points 4 days ago One of the police officers that responded also got run over , they caught whoever did that part of it https://x.com/ChicagoContrar1/status/1987196299985170745 permalink award report block reply\nUnapprovedNarrative 5 points 4 days ago We knew this day would come, and so did Trump and his team. Ice now has the predicate to start busting heads and using live ammunition against these terrorists. They literally just guaranteed their own destruction. permalink award report block reply\nAggrieved03 5 points 4 days ago But they gave an oral warning to people committing violent crimes, that didn’t protect them? Cops being this hands off comes from the top. permalink award report block reply\nmikethemarine 4 points 4 days ago don't send in the troops yet, wait till I get there with my weapons, so I get to help out permalink award report block reply\nVirTW 3 points 4 days ago If the worst happens and an ice agents is killed the right better make the left pay for all their anti ice rhetoric permalink award report block reply\nSisterCovfefeToo 3 points 4 days ago But but a judge said it wasn't as bad as border patrol said! permalink award report block reply\nTrumpLandslide20201 3 points 4 days ago I say please, please, please Mr. President unleash the military on the enemy within. permalink award report block reply\nMADASHELLNEWS 3 points 4 days ago They should block all exits to the city with check points and slowly roll in and deport them all with national guard permalink award report block reply\nArea82 3 points 4 days ago Biden is a corrupt, lying pedo.  Always has been. permalink award report block reply\nMidwestZoomer 2 points 4 days ago Day late and a dollar short permalink award report block reply\nBeardholder 2 points 4 days ago Every Democrat mayor and governor need to be arrested for treason RIGHT NOW! permalink award report block reply\nKilroy 2 points 4 days ago Perhaps if princess Bondi held one more press conference and threatened to arrest and prosecute ANYONE who impeded ice or harbored illegal alien's, that would help? /S permalink award report block reply\nLiberalTearsMiner 2 points 4 days ago This shows how weak republicans are, no matter how bad it gets for us we will never fight. permalink award report block reply\nweltallic 2 points 4 days ago https://cdn.imgchest.com/files/966df915bd31.PNG permalink award report block reply\nBlueKentuckyGirl 2 points 4 days ago NOW permalink award report block reply\nfriarfox 2 points 4 days ago And some judge says tear gas can't be used. Go figure. permalink award report block reply\nSGT_Glowie 2 points 4 days ago plot twist the bullet was actually just a ricochet from black on black crime permalink award report block reply\nRock9Head 2 points 4 days ago Was it one of the Biden judges? permalink award report block reply\nfootinmouth 2 points 4 days ago You don't need to arrest criminal aliens, you can just you know, do stuff. permalink award report block reply\nMEGAWATTMAGASIGN 2 points 4 days ago Don’t forget the tanks! permalink award report block reply\nRealTXPatriot 2 points 4 days ago Link? permalink award report block reply\nduznmatter 1 points 4 days ago Just like the 1983 bombing of the Marine barracks in Beirut when the guards were told to stand their guard post with no rounds in their weapon. Just waiting for a disaster. Understand, we have to have a murderous disaster to respond. I mean how can we just start shooting these assholes without a mass shooting of ICE? The MSM will make anyone look like criminals without said disaster. The feeling out there from what I read is \"Don't be found wanting while you still have the chance to prepare\" permalink award report block reply\nL74ge9wr 1 points 4 days ago If felony charges, lose gun ownership privlege, lose voting rights.  Is that correct? permalink award report block reply\nknnbccb 1 points 4 days ago Told you that the military needs to get involved. Deportation area = hostile combat zone. Permissible to use lethal force. permalink award report block reply\nSavage_Patriot_1776 1 points 4 days ago New link please? Not working. permalink award report block reply\nLePEDES 1 points 4 days ago Trump ain’t doing shit lately democrats have dug in too deep and congress is useless…. permalink award report block reply\nIhateallliars 1 points 4 days ago All hail the traitors. Expect To start hearing this. From these communist & Soros (Hidden hand) types. Apparently, simple minds are easy to manipulate. permalink award report block reply\niLLNESS 1 points 4 days ago Could you imagine if a right winger was doing 1/100th of the shit that these deranged leftists are doing towards ICE? There'd be 24/7 news about how violent conservatives are based on the actions of 1... Here we are with constant attacks from lefties across the country and silence... This is genuinely infuriating. permalink award report block reply\nKlaus73 1 points 4 days ago I will wait to see if they find anyone from the drive-by shooting. Seen too many false flags to just be like \"doooy okie!\" permalink award report block reply\nroadrunner0 1 points 4 days ago Armored stealth minivans with 8 of these firing through gun ports and a pop up rotating turret driving through the mass of Lefty retards.. https://blade-city.com/blogs/gun-knife-blog/the-belt-fed-12-gauge-you-need-to-see-in-action Who needs a minigun when you can throw out thousands of .25 caliber pellets a minute.. permalink award report block reply\nAlldayeveryday 1 points 4 days ago When they don't arrest these psychopaths it just emboldens them permalink award report block reply\nJoeBidensDementia1 1 points 4 days ago More pepper rounds! permalink award report block reply\nShih_Tabed 1 points 4 days ago Folks need to take more hunting trips to Chicago.  So many interstates to use to get in and out quick. permalink award report block reply\nNickAtNight 1 points 4 days ago First arrest the Judge permalink award report block reply\nNarcan 1 points 4 days ago Again? permalink award report block reply\nYodaBannon 1 points 4 days ago Serious FAF permalink award report block reply\ngorilla_grip 1 points 4 days ago There has to be a law that they can use to arrest these people. Throwing them on the ground isn’t enough. They need to go spend 10 or 30 days in county lock up minimum permalink award report block reply\nKarenLukasik 1 points 4 days ago Time for the insurrection Act permalink award report block reply\nElectricDragon- 1 points 4 days ago This is libersl radicalization.  I actually can't believe anyone would care about this that much naturally. permalink award report block reply\nTrumpette1 1 points 4 days ago OMG permalink award report block reply\nlostremote- 0 points 4 days ago I really need someone here to tell us how this is Israels fault! permalink award report block reply Roadpower 1 points 4 days ago http://en.wikipedia.org/wiki/HIAS You can include Catholic charities as well. They are all forces of destruction upon the west. permalink parent award report block reply lostremote- 1 points 4 days ago that i can agree with permalink parent award report block reply\nRoadpower 1 points 4 days ago http://en.wikipedia.org/wiki/HIAS You can include Catholic charities as well. They are all forces of destruction upon the west. permalink parent award report block reply lostremote- 1 points 4 days ago that i can agree with permalink parent award report block reply\nlostremote- 1 points 4 days ago that i can agree with permalink parent award report block reply\nAppalachianTactical 0 points 4 days ago Black jeep. Why are these feds so hard on their fed bros? permalink award report block reply\nBitterRoots 0 points 4 days ago I've given up expecting President Trump to take decisive steps to back ICE agents risking everything 🙄 permalink award report block reply PoohClimbsTrees 1 points 4 days ago They down voted you, but had no response to your statement. \"When is enough,  enough?\" Is a really good question. permalink parent award report block reply breadbaker 1 points 4 days ago Trump probably isn't. He is either holding violence provoked by ICE and retaliated by lefty radicals as a card until midterm elections or, the exact opposite, Trump doesn't want to inflame things more. The more nuanced approach: they are trying to create under the radar chaos and fear in lives of illegals so they leave and the arrests are as much toward that as get some really bad people out. permalink parent award report block reply\nPoohClimbsTrees 1 points 4 days ago They down voted you, but had no response to your statement. \"When is enough,  enough?\" Is a really good question. permalink parent award report block reply\nbreadbaker 1 points 4 days ago Trump probably isn't. He is either holding violence provoked by ICE and retaliated by lefty radicals as a card until midterm elections or, the exact opposite, Trump doesn't want to inflame things more. The more nuanced approach: they are trying to create under the radar chaos and fear in lives of illegals so they leave and the arrests are as much toward that as get some really bad people out. permalink parent award report block reply\nspinometer2 -2 points 4 days ago DOOMERS GET OUT permalink award report block reply",
  "fetched_at": "2025-11-12T20:44:16.876968Z"
}