{
  "id": "1ARK0UanTd",
  "url": "https://patriots.win/p/1ARK0UanTd/robert-barnes-israel-is-a-losing/c",
  "content": "841 Robert Barnes: \"Israel is a losing issue, signified when NYC, most Jewish city in the nation, chooses a Muslim Mayor promising to arrest Bibi if he steps foot into the city. Israel is rapidly becoming a political pariah in America, and no amount of whining from pro-Israel community will change that\" posted 7 days ago by raptoris2 123 comments award share report block Robert Barnes @barnes_law • 7d A few notes on the election. A massive alarm for the GOP. First, this was a nationalized election. Candidate quality didn't matter. Candidate spending didn't matter. Local issues didn't matter. Incumbent history didn't matter. Individual scandals didn't matter. It swept in blue\n123 comments Sort by Top Top New Worst Old Save loooooof 72 points 7 days ago Listen up, Trump. Susie Wiles is hurting you. permalink award report block reply anotherthing 32 points 7 days ago Miriam Adelson is hurting him. She's the lady that gave Trump $100M in 2024 for his campaign, and she's the second largest donor to AIPAC. The number one donor to AIPAC is the guy that started OnlyFans. permalink parent award report block reply taxesaretheft 19 points 7 days ago Trump is owned by these people! permalink parent award report block reply J_Dubya_C 7 points 7 days ago Any source for the onlyfans guy donating to aipac? Only thing I can find is an article from rollingstones which doesn't specify the amount and hasn't been corroborated by anyone else permalink parent award report block reply anotherthing 5 points 7 days ago Leonid Radvinsky is the guy that currently owns the majority stake of OnlyFans. Him and his wife donated jointly to to AIPAC to the tune of $11 million. https://www.newstarget.com/2024-02-04-onlyfans-owner-biggest-donor-pro-israel-aipac.html permalink parent award report block reply J_Dubya_C 1 points 6 days ago That's a lot. Definitely not the largest donor but still a scumbag. permalink parent award report block reply loooooof 4 points 6 days ago Yes. And Wiles does Adelson's bidding. She's a minder. permalink parent award report block reply Ivleeeg -11 points 7 days ago Actually it's idiots obsessed with aipac that are hurting him. permalink parent award report block reply justinkayz 8 points 7 days ago The only idiots are the ones who can't read the room right now. The Left AND the Right have had enough of ZOG. permalink parent award report block reply okboomer59 -4 points 6 days ago Idiot fails to read the room. https://allthatsinteresting.com/wordpress/wp-content/uploads/2013/05/august-landmesser-no-salute.jpg permalink parent award report block reply view 1 more comments... HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply Wallllllllllllllllll 52 points 7 days ago Fuck Israel. permalink award report block reply MAGARondonmonson -25 points 7 days ago Satan getting the 1930s Germany types lined up again. permalink parent award report block reply BadBrainsBuzzcocks 22 points 7 days ago No. I'm just tired of having supported them for the last 30 years, as a conservative and a Zionist. The unwaivering support is not reciprocal. That's the fucking issue. They support communists and have forever. I'm done. permalink parent award report block reply MAGARondonmonson -6 points 7 days ago That is because you have fallen for the Liberal Medias FAV. PLAY, to Divide & Conquer. Remember how they tried to divide Trump and Banon in term 1 and they do this with all Republicans, that is exactly what you are falling for with these BS rumors they spread about how Bibi lies to Trump, Bibi acts this way or this way and Trump scold Bibi behind the scenes etc. etc. Why do you dal fir the medias BS lines over and over? Bibi is pro Israel, and if that means lying to take out Iran GOOD, not that that is true, but who cares if it is, Obama got his nuclear program off the ground, so however Bibi and Israel gets it taken out is OK by me and we need to all SHUT UP about Israel and Bibi meddling, Obama and our damned whole media has meddled in every election they have trying to get a liberal elected. Bibi and Israel could have wiped out their nuke program in its infancy but were always told to not go after their nuke program 2.) No matter what any of the anti Israel guys say, they are in error, God is going to protect Israel, and the USA will be wiped out by the Rev. 8 Asteroid, after the Rapture of course. Trumps 1-4 are all ONE EVENT it describes an Asteroid Impact. And the 1/3 is a destination point, meaning the NEW WORLD & The Pacific Ocean which covers 1/3 of the earths surface. 3.) As per individual Jews, they are like the rest of us, most humans do not now God, the Jewish peoples have been blinded as a Nation for nigh 2000 years, but will soon be allowed to see again, after the fulness of the Gentiles [SERVICE) comes in, meaning the Church's mission is over, and we got to be with Jesus. permalink parent award report block reply LirukDatan -6 points 7 days ago Do you think the New York Jews somehow represent Israel? Israel supports USA. NY Jews, who are mostly orthodox, don't even support Israel... Especially now since Israel is trying to make Orthodox Jews serve in the army, chip in instead of being taxpayer money leeches. permalink parent award report block reply Maskurbator 6 points 7 days ago Israel doesn't support USA. Like saying a mosquito supports a horse. It only takes from us. It doesn't contribute. And it only wants us alive so it can keep mooching and sapping our resources..if Israel ceased to exist tomorrow, our legislators would actually start doing normal things like passing laws that make sense. permalink parent award report block reply view 8 more comments... ShadowInv 13 points 7 days ago Jews are a small minority in the usa and they have all the wealth. Central banks, real estate, hollywood, media, tech companies, politicians. They hate white people. They put indians in charge of their tech companies once they cash out. Then cry more. They have ruined all the white countries. If white people get together somewhere its the jews that will complain to stop it. Why? permalink parent award report block reply MAGARondonmonson -5 points 7 days ago So? They feel they have to stick together because Satan time after time has tried to kill them off. The fact is God has promised them they will rule with Jesus as humans for the 1000 year reign. We will be in Glorious bodies, most will not even be assigned to earth, Rev. 20:4 makes that clear ONLY those were were murdered by the Beast for refusing the Mark of the Beast will live and reign with Jesus [on this earth] for the 1000 years. Why worry about the Jewish peoples lack of understandings when God told us He was going to forsake them (God rent the temple or left and forsook Israel) until our time as the Gentile Church was over with, then He would once again call them unto repentance. It doesn't matter what you or I think, it only matters what God has already determined in His heart. permalink parent award report block reply FBIsurveillance 6 points 7 days ago Bibi is literally modern hitler permalink parent award report block reply Ivleeeg -3 points 7 days ago Yeah he's killing all the jews... Oh wait... That's right, it was Palestine that researched the success of Hitler and created hamas. Oops. permalink parent award report block reply MAGARondonmonson -4 points 7 days ago Yup, he's killing Jews, that is NONSENSICAL. The Arabs and Muslims are the evil doers. permalink parent award report block reply Maskurbator 4 points 7 days ago Arab isn't a religion. There are Arab Christians. Wtf? permalink parent award report block reply view 1 more comments... Maskurbator 3 points 7 days ago Oh fuck off you cunt. permalink parent award report block reply MAGARondonmonson 0 points 6 days ago Vulgar little man hey? Talk to a preacher of 40 years with that mouth, shame on you son. permalink parent award report block reply Maskurbator 1 points 6 days ago You preach bullshit. permalink parent award report block reply view 1 more comments... load 4 more comments... BadBrainsBuzzcocks 19 points 7 days ago The issue for me, as much as I prefer having a democracy and ally in Israel, the Jews in this country have fucked themselves for years voting socialist and aligning themselves with the despicable ADL. I find it extremely hard defending and supporting them. 30 years ago, working on wall street I was always mystified meeting these Jews that voted for their own demise on repeat. At this point fuck them. I'm super pissed. They learn nothing. permalink award report block reply ShadowInv 15 points 7 days ago They hate white people and want them gone. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply Maskurbator 9 points 7 days ago Jews don't vote for their own demise. They won't for whites demise and end up fucking themselves over in the process because Jews require a host society. Notice they have their own nation which they basically refuse to move to..noz it's much more lucrative to hang out in white nations and suck off the tit of the high trust societies those whites make, while also ruining them with porn and shit. permalink parent award report block reply justicein2020 9 points 7 days ago That 'ally' has flooded our country with subhumans.  That hate them. And us. It's by design. Their crazy ass religion. says the end is the world vs. israel. and god steps in and saves them. you don't believe it. i don't either. but they do. they are making it happen. anything not happening will be forced. fake it till they make it. We need to get serious about the two religions on the planet that say to wipe out everyone else... permalink parent award report block reply RedPillosopher1776 16 points 7 days ago They should get more unconstitutional laws passed to punish anyone who dares to say bad things about the jews or israel, I'm sure that'll do wonders for their PR problems. permalink award report block reply 1776er 8 points 7 days ago Yeah, that’s really such an obvious mistake.  I can’t stand it either.  Surely censorship will work, instead of opening a dialogue and addressing the points people make!  Dialogue is dead in America today, it got shot in the neck on a college campus permalink parent award report block reply ReleasetheList 2 points 7 days ago Probably the first order of business when the govt reopens. permalink parent award report block reply 2016TrumpMAGA 10 points 7 days ago To every pro-immigration jew in NY: You just got what you deserve. permalink award report block reply Firepit 6 points 7 days ago They can flee to Israel. The rest of them are stuck. permalink parent award report block reply justinkayz 5 points 7 days ago They'll just go to Florida and fuck it up. permalink parent award report block reply Firepit 1 points 6 days ago They’re already there permalink parent award report block reply TheMemeSpiceMustFlow 9 points 7 days ago Who would have thought that going around telling everyone you're chosen by God, demand they give you billions of dollars to help conquer land, and if they ask any questions about the millions women and children living there you scream in their face and call them a nazi, would make people not like you. Weird how that works. permalink award report block reply Ch3f4554551n 6 points 6 days ago They run both parties. Globally. Soros or Adelson. The Bronfmans or The WEF. Mossad or the CIA. The Bushes or the Clintons. Until a majority of us understand this, nothing will change. permalink award report block reply LastconservativeNY2 5 points 6 days ago The Jews (\"vote blue no matter who\") probably voted for him, but let's not forget that NYC is majority minority. Mamdami was elected by illegals/immigrants. One chart said that 70% of those that elected him were \"foreign born\"; demographics are destiny. permalink award report block reply keeman 5 points 7 days ago A ton of Jews in the USA have no love for Israel.  And if you point this out then Israel will ensure that you are labeled an anti-semite.  Ben Shapiro may even stand behind his doctor wife (who is a doctor) and call you this. permalink award report block reply EvensoAmen 5 points 7 days ago Disagree with this. Non-MAGA candidates don’t win. Cuomo? Dude is a totalitarian,,,hello,,,COVID anyone? New York City is stupid enough to vote for Mandan but not so stupid to vote for a grandma killer. permalink award report block reply GreyKnight 4 points 7 days ago Doesn’t mean I want Muslims in office either…the dem voters have no independence or critical thinking and many voted for a Muslim just to spite Israel…in an American election… I hate all three. permalink award report block reply SaxonRealm 4 points 7 days ago Nothing alarming. Blue states voted blue. permalink award report block reply Maskurbator 2 points 7 days ago That's the take away and the left is masturbating themselves over it. You mean far left cities elected far left candidates and far left states passed far left laws?.Nooooo way! This must be the end of Drumph. That said, there are a few issues hanging around his neck weighing him and the Rs down. And Israel IS one of them. The left will claim it's Epstein. It that's the same crowd that for the past decade has been total okay with fucking kids and mutilating kids and sexualizing kids, and of course killing kids, and normalizing sex workers, so they don't actually give two shits about some sex stuff. I'm sure that's a minor component of it..like 5%.\nBut really it's: Shit is still expensive as fuck Israel, shilling, cock sucking, etc Deportations are slower than expected The pandering to Indians and their demonic holidays when white Christians are struggling Indians in general really. They managed to leap from blacks and Jews for the most loathed group in America. Even Dems don't like them. He should kick out ALL.of the visa workers..that would boost jobs numbers significantly making the.left.and right happy. permalink parent award report block reply chahn1138 2 points 6 days ago Great post! permalink award report block reply Repentnow 2 points 7 days ago All good unless the Muslims are the reason. permalink award report block reply 1LoathsomeDove 1 points 6 days ago NYC is dependent on tourism.\nEvery crime, every debauchery, every littered street & every boarded store front should be on blast. \"NYC isn't safe\" should trend every day. permalink award report block reply medicpatriot 1 points 7 days ago I really don’t care that NYC elected some camel jockey. I mean, what did you expect to happen? This is the result of letting our country be browned. permalink award report block reply benjovikenobi 0 points 7 days ago Second... See hispanic precincts... the youth vote... Third... the populist rebellion reaches deep w/in Democratic ranks as well, as the upstart Mamdani Move, countermove. The democrats see that populist appeal matters more than establishment credentials, so they aren't running geriatric establishment swamp monster candidates anymore. Fourth, Israel... NYC, the most Jewish city in the nation, chooses a Muslim Mayor Acting like Jews are the only people in New York, like New York is the only place in America with Jews, and like New York isn't the east coast swamp capital full of illegals, welfare queens, and \"old money\" democrats. A concrete jungle where kids can grow up never having seen a cornfield, a mountain, or a forest in their life. Butbutbut muh joooooooooos. With all due respect, has Barnes even been to New York? It's basically Atlantic Los Angeles, with worse weather. Remember when the democrats tried to persecute Eric Adams, the previous democrat mayor, because he went off the reservation and started complaining about all the illegals being shipped north from Florida and Texas? (and then President Trump pardoned him). The illegals voted! How quickly we forget. permalink award report block reply DicksOutForHarambe 0 points 7 days ago Goat fuckers unite! permalink award report block reply jonnyuno 0 points 7 days ago Very true.  However,  blue cities and states voted radically blue.  Where is the issue here? Let these places collapse,  zero funding, and we focus on our stares to keep and win. permalink award report block reply NoraScholar -1 points 7 days ago That's a tragedy.  The discourse has gone from mere criticism of Israel's policies to flat-out Nazi-style anti-semitism. That being said, considering how much Jews here support the Demonshit party, they are their own worst enemy. permalink award report block reply medicpatriot 6 points 7 days ago Antisemitism wouldn’t exist if the Jews could improve their behavior. permalink parent award report block reply AgnesDomini -1 points 7 days ago What an idiot. Bibi has diplomatic immunity,  and cannot be arrested by that little prick... permalink award report block reply pollsarefake -1 points 7 days ago Exactly We didn’t lose It was STOLEN just like 2020 Only dead people voted for Mamdani permalink parent award report block reply JamesBlomey 0 points 7 days ago Also  the braindead. permalink parent award report block reply Canadiapede7 -1 points 6 days ago Lmfao, except that it was clearly foreign born who got Muslim boy elected, you people are retarded. permalink award report block reply jiujiujiu -2 points 7 days ago Jews on the chopping block once again. Christians will follow soon after. permalink award report block reply Lurkmoore -2 points 7 days ago Prophecy in progress. The times of the gentiles are ending. permalink award report block reply KungPaoMcChicken -3 points 7 days ago New York doesn't matter, I want Trump resort in Gaza. permalink award report block reply mty_green_go -9 points 7 days ago The juice didnt choose the muslim you fucking retard it's all the fags and minimum wage workers permalink award report block reply staroframphansbhole 28 points 7 days ago There was literally an ad called trans rabbis for mamdani and 1/5 of NYC's population is jew so they did choose him buddy permalink parent award report block reply mty_green_go -7 points 7 days ago That's called a meme buddy We produce shit that doesn't make sense here every single day.  Just because there is an ad fabricated doesn't mean it was approved by all of the population.  Ref: Douglas Mackey permalink parent award report block reply JamesBlomey 1 points 7 days ago Hol'up, it's the stuff that doesn't make sense that makes sense. permalink parent award report block reply giggitybooped 10 points 7 days ago I don't agree with it at all but in today's current economy I understand why people are pissed off at the system. The rich have only gotten substantially richer while the mom and pop shops and the little guy have lost their livelihoods. Biden damage was and still is significant permalink parent award report block reply Repentnow -1 points 7 days ago Maybe. Or maybe mom and pop shops are irrelevant in an online world and no one is to blame. Gasp, sacrilege. permalink parent award report block reply anotherthing 6 points 7 days ago Regulation was killing them before that. The EPA is what killed off the mom and pop gas stations. Now they're either corporate owned or owned by refugees with government credits. Things like crazy minimum wages in blue areas kill off independent fast food places. MacDonald's can weather things like that, and replace those workers with kiosks and automation, mom and pop fast food places can't do that, so they just fold. permalink parent award report block reply TrumpYouMagaFrenner -16 points 7 days ago Oh stfu. This jackass doesnt know shit. New York always has been and will be blue. Nothing to do with Israel. permalink award report block reply henri_derelicte -21 points 7 days ago For all intents and purposes, Trump ended the Gaza war resulting in an Israeli victory. Not as outright of an Israeli victory as some would have liked, but Israel won the war hands down. Leftist groups have been trying to diplomatically isolate Israel for years trying to force this “two state solution” on them despite the fact it will be detrimental to their security interests in the long run. It’s the same playbook they used with South Africa during apartheid. They knew that apartheid-eta South Africa could be a right-leaning country and Israel today can be the same if they continue to have their way with the Palestinians. A big reason the issue is becoming more prominent is the mass importation of Muslims post 9/11, and I’m disappointed the administration has yet to announce any plans to deport them, regardless of legal/citizenship status. permalink award report block reply staroframphansbhole 7 points 7 days ago Israel shouldn't exist and one day it won't, either by man's hand or God's. Enjoy! permalink parent award report block reply henri_derelicte -1 points 7 days ago If given the choice between Israel’s continued existence or returning the land to Muslim control, then I will gladly side with Israel. Not that I agree with everything Israel has done or is doing, but because the Muslims are a far greater threat to everything I care about and hold dear. permalink parent award report block reply Repentnow 6 points 7 days ago I think if you dig a little deeper, you'll find that the differences are less and less. permalink parent award report block reply staroframphansbhole 1 points 6 days ago Better idea, Israel becomes Christian since it really belongs to us anyway permalink parent award report block reply henri_derelicte -1 points 6 days ago The Middle East needs a Christian state, but that land should come at the expense of Muslims. Israel can keep what they have permalink parent award report block reply view 1 more comments... ParmesanCartel 5 points 7 days ago I knew you were retarded by the 9th word permalink parent award report block reply mty_green_go 0 points 7 days ago how could a war with Gaza end up with a loss by any country except south sudan ? of course it was an Israeli \"victory\" permalink parent award report block reply Agent_86 -24 points 7 days ago Well here's a big dick to suck you JDS nut job. A CNN exit-poll found that about 33% of Jewish voters supported Mamdani, while 63% backed Cuomo. permalink award report block reply sordfysh PRO 32 points 7 days ago So 99% of NYC Jews voted for communists. permalink parent award report block reply LORDFALCONE 9 points 7 days ago MANY SUCH CASES permalink parent award report block reply TrumpYouMagaFrenner 3 points 7 days ago Liberal new York voted liberal. Jewish or not. Wow shock permalink parent award report block reply Agent_86 -1 points 7 days ago Yep. But the op said they mostly voted for mamdani which wasn't the case. permalink parent award report block reply blitzkrieg1 8 points 7 days ago So all jews are idiots/ permalink parent award report block reply JamesBlomey 0 points 7 days ago Username umami detected. permalink parent award report block reply Agent_86 -4 points 7 days ago No idea what you mean dude. Elucidate. permalink parent award report block reply justinkayz 4 points 7 days ago So you're telling me that 99% of Jews are retarded? permalink parent award report block reply Agent_86 -1 points 6 days ago Have you thought about seeing a councilor? The psychological damage you seem to have suffered seems pretty bad. Trying to dehumanize an entire demographic is sickening to me. It literally turns my stomach to think people like you walk this earth. NO 99% of Jews are not retarded. People vote their conscious and for what they believe in. They have the right to do so given to them by God. It isn't how you want them to vote TFB. I don't agree with their voting choice but ultimately its none of my business. Your attitude is disgusting to me. Good bye. permalink parent award report block reply TrumpYouMagaFrenner -5 points 7 days ago They downvote the truth lol permalink parent award report block reply Agent_86 -4 points 7 days ago every time. permalink parent award report block reply dankai420 -12 points 7 days ago The majority of Jews is conservative but the minority that supports the far-left are literally suicidal. permalink parent award report block reply cereal_killer 22 points 7 days ago What the fuck are you talking about? Jews in America are overwhelmingly liberal. The only time in the last century that Jews didn't vote majority Democrat is when they voted for a socialist running for president in 1920 . permalink parent award report block reply imnotdeadyet 16 points 7 days ago There are 2.1 Million Jews in NYC.  The most of any city outside Israel.  If they voted against Mamdani, he wouldn't have won.  They lied to CNN. permalink parent award report block reply Repentnow 0 points 7 days ago 730,000 adult Jews in the five boroughs. https://www.ujafedny.org/news/uja-federation-of-new-yorks-2023-jewish-community-study-of-new-york?utm_source=chatgpt.com permalink parent award report block reply imnotdeadyet 6 points 7 days ago Funny how these AI engines give different answers.  I just asked again and got this \"As of 2020, over 960,000 Jews lived in the five boroughs of New York City, and over 1.9 million Jews lived in the New York metropolitan area, approximately 25% of the American Jewish population. Nearly half of the city's Jews live in Brooklyn.\" permalink parent award report block reply view 1 more comments... Nerdrem3 12 points 7 days ago No, the majority of orthodox jews are conservative, the majority of jews are not orthodox. There are more orthodox jews in NYC than probably any other place in the US which skews the numbers. permalink parent award report block reply DrCowboyPresident 8 points 7 days ago And even the orthodox have a deep seated fear and hatred of any nationalism that isn't theirs. That's the prime issue. And the non-orthodox hate all nationalism whatsoever. permalink parent award report block reply staroframphansbhole 10 points 7 days ago The majority of Jews is conservative This is probably one of the most misinformed things I've ever read on this site permalink parent award report block reply Aggrieved03 9 points 7 days ago Where’d you get that bs stat? 85% of them are Democrats. permalink parent award report block reply load 2 more comments... tingo999 -26 points 7 days ago You stupid fuck they are working to destroy Israel just like they are trying to destroy the USA. They are trying to lock up Netanyahu just like Trump. The flooded Israel with Arabs and Africans just like the USA. You're ignorant twat. permalink award report block reply mty_green_go 8 points 7 days ago at least Israel is unapologetic about sterilizing them when they come in , lol permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nloooooof 72 points 7 days ago Listen up, Trump. Susie Wiles is hurting you. permalink award report block reply anotherthing 32 points 7 days ago Miriam Adelson is hurting him. She's the lady that gave Trump $100M in 2024 for his campaign, and she's the second largest donor to AIPAC. The number one donor to AIPAC is the guy that started OnlyFans. permalink parent award report block reply taxesaretheft 19 points 7 days ago Trump is owned by these people! permalink parent award report block reply J_Dubya_C 7 points 7 days ago Any source for the onlyfans guy donating to aipac? Only thing I can find is an article from rollingstones which doesn't specify the amount and hasn't been corroborated by anyone else permalink parent award report block reply anotherthing 5 points 7 days ago Leonid Radvinsky is the guy that currently owns the majority stake of OnlyFans. Him and his wife donated jointly to to AIPAC to the tune of $11 million. https://www.newstarget.com/2024-02-04-onlyfans-owner-biggest-donor-pro-israel-aipac.html permalink parent award report block reply J_Dubya_C 1 points 6 days ago That's a lot. Definitely not the largest donor but still a scumbag. permalink parent award report block reply loooooof 4 points 6 days ago Yes. And Wiles does Adelson's bidding. She's a minder. permalink parent award report block reply Ivleeeg -11 points 7 days ago Actually it's idiots obsessed with aipac that are hurting him. permalink parent award report block reply justinkayz 8 points 7 days ago The only idiots are the ones who can't read the room right now. The Left AND the Right have had enough of ZOG. permalink parent award report block reply okboomer59 -4 points 6 days ago Idiot fails to read the room. https://allthatsinteresting.com/wordpress/wp-content/uploads/2013/05/august-landmesser-no-salute.jpg permalink parent award report block reply view 1 more comments... HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nanotherthing 32 points 7 days ago Miriam Adelson is hurting him. She's the lady that gave Trump $100M in 2024 for his campaign, and she's the second largest donor to AIPAC. The number one donor to AIPAC is the guy that started OnlyFans. permalink parent award report block reply taxesaretheft 19 points 7 days ago Trump is owned by these people! permalink parent award report block reply J_Dubya_C 7 points 7 days ago Any source for the onlyfans guy donating to aipac? Only thing I can find is an article from rollingstones which doesn't specify the amount and hasn't been corroborated by anyone else permalink parent award report block reply anotherthing 5 points 7 days ago Leonid Radvinsky is the guy that currently owns the majority stake of OnlyFans. Him and his wife donated jointly to to AIPAC to the tune of $11 million. https://www.newstarget.com/2024-02-04-onlyfans-owner-biggest-donor-pro-israel-aipac.html permalink parent award report block reply J_Dubya_C 1 points 6 days ago That's a lot. Definitely not the largest donor but still a scumbag. permalink parent award report block reply loooooof 4 points 6 days ago Yes. And Wiles does Adelson's bidding. She's a minder. permalink parent award report block reply Ivleeeg -11 points 7 days ago Actually it's idiots obsessed with aipac that are hurting him. permalink parent award report block reply justinkayz 8 points 7 days ago The only idiots are the ones who can't read the room right now. The Left AND the Right have had enough of ZOG. permalink parent award report block reply okboomer59 -4 points 6 days ago Idiot fails to read the room. https://allthatsinteresting.com/wordpress/wp-content/uploads/2013/05/august-landmesser-no-salute.jpg permalink parent award report block reply view 1 more comments... HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\ntaxesaretheft 19 points 7 days ago Trump is owned by these people! permalink parent award report block reply\nJ_Dubya_C 7 points 7 days ago Any source for the onlyfans guy donating to aipac? Only thing I can find is an article from rollingstones which doesn't specify the amount and hasn't been corroborated by anyone else permalink parent award report block reply anotherthing 5 points 7 days ago Leonid Radvinsky is the guy that currently owns the majority stake of OnlyFans. Him and his wife donated jointly to to AIPAC to the tune of $11 million. https://www.newstarget.com/2024-02-04-onlyfans-owner-biggest-donor-pro-israel-aipac.html permalink parent award report block reply J_Dubya_C 1 points 6 days ago That's a lot. Definitely not the largest donor but still a scumbag. permalink parent award report block reply\nanotherthing 5 points 7 days ago Leonid Radvinsky is the guy that currently owns the majority stake of OnlyFans. Him and his wife donated jointly to to AIPAC to the tune of $11 million. https://www.newstarget.com/2024-02-04-onlyfans-owner-biggest-donor-pro-israel-aipac.html permalink parent award report block reply J_Dubya_C 1 points 6 days ago That's a lot. Definitely not the largest donor but still a scumbag. permalink parent award report block reply\nJ_Dubya_C 1 points 6 days ago That's a lot. Definitely not the largest donor but still a scumbag. permalink parent award report block reply\nloooooof 4 points 6 days ago Yes. And Wiles does Adelson's bidding. She's a minder. permalink parent award report block reply\nIvleeeg -11 points 7 days ago Actually it's idiots obsessed with aipac that are hurting him. permalink parent award report block reply justinkayz 8 points 7 days ago The only idiots are the ones who can't read the room right now. The Left AND the Right have had enough of ZOG. permalink parent award report block reply okboomer59 -4 points 6 days ago Idiot fails to read the room. https://allthatsinteresting.com/wordpress/wp-content/uploads/2013/05/august-landmesser-no-salute.jpg permalink parent award report block reply view 1 more comments... HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\njustinkayz 8 points 7 days ago The only idiots are the ones who can't read the room right now. The Left AND the Right have had enough of ZOG. permalink parent award report block reply okboomer59 -4 points 6 days ago Idiot fails to read the room. https://allthatsinteresting.com/wordpress/wp-content/uploads/2013/05/august-landmesser-no-salute.jpg permalink parent award report block reply view 1 more comments...\nokboomer59 -4 points 6 days ago Idiot fails to read the room. https://allthatsinteresting.com/wordpress/wp-content/uploads/2013/05/august-landmesser-no-salute.jpg permalink parent award report block reply view 1 more comments...\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nWallllllllllllllllll 52 points 7 days ago Fuck Israel. permalink award report block reply MAGARondonmonson -25 points 7 days ago Satan getting the 1930s Germany types lined up again. permalink parent award report block reply BadBrainsBuzzcocks 22 points 7 days ago No. I'm just tired of having supported them for the last 30 years, as a conservative and a Zionist. The unwaivering support is not reciprocal. That's the fucking issue. They support communists and have forever. I'm done. permalink parent award report block reply MAGARondonmonson -6 points 7 days ago That is because you have fallen for the Liberal Medias FAV. PLAY, to Divide & Conquer. Remember how they tried to divide Trump and Banon in term 1 and they do this with all Republicans, that is exactly what you are falling for with these BS rumors they spread about how Bibi lies to Trump, Bibi acts this way or this way and Trump scold Bibi behind the scenes etc. etc. Why do you dal fir the medias BS lines over and over? Bibi is pro Israel, and if that means lying to take out Iran GOOD, not that that is true, but who cares if it is, Obama got his nuclear program off the ground, so however Bibi and Israel gets it taken out is OK by me and we need to all SHUT UP about Israel and Bibi meddling, Obama and our damned whole media has meddled in every election they have trying to get a liberal elected. Bibi and Israel could have wiped out their nuke program in its infancy but were always told to not go after their nuke program 2.) No matter what any of the anti Israel guys say, they are in error, God is going to protect Israel, and the USA will be wiped out by the Rev. 8 Asteroid, after the Rapture of course. Trumps 1-4 are all ONE EVENT it describes an Asteroid Impact. And the 1/3 is a destination point, meaning the NEW WORLD & The Pacific Ocean which covers 1/3 of the earths surface. 3.) As per individual Jews, they are like the rest of us, most humans do not now God, the Jewish peoples have been blinded as a Nation for nigh 2000 years, but will soon be allowed to see again, after the fulness of the Gentiles [SERVICE) comes in, meaning the Church's mission is over, and we got to be with Jesus. permalink parent award report block reply LirukDatan -6 points 7 days ago Do you think the New York Jews somehow represent Israel? Israel supports USA. NY Jews, who are mostly orthodox, don't even support Israel... Especially now since Israel is trying to make Orthodox Jews serve in the army, chip in instead of being taxpayer money leeches. permalink parent award report block reply Maskurbator 6 points 7 days ago Israel doesn't support USA. Like saying a mosquito supports a horse. It only takes from us. It doesn't contribute. And it only wants us alive so it can keep mooching and sapping our resources..if Israel ceased to exist tomorrow, our legislators would actually start doing normal things like passing laws that make sense. permalink parent award report block reply view 8 more comments... ShadowInv 13 points 7 days ago Jews are a small minority in the usa and they have all the wealth. Central banks, real estate, hollywood, media, tech companies, politicians. They hate white people. They put indians in charge of their tech companies once they cash out. Then cry more. They have ruined all the white countries. If white people get together somewhere its the jews that will complain to stop it. Why? permalink parent award report block reply MAGARondonmonson -5 points 7 days ago So? They feel they have to stick together because Satan time after time has tried to kill them off. The fact is God has promised them they will rule with Jesus as humans for the 1000 year reign. We will be in Glorious bodies, most will not even be assigned to earth, Rev. 20:4 makes that clear ONLY those were were murdered by the Beast for refusing the Mark of the Beast will live and reign with Jesus [on this earth] for the 1000 years. Why worry about the Jewish peoples lack of understandings when God told us He was going to forsake them (God rent the temple or left and forsook Israel) until our time as the Gentile Church was over with, then He would once again call them unto repentance. It doesn't matter what you or I think, it only matters what God has already determined in His heart. permalink parent award report block reply FBIsurveillance 6 points 7 days ago Bibi is literally modern hitler permalink parent award report block reply Ivleeeg -3 points 7 days ago Yeah he's killing all the jews... Oh wait... That's right, it was Palestine that researched the success of Hitler and created hamas. Oops. permalink parent award report block reply MAGARondonmonson -4 points 7 days ago Yup, he's killing Jews, that is NONSENSICAL. The Arabs and Muslims are the evil doers. permalink parent award report block reply Maskurbator 4 points 7 days ago Arab isn't a religion. There are Arab Christians. Wtf? permalink parent award report block reply view 1 more comments... Maskurbator 3 points 7 days ago Oh fuck off you cunt. permalink parent award report block reply MAGARondonmonson 0 points 6 days ago Vulgar little man hey? Talk to a preacher of 40 years with that mouth, shame on you son. permalink parent award report block reply Maskurbator 1 points 6 days ago You preach bullshit. permalink parent award report block reply view 1 more comments... load 4 more comments...\nMAGARondonmonson -25 points 7 days ago Satan getting the 1930s Germany types lined up again. permalink parent award report block reply BadBrainsBuzzcocks 22 points 7 days ago No. I'm just tired of having supported them for the last 30 years, as a conservative and a Zionist. The unwaivering support is not reciprocal. That's the fucking issue. They support communists and have forever. I'm done. permalink parent award report block reply MAGARondonmonson -6 points 7 days ago That is because you have fallen for the Liberal Medias FAV. PLAY, to Divide & Conquer. Remember how they tried to divide Trump and Banon in term 1 and they do this with all Republicans, that is exactly what you are falling for with these BS rumors they spread about how Bibi lies to Trump, Bibi acts this way or this way and Trump scold Bibi behind the scenes etc. etc. Why do you dal fir the medias BS lines over and over? Bibi is pro Israel, and if that means lying to take out Iran GOOD, not that that is true, but who cares if it is, Obama got his nuclear program off the ground, so however Bibi and Israel gets it taken out is OK by me and we need to all SHUT UP about Israel and Bibi meddling, Obama and our damned whole media has meddled in every election they have trying to get a liberal elected. Bibi and Israel could have wiped out their nuke program in its infancy but were always told to not go after their nuke program 2.) No matter what any of the anti Israel guys say, they are in error, God is going to protect Israel, and the USA will be wiped out by the Rev. 8 Asteroid, after the Rapture of course. Trumps 1-4 are all ONE EVENT it describes an Asteroid Impact. And the 1/3 is a destination point, meaning the NEW WORLD & The Pacific Ocean which covers 1/3 of the earths surface. 3.) As per individual Jews, they are like the rest of us, most humans do not now God, the Jewish peoples have been blinded as a Nation for nigh 2000 years, but will soon be allowed to see again, after the fulness of the Gentiles [SERVICE) comes in, meaning the Church's mission is over, and we got to be with Jesus. permalink parent award report block reply LirukDatan -6 points 7 days ago Do you think the New York Jews somehow represent Israel? Israel supports USA. NY Jews, who are mostly orthodox, don't even support Israel... Especially now since Israel is trying to make Orthodox Jews serve in the army, chip in instead of being taxpayer money leeches. permalink parent award report block reply Maskurbator 6 points 7 days ago Israel doesn't support USA. Like saying a mosquito supports a horse. It only takes from us. It doesn't contribute. And it only wants us alive so it can keep mooching and sapping our resources..if Israel ceased to exist tomorrow, our legislators would actually start doing normal things like passing laws that make sense. permalink parent award report block reply view 8 more comments... ShadowInv 13 points 7 days ago Jews are a small minority in the usa and they have all the wealth. Central banks, real estate, hollywood, media, tech companies, politicians. They hate white people. They put indians in charge of their tech companies once they cash out. Then cry more. They have ruined all the white countries. If white people get together somewhere its the jews that will complain to stop it. Why? permalink parent award report block reply MAGARondonmonson -5 points 7 days ago So? They feel they have to stick together because Satan time after time has tried to kill them off. The fact is God has promised them they will rule with Jesus as humans for the 1000 year reign. We will be in Glorious bodies, most will not even be assigned to earth, Rev. 20:4 makes that clear ONLY those were were murdered by the Beast for refusing the Mark of the Beast will live and reign with Jesus [on this earth] for the 1000 years. Why worry about the Jewish peoples lack of understandings when God told us He was going to forsake them (God rent the temple or left and forsook Israel) until our time as the Gentile Church was over with, then He would once again call them unto repentance. It doesn't matter what you or I think, it only matters what God has already determined in His heart. permalink parent award report block reply FBIsurveillance 6 points 7 days ago Bibi is literally modern hitler permalink parent award report block reply Ivleeeg -3 points 7 days ago Yeah he's killing all the jews... Oh wait... That's right, it was Palestine that researched the success of Hitler and created hamas. Oops. permalink parent award report block reply MAGARondonmonson -4 points 7 days ago Yup, he's killing Jews, that is NONSENSICAL. The Arabs and Muslims are the evil doers. permalink parent award report block reply Maskurbator 4 points 7 days ago Arab isn't a religion. There are Arab Christians. Wtf? permalink parent award report block reply view 1 more comments... Maskurbator 3 points 7 days ago Oh fuck off you cunt. permalink parent award report block reply MAGARondonmonson 0 points 6 days ago Vulgar little man hey? Talk to a preacher of 40 years with that mouth, shame on you son. permalink parent award report block reply Maskurbator 1 points 6 days ago You preach bullshit. permalink parent award report block reply view 1 more comments... load 4 more comments...\nBadBrainsBuzzcocks 22 points 7 days ago No. I'm just tired of having supported them for the last 30 years, as a conservative and a Zionist. The unwaivering support is not reciprocal. That's the fucking issue. They support communists and have forever. I'm done. permalink parent award report block reply MAGARondonmonson -6 points 7 days ago That is because you have fallen for the Liberal Medias FAV. PLAY, to Divide & Conquer. Remember how they tried to divide Trump and Banon in term 1 and they do this with all Republicans, that is exactly what you are falling for with these BS rumors they spread about how Bibi lies to Trump, Bibi acts this way or this way and Trump scold Bibi behind the scenes etc. etc. Why do you dal fir the medias BS lines over and over? Bibi is pro Israel, and if that means lying to take out Iran GOOD, not that that is true, but who cares if it is, Obama got his nuclear program off the ground, so however Bibi and Israel gets it taken out is OK by me and we need to all SHUT UP about Israel and Bibi meddling, Obama and our damned whole media has meddled in every election they have trying to get a liberal elected. Bibi and Israel could have wiped out their nuke program in its infancy but were always told to not go after their nuke program 2.) No matter what any of the anti Israel guys say, they are in error, God is going to protect Israel, and the USA will be wiped out by the Rev. 8 Asteroid, after the Rapture of course. Trumps 1-4 are all ONE EVENT it describes an Asteroid Impact. And the 1/3 is a destination point, meaning the NEW WORLD & The Pacific Ocean which covers 1/3 of the earths surface. 3.) As per individual Jews, they are like the rest of us, most humans do not now God, the Jewish peoples have been blinded as a Nation for nigh 2000 years, but will soon be allowed to see again, after the fulness of the Gentiles [SERVICE) comes in, meaning the Church's mission is over, and we got to be with Jesus. permalink parent award report block reply LirukDatan -6 points 7 days ago Do you think the New York Jews somehow represent Israel? Israel supports USA. NY Jews, who are mostly orthodox, don't even support Israel... Especially now since Israel is trying to make Orthodox Jews serve in the army, chip in instead of being taxpayer money leeches. permalink parent award report block reply Maskurbator 6 points 7 days ago Israel doesn't support USA. Like saying a mosquito supports a horse. It only takes from us. It doesn't contribute. And it only wants us alive so it can keep mooching and sapping our resources..if Israel ceased to exist tomorrow, our legislators would actually start doing normal things like passing laws that make sense. permalink parent award report block reply view 8 more comments...\nMAGARondonmonson -6 points 7 days ago That is because you have fallen for the Liberal Medias FAV. PLAY, to Divide & Conquer. Remember how they tried to divide Trump and Banon in term 1 and they do this with all Republicans, that is exactly what you are falling for with these BS rumors they spread about how Bibi lies to Trump, Bibi acts this way or this way and Trump scold Bibi behind the scenes etc. etc. Why do you dal fir the medias BS lines over and over? Bibi is pro Israel, and if that means lying to take out Iran GOOD, not that that is true, but who cares if it is, Obama got his nuclear program off the ground, so however Bibi and Israel gets it taken out is OK by me and we need to all SHUT UP about Israel and Bibi meddling, Obama and our damned whole media has meddled in every election they have trying to get a liberal elected. Bibi and Israel could have wiped out their nuke program in its infancy but were always told to not go after their nuke program 2.) No matter what any of the anti Israel guys say, they are in error, God is going to protect Israel, and the USA will be wiped out by the Rev. 8 Asteroid, after the Rapture of course. Trumps 1-4 are all ONE EVENT it describes an Asteroid Impact. And the 1/3 is a destination point, meaning the NEW WORLD & The Pacific Ocean which covers 1/3 of the earths surface. 3.) As per individual Jews, they are like the rest of us, most humans do not now God, the Jewish peoples have been blinded as a Nation for nigh 2000 years, but will soon be allowed to see again, after the fulness of the Gentiles [SERVICE) comes in, meaning the Church's mission is over, and we got to be with Jesus. permalink parent award report block reply\nLirukDatan -6 points 7 days ago Do you think the New York Jews somehow represent Israel? Israel supports USA. NY Jews, who are mostly orthodox, don't even support Israel... Especially now since Israel is trying to make Orthodox Jews serve in the army, chip in instead of being taxpayer money leeches. permalink parent award report block reply Maskurbator 6 points 7 days ago Israel doesn't support USA. Like saying a mosquito supports a horse. It only takes from us. It doesn't contribute. And it only wants us alive so it can keep mooching and sapping our resources..if Israel ceased to exist tomorrow, our legislators would actually start doing normal things like passing laws that make sense. permalink parent award report block reply view 8 more comments...\nMaskurbator 6 points 7 days ago Israel doesn't support USA. Like saying a mosquito supports a horse. It only takes from us. It doesn't contribute. And it only wants us alive so it can keep mooching and sapping our resources..if Israel ceased to exist tomorrow, our legislators would actually start doing normal things like passing laws that make sense. permalink parent award report block reply view 8 more comments...\nShadowInv 13 points 7 days ago Jews are a small minority in the usa and they have all the wealth. Central banks, real estate, hollywood, media, tech companies, politicians. They hate white people. They put indians in charge of their tech companies once they cash out. Then cry more. They have ruined all the white countries. If white people get together somewhere its the jews that will complain to stop it. Why? permalink parent award report block reply MAGARondonmonson -5 points 7 days ago So? They feel they have to stick together because Satan time after time has tried to kill them off. The fact is God has promised them they will rule with Jesus as humans for the 1000 year reign. We will be in Glorious bodies, most will not even be assigned to earth, Rev. 20:4 makes that clear ONLY those were were murdered by the Beast for refusing the Mark of the Beast will live and reign with Jesus [on this earth] for the 1000 years. Why worry about the Jewish peoples lack of understandings when God told us He was going to forsake them (God rent the temple or left and forsook Israel) until our time as the Gentile Church was over with, then He would once again call them unto repentance. It doesn't matter what you or I think, it only matters what God has already determined in His heart. permalink parent award report block reply\nMAGARondonmonson -5 points 7 days ago So? They feel they have to stick together because Satan time after time has tried to kill them off. The fact is God has promised them they will rule with Jesus as humans for the 1000 year reign. We will be in Glorious bodies, most will not even be assigned to earth, Rev. 20:4 makes that clear ONLY those were were murdered by the Beast for refusing the Mark of the Beast will live and reign with Jesus [on this earth] for the 1000 years. Why worry about the Jewish peoples lack of understandings when God told us He was going to forsake them (God rent the temple or left and forsook Israel) until our time as the Gentile Church was over with, then He would once again call them unto repentance. It doesn't matter what you or I think, it only matters what God has already determined in His heart. permalink parent award report block reply\nFBIsurveillance 6 points 7 days ago Bibi is literally modern hitler permalink parent award report block reply Ivleeeg -3 points 7 days ago Yeah he's killing all the jews... Oh wait... That's right, it was Palestine that researched the success of Hitler and created hamas. Oops. permalink parent award report block reply MAGARondonmonson -4 points 7 days ago Yup, he's killing Jews, that is NONSENSICAL. The Arabs and Muslims are the evil doers. permalink parent award report block reply Maskurbator 4 points 7 days ago Arab isn't a religion. There are Arab Christians. Wtf? permalink parent award report block reply view 1 more comments...\nIvleeeg -3 points 7 days ago Yeah he's killing all the jews... Oh wait... That's right, it was Palestine that researched the success of Hitler and created hamas. Oops. permalink parent award report block reply\nMAGARondonmonson -4 points 7 days ago Yup, he's killing Jews, that is NONSENSICAL. The Arabs and Muslims are the evil doers. permalink parent award report block reply Maskurbator 4 points 7 days ago Arab isn't a religion. There are Arab Christians. Wtf? permalink parent award report block reply view 1 more comments...\nMaskurbator 4 points 7 days ago Arab isn't a religion. There are Arab Christians. Wtf? permalink parent award report block reply view 1 more comments...\nMaskurbator 3 points 7 days ago Oh fuck off you cunt. permalink parent award report block reply MAGARondonmonson 0 points 6 days ago Vulgar little man hey? Talk to a preacher of 40 years with that mouth, shame on you son. permalink parent award report block reply Maskurbator 1 points 6 days ago You preach bullshit. permalink parent award report block reply view 1 more comments...\nMAGARondonmonson 0 points 6 days ago Vulgar little man hey? Talk to a preacher of 40 years with that mouth, shame on you son. permalink parent award report block reply Maskurbator 1 points 6 days ago You preach bullshit. permalink parent award report block reply view 1 more comments...\nMaskurbator 1 points 6 days ago You preach bullshit. permalink parent award report block reply view 1 more comments...\nBadBrainsBuzzcocks 19 points 7 days ago The issue for me, as much as I prefer having a democracy and ally in Israel, the Jews in this country have fucked themselves for years voting socialist and aligning themselves with the despicable ADL. I find it extremely hard defending and supporting them. 30 years ago, working on wall street I was always mystified meeting these Jews that voted for their own demise on repeat. At this point fuck them. I'm super pissed. They learn nothing. permalink award report block reply ShadowInv 15 points 7 days ago They hate white people and want them gone. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply Maskurbator 9 points 7 days ago Jews don't vote for their own demise. They won't for whites demise and end up fucking themselves over in the process because Jews require a host society. Notice they have their own nation which they basically refuse to move to..noz it's much more lucrative to hang out in white nations and suck off the tit of the high trust societies those whites make, while also ruining them with porn and shit. permalink parent award report block reply justicein2020 9 points 7 days ago That 'ally' has flooded our country with subhumans.  That hate them. And us. It's by design. Their crazy ass religion. says the end is the world vs. israel. and god steps in and saves them. you don't believe it. i don't either. but they do. they are making it happen. anything not happening will be forced. fake it till they make it. We need to get serious about the two religions on the planet that say to wipe out everyone else... permalink parent award report block reply\nShadowInv 15 points 7 days ago They hate white people and want them gone. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nMaskurbator 9 points 7 days ago Jews don't vote for their own demise. They won't for whites demise and end up fucking themselves over in the process because Jews require a host society. Notice they have their own nation which they basically refuse to move to..noz it's much more lucrative to hang out in white nations and suck off the tit of the high trust societies those whites make, while also ruining them with porn and shit. permalink parent award report block reply\njusticein2020 9 points 7 days ago That 'ally' has flooded our country with subhumans.  That hate them. And us. It's by design. Their crazy ass religion. says the end is the world vs. israel. and god steps in and saves them. you don't believe it. i don't either. but they do. they are making it happen. anything not happening will be forced. fake it till they make it. We need to get serious about the two religions on the planet that say to wipe out everyone else... permalink parent award report block reply\nRedPillosopher1776 16 points 7 days ago They should get more unconstitutional laws passed to punish anyone who dares to say bad things about the jews or israel, I'm sure that'll do wonders for their PR problems. permalink award report block reply 1776er 8 points 7 days ago Yeah, that’s really such an obvious mistake.  I can’t stand it either.  Surely censorship will work, instead of opening a dialogue and addressing the points people make!  Dialogue is dead in America today, it got shot in the neck on a college campus permalink parent award report block reply ReleasetheList 2 points 7 days ago Probably the first order of business when the govt reopens. permalink parent award report block reply\n1776er 8 points 7 days ago Yeah, that’s really such an obvious mistake.  I can’t stand it either.  Surely censorship will work, instead of opening a dialogue and addressing the points people make!  Dialogue is dead in America today, it got shot in the neck on a college campus permalink parent award report block reply\nReleasetheList 2 points 7 days ago Probably the first order of business when the govt reopens. permalink parent award report block reply\n2016TrumpMAGA 10 points 7 days ago To every pro-immigration jew in NY: You just got what you deserve. permalink award report block reply Firepit 6 points 7 days ago They can flee to Israel. The rest of them are stuck. permalink parent award report block reply justinkayz 5 points 7 days ago They'll just go to Florida and fuck it up. permalink parent award report block reply Firepit 1 points 6 days ago They’re already there permalink parent award report block reply\nFirepit 6 points 7 days ago They can flee to Israel. The rest of them are stuck. permalink parent award report block reply justinkayz 5 points 7 days ago They'll just go to Florida and fuck it up. permalink parent award report block reply Firepit 1 points 6 days ago They’re already there permalink parent award report block reply\njustinkayz 5 points 7 days ago They'll just go to Florida and fuck it up. permalink parent award report block reply Firepit 1 points 6 days ago They’re already there permalink parent award report block reply\nFirepit 1 points 6 days ago They’re already there permalink parent award report block reply\nTheMemeSpiceMustFlow 9 points 7 days ago Who would have thought that going around telling everyone you're chosen by God, demand they give you billions of dollars to help conquer land, and if they ask any questions about the millions women and children living there you scream in their face and call them a nazi, would make people not like you. Weird how that works. permalink award report block reply\nCh3f4554551n 6 points 6 days ago They run both parties. Globally. Soros or Adelson. The Bronfmans or The WEF. Mossad or the CIA. The Bushes or the Clintons. Until a majority of us understand this, nothing will change. permalink award report block reply\nLastconservativeNY2 5 points 6 days ago The Jews (\"vote blue no matter who\") probably voted for him, but let's not forget that NYC is majority minority. Mamdami was elected by illegals/immigrants. One chart said that 70% of those that elected him were \"foreign born\"; demographics are destiny. permalink award report block reply\nkeeman 5 points 7 days ago A ton of Jews in the USA have no love for Israel.  And if you point this out then Israel will ensure that you are labeled an anti-semite.  Ben Shapiro may even stand behind his doctor wife (who is a doctor) and call you this. permalink award report block reply\nEvensoAmen 5 points 7 days ago Disagree with this. Non-MAGA candidates don’t win. Cuomo? Dude is a totalitarian,,,hello,,,COVID anyone? New York City is stupid enough to vote for Mandan but not so stupid to vote for a grandma killer. permalink award report block reply\nGreyKnight 4 points 7 days ago Doesn’t mean I want Muslims in office either…the dem voters have no independence or critical thinking and many voted for a Muslim just to spite Israel…in an American election… I hate all three. permalink award report block reply\nSaxonRealm 4 points 7 days ago Nothing alarming. Blue states voted blue. permalink award report block reply Maskurbator 2 points 7 days ago That's the take away and the left is masturbating themselves over it. You mean far left cities elected far left candidates and far left states passed far left laws?.Nooooo way! This must be the end of Drumph. That said, there are a few issues hanging around his neck weighing him and the Rs down. And Israel IS one of them. The left will claim it's Epstein. It that's the same crowd that for the past decade has been total okay with fucking kids and mutilating kids and sexualizing kids, and of course killing kids, and normalizing sex workers, so they don't actually give two shits about some sex stuff. I'm sure that's a minor component of it..like 5%.\nBut really it's: Shit is still expensive as fuck Israel, shilling, cock sucking, etc Deportations are slower than expected The pandering to Indians and their demonic holidays when white Christians are struggling Indians in general really. They managed to leap from blacks and Jews for the most loathed group in America. Even Dems don't like them. He should kick out ALL.of the visa workers..that would boost jobs numbers significantly making the.left.and right happy. permalink parent award report block reply\nMaskurbator 2 points 7 days ago That's the take away and the left is masturbating themselves over it. You mean far left cities elected far left candidates and far left states passed far left laws?.Nooooo way! This must be the end of Drumph. That said, there are a few issues hanging around his neck weighing him and the Rs down. And Israel IS one of them. The left will claim it's Epstein. It that's the same crowd that for the past decade has been total okay with fucking kids and mutilating kids and sexualizing kids, and of course killing kids, and normalizing sex workers, so they don't actually give two shits about some sex stuff. I'm sure that's a minor component of it..like 5%.\nBut really it's: Shit is still expensive as fuck Israel, shilling, cock sucking, etc Deportations are slower than expected The pandering to Indians and their demonic holidays when white Christians are struggling Indians in general really. They managed to leap from blacks and Jews for the most loathed group in America. Even Dems don't like them. He should kick out ALL.of the visa workers..that would boost jobs numbers significantly making the.left.and right happy. permalink parent award report block reply\nchahn1138 2 points 6 days ago Great post! permalink award report block reply\nRepentnow 2 points 7 days ago All good unless the Muslims are the reason. permalink award report block reply\n1LoathsomeDove 1 points 6 days ago NYC is dependent on tourism.\nEvery crime, every debauchery, every littered street & every boarded store front should be on blast. \"NYC isn't safe\" should trend every day. permalink award report block reply\nmedicpatriot 1 points 7 days ago I really don’t care that NYC elected some camel jockey. I mean, what did you expect to happen? This is the result of letting our country be browned. permalink award report block reply\nbenjovikenobi 0 points 7 days ago Second... See hispanic precincts... the youth vote... Third... the populist rebellion reaches deep w/in Democratic ranks as well, as the upstart Mamdani Move, countermove. The democrats see that populist appeal matters more than establishment credentials, so they aren't running geriatric establishment swamp monster candidates anymore. Fourth, Israel... NYC, the most Jewish city in the nation, chooses a Muslim Mayor Acting like Jews are the only people in New York, like New York is the only place in America with Jews, and like New York isn't the east coast swamp capital full of illegals, welfare queens, and \"old money\" democrats. A concrete jungle where kids can grow up never having seen a cornfield, a mountain, or a forest in their life. Butbutbut muh joooooooooos. With all due respect, has Barnes even been to New York? It's basically Atlantic Los Angeles, with worse weather. Remember when the democrats tried to persecute Eric Adams, the previous democrat mayor, because he went off the reservation and started complaining about all the illegals being shipped north from Florida and Texas? (and then President Trump pardoned him). The illegals voted! How quickly we forget. permalink award report block reply\nDicksOutForHarambe 0 points 7 days ago Goat fuckers unite! permalink award report block reply\njonnyuno 0 points 7 days ago Very true.  However,  blue cities and states voted radically blue.  Where is the issue here? Let these places collapse,  zero funding, and we focus on our stares to keep and win. permalink award report block reply\nNoraScholar -1 points 7 days ago That's a tragedy.  The discourse has gone from mere criticism of Israel's policies to flat-out Nazi-style anti-semitism. That being said, considering how much Jews here support the Demonshit party, they are their own worst enemy. permalink award report block reply medicpatriot 6 points 7 days ago Antisemitism wouldn’t exist if the Jews could improve their behavior. permalink parent award report block reply\nmedicpatriot 6 points 7 days ago Antisemitism wouldn’t exist if the Jews could improve their behavior. permalink parent award report block reply\nAgnesDomini -1 points 7 days ago What an idiot. Bibi has diplomatic immunity,  and cannot be arrested by that little prick... permalink award report block reply pollsarefake -1 points 7 days ago Exactly We didn’t lose It was STOLEN just like 2020 Only dead people voted for Mamdani permalink parent award report block reply JamesBlomey 0 points 7 days ago Also  the braindead. permalink parent award report block reply\npollsarefake -1 points 7 days ago Exactly We didn’t lose It was STOLEN just like 2020 Only dead people voted for Mamdani permalink parent award report block reply JamesBlomey 0 points 7 days ago Also  the braindead. permalink parent award report block reply\nJamesBlomey 0 points 7 days ago Also  the braindead. permalink parent award report block reply\nCanadiapede7 -1 points 6 days ago Lmfao, except that it was clearly foreign born who got Muslim boy elected, you people are retarded. permalink award report block reply\njiujiujiu -2 points 7 days ago Jews on the chopping block once again. Christians will follow soon after. permalink award report block reply\nLurkmoore -2 points 7 days ago Prophecy in progress. The times of the gentiles are ending. permalink award report block reply\nKungPaoMcChicken -3 points 7 days ago New York doesn't matter, I want Trump resort in Gaza. permalink award report block reply\nmty_green_go -9 points 7 days ago The juice didnt choose the muslim you fucking retard it's all the fags and minimum wage workers permalink award report block reply staroframphansbhole 28 points 7 days ago There was literally an ad called trans rabbis for mamdani and 1/5 of NYC's population is jew so they did choose him buddy permalink parent award report block reply mty_green_go -7 points 7 days ago That's called a meme buddy We produce shit that doesn't make sense here every single day.  Just because there is an ad fabricated doesn't mean it was approved by all of the population.  Ref: Douglas Mackey permalink parent award report block reply JamesBlomey 1 points 7 days ago Hol'up, it's the stuff that doesn't make sense that makes sense. permalink parent award report block reply giggitybooped 10 points 7 days ago I don't agree with it at all but in today's current economy I understand why people are pissed off at the system. The rich have only gotten substantially richer while the mom and pop shops and the little guy have lost their livelihoods. Biden damage was and still is significant permalink parent award report block reply Repentnow -1 points 7 days ago Maybe. Or maybe mom and pop shops are irrelevant in an online world and no one is to blame. Gasp, sacrilege. permalink parent award report block reply anotherthing 6 points 7 days ago Regulation was killing them before that. The EPA is what killed off the mom and pop gas stations. Now they're either corporate owned or owned by refugees with government credits. Things like crazy minimum wages in blue areas kill off independent fast food places. MacDonald's can weather things like that, and replace those workers with kiosks and automation, mom and pop fast food places can't do that, so they just fold. permalink parent award report block reply\nstaroframphansbhole 28 points 7 days ago There was literally an ad called trans rabbis for mamdani and 1/5 of NYC's population is jew so they did choose him buddy permalink parent award report block reply mty_green_go -7 points 7 days ago That's called a meme buddy We produce shit that doesn't make sense here every single day.  Just because there is an ad fabricated doesn't mean it was approved by all of the population.  Ref: Douglas Mackey permalink parent award report block reply JamesBlomey 1 points 7 days ago Hol'up, it's the stuff that doesn't make sense that makes sense. permalink parent award report block reply\nmty_green_go -7 points 7 days ago That's called a meme buddy We produce shit that doesn't make sense here every single day.  Just because there is an ad fabricated doesn't mean it was approved by all of the population.  Ref: Douglas Mackey permalink parent award report block reply JamesBlomey 1 points 7 days ago Hol'up, it's the stuff that doesn't make sense that makes sense. permalink parent award report block reply\nJamesBlomey 1 points 7 days ago Hol'up, it's the stuff that doesn't make sense that makes sense. permalink parent award report block reply\ngiggitybooped 10 points 7 days ago I don't agree with it at all but in today's current economy I understand why people are pissed off at the system. The rich have only gotten substantially richer while the mom and pop shops and the little guy have lost their livelihoods. Biden damage was and still is significant permalink parent award report block reply Repentnow -1 points 7 days ago Maybe. Or maybe mom and pop shops are irrelevant in an online world and no one is to blame. Gasp, sacrilege. permalink parent award report block reply anotherthing 6 points 7 days ago Regulation was killing them before that. The EPA is what killed off the mom and pop gas stations. Now they're either corporate owned or owned by refugees with government credits. Things like crazy minimum wages in blue areas kill off independent fast food places. MacDonald's can weather things like that, and replace those workers with kiosks and automation, mom and pop fast food places can't do that, so they just fold. permalink parent award report block reply\nRepentnow -1 points 7 days ago Maybe. Or maybe mom and pop shops are irrelevant in an online world and no one is to blame. Gasp, sacrilege. permalink parent award report block reply anotherthing 6 points 7 days ago Regulation was killing them before that. The EPA is what killed off the mom and pop gas stations. Now they're either corporate owned or owned by refugees with government credits. Things like crazy minimum wages in blue areas kill off independent fast food places. MacDonald's can weather things like that, and replace those workers with kiosks and automation, mom and pop fast food places can't do that, so they just fold. permalink parent award report block reply\nanotherthing 6 points 7 days ago Regulation was killing them before that. The EPA is what killed off the mom and pop gas stations. Now they're either corporate owned or owned by refugees with government credits. Things like crazy minimum wages in blue areas kill off independent fast food places. MacDonald's can weather things like that, and replace those workers with kiosks and automation, mom and pop fast food places can't do that, so they just fold. permalink parent award report block reply\nTrumpYouMagaFrenner -16 points 7 days ago Oh stfu. This jackass doesnt know shit. New York always has been and will be blue. Nothing to do with Israel. permalink award report block reply\nhenri_derelicte -21 points 7 days ago For all intents and purposes, Trump ended the Gaza war resulting in an Israeli victory. Not as outright of an Israeli victory as some would have liked, but Israel won the war hands down. Leftist groups have been trying to diplomatically isolate Israel for years trying to force this “two state solution” on them despite the fact it will be detrimental to their security interests in the long run. It’s the same playbook they used with South Africa during apartheid. They knew that apartheid-eta South Africa could be a right-leaning country and Israel today can be the same if they continue to have their way with the Palestinians. A big reason the issue is becoming more prominent is the mass importation of Muslims post 9/11, and I’m disappointed the administration has yet to announce any plans to deport them, regardless of legal/citizenship status. permalink award report block reply staroframphansbhole 7 points 7 days ago Israel shouldn't exist and one day it won't, either by man's hand or God's. Enjoy! permalink parent award report block reply henri_derelicte -1 points 7 days ago If given the choice between Israel’s continued existence or returning the land to Muslim control, then I will gladly side with Israel. Not that I agree with everything Israel has done or is doing, but because the Muslims are a far greater threat to everything I care about and hold dear. permalink parent award report block reply Repentnow 6 points 7 days ago I think if you dig a little deeper, you'll find that the differences are less and less. permalink parent award report block reply staroframphansbhole 1 points 6 days ago Better idea, Israel becomes Christian since it really belongs to us anyway permalink parent award report block reply henri_derelicte -1 points 6 days ago The Middle East needs a Christian state, but that land should come at the expense of Muslims. Israel can keep what they have permalink parent award report block reply view 1 more comments... ParmesanCartel 5 points 7 days ago I knew you were retarded by the 9th word permalink parent award report block reply mty_green_go 0 points 7 days ago how could a war with Gaza end up with a loss by any country except south sudan ? of course it was an Israeli \"victory\" permalink parent award report block reply\nstaroframphansbhole 7 points 7 days ago Israel shouldn't exist and one day it won't, either by man's hand or God's. Enjoy! permalink parent award report block reply henri_derelicte -1 points 7 days ago If given the choice between Israel’s continued existence or returning the land to Muslim control, then I will gladly side with Israel. Not that I agree with everything Israel has done or is doing, but because the Muslims are a far greater threat to everything I care about and hold dear. permalink parent award report block reply Repentnow 6 points 7 days ago I think if you dig a little deeper, you'll find that the differences are less and less. permalink parent award report block reply staroframphansbhole 1 points 6 days ago Better idea, Israel becomes Christian since it really belongs to us anyway permalink parent award report block reply henri_derelicte -1 points 6 days ago The Middle East needs a Christian state, but that land should come at the expense of Muslims. Israel can keep what they have permalink parent award report block reply view 1 more comments...\nhenri_derelicte -1 points 7 days ago If given the choice between Israel’s continued existence or returning the land to Muslim control, then I will gladly side with Israel. Not that I agree with everything Israel has done or is doing, but because the Muslims are a far greater threat to everything I care about and hold dear. permalink parent award report block reply Repentnow 6 points 7 days ago I think if you dig a little deeper, you'll find that the differences are less and less. permalink parent award report block reply staroframphansbhole 1 points 6 days ago Better idea, Israel becomes Christian since it really belongs to us anyway permalink parent award report block reply henri_derelicte -1 points 6 days ago The Middle East needs a Christian state, but that land should come at the expense of Muslims. Israel can keep what they have permalink parent award report block reply view 1 more comments...\nRepentnow 6 points 7 days ago I think if you dig a little deeper, you'll find that the differences are less and less. permalink parent award report block reply\nstaroframphansbhole 1 points 6 days ago Better idea, Israel becomes Christian since it really belongs to us anyway permalink parent award report block reply henri_derelicte -1 points 6 days ago The Middle East needs a Christian state, but that land should come at the expense of Muslims. Israel can keep what they have permalink parent award report block reply view 1 more comments...\nhenri_derelicte -1 points 6 days ago The Middle East needs a Christian state, but that land should come at the expense of Muslims. Israel can keep what they have permalink parent award report block reply view 1 more comments...\nParmesanCartel 5 points 7 days ago I knew you were retarded by the 9th word permalink parent award report block reply\nmty_green_go 0 points 7 days ago how could a war with Gaza end up with a loss by any country except south sudan ? of course it was an Israeli \"victory\" permalink parent award report block reply\nAgent_86 -24 points 7 days ago Well here's a big dick to suck you JDS nut job. A CNN exit-poll found that about 33% of Jewish voters supported Mamdani, while 63% backed Cuomo. permalink award report block reply sordfysh PRO 32 points 7 days ago So 99% of NYC Jews voted for communists. permalink parent award report block reply LORDFALCONE 9 points 7 days ago MANY SUCH CASES permalink parent award report block reply TrumpYouMagaFrenner 3 points 7 days ago Liberal new York voted liberal. Jewish or not. Wow shock permalink parent award report block reply Agent_86 -1 points 7 days ago Yep. But the op said they mostly voted for mamdani which wasn't the case. permalink parent award report block reply blitzkrieg1 8 points 7 days ago So all jews are idiots/ permalink parent award report block reply JamesBlomey 0 points 7 days ago Username umami detected. permalink parent award report block reply Agent_86 -4 points 7 days ago No idea what you mean dude. Elucidate. permalink parent award report block reply justinkayz 4 points 7 days ago So you're telling me that 99% of Jews are retarded? permalink parent award report block reply Agent_86 -1 points 6 days ago Have you thought about seeing a councilor? The psychological damage you seem to have suffered seems pretty bad. Trying to dehumanize an entire demographic is sickening to me. It literally turns my stomach to think people like you walk this earth. NO 99% of Jews are not retarded. People vote their conscious and for what they believe in. They have the right to do so given to them by God. It isn't how you want them to vote TFB. I don't agree with their voting choice but ultimately its none of my business. Your attitude is disgusting to me. Good bye. permalink parent award report block reply TrumpYouMagaFrenner -5 points 7 days ago They downvote the truth lol permalink parent award report block reply Agent_86 -4 points 7 days ago every time. permalink parent award report block reply dankai420 -12 points 7 days ago The majority of Jews is conservative but the minority that supports the far-left are literally suicidal. permalink parent award report block reply cereal_killer 22 points 7 days ago What the fuck are you talking about? Jews in America are overwhelmingly liberal. The only time in the last century that Jews didn't vote majority Democrat is when they voted for a socialist running for president in 1920 . permalink parent award report block reply imnotdeadyet 16 points 7 days ago There are 2.1 Million Jews in NYC.  The most of any city outside Israel.  If they voted against Mamdani, he wouldn't have won.  They lied to CNN. permalink parent award report block reply Repentnow 0 points 7 days ago 730,000 adult Jews in the five boroughs. https://www.ujafedny.org/news/uja-federation-of-new-yorks-2023-jewish-community-study-of-new-york?utm_source=chatgpt.com permalink parent award report block reply imnotdeadyet 6 points 7 days ago Funny how these AI engines give different answers.  I just asked again and got this \"As of 2020, over 960,000 Jews lived in the five boroughs of New York City, and over 1.9 million Jews lived in the New York metropolitan area, approximately 25% of the American Jewish population. Nearly half of the city's Jews live in Brooklyn.\" permalink parent award report block reply view 1 more comments... Nerdrem3 12 points 7 days ago No, the majority of orthodox jews are conservative, the majority of jews are not orthodox. There are more orthodox jews in NYC than probably any other place in the US which skews the numbers. permalink parent award report block reply DrCowboyPresident 8 points 7 days ago And even the orthodox have a deep seated fear and hatred of any nationalism that isn't theirs. That's the prime issue. And the non-orthodox hate all nationalism whatsoever. permalink parent award report block reply staroframphansbhole 10 points 7 days ago The majority of Jews is conservative This is probably one of the most misinformed things I've ever read on this site permalink parent award report block reply Aggrieved03 9 points 7 days ago Where’d you get that bs stat? 85% of them are Democrats. permalink parent award report block reply load 2 more comments...\nsordfysh PRO 32 points 7 days ago So 99% of NYC Jews voted for communists. permalink parent award report block reply LORDFALCONE 9 points 7 days ago MANY SUCH CASES permalink parent award report block reply TrumpYouMagaFrenner 3 points 7 days ago Liberal new York voted liberal. Jewish or not. Wow shock permalink parent award report block reply Agent_86 -1 points 7 days ago Yep. But the op said they mostly voted for mamdani which wasn't the case. permalink parent award report block reply\nLORDFALCONE 9 points 7 days ago MANY SUCH CASES permalink parent award report block reply\nTrumpYouMagaFrenner 3 points 7 days ago Liberal new York voted liberal. Jewish or not. Wow shock permalink parent award report block reply\nAgent_86 -1 points 7 days ago Yep. But the op said they mostly voted for mamdani which wasn't the case. permalink parent award report block reply\nblitzkrieg1 8 points 7 days ago So all jews are idiots/ permalink parent award report block reply JamesBlomey 0 points 7 days ago Username umami detected. permalink parent award report block reply Agent_86 -4 points 7 days ago No idea what you mean dude. Elucidate. permalink parent award report block reply\nJamesBlomey 0 points 7 days ago Username umami detected. permalink parent award report block reply\nAgent_86 -4 points 7 days ago No idea what you mean dude. Elucidate. permalink parent award report block reply\njustinkayz 4 points 7 days ago So you're telling me that 99% of Jews are retarded? permalink parent award report block reply Agent_86 -1 points 6 days ago Have you thought about seeing a councilor? The psychological damage you seem to have suffered seems pretty bad. Trying to dehumanize an entire demographic is sickening to me. It literally turns my stomach to think people like you walk this earth. NO 99% of Jews are not retarded. People vote their conscious and for what they believe in. They have the right to do so given to them by God. It isn't how you want them to vote TFB. I don't agree with their voting choice but ultimately its none of my business. Your attitude is disgusting to me. Good bye. permalink parent award report block reply\nAgent_86 -1 points 6 days ago Have you thought about seeing a councilor? The psychological damage you seem to have suffered seems pretty bad. Trying to dehumanize an entire demographic is sickening to me. It literally turns my stomach to think people like you walk this earth. NO 99% of Jews are not retarded. People vote their conscious and for what they believe in. They have the right to do so given to them by God. It isn't how you want them to vote TFB. I don't agree with their voting choice but ultimately its none of my business. Your attitude is disgusting to me. Good bye. permalink parent award report block reply\nTrumpYouMagaFrenner -5 points 7 days ago They downvote the truth lol permalink parent award report block reply Agent_86 -4 points 7 days ago every time. permalink parent award report block reply\nAgent_86 -4 points 7 days ago every time. permalink parent award report block reply\ndankai420 -12 points 7 days ago The majority of Jews is conservative but the minority that supports the far-left are literally suicidal. permalink parent award report block reply cereal_killer 22 points 7 days ago What the fuck are you talking about? Jews in America are overwhelmingly liberal. The only time in the last century that Jews didn't vote majority Democrat is when they voted for a socialist running for president in 1920 . permalink parent award report block reply imnotdeadyet 16 points 7 days ago There are 2.1 Million Jews in NYC.  The most of any city outside Israel.  If they voted against Mamdani, he wouldn't have won.  They lied to CNN. permalink parent award report block reply Repentnow 0 points 7 days ago 730,000 adult Jews in the five boroughs. https://www.ujafedny.org/news/uja-federation-of-new-yorks-2023-jewish-community-study-of-new-york?utm_source=chatgpt.com permalink parent award report block reply imnotdeadyet 6 points 7 days ago Funny how these AI engines give different answers.  I just asked again and got this \"As of 2020, over 960,000 Jews lived in the five boroughs of New York City, and over 1.9 million Jews lived in the New York metropolitan area, approximately 25% of the American Jewish population. Nearly half of the city's Jews live in Brooklyn.\" permalink parent award report block reply view 1 more comments... Nerdrem3 12 points 7 days ago No, the majority of orthodox jews are conservative, the majority of jews are not orthodox. There are more orthodox jews in NYC than probably any other place in the US which skews the numbers. permalink parent award report block reply DrCowboyPresident 8 points 7 days ago And even the orthodox have a deep seated fear and hatred of any nationalism that isn't theirs. That's the prime issue. And the non-orthodox hate all nationalism whatsoever. permalink parent award report block reply staroframphansbhole 10 points 7 days ago The majority of Jews is conservative This is probably one of the most misinformed things I've ever read on this site permalink parent award report block reply Aggrieved03 9 points 7 days ago Where’d you get that bs stat? 85% of them are Democrats. permalink parent award report block reply load 2 more comments...\ncereal_killer 22 points 7 days ago What the fuck are you talking about? Jews in America are overwhelmingly liberal. The only time in the last century that Jews didn't vote majority Democrat is when they voted for a socialist running for president in 1920 . permalink parent award report block reply\nimnotdeadyet 16 points 7 days ago There are 2.1 Million Jews in NYC.  The most of any city outside Israel.  If they voted against Mamdani, he wouldn't have won.  They lied to CNN. permalink parent award report block reply Repentnow 0 points 7 days ago 730,000 adult Jews in the five boroughs. https://www.ujafedny.org/news/uja-federation-of-new-yorks-2023-jewish-community-study-of-new-york?utm_source=chatgpt.com permalink parent award report block reply imnotdeadyet 6 points 7 days ago Funny how these AI engines give different answers.  I just asked again and got this \"As of 2020, over 960,000 Jews lived in the five boroughs of New York City, and over 1.9 million Jews lived in the New York metropolitan area, approximately 25% of the American Jewish population. Nearly half of the city's Jews live in Brooklyn.\" permalink parent award report block reply view 1 more comments...\nRepentnow 0 points 7 days ago 730,000 adult Jews in the five boroughs. https://www.ujafedny.org/news/uja-federation-of-new-yorks-2023-jewish-community-study-of-new-york?utm_source=chatgpt.com permalink parent award report block reply imnotdeadyet 6 points 7 days ago Funny how these AI engines give different answers.  I just asked again and got this \"As of 2020, over 960,000 Jews lived in the five boroughs of New York City, and over 1.9 million Jews lived in the New York metropolitan area, approximately 25% of the American Jewish population. Nearly half of the city's Jews live in Brooklyn.\" permalink parent award report block reply view 1 more comments...\nimnotdeadyet 6 points 7 days ago Funny how these AI engines give different answers.  I just asked again and got this \"As of 2020, over 960,000 Jews lived in the five boroughs of New York City, and over 1.9 million Jews lived in the New York metropolitan area, approximately 25% of the American Jewish population. Nearly half of the city's Jews live in Brooklyn.\" permalink parent award report block reply view 1 more comments...\nNerdrem3 12 points 7 days ago No, the majority of orthodox jews are conservative, the majority of jews are not orthodox. There are more orthodox jews in NYC than probably any other place in the US which skews the numbers. permalink parent award report block reply DrCowboyPresident 8 points 7 days ago And even the orthodox have a deep seated fear and hatred of any nationalism that isn't theirs. That's the prime issue. And the non-orthodox hate all nationalism whatsoever. permalink parent award report block reply\nDrCowboyPresident 8 points 7 days ago And even the orthodox have a deep seated fear and hatred of any nationalism that isn't theirs. That's the prime issue. And the non-orthodox hate all nationalism whatsoever. permalink parent award report block reply\nstaroframphansbhole 10 points 7 days ago The majority of Jews is conservative This is probably one of the most misinformed things I've ever read on this site permalink parent award report block reply\nAggrieved03 9 points 7 days ago Where’d you get that bs stat? 85% of them are Democrats. permalink parent award report block reply\ntingo999 -26 points 7 days ago You stupid fuck they are working to destroy Israel just like they are trying to destroy the USA. They are trying to lock up Netanyahu just like Trump. The flooded Israel with Arabs and Africans just like the USA. You're ignorant twat. permalink award report block reply mty_green_go 8 points 7 days ago at least Israel is unapologetic about sterilizing them when they come in , lol permalink parent award report block reply\nmty_green_go 8 points 7 days ago at least Israel is unapologetic about sterilizing them when they come in , lol permalink parent award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:19:46.657804Z"
}