{
  "id": "1ARK57t3tx",
  "url": "https://patriots.win/p/1ARK57t3tx/enjoy-ny-/c",
  "content": "648 Enjoy NY posted 4 days ago by wst4 25 comments award share download report block\n25 comments Sort by Top Top New Worst Old Save Porkchop-express 11 points 4 days ago Chavez didn’t do it right. You guys have to believe me. It will work this time. Once I take all of your money and place it in an off shore account I’ll keep it safe and come back for you suckers later permalink award report block reply PatriotSkorzeny 10 points 4 days ago Inventory the Bronx zoo now!! permalink award report block reply gorilla_grip 3 points 4 days ago Right after Fort Knox!!! permalink parent award report block reply Creepy_Joe 5 points 4 days ago I've never seen anyone make a raft out of garbage in hopes of floating to a socialist paradise. permalink award report block reply JwPATX 3 points 4 days ago They’d have to know that in the first place for us to remind them of it. permalink award report block reply Nomad899 2 points 4 days ago They will reply “ummmmm zoo animals will be freeeeeeee” permalink award report block reply yurimodin 1 points 4 days ago I thought these commies were all vegans...... permalink parent award report block reply Nomad899 2 points 4 days ago Only when food is available and people are looking permalink parent award report block reply billybaldwin2 2 points 4 days ago Zoo animals won't last. First thing any country has to do is food. Grow it, trade for it, whatever you gotta do, but soon, you need to be producing your own food. Let me ask AI how they're doing: \"Venezuelan agriculture has significantly declined over the years, contributing only about 3% to the country's GDP and employing around 10% of the labor force. The sector faces challenges such as government intervention, food shortages, and reliance on food imports, primarily from Colombia and the United States.\" Wait, the USA is trading them food? permalink award report block reply JoeBidensDementia1 2 points 4 days ago The Muslims will also start fucking goats on the street corners. permalink award report block reply DudeNoOne 1 points 4 days ago I think they can learn this lesson the hard way permalink award report block reply Smurfection 1 points 4 days ago 1992 - Aside from the U.S., Venezuela had the highest GDP (by the old calculation) than any country south of the border and higher than Canada. Then they voted in the socialist Hugo Chavez. They they started making deals with China for rice.\nThen the government outlawed guns.\nThen the government enacted universal health care.\nThen the government kicked U.S. oil companies out.\nThen the pumps on their oil wells started failing and no one knew how to get them to work.\nThen the rice deal didn't deliver any rice.\nThen the people had no food, no medicine and no doctors and no nurses, except those who were dumb enough to stay to try and help people while being robbed and having their equipment stolen.\nThen they started eating pets.\nThen they started eating zoo animals.\nThen they started eating rodents. The commies in charge are still fat though. permalink award report block reply whataboob 1 points 4 days ago I’m no defender of socialism, but did that happen because of socialism or because of US sanctions against Venezuela? … permalink award report block reply Cubey 1 points 3 days ago So in order to be a successful socialist country they need to rely on trade with the USA? permalink parent award report block reply whataboob 1 points 3 days ago Haha Ever wonder why we don’t sanction China, the biggest communist state on earth? …. Ever wonder why we expect Russia to be cutoff from the entire planet due to our sanctions? … US sanctions aren’t some US trade embargo by the United States of America, or a just a simple refusal to trade with a country, as you seem to be implying. US sanctions are a threat to the entire planet, to any country who is still scared of this pathetic dying faggot US warmonger empire (and the list is quickly shrinking), that they will face US punishment of various kinds if they do business with a sanctioned country. If that’s new to you, it’s understandable.  They don’t advertise it that way, as being a faggot scum empire bullying the world to crush countries we disagree with.   “We’re the good guys” doing it for democracy, or some other trash reason that’s supposed to make me okay with them crushing countries in my name for their crony capitalist goals. And it should also help color why they’re so hellbent about their gayass Russia sanctions lol cuz it ain’t working because too many countries think we’re a dying weak pathetic desperate empire and continue to do business with Russia. Wahhh Trump is upset lol just like Biden. (Unless it’s 5D chess and he has to act like a Bidenesque faggot for the Lindsey Grahams of the world who have a knife to his back? … ¯\\_(ツ)_/¯ ) Meanwhile, they suck CCP China’s dick daily.  I mean, I’m not against doing business with China, but they sold most of our country’s production to the biggest communist state on earth, meanwhile they pretend they have a problem with socialism? They’re lying pathetic faggots, and they’re just trying to rob Venezuela cuz they failed miserably to rob Russia.  And it’s not clear they’ll succeed even in Venezuela, cuz today’s faggot scum just isn’t as competent  as their predecessor ancestor scum. permalink parent award report block reply Megaboom2025 1 points 4 days ago I am legend takes place in New York City only permalink award report block reply Toohershat 1 points 4 days ago It's a simple death sentence for a nation, but the NY thing is a different type of animal. Same socialist scam, but here it's a major city in a non-socialist country. What I'm saying is that it will fuck up NYC, but those of us Americans outside of that city will be put under pressure to bail them out. The media will come to their aid, saying Trump did this, MAGA did that, etc. They won't be eating zoo animals anytime soon, trust me. permalink award report block reply Tobin 1 points 4 days ago Is that what the Venezuelan temporary resident people were fleeing?  If so maybe we should look into giving them some respite if they did it the legal way permalink award report block reply TheArchAngel 1 points 4 days ago some lessons you have to learn the hard way. permalink award report block reply GuerillaYourDreams 1 points 4 days ago The New Bronx Zoo Buffet!! permalink award report block reply DontApologize 1 points 4 days ago Chavez ate fine. All those New Yorkers think they will be the elite when US goes Communist. permalink award report block reply mikethemarine 1 points 4 days ago They expect the rest of the country to support them while they go threw their transition permalink award report block reply ACActual 1 points 4 days ago Doesn't matter now.   NY is not America anymore.   Its occupied by 3rd World foreigners who know nothing about governance.  They just want free stuff.  Its time to cut cities off from all Federal funding.  Let them eat cake permalink award report block reply Krat 0 points 4 days ago They wont though, theyll siphon other states money first permalink award report block reply TheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply HoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nPorkchop-express 11 points 4 days ago Chavez didn’t do it right. You guys have to believe me. It will work this time. Once I take all of your money and place it in an off shore account I’ll keep it safe and come back for you suckers later permalink award report block reply\nPatriotSkorzeny 10 points 4 days ago Inventory the Bronx zoo now!! permalink award report block reply gorilla_grip 3 points 4 days ago Right after Fort Knox!!! permalink parent award report block reply\ngorilla_grip 3 points 4 days ago Right after Fort Knox!!! permalink parent award report block reply\nCreepy_Joe 5 points 4 days ago I've never seen anyone make a raft out of garbage in hopes of floating to a socialist paradise. permalink award report block reply\nJwPATX 3 points 4 days ago They’d have to know that in the first place for us to remind them of it. permalink award report block reply\nNomad899 2 points 4 days ago They will reply “ummmmm zoo animals will be freeeeeeee” permalink award report block reply yurimodin 1 points 4 days ago I thought these commies were all vegans...... permalink parent award report block reply Nomad899 2 points 4 days ago Only when food is available and people are looking permalink parent award report block reply\nyurimodin 1 points 4 days ago I thought these commies were all vegans...... permalink parent award report block reply Nomad899 2 points 4 days ago Only when food is available and people are looking permalink parent award report block reply\nNomad899 2 points 4 days ago Only when food is available and people are looking permalink parent award report block reply\nbillybaldwin2 2 points 4 days ago Zoo animals won't last. First thing any country has to do is food. Grow it, trade for it, whatever you gotta do, but soon, you need to be producing your own food. Let me ask AI how they're doing: \"Venezuelan agriculture has significantly declined over the years, contributing only about 3% to the country's GDP and employing around 10% of the labor force. The sector faces challenges such as government intervention, food shortages, and reliance on food imports, primarily from Colombia and the United States.\" Wait, the USA is trading them food? permalink award report block reply\nJoeBidensDementia1 2 points 4 days ago The Muslims will also start fucking goats on the street corners. permalink award report block reply\nDudeNoOne 1 points 4 days ago I think they can learn this lesson the hard way permalink award report block reply\nSmurfection 1 points 4 days ago 1992 - Aside from the U.S., Venezuela had the highest GDP (by the old calculation) than any country south of the border and higher than Canada. Then they voted in the socialist Hugo Chavez. They they started making deals with China for rice.\nThen the government outlawed guns.\nThen the government enacted universal health care.\nThen the government kicked U.S. oil companies out.\nThen the pumps on their oil wells started failing and no one knew how to get them to work.\nThen the rice deal didn't deliver any rice.\nThen the people had no food, no medicine and no doctors and no nurses, except those who were dumb enough to stay to try and help people while being robbed and having their equipment stolen.\nThen they started eating pets.\nThen they started eating zoo animals.\nThen they started eating rodents. The commies in charge are still fat though. permalink award report block reply\nwhataboob 1 points 4 days ago I’m no defender of socialism, but did that happen because of socialism or because of US sanctions against Venezuela? … permalink award report block reply Cubey 1 points 3 days ago So in order to be a successful socialist country they need to rely on trade with the USA? permalink parent award report block reply whataboob 1 points 3 days ago Haha Ever wonder why we don’t sanction China, the biggest communist state on earth? …. Ever wonder why we expect Russia to be cutoff from the entire planet due to our sanctions? … US sanctions aren’t some US trade embargo by the United States of America, or a just a simple refusal to trade with a country, as you seem to be implying. US sanctions are a threat to the entire planet, to any country who is still scared of this pathetic dying faggot US warmonger empire (and the list is quickly shrinking), that they will face US punishment of various kinds if they do business with a sanctioned country. If that’s new to you, it’s understandable.  They don’t advertise it that way, as being a faggot scum empire bullying the world to crush countries we disagree with.   “We’re the good guys” doing it for democracy, or some other trash reason that’s supposed to make me okay with them crushing countries in my name for their crony capitalist goals. And it should also help color why they’re so hellbent about their gayass Russia sanctions lol cuz it ain’t working because too many countries think we’re a dying weak pathetic desperate empire and continue to do business with Russia. Wahhh Trump is upset lol just like Biden. (Unless it’s 5D chess and he has to act like a Bidenesque faggot for the Lindsey Grahams of the world who have a knife to his back? … ¯\\_(ツ)_/¯ ) Meanwhile, they suck CCP China’s dick daily.  I mean, I’m not against doing business with China, but they sold most of our country’s production to the biggest communist state on earth, meanwhile they pretend they have a problem with socialism? They’re lying pathetic faggots, and they’re just trying to rob Venezuela cuz they failed miserably to rob Russia.  And it’s not clear they’ll succeed even in Venezuela, cuz today’s faggot scum just isn’t as competent  as their predecessor ancestor scum. permalink parent award report block reply\nCubey 1 points 3 days ago So in order to be a successful socialist country they need to rely on trade with the USA? permalink parent award report block reply whataboob 1 points 3 days ago Haha Ever wonder why we don’t sanction China, the biggest communist state on earth? …. Ever wonder why we expect Russia to be cutoff from the entire planet due to our sanctions? … US sanctions aren’t some US trade embargo by the United States of America, or a just a simple refusal to trade with a country, as you seem to be implying. US sanctions are a threat to the entire planet, to any country who is still scared of this pathetic dying faggot US warmonger empire (and the list is quickly shrinking), that they will face US punishment of various kinds if they do business with a sanctioned country. If that’s new to you, it’s understandable.  They don’t advertise it that way, as being a faggot scum empire bullying the world to crush countries we disagree with.   “We’re the good guys” doing it for democracy, or some other trash reason that’s supposed to make me okay with them crushing countries in my name for their crony capitalist goals. And it should also help color why they’re so hellbent about their gayass Russia sanctions lol cuz it ain’t working because too many countries think we’re a dying weak pathetic desperate empire and continue to do business with Russia. Wahhh Trump is upset lol just like Biden. (Unless it’s 5D chess and he has to act like a Bidenesque faggot for the Lindsey Grahams of the world who have a knife to his back? … ¯\\_(ツ)_/¯ ) Meanwhile, they suck CCP China’s dick daily.  I mean, I’m not against doing business with China, but they sold most of our country’s production to the biggest communist state on earth, meanwhile they pretend they have a problem with socialism? They’re lying pathetic faggots, and they’re just trying to rob Venezuela cuz they failed miserably to rob Russia.  And it’s not clear they’ll succeed even in Venezuela, cuz today’s faggot scum just isn’t as competent  as their predecessor ancestor scum. permalink parent award report block reply\nwhataboob 1 points 3 days ago Haha Ever wonder why we don’t sanction China, the biggest communist state on earth? …. Ever wonder why we expect Russia to be cutoff from the entire planet due to our sanctions? … US sanctions aren’t some US trade embargo by the United States of America, or a just a simple refusal to trade with a country, as you seem to be implying. US sanctions are a threat to the entire planet, to any country who is still scared of this pathetic dying faggot US warmonger empire (and the list is quickly shrinking), that they will face US punishment of various kinds if they do business with a sanctioned country. If that’s new to you, it’s understandable.  They don’t advertise it that way, as being a faggot scum empire bullying the world to crush countries we disagree with.   “We’re the good guys” doing it for democracy, or some other trash reason that’s supposed to make me okay with them crushing countries in my name for their crony capitalist goals. And it should also help color why they’re so hellbent about their gayass Russia sanctions lol cuz it ain’t working because too many countries think we’re a dying weak pathetic desperate empire and continue to do business with Russia. Wahhh Trump is upset lol just like Biden. (Unless it’s 5D chess and he has to act like a Bidenesque faggot for the Lindsey Grahams of the world who have a knife to his back? … ¯\\_(ツ)_/¯ ) Meanwhile, they suck CCP China’s dick daily.  I mean, I’m not against doing business with China, but they sold most of our country’s production to the biggest communist state on earth, meanwhile they pretend they have a problem with socialism? They’re lying pathetic faggots, and they’re just trying to rob Venezuela cuz they failed miserably to rob Russia.  And it’s not clear they’ll succeed even in Venezuela, cuz today’s faggot scum just isn’t as competent  as their predecessor ancestor scum. permalink parent award report block reply\nMegaboom2025 1 points 4 days ago I am legend takes place in New York City only permalink award report block reply\nToohershat 1 points 4 days ago It's a simple death sentence for a nation, but the NY thing is a different type of animal. Same socialist scam, but here it's a major city in a non-socialist country. What I'm saying is that it will fuck up NYC, but those of us Americans outside of that city will be put under pressure to bail them out. The media will come to their aid, saying Trump did this, MAGA did that, etc. They won't be eating zoo animals anytime soon, trust me. permalink award report block reply\nTobin 1 points 4 days ago Is that what the Venezuelan temporary resident people were fleeing?  If so maybe we should look into giving them some respite if they did it the legal way permalink award report block reply\nTheArchAngel 1 points 4 days ago some lessons you have to learn the hard way. permalink award report block reply\nGuerillaYourDreams 1 points 4 days ago The New Bronx Zoo Buffet!! permalink award report block reply\nDontApologize 1 points 4 days ago Chavez ate fine. All those New Yorkers think they will be the elite when US goes Communist. permalink award report block reply\nmikethemarine 1 points 4 days ago They expect the rest of the country to support them while they go threw their transition permalink award report block reply\nACActual 1 points 4 days ago Doesn't matter now.   NY is not America anymore.   Its occupied by 3rd World foreigners who know nothing about governance.  They just want free stuff.  Its time to cut cities off from all Federal funding.  Let them eat cake permalink award report block reply\nKrat 0 points 4 days ago They wont though, theyll siphon other states money first permalink award report block reply\nTheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nHoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:57:35.816993Z"
}