{
  "id": "1ARK9nPu6w",
  "url": "https://patriots.win/p/1ARK9nPu6w/america-has-sanctuary-cities-bir/c",
  "content": "17 \"America has sanctuary cities, birthright citizenship, chain migration, a zillion ways to stay once here. We don’t have the legal capacity for temporary workers, and any particulars are suicide to enforce because the civil rights act overrules everything and includes national origin\" posted 4 hours ago by bleeje 6 comments award share report block stricture @bog_beef • 9h America has sanctuary cities, birthright citizenship, chain migration, a zillion ways to stay once here. We don’t have the legal capacity for temporary workers, and any particulars are suicide to enforce because the civil rights act overrules everything and includes nat’l origin Eric Daugherty @EricLDaugh • 10h 🚨 BREAKING: Treasury Sec. Scott Bessent says President Trump's plan for visas is to TEMPORARILY bring in expert overseas workers to train Americans, they they go BACK home. \"Train the US workers. Then, go home. Then, the US workers fully take over.\" KILMEADE: You understand\n6 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno Wizard_Glick 4 points 4 hours ago They think we are stupid... permalink award report block reply FKH2 3 points 4 hours ago I call bullshit permalink award report block reply wharfthrowaway 3 points 4 hours ago “Temporary” like Somalis they’ve been here “temporarily” for 20 years. All they have to do is squirt out a kid once here and they can stay forever. permalink award report block reply genericamerican69 2 points 3 hours ago The US is the most innovative and prosperous country in the history of the world with the most elite universities. What could \"temporarily\" importing 3rd world shitskins possibly \"teach\" Americans? This doesn't even make sense. The globalist corporations have fully captured trump and his agenda. 10% of Intel? Intel is all punejab parasites!!!! permalink award report block reply Cville123 2 points 3 hours ago Bullshit indeed permalink award report block reply FKH2 1 points 4 hours ago The one thing we actually still build in America are ships at Bath Iron Works Maine and this is the example he uses permalink award report block reply genericamerican69 1 points 3 hours ago Bunch of shit bathing half monkey punejabs from whogiveaafuck india would make that so much better dont you think?? permalink parent award report block reply\nWizard_Glick 4 points 4 hours ago They think we are stupid... permalink award report block reply\nFKH2 3 points 4 hours ago I call bullshit permalink award report block reply\nwharfthrowaway 3 points 4 hours ago “Temporary” like Somalis they’ve been here “temporarily” for 20 years. All they have to do is squirt out a kid once here and they can stay forever. permalink award report block reply\ngenericamerican69 2 points 3 hours ago The US is the most innovative and prosperous country in the history of the world with the most elite universities. What could \"temporarily\" importing 3rd world shitskins possibly \"teach\" Americans? This doesn't even make sense. The globalist corporations have fully captured trump and his agenda. 10% of Intel? Intel is all punejab parasites!!!! permalink award report block reply\nCville123 2 points 3 hours ago Bullshit indeed permalink award report block reply\nFKH2 1 points 4 hours ago The one thing we actually still build in America are ships at Bath Iron Works Maine and this is the example he uses permalink award report block reply genericamerican69 1 points 3 hours ago Bunch of shit bathing half monkey punejabs from whogiveaafuck india would make that so much better dont you think?? permalink parent award report block reply\ngenericamerican69 1 points 3 hours ago Bunch of shit bathing half monkey punejabs from whogiveaafuck india would make that so much better dont you think?? permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:28:40.660521Z"
}