{
  "id": "8184729",
  "title": "460Charlie Kirk: \n1 - Mass deportations\n2 - Stop the H-1B scam\n3 - Dramatically reduce LEGAL Immigra",
  "url": "https://patriots.win/p/1ARK9mHEXh/charlie-kirk-\n1--mass-deportatio/c",
  "content": "481 Charlie Kirk: \n1 - Mass deportations\n2 - Stop the H-1B scam\n3 - Dramatically reduce LEGAL Immigration\n4 - End chain migration and the Visa Lottery\n5 - Build 10 million homes for Americans\n6 - Crush the College Cartel posted 15 hours ago by PiratePatriotParrot 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save SimaYi 8 points 11 hours ago Never going to happen. Trump loves H1B labor because Americans \"aren't talented\". permalink award report block reply Pats5x 6 points 10 hours ago Seems like Trump is against all of these at the moment....50 year mortgages, 600K chinamen students, H1B because they're \"talented\", and slow deportations....We had so much fucking hope but it looks like Trump has succumbed to the Mark Levin Israel First Wing of the Republican Party. permalink award report block reply aaafirefly123 1 points 5 hours ago The slow deportations aren’t entirely his fault. But he needs to declare that he will no longer abide by the rulings of any judge that isn’t the SCOTUS. permalink parent award report block reply TrumpPl4yedU 1 points 9 hours ago Comment removed upon the user being banned. permalink parent award report block reply BasedCostanza91 5 points 11 hours ago We have the talent, President Trump. Get the merchants out of your ear. permalink award report block reply SimaYi 2 points 11 hours ago Nope. He just said we need Indians H1Bs because Americans aren't talented enough to do these jobs. Laura ingram interview. Look it up. Fucking betrayal of the highest order. I'm done with this fucking cunt. He's not the one. permalink parent award report block reply BasedCostanza91 1 points 11 hours ago Well that’s fine. If we can’t vote our way out of it then we’ll use the old ways. permalink parent award report block reply Calumet57 4 points 15 hours ago Regarding #5 (build 10M homes): where and by whom? permalink award report block reply SuperUser 8 points 14 hours ago Remove the psychotic hyper bureaucracy and men will build their own home. permalink parent award report block reply Calumet57 3 points 13 hours ago okay, but where? permalink parent award report block reply PiratePatriotParrot OP 3 points 15 hours ago by H1-Bs or illegals haha permalink parent award report block reply BBvarn 1 points 11 hours ago There is free housing in NYC, one problem solved. You get free bussing with those free homes too. permalink parent award report block reply someguy7738 1 points 6 hours ago Yeah that's better solved by removing the 100 million+ foreigners from our shores. Although removing all the red tape and bullshit fees so that people can build their own homes affordably again would be nice. permalink parent award report block reply PiratePatriotParrot OP 2 points 15 hours ago https://x.com/charliekirk11/status/1956044288573497681 permalink award report block reply contender 2 points 8 hours ago This permalink award report block reply SteveRogers42 2 points 10 hours ago If we do mass deportations, we won’t need to build 10 million homes. permalink award report block reply aaafirefly123 1 points 5 hours ago I think MAGA just found its 2028 platform. permalink award report block reply\nSimaYi 8 points 11 hours ago Never going to happen. Trump loves H1B labor because Americans \"aren't talented\". permalink award report block reply\nPats5x 6 points 10 hours ago Seems like Trump is against all of these at the moment....50 year mortgages, 600K chinamen students, H1B because they're \"talented\", and slow deportations....We had so much fucking hope but it looks like Trump has succumbed to the Mark Levin Israel First Wing of the Republican Party. permalink award report block reply aaafirefly123 1 points 5 hours ago The slow deportations aren’t entirely his fault. But he needs to declare that he will no longer abide by the rulings of any judge that isn’t the SCOTUS. permalink parent award report block reply TrumpPl4yedU 1 points 9 hours ago Comment removed upon the user being banned. permalink parent award report block reply\naaafirefly123 1 points 5 hours ago The slow deportations aren’t entirely his fault. But he needs to declare that he will no longer abide by the rulings of any judge that isn’t the SCOTUS. permalink parent award report block reply\nTrumpPl4yedU 1 points 9 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nBasedCostanza91 5 points 11 hours ago We have the talent, President Trump. Get the merchants out of your ear. permalink award report block reply SimaYi 2 points 11 hours ago Nope. He just said we need Indians H1Bs because Americans aren't talented enough to do these jobs. Laura ingram interview. Look it up. Fucking betrayal of the highest order. I'm done with this fucking cunt. He's not the one. permalink parent award report block reply BasedCostanza91 1 points 11 hours ago Well that’s fine. If we can’t vote our way out of it then we’ll use the old ways. permalink parent award report block reply\nSimaYi 2 points 11 hours ago Nope. He just said we need Indians H1Bs because Americans aren't talented enough to do these jobs. Laura ingram interview. Look it up. Fucking betrayal of the highest order. I'm done with this fucking cunt. He's not the one. permalink parent award report block reply BasedCostanza91 1 points 11 hours ago Well that’s fine. If we can’t vote our way out of it then we’ll use the old ways. permalink parent award report block reply\nBasedCostanza91 1 points 11 hours ago Well that’s fine. If we can’t vote our way out of it then we’ll use the old ways. permalink parent award report block reply\nCalumet57 4 points 15 hours ago Regarding #5 (build 10M homes): where and by whom? permalink award report block reply SuperUser 8 points 14 hours ago Remove the psychotic hyper bureaucracy and men will build their own home. permalink parent award report block reply Calumet57 3 points 13 hours ago okay, but where? permalink parent award report block reply PiratePatriotParrot OP 3 points 15 hours ago by H1-Bs or illegals haha permalink parent award report block reply BBvarn 1 points 11 hours ago There is free housing in NYC, one problem solved. You get free bussing with those free homes too. permalink parent award report block reply someguy7738 1 points 6 hours ago Yeah that's better solved by removing the 100 million+ foreigners from our shores. Although removing all the red tape and bullshit fees so that people can build their own homes affordably again would be nice. permalink parent award report block reply\nSuperUser 8 points 14 hours ago Remove the psychotic hyper bureaucracy and men will build their own home. permalink parent award report block reply Calumet57 3 points 13 hours ago okay, but where? permalink parent award report block reply\nCalumet57 3 points 13 hours ago okay, but where? permalink parent award report block reply\nPiratePatriotParrot OP 3 points 15 hours ago by H1-Bs or illegals haha permalink parent award report block reply\nBBvarn 1 points 11 hours ago There is free housing in NYC, one problem solved. You get free bussing with those free homes too. permalink parent award report block reply\nsomeguy7738 1 points 6 hours ago Yeah that's better solved by removing the 100 million+ foreigners from our shores. Although removing all the red tape and bullshit fees so that people can build their own homes affordably again would be nice. permalink parent award report block reply\nPiratePatriotParrot OP 2 points 15 hours ago https://x.com/charliekirk11/status/1956044288573497681 permalink award report block reply\ncontender 2 points 8 hours ago This permalink award report block reply\nSteveRogers42 2 points 10 hours ago If we do mass deportations, we won’t need to build 10 million homes. permalink award report block reply\naaafirefly123 1 points 5 hours ago I think MAGA just found its 2028 platform. permalink award report block reply",
  "fetched_at": "2025-11-12T23:43:57.263222Z"
}