{
  "id": "1ARK9oWeL3",
  "url": "https://patriots.win/p/1ARK9oWeL3/president-trump-has-dug-himself-/c",
  "content": "3 President Trump has dug himself out of worse, however he needs to face the reality sooner, rather than later.. posted 1 hour ago by raptoris2 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Cville123 1 points 1 hour ago Yeah.  Their solution to H1B crowding out Americans is to make them citizens? So they can vote?\nThis is becoming a joke. permalink award report block reply TheJakeFroggy 1 points 1 hour ago I think a bunch of people have sent him messages through the WH website according to a post on this site that was stickied earlier today. Here's hoping he hears the disapproval of his latest statements. permalink award report block reply Jrtomasejn 1 points 1 hour ago Polls are for Holes. permalink award report block reply Deplora 1 points 1 hour ago Second time you've posted this.  Still no source. permalink award report block reply Ostia 1 points 56 minutes ago Here you go. I'll do it for them. It's the realclearpolitics average of all recent polls. This is where you decide to discredit the source of an average of multiple polls from multiple sources that all say the same thing, because it says something you don't want to hear. AP's latest poll today is even worse. permalink parent award report block reply Deplora 1 points 49 minutes ago Thanks.  I just like to see sources provided with posts here.  Too many shills spamming PDW with fake stuff aimed at demoralizing and dividing MAGA. permalink parent award report block reply\nCville123 1 points 1 hour ago Yeah.  Their solution to H1B crowding out Americans is to make them citizens? So they can vote?\nThis is becoming a joke. permalink award report block reply\nTheJakeFroggy 1 points 1 hour ago I think a bunch of people have sent him messages through the WH website according to a post on this site that was stickied earlier today. Here's hoping he hears the disapproval of his latest statements. permalink award report block reply\nJrtomasejn 1 points 1 hour ago Polls are for Holes. permalink award report block reply\nDeplora 1 points 1 hour ago Second time you've posted this.  Still no source. permalink award report block reply Ostia 1 points 56 minutes ago Here you go. I'll do it for them. It's the realclearpolitics average of all recent polls. This is where you decide to discredit the source of an average of multiple polls from multiple sources that all say the same thing, because it says something you don't want to hear. AP's latest poll today is even worse. permalink parent award report block reply Deplora 1 points 49 minutes ago Thanks.  I just like to see sources provided with posts here.  Too many shills spamming PDW with fake stuff aimed at demoralizing and dividing MAGA. permalink parent award report block reply\nOstia 1 points 56 minutes ago Here you go. I'll do it for them. It's the realclearpolitics average of all recent polls. This is where you decide to discredit the source of an average of multiple polls from multiple sources that all say the same thing, because it says something you don't want to hear. AP's latest poll today is even worse. permalink parent award report block reply Deplora 1 points 49 minutes ago Thanks.  I just like to see sources provided with posts here.  Too many shills spamming PDW with fake stuff aimed at demoralizing and dividing MAGA. permalink parent award report block reply\nDeplora 1 points 49 minutes ago Thanks.  I just like to see sources provided with posts here.  Too many shills spamming PDW with fake stuff aimed at demoralizing and dividing MAGA. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:26:11.630318Z"
}