{
  "id": "8180465",
  "title": "1280MSNBC's Morning Joe just said the QUIET PART OUT LOUD. \n\nDemocrats' goal with the Schumer Shutdo",
  "url": "https://patriots.win/p/1ARK9hipa1/msnbcs-morning-joe-just-said-the/c",
  "content": "1280 MSNBC's Morning Joe just said the QUIET PART OUT LOUD. \n\nDemocrats' goal with the Schumer Shutdown was to get CRIME OUT OF THE NEWS! \n\nThey wanted people to STOP talking about how OUT OF CONTROL Blue Cities are! posted 2 days ago by Eruditio 34 comments award share report block The Patriot Oasis™ @ThePatriotOasis • 2d 🚨BREAKING: MSNBC's Morning Joe just said the QUIET PART OUT LOUD. Democrats' goal with the Schumer Shutdown was to get CRIME OUT OF THE NEWS! They wanted people to STOP talking about how OUT OF CONTROL Blue Cities are!\n34 comments Sort by Top Top New Worst Old Save McFatty7 65 points 2 days ago I don’t think that’s the real reason. I think Shutdown Schumer wanted to manipulate the elections in Virginia, New Jersey, and NYC. By starving people of federal paychecks, SNAP benefits, and causing massive airport chaos, it was a nonverbal message saying “Vote for Democrats or else you’ll starve. Know your place serfs.” permalink award report block reply NonbinaryPotatohead 24 points 2 days ago This. The PR damage to this admin and the Republicans has been done in the MINDS of nearly all SNAP recipients and voters who flip base, which has been significant in the past 2 elections. People can't argue about abortion, illegal aliens or giving tens of billions to other countries if there is no food next month, etc. permalink parent award report block reply terribletwos 7 points 2 days ago Told people it was the wrong time to try to attack snap. People always have to put their two cents in to play into the enemies hands. The Democrats already owned the problem and we took it up for them and made it our own. permalink parent award report block reply Wtf_socialismreally 5 points 2 days ago It may have been the wrong time, but there will also never be a right time. That is a bandage that will need to be yanked off at some point. Perhaps focus on people who weren't born here first. Then you can drive a wedge between the people on the dime of the government who were born here, and the people who moved here to get on the dime of the government. With that wedge, we focus on the bigger issue (illegals and legal foreigners coming here to take our jobs and resources) without directly attacking the voter base at large. But either way, the welfare state will have to be addressed at some point, and we will always be a maximum of two years for an election. permalink parent award report block reply daty_dato 4 points 2 days ago And the Latino vote is gone because they've framed it better then the R's. permalink parent award report block reply clownworld30330 0 points 2 days ago This is the thing that worries me. With Latinos voting R for a few cycles the dems were done. With this they turned all poor Latinos back to supporting LGBTQKKK. permalink parent award report block reply NotYourMan 4 points 2 days ago Democrats did a good job pushing the narrative.  They are a single voice: party before people.  X showed the entire narrative with the endless push of \"higher health insurance cost\" and \"no EBT/SNAP\".  The campaign did enough damage to Trump and republicans so they settled on a compromise.  Watch the next round when they vote for ACA extensions.  They will leverage that vote too. permalink parent award report block reply booblitchutz 3 points 2 days ago These people are only aware of the moment they're in and the moment that just passed. They are about on par mentally with fruit flies. permalink parent award report block reply MickHigan2 4 points 2 days ago This is the real reason. Ignore the propaganda. permalink parent award report block reply NotYourMan 2 points 2 days ago When do we believe the MSM?  Never.  The democrats wanted leverage over Trump so they could push the elections.  Just look at all the posts on X to understand the narrative that drove the democrat shutdown.  Democrats used the poor and health insurance to get leverage on Trump. permalink parent award report block reply realPixelDust 1 points 2 days ago I agree - there is no possible way this is the reason why because they were risking riots & massively increased crime & did suffer a MASSIVE increase in threats from the inner-city career-EBT users. permalink parent award report block reply booblitchutz 1 points 2 days ago Joe Scarborough is the dumbest man on television. Thats a pretty low bar and he easily walks under it, even with his foot-tall pile of bouffant. permalink parent award report block reply load 2 more comments... MythArcana 13 points 2 days ago Why isn't he in prison for homicide? permalink award report block reply BurtMcGirt 6 points 2 days ago Because Mockingbird gonna Mockingbird? permalink parent award report block reply LaVaughnRobinson 3 points 2 days ago WAsnt she rumored to been pregnant too. permalink parent award report block reply CMDRConanAAnderson 5 points 2 days ago CDL invasion, ICE rioters, troon shooters. Take your pick. permalink award report block reply ActNow 3 points 2 days ago Only the Ds can present pile of shit A for the public, then distract by presenting pile of shit B. Way to go for your constituents! permalink award report block reply ReturnOfSmarm 3 points 2 days ago Someone needs to AI this exact segment, but with Rome burning in the background. permalink award report block reply daty_dato 3 points 2 days ago When was this asshole ever right?  They did this as long as they could to give their people hope, to pacify their nutters on the far left as long as they could. It was about to turn into a complete shit show before the holidays and they knew they had to give it up. permalink award report block reply booblitchutz 2 points 2 days ago Joe Scarborough is an imbecile. He has no idea what he's talking about. Yeah, the effect of the shutdown was a changed narrative, but no - the democrats didn't shut down the government to drown out coverage of crime. This guy's brains are fried from too much hairspray. permalink award report block reply PatriotSkorzeny 1 points 2 days ago Yeah that seems like the cover for the suffering. Not crime. Nobody gives a shit about crime. permalink award report block reply HumblePepe 1 points 2 days ago It's never about solving problems with democrats, but keeping reputation and power permalink award report block reply OldGloryUnfurled 1 points 2 days ago Nah, I dont see it. permalink award report block reply YodaBannon 1 points 2 days ago uh permalink award report block reply Greenhills 1 points 2 days ago What a dumb assessment. permalink award report block reply barwhack 1 points 2 days ago So let's go back to that. permalink award report block reply TheRedPike 2 points 2 days ago The thing about crime is it doesn't just go away. permalink parent award report block reply PearlyGaits57 1 points 2 days ago So, the demoncrats shut down the gubment for 45 days, to stop crimes frome being reported in blue states? that litrerally makes no sence. permalink award report block reply Prandogolio -1 points 2 days ago 🚨OMG WOW THE QUIET PART OUT LOUD!! WOW 🚨 LET THAT SINK IN!!! permalink award report block reply NonbinaryPotatohead -2 points 2 days ago You must be extremely short sighted. He is running cover for the damage that has been done to the Republicans and Trump's image through this SNAP debacle. Classic deflection. Did you FORGET he is CIA farmboy? permalink award report block reply djentropyhardcore 3 points 2 days ago There's no \"damage\" to Republicans over snap.  The damage was done to the left by people realizing there was 40 million something people on snap.  THAT'S why they caved.  They don't care about the people they just don't want those numbers out there in the media. permalink parent award report block reply KernalMustard 1 points 2 days ago 1 in 6 people are on snap. permalink parent award report block reply\nMcFatty7 65 points 2 days ago I don’t think that’s the real reason. I think Shutdown Schumer wanted to manipulate the elections in Virginia, New Jersey, and NYC. By starving people of federal paychecks, SNAP benefits, and causing massive airport chaos, it was a nonverbal message saying “Vote for Democrats or else you’ll starve. Know your place serfs.” permalink award report block reply NonbinaryPotatohead 24 points 2 days ago This. The PR damage to this admin and the Republicans has been done in the MINDS of nearly all SNAP recipients and voters who flip base, which has been significant in the past 2 elections. People can't argue about abortion, illegal aliens or giving tens of billions to other countries if there is no food next month, etc. permalink parent award report block reply terribletwos 7 points 2 days ago Told people it was the wrong time to try to attack snap. People always have to put their two cents in to play into the enemies hands. The Democrats already owned the problem and we took it up for them and made it our own. permalink parent award report block reply Wtf_socialismreally 5 points 2 days ago It may have been the wrong time, but there will also never be a right time. That is a bandage that will need to be yanked off at some point. Perhaps focus on people who weren't born here first. Then you can drive a wedge between the people on the dime of the government who were born here, and the people who moved here to get on the dime of the government. With that wedge, we focus on the bigger issue (illegals and legal foreigners coming here to take our jobs and resources) without directly attacking the voter base at large. But either way, the welfare state will have to be addressed at some point, and we will always be a maximum of two years for an election. permalink parent award report block reply daty_dato 4 points 2 days ago And the Latino vote is gone because they've framed it better then the R's. permalink parent award report block reply clownworld30330 0 points 2 days ago This is the thing that worries me. With Latinos voting R for a few cycles the dems were done. With this they turned all poor Latinos back to supporting LGBTQKKK. permalink parent award report block reply NotYourMan 4 points 2 days ago Democrats did a good job pushing the narrative.  They are a single voice: party before people.  X showed the entire narrative with the endless push of \"higher health insurance cost\" and \"no EBT/SNAP\".  The campaign did enough damage to Trump and republicans so they settled on a compromise.  Watch the next round when they vote for ACA extensions.  They will leverage that vote too. permalink parent award report block reply booblitchutz 3 points 2 days ago These people are only aware of the moment they're in and the moment that just passed. They are about on par mentally with fruit flies. permalink parent award report block reply MickHigan2 4 points 2 days ago This is the real reason. Ignore the propaganda. permalink parent award report block reply NotYourMan 2 points 2 days ago When do we believe the MSM?  Never.  The democrats wanted leverage over Trump so they could push the elections.  Just look at all the posts on X to understand the narrative that drove the democrat shutdown.  Democrats used the poor and health insurance to get leverage on Trump. permalink parent award report block reply realPixelDust 1 points 2 days ago I agree - there is no possible way this is the reason why because they were risking riots & massively increased crime & did suffer a MASSIVE increase in threats from the inner-city career-EBT users. permalink parent award report block reply booblitchutz 1 points 2 days ago Joe Scarborough is the dumbest man on television. Thats a pretty low bar and he easily walks under it, even with his foot-tall pile of bouffant. permalink parent award report block reply load 2 more comments...\nNonbinaryPotatohead 24 points 2 days ago This. The PR damage to this admin and the Republicans has been done in the MINDS of nearly all SNAP recipients and voters who flip base, which has been significant in the past 2 elections. People can't argue about abortion, illegal aliens or giving tens of billions to other countries if there is no food next month, etc. permalink parent award report block reply terribletwos 7 points 2 days ago Told people it was the wrong time to try to attack snap. People always have to put their two cents in to play into the enemies hands. The Democrats already owned the problem and we took it up for them and made it our own. permalink parent award report block reply Wtf_socialismreally 5 points 2 days ago It may have been the wrong time, but there will also never be a right time. That is a bandage that will need to be yanked off at some point. Perhaps focus on people who weren't born here first. Then you can drive a wedge between the people on the dime of the government who were born here, and the people who moved here to get on the dime of the government. With that wedge, we focus on the bigger issue (illegals and legal foreigners coming here to take our jobs and resources) without directly attacking the voter base at large. But either way, the welfare state will have to be addressed at some point, and we will always be a maximum of two years for an election. permalink parent award report block reply daty_dato 4 points 2 days ago And the Latino vote is gone because they've framed it better then the R's. permalink parent award report block reply clownworld30330 0 points 2 days ago This is the thing that worries me. With Latinos voting R for a few cycles the dems were done. With this they turned all poor Latinos back to supporting LGBTQKKK. permalink parent award report block reply NotYourMan 4 points 2 days ago Democrats did a good job pushing the narrative.  They are a single voice: party before people.  X showed the entire narrative with the endless push of \"higher health insurance cost\" and \"no EBT/SNAP\".  The campaign did enough damage to Trump and republicans so they settled on a compromise.  Watch the next round when they vote for ACA extensions.  They will leverage that vote too. permalink parent award report block reply booblitchutz 3 points 2 days ago These people are only aware of the moment they're in and the moment that just passed. They are about on par mentally with fruit flies. permalink parent award report block reply\nterribletwos 7 points 2 days ago Told people it was the wrong time to try to attack snap. People always have to put their two cents in to play into the enemies hands. The Democrats already owned the problem and we took it up for them and made it our own. permalink parent award report block reply Wtf_socialismreally 5 points 2 days ago It may have been the wrong time, but there will also never be a right time. That is a bandage that will need to be yanked off at some point. Perhaps focus on people who weren't born here first. Then you can drive a wedge between the people on the dime of the government who were born here, and the people who moved here to get on the dime of the government. With that wedge, we focus on the bigger issue (illegals and legal foreigners coming here to take our jobs and resources) without directly attacking the voter base at large. But either way, the welfare state will have to be addressed at some point, and we will always be a maximum of two years for an election. permalink parent award report block reply\nWtf_socialismreally 5 points 2 days ago It may have been the wrong time, but there will also never be a right time. That is a bandage that will need to be yanked off at some point. Perhaps focus on people who weren't born here first. Then you can drive a wedge between the people on the dime of the government who were born here, and the people who moved here to get on the dime of the government. With that wedge, we focus on the bigger issue (illegals and legal foreigners coming here to take our jobs and resources) without directly attacking the voter base at large. But either way, the welfare state will have to be addressed at some point, and we will always be a maximum of two years for an election. permalink parent award report block reply\ndaty_dato 4 points 2 days ago And the Latino vote is gone because they've framed it better then the R's. permalink parent award report block reply clownworld30330 0 points 2 days ago This is the thing that worries me. With Latinos voting R for a few cycles the dems were done. With this they turned all poor Latinos back to supporting LGBTQKKK. permalink parent award report block reply\nclownworld30330 0 points 2 days ago This is the thing that worries me. With Latinos voting R for a few cycles the dems were done. With this they turned all poor Latinos back to supporting LGBTQKKK. permalink parent award report block reply\nNotYourMan 4 points 2 days ago Democrats did a good job pushing the narrative.  They are a single voice: party before people.  X showed the entire narrative with the endless push of \"higher health insurance cost\" and \"no EBT/SNAP\".  The campaign did enough damage to Trump and republicans so they settled on a compromise.  Watch the next round when they vote for ACA extensions.  They will leverage that vote too. permalink parent award report block reply\nbooblitchutz 3 points 2 days ago These people are only aware of the moment they're in and the moment that just passed. They are about on par mentally with fruit flies. permalink parent award report block reply\nMickHigan2 4 points 2 days ago This is the real reason. Ignore the propaganda. permalink parent award report block reply\nNotYourMan 2 points 2 days ago When do we believe the MSM?  Never.  The democrats wanted leverage over Trump so they could push the elections.  Just look at all the posts on X to understand the narrative that drove the democrat shutdown.  Democrats used the poor and health insurance to get leverage on Trump. permalink parent award report block reply\nrealPixelDust 1 points 2 days ago I agree - there is no possible way this is the reason why because they were risking riots & massively increased crime & did suffer a MASSIVE increase in threats from the inner-city career-EBT users. permalink parent award report block reply\nbooblitchutz 1 points 2 days ago Joe Scarborough is the dumbest man on television. Thats a pretty low bar and he easily walks under it, even with his foot-tall pile of bouffant. permalink parent award report block reply\nMythArcana 13 points 2 days ago Why isn't he in prison for homicide? permalink award report block reply BurtMcGirt 6 points 2 days ago Because Mockingbird gonna Mockingbird? permalink parent award report block reply LaVaughnRobinson 3 points 2 days ago WAsnt she rumored to been pregnant too. permalink parent award report block reply\nBurtMcGirt 6 points 2 days ago Because Mockingbird gonna Mockingbird? permalink parent award report block reply\nLaVaughnRobinson 3 points 2 days ago WAsnt she rumored to been pregnant too. permalink parent award report block reply\nCMDRConanAAnderson 5 points 2 days ago CDL invasion, ICE rioters, troon shooters. Take your pick. permalink award report block reply\nActNow 3 points 2 days ago Only the Ds can present pile of shit A for the public, then distract by presenting pile of shit B. Way to go for your constituents! permalink award report block reply\nReturnOfSmarm 3 points 2 days ago Someone needs to AI this exact segment, but with Rome burning in the background. permalink award report block reply\ndaty_dato 3 points 2 days ago When was this asshole ever right?  They did this as long as they could to give their people hope, to pacify their nutters on the far left as long as they could. It was about to turn into a complete shit show before the holidays and they knew they had to give it up. permalink award report block reply\nbooblitchutz 2 points 2 days ago Joe Scarborough is an imbecile. He has no idea what he's talking about. Yeah, the effect of the shutdown was a changed narrative, but no - the democrats didn't shut down the government to drown out coverage of crime. This guy's brains are fried from too much hairspray. permalink award report block reply\nPatriotSkorzeny 1 points 2 days ago Yeah that seems like the cover for the suffering. Not crime. Nobody gives a shit about crime. permalink award report block reply\nHumblePepe 1 points 2 days ago It's never about solving problems with democrats, but keeping reputation and power permalink award report block reply\nOldGloryUnfurled 1 points 2 days ago Nah, I dont see it. permalink award report block reply\nYodaBannon 1 points 2 days ago uh permalink award report block reply\nGreenhills 1 points 2 days ago What a dumb assessment. permalink award report block reply\nbarwhack 1 points 2 days ago So let's go back to that. permalink award report block reply TheRedPike 2 points 2 days ago The thing about crime is it doesn't just go away. permalink parent award report block reply\nTheRedPike 2 points 2 days ago The thing about crime is it doesn't just go away. permalink parent award report block reply\nPearlyGaits57 1 points 2 days ago So, the demoncrats shut down the gubment for 45 days, to stop crimes frome being reported in blue states? that litrerally makes no sence. permalink award report block reply\nPrandogolio -1 points 2 days ago 🚨OMG WOW THE QUIET PART OUT LOUD!! WOW 🚨 LET THAT SINK IN!!! permalink award report block reply\nNonbinaryPotatohead -2 points 2 days ago You must be extremely short sighted. He is running cover for the damage that has been done to the Republicans and Trump's image through this SNAP debacle. Classic deflection. Did you FORGET he is CIA farmboy? permalink award report block reply djentropyhardcore 3 points 2 days ago There's no \"damage\" to Republicans over snap.  The damage was done to the left by people realizing there was 40 million something people on snap.  THAT'S why they caved.  They don't care about the people they just don't want those numbers out there in the media. permalink parent award report block reply KernalMustard 1 points 2 days ago 1 in 6 people are on snap. permalink parent award report block reply\ndjentropyhardcore 3 points 2 days ago There's no \"damage\" to Republicans over snap.  The damage was done to the left by people realizing there was 40 million something people on snap.  THAT'S why they caved.  They don't care about the people they just don't want those numbers out there in the media. permalink parent award report block reply KernalMustard 1 points 2 days ago 1 in 6 people are on snap. permalink parent award report block reply\nKernalMustard 1 points 2 days ago 1 in 6 people are on snap. permalink parent award report block reply"
}