{
  "id": "1ARK5A8kTq",
  "url": "https://patriots.win/p/1ARK5A8kTq/since-1963-75-of-all-nationwide-/c",
  "content": "366 Since 1963, 75% of all nationwide injunctions have been against President Trump. 90% of those injunctions came from Democrat-appointed judges. Yet the Admin has a 92% win rate at SCOTUS. President Trump isn’t the one abusing his power. It’s Democrat-appointed judges. YES posted 3 days ago by Kimball_Kinnison 5 comments award share report block Chad Mizelle @chad_mizelle • 5d Since 1963, 75% of all nationwide injunctions have been against President Trump. 90% of those injunctions came from Democrat-appointed judges. Yet the Admin has a 92% win rate at SCOTUS. President Trump isn’t the one abusing his power. It’s Democrat-appointed judges.\n5 comments Sort by Top Top New Worst Old Save Around the Web FORMERCHILDSTAR 12 points 3 days ago I try to tell liberals this all the time. They think Trump is lawless because of these injunctions, but they don't realize nearly all of those injunctions get reversed. It's the activists judges who are promoting lawlessness, not President Trump. permalink award report block reply Zhongda 5 points 3 days ago It's (D)ifferent until it is made not to be.  That simple.  But suppose we can kick the can down the road another decade.  Sure. permalink award report block reply Chachiex 3 points 3 days ago The chances of any fed appointed position being a compromised pedophile, in time will be understood to be 80% permalink award report block reply barwhack 1 points 3 days ago 1963... permalink award report block reply 1_Badcop 1 points 3 days ago If only the republicans controlled Congress and could do something about this. permalink award report block reply\nFORMERCHILDSTAR 12 points 3 days ago I try to tell liberals this all the time. They think Trump is lawless because of these injunctions, but they don't realize nearly all of those injunctions get reversed. It's the activists judges who are promoting lawlessness, not President Trump. permalink award report block reply\nZhongda 5 points 3 days ago It's (D)ifferent until it is made not to be.  That simple.  But suppose we can kick the can down the road another decade.  Sure. permalink award report block reply\nChachiex 3 points 3 days ago The chances of any fed appointed position being a compromised pedophile, in time will be understood to be 80% permalink award report block reply\nbarwhack 1 points 3 days ago 1963... permalink award report block reply\n1_Badcop 1 points 3 days ago If only the republicans controlled Congress and could do something about this. permalink award report block reply",
  "fetched_at": "2025-11-12T23:02:09.553343Z"
}