{
  "id": "1ARK9mHW3a",
  "url": "https://patriots.win/p/1ARK9mHW3a/many-of-the-same-senators-sittin/c",
  "content": "600 Many of the same senators sitting in the Senate today are the ones who backed both impeachment efforts against President Trump—built entirely on false claims of a 2016 “Russia collusion.” posted 10 hours ago by MEME-SUPREME 4 comments award share report block Rep. Anna Paulina Luna @RepLuna • 18h Many of the same senators sitting in the Senate today are the ones who backed both impeachment efforts against President Trump—built entirely on false claims of a 2016 “Russia collusion.” They ran cover for a clearly unfit president (Biden), then launched a quiet coup against\n4 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style FORMERCHILDSTAR 5 points 9 hours ago Snakes!!! Anti democratic snakes!!! permalink award report block reply LiteraIIyHitIer 3 points 4 hours ago Yeah, like Thune and Graham aren't using election fraud themselves. permalink award report block reply Dev404 3 points 6 hours ago I've been bitching about how Congress are the criminals that have been facilitating every negative aspect of this country by funding terrorist-backing NGOs and passing laws to try to limit us when the limits need to be put on them. permalink award report block reply starjello 1 points 5 hours ago And they're chomping at the bit to do it again after the 2026 midterms. Trump better start building a tower in downtown Tel Aviv. Might be the only place his family will be safe. Now down vote away useless faggots. Truth is like holy water sprinkled on your demonic heads permalink award report block reply\nFORMERCHILDSTAR 5 points 9 hours ago Snakes!!! Anti democratic snakes!!! permalink award report block reply\nLiteraIIyHitIer 3 points 4 hours ago Yeah, like Thune and Graham aren't using election fraud themselves. permalink award report block reply\nDev404 3 points 6 hours ago I've been bitching about how Congress are the criminals that have been facilitating every negative aspect of this country by funding terrorist-backing NGOs and passing laws to try to limit us when the limits need to be put on them. permalink award report block reply\nstarjello 1 points 5 hours ago And they're chomping at the bit to do it again after the 2026 midterms. Trump better start building a tower in downtown Tel Aviv. Might be the only place his family will be safe. Now down vote away useless faggots. Truth is like holy water sprinkled on your demonic heads permalink award report block reply",
  "fetched_at": "2025-11-12T21:22:27.009367Z"
}