{
  "id": "1ARK9mHmlx",
  "url": "https://patriots.win/p/1ARK9mHmlx/bringing-foreigners-into-america/c",
  "content": "752 Bringing foreigners into America is worse than shooting a man on Fifth Avenue.  We need to deport them all.  Housing crisis?  Deport.  You do not even have to build a single home.  We do not want Chinese students.  We do not want H-1b.  We do not want invaders.  We do not want 50 yr mortgages. DEPORT posted 11 hours ago by RadicalCovfefe 43 comments award share report block .\n43 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Trooph-Hurts 41 points 11 hours ago There are 125 million foreigners in this country….. 50,000,000 hold visas,,, 25 million visa overstay criminals,,, And another 50 million are illegally here with no visa and no invitation!……… The reason why your kids can’t get into college is because of this, The reason why our kids can’t buy a home is because of this, The reason why it’s difficult to get a job because of this,,,, then you add the economic structures that are designed to promote foreigners against Americans, Like, Like housing loans, Like access to medical care supporting all of these millions of people that don’t belong here, The school systems that our kids have to go to and never get educated because there’s too many foreigners, Quotas and DEI…… Tax benefits for foreign owned businesses,….. It’s not just that they’re here. It’s that they’re treated so much better and how we are treated so unfairly.! ….. i’m sick of the system, ignoring the problem, and this includes Trump permalink award report block reply mohel 14 points 7 hours ago This is cancer. And like an advanced stage cancer, it has grown so big it prevents the rest of healthy cells from functioning. The patient will be dead soon unless they undergo a treatment. permalink parent award report block reply SutopSutolf 1 points 5 hours ago Nah, we already dead. permalink parent award report block reply UltraMagaWA 6 points 9 hours ago 100% permalink parent award report block reply NotYourMan 2 points 6 hours ago This is true!  Giving the successful companies and jobs of the boomers to foreigners is such a democrat strategy but we see republicans supporting this too.  Start charging a 20% of salary fee per year for each H1B-visa worker and use that money to fund US citizens getting graduate level degrees from US universities. permalink parent award report block reply RedStoneDeepState -2 points 4 hours ago This is complete nonsense permalink parent award report block reply Trooph-Hurts 2 points 3 hours ago What’s nonsense,,,,, the stats came out 6 weeks ago….. 50 million visa holders,,,,,, we know Biden brought 20 million in illegals on top of the 35 million here already……. In 2007 there were 8 million visa overstays and that number increases 800k a year! permalink parent award report block reply RedStoneDeepState -1 points 3 hours ago 50 million visa holders Yes, mostly tourists. What about it? Biden brought 20 million in illegals No. 11 million. And then you have Trump's 3 million deportations, mostly voluntary ones. 35 million here already No. 10 to 12 million. permalink parent award report block reply possibletower -3 points 5 hours ago Ron DeFaggot will never be your POTUS permalink parent award report block reply load 1 more comments... Trump454748 28 points 11 hours ago 100%. It has been stated before that there is absolutely no downside to getting rid of 50 to 100 million people that don’t actually belong here. permalink award report block reply RedStoneDeepState -2 points 4 hours ago There aren't 50 to 100 million to get rid of permalink parent award report block reply RadicalCovfefe OP 3 points 4 hours ago Oh you trust the census, huh? permalink parent award report block reply RedStoneDeepState -1 points 3 hours ago Nope permalink parent award report block reply -Evspra 14 points 10 hours ago hey man, if it makes you feel any better, kristi noem just bragged about how more foreigners are becoming citizens than before! yay!!! https://patriots.win/p/1ARK9nNhea/now--dhs-secretary-noem-on-h1bs-/c permalink award report block reply Truthisunpopular 8 points 9 hours ago Sorry, you're going to have to settle for endless hordes of foreigners that will never assimilate taking all of the best jobs while importing their entire bloodline because trump thinks Americans are too stupid, worthless and incompetent to do any job in the country, from farm labor to engineering. It's a really great strategy that will keep MAGA united now and going forward after he's out of office because we're all sure to show up to vote for more of this! WINNING!! permalink award report block reply TrumpPl4yedU 0 points 9 hours ago Comment removed upon the user being banned. permalink parent award report block reply tholinz 6 points 10 hours ago So don't sit here and whine online. Call the White House. Call your congressman. Show up if there's a town hall in your area. Protest. Do something in meat space. permalink award report block reply glow-operator-2-0 8 points 10 hours ago Calling automated systems does little, IMO. permalink parent award report block reply The_Emperor 4 points 9 hours ago He said meat space permalink parent award report block reply aaafirefly123 6 points 5 hours ago I think the issue is that these policies Trump is advancing would have been wonderful… back in 2017. If it was back in 2017, then everything he is doing: reforming H1B, deporting only illegals, and only arresting a few perps would have been fine. But the problem is that it isn’t 2017. It’s 2025 and we just got out of the most corrupt and evil administration in American history. An administration that flooded the country with illegal aliens, gave out a record number of H1Bs, and staffed the government with the wokest and most corrupt people in America. Trump fails to realize that after all that, the people don’t want to reform H1B, they want to end it, they don’t want to just deport illegals, but to actively end all immigration. Trump has stayed pretty consistent, he wants to reform the existing order, not uproot it entirely. But his base has gone further right and now wants radical reforms, and if we don’t get it, then we want revolution. permalink award report block reply ACActual 1 points 3 hours ago Exactly permalink parent award report block reply VaporJet11 5 points 9 hours ago Well said and true for most Americans feel the same. Keep bringing them in to keep wages low and keep stagnating the standard of living for Americans in the richest Country in the World. permalink award report block reply greatpumpkin 5 points 5 hours ago Keep talking. You're on the right track, don't stop now. permalink award report block reply JerryNadlerBeltFund 5 points 10 hours ago We may not have to build a single home, but we'll need to do some fumigating, sanitizing and repiair. permalink award report block reply RadicalCovfefe OP 4 points 4 hours ago Kek permalink parent award report block reply IAmRetard 5 points 10 hours ago This permalink award report block reply apathy_meh 4 points 5 hours ago Afuera to all permalink award report block reply ChristiansAreIsrael 3 points 4 hours ago So much for deportations and making america great again. Seems like all that's cared about now is giving a platform to a retard who cannot read a scientific paper to save his life and importing more h1bs to displace american workers and make education even more expensive for americans. The left drift is real and disgusting. permalink award report block reply friarfox 3 points 9 hours ago Best I can do is a MAGA hat. permalink award report block reply MoldyLocksNesMonste 3 points 6 hours ago And sombrero hat memes. permalink parent award report block reply Mudbutt 2 points 2 hours ago This thread is why there's so many stickied posts. Mods are being Uber fags trying to kill Trump stabbing is in the back. We're not a cult, and these Zionist cocksuckers are about to learn next election. permalink award report block reply RadicalCovfefe OP 1 points 47 minutes ago Yeah, it's coming to a head.  As the old guard is cornered it is lashing out in violent struggle.  The death throes of a wicked people are rife with debauchery and thieving and killing. permalink parent award report block reply Crappydatum 1 points 2 hours ago Gangs of New York called, they need another extra permalink award report block reply ACActual 1 points 3 hours ago Property (Homes) is the problem for Trump.   His donors don't want property values to drop that's why they sold him on 50 year mortgage.   Were fucked.  Chinese Spies, Illegals and H1B's take housing.  Wonder what the connection is? permalink award report block reply RadicalCovfefe OP 1 points 44 minutes ago It is all connected, yet very simple.  This is no mysterious web of various things, but a central thread.  We have been invaded and now we are being replaced even against what we were promised.  Hope it turns out. permalink parent award report block reply possibletower -4 points 5 hours ago Ron DeFaggot will never be your POTUS permalink award report block reply RadicalCovfefe OP 2 points 4 hours ago Good permalink parent award report block reply Krampus5150 1 points 3 hours ago Who says? You? That's laughable. You gonna assassinate him if he tries? That's all your fucking side does. Worthless fucking commies. permalink parent award report block reply BonginosRac1stCowboy 3 points 11 hours ago Comment removed by community moderators. permalink award report block reply RadicalCovfefe OP 6 points 11 hours ago And i dont want a damn check from the government. permalink parent award report block reply RadicalCovfefe OP 2 points 11 hours ago Amen permalink parent award report block reply Be_The_Change 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply\nTrooph-Hurts 41 points 11 hours ago There are 125 million foreigners in this country….. 50,000,000 hold visas,,, 25 million visa overstay criminals,,, And another 50 million are illegally here with no visa and no invitation!……… The reason why your kids can’t get into college is because of this, The reason why our kids can’t buy a home is because of this, The reason why it’s difficult to get a job because of this,,,, then you add the economic structures that are designed to promote foreigners against Americans, Like, Like housing loans, Like access to medical care supporting all of these millions of people that don’t belong here, The school systems that our kids have to go to and never get educated because there’s too many foreigners, Quotas and DEI…… Tax benefits for foreign owned businesses,….. It’s not just that they’re here. It’s that they’re treated so much better and how we are treated so unfairly.! ….. i’m sick of the system, ignoring the problem, and this includes Trump permalink award report block reply mohel 14 points 7 hours ago This is cancer. And like an advanced stage cancer, it has grown so big it prevents the rest of healthy cells from functioning. The patient will be dead soon unless they undergo a treatment. permalink parent award report block reply SutopSutolf 1 points 5 hours ago Nah, we already dead. permalink parent award report block reply UltraMagaWA 6 points 9 hours ago 100% permalink parent award report block reply NotYourMan 2 points 6 hours ago This is true!  Giving the successful companies and jobs of the boomers to foreigners is such a democrat strategy but we see republicans supporting this too.  Start charging a 20% of salary fee per year for each H1B-visa worker and use that money to fund US citizens getting graduate level degrees from US universities. permalink parent award report block reply RedStoneDeepState -2 points 4 hours ago This is complete nonsense permalink parent award report block reply Trooph-Hurts 2 points 3 hours ago What’s nonsense,,,,, the stats came out 6 weeks ago….. 50 million visa holders,,,,,, we know Biden brought 20 million in illegals on top of the 35 million here already……. In 2007 there were 8 million visa overstays and that number increases 800k a year! permalink parent award report block reply RedStoneDeepState -1 points 3 hours ago 50 million visa holders Yes, mostly tourists. What about it? Biden brought 20 million in illegals No. 11 million. And then you have Trump's 3 million deportations, mostly voluntary ones. 35 million here already No. 10 to 12 million. permalink parent award report block reply possibletower -3 points 5 hours ago Ron DeFaggot will never be your POTUS permalink parent award report block reply load 1 more comments...\nmohel 14 points 7 hours ago This is cancer. And like an advanced stage cancer, it has grown so big it prevents the rest of healthy cells from functioning. The patient will be dead soon unless they undergo a treatment. permalink parent award report block reply SutopSutolf 1 points 5 hours ago Nah, we already dead. permalink parent award report block reply\nSutopSutolf 1 points 5 hours ago Nah, we already dead. permalink parent award report block reply\nUltraMagaWA 6 points 9 hours ago 100% permalink parent award report block reply\nNotYourMan 2 points 6 hours ago This is true!  Giving the successful companies and jobs of the boomers to foreigners is such a democrat strategy but we see republicans supporting this too.  Start charging a 20% of salary fee per year for each H1B-visa worker and use that money to fund US citizens getting graduate level degrees from US universities. permalink parent award report block reply\nRedStoneDeepState -2 points 4 hours ago This is complete nonsense permalink parent award report block reply Trooph-Hurts 2 points 3 hours ago What’s nonsense,,,,, the stats came out 6 weeks ago….. 50 million visa holders,,,,,, we know Biden brought 20 million in illegals on top of the 35 million here already……. In 2007 there were 8 million visa overstays and that number increases 800k a year! permalink parent award report block reply RedStoneDeepState -1 points 3 hours ago 50 million visa holders Yes, mostly tourists. What about it? Biden brought 20 million in illegals No. 11 million. And then you have Trump's 3 million deportations, mostly voluntary ones. 35 million here already No. 10 to 12 million. permalink parent award report block reply\nTrooph-Hurts 2 points 3 hours ago What’s nonsense,,,,, the stats came out 6 weeks ago….. 50 million visa holders,,,,,, we know Biden brought 20 million in illegals on top of the 35 million here already……. In 2007 there were 8 million visa overstays and that number increases 800k a year! permalink parent award report block reply RedStoneDeepState -1 points 3 hours ago 50 million visa holders Yes, mostly tourists. What about it? Biden brought 20 million in illegals No. 11 million. And then you have Trump's 3 million deportations, mostly voluntary ones. 35 million here already No. 10 to 12 million. permalink parent award report block reply\nRedStoneDeepState -1 points 3 hours ago 50 million visa holders Yes, mostly tourists. What about it? Biden brought 20 million in illegals No. 11 million. And then you have Trump's 3 million deportations, mostly voluntary ones. 35 million here already No. 10 to 12 million. permalink parent award report block reply\npossibletower -3 points 5 hours ago Ron DeFaggot will never be your POTUS permalink parent award report block reply\nTrump454748 28 points 11 hours ago 100%. It has been stated before that there is absolutely no downside to getting rid of 50 to 100 million people that don’t actually belong here. permalink award report block reply RedStoneDeepState -2 points 4 hours ago There aren't 50 to 100 million to get rid of permalink parent award report block reply RadicalCovfefe OP 3 points 4 hours ago Oh you trust the census, huh? permalink parent award report block reply RedStoneDeepState -1 points 3 hours ago Nope permalink parent award report block reply\nRedStoneDeepState -2 points 4 hours ago There aren't 50 to 100 million to get rid of permalink parent award report block reply RadicalCovfefe OP 3 points 4 hours ago Oh you trust the census, huh? permalink parent award report block reply RedStoneDeepState -1 points 3 hours ago Nope permalink parent award report block reply\nRadicalCovfefe OP 3 points 4 hours ago Oh you trust the census, huh? permalink parent award report block reply RedStoneDeepState -1 points 3 hours ago Nope permalink parent award report block reply\nRedStoneDeepState -1 points 3 hours ago Nope permalink parent award report block reply\n-Evspra 14 points 10 hours ago hey man, if it makes you feel any better, kristi noem just bragged about how more foreigners are becoming citizens than before! yay!!! https://patriots.win/p/1ARK9nNhea/now--dhs-secretary-noem-on-h1bs-/c permalink award report block reply\nTruthisunpopular 8 points 9 hours ago Sorry, you're going to have to settle for endless hordes of foreigners that will never assimilate taking all of the best jobs while importing their entire bloodline because trump thinks Americans are too stupid, worthless and incompetent to do any job in the country, from farm labor to engineering. It's a really great strategy that will keep MAGA united now and going forward after he's out of office because we're all sure to show up to vote for more of this! WINNING!! permalink award report block reply TrumpPl4yedU 0 points 9 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpPl4yedU 0 points 9 hours ago Comment removed upon the user being banned. permalink parent award report block reply\ntholinz 6 points 10 hours ago So don't sit here and whine online. Call the White House. Call your congressman. Show up if there's a town hall in your area. Protest. Do something in meat space. permalink award report block reply glow-operator-2-0 8 points 10 hours ago Calling automated systems does little, IMO. permalink parent award report block reply The_Emperor 4 points 9 hours ago He said meat space permalink parent award report block reply\nglow-operator-2-0 8 points 10 hours ago Calling automated systems does little, IMO. permalink parent award report block reply The_Emperor 4 points 9 hours ago He said meat space permalink parent award report block reply\nThe_Emperor 4 points 9 hours ago He said meat space permalink parent award report block reply\naaafirefly123 6 points 5 hours ago I think the issue is that these policies Trump is advancing would have been wonderful… back in 2017. If it was back in 2017, then everything he is doing: reforming H1B, deporting only illegals, and only arresting a few perps would have been fine. But the problem is that it isn’t 2017. It’s 2025 and we just got out of the most corrupt and evil administration in American history. An administration that flooded the country with illegal aliens, gave out a record number of H1Bs, and staffed the government with the wokest and most corrupt people in America. Trump fails to realize that after all that, the people don’t want to reform H1B, they want to end it, they don’t want to just deport illegals, but to actively end all immigration. Trump has stayed pretty consistent, he wants to reform the existing order, not uproot it entirely. But his base has gone further right and now wants radical reforms, and if we don’t get it, then we want revolution. permalink award report block reply ACActual 1 points 3 hours ago Exactly permalink parent award report block reply\nACActual 1 points 3 hours ago Exactly permalink parent award report block reply\nVaporJet11 5 points 9 hours ago Well said and true for most Americans feel the same. Keep bringing them in to keep wages low and keep stagnating the standard of living for Americans in the richest Country in the World. permalink award report block reply\ngreatpumpkin 5 points 5 hours ago Keep talking. You're on the right track, don't stop now. permalink award report block reply\nJerryNadlerBeltFund 5 points 10 hours ago We may not have to build a single home, but we'll need to do some fumigating, sanitizing and repiair. permalink award report block reply RadicalCovfefe OP 4 points 4 hours ago Kek permalink parent award report block reply\nRadicalCovfefe OP 4 points 4 hours ago Kek permalink parent award report block reply\nIAmRetard 5 points 10 hours ago This permalink award report block reply\napathy_meh 4 points 5 hours ago Afuera to all permalink award report block reply\nChristiansAreIsrael 3 points 4 hours ago So much for deportations and making america great again. Seems like all that's cared about now is giving a platform to a retard who cannot read a scientific paper to save his life and importing more h1bs to displace american workers and make education even more expensive for americans. The left drift is real and disgusting. permalink award report block reply\nfriarfox 3 points 9 hours ago Best I can do is a MAGA hat. permalink award report block reply MoldyLocksNesMonste 3 points 6 hours ago And sombrero hat memes. permalink parent award report block reply\nMoldyLocksNesMonste 3 points 6 hours ago And sombrero hat memes. permalink parent award report block reply\nMudbutt 2 points 2 hours ago This thread is why there's so many stickied posts. Mods are being Uber fags trying to kill Trump stabbing is in the back. We're not a cult, and these Zionist cocksuckers are about to learn next election. permalink award report block reply RadicalCovfefe OP 1 points 47 minutes ago Yeah, it's coming to a head.  As the old guard is cornered it is lashing out in violent struggle.  The death throes of a wicked people are rife with debauchery and thieving and killing. permalink parent award report block reply\nRadicalCovfefe OP 1 points 47 minutes ago Yeah, it's coming to a head.  As the old guard is cornered it is lashing out in violent struggle.  The death throes of a wicked people are rife with debauchery and thieving and killing. permalink parent award report block reply\nCrappydatum 1 points 2 hours ago Gangs of New York called, they need another extra permalink award report block reply\nACActual 1 points 3 hours ago Property (Homes) is the problem for Trump.   His donors don't want property values to drop that's why they sold him on 50 year mortgage.   Were fucked.  Chinese Spies, Illegals and H1B's take housing.  Wonder what the connection is? permalink award report block reply RadicalCovfefe OP 1 points 44 minutes ago It is all connected, yet very simple.  This is no mysterious web of various things, but a central thread.  We have been invaded and now we are being replaced even against what we were promised.  Hope it turns out. permalink parent award report block reply\nRadicalCovfefe OP 1 points 44 minutes ago It is all connected, yet very simple.  This is no mysterious web of various things, but a central thread.  We have been invaded and now we are being replaced even against what we were promised.  Hope it turns out. permalink parent award report block reply\npossibletower -4 points 5 hours ago Ron DeFaggot will never be your POTUS permalink award report block reply RadicalCovfefe OP 2 points 4 hours ago Good permalink parent award report block reply Krampus5150 1 points 3 hours ago Who says? You? That's laughable. You gonna assassinate him if he tries? That's all your fucking side does. Worthless fucking commies. permalink parent award report block reply\nRadicalCovfefe OP 2 points 4 hours ago Good permalink parent award report block reply\nKrampus5150 1 points 3 hours ago Who says? You? That's laughable. You gonna assassinate him if he tries? That's all your fucking side does. Worthless fucking commies. permalink parent award report block reply\nBonginosRac1stCowboy 3 points 11 hours ago Comment removed by community moderators. permalink award report block reply RadicalCovfefe OP 6 points 11 hours ago And i dont want a damn check from the government. permalink parent award report block reply RadicalCovfefe OP 2 points 11 hours ago Amen permalink parent award report block reply Be_The_Change 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply\nRadicalCovfefe OP 6 points 11 hours ago And i dont want a damn check from the government. permalink parent award report block reply\nRadicalCovfefe OP 2 points 11 hours ago Amen permalink parent award report block reply\nBe_The_Change 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:12:17.298276Z"
}