{
  "id": "1ARK9iqOor",
  "url": "https://patriots.win/p/1ARK9iqOor/x/c",
  "content": "698 😮 posted 2 days ago by magaMC117 84 comments award share download report block\n84 comments Sort by Top Top New Worst Old Save Roadpower 60 points 2 days ago I hope that is restricted to actual Polish people. permalink award report block reply Bullet3250 26 points 2 days ago All of Eastern Europe should do this. permalink parent award report block reply Roadpower 20 points 2 days ago Every European nation, they're in a global minority. They should have less than zero shame about this. permalink parent award report block reply Bullet3250 9 points 2 days ago Western Europe has to instigation FULL REMIGRATION first.  None Europeans have to get that free ride back home. permalink parent award report block reply MAGALADON9 5 points 2 days ago Full remigration Then isolation. I literally hope they eat each other permalink parent award report block reply RedCapNation 3 points 2 days ago And the USA. But only if your family was here pre immigration act. permalink parent award report block reply TerrorAndSlaughter 17 points 2 days ago Poland is almost entirely Polish.  Even their minorities are groups like Silesian(a region in Poland).  I think the biggest non-Polish group are Ukrainian. permalink parent award report block reply Roadpower 7 points 2 days ago Good to hear. permalink parent award report block reply South_Florida_Guy 8 points 2 days ago And 100% WHITE children only permalink parent award report block reply TiggerLovingPooh 5 points 2 days ago Exactly. Leftists would suddenly implement these programs and ban abortion right after they flood White countries with millions of foreigners. permalink parent award report block reply patrioticwinning3 5 points 2 days ago And only if they stay married and the dad is the dad of all children! permalink parent award report block reply load 1 more comments... Bullet3250 23 points 2 days ago This is how you do it. permalink award report block reply Votingnerd 5 points 2 days ago Didnt the Austrian painter implement something similar permalink parent award report block reply Datamancer 8 points 2 days ago Well, he also painted so I guess we need to outlaw that too. permalink parent award report block reply carpetxparmesan 0 points 2 days ago He hated christianity. And anything he may have done positive, he wiped out by allowing his cities to be burned and his people to be killed defending the indefensible. He was a socialist. And not a particularly good one at that. Thanks to him, a once proud people wallow in an even worse socialist fetor than his own, too scared to teach their own history to their children so they can sacrifice those children's minds to globohomo. He was retarded. He had so little faith in his own people that he thought the world would choke his country even though they were #1 in almost every important field of industry and science: chemistry, metallurgy, physics, logistics, manufacturing, engineering. They're still either #1, #2 or top 5 in almost every field that counts, excepting maybe they don't make as much money as they could, though they punch above their weight in that category too. And, even for their lowest classes, even today, they fare better than most of europe. The world could no more choke german industry than german people could stop excelling at chemistry and warfare. He was a bitter mental midget with a lot of charisma. He could have chosen freedom and instead he chose socialism. Fucking retarded. He probably would have unlocked fusion by now if his retarded ass hadn't forced the world to gang up on him and Americans to find clever ways to lead him down the wrong path. If he would have just not existed, left his people to struggle into the future, they would have advanced twice as fast as they already did. And they ALREADY control europe without having fired ONE shot. Guy was a perfect example that sometimes, often-times, the best move is not to play, not to interfere, not to act in any way whatsoever. When confronted with a problem, sometimes the best solution is to not take your turn, to fast-forward the game and see what develops in your current path. That's what voters and governments often don't understand and just can't wrap their minds around the concept. Disease, famine, poverty, sometimes the winning move is to just... keep your hands off. Because any play you make, you will make things worse and prevent the magic of the markets from working. Boohoo, you got injured in a war. Big deal. You had the best chemists, the best mathematicians, the best universities, and you burn it down for what? A worse version, a gayer version of yourself to take over and destroy anything you valued? Even hitler would be ashamed of the faggots leading Germany today and he wasn't a prime example of humanity himself. Just... more charismatic than your average bear. permalink parent award report block reply Votingnerd 1 points 1 day ago Me thinks he doth protest too much! permalink parent award report block reply carpetxparmesan 1 points 22 hours ago Sure. Keep sucking a socialist's dick, that'll make you alright. permalink parent award report block reply snoopy3210 3 points 2 days ago No. For mothers only. And for 3 children and up. You can reduce taxes for 2 to motivate gradually towards 3 permalink parent award report block reply MaxineWaters4Prez 2 points 2 days ago Married couples with two or more children. Incentivize families remaining intact. permalink parent award report block reply Magma_Biscuit 11 points 2 days ago Why do people without kids always get the shaft permalink award report block reply Datamancer 23 points 2 days ago Because nations are still built on people and we are not contributing. Personally I see no issue with this other than the possibility of fraud and bad actors, but that is possible with anything. permalink parent award report block reply politicsaside 4 points 2 days ago The only issue I have is that people with fertility issues should be penalized for a medical problem that’s not their fault. permalink parent award report block reply dumb-but-not-stupid 3 points 2 days ago Adopt. permalink parent award report block reply bidensmissingbrain 2 points 2 days ago Because nations are still built on people and we are not contributing. Yea, because Bob and Courtney Methhead's spawn will be so much more contributing... permalink parent award report block reply noPTSDforMePlease 2 points 2 days ago Yeah. You're an evolutionary dead end and simply don't matter after you die. permalink parent award report block reply bidensmissingbrain 0 points 2 days ago And yet will contribute more than 2 generations with barely any effort. permalink parent award report block reply geckogreen 14 points 2 days ago It's not about giving people without kids the shaft, it is about incentivising people who do build families. permalink parent award report block reply joeblow2020 1 points 2 days ago That's right. No one is penalized...it's just an incentive for people with kids. People without kids get the benefit of not having to wipe poop off the walls and get to sleep for more than 2 hours. It seems like a win for everyone to me. permalink parent award report block reply Floppybutthole 1 points 1 day ago Well I would argue that income tax is very penalizing.     But I think society shouldn't be built around people with no kids.   I say this as someone who doesn't have any. permalink parent award report block reply Crappydatum 9 points 2 days ago People with kids have CONSIDERABLY more costs than people without permalink parent award report block reply suckmycorona 7 points 2 days ago Is that why I have to pay school taxes? To pay for your kids? permalink parent award report block reply dumb-but-not-stupid 2 points 2 days ago My wife homeschooled all of our 7 kids and paid for both the homeschool curriculum and the public school service through my taxes as the soul provider. You're only paying once and not even replacing yourself numerically in society. permalink parent award report block reply joeblow2020 2 points 2 days ago Wow...that's awesome. I can't imagine homeschooling 7 kids, but I'm really glad that some people can. Good job! permalink parent award report block reply suckmycorona 1 points 2 days ago Please don’t assume.  Maybe I’m young and not married or maybe I’m old but the point as you clearly illustrated you’re paying for a service you don’t use for others to benefit.  So yes I agree I don’t like socialism. permalink parent award report block reply SimaYi 2 points 2 days ago Don't like it? Go start your own country with no kids. permalink parent award report block reply Floppybutthole 1 points 1 day ago Lol it will be an immigrants paradise permalink parent award report block reply The_Emperor 2 points 2 days ago You pay school taxes so that the Elevator at your hotel works, the food you buy is properly handled, the dentist can spell your name correctly. The alternative is living in a Hatian level sea of ignorance permalink parent award report block reply suckmycorona 1 points 2 days ago Dumbest shit I’ve ever read.  They’re not my kids.  Pay for your own kids. permalink parent award report block reply view 3 more comments... YaharaRiver 1 points 2 days ago Old folks pay them too, people who pay tuition at private school, couples whose kids aren’t born yet, even people whose kids just graduated. Not just people with no kids. Everybody pays for the children sitting at their desks. Quit whining. permalink parent award report block reply suckmycorona 2 points 2 days ago Bet you whin about taxes.  School taxes for people without kids is socialism.  But I bet you are only against “real socialism”” permalink parent award report block reply view 3 more comments... suckmycorona 6 points 2 days ago Shut up and pay your school taxes.  Racist.  /s permalink parent award report block reply Awakened 4 points 2 days ago All income tax is theft. permalink parent award report block reply load 4 more comments... Awakened 6 points 2 days ago Jesus I see what you've done for others meme permalink award report block reply Lol_Garrus 5 points 2 days ago Polish people only. Married couples only. No fags. permalink award report block reply Mcrumples 4 points 2 days ago I would love something similar here, but can already see a discrimination lawsuit from 100 miles away, based on infertile/trouble conceiving couples. They WANT to have kids, but cannot, due to biological characteristics (or unknown). But that's gonna be the argument - we've been trying for years, no luck, and it's unexplained aka not our fault. Discrimination - gimme the gibs. permalink award report block reply Crappydatum 8 points 2 days ago They've been feeding you infertility drugs for years don't be surprised. permalink parent award report block reply Magma_Biscuit 4 points 2 days ago Yes this is a huge part of the problem for a few decades now, it’s not by choice in our case permalink parent award report block reply Crappydatum 6 points 2 days ago Years of \"the pill\" usage lowering women's fertility while at the same time, an unknown number of vectors lowering men's sperm count. It's almost a miracle American born women can have children permalink parent award report block reply Magma_Biscuit 4 points 2 days ago Yes the trend makes it looks like a targeted approach starting when children were very young. Maybe a conspiracy, but the trends really do speak for themselves. permalink parent award report block reply carpetxparmesan 1 points 2 days ago Yeah... but ... devil's advocate... so does age. KEK You use use the pill, you age, nature takes its course. Could there be more to it? Sure. Does there need to be? No. Every year you don't reproduce, look up the stats on what happens. What happens to you, your child, the chances that they develop incorrectly or have mutations or genetic errors. Every year you're on the pill, is a year you haven't reproduced, is another year under your belt, another category of risk. Every year. Tick tock. The clock runs out. permalink parent award report block reply Crappydatum 1 points 1 day ago I suspect it was all part of the plan. True believers ala The Club of Rome, decided murdering the next generation was somehow beneficial to \"humanity\". It was a multi pronged assault. permalink parent award report block reply Magma_Biscuit 3 points 2 days ago There are more and more couples in this same predicament, and yes it is discrimination against them. Being one such couple it gets old paying taxes for other peoples kids permalink parent award report block reply SimaYi 3 points 2 days ago American women are infertile because they fuck up their bodies by being road whores and then want to have kids at 37 years old. permalink parent award report block reply Floppybutthole 2 points 1 day ago \"I'm 37 and I'm ready to settle down with any man who is 6ft makes six figures and has a 6 pack\" permalink parent award report block reply cuhboose 2 points 2 days ago It's not discrimination, you just don't want to go through the efforts to have kids in the house. There are plenty up for adoption/foster care if you wanted to raise kids. If two guys can get a kid, I don't see why you have a problem. permalink parent award report block reply Magma_Biscuit 5 points 2 days ago This is true but how many couples can go through envitro at 30k a pop? Also why does it cost almost as much to adopt also. Not everyone has that much spare cash on hand permalink parent award report block reply carpetxparmesan 1 points 2 days ago Have you heard of a turkey baster? Separate and find a functional partner. Who gives a shit if your nuts or womb don't work? permalink parent award report block reply cuhboose 1 points 2 days ago So then add on the incentives and make it either really cheap or far more affordable? And for adoption if you are approved, it shouldn't cost you a dime except maybe a starting amount that is locked to make sure the kid is provided for (bed etc), shouldn't be the nonsense of 30k. permalink parent award report block reply view 1 more comments... carpetxparmesan 0 points 2 days ago True. And the courts should have the guts to say it's not, because it's not. More to the point, income tax shouldn't even be a thing and this should not be a problem. Nobody can tariff you for not having kids - and nobody should. You don't have kids, you buy less shit, you actually get less impositions. You WIN money, if that's what you choose to do. But, though conception is difficult for many, how many REALLY have the problem? Less than 10%. Less than 3% if you count viable alternatives in cases where only one of the pair is unable to conceive. In all reality, it's a problem that affects less than 1% of people. It's a ridiculous notion, that you need to worry about some defectives, bless you, we still love you even though you malfunctioned. What, now, we have to orient society around those whose bodies are broken? You orient society around those who engage in monogamous reproduction. Not the defective. Not the perverts. Not the lazy. Not the brainwashed. Not any of that junk. You orient society around the mother, the father, and the children who will grow up to be the blood of your nation. permalink parent award report block reply SimaYi 2 points 2 days ago I would like it here too, but only for White people. permalink parent award report block reply YaharaRiver 4 points 2 days ago Beautiful family, wow what a portrait. permalink award report block reply bidensmissingbrain 3 points 2 days ago For a second I thought it said Portland... permalink award report block reply barwhack 3 points 2 days ago Russia and Poland may shortly be the only White countries. 20 years. permalink award report block reply Easzq8 2 points 2 days ago I don’t think this will convince women to start families. On the end of Feminism will do that. permalink award report block reply TerrorAndSlaughter 2 points 2 days ago They are in bad shape for it to kick in with a mere two kids.  That is a low bar.  At least subsidize population growth. permalink award report block reply YaharaRiver 3 points 2 days ago Huh? It sounds like they are in great shape if they can offer an incentive for just two kids.  That’s a lot of families!  Now they can reward people, lots of them! permalink parent award report block reply carpetxparmesan 1 points 2 days ago They don't have LAND for more kids. You been to any of these places? It's tighter than a nun's asshole. And has been for 1000 years. permalink parent award report block reply DudeNoOne 2 points 2 days ago Based permalink award report block reply MAGALADON9 1 points 2 days ago Bonuses for 3rd and 4th permalink award report block reply NoMaskNoMaster 1 points 1 day ago THETE MUST BE A STIPULATION THAT ITS FOR ETHNIC POLES ONLY!! permalink award report block reply that1guy1981 1 points 1 day ago When I see the way thats worded I cant help but think it must really suck to accidentally have that third child. permalink award report block reply lifeisahologram 1 points 2 days ago I dont think income tax should exist so this is good either way. But if you are doing it with the purpose of promoting families shouldn’t it be above replacement, maybe 3 minimum? permalink award report block reply keeman 1 points 1 day ago Or just make tax zero and stop propagandizing women to think they require a career. permalink award report block reply\nRoadpower 60 points 2 days ago I hope that is restricted to actual Polish people. permalink award report block reply Bullet3250 26 points 2 days ago All of Eastern Europe should do this. permalink parent award report block reply Roadpower 20 points 2 days ago Every European nation, they're in a global minority. They should have less than zero shame about this. permalink parent award report block reply Bullet3250 9 points 2 days ago Western Europe has to instigation FULL REMIGRATION first.  None Europeans have to get that free ride back home. permalink parent award report block reply MAGALADON9 5 points 2 days ago Full remigration Then isolation. I literally hope they eat each other permalink parent award report block reply RedCapNation 3 points 2 days ago And the USA. But only if your family was here pre immigration act. permalink parent award report block reply TerrorAndSlaughter 17 points 2 days ago Poland is almost entirely Polish.  Even their minorities are groups like Silesian(a region in Poland).  I think the biggest non-Polish group are Ukrainian. permalink parent award report block reply Roadpower 7 points 2 days ago Good to hear. permalink parent award report block reply South_Florida_Guy 8 points 2 days ago And 100% WHITE children only permalink parent award report block reply TiggerLovingPooh 5 points 2 days ago Exactly. Leftists would suddenly implement these programs and ban abortion right after they flood White countries with millions of foreigners. permalink parent award report block reply patrioticwinning3 5 points 2 days ago And only if they stay married and the dad is the dad of all children! permalink parent award report block reply load 1 more comments...\nBullet3250 26 points 2 days ago All of Eastern Europe should do this. permalink parent award report block reply Roadpower 20 points 2 days ago Every European nation, they're in a global minority. They should have less than zero shame about this. permalink parent award report block reply Bullet3250 9 points 2 days ago Western Europe has to instigation FULL REMIGRATION first.  None Europeans have to get that free ride back home. permalink parent award report block reply MAGALADON9 5 points 2 days ago Full remigration Then isolation. I literally hope they eat each other permalink parent award report block reply RedCapNation 3 points 2 days ago And the USA. But only if your family was here pre immigration act. permalink parent award report block reply\nRoadpower 20 points 2 days ago Every European nation, they're in a global minority. They should have less than zero shame about this. permalink parent award report block reply Bullet3250 9 points 2 days ago Western Europe has to instigation FULL REMIGRATION first.  None Europeans have to get that free ride back home. permalink parent award report block reply MAGALADON9 5 points 2 days ago Full remigration Then isolation. I literally hope they eat each other permalink parent award report block reply\nBullet3250 9 points 2 days ago Western Europe has to instigation FULL REMIGRATION first.  None Europeans have to get that free ride back home. permalink parent award report block reply MAGALADON9 5 points 2 days ago Full remigration Then isolation. I literally hope they eat each other permalink parent award report block reply\nMAGALADON9 5 points 2 days ago Full remigration Then isolation. I literally hope they eat each other permalink parent award report block reply\nRedCapNation 3 points 2 days ago And the USA. But only if your family was here pre immigration act. permalink parent award report block reply\nTerrorAndSlaughter 17 points 2 days ago Poland is almost entirely Polish.  Even their minorities are groups like Silesian(a region in Poland).  I think the biggest non-Polish group are Ukrainian. permalink parent award report block reply Roadpower 7 points 2 days ago Good to hear. permalink parent award report block reply\nRoadpower 7 points 2 days ago Good to hear. permalink parent award report block reply\nSouth_Florida_Guy 8 points 2 days ago And 100% WHITE children only permalink parent award report block reply\nTiggerLovingPooh 5 points 2 days ago Exactly. Leftists would suddenly implement these programs and ban abortion right after they flood White countries with millions of foreigners. permalink parent award report block reply\npatrioticwinning3 5 points 2 days ago And only if they stay married and the dad is the dad of all children! permalink parent award report block reply\nBullet3250 23 points 2 days ago This is how you do it. permalink award report block reply Votingnerd 5 points 2 days ago Didnt the Austrian painter implement something similar permalink parent award report block reply Datamancer 8 points 2 days ago Well, he also painted so I guess we need to outlaw that too. permalink parent award report block reply carpetxparmesan 0 points 2 days ago He hated christianity. And anything he may have done positive, he wiped out by allowing his cities to be burned and his people to be killed defending the indefensible. He was a socialist. And not a particularly good one at that. Thanks to him, a once proud people wallow in an even worse socialist fetor than his own, too scared to teach their own history to their children so they can sacrifice those children's minds to globohomo. He was retarded. He had so little faith in his own people that he thought the world would choke his country even though they were #1 in almost every important field of industry and science: chemistry, metallurgy, physics, logistics, manufacturing, engineering. They're still either #1, #2 or top 5 in almost every field that counts, excepting maybe they don't make as much money as they could, though they punch above their weight in that category too. And, even for their lowest classes, even today, they fare better than most of europe. The world could no more choke german industry than german people could stop excelling at chemistry and warfare. He was a bitter mental midget with a lot of charisma. He could have chosen freedom and instead he chose socialism. Fucking retarded. He probably would have unlocked fusion by now if his retarded ass hadn't forced the world to gang up on him and Americans to find clever ways to lead him down the wrong path. If he would have just not existed, left his people to struggle into the future, they would have advanced twice as fast as they already did. And they ALREADY control europe without having fired ONE shot. Guy was a perfect example that sometimes, often-times, the best move is not to play, not to interfere, not to act in any way whatsoever. When confronted with a problem, sometimes the best solution is to not take your turn, to fast-forward the game and see what develops in your current path. That's what voters and governments often don't understand and just can't wrap their minds around the concept. Disease, famine, poverty, sometimes the winning move is to just... keep your hands off. Because any play you make, you will make things worse and prevent the magic of the markets from working. Boohoo, you got injured in a war. Big deal. You had the best chemists, the best mathematicians, the best universities, and you burn it down for what? A worse version, a gayer version of yourself to take over and destroy anything you valued? Even hitler would be ashamed of the faggots leading Germany today and he wasn't a prime example of humanity himself. Just... more charismatic than your average bear. permalink parent award report block reply Votingnerd 1 points 1 day ago Me thinks he doth protest too much! permalink parent award report block reply carpetxparmesan 1 points 22 hours ago Sure. Keep sucking a socialist's dick, that'll make you alright. permalink parent award report block reply snoopy3210 3 points 2 days ago No. For mothers only. And for 3 children and up. You can reduce taxes for 2 to motivate gradually towards 3 permalink parent award report block reply MaxineWaters4Prez 2 points 2 days ago Married couples with two or more children. Incentivize families remaining intact. permalink parent award report block reply\nVotingnerd 5 points 2 days ago Didnt the Austrian painter implement something similar permalink parent award report block reply Datamancer 8 points 2 days ago Well, he also painted so I guess we need to outlaw that too. permalink parent award report block reply carpetxparmesan 0 points 2 days ago He hated christianity. And anything he may have done positive, he wiped out by allowing his cities to be burned and his people to be killed defending the indefensible. He was a socialist. And not a particularly good one at that. Thanks to him, a once proud people wallow in an even worse socialist fetor than his own, too scared to teach their own history to their children so they can sacrifice those children's minds to globohomo. He was retarded. He had so little faith in his own people that he thought the world would choke his country even though they were #1 in almost every important field of industry and science: chemistry, metallurgy, physics, logistics, manufacturing, engineering. They're still either #1, #2 or top 5 in almost every field that counts, excepting maybe they don't make as much money as they could, though they punch above their weight in that category too. And, even for their lowest classes, even today, they fare better than most of europe. The world could no more choke german industry than german people could stop excelling at chemistry and warfare. He was a bitter mental midget with a lot of charisma. He could have chosen freedom and instead he chose socialism. Fucking retarded. He probably would have unlocked fusion by now if his retarded ass hadn't forced the world to gang up on him and Americans to find clever ways to lead him down the wrong path. If he would have just not existed, left his people to struggle into the future, they would have advanced twice as fast as they already did. And they ALREADY control europe without having fired ONE shot. Guy was a perfect example that sometimes, often-times, the best move is not to play, not to interfere, not to act in any way whatsoever. When confronted with a problem, sometimes the best solution is to not take your turn, to fast-forward the game and see what develops in your current path. That's what voters and governments often don't understand and just can't wrap their minds around the concept. Disease, famine, poverty, sometimes the winning move is to just... keep your hands off. Because any play you make, you will make things worse and prevent the magic of the markets from working. Boohoo, you got injured in a war. Big deal. You had the best chemists, the best mathematicians, the best universities, and you burn it down for what? A worse version, a gayer version of yourself to take over and destroy anything you valued? Even hitler would be ashamed of the faggots leading Germany today and he wasn't a prime example of humanity himself. Just... more charismatic than your average bear. permalink parent award report block reply Votingnerd 1 points 1 day ago Me thinks he doth protest too much! permalink parent award report block reply carpetxparmesan 1 points 22 hours ago Sure. Keep sucking a socialist's dick, that'll make you alright. permalink parent award report block reply\nDatamancer 8 points 2 days ago Well, he also painted so I guess we need to outlaw that too. permalink parent award report block reply\ncarpetxparmesan 0 points 2 days ago He hated christianity. And anything he may have done positive, he wiped out by allowing his cities to be burned and his people to be killed defending the indefensible. He was a socialist. And not a particularly good one at that. Thanks to him, a once proud people wallow in an even worse socialist fetor than his own, too scared to teach their own history to their children so they can sacrifice those children's minds to globohomo. He was retarded. He had so little faith in his own people that he thought the world would choke his country even though they were #1 in almost every important field of industry and science: chemistry, metallurgy, physics, logistics, manufacturing, engineering. They're still either #1, #2 or top 5 in almost every field that counts, excepting maybe they don't make as much money as they could, though they punch above their weight in that category too. And, even for their lowest classes, even today, they fare better than most of europe. The world could no more choke german industry than german people could stop excelling at chemistry and warfare. He was a bitter mental midget with a lot of charisma. He could have chosen freedom and instead he chose socialism. Fucking retarded. He probably would have unlocked fusion by now if his retarded ass hadn't forced the world to gang up on him and Americans to find clever ways to lead him down the wrong path. If he would have just not existed, left his people to struggle into the future, they would have advanced twice as fast as they already did. And they ALREADY control europe without having fired ONE shot. Guy was a perfect example that sometimes, often-times, the best move is not to play, not to interfere, not to act in any way whatsoever. When confronted with a problem, sometimes the best solution is to not take your turn, to fast-forward the game and see what develops in your current path. That's what voters and governments often don't understand and just can't wrap their minds around the concept. Disease, famine, poverty, sometimes the winning move is to just... keep your hands off. Because any play you make, you will make things worse and prevent the magic of the markets from working. Boohoo, you got injured in a war. Big deal. You had the best chemists, the best mathematicians, the best universities, and you burn it down for what? A worse version, a gayer version of yourself to take over and destroy anything you valued? Even hitler would be ashamed of the faggots leading Germany today and he wasn't a prime example of humanity himself. Just... more charismatic than your average bear. permalink parent award report block reply Votingnerd 1 points 1 day ago Me thinks he doth protest too much! permalink parent award report block reply carpetxparmesan 1 points 22 hours ago Sure. Keep sucking a socialist's dick, that'll make you alright. permalink parent award report block reply\nVotingnerd 1 points 1 day ago Me thinks he doth protest too much! permalink parent award report block reply carpetxparmesan 1 points 22 hours ago Sure. Keep sucking a socialist's dick, that'll make you alright. permalink parent award report block reply\ncarpetxparmesan 1 points 22 hours ago Sure. Keep sucking a socialist's dick, that'll make you alright. permalink parent award report block reply\nsnoopy3210 3 points 2 days ago No. For mothers only. And for 3 children and up. You can reduce taxes for 2 to motivate gradually towards 3 permalink parent award report block reply\nMaxineWaters4Prez 2 points 2 days ago Married couples with two or more children. Incentivize families remaining intact. permalink parent award report block reply\nMagma_Biscuit 11 points 2 days ago Why do people without kids always get the shaft permalink award report block reply Datamancer 23 points 2 days ago Because nations are still built on people and we are not contributing. Personally I see no issue with this other than the possibility of fraud and bad actors, but that is possible with anything. permalink parent award report block reply politicsaside 4 points 2 days ago The only issue I have is that people with fertility issues should be penalized for a medical problem that’s not their fault. permalink parent award report block reply dumb-but-not-stupid 3 points 2 days ago Adopt. permalink parent award report block reply bidensmissingbrain 2 points 2 days ago Because nations are still built on people and we are not contributing. Yea, because Bob and Courtney Methhead's spawn will be so much more contributing... permalink parent award report block reply noPTSDforMePlease 2 points 2 days ago Yeah. You're an evolutionary dead end and simply don't matter after you die. permalink parent award report block reply bidensmissingbrain 0 points 2 days ago And yet will contribute more than 2 generations with barely any effort. permalink parent award report block reply geckogreen 14 points 2 days ago It's not about giving people without kids the shaft, it is about incentivising people who do build families. permalink parent award report block reply joeblow2020 1 points 2 days ago That's right. No one is penalized...it's just an incentive for people with kids. People without kids get the benefit of not having to wipe poop off the walls and get to sleep for more than 2 hours. It seems like a win for everyone to me. permalink parent award report block reply Floppybutthole 1 points 1 day ago Well I would argue that income tax is very penalizing.     But I think society shouldn't be built around people with no kids.   I say this as someone who doesn't have any. permalink parent award report block reply Crappydatum 9 points 2 days ago People with kids have CONSIDERABLY more costs than people without permalink parent award report block reply suckmycorona 7 points 2 days ago Is that why I have to pay school taxes? To pay for your kids? permalink parent award report block reply dumb-but-not-stupid 2 points 2 days ago My wife homeschooled all of our 7 kids and paid for both the homeschool curriculum and the public school service through my taxes as the soul provider. You're only paying once and not even replacing yourself numerically in society. permalink parent award report block reply joeblow2020 2 points 2 days ago Wow...that's awesome. I can't imagine homeschooling 7 kids, but I'm really glad that some people can. Good job! permalink parent award report block reply suckmycorona 1 points 2 days ago Please don’t assume.  Maybe I’m young and not married or maybe I’m old but the point as you clearly illustrated you’re paying for a service you don’t use for others to benefit.  So yes I agree I don’t like socialism. permalink parent award report block reply SimaYi 2 points 2 days ago Don't like it? Go start your own country with no kids. permalink parent award report block reply Floppybutthole 1 points 1 day ago Lol it will be an immigrants paradise permalink parent award report block reply The_Emperor 2 points 2 days ago You pay school taxes so that the Elevator at your hotel works, the food you buy is properly handled, the dentist can spell your name correctly. The alternative is living in a Hatian level sea of ignorance permalink parent award report block reply suckmycorona 1 points 2 days ago Dumbest shit I’ve ever read.  They’re not my kids.  Pay for your own kids. permalink parent award report block reply view 3 more comments... YaharaRiver 1 points 2 days ago Old folks pay them too, people who pay tuition at private school, couples whose kids aren’t born yet, even people whose kids just graduated. Not just people with no kids. Everybody pays for the children sitting at their desks. Quit whining. permalink parent award report block reply suckmycorona 2 points 2 days ago Bet you whin about taxes.  School taxes for people without kids is socialism.  But I bet you are only against “real socialism”” permalink parent award report block reply view 3 more comments... suckmycorona 6 points 2 days ago Shut up and pay your school taxes.  Racist.  /s permalink parent award report block reply Awakened 4 points 2 days ago All income tax is theft. permalink parent award report block reply load 4 more comments...\nDatamancer 23 points 2 days ago Because nations are still built on people and we are not contributing. Personally I see no issue with this other than the possibility of fraud and bad actors, but that is possible with anything. permalink parent award report block reply politicsaside 4 points 2 days ago The only issue I have is that people with fertility issues should be penalized for a medical problem that’s not their fault. permalink parent award report block reply dumb-but-not-stupid 3 points 2 days ago Adopt. permalink parent award report block reply bidensmissingbrain 2 points 2 days ago Because nations are still built on people and we are not contributing. Yea, because Bob and Courtney Methhead's spawn will be so much more contributing... permalink parent award report block reply noPTSDforMePlease 2 points 2 days ago Yeah. You're an evolutionary dead end and simply don't matter after you die. permalink parent award report block reply bidensmissingbrain 0 points 2 days ago And yet will contribute more than 2 generations with barely any effort. permalink parent award report block reply\npoliticsaside 4 points 2 days ago The only issue I have is that people with fertility issues should be penalized for a medical problem that’s not their fault. permalink parent award report block reply dumb-but-not-stupid 3 points 2 days ago Adopt. permalink parent award report block reply\ndumb-but-not-stupid 3 points 2 days ago Adopt. permalink parent award report block reply\nbidensmissingbrain 2 points 2 days ago Because nations are still built on people and we are not contributing. Yea, because Bob and Courtney Methhead's spawn will be so much more contributing... permalink parent award report block reply noPTSDforMePlease 2 points 2 days ago Yeah. You're an evolutionary dead end and simply don't matter after you die. permalink parent award report block reply bidensmissingbrain 0 points 2 days ago And yet will contribute more than 2 generations with barely any effort. permalink parent award report block reply\nnoPTSDforMePlease 2 points 2 days ago Yeah. You're an evolutionary dead end and simply don't matter after you die. permalink parent award report block reply bidensmissingbrain 0 points 2 days ago And yet will contribute more than 2 generations with barely any effort. permalink parent award report block reply\nbidensmissingbrain 0 points 2 days ago And yet will contribute more than 2 generations with barely any effort. permalink parent award report block reply\ngeckogreen 14 points 2 days ago It's not about giving people without kids the shaft, it is about incentivising people who do build families. permalink parent award report block reply joeblow2020 1 points 2 days ago That's right. No one is penalized...it's just an incentive for people with kids. People without kids get the benefit of not having to wipe poop off the walls and get to sleep for more than 2 hours. It seems like a win for everyone to me. permalink parent award report block reply Floppybutthole 1 points 1 day ago Well I would argue that income tax is very penalizing.     But I think society shouldn't be built around people with no kids.   I say this as someone who doesn't have any. permalink parent award report block reply\njoeblow2020 1 points 2 days ago That's right. No one is penalized...it's just an incentive for people with kids. People without kids get the benefit of not having to wipe poop off the walls and get to sleep for more than 2 hours. It seems like a win for everyone to me. permalink parent award report block reply Floppybutthole 1 points 1 day ago Well I would argue that income tax is very penalizing.     But I think society shouldn't be built around people with no kids.   I say this as someone who doesn't have any. permalink parent award report block reply\nFloppybutthole 1 points 1 day ago Well I would argue that income tax is very penalizing.     But I think society shouldn't be built around people with no kids.   I say this as someone who doesn't have any. permalink parent award report block reply\nCrappydatum 9 points 2 days ago People with kids have CONSIDERABLY more costs than people without permalink parent award report block reply suckmycorona 7 points 2 days ago Is that why I have to pay school taxes? To pay for your kids? permalink parent award report block reply dumb-but-not-stupid 2 points 2 days ago My wife homeschooled all of our 7 kids and paid for both the homeschool curriculum and the public school service through my taxes as the soul provider. You're only paying once and not even replacing yourself numerically in society. permalink parent award report block reply joeblow2020 2 points 2 days ago Wow...that's awesome. I can't imagine homeschooling 7 kids, but I'm really glad that some people can. Good job! permalink parent award report block reply suckmycorona 1 points 2 days ago Please don’t assume.  Maybe I’m young and not married or maybe I’m old but the point as you clearly illustrated you’re paying for a service you don’t use for others to benefit.  So yes I agree I don’t like socialism. permalink parent award report block reply SimaYi 2 points 2 days ago Don't like it? Go start your own country with no kids. permalink parent award report block reply Floppybutthole 1 points 1 day ago Lol it will be an immigrants paradise permalink parent award report block reply The_Emperor 2 points 2 days ago You pay school taxes so that the Elevator at your hotel works, the food you buy is properly handled, the dentist can spell your name correctly. The alternative is living in a Hatian level sea of ignorance permalink parent award report block reply suckmycorona 1 points 2 days ago Dumbest shit I’ve ever read.  They’re not my kids.  Pay for your own kids. permalink parent award report block reply view 3 more comments... YaharaRiver 1 points 2 days ago Old folks pay them too, people who pay tuition at private school, couples whose kids aren’t born yet, even people whose kids just graduated. Not just people with no kids. Everybody pays for the children sitting at their desks. Quit whining. permalink parent award report block reply suckmycorona 2 points 2 days ago Bet you whin about taxes.  School taxes for people without kids is socialism.  But I bet you are only against “real socialism”” permalink parent award report block reply view 3 more comments...\nsuckmycorona 7 points 2 days ago Is that why I have to pay school taxes? To pay for your kids? permalink parent award report block reply dumb-but-not-stupid 2 points 2 days ago My wife homeschooled all of our 7 kids and paid for both the homeschool curriculum and the public school service through my taxes as the soul provider. You're only paying once and not even replacing yourself numerically in society. permalink parent award report block reply joeblow2020 2 points 2 days ago Wow...that's awesome. I can't imagine homeschooling 7 kids, but I'm really glad that some people can. Good job! permalink parent award report block reply suckmycorona 1 points 2 days ago Please don’t assume.  Maybe I’m young and not married or maybe I’m old but the point as you clearly illustrated you’re paying for a service you don’t use for others to benefit.  So yes I agree I don’t like socialism. permalink parent award report block reply SimaYi 2 points 2 days ago Don't like it? Go start your own country with no kids. permalink parent award report block reply Floppybutthole 1 points 1 day ago Lol it will be an immigrants paradise permalink parent award report block reply The_Emperor 2 points 2 days ago You pay school taxes so that the Elevator at your hotel works, the food you buy is properly handled, the dentist can spell your name correctly. The alternative is living in a Hatian level sea of ignorance permalink parent award report block reply suckmycorona 1 points 2 days ago Dumbest shit I’ve ever read.  They’re not my kids.  Pay for your own kids. permalink parent award report block reply view 3 more comments... YaharaRiver 1 points 2 days ago Old folks pay them too, people who pay tuition at private school, couples whose kids aren’t born yet, even people whose kids just graduated. Not just people with no kids. Everybody pays for the children sitting at their desks. Quit whining. permalink parent award report block reply suckmycorona 2 points 2 days ago Bet you whin about taxes.  School taxes for people without kids is socialism.  But I bet you are only against “real socialism”” permalink parent award report block reply view 3 more comments...\ndumb-but-not-stupid 2 points 2 days ago My wife homeschooled all of our 7 kids and paid for both the homeschool curriculum and the public school service through my taxes as the soul provider. You're only paying once and not even replacing yourself numerically in society. permalink parent award report block reply joeblow2020 2 points 2 days ago Wow...that's awesome. I can't imagine homeschooling 7 kids, but I'm really glad that some people can. Good job! permalink parent award report block reply suckmycorona 1 points 2 days ago Please don’t assume.  Maybe I’m young and not married or maybe I’m old but the point as you clearly illustrated you’re paying for a service you don’t use for others to benefit.  So yes I agree I don’t like socialism. permalink parent award report block reply\njoeblow2020 2 points 2 days ago Wow...that's awesome. I can't imagine homeschooling 7 kids, but I'm really glad that some people can. Good job! permalink parent award report block reply\nsuckmycorona 1 points 2 days ago Please don’t assume.  Maybe I’m young and not married or maybe I’m old but the point as you clearly illustrated you’re paying for a service you don’t use for others to benefit.  So yes I agree I don’t like socialism. permalink parent award report block reply\nSimaYi 2 points 2 days ago Don't like it? Go start your own country with no kids. permalink parent award report block reply Floppybutthole 1 points 1 day ago Lol it will be an immigrants paradise permalink parent award report block reply\nFloppybutthole 1 points 1 day ago Lol it will be an immigrants paradise permalink parent award report block reply\nThe_Emperor 2 points 2 days ago You pay school taxes so that the Elevator at your hotel works, the food you buy is properly handled, the dentist can spell your name correctly. The alternative is living in a Hatian level sea of ignorance permalink parent award report block reply suckmycorona 1 points 2 days ago Dumbest shit I’ve ever read.  They’re not my kids.  Pay for your own kids. permalink parent award report block reply view 3 more comments...\nsuckmycorona 1 points 2 days ago Dumbest shit I’ve ever read.  They’re not my kids.  Pay for your own kids. permalink parent award report block reply view 3 more comments...\nYaharaRiver 1 points 2 days ago Old folks pay them too, people who pay tuition at private school, couples whose kids aren’t born yet, even people whose kids just graduated. Not just people with no kids. Everybody pays for the children sitting at their desks. Quit whining. permalink parent award report block reply suckmycorona 2 points 2 days ago Bet you whin about taxes.  School taxes for people without kids is socialism.  But I bet you are only against “real socialism”” permalink parent award report block reply view 3 more comments...\nsuckmycorona 2 points 2 days ago Bet you whin about taxes.  School taxes for people without kids is socialism.  But I bet you are only against “real socialism”” permalink parent award report block reply view 3 more comments...\nsuckmycorona 6 points 2 days ago Shut up and pay your school taxes.  Racist.  /s permalink parent award report block reply\nAwakened 4 points 2 days ago All income tax is theft. permalink parent award report block reply\nAwakened 6 points 2 days ago Jesus I see what you've done for others meme permalink award report block reply\nLol_Garrus 5 points 2 days ago Polish people only. Married couples only. No fags. permalink award report block reply\nMcrumples 4 points 2 days ago I would love something similar here, but can already see a discrimination lawsuit from 100 miles away, based on infertile/trouble conceiving couples. They WANT to have kids, but cannot, due to biological characteristics (or unknown). But that's gonna be the argument - we've been trying for years, no luck, and it's unexplained aka not our fault. Discrimination - gimme the gibs. permalink award report block reply Crappydatum 8 points 2 days ago They've been feeding you infertility drugs for years don't be surprised. permalink parent award report block reply Magma_Biscuit 4 points 2 days ago Yes this is a huge part of the problem for a few decades now, it’s not by choice in our case permalink parent award report block reply Crappydatum 6 points 2 days ago Years of \"the pill\" usage lowering women's fertility while at the same time, an unknown number of vectors lowering men's sperm count. It's almost a miracle American born women can have children permalink parent award report block reply Magma_Biscuit 4 points 2 days ago Yes the trend makes it looks like a targeted approach starting when children were very young. Maybe a conspiracy, but the trends really do speak for themselves. permalink parent award report block reply carpetxparmesan 1 points 2 days ago Yeah... but ... devil's advocate... so does age. KEK You use use the pill, you age, nature takes its course. Could there be more to it? Sure. Does there need to be? No. Every year you don't reproduce, look up the stats on what happens. What happens to you, your child, the chances that they develop incorrectly or have mutations or genetic errors. Every year you're on the pill, is a year you haven't reproduced, is another year under your belt, another category of risk. Every year. Tick tock. The clock runs out. permalink parent award report block reply Crappydatum 1 points 1 day ago I suspect it was all part of the plan. True believers ala The Club of Rome, decided murdering the next generation was somehow beneficial to \"humanity\". It was a multi pronged assault. permalink parent award report block reply Magma_Biscuit 3 points 2 days ago There are more and more couples in this same predicament, and yes it is discrimination against them. Being one such couple it gets old paying taxes for other peoples kids permalink parent award report block reply SimaYi 3 points 2 days ago American women are infertile because they fuck up their bodies by being road whores and then want to have kids at 37 years old. permalink parent award report block reply Floppybutthole 2 points 1 day ago \"I'm 37 and I'm ready to settle down with any man who is 6ft makes six figures and has a 6 pack\" permalink parent award report block reply cuhboose 2 points 2 days ago It's not discrimination, you just don't want to go through the efforts to have kids in the house. There are plenty up for adoption/foster care if you wanted to raise kids. If two guys can get a kid, I don't see why you have a problem. permalink parent award report block reply Magma_Biscuit 5 points 2 days ago This is true but how many couples can go through envitro at 30k a pop? Also why does it cost almost as much to adopt also. Not everyone has that much spare cash on hand permalink parent award report block reply carpetxparmesan 1 points 2 days ago Have you heard of a turkey baster? Separate and find a functional partner. Who gives a shit if your nuts or womb don't work? permalink parent award report block reply cuhboose 1 points 2 days ago So then add on the incentives and make it either really cheap or far more affordable? And for adoption if you are approved, it shouldn't cost you a dime except maybe a starting amount that is locked to make sure the kid is provided for (bed etc), shouldn't be the nonsense of 30k. permalink parent award report block reply view 1 more comments... carpetxparmesan 0 points 2 days ago True. And the courts should have the guts to say it's not, because it's not. More to the point, income tax shouldn't even be a thing and this should not be a problem. Nobody can tariff you for not having kids - and nobody should. You don't have kids, you buy less shit, you actually get less impositions. You WIN money, if that's what you choose to do. But, though conception is difficult for many, how many REALLY have the problem? Less than 10%. Less than 3% if you count viable alternatives in cases where only one of the pair is unable to conceive. In all reality, it's a problem that affects less than 1% of people. It's a ridiculous notion, that you need to worry about some defectives, bless you, we still love you even though you malfunctioned. What, now, we have to orient society around those whose bodies are broken? You orient society around those who engage in monogamous reproduction. Not the defective. Not the perverts. Not the lazy. Not the brainwashed. Not any of that junk. You orient society around the mother, the father, and the children who will grow up to be the blood of your nation. permalink parent award report block reply SimaYi 2 points 2 days ago I would like it here too, but only for White people. permalink parent award report block reply\nCrappydatum 8 points 2 days ago They've been feeding you infertility drugs for years don't be surprised. permalink parent award report block reply Magma_Biscuit 4 points 2 days ago Yes this is a huge part of the problem for a few decades now, it’s not by choice in our case permalink parent award report block reply Crappydatum 6 points 2 days ago Years of \"the pill\" usage lowering women's fertility while at the same time, an unknown number of vectors lowering men's sperm count. It's almost a miracle American born women can have children permalink parent award report block reply Magma_Biscuit 4 points 2 days ago Yes the trend makes it looks like a targeted approach starting when children were very young. Maybe a conspiracy, but the trends really do speak for themselves. permalink parent award report block reply carpetxparmesan 1 points 2 days ago Yeah... but ... devil's advocate... so does age. KEK You use use the pill, you age, nature takes its course. Could there be more to it? Sure. Does there need to be? No. Every year you don't reproduce, look up the stats on what happens. What happens to you, your child, the chances that they develop incorrectly or have mutations or genetic errors. Every year you're on the pill, is a year you haven't reproduced, is another year under your belt, another category of risk. Every year. Tick tock. The clock runs out. permalink parent award report block reply Crappydatum 1 points 1 day ago I suspect it was all part of the plan. True believers ala The Club of Rome, decided murdering the next generation was somehow beneficial to \"humanity\". It was a multi pronged assault. permalink parent award report block reply\nMagma_Biscuit 4 points 2 days ago Yes this is a huge part of the problem for a few decades now, it’s not by choice in our case permalink parent award report block reply Crappydatum 6 points 2 days ago Years of \"the pill\" usage lowering women's fertility while at the same time, an unknown number of vectors lowering men's sperm count. It's almost a miracle American born women can have children permalink parent award report block reply Magma_Biscuit 4 points 2 days ago Yes the trend makes it looks like a targeted approach starting when children were very young. Maybe a conspiracy, but the trends really do speak for themselves. permalink parent award report block reply carpetxparmesan 1 points 2 days ago Yeah... but ... devil's advocate... so does age. KEK You use use the pill, you age, nature takes its course. Could there be more to it? Sure. Does there need to be? No. Every year you don't reproduce, look up the stats on what happens. What happens to you, your child, the chances that they develop incorrectly or have mutations or genetic errors. Every year you're on the pill, is a year you haven't reproduced, is another year under your belt, another category of risk. Every year. Tick tock. The clock runs out. permalink parent award report block reply Crappydatum 1 points 1 day ago I suspect it was all part of the plan. True believers ala The Club of Rome, decided murdering the next generation was somehow beneficial to \"humanity\". It was a multi pronged assault. permalink parent award report block reply\nCrappydatum 6 points 2 days ago Years of \"the pill\" usage lowering women's fertility while at the same time, an unknown number of vectors lowering men's sperm count. It's almost a miracle American born women can have children permalink parent award report block reply Magma_Biscuit 4 points 2 days ago Yes the trend makes it looks like a targeted approach starting when children were very young. Maybe a conspiracy, but the trends really do speak for themselves. permalink parent award report block reply carpetxparmesan 1 points 2 days ago Yeah... but ... devil's advocate... so does age. KEK You use use the pill, you age, nature takes its course. Could there be more to it? Sure. Does there need to be? No. Every year you don't reproduce, look up the stats on what happens. What happens to you, your child, the chances that they develop incorrectly or have mutations or genetic errors. Every year you're on the pill, is a year you haven't reproduced, is another year under your belt, another category of risk. Every year. Tick tock. The clock runs out. permalink parent award report block reply\nMagma_Biscuit 4 points 2 days ago Yes the trend makes it looks like a targeted approach starting when children were very young. Maybe a conspiracy, but the trends really do speak for themselves. permalink parent award report block reply\ncarpetxparmesan 1 points 2 days ago Yeah... but ... devil's advocate... so does age. KEK You use use the pill, you age, nature takes its course. Could there be more to it? Sure. Does there need to be? No. Every year you don't reproduce, look up the stats on what happens. What happens to you, your child, the chances that they develop incorrectly or have mutations or genetic errors. Every year you're on the pill, is a year you haven't reproduced, is another year under your belt, another category of risk. Every year. Tick tock. The clock runs out. permalink parent award report block reply\nCrappydatum 1 points 1 day ago I suspect it was all part of the plan. True believers ala The Club of Rome, decided murdering the next generation was somehow beneficial to \"humanity\". It was a multi pronged assault. permalink parent award report block reply\nMagma_Biscuit 3 points 2 days ago There are more and more couples in this same predicament, and yes it is discrimination against them. Being one such couple it gets old paying taxes for other peoples kids permalink parent award report block reply SimaYi 3 points 2 days ago American women are infertile because they fuck up their bodies by being road whores and then want to have kids at 37 years old. permalink parent award report block reply Floppybutthole 2 points 1 day ago \"I'm 37 and I'm ready to settle down with any man who is 6ft makes six figures and has a 6 pack\" permalink parent award report block reply cuhboose 2 points 2 days ago It's not discrimination, you just don't want to go through the efforts to have kids in the house. There are plenty up for adoption/foster care if you wanted to raise kids. If two guys can get a kid, I don't see why you have a problem. permalink parent award report block reply Magma_Biscuit 5 points 2 days ago This is true but how many couples can go through envitro at 30k a pop? Also why does it cost almost as much to adopt also. Not everyone has that much spare cash on hand permalink parent award report block reply carpetxparmesan 1 points 2 days ago Have you heard of a turkey baster? Separate and find a functional partner. Who gives a shit if your nuts or womb don't work? permalink parent award report block reply cuhboose 1 points 2 days ago So then add on the incentives and make it either really cheap or far more affordable? And for adoption if you are approved, it shouldn't cost you a dime except maybe a starting amount that is locked to make sure the kid is provided for (bed etc), shouldn't be the nonsense of 30k. permalink parent award report block reply view 1 more comments... carpetxparmesan 0 points 2 days ago True. And the courts should have the guts to say it's not, because it's not. More to the point, income tax shouldn't even be a thing and this should not be a problem. Nobody can tariff you for not having kids - and nobody should. You don't have kids, you buy less shit, you actually get less impositions. You WIN money, if that's what you choose to do. But, though conception is difficult for many, how many REALLY have the problem? Less than 10%. Less than 3% if you count viable alternatives in cases where only one of the pair is unable to conceive. In all reality, it's a problem that affects less than 1% of people. It's a ridiculous notion, that you need to worry about some defectives, bless you, we still love you even though you malfunctioned. What, now, we have to orient society around those whose bodies are broken? You orient society around those who engage in monogamous reproduction. Not the defective. Not the perverts. Not the lazy. Not the brainwashed. Not any of that junk. You orient society around the mother, the father, and the children who will grow up to be the blood of your nation. permalink parent award report block reply\nSimaYi 3 points 2 days ago American women are infertile because they fuck up their bodies by being road whores and then want to have kids at 37 years old. permalink parent award report block reply Floppybutthole 2 points 1 day ago \"I'm 37 and I'm ready to settle down with any man who is 6ft makes six figures and has a 6 pack\" permalink parent award report block reply\nFloppybutthole 2 points 1 day ago \"I'm 37 and I'm ready to settle down with any man who is 6ft makes six figures and has a 6 pack\" permalink parent award report block reply\ncuhboose 2 points 2 days ago It's not discrimination, you just don't want to go through the efforts to have kids in the house. There are plenty up for adoption/foster care if you wanted to raise kids. If two guys can get a kid, I don't see why you have a problem. permalink parent award report block reply Magma_Biscuit 5 points 2 days ago This is true but how many couples can go through envitro at 30k a pop? Also why does it cost almost as much to adopt also. Not everyone has that much spare cash on hand permalink parent award report block reply carpetxparmesan 1 points 2 days ago Have you heard of a turkey baster? Separate and find a functional partner. Who gives a shit if your nuts or womb don't work? permalink parent award report block reply cuhboose 1 points 2 days ago So then add on the incentives and make it either really cheap or far more affordable? And for adoption if you are approved, it shouldn't cost you a dime except maybe a starting amount that is locked to make sure the kid is provided for (bed etc), shouldn't be the nonsense of 30k. permalink parent award report block reply view 1 more comments...\nMagma_Biscuit 5 points 2 days ago This is true but how many couples can go through envitro at 30k a pop? Also why does it cost almost as much to adopt also. Not everyone has that much spare cash on hand permalink parent award report block reply carpetxparmesan 1 points 2 days ago Have you heard of a turkey baster? Separate and find a functional partner. Who gives a shit if your nuts or womb don't work? permalink parent award report block reply cuhboose 1 points 2 days ago So then add on the incentives and make it either really cheap or far more affordable? And for adoption if you are approved, it shouldn't cost you a dime except maybe a starting amount that is locked to make sure the kid is provided for (bed etc), shouldn't be the nonsense of 30k. permalink parent award report block reply view 1 more comments...\ncarpetxparmesan 1 points 2 days ago Have you heard of a turkey baster? Separate and find a functional partner. Who gives a shit if your nuts or womb don't work? permalink parent award report block reply\ncuhboose 1 points 2 days ago So then add on the incentives and make it either really cheap or far more affordable? And for adoption if you are approved, it shouldn't cost you a dime except maybe a starting amount that is locked to make sure the kid is provided for (bed etc), shouldn't be the nonsense of 30k. permalink parent award report block reply view 1 more comments...\ncarpetxparmesan 0 points 2 days ago True. And the courts should have the guts to say it's not, because it's not. More to the point, income tax shouldn't even be a thing and this should not be a problem. Nobody can tariff you for not having kids - and nobody should. You don't have kids, you buy less shit, you actually get less impositions. You WIN money, if that's what you choose to do. But, though conception is difficult for many, how many REALLY have the problem? Less than 10%. Less than 3% if you count viable alternatives in cases where only one of the pair is unable to conceive. In all reality, it's a problem that affects less than 1% of people. It's a ridiculous notion, that you need to worry about some defectives, bless you, we still love you even though you malfunctioned. What, now, we have to orient society around those whose bodies are broken? You orient society around those who engage in monogamous reproduction. Not the defective. Not the perverts. Not the lazy. Not the brainwashed. Not any of that junk. You orient society around the mother, the father, and the children who will grow up to be the blood of your nation. permalink parent award report block reply\nSimaYi 2 points 2 days ago I would like it here too, but only for White people. permalink parent award report block reply\nYaharaRiver 4 points 2 days ago Beautiful family, wow what a portrait. permalink award report block reply\nbidensmissingbrain 3 points 2 days ago For a second I thought it said Portland... permalink award report block reply\nbarwhack 3 points 2 days ago Russia and Poland may shortly be the only White countries. 20 years. permalink award report block reply\nEaszq8 2 points 2 days ago I don’t think this will convince women to start families. On the end of Feminism will do that. permalink award report block reply\nTerrorAndSlaughter 2 points 2 days ago They are in bad shape for it to kick in with a mere two kids.  That is a low bar.  At least subsidize population growth. permalink award report block reply YaharaRiver 3 points 2 days ago Huh? It sounds like they are in great shape if they can offer an incentive for just two kids.  That’s a lot of families!  Now they can reward people, lots of them! permalink parent award report block reply carpetxparmesan 1 points 2 days ago They don't have LAND for more kids. You been to any of these places? It's tighter than a nun's asshole. And has been for 1000 years. permalink parent award report block reply\nYaharaRiver 3 points 2 days ago Huh? It sounds like they are in great shape if they can offer an incentive for just two kids.  That’s a lot of families!  Now they can reward people, lots of them! permalink parent award report block reply\ncarpetxparmesan 1 points 2 days ago They don't have LAND for more kids. You been to any of these places? It's tighter than a nun's asshole. And has been for 1000 years. permalink parent award report block reply\nDudeNoOne 2 points 2 days ago Based permalink award report block reply\nMAGALADON9 1 points 2 days ago Bonuses for 3rd and 4th permalink award report block reply\nNoMaskNoMaster 1 points 1 day ago THETE MUST BE A STIPULATION THAT ITS FOR ETHNIC POLES ONLY!! permalink award report block reply\nthat1guy1981 1 points 1 day ago When I see the way thats worded I cant help but think it must really suck to accidentally have that third child. permalink award report block reply\nlifeisahologram 1 points 2 days ago I dont think income tax should exist so this is good either way. But if you are doing it with the purpose of promoting families shouldn’t it be above replacement, maybe 3 minimum? permalink award report block reply\nkeeman 1 points 1 day ago Or just make tax zero and stop propagandizing women to think they require a career. permalink award report block reply",
  "fetched_at": "2025-11-12T20:46:22.959746Z"
}