{
  "id": "8185543",
  "title": "55HUGE: Congress just read Pam Bondi the Riot Act in a letter regarding her anti-2A stance regarding",
  "url": "https://patriots.win/p/1ARK9nP563/huge-congress-just-read-pam-bond/c",
  "content": "55 HUGE: Congress just read Pam Bondi the Riot Act in a letter regarding her anti-2A stance regarding ongoing litigation surrounding the NFA and the BBB. DON'T TREAD ON ME posted 2 hours ago by kek-is-tan 3 comments award share report block Rep. Andrew Clyde @Rep_Clyde • 23h Thanks to the OBBB, the $200 NFA tax is now $0. But registration requirements remain. Yet it was Congress’s clear intent to repeal NFA registration by eliminating NFA taxes. That’s why I’m urging the DOJ to adopt our position in all litigation concerning this critical matter.\n3 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style kek-is-tan OP 1 points 2 hours ago video covering topic permalink award report block reply OldGamerGuy79 1 points 57 minutes ago Oh no!!! Not…..A STERNLY WORDED LETTER!!! permalink award report block reply kek-is-tan OP 1 points 39 minutes ago A STERNLY WORDED LETTER!!! Written by the same cluster of clowns that allowed the HPA and the Short Act to get neutered by a non-elected Democrat plant in the first place. But here we are. Not holding my breath, but it's political pressure. We'll see the results, if any, over the next few weeks with the two open cases. (2 more weeks) (reeeeeeeee) permalink parent award report block reply\nkek-is-tan OP 1 points 2 hours ago video covering topic permalink award report block reply\nOldGamerGuy79 1 points 57 minutes ago Oh no!!! Not…..A STERNLY WORDED LETTER!!! permalink award report block reply kek-is-tan OP 1 points 39 minutes ago A STERNLY WORDED LETTER!!! Written by the same cluster of clowns that allowed the HPA and the Short Act to get neutered by a non-elected Democrat plant in the first place. But here we are. Not holding my breath, but it's political pressure. We'll see the results, if any, over the next few weeks with the two open cases. (2 more weeks) (reeeeeeeee) permalink parent award report block reply\nkek-is-tan OP 1 points 39 minutes ago A STERNLY WORDED LETTER!!! Written by the same cluster of clowns that allowed the HPA and the Short Act to get neutered by a non-elected Democrat plant in the first place. But here we are. Not holding my breath, but it's political pressure. We'll see the results, if any, over the next few weeks with the two open cases. (2 more weeks) (reeeeeeeee) permalink parent award report block reply",
  "fetched_at": "2025-11-12T19:29:03.858919Z"
}