{
  "id": "8178095",
  "title": "1205A dividend of at least $2000 a person (not including high income people!) will be paid to everyo",
  "url": "https://patriots.win/p/1ARK5A7eYH/a-dividend-of-at-least-2000-a-pe/c",
  "content": "1205 A dividend of at least $2000 a person (not including high income people!) will be paid to everyone. TRUMP  TRUTH posted 3 days ago by _C_I_A_ 461 comments award share download report block\n461 comments Sort by Top Top New Worst Old Save chede 156 points 3 days ago What kind of stupid shit is this? I want to know who put this idea in his head. permalink award report block reply RedCapNation 120 points 3 days ago You’re right, it should be 25k to anyone who had family here before the immigration act. permalink parent award report block reply TooTrue-translation 41 points 3 days ago That sounds like \"Universal Basic Income\" which is what the mainstream media has been trying to familiarize us with for several years now. It is a communist nightmare. permalink parent award report block reply IAmTheScience 14 points 3 days ago It would be MASSIVELY inflationary. But with not just AI, but automation also, some things will have to change. I'm not saying I agree with this or not. permalink parent award report block reply daty_dato 10 points 3 days ago Not really. Most ppl will just pay bills with it. permalink parent award report block reply view 3 more comments... Hanging_Chad 6 points 3 days ago sounds like reparations for native Americans ✊🏻 permalink parent award report block reply Desktop 9 points 3 days ago There's not going to be any \"Paying down our enormous debt, 37 Trillion\".  I laughed when I read that.  Politicians were saying this in 1975 when the national debt was only 500 billion, which equivalent to only 3 Trillion in 2025 dollars. permalink parent award report block reply view 4 more comments... snoopy3210 5 points 3 days ago Nah a dividend is just a return on investment. He’s rebuilding American manufacturing. Problem is this is the wrong argument right now with the pending supreme court decision. It’s not about money collection. It’s about regulating BAD TRADE BEHAVIOR, like illegal dumping, by foreign countries during an emergency. Collecting the money is a plus but the not the main goal. permalink parent award report block reply JoePlumber 1 points 3 days ago One time payments are not UBI. permalink parent award report block reply Yawnz13 1 points 3 days ago Not if it's a one-time thing. permalink parent award report block reply load 1 more comments... UCantStumpTheTrump 1 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply RedStoneDeepState 1 points 3 days ago You keep proving you fuckers are socialists. permalink parent award report block reply maverick202 -5 points 3 days ago Huh? Woke right demands raparations now like blacks? permalink parent award report block reply GatoradeJeb 10 points 3 days ago Wokeright is ben shapiro, ted cruz and the rinos who out isreal above america permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply view 1 more comments... RedStoneDeepState -3 points 3 days ago Bullshit, you fuckers want to harm US National security by stopping missile defense system development permalink parent award report block reply view 9 more comments... Lordfred1993 24 points 3 days ago The people running for reelection next year... permalink parent award report block reply MastaJoda -9 points 3 days ago Fuck JD Vance slightly more likable and slightly less weird DeSantis 2.0. permalink parent award report block reply DickTick PRO 6 points 3 days ago I've noticed you very often have some extremely retarded takes. permalink parent award report block reply GatoradeJeb 4 points 3 days ago Jd is worse as he is for india the same way ted cruz simps for israel permalink parent award report block reply TrancePhreak 12 points 3 days ago It's James Fishback's idea. permalink parent award report block reply YaharaRiver 13 points 3 days ago Never heard of him (surprise!) so i looked him up. Very anti-DEI, values merit, very pro-America 👍 permalink parent award report block reply YaharaRiver 9 points 3 days ago Was it the implication that NOT A CENT will go to foreign international felons nor to those for whom $2k would not be felt that makes you call it “stupid shit”?? permalink parent award report block reply wmmiv2016v2 19 points 3 days ago Remember COVID stimulus and the resulting inflation??? permalink parent award report block reply Porkbut 6 points 3 days ago ☝️this is how you know left and media bots have overrun this website. Literal media rhetoric, repeated unironically and \"organically\" upbotted, sorry upvoted. Covid stimmy checks were a drop in the bucket of your inflation woes, yet you still repeat the same mindless drivel. At $2k, given to a third of the population, would total around 435 billion, which is 1.4 percent of the current national debt. Just shut up and stop spreading lies like blatant propagandists. The CRs passed most years add far more to inflation than a simple tariff surplus stimulus ever would. You poo pooing this is just another way the media gets its zombies to repeat its propaganda and undermine the Trump admins attempts to help the American people. permalink parent award report block reply Axiom502 2 points 3 days ago They want their pats on the head from massie faggots. permalink parent award report block reply chickeninoven 2 points 3 days ago You fucking idiot. The \"COVID stimulus\" was the CARES Act of 2020 and was a  $2.2 TRILLION spending bill. If you think that didn't affect inflation, you're even more retarded than I thought possible. permalink parent award report block reply view 1 more comments... GatoradeJeb 5 points 3 days ago Eliminate welfare and ebt permalink parent award report block reply OrdJFellow 3 points 3 days ago We shut down shipping, we shut down factories, paused debt repayments and gave everyone money to consume. Completely different circumstance to now. permalink parent award report block reply IAmTheScience 1 points 3 days ago Regardless of any morals or politics, or whether this is a good idea or not, yes this would be extremely inflationary. Like in the decade after unveiling this you would likely see prices triple. Money spent is what causes inflation. And this money would be spent by 2/3 of the people. Edit: people are talking about this as if it's monthly but I just realized he is referring to it as a one time thing. permalink parent award report block reply HoganP 2 points 3 days ago Inflation is 100% an effect of increased monetary supply.  Spending has nothing to do with it, although it's an easy conflation to make when spending is so often financed by increasing monetary supply. permalink parent award report block reply view 4 more comments... YaharaRiver 0 points 3 days ago Those two things are NOT connected whatsoever and it’s dishonest to imply they were. The covid-hoax gutted out entire legacies, and many people were fucked over by it. permalink parent award report block reply Hanging_Chad 9 points 3 days ago is we getting a stimmie check? permalink parent award report block reply view 3 more comments... Prof_Smith 4 points 3 days ago Thanks for letting us know you never took an economics course. Printing money like we do during covid caused massive inflation. Economically, we should have just let covid happen. permalink parent award report block reply view 9 more comments... chede 4 points 3 days ago Buying support with government money is stupid. permalink parent award report block reply YaharaRiver 10 points 3 days ago lawl 🙄 He’s returning it to the citizen victims from which it was STOLEN. There will be people WHO HATE HIM and would never vote for him who will benefit.  How is it buying their vote? fuck outta here permalink parent award report block reply Hanging_Chad 3 points 3 days ago I’d rather it spent on paying down the national debt permalink parent award report block reply view 11 more comments... canada_is_communist 1 points 3 days ago It worked in Quebec lol permalink parent award report block reply wilstjb 1 points 3 days ago Should be charging a fee to collect the tariffs. Will keep inflation down; heck increase taxes 1000% and zero inflation. permalink parent award report block reply lifeisahologram 8 points 3 days ago Probably Susie because it ultimately benefits her agenda if America is weak permalink parent award report block reply Youngman1234 6 points 3 days ago Explain? permalink parent award report block reply FatigueIsReal -2 points 3 days ago Lol.  Yes.  Susie fucking Wiles is the mastermind.  🤣🤣🤣 permalink parent award report block reply Porkbut 1 points 3 days ago These marvel children always need a thanos to be behind everything. permalink parent award report block reply load 28 more comments... Bullet_Tooth_Tony 110 points 3 days ago 50 year mortgages and now more poor people checks...? LMFAO what is this dude on lately 😂 permalink award report block reply guywholikesDjtof2024 87 points 3 days ago still waiting on 5,000$ DOGE checks and Fort Knox gold audit permalink parent award report block reply Hanging_Chad 8 points 3 days ago the gold has been converted into BTC permalink parent award report block reply MasterChief 3 points 3 days ago you mean $TRUMPCoin permalink parent award report block reply CPT88 3 points 3 days ago Epstein files. permalink parent award report block reply Texas_81 16 points 3 days ago Trump is not the same.. no mass deportations, no golden age, inflation is still high af and he denies it! This is all bullshit. We are not winning we’re losing permalink parent award report block reply RedStoneDeepState 1 points 3 days ago Inflation is not high, its virtually zero permalink parent award report block reply GA_Logic 2 points 3 days ago Agreed by December it will be clear. permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply Braineack 8 points 3 days ago The Democrat diet. permalink parent award report block reply YaharaRiver 4 points 3 days ago Does playing the “long game” fill you with Concern?? permalink parent award report block reply Donger-Lord 2 points 3 days ago Who the fuck is this guy even listening to? Does he not remember who got him into office? permalink parent award report block reply load 27 more comments... Thefrogeatsfree 92 points 3 days ago I didnt vote for this. Pay off the debt permalink award report block reply HelluvaEngineer 20 points 3 days ago How can the debt ever be paid off?  That's not how our monetary system works. permalink parent award report block reply Thefrogeatsfree 18 points 3 days ago Its been paid off before, granted that was before we were chained to central banking permalink parent award report block reply 0111000001100101 11 points 3 days ago There is no debt.  It's all fictional, with zero value, no consideration, and no contract. permalink parent award report block reply songman727 2 points 3 days ago I've got enough money to last me the rest of my life..... Unless I buy something. permalink parent award report block reply RedStoneDeepState 0 points 3 days ago This is complete nonsense permalink parent award report block reply RockyBalboa 5 points 3 days ago U.S. has to cease borrowing money from the privately-owned Federal Reserve bank (every penny borrowed comes with interest.) Make spending less than revenue. Reduce national debt to zero. permalink parent award report block reply RedStoneDeepState 1 points 3 days ago U.S. has to cease borrowing money from the privately-owned Federal Reserve bank (every penny borrowed comes with interest.) The national debt isnt borrowed from the federal reserve, its financed with bonds. permalink parent award report block reply Thunnus73 3 points 3 days ago Bitcoin permalink parent award report block reply Pede45 11 points 3 days ago I didn't cause the debt. You are more than welcome to pay it off. I'll take my money back thank you. permalink parent award report block reply Thefrogeatsfree 2 points 3 days ago It wasn't your money though, at this point it was your great grandkids money that spent permalink parent award report block reply GatoradeJeb 10 points 3 days ago I didnt vote for welfare and ebt for blacks and latinos. I want my money back permalink parent award report block reply NebraskanPatriot 6 points 3 days ago Today Trump doubled the payment to Argentina to $40 Billion to help out Argentina's cattle ranchers. Let that sink in.  We are in serious debt and the President chooses to send YOUR tax dollars to Argentina to subsidize their ranchers so that they can undercut OUR ranchers. It's your money.  I hope you like what Trump's doing with it. #ArgentinaFirst permalink parent award report block reply GatoradeJeb 1 points 2 days ago Cool now do israel permalink parent award report block reply Porkbut 7 points 3 days ago This amounts to ~$435 billion, or 1.4% of the debt. The next CR will wipeout all that payment, and double the debt contribution you attempted to alleviate. Better to give it to people who can actually use it, and give a real and meaningful sense of policy impact to your average voter, than some performative placation of people who dont understand how Keynesian economics works. permalink parent award report block reply NebraskanPatriot 0 points 3 days ago Well, Trump announced today that he is DOUBLING the amount of our tax dollars that go to help Argentina's cattle ranchers.  Does that qualify as 'people who can actually use it?' Because, technically, Argentina can actually use your hard-earned tax dollars. permalink parent award report block reply Porkbut 3 points 3 days ago Thats a blatant lie, hes not using tax dollars for this, propagandist, hes just allowing more imports by using a targeted tariff structure. Nothing to do with tax funds at all, liar. Those ranchers increasing their own production would have stopped it from happening in the first place, as hes doing it in response to artificially high beef prices. But they chose a different path to protect short term financial considerations, and that has long term consequences. So nah, dont care about your incredibly fallacious opinion. Lie to a retard who will believe it, handshake. permalink parent award report block reply Megaboom2025 2 points 3 days ago Can’t pay it off with tariffs. Need to abolish the federal reserve and make budget deficits illegal before it can even begin to be tackled. permalink parent award report block reply Thefrogeatsfree 1 points 3 days ago Agreed, it'll take multiple ways permalink parent award report block reply load 23 more comments... ScoobyDum 67 points 3 days ago $2000 will do nothing but cause more inflation. Pay off the debt or just stop collecting tariffs ffs. permalink award report block reply newestofnew 21 points 3 days ago the money already exists and had velocity, otherwise it couldn't have been collected as a tariff. it will have no supply side impact on inflation. it will likely go to pay down debt, just like the majority of covid stimmies, so will not go towards new goods or services either. so inflation impact minimal. permalink parent award report block reply Wexit-Delecto 10 points 3 days ago Lol Keynes. Didn’t covid herald a wave of massive inflation? Expand the money supply, cause inflation. Simple as. permalink parent award report block reply Isolated_Patriot 12 points 3 days ago Because they PRINTED money. This isn't about printing money. Expand the money supply, cause inflation. Simple as. There is nothing in this proposal about expanding the money supply. permalink parent award report block reply Wexit-Delecto -2 points 3 days ago There was during covid, which was the point. The fellow to whom I responded was saying the covid spending didn’t cause inflation because of some keynesian velocity mumbo jumbo. permalink parent award report block reply view 1 more comments... newestofnew 4 points 3 days ago perpetual election loser neocons and country club types like yourself to point to the 200 billion in stimmies to working people as the cause of inflation. but ignore the waves of trillions in liquidity injection the fed pumped into the asset class at the same time. the fed is still at it as well. money machine hasn't stopped feeding the banks since Silicon Valley bank. permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Not at all. All socialism must stop or the economy will continue to circle the drain. Since government is perennially corrupt, the only way to stop it is to cut the size of government down to the absolute bare minimum required. permalink parent award report block reply view 2 more comments... GatoradeJeb 3 points 3 days ago Funny how you retards support welfare and ebt for blacks and latinos but no to americans getting money back they paid in taxes permalink parent award report block reply Wexit-Delecto 0 points 3 days ago I don’t support any welfare of any kind. permalink parent award report block reply view 1 more comments... MastaJoda 2 points 3 days ago Of course the stimulus checks caused MASSIVE inflation, as it will every time the govt hands out Tillions to citizens. This isnt even up for debate. Stimulus checks only helps corporations and in turn wall street. As everyone is nagger rich for a day and they blow it before they even get it. permalink parent award report block reply MikeyisNinja 3 points 3 days ago I’m going to dump mine into memes like I did in 2021. permalink parent award report block reply Beachboy1b 2 points 3 days ago There is a staggering number of people on here that fail to understand what you just said. permalink parent award report block reply GA_Logic 1 points 3 days ago Unfortunately this thread reveals people do not understand how inflation works. The money exists already like you said and it is being returned to the taxpayers. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago No. The SCOTUS will rule tariffs illegal, will order the money returned to importers, big companies will use that money to buy back stock, they will keep prices high and the stock price will increase. permalink parent award report block reply load 1 more comments... HuggableBear 16 points 3 days ago Or maybe lower tax rates instead of just cutting us a check one time permalink parent award report block reply flashersenpai -2 points 3 days ago tax rate doesn't put money into someone's account or pay their utility bills no point in paying lower taxes if you lose your apartment anyway permalink parent award report block reply HuggableBear 4 points 3 days ago Literally does, you moron, and it does it repeatedly instead of just once permalink parent award report block reply 123breadman 5 points 3 days ago He's a business boomer CEO. When they get his with lawsuits they have to pay millions of dollars that are paid to their millions of people only totaling about $1 per person. He's going to pay $2,000 per person (which is not a life changing amount) and claim he paid billions out to americans. It's what boomers do. permalink parent award report block reply Pede45 3 points 3 days ago I'll take your check. permalink parent award report block reply GA_Logic 2 points 3 days ago I want my check too because that is our money as US citizens. permalink parent award report block reply DCYR66 1 points 3 days ago That just may buy a days worth of groceries. permalink parent award report block reply load 4 more comments... DingleBalls 39 points 3 days ago I dont understand how this is even up for debate or even for SCOTUS to consider. The President has sole ability to levy tariffs on any nation. Its not a \"tax on citizens\" because the costs arent supposed to be passed on and you're supposed to be buying and making American instead permalink award report block reply TravisRSCX 23 points 3 days ago That and you’re not required to buy said product from said country. Buy American or find a country that makes said product witha better relationship with us and has lower tariffs fees. Easy enough to understand. We are too addicted to cheap foreign goods. permalink parent award report block reply Maganifice7 7 points 3 days ago You literally can't find most products made in America anymore. I know, I've been trying. permalink parent award report block reply iamherefortheluls 2 points 3 days ago and has lower tariffs fees. so China again. A week or two ago, they have negotiated to have the lowest tariff fees of any country and in return for that they conceded that they won't cut off US from refined rare earth minerals. permalink parent award report block reply Consumerbot381732 5 points 3 days ago Next president (Newsome?) places tariffs on all countries that don’t have at least 50% gay or tranny cabinet members. Or more likely, on countries that don’t bend the knee to Our Greatest Ally. permalink parent award report block reply barryb0nds 1 points 3 days ago because the costs arent supposed to be passed on and you're supposed to be buying and making American instead American labor is expensive and most Americans wouldn't want to, or couldn't afford to live the lifestyle they have become accustomed to by \"buying American\". permalink parent award report block reply BillyBobBrewer 3 points 3 days ago The lifestyle we've become accustomed to? You mean living well below the means of our parents and grandparents who had a single income and working 4x as much? Oh, and back then, they were buying American. American labor is expensive, but it also made non-disposable products and allowed Americans to have a prosperous middle class. Sure, a TV or a washer or freezer would cost double or triple or more what a cheap Chinese piece of shit does. But it would last a generation. You rarely had to buy new, unless you wanted to, as things could be easily maintained and repaired. If we made things here, people would be making a lot more money rather than having all the productivity siphoned off by technocrats. But I'm sure you already knew that. permalink parent award report block reply barryb0nds -1 points 3 days ago You mean living well below the means of our parents and grandparents who had a single income and working 4x as much? The boomer generation is an unprecedented anomaly in a long history that likely won't be repeated anytime soon. The US economy post WWII managed to capture lightning in a bottle. The conditions to repeat that simply do not exist. Americans are still living extraordinarily well. permalink parent award report block reply iamherefortheluls 1 points 3 days ago the costs arent supposed to be passed on that's like splashing a bucket of shit on your wall and saying 'the splatter wasn't supposed to land on me... or stick to my wall' You tax a merchant, he is passing the cost on to his buyers and by definition if its an import, someone in America is the buyer. permalink parent award report block reply TPMJB 33 points 3 days ago I have a feeling it's going to be capped at 150k gross combined income, or something gay like that. Which will suck for me. Work harder = get less. permalink award report block reply Wexit-Delecto 25 points 3 days ago The blacks who never vote for Trump is getting stimmies! permalink parent award report block reply DCYR66 3 points 3 days ago Time for more tats and grills. permalink parent award report block reply DCYR66 -1 points 3 days ago 🖕downvote this permalink parent award report block reply TPMJB 1 points 3 days ago YOU'RE NOT MY DAD! permalink parent award report block reply ianpatrick1966 14 points 3 days ago Same as the coof stimmies. I got to listen to every single fucking person jaw about what consumer nonsense they were going to buy. I didn't get a cent, and my business had cratered due to the coof. permalink parent award report block reply yummy_yumm_yumms 1 points 3 days ago Yup, I be getten non of dis fwee monee evwere! permalink parent award report block reply YaharaRiver 0 points 3 days ago YET, If you were presented with a 1.33% raise you would raise holy hell because you don’t even notice the fucking difference. So $2k is really life-changing for that income?  I’m not talking about YOU, i rather doubt that you’re in that income bracket, frankly. permalink parent award report block reply Consumerbot381732 14 points 3 days ago I’ll never forget my government teacher telling our class that progressive tax rates were “more fair”, as if it was factual information. $2000 per person to everyone except “high income people” is income redistribution. permalink parent award report block reply YaharaRiver -3 points 3 days ago ON PAPER. In real life, it’s a form of crime prevention! permalink parent award report block reply iamherefortheluls 3 points 3 days ago its never been before, but I am sure this time the disney fairy will come through to make it so. permalink parent award report block reply TPMJB 1 points 3 days ago Bullets are cheaper. $2000 worth of bullets would prevent a lot of crime. Well unless it's 5.56. That gets you like a full magazine. permalink parent award report block reply TPMJB 1 points 3 days ago I don't have to deal with raises. I'm a contractor. Getting an 80% raise was worth the \"instability\" of not being full time. So yeah, these stimmies still fuck me. permalink parent award report block reply DomTullipso 33 points 3 days ago Inflation is still shit. 401k doesn't help most people for decades. And then, the dollar will be tanked. He's so out of touch permalink award report block reply mb5231 2 points 3 days ago This wouldn't be printing new money, inflation most likely not impacted by much permalink parent award report block reply CanadianTrump2 1 points 3 days ago Wrong The massive interest bill is the main driver of inflation as they print money to cover it. Paying down debt will reverse. permalink parent award report block reply bluewhiteandred 1 points 3 days ago I think they were saying that inflation is still bad, not that this causes inflation (although there seem to be a lot of people - in my understanding incorrectly - posting that) permalink parent award report block reply henri_derelicte 30 points 3 days ago Stimmy checks are back on the menu, pedes! permalink award report block reply Wexit-Delecto 27 points 3 days ago “Is we getting…” permalink parent award report block reply South_Florida_Guy 9 points 3 days ago Gibsmedat permalink parent award report block reply Eagle_Balls3 12 points 3 days ago Oh lawd we gun be rich!!! permalink parent award report block reply DCYR66 3 points 3 days ago And sheet!!! permalink parent award report block reply DCYR66 0 points 3 days ago 🖕downvote this permalink parent award report block reply mikejones 7 points 3 days ago Still got the one Trump signed a few years ago. permalink parent award report block reply Amaroq64 1 points 3 days ago It'll about make up what I've been losing on Trump's stock lately. He needs to have a talk to whoever is running his company while he's president. permalink parent award report block reply DCYR66 -1 points 3 days ago And we wonder why so many fat lazy asses won’t go to work permalink parent award report block reply DCYR66 -3 points 3 days ago 🖕downvote this permalink parent award report block reply Wexit-Delecto 25 points 3 days ago Can you use the money to hire a decent AG instead? permalink award report block reply bill_in_texas 20 points 3 days ago Another bullshit idea!  Unless we are somehow running a surplus, then Trump would be borrowing that money to send to the taxpayers, which will spur more inflation, and put us even further in debt.  Did we learn nothing from the covid hysteria and subsequent Bidenflation?    He's just flailing right now.  Focus, President Trump, focus. permalink award report block reply Axiom502 -2 points 3 days ago Shut up faggot permalink parent award report block reply Logan051361 -9 points 3 days ago Good, then you can send your money to me. so sick of the complainers permalink parent award report block reply BigDuke6 16 points 3 days ago Is this on top of that $5000 DOGE dividend we gettin???? permalink award report block reply DCYR66 5 points 3 days ago That was so yesterday. permalink parent award report block reply DCYR66 -5 points 3 days ago 🖕downvote this permalink parent award report block reply starjello -2 points 3 days ago You don't have to tell the idiots here to do that. They hate truth. permalink parent award report block reply Reassess_Reevaluate 14 points 3 days ago Why not high income? I pay more to slop SNAP benefits into degenerate's faces than 95% of people living in my state.  I'll happily take a tiny percentage of my tax dollars back. permalink award report block reply Andweareback -7 points 3 days ago Greed is one of the 7 deadly sins. permalink parent award report block reply Reassess_Reevaluate 14 points 3 days ago Is theft a sin? permalink parent award report block reply RocksCanOnlyWait 11 points 3 days ago Why is it greed to want to keep what one has worked for, but not greed to take from someone what they earned and give it to another who has not? permalink parent award report block reply TPMJB 1 points 3 days ago And with our taxes we are funding greed, gluttony, and sloth. We just need to stop paying tax permalink parent award report block reply Obambi 13 points 3 days ago Get rid of the income tax if you want the GOP to win in 2028. That’s what it will take tbh. permalink award report block reply Electrocutioner 2 points 3 days ago This will guarantee wins for longer than that. permalink parent award report block reply Obambi 0 points 3 days ago Yea. Do you want to pay income taxes? Then don’t vote for democrats. To keep no income taxes keep voting for Trump/Vance/Barron etc. permalink parent award report block reply Logan051361 10 points 3 days ago Many Seniors could use the money. permalink award report block reply YaharaRiver 8 points 3 days ago Unfortunately, it’s to pay the property taxes on their paid-for houses which they’ll lose if they don’t.  They won’t be buying new towels or socks.  But their ass in a sling will be saved. This whole scam is so ugly! Squeezing blood from a stone to wash turds clean. permalink parent award report block reply Logan051361 4 points 3 days ago Most will be buying food permalink parent award report block reply YaharaRiver 3 points 3 days ago Trust me, property taxes make old people lose their appetite. They will forage dandelion leaves from the back yard before they let their now $400,000 house be snatched for not paying the $8000 tax bill in full on time. permalink parent award report block reply Logan051361 4 points 3 days ago I know, I get it. Its bullshit.  alll this Tax shit needs to go the fuck away permalink parent award report block reply TPMJB 2 points 3 days ago Unfortunately what's going to happen is many señors will get it. Did you.... Did you see what I did there? permalink parent award report block reply billybaldwin2 10 points 3 days ago Where can we see how much money America has earned through tariffs over the years / decades? permalink award report block reply TPMJB 2 points 3 days ago Trust me, bro. permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply MAGA_APN 10 points 3 days ago Hopefully not to those who dont pay any taxes and are already on government hand outs-or illegals. permalink award report block reply ScamBlondie 7 points 3 days ago Uh, yeah, about that, sorry to disappoint you but… permalink parent award report block reply YaharaRiver 1 points 3 days ago I guarantee you that Trump has no intention whatsoever of boosting any muslims whose bigshots are just giving away used 747s. 😂 permalink parent award report block reply TPMJB 1 points 3 days ago Yeah, buddy. Hillary is secretly in jail too. permalink parent award report block reply C0drus 8 points 3 days ago A $2000 “dividend”?….you mean some of the money that I paid in taxes is coming back to me so I can be taxed on it again, devalue the dollar further, put us further in debt and destroy the country even more…..what could go wrong?🤷‍♂️ permalink award report block reply YaharaRiver 3 points 3 days ago lol You so obviously do not qualify to receive one cent 😂 permalink parent award report block reply C0drus 6 points 3 days ago I don’t qualify for snap, ebt or subsidized housing either….and I’m good with that also 😎 permalink parent award report block reply YaharaRiver -7 points 3 days ago ah, the carefree life of a jihadi! permalink parent award report block reply C0drus 5 points 3 days ago You’re a jahadii?….get the fuck out of my country permalink parent award report block reply view 1 more comments... TPMJB 0 points 3 days ago $2000 is a drop in the bucket. I'm not a wagie. I receive more than that in rental income, that people like you pay me. permalink parent award report block reply Retardloserimsogay 8 points 3 days ago FFS, get rid of income taxes or property taxes. wtf is this $2k now?! permalink award report block reply NYforTrump 7 points 3 days ago How about we pay off the 31 trillion dollar DEBT? permalink award report block reply RocksCanOnlyWait 4 points 3 days ago $38 trillion debt permalink parent award report block reply Jaunty_Haul 2 points 3 days ago Why would we do something silly like that when we could pump up inflation with some helicopter money? If you want someone to pay the debt, just have more kids. /s permalink parent award report block reply alucard13mmfmj 7 points 3 days ago So.. where are these plants? Arent they mostly just promises/pledges from corporations? Lawl. Most of that shit wont be built as they are waiting out tariffs when 2028 comes around. permalink award report block reply SenorTrumper 4 points 3 days ago STFU! We must pretend that we still believe all the BS spoonfed to us. permalink parent award report block reply FatigueIsReal 2 points 3 days ago So you ask a searchable question to a forum? Here (edit: I'll should be more polite.) Technology and Semiconductors Nvidia Corp.\nAmkor Technology\nPegatron\nApple Inc.\nTSMC Pharmaceuticals and Biotech Johnson & Johnson\nAstraZeneca\nGlaukos Corporation Appliances and Consumer Goods Whirlpool Corp.\nWCR Incorporated Energy and Infrastructure XNRGY\nHyundai Motor Group permalink parent award report block reply Maganifice7 1 points 3 days ago This retard clearly didn't understand the question. permalink parent award report block reply FatigueIsReal 2 points 3 days ago The question was \"where are these plants\"  it was implying they don't exist and are never going to be built. Each of the companies I listed are building the plants or re-shoring the operations currently. So no these are not just promises. permalink parent award report block reply MemeWarsVet 7 points 3 days ago Abolish the IRS. permalink award report block reply ScamBlondie 6 points 3 days ago “High income people” probably anyone not on welfare permalink award report block reply GeorgeBailey 5 points 3 days ago Thank you President Trump! That $2000 will help offset the $120,000 I was making before my job was given to a non-American H1-B Hindu. Winning! /s permalink award report block reply Texasnumber1 5 points 3 days ago Why in the f*** do people on this website only post screenshots from Truth social Trump's creation, but everything is linked when it comes to Twitter. I've said it once and I'll say it again this place should be called the Twitter for the Elon permalink award report block reply barryb0nds 7 points 3 days ago I didn't sign up to truth because it required a cell number (even just to view posts) and fuck that. permalink parent award report block reply Texasnumber1 0 points 3 days ago So you go to Twitter where  it's loaded with Bots yeah sure that makes a whole lot of sense some of you people don't have the balls to build anything or compete with mainstream social media pretty f****** sad permalink parent award report block reply barryb0nds 1 points 3 days ago I don't really use twitter outside of clicking links to it that are posted here on elsewhere. I don't think \"microblogging\" sites are particularly pleasant to use at all. permalink parent award report block reply Maganifice7 5 points 3 days ago Don't you need an account or app to access truth social? I remember looking into it when it came out and there was no way to view it from a web browser or something like that. I tried signing up, but it wanted my phone number, which I don't give out. permalink parent award report block reply Texasnumber1 1 points 3 days ago It's the same thing as Twitter you can't see the comments unless you have an account you can always link and see Trump's truths or anybody for that matter permalink parent award report block reply YaharaRiver 0 points 3 days ago Pretty sure foreigners can’t access the site live. Best platform ever!! 😂👍 permalink parent award report block reply Texasnumber1 -1 points 3 days ago What do I care about foreigners I'm focus on America and American opinions and politics. Works in Canada Works in Europe so now you're just making s*** up permalink parent award report block reply YaharaRiver -1 points 3 days ago Fuck off. “Truth Social is officially available to users in the United States and Canada, with no public announcement of expansion to other countries as of November 2025.” Get bent, foreigners! 👍 No access for you, not even in Europe permalink parent award report block reply Texasnumber1 1 points 3 days ago Then get a VPN easy permalink parent award report block reply Ryunnsun 5 points 3 days ago We're going to pay down our debt, but first, we're going to drop another 700B on it. permalink award report block reply JBlaze056 4 points 3 days ago More gibs is not the answer.   Arresting traitors, holding them accountable.   Arresting Epstein clients, holding them accountable.  Stop funding foreign states and their wars, holding those that push their never ending Zionism at the expense of the American citizen accountable.  Lowering the cost of goods by ending H1Bs and all the other illegal and legal ways that the American worker is undercut by the hordes of the words, holding the employers that exploit the laws accountable…these are the ways to get the country back.  Not more gibs.   Get a clue Trump…less Zionism, less cronies, more prosecutions, more swamp draining, more America First!! permalink award report block reply armyofpedes4usa 4 points 3 days ago The printing press goes \"BURRRRRRRR\".  Hello more inflation. permalink award report block reply Isolated_Patriot 8 points 3 days ago There is nothing in the proposal about printing more money. The tarrif money is returning American dollars from abroad, and he is saying it should go to the people. NOTHING about printing more and expanding the money supply. permalink parent award report block reply FORMERCHILDSTAR 9 points 3 days ago I don't understand why more people on this site don't get this. We're not printing money, we're giving tariff money to citizens. They think it's going to create inflation. No it's not. It's going to temporarily give citizens more purchasing power. I'm glad you understand. permalink parent award report block reply bluewhiteandred 4 points 3 days ago I guess I understand now through a couple of these comments why people were incorrectly (afaik?) thinking this would cause inflation: it's because the checks themselves are identical, but their sources are different. Hence without understanding the source being different, they think the tariff checks are inflationary like money printing checks would be. (I think I see people make the same - afaik erroneous - argument with respect to raising people's wages. It doesn't cause inflation if it comes from existing profits of a company.) permalink parent award report block reply FORMERCHILDSTAR 4 points 3 days ago Correct permalink parent award report block reply iamherefortheluls 2 points 3 days ago first, US is printing a ton of money still. Second, SCC is still deliberating on whether the tariffs are legal. Very likely they will decide that they are not. In which case every company is going to file for reimbursement. Guess where the money to pay that all back is going to come from. permalink parent award report block reply FORMERCHILDSTAR 2 points 3 days ago That's a lot of speculation about the SCC regarding tariffs. But, yes printing too much money will cause it to be more worthless. This tariff proposal however isn't linked to printing more money, it's simply a proposal to redistribute tariff monies back to the USA citizens. permalink parent award report block reply view 2 more comments... Axiom502 1 points 3 days ago Because they are retards permalink parent award report block reply Isolated_Patriot 1 points 3 days ago Some of them don't understand. A lot more of them know exactly what they are doing. permalink parent award report block reply Axiom502 2 points 3 days ago You are retarded permalink parent award report block reply Logan051361 1 points 3 days ago then dont except it. permalink parent award report block reply MasterChief 0 points 3 days ago yep, give it to the target demographic, they'll glady \"except\" it permalink parent award report block reply deleted 4 points 3 days ago Axiom502 2 points 3 days ago Shut up faggot permalink parent award report block reply GreyKnight 4 points 3 days ago 2k is not not even a month of benefits for a welfare parasite. permalink award report block reply Jaunty_Haul 4 points 3 days ago helicopter money -> inflation no exceptions permalink award report block reply Klown_Kutz 4 points 3 days ago I’ll do the same thing I did with the COVID checks. Buy tools. (not from the overpriced tool trucks). permalink award report block reply Whatyougotson 7 points 3 days ago Are guns and ammo considered tools because that's what im buying. permalink parent award report block reply imafarttrustme 3 points 3 days ago Yes permalink parent award report block reply armyofpedes4usa 5 points 3 days ago At this rate, the tools will hold their value better than the dollar. permalink parent award report block reply Klown_Kutz 3 points 3 days ago In my case this is true because I bought diagnostic tools. I fix the check engine lights other techs can’t. permalink parent award report block reply YaharaRiver 1 points 3 days ago This is extremely important. The Enemy doesn’t want you to have tools, they don’t want you to have a place to store tools, and they sure as hell don’t want you to be skillful in using tools. It’s why they “help” poor countries with sacks of oatmeal instead of seeds and shovels. permalink parent award report block reply Xinnietheflu3 2 points 3 days ago Wright and channellock are some good USA made tools permalink parent award report block reply Klown_Kutz 2 points 3 days ago After 32 years I’m way past basic hand tools. It’s all diag tools for me now. permalink parent award report block reply _4TheRepublic 4 points 3 days ago The point here is the tariffs are a success. Thank you Trump! Making our country rich again! permalink award report block reply GA_Logic 2 points 3 days ago Amen and this is only the start. permalink parent award report block reply Maganifice7 -1 points 3 days ago When do I see some of this rich out country is getting? permalink parent award report block reply ImmaculateDeception 3 points 3 days ago Every person on EBT must show up in person to receive their dividend. When they arrive, they will be photographed, fingerprinted, weighed, etc. as they are added into a fraud detection database.  Failure to show up to receive their dividend will result in suspension of all EBT payments. permalink award report block reply JDVance4President28 3 points 3 days ago You will never see that \"$2000.00\" check. It just won't happen. More strongly worded blog posts by Trump. Because ask him why we are still paying so much into federal taxes? permalink award report block reply barwhack 3 points 3 days ago Feckless presidential optimism in the face of universal stage4 corruption is just ... bad and stupid. I'm understanding better, WHY Trump abandoned his promise to publish the massive list of pedos in charge: he just wants to use the present child-sex machinery to enrich everyone . That's as messed up as it sounds. And because it's so gorked, his advisers - those who approve such fundamental horror - are advising bad-stupid means toward that bad-stupid end... Dividends aren't the answer; 50-year debt slavery isn't the answer. DECORRUPTING the longitudinal rot in the American soul is a start on the answer; which involves execution of traitors, deportation of invaders, and harm done to active enemies. But we cannot, because we cannot even name the specific Epstardian Corruptocrats \"who don't exist\", yet who rule the West. permalink award report block reply swift_water 3 points 3 days ago Unless you've got student loans in default. Then you receive nothing. permalink award report block reply Aoikaze2000 3 points 3 days ago Well it's a start... and if it gets me my money back from theft, I'm happy... but it's a drop in the bucket with how much that gets stolen from me annually. permalink award report block reply Droford 3 points 3 days ago If they did ever give out $2000 checks the left would bitch about it permalink award report block reply pedeypete 3 points 3 days ago Normally I would say put it against the debt. But I don't want the dems spending it to cut some 8 year old's dick off when they steal the election in 28. Give it to me, I'll use it to help move my family to Florida. permalink award report block reply ActNow 3 points 3 days ago If they really do issue $2000 each to Americans, I hope they've fixed the enormous fraud that took place with the stimulus checks. <prisoners and foreign nationals rub hands together> permalink award report block reply Texas_81 2 points 3 days ago We’re screwed. DJT is being manipulated by Susie Wiles permalink award report block reply DJTrumpMAGA 2 points 3 days ago Congrats for working your ass off and being \"high income'!! You get to pay for everything and get nothing in return. permalink award report block reply FlyinHeadlock 2 points 3 days ago What exactly does high income mean. During COVID it meant the middle class received no COVID money. I was considered filthy rich during COVID. No. Just middle class. permalink award report block reply LastconservativeNY2 2 points 3 days ago F this. \"Paid to everyone\" is not \"reimbursed to taxpayers\". What does high income mean? permalink award report block reply MemeWarsVet 2 points 3 days ago high income person What's the threshold? permalink award report block reply HoganT 2 points 3 days ago There is no threshold. This isn’t real. It’s something he’s pulling completely out of his ass out of desperation. permalink parent award report block reply SaltyLandscaper 2 points 3 days ago Keep tickling my balls about a rebate check..shit or get off the fucking pot already. One way or the other. permalink award report block reply Michalusmichalus 2 points 3 days ago Too many intentionally miseducated having TDS. permalink award report block reply canada_is_communist 2 points 3 days ago I have to admit hes right permalink award report block reply Gman75 2 points 3 days ago On one hand, I sure as shit could use an extra 2k right now. On the other hand, the price we pay for this economically would not be great , to put it mildly. permalink award report block reply OldGloryUnfurled 2 points 3 days ago No dividend. Fuck that. Slap that onto the national debt for fucks sake permalink award report block reply Ocineaa 2 points 3 days ago This is retarded. As are fifty fucking year mortgages permalink award report block reply presticus 2 points 3 days ago Dividends should only be on the table after the national debt is paid off and the budget allocated by Congress is resulting in a surplus. permalink award report block reply israelworst 1 points 3 days ago They should make a vehicle production line to replace the aging postal vehicle. Also make them available to civilians. So we can bypass the shitty market. permalink parent award report block reply larryjohnson 2 points 3 days ago Seems like this is an apply pressure move on SCOTUS.  If SCOTUS rules against tariffs, Trump gets to say, there goes your $2k dividend.   If they don't he gets to seem compassionate and say hey we realize prices are still a little high, but I helped offset them for you.  Wins a little favorability.  I'd rather see debt paid off coupled with massive spending cuts, but R's need to be able to get reelected at midterms, and imagine the ads saying such and such Democrat voted against tariffs and your dividend!  People will remember a little spending money over more financially stable country unfortunately. permalink award report block reply Mhmm2MoreWeeks 2 points 3 days ago They will never let Trump give everyone $2000. permalink award report block reply DITTOPatriot 2 points 3 days ago FK that, I'm tired of the underperforming getting a check when I get nothing.  It should be based  off of a percentage of the tax you pay. And the BS of measuring the economy off of the financial sector is BS. What about Mainstreet? permalink award report block reply UltraFrogMan 2 points 3 days ago Sweet I can get a new heater core for my truck permalink award report block reply Counterwhat 2 points 3 days ago Let's return to Pre1913 prosperity. permalink award report block reply KeepMarxInTheGround 2 points 3 days ago I think he was saying that after the debt is paid off, American citizens would receive $2000 per year in dividends from tariff revenue. permalink award report block reply Tromboneofsteel 1 points 3 days ago The federal gov is like a single wine aunt who's on her 35th maxed out credit card and refuses to lower her standard of living. I mean, maybe it'd be worth it if it got half the dumbass college liberals to vote red in the midterms. But that ain't going to happen. permalink award report block reply moscowjade 1 points 3 days ago He's trying to buy social pressure on the rogue justices. Good idea. permalink award report block reply 45ichooseu 1 points 3 days ago What's a high income person? I only ask because one person making $120k/yr, with two kids and a spouse that stays home to take care of them, is only just \"getting by\" in California. permalink award report block reply Standingoak 1 points 3 days ago 38 but whose counting ? permalink award report block reply Tardigrade 1 points 3 days ago I'll use mine to buy an ounce of palladium.  Maybe a Mcribwich with what's left over. permalink award report block reply Tacitus1963 1 points 3 days ago What should happen is that any American taxpayer who wants to get the $2K must prove s/he is an actual citizen.\nPut Elon and his team in charge of organizing this.\nZero $ should be given to illegals and those who don't pay any taxes. permalink award report block reply Sicsempertyrannis76 1 points 3 days ago Would rather end income and property tax permalink award report block reply Genericwhitemale 1 points 3 days ago Damage control for the SNAP bs. This is dumb permalink award report block reply paramour 1 points 3 days ago Trump needs to go scorched earth on this shit. Figuratively  of course. We voted for him to do what he's doing. Balls to the wall, bitches! LET'S GO!!! permalink award report block reply unotrumpcard 1 points 3 days ago Put tariffs on import which are then paid back with stimulus checks, genius. Retarded. permalink award report block reply Kraken_V_Algorithm -1 points 3 days ago Which then stimulates domestic economy, increasing tax revenue, goes toward ultimate plan of reducing debt.  Just need DOGE cuts to keep happening and reduce size of govt.  Why do simpletons continue to think this stuff can all happen in one cycle when it took decades to get us where we are? permalink parent award report block reply unotrumpcard 1 points 3 days ago Stimulating the economy by collecting tax from stimulus money funded by taxing imports, its brilliant really, keeps the money circling perpetually. Btw the debt has increased a couple of trillions since Trump took office, there is no plan to \"reduce debt\", retard mongoloid. permalink parent award report block reply Kraken_V_Algorithm -1 points 3 days ago No, not perpetual.  Reading is fundamental.  Cyclical planning.  And don't forget all COVID money printing for programs on top of the individual stimulus.  And Biden happened since first term too.  But go ahead, keep blaming Trump for all the Dem interference. permalink parent award report block reply unotrumpcard 1 points 3 days ago It is very low IQ behavior to instantly start arguing about who is to blame as if it is interesting. I am just stating the fact that the debt will increase under Trump 2 just as it did under Trump 1. It is only a delusional retard who clings onto the dream that the debt will be reduced. I wont even engage with you about whose fault it is until you start living in reality. permalink parent award report block reply view 2 more comments... Urusovite 1 points 3 days ago Id rather he just pay off the debt… permalink award report block reply 2016TrumpMAGA 1 points 3 days ago Fuck a dividend, pay down the debt. permalink award report block reply gp7373 1 points 3 days ago The stock market does not track the everyday persons economic health nor is it a reflection of the overall economy. The elite class is so out of touch by how bad most people are struggling. Glad your billionaire buddies are doing great in the stock market, they also comprise more than 80% of market share. We need jobs, and more importantly wages to track with cost of living. Stagflation of wages combined with out of touch policies are destroying the economy......... permalink award report block reply hey_spike 1 points 3 days ago It will be stimmy 2.0. permalink award report block reply glasscrawler 1 points 3 days ago I would rather illegals not be included. permalink award report block reply hansgruber7 1 points 3 days ago This is a retarded idea. permalink award report block reply israelworst 1 points 3 days ago Um he meant paid against the national debt right...? Right???? permalink award report block reply TonyTheSlop 1 points 3 days ago Should only give it to those who voted Trump lol.. Also what the fuck does high income mean? permalink award report block reply YaharaRiver 1 points 3 days ago $2k x 175 million eligible adults (rough guesstimate, not minors, not foreigners) is only $360 billion. Our GDP last year WITHOUT TARIFFS, WITH FULL DEAD WEIGHT, WITH MAXIMUM LEECHES, was $29,000 billion. (That’s nearly 30 TRILLION) With deadweights eliminated, with leeches kicked out, with tariff money pouring in, this refund to us is a piece of cake.  LFG! permalink award report block reply patrioticwinning3 1 points 3 days ago They aren't fools they are communists, jihadis and globohomos TRYING TO CRASH THE ECONOMY! permalink award report block reply AmericanJawa 1 points 3 days ago will soon begin paying down our ENORMOUS DEBT This should be the singular focus until the debt is actually paid off. permalink award report block reply Kiwipede22 1 points 3 days ago I call bullshit on the dividend payment.\nOne either pays down debt or one pays a dividend… it cannot be both AND LETS FACE IT THE GOVT ARE NOT GOING TO PAY EVERY SINGLE PERSON $2K. permalink award report block reply dorsalmorsel 1 points 3 days ago We don't need cash payoffs like this.  Nobody is asking for cash payoffs like this. Just lower taxes for the next cycle.  Eliminate the estate tax. permalink award report block reply 10MeV 1 points 3 days ago NO, dammit!  Reduce borrowing, pay off debt.  We're drowning in debt, and inflation is already destroying savings.  STOP IT! permalink award report block reply brickbrack 1 points 3 days ago Great, so I have a choice between Trump the commie and Mamdumi the commie. Fucking joy. permalink award report block reply keeman 1 points 3 days ago Yay socialism!  And just think of all the government bureaucrats who will need to be hired to administer this. permalink award report block reply TurdSammich 1 points 3 days ago Wish he wouldnt say these things.   2k a person will cause instant inflation.  Better to reduce tax rates. permalink award report block reply 67Vert 1 points 3 days ago Apply only to people who pay taxes.  Please permalink award report block reply ACActual 1 points 3 days ago This is a whopper.   Took a page from his days as  a Democrat permalink award report block reply DivineEternal1 1 points 3 days ago This won't cause inflation like the stimulus checks did, right? I'd rather he put it to paying off the national debt. permalink award report block reply Abovethefray 1 points 3 days ago Giving away money again?  Come on, man. permalink award report block reply Pelosi_Halitosis 0 points 3 days ago Keep the $2k. It's just fodder for the leftists. Even though they'll be the first ones to cash the check, and will still say it increased the debt somehow. permalink award report block reply Diddlywac3 0 points 3 days ago The amount of people here who think they know more than Trump is hilarious permalink award report block reply Maganifice7 1 points 3 days ago I know more about ai than Trump. permalink parent award report block reply YaharaRiver 0 points 3 days ago Right? 2 billion pisslamics against 1 White male. Also known as a Fair Fight 😆 permalink parent award report block reply yepyep 0 points 3 days ago I have 4 children, will they get a check? permalink award report block reply LiterallyKaiser 0 points 3 days ago Dumbest idea possible, who is telling him this stuff? Last time we gave out free checks we got the worst inflation in decades, now he wants to give even more in checks while we’re still struggling to bring down inflation from 2020? Ffs permalink award report block reply EdBuck 0 points 3 days ago What the fuck does high earning mean???? permalink award report block reply Trump737 0 points 3 days ago So high income- yeah , lets just screw them.  Wtf is a high income person?  1M a year?  100K /yr\nThe higher income people are who continue to buy and consume- permalink award report block reply YaharaRiver 2 points 3 days ago Eyebrow technicians 😆 permalink parent award report block reply GuerillaYourDreams 0 points 3 days ago That would be nice, but is that the best use of our money?? permalink award report block reply Prandogolio 4 points 3 days ago Yes, when you get your check you can use it for whatever you think is best. permalink parent award report block reply Patriot4TN 3 points 3 days ago Take what you can get. Your taxes are stolen away from you to enrich the crooks. permalink parent award report block reply Snooptwo 0 points 3 days ago Don’t give it to the people. Put it right towards the debt. I don’t give a shit about boomers getting $2000, I care about unfucking what their generation did to us. permalink award report block reply fweedom 0 points 3 days ago I'm not gleefully paying higher prices (from tariffs) so he can transfer even more wealth to poor people!!!!  DO NOT USE TARIFF MONEY TO SEND STIMULUS CHECKS TO POOR PEOPLE!!! permalink award report block reply bluewhiteandred 0 points 3 days ago is this a before Christmas dividend / bonus thing because that's probably good timing if so edit: it's also pretty amazing that he seems to always know what to do. I was just commenting a few days ago that paying the national debt is such an intangible that - although many people might like it and appreciate it - it probably doesn't get votes like lowering taxes or some kind of dividend does permalink award report block reply HoganT 0 points 3 days ago Hah! Yeah, these are starting to lose their punch. permalink award report block reply LaptopDied 0 points 3 days ago He is defending our sovereignty and our currency. Related things. Good job. It's called making a living. You get that with a businessman president. permalink award report block reply bill_in_texas 7 points 3 days ago Borrowing more money to hand out, to fire up inflation more and put us in even more debt is a businessman at work?  That's certainly not a businessman that wants to stay in business. We already did this and got the Bidenflation.  You really want to do that again?  It's the reason people are hurting now. permalink parent award report block reply LaptopDied 2 points 3 days ago But it isn't borrowed money? I am certainly against borrowing. permalink parent award report block reply Isolated_Patriot 2 points 3 days ago Borrowing more money to hand out This is not part of his proposal... permalink parent award report block reply bill_in_texas 5 points 3 days ago Let's put it this way.  You are underwater on your mortgage, and also on your car payment.  You have no savings, and your monthly expenses exceed your monthly income.  You've been borrowing on your credit card to make ends meet.  But now, you are renting out a room in your house to a boarder, and you have extra income, yet, you still have to lean on more credit card debt each month to make ends meet. But you want to be popular in the neighborhood, so at Halloween, you hand out $ 100 bills to the kids trick or treating. That's more money you have to borrow from your credit card issuer, that you'll have to pay back with interest. permalink parent award report block reply ddbb 1 points 3 days ago The thumbs down on my post tells me you either don't run your household finances, or you have a laughable amount of \"leverage\" yourself. What a joke. permalink parent award report block reply Isolated_Patriot 1 points 3 days ago Assuming that the person who actually bothered to responded to you is the same person as the (now 4) who downvoted you tells me that you only discovered the internet yesterday. What a joke. permalink parent award report block reply view 1 more comments... ddbb -1 points 3 days ago Of course it is. If you have debt - any money spent NOT paying it off is borrowed. permalink parent award report block reply newestofnew 1 points 3 days ago he's actually hurting the currency significantly currently, because with the tariff regime dollars are returning home from abroad. majority of international dollars holdings are eurodollars created by fractional reserve systems at European branches of american banks. Trump has no plan on dealing with international dollars flooding the domestic market. has no attention on it. that's why gold is at 4,000 and just getting started. permalink parent award report block reply LaptopDied 0 points 3 days ago Well some will use that new money well and some won't. Money used badly disappears into the air. The main thing is work. Productivity.  The rest is just symbolism of work. permalink parent award report block reply Chad_Prime 0 points 3 days ago WTF? How about we take these\"excess\"funds and start paying down the fucking debt? Who is advising him of this retarded idea? Mr. President, if you are listening, please rethink this! Good God man! permalink award report block reply barryb0nds 0 points 3 days ago Yay more inflation. Citing stock market prices is weird. The stock market hitting new highs every other week is being carried by the tech sector via AI companies and frankly it's alarming. Take tech companies out and the market barely moved in a year. Just to pick an example, take Schwab's dividend ETF https://totalrealreturns.com/s/USDOLLAR,SCHD?start=2024-11-05 It's holdings are all, long term SOLID American companies that pay good dividends. It's down from 1 year ago. I think another 6, 12, maybe 18 months bull run until the AI bubble bursts. Even before the election we had analysts at Schwab and Vanguard warning we could see a decade of only 3$ annualized S&P500 growth due to tech being so overvalued. Does anybody really think Nvidia is worth 5 TRILLION dollars? I don't think this is sustainable at all. permalink award report block reply questionmarks 0 points 3 days ago polls must be looking grim permalink award report block reply lispboy 0 points 3 days ago It's a whooping 96¢/hr raise for a full time worker. permalink award report block reply YaharaRiver 2 points 3 days ago It’s not a raise AT ALL. it’s a Bonus. permalink parent award report block reply DagneyTaggart -1 points 3 days ago This will feed hyperinflation. Did we not learn anything from Covid helicopter money? If you’re going to pay it, first deport 40 million illegal aliens and cross all the American welfare takers off the list. permalink award report block reply Deplorable_Badger 3 points 3 days ago Lets start with redistributing Nancy Pelosi's insider trading money back to the people. permalink parent award report block reply Steve1 -1 points 3 days ago Why - buying votes - this communist crap - cut my taxes make government smaller Eliminate property tax! Arrest the Coup gang - if you don’t there going to arrest you when they get back in power - fix elections NJ and VA just had machine elections WTF - permalink award report block reply Mhmm2MoreWeeks -1 points 3 days ago Trump gives everyone in America $2K. Imagine. The popularity of the Man. Just imagine. They call this Communism by the way. Good way to Segway to a UBI in a North American Union. permalink award report block reply HoganT -2 points 3 days ago Reeks of desperation. permalink award report block reply Logan051361 0 points 3 days ago AAre you kidding? People need Food, and bills get higher. we should be getting some back. Especially Seniors permalink parent award report block reply HoganT -1 points 3 days ago Seniors? So you didn’t work hard, build wealth, and budget for retirement accordingly so now we have to pay for you? How bought cut down on those 6:00 am cafe breakfasts and sell your million dollar appreciated $80,000 home and downsize? permalink parent award report block reply Logan051361 1 points 3 days ago Not all Seniors Are in the same boat. I know to retired Teachers that cant afford to pay all their bills by themselves and work at Walmart to make ends meet. this story is all across the country. thinking just cause you are tired you should be well off is bullshit permalink parent award report block reply HoganT 0 points 3 days ago So because you didn’t succeed in life we should pay for you? permalink parent award report block reply view 3 more comments... conservativefrank -2 points 3 days ago Terrific! Another tax payer funded dividend. You'll receive $2000. In return there will be higher taxes and more massive inflation. permalink award report block reply james_randall 3 points 3 days ago Comment removed upon the user being banned. permalink award report block reply freedom4Speech 1 points 3 days ago Comment removed by community moderators. permalink award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nchede 156 points 3 days ago What kind of stupid shit is this? I want to know who put this idea in his head. permalink award report block reply RedCapNation 120 points 3 days ago You’re right, it should be 25k to anyone who had family here before the immigration act. permalink parent award report block reply TooTrue-translation 41 points 3 days ago That sounds like \"Universal Basic Income\" which is what the mainstream media has been trying to familiarize us with for several years now. It is a communist nightmare. permalink parent award report block reply IAmTheScience 14 points 3 days ago It would be MASSIVELY inflationary. But with not just AI, but automation also, some things will have to change. I'm not saying I agree with this or not. permalink parent award report block reply daty_dato 10 points 3 days ago Not really. Most ppl will just pay bills with it. permalink parent award report block reply view 3 more comments... Hanging_Chad 6 points 3 days ago sounds like reparations for native Americans ✊🏻 permalink parent award report block reply Desktop 9 points 3 days ago There's not going to be any \"Paying down our enormous debt, 37 Trillion\".  I laughed when I read that.  Politicians were saying this in 1975 when the national debt was only 500 billion, which equivalent to only 3 Trillion in 2025 dollars. permalink parent award report block reply view 4 more comments... snoopy3210 5 points 3 days ago Nah a dividend is just a return on investment. He’s rebuilding American manufacturing. Problem is this is the wrong argument right now with the pending supreme court decision. It’s not about money collection. It’s about regulating BAD TRADE BEHAVIOR, like illegal dumping, by foreign countries during an emergency. Collecting the money is a plus but the not the main goal. permalink parent award report block reply JoePlumber 1 points 3 days ago One time payments are not UBI. permalink parent award report block reply Yawnz13 1 points 3 days ago Not if it's a one-time thing. permalink parent award report block reply load 1 more comments... UCantStumpTheTrump 1 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply RedStoneDeepState 1 points 3 days ago You keep proving you fuckers are socialists. permalink parent award report block reply maverick202 -5 points 3 days ago Huh? Woke right demands raparations now like blacks? permalink parent award report block reply GatoradeJeb 10 points 3 days ago Wokeright is ben shapiro, ted cruz and the rinos who out isreal above america permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply view 1 more comments... RedStoneDeepState -3 points 3 days ago Bullshit, you fuckers want to harm US National security by stopping missile defense system development permalink parent award report block reply view 9 more comments... Lordfred1993 24 points 3 days ago The people running for reelection next year... permalink parent award report block reply MastaJoda -9 points 3 days ago Fuck JD Vance slightly more likable and slightly less weird DeSantis 2.0. permalink parent award report block reply DickTick PRO 6 points 3 days ago I've noticed you very often have some extremely retarded takes. permalink parent award report block reply GatoradeJeb 4 points 3 days ago Jd is worse as he is for india the same way ted cruz simps for israel permalink parent award report block reply TrancePhreak 12 points 3 days ago It's James Fishback's idea. permalink parent award report block reply YaharaRiver 13 points 3 days ago Never heard of him (surprise!) so i looked him up. Very anti-DEI, values merit, very pro-America 👍 permalink parent award report block reply YaharaRiver 9 points 3 days ago Was it the implication that NOT A CENT will go to foreign international felons nor to those for whom $2k would not be felt that makes you call it “stupid shit”?? permalink parent award report block reply wmmiv2016v2 19 points 3 days ago Remember COVID stimulus and the resulting inflation??? permalink parent award report block reply Porkbut 6 points 3 days ago ☝️this is how you know left and media bots have overrun this website. Literal media rhetoric, repeated unironically and \"organically\" upbotted, sorry upvoted. Covid stimmy checks were a drop in the bucket of your inflation woes, yet you still repeat the same mindless drivel. At $2k, given to a third of the population, would total around 435 billion, which is 1.4 percent of the current national debt. Just shut up and stop spreading lies like blatant propagandists. The CRs passed most years add far more to inflation than a simple tariff surplus stimulus ever would. You poo pooing this is just another way the media gets its zombies to repeat its propaganda and undermine the Trump admins attempts to help the American people. permalink parent award report block reply Axiom502 2 points 3 days ago They want their pats on the head from massie faggots. permalink parent award report block reply chickeninoven 2 points 3 days ago You fucking idiot. The \"COVID stimulus\" was the CARES Act of 2020 and was a  $2.2 TRILLION spending bill. If you think that didn't affect inflation, you're even more retarded than I thought possible. permalink parent award report block reply view 1 more comments... GatoradeJeb 5 points 3 days ago Eliminate welfare and ebt permalink parent award report block reply OrdJFellow 3 points 3 days ago We shut down shipping, we shut down factories, paused debt repayments and gave everyone money to consume. Completely different circumstance to now. permalink parent award report block reply IAmTheScience 1 points 3 days ago Regardless of any morals or politics, or whether this is a good idea or not, yes this would be extremely inflationary. Like in the decade after unveiling this you would likely see prices triple. Money spent is what causes inflation. And this money would be spent by 2/3 of the people. Edit: people are talking about this as if it's monthly but I just realized he is referring to it as a one time thing. permalink parent award report block reply HoganP 2 points 3 days ago Inflation is 100% an effect of increased monetary supply.  Spending has nothing to do with it, although it's an easy conflation to make when spending is so often financed by increasing monetary supply. permalink parent award report block reply view 4 more comments... YaharaRiver 0 points 3 days ago Those two things are NOT connected whatsoever and it’s dishonest to imply they were. The covid-hoax gutted out entire legacies, and many people were fucked over by it. permalink parent award report block reply Hanging_Chad 9 points 3 days ago is we getting a stimmie check? permalink parent award report block reply view 3 more comments... Prof_Smith 4 points 3 days ago Thanks for letting us know you never took an economics course. Printing money like we do during covid caused massive inflation. Economically, we should have just let covid happen. permalink parent award report block reply view 9 more comments... chede 4 points 3 days ago Buying support with government money is stupid. permalink parent award report block reply YaharaRiver 10 points 3 days ago lawl 🙄 He’s returning it to the citizen victims from which it was STOLEN. There will be people WHO HATE HIM and would never vote for him who will benefit.  How is it buying their vote? fuck outta here permalink parent award report block reply Hanging_Chad 3 points 3 days ago I’d rather it spent on paying down the national debt permalink parent award report block reply view 11 more comments... canada_is_communist 1 points 3 days ago It worked in Quebec lol permalink parent award report block reply wilstjb 1 points 3 days ago Should be charging a fee to collect the tariffs. Will keep inflation down; heck increase taxes 1000% and zero inflation. permalink parent award report block reply lifeisahologram 8 points 3 days ago Probably Susie because it ultimately benefits her agenda if America is weak permalink parent award report block reply Youngman1234 6 points 3 days ago Explain? permalink parent award report block reply FatigueIsReal -2 points 3 days ago Lol.  Yes.  Susie fucking Wiles is the mastermind.  🤣🤣🤣 permalink parent award report block reply Porkbut 1 points 3 days ago These marvel children always need a thanos to be behind everything. permalink parent award report block reply load 28 more comments...\nRedCapNation 120 points 3 days ago You’re right, it should be 25k to anyone who had family here before the immigration act. permalink parent award report block reply TooTrue-translation 41 points 3 days ago That sounds like \"Universal Basic Income\" which is what the mainstream media has been trying to familiarize us with for several years now. It is a communist nightmare. permalink parent award report block reply IAmTheScience 14 points 3 days ago It would be MASSIVELY inflationary. But with not just AI, but automation also, some things will have to change. I'm not saying I agree with this or not. permalink parent award report block reply daty_dato 10 points 3 days ago Not really. Most ppl will just pay bills with it. permalink parent award report block reply view 3 more comments... Hanging_Chad 6 points 3 days ago sounds like reparations for native Americans ✊🏻 permalink parent award report block reply Desktop 9 points 3 days ago There's not going to be any \"Paying down our enormous debt, 37 Trillion\".  I laughed when I read that.  Politicians were saying this in 1975 when the national debt was only 500 billion, which equivalent to only 3 Trillion in 2025 dollars. permalink parent award report block reply view 4 more comments... snoopy3210 5 points 3 days ago Nah a dividend is just a return on investment. He’s rebuilding American manufacturing. Problem is this is the wrong argument right now with the pending supreme court decision. It’s not about money collection. It’s about regulating BAD TRADE BEHAVIOR, like illegal dumping, by foreign countries during an emergency. Collecting the money is a plus but the not the main goal. permalink parent award report block reply JoePlumber 1 points 3 days ago One time payments are not UBI. permalink parent award report block reply Yawnz13 1 points 3 days ago Not if it's a one-time thing. permalink parent award report block reply load 1 more comments... UCantStumpTheTrump 1 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply RedStoneDeepState 1 points 3 days ago You keep proving you fuckers are socialists. permalink parent award report block reply maverick202 -5 points 3 days ago Huh? Woke right demands raparations now like blacks? permalink parent award report block reply GatoradeJeb 10 points 3 days ago Wokeright is ben shapiro, ted cruz and the rinos who out isreal above america permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply view 1 more comments... RedStoneDeepState -3 points 3 days ago Bullshit, you fuckers want to harm US National security by stopping missile defense system development permalink parent award report block reply view 9 more comments...\nTooTrue-translation 41 points 3 days ago That sounds like \"Universal Basic Income\" which is what the mainstream media has been trying to familiarize us with for several years now. It is a communist nightmare. permalink parent award report block reply IAmTheScience 14 points 3 days ago It would be MASSIVELY inflationary. But with not just AI, but automation also, some things will have to change. I'm not saying I agree with this or not. permalink parent award report block reply daty_dato 10 points 3 days ago Not really. Most ppl will just pay bills with it. permalink parent award report block reply view 3 more comments... Hanging_Chad 6 points 3 days ago sounds like reparations for native Americans ✊🏻 permalink parent award report block reply Desktop 9 points 3 days ago There's not going to be any \"Paying down our enormous debt, 37 Trillion\".  I laughed when I read that.  Politicians were saying this in 1975 when the national debt was only 500 billion, which equivalent to only 3 Trillion in 2025 dollars. permalink parent award report block reply view 4 more comments... snoopy3210 5 points 3 days ago Nah a dividend is just a return on investment. He’s rebuilding American manufacturing. Problem is this is the wrong argument right now with the pending supreme court decision. It’s not about money collection. It’s about regulating BAD TRADE BEHAVIOR, like illegal dumping, by foreign countries during an emergency. Collecting the money is a plus but the not the main goal. permalink parent award report block reply JoePlumber 1 points 3 days ago One time payments are not UBI. permalink parent award report block reply Yawnz13 1 points 3 days ago Not if it's a one-time thing. permalink parent award report block reply load 1 more comments...\nIAmTheScience 14 points 3 days ago It would be MASSIVELY inflationary. But with not just AI, but automation also, some things will have to change. I'm not saying I agree with this or not. permalink parent award report block reply daty_dato 10 points 3 days ago Not really. Most ppl will just pay bills with it. permalink parent award report block reply view 3 more comments...\ndaty_dato 10 points 3 days ago Not really. Most ppl will just pay bills with it. permalink parent award report block reply view 3 more comments...\nHanging_Chad 6 points 3 days ago sounds like reparations for native Americans ✊🏻 permalink parent award report block reply Desktop 9 points 3 days ago There's not going to be any \"Paying down our enormous debt, 37 Trillion\".  I laughed when I read that.  Politicians were saying this in 1975 when the national debt was only 500 billion, which equivalent to only 3 Trillion in 2025 dollars. permalink parent award report block reply view 4 more comments...\nDesktop 9 points 3 days ago There's not going to be any \"Paying down our enormous debt, 37 Trillion\".  I laughed when I read that.  Politicians were saying this in 1975 when the national debt was only 500 billion, which equivalent to only 3 Trillion in 2025 dollars. permalink parent award report block reply view 4 more comments...\nsnoopy3210 5 points 3 days ago Nah a dividend is just a return on investment. He’s rebuilding American manufacturing. Problem is this is the wrong argument right now with the pending supreme court decision. It’s not about money collection. It’s about regulating BAD TRADE BEHAVIOR, like illegal dumping, by foreign countries during an emergency. Collecting the money is a plus but the not the main goal. permalink parent award report block reply\nJoePlumber 1 points 3 days ago One time payments are not UBI. permalink parent award report block reply\nYawnz13 1 points 3 days ago Not if it's a one-time thing. permalink parent award report block reply\nUCantStumpTheTrump 1 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply\nRedStoneDeepState 1 points 3 days ago You keep proving you fuckers are socialists. permalink parent award report block reply\nmaverick202 -5 points 3 days ago Huh? Woke right demands raparations now like blacks? permalink parent award report block reply GatoradeJeb 10 points 3 days ago Wokeright is ben shapiro, ted cruz and the rinos who out isreal above america permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply view 1 more comments... RedStoneDeepState -3 points 3 days ago Bullshit, you fuckers want to harm US National security by stopping missile defense system development permalink parent award report block reply view 9 more comments...\nGatoradeJeb 10 points 3 days ago Wokeright is ben shapiro, ted cruz and the rinos who out isreal above america permalink parent award report block reply UCantStumpTheTrump 2 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply view 1 more comments... RedStoneDeepState -3 points 3 days ago Bullshit, you fuckers want to harm US National security by stopping missile defense system development permalink parent award report block reply view 9 more comments...\nUCantStumpTheTrump 2 points 3 days ago keep in mind u/maverick202 is a self-admitted black Democrat from Chicago, who only comes here to troll \"incels\" and \"white trash\" (just read his post history), and he also believes Joe Biden won the most votes of any President in US history lmfao permalink parent award report block reply view 1 more comments...\nRedStoneDeepState -3 points 3 days ago Bullshit, you fuckers want to harm US National security by stopping missile defense system development permalink parent award report block reply view 9 more comments...\nLordfred1993 24 points 3 days ago The people running for reelection next year... permalink parent award report block reply MastaJoda -9 points 3 days ago Fuck JD Vance slightly more likable and slightly less weird DeSantis 2.0. permalink parent award report block reply DickTick PRO 6 points 3 days ago I've noticed you very often have some extremely retarded takes. permalink parent award report block reply GatoradeJeb 4 points 3 days ago Jd is worse as he is for india the same way ted cruz simps for israel permalink parent award report block reply\nMastaJoda -9 points 3 days ago Fuck JD Vance slightly more likable and slightly less weird DeSantis 2.0. permalink parent award report block reply DickTick PRO 6 points 3 days ago I've noticed you very often have some extremely retarded takes. permalink parent award report block reply GatoradeJeb 4 points 3 days ago Jd is worse as he is for india the same way ted cruz simps for israel permalink parent award report block reply\nDickTick PRO 6 points 3 days ago I've noticed you very often have some extremely retarded takes. permalink parent award report block reply\nGatoradeJeb 4 points 3 days ago Jd is worse as he is for india the same way ted cruz simps for israel permalink parent award report block reply\nTrancePhreak 12 points 3 days ago It's James Fishback's idea. permalink parent award report block reply YaharaRiver 13 points 3 days ago Never heard of him (surprise!) so i looked him up. Very anti-DEI, values merit, very pro-America 👍 permalink parent award report block reply\nYaharaRiver 13 points 3 days ago Never heard of him (surprise!) so i looked him up. Very anti-DEI, values merit, very pro-America 👍 permalink parent award report block reply\nYaharaRiver 9 points 3 days ago Was it the implication that NOT A CENT will go to foreign international felons nor to those for whom $2k would not be felt that makes you call it “stupid shit”?? permalink parent award report block reply wmmiv2016v2 19 points 3 days ago Remember COVID stimulus and the resulting inflation??? permalink parent award report block reply Porkbut 6 points 3 days ago ☝️this is how you know left and media bots have overrun this website. Literal media rhetoric, repeated unironically and \"organically\" upbotted, sorry upvoted. Covid stimmy checks were a drop in the bucket of your inflation woes, yet you still repeat the same mindless drivel. At $2k, given to a third of the population, would total around 435 billion, which is 1.4 percent of the current national debt. Just shut up and stop spreading lies like blatant propagandists. The CRs passed most years add far more to inflation than a simple tariff surplus stimulus ever would. You poo pooing this is just another way the media gets its zombies to repeat its propaganda and undermine the Trump admins attempts to help the American people. permalink parent award report block reply Axiom502 2 points 3 days ago They want their pats on the head from massie faggots. permalink parent award report block reply chickeninoven 2 points 3 days ago You fucking idiot. The \"COVID stimulus\" was the CARES Act of 2020 and was a  $2.2 TRILLION spending bill. If you think that didn't affect inflation, you're even more retarded than I thought possible. permalink parent award report block reply view 1 more comments... GatoradeJeb 5 points 3 days ago Eliminate welfare and ebt permalink parent award report block reply OrdJFellow 3 points 3 days ago We shut down shipping, we shut down factories, paused debt repayments and gave everyone money to consume. Completely different circumstance to now. permalink parent award report block reply IAmTheScience 1 points 3 days ago Regardless of any morals or politics, or whether this is a good idea or not, yes this would be extremely inflationary. Like in the decade after unveiling this you would likely see prices triple. Money spent is what causes inflation. And this money would be spent by 2/3 of the people. Edit: people are talking about this as if it's monthly but I just realized he is referring to it as a one time thing. permalink parent award report block reply HoganP 2 points 3 days ago Inflation is 100% an effect of increased monetary supply.  Spending has nothing to do with it, although it's an easy conflation to make when spending is so often financed by increasing monetary supply. permalink parent award report block reply view 4 more comments... YaharaRiver 0 points 3 days ago Those two things are NOT connected whatsoever and it’s dishonest to imply they were. The covid-hoax gutted out entire legacies, and many people were fucked over by it. permalink parent award report block reply Hanging_Chad 9 points 3 days ago is we getting a stimmie check? permalink parent award report block reply view 3 more comments... Prof_Smith 4 points 3 days ago Thanks for letting us know you never took an economics course. Printing money like we do during covid caused massive inflation. Economically, we should have just let covid happen. permalink parent award report block reply view 9 more comments... chede 4 points 3 days ago Buying support with government money is stupid. permalink parent award report block reply YaharaRiver 10 points 3 days ago lawl 🙄 He’s returning it to the citizen victims from which it was STOLEN. There will be people WHO HATE HIM and would never vote for him who will benefit.  How is it buying their vote? fuck outta here permalink parent award report block reply Hanging_Chad 3 points 3 days ago I’d rather it spent on paying down the national debt permalink parent award report block reply view 11 more comments... canada_is_communist 1 points 3 days ago It worked in Quebec lol permalink parent award report block reply wilstjb 1 points 3 days ago Should be charging a fee to collect the tariffs. Will keep inflation down; heck increase taxes 1000% and zero inflation. permalink parent award report block reply\nwmmiv2016v2 19 points 3 days ago Remember COVID stimulus and the resulting inflation??? permalink parent award report block reply Porkbut 6 points 3 days ago ☝️this is how you know left and media bots have overrun this website. Literal media rhetoric, repeated unironically and \"organically\" upbotted, sorry upvoted. Covid stimmy checks were a drop in the bucket of your inflation woes, yet you still repeat the same mindless drivel. At $2k, given to a third of the population, would total around 435 billion, which is 1.4 percent of the current national debt. Just shut up and stop spreading lies like blatant propagandists. The CRs passed most years add far more to inflation than a simple tariff surplus stimulus ever would. You poo pooing this is just another way the media gets its zombies to repeat its propaganda and undermine the Trump admins attempts to help the American people. permalink parent award report block reply Axiom502 2 points 3 days ago They want their pats on the head from massie faggots. permalink parent award report block reply chickeninoven 2 points 3 days ago You fucking idiot. The \"COVID stimulus\" was the CARES Act of 2020 and was a  $2.2 TRILLION spending bill. If you think that didn't affect inflation, you're even more retarded than I thought possible. permalink parent award report block reply view 1 more comments... GatoradeJeb 5 points 3 days ago Eliminate welfare and ebt permalink parent award report block reply OrdJFellow 3 points 3 days ago We shut down shipping, we shut down factories, paused debt repayments and gave everyone money to consume. Completely different circumstance to now. permalink parent award report block reply IAmTheScience 1 points 3 days ago Regardless of any morals or politics, or whether this is a good idea or not, yes this would be extremely inflationary. Like in the decade after unveiling this you would likely see prices triple. Money spent is what causes inflation. And this money would be spent by 2/3 of the people. Edit: people are talking about this as if it's monthly but I just realized he is referring to it as a one time thing. permalink parent award report block reply HoganP 2 points 3 days ago Inflation is 100% an effect of increased monetary supply.  Spending has nothing to do with it, although it's an easy conflation to make when spending is so often financed by increasing monetary supply. permalink parent award report block reply view 4 more comments... YaharaRiver 0 points 3 days ago Those two things are NOT connected whatsoever and it’s dishonest to imply they were. The covid-hoax gutted out entire legacies, and many people were fucked over by it. permalink parent award report block reply Hanging_Chad 9 points 3 days ago is we getting a stimmie check? permalink parent award report block reply view 3 more comments... Prof_Smith 4 points 3 days ago Thanks for letting us know you never took an economics course. Printing money like we do during covid caused massive inflation. Economically, we should have just let covid happen. permalink parent award report block reply view 9 more comments...\nPorkbut 6 points 3 days ago ☝️this is how you know left and media bots have overrun this website. Literal media rhetoric, repeated unironically and \"organically\" upbotted, sorry upvoted. Covid stimmy checks were a drop in the bucket of your inflation woes, yet you still repeat the same mindless drivel. At $2k, given to a third of the population, would total around 435 billion, which is 1.4 percent of the current national debt. Just shut up and stop spreading lies like blatant propagandists. The CRs passed most years add far more to inflation than a simple tariff surplus stimulus ever would. You poo pooing this is just another way the media gets its zombies to repeat its propaganda and undermine the Trump admins attempts to help the American people. permalink parent award report block reply Axiom502 2 points 3 days ago They want their pats on the head from massie faggots. permalink parent award report block reply chickeninoven 2 points 3 days ago You fucking idiot. The \"COVID stimulus\" was the CARES Act of 2020 and was a  $2.2 TRILLION spending bill. If you think that didn't affect inflation, you're even more retarded than I thought possible. permalink parent award report block reply view 1 more comments...\nAxiom502 2 points 3 days ago They want their pats on the head from massie faggots. permalink parent award report block reply\nchickeninoven 2 points 3 days ago You fucking idiot. The \"COVID stimulus\" was the CARES Act of 2020 and was a  $2.2 TRILLION spending bill. If you think that didn't affect inflation, you're even more retarded than I thought possible. permalink parent award report block reply view 1 more comments...\nGatoradeJeb 5 points 3 days ago Eliminate welfare and ebt permalink parent award report block reply\nOrdJFellow 3 points 3 days ago We shut down shipping, we shut down factories, paused debt repayments and gave everyone money to consume. Completely different circumstance to now. permalink parent award report block reply\nIAmTheScience 1 points 3 days ago Regardless of any morals or politics, or whether this is a good idea or not, yes this would be extremely inflationary. Like in the decade after unveiling this you would likely see prices triple. Money spent is what causes inflation. And this money would be spent by 2/3 of the people. Edit: people are talking about this as if it's monthly but I just realized he is referring to it as a one time thing. permalink parent award report block reply HoganP 2 points 3 days ago Inflation is 100% an effect of increased monetary supply.  Spending has nothing to do with it, although it's an easy conflation to make when spending is so often financed by increasing monetary supply. permalink parent award report block reply view 4 more comments...\nHoganP 2 points 3 days ago Inflation is 100% an effect of increased monetary supply.  Spending has nothing to do with it, although it's an easy conflation to make when spending is so often financed by increasing monetary supply. permalink parent award report block reply view 4 more comments...\nYaharaRiver 0 points 3 days ago Those two things are NOT connected whatsoever and it’s dishonest to imply they were. The covid-hoax gutted out entire legacies, and many people were fucked over by it. permalink parent award report block reply Hanging_Chad 9 points 3 days ago is we getting a stimmie check? permalink parent award report block reply view 3 more comments... Prof_Smith 4 points 3 days ago Thanks for letting us know you never took an economics course. Printing money like we do during covid caused massive inflation. Economically, we should have just let covid happen. permalink parent award report block reply view 9 more comments...\nHanging_Chad 9 points 3 days ago is we getting a stimmie check? permalink parent award report block reply view 3 more comments...\nProf_Smith 4 points 3 days ago Thanks for letting us know you never took an economics course. Printing money like we do during covid caused massive inflation. Economically, we should have just let covid happen. permalink parent award report block reply view 9 more comments...\nchede 4 points 3 days ago Buying support with government money is stupid. permalink parent award report block reply YaharaRiver 10 points 3 days ago lawl 🙄 He’s returning it to the citizen victims from which it was STOLEN. There will be people WHO HATE HIM and would never vote for him who will benefit.  How is it buying their vote? fuck outta here permalink parent award report block reply Hanging_Chad 3 points 3 days ago I’d rather it spent on paying down the national debt permalink parent award report block reply view 11 more comments... canada_is_communist 1 points 3 days ago It worked in Quebec lol permalink parent award report block reply wilstjb 1 points 3 days ago Should be charging a fee to collect the tariffs. Will keep inflation down; heck increase taxes 1000% and zero inflation. permalink parent award report block reply\nYaharaRiver 10 points 3 days ago lawl 🙄 He’s returning it to the citizen victims from which it was STOLEN. There will be people WHO HATE HIM and would never vote for him who will benefit.  How is it buying their vote? fuck outta here permalink parent award report block reply Hanging_Chad 3 points 3 days ago I’d rather it spent on paying down the national debt permalink parent award report block reply view 11 more comments...\nHanging_Chad 3 points 3 days ago I’d rather it spent on paying down the national debt permalink parent award report block reply view 11 more comments...\ncanada_is_communist 1 points 3 days ago It worked in Quebec lol permalink parent award report block reply\nwilstjb 1 points 3 days ago Should be charging a fee to collect the tariffs. Will keep inflation down; heck increase taxes 1000% and zero inflation. permalink parent award report block reply\nlifeisahologram 8 points 3 days ago Probably Susie because it ultimately benefits her agenda if America is weak permalink parent award report block reply Youngman1234 6 points 3 days ago Explain? permalink parent award report block reply FatigueIsReal -2 points 3 days ago Lol.  Yes.  Susie fucking Wiles is the mastermind.  🤣🤣🤣 permalink parent award report block reply Porkbut 1 points 3 days ago These marvel children always need a thanos to be behind everything. permalink parent award report block reply\nYoungman1234 6 points 3 days ago Explain? permalink parent award report block reply\nFatigueIsReal -2 points 3 days ago Lol.  Yes.  Susie fucking Wiles is the mastermind.  🤣🤣🤣 permalink parent award report block reply Porkbut 1 points 3 days ago These marvel children always need a thanos to be behind everything. permalink parent award report block reply\nPorkbut 1 points 3 days ago These marvel children always need a thanos to be behind everything. permalink parent award report block reply\nBullet_Tooth_Tony 110 points 3 days ago 50 year mortgages and now more poor people checks...? LMFAO what is this dude on lately 😂 permalink award report block reply guywholikesDjtof2024 87 points 3 days ago still waiting on 5,000$ DOGE checks and Fort Knox gold audit permalink parent award report block reply Hanging_Chad 8 points 3 days ago the gold has been converted into BTC permalink parent award report block reply MasterChief 3 points 3 days ago you mean $TRUMPCoin permalink parent award report block reply CPT88 3 points 3 days ago Epstein files. permalink parent award report block reply Texas_81 16 points 3 days ago Trump is not the same.. no mass deportations, no golden age, inflation is still high af and he denies it! This is all bullshit. We are not winning we’re losing permalink parent award report block reply RedStoneDeepState 1 points 3 days ago Inflation is not high, its virtually zero permalink parent award report block reply GA_Logic 2 points 3 days ago Agreed by December it will be clear. permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply Braineack 8 points 3 days ago The Democrat diet. permalink parent award report block reply YaharaRiver 4 points 3 days ago Does playing the “long game” fill you with Concern?? permalink parent award report block reply Donger-Lord 2 points 3 days ago Who the fuck is this guy even listening to? Does he not remember who got him into office? permalink parent award report block reply load 27 more comments...\nguywholikesDjtof2024 87 points 3 days ago still waiting on 5,000$ DOGE checks and Fort Knox gold audit permalink parent award report block reply Hanging_Chad 8 points 3 days ago the gold has been converted into BTC permalink parent award report block reply MasterChief 3 points 3 days ago you mean $TRUMPCoin permalink parent award report block reply CPT88 3 points 3 days ago Epstein files. permalink parent award report block reply\nHanging_Chad 8 points 3 days ago the gold has been converted into BTC permalink parent award report block reply MasterChief 3 points 3 days ago you mean $TRUMPCoin permalink parent award report block reply\nMasterChief 3 points 3 days ago you mean $TRUMPCoin permalink parent award report block reply\nCPT88 3 points 3 days ago Epstein files. permalink parent award report block reply\nTexas_81 16 points 3 days ago Trump is not the same.. no mass deportations, no golden age, inflation is still high af and he denies it! This is all bullshit. We are not winning we’re losing permalink parent award report block reply RedStoneDeepState 1 points 3 days ago Inflation is not high, its virtually zero permalink parent award report block reply GA_Logic 2 points 3 days ago Agreed by December it will be clear. permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nRedStoneDeepState 1 points 3 days ago Inflation is not high, its virtually zero permalink parent award report block reply GA_Logic 2 points 3 days ago Agreed by December it will be clear. permalink parent award report block reply\nGA_Logic 2 points 3 days ago Agreed by December it will be clear. permalink parent award report block reply\nTheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nBraineack 8 points 3 days ago The Democrat diet. permalink parent award report block reply\nYaharaRiver 4 points 3 days ago Does playing the “long game” fill you with Concern?? permalink parent award report block reply\nDonger-Lord 2 points 3 days ago Who the fuck is this guy even listening to? Does he not remember who got him into office? permalink parent award report block reply\nThefrogeatsfree 92 points 3 days ago I didnt vote for this. Pay off the debt permalink award report block reply HelluvaEngineer 20 points 3 days ago How can the debt ever be paid off?  That's not how our monetary system works. permalink parent award report block reply Thefrogeatsfree 18 points 3 days ago Its been paid off before, granted that was before we were chained to central banking permalink parent award report block reply 0111000001100101 11 points 3 days ago There is no debt.  It's all fictional, with zero value, no consideration, and no contract. permalink parent award report block reply songman727 2 points 3 days ago I've got enough money to last me the rest of my life..... Unless I buy something. permalink parent award report block reply RedStoneDeepState 0 points 3 days ago This is complete nonsense permalink parent award report block reply RockyBalboa 5 points 3 days ago U.S. has to cease borrowing money from the privately-owned Federal Reserve bank (every penny borrowed comes with interest.) Make spending less than revenue. Reduce national debt to zero. permalink parent award report block reply RedStoneDeepState 1 points 3 days ago U.S. has to cease borrowing money from the privately-owned Federal Reserve bank (every penny borrowed comes with interest.) The national debt isnt borrowed from the federal reserve, its financed with bonds. permalink parent award report block reply Thunnus73 3 points 3 days ago Bitcoin permalink parent award report block reply Pede45 11 points 3 days ago I didn't cause the debt. You are more than welcome to pay it off. I'll take my money back thank you. permalink parent award report block reply Thefrogeatsfree 2 points 3 days ago It wasn't your money though, at this point it was your great grandkids money that spent permalink parent award report block reply GatoradeJeb 10 points 3 days ago I didnt vote for welfare and ebt for blacks and latinos. I want my money back permalink parent award report block reply NebraskanPatriot 6 points 3 days ago Today Trump doubled the payment to Argentina to $40 Billion to help out Argentina's cattle ranchers. Let that sink in.  We are in serious debt and the President chooses to send YOUR tax dollars to Argentina to subsidize their ranchers so that they can undercut OUR ranchers. It's your money.  I hope you like what Trump's doing with it. #ArgentinaFirst permalink parent award report block reply GatoradeJeb 1 points 2 days ago Cool now do israel permalink parent award report block reply Porkbut 7 points 3 days ago This amounts to ~$435 billion, or 1.4% of the debt. The next CR will wipeout all that payment, and double the debt contribution you attempted to alleviate. Better to give it to people who can actually use it, and give a real and meaningful sense of policy impact to your average voter, than some performative placation of people who dont understand how Keynesian economics works. permalink parent award report block reply NebraskanPatriot 0 points 3 days ago Well, Trump announced today that he is DOUBLING the amount of our tax dollars that go to help Argentina's cattle ranchers.  Does that qualify as 'people who can actually use it?' Because, technically, Argentina can actually use your hard-earned tax dollars. permalink parent award report block reply Porkbut 3 points 3 days ago Thats a blatant lie, hes not using tax dollars for this, propagandist, hes just allowing more imports by using a targeted tariff structure. Nothing to do with tax funds at all, liar. Those ranchers increasing their own production would have stopped it from happening in the first place, as hes doing it in response to artificially high beef prices. But they chose a different path to protect short term financial considerations, and that has long term consequences. So nah, dont care about your incredibly fallacious opinion. Lie to a retard who will believe it, handshake. permalink parent award report block reply Megaboom2025 2 points 3 days ago Can’t pay it off with tariffs. Need to abolish the federal reserve and make budget deficits illegal before it can even begin to be tackled. permalink parent award report block reply Thefrogeatsfree 1 points 3 days ago Agreed, it'll take multiple ways permalink parent award report block reply load 23 more comments...\nHelluvaEngineer 20 points 3 days ago How can the debt ever be paid off?  That's not how our monetary system works. permalink parent award report block reply Thefrogeatsfree 18 points 3 days ago Its been paid off before, granted that was before we were chained to central banking permalink parent award report block reply 0111000001100101 11 points 3 days ago There is no debt.  It's all fictional, with zero value, no consideration, and no contract. permalink parent award report block reply songman727 2 points 3 days ago I've got enough money to last me the rest of my life..... Unless I buy something. permalink parent award report block reply RedStoneDeepState 0 points 3 days ago This is complete nonsense permalink parent award report block reply RockyBalboa 5 points 3 days ago U.S. has to cease borrowing money from the privately-owned Federal Reserve bank (every penny borrowed comes with interest.) Make spending less than revenue. Reduce national debt to zero. permalink parent award report block reply RedStoneDeepState 1 points 3 days ago U.S. has to cease borrowing money from the privately-owned Federal Reserve bank (every penny borrowed comes with interest.) The national debt isnt borrowed from the federal reserve, its financed with bonds. permalink parent award report block reply Thunnus73 3 points 3 days ago Bitcoin permalink parent award report block reply\nThefrogeatsfree 18 points 3 days ago Its been paid off before, granted that was before we were chained to central banking permalink parent award report block reply\n0111000001100101 11 points 3 days ago There is no debt.  It's all fictional, with zero value, no consideration, and no contract. permalink parent award report block reply songman727 2 points 3 days ago I've got enough money to last me the rest of my life..... Unless I buy something. permalink parent award report block reply RedStoneDeepState 0 points 3 days ago This is complete nonsense permalink parent award report block reply\nsongman727 2 points 3 days ago I've got enough money to last me the rest of my life..... Unless I buy something. permalink parent award report block reply\nRedStoneDeepState 0 points 3 days ago This is complete nonsense permalink parent award report block reply\nRockyBalboa 5 points 3 days ago U.S. has to cease borrowing money from the privately-owned Federal Reserve bank (every penny borrowed comes with interest.) Make spending less than revenue. Reduce national debt to zero. permalink parent award report block reply RedStoneDeepState 1 points 3 days ago U.S. has to cease borrowing money from the privately-owned Federal Reserve bank (every penny borrowed comes with interest.) The national debt isnt borrowed from the federal reserve, its financed with bonds. permalink parent award report block reply\nRedStoneDeepState 1 points 3 days ago U.S. has to cease borrowing money from the privately-owned Federal Reserve bank (every penny borrowed comes with interest.) The national debt isnt borrowed from the federal reserve, its financed with bonds. permalink parent award report block reply\nThunnus73 3 points 3 days ago Bitcoin permalink parent award report block reply\nPede45 11 points 3 days ago I didn't cause the debt. You are more than welcome to pay it off. I'll take my money back thank you. permalink parent award report block reply Thefrogeatsfree 2 points 3 days ago It wasn't your money though, at this point it was your great grandkids money that spent permalink parent award report block reply\nThefrogeatsfree 2 points 3 days ago It wasn't your money though, at this point it was your great grandkids money that spent permalink parent award report block reply\nGatoradeJeb 10 points 3 days ago I didnt vote for welfare and ebt for blacks and latinos. I want my money back permalink parent award report block reply NebraskanPatriot 6 points 3 days ago Today Trump doubled the payment to Argentina to $40 Billion to help out Argentina's cattle ranchers. Let that sink in.  We are in serious debt and the President chooses to send YOUR tax dollars to Argentina to subsidize their ranchers so that they can undercut OUR ranchers. It's your money.  I hope you like what Trump's doing with it. #ArgentinaFirst permalink parent award report block reply GatoradeJeb 1 points 2 days ago Cool now do israel permalink parent award report block reply\nNebraskanPatriot 6 points 3 days ago Today Trump doubled the payment to Argentina to $40 Billion to help out Argentina's cattle ranchers. Let that sink in.  We are in serious debt and the President chooses to send YOUR tax dollars to Argentina to subsidize their ranchers so that they can undercut OUR ranchers. It's your money.  I hope you like what Trump's doing with it. #ArgentinaFirst permalink parent award report block reply GatoradeJeb 1 points 2 days ago Cool now do israel permalink parent award report block reply\nGatoradeJeb 1 points 2 days ago Cool now do israel permalink parent award report block reply\nPorkbut 7 points 3 days ago This amounts to ~$435 billion, or 1.4% of the debt. The next CR will wipeout all that payment, and double the debt contribution you attempted to alleviate. Better to give it to people who can actually use it, and give a real and meaningful sense of policy impact to your average voter, than some performative placation of people who dont understand how Keynesian economics works. permalink parent award report block reply NebraskanPatriot 0 points 3 days ago Well, Trump announced today that he is DOUBLING the amount of our tax dollars that go to help Argentina's cattle ranchers.  Does that qualify as 'people who can actually use it?' Because, technically, Argentina can actually use your hard-earned tax dollars. permalink parent award report block reply Porkbut 3 points 3 days ago Thats a blatant lie, hes not using tax dollars for this, propagandist, hes just allowing more imports by using a targeted tariff structure. Nothing to do with tax funds at all, liar. Those ranchers increasing their own production would have stopped it from happening in the first place, as hes doing it in response to artificially high beef prices. But they chose a different path to protect short term financial considerations, and that has long term consequences. So nah, dont care about your incredibly fallacious opinion. Lie to a retard who will believe it, handshake. permalink parent award report block reply\nNebraskanPatriot 0 points 3 days ago Well, Trump announced today that he is DOUBLING the amount of our tax dollars that go to help Argentina's cattle ranchers.  Does that qualify as 'people who can actually use it?' Because, technically, Argentina can actually use your hard-earned tax dollars. permalink parent award report block reply Porkbut 3 points 3 days ago Thats a blatant lie, hes not using tax dollars for this, propagandist, hes just allowing more imports by using a targeted tariff structure. Nothing to do with tax funds at all, liar. Those ranchers increasing their own production would have stopped it from happening in the first place, as hes doing it in response to artificially high beef prices. But they chose a different path to protect short term financial considerations, and that has long term consequences. So nah, dont care about your incredibly fallacious opinion. Lie to a retard who will believe it, handshake. permalink parent award report block reply\nPorkbut 3 points 3 days ago Thats a blatant lie, hes not using tax dollars for this, propagandist, hes just allowing more imports by using a targeted tariff structure. Nothing to do with tax funds at all, liar. Those ranchers increasing their own production would have stopped it from happening in the first place, as hes doing it in response to artificially high beef prices. But they chose a different path to protect short term financial considerations, and that has long term consequences. So nah, dont care about your incredibly fallacious opinion. Lie to a retard who will believe it, handshake. permalink parent award report block reply\nMegaboom2025 2 points 3 days ago Can’t pay it off with tariffs. Need to abolish the federal reserve and make budget deficits illegal before it can even begin to be tackled. permalink parent award report block reply Thefrogeatsfree 1 points 3 days ago Agreed, it'll take multiple ways permalink parent award report block reply\nThefrogeatsfree 1 points 3 days ago Agreed, it'll take multiple ways permalink parent award report block reply\nScoobyDum 67 points 3 days ago $2000 will do nothing but cause more inflation. Pay off the debt or just stop collecting tariffs ffs. permalink award report block reply newestofnew 21 points 3 days ago the money already exists and had velocity, otherwise it couldn't have been collected as a tariff. it will have no supply side impact on inflation. it will likely go to pay down debt, just like the majority of covid stimmies, so will not go towards new goods or services either. so inflation impact minimal. permalink parent award report block reply Wexit-Delecto 10 points 3 days ago Lol Keynes. Didn’t covid herald a wave of massive inflation? Expand the money supply, cause inflation. Simple as. permalink parent award report block reply Isolated_Patriot 12 points 3 days ago Because they PRINTED money. This isn't about printing money. Expand the money supply, cause inflation. Simple as. There is nothing in this proposal about expanding the money supply. permalink parent award report block reply Wexit-Delecto -2 points 3 days ago There was during covid, which was the point. The fellow to whom I responded was saying the covid spending didn’t cause inflation because of some keynesian velocity mumbo jumbo. permalink parent award report block reply view 1 more comments... newestofnew 4 points 3 days ago perpetual election loser neocons and country club types like yourself to point to the 200 billion in stimmies to working people as the cause of inflation. but ignore the waves of trillions in liquidity injection the fed pumped into the asset class at the same time. the fed is still at it as well. money machine hasn't stopped feeding the banks since Silicon Valley bank. permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Not at all. All socialism must stop or the economy will continue to circle the drain. Since government is perennially corrupt, the only way to stop it is to cut the size of government down to the absolute bare minimum required. permalink parent award report block reply view 2 more comments... GatoradeJeb 3 points 3 days ago Funny how you retards support welfare and ebt for blacks and latinos but no to americans getting money back they paid in taxes permalink parent award report block reply Wexit-Delecto 0 points 3 days ago I don’t support any welfare of any kind. permalink parent award report block reply view 1 more comments... MastaJoda 2 points 3 days ago Of course the stimulus checks caused MASSIVE inflation, as it will every time the govt hands out Tillions to citizens. This isnt even up for debate. Stimulus checks only helps corporations and in turn wall street. As everyone is nagger rich for a day and they blow it before they even get it. permalink parent award report block reply MikeyisNinja 3 points 3 days ago I’m going to dump mine into memes like I did in 2021. permalink parent award report block reply Beachboy1b 2 points 3 days ago There is a staggering number of people on here that fail to understand what you just said. permalink parent award report block reply GA_Logic 1 points 3 days ago Unfortunately this thread reveals people do not understand how inflation works. The money exists already like you said and it is being returned to the taxpayers. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago No. The SCOTUS will rule tariffs illegal, will order the money returned to importers, big companies will use that money to buy back stock, they will keep prices high and the stock price will increase. permalink parent award report block reply load 1 more comments... HuggableBear 16 points 3 days ago Or maybe lower tax rates instead of just cutting us a check one time permalink parent award report block reply flashersenpai -2 points 3 days ago tax rate doesn't put money into someone's account or pay their utility bills no point in paying lower taxes if you lose your apartment anyway permalink parent award report block reply HuggableBear 4 points 3 days ago Literally does, you moron, and it does it repeatedly instead of just once permalink parent award report block reply 123breadman 5 points 3 days ago He's a business boomer CEO. When they get his with lawsuits they have to pay millions of dollars that are paid to their millions of people only totaling about $1 per person. He's going to pay $2,000 per person (which is not a life changing amount) and claim he paid billions out to americans. It's what boomers do. permalink parent award report block reply Pede45 3 points 3 days ago I'll take your check. permalink parent award report block reply GA_Logic 2 points 3 days ago I want my check too because that is our money as US citizens. permalink parent award report block reply DCYR66 1 points 3 days ago That just may buy a days worth of groceries. permalink parent award report block reply load 4 more comments...\nnewestofnew 21 points 3 days ago the money already exists and had velocity, otherwise it couldn't have been collected as a tariff. it will have no supply side impact on inflation. it will likely go to pay down debt, just like the majority of covid stimmies, so will not go towards new goods or services either. so inflation impact minimal. permalink parent award report block reply Wexit-Delecto 10 points 3 days ago Lol Keynes. Didn’t covid herald a wave of massive inflation? Expand the money supply, cause inflation. Simple as. permalink parent award report block reply Isolated_Patriot 12 points 3 days ago Because they PRINTED money. This isn't about printing money. Expand the money supply, cause inflation. Simple as. There is nothing in this proposal about expanding the money supply. permalink parent award report block reply Wexit-Delecto -2 points 3 days ago There was during covid, which was the point. The fellow to whom I responded was saying the covid spending didn’t cause inflation because of some keynesian velocity mumbo jumbo. permalink parent award report block reply view 1 more comments... newestofnew 4 points 3 days ago perpetual election loser neocons and country club types like yourself to point to the 200 billion in stimmies to working people as the cause of inflation. but ignore the waves of trillions in liquidity injection the fed pumped into the asset class at the same time. the fed is still at it as well. money machine hasn't stopped feeding the banks since Silicon Valley bank. permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Not at all. All socialism must stop or the economy will continue to circle the drain. Since government is perennially corrupt, the only way to stop it is to cut the size of government down to the absolute bare minimum required. permalink parent award report block reply view 2 more comments... GatoradeJeb 3 points 3 days ago Funny how you retards support welfare and ebt for blacks and latinos but no to americans getting money back they paid in taxes permalink parent award report block reply Wexit-Delecto 0 points 3 days ago I don’t support any welfare of any kind. permalink parent award report block reply view 1 more comments... MastaJoda 2 points 3 days ago Of course the stimulus checks caused MASSIVE inflation, as it will every time the govt hands out Tillions to citizens. This isnt even up for debate. Stimulus checks only helps corporations and in turn wall street. As everyone is nagger rich for a day and they blow it before they even get it. permalink parent award report block reply MikeyisNinja 3 points 3 days ago I’m going to dump mine into memes like I did in 2021. permalink parent award report block reply Beachboy1b 2 points 3 days ago There is a staggering number of people on here that fail to understand what you just said. permalink parent award report block reply GA_Logic 1 points 3 days ago Unfortunately this thread reveals people do not understand how inflation works. The money exists already like you said and it is being returned to the taxpayers. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago No. The SCOTUS will rule tariffs illegal, will order the money returned to importers, big companies will use that money to buy back stock, they will keep prices high and the stock price will increase. permalink parent award report block reply load 1 more comments...\nWexit-Delecto 10 points 3 days ago Lol Keynes. Didn’t covid herald a wave of massive inflation? Expand the money supply, cause inflation. Simple as. permalink parent award report block reply Isolated_Patriot 12 points 3 days ago Because they PRINTED money. This isn't about printing money. Expand the money supply, cause inflation. Simple as. There is nothing in this proposal about expanding the money supply. permalink parent award report block reply Wexit-Delecto -2 points 3 days ago There was during covid, which was the point. The fellow to whom I responded was saying the covid spending didn’t cause inflation because of some keynesian velocity mumbo jumbo. permalink parent award report block reply view 1 more comments... newestofnew 4 points 3 days ago perpetual election loser neocons and country club types like yourself to point to the 200 billion in stimmies to working people as the cause of inflation. but ignore the waves of trillions in liquidity injection the fed pumped into the asset class at the same time. the fed is still at it as well. money machine hasn't stopped feeding the banks since Silicon Valley bank. permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Not at all. All socialism must stop or the economy will continue to circle the drain. Since government is perennially corrupt, the only way to stop it is to cut the size of government down to the absolute bare minimum required. permalink parent award report block reply view 2 more comments... GatoradeJeb 3 points 3 days ago Funny how you retards support welfare and ebt for blacks and latinos but no to americans getting money back they paid in taxes permalink parent award report block reply Wexit-Delecto 0 points 3 days ago I don’t support any welfare of any kind. permalink parent award report block reply view 1 more comments... MastaJoda 2 points 3 days ago Of course the stimulus checks caused MASSIVE inflation, as it will every time the govt hands out Tillions to citizens. This isnt even up for debate. Stimulus checks only helps corporations and in turn wall street. As everyone is nagger rich for a day and they blow it before they even get it. permalink parent award report block reply\nIsolated_Patriot 12 points 3 days ago Because they PRINTED money. This isn't about printing money. Expand the money supply, cause inflation. Simple as. There is nothing in this proposal about expanding the money supply. permalink parent award report block reply Wexit-Delecto -2 points 3 days ago There was during covid, which was the point. The fellow to whom I responded was saying the covid spending didn’t cause inflation because of some keynesian velocity mumbo jumbo. permalink parent award report block reply view 1 more comments...\nWexit-Delecto -2 points 3 days ago There was during covid, which was the point. The fellow to whom I responded was saying the covid spending didn’t cause inflation because of some keynesian velocity mumbo jumbo. permalink parent award report block reply view 1 more comments...\nnewestofnew 4 points 3 days ago perpetual election loser neocons and country club types like yourself to point to the 200 billion in stimmies to working people as the cause of inflation. but ignore the waves of trillions in liquidity injection the fed pumped into the asset class at the same time. the fed is still at it as well. money machine hasn't stopped feeding the banks since Silicon Valley bank. permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Not at all. All socialism must stop or the economy will continue to circle the drain. Since government is perennially corrupt, the only way to stop it is to cut the size of government down to the absolute bare minimum required. permalink parent award report block reply view 2 more comments...\nWexit-Delecto 2 points 3 days ago Not at all. All socialism must stop or the economy will continue to circle the drain. Since government is perennially corrupt, the only way to stop it is to cut the size of government down to the absolute bare minimum required. permalink parent award report block reply view 2 more comments...\nGatoradeJeb 3 points 3 days ago Funny how you retards support welfare and ebt for blacks and latinos but no to americans getting money back they paid in taxes permalink parent award report block reply Wexit-Delecto 0 points 3 days ago I don’t support any welfare of any kind. permalink parent award report block reply view 1 more comments...\nWexit-Delecto 0 points 3 days ago I don’t support any welfare of any kind. permalink parent award report block reply view 1 more comments...\nMastaJoda 2 points 3 days ago Of course the stimulus checks caused MASSIVE inflation, as it will every time the govt hands out Tillions to citizens. This isnt even up for debate. Stimulus checks only helps corporations and in turn wall street. As everyone is nagger rich for a day and they blow it before they even get it. permalink parent award report block reply\nMikeyisNinja 3 points 3 days ago I’m going to dump mine into memes like I did in 2021. permalink parent award report block reply\nBeachboy1b 2 points 3 days ago There is a staggering number of people on here that fail to understand what you just said. permalink parent award report block reply\nGA_Logic 1 points 3 days ago Unfortunately this thread reveals people do not understand how inflation works. The money exists already like you said and it is being returned to the taxpayers. permalink parent award report block reply\nPeterThielAntiChrist 1 points 3 days ago No. The SCOTUS will rule tariffs illegal, will order the money returned to importers, big companies will use that money to buy back stock, they will keep prices high and the stock price will increase. permalink parent award report block reply\nHuggableBear 16 points 3 days ago Or maybe lower tax rates instead of just cutting us a check one time permalink parent award report block reply flashersenpai -2 points 3 days ago tax rate doesn't put money into someone's account or pay their utility bills no point in paying lower taxes if you lose your apartment anyway permalink parent award report block reply HuggableBear 4 points 3 days ago Literally does, you moron, and it does it repeatedly instead of just once permalink parent award report block reply\nflashersenpai -2 points 3 days ago tax rate doesn't put money into someone's account or pay their utility bills no point in paying lower taxes if you lose your apartment anyway permalink parent award report block reply HuggableBear 4 points 3 days ago Literally does, you moron, and it does it repeatedly instead of just once permalink parent award report block reply\nHuggableBear 4 points 3 days ago Literally does, you moron, and it does it repeatedly instead of just once permalink parent award report block reply\n123breadman 5 points 3 days ago He's a business boomer CEO. When they get his with lawsuits they have to pay millions of dollars that are paid to their millions of people only totaling about $1 per person. He's going to pay $2,000 per person (which is not a life changing amount) and claim he paid billions out to americans. It's what boomers do. permalink parent award report block reply\nPede45 3 points 3 days ago I'll take your check. permalink parent award report block reply GA_Logic 2 points 3 days ago I want my check too because that is our money as US citizens. permalink parent award report block reply\nGA_Logic 2 points 3 days ago I want my check too because that is our money as US citizens. permalink parent award report block reply\nDCYR66 1 points 3 days ago That just may buy a days worth of groceries. permalink parent award report block reply\nDingleBalls 39 points 3 days ago I dont understand how this is even up for debate or even for SCOTUS to consider. The President has sole ability to levy tariffs on any nation. Its not a \"tax on citizens\" because the costs arent supposed to be passed on and you're supposed to be buying and making American instead permalink award report block reply TravisRSCX 23 points 3 days ago That and you’re not required to buy said product from said country. Buy American or find a country that makes said product witha better relationship with us and has lower tariffs fees. Easy enough to understand. We are too addicted to cheap foreign goods. permalink parent award report block reply Maganifice7 7 points 3 days ago You literally can't find most products made in America anymore. I know, I've been trying. permalink parent award report block reply iamherefortheluls 2 points 3 days ago and has lower tariffs fees. so China again. A week or two ago, they have negotiated to have the lowest tariff fees of any country and in return for that they conceded that they won't cut off US from refined rare earth minerals. permalink parent award report block reply Consumerbot381732 5 points 3 days ago Next president (Newsome?) places tariffs on all countries that don’t have at least 50% gay or tranny cabinet members. Or more likely, on countries that don’t bend the knee to Our Greatest Ally. permalink parent award report block reply barryb0nds 1 points 3 days ago because the costs arent supposed to be passed on and you're supposed to be buying and making American instead American labor is expensive and most Americans wouldn't want to, or couldn't afford to live the lifestyle they have become accustomed to by \"buying American\". permalink parent award report block reply BillyBobBrewer 3 points 3 days ago The lifestyle we've become accustomed to? You mean living well below the means of our parents and grandparents who had a single income and working 4x as much? Oh, and back then, they were buying American. American labor is expensive, but it also made non-disposable products and allowed Americans to have a prosperous middle class. Sure, a TV or a washer or freezer would cost double or triple or more what a cheap Chinese piece of shit does. But it would last a generation. You rarely had to buy new, unless you wanted to, as things could be easily maintained and repaired. If we made things here, people would be making a lot more money rather than having all the productivity siphoned off by technocrats. But I'm sure you already knew that. permalink parent award report block reply barryb0nds -1 points 3 days ago You mean living well below the means of our parents and grandparents who had a single income and working 4x as much? The boomer generation is an unprecedented anomaly in a long history that likely won't be repeated anytime soon. The US economy post WWII managed to capture lightning in a bottle. The conditions to repeat that simply do not exist. Americans are still living extraordinarily well. permalink parent award report block reply iamherefortheluls 1 points 3 days ago the costs arent supposed to be passed on that's like splashing a bucket of shit on your wall and saying 'the splatter wasn't supposed to land on me... or stick to my wall' You tax a merchant, he is passing the cost on to his buyers and by definition if its an import, someone in America is the buyer. permalink parent award report block reply\nTravisRSCX 23 points 3 days ago That and you’re not required to buy said product from said country. Buy American or find a country that makes said product witha better relationship with us and has lower tariffs fees. Easy enough to understand. We are too addicted to cheap foreign goods. permalink parent award report block reply Maganifice7 7 points 3 days ago You literally can't find most products made in America anymore. I know, I've been trying. permalink parent award report block reply iamherefortheluls 2 points 3 days ago and has lower tariffs fees. so China again. A week or two ago, they have negotiated to have the lowest tariff fees of any country and in return for that they conceded that they won't cut off US from refined rare earth minerals. permalink parent award report block reply\nMaganifice7 7 points 3 days ago You literally can't find most products made in America anymore. I know, I've been trying. permalink parent award report block reply\niamherefortheluls 2 points 3 days ago and has lower tariffs fees. so China again. A week or two ago, they have negotiated to have the lowest tariff fees of any country and in return for that they conceded that they won't cut off US from refined rare earth minerals. permalink parent award report block reply\nConsumerbot381732 5 points 3 days ago Next president (Newsome?) places tariffs on all countries that don’t have at least 50% gay or tranny cabinet members. Or more likely, on countries that don’t bend the knee to Our Greatest Ally. permalink parent award report block reply\nbarryb0nds 1 points 3 days ago because the costs arent supposed to be passed on and you're supposed to be buying and making American instead American labor is expensive and most Americans wouldn't want to, or couldn't afford to live the lifestyle they have become accustomed to by \"buying American\". permalink parent award report block reply BillyBobBrewer 3 points 3 days ago The lifestyle we've become accustomed to? You mean living well below the means of our parents and grandparents who had a single income and working 4x as much? Oh, and back then, they were buying American. American labor is expensive, but it also made non-disposable products and allowed Americans to have a prosperous middle class. Sure, a TV or a washer or freezer would cost double or triple or more what a cheap Chinese piece of shit does. But it would last a generation. You rarely had to buy new, unless you wanted to, as things could be easily maintained and repaired. If we made things here, people would be making a lot more money rather than having all the productivity siphoned off by technocrats. But I'm sure you already knew that. permalink parent award report block reply barryb0nds -1 points 3 days ago You mean living well below the means of our parents and grandparents who had a single income and working 4x as much? The boomer generation is an unprecedented anomaly in a long history that likely won't be repeated anytime soon. The US economy post WWII managed to capture lightning in a bottle. The conditions to repeat that simply do not exist. Americans are still living extraordinarily well. permalink parent award report block reply\nBillyBobBrewer 3 points 3 days ago The lifestyle we've become accustomed to? You mean living well below the means of our parents and grandparents who had a single income and working 4x as much? Oh, and back then, they were buying American. American labor is expensive, but it also made non-disposable products and allowed Americans to have a prosperous middle class. Sure, a TV or a washer or freezer would cost double or triple or more what a cheap Chinese piece of shit does. But it would last a generation. You rarely had to buy new, unless you wanted to, as things could be easily maintained and repaired. If we made things here, people would be making a lot more money rather than having all the productivity siphoned off by technocrats. But I'm sure you already knew that. permalink parent award report block reply barryb0nds -1 points 3 days ago You mean living well below the means of our parents and grandparents who had a single income and working 4x as much? The boomer generation is an unprecedented anomaly in a long history that likely won't be repeated anytime soon. The US economy post WWII managed to capture lightning in a bottle. The conditions to repeat that simply do not exist. Americans are still living extraordinarily well. permalink parent award report block reply\nbarryb0nds -1 points 3 days ago You mean living well below the means of our parents and grandparents who had a single income and working 4x as much? The boomer generation is an unprecedented anomaly in a long history that likely won't be repeated anytime soon. The US economy post WWII managed to capture lightning in a bottle. The conditions to repeat that simply do not exist. Americans are still living extraordinarily well. permalink parent award report block reply\niamherefortheluls 1 points 3 days ago the costs arent supposed to be passed on that's like splashing a bucket of shit on your wall and saying 'the splatter wasn't supposed to land on me... or stick to my wall' You tax a merchant, he is passing the cost on to his buyers and by definition if its an import, someone in America is the buyer. permalink parent award report block reply\nTPMJB 33 points 3 days ago I have a feeling it's going to be capped at 150k gross combined income, or something gay like that. Which will suck for me. Work harder = get less. permalink award report block reply Wexit-Delecto 25 points 3 days ago The blacks who never vote for Trump is getting stimmies! permalink parent award report block reply DCYR66 3 points 3 days ago Time for more tats and grills. permalink parent award report block reply DCYR66 -1 points 3 days ago 🖕downvote this permalink parent award report block reply TPMJB 1 points 3 days ago YOU'RE NOT MY DAD! permalink parent award report block reply ianpatrick1966 14 points 3 days ago Same as the coof stimmies. I got to listen to every single fucking person jaw about what consumer nonsense they were going to buy. I didn't get a cent, and my business had cratered due to the coof. permalink parent award report block reply yummy_yumm_yumms 1 points 3 days ago Yup, I be getten non of dis fwee monee evwere! permalink parent award report block reply YaharaRiver 0 points 3 days ago YET, If you were presented with a 1.33% raise you would raise holy hell because you don’t even notice the fucking difference. So $2k is really life-changing for that income?  I’m not talking about YOU, i rather doubt that you’re in that income bracket, frankly. permalink parent award report block reply Consumerbot381732 14 points 3 days ago I’ll never forget my government teacher telling our class that progressive tax rates were “more fair”, as if it was factual information. $2000 per person to everyone except “high income people” is income redistribution. permalink parent award report block reply YaharaRiver -3 points 3 days ago ON PAPER. In real life, it’s a form of crime prevention! permalink parent award report block reply iamherefortheluls 3 points 3 days ago its never been before, but I am sure this time the disney fairy will come through to make it so. permalink parent award report block reply TPMJB 1 points 3 days ago Bullets are cheaper. $2000 worth of bullets would prevent a lot of crime. Well unless it's 5.56. That gets you like a full magazine. permalink parent award report block reply TPMJB 1 points 3 days ago I don't have to deal with raises. I'm a contractor. Getting an 80% raise was worth the \"instability\" of not being full time. So yeah, these stimmies still fuck me. permalink parent award report block reply\nWexit-Delecto 25 points 3 days ago The blacks who never vote for Trump is getting stimmies! permalink parent award report block reply DCYR66 3 points 3 days ago Time for more tats and grills. permalink parent award report block reply DCYR66 -1 points 3 days ago 🖕downvote this permalink parent award report block reply TPMJB 1 points 3 days ago YOU'RE NOT MY DAD! permalink parent award report block reply\nDCYR66 3 points 3 days ago Time for more tats and grills. permalink parent award report block reply DCYR66 -1 points 3 days ago 🖕downvote this permalink parent award report block reply TPMJB 1 points 3 days ago YOU'RE NOT MY DAD! permalink parent award report block reply\nDCYR66 -1 points 3 days ago 🖕downvote this permalink parent award report block reply TPMJB 1 points 3 days ago YOU'RE NOT MY DAD! permalink parent award report block reply\nTPMJB 1 points 3 days ago YOU'RE NOT MY DAD! permalink parent award report block reply\nianpatrick1966 14 points 3 days ago Same as the coof stimmies. I got to listen to every single fucking person jaw about what consumer nonsense they were going to buy. I didn't get a cent, and my business had cratered due to the coof. permalink parent award report block reply\nyummy_yumm_yumms 1 points 3 days ago Yup, I be getten non of dis fwee monee evwere! permalink parent award report block reply\nYaharaRiver 0 points 3 days ago YET, If you were presented with a 1.33% raise you would raise holy hell because you don’t even notice the fucking difference. So $2k is really life-changing for that income?  I’m not talking about YOU, i rather doubt that you’re in that income bracket, frankly. permalink parent award report block reply Consumerbot381732 14 points 3 days ago I’ll never forget my government teacher telling our class that progressive tax rates were “more fair”, as if it was factual information. $2000 per person to everyone except “high income people” is income redistribution. permalink parent award report block reply YaharaRiver -3 points 3 days ago ON PAPER. In real life, it’s a form of crime prevention! permalink parent award report block reply iamherefortheluls 3 points 3 days ago its never been before, but I am sure this time the disney fairy will come through to make it so. permalink parent award report block reply TPMJB 1 points 3 days ago Bullets are cheaper. $2000 worth of bullets would prevent a lot of crime. Well unless it's 5.56. That gets you like a full magazine. permalink parent award report block reply TPMJB 1 points 3 days ago I don't have to deal with raises. I'm a contractor. Getting an 80% raise was worth the \"instability\" of not being full time. So yeah, these stimmies still fuck me. permalink parent award report block reply\nConsumerbot381732 14 points 3 days ago I’ll never forget my government teacher telling our class that progressive tax rates were “more fair”, as if it was factual information. $2000 per person to everyone except “high income people” is income redistribution. permalink parent award report block reply YaharaRiver -3 points 3 days ago ON PAPER. In real life, it’s a form of crime prevention! permalink parent award report block reply iamherefortheluls 3 points 3 days ago its never been before, but I am sure this time the disney fairy will come through to make it so. permalink parent award report block reply TPMJB 1 points 3 days ago Bullets are cheaper. $2000 worth of bullets would prevent a lot of crime. Well unless it's 5.56. That gets you like a full magazine. permalink parent award report block reply\nYaharaRiver -3 points 3 days ago ON PAPER. In real life, it’s a form of crime prevention! permalink parent award report block reply iamherefortheluls 3 points 3 days ago its never been before, but I am sure this time the disney fairy will come through to make it so. permalink parent award report block reply TPMJB 1 points 3 days ago Bullets are cheaper. $2000 worth of bullets would prevent a lot of crime. Well unless it's 5.56. That gets you like a full magazine. permalink parent award report block reply\niamherefortheluls 3 points 3 days ago its never been before, but I am sure this time the disney fairy will come through to make it so. permalink parent award report block reply\nTPMJB 1 points 3 days ago Bullets are cheaper. $2000 worth of bullets would prevent a lot of crime. Well unless it's 5.56. That gets you like a full magazine. permalink parent award report block reply\nTPMJB 1 points 3 days ago I don't have to deal with raises. I'm a contractor. Getting an 80% raise was worth the \"instability\" of not being full time. So yeah, these stimmies still fuck me. permalink parent award report block reply\nDomTullipso 33 points 3 days ago Inflation is still shit. 401k doesn't help most people for decades. And then, the dollar will be tanked. He's so out of touch permalink award report block reply mb5231 2 points 3 days ago This wouldn't be printing new money, inflation most likely not impacted by much permalink parent award report block reply CanadianTrump2 1 points 3 days ago Wrong The massive interest bill is the main driver of inflation as they print money to cover it. Paying down debt will reverse. permalink parent award report block reply bluewhiteandred 1 points 3 days ago I think they were saying that inflation is still bad, not that this causes inflation (although there seem to be a lot of people - in my understanding incorrectly - posting that) permalink parent award report block reply\nmb5231 2 points 3 days ago This wouldn't be printing new money, inflation most likely not impacted by much permalink parent award report block reply CanadianTrump2 1 points 3 days ago Wrong The massive interest bill is the main driver of inflation as they print money to cover it. Paying down debt will reverse. permalink parent award report block reply bluewhiteandred 1 points 3 days ago I think they were saying that inflation is still bad, not that this causes inflation (although there seem to be a lot of people - in my understanding incorrectly - posting that) permalink parent award report block reply\nCanadianTrump2 1 points 3 days ago Wrong The massive interest bill is the main driver of inflation as they print money to cover it. Paying down debt will reverse. permalink parent award report block reply\nbluewhiteandred 1 points 3 days ago I think they were saying that inflation is still bad, not that this causes inflation (although there seem to be a lot of people - in my understanding incorrectly - posting that) permalink parent award report block reply\nhenri_derelicte 30 points 3 days ago Stimmy checks are back on the menu, pedes! permalink award report block reply Wexit-Delecto 27 points 3 days ago “Is we getting…” permalink parent award report block reply South_Florida_Guy 9 points 3 days ago Gibsmedat permalink parent award report block reply Eagle_Balls3 12 points 3 days ago Oh lawd we gun be rich!!! permalink parent award report block reply DCYR66 3 points 3 days ago And sheet!!! permalink parent award report block reply DCYR66 0 points 3 days ago 🖕downvote this permalink parent award report block reply mikejones 7 points 3 days ago Still got the one Trump signed a few years ago. permalink parent award report block reply Amaroq64 1 points 3 days ago It'll about make up what I've been losing on Trump's stock lately. He needs to have a talk to whoever is running his company while he's president. permalink parent award report block reply DCYR66 -1 points 3 days ago And we wonder why so many fat lazy asses won’t go to work permalink parent award report block reply DCYR66 -3 points 3 days ago 🖕downvote this permalink parent award report block reply\nWexit-Delecto 27 points 3 days ago “Is we getting…” permalink parent award report block reply South_Florida_Guy 9 points 3 days ago Gibsmedat permalink parent award report block reply\nSouth_Florida_Guy 9 points 3 days ago Gibsmedat permalink parent award report block reply\nEagle_Balls3 12 points 3 days ago Oh lawd we gun be rich!!! permalink parent award report block reply DCYR66 3 points 3 days ago And sheet!!! permalink parent award report block reply DCYR66 0 points 3 days ago 🖕downvote this permalink parent award report block reply\nDCYR66 3 points 3 days ago And sheet!!! permalink parent award report block reply DCYR66 0 points 3 days ago 🖕downvote this permalink parent award report block reply\nDCYR66 0 points 3 days ago 🖕downvote this permalink parent award report block reply\nmikejones 7 points 3 days ago Still got the one Trump signed a few years ago. permalink parent award report block reply\nAmaroq64 1 points 3 days ago It'll about make up what I've been losing on Trump's stock lately. He needs to have a talk to whoever is running his company while he's president. permalink parent award report block reply\nDCYR66 -1 points 3 days ago And we wonder why so many fat lazy asses won’t go to work permalink parent award report block reply DCYR66 -3 points 3 days ago 🖕downvote this permalink parent award report block reply\nDCYR66 -3 points 3 days ago 🖕downvote this permalink parent award report block reply\nWexit-Delecto 25 points 3 days ago Can you use the money to hire a decent AG instead? permalink award report block reply\nbill_in_texas 20 points 3 days ago Another bullshit idea!  Unless we are somehow running a surplus, then Trump would be borrowing that money to send to the taxpayers, which will spur more inflation, and put us even further in debt.  Did we learn nothing from the covid hysteria and subsequent Bidenflation?    He's just flailing right now.  Focus, President Trump, focus. permalink award report block reply Axiom502 -2 points 3 days ago Shut up faggot permalink parent award report block reply Logan051361 -9 points 3 days ago Good, then you can send your money to me. so sick of the complainers permalink parent award report block reply\nAxiom502 -2 points 3 days ago Shut up faggot permalink parent award report block reply\nLogan051361 -9 points 3 days ago Good, then you can send your money to me. so sick of the complainers permalink parent award report block reply\nBigDuke6 16 points 3 days ago Is this on top of that $5000 DOGE dividend we gettin???? permalink award report block reply DCYR66 5 points 3 days ago That was so yesterday. permalink parent award report block reply DCYR66 -5 points 3 days ago 🖕downvote this permalink parent award report block reply starjello -2 points 3 days ago You don't have to tell the idiots here to do that. They hate truth. permalink parent award report block reply\nDCYR66 5 points 3 days ago That was so yesterday. permalink parent award report block reply DCYR66 -5 points 3 days ago 🖕downvote this permalink parent award report block reply starjello -2 points 3 days ago You don't have to tell the idiots here to do that. They hate truth. permalink parent award report block reply\nDCYR66 -5 points 3 days ago 🖕downvote this permalink parent award report block reply starjello -2 points 3 days ago You don't have to tell the idiots here to do that. They hate truth. permalink parent award report block reply\nstarjello -2 points 3 days ago You don't have to tell the idiots here to do that. They hate truth. permalink parent award report block reply\nReassess_Reevaluate 14 points 3 days ago Why not high income? I pay more to slop SNAP benefits into degenerate's faces than 95% of people living in my state.  I'll happily take a tiny percentage of my tax dollars back. permalink award report block reply Andweareback -7 points 3 days ago Greed is one of the 7 deadly sins. permalink parent award report block reply Reassess_Reevaluate 14 points 3 days ago Is theft a sin? permalink parent award report block reply RocksCanOnlyWait 11 points 3 days ago Why is it greed to want to keep what one has worked for, but not greed to take from someone what they earned and give it to another who has not? permalink parent award report block reply TPMJB 1 points 3 days ago And with our taxes we are funding greed, gluttony, and sloth. We just need to stop paying tax permalink parent award report block reply\nAndweareback -7 points 3 days ago Greed is one of the 7 deadly sins. permalink parent award report block reply Reassess_Reevaluate 14 points 3 days ago Is theft a sin? permalink parent award report block reply RocksCanOnlyWait 11 points 3 days ago Why is it greed to want to keep what one has worked for, but not greed to take from someone what they earned and give it to another who has not? permalink parent award report block reply TPMJB 1 points 3 days ago And with our taxes we are funding greed, gluttony, and sloth. We just need to stop paying tax permalink parent award report block reply\nReassess_Reevaluate 14 points 3 days ago Is theft a sin? permalink parent award report block reply\nRocksCanOnlyWait 11 points 3 days ago Why is it greed to want to keep what one has worked for, but not greed to take from someone what they earned and give it to another who has not? permalink parent award report block reply\nTPMJB 1 points 3 days ago And with our taxes we are funding greed, gluttony, and sloth. We just need to stop paying tax permalink parent award report block reply\nObambi 13 points 3 days ago Get rid of the income tax if you want the GOP to win in 2028. That’s what it will take tbh. permalink award report block reply Electrocutioner 2 points 3 days ago This will guarantee wins for longer than that. permalink parent award report block reply Obambi 0 points 3 days ago Yea. Do you want to pay income taxes? Then don’t vote for democrats. To keep no income taxes keep voting for Trump/Vance/Barron etc. permalink parent award report block reply\nElectrocutioner 2 points 3 days ago This will guarantee wins for longer than that. permalink parent award report block reply Obambi 0 points 3 days ago Yea. Do you want to pay income taxes? Then don’t vote for democrats. To keep no income taxes keep voting for Trump/Vance/Barron etc. permalink parent award report block reply\nObambi 0 points 3 days ago Yea. Do you want to pay income taxes? Then don’t vote for democrats. To keep no income taxes keep voting for Trump/Vance/Barron etc. permalink parent award report block reply\nLogan051361 10 points 3 days ago Many Seniors could use the money. permalink award report block reply YaharaRiver 8 points 3 days ago Unfortunately, it’s to pay the property taxes on their paid-for houses which they’ll lose if they don’t.  They won’t be buying new towels or socks.  But their ass in a sling will be saved. This whole scam is so ugly! Squeezing blood from a stone to wash turds clean. permalink parent award report block reply Logan051361 4 points 3 days ago Most will be buying food permalink parent award report block reply YaharaRiver 3 points 3 days ago Trust me, property taxes make old people lose their appetite. They will forage dandelion leaves from the back yard before they let their now $400,000 house be snatched for not paying the $8000 tax bill in full on time. permalink parent award report block reply Logan051361 4 points 3 days ago I know, I get it. Its bullshit.  alll this Tax shit needs to go the fuck away permalink parent award report block reply TPMJB 2 points 3 days ago Unfortunately what's going to happen is many señors will get it. Did you.... Did you see what I did there? permalink parent award report block reply\nYaharaRiver 8 points 3 days ago Unfortunately, it’s to pay the property taxes on their paid-for houses which they’ll lose if they don’t.  They won’t be buying new towels or socks.  But their ass in a sling will be saved. This whole scam is so ugly! Squeezing blood from a stone to wash turds clean. permalink parent award report block reply Logan051361 4 points 3 days ago Most will be buying food permalink parent award report block reply YaharaRiver 3 points 3 days ago Trust me, property taxes make old people lose their appetite. They will forage dandelion leaves from the back yard before they let their now $400,000 house be snatched for not paying the $8000 tax bill in full on time. permalink parent award report block reply Logan051361 4 points 3 days ago I know, I get it. Its bullshit.  alll this Tax shit needs to go the fuck away permalink parent award report block reply\nLogan051361 4 points 3 days ago Most will be buying food permalink parent award report block reply YaharaRiver 3 points 3 days ago Trust me, property taxes make old people lose their appetite. They will forage dandelion leaves from the back yard before they let their now $400,000 house be snatched for not paying the $8000 tax bill in full on time. permalink parent award report block reply Logan051361 4 points 3 days ago I know, I get it. Its bullshit.  alll this Tax shit needs to go the fuck away permalink parent award report block reply\nYaharaRiver 3 points 3 days ago Trust me, property taxes make old people lose their appetite. They will forage dandelion leaves from the back yard before they let their now $400,000 house be snatched for not paying the $8000 tax bill in full on time. permalink parent award report block reply Logan051361 4 points 3 days ago I know, I get it. Its bullshit.  alll this Tax shit needs to go the fuck away permalink parent award report block reply\nLogan051361 4 points 3 days ago I know, I get it. Its bullshit.  alll this Tax shit needs to go the fuck away permalink parent award report block reply\nTPMJB 2 points 3 days ago Unfortunately what's going to happen is many señors will get it. Did you.... Did you see what I did there? permalink parent award report block reply\nbillybaldwin2 10 points 3 days ago Where can we see how much money America has earned through tariffs over the years / decades? permalink award report block reply TPMJB 2 points 3 days ago Trust me, bro. permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nTPMJB 2 points 3 days ago Trust me, bro. permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nTheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nMAGA_APN 10 points 3 days ago Hopefully not to those who dont pay any taxes and are already on government hand outs-or illegals. permalink award report block reply ScamBlondie 7 points 3 days ago Uh, yeah, about that, sorry to disappoint you but… permalink parent award report block reply YaharaRiver 1 points 3 days ago I guarantee you that Trump has no intention whatsoever of boosting any muslims whose bigshots are just giving away used 747s. 😂 permalink parent award report block reply TPMJB 1 points 3 days ago Yeah, buddy. Hillary is secretly in jail too. permalink parent award report block reply\nScamBlondie 7 points 3 days ago Uh, yeah, about that, sorry to disappoint you but… permalink parent award report block reply\nYaharaRiver 1 points 3 days ago I guarantee you that Trump has no intention whatsoever of boosting any muslims whose bigshots are just giving away used 747s. 😂 permalink parent award report block reply TPMJB 1 points 3 days ago Yeah, buddy. Hillary is secretly in jail too. permalink parent award report block reply\nTPMJB 1 points 3 days ago Yeah, buddy. Hillary is secretly in jail too. permalink parent award report block reply\nC0drus 8 points 3 days ago A $2000 “dividend”?….you mean some of the money that I paid in taxes is coming back to me so I can be taxed on it again, devalue the dollar further, put us further in debt and destroy the country even more…..what could go wrong?🤷‍♂️ permalink award report block reply YaharaRiver 3 points 3 days ago lol You so obviously do not qualify to receive one cent 😂 permalink parent award report block reply C0drus 6 points 3 days ago I don’t qualify for snap, ebt or subsidized housing either….and I’m good with that also 😎 permalink parent award report block reply YaharaRiver -7 points 3 days ago ah, the carefree life of a jihadi! permalink parent award report block reply C0drus 5 points 3 days ago You’re a jahadii?….get the fuck out of my country permalink parent award report block reply view 1 more comments... TPMJB 0 points 3 days ago $2000 is a drop in the bucket. I'm not a wagie. I receive more than that in rental income, that people like you pay me. permalink parent award report block reply\nYaharaRiver 3 points 3 days ago lol You so obviously do not qualify to receive one cent 😂 permalink parent award report block reply C0drus 6 points 3 days ago I don’t qualify for snap, ebt or subsidized housing either….and I’m good with that also 😎 permalink parent award report block reply YaharaRiver -7 points 3 days ago ah, the carefree life of a jihadi! permalink parent award report block reply C0drus 5 points 3 days ago You’re a jahadii?….get the fuck out of my country permalink parent award report block reply view 1 more comments... TPMJB 0 points 3 days ago $2000 is a drop in the bucket. I'm not a wagie. I receive more than that in rental income, that people like you pay me. permalink parent award report block reply\nC0drus 6 points 3 days ago I don’t qualify for snap, ebt or subsidized housing either….and I’m good with that also 😎 permalink parent award report block reply YaharaRiver -7 points 3 days ago ah, the carefree life of a jihadi! permalink parent award report block reply C0drus 5 points 3 days ago You’re a jahadii?….get the fuck out of my country permalink parent award report block reply view 1 more comments...\nYaharaRiver -7 points 3 days ago ah, the carefree life of a jihadi! permalink parent award report block reply C0drus 5 points 3 days ago You’re a jahadii?….get the fuck out of my country permalink parent award report block reply view 1 more comments...\nC0drus 5 points 3 days ago You’re a jahadii?….get the fuck out of my country permalink parent award report block reply view 1 more comments...\nTPMJB 0 points 3 days ago $2000 is a drop in the bucket. I'm not a wagie. I receive more than that in rental income, that people like you pay me. permalink parent award report block reply\nRetardloserimsogay 8 points 3 days ago FFS, get rid of income taxes or property taxes. wtf is this $2k now?! permalink award report block reply\nNYforTrump 7 points 3 days ago How about we pay off the 31 trillion dollar DEBT? permalink award report block reply RocksCanOnlyWait 4 points 3 days ago $38 trillion debt permalink parent award report block reply Jaunty_Haul 2 points 3 days ago Why would we do something silly like that when we could pump up inflation with some helicopter money? If you want someone to pay the debt, just have more kids. /s permalink parent award report block reply\nRocksCanOnlyWait 4 points 3 days ago $38 trillion debt permalink parent award report block reply\nJaunty_Haul 2 points 3 days ago Why would we do something silly like that when we could pump up inflation with some helicopter money? If you want someone to pay the debt, just have more kids. /s permalink parent award report block reply\nalucard13mmfmj 7 points 3 days ago So.. where are these plants? Arent they mostly just promises/pledges from corporations? Lawl. Most of that shit wont be built as they are waiting out tariffs when 2028 comes around. permalink award report block reply SenorTrumper 4 points 3 days ago STFU! We must pretend that we still believe all the BS spoonfed to us. permalink parent award report block reply FatigueIsReal 2 points 3 days ago So you ask a searchable question to a forum? Here (edit: I'll should be more polite.) Technology and Semiconductors Nvidia Corp.\nAmkor Technology\nPegatron\nApple Inc.\nTSMC Pharmaceuticals and Biotech Johnson & Johnson\nAstraZeneca\nGlaukos Corporation Appliances and Consumer Goods Whirlpool Corp.\nWCR Incorporated Energy and Infrastructure XNRGY\nHyundai Motor Group permalink parent award report block reply Maganifice7 1 points 3 days ago This retard clearly didn't understand the question. permalink parent award report block reply FatigueIsReal 2 points 3 days ago The question was \"where are these plants\"  it was implying they don't exist and are never going to be built. Each of the companies I listed are building the plants or re-shoring the operations currently. So no these are not just promises. permalink parent award report block reply\nSenorTrumper 4 points 3 days ago STFU! We must pretend that we still believe all the BS spoonfed to us. permalink parent award report block reply\nFatigueIsReal 2 points 3 days ago So you ask a searchable question to a forum? Here (edit: I'll should be more polite.) Technology and Semiconductors Nvidia Corp.\nAmkor Technology\nPegatron\nApple Inc.\nTSMC Pharmaceuticals and Biotech Johnson & Johnson\nAstraZeneca\nGlaukos Corporation Appliances and Consumer Goods Whirlpool Corp.\nWCR Incorporated Energy and Infrastructure XNRGY\nHyundai Motor Group permalink parent award report block reply Maganifice7 1 points 3 days ago This retard clearly didn't understand the question. permalink parent award report block reply FatigueIsReal 2 points 3 days ago The question was \"where are these plants\"  it was implying they don't exist and are never going to be built. Each of the companies I listed are building the plants or re-shoring the operations currently. So no these are not just promises. permalink parent award report block reply\nMaganifice7 1 points 3 days ago This retard clearly didn't understand the question. permalink parent award report block reply FatigueIsReal 2 points 3 days ago The question was \"where are these plants\"  it was implying they don't exist and are never going to be built. Each of the companies I listed are building the plants or re-shoring the operations currently. So no these are not just promises. permalink parent award report block reply\nFatigueIsReal 2 points 3 days ago The question was \"where are these plants\"  it was implying they don't exist and are never going to be built. Each of the companies I listed are building the plants or re-shoring the operations currently. So no these are not just promises. permalink parent award report block reply\nMemeWarsVet 7 points 3 days ago Abolish the IRS. permalink award report block reply\nScamBlondie 6 points 3 days ago “High income people” probably anyone not on welfare permalink award report block reply\nGeorgeBailey 5 points 3 days ago Thank you President Trump! That $2000 will help offset the $120,000 I was making before my job was given to a non-American H1-B Hindu. Winning! /s permalink award report block reply\nTexasnumber1 5 points 3 days ago Why in the f*** do people on this website only post screenshots from Truth social Trump's creation, but everything is linked when it comes to Twitter. I've said it once and I'll say it again this place should be called the Twitter for the Elon permalink award report block reply barryb0nds 7 points 3 days ago I didn't sign up to truth because it required a cell number (even just to view posts) and fuck that. permalink parent award report block reply Texasnumber1 0 points 3 days ago So you go to Twitter where  it's loaded with Bots yeah sure that makes a whole lot of sense some of you people don't have the balls to build anything or compete with mainstream social media pretty f****** sad permalink parent award report block reply barryb0nds 1 points 3 days ago I don't really use twitter outside of clicking links to it that are posted here on elsewhere. I don't think \"microblogging\" sites are particularly pleasant to use at all. permalink parent award report block reply Maganifice7 5 points 3 days ago Don't you need an account or app to access truth social? I remember looking into it when it came out and there was no way to view it from a web browser or something like that. I tried signing up, but it wanted my phone number, which I don't give out. permalink parent award report block reply Texasnumber1 1 points 3 days ago It's the same thing as Twitter you can't see the comments unless you have an account you can always link and see Trump's truths or anybody for that matter permalink parent award report block reply YaharaRiver 0 points 3 days ago Pretty sure foreigners can’t access the site live. Best platform ever!! 😂👍 permalink parent award report block reply Texasnumber1 -1 points 3 days ago What do I care about foreigners I'm focus on America and American opinions and politics. Works in Canada Works in Europe so now you're just making s*** up permalink parent award report block reply YaharaRiver -1 points 3 days ago Fuck off. “Truth Social is officially available to users in the United States and Canada, with no public announcement of expansion to other countries as of November 2025.” Get bent, foreigners! 👍 No access for you, not even in Europe permalink parent award report block reply Texasnumber1 1 points 3 days ago Then get a VPN easy permalink parent award report block reply\nbarryb0nds 7 points 3 days ago I didn't sign up to truth because it required a cell number (even just to view posts) and fuck that. permalink parent award report block reply Texasnumber1 0 points 3 days ago So you go to Twitter where  it's loaded with Bots yeah sure that makes a whole lot of sense some of you people don't have the balls to build anything or compete with mainstream social media pretty f****** sad permalink parent award report block reply barryb0nds 1 points 3 days ago I don't really use twitter outside of clicking links to it that are posted here on elsewhere. I don't think \"microblogging\" sites are particularly pleasant to use at all. permalink parent award report block reply\nTexasnumber1 0 points 3 days ago So you go to Twitter where  it's loaded with Bots yeah sure that makes a whole lot of sense some of you people don't have the balls to build anything or compete with mainstream social media pretty f****** sad permalink parent award report block reply barryb0nds 1 points 3 days ago I don't really use twitter outside of clicking links to it that are posted here on elsewhere. I don't think \"microblogging\" sites are particularly pleasant to use at all. permalink parent award report block reply\nbarryb0nds 1 points 3 days ago I don't really use twitter outside of clicking links to it that are posted here on elsewhere. I don't think \"microblogging\" sites are particularly pleasant to use at all. permalink parent award report block reply\nMaganifice7 5 points 3 days ago Don't you need an account or app to access truth social? I remember looking into it when it came out and there was no way to view it from a web browser or something like that. I tried signing up, but it wanted my phone number, which I don't give out. permalink parent award report block reply Texasnumber1 1 points 3 days ago It's the same thing as Twitter you can't see the comments unless you have an account you can always link and see Trump's truths or anybody for that matter permalink parent award report block reply\nTexasnumber1 1 points 3 days ago It's the same thing as Twitter you can't see the comments unless you have an account you can always link and see Trump's truths or anybody for that matter permalink parent award report block reply\nYaharaRiver 0 points 3 days ago Pretty sure foreigners can’t access the site live. Best platform ever!! 😂👍 permalink parent award report block reply Texasnumber1 -1 points 3 days ago What do I care about foreigners I'm focus on America and American opinions and politics. Works in Canada Works in Europe so now you're just making s*** up permalink parent award report block reply YaharaRiver -1 points 3 days ago Fuck off. “Truth Social is officially available to users in the United States and Canada, with no public announcement of expansion to other countries as of November 2025.” Get bent, foreigners! 👍 No access for you, not even in Europe permalink parent award report block reply Texasnumber1 1 points 3 days ago Then get a VPN easy permalink parent award report block reply\nTexasnumber1 -1 points 3 days ago What do I care about foreigners I'm focus on America and American opinions and politics. Works in Canada Works in Europe so now you're just making s*** up permalink parent award report block reply YaharaRiver -1 points 3 days ago Fuck off. “Truth Social is officially available to users in the United States and Canada, with no public announcement of expansion to other countries as of November 2025.” Get bent, foreigners! 👍 No access for you, not even in Europe permalink parent award report block reply Texasnumber1 1 points 3 days ago Then get a VPN easy permalink parent award report block reply\nYaharaRiver -1 points 3 days ago Fuck off. “Truth Social is officially available to users in the United States and Canada, with no public announcement of expansion to other countries as of November 2025.” Get bent, foreigners! 👍 No access for you, not even in Europe permalink parent award report block reply Texasnumber1 1 points 3 days ago Then get a VPN easy permalink parent award report block reply\nTexasnumber1 1 points 3 days ago Then get a VPN easy permalink parent award report block reply\nRyunnsun 5 points 3 days ago We're going to pay down our debt, but first, we're going to drop another 700B on it. permalink award report block reply\nJBlaze056 4 points 3 days ago More gibs is not the answer.   Arresting traitors, holding them accountable.   Arresting Epstein clients, holding them accountable.  Stop funding foreign states and their wars, holding those that push their never ending Zionism at the expense of the American citizen accountable.  Lowering the cost of goods by ending H1Bs and all the other illegal and legal ways that the American worker is undercut by the hordes of the words, holding the employers that exploit the laws accountable…these are the ways to get the country back.  Not more gibs.   Get a clue Trump…less Zionism, less cronies, more prosecutions, more swamp draining, more America First!! permalink award report block reply\narmyofpedes4usa 4 points 3 days ago The printing press goes \"BURRRRRRRR\".  Hello more inflation. permalink award report block reply Isolated_Patriot 8 points 3 days ago There is nothing in the proposal about printing more money. The tarrif money is returning American dollars from abroad, and he is saying it should go to the people. NOTHING about printing more and expanding the money supply. permalink parent award report block reply FORMERCHILDSTAR 9 points 3 days ago I don't understand why more people on this site don't get this. We're not printing money, we're giving tariff money to citizens. They think it's going to create inflation. No it's not. It's going to temporarily give citizens more purchasing power. I'm glad you understand. permalink parent award report block reply bluewhiteandred 4 points 3 days ago I guess I understand now through a couple of these comments why people were incorrectly (afaik?) thinking this would cause inflation: it's because the checks themselves are identical, but their sources are different. Hence without understanding the source being different, they think the tariff checks are inflationary like money printing checks would be. (I think I see people make the same - afaik erroneous - argument with respect to raising people's wages. It doesn't cause inflation if it comes from existing profits of a company.) permalink parent award report block reply FORMERCHILDSTAR 4 points 3 days ago Correct permalink parent award report block reply iamherefortheluls 2 points 3 days ago first, US is printing a ton of money still. Second, SCC is still deliberating on whether the tariffs are legal. Very likely they will decide that they are not. In which case every company is going to file for reimbursement. Guess where the money to pay that all back is going to come from. permalink parent award report block reply FORMERCHILDSTAR 2 points 3 days ago That's a lot of speculation about the SCC regarding tariffs. But, yes printing too much money will cause it to be more worthless. This tariff proposal however isn't linked to printing more money, it's simply a proposal to redistribute tariff monies back to the USA citizens. permalink parent award report block reply view 2 more comments... Axiom502 1 points 3 days ago Because they are retards permalink parent award report block reply Isolated_Patriot 1 points 3 days ago Some of them don't understand. A lot more of them know exactly what they are doing. permalink parent award report block reply Axiom502 2 points 3 days ago You are retarded permalink parent award report block reply Logan051361 1 points 3 days ago then dont except it. permalink parent award report block reply MasterChief 0 points 3 days ago yep, give it to the target demographic, they'll glady \"except\" it permalink parent award report block reply\nIsolated_Patriot 8 points 3 days ago There is nothing in the proposal about printing more money. The tarrif money is returning American dollars from abroad, and he is saying it should go to the people. NOTHING about printing more and expanding the money supply. permalink parent award report block reply FORMERCHILDSTAR 9 points 3 days ago I don't understand why more people on this site don't get this. We're not printing money, we're giving tariff money to citizens. They think it's going to create inflation. No it's not. It's going to temporarily give citizens more purchasing power. I'm glad you understand. permalink parent award report block reply bluewhiteandred 4 points 3 days ago I guess I understand now through a couple of these comments why people were incorrectly (afaik?) thinking this would cause inflation: it's because the checks themselves are identical, but their sources are different. Hence without understanding the source being different, they think the tariff checks are inflationary like money printing checks would be. (I think I see people make the same - afaik erroneous - argument with respect to raising people's wages. It doesn't cause inflation if it comes from existing profits of a company.) permalink parent award report block reply FORMERCHILDSTAR 4 points 3 days ago Correct permalink parent award report block reply iamherefortheluls 2 points 3 days ago first, US is printing a ton of money still. Second, SCC is still deliberating on whether the tariffs are legal. Very likely they will decide that they are not. In which case every company is going to file for reimbursement. Guess where the money to pay that all back is going to come from. permalink parent award report block reply FORMERCHILDSTAR 2 points 3 days ago That's a lot of speculation about the SCC regarding tariffs. But, yes printing too much money will cause it to be more worthless. This tariff proposal however isn't linked to printing more money, it's simply a proposal to redistribute tariff monies back to the USA citizens. permalink parent award report block reply view 2 more comments... Axiom502 1 points 3 days ago Because they are retards permalink parent award report block reply Isolated_Patriot 1 points 3 days ago Some of them don't understand. A lot more of them know exactly what they are doing. permalink parent award report block reply\nFORMERCHILDSTAR 9 points 3 days ago I don't understand why more people on this site don't get this. We're not printing money, we're giving tariff money to citizens. They think it's going to create inflation. No it's not. It's going to temporarily give citizens more purchasing power. I'm glad you understand. permalink parent award report block reply bluewhiteandred 4 points 3 days ago I guess I understand now through a couple of these comments why people were incorrectly (afaik?) thinking this would cause inflation: it's because the checks themselves are identical, but their sources are different. Hence without understanding the source being different, they think the tariff checks are inflationary like money printing checks would be. (I think I see people make the same - afaik erroneous - argument with respect to raising people's wages. It doesn't cause inflation if it comes from existing profits of a company.) permalink parent award report block reply FORMERCHILDSTAR 4 points 3 days ago Correct permalink parent award report block reply iamherefortheluls 2 points 3 days ago first, US is printing a ton of money still. Second, SCC is still deliberating on whether the tariffs are legal. Very likely they will decide that they are not. In which case every company is going to file for reimbursement. Guess where the money to pay that all back is going to come from. permalink parent award report block reply FORMERCHILDSTAR 2 points 3 days ago That's a lot of speculation about the SCC regarding tariffs. But, yes printing too much money will cause it to be more worthless. This tariff proposal however isn't linked to printing more money, it's simply a proposal to redistribute tariff monies back to the USA citizens. permalink parent award report block reply view 2 more comments... Axiom502 1 points 3 days ago Because they are retards permalink parent award report block reply Isolated_Patriot 1 points 3 days ago Some of them don't understand. A lot more of them know exactly what they are doing. permalink parent award report block reply\nbluewhiteandred 4 points 3 days ago I guess I understand now through a couple of these comments why people were incorrectly (afaik?) thinking this would cause inflation: it's because the checks themselves are identical, but their sources are different. Hence without understanding the source being different, they think the tariff checks are inflationary like money printing checks would be. (I think I see people make the same - afaik erroneous - argument with respect to raising people's wages. It doesn't cause inflation if it comes from existing profits of a company.) permalink parent award report block reply FORMERCHILDSTAR 4 points 3 days ago Correct permalink parent award report block reply\nFORMERCHILDSTAR 4 points 3 days ago Correct permalink parent award report block reply\niamherefortheluls 2 points 3 days ago first, US is printing a ton of money still. Second, SCC is still deliberating on whether the tariffs are legal. Very likely they will decide that they are not. In which case every company is going to file for reimbursement. Guess where the money to pay that all back is going to come from. permalink parent award report block reply FORMERCHILDSTAR 2 points 3 days ago That's a lot of speculation about the SCC regarding tariffs. But, yes printing too much money will cause it to be more worthless. This tariff proposal however isn't linked to printing more money, it's simply a proposal to redistribute tariff monies back to the USA citizens. permalink parent award report block reply view 2 more comments...\nFORMERCHILDSTAR 2 points 3 days ago That's a lot of speculation about the SCC regarding tariffs. But, yes printing too much money will cause it to be more worthless. This tariff proposal however isn't linked to printing more money, it's simply a proposal to redistribute tariff monies back to the USA citizens. permalink parent award report block reply view 2 more comments...\nAxiom502 1 points 3 days ago Because they are retards permalink parent award report block reply\nIsolated_Patriot 1 points 3 days ago Some of them don't understand. A lot more of them know exactly what they are doing. permalink parent award report block reply\nAxiom502 2 points 3 days ago You are retarded permalink parent award report block reply\nLogan051361 1 points 3 days ago then dont except it. permalink parent award report block reply MasterChief 0 points 3 days ago yep, give it to the target demographic, they'll glady \"except\" it permalink parent award report block reply\nMasterChief 0 points 3 days ago yep, give it to the target demographic, they'll glady \"except\" it permalink parent award report block reply\ndeleted 4 points 3 days ago Axiom502 2 points 3 days ago Shut up faggot permalink parent award report block reply\nAxiom502 2 points 3 days ago Shut up faggot permalink parent award report block reply\nGreyKnight 4 points 3 days ago 2k is not not even a month of benefits for a welfare parasite. permalink award report block reply\nJaunty_Haul 4 points 3 days ago helicopter money -> inflation no exceptions permalink award report block reply\nKlown_Kutz 4 points 3 days ago I’ll do the same thing I did with the COVID checks. Buy tools. (not from the overpriced tool trucks). permalink award report block reply Whatyougotson 7 points 3 days ago Are guns and ammo considered tools because that's what im buying. permalink parent award report block reply imafarttrustme 3 points 3 days ago Yes permalink parent award report block reply armyofpedes4usa 5 points 3 days ago At this rate, the tools will hold their value better than the dollar. permalink parent award report block reply Klown_Kutz 3 points 3 days ago In my case this is true because I bought diagnostic tools. I fix the check engine lights other techs can’t. permalink parent award report block reply YaharaRiver 1 points 3 days ago This is extremely important. The Enemy doesn’t want you to have tools, they don’t want you to have a place to store tools, and they sure as hell don’t want you to be skillful in using tools. It’s why they “help” poor countries with sacks of oatmeal instead of seeds and shovels. permalink parent award report block reply Xinnietheflu3 2 points 3 days ago Wright and channellock are some good USA made tools permalink parent award report block reply Klown_Kutz 2 points 3 days ago After 32 years I’m way past basic hand tools. It’s all diag tools for me now. permalink parent award report block reply\nWhatyougotson 7 points 3 days ago Are guns and ammo considered tools because that's what im buying. permalink parent award report block reply imafarttrustme 3 points 3 days ago Yes permalink parent award report block reply\nimafarttrustme 3 points 3 days ago Yes permalink parent award report block reply\narmyofpedes4usa 5 points 3 days ago At this rate, the tools will hold their value better than the dollar. permalink parent award report block reply Klown_Kutz 3 points 3 days ago In my case this is true because I bought diagnostic tools. I fix the check engine lights other techs can’t. permalink parent award report block reply YaharaRiver 1 points 3 days ago This is extremely important. The Enemy doesn’t want you to have tools, they don’t want you to have a place to store tools, and they sure as hell don’t want you to be skillful in using tools. It’s why they “help” poor countries with sacks of oatmeal instead of seeds and shovels. permalink parent award report block reply\nKlown_Kutz 3 points 3 days ago In my case this is true because I bought diagnostic tools. I fix the check engine lights other techs can’t. permalink parent award report block reply\nYaharaRiver 1 points 3 days ago This is extremely important. The Enemy doesn’t want you to have tools, they don’t want you to have a place to store tools, and they sure as hell don’t want you to be skillful in using tools. It’s why they “help” poor countries with sacks of oatmeal instead of seeds and shovels. permalink parent award report block reply\nXinnietheflu3 2 points 3 days ago Wright and channellock are some good USA made tools permalink parent award report block reply Klown_Kutz 2 points 3 days ago After 32 years I’m way past basic hand tools. It’s all diag tools for me now. permalink parent award report block reply\nKlown_Kutz 2 points 3 days ago After 32 years I’m way past basic hand tools. It’s all diag tools for me now. permalink parent award report block reply\n_4TheRepublic 4 points 3 days ago The point here is the tariffs are a success. Thank you Trump! Making our country rich again! permalink award report block reply GA_Logic 2 points 3 days ago Amen and this is only the start. permalink parent award report block reply Maganifice7 -1 points 3 days ago When do I see some of this rich out country is getting? permalink parent award report block reply\nGA_Logic 2 points 3 days ago Amen and this is only the start. permalink parent award report block reply\nMaganifice7 -1 points 3 days ago When do I see some of this rich out country is getting? permalink parent award report block reply\nImmaculateDeception 3 points 3 days ago Every person on EBT must show up in person to receive their dividend. When they arrive, they will be photographed, fingerprinted, weighed, etc. as they are added into a fraud detection database.  Failure to show up to receive their dividend will result in suspension of all EBT payments. permalink award report block reply\nJDVance4President28 3 points 3 days ago You will never see that \"$2000.00\" check. It just won't happen. More strongly worded blog posts by Trump. Because ask him why we are still paying so much into federal taxes? permalink award report block reply\nbarwhack 3 points 3 days ago Feckless presidential optimism in the face of universal stage4 corruption is just ... bad and stupid. I'm understanding better, WHY Trump abandoned his promise to publish the massive list of pedos in charge: he just wants to use the present child-sex machinery to enrich everyone . That's as messed up as it sounds. And because it's so gorked, his advisers - those who approve such fundamental horror - are advising bad-stupid means toward that bad-stupid end... Dividends aren't the answer; 50-year debt slavery isn't the answer. DECORRUPTING the longitudinal rot in the American soul is a start on the answer; which involves execution of traitors, deportation of invaders, and harm done to active enemies. But we cannot, because we cannot even name the specific Epstardian Corruptocrats \"who don't exist\", yet who rule the West. permalink award report block reply\nswift_water 3 points 3 days ago Unless you've got student loans in default. Then you receive nothing. permalink award report block reply\nAoikaze2000 3 points 3 days ago Well it's a start... and if it gets me my money back from theft, I'm happy... but it's a drop in the bucket with how much that gets stolen from me annually. permalink award report block reply\nDroford 3 points 3 days ago If they did ever give out $2000 checks the left would bitch about it permalink award report block reply\npedeypete 3 points 3 days ago Normally I would say put it against the debt. But I don't want the dems spending it to cut some 8 year old's dick off when they steal the election in 28. Give it to me, I'll use it to help move my family to Florida. permalink award report block reply\nActNow 3 points 3 days ago If they really do issue $2000 each to Americans, I hope they've fixed the enormous fraud that took place with the stimulus checks. <prisoners and foreign nationals rub hands together> permalink award report block reply\nTexas_81 2 points 3 days ago We’re screwed. DJT is being manipulated by Susie Wiles permalink award report block reply\nDJTrumpMAGA 2 points 3 days ago Congrats for working your ass off and being \"high income'!! You get to pay for everything and get nothing in return. permalink award report block reply\nFlyinHeadlock 2 points 3 days ago What exactly does high income mean. During COVID it meant the middle class received no COVID money. I was considered filthy rich during COVID. No. Just middle class. permalink award report block reply\nLastconservativeNY2 2 points 3 days ago F this. \"Paid to everyone\" is not \"reimbursed to taxpayers\". What does high income mean? permalink award report block reply\nMemeWarsVet 2 points 3 days ago high income person What's the threshold? permalink award report block reply HoganT 2 points 3 days ago There is no threshold. This isn’t real. It’s something he’s pulling completely out of his ass out of desperation. permalink parent award report block reply\nHoganT 2 points 3 days ago There is no threshold. This isn’t real. It’s something he’s pulling completely out of his ass out of desperation. permalink parent award report block reply\nSaltyLandscaper 2 points 3 days ago Keep tickling my balls about a rebate check..shit or get off the fucking pot already. One way or the other. permalink award report block reply\nMichalusmichalus 2 points 3 days ago Too many intentionally miseducated having TDS. permalink award report block reply\ncanada_is_communist 2 points 3 days ago I have to admit hes right permalink award report block reply\nGman75 2 points 3 days ago On one hand, I sure as shit could use an extra 2k right now. On the other hand, the price we pay for this economically would not be great , to put it mildly. permalink award report block reply\nOldGloryUnfurled 2 points 3 days ago No dividend. Fuck that. Slap that onto the national debt for fucks sake permalink award report block reply\nOcineaa 2 points 3 days ago This is retarded. As are fifty fucking year mortgages permalink award report block reply\npresticus 2 points 3 days ago Dividends should only be on the table after the national debt is paid off and the budget allocated by Congress is resulting in a surplus. permalink award report block reply israelworst 1 points 3 days ago They should make a vehicle production line to replace the aging postal vehicle. Also make them available to civilians. So we can bypass the shitty market. permalink parent award report block reply\nisraelworst 1 points 3 days ago They should make a vehicle production line to replace the aging postal vehicle. Also make them available to civilians. So we can bypass the shitty market. permalink parent award report block reply\nlarryjohnson 2 points 3 days ago Seems like this is an apply pressure move on SCOTUS.  If SCOTUS rules against tariffs, Trump gets to say, there goes your $2k dividend.   If they don't he gets to seem compassionate and say hey we realize prices are still a little high, but I helped offset them for you.  Wins a little favorability.  I'd rather see debt paid off coupled with massive spending cuts, but R's need to be able to get reelected at midterms, and imagine the ads saying such and such Democrat voted against tariffs and your dividend!  People will remember a little spending money over more financially stable country unfortunately. permalink award report block reply\nMhmm2MoreWeeks 2 points 3 days ago They will never let Trump give everyone $2000. permalink award report block reply\nDITTOPatriot 2 points 3 days ago FK that, I'm tired of the underperforming getting a check when I get nothing.  It should be based  off of a percentage of the tax you pay. And the BS of measuring the economy off of the financial sector is BS. What about Mainstreet? permalink award report block reply\nUltraFrogMan 2 points 3 days ago Sweet I can get a new heater core for my truck permalink award report block reply\nCounterwhat 2 points 3 days ago Let's return to Pre1913 prosperity. permalink award report block reply\nKeepMarxInTheGround 2 points 3 days ago I think he was saying that after the debt is paid off, American citizens would receive $2000 per year in dividends from tariff revenue. permalink award report block reply\nTromboneofsteel 1 points 3 days ago The federal gov is like a single wine aunt who's on her 35th maxed out credit card and refuses to lower her standard of living. I mean, maybe it'd be worth it if it got half the dumbass college liberals to vote red in the midterms. But that ain't going to happen. permalink award report block reply\nmoscowjade 1 points 3 days ago He's trying to buy social pressure on the rogue justices. Good idea. permalink award report block reply\n45ichooseu 1 points 3 days ago What's a high income person? I only ask because one person making $120k/yr, with two kids and a spouse that stays home to take care of them, is only just \"getting by\" in California. permalink award report block reply\nStandingoak 1 points 3 days ago 38 but whose counting ? permalink award report block reply\nTardigrade 1 points 3 days ago I'll use mine to buy an ounce of palladium.  Maybe a Mcribwich with what's left over. permalink award report block reply\nTacitus1963 1 points 3 days ago What should happen is that any American taxpayer who wants to get the $2K must prove s/he is an actual citizen.\nPut Elon and his team in charge of organizing this.\nZero $ should be given to illegals and those who don't pay any taxes. permalink award report block reply\nSicsempertyrannis76 1 points 3 days ago Would rather end income and property tax permalink award report block reply\nGenericwhitemale 1 points 3 days ago Damage control for the SNAP bs. This is dumb permalink award report block reply\nparamour 1 points 3 days ago Trump needs to go scorched earth on this shit. Figuratively  of course. We voted for him to do what he's doing. Balls to the wall, bitches! LET'S GO!!! permalink award report block reply\nunotrumpcard 1 points 3 days ago Put tariffs on import which are then paid back with stimulus checks, genius. Retarded. permalink award report block reply Kraken_V_Algorithm -1 points 3 days ago Which then stimulates domestic economy, increasing tax revenue, goes toward ultimate plan of reducing debt.  Just need DOGE cuts to keep happening and reduce size of govt.  Why do simpletons continue to think this stuff can all happen in one cycle when it took decades to get us where we are? permalink parent award report block reply unotrumpcard 1 points 3 days ago Stimulating the economy by collecting tax from stimulus money funded by taxing imports, its brilliant really, keeps the money circling perpetually. Btw the debt has increased a couple of trillions since Trump took office, there is no plan to \"reduce debt\", retard mongoloid. permalink parent award report block reply Kraken_V_Algorithm -1 points 3 days ago No, not perpetual.  Reading is fundamental.  Cyclical planning.  And don't forget all COVID money printing for programs on top of the individual stimulus.  And Biden happened since first term too.  But go ahead, keep blaming Trump for all the Dem interference. permalink parent award report block reply unotrumpcard 1 points 3 days ago It is very low IQ behavior to instantly start arguing about who is to blame as if it is interesting. I am just stating the fact that the debt will increase under Trump 2 just as it did under Trump 1. It is only a delusional retard who clings onto the dream that the debt will be reduced. I wont even engage with you about whose fault it is until you start living in reality. permalink parent award report block reply view 2 more comments...\nKraken_V_Algorithm -1 points 3 days ago Which then stimulates domestic economy, increasing tax revenue, goes toward ultimate plan of reducing debt.  Just need DOGE cuts to keep happening and reduce size of govt.  Why do simpletons continue to think this stuff can all happen in one cycle when it took decades to get us where we are? permalink parent award report block reply unotrumpcard 1 points 3 days ago Stimulating the economy by collecting tax from stimulus money funded by taxing imports, its brilliant really, keeps the money circling perpetually. Btw the debt has increased a couple of trillions since Trump took office, there is no plan to \"reduce debt\", retard mongoloid. permalink parent award report block reply Kraken_V_Algorithm -1 points 3 days ago No, not perpetual.  Reading is fundamental.  Cyclical planning.  And don't forget all COVID money printing for programs on top of the individual stimulus.  And Biden happened since first term too.  But go ahead, keep blaming Trump for all the Dem interference. permalink parent award report block reply unotrumpcard 1 points 3 days ago It is very low IQ behavior to instantly start arguing about who is to blame as if it is interesting. I am just stating the fact that the debt will increase under Trump 2 just as it did under Trump 1. It is only a delusional retard who clings onto the dream that the debt will be reduced. I wont even engage with you about whose fault it is until you start living in reality. permalink parent award report block reply view 2 more comments...\nunotrumpcard 1 points 3 days ago Stimulating the economy by collecting tax from stimulus money funded by taxing imports, its brilliant really, keeps the money circling perpetually. Btw the debt has increased a couple of trillions since Trump took office, there is no plan to \"reduce debt\", retard mongoloid. permalink parent award report block reply Kraken_V_Algorithm -1 points 3 days ago No, not perpetual.  Reading is fundamental.  Cyclical planning.  And don't forget all COVID money printing for programs on top of the individual stimulus.  And Biden happened since first term too.  But go ahead, keep blaming Trump for all the Dem interference. permalink parent award report block reply unotrumpcard 1 points 3 days ago It is very low IQ behavior to instantly start arguing about who is to blame as if it is interesting. I am just stating the fact that the debt will increase under Trump 2 just as it did under Trump 1. It is only a delusional retard who clings onto the dream that the debt will be reduced. I wont even engage with you about whose fault it is until you start living in reality. permalink parent award report block reply view 2 more comments...\nKraken_V_Algorithm -1 points 3 days ago No, not perpetual.  Reading is fundamental.  Cyclical planning.  And don't forget all COVID money printing for programs on top of the individual stimulus.  And Biden happened since first term too.  But go ahead, keep blaming Trump for all the Dem interference. permalink parent award report block reply unotrumpcard 1 points 3 days ago It is very low IQ behavior to instantly start arguing about who is to blame as if it is interesting. I am just stating the fact that the debt will increase under Trump 2 just as it did under Trump 1. It is only a delusional retard who clings onto the dream that the debt will be reduced. I wont even engage with you about whose fault it is until you start living in reality. permalink parent award report block reply view 2 more comments...\nunotrumpcard 1 points 3 days ago It is very low IQ behavior to instantly start arguing about who is to blame as if it is interesting. I am just stating the fact that the debt will increase under Trump 2 just as it did under Trump 1. It is only a delusional retard who clings onto the dream that the debt will be reduced. I wont even engage with you about whose fault it is until you start living in reality. permalink parent award report block reply view 2 more comments...\nUrusovite 1 points 3 days ago Id rather he just pay off the debt… permalink award report block reply\n2016TrumpMAGA 1 points 3 days ago Fuck a dividend, pay down the debt. permalink award report block reply\ngp7373 1 points 3 days ago The stock market does not track the everyday persons economic health nor is it a reflection of the overall economy. The elite class is so out of touch by how bad most people are struggling. Glad your billionaire buddies are doing great in the stock market, they also comprise more than 80% of market share. We need jobs, and more importantly wages to track with cost of living. Stagflation of wages combined with out of touch policies are destroying the economy......... permalink award report block reply\nhey_spike 1 points 3 days ago It will be stimmy 2.0. permalink award report block reply\nglasscrawler 1 points 3 days ago I would rather illegals not be included. permalink award report block reply\nhansgruber7 1 points 3 days ago This is a retarded idea. permalink award report block reply\nisraelworst 1 points 3 days ago Um he meant paid against the national debt right...? Right???? permalink award report block reply\nTonyTheSlop 1 points 3 days ago Should only give it to those who voted Trump lol.. Also what the fuck does high income mean? permalink award report block reply\nYaharaRiver 1 points 3 days ago $2k x 175 million eligible adults (rough guesstimate, not minors, not foreigners) is only $360 billion. Our GDP last year WITHOUT TARIFFS, WITH FULL DEAD WEIGHT, WITH MAXIMUM LEECHES, was $29,000 billion. (That’s nearly 30 TRILLION) With deadweights eliminated, with leeches kicked out, with tariff money pouring in, this refund to us is a piece of cake.  LFG! permalink award report block reply\npatrioticwinning3 1 points 3 days ago They aren't fools they are communists, jihadis and globohomos TRYING TO CRASH THE ECONOMY! permalink award report block reply\nAmericanJawa 1 points 3 days ago will soon begin paying down our ENORMOUS DEBT This should be the singular focus until the debt is actually paid off. permalink award report block reply\nKiwipede22 1 points 3 days ago I call bullshit on the dividend payment.\nOne either pays down debt or one pays a dividend… it cannot be both AND LETS FACE IT THE GOVT ARE NOT GOING TO PAY EVERY SINGLE PERSON $2K. permalink award report block reply\ndorsalmorsel 1 points 3 days ago We don't need cash payoffs like this.  Nobody is asking for cash payoffs like this. Just lower taxes for the next cycle.  Eliminate the estate tax. permalink award report block reply\n10MeV 1 points 3 days ago NO, dammit!  Reduce borrowing, pay off debt.  We're drowning in debt, and inflation is already destroying savings.  STOP IT! permalink award report block reply\nbrickbrack 1 points 3 days ago Great, so I have a choice between Trump the commie and Mamdumi the commie. Fucking joy. permalink award report block reply\nkeeman 1 points 3 days ago Yay socialism!  And just think of all the government bureaucrats who will need to be hired to administer this. permalink award report block reply\nTurdSammich 1 points 3 days ago Wish he wouldnt say these things.   2k a person will cause instant inflation.  Better to reduce tax rates. permalink award report block reply\n67Vert 1 points 3 days ago Apply only to people who pay taxes.  Please permalink award report block reply\nACActual 1 points 3 days ago This is a whopper.   Took a page from his days as  a Democrat permalink award report block reply\nDivineEternal1 1 points 3 days ago This won't cause inflation like the stimulus checks did, right? I'd rather he put it to paying off the national debt. permalink award report block reply\nAbovethefray 1 points 3 days ago Giving away money again?  Come on, man. permalink award report block reply\nPelosi_Halitosis 0 points 3 days ago Keep the $2k. It's just fodder for the leftists. Even though they'll be the first ones to cash the check, and will still say it increased the debt somehow. permalink award report block reply\nDiddlywac3 0 points 3 days ago The amount of people here who think they know more than Trump is hilarious permalink award report block reply Maganifice7 1 points 3 days ago I know more about ai than Trump. permalink parent award report block reply YaharaRiver 0 points 3 days ago Right? 2 billion pisslamics against 1 White male. Also known as a Fair Fight 😆 permalink parent award report block reply\nMaganifice7 1 points 3 days ago I know more about ai than Trump. permalink parent award report block reply\nYaharaRiver 0 points 3 days ago Right? 2 billion pisslamics against 1 White male. Also known as a Fair Fight 😆 permalink parent award report block reply\nyepyep 0 points 3 days ago I have 4 children, will they get a check? permalink award report block reply\nLiterallyKaiser 0 points 3 days ago Dumbest idea possible, who is telling him this stuff? Last time we gave out free checks we got the worst inflation in decades, now he wants to give even more in checks while we’re still struggling to bring down inflation from 2020? Ffs permalink award report block reply\nEdBuck 0 points 3 days ago What the fuck does high earning mean???? permalink award report block reply\nTrump737 0 points 3 days ago So high income- yeah , lets just screw them.  Wtf is a high income person?  1M a year?  100K /yr\nThe higher income people are who continue to buy and consume- permalink award report block reply YaharaRiver 2 points 3 days ago Eyebrow technicians 😆 permalink parent award report block reply\nYaharaRiver 2 points 3 days ago Eyebrow technicians 😆 permalink parent award report block reply\nGuerillaYourDreams 0 points 3 days ago That would be nice, but is that the best use of our money?? permalink award report block reply Prandogolio 4 points 3 days ago Yes, when you get your check you can use it for whatever you think is best. permalink parent award report block reply Patriot4TN 3 points 3 days ago Take what you can get. Your taxes are stolen away from you to enrich the crooks. permalink parent award report block reply\nPrandogolio 4 points 3 days ago Yes, when you get your check you can use it for whatever you think is best. permalink parent award report block reply\nPatriot4TN 3 points 3 days ago Take what you can get. Your taxes are stolen away from you to enrich the crooks. permalink parent award report block reply\nSnooptwo 0 points 3 days ago Don’t give it to the people. Put it right towards the debt. I don’t give a shit about boomers getting $2000, I care about unfucking what their generation did to us. permalink award report block reply\nfweedom 0 points 3 days ago I'm not gleefully paying higher prices (from tariffs) so he can transfer even more wealth to poor people!!!!  DO NOT USE TARIFF MONEY TO SEND STIMULUS CHECKS TO POOR PEOPLE!!! permalink award report block reply\nbluewhiteandred 0 points 3 days ago is this a before Christmas dividend / bonus thing because that's probably good timing if so edit: it's also pretty amazing that he seems to always know what to do. I was just commenting a few days ago that paying the national debt is such an intangible that - although many people might like it and appreciate it - it probably doesn't get votes like lowering taxes or some kind of dividend does permalink award report block reply\nHoganT 0 points 3 days ago Hah! Yeah, these are starting to lose their punch. permalink award report block reply\nLaptopDied 0 points 3 days ago He is defending our sovereignty and our currency. Related things. Good job. It's called making a living. You get that with a businessman president. permalink award report block reply bill_in_texas 7 points 3 days ago Borrowing more money to hand out, to fire up inflation more and put us in even more debt is a businessman at work?  That's certainly not a businessman that wants to stay in business. We already did this and got the Bidenflation.  You really want to do that again?  It's the reason people are hurting now. permalink parent award report block reply LaptopDied 2 points 3 days ago But it isn't borrowed money? I am certainly against borrowing. permalink parent award report block reply Isolated_Patriot 2 points 3 days ago Borrowing more money to hand out This is not part of his proposal... permalink parent award report block reply bill_in_texas 5 points 3 days ago Let's put it this way.  You are underwater on your mortgage, and also on your car payment.  You have no savings, and your monthly expenses exceed your monthly income.  You've been borrowing on your credit card to make ends meet.  But now, you are renting out a room in your house to a boarder, and you have extra income, yet, you still have to lean on more credit card debt each month to make ends meet. But you want to be popular in the neighborhood, so at Halloween, you hand out $ 100 bills to the kids trick or treating. That's more money you have to borrow from your credit card issuer, that you'll have to pay back with interest. permalink parent award report block reply ddbb 1 points 3 days ago The thumbs down on my post tells me you either don't run your household finances, or you have a laughable amount of \"leverage\" yourself. What a joke. permalink parent award report block reply Isolated_Patriot 1 points 3 days ago Assuming that the person who actually bothered to responded to you is the same person as the (now 4) who downvoted you tells me that you only discovered the internet yesterday. What a joke. permalink parent award report block reply view 1 more comments... ddbb -1 points 3 days ago Of course it is. If you have debt - any money spent NOT paying it off is borrowed. permalink parent award report block reply newestofnew 1 points 3 days ago he's actually hurting the currency significantly currently, because with the tariff regime dollars are returning home from abroad. majority of international dollars holdings are eurodollars created by fractional reserve systems at European branches of american banks. Trump has no plan on dealing with international dollars flooding the domestic market. has no attention on it. that's why gold is at 4,000 and just getting started. permalink parent award report block reply LaptopDied 0 points 3 days ago Well some will use that new money well and some won't. Money used badly disappears into the air. The main thing is work. Productivity.  The rest is just symbolism of work. permalink parent award report block reply\nbill_in_texas 7 points 3 days ago Borrowing more money to hand out, to fire up inflation more and put us in even more debt is a businessman at work?  That's certainly not a businessman that wants to stay in business. We already did this and got the Bidenflation.  You really want to do that again?  It's the reason people are hurting now. permalink parent award report block reply LaptopDied 2 points 3 days ago But it isn't borrowed money? I am certainly against borrowing. permalink parent award report block reply Isolated_Patriot 2 points 3 days ago Borrowing more money to hand out This is not part of his proposal... permalink parent award report block reply bill_in_texas 5 points 3 days ago Let's put it this way.  You are underwater on your mortgage, and also on your car payment.  You have no savings, and your monthly expenses exceed your monthly income.  You've been borrowing on your credit card to make ends meet.  But now, you are renting out a room in your house to a boarder, and you have extra income, yet, you still have to lean on more credit card debt each month to make ends meet. But you want to be popular in the neighborhood, so at Halloween, you hand out $ 100 bills to the kids trick or treating. That's more money you have to borrow from your credit card issuer, that you'll have to pay back with interest. permalink parent award report block reply ddbb 1 points 3 days ago The thumbs down on my post tells me you either don't run your household finances, or you have a laughable amount of \"leverage\" yourself. What a joke. permalink parent award report block reply Isolated_Patriot 1 points 3 days ago Assuming that the person who actually bothered to responded to you is the same person as the (now 4) who downvoted you tells me that you only discovered the internet yesterday. What a joke. permalink parent award report block reply view 1 more comments... ddbb -1 points 3 days ago Of course it is. If you have debt - any money spent NOT paying it off is borrowed. permalink parent award report block reply\nLaptopDied 2 points 3 days ago But it isn't borrowed money? I am certainly against borrowing. permalink parent award report block reply\nIsolated_Patriot 2 points 3 days ago Borrowing more money to hand out This is not part of his proposal... permalink parent award report block reply bill_in_texas 5 points 3 days ago Let's put it this way.  You are underwater on your mortgage, and also on your car payment.  You have no savings, and your monthly expenses exceed your monthly income.  You've been borrowing on your credit card to make ends meet.  But now, you are renting out a room in your house to a boarder, and you have extra income, yet, you still have to lean on more credit card debt each month to make ends meet. But you want to be popular in the neighborhood, so at Halloween, you hand out $ 100 bills to the kids trick or treating. That's more money you have to borrow from your credit card issuer, that you'll have to pay back with interest. permalink parent award report block reply ddbb 1 points 3 days ago The thumbs down on my post tells me you either don't run your household finances, or you have a laughable amount of \"leverage\" yourself. What a joke. permalink parent award report block reply Isolated_Patriot 1 points 3 days ago Assuming that the person who actually bothered to responded to you is the same person as the (now 4) who downvoted you tells me that you only discovered the internet yesterday. What a joke. permalink parent award report block reply view 1 more comments... ddbb -1 points 3 days ago Of course it is. If you have debt - any money spent NOT paying it off is borrowed. permalink parent award report block reply\nbill_in_texas 5 points 3 days ago Let's put it this way.  You are underwater on your mortgage, and also on your car payment.  You have no savings, and your monthly expenses exceed your monthly income.  You've been borrowing on your credit card to make ends meet.  But now, you are renting out a room in your house to a boarder, and you have extra income, yet, you still have to lean on more credit card debt each month to make ends meet. But you want to be popular in the neighborhood, so at Halloween, you hand out $ 100 bills to the kids trick or treating. That's more money you have to borrow from your credit card issuer, that you'll have to pay back with interest. permalink parent award report block reply\nddbb 1 points 3 days ago The thumbs down on my post tells me you either don't run your household finances, or you have a laughable amount of \"leverage\" yourself. What a joke. permalink parent award report block reply Isolated_Patriot 1 points 3 days ago Assuming that the person who actually bothered to responded to you is the same person as the (now 4) who downvoted you tells me that you only discovered the internet yesterday. What a joke. permalink parent award report block reply view 1 more comments...\nIsolated_Patriot 1 points 3 days ago Assuming that the person who actually bothered to responded to you is the same person as the (now 4) who downvoted you tells me that you only discovered the internet yesterday. What a joke. permalink parent award report block reply view 1 more comments...\nddbb -1 points 3 days ago Of course it is. If you have debt - any money spent NOT paying it off is borrowed. permalink parent award report block reply\nnewestofnew 1 points 3 days ago he's actually hurting the currency significantly currently, because with the tariff regime dollars are returning home from abroad. majority of international dollars holdings are eurodollars created by fractional reserve systems at European branches of american banks. Trump has no plan on dealing with international dollars flooding the domestic market. has no attention on it. that's why gold is at 4,000 and just getting started. permalink parent award report block reply LaptopDied 0 points 3 days ago Well some will use that new money well and some won't. Money used badly disappears into the air. The main thing is work. Productivity.  The rest is just symbolism of work. permalink parent award report block reply\nLaptopDied 0 points 3 days ago Well some will use that new money well and some won't. Money used badly disappears into the air. The main thing is work. Productivity.  The rest is just symbolism of work. permalink parent award report block reply\nChad_Prime 0 points 3 days ago WTF? How about we take these\"excess\"funds and start paying down the fucking debt? Who is advising him of this retarded idea? Mr. President, if you are listening, please rethink this! Good God man! permalink award report block reply\nbarryb0nds 0 points 3 days ago Yay more inflation. Citing stock market prices is weird. The stock market hitting new highs every other week is being carried by the tech sector via AI companies and frankly it's alarming. Take tech companies out and the market barely moved in a year. Just to pick an example, take Schwab's dividend ETF https://totalrealreturns.com/s/USDOLLAR,SCHD?start=2024-11-05 It's holdings are all, long term SOLID American companies that pay good dividends. It's down from 1 year ago. I think another 6, 12, maybe 18 months bull run until the AI bubble bursts. Even before the election we had analysts at Schwab and Vanguard warning we could see a decade of only 3$ annualized S&P500 growth due to tech being so overvalued. Does anybody really think Nvidia is worth 5 TRILLION dollars? I don't think this is sustainable at all. permalink award report block reply\nquestionmarks 0 points 3 days ago polls must be looking grim permalink award report block reply\nlispboy 0 points 3 days ago It's a whooping 96¢/hr raise for a full time worker. permalink award report block reply YaharaRiver 2 points 3 days ago It’s not a raise AT ALL. it’s a Bonus. permalink parent award report block reply\nYaharaRiver 2 points 3 days ago It’s not a raise AT ALL. it’s a Bonus. permalink parent award report block reply\nDagneyTaggart -1 points 3 days ago This will feed hyperinflation. Did we not learn anything from Covid helicopter money? If you’re going to pay it, first deport 40 million illegal aliens and cross all the American welfare takers off the list. permalink award report block reply Deplorable_Badger 3 points 3 days ago Lets start with redistributing Nancy Pelosi's insider trading money back to the people. permalink parent award report block reply\nDeplorable_Badger 3 points 3 days ago Lets start with redistributing Nancy Pelosi's insider trading money back to the people. permalink parent award report block reply\nSteve1 -1 points 3 days ago Why - buying votes - this communist crap - cut my taxes make government smaller Eliminate property tax! Arrest the Coup gang - if you don’t there going to arrest you when they get back in power - fix elections NJ and VA just had machine elections WTF - permalink award report block reply\nMhmm2MoreWeeks -1 points 3 days ago Trump gives everyone in America $2K. Imagine. The popularity of the Man. Just imagine. They call this Communism by the way. Good way to Segway to a UBI in a North American Union. permalink award report block reply\nHoganT -2 points 3 days ago Reeks of desperation. permalink award report block reply Logan051361 0 points 3 days ago AAre you kidding? People need Food, and bills get higher. we should be getting some back. Especially Seniors permalink parent award report block reply HoganT -1 points 3 days ago Seniors? So you didn’t work hard, build wealth, and budget for retirement accordingly so now we have to pay for you? How bought cut down on those 6:00 am cafe breakfasts and sell your million dollar appreciated $80,000 home and downsize? permalink parent award report block reply Logan051361 1 points 3 days ago Not all Seniors Are in the same boat. I know to retired Teachers that cant afford to pay all their bills by themselves and work at Walmart to make ends meet. this story is all across the country. thinking just cause you are tired you should be well off is bullshit permalink parent award report block reply HoganT 0 points 3 days ago So because you didn’t succeed in life we should pay for you? permalink parent award report block reply view 3 more comments...\nLogan051361 0 points 3 days ago AAre you kidding? People need Food, and bills get higher. we should be getting some back. Especially Seniors permalink parent award report block reply HoganT -1 points 3 days ago Seniors? So you didn’t work hard, build wealth, and budget for retirement accordingly so now we have to pay for you? How bought cut down on those 6:00 am cafe breakfasts and sell your million dollar appreciated $80,000 home and downsize? permalink parent award report block reply Logan051361 1 points 3 days ago Not all Seniors Are in the same boat. I know to retired Teachers that cant afford to pay all their bills by themselves and work at Walmart to make ends meet. this story is all across the country. thinking just cause you are tired you should be well off is bullshit permalink parent award report block reply HoganT 0 points 3 days ago So because you didn’t succeed in life we should pay for you? permalink parent award report block reply view 3 more comments...\nHoganT -1 points 3 days ago Seniors? So you didn’t work hard, build wealth, and budget for retirement accordingly so now we have to pay for you? How bought cut down on those 6:00 am cafe breakfasts and sell your million dollar appreciated $80,000 home and downsize? permalink parent award report block reply Logan051361 1 points 3 days ago Not all Seniors Are in the same boat. I know to retired Teachers that cant afford to pay all their bills by themselves and work at Walmart to make ends meet. this story is all across the country. thinking just cause you are tired you should be well off is bullshit permalink parent award report block reply HoganT 0 points 3 days ago So because you didn’t succeed in life we should pay for you? permalink parent award report block reply view 3 more comments...\nLogan051361 1 points 3 days ago Not all Seniors Are in the same boat. I know to retired Teachers that cant afford to pay all their bills by themselves and work at Walmart to make ends meet. this story is all across the country. thinking just cause you are tired you should be well off is bullshit permalink parent award report block reply HoganT 0 points 3 days ago So because you didn’t succeed in life we should pay for you? permalink parent award report block reply view 3 more comments...\nHoganT 0 points 3 days ago So because you didn’t succeed in life we should pay for you? permalink parent award report block reply view 3 more comments...\nconservativefrank -2 points 3 days ago Terrific! Another tax payer funded dividend. You'll receive $2000. In return there will be higher taxes and more massive inflation. permalink award report block reply\njames_randall 3 points 3 days ago Comment removed upon the user being banned. permalink award report block reply\nfreedom4Speech 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nTheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:15:51.305366Z"
}