{
  "id": "8181763",
  "title": "1424Wait Harvard has the cure for breast cancer but they won't spend any of their 50 billion dollar ",
  "url": "https://patriots.win/p/1ARK9is3FL/wait-harvard-has-the-cure-for-br/c",
  "content": "1424 Wait Harvard has the cure for breast cancer but they won't spend any of their 50 billion dollar endowment to develop it and instead demand that the taxpayers give them the money? Wow these people are even more evil than I ever imagined. posted 2 days ago by PiratePatriotParrot 217 comments award share report block Matt Walsh @MattWalshBlog • 2d Wait Harvard has the cure for breast cancer but they won't spend any of their 50 billion dollar endowment to develop it and instead demand that the taxpayers give them the money? Wow these people are even more evil than I ever imagined. 60 Minutes @60Minutes • 3d Harvard researcher Joan Brugge says her work has the potential to prevent breast cancer, but she was notified last spring that her federal funding was terminated. “It was just like a gut punch. My knees buckled, and I had to sit down,” she says.\n217 comments Sort by Top Top New Worst Old Save Prof_Smith 126 points 2 days ago Fuck that even…. How about the pharma companies who have shit loads of money to fund this research but they won’t. So, the system is designed for you to pay with your tax dollars liberal researchers to come up with something that they sell to a pharma company that makes it and sells it back to you for 10000% markup. permalink award report block reply XxxRDTPRNxxX 74 points 2 days ago Worse, what about the ones that have cures to diseases already discovered but don't bring them to market because it's more profitable sell a treatment? You know they're there. Is there any law requiring them to bring shit like that to market? There are definitely laws saying they have to act in the best interest of shareholders and if they don't the CEO can be personally liable for losses. permalink parent award report block reply Cuetardian 33 points 2 days ago and their argument would be that \"selling the treatment over and over and over makes tons of money and THAT is in the best interest of the shareholders.\" Monsters. permalink parent award report block reply ModernKnight 18 points 2 days ago The real cure for breast cancer is actually having kids before 25.  Breast cancer used to be called \"Nun's disease,\" because almost all the people who got it were nuns.  I think the age when women become more at risk for breast cancer is somewhere around 23, with each further year a woman goes without giving birth doubling her chance of breast cancer.  It has to do with how womens' bodies develop, with the breasts only fully developing when she has a kid and breast feeds that kid finishing development, and not doing so causing problems. permalink parent award report block reply America1stAndOnly 5 points 1 day ago But if they do that they won't be able to get abortions and perform their child sacrifices to moloch. permalink parent award report block reply view 1 more comments... Mestroisfils 3 points 1 day ago Yes.  Having kids early,  nursing them and avoiding birth control pills are the way. permalink parent award report block reply I_have_lady_parts-2 3 points 2 days ago Holy shit... maybe this. Girl in my grad class just died from it. 38 or 39... married but no kids. Looked like a model all her life. But also seems like she followed the hard and fast mustard treatment so... who knows. permalink parent award report block reply XxxRDTPRNxxX 4 points 2 days ago They're not wrong either. permalink parent award report block reply 0111000001100101 14 points 2 days ago Best interest of shareholders taking precedence is one of the worst things that happened to america since ww2.  I noticed.  Along with switching fries from tallow to seed oils, I noticed that also. permalink parent award report block reply Squentin 4 points 1 day ago It's basic capitalism.  Capitalism has cured more diseases than any other system could.  That said, tge government needs to play a major role in situations where cures are not inherently profitable. permalink parent award report block reply 0111000001100101 1 points 1 day ago Right that's exactly the problem. America had its golden age from  FREE MARKET not CAPITALISM.  The distinctions are and undertone to those not paying with attention and the implications are massive. permalink parent award report block reply WildStar 1 points 1 day ago Yes, and it's one problem we can't blame on the left. This was pure boomer conservatism. permalink parent award report block reply Squentin 2 points 1 day ago The Rand Paul strain of pure libertarianism ad opposed to more pragmatic approaches that recognize that the simplicity of that model has some nasty side affects permalink parent award report block reply view 1 more comments... Squentin 1 points 1 day ago This is the component where government needs to play a role.  Not all cures are going be inherently profitable for the drug companies. permalink parent award report block reply XxxRDTPRNxxX 3 points 1 day ago I've said before a possible solution is to put bounties on diseases. First company to produce a working cure for cancer gets 1 trillion from the government, but they can't patent it and it immediately enters public domain. permalink parent award report block reply Squentin 2 points 1 day ago Makes sense.   It would save the taxpayers money in the long run. permalink parent award report block reply 0111000001100101 1 points 1 day ago Interesting idea permalink parent award report block reply VirPopulus 1 points 2 days ago Sounds very Jewish. permalink parent award report block reply TPMJB 0 points 1 day ago Worse, what about the ones that have cures to diseases already discovered but don't bring them to market because it's more profitable sell a treatment? I wish people would stop parroting this absolutely neanderthal statement. You know how much those cures cost? Absolutely astronomical amounts of money. Not to pharma, to you. And you end up paying it. Why? Because you have no other options. You know what's cheaper? Chemo, radiation, and removal. You know what insurance covers first ? You guessed it! Some of you will be cured, many will die = less money insurance has to dish out. Pharma absolutely profits on cures and absolutely makes them. A lot of the mabs out there will cure, and will also cost you $10k/month without insurance minimum . It's like playing whack-a-mole with all the diseases out there.  They could cure a thousand different cancers and there'd still be tens of thousands more. Absolutely bonehead, 90s comedian take. permalink parent award report block reply XxxRDTPRNxxX 2 points 1 day ago Pharma absolutely profits on cures and absolutely makes them. A lot of the mabs out there will cure, and will also cost you $10k/month without insurance minimum. What a completely asinine misrepresentation of what I said. Where did I say that they never cure any diseases? Where did I say that? I didn't. I said there are some diseases they won't cure due to making more money on treatments. Are you gonna refute that? No, you aren't. and will also cost you $10k/month without insurance minimum. Show me the $10k per month cure for cancer or diabetes, fucking retard. permalink parent award report block reply TPMJB 1 points 1 day ago You just said \"they don't bring cures to the market\". What the fuck else could you mean? They make a shitload more on cures than they ever did on treatment, and they make that money up front instead of over time, which means instant gratification for shareholders. MuH cUrE fOr CaNcEr!111 It's retards like you that think all cancer is the same. We've had a cure for ALL for decades . Breast cancer is as simple as lopping off the tits the vast majority of the time. Keytruda treats and often cures many different types of cancer . Keytruda is so old that it's coming off patent! People that struggled through high school and have problems with concepts like \"every different cancer has a different cause and different treatment options\" are the worst. It's like explaining Checkers to someone who can't stop eating glue. permalink parent award report block reply view 16 more comments... Isolated_Patriot 2 points 1 day ago cost you $10k/month So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. permalink parent award report block reply TPMJB 1 points 1 day ago So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. By definition, there is no \"cure\". Unless you're getting down to the microscopic level and analyzing every cell, you will never be able to determine if the problem is completely gone. No more cancerous cells? What if a gene disorder caused it in the first place? So people will be in \"remission\" for 10, 20, 30 years. Could it still come back? Sure. Is it going to? Likelihood drops with every year. At this point it's a war on language. Pragmatically, many are \"cured\" and will never experience cancer again. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. Probably because of the astronomical amounts of money that goes into it. You're not just mixing chemicals in a vat, you're genetically modifying a cell to produce antibodies.  You can't even make generics of existing monoclonal antibodies - you can only make \"similar\" (biosimilar) drugs as it's impossible to make an exact copy. Our glove budget is more than my salary. I could go on and on, but I imagine you've stopped reading by now. permalink parent award report block reply Sgt_Hulka 18 points 2 days ago Yep. Tired of taking it up the ass yet? permalink parent award report block reply Here_we_go 22 points 2 days ago Wtf does Obama have to do with this? Kek permalink parent award report block reply bh506407 5 points 2 days ago Nothing, because that guy NEVER tires of taking big Mike’s swinging cock up his ass! permalink parent award report block reply Prof_Smith 10 points 2 days ago Oh, I don’t play the game.  I don’t do doctors or meds and gladly limit my exposure to society as a whole. Only way to win is not to play. permalink parent award report block reply Deplora 10 points 2 days ago They'll fund research that is reasonably likely to result in a patentable treatment, and they have already done a lot of that for breast cancer, very effectively.  They won't fund researchers' hopes and dreams -- neither pharma companies nor the government should do that. permalink parent award report block reply UCantStumpTheTrump 13 points 2 days ago Bingo, I'm a chemist working in the cancer space (startup) and we are 100% funded by VCs and private investors. permalink parent award report block reply BloodElfSupporter 8 points 2 days ago Are u in Boston? I’m also a chemist that recently joined a start up as well. Not in cancer tho more like biologics and gene therapy. Also funded by VCs but also have a partner program with one of the pharma giants in the states (not Pfizer) permalink parent award report block reply UCantStumpTheTrump 7 points 2 days ago I’m in SF. And we are doing a form of gene therapy (in the sense that we make a nanoparticle that targets a specific cancer-related messenger RNA known to be overexpressed in the tumor cells). If the target is bound, release of a cytotoxic payload is triggered. If there is no target, the payload remains inert and the particles are excreted unchanged. My PhD work mainly focused on the design and synthesis of novel biocompatible nanomaterials for transfection-free intracellular gene knockdown. permalink parent award report block reply view 15 more comments... UCantStumpTheTrump 2 points 2 days ago You at HelixNano by any chance? permalink parent award report block reply view 2 more comments... PatriotSam 3 points 2 days ago Watch the video she does not say that she has the cure to breast cancer in it. A woman also is not capable of synthesizing enough brain power to come anywhere near finding a medical miracle of this magnitude. The cure for cancer, if it's even possible, which I don't think it's possible, will be found by a man. permalink parent award report block reply KungPaoMcChicken 7 points 2 days ago Dude, we can't even reconnect nerves after they are severed. How the fuck are we going to cure cancer? It's not possible. Cancer is mother nature's cure for human lifespan's going well beyond 100 years. What possible help is a cure? We will end up sustaining nursing home populations for 50 to 60 years if we cure cancer. permalink parent award report block reply PatriotSam 5 points 2 days ago Yes, cancer is simply your cells not dividing properly anymore. It's just like how you copy a photo over and over and it warps, no way to stop that. permalink parent award report block reply TGNX 2 points 2 days ago There are biologically immortal animals out there that never develop cancer. So it's possible, but we just don't know how. Not that I trust pharma fucks to do anything but hide it. permalink parent award report block reply KungPaoMcChicken 0 points 2 days ago To me, wasting money on research like this is a bottomless pit. We should invent cloning and memory transfer. Hey, I have cancer, but here is a fresh body, now transfer over my memory to the new body. Obviously only the rich or super important should have access to this. But, any day I could find cancer in my ass, and it's just a roll of the dice. Long life is pointless. We used to live to 30 or 40 and we were more productive as a human race. Families made like 12 children and they worked in coal mines and shit. School went to 12 years if you were lucky. We have it far too good today and none of us deserve it. A man who has everything is weak as fuck. The struggle makes us real. I imagine those teams of 4 to 5 Russians creeping through towns with those gigantic backpacks and hiding are the kings of this world. They deserve lots of pussy when the war is done. permalink parent award report block reply view 7 more comments... localhost 1 points 2 days ago Or by AI, which is made by men. permalink parent award report block reply tpactionchasethevote 1 points 2 days ago How much would it be to prevent cancer? End all the chemicals in our food and water? permalink parent award report block reply bratt 2 points 2 days ago In other words 'kill everyone'. permalink parent award report block reply FKH2 1 points 1 day ago Yep permalink parent award report block reply load 7 more comments... Deplora 46 points 2 days ago She says her work has potential to prevent (not cure) breast cancer.  I can't be bothered to watch this, but \"breast cancer\" is a whole bunch of different types of cancer, with different developmental pathways and different sensitivity/resistance to various treatments.  Nobody has \" the cure for breast cancer\" or even \" the prevention for breast cancer\", and nobody ever will.  Most preventive measures that are already proven to be highly effective involve lifestyle changes and self-discipline that most women are unwilling to adhere to (no alcohol use, no getting significantly overweight). There are many thousands of biomedical researchers who are hoping that their idea will prove to be very significant for treating or preventing some common life-shortening or disabling disease.  They can't all be given all the money they want to try to prove their idea actually works.  In most cases, their idea will turn out not to work, or to work a little bit but less effectively than somebody else's idea. permalink award report block reply UCantStumpTheTrump 48 points 2 days ago PhD scientist here working in cancer research. These academic scientists are almost ALL turbo-liberals, because they can stay in the ivory tower huffing their own farts, and their research is funded by NIH/NSF grants. Most of the stuff they publish is purely academic and will never become an actual medicine or product, which is why I got out of academia as soon as I defended my thesis and went into industry permalink parent award report block reply I_Am_John_Galt 21 points 2 days ago It's insufferable isn't it?  I couldn't stand the ideological rot and the egotistical snobbery, and that was a good while back.  Jabbering buttplugs posing as human beings. permalink parent award report block reply Moose_Antlers 13 points 2 days ago I'd settle for her actually citing her paper so I can look at it and see if there's any actual validity to her claim. Preventing Breast CA would be huge. But which type? Are we talking BRCA+, ER+, HER+?, the negative versions of these, which get rarer but harder to treat? Details matter when you're making sensationalist claims to a urinalist/activist about a disease which threatens 1 in 8 women and terrifies them all. Meanwhile I'm also reading another author on that paper is saying he did the lion's share of the work and she's trying to claim credit for the breakthrough, if there is one... I already know this is getting politicized and turned into a circus, so I can't listen to either one. I'll have to read the paper myself and see what's up. But yeah, from here, I'm smelling ivory-tower vegan farts with a hint of cat piss and wine breath. Edit: Found the paper: https://www.nature.com/articles/s41588-024-01988-0 She's got a copy number alteration that seems to correlate with BRCA1+ or BRCA2+ status. Maybe a biomarker? Maybe useful as a screening tool? We already have BRCA1 and BRCA2 screening tests, so is her thought to use this in lieu of mammograms in high-risk women in their 20s and 30s to try and catch early onset cancer? (This isn't prevention, it's screening) permalink parent award report block reply UCantStumpTheTrump 8 points 2 days ago There are a lot of academics whose whole career is just questionable contributions to science funded by lavish grants of millions of dollars, just because they made flashy presentations for granting agencies, published papers in prestigious journals, etc. The core of the \"red wine is good for you\" theory came from the compound resveratrol, which is a natural polyphenol present in wine. It was supposed to be cardioprotective or some shit like that, but anyway the professor (Dipak Das) was found to have faked HIS WHOLE CAREER worth of papers, and he wrote a lengthy rambling rebuttal after he was fired and then died unceremoniously of a heart attack. You cant make this shit up! permalink parent award report block reply DrMarcy 3 points 1 day ago I also work in research. I had heard they were in the process of redoing his research to actually find results. Heard anything about that? permalink parent award report block reply view 1 more comments... UCantStumpTheTrump 7 points 2 days ago I'm at a small biotech startup funded by private VCs and private investors, and we are using a nanoparticle that is endocytosed by all cell types and has a DNA component that can bind messenger RNA in the cell and prevent it from being transcribed, so we can target any genetic disorder. also the RNA binding can trigger release of a cytotoxic drug to kill the cell if its a cancer mRNA sequence (like Survivin) that is highly overexpressed in BC cells (esp triple negative) permalink parent award report block reply Tyrone_biggums 1 points 1 day ago BRCA+? BRCA mutant. permalink parent award report block reply 2016TrumpMAGA 6 points 2 days ago Try being a PhD in the humanities.  Half the people I used to work with were certifiably insane.  I was the almost only one in my whole department not on some sort of med. permalink parent award report block reply TPMJB 2 points 1 day ago These academic scientists are almost ALL turbo-liberals, because they can stay in the ivory tower huffing their own farts, and their research is funded by NIH/NSF grants. Academia is almost always 5+ years behind private industry. But private industry keeps all their research behind their closed doors. Private industry it all depends on the location - I've seen my share of Republicans, though we'll never announce that fact. I'd never work for Academia lol. Begging for grants 90% of your week is not science. permalink parent award report block reply Aquamine-Amarine 14 points 2 days ago I don't drink alcohol. Guess I'm off to a good start. permalink parent award report block reply Deplora 12 points 2 days ago You definitely are.  I don't drink alcohol either.  There are a whole lot of benefits besides reducing cancer risk. permalink parent award report block reply makersmarx -1 points 2 days ago Good job, ladies. Way to keep those lady lumps healthy for makersmarx permalink parent award report block reply America1stAndOnly 2 points 1 day ago You're referring to yourself in the 3rd person. Perhaps you'd fit in better at Reddit. permalink parent award report block reply view 9 more comments... they-see-me-trollin 4 points 1 day ago the guy who was the lead researcher on her project came out and said this is wildly misrepresentative... that it's not even close to what 60 minutes presents it as. someone called him out for getting punted from duke, but then it turns out it was because they wanted him to push more of this grifter breadcrumbing bullshit, and he refused. permalink parent award report block reply booblitchutz 2 points 1 day ago Lookit Mr Sensible, over here! permalink parent award report block reply Yaemz123 32 points 2 days ago What she said was her research had POTENTIAL which is the same as all other research. Nobody said she had the cure for breast cancer. Clickbait trash. permalink award report block reply 26magarat 10 points 2 days ago Hey, every criminal is a potential doctor, lawyer, etc. to libs. permalink parent award report block reply fauxgnaws 4 points 2 days ago Potential implies if you put enough resources into it then it'll happen.  What she should have said was \"possibility\". Walsh is click-baiting because he knows she doesn't actually have a cure for cancer, but she was asking for it by mispresenting her work for politics. permalink parent award report block reply amopheldupsidedown 3 points 2 days ago I think he was implying that they know what she has is worthless because they are not willing to put up their own money, even when when they have billions sitting around. However they are perfectly willing to spend your money on it. permalink parent award report block reply bill_in_texas 1 points 1 day ago I have the potential to save someone from a burning car or house fire.  I mean, I haven't done it yet, but I have the potential to do it. permalink parent award report block reply deleted 1 points 2 days ago UCantStumpTheTrump 4 points 2 days ago I'm doing it with VC funding! Which is how it should be done. Academia is all about just pushing out papers to get graduate students out the door with a degree permalink parent award report block reply 1_Badcop 5 points 2 days ago Private Sector? Are you crazy? They expect results! permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago We just filed our patents today. We basically have developed a completely new technology for delivering anticancer drugs that causes them only to be activated in tumor cells while leaving healthy cells alone. We’re in the process of doing our first animal studies now, but so far the data from cell culture has been positive. permalink parent award report block reply view 3 more comments... TPMJB 2 points 1 day ago Depends. The largest pharma companies have dozens of projects that don't produce shit for a decade. I was on a couple of those projects. They shut down after I left. As with any company, the larger the bloat, the more useless \"work\" gets done. permalink parent award report block reply Mamapedia 3 points 2 days ago Best wishes in your research! permalink parent award report block reply UCantStumpTheTrump 2 points 2 days ago Thank you! permalink parent award report block reply Luvs_2_Bop 13 points 2 days ago Exercise, eat red meat, drink tea….stop using all those beauty/skincare products with horrible ingredients. Less bullshit equals less cancer. At least it’s a start permalink award report block reply Deplora 8 points 2 days ago For preventing breast cancer (and some other common cancers) cutting out alcohol is highly effective.  People just don't want to.  Few if any topical beauty/skincare products are doing to increase cancer risk.  I'd be more concerned about all the injectables (fillers, botox, etc) and repeated use of laser treatments. permalink parent award report block reply Luvs_2_Bop 6 points 2 days ago From articles I’ve read, artificial fragrance is a toxic nightmare permalink parent award report block reply TrumpAndGodWin 4 points 2 days ago Dawn soap added a nasty irritating fragrance recently, phenoxyethanol is another one to avoid. You can rinse the hell out of your hands and the toxic stench of new dawn remains. permalink parent award report block reply Deplora 4 points 2 days ago Only ones I've heard of being a problem are natural lavender and tea tree oils (though if there are artificial versions that contain the same chemicals, those would cause problems too).  Several components of these oils have estrogenic and anti-androgenic effects, and can cause breast growth in young boys.  Presumably there are some other potentially undesirable effects that are less visible/detectable. https://www.endocrine.org/news-and-advocacy/news-room/2018/chemicals-in-lavender-and-tea-tree-oil-appear-to-be-hormone-disruptors permalink parent award report block reply booblitchutz 3 points 1 day ago Colon cancer, too. permalink parent award report block reply TPMJB 2 points 1 day ago highly effective Eh, it depends on the amount per day. It seems to be a modest increase, which I was unaware of. https://pmc.ncbi.nlm.nih.gov/articles/PMC7295577/ Seems like 4-8% per 10mL alcohol consumed per day (which I assume they're equating to 100% alcohol? A 40mL shot is roughly 10mL of alcohol, equal to one \"unit\".) But keep in mind that the average incidence is 46.3 per 100,000.  So we're talking somewhere in the realm of 2-4 more than that. It's...an association, but a little weak. With as old as alcohol is in society, I'd think that there was something else at play here. Alcohol does have hormonal activity a la estrogen, so I think it probably modifies something where those predisposed to breast cancer get a boost in their ability to develop cancer. Otherwise, we'd see much higher rates in Poland than we would in the US, but the opposite is true. permalink parent award report block reply Deplora 2 points 1 day ago Several studies have found a very strong effect, especially with binge drinking in early adulthood (i.e. drinking that's considered \"normal\" on many college campuses).  No doubt there are a lot of other factors that account for varying results in different countries, especially dietary factors. permalink parent award report block reply TPMJB 2 points 1 day ago Explain why Poland, which has drinking leagues above the US in the average populace, has a lower incidence of breast cancer. They have a MUCH higher rate of people binge drinking starting at 15. permalink parent award report block reply view 2 more comments... JamesSunderland 2 points 1 day ago My sister in law's mother has prevented the return of her breast cancer these years by eating clean and healthy. No trash foods into her system. permalink parent award report block reply thp2034 12 points 2 days ago So, they are trying to tie blame for the termination of funding to the Trump Admin cuz we all know how mean & nasty the Orange Man can be. But, if Harvard would comply with Federal mandates, then the funding would not be terminated...so does that not actually make Harvard the one to blame? They just have to follow the law like everyone else & funding will not be cut, cancer will be cured and everyone will be happy! permalink award report block reply s27zw7M1h62lURPyezOa PRO 8 points 2 days ago The key term is \"Potential\" to cure cancer.  I have the \"Potential\" to win the Super Lotto. permalink award report block reply Moose_Antlers 2 points 2 days ago \"weasel words\" Though, in her defense, I'd be obliged to use them in any paper because there's always uncertainty in any experiment. Salesmen make definitive all or none statements. Scientists and clinicians always acknowledge the possibility of outliers. permalink parent award report block reply PatriotSam 8 points 2 days ago Oh come the fuck on, she says right in the beginning that she is searching for the potential to cure breast cancer Not that she's actually found the cure. Listen to the wording. Also this is a woman scientist, of course she's going to be featured on CNN for some sort of feminist bullshit like oh my god the women are being prevented from finding the cure to cancer, as if they ever would. Bullshit headline very disappointed in Matt Walsh, he is usually more astute than this. permalink award report block reply booblitchutz 1 points 1 day ago To me it sounds like Matt Walsh is saying Harvard had $50B to fund her research, if it’s so important. permalink parent award report block reply America1stAndOnly 1 points 1 day ago very disappointed in Matt Walsh, he is usually more astute than this. He really isn't. permalink parent award report block reply GoldwaterVoter 7 points 2 days ago For any Alzheimer's caregivers: FOLIC ACID may \"cure \"sundowning\". I was a 24/7 caregiver for my mother for 3 years. And I mean 24 and 7, while I ran a small software company by myself at home. About 5 PM each day she started walking out the front door (at age 83) to take a bus (no bus in our suburban neighborhood) to \"see her mother\". Damn annoying while I was cooking dinner. Heard on a doctor's radio show about Folic acid, so I tried it. One daily vitamin tablet at each meal time and bedtime, total 4 tablets per day. Stopped the sundowning cold for a year, and when started up again, increased dose by 50%, and stopped again. Search for folic acid/sundowning/Alzheimer's and look for current research about folic acid deficiency. For instance: https://pmc.ncbi.nlm.nih.gov/articles/PMC4909909/ permalink award report block reply Koikatrose 1 points 1 day ago Good info. I wish I had known that. 5 years ago Dad had it. What a night mare. God bless you for sharing that info. permalink parent award report block reply TPMJB 1 points 1 day ago For any Alzheimer's caregivers: FOLIC ACID may \"cure \"sundowning\". That paper doesn't use the word \" cure \" but \" mitigate \". So the effects of sundowning won't be as pronounced. Alzheimer's is a prion disease. Once you have it, you're fucked. In the odd future we can regenerate brain tissue, it'll never have the data of the old brain tissue. The only potential pathway we have is to stop it before it gets worse. I know I only have a few decades left at most. It's a good thing to add to treatment, though. permalink parent award report block reply GoldwaterVoter 1 points 1 day ago The \"cure\" comment isn't from the paper -- it's from my personal experience as my mother's caregiver for 3 years. Sundowning went to zero for a year, then started up again and 50% increase in dosage got it back to zero. It mostly is a relief for caregivers, not the patient. I could not have functioned for 3 years with my mother trying to leave home at  dinner time every day. I wrote a letter to Merck documenting my experience. They replied that they were looking for cures, not palliatives. permalink parent award report block reply TPMJB 1 points 1 day ago The \"cure\" comment isn't from the paper -- it's from my personal experience as my mother's caregiver for 3 years. Sundowning went to zero for a year, then started up again and 50% increase in dosage got it back to zero. Alright, sure. I'll give you that. I wrote a letter to Merck documenting my experience. They replied that they were looking for cures, not palliatives. I'm sure they are working on something , but like I said they'll only be able to arrest the damage that has been done. If you're full-on dementia, you'll still be demented but it won't get worse. Only possibility is to arrest it before it gets bad. Which it would be cool if they'd test people early-on before it gets bad, but we don't do that here (we can). Merck is working on everything under the sun. I've been to one of their bigger campuses - it's miles long. permalink parent award report block reply Ralphusthegreatus 6 points 2 days ago 56,000 years!! Harvard has enough money to fund this research for 56,000 years. permalink award report block reply Dev404 6 points 2 days ago No medical research company wants to find the cure to anything, they want to find treatments to keep you sick and paying, forever. Our government is happy to help them with these ambitions with kickbacks, of course. permalink award report block reply Tacitus1963 5 points 2 days ago How many years have millions if not billions been given to researchers to come up with all kinds of cancer cures? I've lost count.\nThere never will be a cure for cancer- at least not for us plebs- because it would make lots of people unemployed who depend on the cancer industry for their livelihoods. permalink award report block reply HyperCarbs 5 points 2 days ago Bullshit. More like she can't get funding. These academics are always assholes. permalink award report block reply Strzok 1 points 1 day ago Second clip in the video: \"For 50 years she has applied for, and won federal grants\" So we've been paying this partisan cunt for 50 years already and she wants to whine and bitch. She's basically a democratic senator. permalink parent award report block reply Talledega 5 points 2 days ago \"...has the potential...\" is codeword for, \"This is what we want it to do, but have no idea how to get it there.\" permalink award report block reply Sivispacem 4 points 2 days ago You can't turn a cure into a subscription plan. permalink award report block reply 2016TrumpMAGA 4 points 2 days ago Some academic whose funding was cut claims their work had the potential to cure cancer? Wow, that never happens.  No way she would lie for money. permalink award report block reply vongregormench 4 points 2 days ago Does anyone believe that they cured cancer and they just need to spend a little bit more to finish? permalink award report block reply bluewhiteandred 4 points 2 days ago they don't have the cure edit: beyond what we already know permalink award report block reply Fecklessgod 4 points 2 days ago So at a million dollars a year Harvard could fund this lady for 50,000 years with their endowments. permalink award report block reply gaijin_ronin 3 points 1 day ago \"Higher education\" is all shit. permalink award report block reply Wrexxis780 3 points 2 days ago Curing disease is nowhere near as profitable as treating it over a lifetime permalink award report block reply MasterChief08 3 points 2 days ago She's probably studying how cancer affects black people more than white people and it's the fault of men. I don't trust any research permalink award report block reply ThePatriotGames2016 3 points 2 days ago oh i'm sure they have a cure for all cancer. I'm also sure she is absolutely a piece of shit trying to get more money while also not releasing a cure for cancer. permalink award report block reply Thebigone123 3 points 2 days ago You can't convince me that millionaires and billionaires already have cures for every known disease. They just won't share with the poors because they get so much money from treatment and not cures permalink award report block reply RocksCanOnlyWait 3 points 2 days ago It's another garbage 60 Minutes piece. She doesn't do anything that useful, but they can spin it to foment outrage about universities no longer being able to suckle the teet of government. Here's the real story: https://x.com/LocasaleLab/status/1987994762893254754 permalink award report block reply Beelzy 2 points 2 days ago SHE LIES!!! permalink award report block reply btntx 2 points 2 days ago Harvard is probably protecting her. If this bitch went public with a verified cure pharma would immediately suicide her. permalink award report block reply benjovikenobi 2 points 1 day ago Harvard hates women. permalink award report block reply Jack_HinsonTN 2 points 2 days ago \"Has the potential\" doesn't equal \"has the cure.\" permalink award report block reply Koikatrose 2 points 1 day ago Ivermectin and fenbendozol or membendazol is a cure.\nWhy waste money on these \"resesrch\" projects?\nBreast cancer is a big money maker. I would never trust a vax of any kind. And mamograms....pfft. Thermal imaging is non toxic and more exact. But radiating breasts is more profitable and causes more cancer. Then there's biopsy s. That only spreads it. So medical industry....go to hell. University research....pffft. Money leeches. .... permalink award report block reply learntocode 2 points 2 days ago they aint got sheeeeeit fuckin liars permalink award report block reply Trump737 2 points 1 day ago Potential means keep sending more money.\nThe whole cancer thing is the medical version of nasa. All a scam to funnel money elsewhere permalink award report block reply MeMargie 2 points 2 days ago Been given millions every year for decades for  cancer research, what are the results biotch? permalink award report block reply utfanx2 2 points 2 days ago If she cures cancer, would every taxpayer get royalties? permalink award report block reply KungPaoMcChicken 2 points 2 days ago \"has the potential\". So, its not a cure for cancer, yet... permalink award report block reply lul_cheto 2 points 2 days ago I make a mean egg salad, I also think it has the potential to cure breast cancer.. I demand 50m to release the recipie. Youre welcome. permalink award report block reply Tacotuesday867 1 points 2 days ago Ahhh so its trump fault.  That math nerd Terrence too got recruited to bitch about trump at ucla as well permalink award report block reply FusionBlack 1 points 1 day ago But the Chinese students pay a great deal of money to them.... permalink award report block reply ColonelKlink 1 points 2 days ago The potential? That means they just want more money and have no idea if it  works. permalink award report block reply TGNX 1 points 2 days ago I mean, if they wanted people to help them fund it, that would be one thing. Like \"our initial estimate is $10M, just match us dollar for dollar and we're good.\" Heck, even that much effort would be something. permalink award report block reply Seeker_17 1 points 2 days ago They will sure own the patents while the tax payers paid for it. permalink award report block reply Whoopies_tds 1 points 2 days ago Nearly word for word what I said last night while this Karen was crying on 60 minutes. No I am not Matt Walsh permalink award report block reply raptormissle 1 points 2 days ago Has the \"potential\". Yeah, so does Fanta. permalink award report block reply AbsurdOpinion 1 points 1 day ago Researcher claims being on the verge of a great discovery Demands tax payer funding Research goes no where Research has a new idea for a great discovery Demands tax payer funding Rinse and repeat -- This is what's known as a career scientist permalink award report block reply Mhmm2MoreWeeks 1 points 2 days ago There is no reason to do anything for the poor because there is no Law and Order placed upon the Rich. That is what the ultra simple poor haters do not understand. The Rich can do whatever they like. Laws are no different for them then Jay Walking would be to you or me. permalink award report block reply keeman 1 points 2 days ago Me banging on a rock has the potential to cure breast cancer.  Not a very good potential, but you cannot prove that it won't work.  So give me some money. permalink award report block reply barwhack 1 points 2 days ago Harvard gives everyone A's. It'll cure cancer, about as fast as a million monky-years of protesting against human life on earth. permalink award report block reply Moose_Antlers 1 points 2 days ago She's wildly overstating what she has. This is the paper she published referring to this breakthrough: https://www.nature.com/articles/s41588-024-01988-0 She's saying that she found a fairly easily detectable pattern in BRCA1+ and BRCA2+ individuals that appears before some of the traditional mutations manifest. This is what's called a biomarker. You can build a test for these things and use the test to screen at-risk patients. The catch is that she's developed no actual test, nor has she done the clinical work to validate her method of screening in real patients. This is really important because we need to know if the test results mean anything. Do they predict that a person is going to develop the disease? If so, how often? If a person tests positive and half the time, nothing happens, it's a terrible test. That has to be studied. She's a long way out from that. She's doing hypothesis generating research and trying to act like she's on the verge of launching a meaningful screening test. Even then, that's not preventing breast cancer. That's early detection of something that's already there in patients where we already know are high risk. It's not nothing, but it's a hell of a lot less than this lady and the propagandist are trying to insinuate. permalink award report block reply Ligersrule1 1 points 2 days ago Another RMNA \"vaccine\"?  No thanks. permalink award report block reply ConfusedAngryArmed 1 points 22 hours ago If anything they will try to sell it to Sanofi or Novartis. permalink award report block reply boomerbutnotOKBoomer 1 points 2 days ago Ivermectin and Fenbenzadol permalink award report block reply yepyep 1 points 1 day ago Wait! Let’s invite a bunch of foreigners and let them steal it. permalink award report block reply PearlyGaits57 1 points 1 day ago Just more proof, gubment cares \"NADDA\" about it's citizenry. Can't make any \"MONEY\" with cures, only research. I have said for 40 years, they already have \"CURES\" for many ailments, but, cures = no more reasearch $$$$\" like everything, money is the ROOT of this \"EVIL\" permalink award report block reply obamagavemeaphone 1 points 2 days ago Breast cancer awareness 🎀 was what October was all about for decades. Then the globohomos pushed a giant scam in 2020 and suddenly there's no longer a need for Breast cancer awareness. permalink award report block reply CaptainTrouble 1 points 2 days ago This is called extortion and is illegal. Lock her up. permalink award report block reply Obambi 1 points 2 days ago Im sure a berg is somehow involved in this permalink award report block reply Chuj 1 points 1 day ago The research in question was likely DEI inspired. permalink award report block reply Michalusmichalus 1 points 1 day ago Harvard is on the list of schools that is both unofficially blacklisted, and officially blacklisted. Last year articles were saying guidance counselors were discouraging even applying because having a degree from that school would make the child unemployable. permalink award report block reply TheColonelsDaughter 1 points 1 day ago She looks way too much like Pocahontas for me to take her seriously. permalink award report block reply Mcrumples 1 points 2 days ago Couldn't she take this to private investors then? Use the market - stop being a leech and demanding taxpayer money. The cure to breast cancer HAS to be an easy sell. What rich capitalist wouldn't want to steal this out from under Harvard and fund it themselves???? permalink award report block reply bratt 1 points 2 days ago Joan Brugge says her work has the potential to prevent breast cancer Anthony Fauci said covid vaccines would provide immunity and is safe and effective. permalink award report block reply Dem_slayer 1 points 2 days ago \"Potential\" does not equal having. They're full of shit. permalink award report block reply RememberCharlieKirk 1 points 2 days ago \"potential\" More realistically, Joan Brugge's work would not lead to a greatly capable and widely applicable preventive care against breast cancer. Most likely outcome: Slight improvement, with a small number of actually suitable candidates permalink award report block reply JohnN 1 points 2 days ago This guy says she cites him more than she cites anyone else... and she's full of shit (paraphrasing). https://x.com/LocasaleLab/status/1987994762893254754 permalink award report block reply LirukDatan 1 points 2 days ago There are many different approaches to fight breast cancer. This particular type of cancer is well studied, so many different companies developed ways to tackle it. Whatever they had developed at Harvard must not be economically viable if they're just sitting on it. Also, fuck 'em just because. permalink award report block reply mikethemarine 1 points 2 days ago her work has the potential to prevent breast cancer What this really means is give us your gibbs, cause we MIGHT someday find something anything, but probably not permalink award report block reply DenturesNancy 1 points 1 day ago let me guess: she uses mRNA, that's the new recipe for treating all diseases.  I am sure she is a graduate of Fauci and Birx skool of Madacine permalink award report block reply Liberats 1 points 1 day ago She started work on cancer in the 60's and has been at Harvard since 1997.\nCancer research is a never ending money burner and researchers are the matches. https://www.aacr.org/professionals/membership/aacr-academy/fellows/joan-s-brugge-phd/ permalink award report block reply America1stAndOnly 0 points 1 day ago But if breast cancer was cured, how would women complain about being victims? They'd have to find a whole new way and work even harder to ignore the cancers that effect men. permalink award report block reply\nProf_Smith 126 points 2 days ago Fuck that even…. How about the pharma companies who have shit loads of money to fund this research but they won’t. So, the system is designed for you to pay with your tax dollars liberal researchers to come up with something that they sell to a pharma company that makes it and sells it back to you for 10000% markup. permalink award report block reply XxxRDTPRNxxX 74 points 2 days ago Worse, what about the ones that have cures to diseases already discovered but don't bring them to market because it's more profitable sell a treatment? You know they're there. Is there any law requiring them to bring shit like that to market? There are definitely laws saying they have to act in the best interest of shareholders and if they don't the CEO can be personally liable for losses. permalink parent award report block reply Cuetardian 33 points 2 days ago and their argument would be that \"selling the treatment over and over and over makes tons of money and THAT is in the best interest of the shareholders.\" Monsters. permalink parent award report block reply ModernKnight 18 points 2 days ago The real cure for breast cancer is actually having kids before 25.  Breast cancer used to be called \"Nun's disease,\" because almost all the people who got it were nuns.  I think the age when women become more at risk for breast cancer is somewhere around 23, with each further year a woman goes without giving birth doubling her chance of breast cancer.  It has to do with how womens' bodies develop, with the breasts only fully developing when she has a kid and breast feeds that kid finishing development, and not doing so causing problems. permalink parent award report block reply America1stAndOnly 5 points 1 day ago But if they do that they won't be able to get abortions and perform their child sacrifices to moloch. permalink parent award report block reply view 1 more comments... Mestroisfils 3 points 1 day ago Yes.  Having kids early,  nursing them and avoiding birth control pills are the way. permalink parent award report block reply I_have_lady_parts-2 3 points 2 days ago Holy shit... maybe this. Girl in my grad class just died from it. 38 or 39... married but no kids. Looked like a model all her life. But also seems like she followed the hard and fast mustard treatment so... who knows. permalink parent award report block reply XxxRDTPRNxxX 4 points 2 days ago They're not wrong either. permalink parent award report block reply 0111000001100101 14 points 2 days ago Best interest of shareholders taking precedence is one of the worst things that happened to america since ww2.  I noticed.  Along with switching fries from tallow to seed oils, I noticed that also. permalink parent award report block reply Squentin 4 points 1 day ago It's basic capitalism.  Capitalism has cured more diseases than any other system could.  That said, tge government needs to play a major role in situations where cures are not inherently profitable. permalink parent award report block reply 0111000001100101 1 points 1 day ago Right that's exactly the problem. America had its golden age from  FREE MARKET not CAPITALISM.  The distinctions are and undertone to those not paying with attention and the implications are massive. permalink parent award report block reply WildStar 1 points 1 day ago Yes, and it's one problem we can't blame on the left. This was pure boomer conservatism. permalink parent award report block reply Squentin 2 points 1 day ago The Rand Paul strain of pure libertarianism ad opposed to more pragmatic approaches that recognize that the simplicity of that model has some nasty side affects permalink parent award report block reply view 1 more comments... Squentin 1 points 1 day ago This is the component where government needs to play a role.  Not all cures are going be inherently profitable for the drug companies. permalink parent award report block reply XxxRDTPRNxxX 3 points 1 day ago I've said before a possible solution is to put bounties on diseases. First company to produce a working cure for cancer gets 1 trillion from the government, but they can't patent it and it immediately enters public domain. permalink parent award report block reply Squentin 2 points 1 day ago Makes sense.   It would save the taxpayers money in the long run. permalink parent award report block reply 0111000001100101 1 points 1 day ago Interesting idea permalink parent award report block reply VirPopulus 1 points 2 days ago Sounds very Jewish. permalink parent award report block reply TPMJB 0 points 1 day ago Worse, what about the ones that have cures to diseases already discovered but don't bring them to market because it's more profitable sell a treatment? I wish people would stop parroting this absolutely neanderthal statement. You know how much those cures cost? Absolutely astronomical amounts of money. Not to pharma, to you. And you end up paying it. Why? Because you have no other options. You know what's cheaper? Chemo, radiation, and removal. You know what insurance covers first ? You guessed it! Some of you will be cured, many will die = less money insurance has to dish out. Pharma absolutely profits on cures and absolutely makes them. A lot of the mabs out there will cure, and will also cost you $10k/month without insurance minimum . It's like playing whack-a-mole with all the diseases out there.  They could cure a thousand different cancers and there'd still be tens of thousands more. Absolutely bonehead, 90s comedian take. permalink parent award report block reply XxxRDTPRNxxX 2 points 1 day ago Pharma absolutely profits on cures and absolutely makes them. A lot of the mabs out there will cure, and will also cost you $10k/month without insurance minimum. What a completely asinine misrepresentation of what I said. Where did I say that they never cure any diseases? Where did I say that? I didn't. I said there are some diseases they won't cure due to making more money on treatments. Are you gonna refute that? No, you aren't. and will also cost you $10k/month without insurance minimum. Show me the $10k per month cure for cancer or diabetes, fucking retard. permalink parent award report block reply TPMJB 1 points 1 day ago You just said \"they don't bring cures to the market\". What the fuck else could you mean? They make a shitload more on cures than they ever did on treatment, and they make that money up front instead of over time, which means instant gratification for shareholders. MuH cUrE fOr CaNcEr!111 It's retards like you that think all cancer is the same. We've had a cure for ALL for decades . Breast cancer is as simple as lopping off the tits the vast majority of the time. Keytruda treats and often cures many different types of cancer . Keytruda is so old that it's coming off patent! People that struggled through high school and have problems with concepts like \"every different cancer has a different cause and different treatment options\" are the worst. It's like explaining Checkers to someone who can't stop eating glue. permalink parent award report block reply view 16 more comments... Isolated_Patriot 2 points 1 day ago cost you $10k/month So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. permalink parent award report block reply TPMJB 1 points 1 day ago So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. By definition, there is no \"cure\". Unless you're getting down to the microscopic level and analyzing every cell, you will never be able to determine if the problem is completely gone. No more cancerous cells? What if a gene disorder caused it in the first place? So people will be in \"remission\" for 10, 20, 30 years. Could it still come back? Sure. Is it going to? Likelihood drops with every year. At this point it's a war on language. Pragmatically, many are \"cured\" and will never experience cancer again. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. Probably because of the astronomical amounts of money that goes into it. You're not just mixing chemicals in a vat, you're genetically modifying a cell to produce antibodies.  You can't even make generics of existing monoclonal antibodies - you can only make \"similar\" (biosimilar) drugs as it's impossible to make an exact copy. Our glove budget is more than my salary. I could go on and on, but I imagine you've stopped reading by now. permalink parent award report block reply Sgt_Hulka 18 points 2 days ago Yep. Tired of taking it up the ass yet? permalink parent award report block reply Here_we_go 22 points 2 days ago Wtf does Obama have to do with this? Kek permalink parent award report block reply bh506407 5 points 2 days ago Nothing, because that guy NEVER tires of taking big Mike’s swinging cock up his ass! permalink parent award report block reply Prof_Smith 10 points 2 days ago Oh, I don’t play the game.  I don’t do doctors or meds and gladly limit my exposure to society as a whole. Only way to win is not to play. permalink parent award report block reply Deplora 10 points 2 days ago They'll fund research that is reasonably likely to result in a patentable treatment, and they have already done a lot of that for breast cancer, very effectively.  They won't fund researchers' hopes and dreams -- neither pharma companies nor the government should do that. permalink parent award report block reply UCantStumpTheTrump 13 points 2 days ago Bingo, I'm a chemist working in the cancer space (startup) and we are 100% funded by VCs and private investors. permalink parent award report block reply BloodElfSupporter 8 points 2 days ago Are u in Boston? I’m also a chemist that recently joined a start up as well. Not in cancer tho more like biologics and gene therapy. Also funded by VCs but also have a partner program with one of the pharma giants in the states (not Pfizer) permalink parent award report block reply UCantStumpTheTrump 7 points 2 days ago I’m in SF. And we are doing a form of gene therapy (in the sense that we make a nanoparticle that targets a specific cancer-related messenger RNA known to be overexpressed in the tumor cells). If the target is bound, release of a cytotoxic payload is triggered. If there is no target, the payload remains inert and the particles are excreted unchanged. My PhD work mainly focused on the design and synthesis of novel biocompatible nanomaterials for transfection-free intracellular gene knockdown. permalink parent award report block reply view 15 more comments... UCantStumpTheTrump 2 points 2 days ago You at HelixNano by any chance? permalink parent award report block reply view 2 more comments... PatriotSam 3 points 2 days ago Watch the video she does not say that she has the cure to breast cancer in it. A woman also is not capable of synthesizing enough brain power to come anywhere near finding a medical miracle of this magnitude. The cure for cancer, if it's even possible, which I don't think it's possible, will be found by a man. permalink parent award report block reply KungPaoMcChicken 7 points 2 days ago Dude, we can't even reconnect nerves after they are severed. How the fuck are we going to cure cancer? It's not possible. Cancer is mother nature's cure for human lifespan's going well beyond 100 years. What possible help is a cure? We will end up sustaining nursing home populations for 50 to 60 years if we cure cancer. permalink parent award report block reply PatriotSam 5 points 2 days ago Yes, cancer is simply your cells not dividing properly anymore. It's just like how you copy a photo over and over and it warps, no way to stop that. permalink parent award report block reply TGNX 2 points 2 days ago There are biologically immortal animals out there that never develop cancer. So it's possible, but we just don't know how. Not that I trust pharma fucks to do anything but hide it. permalink parent award report block reply KungPaoMcChicken 0 points 2 days ago To me, wasting money on research like this is a bottomless pit. We should invent cloning and memory transfer. Hey, I have cancer, but here is a fresh body, now transfer over my memory to the new body. Obviously only the rich or super important should have access to this. But, any day I could find cancer in my ass, and it's just a roll of the dice. Long life is pointless. We used to live to 30 or 40 and we were more productive as a human race. Families made like 12 children and they worked in coal mines and shit. School went to 12 years if you were lucky. We have it far too good today and none of us deserve it. A man who has everything is weak as fuck. The struggle makes us real. I imagine those teams of 4 to 5 Russians creeping through towns with those gigantic backpacks and hiding are the kings of this world. They deserve lots of pussy when the war is done. permalink parent award report block reply view 7 more comments... localhost 1 points 2 days ago Or by AI, which is made by men. permalink parent award report block reply tpactionchasethevote 1 points 2 days ago How much would it be to prevent cancer? End all the chemicals in our food and water? permalink parent award report block reply bratt 2 points 2 days ago In other words 'kill everyone'. permalink parent award report block reply FKH2 1 points 1 day ago Yep permalink parent award report block reply load 7 more comments...\nXxxRDTPRNxxX 74 points 2 days ago Worse, what about the ones that have cures to diseases already discovered but don't bring them to market because it's more profitable sell a treatment? You know they're there. Is there any law requiring them to bring shit like that to market? There are definitely laws saying they have to act in the best interest of shareholders and if they don't the CEO can be personally liable for losses. permalink parent award report block reply Cuetardian 33 points 2 days ago and their argument would be that \"selling the treatment over and over and over makes tons of money and THAT is in the best interest of the shareholders.\" Monsters. permalink parent award report block reply ModernKnight 18 points 2 days ago The real cure for breast cancer is actually having kids before 25.  Breast cancer used to be called \"Nun's disease,\" because almost all the people who got it were nuns.  I think the age when women become more at risk for breast cancer is somewhere around 23, with each further year a woman goes without giving birth doubling her chance of breast cancer.  It has to do with how womens' bodies develop, with the breasts only fully developing when she has a kid and breast feeds that kid finishing development, and not doing so causing problems. permalink parent award report block reply America1stAndOnly 5 points 1 day ago But if they do that they won't be able to get abortions and perform their child sacrifices to moloch. permalink parent award report block reply view 1 more comments... Mestroisfils 3 points 1 day ago Yes.  Having kids early,  nursing them and avoiding birth control pills are the way. permalink parent award report block reply I_have_lady_parts-2 3 points 2 days ago Holy shit... maybe this. Girl in my grad class just died from it. 38 or 39... married but no kids. Looked like a model all her life. But also seems like she followed the hard and fast mustard treatment so... who knows. permalink parent award report block reply XxxRDTPRNxxX 4 points 2 days ago They're not wrong either. permalink parent award report block reply 0111000001100101 14 points 2 days ago Best interest of shareholders taking precedence is one of the worst things that happened to america since ww2.  I noticed.  Along with switching fries from tallow to seed oils, I noticed that also. permalink parent award report block reply Squentin 4 points 1 day ago It's basic capitalism.  Capitalism has cured more diseases than any other system could.  That said, tge government needs to play a major role in situations where cures are not inherently profitable. permalink parent award report block reply 0111000001100101 1 points 1 day ago Right that's exactly the problem. America had its golden age from  FREE MARKET not CAPITALISM.  The distinctions are and undertone to those not paying with attention and the implications are massive. permalink parent award report block reply WildStar 1 points 1 day ago Yes, and it's one problem we can't blame on the left. This was pure boomer conservatism. permalink parent award report block reply Squentin 2 points 1 day ago The Rand Paul strain of pure libertarianism ad opposed to more pragmatic approaches that recognize that the simplicity of that model has some nasty side affects permalink parent award report block reply view 1 more comments... Squentin 1 points 1 day ago This is the component where government needs to play a role.  Not all cures are going be inherently profitable for the drug companies. permalink parent award report block reply XxxRDTPRNxxX 3 points 1 day ago I've said before a possible solution is to put bounties on diseases. First company to produce a working cure for cancer gets 1 trillion from the government, but they can't patent it and it immediately enters public domain. permalink parent award report block reply Squentin 2 points 1 day ago Makes sense.   It would save the taxpayers money in the long run. permalink parent award report block reply 0111000001100101 1 points 1 day ago Interesting idea permalink parent award report block reply VirPopulus 1 points 2 days ago Sounds very Jewish. permalink parent award report block reply TPMJB 0 points 1 day ago Worse, what about the ones that have cures to diseases already discovered but don't bring them to market because it's more profitable sell a treatment? I wish people would stop parroting this absolutely neanderthal statement. You know how much those cures cost? Absolutely astronomical amounts of money. Not to pharma, to you. And you end up paying it. Why? Because you have no other options. You know what's cheaper? Chemo, radiation, and removal. You know what insurance covers first ? You guessed it! Some of you will be cured, many will die = less money insurance has to dish out. Pharma absolutely profits on cures and absolutely makes them. A lot of the mabs out there will cure, and will also cost you $10k/month without insurance minimum . It's like playing whack-a-mole with all the diseases out there.  They could cure a thousand different cancers and there'd still be tens of thousands more. Absolutely bonehead, 90s comedian take. permalink parent award report block reply XxxRDTPRNxxX 2 points 1 day ago Pharma absolutely profits on cures and absolutely makes them. A lot of the mabs out there will cure, and will also cost you $10k/month without insurance minimum. What a completely asinine misrepresentation of what I said. Where did I say that they never cure any diseases? Where did I say that? I didn't. I said there are some diseases they won't cure due to making more money on treatments. Are you gonna refute that? No, you aren't. and will also cost you $10k/month without insurance minimum. Show me the $10k per month cure for cancer or diabetes, fucking retard. permalink parent award report block reply TPMJB 1 points 1 day ago You just said \"they don't bring cures to the market\". What the fuck else could you mean? They make a shitload more on cures than they ever did on treatment, and they make that money up front instead of over time, which means instant gratification for shareholders. MuH cUrE fOr CaNcEr!111 It's retards like you that think all cancer is the same. We've had a cure for ALL for decades . Breast cancer is as simple as lopping off the tits the vast majority of the time. Keytruda treats and often cures many different types of cancer . Keytruda is so old that it's coming off patent! People that struggled through high school and have problems with concepts like \"every different cancer has a different cause and different treatment options\" are the worst. It's like explaining Checkers to someone who can't stop eating glue. permalink parent award report block reply view 16 more comments... Isolated_Patriot 2 points 1 day ago cost you $10k/month So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. permalink parent award report block reply TPMJB 1 points 1 day ago So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. By definition, there is no \"cure\". Unless you're getting down to the microscopic level and analyzing every cell, you will never be able to determine if the problem is completely gone. No more cancerous cells? What if a gene disorder caused it in the first place? So people will be in \"remission\" for 10, 20, 30 years. Could it still come back? Sure. Is it going to? Likelihood drops with every year. At this point it's a war on language. Pragmatically, many are \"cured\" and will never experience cancer again. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. Probably because of the astronomical amounts of money that goes into it. You're not just mixing chemicals in a vat, you're genetically modifying a cell to produce antibodies.  You can't even make generics of existing monoclonal antibodies - you can only make \"similar\" (biosimilar) drugs as it's impossible to make an exact copy. Our glove budget is more than my salary. I could go on and on, but I imagine you've stopped reading by now. permalink parent award report block reply\nCuetardian 33 points 2 days ago and their argument would be that \"selling the treatment over and over and over makes tons of money and THAT is in the best interest of the shareholders.\" Monsters. permalink parent award report block reply ModernKnight 18 points 2 days ago The real cure for breast cancer is actually having kids before 25.  Breast cancer used to be called \"Nun's disease,\" because almost all the people who got it were nuns.  I think the age when women become more at risk for breast cancer is somewhere around 23, with each further year a woman goes without giving birth doubling her chance of breast cancer.  It has to do with how womens' bodies develop, with the breasts only fully developing when she has a kid and breast feeds that kid finishing development, and not doing so causing problems. permalink parent award report block reply America1stAndOnly 5 points 1 day ago But if they do that they won't be able to get abortions and perform their child sacrifices to moloch. permalink parent award report block reply view 1 more comments... Mestroisfils 3 points 1 day ago Yes.  Having kids early,  nursing them and avoiding birth control pills are the way. permalink parent award report block reply I_have_lady_parts-2 3 points 2 days ago Holy shit... maybe this. Girl in my grad class just died from it. 38 or 39... married but no kids. Looked like a model all her life. But also seems like she followed the hard and fast mustard treatment so... who knows. permalink parent award report block reply XxxRDTPRNxxX 4 points 2 days ago They're not wrong either. permalink parent award report block reply\nModernKnight 18 points 2 days ago The real cure for breast cancer is actually having kids before 25.  Breast cancer used to be called \"Nun's disease,\" because almost all the people who got it were nuns.  I think the age when women become more at risk for breast cancer is somewhere around 23, with each further year a woman goes without giving birth doubling her chance of breast cancer.  It has to do with how womens' bodies develop, with the breasts only fully developing when she has a kid and breast feeds that kid finishing development, and not doing so causing problems. permalink parent award report block reply America1stAndOnly 5 points 1 day ago But if they do that they won't be able to get abortions and perform their child sacrifices to moloch. permalink parent award report block reply view 1 more comments... Mestroisfils 3 points 1 day ago Yes.  Having kids early,  nursing them and avoiding birth control pills are the way. permalink parent award report block reply I_have_lady_parts-2 3 points 2 days ago Holy shit... maybe this. Girl in my grad class just died from it. 38 or 39... married but no kids. Looked like a model all her life. But also seems like she followed the hard and fast mustard treatment so... who knows. permalink parent award report block reply\nAmerica1stAndOnly 5 points 1 day ago But if they do that they won't be able to get abortions and perform their child sacrifices to moloch. permalink parent award report block reply view 1 more comments...\nMestroisfils 3 points 1 day ago Yes.  Having kids early,  nursing them and avoiding birth control pills are the way. permalink parent award report block reply\nI_have_lady_parts-2 3 points 2 days ago Holy shit... maybe this. Girl in my grad class just died from it. 38 or 39... married but no kids. Looked like a model all her life. But also seems like she followed the hard and fast mustard treatment so... who knows. permalink parent award report block reply\nXxxRDTPRNxxX 4 points 2 days ago They're not wrong either. permalink parent award report block reply\n0111000001100101 14 points 2 days ago Best interest of shareholders taking precedence is one of the worst things that happened to america since ww2.  I noticed.  Along with switching fries from tallow to seed oils, I noticed that also. permalink parent award report block reply Squentin 4 points 1 day ago It's basic capitalism.  Capitalism has cured more diseases than any other system could.  That said, tge government needs to play a major role in situations where cures are not inherently profitable. permalink parent award report block reply 0111000001100101 1 points 1 day ago Right that's exactly the problem. America had its golden age from  FREE MARKET not CAPITALISM.  The distinctions are and undertone to those not paying with attention and the implications are massive. permalink parent award report block reply WildStar 1 points 1 day ago Yes, and it's one problem we can't blame on the left. This was pure boomer conservatism. permalink parent award report block reply Squentin 2 points 1 day ago The Rand Paul strain of pure libertarianism ad opposed to more pragmatic approaches that recognize that the simplicity of that model has some nasty side affects permalink parent award report block reply view 1 more comments...\nSquentin 4 points 1 day ago It's basic capitalism.  Capitalism has cured more diseases than any other system could.  That said, tge government needs to play a major role in situations where cures are not inherently profitable. permalink parent award report block reply 0111000001100101 1 points 1 day ago Right that's exactly the problem. America had its golden age from  FREE MARKET not CAPITALISM.  The distinctions are and undertone to those not paying with attention and the implications are massive. permalink parent award report block reply\n0111000001100101 1 points 1 day ago Right that's exactly the problem. America had its golden age from  FREE MARKET not CAPITALISM.  The distinctions are and undertone to those not paying with attention and the implications are massive. permalink parent award report block reply\nWildStar 1 points 1 day ago Yes, and it's one problem we can't blame on the left. This was pure boomer conservatism. permalink parent award report block reply Squentin 2 points 1 day ago The Rand Paul strain of pure libertarianism ad opposed to more pragmatic approaches that recognize that the simplicity of that model has some nasty side affects permalink parent award report block reply view 1 more comments...\nSquentin 2 points 1 day ago The Rand Paul strain of pure libertarianism ad opposed to more pragmatic approaches that recognize that the simplicity of that model has some nasty side affects permalink parent award report block reply view 1 more comments...\nSquentin 1 points 1 day ago This is the component where government needs to play a role.  Not all cures are going be inherently profitable for the drug companies. permalink parent award report block reply XxxRDTPRNxxX 3 points 1 day ago I've said before a possible solution is to put bounties on diseases. First company to produce a working cure for cancer gets 1 trillion from the government, but they can't patent it and it immediately enters public domain. permalink parent award report block reply Squentin 2 points 1 day ago Makes sense.   It would save the taxpayers money in the long run. permalink parent award report block reply 0111000001100101 1 points 1 day ago Interesting idea permalink parent award report block reply\nXxxRDTPRNxxX 3 points 1 day ago I've said before a possible solution is to put bounties on diseases. First company to produce a working cure for cancer gets 1 trillion from the government, but they can't patent it and it immediately enters public domain. permalink parent award report block reply Squentin 2 points 1 day ago Makes sense.   It would save the taxpayers money in the long run. permalink parent award report block reply 0111000001100101 1 points 1 day ago Interesting idea permalink parent award report block reply\nSquentin 2 points 1 day ago Makes sense.   It would save the taxpayers money in the long run. permalink parent award report block reply\n0111000001100101 1 points 1 day ago Interesting idea permalink parent award report block reply\nVirPopulus 1 points 2 days ago Sounds very Jewish. permalink parent award report block reply\nTPMJB 0 points 1 day ago Worse, what about the ones that have cures to diseases already discovered but don't bring them to market because it's more profitable sell a treatment? I wish people would stop parroting this absolutely neanderthal statement. You know how much those cures cost? Absolutely astronomical amounts of money. Not to pharma, to you. And you end up paying it. Why? Because you have no other options. You know what's cheaper? Chemo, radiation, and removal. You know what insurance covers first ? You guessed it! Some of you will be cured, many will die = less money insurance has to dish out. Pharma absolutely profits on cures and absolutely makes them. A lot of the mabs out there will cure, and will also cost you $10k/month without insurance minimum . It's like playing whack-a-mole with all the diseases out there.  They could cure a thousand different cancers and there'd still be tens of thousands more. Absolutely bonehead, 90s comedian take. permalink parent award report block reply XxxRDTPRNxxX 2 points 1 day ago Pharma absolutely profits on cures and absolutely makes them. A lot of the mabs out there will cure, and will also cost you $10k/month without insurance minimum. What a completely asinine misrepresentation of what I said. Where did I say that they never cure any diseases? Where did I say that? I didn't. I said there are some diseases they won't cure due to making more money on treatments. Are you gonna refute that? No, you aren't. and will also cost you $10k/month without insurance minimum. Show me the $10k per month cure for cancer or diabetes, fucking retard. permalink parent award report block reply TPMJB 1 points 1 day ago You just said \"they don't bring cures to the market\". What the fuck else could you mean? They make a shitload more on cures than they ever did on treatment, and they make that money up front instead of over time, which means instant gratification for shareholders. MuH cUrE fOr CaNcEr!111 It's retards like you that think all cancer is the same. We've had a cure for ALL for decades . Breast cancer is as simple as lopping off the tits the vast majority of the time. Keytruda treats and often cures many different types of cancer . Keytruda is so old that it's coming off patent! People that struggled through high school and have problems with concepts like \"every different cancer has a different cause and different treatment options\" are the worst. It's like explaining Checkers to someone who can't stop eating glue. permalink parent award report block reply view 16 more comments... Isolated_Patriot 2 points 1 day ago cost you $10k/month So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. permalink parent award report block reply TPMJB 1 points 1 day ago So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. By definition, there is no \"cure\". Unless you're getting down to the microscopic level and analyzing every cell, you will never be able to determine if the problem is completely gone. No more cancerous cells? What if a gene disorder caused it in the first place? So people will be in \"remission\" for 10, 20, 30 years. Could it still come back? Sure. Is it going to? Likelihood drops with every year. At this point it's a war on language. Pragmatically, many are \"cured\" and will never experience cancer again. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. Probably because of the astronomical amounts of money that goes into it. You're not just mixing chemicals in a vat, you're genetically modifying a cell to produce antibodies.  You can't even make generics of existing monoclonal antibodies - you can only make \"similar\" (biosimilar) drugs as it's impossible to make an exact copy. Our glove budget is more than my salary. I could go on and on, but I imagine you've stopped reading by now. permalink parent award report block reply\nXxxRDTPRNxxX 2 points 1 day ago Pharma absolutely profits on cures and absolutely makes them. A lot of the mabs out there will cure, and will also cost you $10k/month without insurance minimum. What a completely asinine misrepresentation of what I said. Where did I say that they never cure any diseases? Where did I say that? I didn't. I said there are some diseases they won't cure due to making more money on treatments. Are you gonna refute that? No, you aren't. and will also cost you $10k/month without insurance minimum. Show me the $10k per month cure for cancer or diabetes, fucking retard. permalink parent award report block reply TPMJB 1 points 1 day ago You just said \"they don't bring cures to the market\". What the fuck else could you mean? They make a shitload more on cures than they ever did on treatment, and they make that money up front instead of over time, which means instant gratification for shareholders. MuH cUrE fOr CaNcEr!111 It's retards like you that think all cancer is the same. We've had a cure for ALL for decades . Breast cancer is as simple as lopping off the tits the vast majority of the time. Keytruda treats and often cures many different types of cancer . Keytruda is so old that it's coming off patent! People that struggled through high school and have problems with concepts like \"every different cancer has a different cause and different treatment options\" are the worst. It's like explaining Checkers to someone who can't stop eating glue. permalink parent award report block reply view 16 more comments...\nTPMJB 1 points 1 day ago You just said \"they don't bring cures to the market\". What the fuck else could you mean? They make a shitload more on cures than they ever did on treatment, and they make that money up front instead of over time, which means instant gratification for shareholders. MuH cUrE fOr CaNcEr!111 It's retards like you that think all cancer is the same. We've had a cure for ALL for decades . Breast cancer is as simple as lopping off the tits the vast majority of the time. Keytruda treats and often cures many different types of cancer . Keytruda is so old that it's coming off patent! People that struggled through high school and have problems with concepts like \"every different cancer has a different cause and different treatment options\" are the worst. It's like explaining Checkers to someone who can't stop eating glue. permalink parent award report block reply view 16 more comments...\nIsolated_Patriot 2 points 1 day ago cost you $10k/month So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. permalink parent award report block reply TPMJB 1 points 1 day ago So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. By definition, there is no \"cure\". Unless you're getting down to the microscopic level and analyzing every cell, you will never be able to determine if the problem is completely gone. No more cancerous cells? What if a gene disorder caused it in the first place? So people will be in \"remission\" for 10, 20, 30 years. Could it still come back? Sure. Is it going to? Likelihood drops with every year. At this point it's a war on language. Pragmatically, many are \"cured\" and will never experience cancer again. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. Probably because of the astronomical amounts of money that goes into it. You're not just mixing chemicals in a vat, you're genetically modifying a cell to produce antibodies.  You can't even make generics of existing monoclonal antibodies - you can only make \"similar\" (biosimilar) drugs as it's impossible to make an exact copy. Our glove budget is more than my salary. I could go on and on, but I imagine you've stopped reading by now. permalink parent award report block reply\nTPMJB 1 points 1 day ago So, not a cure then? That would be a treatment, of the kind that makes them rich, but doesn't actually cure you. Exactly the kind of thing people are talking about. By definition, there is no \"cure\". Unless you're getting down to the microscopic level and analyzing every cell, you will never be able to determine if the problem is completely gone. No more cancerous cells? What if a gene disorder caused it in the first place? So people will be in \"remission\" for 10, 20, 30 years. Could it still come back? Sure. Is it going to? Likelihood drops with every year. At this point it's a war on language. Pragmatically, many are \"cured\" and will never experience cancer again. Why release a $10 cure, when they can charge $10k a month for a 'treatment' that merely slows your death down a bit? That's the profit motive people are talking about. Probably because of the astronomical amounts of money that goes into it. You're not just mixing chemicals in a vat, you're genetically modifying a cell to produce antibodies.  You can't even make generics of existing monoclonal antibodies - you can only make \"similar\" (biosimilar) drugs as it's impossible to make an exact copy. Our glove budget is more than my salary. I could go on and on, but I imagine you've stopped reading by now. permalink parent award report block reply\nSgt_Hulka 18 points 2 days ago Yep. Tired of taking it up the ass yet? permalink parent award report block reply Here_we_go 22 points 2 days ago Wtf does Obama have to do with this? Kek permalink parent award report block reply bh506407 5 points 2 days ago Nothing, because that guy NEVER tires of taking big Mike’s swinging cock up his ass! permalink parent award report block reply Prof_Smith 10 points 2 days ago Oh, I don’t play the game.  I don’t do doctors or meds and gladly limit my exposure to society as a whole. Only way to win is not to play. permalink parent award report block reply\nHere_we_go 22 points 2 days ago Wtf does Obama have to do with this? Kek permalink parent award report block reply bh506407 5 points 2 days ago Nothing, because that guy NEVER tires of taking big Mike’s swinging cock up his ass! permalink parent award report block reply\nbh506407 5 points 2 days ago Nothing, because that guy NEVER tires of taking big Mike’s swinging cock up his ass! permalink parent award report block reply\nProf_Smith 10 points 2 days ago Oh, I don’t play the game.  I don’t do doctors or meds and gladly limit my exposure to society as a whole. Only way to win is not to play. permalink parent award report block reply\nDeplora 10 points 2 days ago They'll fund research that is reasonably likely to result in a patentable treatment, and they have already done a lot of that for breast cancer, very effectively.  They won't fund researchers' hopes and dreams -- neither pharma companies nor the government should do that. permalink parent award report block reply UCantStumpTheTrump 13 points 2 days ago Bingo, I'm a chemist working in the cancer space (startup) and we are 100% funded by VCs and private investors. permalink parent award report block reply BloodElfSupporter 8 points 2 days ago Are u in Boston? I’m also a chemist that recently joined a start up as well. Not in cancer tho more like biologics and gene therapy. Also funded by VCs but also have a partner program with one of the pharma giants in the states (not Pfizer) permalink parent award report block reply UCantStumpTheTrump 7 points 2 days ago I’m in SF. And we are doing a form of gene therapy (in the sense that we make a nanoparticle that targets a specific cancer-related messenger RNA known to be overexpressed in the tumor cells). If the target is bound, release of a cytotoxic payload is triggered. If there is no target, the payload remains inert and the particles are excreted unchanged. My PhD work mainly focused on the design and synthesis of novel biocompatible nanomaterials for transfection-free intracellular gene knockdown. permalink parent award report block reply view 15 more comments... UCantStumpTheTrump 2 points 2 days ago You at HelixNano by any chance? permalink parent award report block reply view 2 more comments...\nUCantStumpTheTrump 13 points 2 days ago Bingo, I'm a chemist working in the cancer space (startup) and we are 100% funded by VCs and private investors. permalink parent award report block reply BloodElfSupporter 8 points 2 days ago Are u in Boston? I’m also a chemist that recently joined a start up as well. Not in cancer tho more like biologics and gene therapy. Also funded by VCs but also have a partner program with one of the pharma giants in the states (not Pfizer) permalink parent award report block reply UCantStumpTheTrump 7 points 2 days ago I’m in SF. And we are doing a form of gene therapy (in the sense that we make a nanoparticle that targets a specific cancer-related messenger RNA known to be overexpressed in the tumor cells). If the target is bound, release of a cytotoxic payload is triggered. If there is no target, the payload remains inert and the particles are excreted unchanged. My PhD work mainly focused on the design and synthesis of novel biocompatible nanomaterials for transfection-free intracellular gene knockdown. permalink parent award report block reply view 15 more comments... UCantStumpTheTrump 2 points 2 days ago You at HelixNano by any chance? permalink parent award report block reply view 2 more comments...\nBloodElfSupporter 8 points 2 days ago Are u in Boston? I’m also a chemist that recently joined a start up as well. Not in cancer tho more like biologics and gene therapy. Also funded by VCs but also have a partner program with one of the pharma giants in the states (not Pfizer) permalink parent award report block reply UCantStumpTheTrump 7 points 2 days ago I’m in SF. And we are doing a form of gene therapy (in the sense that we make a nanoparticle that targets a specific cancer-related messenger RNA known to be overexpressed in the tumor cells). If the target is bound, release of a cytotoxic payload is triggered. If there is no target, the payload remains inert and the particles are excreted unchanged. My PhD work mainly focused on the design and synthesis of novel biocompatible nanomaterials for transfection-free intracellular gene knockdown. permalink parent award report block reply view 15 more comments... UCantStumpTheTrump 2 points 2 days ago You at HelixNano by any chance? permalink parent award report block reply view 2 more comments...\nUCantStumpTheTrump 7 points 2 days ago I’m in SF. And we are doing a form of gene therapy (in the sense that we make a nanoparticle that targets a specific cancer-related messenger RNA known to be overexpressed in the tumor cells). If the target is bound, release of a cytotoxic payload is triggered. If there is no target, the payload remains inert and the particles are excreted unchanged. My PhD work mainly focused on the design and synthesis of novel biocompatible nanomaterials for transfection-free intracellular gene knockdown. permalink parent award report block reply view 15 more comments...\nUCantStumpTheTrump 2 points 2 days ago You at HelixNano by any chance? permalink parent award report block reply view 2 more comments...\nPatriotSam 3 points 2 days ago Watch the video she does not say that she has the cure to breast cancer in it. A woman also is not capable of synthesizing enough brain power to come anywhere near finding a medical miracle of this magnitude. The cure for cancer, if it's even possible, which I don't think it's possible, will be found by a man. permalink parent award report block reply KungPaoMcChicken 7 points 2 days ago Dude, we can't even reconnect nerves after they are severed. How the fuck are we going to cure cancer? It's not possible. Cancer is mother nature's cure for human lifespan's going well beyond 100 years. What possible help is a cure? We will end up sustaining nursing home populations for 50 to 60 years if we cure cancer. permalink parent award report block reply PatriotSam 5 points 2 days ago Yes, cancer is simply your cells not dividing properly anymore. It's just like how you copy a photo over and over and it warps, no way to stop that. permalink parent award report block reply TGNX 2 points 2 days ago There are biologically immortal animals out there that never develop cancer. So it's possible, but we just don't know how. Not that I trust pharma fucks to do anything but hide it. permalink parent award report block reply KungPaoMcChicken 0 points 2 days ago To me, wasting money on research like this is a bottomless pit. We should invent cloning and memory transfer. Hey, I have cancer, but here is a fresh body, now transfer over my memory to the new body. Obviously only the rich or super important should have access to this. But, any day I could find cancer in my ass, and it's just a roll of the dice. Long life is pointless. We used to live to 30 or 40 and we were more productive as a human race. Families made like 12 children and they worked in coal mines and shit. School went to 12 years if you were lucky. We have it far too good today and none of us deserve it. A man who has everything is weak as fuck. The struggle makes us real. I imagine those teams of 4 to 5 Russians creeping through towns with those gigantic backpacks and hiding are the kings of this world. They deserve lots of pussy when the war is done. permalink parent award report block reply view 7 more comments... localhost 1 points 2 days ago Or by AI, which is made by men. permalink parent award report block reply tpactionchasethevote 1 points 2 days ago How much would it be to prevent cancer? End all the chemicals in our food and water? permalink parent award report block reply bratt 2 points 2 days ago In other words 'kill everyone'. permalink parent award report block reply\nKungPaoMcChicken 7 points 2 days ago Dude, we can't even reconnect nerves after they are severed. How the fuck are we going to cure cancer? It's not possible. Cancer is mother nature's cure for human lifespan's going well beyond 100 years. What possible help is a cure? We will end up sustaining nursing home populations for 50 to 60 years if we cure cancer. permalink parent award report block reply PatriotSam 5 points 2 days ago Yes, cancer is simply your cells not dividing properly anymore. It's just like how you copy a photo over and over and it warps, no way to stop that. permalink parent award report block reply TGNX 2 points 2 days ago There are biologically immortal animals out there that never develop cancer. So it's possible, but we just don't know how. Not that I trust pharma fucks to do anything but hide it. permalink parent award report block reply KungPaoMcChicken 0 points 2 days ago To me, wasting money on research like this is a bottomless pit. We should invent cloning and memory transfer. Hey, I have cancer, but here is a fresh body, now transfer over my memory to the new body. Obviously only the rich or super important should have access to this. But, any day I could find cancer in my ass, and it's just a roll of the dice. Long life is pointless. We used to live to 30 or 40 and we were more productive as a human race. Families made like 12 children and they worked in coal mines and shit. School went to 12 years if you were lucky. We have it far too good today and none of us deserve it. A man who has everything is weak as fuck. The struggle makes us real. I imagine those teams of 4 to 5 Russians creeping through towns with those gigantic backpacks and hiding are the kings of this world. They deserve lots of pussy when the war is done. permalink parent award report block reply view 7 more comments...\nPatriotSam 5 points 2 days ago Yes, cancer is simply your cells not dividing properly anymore. It's just like how you copy a photo over and over and it warps, no way to stop that. permalink parent award report block reply TGNX 2 points 2 days ago There are biologically immortal animals out there that never develop cancer. So it's possible, but we just don't know how. Not that I trust pharma fucks to do anything but hide it. permalink parent award report block reply KungPaoMcChicken 0 points 2 days ago To me, wasting money on research like this is a bottomless pit. We should invent cloning and memory transfer. Hey, I have cancer, but here is a fresh body, now transfer over my memory to the new body. Obviously only the rich or super important should have access to this. But, any day I could find cancer in my ass, and it's just a roll of the dice. Long life is pointless. We used to live to 30 or 40 and we were more productive as a human race. Families made like 12 children and they worked in coal mines and shit. School went to 12 years if you were lucky. We have it far too good today and none of us deserve it. A man who has everything is weak as fuck. The struggle makes us real. I imagine those teams of 4 to 5 Russians creeping through towns with those gigantic backpacks and hiding are the kings of this world. They deserve lots of pussy when the war is done. permalink parent award report block reply view 7 more comments...\nTGNX 2 points 2 days ago There are biologically immortal animals out there that never develop cancer. So it's possible, but we just don't know how. Not that I trust pharma fucks to do anything but hide it. permalink parent award report block reply\nKungPaoMcChicken 0 points 2 days ago To me, wasting money on research like this is a bottomless pit. We should invent cloning and memory transfer. Hey, I have cancer, but here is a fresh body, now transfer over my memory to the new body. Obviously only the rich or super important should have access to this. But, any day I could find cancer in my ass, and it's just a roll of the dice. Long life is pointless. We used to live to 30 or 40 and we were more productive as a human race. Families made like 12 children and they worked in coal mines and shit. School went to 12 years if you were lucky. We have it far too good today and none of us deserve it. A man who has everything is weak as fuck. The struggle makes us real. I imagine those teams of 4 to 5 Russians creeping through towns with those gigantic backpacks and hiding are the kings of this world. They deserve lots of pussy when the war is done. permalink parent award report block reply view 7 more comments...\nlocalhost 1 points 2 days ago Or by AI, which is made by men. permalink parent award report block reply\ntpactionchasethevote 1 points 2 days ago How much would it be to prevent cancer? End all the chemicals in our food and water? permalink parent award report block reply bratt 2 points 2 days ago In other words 'kill everyone'. permalink parent award report block reply\nbratt 2 points 2 days ago In other words 'kill everyone'. permalink parent award report block reply\nFKH2 1 points 1 day ago Yep permalink parent award report block reply\nDeplora 46 points 2 days ago She says her work has potential to prevent (not cure) breast cancer.  I can't be bothered to watch this, but \"breast cancer\" is a whole bunch of different types of cancer, with different developmental pathways and different sensitivity/resistance to various treatments.  Nobody has \" the cure for breast cancer\" or even \" the prevention for breast cancer\", and nobody ever will.  Most preventive measures that are already proven to be highly effective involve lifestyle changes and self-discipline that most women are unwilling to adhere to (no alcohol use, no getting significantly overweight). There are many thousands of biomedical researchers who are hoping that their idea will prove to be very significant for treating or preventing some common life-shortening or disabling disease.  They can't all be given all the money they want to try to prove their idea actually works.  In most cases, their idea will turn out not to work, or to work a little bit but less effectively than somebody else's idea. permalink award report block reply UCantStumpTheTrump 48 points 2 days ago PhD scientist here working in cancer research. These academic scientists are almost ALL turbo-liberals, because they can stay in the ivory tower huffing their own farts, and their research is funded by NIH/NSF grants. Most of the stuff they publish is purely academic and will never become an actual medicine or product, which is why I got out of academia as soon as I defended my thesis and went into industry permalink parent award report block reply I_Am_John_Galt 21 points 2 days ago It's insufferable isn't it?  I couldn't stand the ideological rot and the egotistical snobbery, and that was a good while back.  Jabbering buttplugs posing as human beings. permalink parent award report block reply Moose_Antlers 13 points 2 days ago I'd settle for her actually citing her paper so I can look at it and see if there's any actual validity to her claim. Preventing Breast CA would be huge. But which type? Are we talking BRCA+, ER+, HER+?, the negative versions of these, which get rarer but harder to treat? Details matter when you're making sensationalist claims to a urinalist/activist about a disease which threatens 1 in 8 women and terrifies them all. Meanwhile I'm also reading another author on that paper is saying he did the lion's share of the work and she's trying to claim credit for the breakthrough, if there is one... I already know this is getting politicized and turned into a circus, so I can't listen to either one. I'll have to read the paper myself and see what's up. But yeah, from here, I'm smelling ivory-tower vegan farts with a hint of cat piss and wine breath. Edit: Found the paper: https://www.nature.com/articles/s41588-024-01988-0 She's got a copy number alteration that seems to correlate with BRCA1+ or BRCA2+ status. Maybe a biomarker? Maybe useful as a screening tool? We already have BRCA1 and BRCA2 screening tests, so is her thought to use this in lieu of mammograms in high-risk women in their 20s and 30s to try and catch early onset cancer? (This isn't prevention, it's screening) permalink parent award report block reply UCantStumpTheTrump 8 points 2 days ago There are a lot of academics whose whole career is just questionable contributions to science funded by lavish grants of millions of dollars, just because they made flashy presentations for granting agencies, published papers in prestigious journals, etc. The core of the \"red wine is good for you\" theory came from the compound resveratrol, which is a natural polyphenol present in wine. It was supposed to be cardioprotective or some shit like that, but anyway the professor (Dipak Das) was found to have faked HIS WHOLE CAREER worth of papers, and he wrote a lengthy rambling rebuttal after he was fired and then died unceremoniously of a heart attack. You cant make this shit up! permalink parent award report block reply DrMarcy 3 points 1 day ago I also work in research. I had heard they were in the process of redoing his research to actually find results. Heard anything about that? permalink parent award report block reply view 1 more comments... UCantStumpTheTrump 7 points 2 days ago I'm at a small biotech startup funded by private VCs and private investors, and we are using a nanoparticle that is endocytosed by all cell types and has a DNA component that can bind messenger RNA in the cell and prevent it from being transcribed, so we can target any genetic disorder. also the RNA binding can trigger release of a cytotoxic drug to kill the cell if its a cancer mRNA sequence (like Survivin) that is highly overexpressed in BC cells (esp triple negative) permalink parent award report block reply Tyrone_biggums 1 points 1 day ago BRCA+? BRCA mutant. permalink parent award report block reply 2016TrumpMAGA 6 points 2 days ago Try being a PhD in the humanities.  Half the people I used to work with were certifiably insane.  I was the almost only one in my whole department not on some sort of med. permalink parent award report block reply TPMJB 2 points 1 day ago These academic scientists are almost ALL turbo-liberals, because they can stay in the ivory tower huffing their own farts, and their research is funded by NIH/NSF grants. Academia is almost always 5+ years behind private industry. But private industry keeps all their research behind their closed doors. Private industry it all depends on the location - I've seen my share of Republicans, though we'll never announce that fact. I'd never work for Academia lol. Begging for grants 90% of your week is not science. permalink parent award report block reply Aquamine-Amarine 14 points 2 days ago I don't drink alcohol. Guess I'm off to a good start. permalink parent award report block reply Deplora 12 points 2 days ago You definitely are.  I don't drink alcohol either.  There are a whole lot of benefits besides reducing cancer risk. permalink parent award report block reply makersmarx -1 points 2 days ago Good job, ladies. Way to keep those lady lumps healthy for makersmarx permalink parent award report block reply America1stAndOnly 2 points 1 day ago You're referring to yourself in the 3rd person. Perhaps you'd fit in better at Reddit. permalink parent award report block reply view 9 more comments... they-see-me-trollin 4 points 1 day ago the guy who was the lead researcher on her project came out and said this is wildly misrepresentative... that it's not even close to what 60 minutes presents it as. someone called him out for getting punted from duke, but then it turns out it was because they wanted him to push more of this grifter breadcrumbing bullshit, and he refused. permalink parent award report block reply booblitchutz 2 points 1 day ago Lookit Mr Sensible, over here! permalink parent award report block reply\nUCantStumpTheTrump 48 points 2 days ago PhD scientist here working in cancer research. These academic scientists are almost ALL turbo-liberals, because they can stay in the ivory tower huffing their own farts, and their research is funded by NIH/NSF grants. Most of the stuff they publish is purely academic and will never become an actual medicine or product, which is why I got out of academia as soon as I defended my thesis and went into industry permalink parent award report block reply I_Am_John_Galt 21 points 2 days ago It's insufferable isn't it?  I couldn't stand the ideological rot and the egotistical snobbery, and that was a good while back.  Jabbering buttplugs posing as human beings. permalink parent award report block reply Moose_Antlers 13 points 2 days ago I'd settle for her actually citing her paper so I can look at it and see if there's any actual validity to her claim. Preventing Breast CA would be huge. But which type? Are we talking BRCA+, ER+, HER+?, the negative versions of these, which get rarer but harder to treat? Details matter when you're making sensationalist claims to a urinalist/activist about a disease which threatens 1 in 8 women and terrifies them all. Meanwhile I'm also reading another author on that paper is saying he did the lion's share of the work and she's trying to claim credit for the breakthrough, if there is one... I already know this is getting politicized and turned into a circus, so I can't listen to either one. I'll have to read the paper myself and see what's up. But yeah, from here, I'm smelling ivory-tower vegan farts with a hint of cat piss and wine breath. Edit: Found the paper: https://www.nature.com/articles/s41588-024-01988-0 She's got a copy number alteration that seems to correlate with BRCA1+ or BRCA2+ status. Maybe a biomarker? Maybe useful as a screening tool? We already have BRCA1 and BRCA2 screening tests, so is her thought to use this in lieu of mammograms in high-risk women in their 20s and 30s to try and catch early onset cancer? (This isn't prevention, it's screening) permalink parent award report block reply UCantStumpTheTrump 8 points 2 days ago There are a lot of academics whose whole career is just questionable contributions to science funded by lavish grants of millions of dollars, just because they made flashy presentations for granting agencies, published papers in prestigious journals, etc. The core of the \"red wine is good for you\" theory came from the compound resveratrol, which is a natural polyphenol present in wine. It was supposed to be cardioprotective or some shit like that, but anyway the professor (Dipak Das) was found to have faked HIS WHOLE CAREER worth of papers, and he wrote a lengthy rambling rebuttal after he was fired and then died unceremoniously of a heart attack. You cant make this shit up! permalink parent award report block reply DrMarcy 3 points 1 day ago I also work in research. I had heard they were in the process of redoing his research to actually find results. Heard anything about that? permalink parent award report block reply view 1 more comments... UCantStumpTheTrump 7 points 2 days ago I'm at a small biotech startup funded by private VCs and private investors, and we are using a nanoparticle that is endocytosed by all cell types and has a DNA component that can bind messenger RNA in the cell and prevent it from being transcribed, so we can target any genetic disorder. also the RNA binding can trigger release of a cytotoxic drug to kill the cell if its a cancer mRNA sequence (like Survivin) that is highly overexpressed in BC cells (esp triple negative) permalink parent award report block reply Tyrone_biggums 1 points 1 day ago BRCA+? BRCA mutant. permalink parent award report block reply 2016TrumpMAGA 6 points 2 days ago Try being a PhD in the humanities.  Half the people I used to work with were certifiably insane.  I was the almost only one in my whole department not on some sort of med. permalink parent award report block reply TPMJB 2 points 1 day ago These academic scientists are almost ALL turbo-liberals, because they can stay in the ivory tower huffing their own farts, and their research is funded by NIH/NSF grants. Academia is almost always 5+ years behind private industry. But private industry keeps all their research behind their closed doors. Private industry it all depends on the location - I've seen my share of Republicans, though we'll never announce that fact. I'd never work for Academia lol. Begging for grants 90% of your week is not science. permalink parent award report block reply\nI_Am_John_Galt 21 points 2 days ago It's insufferable isn't it?  I couldn't stand the ideological rot and the egotistical snobbery, and that was a good while back.  Jabbering buttplugs posing as human beings. permalink parent award report block reply\nMoose_Antlers 13 points 2 days ago I'd settle for her actually citing her paper so I can look at it and see if there's any actual validity to her claim. Preventing Breast CA would be huge. But which type? Are we talking BRCA+, ER+, HER+?, the negative versions of these, which get rarer but harder to treat? Details matter when you're making sensationalist claims to a urinalist/activist about a disease which threatens 1 in 8 women and terrifies them all. Meanwhile I'm also reading another author on that paper is saying he did the lion's share of the work and she's trying to claim credit for the breakthrough, if there is one... I already know this is getting politicized and turned into a circus, so I can't listen to either one. I'll have to read the paper myself and see what's up. But yeah, from here, I'm smelling ivory-tower vegan farts with a hint of cat piss and wine breath. Edit: Found the paper: https://www.nature.com/articles/s41588-024-01988-0 She's got a copy number alteration that seems to correlate with BRCA1+ or BRCA2+ status. Maybe a biomarker? Maybe useful as a screening tool? We already have BRCA1 and BRCA2 screening tests, so is her thought to use this in lieu of mammograms in high-risk women in their 20s and 30s to try and catch early onset cancer? (This isn't prevention, it's screening) permalink parent award report block reply UCantStumpTheTrump 8 points 2 days ago There are a lot of academics whose whole career is just questionable contributions to science funded by lavish grants of millions of dollars, just because they made flashy presentations for granting agencies, published papers in prestigious journals, etc. The core of the \"red wine is good for you\" theory came from the compound resveratrol, which is a natural polyphenol present in wine. It was supposed to be cardioprotective or some shit like that, but anyway the professor (Dipak Das) was found to have faked HIS WHOLE CAREER worth of papers, and he wrote a lengthy rambling rebuttal after he was fired and then died unceremoniously of a heart attack. You cant make this shit up! permalink parent award report block reply DrMarcy 3 points 1 day ago I also work in research. I had heard they were in the process of redoing his research to actually find results. Heard anything about that? permalink parent award report block reply view 1 more comments... UCantStumpTheTrump 7 points 2 days ago I'm at a small biotech startup funded by private VCs and private investors, and we are using a nanoparticle that is endocytosed by all cell types and has a DNA component that can bind messenger RNA in the cell and prevent it from being transcribed, so we can target any genetic disorder. also the RNA binding can trigger release of a cytotoxic drug to kill the cell if its a cancer mRNA sequence (like Survivin) that is highly overexpressed in BC cells (esp triple negative) permalink parent award report block reply Tyrone_biggums 1 points 1 day ago BRCA+? BRCA mutant. permalink parent award report block reply\nUCantStumpTheTrump 8 points 2 days ago There are a lot of academics whose whole career is just questionable contributions to science funded by lavish grants of millions of dollars, just because they made flashy presentations for granting agencies, published papers in prestigious journals, etc. The core of the \"red wine is good for you\" theory came from the compound resveratrol, which is a natural polyphenol present in wine. It was supposed to be cardioprotective or some shit like that, but anyway the professor (Dipak Das) was found to have faked HIS WHOLE CAREER worth of papers, and he wrote a lengthy rambling rebuttal after he was fired and then died unceremoniously of a heart attack. You cant make this shit up! permalink parent award report block reply DrMarcy 3 points 1 day ago I also work in research. I had heard they were in the process of redoing his research to actually find results. Heard anything about that? permalink parent award report block reply view 1 more comments...\nDrMarcy 3 points 1 day ago I also work in research. I had heard they were in the process of redoing his research to actually find results. Heard anything about that? permalink parent award report block reply view 1 more comments...\nUCantStumpTheTrump 7 points 2 days ago I'm at a small biotech startup funded by private VCs and private investors, and we are using a nanoparticle that is endocytosed by all cell types and has a DNA component that can bind messenger RNA in the cell and prevent it from being transcribed, so we can target any genetic disorder. also the RNA binding can trigger release of a cytotoxic drug to kill the cell if its a cancer mRNA sequence (like Survivin) that is highly overexpressed in BC cells (esp triple negative) permalink parent award report block reply\nTyrone_biggums 1 points 1 day ago BRCA+? BRCA mutant. permalink parent award report block reply\n2016TrumpMAGA 6 points 2 days ago Try being a PhD in the humanities.  Half the people I used to work with were certifiably insane.  I was the almost only one in my whole department not on some sort of med. permalink parent award report block reply\nTPMJB 2 points 1 day ago These academic scientists are almost ALL turbo-liberals, because they can stay in the ivory tower huffing their own farts, and their research is funded by NIH/NSF grants. Academia is almost always 5+ years behind private industry. But private industry keeps all their research behind their closed doors. Private industry it all depends on the location - I've seen my share of Republicans, though we'll never announce that fact. I'd never work for Academia lol. Begging for grants 90% of your week is not science. permalink parent award report block reply\nAquamine-Amarine 14 points 2 days ago I don't drink alcohol. Guess I'm off to a good start. permalink parent award report block reply Deplora 12 points 2 days ago You definitely are.  I don't drink alcohol either.  There are a whole lot of benefits besides reducing cancer risk. permalink parent award report block reply makersmarx -1 points 2 days ago Good job, ladies. Way to keep those lady lumps healthy for makersmarx permalink parent award report block reply America1stAndOnly 2 points 1 day ago You're referring to yourself in the 3rd person. Perhaps you'd fit in better at Reddit. permalink parent award report block reply view 9 more comments...\nDeplora 12 points 2 days ago You definitely are.  I don't drink alcohol either.  There are a whole lot of benefits besides reducing cancer risk. permalink parent award report block reply makersmarx -1 points 2 days ago Good job, ladies. Way to keep those lady lumps healthy for makersmarx permalink parent award report block reply America1stAndOnly 2 points 1 day ago You're referring to yourself in the 3rd person. Perhaps you'd fit in better at Reddit. permalink parent award report block reply view 9 more comments...\nmakersmarx -1 points 2 days ago Good job, ladies. Way to keep those lady lumps healthy for makersmarx permalink parent award report block reply America1stAndOnly 2 points 1 day ago You're referring to yourself in the 3rd person. Perhaps you'd fit in better at Reddit. permalink parent award report block reply view 9 more comments...\nAmerica1stAndOnly 2 points 1 day ago You're referring to yourself in the 3rd person. Perhaps you'd fit in better at Reddit. permalink parent award report block reply view 9 more comments...\nthey-see-me-trollin 4 points 1 day ago the guy who was the lead researcher on her project came out and said this is wildly misrepresentative... that it's not even close to what 60 minutes presents it as. someone called him out for getting punted from duke, but then it turns out it was because they wanted him to push more of this grifter breadcrumbing bullshit, and he refused. permalink parent award report block reply\nbooblitchutz 2 points 1 day ago Lookit Mr Sensible, over here! permalink parent award report block reply\nYaemz123 32 points 2 days ago What she said was her research had POTENTIAL which is the same as all other research. Nobody said she had the cure for breast cancer. Clickbait trash. permalink award report block reply 26magarat 10 points 2 days ago Hey, every criminal is a potential doctor, lawyer, etc. to libs. permalink parent award report block reply fauxgnaws 4 points 2 days ago Potential implies if you put enough resources into it then it'll happen.  What she should have said was \"possibility\". Walsh is click-baiting because he knows she doesn't actually have a cure for cancer, but she was asking for it by mispresenting her work for politics. permalink parent award report block reply amopheldupsidedown 3 points 2 days ago I think he was implying that they know what she has is worthless because they are not willing to put up their own money, even when when they have billions sitting around. However they are perfectly willing to spend your money on it. permalink parent award report block reply bill_in_texas 1 points 1 day ago I have the potential to save someone from a burning car or house fire.  I mean, I haven't done it yet, but I have the potential to do it. permalink parent award report block reply deleted 1 points 2 days ago UCantStumpTheTrump 4 points 2 days ago I'm doing it with VC funding! Which is how it should be done. Academia is all about just pushing out papers to get graduate students out the door with a degree permalink parent award report block reply 1_Badcop 5 points 2 days ago Private Sector? Are you crazy? They expect results! permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago We just filed our patents today. We basically have developed a completely new technology for delivering anticancer drugs that causes them only to be activated in tumor cells while leaving healthy cells alone. We’re in the process of doing our first animal studies now, but so far the data from cell culture has been positive. permalink parent award report block reply view 3 more comments... TPMJB 2 points 1 day ago Depends. The largest pharma companies have dozens of projects that don't produce shit for a decade. I was on a couple of those projects. They shut down after I left. As with any company, the larger the bloat, the more useless \"work\" gets done. permalink parent award report block reply Mamapedia 3 points 2 days ago Best wishes in your research! permalink parent award report block reply UCantStumpTheTrump 2 points 2 days ago Thank you! permalink parent award report block reply\n26magarat 10 points 2 days ago Hey, every criminal is a potential doctor, lawyer, etc. to libs. permalink parent award report block reply\nfauxgnaws 4 points 2 days ago Potential implies if you put enough resources into it then it'll happen.  What she should have said was \"possibility\". Walsh is click-baiting because he knows she doesn't actually have a cure for cancer, but she was asking for it by mispresenting her work for politics. permalink parent award report block reply amopheldupsidedown 3 points 2 days ago I think he was implying that they know what she has is worthless because they are not willing to put up their own money, even when when they have billions sitting around. However they are perfectly willing to spend your money on it. permalink parent award report block reply\namopheldupsidedown 3 points 2 days ago I think he was implying that they know what she has is worthless because they are not willing to put up their own money, even when when they have billions sitting around. However they are perfectly willing to spend your money on it. permalink parent award report block reply\nbill_in_texas 1 points 1 day ago I have the potential to save someone from a burning car or house fire.  I mean, I haven't done it yet, but I have the potential to do it. permalink parent award report block reply\ndeleted 1 points 2 days ago UCantStumpTheTrump 4 points 2 days ago I'm doing it with VC funding! Which is how it should be done. Academia is all about just pushing out papers to get graduate students out the door with a degree permalink parent award report block reply 1_Badcop 5 points 2 days ago Private Sector? Are you crazy? They expect results! permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago We just filed our patents today. We basically have developed a completely new technology for delivering anticancer drugs that causes them only to be activated in tumor cells while leaving healthy cells alone. We’re in the process of doing our first animal studies now, but so far the data from cell culture has been positive. permalink parent award report block reply view 3 more comments... TPMJB 2 points 1 day ago Depends. The largest pharma companies have dozens of projects that don't produce shit for a decade. I was on a couple of those projects. They shut down after I left. As with any company, the larger the bloat, the more useless \"work\" gets done. permalink parent award report block reply Mamapedia 3 points 2 days ago Best wishes in your research! permalink parent award report block reply UCantStumpTheTrump 2 points 2 days ago Thank you! permalink parent award report block reply\nUCantStumpTheTrump 4 points 2 days ago I'm doing it with VC funding! Which is how it should be done. Academia is all about just pushing out papers to get graduate students out the door with a degree permalink parent award report block reply 1_Badcop 5 points 2 days ago Private Sector? Are you crazy? They expect results! permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago We just filed our patents today. We basically have developed a completely new technology for delivering anticancer drugs that causes them only to be activated in tumor cells while leaving healthy cells alone. We’re in the process of doing our first animal studies now, but so far the data from cell culture has been positive. permalink parent award report block reply view 3 more comments... TPMJB 2 points 1 day ago Depends. The largest pharma companies have dozens of projects that don't produce shit for a decade. I was on a couple of those projects. They shut down after I left. As with any company, the larger the bloat, the more useless \"work\" gets done. permalink parent award report block reply Mamapedia 3 points 2 days ago Best wishes in your research! permalink parent award report block reply UCantStumpTheTrump 2 points 2 days ago Thank you! permalink parent award report block reply\n1_Badcop 5 points 2 days ago Private Sector? Are you crazy? They expect results! permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago We just filed our patents today. We basically have developed a completely new technology for delivering anticancer drugs that causes them only to be activated in tumor cells while leaving healthy cells alone. We’re in the process of doing our first animal studies now, but so far the data from cell culture has been positive. permalink parent award report block reply view 3 more comments... TPMJB 2 points 1 day ago Depends. The largest pharma companies have dozens of projects that don't produce shit for a decade. I was on a couple of those projects. They shut down after I left. As with any company, the larger the bloat, the more useless \"work\" gets done. permalink parent award report block reply\nUCantStumpTheTrump 4 points 2 days ago We just filed our patents today. We basically have developed a completely new technology for delivering anticancer drugs that causes them only to be activated in tumor cells while leaving healthy cells alone. We’re in the process of doing our first animal studies now, but so far the data from cell culture has been positive. permalink parent award report block reply view 3 more comments...\nTPMJB 2 points 1 day ago Depends. The largest pharma companies have dozens of projects that don't produce shit for a decade. I was on a couple of those projects. They shut down after I left. As with any company, the larger the bloat, the more useless \"work\" gets done. permalink parent award report block reply\nMamapedia 3 points 2 days ago Best wishes in your research! permalink parent award report block reply UCantStumpTheTrump 2 points 2 days ago Thank you! permalink parent award report block reply\nUCantStumpTheTrump 2 points 2 days ago Thank you! permalink parent award report block reply\nLuvs_2_Bop 13 points 2 days ago Exercise, eat red meat, drink tea….stop using all those beauty/skincare products with horrible ingredients. Less bullshit equals less cancer. At least it’s a start permalink award report block reply Deplora 8 points 2 days ago For preventing breast cancer (and some other common cancers) cutting out alcohol is highly effective.  People just don't want to.  Few if any topical beauty/skincare products are doing to increase cancer risk.  I'd be more concerned about all the injectables (fillers, botox, etc) and repeated use of laser treatments. permalink parent award report block reply Luvs_2_Bop 6 points 2 days ago From articles I’ve read, artificial fragrance is a toxic nightmare permalink parent award report block reply TrumpAndGodWin 4 points 2 days ago Dawn soap added a nasty irritating fragrance recently, phenoxyethanol is another one to avoid. You can rinse the hell out of your hands and the toxic stench of new dawn remains. permalink parent award report block reply Deplora 4 points 2 days ago Only ones I've heard of being a problem are natural lavender and tea tree oils (though if there are artificial versions that contain the same chemicals, those would cause problems too).  Several components of these oils have estrogenic and anti-androgenic effects, and can cause breast growth in young boys.  Presumably there are some other potentially undesirable effects that are less visible/detectable. https://www.endocrine.org/news-and-advocacy/news-room/2018/chemicals-in-lavender-and-tea-tree-oil-appear-to-be-hormone-disruptors permalink parent award report block reply booblitchutz 3 points 1 day ago Colon cancer, too. permalink parent award report block reply TPMJB 2 points 1 day ago highly effective Eh, it depends on the amount per day. It seems to be a modest increase, which I was unaware of. https://pmc.ncbi.nlm.nih.gov/articles/PMC7295577/ Seems like 4-8% per 10mL alcohol consumed per day (which I assume they're equating to 100% alcohol? A 40mL shot is roughly 10mL of alcohol, equal to one \"unit\".) But keep in mind that the average incidence is 46.3 per 100,000.  So we're talking somewhere in the realm of 2-4 more than that. It's...an association, but a little weak. With as old as alcohol is in society, I'd think that there was something else at play here. Alcohol does have hormonal activity a la estrogen, so I think it probably modifies something where those predisposed to breast cancer get a boost in their ability to develop cancer. Otherwise, we'd see much higher rates in Poland than we would in the US, but the opposite is true. permalink parent award report block reply Deplora 2 points 1 day ago Several studies have found a very strong effect, especially with binge drinking in early adulthood (i.e. drinking that's considered \"normal\" on many college campuses).  No doubt there are a lot of other factors that account for varying results in different countries, especially dietary factors. permalink parent award report block reply TPMJB 2 points 1 day ago Explain why Poland, which has drinking leagues above the US in the average populace, has a lower incidence of breast cancer. They have a MUCH higher rate of people binge drinking starting at 15. permalink parent award report block reply view 2 more comments... JamesSunderland 2 points 1 day ago My sister in law's mother has prevented the return of her breast cancer these years by eating clean and healthy. No trash foods into her system. permalink parent award report block reply\nDeplora 8 points 2 days ago For preventing breast cancer (and some other common cancers) cutting out alcohol is highly effective.  People just don't want to.  Few if any topical beauty/skincare products are doing to increase cancer risk.  I'd be more concerned about all the injectables (fillers, botox, etc) and repeated use of laser treatments. permalink parent award report block reply Luvs_2_Bop 6 points 2 days ago From articles I’ve read, artificial fragrance is a toxic nightmare permalink parent award report block reply TrumpAndGodWin 4 points 2 days ago Dawn soap added a nasty irritating fragrance recently, phenoxyethanol is another one to avoid. You can rinse the hell out of your hands and the toxic stench of new dawn remains. permalink parent award report block reply Deplora 4 points 2 days ago Only ones I've heard of being a problem are natural lavender and tea tree oils (though if there are artificial versions that contain the same chemicals, those would cause problems too).  Several components of these oils have estrogenic and anti-androgenic effects, and can cause breast growth in young boys.  Presumably there are some other potentially undesirable effects that are less visible/detectable. https://www.endocrine.org/news-and-advocacy/news-room/2018/chemicals-in-lavender-and-tea-tree-oil-appear-to-be-hormone-disruptors permalink parent award report block reply booblitchutz 3 points 1 day ago Colon cancer, too. permalink parent award report block reply TPMJB 2 points 1 day ago highly effective Eh, it depends on the amount per day. It seems to be a modest increase, which I was unaware of. https://pmc.ncbi.nlm.nih.gov/articles/PMC7295577/ Seems like 4-8% per 10mL alcohol consumed per day (which I assume they're equating to 100% alcohol? A 40mL shot is roughly 10mL of alcohol, equal to one \"unit\".) But keep in mind that the average incidence is 46.3 per 100,000.  So we're talking somewhere in the realm of 2-4 more than that. It's...an association, but a little weak. With as old as alcohol is in society, I'd think that there was something else at play here. Alcohol does have hormonal activity a la estrogen, so I think it probably modifies something where those predisposed to breast cancer get a boost in their ability to develop cancer. Otherwise, we'd see much higher rates in Poland than we would in the US, but the opposite is true. permalink parent award report block reply Deplora 2 points 1 day ago Several studies have found a very strong effect, especially with binge drinking in early adulthood (i.e. drinking that's considered \"normal\" on many college campuses).  No doubt there are a lot of other factors that account for varying results in different countries, especially dietary factors. permalink parent award report block reply TPMJB 2 points 1 day ago Explain why Poland, which has drinking leagues above the US in the average populace, has a lower incidence of breast cancer. They have a MUCH higher rate of people binge drinking starting at 15. permalink parent award report block reply view 2 more comments...\nLuvs_2_Bop 6 points 2 days ago From articles I’ve read, artificial fragrance is a toxic nightmare permalink parent award report block reply TrumpAndGodWin 4 points 2 days ago Dawn soap added a nasty irritating fragrance recently, phenoxyethanol is another one to avoid. You can rinse the hell out of your hands and the toxic stench of new dawn remains. permalink parent award report block reply Deplora 4 points 2 days ago Only ones I've heard of being a problem are natural lavender and tea tree oils (though if there are artificial versions that contain the same chemicals, those would cause problems too).  Several components of these oils have estrogenic and anti-androgenic effects, and can cause breast growth in young boys.  Presumably there are some other potentially undesirable effects that are less visible/detectable. https://www.endocrine.org/news-and-advocacy/news-room/2018/chemicals-in-lavender-and-tea-tree-oil-appear-to-be-hormone-disruptors permalink parent award report block reply\nTrumpAndGodWin 4 points 2 days ago Dawn soap added a nasty irritating fragrance recently, phenoxyethanol is another one to avoid. You can rinse the hell out of your hands and the toxic stench of new dawn remains. permalink parent award report block reply\nDeplora 4 points 2 days ago Only ones I've heard of being a problem are natural lavender and tea tree oils (though if there are artificial versions that contain the same chemicals, those would cause problems too).  Several components of these oils have estrogenic and anti-androgenic effects, and can cause breast growth in young boys.  Presumably there are some other potentially undesirable effects that are less visible/detectable. https://www.endocrine.org/news-and-advocacy/news-room/2018/chemicals-in-lavender-and-tea-tree-oil-appear-to-be-hormone-disruptors permalink parent award report block reply\nbooblitchutz 3 points 1 day ago Colon cancer, too. permalink parent award report block reply\nTPMJB 2 points 1 day ago highly effective Eh, it depends on the amount per day. It seems to be a modest increase, which I was unaware of. https://pmc.ncbi.nlm.nih.gov/articles/PMC7295577/ Seems like 4-8% per 10mL alcohol consumed per day (which I assume they're equating to 100% alcohol? A 40mL shot is roughly 10mL of alcohol, equal to one \"unit\".) But keep in mind that the average incidence is 46.3 per 100,000.  So we're talking somewhere in the realm of 2-4 more than that. It's...an association, but a little weak. With as old as alcohol is in society, I'd think that there was something else at play here. Alcohol does have hormonal activity a la estrogen, so I think it probably modifies something where those predisposed to breast cancer get a boost in their ability to develop cancer. Otherwise, we'd see much higher rates in Poland than we would in the US, but the opposite is true. permalink parent award report block reply Deplora 2 points 1 day ago Several studies have found a very strong effect, especially with binge drinking in early adulthood (i.e. drinking that's considered \"normal\" on many college campuses).  No doubt there are a lot of other factors that account for varying results in different countries, especially dietary factors. permalink parent award report block reply TPMJB 2 points 1 day ago Explain why Poland, which has drinking leagues above the US in the average populace, has a lower incidence of breast cancer. They have a MUCH higher rate of people binge drinking starting at 15. permalink parent award report block reply view 2 more comments...\nDeplora 2 points 1 day ago Several studies have found a very strong effect, especially with binge drinking in early adulthood (i.e. drinking that's considered \"normal\" on many college campuses).  No doubt there are a lot of other factors that account for varying results in different countries, especially dietary factors. permalink parent award report block reply TPMJB 2 points 1 day ago Explain why Poland, which has drinking leagues above the US in the average populace, has a lower incidence of breast cancer. They have a MUCH higher rate of people binge drinking starting at 15. permalink parent award report block reply view 2 more comments...\nTPMJB 2 points 1 day ago Explain why Poland, which has drinking leagues above the US in the average populace, has a lower incidence of breast cancer. They have a MUCH higher rate of people binge drinking starting at 15. permalink parent award report block reply view 2 more comments...\nJamesSunderland 2 points 1 day ago My sister in law's mother has prevented the return of her breast cancer these years by eating clean and healthy. No trash foods into her system. permalink parent award report block reply\nthp2034 12 points 2 days ago So, they are trying to tie blame for the termination of funding to the Trump Admin cuz we all know how mean & nasty the Orange Man can be. But, if Harvard would comply with Federal mandates, then the funding would not be terminated...so does that not actually make Harvard the one to blame? They just have to follow the law like everyone else & funding will not be cut, cancer will be cured and everyone will be happy! permalink award report block reply\ns27zw7M1h62lURPyezOa PRO 8 points 2 days ago The key term is \"Potential\" to cure cancer.  I have the \"Potential\" to win the Super Lotto. permalink award report block reply Moose_Antlers 2 points 2 days ago \"weasel words\" Though, in her defense, I'd be obliged to use them in any paper because there's always uncertainty in any experiment. Salesmen make definitive all or none statements. Scientists and clinicians always acknowledge the possibility of outliers. permalink parent award report block reply\nMoose_Antlers 2 points 2 days ago \"weasel words\" Though, in her defense, I'd be obliged to use them in any paper because there's always uncertainty in any experiment. Salesmen make definitive all or none statements. Scientists and clinicians always acknowledge the possibility of outliers. permalink parent award report block reply\nPatriotSam 8 points 2 days ago Oh come the fuck on, she says right in the beginning that she is searching for the potential to cure breast cancer Not that she's actually found the cure. Listen to the wording. Also this is a woman scientist, of course she's going to be featured on CNN for some sort of feminist bullshit like oh my god the women are being prevented from finding the cure to cancer, as if they ever would. Bullshit headline very disappointed in Matt Walsh, he is usually more astute than this. permalink award report block reply booblitchutz 1 points 1 day ago To me it sounds like Matt Walsh is saying Harvard had $50B to fund her research, if it’s so important. permalink parent award report block reply America1stAndOnly 1 points 1 day ago very disappointed in Matt Walsh, he is usually more astute than this. He really isn't. permalink parent award report block reply\nbooblitchutz 1 points 1 day ago To me it sounds like Matt Walsh is saying Harvard had $50B to fund her research, if it’s so important. permalink parent award report block reply\nAmerica1stAndOnly 1 points 1 day ago very disappointed in Matt Walsh, he is usually more astute than this. He really isn't. permalink parent award report block reply\nGoldwaterVoter 7 points 2 days ago For any Alzheimer's caregivers: FOLIC ACID may \"cure \"sundowning\". I was a 24/7 caregiver for my mother for 3 years. And I mean 24 and 7, while I ran a small software company by myself at home. About 5 PM each day she started walking out the front door (at age 83) to take a bus (no bus in our suburban neighborhood) to \"see her mother\". Damn annoying while I was cooking dinner. Heard on a doctor's radio show about Folic acid, so I tried it. One daily vitamin tablet at each meal time and bedtime, total 4 tablets per day. Stopped the sundowning cold for a year, and when started up again, increased dose by 50%, and stopped again. Search for folic acid/sundowning/Alzheimer's and look for current research about folic acid deficiency. For instance: https://pmc.ncbi.nlm.nih.gov/articles/PMC4909909/ permalink award report block reply Koikatrose 1 points 1 day ago Good info. I wish I had known that. 5 years ago Dad had it. What a night mare. God bless you for sharing that info. permalink parent award report block reply TPMJB 1 points 1 day ago For any Alzheimer's caregivers: FOLIC ACID may \"cure \"sundowning\". That paper doesn't use the word \" cure \" but \" mitigate \". So the effects of sundowning won't be as pronounced. Alzheimer's is a prion disease. Once you have it, you're fucked. In the odd future we can regenerate brain tissue, it'll never have the data of the old brain tissue. The only potential pathway we have is to stop it before it gets worse. I know I only have a few decades left at most. It's a good thing to add to treatment, though. permalink parent award report block reply GoldwaterVoter 1 points 1 day ago The \"cure\" comment isn't from the paper -- it's from my personal experience as my mother's caregiver for 3 years. Sundowning went to zero for a year, then started up again and 50% increase in dosage got it back to zero. It mostly is a relief for caregivers, not the patient. I could not have functioned for 3 years with my mother trying to leave home at  dinner time every day. I wrote a letter to Merck documenting my experience. They replied that they were looking for cures, not palliatives. permalink parent award report block reply TPMJB 1 points 1 day ago The \"cure\" comment isn't from the paper -- it's from my personal experience as my mother's caregiver for 3 years. Sundowning went to zero for a year, then started up again and 50% increase in dosage got it back to zero. Alright, sure. I'll give you that. I wrote a letter to Merck documenting my experience. They replied that they were looking for cures, not palliatives. I'm sure they are working on something , but like I said they'll only be able to arrest the damage that has been done. If you're full-on dementia, you'll still be demented but it won't get worse. Only possibility is to arrest it before it gets bad. Which it would be cool if they'd test people early-on before it gets bad, but we don't do that here (we can). Merck is working on everything under the sun. I've been to one of their bigger campuses - it's miles long. permalink parent award report block reply\nKoikatrose 1 points 1 day ago Good info. I wish I had known that. 5 years ago Dad had it. What a night mare. God bless you for sharing that info. permalink parent award report block reply\nTPMJB 1 points 1 day ago For any Alzheimer's caregivers: FOLIC ACID may \"cure \"sundowning\". That paper doesn't use the word \" cure \" but \" mitigate \". So the effects of sundowning won't be as pronounced. Alzheimer's is a prion disease. Once you have it, you're fucked. In the odd future we can regenerate brain tissue, it'll never have the data of the old brain tissue. The only potential pathway we have is to stop it before it gets worse. I know I only have a few decades left at most. It's a good thing to add to treatment, though. permalink parent award report block reply GoldwaterVoter 1 points 1 day ago The \"cure\" comment isn't from the paper -- it's from my personal experience as my mother's caregiver for 3 years. Sundowning went to zero for a year, then started up again and 50% increase in dosage got it back to zero. It mostly is a relief for caregivers, not the patient. I could not have functioned for 3 years with my mother trying to leave home at  dinner time every day. I wrote a letter to Merck documenting my experience. They replied that they were looking for cures, not palliatives. permalink parent award report block reply TPMJB 1 points 1 day ago The \"cure\" comment isn't from the paper -- it's from my personal experience as my mother's caregiver for 3 years. Sundowning went to zero for a year, then started up again and 50% increase in dosage got it back to zero. Alright, sure. I'll give you that. I wrote a letter to Merck documenting my experience. They replied that they were looking for cures, not palliatives. I'm sure they are working on something , but like I said they'll only be able to arrest the damage that has been done. If you're full-on dementia, you'll still be demented but it won't get worse. Only possibility is to arrest it before it gets bad. Which it would be cool if they'd test people early-on before it gets bad, but we don't do that here (we can). Merck is working on everything under the sun. I've been to one of their bigger campuses - it's miles long. permalink parent award report block reply\nGoldwaterVoter 1 points 1 day ago The \"cure\" comment isn't from the paper -- it's from my personal experience as my mother's caregiver for 3 years. Sundowning went to zero for a year, then started up again and 50% increase in dosage got it back to zero. It mostly is a relief for caregivers, not the patient. I could not have functioned for 3 years with my mother trying to leave home at  dinner time every day. I wrote a letter to Merck documenting my experience. They replied that they were looking for cures, not palliatives. permalink parent award report block reply TPMJB 1 points 1 day ago The \"cure\" comment isn't from the paper -- it's from my personal experience as my mother's caregiver for 3 years. Sundowning went to zero for a year, then started up again and 50% increase in dosage got it back to zero. Alright, sure. I'll give you that. I wrote a letter to Merck documenting my experience. They replied that they were looking for cures, not palliatives. I'm sure they are working on something , but like I said they'll only be able to arrest the damage that has been done. If you're full-on dementia, you'll still be demented but it won't get worse. Only possibility is to arrest it before it gets bad. Which it would be cool if they'd test people early-on before it gets bad, but we don't do that here (we can). Merck is working on everything under the sun. I've been to one of their bigger campuses - it's miles long. permalink parent award report block reply\nTPMJB 1 points 1 day ago The \"cure\" comment isn't from the paper -- it's from my personal experience as my mother's caregiver for 3 years. Sundowning went to zero for a year, then started up again and 50% increase in dosage got it back to zero. Alright, sure. I'll give you that. I wrote a letter to Merck documenting my experience. They replied that they were looking for cures, not palliatives. I'm sure they are working on something , but like I said they'll only be able to arrest the damage that has been done. If you're full-on dementia, you'll still be demented but it won't get worse. Only possibility is to arrest it before it gets bad. Which it would be cool if they'd test people early-on before it gets bad, but we don't do that here (we can). Merck is working on everything under the sun. I've been to one of their bigger campuses - it's miles long. permalink parent award report block reply\nRalphusthegreatus 6 points 2 days ago 56,000 years!! Harvard has enough money to fund this research for 56,000 years. permalink award report block reply\nDev404 6 points 2 days ago No medical research company wants to find the cure to anything, they want to find treatments to keep you sick and paying, forever. Our government is happy to help them with these ambitions with kickbacks, of course. permalink award report block reply\nTacitus1963 5 points 2 days ago How many years have millions if not billions been given to researchers to come up with all kinds of cancer cures? I've lost count.\nThere never will be a cure for cancer- at least not for us plebs- because it would make lots of people unemployed who depend on the cancer industry for their livelihoods. permalink award report block reply\nHyperCarbs 5 points 2 days ago Bullshit. More like she can't get funding. These academics are always assholes. permalink award report block reply Strzok 1 points 1 day ago Second clip in the video: \"For 50 years she has applied for, and won federal grants\" So we've been paying this partisan cunt for 50 years already and she wants to whine and bitch. She's basically a democratic senator. permalink parent award report block reply\nStrzok 1 points 1 day ago Second clip in the video: \"For 50 years she has applied for, and won federal grants\" So we've been paying this partisan cunt for 50 years already and she wants to whine and bitch. She's basically a democratic senator. permalink parent award report block reply\nTalledega 5 points 2 days ago \"...has the potential...\" is codeword for, \"This is what we want it to do, but have no idea how to get it there.\" permalink award report block reply\nSivispacem 4 points 2 days ago You can't turn a cure into a subscription plan. permalink award report block reply\n2016TrumpMAGA 4 points 2 days ago Some academic whose funding was cut claims their work had the potential to cure cancer? Wow, that never happens.  No way she would lie for money. permalink award report block reply\nvongregormench 4 points 2 days ago Does anyone believe that they cured cancer and they just need to spend a little bit more to finish? permalink award report block reply\nbluewhiteandred 4 points 2 days ago they don't have the cure edit: beyond what we already know permalink award report block reply\nFecklessgod 4 points 2 days ago So at a million dollars a year Harvard could fund this lady for 50,000 years with their endowments. permalink award report block reply\ngaijin_ronin 3 points 1 day ago \"Higher education\" is all shit. permalink award report block reply\nWrexxis780 3 points 2 days ago Curing disease is nowhere near as profitable as treating it over a lifetime permalink award report block reply\nMasterChief08 3 points 2 days ago She's probably studying how cancer affects black people more than white people and it's the fault of men. I don't trust any research permalink award report block reply\nThePatriotGames2016 3 points 2 days ago oh i'm sure they have a cure for all cancer. I'm also sure she is absolutely a piece of shit trying to get more money while also not releasing a cure for cancer. permalink award report block reply\nThebigone123 3 points 2 days ago You can't convince me that millionaires and billionaires already have cures for every known disease. They just won't share with the poors because they get so much money from treatment and not cures permalink award report block reply\nRocksCanOnlyWait 3 points 2 days ago It's another garbage 60 Minutes piece. She doesn't do anything that useful, but they can spin it to foment outrage about universities no longer being able to suckle the teet of government. Here's the real story: https://x.com/LocasaleLab/status/1987994762893254754 permalink award report block reply\nBeelzy 2 points 2 days ago SHE LIES!!! permalink award report block reply\nbtntx 2 points 2 days ago Harvard is probably protecting her. If this bitch went public with a verified cure pharma would immediately suicide her. permalink award report block reply\nbenjovikenobi 2 points 1 day ago Harvard hates women. permalink award report block reply\nJack_HinsonTN 2 points 2 days ago \"Has the potential\" doesn't equal \"has the cure.\" permalink award report block reply\nKoikatrose 2 points 1 day ago Ivermectin and fenbendozol or membendazol is a cure.\nWhy waste money on these \"resesrch\" projects?\nBreast cancer is a big money maker. I would never trust a vax of any kind. And mamograms....pfft. Thermal imaging is non toxic and more exact. But radiating breasts is more profitable and causes more cancer. Then there's biopsy s. That only spreads it. So medical industry....go to hell. University research....pffft. Money leeches. .... permalink award report block reply\nlearntocode 2 points 2 days ago they aint got sheeeeeit fuckin liars permalink award report block reply\nTrump737 2 points 1 day ago Potential means keep sending more money.\nThe whole cancer thing is the medical version of nasa. All a scam to funnel money elsewhere permalink award report block reply\nMeMargie 2 points 2 days ago Been given millions every year for decades for  cancer research, what are the results biotch? permalink award report block reply\nutfanx2 2 points 2 days ago If she cures cancer, would every taxpayer get royalties? permalink award report block reply\nKungPaoMcChicken 2 points 2 days ago \"has the potential\". So, its not a cure for cancer, yet... permalink award report block reply\nlul_cheto 2 points 2 days ago I make a mean egg salad, I also think it has the potential to cure breast cancer.. I demand 50m to release the recipie. Youre welcome. permalink award report block reply\nTacotuesday867 1 points 2 days ago Ahhh so its trump fault.  That math nerd Terrence too got recruited to bitch about trump at ucla as well permalink award report block reply\nFusionBlack 1 points 1 day ago But the Chinese students pay a great deal of money to them.... permalink award report block reply\nColonelKlink 1 points 2 days ago The potential? That means they just want more money and have no idea if it  works. permalink award report block reply\nTGNX 1 points 2 days ago I mean, if they wanted people to help them fund it, that would be one thing. Like \"our initial estimate is $10M, just match us dollar for dollar and we're good.\" Heck, even that much effort would be something. permalink award report block reply\nSeeker_17 1 points 2 days ago They will sure own the patents while the tax payers paid for it. permalink award report block reply\nWhoopies_tds 1 points 2 days ago Nearly word for word what I said last night while this Karen was crying on 60 minutes. No I am not Matt Walsh permalink award report block reply\nraptormissle 1 points 2 days ago Has the \"potential\". Yeah, so does Fanta. permalink award report block reply\nAbsurdOpinion 1 points 1 day ago Researcher claims being on the verge of a great discovery Demands tax payer funding Research goes no where Research has a new idea for a great discovery Demands tax payer funding Rinse and repeat -- This is what's known as a career scientist permalink award report block reply\nMhmm2MoreWeeks 1 points 2 days ago There is no reason to do anything for the poor because there is no Law and Order placed upon the Rich. That is what the ultra simple poor haters do not understand. The Rich can do whatever they like. Laws are no different for them then Jay Walking would be to you or me. permalink award report block reply\nkeeman 1 points 2 days ago Me banging on a rock has the potential to cure breast cancer.  Not a very good potential, but you cannot prove that it won't work.  So give me some money. permalink award report block reply\nbarwhack 1 points 2 days ago Harvard gives everyone A's. It'll cure cancer, about as fast as a million monky-years of protesting against human life on earth. permalink award report block reply\nMoose_Antlers 1 points 2 days ago She's wildly overstating what she has. This is the paper she published referring to this breakthrough: https://www.nature.com/articles/s41588-024-01988-0 She's saying that she found a fairly easily detectable pattern in BRCA1+ and BRCA2+ individuals that appears before some of the traditional mutations manifest. This is what's called a biomarker. You can build a test for these things and use the test to screen at-risk patients. The catch is that she's developed no actual test, nor has she done the clinical work to validate her method of screening in real patients. This is really important because we need to know if the test results mean anything. Do they predict that a person is going to develop the disease? If so, how often? If a person tests positive and half the time, nothing happens, it's a terrible test. That has to be studied. She's a long way out from that. She's doing hypothesis generating research and trying to act like she's on the verge of launching a meaningful screening test. Even then, that's not preventing breast cancer. That's early detection of something that's already there in patients where we already know are high risk. It's not nothing, but it's a hell of a lot less than this lady and the propagandist are trying to insinuate. permalink award report block reply\nLigersrule1 1 points 2 days ago Another RMNA \"vaccine\"?  No thanks. permalink award report block reply\nConfusedAngryArmed 1 points 22 hours ago If anything they will try to sell it to Sanofi or Novartis. permalink award report block reply\nboomerbutnotOKBoomer 1 points 2 days ago Ivermectin and Fenbenzadol permalink award report block reply\nyepyep 1 points 1 day ago Wait! Let’s invite a bunch of foreigners and let them steal it. permalink award report block reply\nPearlyGaits57 1 points 1 day ago Just more proof, gubment cares \"NADDA\" about it's citizenry. Can't make any \"MONEY\" with cures, only research. I have said for 40 years, they already have \"CURES\" for many ailments, but, cures = no more reasearch $$$$\" like everything, money is the ROOT of this \"EVIL\" permalink award report block reply\nobamagavemeaphone 1 points 2 days ago Breast cancer awareness 🎀 was what October was all about for decades. Then the globohomos pushed a giant scam in 2020 and suddenly there's no longer a need for Breast cancer awareness. permalink award report block reply\nCaptainTrouble 1 points 2 days ago This is called extortion and is illegal. Lock her up. permalink award report block reply\nObambi 1 points 2 days ago Im sure a berg is somehow involved in this permalink award report block reply\nChuj 1 points 1 day ago The research in question was likely DEI inspired. permalink award report block reply\nMichalusmichalus 1 points 1 day ago Harvard is on the list of schools that is both unofficially blacklisted, and officially blacklisted. Last year articles were saying guidance counselors were discouraging even applying because having a degree from that school would make the child unemployable. permalink award report block reply\nTheColonelsDaughter 1 points 1 day ago She looks way too much like Pocahontas for me to take her seriously. permalink award report block reply\nMcrumples 1 points 2 days ago Couldn't she take this to private investors then? Use the market - stop being a leech and demanding taxpayer money. The cure to breast cancer HAS to be an easy sell. What rich capitalist wouldn't want to steal this out from under Harvard and fund it themselves???? permalink award report block reply\nbratt 1 points 2 days ago Joan Brugge says her work has the potential to prevent breast cancer Anthony Fauci said covid vaccines would provide immunity and is safe and effective. permalink award report block reply\nDem_slayer 1 points 2 days ago \"Potential\" does not equal having. They're full of shit. permalink award report block reply\nRememberCharlieKirk 1 points 2 days ago \"potential\" More realistically, Joan Brugge's work would not lead to a greatly capable and widely applicable preventive care against breast cancer. Most likely outcome: Slight improvement, with a small number of actually suitable candidates permalink award report block reply\nJohnN 1 points 2 days ago This guy says she cites him more than she cites anyone else... and she's full of shit (paraphrasing). https://x.com/LocasaleLab/status/1987994762893254754 permalink award report block reply\nLirukDatan 1 points 2 days ago There are many different approaches to fight breast cancer. This particular type of cancer is well studied, so many different companies developed ways to tackle it. Whatever they had developed at Harvard must not be economically viable if they're just sitting on it. Also, fuck 'em just because. permalink award report block reply\nmikethemarine 1 points 2 days ago her work has the potential to prevent breast cancer What this really means is give us your gibbs, cause we MIGHT someday find something anything, but probably not permalink award report block reply\nDenturesNancy 1 points 1 day ago let me guess: she uses mRNA, that's the new recipe for treating all diseases.  I am sure she is a graduate of Fauci and Birx skool of Madacine permalink award report block reply\nLiberats 1 points 1 day ago She started work on cancer in the 60's and has been at Harvard since 1997.\nCancer research is a never ending money burner and researchers are the matches. https://www.aacr.org/professionals/membership/aacr-academy/fellows/joan-s-brugge-phd/ permalink award report block reply\nAmerica1stAndOnly 0 points 1 day ago But if breast cancer was cured, how would women complain about being victims? They'd have to find a whole new way and work even harder to ignore the cancers that effect men. permalink award report block reply",
  "fetched_at": "2025-11-12T20:05:38.277281Z"
}