{
  "id": "1ARK9oWNM4",
  "url": "https://patriots.win/p/1ARK9oWNM4/ireland-is-a-strange-country-\n\na/c",
  "content": "75 Ireland is a strange country. \n\nAfrican woman dodges deportation order, commits immigration and welfare fraud, receives a suspended sentence. \n\nDisabled Irish woman dragged from her house in her pyjamas, brought to court, for not having a TV license. posted 2 hours ago by IlhansBrother 7 comments award share report block MichaeloKeeffe @MickOKeeffe • 11h Ireland is a strange country. African woman dodges deportation order, commits immigration and welfare fraud, receives a suspended sentence. Disabled Irish woman dragged from her house in her pyjamas, brought to court, for not having a TV license.\n7 comments Sort by Top Top New Worst Old Save Greenhills 2 points 2 hours ago For the same reason they censored conservatives off social media and debanked them in the US permalink award report block reply PatriotSkorzeny 1 points 1 hour ago Enforced by whom. 😒 permalink award report block reply Nachos_and_cheese 0 points 2 hours ago The whole place, scottland, england and ireland are antiwhite shitholes. permalink award report block reply IlhansBrother OP 2 points 2 hours ago Learn from their mistakes or we’ll be them in a decade permalink parent award report block reply Nachos_and_cheese 1 points 2 hours ago canada is already there permalink parent award report block reply genericamerican69 -2 points 2 hours ago I know, this must be Israel's fault somehow. Fuck Ireland. Let them become mislim or African. Bunch of fuxking inbred hick faggot terrorists and nazi sympathizers. Only relevance is proximity to britain. Vermin. Fuck em permalink award report block reply MAG-n-KAG 4 points 2 hours ago it is their fault. https://www.youtube.com/watch?v=G45WthPTo24 permalink parent award report block reply\nGreenhills 2 points 2 hours ago For the same reason they censored conservatives off social media and debanked them in the US permalink award report block reply\nPatriotSkorzeny 1 points 1 hour ago Enforced by whom. 😒 permalink award report block reply\nNachos_and_cheese 0 points 2 hours ago The whole place, scottland, england and ireland are antiwhite shitholes. permalink award report block reply IlhansBrother OP 2 points 2 hours ago Learn from their mistakes or we’ll be them in a decade permalink parent award report block reply Nachos_and_cheese 1 points 2 hours ago canada is already there permalink parent award report block reply\nIlhansBrother OP 2 points 2 hours ago Learn from their mistakes or we’ll be them in a decade permalink parent award report block reply Nachos_and_cheese 1 points 2 hours ago canada is already there permalink parent award report block reply\nNachos_and_cheese 1 points 2 hours ago canada is already there permalink parent award report block reply\ngenericamerican69 -2 points 2 hours ago I know, this must be Israel's fault somehow. Fuck Ireland. Let them become mislim or African. Bunch of fuxking inbred hick faggot terrorists and nazi sympathizers. Only relevance is proximity to britain. Vermin. Fuck em permalink award report block reply MAG-n-KAG 4 points 2 hours ago it is their fault. https://www.youtube.com/watch?v=G45WthPTo24 permalink parent award report block reply\nMAG-n-KAG 4 points 2 hours ago it is their fault. https://www.youtube.com/watch?v=G45WthPTo24 permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:31:21.247249Z"
}