{
  "id": "1ARK9irE6J",
  "url": "https://patriots.win/p/1ARK9irE6J/immigrants-dont-come-to-america-/c",
  "content": "447 Immigrants don’t come to America to make our country great. They’re here to steal. That’s all. posted 2 days ago by PiratePatriotParrot 26 comments award share report block David Santa Carla 🦇 @TheOnlyDSC • 2d Immigrants don’t come to America to make our country great. They’re here to steal. That’s all.\n26 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Elchitodote 22 points 2 days ago Please, saaar! permalink award report block reply Johanes 10 points 2 days ago Do not redeem!!! permalink parent award report block reply MAGALADON9 5 points 2 days ago They do beg nicely, I mean they made an art of sounding meek and pathetic permalink parent award report block reply South_Florida_Guy 18 points 2 days ago I hate that accent so damn much permalink award report block reply TheBasedFriscoMan 6 points 2 days ago I hate the stench more permalink parent award report block reply Belleoffreedom 14 points 2 days ago Legal immigrants probably don't come to steal.  But stealing is grounds to cancel a visa or green card. permalink award report block reply MAGALADON9 7 points 2 days ago Weirdly they have THE highest median income in the usa permalink parent award report block reply 1ValhallaJack 12 points 2 days ago and rape and murder permalink award report block reply TrumpAndGodWin 4 points 2 days ago E.g. basically the origin of the word thug. permalink parent award report block reply YT45 10 points 2 days ago Trying to bribe an officer on top of whatever they already busted her for, eh?  At this point, I’m down for summarily executing any illegal arrested for anything beyond immigration charges.  And I’m real close to “shoot ‘em all and let God sort ’em out.” permalink award report block reply BlackJack1776 6 points 2 days ago See, that's exactly how it works. In India. A classic case of sticking to what you know. permalink parent award report block reply MAGALADON9 3 points 2 days ago She did say she is \"for god\" or whatever permalink parent award report block reply Covidrrhea 8 points 2 days ago Looks like she redeemed permalink award report block reply Freedomnuggs 6 points 2 days ago Quit trying to explain it and just arrest. I hate seeing them waste time trying to explain permalink award report block reply Smurfection 7 points 2 days ago They have to go through this sorry routine with every nonwhyte they encounter otherwise they'll be accused of racism and the lesbian dyke police chief will gladly add another good fine upstanding officer to her wall of scalps. permalink parent award report block reply nod32 5 points 2 days ago Bliss Saar, bliss!! permalink award report block reply Duke442games 3 points 2 days ago Chop her hand off. permalink award report block reply lifeisahologram 2 points 2 days ago How does this cop have so much patience? I would have lost my job as a cop and probably gotten arrested for violent assault after her 2nd sorry, definitely by the time she clasped her hands. permalink award report block reply America101 2 points 2 days ago Don't talk about it, arrest and deport. permalink award report block reply MAGALADON9 2 points 2 days ago Shit - when I get arrested for my conduct being not orderly or some shit on a Friday night I'm there all weekend eating baloney sandwiches permalink award report block reply TearsAficionado 2 points 2 days ago Look how scared these cops are to put hands on her. Use the ATM method. Ask, tell, make. Tired of this appeasement bullshit. Fuck her and all her criminal cockroach brethren. permalink award report block reply stillbringingitback 1 points 2 days ago Is there any context to this video?  All I see is this woman begging but I have no idea why she’s being arrested. permalink award report block reply PiratePatriotParrot OP 2 points 2 days ago Indian lady shoplifting at either Walmart or Target, promising to pay it back after it's too late. haha. permalink parent award report block reply stillbringingitback 1 points 2 days ago Oh okay, then I don’t feel bad for her at all lol. permalink parent award report block reply Justjayce 1 points 2 days ago Shits pants because she can't shit on the street permalink award report block reply\nElchitodote 22 points 2 days ago Please, saaar! permalink award report block reply Johanes 10 points 2 days ago Do not redeem!!! permalink parent award report block reply MAGALADON9 5 points 2 days ago They do beg nicely, I mean they made an art of sounding meek and pathetic permalink parent award report block reply\nJohanes 10 points 2 days ago Do not redeem!!! permalink parent award report block reply\nMAGALADON9 5 points 2 days ago They do beg nicely, I mean they made an art of sounding meek and pathetic permalink parent award report block reply\nSouth_Florida_Guy 18 points 2 days ago I hate that accent so damn much permalink award report block reply TheBasedFriscoMan 6 points 2 days ago I hate the stench more permalink parent award report block reply\nTheBasedFriscoMan 6 points 2 days ago I hate the stench more permalink parent award report block reply\nBelleoffreedom 14 points 2 days ago Legal immigrants probably don't come to steal.  But stealing is grounds to cancel a visa or green card. permalink award report block reply MAGALADON9 7 points 2 days ago Weirdly they have THE highest median income in the usa permalink parent award report block reply\nMAGALADON9 7 points 2 days ago Weirdly they have THE highest median income in the usa permalink parent award report block reply\n1ValhallaJack 12 points 2 days ago and rape and murder permalink award report block reply TrumpAndGodWin 4 points 2 days ago E.g. basically the origin of the word thug. permalink parent award report block reply\nTrumpAndGodWin 4 points 2 days ago E.g. basically the origin of the word thug. permalink parent award report block reply\nYT45 10 points 2 days ago Trying to bribe an officer on top of whatever they already busted her for, eh?  At this point, I’m down for summarily executing any illegal arrested for anything beyond immigration charges.  And I’m real close to “shoot ‘em all and let God sort ’em out.” permalink award report block reply BlackJack1776 6 points 2 days ago See, that's exactly how it works. In India. A classic case of sticking to what you know. permalink parent award report block reply MAGALADON9 3 points 2 days ago She did say she is \"for god\" or whatever permalink parent award report block reply\nBlackJack1776 6 points 2 days ago See, that's exactly how it works. In India. A classic case of sticking to what you know. permalink parent award report block reply\nMAGALADON9 3 points 2 days ago She did say she is \"for god\" or whatever permalink parent award report block reply\nCovidrrhea 8 points 2 days ago Looks like she redeemed permalink award report block reply\nFreedomnuggs 6 points 2 days ago Quit trying to explain it and just arrest. I hate seeing them waste time trying to explain permalink award report block reply Smurfection 7 points 2 days ago They have to go through this sorry routine with every nonwhyte they encounter otherwise they'll be accused of racism and the lesbian dyke police chief will gladly add another good fine upstanding officer to her wall of scalps. permalink parent award report block reply\nSmurfection 7 points 2 days ago They have to go through this sorry routine with every nonwhyte they encounter otherwise they'll be accused of racism and the lesbian dyke police chief will gladly add another good fine upstanding officer to her wall of scalps. permalink parent award report block reply\nnod32 5 points 2 days ago Bliss Saar, bliss!! permalink award report block reply\nDuke442games 3 points 2 days ago Chop her hand off. permalink award report block reply\nlifeisahologram 2 points 2 days ago How does this cop have so much patience? I would have lost my job as a cop and probably gotten arrested for violent assault after her 2nd sorry, definitely by the time she clasped her hands. permalink award report block reply\nAmerica101 2 points 2 days ago Don't talk about it, arrest and deport. permalink award report block reply\nMAGALADON9 2 points 2 days ago Shit - when I get arrested for my conduct being not orderly or some shit on a Friday night I'm there all weekend eating baloney sandwiches permalink award report block reply\nTearsAficionado 2 points 2 days ago Look how scared these cops are to put hands on her. Use the ATM method. Ask, tell, make. Tired of this appeasement bullshit. Fuck her and all her criminal cockroach brethren. permalink award report block reply\nstillbringingitback 1 points 2 days ago Is there any context to this video?  All I see is this woman begging but I have no idea why she’s being arrested. permalink award report block reply PiratePatriotParrot OP 2 points 2 days ago Indian lady shoplifting at either Walmart or Target, promising to pay it back after it's too late. haha. permalink parent award report block reply stillbringingitback 1 points 2 days ago Oh okay, then I don’t feel bad for her at all lol. permalink parent award report block reply\nPiratePatriotParrot OP 2 points 2 days ago Indian lady shoplifting at either Walmart or Target, promising to pay it back after it's too late. haha. permalink parent award report block reply stillbringingitback 1 points 2 days ago Oh okay, then I don’t feel bad for her at all lol. permalink parent award report block reply\nstillbringingitback 1 points 2 days ago Oh okay, then I don’t feel bad for her at all lol. permalink parent award report block reply\nJustjayce 1 points 2 days ago Shits pants because she can't shit on the street permalink award report block reply",
  "fetched_at": "2025-11-12T23:01:13.442932Z"
}