{
  "id": "1ARK58zX57",
  "url": "https://patriots.win/p/1ARK58zX57/every-single-word-about-obamacar/c",
  "content": "520 Every single word about Obamacare was a lie and he knew it. \nWhat a snake. posted 4 days ago by LightBeacons 18 comments award share report block C3 @C_3C_3 • 4d Every single word about Obamacare was a lie and he knew it. What a snake.\n18 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style reversethefraud 12 points 4 days ago everyone knew it. every one. permalink award report block reply C0drus 7 points 4 days ago We knew,…. Could’ve just asked us but NOOOOOO, we’re the unwashed ignorant peasants clinging to our guns and bibles 🙄 permalink parent award report block reply equiv222 10 points 4 days ago OH.. HE SAID YOU CAN KEEP YOUR DOCTOR.. DIDN'T MENTION YOUR DR. WASN'T GONNA KEEP YOU, BECAUSE THE BASE RATE FOR SERVUCES ARE MUCH HIGHER  UNDER THIS SOCIALIST PAY SCAM IS ONLY TO BENEFIT THE INSURANCE COMPANY. YOU CAN JUST PAY YOUR DR 300 BUCKS INSTEAD OF THE 89 BUCKS YOU WERE PAYING.NOW DRS DONY DOCTOR ANYMORE. EVEN THEY WILL BE REPLACED BY AI. permalink award report block reply josiborg 8 points 4 days ago We have to pass it to see what's in it permalink award report block reply MocksFordComma 8 points 4 days ago The insurance companies used him like a stupid tool that he is. permalink award report block reply Smurfection 2 points 4 days ago Remember when he said \"There's a lot of smart people working on this.  They're smarter than you.  They're smarter than me.  We got smart dedicated people working on this\".    He didn't.  It was a hodgepodge of left wing Democrat fantasies rolled into a huge Act that no one read because there were no smart people working on it.   Ted Kennedy, before he died, was one of the biggest backers of Obamacare.  He put a whole section into the Act that no one has even tried to implement because it would bankrupt the entire medical sector of the economy.  It's regarding a right to assisted living, nursing homes and in home care.   It's actually in the act, but no one has even attempted to implement even one part of it so far. permalink parent award report block reply Sparkywalnutz 5 points 4 days ago \"Grandma can't get a new hip, We'll just give her a pill for the pain.\"\n\"Oh, he's so charming! Isn't he great!\" permalink award report block reply Sodak 4 points 4 days ago I've never had health insurance never needed it. Can someone fill me in? You couldn't keep your plan? People were forced to join the new higher priced shittier Obama care plans or something? permalink award report block reply HanginChad 6 points 4 days ago Basically, a friend had a private plan that he liked. They discontinued it because of Obamacare so he had to get Obamacare then they jacked up the prices. permalink parent award report block reply okboomer59 3 points 4 days ago He was singing \"Mammy.\" Obomba was reading a script handed to him by insurance companies and Big Pharma. He was collecting a check. permalink award report block reply Smurfection 3 points 4 days ago Jonathan Gruber, one of the architects of Obamacare, saying that American people are stupid and that's what allowed them to get Obamacare passed.   Jonathan Gruber acknowledged that premiums would rise and deductibles would go higher. https://www.youtube.com/watch?v=AEjr9WchNkg permalink award report block reply keeman 2 points 3 days ago That's nice.  We have House, Senate, President, SCOTUS all R. And it is still in power.  Wake me when something useful happens. permalink award report block reply tholinz 2 points 4 days ago They said at the time it was unsustainable and about collapsing the health care system so that Americans would beg for government run everything and that they were depending on people being stupidly so they could get away with it. permalink award report block reply Moebius 2 points 4 days ago We all knew it... permalink award report block reply Shitsbrokeyo 1 points 3 days ago Jail. permalink award report block reply Znut55 1 points 4 days ago And those really good plans we once had (often provided by our employers) had a HUGE increase in their costs (often referred to as cadillac plans) and employers no longer could afford them for their employees and it all went downhill from there.  ALL A LIE!!!! permalink award report block reply 10MeV 1 points 4 days ago They were going to tax the companies providing those as “imputed income” to the employees fortunate enough to work for such places. So… my company CANCELLED that plan, charging me the same premium for the formerly “middle” tier plan. Great.  So the government got NO more money, and I lost my good health care plan.  Thanks a lot, Preezy BO, and the rest.   You rat bastards. permalink parent award report block reply Losferwords 1 points 3 days ago If you didn't know this when he mandated it, you weren't paying attention. permalink award report block reply\nreversethefraud 12 points 4 days ago everyone knew it. every one. permalink award report block reply C0drus 7 points 4 days ago We knew,…. Could’ve just asked us but NOOOOOO, we’re the unwashed ignorant peasants clinging to our guns and bibles 🙄 permalink parent award report block reply\nC0drus 7 points 4 days ago We knew,…. Could’ve just asked us but NOOOOOO, we’re the unwashed ignorant peasants clinging to our guns and bibles 🙄 permalink parent award report block reply\nequiv222 10 points 4 days ago OH.. HE SAID YOU CAN KEEP YOUR DOCTOR.. DIDN'T MENTION YOUR DR. WASN'T GONNA KEEP YOU, BECAUSE THE BASE RATE FOR SERVUCES ARE MUCH HIGHER  UNDER THIS SOCIALIST PAY SCAM IS ONLY TO BENEFIT THE INSURANCE COMPANY. YOU CAN JUST PAY YOUR DR 300 BUCKS INSTEAD OF THE 89 BUCKS YOU WERE PAYING.NOW DRS DONY DOCTOR ANYMORE. EVEN THEY WILL BE REPLACED BY AI. permalink award report block reply\njosiborg 8 points 4 days ago We have to pass it to see what's in it permalink award report block reply\nMocksFordComma 8 points 4 days ago The insurance companies used him like a stupid tool that he is. permalink award report block reply Smurfection 2 points 4 days ago Remember when he said \"There's a lot of smart people working on this.  They're smarter than you.  They're smarter than me.  We got smart dedicated people working on this\".    He didn't.  It was a hodgepodge of left wing Democrat fantasies rolled into a huge Act that no one read because there were no smart people working on it.   Ted Kennedy, before he died, was one of the biggest backers of Obamacare.  He put a whole section into the Act that no one has even tried to implement because it would bankrupt the entire medical sector of the economy.  It's regarding a right to assisted living, nursing homes and in home care.   It's actually in the act, but no one has even attempted to implement even one part of it so far. permalink parent award report block reply\nSmurfection 2 points 4 days ago Remember when he said \"There's a lot of smart people working on this.  They're smarter than you.  They're smarter than me.  We got smart dedicated people working on this\".    He didn't.  It was a hodgepodge of left wing Democrat fantasies rolled into a huge Act that no one read because there were no smart people working on it.   Ted Kennedy, before he died, was one of the biggest backers of Obamacare.  He put a whole section into the Act that no one has even tried to implement because it would bankrupt the entire medical sector of the economy.  It's regarding a right to assisted living, nursing homes and in home care.   It's actually in the act, but no one has even attempted to implement even one part of it so far. permalink parent award report block reply\nSparkywalnutz 5 points 4 days ago \"Grandma can't get a new hip, We'll just give her a pill for the pain.\"\n\"Oh, he's so charming! Isn't he great!\" permalink award report block reply\nSodak 4 points 4 days ago I've never had health insurance never needed it. Can someone fill me in? You couldn't keep your plan? People were forced to join the new higher priced shittier Obama care plans or something? permalink award report block reply HanginChad 6 points 4 days ago Basically, a friend had a private plan that he liked. They discontinued it because of Obamacare so he had to get Obamacare then they jacked up the prices. permalink parent award report block reply\nHanginChad 6 points 4 days ago Basically, a friend had a private plan that he liked. They discontinued it because of Obamacare so he had to get Obamacare then they jacked up the prices. permalink parent award report block reply\nokboomer59 3 points 4 days ago He was singing \"Mammy.\" Obomba was reading a script handed to him by insurance companies and Big Pharma. He was collecting a check. permalink award report block reply\nSmurfection 3 points 4 days ago Jonathan Gruber, one of the architects of Obamacare, saying that American people are stupid and that's what allowed them to get Obamacare passed.   Jonathan Gruber acknowledged that premiums would rise and deductibles would go higher. https://www.youtube.com/watch?v=AEjr9WchNkg permalink award report block reply\nkeeman 2 points 3 days ago That's nice.  We have House, Senate, President, SCOTUS all R. And it is still in power.  Wake me when something useful happens. permalink award report block reply\ntholinz 2 points 4 days ago They said at the time it was unsustainable and about collapsing the health care system so that Americans would beg for government run everything and that they were depending on people being stupidly so they could get away with it. permalink award report block reply\nMoebius 2 points 4 days ago We all knew it... permalink award report block reply\nShitsbrokeyo 1 points 3 days ago Jail. permalink award report block reply\nZnut55 1 points 4 days ago And those really good plans we once had (often provided by our employers) had a HUGE increase in their costs (often referred to as cadillac plans) and employers no longer could afford them for their employees and it all went downhill from there.  ALL A LIE!!!! permalink award report block reply 10MeV 1 points 4 days ago They were going to tax the companies providing those as “imputed income” to the employees fortunate enough to work for such places. So… my company CANCELLED that plan, charging me the same premium for the formerly “middle” tier plan. Great.  So the government got NO more money, and I lost my good health care plan.  Thanks a lot, Preezy BO, and the rest.   You rat bastards. permalink parent award report block reply\n10MeV 1 points 4 days ago They were going to tax the companies providing those as “imputed income” to the employees fortunate enough to work for such places. So… my company CANCELLED that plan, charging me the same premium for the formerly “middle” tier plan. Great.  So the government got NO more money, and I lost my good health care plan.  Thanks a lot, Preezy BO, and the rest.   You rat bastards. permalink parent award report block reply\nLosferwords 1 points 3 days ago If you didn't know this when he mandated it, you weren't paying attention. permalink award report block reply",
  "fetched_at": "2025-11-12T21:21:53.790491Z"
}