{
  "id": "8185765",
  "title": "152Zerohedge : OpenAI Ordered To Produce 20 Million User Conversations To NY Times(www.zerohedge.com",
  "url": "https://patriots.win/p/1ARK9nPdKP/zerohedge--openai-ordered-to-pro/c",
  "content": "161 Zerohedge : OpenAI Ordered To Produce 20 Million User Conversations To NY Times (www.zerohedge.com) posted 28 minutes ago by IlhansBrother 15 comments award share report block OpenAI Ordered To Produce 20 Million User Conversations To NY Times ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero www.zerohedge.com\n15 comments Sort by Top Top New Worst Old Save Vinnie 22 points 22 minutes ago Perfect. My conversations all include \"Fuck Joe Biden\" permalink award report block reply DeltaSierra 4 points 13 minutes ago “Fuck Joe Biden\" began during sporting events in early September 2021. On October 2, 2021, during a televised interview with the Sparks 300 race winner Brandon Brown at Talladega Superspeedway in Talladega, Alabama, NBC Sports reporter Kelli Stavast incorrectly described the chant in the background as \"Let's Go Brandon\", which sparked the meme. permalink parent award report block reply Ifeargovtmorethan 1 points 4 minutes ago with a heavy rotation of  \"fagot\" and \"retard\" permalink parent award report block reply Citizen_Bob 9 points 21 minutes ago open isn't open and they are not private. neither is X but they do anonymize for their own purposes. you have to dump your data from chat and then 30 days it expunges. or use private and it will expunge immediately. permalink award report block reply BlackJack1776 7 points 23 minutes ago As a retired dumfuck hick. How is this important? permalink award report block reply user2827 8 points 18 minutes ago People chat with these AIs as though it's a friend, an assistant, or the hypothetical that someone sent legal documents asking for advice or strategies... they do so on the presumption that it's secret. Others might have more detailed comments, but that they are giving up the chat logs should serve as a reminder that if they are chatting with an AI (unless locally hosted) that the conversation is saved to the cloud and can be retrieved. permalink parent award report block reply BlackJack1776 5 points 14 minutes ago It's mind boggling to me that people abdicate free will, problem solving and basic understanding of the world to a computer program under the control of the worst people on the planet. NPCs. permalink parent award report block reply IlhansBrother OP 6 points 14 minutes ago They will hand over your private conversations to Marxist activists permalink parent award report block reply MemeWarsVet 3 points 22 minutes ago It's not. permalink parent award report block reply BeauHD 2 points 16 minutes ago I don't trust Zero Hedge. They are out there to manipulate markets with \"insider info\" the trader bots ingest and trade on. permalink parent award report block reply Hikedelics 1 points 11 minutes ago TwoRetardsFighting.jpeg permalink parent award report block reply DemPanicAtTheDisco 5 points 24 minutes ago Dumb pin. It's about data scraping. permalink award report block reply basedboston 5 points 16 minutes ago New York Magistrate Judge Ona T. Wang .... No way. permalink award report block reply TheTelltaleFly 3 points 12 minutes ago Unrelated, I think we should definitely bring in more Chinese students. It’s going great so far. permalink parent award report block reply HeinzHummer 3 points 19 minutes ago I like to ask AI statistical questions that causes it to generate bullshit contextual summaries to discredit the real numbers. permalink award report block reply savman 2 points 8 minutes ago AI Agents are an extension of human coders.  If I read a NYT article, have a photographic memory, or use a screen reader and tell my friends what I read, how can this be considered any different? permalink award report block reply\nVinnie 22 points 22 minutes ago Perfect. My conversations all include \"Fuck Joe Biden\" permalink award report block reply DeltaSierra 4 points 13 minutes ago “Fuck Joe Biden\" began during sporting events in early September 2021. On October 2, 2021, during a televised interview with the Sparks 300 race winner Brandon Brown at Talladega Superspeedway in Talladega, Alabama, NBC Sports reporter Kelli Stavast incorrectly described the chant in the background as \"Let's Go Brandon\", which sparked the meme. permalink parent award report block reply Ifeargovtmorethan 1 points 4 minutes ago with a heavy rotation of  \"fagot\" and \"retard\" permalink parent award report block reply\nDeltaSierra 4 points 13 minutes ago “Fuck Joe Biden\" began during sporting events in early September 2021. On October 2, 2021, during a televised interview with the Sparks 300 race winner Brandon Brown at Talladega Superspeedway in Talladega, Alabama, NBC Sports reporter Kelli Stavast incorrectly described the chant in the background as \"Let's Go Brandon\", which sparked the meme. permalink parent award report block reply\nIfeargovtmorethan 1 points 4 minutes ago with a heavy rotation of  \"fagot\" and \"retard\" permalink parent award report block reply\nCitizen_Bob 9 points 21 minutes ago open isn't open and they are not private. neither is X but they do anonymize for their own purposes. you have to dump your data from chat and then 30 days it expunges. or use private and it will expunge immediately. permalink award report block reply\nBlackJack1776 7 points 23 minutes ago As a retired dumfuck hick. How is this important? permalink award report block reply user2827 8 points 18 minutes ago People chat with these AIs as though it's a friend, an assistant, or the hypothetical that someone sent legal documents asking for advice or strategies... they do so on the presumption that it's secret. Others might have more detailed comments, but that they are giving up the chat logs should serve as a reminder that if they are chatting with an AI (unless locally hosted) that the conversation is saved to the cloud and can be retrieved. permalink parent award report block reply BlackJack1776 5 points 14 minutes ago It's mind boggling to me that people abdicate free will, problem solving and basic understanding of the world to a computer program under the control of the worst people on the planet. NPCs. permalink parent award report block reply IlhansBrother OP 6 points 14 minutes ago They will hand over your private conversations to Marxist activists permalink parent award report block reply MemeWarsVet 3 points 22 minutes ago It's not. permalink parent award report block reply BeauHD 2 points 16 minutes ago I don't trust Zero Hedge. They are out there to manipulate markets with \"insider info\" the trader bots ingest and trade on. permalink parent award report block reply Hikedelics 1 points 11 minutes ago TwoRetardsFighting.jpeg permalink parent award report block reply\nuser2827 8 points 18 minutes ago People chat with these AIs as though it's a friend, an assistant, or the hypothetical that someone sent legal documents asking for advice or strategies... they do so on the presumption that it's secret. Others might have more detailed comments, but that they are giving up the chat logs should serve as a reminder that if they are chatting with an AI (unless locally hosted) that the conversation is saved to the cloud and can be retrieved. permalink parent award report block reply BlackJack1776 5 points 14 minutes ago It's mind boggling to me that people abdicate free will, problem solving and basic understanding of the world to a computer program under the control of the worst people on the planet. NPCs. permalink parent award report block reply\nBlackJack1776 5 points 14 minutes ago It's mind boggling to me that people abdicate free will, problem solving and basic understanding of the world to a computer program under the control of the worst people on the planet. NPCs. permalink parent award report block reply\nIlhansBrother OP 6 points 14 minutes ago They will hand over your private conversations to Marxist activists permalink parent award report block reply\nMemeWarsVet 3 points 22 minutes ago It's not. permalink parent award report block reply BeauHD 2 points 16 minutes ago I don't trust Zero Hedge. They are out there to manipulate markets with \"insider info\" the trader bots ingest and trade on. permalink parent award report block reply\nBeauHD 2 points 16 minutes ago I don't trust Zero Hedge. They are out there to manipulate markets with \"insider info\" the trader bots ingest and trade on. permalink parent award report block reply\nHikedelics 1 points 11 minutes ago TwoRetardsFighting.jpeg permalink parent award report block reply\nDemPanicAtTheDisco 5 points 24 minutes ago Dumb pin. It's about data scraping. permalink award report block reply\nbasedboston 5 points 16 minutes ago New York Magistrate Judge Ona T. Wang .... No way. permalink award report block reply TheTelltaleFly 3 points 12 minutes ago Unrelated, I think we should definitely bring in more Chinese students. It’s going great so far. permalink parent award report block reply\nTheTelltaleFly 3 points 12 minutes ago Unrelated, I think we should definitely bring in more Chinese students. It’s going great so far. permalink parent award report block reply\nHeinzHummer 3 points 19 minutes ago I like to ask AI statistical questions that causes it to generate bullshit contextual summaries to discredit the real numbers. permalink award report block reply\nsavman 2 points 8 minutes ago AI Agents are an extension of human coders.  If I read a NYT article, have a photographic memory, or use a screen reader and tell my friends what I read, how can this be considered any different? permalink award report block reply"
}