{
  "id": "1ARK56kO8K",
  "url": "https://patriots.win/p/1ARK56kO8K/when-you-have-beaten-the-entire-/c",
  "content": "695 When You Have Beaten The Entire Game GEOTUS posted 5 days ago by hecubus 12 comments award share download report block\n12 comments Sort by Top Top New Worst Old Save Around the Web 5 Parasite Causing Foods You Should Stop Eating Right Now Paratoxil SneakyWino 9 points 4 days ago I love my President. permalink award report block reply EastTexasMadLad 3 points 4 days ago Our guy is going to jail or worse if he doesn’t start getting shit done at home. No one is being held accountable.  We’re on a path to losing the midterms and that’s the end of the Republic permalink parent award report block reply KingMob 2 points 4 days ago The man can only do so much. It is up to us to fill the gap. He is not going to jail, and he is doing stuff at home, but his powers are limited by many laws, and he is not in prison now because he doesn't break those laws. If we lose in the midterms and the Republic is lost (and it won't be), it not because of him. permalink parent award report block reply Fakehistory2 6 points 4 days ago It's funny, I tell my kids \"He thought it would be cool to work at Mc. Donald's too\". permalink award report block reply Bullet3250 4 points 4 days ago Connecting to Americans is a real thing... Approximately 13.7% of American adults, or about 1 in 8, have worked at McDonald’s at some point in their lives, according to a survey conducted by the company. Approximately 87% of U.S. households have eaten at McDonald's at least once in the last 12 months, according to data from Numerator. permalink award report block reply ancroidubh 2 points 4 days ago Neither is true in my case. Full disclosure: I have had a few of their fries and a couple of soft drinks in over sixty years of passing by the arches. I do love our President (in a filial way). permalink parent award report block reply Agent_86 3 points 4 days ago Yep lol. I do that on City Of Heroes Homecoming all the time lol. permalink award report block reply Choppermagic 2 points 4 days ago nope, he was doing the side quest DURING his main quest.  Chad! permalink award report block reply QSWO1 2 points 4 days ago True. permalink award report block reply Constitution_1788 2 points 4 days ago Great analogy. Lolol permalink award report block reply 5DchessWatch 2 points 4 days ago Trump is living his best OP issekai permalink award report block reply PepesJusticeBoner 1 points 4 days ago Loved this moment during the campaign. But don't love it enough to eat McFood, that shit will kill you and mess up your digestion big time. Eat at your local mom n pop places instead and pay in cash in order to truly make America great! permalink award report block reply TrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nSneakyWino 9 points 4 days ago I love my President. permalink award report block reply EastTexasMadLad 3 points 4 days ago Our guy is going to jail or worse if he doesn’t start getting shit done at home. No one is being held accountable.  We’re on a path to losing the midterms and that’s the end of the Republic permalink parent award report block reply KingMob 2 points 4 days ago The man can only do so much. It is up to us to fill the gap. He is not going to jail, and he is doing stuff at home, but his powers are limited by many laws, and he is not in prison now because he doesn't break those laws. If we lose in the midterms and the Republic is lost (and it won't be), it not because of him. permalink parent award report block reply\nEastTexasMadLad 3 points 4 days ago Our guy is going to jail or worse if he doesn’t start getting shit done at home. No one is being held accountable.  We’re on a path to losing the midterms and that’s the end of the Republic permalink parent award report block reply KingMob 2 points 4 days ago The man can only do so much. It is up to us to fill the gap. He is not going to jail, and he is doing stuff at home, but his powers are limited by many laws, and he is not in prison now because he doesn't break those laws. If we lose in the midterms and the Republic is lost (and it won't be), it not because of him. permalink parent award report block reply\nKingMob 2 points 4 days ago The man can only do so much. It is up to us to fill the gap. He is not going to jail, and he is doing stuff at home, but his powers are limited by many laws, and he is not in prison now because he doesn't break those laws. If we lose in the midterms and the Republic is lost (and it won't be), it not because of him. permalink parent award report block reply\nFakehistory2 6 points 4 days ago It's funny, I tell my kids \"He thought it would be cool to work at Mc. Donald's too\". permalink award report block reply\nBullet3250 4 points 4 days ago Connecting to Americans is a real thing... Approximately 13.7% of American adults, or about 1 in 8, have worked at McDonald’s at some point in their lives, according to a survey conducted by the company. Approximately 87% of U.S. households have eaten at McDonald's at least once in the last 12 months, according to data from Numerator. permalink award report block reply ancroidubh 2 points 4 days ago Neither is true in my case. Full disclosure: I have had a few of their fries and a couple of soft drinks in over sixty years of passing by the arches. I do love our President (in a filial way). permalink parent award report block reply\nancroidubh 2 points 4 days ago Neither is true in my case. Full disclosure: I have had a few of their fries and a couple of soft drinks in over sixty years of passing by the arches. I do love our President (in a filial way). permalink parent award report block reply\nAgent_86 3 points 4 days ago Yep lol. I do that on City Of Heroes Homecoming all the time lol. permalink award report block reply\nChoppermagic 2 points 4 days ago nope, he was doing the side quest DURING his main quest.  Chad! permalink award report block reply\nQSWO1 2 points 4 days ago True. permalink award report block reply\nConstitution_1788 2 points 4 days ago Great analogy. Lolol permalink award report block reply\n5DchessWatch 2 points 4 days ago Trump is living his best OP issekai permalink award report block reply\nPepesJusticeBoner 1 points 4 days ago Loved this moment during the campaign. But don't love it enough to eat McFood, that shit will kill you and mess up your digestion big time. Eat at your local mom n pop places instead and pay in cash in order to truly make America great! permalink award report block reply\nTrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:16:25.575328Z"
}