{
  "id": "1ARK54Tb9w",
  "url": "https://patriots.win/p/1ARK54Tb9w/kek/c",
  "content": "579 kek posted 5 days ago by blockchain-the-vote 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save mygovisacommie 23 points 5 days ago Never apologize to leftists. They will never accept your apology, they will never accept you. All you do by apologizing to them is alienate your own party. Once you apologize to them, you are now the enemy of your own people, and you are still the enemy of the leftists. In summary: not apologizing = no change, apologizing = things are worse than before. permalink award report block reply VienneseSunrise 5 points 5 days ago They're bullies; whose entire raison d'être is to identify weakness in others in order to re-direct from their own crimes/inadequacies. Once they identify weakness, they will summon the mob to rend and tear the victim. The mob will be fed for a time. There are two winnable strategies when faced with this sort of attack (make no mistake -  it is an attack); all out assault (like Trump), or the shield of contempt (like Sydney). permalink parent award report block reply UCantStumpTheTrump 1 points 5 days ago Bingo. You gain nothing by playing along with their faulty logic. The only appropriate response is SHAME and RIDICULE, because it works! permalink parent award report block reply _M_A_G_A_ 13 points 5 days ago Only saw a short clip from that interview. Was the interviewer purposefully a charicature of an annoying liberal journalist trying to sound cool and relatable? permalink award report block reply MediaBro 3 points 5 days ago What interview is this? permalink parent award report block reply RuleoVicus 3 points 5 days ago Check yesterday's Posts, sorry don't have it readily available permalink parent award report block reply D__1 2 points 5 days ago Was that a chick? Damn, I thought that was Jerry Reed. I was waiting for him to grab his guitar and start singing. permalink parent award report block reply Trunks 4 points 5 days ago https://render.fineartamerica.com/images/rendered/default/greeting-card/images/artworkimages/medium/1/heath-ledger-the-joker-david-peninger.jpg?&targetx=0&targety=-98&imagewidth=700&imageheight=697&modelwidth=700&modelheight=500&backgroundcolor=D1CDAC&orientation=0 permalink award report block reply HaSumBro 3 points 5 days ago That bitch is hideous... And the camera angles were fucking weird as hell. Total shit show permalink award report block reply\nmygovisacommie 23 points 5 days ago Never apologize to leftists. They will never accept your apology, they will never accept you. All you do by apologizing to them is alienate your own party. Once you apologize to them, you are now the enemy of your own people, and you are still the enemy of the leftists. In summary: not apologizing = no change, apologizing = things are worse than before. permalink award report block reply VienneseSunrise 5 points 5 days ago They're bullies; whose entire raison d'être is to identify weakness in others in order to re-direct from their own crimes/inadequacies. Once they identify weakness, they will summon the mob to rend and tear the victim. The mob will be fed for a time. There are two winnable strategies when faced with this sort of attack (make no mistake -  it is an attack); all out assault (like Trump), or the shield of contempt (like Sydney). permalink parent award report block reply UCantStumpTheTrump 1 points 5 days ago Bingo. You gain nothing by playing along with their faulty logic. The only appropriate response is SHAME and RIDICULE, because it works! permalink parent award report block reply\nVienneseSunrise 5 points 5 days ago They're bullies; whose entire raison d'être is to identify weakness in others in order to re-direct from their own crimes/inadequacies. Once they identify weakness, they will summon the mob to rend and tear the victim. The mob will be fed for a time. There are two winnable strategies when faced with this sort of attack (make no mistake -  it is an attack); all out assault (like Trump), or the shield of contempt (like Sydney). permalink parent award report block reply\nUCantStumpTheTrump 1 points 5 days ago Bingo. You gain nothing by playing along with their faulty logic. The only appropriate response is SHAME and RIDICULE, because it works! permalink parent award report block reply\n_M_A_G_A_ 13 points 5 days ago Only saw a short clip from that interview. Was the interviewer purposefully a charicature of an annoying liberal journalist trying to sound cool and relatable? permalink award report block reply MediaBro 3 points 5 days ago What interview is this? permalink parent award report block reply RuleoVicus 3 points 5 days ago Check yesterday's Posts, sorry don't have it readily available permalink parent award report block reply D__1 2 points 5 days ago Was that a chick? Damn, I thought that was Jerry Reed. I was waiting for him to grab his guitar and start singing. permalink parent award report block reply\nMediaBro 3 points 5 days ago What interview is this? permalink parent award report block reply RuleoVicus 3 points 5 days ago Check yesterday's Posts, sorry don't have it readily available permalink parent award report block reply\nRuleoVicus 3 points 5 days ago Check yesterday's Posts, sorry don't have it readily available permalink parent award report block reply\nD__1 2 points 5 days ago Was that a chick? Damn, I thought that was Jerry Reed. I was waiting for him to grab his guitar and start singing. permalink parent award report block reply\nTrunks 4 points 5 days ago https://render.fineartamerica.com/images/rendered/default/greeting-card/images/artworkimages/medium/1/heath-ledger-the-joker-david-peninger.jpg?&targetx=0&targety=-98&imagewidth=700&imageheight=697&modelwidth=700&modelheight=500&backgroundcolor=D1CDAC&orientation=0 permalink award report block reply\nHaSumBro 3 points 5 days ago That bitch is hideous... And the camera angles were fucking weird as hell. Total shit show permalink award report block reply",
  "fetched_at": "2025-11-12T21:06:10.902560Z"
}