{
  "id": "1ARK9hi0Mo",
  "url": "https://patriots.win/p/1ARK9hi0Mo/well-well-well/c",
  "content": "681 Well well well. posted 3 days ago by wst4 53 comments award share download report block\n53 comments Sort by Top Top New Worst Old Save TiggerLovingPooh 29 points 2 days ago punchable face permalink award report block reply TheRedPike 20 points 2 days ago Built for tuna-diving. permalink parent award report block reply Brownwaterboys 1 points 2 days ago She's built for fisting. permalink parent award report block reply Thwok 3 points 2 days ago \"She\"?  You are being very generous. permalink parent award report block reply Standingoak 2 points 2 days ago Is that Booty-Gay with him ? permalink parent award report block reply MAGABOND 1 points 2 days ago Moon face. permalink parent award report block reply MADASHELLNEWS 16 points 2 days ago Alex Jones covered it Friday and Sunday permalink award report block reply MorningFrost 6 points 2 days ago Yeah, needs a bag over the head. I would cover it also. permalink parent award report block reply snoopy3210 1 points 2 days ago Arrest Baker and Kyle Seraphin for illegal domestic propaganda permalink parent award report block reply snoopy3210 -1 points 2 days ago Aaaaand it’s fake, not even the same body shape than the 2021 photos. Ah Alex permalink parent award report block reply Kaputtmacher 14 points 2 days ago There is something wrong with this bitch. She looks like a boy. permalink award report block reply BaldyGull 9 points 2 days ago Like a cross between Rulph Lundgren  and shrek. permalink parent award report block reply BaldyGull 4 points 2 days ago Elder Scrolls Morrowind character creator. That is the only place I have seen a face like that. permalink parent award report block reply brutustyberius 1 points 2 days ago Mike Johnson. Now you can’t unsee it. permalink parent award report block reply BaldyGull 1 points 2 days ago It is close. I think it is the small face on a chunky square head that is so off putting. permalink parent award report block reply Smurfection 3 points 2 days ago yeah, this looks like a transwoman trying to pass as a bulldyke.   It's hands are too big and for being that skinny in the legs and no waist at all. permalink parent award report block reply billybaldwin2 14 points 2 days ago Media silent, because no one bothered to post videos of her walking and the pipe bomber walking. Nor bothered to post videos demonstrating the GAIT confirmation. Pipe bomber was also carrying a bag and would be offset, making it that much more difficult to confirm. IDK dudes, doesn't feel real, but I'm sure the FBI is on it. Someone will just tell me they're in on it and this is totally 100% real and \"believe all posts.\" permalink award report block reply GontMawr 2 points 2 days ago I think you are onto something, i think it is Ukraines involvement in that day. They know what they had to lose if Trump found out. Just like all the lawfare against Trump, Black prosecutors...everytime. they use their 'useful idiots' to commit the most henious of crimes so that when they are discovered they can obfuscate. permalink parent award report block reply MAGABOND 1 points 2 days ago It’s definitely a female gait, I have no doubt about that. permalink parent award report block reply IAmRetard 12 points 2 days ago Dyke face permalink award report block reply OZJRant 8 points 2 days ago Retard.. permalink award report block reply Deplora 6 points 2 days ago No actual identification has been made.  A circle-jerk of clickbaiters claims an identification has been made. permalink award report block reply PatPede1 2 points 2 days ago So, six months from now there will be an \"actual identification\"? permalink parent award report block reply Deplora 3 points 2 days ago Maybe.  Maybe not.  Maybe sooner. People need to stop acting like it's some kind of virtue to believe every piece of narrative-affirming clickbait that passes in front of their eyes. permalink parent award report block reply Muttsbitetoo 4 points 2 days ago Tranny permalink award report block reply CaJuN-Polak 3 points 2 days ago \"That's a MAN, Baby.\"    (Poor Austin Powers imitation voice) permalink award report block reply brutustyberius 3 points 2 days ago You’re not a real boy! permalink award report block reply dumb-but-not-stupid 3 points 2 days ago Wtf is even that?!? permalink award report block reply DlanOdcammron 2 points 2 days ago That’s a man, baby! permalink award report block reply Alldayeveryday 2 points 2 days ago Dyke bitch permalink award report block reply HockeyMom4Trump 2 points 2 days ago Lesbian? permalink award report block reply cosmos411 2 points 2 days ago She looks like one of those troll dolls from the 80s permalink award report block reply GontMawr 2 points 2 days ago A face only a mother could lo.... LOL...who am i kidding, she disowned her. This is what happens to your face as an adult when you chew crayons as a kid. permalink award report block reply JamesBond007 2 points 2 days ago Dead Woman walking. They will cut ties. Pelosi liquidation list. She will join the rest of the capital police that committed “suicide”. If she had any sense she’d go straight to the Justice Department and turn State’s evidence and go into protective custody. But she won’t because she’s now CIA true believer permalink award report block reply Rakkasan91b 1 points 2 days ago Huh, that's funny you think the FBI isn't still filled with deep state leftist losers just because Trump is in office. permalink parent award report block reply Keep_on_winning_kag 2 points 2 days ago Whats with her head and skull shape? permalink award report block reply Liberalism_is_mental 2 points 2 days ago The fact they couldn't find her, tells us it was ordered by the deepstate.  The fact that a journalist was able to identify her, shows us DEI was their downfall. I think the deepstate cretins forgot you shouldn't smoke your own product. permalink award report block reply JesusisLordofAll777 2 points 2 days ago Given bonginos previous reporting of this story and his current occupation, I'm going to need to hear something from him soon.  Preferably this bomber is in custody squeeling and the j6 fedsurrection has imploded and 100's of 5am arrests are imminent. permalink award report block reply PhantomShield72 1 points 2 days ago Such stunning. Much brave. permalink award report block reply Psarg 1 points 2 days ago It could have been a female FBI agent and not this lady.  There's no 100% confirmation yet. permalink award report block reply HillarysBeaverMunch 1 points 2 days ago If this lady ever writes a tell-all book, there better be a section on scissoring, or I ain't buying it. permalink award report block reply AgnosticTemplar 1 points 2 days ago She looks like a character made in Oblivion... the Xbox 360 version. permalink award report block reply greatpumpkin 1 points 2 days ago 'She' should lay off the steroids for a while .... permalink award report block reply Formerlurker92 1 points 2 days ago That dude standing next to her looks like an extra from whoville permalink award report block reply Dev404 1 points 2 days ago If she did do it, I wouldn't be surprised. With the way most modern women behave, this would be right up their alley and the media protection only makes it more likely. permalink award report block reply Ritchie_Blackadder 1 points 2 days ago Final boss of the DNC FeM. Bison permalink award report block reply Yakhechos 1 points 2 days ago Bitch looks like a fugly default character Skyrim skin. permalink award report block reply NonbinaryPotatohead 1 points 2 days ago This is misleading clickbait garbage. There is no verifiable evidence yet. Also, AJ is a controlled op LOL permalink award report block reply hillaryforprison 1 points 2 days ago She did it as an FBI job. Is Kash going to do anything about this? permalink award report block reply FastnFurious 0 points 2 days ago Be careful about any shit that spews from Kyle Seraphin permalink award report block reply HoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nTiggerLovingPooh 29 points 2 days ago punchable face permalink award report block reply TheRedPike 20 points 2 days ago Built for tuna-diving. permalink parent award report block reply Brownwaterboys 1 points 2 days ago She's built for fisting. permalink parent award report block reply Thwok 3 points 2 days ago \"She\"?  You are being very generous. permalink parent award report block reply Standingoak 2 points 2 days ago Is that Booty-Gay with him ? permalink parent award report block reply MAGABOND 1 points 2 days ago Moon face. permalink parent award report block reply\nTheRedPike 20 points 2 days ago Built for tuna-diving. permalink parent award report block reply Brownwaterboys 1 points 2 days ago She's built for fisting. permalink parent award report block reply Thwok 3 points 2 days ago \"She\"?  You are being very generous. permalink parent award report block reply Standingoak 2 points 2 days ago Is that Booty-Gay with him ? permalink parent award report block reply\nBrownwaterboys 1 points 2 days ago She's built for fisting. permalink parent award report block reply Thwok 3 points 2 days ago \"She\"?  You are being very generous. permalink parent award report block reply Standingoak 2 points 2 days ago Is that Booty-Gay with him ? permalink parent award report block reply\nThwok 3 points 2 days ago \"She\"?  You are being very generous. permalink parent award report block reply Standingoak 2 points 2 days ago Is that Booty-Gay with him ? permalink parent award report block reply\nStandingoak 2 points 2 days ago Is that Booty-Gay with him ? permalink parent award report block reply\nMAGABOND 1 points 2 days ago Moon face. permalink parent award report block reply\nMADASHELLNEWS 16 points 2 days ago Alex Jones covered it Friday and Sunday permalink award report block reply MorningFrost 6 points 2 days ago Yeah, needs a bag over the head. I would cover it also. permalink parent award report block reply snoopy3210 1 points 2 days ago Arrest Baker and Kyle Seraphin for illegal domestic propaganda permalink parent award report block reply snoopy3210 -1 points 2 days ago Aaaaand it’s fake, not even the same body shape than the 2021 photos. Ah Alex permalink parent award report block reply\nMorningFrost 6 points 2 days ago Yeah, needs a bag over the head. I would cover it also. permalink parent award report block reply snoopy3210 1 points 2 days ago Arrest Baker and Kyle Seraphin for illegal domestic propaganda permalink parent award report block reply\nsnoopy3210 1 points 2 days ago Arrest Baker and Kyle Seraphin for illegal domestic propaganda permalink parent award report block reply\nsnoopy3210 -1 points 2 days ago Aaaaand it’s fake, not even the same body shape than the 2021 photos. Ah Alex permalink parent award report block reply\nKaputtmacher 14 points 2 days ago There is something wrong with this bitch. She looks like a boy. permalink award report block reply BaldyGull 9 points 2 days ago Like a cross between Rulph Lundgren  and shrek. permalink parent award report block reply BaldyGull 4 points 2 days ago Elder Scrolls Morrowind character creator. That is the only place I have seen a face like that. permalink parent award report block reply brutustyberius 1 points 2 days ago Mike Johnson. Now you can’t unsee it. permalink parent award report block reply BaldyGull 1 points 2 days ago It is close. I think it is the small face on a chunky square head that is so off putting. permalink parent award report block reply Smurfection 3 points 2 days ago yeah, this looks like a transwoman trying to pass as a bulldyke.   It's hands are too big and for being that skinny in the legs and no waist at all. permalink parent award report block reply\nBaldyGull 9 points 2 days ago Like a cross between Rulph Lundgren  and shrek. permalink parent award report block reply BaldyGull 4 points 2 days ago Elder Scrolls Morrowind character creator. That is the only place I have seen a face like that. permalink parent award report block reply brutustyberius 1 points 2 days ago Mike Johnson. Now you can’t unsee it. permalink parent award report block reply BaldyGull 1 points 2 days ago It is close. I think it is the small face on a chunky square head that is so off putting. permalink parent award report block reply\nBaldyGull 4 points 2 days ago Elder Scrolls Morrowind character creator. That is the only place I have seen a face like that. permalink parent award report block reply brutustyberius 1 points 2 days ago Mike Johnson. Now you can’t unsee it. permalink parent award report block reply BaldyGull 1 points 2 days ago It is close. I think it is the small face on a chunky square head that is so off putting. permalink parent award report block reply\nbrutustyberius 1 points 2 days ago Mike Johnson. Now you can’t unsee it. permalink parent award report block reply BaldyGull 1 points 2 days ago It is close. I think it is the small face on a chunky square head that is so off putting. permalink parent award report block reply\nBaldyGull 1 points 2 days ago It is close. I think it is the small face on a chunky square head that is so off putting. permalink parent award report block reply\nSmurfection 3 points 2 days ago yeah, this looks like a transwoman trying to pass as a bulldyke.   It's hands are too big and for being that skinny in the legs and no waist at all. permalink parent award report block reply\nbillybaldwin2 14 points 2 days ago Media silent, because no one bothered to post videos of her walking and the pipe bomber walking. Nor bothered to post videos demonstrating the GAIT confirmation. Pipe bomber was also carrying a bag and would be offset, making it that much more difficult to confirm. IDK dudes, doesn't feel real, but I'm sure the FBI is on it. Someone will just tell me they're in on it and this is totally 100% real and \"believe all posts.\" permalink award report block reply GontMawr 2 points 2 days ago I think you are onto something, i think it is Ukraines involvement in that day. They know what they had to lose if Trump found out. Just like all the lawfare against Trump, Black prosecutors...everytime. they use their 'useful idiots' to commit the most henious of crimes so that when they are discovered they can obfuscate. permalink parent award report block reply MAGABOND 1 points 2 days ago It’s definitely a female gait, I have no doubt about that. permalink parent award report block reply\nGontMawr 2 points 2 days ago I think you are onto something, i think it is Ukraines involvement in that day. They know what they had to lose if Trump found out. Just like all the lawfare against Trump, Black prosecutors...everytime. they use their 'useful idiots' to commit the most henious of crimes so that when they are discovered they can obfuscate. permalink parent award report block reply\nMAGABOND 1 points 2 days ago It’s definitely a female gait, I have no doubt about that. permalink parent award report block reply\nIAmRetard 12 points 2 days ago Dyke face permalink award report block reply\nOZJRant 8 points 2 days ago Retard.. permalink award report block reply\nDeplora 6 points 2 days ago No actual identification has been made.  A circle-jerk of clickbaiters claims an identification has been made. permalink award report block reply PatPede1 2 points 2 days ago So, six months from now there will be an \"actual identification\"? permalink parent award report block reply Deplora 3 points 2 days ago Maybe.  Maybe not.  Maybe sooner. People need to stop acting like it's some kind of virtue to believe every piece of narrative-affirming clickbait that passes in front of their eyes. permalink parent award report block reply\nPatPede1 2 points 2 days ago So, six months from now there will be an \"actual identification\"? permalink parent award report block reply Deplora 3 points 2 days ago Maybe.  Maybe not.  Maybe sooner. People need to stop acting like it's some kind of virtue to believe every piece of narrative-affirming clickbait that passes in front of their eyes. permalink parent award report block reply\nDeplora 3 points 2 days ago Maybe.  Maybe not.  Maybe sooner. People need to stop acting like it's some kind of virtue to believe every piece of narrative-affirming clickbait that passes in front of their eyes. permalink parent award report block reply\nMuttsbitetoo 4 points 2 days ago Tranny permalink award report block reply\nCaJuN-Polak 3 points 2 days ago \"That's a MAN, Baby.\"    (Poor Austin Powers imitation voice) permalink award report block reply\nbrutustyberius 3 points 2 days ago You’re not a real boy! permalink award report block reply\ndumb-but-not-stupid 3 points 2 days ago Wtf is even that?!? permalink award report block reply\nDlanOdcammron 2 points 2 days ago That’s a man, baby! permalink award report block reply\nAlldayeveryday 2 points 2 days ago Dyke bitch permalink award report block reply\nHockeyMom4Trump 2 points 2 days ago Lesbian? permalink award report block reply\ncosmos411 2 points 2 days ago She looks like one of those troll dolls from the 80s permalink award report block reply\nGontMawr 2 points 2 days ago A face only a mother could lo.... LOL...who am i kidding, she disowned her. This is what happens to your face as an adult when you chew crayons as a kid. permalink award report block reply\nJamesBond007 2 points 2 days ago Dead Woman walking. They will cut ties. Pelosi liquidation list. She will join the rest of the capital police that committed “suicide”. If she had any sense she’d go straight to the Justice Department and turn State’s evidence and go into protective custody. But she won’t because she’s now CIA true believer permalink award report block reply Rakkasan91b 1 points 2 days ago Huh, that's funny you think the FBI isn't still filled with deep state leftist losers just because Trump is in office. permalink parent award report block reply\nRakkasan91b 1 points 2 days ago Huh, that's funny you think the FBI isn't still filled with deep state leftist losers just because Trump is in office. permalink parent award report block reply\nKeep_on_winning_kag 2 points 2 days ago Whats with her head and skull shape? permalink award report block reply\nLiberalism_is_mental 2 points 2 days ago The fact they couldn't find her, tells us it was ordered by the deepstate.  The fact that a journalist was able to identify her, shows us DEI was their downfall. I think the deepstate cretins forgot you shouldn't smoke your own product. permalink award report block reply\nJesusisLordofAll777 2 points 2 days ago Given bonginos previous reporting of this story and his current occupation, I'm going to need to hear something from him soon.  Preferably this bomber is in custody squeeling and the j6 fedsurrection has imploded and 100's of 5am arrests are imminent. permalink award report block reply\nPhantomShield72 1 points 2 days ago Such stunning. Much brave. permalink award report block reply\nPsarg 1 points 2 days ago It could have been a female FBI agent and not this lady.  There's no 100% confirmation yet. permalink award report block reply\nHillarysBeaverMunch 1 points 2 days ago If this lady ever writes a tell-all book, there better be a section on scissoring, or I ain't buying it. permalink award report block reply\nAgnosticTemplar 1 points 2 days ago She looks like a character made in Oblivion... the Xbox 360 version. permalink award report block reply\ngreatpumpkin 1 points 2 days ago 'She' should lay off the steroids for a while .... permalink award report block reply\nFormerlurker92 1 points 2 days ago That dude standing next to her looks like an extra from whoville permalink award report block reply\nDev404 1 points 2 days ago If she did do it, I wouldn't be surprised. With the way most modern women behave, this would be right up their alley and the media protection only makes it more likely. permalink award report block reply\nRitchie_Blackadder 1 points 2 days ago Final boss of the DNC FeM. Bison permalink award report block reply\nYakhechos 1 points 2 days ago Bitch looks like a fugly default character Skyrim skin. permalink award report block reply\nNonbinaryPotatohead 1 points 2 days ago This is misleading clickbait garbage. There is no verifiable evidence yet. Also, AJ is a controlled op LOL permalink award report block reply\nhillaryforprison 1 points 2 days ago She did it as an FBI job. Is Kash going to do anything about this? permalink award report block reply\nFastnFurious 0 points 2 days ago Be careful about any shit that spews from Kyle Seraphin permalink award report block reply\nHoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:09:40.152646Z"
}