{
  "id": "1ARK56kfBL",
  "url": "https://patriots.win/p/1ARK56kfBL/this-is-like-watching-someone-wh/c",
  "content": "531 This is like watching someone who has been stuck in a coma since 2020 confront someone in 2025. posted 4 days ago by Taraa 64 comments award share report block Kyle Tibbitts @KyleTibbitts • 6d This is like watching someone who has been stuck in a coma since 2020 confront someone in 2025.\n64 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Jack_NC 44 points 4 days ago Hello ugly woman. How about a nice cup of STFU? Your opinions are disregarded. Feminism was established so as to allow unattractive women access to the mainstream of society. -- Rush Limbaugh permalink award report block reply Bullet3250 27 points 4 days ago Rush is right of course... But the ROOT of Modern Feminism is from Cultural Marxism... to cause FIGHTING between Men and Women... and it worked - very very well. permalink parent award report block reply snoopy3210 12 points 4 days ago Why don’t you talk about the Ad, that never mentions race at all and this lying propagandist at GQ made it about race? permalink parent award report block reply Bullet3250 10 points 4 days ago MODERN RACE WARS ARE ALSO based almost entirely in Cultural Marxism... Here is a 12 minute video that explains it ALL - extremely well What and Where Cultural Marxism comes from.  And why it is so successful... rhttps://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply Transparency 2 points 4 days ago https://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply staroframphansbhole 3 points 4 days ago And what’s the tribal origin of Marxism? permalink parent award report block reply Coin-Op 1 points 4 days ago I think that's called collectivism. permalink parent award report block reply staroframphansbhole 2 points 4 days ago I mean the tribe of Marx permalink parent award report block reply Bboop 3 points 4 days ago Yes that! And to destroy families, to make women dependent on the government instead of me, to loop the government In to schooling and daycare. And to kneecap good men by turning stupid women against them permalink parent award report block reply Emodius 2 points 4 days ago Rush was always right permalink parent award report block reply twentytwentyfourr 17 points 4 days ago feminism was established as a trojan horse to the west. the women are the most gullible and susceptible of the household. permalink parent award report block reply highenergywinning 10 points 4 days ago “It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers−out of unorthodoxy.” -George Orwell permalink parent award report block reply Covfefebrulee 4 points 4 days ago My mom totally fell for it. I somehow, instinctively stayed female. lol. permalink parent award report block reply nemonster 1 points 4 days ago Here come masculinism. permalink parent award report block reply mikethemarine 1 points 4 days ago I saw this as a very nice way of saying FUCK OFF WITH YOUR GOT YOU MOMENT permalink parent award report block reply 202_ 25 points 4 days ago The way she says \"specifically\" makes me wanna punch her. What an insufferable cunt. permalink award report block reply snoopy3210 17 points 4 days ago And she’s specifically wrong. The ad is not about race superiority at all. It’s about genetics of beauty. Ugly white women don’t have her good genes. That’s it. permalink parent award report block reply HawkDriverMN 8 points 4 days ago Or it was just an ad for a pair of pants. permalink parent award report block reply BrewSwillis 5 points 4 days ago But it was also a joke about how this specific girl was passed down the 'skinny with big tits' genes (jeans). It's not about race. Black and Latina women can have good genes too. You could say that Salma Hayek has good genes. What's it's not saying, is that every women is equally the same, as far as looks and body type....... which is really why feminazis are mad. permalink parent award report block reply HawkDriverMN 3 points 4 days ago I get the double entendres - but in the ancient days ads for pants had hot chicks and no one batted an eye. Sweeney’s response to the femi-hag was perfect. permalink parent award report block reply clownworld30330 3 points 4 days ago What about the up-talking though? permalink parent award report block reply nemonster 1 points 4 days ago Feel same just looking at her permalink parent award report block reply deleted 15 points 4 days ago Tulkas71 8 points 4 days ago She ruined Dune with her permanent resting bitch face permalink parent award report block reply MAGANatsFan 3 points 4 days ago Original Dune movie better than the remake. Fight me! permalink parent award report block reply Reefay 4 points 4 days ago I haven't seen the latest, but original dune was terrible.  so if original was better I'm definitely not wasting my time permalink parent award report block reply Tulkas71 1 points 4 days ago Agreed,  when I was a kid, my mom had this blood disease so we went across country to Mayo Clinic. So I spent a lot of time in the motel room watching HBO, (this was in the early 80's) I probably watched the Lynch Dune I don't know how many times while We were there. So it has a special place for me. permalink parent award report block reply SpinInGrave1776 1 points 4 days ago Clunky but unforgettable vs. Perfectly executed vanilla paste. permalink parent award report block reply Powhattan 8 points 4 days ago Did the dumb one just say that white people are genetically superior? permalink award report block reply clownworld30330 5 points 4 days ago Oh my word, she kinda did. permalink parent award report block reply f_bastiat 4 points 4 days ago Finally they have accepted reality. permalink parent award report block reply JoeBidensDementia1 7 points 4 days ago Was it Ricky Gervais who said during the Oscars that it's the Left who only allows a certain number of Blacks to rise to the top? permalink award report block reply HockeyMom4Trump 7 points 4 days ago What a horrible interview. Sydney Sweeney is next level compared to that “journalist” My son is single. I would love him to bring home Sydney. She’s a hardworking woman with common sense. permalink award report block reply lixa 1 points 4 days ago Apparently she's also an attention whore. Encourage your son to find a woman who doesn't need to show up to a sit down dinner black tie event naked and he probably will be happier for it. permalink parent award report block reply Coin-Op 4 points 4 days ago Good comment. Thank God not everyone on this site is a beta simp. permalink parent award report block reply lixa 6 points 4 days ago Thanks. In all honesty I am a woman- but I'm happy to admit when another woman is beautiful or has an amazing body (she certainly does and so do I lol), but I think women should value themselves and present themselves with decency in the public eye. Hypocrites here downvote me while they claim to want a godly woman.  🤷🏼‍♀️ permalink parent award report block reply LiveFreeInXorDie 3 points 4 days ago You're entirely correct. To me, Sweeney isn't far from being a prostitute. She seems to be a decent person, a saint by Hollywood standards, but no matter how based a prostitute may be, she's still a whore. No self-respecting man should settle for an active, unrepentant whore. Unfortunately, 99.9% (i.e., 1/1000 odds) of women in America seem to be, at minimum, whore-adjacent, if not in promiscuity than in general unsuitablity for marriage. The more women I meet, the more I come to understand the last few verses of Ecclesiastes 7. permalink parent award report block reply overblod 6 points 4 days ago That jawline... Man... permalink award report block reply clownworld30330 5 points 4 days ago Look at the interviewers forehead: full of frowning lines. Look at Sweeney’s forehead: no frowning lines at all!! And Sweeney has deep, pronounced laugh lines. Sweeney lives her best life every day. The interviewer is a miserable, deeply unhappy person. permalink award report block reply Hikedelics 5 points 4 days ago Trump showed everyone the way to handle this shit 10 years ago. Glad people are finally starting to catch on. permalink award report block reply SenorTrumper 4 points 4 days ago What a slimy creature that woman is. permalink award report block reply Beat_to_Quarters 4 points 4 days ago It's like watching the scene in the wolf of Wall Street where Jordan and the Swiss banker are talking to each other, and then their voice overs in their head of what they really are talking about are talking to each other. Voice over: what I'm asking, you Swiss dick, is are you going to fuck me over. Voice over: I understand perfectly, you American shit. permalink award report block reply clownworld30330 3 points 4 days ago can you ask me again without up-talking? I can’t take you seriously if you up-talk Idk, might have said something like that. Sweeney handled it perfectly. permalink award report block reply QSWO1 3 points 4 days ago Ugly chick, or tranny? permalink award report block reply clownworld30330 5 points 4 days ago Congrats to her on her transition! permalink parent award report block reply Choppermagic 3 points 4 days ago \"white people shouldn't\"... one of the most racist things you can say. And what shouldn't black people say\nbrown? permalink award report block reply SpellingContable 2 points 4 days ago Specifically, everyone who criticized the ad were using their systematic racism, their fuglibias, and straightaphobia. Such Bigoted Pogs permalink award report block reply Steve56775 2 points 4 days ago Why do libtards end every statement like a question? It’s really irritating. permalink award report block reply Jack_NC 1 points 3 days ago serious answer: because they are cowards and are looking for group consensus before expressing an opinion that could possibly violate the agreed narrative. In the liberal world,  agreement with the tribe is more important than factuality. permalink parent award report block reply Psalm-118_24 2 points 4 days ago Sweeney showing her \"white people \" intellectual superiority. 😁 permalink award report block reply Coin-Op 2 points 4 days ago Unpopular opinion: Sydney is just another glorified 304. One of the many hollyweird \"it\" girls that have had their 15 minutes of fame. Conservatives need to STOP with the beta simping. It's disappointing. permalink award report block reply Emodius 1 points 4 days ago What's a 304 permalink parent award report block reply LiveFreeInXorDie 3 points 4 days ago My guess is it's calculator code for \"hoe\". permalink parent award report block reply Coin-Op 1 points 3 days ago Winner, winner, chicken dinner! permalink parent award report block reply Coin-Op 1 points 3 days ago It's a euphemism for 'hoe'. Just type in '304' into a calculator, turn it upside down, and the spelling will set you free. permalink parent award report block reply LiveFreeInXorDie 1 points 4 days ago Yeah, she is. As I just replied to someone else, I don't care how based a prostitute is, I'm not going to put a ring on her or advocate anyone else to, and while Sweeney isn't literally a prostitute and by all accounts seems to be a decent person, she's happy to enable men to get their rocks off to her, i.e. mentally commit adultery. Not exactly a good role model for girls. I still respect her, but I'm sick of people simping for her just because she's not evil in Hollywood. permalink parent award report block reply TRexScrotum 1 points 4 days ago “Mentally commit adultery…” Are you fucking serious? So you walk around every day without looking at anyone else? How do you operate a motor vehicle? You’re skirting shariah. That’s an asinine statement you made. permalink parent award report block reply LiveFreeInXorDie 1 points 3 days ago \"But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart.\"  Matthew 5:28 I challenege any man to 100% honestly tell me that they can look at a nude pretty girl without getting lustful (therefore, adulterous) thoughts in their head. That's not sharia by the way, dipshit, that's just what Jesus taught. permalink parent award report block reply TRexScrotum 1 points 3 days ago Oh, with LUSTFUL intent. I thought you meant in general. I was sitting here thinking… how is that even a thing? My bad! permalink parent award report block reply view 2 more comments...\nJack_NC 44 points 4 days ago Hello ugly woman. How about a nice cup of STFU? Your opinions are disregarded. Feminism was established so as to allow unattractive women access to the mainstream of society. -- Rush Limbaugh permalink award report block reply Bullet3250 27 points 4 days ago Rush is right of course... But the ROOT of Modern Feminism is from Cultural Marxism... to cause FIGHTING between Men and Women... and it worked - very very well. permalink parent award report block reply snoopy3210 12 points 4 days ago Why don’t you talk about the Ad, that never mentions race at all and this lying propagandist at GQ made it about race? permalink parent award report block reply Bullet3250 10 points 4 days ago MODERN RACE WARS ARE ALSO based almost entirely in Cultural Marxism... Here is a 12 minute video that explains it ALL - extremely well What and Where Cultural Marxism comes from.  And why it is so successful... rhttps://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply Transparency 2 points 4 days ago https://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply staroframphansbhole 3 points 4 days ago And what’s the tribal origin of Marxism? permalink parent award report block reply Coin-Op 1 points 4 days ago I think that's called collectivism. permalink parent award report block reply staroframphansbhole 2 points 4 days ago I mean the tribe of Marx permalink parent award report block reply Bboop 3 points 4 days ago Yes that! And to destroy families, to make women dependent on the government instead of me, to loop the government In to schooling and daycare. And to kneecap good men by turning stupid women against them permalink parent award report block reply Emodius 2 points 4 days ago Rush was always right permalink parent award report block reply twentytwentyfourr 17 points 4 days ago feminism was established as a trojan horse to the west. the women are the most gullible and susceptible of the household. permalink parent award report block reply highenergywinning 10 points 4 days ago “It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers−out of unorthodoxy.” -George Orwell permalink parent award report block reply Covfefebrulee 4 points 4 days ago My mom totally fell for it. I somehow, instinctively stayed female. lol. permalink parent award report block reply nemonster 1 points 4 days ago Here come masculinism. permalink parent award report block reply mikethemarine 1 points 4 days ago I saw this as a very nice way of saying FUCK OFF WITH YOUR GOT YOU MOMENT permalink parent award report block reply\nBullet3250 27 points 4 days ago Rush is right of course... But the ROOT of Modern Feminism is from Cultural Marxism... to cause FIGHTING between Men and Women... and it worked - very very well. permalink parent award report block reply snoopy3210 12 points 4 days ago Why don’t you talk about the Ad, that never mentions race at all and this lying propagandist at GQ made it about race? permalink parent award report block reply Bullet3250 10 points 4 days ago MODERN RACE WARS ARE ALSO based almost entirely in Cultural Marxism... Here is a 12 minute video that explains it ALL - extremely well What and Where Cultural Marxism comes from.  And why it is so successful... rhttps://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply Transparency 2 points 4 days ago https://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply staroframphansbhole 3 points 4 days ago And what’s the tribal origin of Marxism? permalink parent award report block reply Coin-Op 1 points 4 days ago I think that's called collectivism. permalink parent award report block reply staroframphansbhole 2 points 4 days ago I mean the tribe of Marx permalink parent award report block reply Bboop 3 points 4 days ago Yes that! And to destroy families, to make women dependent on the government instead of me, to loop the government In to schooling and daycare. And to kneecap good men by turning stupid women against them permalink parent award report block reply Emodius 2 points 4 days ago Rush was always right permalink parent award report block reply\nsnoopy3210 12 points 4 days ago Why don’t you talk about the Ad, that never mentions race at all and this lying propagandist at GQ made it about race? permalink parent award report block reply Bullet3250 10 points 4 days ago MODERN RACE WARS ARE ALSO based almost entirely in Cultural Marxism... Here is a 12 minute video that explains it ALL - extremely well What and Where Cultural Marxism comes from.  And why it is so successful... rhttps://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply Transparency 2 points 4 days ago https://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply\nBullet3250 10 points 4 days ago MODERN RACE WARS ARE ALSO based almost entirely in Cultural Marxism... Here is a 12 minute video that explains it ALL - extremely well What and Where Cultural Marxism comes from.  And why it is so successful... rhttps://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply Transparency 2 points 4 days ago https://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply\nTransparency 2 points 4 days ago https://www.dailymotion.com/video/x2nsbl5 permalink parent award report block reply\nstaroframphansbhole 3 points 4 days ago And what’s the tribal origin of Marxism? permalink parent award report block reply Coin-Op 1 points 4 days ago I think that's called collectivism. permalink parent award report block reply staroframphansbhole 2 points 4 days ago I mean the tribe of Marx permalink parent award report block reply\nCoin-Op 1 points 4 days ago I think that's called collectivism. permalink parent award report block reply staroframphansbhole 2 points 4 days ago I mean the tribe of Marx permalink parent award report block reply\nstaroframphansbhole 2 points 4 days ago I mean the tribe of Marx permalink parent award report block reply\nBboop 3 points 4 days ago Yes that! And to destroy families, to make women dependent on the government instead of me, to loop the government In to schooling and daycare. And to kneecap good men by turning stupid women against them permalink parent award report block reply\nEmodius 2 points 4 days ago Rush was always right permalink parent award report block reply\ntwentytwentyfourr 17 points 4 days ago feminism was established as a trojan horse to the west. the women are the most gullible and susceptible of the household. permalink parent award report block reply highenergywinning 10 points 4 days ago “It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers−out of unorthodoxy.” -George Orwell permalink parent award report block reply Covfefebrulee 4 points 4 days ago My mom totally fell for it. I somehow, instinctively stayed female. lol. permalink parent award report block reply nemonster 1 points 4 days ago Here come masculinism. permalink parent award report block reply\nhighenergywinning 10 points 4 days ago “It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers−out of unorthodoxy.” -George Orwell permalink parent award report block reply\nCovfefebrulee 4 points 4 days ago My mom totally fell for it. I somehow, instinctively stayed female. lol. permalink parent award report block reply\nnemonster 1 points 4 days ago Here come masculinism. permalink parent award report block reply\nmikethemarine 1 points 4 days ago I saw this as a very nice way of saying FUCK OFF WITH YOUR GOT YOU MOMENT permalink parent award report block reply\n202_ 25 points 4 days ago The way she says \"specifically\" makes me wanna punch her. What an insufferable cunt. permalink award report block reply snoopy3210 17 points 4 days ago And she’s specifically wrong. The ad is not about race superiority at all. It’s about genetics of beauty. Ugly white women don’t have her good genes. That’s it. permalink parent award report block reply HawkDriverMN 8 points 4 days ago Or it was just an ad for a pair of pants. permalink parent award report block reply BrewSwillis 5 points 4 days ago But it was also a joke about how this specific girl was passed down the 'skinny with big tits' genes (jeans). It's not about race. Black and Latina women can have good genes too. You could say that Salma Hayek has good genes. What's it's not saying, is that every women is equally the same, as far as looks and body type....... which is really why feminazis are mad. permalink parent award report block reply HawkDriverMN 3 points 4 days ago I get the double entendres - but in the ancient days ads for pants had hot chicks and no one batted an eye. Sweeney’s response to the femi-hag was perfect. permalink parent award report block reply clownworld30330 3 points 4 days ago What about the up-talking though? permalink parent award report block reply nemonster 1 points 4 days ago Feel same just looking at her permalink parent award report block reply\nsnoopy3210 17 points 4 days ago And she’s specifically wrong. The ad is not about race superiority at all. It’s about genetics of beauty. Ugly white women don’t have her good genes. That’s it. permalink parent award report block reply HawkDriverMN 8 points 4 days ago Or it was just an ad for a pair of pants. permalink parent award report block reply BrewSwillis 5 points 4 days ago But it was also a joke about how this specific girl was passed down the 'skinny with big tits' genes (jeans). It's not about race. Black and Latina women can have good genes too. You could say that Salma Hayek has good genes. What's it's not saying, is that every women is equally the same, as far as looks and body type....... which is really why feminazis are mad. permalink parent award report block reply HawkDriverMN 3 points 4 days ago I get the double entendres - but in the ancient days ads for pants had hot chicks and no one batted an eye. Sweeney’s response to the femi-hag was perfect. permalink parent award report block reply\nHawkDriverMN 8 points 4 days ago Or it was just an ad for a pair of pants. permalink parent award report block reply BrewSwillis 5 points 4 days ago But it was also a joke about how this specific girl was passed down the 'skinny with big tits' genes (jeans). It's not about race. Black and Latina women can have good genes too. You could say that Salma Hayek has good genes. What's it's not saying, is that every women is equally the same, as far as looks and body type....... which is really why feminazis are mad. permalink parent award report block reply HawkDriverMN 3 points 4 days ago I get the double entendres - but in the ancient days ads for pants had hot chicks and no one batted an eye. Sweeney’s response to the femi-hag was perfect. permalink parent award report block reply\nBrewSwillis 5 points 4 days ago But it was also a joke about how this specific girl was passed down the 'skinny with big tits' genes (jeans). It's not about race. Black and Latina women can have good genes too. You could say that Salma Hayek has good genes. What's it's not saying, is that every women is equally the same, as far as looks and body type....... which is really why feminazis are mad. permalink parent award report block reply HawkDriverMN 3 points 4 days ago I get the double entendres - but in the ancient days ads for pants had hot chicks and no one batted an eye. Sweeney’s response to the femi-hag was perfect. permalink parent award report block reply\nHawkDriverMN 3 points 4 days ago I get the double entendres - but in the ancient days ads for pants had hot chicks and no one batted an eye. Sweeney’s response to the femi-hag was perfect. permalink parent award report block reply\nclownworld30330 3 points 4 days ago What about the up-talking though? permalink parent award report block reply\nnemonster 1 points 4 days ago Feel same just looking at her permalink parent award report block reply\ndeleted 15 points 4 days ago Tulkas71 8 points 4 days ago She ruined Dune with her permanent resting bitch face permalink parent award report block reply MAGANatsFan 3 points 4 days ago Original Dune movie better than the remake. Fight me! permalink parent award report block reply Reefay 4 points 4 days ago I haven't seen the latest, but original dune was terrible.  so if original was better I'm definitely not wasting my time permalink parent award report block reply Tulkas71 1 points 4 days ago Agreed,  when I was a kid, my mom had this blood disease so we went across country to Mayo Clinic. So I spent a lot of time in the motel room watching HBO, (this was in the early 80's) I probably watched the Lynch Dune I don't know how many times while We were there. So it has a special place for me. permalink parent award report block reply SpinInGrave1776 1 points 4 days ago Clunky but unforgettable vs. Perfectly executed vanilla paste. permalink parent award report block reply\nTulkas71 8 points 4 days ago She ruined Dune with her permanent resting bitch face permalink parent award report block reply MAGANatsFan 3 points 4 days ago Original Dune movie better than the remake. Fight me! permalink parent award report block reply Reefay 4 points 4 days ago I haven't seen the latest, but original dune was terrible.  so if original was better I'm definitely not wasting my time permalink parent award report block reply Tulkas71 1 points 4 days ago Agreed,  when I was a kid, my mom had this blood disease so we went across country to Mayo Clinic. So I spent a lot of time in the motel room watching HBO, (this was in the early 80's) I probably watched the Lynch Dune I don't know how many times while We were there. So it has a special place for me. permalink parent award report block reply SpinInGrave1776 1 points 4 days ago Clunky but unforgettable vs. Perfectly executed vanilla paste. permalink parent award report block reply\nMAGANatsFan 3 points 4 days ago Original Dune movie better than the remake. Fight me! permalink parent award report block reply Reefay 4 points 4 days ago I haven't seen the latest, but original dune was terrible.  so if original was better I'm definitely not wasting my time permalink parent award report block reply Tulkas71 1 points 4 days ago Agreed,  when I was a kid, my mom had this blood disease so we went across country to Mayo Clinic. So I spent a lot of time in the motel room watching HBO, (this was in the early 80's) I probably watched the Lynch Dune I don't know how many times while We were there. So it has a special place for me. permalink parent award report block reply SpinInGrave1776 1 points 4 days ago Clunky but unforgettable vs. Perfectly executed vanilla paste. permalink parent award report block reply\nReefay 4 points 4 days ago I haven't seen the latest, but original dune was terrible.  so if original was better I'm definitely not wasting my time permalink parent award report block reply\nTulkas71 1 points 4 days ago Agreed,  when I was a kid, my mom had this blood disease so we went across country to Mayo Clinic. So I spent a lot of time in the motel room watching HBO, (this was in the early 80's) I probably watched the Lynch Dune I don't know how many times while We were there. So it has a special place for me. permalink parent award report block reply\nSpinInGrave1776 1 points 4 days ago Clunky but unforgettable vs. Perfectly executed vanilla paste. permalink parent award report block reply\nPowhattan 8 points 4 days ago Did the dumb one just say that white people are genetically superior? permalink award report block reply clownworld30330 5 points 4 days ago Oh my word, she kinda did. permalink parent award report block reply f_bastiat 4 points 4 days ago Finally they have accepted reality. permalink parent award report block reply\nclownworld30330 5 points 4 days ago Oh my word, she kinda did. permalink parent award report block reply f_bastiat 4 points 4 days ago Finally they have accepted reality. permalink parent award report block reply\nf_bastiat 4 points 4 days ago Finally they have accepted reality. permalink parent award report block reply\nJoeBidensDementia1 7 points 4 days ago Was it Ricky Gervais who said during the Oscars that it's the Left who only allows a certain number of Blacks to rise to the top? permalink award report block reply\nHockeyMom4Trump 7 points 4 days ago What a horrible interview. Sydney Sweeney is next level compared to that “journalist” My son is single. I would love him to bring home Sydney. She’s a hardworking woman with common sense. permalink award report block reply lixa 1 points 4 days ago Apparently she's also an attention whore. Encourage your son to find a woman who doesn't need to show up to a sit down dinner black tie event naked and he probably will be happier for it. permalink parent award report block reply Coin-Op 4 points 4 days ago Good comment. Thank God not everyone on this site is a beta simp. permalink parent award report block reply lixa 6 points 4 days ago Thanks. In all honesty I am a woman- but I'm happy to admit when another woman is beautiful or has an amazing body (she certainly does and so do I lol), but I think women should value themselves and present themselves with decency in the public eye. Hypocrites here downvote me while they claim to want a godly woman.  🤷🏼‍♀️ permalink parent award report block reply LiveFreeInXorDie 3 points 4 days ago You're entirely correct. To me, Sweeney isn't far from being a prostitute. She seems to be a decent person, a saint by Hollywood standards, but no matter how based a prostitute may be, she's still a whore. No self-respecting man should settle for an active, unrepentant whore. Unfortunately, 99.9% (i.e., 1/1000 odds) of women in America seem to be, at minimum, whore-adjacent, if not in promiscuity than in general unsuitablity for marriage. The more women I meet, the more I come to understand the last few verses of Ecclesiastes 7. permalink parent award report block reply\nlixa 1 points 4 days ago Apparently she's also an attention whore. Encourage your son to find a woman who doesn't need to show up to a sit down dinner black tie event naked and he probably will be happier for it. permalink parent award report block reply Coin-Op 4 points 4 days ago Good comment. Thank God not everyone on this site is a beta simp. permalink parent award report block reply lixa 6 points 4 days ago Thanks. In all honesty I am a woman- but I'm happy to admit when another woman is beautiful or has an amazing body (she certainly does and so do I lol), but I think women should value themselves and present themselves with decency in the public eye. Hypocrites here downvote me while they claim to want a godly woman.  🤷🏼‍♀️ permalink parent award report block reply LiveFreeInXorDie 3 points 4 days ago You're entirely correct. To me, Sweeney isn't far from being a prostitute. She seems to be a decent person, a saint by Hollywood standards, but no matter how based a prostitute may be, she's still a whore. No self-respecting man should settle for an active, unrepentant whore. Unfortunately, 99.9% (i.e., 1/1000 odds) of women in America seem to be, at minimum, whore-adjacent, if not in promiscuity than in general unsuitablity for marriage. The more women I meet, the more I come to understand the last few verses of Ecclesiastes 7. permalink parent award report block reply\nCoin-Op 4 points 4 days ago Good comment. Thank God not everyone on this site is a beta simp. permalink parent award report block reply lixa 6 points 4 days ago Thanks. In all honesty I am a woman- but I'm happy to admit when another woman is beautiful or has an amazing body (she certainly does and so do I lol), but I think women should value themselves and present themselves with decency in the public eye. Hypocrites here downvote me while they claim to want a godly woman.  🤷🏼‍♀️ permalink parent award report block reply LiveFreeInXorDie 3 points 4 days ago You're entirely correct. To me, Sweeney isn't far from being a prostitute. She seems to be a decent person, a saint by Hollywood standards, but no matter how based a prostitute may be, she's still a whore. No self-respecting man should settle for an active, unrepentant whore. Unfortunately, 99.9% (i.e., 1/1000 odds) of women in America seem to be, at minimum, whore-adjacent, if not in promiscuity than in general unsuitablity for marriage. The more women I meet, the more I come to understand the last few verses of Ecclesiastes 7. permalink parent award report block reply\nlixa 6 points 4 days ago Thanks. In all honesty I am a woman- but I'm happy to admit when another woman is beautiful or has an amazing body (she certainly does and so do I lol), but I think women should value themselves and present themselves with decency in the public eye. Hypocrites here downvote me while they claim to want a godly woman.  🤷🏼‍♀️ permalink parent award report block reply LiveFreeInXorDie 3 points 4 days ago You're entirely correct. To me, Sweeney isn't far from being a prostitute. She seems to be a decent person, a saint by Hollywood standards, but no matter how based a prostitute may be, she's still a whore. No self-respecting man should settle for an active, unrepentant whore. Unfortunately, 99.9% (i.e., 1/1000 odds) of women in America seem to be, at minimum, whore-adjacent, if not in promiscuity than in general unsuitablity for marriage. The more women I meet, the more I come to understand the last few verses of Ecclesiastes 7. permalink parent award report block reply\nLiveFreeInXorDie 3 points 4 days ago You're entirely correct. To me, Sweeney isn't far from being a prostitute. She seems to be a decent person, a saint by Hollywood standards, but no matter how based a prostitute may be, she's still a whore. No self-respecting man should settle for an active, unrepentant whore. Unfortunately, 99.9% (i.e., 1/1000 odds) of women in America seem to be, at minimum, whore-adjacent, if not in promiscuity than in general unsuitablity for marriage. The more women I meet, the more I come to understand the last few verses of Ecclesiastes 7. permalink parent award report block reply\noverblod 6 points 4 days ago That jawline... Man... permalink award report block reply\nclownworld30330 5 points 4 days ago Look at the interviewers forehead: full of frowning lines. Look at Sweeney’s forehead: no frowning lines at all!! And Sweeney has deep, pronounced laugh lines. Sweeney lives her best life every day. The interviewer is a miserable, deeply unhappy person. permalink award report block reply\nHikedelics 5 points 4 days ago Trump showed everyone the way to handle this shit 10 years ago. Glad people are finally starting to catch on. permalink award report block reply\nSenorTrumper 4 points 4 days ago What a slimy creature that woman is. permalink award report block reply\nBeat_to_Quarters 4 points 4 days ago It's like watching the scene in the wolf of Wall Street where Jordan and the Swiss banker are talking to each other, and then their voice overs in their head of what they really are talking about are talking to each other. Voice over: what I'm asking, you Swiss dick, is are you going to fuck me over. Voice over: I understand perfectly, you American shit. permalink award report block reply\nclownworld30330 3 points 4 days ago can you ask me again without up-talking? I can’t take you seriously if you up-talk Idk, might have said something like that. Sweeney handled it perfectly. permalink award report block reply\nQSWO1 3 points 4 days ago Ugly chick, or tranny? permalink award report block reply clownworld30330 5 points 4 days ago Congrats to her on her transition! permalink parent award report block reply\nclownworld30330 5 points 4 days ago Congrats to her on her transition! permalink parent award report block reply\nChoppermagic 3 points 4 days ago \"white people shouldn't\"... one of the most racist things you can say. And what shouldn't black people say\nbrown? permalink award report block reply\nSpellingContable 2 points 4 days ago Specifically, everyone who criticized the ad were using their systematic racism, their fuglibias, and straightaphobia. Such Bigoted Pogs permalink award report block reply\nSteve56775 2 points 4 days ago Why do libtards end every statement like a question? It’s really irritating. permalink award report block reply Jack_NC 1 points 3 days ago serious answer: because they are cowards and are looking for group consensus before expressing an opinion that could possibly violate the agreed narrative. In the liberal world,  agreement with the tribe is more important than factuality. permalink parent award report block reply\nJack_NC 1 points 3 days ago serious answer: because they are cowards and are looking for group consensus before expressing an opinion that could possibly violate the agreed narrative. In the liberal world,  agreement with the tribe is more important than factuality. permalink parent award report block reply\nPsalm-118_24 2 points 4 days ago Sweeney showing her \"white people \" intellectual superiority. 😁 permalink award report block reply\nCoin-Op 2 points 4 days ago Unpopular opinion: Sydney is just another glorified 304. One of the many hollyweird \"it\" girls that have had their 15 minutes of fame. Conservatives need to STOP with the beta simping. It's disappointing. permalink award report block reply Emodius 1 points 4 days ago What's a 304 permalink parent award report block reply LiveFreeInXorDie 3 points 4 days ago My guess is it's calculator code for \"hoe\". permalink parent award report block reply Coin-Op 1 points 3 days ago Winner, winner, chicken dinner! permalink parent award report block reply Coin-Op 1 points 3 days ago It's a euphemism for 'hoe'. Just type in '304' into a calculator, turn it upside down, and the spelling will set you free. permalink parent award report block reply LiveFreeInXorDie 1 points 4 days ago Yeah, she is. As I just replied to someone else, I don't care how based a prostitute is, I'm not going to put a ring on her or advocate anyone else to, and while Sweeney isn't literally a prostitute and by all accounts seems to be a decent person, she's happy to enable men to get their rocks off to her, i.e. mentally commit adultery. Not exactly a good role model for girls. I still respect her, but I'm sick of people simping for her just because she's not evil in Hollywood. permalink parent award report block reply TRexScrotum 1 points 4 days ago “Mentally commit adultery…” Are you fucking serious? So you walk around every day without looking at anyone else? How do you operate a motor vehicle? You’re skirting shariah. That’s an asinine statement you made. permalink parent award report block reply LiveFreeInXorDie 1 points 3 days ago \"But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart.\"  Matthew 5:28 I challenege any man to 100% honestly tell me that they can look at a nude pretty girl without getting lustful (therefore, adulterous) thoughts in their head. That's not sharia by the way, dipshit, that's just what Jesus taught. permalink parent award report block reply TRexScrotum 1 points 3 days ago Oh, with LUSTFUL intent. I thought you meant in general. I was sitting here thinking… how is that even a thing? My bad! permalink parent award report block reply view 2 more comments...\nEmodius 1 points 4 days ago What's a 304 permalink parent award report block reply LiveFreeInXorDie 3 points 4 days ago My guess is it's calculator code for \"hoe\". permalink parent award report block reply Coin-Op 1 points 3 days ago Winner, winner, chicken dinner! permalink parent award report block reply Coin-Op 1 points 3 days ago It's a euphemism for 'hoe'. Just type in '304' into a calculator, turn it upside down, and the spelling will set you free. permalink parent award report block reply\nLiveFreeInXorDie 3 points 4 days ago My guess is it's calculator code for \"hoe\". permalink parent award report block reply Coin-Op 1 points 3 days ago Winner, winner, chicken dinner! permalink parent award report block reply\nCoin-Op 1 points 3 days ago Winner, winner, chicken dinner! permalink parent award report block reply\nCoin-Op 1 points 3 days ago It's a euphemism for 'hoe'. Just type in '304' into a calculator, turn it upside down, and the spelling will set you free. permalink parent award report block reply\nLiveFreeInXorDie 1 points 4 days ago Yeah, she is. As I just replied to someone else, I don't care how based a prostitute is, I'm not going to put a ring on her or advocate anyone else to, and while Sweeney isn't literally a prostitute and by all accounts seems to be a decent person, she's happy to enable men to get their rocks off to her, i.e. mentally commit adultery. Not exactly a good role model for girls. I still respect her, but I'm sick of people simping for her just because she's not evil in Hollywood. permalink parent award report block reply TRexScrotum 1 points 4 days ago “Mentally commit adultery…” Are you fucking serious? So you walk around every day without looking at anyone else? How do you operate a motor vehicle? You’re skirting shariah. That’s an asinine statement you made. permalink parent award report block reply LiveFreeInXorDie 1 points 3 days ago \"But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart.\"  Matthew 5:28 I challenege any man to 100% honestly tell me that they can look at a nude pretty girl without getting lustful (therefore, adulterous) thoughts in their head. That's not sharia by the way, dipshit, that's just what Jesus taught. permalink parent award report block reply TRexScrotum 1 points 3 days ago Oh, with LUSTFUL intent. I thought you meant in general. I was sitting here thinking… how is that even a thing? My bad! permalink parent award report block reply view 2 more comments...\nTRexScrotum 1 points 4 days ago “Mentally commit adultery…” Are you fucking serious? So you walk around every day without looking at anyone else? How do you operate a motor vehicle? You’re skirting shariah. That’s an asinine statement you made. permalink parent award report block reply LiveFreeInXorDie 1 points 3 days ago \"But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart.\"  Matthew 5:28 I challenege any man to 100% honestly tell me that they can look at a nude pretty girl without getting lustful (therefore, adulterous) thoughts in their head. That's not sharia by the way, dipshit, that's just what Jesus taught. permalink parent award report block reply TRexScrotum 1 points 3 days ago Oh, with LUSTFUL intent. I thought you meant in general. I was sitting here thinking… how is that even a thing? My bad! permalink parent award report block reply view 2 more comments...\nLiveFreeInXorDie 1 points 3 days ago \"But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart.\"  Matthew 5:28 I challenege any man to 100% honestly tell me that they can look at a nude pretty girl without getting lustful (therefore, adulterous) thoughts in their head. That's not sharia by the way, dipshit, that's just what Jesus taught. permalink parent award report block reply TRexScrotum 1 points 3 days ago Oh, with LUSTFUL intent. I thought you meant in general. I was sitting here thinking… how is that even a thing? My bad! permalink parent award report block reply view 2 more comments...\nTRexScrotum 1 points 3 days ago Oh, with LUSTFUL intent. I thought you meant in general. I was sitting here thinking… how is that even a thing? My bad! permalink parent award report block reply view 2 more comments...",
  "fetched_at": "2025-11-12T23:02:03.627633Z"
}