{
  "id": "8185523",
  "title": "71WAYNE ROOT: CHEMTRAILS: We All See It. We All Know It’s Happening. We’re All Concerned. We Want Pr",
  "url": "https://patriots.win/p/1ARK9nP4xn/wayne-root-chemtrails-we-all-see/c",
  "content": "72 WAYNE ROOT: CHEMTRAILS: We All See It. We All Know It’s Happening. We’re All Concerned. We Want President Trump and RFK Jr. to Address This Crisis. And Then Ban the Chemtrails in Our Skies. (www.thegatewaypundit.com) posted 3 hours ago by thegatewaybandit 5 comments award share report block WAYNE ROOT: CHEMTRAILS: We All See It. We All Know It’s Happening. We’re All Concerned. We Want President Trump and RFK Jr. to A... By Wayne Allyn Root This will be one of the shortest columns I’ve ever written. www.thegatewaypundit.com\n5 comments Sort by Top Top New Worst Old Save RudeFrog 2 points 2 hours ago The sky outside is fucking insane, I just counted over 30 trails, the whole sky is covered permalink award report block reply LORDFALCONE 2 points 1 hour ago Inb4 DUUUUUURRRRRRR ITS WATER VAPOR DURRRRRR permalink award report block reply SDsc0rch 1 points 1 hour ago ...sigh.......... its WATER vapor!! permalink award report block reply LORDFALCONE 1 points 1 hour ago You know what the punishment for crimes against humanity is permalink parent award report block reply IroWide -1 points 1 hour ago Please stop with your gatewayjunkit spamming. I've reported you numerous times. permalink award report block reply\nRudeFrog 2 points 2 hours ago The sky outside is fucking insane, I just counted over 30 trails, the whole sky is covered permalink award report block reply\nLORDFALCONE 2 points 1 hour ago Inb4 DUUUUUURRRRRRR ITS WATER VAPOR DURRRRRR permalink award report block reply\nSDsc0rch 1 points 1 hour ago ...sigh.......... its WATER vapor!! permalink award report block reply LORDFALCONE 1 points 1 hour ago You know what the punishment for crimes against humanity is permalink parent award report block reply\nLORDFALCONE 1 points 1 hour ago You know what the punishment for crimes against humanity is permalink parent award report block reply\nIroWide -1 points 1 hour ago Please stop with your gatewayjunkit spamming. I've reported you numerous times. permalink award report block reply"
}