{
  "id": "1ARK5A8TdJ",
  "url": "https://patriots.win/p/1ARK5A8TdJ/the-checklist/c",
  "content": "717 The Checklist posted 3 days ago by rdvs34283 290 comments award share report block Washingtons ghost @washghost1 • 4d Looking like that and having a checklist for a man is bold\n290 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno KekistanPM 145 points 3 days ago I know this man is out there And this man is definitely not interested in you. permalink award report block reply Tellman125 42 points 3 days ago \"Some sort of exercise with group accountability.\" What group is holding HER exercise regime accountable? Her posture is so bad, she looks like she's about to fold in half at any second. permalink parent award report block reply Hikedelics 31 points 3 days ago That one had me cracking up. I have done group exercise stuff in the past. For a long time actually. Those always seem to devolve into being more about drinking beer afterwards than the actual workout itself. On the other hand I’ve been lifting weights in my basement since March. I just looked this up yesterday and I’m at 237 workouts in 247 days, or 96%. Those groups never held me anywhere near that kind of standard. permalink parent award report block reply schnazzmizzle 10 points 3 days ago Having your own equipment is wonderful. permalink parent award report block reply bananaguard62 1 points 3 days ago What's your exercise of choice?  I'm guessing lots of disc golf? permalink parent award report block reply Hikedelics 4 points 3 days ago I’m almost exclusively weight lifting this year. Admittedly each day isn’t some kind of marathon session. I’m doing 2 lifts each work out. 6 sets with 8 reps. My rotation currently goes like this: Monday 3am: Bench Press + Barbell Squat Tuesday 3pm: Overhead Press + Dead lift Wednesday 3am: barbell curls + tricep rope push downs Thursday 3pm: Bench press + barbell squat Friday 3am:  Overhead Press + deadlift Saturday (whenever) barbell curls + tricep rope push downs Sunday (whenever) barbell skull crushers + either 5 mile run or 10 mile bike ride pulling my son in a trailer to this big play ground he likes. permalink parent award report block reply view 5 more comments... booblitchutz 16 points 3 days ago She wants a Crossfitter, but knows that’s not cool anymore. permalink parent award report block reply Trump454748 11 points 3 days ago That would actually be an excellent play area for her cats. permalink parent award report block reply mikethemarine 30 points 3 days ago he HAS to have hair, But she doesn't he can't wear jewelry, but yet she does, must be religious, but ye\\t she really isn't. This person is one fucking losers, She just wants the MILLION plus wage earner permalink parent award report block reply Transparency 17 points 3 days ago This person is one fucking losers, It was  predicted by MorganStanley in 2019 that 45% (almost HALF) of women will be single, never married and childless by 2030. IIRC, it has already been moved up to OVER 50%, so we'll see how it plays out at 2030. The woman in the OP is not an exception. She is MUCH more toward the norm today. Here is the longer, maybe complete video: https://www.youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply Kolob64 7 points 3 days ago Ewww, no wonder my son is still single. permalink parent award report block reply HOSEQ 10 points 3 days ago Yes, but she also want's to be \"\"The FIRST Wife\"\".... And according to all the stats and Movies we've seen, we know where this leads.... She want's to make sure she gets Life Long Alimony AFTER she makes his life into a Living hell, and he finally dumps her, usually for the second Wife, who will be Younger, and less controlling.... permalink parent award report block reply Transparency 1 points 3 days ago Yeah, don't fret or blame him. MANY of the younger guys have already woke up and walked away. Be glad that he's not willing to be treated badly, and no... he's very likely NOT gay. Unfortunately, that is 1 of society's ways of trying to force/trick men into keeping a woman, regardless of how bad they are. \"Are you gay?\" permalink parent award report block reply view 1 more comments... A_Little_White_Duck 4 points 3 days ago After watching the full video, pretty sure it's a parody. They try to suppress laughter at one point. But it is still low-key funny. permalink parent award report block reply Transparency 1 points 3 days ago It's not. It's not a 1-off. The matchmaker has posted plenty of these type videos and has a well-known legit business that you can look up. None of this is new. thelovearchitects.com permalink parent award report block reply view 2 more comments... MyDadLikedBiden 1 points 3 days ago Yeah, this can’t be real. https://youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply AllahFubar 15 points 3 days ago She'll have to settle for dozens of cats. permalink parent award report block reply Transparency 9 points 3 days ago ...and box wine, because all that BIG money she made was shelled out to Blue Collar MEN like plumbers (the toilet was stopped up), Electricians (a light switch stopped working), Handymen (the door squeaks, the ceiling fan wobbles too much when she's drunk, and needed a doggie-door installed for her new little victim friend), LawnMan, Mechanic, etc, etc, etc. permalink parent award report block reply RuleoVicus 6 points 3 days ago Not always shelling out \"big money\" lol I get some customers that scoff at modern pricing (it's frightening how many idiots out there are clueless about the 2021-23 inflation), especially for my quotes. The want top tier work for methhead prices. You see, I'm just a sole White independent tradesman they view as 'cheap' help. These are the people that would fight me tooth and nail that replacement of a toilet flange isn't going to be more than $100 but happily shell out $2,500 to have 13 \"pest control\" stakes installed around their lawn or, even Jesus Christ, $450 to have a kitchen faucet replaced! permalink parent award report block reply deleted 7 points 3 days ago view 10 more comments... Transparency 5 points 3 days ago I'm a 1-man operation also. I don't deal with the cheapos. I've told people straight-up: \"I'm not the cheapest guy and I don't try to be. If price is a major factor for you, then I am likely not the guy for you.\" I'm in an industry that sounds similar to whatever you do -ie, lots of competition. I call people back same day, I have great communication, I arrive... and magically, I arrive on time. I get people legitimately calling me \"Sir\", and genuinely thanking me for calling them back, showing up, showing up on time, great work, etc. I don't negotiate. They take my price or leave it. I don't care. When people start making it \"too complicated/difficult\" I cut them loose. They NEVER turn out to be worth the aggravation, time, effort, etc. MOST of the people that seem to have genuine problems with pricing seem to be people in their 80s or older. They grew up when people worked for $5/WEEK and once they get over the line they just can't seem to keep up, IME. Not all. Not even most, IME. But that's where I see a few struggling the most (mentally) over price. permalink parent award report block reply view 3 more comments... CrackerSmurf2 14 points 3 days ago He is so not interested he watched this video and went and got his face tattooed. permalink parent award report block reply Transparency 5 points 3 days ago ☝😂😂😂😂👆 permalink parent award report block reply schism 4 points 3 days ago The best way for her to achieve this goal is to trans herself as a cue ball. permalink parent award report block reply load 1 more comments... austford 78 points 3 days ago lol that interviewer can barely keep a straight face 😂 permalink award report block reply Formerlurker92 54 points 3 days ago I think she knew it was a waste of time when 7 figure salary was the first thing out. 1,000,000 is more than the top 1% its the top .34% for yearly salary. Networth is still a high bar, but she wants salary permalink parent award report block reply MAGA9428 30 points 3 days ago My thoughts exactly… You could disregard every other thing she said. That one request alone is already absurdly unreasonable. permalink parent award report block reply HuggableBear 2 points 2 days ago No one with that salary is speaking to a matchmaking service, ever. permalink parent award report block reply Big-E 17 points 3 days ago And of those men, most are married already. permalink parent award report block reply GoodGuyNixon 16 points 3 days ago Right, a millionaire probably isn’t just making a seven figure salary. His wealth comes from holdings, and he’s probably making a six figure salary. For a seven figure salary she’s looking at like a D1 college football coach, who probably isn’t going to be checking many of the other boxes. permalink parent award report block reply Mydogisbetter 11 points 3 days ago It takes 25 years to build a resume that leads to that kind of salary.  Dumb bitch isn't rooted in reality.   If he has a 7 figure salary chances are he has been married or has kids.  Truly stupid people out there. permalink parent award report block reply The_Emperor 5 points 3 days ago Or a King of some country...she wants prince charming, who goes to the gym, feeds cats, tailors his wardrobe, and had the time to bring in a million a year? She's looking for an arranged marriage into old money.  She has some of her own...her pearls and the plantation shutters behind her ain't cheap. She's like a computer data analyst...not the kind of loving persona that would attract men worthy of her. permalink parent award report block reply Formerlurker92 1 points 3 days ago Basically the only type of man that would hit her standards and be under 30 is a pro sports player. There's, what, 400 if those across all games being paid that much, if that. Not exactly a big market permalink parent award report block reply TheRedPike 36 points 3 days ago It was the smoothie that broke her. permalink parent award report block reply McFatty7 29 points 3 days ago She's like 'thanks for the free matchmaker money'. \"Sorry couldn't find your man, but if you keep paying me, I totally promise keep looking.\" She's better off with an AI boyfriend. At least that removes her from the gene pool. permalink parent award report block reply Formerlurker92 18 points 3 days ago Ai boyfriend won't pay her Kardashian money for being a frigid mid permalink parent award report block reply 3-10 17 points 3 days ago She ain’t even mid. permalink parent award report block reply McFatty7 8 points 3 days ago Mid is still being generous. More like mud. permalink parent award report block reply view 1 more comments... EastTexasMadLad 4 points 3 days ago Far cry from mid. She’s 2/10 bumped to 3 for not being obese AND fugly. permalink parent award report block reply Mortal_Wombat 8 points 3 days ago Frigid mud. What the hell is on it's head? permalink parent award report block reply Tellman125 11 points 3 days ago She's concerned about finding a guy who fits her spreadsheet of non-negotiable requirements, but actually the number of wealthy CEO bodybuilders who ARE out there for her is literally infinite--if we're talking about AI-generated ones. Reminds me of CryptoPunk NFTs and how thousands could be generated in a second. permalink parent award report block reply Transparency 4 points 3 days ago \"Sorry couldn't find your man, but if you keep paying me, I totally promise keep looking.\" I hate to see people scammed, but she really does deserve to be played that way. Can she not hear herself talk? I guarantee if a group did an intervention she still would not wake up enough to remove more than 5% of her ridiculous expectations. permalink parent award report block reply Tellman125 21 points 3 days ago She almost cracked at 0:33, after \"I'm gonna say smoothie.\" permalink parent award report block reply HunterBidensPC 13 points 3 days ago “My ideal man would drink a smoothie” This woman is a fag permalink parent award report block reply monkadelic 11 points 3 days ago Thats a protein shake!!!! I'm divorcing you, taking the kids, and ruining your life. permalink parent award report block reply Transparency 3 points 3 days ago I'm divorcing you, taking the kids, and ruining your life. Her odds of hitting 3 lotterys in a row are much better than a future containing those factors. 😂😂😂 permalink parent award report block reply RuleoVicus 1 points 3 days ago \"protein shake\" In this age of two decades of Rule 34.... permalink parent award report block reply drattastic1 13 points 3 days ago How long? How about never you gargoyle looking bitch. The few men that could live up to those standards marry top tier women and this woman is a hard\n4 or 5 (at best) with the personality of a rattlesnake that takes her down to a 1 or 2. Enjoy your cats cunt. permalink parent award report block reply Transparency 6 points 3 days ago with the personality of a rattlesnake that takes her down to a 1 or 2. Honestly, a lot of guys need to realize that women like her do not even get rated positively. That cunt WILL Destroy your life... Guaranteed! She rates a negative-pick a number. You move as far AWAY from that trash as Fast as possible!! Save YOURSELF, Gentlemen. permalink parent award report block reply RuleoVicus 1 points 3 days ago A good pump and dump later. Unlike fagos, lesbos carry far fewer diseases. Also they really like the D but in a creepy way. Approach at own risk. permalink parent award report block reply load 2 more comments... awsure 53 points 3 days ago Those eggs aren’t gonna get fertilized ever permalink award report block reply UH69MAGA 21 points 3 days ago She has a German Shepherd. permalink parent award report block reply MyDadLikedBiden 8 points 3 days ago 39andMe permalink parent award report block reply Transparency 3 points 3 days ago She has a German Shepherd. Yep: Dogpill enters the chat. (Look it up) permalink parent award report block reply 27Sandino 4 points 3 days ago Coach redpill (rip, and fuck the midget jew for killing him) used to talk about this It's far more women than people think permalink parent award report block reply SenorTrumper 2 points 2 days ago CRP RIP permalink parent award report block reply view 1 more comments... The_Emperor 1 points 3 days ago Nah, she wants a cat person over a dog person. permalink parent award report block reply Tele_Plus 0 points 3 days ago wtf permalink parent award report block reply RuleoVicus 3 points 3 days ago Why are you being brigaded with DVs? Holy shit! permalink parent award report block reply Tele_Plus 0 points 3 days ago I know!  lol I was going to add that I omitted the “lol” after the “wtf” but figured it was enough.  I either have a bot assigned to me, or people here have too much of a mob mentality, which is likely true.  If a post is voted 0 or -1, people will follow suit and downvote without even thinking. permalink parent award report block reply HillarysFUPA 9 points 3 days ago But how will she ever get an abortion in solidarity? permalink parent award report block reply Transparency 4 points 3 days ago Those eggs aren’t gonna get fertilized ever Doesn't matter if they do- she'll just get it aborted. Then pay SHIT-TONS of $$$$ in her 40s to try to have a baby, but the previous abortionS will have already defeated that. permalink parent award report block reply sanitaryshaver 49 points 3 days ago All that for a 3. Jesus permalink award report block reply ThorsonTT 37 points 3 days ago Female social norms affirm that every woman is a 10. permalink parent award report block reply Tellman125 10 points 3 days ago The Era of Snapchat Filter Feminism. Our country has over 160M models. I mean, if you're going by digitally altered selfies and not how they look in meatspace (also known as real life). permalink parent award report block reply RuleoVicus 7 points 3 days ago In ancient times when PoF [Plenty of Fish] was contemporary THE ONE TIME I used it I was catfished HARD. Bitch looked like a 200lb melted candle when I pulled up to her house. That's not fucking right people. permalink parent award report block reply user2827 2 points 3 days ago I remember PoF, I did meet a couple people, only one of which was not obese (that one wound up being crazy). It's easy to get caught when it's a cute face picture, but one of them literally could barely fit in her own car... permalink parent award report block reply Transparency 1 points 3 days ago The Era of Snapchat Filter Feminism. Yup. That filter use shows you beyond the shadow of ANY doubt how PATENTLY DISHONEST the majority of women actually are. permalink parent award report block reply user2827 1 points 3 days ago What are you talking about; lying about her face with makeup, her boobs with padding, her legs with tights, hair color, height, and weight... but expects an honest man. permalink parent award report block reply Transparency 1 points 3 days ago Female social norms affirm that every woman is a 10. You are not wrong. Here's proof: https://www.youtube.com/watch?v=CzJILyLdT8k permalink parent award report block reply Tellman125 21 points 3 days ago \"Be a Christian, but not take it too seriously,\" meaning to \"You must spend a lot of money (as you DO make a 7-figure salary) on all the Christmas gifts I ask for. ALL of them.\" permalink parent award report block reply IroWide 13 points 3 days ago Claim to follow Jesus, but don't actually follow Jesus and wind up in hell. permalink parent award report block reply Transparency 11 points 3 days ago \"Be a Christian, but not take it too seriously,\" meaning to No. It means that she wants to treat it like a smorgasbord, including enforcing what she wants on HIM. SHE will pick and choose and he will obey while he \"leads\". permalink parent award report block reply ThorsonTT 4 points 3 days ago Be a Christian = you must be moral and faithful.  Me, not so much. permalink parent award report block reply MediaBro 1 points 3 days ago She basically means a Cultural Christian. Keeps the trimmings of Christianity and the cultural aspect but doesn't care for the morals and the demanding nature of what it expects. Technically, these make up a good 80% of all Christians tbh, so it will actually be easier to find him. permalink parent award report block reply Mortal_Wombat 15 points 3 days ago 3? You're generous 🤣 permalink parent award report block reply 3-10 22 points 3 days ago I guess the lack of obesity is plus 2 permalink parent award report block reply Mortal_Wombat 12 points 3 days ago Sustained. Please proceed 😂 permalink parent award report block reply Transparency 2 points 3 days ago The attitude and general level of stupidity makes her a minimum -11. permalink parent award report block reply MyDadLikedBiden 10 points 3 days ago More like 𝑒 because she’s irrational . permalink parent award report block reply CommanderOfCheese 4 points 3 days ago Pi, because that's clearly what she eats too much of. permalink parent award report block reply alfredbester 3 points 3 days ago Your Dad liked that joke, too. permalink parent award report block reply RuleoVicus 4 points 3 days ago My fellow fren, I'm am the king of dad jokes. I've made up quite a few. Heard it here first- What do you call an abusive sandwich? A slappy Joe. permalink parent award report block reply scottcaver1 12 points 3 days ago Hoeflation permalink parent award report block reply TwoArizonaPedes 8 points 3 days ago This is what comes from broken homes. She has absolutely no idea what a normal, healthy, functional marriage and family looks like, so she's just going off some fantasy she created in her head. And she has no idea she has no idea. There are so many damaged women and men like this, it's tragic. permalink parent award report block reply Transparency -1 points 3 days ago You just describe a shit-ton of women today. Fuck them. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago You just describe a shit-ton of women today. And men. Good ones are out there and worth the search. permalink parent award report block reply Transparency 1 points 3 days ago A lot of men today are not worth a flip from women's perspective, because they have walked away. They don't care about any of you any longer. We don't need to advertise it... we just act polite and move on. Sex? Ok. Otherwise, yeah, uh, nah. I fit that description, except sex really isn't even on the table any more. Do some research: Women are filthy disease factories. I'm not interested in getting oral or penial cancer just to get with any of you. That's not even touching on HIV/AIDS, Herpes, etc. Now some STDs are becoming untreatable. Use your vibrator and fuck machine. More and more men are even waking up to sex, because: What you offer is not longer worth it. permalink parent award report block reply view 9 more comments... load 2 more comments... MAGA-Fett 34 points 3 days ago LOL, “I want a Christian….but he can’t take it too seriously”. permalink award report block reply Tellman125 11 points 3 days ago \"Buy me a new vacation home and 5 new sports cars--OR luxury cars--every Christmas. That's what I mean.\" permalink parent award report block reply gorilla_grip 7 points 3 days ago I seriously just spit some coffee out when she said that. permalink parent award report block reply YaharaRiver 3 points 3 days ago Code for “NO fucking muslims, nyet nada NO.” permalink parent award report block reply Retard_Strength 27 points 3 days ago other than the 7 figure salary, she could find what she's looking for in a gay bar permalink award report block reply ConsrvspkgNJ 25 points 3 days ago She is gonna die smelling of cat piss..... permalink award report block reply monkadelic 11 points 3 days ago Her cats' last meal, will be her. permalink parent award report block reply RuleoVicus 2 points 3 days ago 💀 permalink parent award report block reply booblitchutz 7 points 3 days ago Or strangled to death by her jigaboo booty call. permalink parent award report block reply RuleoVicus 3 points 3 days ago Burn coal pay toll permalink parent award report block reply Slugbert 24 points 3 days ago JFC, I turned it off after she listed the wardrobe color requirements she’s expecting from her would-be unicorn. Absolutely insufferable. The matchmaker’s reaction and facial expressions were hilarious, though. permalink award report block reply Formerlurker92 23 points 3 days ago If he's good enough for you, he's good enough for a few. So why would he settle for you permalink award report block reply RuleoVicus 9 points 3 days ago \"A key that can open any lock is a great key. A lock that any key can open is a terrible lock.\" some based dude permalink parent award report block reply Floppybutthole 20 points 3 days ago Why would this man want you? Ok yeah there's billions of people out there but from his perspective the nice cute girl working at Starbucks is higher up on his list than you. permalink award report block reply RuprechtThaMonkeyBoy 13 points 3 days ago Hell, with those demands even a plain Jane is a better option. (The girl in the video is sub-plain Jane) permalink parent award report block reply Transparency 6 points 3 days ago the nice cute girl working at Starbucks is higher up on his list than you. ...but...but...but... She has TWO Degrees!!!! (like anybody cares. Not 1 hard-on has been produced by looking at a woman's degree.) permalink parent award report block reply Floppybutthole 4 points 3 days ago Emphasis on the word nice permalink parent award report block reply Tellman125 5 points 3 days ago And meanwhile this girl is literally asking for someone who could buy her the entire Starbucks franchise if she asked him for it. permalink parent award report block reply MyDadLikedBiden 4 points 3 days ago But Starbucks stores are corporate-owned. The cheapest way I can think of would be a hotel containing a cafe that is licensed to sell Starbucks coffee. permalink parent award report block reply Seatacjoe 19 points 3 days ago This has to be a joke. permalink award report block reply LostElf 13 points 3 days ago Sadly, this probably happens all the time. So many women are mentally unfit. Their future is manless, childless, lonely, frustrated, furiously angry at the world for not living up to expectations, and propping up unamused cats on social media in a desperate bid for human connection. permalink parent award report block reply Transparency 4 points 3 days ago Millions and millions lied to and played by Feminism. permalink parent award report block reply bidensmissingbrain 4 points 3 days ago No, this is modern women. Now you know why so many men have checked out. THIS is what the alternative is. permalink parent award report block reply nakedjay 2 points 3 days ago We've gone from 6 figures, 6 feet, 6 inches to 7 figures, great body, and smoothie drinker. permalink parent award report block reply Transparency 1 points 3 days ago This has to be a joke. Oh, it's not a joke. It's not satire. Society has been publicly making fun of those imbeciles for at least several years now. They are a dime a dozen. permalink parent award report block reply SavingPrivateGrace 18 points 3 days ago Beware contenders, it appears she pulls her own hair out. permalink award report block reply Mortal_Wombat 9 points 3 days ago Trichotillomania. Knew a few people that had this. Strange. permalink parent award report block reply Transparency 5 points 3 days ago Same thing birds do (pull feathers) when they are overly stressed. Birds pull their feathers, a behavior known as feather plucking, when they experience stress, boredom, or discomfort. This can lead to physical and emotional issues, making it important to address the underlying causes to help the bird recover. https://duckduckgo.com/?q=feather+plucking&atb=v498-1&ia=images&iax=images permalink parent award report block reply monkadelic 6 points 3 days ago explains the insistence he has all of his permalink parent award report block reply Tellman125 14 points 3 days ago She's very insistently asking a for a business executive who is also a health-conscious gym rat, but even setting aside what her job and her professional level may be, does she look someone who's in awesome shape? She looks more like she has the physique of an ACTUAL rat standing on its hind legs. In fact, compare her shoulders with the shoulders of the interviewer; the interview looks like SHE'S in good shape. And we see that she definitely has a job too. I assume she may be the one who released this video. permalink award report block reply LostElf 5 points 3 days ago I'm a woman so I can't speak for guys, but wouldn't most men find the interviewer more attractive? She's quieter, clearly more intelligent, has a sense of humor, doesn't croak out every statement as a question.... permalink parent award report block reply monkadelic 10 points 3 days ago I'll speak for men here.  Absolutely.  The shrew doesn't have a single attractive quality, the contrast between her and the interviewer made that even more clear. permalink parent award report block reply Crappydatum 6 points 3 days ago I have no knowledge on this, but suspect the interviewer is some kind of matchmaker? permalink parent award report block reply MyDadLikedBiden 3 points 3 days ago Yes, thelovearchitects.com permalink parent award report block reply LostElf 3 points 3 days ago Yep, take the crazy's money and put her on the laugh list. permalink parent award report block reply Crappydatum 2 points 3 days ago Win win! permalink parent award report block reply Transparency 1 points 3 days ago Unfortunately, she deserves it. I hate to see people \"scammed\", but sometimes it's fair and may turn out to be in their best interest. permalink parent award report block reply Transparency 2 points 3 days ago but suspect the interviewer is some kind of matchmaker? She is, and she started voicing this reality at least a few years ago, and she is not the only matchmaker to do so. Women today are beyond ridiculous. Even butch-lesbians are making the same complaints as men. For real. 😂😂😂🤡🌎 Just keep screaming \"Incel!!!\", ladies, because, incel or not, shit-tons of men have already walked away. We're done. You can die alone. Good riddance. permalink parent award report block reply Crappydatum 2 points 3 days ago They won't die alone, they'll have their dozen cats, and the cats will eat their corpses permalink parent award report block reply Nibba2 6 points 3 days ago Everybody finds the interviewer more attractive. Just the inflection in that demanding woman’s voice would put off anyone with options. permalink parent award report block reply Transparency 3 points 3 days ago wouldn't most men find the interviewer more attractive? MUCH more attractive. 👍👍 permalink parent award report block reply nakedjay 1 points 3 days ago I think her dream man is Patrick Bateman. permalink parent award report block reply Account 13 points 3 days ago Big tattoo guys who were forced to get them as part of Ivy League secret societies are right, she is a bitch. permalink award report block reply booblitchutz 10 points 3 days ago She’s saying she’ll “settle” for a member of Skull & Bones Society. Lol okay sugar. permalink parent award report block reply Run_over_Antifa 13 points 3 days ago lol, I am sure there are plenty of cats out there for her. permalink award report block reply Skogin 13 points 3 days ago It’s me! She’s talking about meee!!! permalink award report block reply SnowSnake 6 points 3 days ago Then do the Sam Kinison: cum on her back, steal her cash, and slip out the window. Why's my back wet? Where's my money? Why's the window open? Boo hoo hoo! permalink parent award report block reply Skogin 5 points 3 days ago I don’t normally treat women that way, but for her, I can make an exception. permalink parent award report block reply SnowSnake 4 points 3 days ago Oh, me either. But the dark side laughs along with the idea. permalink parent award report block reply flashersenpai 1 points 3 days ago lmao permalink parent award report block reply itspancakees 9 points 3 days ago that man is out there... right in the mirror permalink award report block reply Transparency 2 points 3 days ago that man is out there... right in the mirror Ahhhhh, you jest! You jest! But the truth is that 1 of the reasons women today are so bitter, abrasive and insufferable is because they have had to BECOME the man that they cannot find AND LOCKDOWN. And, like it or not, women make shitty men, and they cannot even live up to their OWN standards. permalink parent award report block reply Crappydatum 1 points 3 days ago 😂😂☝️ permalink parent award report block reply mydogma8yourkarma 9 points 3 days ago Corey, \"best I can do is a dozen cats\". permalink award report block reply ArtLife 2 points 3 days ago that would be a great meme. permalink parent award report block reply mydogma8yourkarma 2 points 3 days ago Ok https://patriots.win/c/TheDonald/p/1ARK5A91Sq/ permalink parent award report block reply ArtLife 1 points 3 days ago brilliant!!! love it permalink parent award report block reply Crappydatum 7 points 3 days ago \"I want\" Lather rinse repeat permalink award report block reply Oldman1234 6 points 3 days ago She's in the early stages of becoming a cat lady. permalink award report block reply booblitchutz 2 points 3 days ago Nah she’s a few weeks away from getting knocked up by the black dude she’s banging on the side. permalink parent award report block reply Right_of_Sinner 6 points 3 days ago And they complain about unrealistic expectations of them permalink award report block reply Transparency 1 points 3 days ago They're women. Get this to sink in: Nothing is ever good enough. So, they complain. When there is nothing to complain about--> They just complain LESS. If you have much experience with women: Once life finally gives you a break for a week, maybe 10 days, ---> SHE will start some shit. permalink parent award report block reply Freedomnc1776_2 6 points 3 days ago She’s a 1. Maybe a 2  she needs to lower her standards. By A LOT permalink award report block reply nakedjay 2 points 3 days ago She isn't even office hot. permalink parent award report block reply magaspif 5 points 3 days ago this has to be trolling, the 7 figure salary is silly permalink award report block reply Informationinsider 2 points 3 days ago I've met a few. They were very serious. permalink parent award report block reply NecturusMaculosus 5 points 3 days ago I couldnt finish watching this horrible female... \"Needs to look good in blues and greens, because that's what I look good in... (while she's being interviewed in a BLACK BLOUSE AND PINK SWEATER with a WHITE PEARL NECKLACE 😂🤣😂🤣😅🤣🤣🤣🤣🤣🤣) Mentally ill. No pussy is worth this craziness! permalink award report block reply SnowSnake 5 points 3 days ago She may very easily find several men who mesh into her \"checklist,\" but my reverse-ask is, would any of them find her attractive, and not just physically. Like, can he expect fellatio on a regular basis and not only when you're dating. How is this woman going to set herself apart so a man with the level of choice available to him will take notice? 7 figures means he can BUY quality pussy if he wants to. permalink award report block reply Tellman125 4 points 3 days ago Her final requirement is probably \"This bodybuilder CEO I'm describing must not expect sex from me unless I am totally in the mood and he has just given me the 3 or 4 expensive gifts I asked for earlier that day.\" permalink parent award report block reply booblitchutz 5 points 3 days ago But she’s hopping on Tinder every week giving it away to any schmo that will swipe right on her. permalink award report block reply MyDadLikedBiden 4 points 3 days ago Alas, none ever do. permalink parent award report block reply greyhound 5 points 3 days ago I think it is satire. The whole thing is here: https://youtu.be/00_xnbkuiXw permalink award report block reply Samsonlike 5 points 3 days ago I think they took a real video of the matchmaker and then spliced in an actress to play the goofy lady. At first I was in disbelief.  Then it sunk and I couldn't stop laughing. permalink parent award report block reply MemeWarsVet 4 points 3 days ago Cats.  Dildo. Wine. That's your future. permalink award report block reply Transparency 1 points 3 days ago ...and Blue Collar MEN on the clock (nobody wants any of that stank old pussy). permalink parent award report block reply B0bE 4 points 3 days ago That dude is out there banging supermodels not the creatures from horror flicks. permalink award report block reply DeportThemAllForever 4 points 3 days ago This is got to be a skit permalink award report block reply jhewish 4 points 3 days ago The cougar therapist nodding in the affirmative to the fucking wildabeast that has higher standards than she had in her prime with a straight face is hilarious. permalink award report block reply Transparency 1 points 3 days ago She's a pro. She started publicly putting videos up of these ridiculous women at least a few years ago, and she is not the only matchmaker to do so. permalink parent award report block reply MajorPlayer 4 points 3 days ago And I get nothing in return? Lemme guess no prenup, starter marriage 5 years, divorce and marry someone else? permalink award report block reply drsowells1fan 4 points 3 days ago You can thank social media for spawning a generation of well below average women who firmly believe they deserve an above average man.  She better just pour a cup of tea and turn on a Hallmark fantasy where a chubby boss babe 4 returns to her hometown to save her family's candycane factory or tree farm and finds love with a handsome salt of the earth 6' man who would never look at her in real life. permalink award report block reply ArnoldF 4 points 3 days ago A week. lol permalink award report block reply SteveRogers42 4 points 3 days ago Aaahhhahahaha —pause for breath — Aaaahahahaha! permalink award report block reply RedFoxOnFire 4 points 3 days ago Hoeflation is real. permalink award report block reply presticus 4 points 3 days ago The man she's chasing has his pick of actual 10s fighting over him. She is delusional. Hypothetically if she did get her unicorn what's she going to do if he starts going bald 10 years in? About 60% of men undergo hair loss. permalink award report block reply Keep_on_winning_kag 3 points 3 days ago Shes not looking for long term. She will divorce him for her payday. She doesn't realise she's also past her prime and 10's don't want old hens. permalink parent award report block reply gorilla_grip 4 points 3 days ago This man does not exist despite her claim that he’s out there.  There isn’t a 5’10” man with perfect full head of hair, spectacular body, handsome, makes over a million a year, Christian but doesn’t go to church, never been married, never had kids, never got tattoos, likes cats, and wants anything to to do with a horse faced washed up woman with saggy little boobs and a shaved head. And she thinks this matchmaker can find him in a week?  Wow.  This is more delusional than a tranny. permalink award report block reply Transparency 4 points 3 days ago They're a dime a dozen today. Society has been publicly making fun of them for years now. They are as clueless as they are serious. 100%. 👍 wHeRe hAvE aLL thE GOOD mEn GoNe? 😂😂😂 Go ahead, \"ladies\", and tell us how she is the extreme exception to the norm. I dOn'T KnOw WHERE yOu aRe MeeTiNg woMeN lIke ThAT. I Don'T kNoW ANY wOmEn LikE THAT!!! Fuck you and your lies. EVERY. SINGLE. DAY. More and More men are waking up and waking away. It's been going on for YEARS now, ...but WE are the \"Bad guys\", as usual. 😂😂😂 Millions and Millions of you women are and have been played for the fool by feminism. It's a LOOOONG haul from 40-80yo without a man, a family, children. Enjoy your wine and your little dogs that are going to feed off of you until they are rescued after you die alone. 😘👌✌ permalink award report block reply Keep_on_winning_kag 3 points 3 days ago If i were paid a dollar for every \"Dog mom\" profile i see on dating sites i'd have  amillion bucks by now. Avoid dog moms. Notice you never see \" Dog dads\". permalink parent award report block reply Transparency 2 points 3 days ago Avoid dog moms. 👍👍 1,000%. permalink parent award report block reply GuidedDisinfo 4 points 3 days ago The man who fits this list is dating women like Sydney Sweeney. permalink award report block reply Jodokon92 4 points 3 days ago Woman: I want a man with a seven figure salary. Interviewer in her head: Annnnnndddd were done here, good luck crazy. permalink award report block reply Transparency 2 points 3 days ago That's exactly how it played out. The matchmaker is not new and has been posting these lunatics for at least a few years. She knows. 👌 permalink parent award report block reply GreyKnight 4 points 3 days ago Ahhh…6 figure salary of no longer enough… Do they just completely overestimate their worth or are they just playing a different lottery with even less to lose and buy into…? permalink award report block reply deleted 4 points 3 days ago Transparency 0 points 3 days ago THAT ONE. She will never wake up, and even if she did she could never reverse enough to become a viable option for ANYONE. It's the little dogs and cats that will have to suffer with her. No, I'm not joking. 👍👍 permalink parent award report block reply heavyD 4 points 3 days ago And one last thing, he must be blind. permalink award report block reply CommanderOfCheese 4 points 3 days ago All of a sudden that one meme song isn't so ridiculous sounding. \"I'm looking for a man in finance. With a trust fund. 6-5, blue eyes.\" permalink award report block reply ProfHinsley 4 points 3 days ago Basically described me (as long as we're counting decimal points on the salary), but she's a shrew, so, no thanks. permalink award report block reply booblitchutz 4 points 3 days ago A lot of the things she describes in her match are qualities a man grows into after years of stability and happiness. She thinks that kind of man is just floating around single at the age of 30. permalink parent award report block reply Beelzy 3 points 3 days ago She forgot, smells good. permalink award report block reply malooch 3 points 3 days ago I can’t fucking stand when girls speak like that with that inflection in their voice permalink award report block reply AynRand22 3 points 3 days ago Controlling much? permalink award report block reply Transparency 1 points 3 days ago It's not \"cOnTroLLiNg\" when da gurls do it. It's just \"pReFeRenCEs!\" 🤡🌎 permalink parent award report block reply dtrap 3 points 3 days ago With all of those demands, at least she is smoking hot... Oh wait. permalink award report block reply PatriotDescendant 3 points 3 days ago She's not going to get better looking over time... permalink award report block reply I_Am_John_Galt 3 points 3 days ago Opens up out of the gate with \"seven figure salary\"...lol! permalink award report block reply Hikedelics 3 points 3 days ago What the fuck is that on its head? Please tell me that’s not what’s left of “her” hair? permalink award report block reply Transparency 3 points 3 days ago It's a hairband. Her hair is pulled back. permalink parent award report block reply Silly_Wabbitt 3 points 3 days ago GTFO stank hoe....... permalink award report block reply skywalk 2 points 3 days ago She literally wants a male onlyfans model. permalink award report block reply seattlerunner 2 points 3 days ago This is parody obviously. Why are mods gay and stickying this. permalink award report block reply EastTexasMadLad 2 points 3 days ago This is coming from a 3/10 just cause she’s not obese. permalink award report block reply Trajano 2 points 3 days ago If this were not fake, I would applaud the matchmaker's professionalism. permalink award report block reply Sunnywindows 2 points 3 days ago Hilarious… I thought maybe it’s a parody thing, but sadly, probably not. permalink award report block reply MapleMAGA 2 points 3 days ago I found the original video. https://youtu.be/00_xnbkuiXw?si=Na73vc6M-AQdE62w permalink award report block reply Bilbobaggins 2 points 3 days ago I’ll be praying for this woman. How did we get here as a society? permalink award report block reply Transparency 2 points 3 days ago Feminism allowed by all of the pussy-begging simps. Instead of correcting and controlling the women, weak men have focused on babying and catering to them because their focus is to try to fuck them. permalink parent award report block reply 2016TrumpMAGA 2 points 3 days ago A woman that looks like that should be content with any man that has a job.  And that's reaching. permalink award report block reply Samsonlike 2 points 3 days ago She seems nice. permalink award report block reply WhoMeTwo 2 points 3 days ago This is a skit. permalink award report block reply DeaduponArousal 2 points 3 days ago Hope everyone’s enjoying deer season. Just remember: “never pass up a buck on the first day you’d be happy with on the last”. I guess another one that’s applicable is “ya can’t eat the horns”. Happy hunting ladies. permalink award report block reply BrewSwillis 2 points 3 days ago How many billions of dollars is this lady worth? It can be the only explanation....... unless this is a joke. permalink award report block reply okboomer59 2 points 3 days ago My checklist: Not her. The End. permalink award report block reply Kolob64 2 points 3 days ago Makes me wonder if she is for real.  I had a list and my husband exceeded it, so I married him.  I only wanted a man who would support me at home, 7 figures are not necessary and my husband was broke at the time, but finishing a degree in a well paid field.  My list was very specific to me and was so much more flexible than this woman.  I wanted someone completely honest.  Notice she never mentions character. permalink award report block reply Wrexxis780 2 points 3 days ago full head of hair Oh the irony permalink award report block reply Kilroy 2 points 3 days ago If she wants good success, she should probably think seriously about what she's bringing to the party,  what she can do and be for the ideal man that she's seeking. Of course, she won't. permalink award report block reply Gletkin 2 points 3 days ago This is the kind of “Christian” whose idea of a good sermon is one that explores the queer nature of the apostolic fraternity, isn’t it. permalink award report block reply MissSuperSaltine 2 points 3 days ago I think it’s laughable that she is demanding a man that’s top shelf when she’s mid at best. Shocking that she wants a ‘cat’ person. The delusion is strong in this one. permalink award report block reply GoneViking 2 points 3 days ago I know lots of 7 figure, ripped dudes that are looking for an autistic chick. permalink award report block reply asiatrails 2 points 3 days ago This self-centered, autistic, world revolves around me, cat lady in training, would make any decent man's life pure hell permalink award report block reply AgnesDomini 2 points 3 days ago FFS, she even wants to dictate what he has for breakfast and what color clothes he wears so he'll match hers? I cannot imagine that if such a man exists that SHE would be the ideal partner that HE would describe. She's as plain as the day is long, her voice is annoying, she's obviously a control freak. Hard pass, fellas! permalink award report block reply Easzq8 1 points 3 days ago This chick is a solid 5. And with the scrambled eggs called a brain in her head she’s not even good for a lay. permalink award report block reply Orangeperson 1 points 2 days ago I fit those boxes, well some of her checklist boxes, okay once I had a smoothie.  Nevertheless I would shave my head, get a neck tattoo and pull my teeth before I spent one minute with that delusional harpy. permalink award report block reply MPitcher1776 1 points 3 days ago Was she bald or was her hair pulled back tight?  Btw she's nutz. permalink award report block reply MJ_43 1 points 3 days ago Bird hand, check permalink award report block reply kfm2000 1 points 3 days ago Future cat-lady. permalink award report block reply Kwdzr 1 points 3 days ago All superficial things really. permalink award report block reply Megaboom2025 1 points 3 days ago Zero men on earth with a 7 figure salary that want to deal with that harpy permalink award report block reply Fecklessgod 1 points 3 days ago Is this AI? permalink award report block reply RagnarD 1 points 3 days ago A man like that could have any woman he wanted. What does she bring to the table except a princess attitude? permalink award report block reply sumadartson 1 points 2 days ago did she mention detachable balls that fit in her purse? permalink award report block reply 1ValhallaJack 1 points 3 days ago shmeegle permalink award report block reply TrumpOrTreason 1 points 3 days ago \"How soon can you find this man?\"\nAnswer: \" A week\" This list of requirements she has, just proves she doesn't care about who the guy is. permalink award report block reply clownworld30330 1 points 3 days ago Probably AI. But good prompting. permalink award report block reply Psalm-118_24 1 points 3 days ago That's a dude. permalink award report block reply JoeBidensDementia1 -4 points 3 days ago Feel free to stop posting this worthless shit. permalink award report block reply monkadelic 4 points 3 days ago I too am cranky in the mornings.  But sometimes some distraction is ok. permalink parent award report block reply Transparency 0 points 3 days ago Nah, this is the worthless kind of shit that has woken up and SAVED many millions of men over the last several years+, and many, many more into the future. So, go fuck yourself. 👍👍 permalink parent award report block reply asdrubael_was_right -6 points 3 days ago Unpopular opinion: I don’t think she is that unreasonable with her standards. The fashion stuff is silly but that is the way women think. The seven figure salary is unrealistic too but shoot your shot, girl. She’s white and decent looking and didn’t bring up “no Nazi Drumpf supporters” so forgive me for not taking today’s rage bait. Spez: I’m dumb didn’t realize she was looking for a millionaire permalink award report block reply Redclyde75 6 points 3 days ago Decent looking? I felt like I hit my dick with a hammer looking an listening to her permalink parent award report block reply Transparency 2 points 3 days ago Everything screams that it's a woman posting what you responded to. permalink parent award report block reply asdrubael_was_right 2 points 3 days ago Jokes on you I’m into that shit. permalink parent award report block reply Redclyde75 2 points 3 days ago Good news is when you start making 7 figures she might start thinking about it permalink parent award report block reply asdrubael_was_right 1 points 3 days ago She said seven figures? Nvm I’m bad at math. Six figures is like top 10%. Seven is less than 1%. You need swimsuit model looks for that. permalink parent award report block reply booblitchutz 3 points 3 days ago I don’t think this is “rage bait” so much as it is humorous. permalink parent award report block reply ArtLife 1 points 3 days ago this kind of person may well be at a dating service because she is unpleasable, and likely simply unhappy with herself and looking for fulfillment from some nebulous mr perfect. I was on match.com in the very beginning and corresponded with a guy who listed his preferences down to what type of jewelry his match could wear. Kinda glad I never met him in person. permalink parent award report block reply Transparency 1 points 3 days ago Women like her are a dime a dozen today. What you describe fits MANY women today. ... but it's all men's fault. /s permalink parent award report block reply ArtLife 2 points 3 days ago sadly yes. some men have morphed into something weird, probably because of the whole ~girl power men are horrible but save me please mr perfect~. a normal man I don't think should even try to navigate that. permalink parent award report block reply Transparency 2 points 3 days ago More and more are not bothering and even sex is going off the table more and more every day. We are living and witnessing 1 answer to Fermi's paradox. permalink parent award report block reply\nKekistanPM 145 points 3 days ago I know this man is out there And this man is definitely not interested in you. permalink award report block reply Tellman125 42 points 3 days ago \"Some sort of exercise with group accountability.\" What group is holding HER exercise regime accountable? Her posture is so bad, she looks like she's about to fold in half at any second. permalink parent award report block reply Hikedelics 31 points 3 days ago That one had me cracking up. I have done group exercise stuff in the past. For a long time actually. Those always seem to devolve into being more about drinking beer afterwards than the actual workout itself. On the other hand I’ve been lifting weights in my basement since March. I just looked this up yesterday and I’m at 237 workouts in 247 days, or 96%. Those groups never held me anywhere near that kind of standard. permalink parent award report block reply schnazzmizzle 10 points 3 days ago Having your own equipment is wonderful. permalink parent award report block reply bananaguard62 1 points 3 days ago What's your exercise of choice?  I'm guessing lots of disc golf? permalink parent award report block reply Hikedelics 4 points 3 days ago I’m almost exclusively weight lifting this year. Admittedly each day isn’t some kind of marathon session. I’m doing 2 lifts each work out. 6 sets with 8 reps. My rotation currently goes like this: Monday 3am: Bench Press + Barbell Squat Tuesday 3pm: Overhead Press + Dead lift Wednesday 3am: barbell curls + tricep rope push downs Thursday 3pm: Bench press + barbell squat Friday 3am:  Overhead Press + deadlift Saturday (whenever) barbell curls + tricep rope push downs Sunday (whenever) barbell skull crushers + either 5 mile run or 10 mile bike ride pulling my son in a trailer to this big play ground he likes. permalink parent award report block reply view 5 more comments... booblitchutz 16 points 3 days ago She wants a Crossfitter, but knows that’s not cool anymore. permalink parent award report block reply Trump454748 11 points 3 days ago That would actually be an excellent play area for her cats. permalink parent award report block reply mikethemarine 30 points 3 days ago he HAS to have hair, But she doesn't he can't wear jewelry, but yet she does, must be religious, but ye\\t she really isn't. This person is one fucking losers, She just wants the MILLION plus wage earner permalink parent award report block reply Transparency 17 points 3 days ago This person is one fucking losers, It was  predicted by MorganStanley in 2019 that 45% (almost HALF) of women will be single, never married and childless by 2030. IIRC, it has already been moved up to OVER 50%, so we'll see how it plays out at 2030. The woman in the OP is not an exception. She is MUCH more toward the norm today. Here is the longer, maybe complete video: https://www.youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply Kolob64 7 points 3 days ago Ewww, no wonder my son is still single. permalink parent award report block reply HOSEQ 10 points 3 days ago Yes, but she also want's to be \"\"The FIRST Wife\"\".... And according to all the stats and Movies we've seen, we know where this leads.... She want's to make sure she gets Life Long Alimony AFTER she makes his life into a Living hell, and he finally dumps her, usually for the second Wife, who will be Younger, and less controlling.... permalink parent award report block reply Transparency 1 points 3 days ago Yeah, don't fret or blame him. MANY of the younger guys have already woke up and walked away. Be glad that he's not willing to be treated badly, and no... he's very likely NOT gay. Unfortunately, that is 1 of society's ways of trying to force/trick men into keeping a woman, regardless of how bad they are. \"Are you gay?\" permalink parent award report block reply view 1 more comments... A_Little_White_Duck 4 points 3 days ago After watching the full video, pretty sure it's a parody. They try to suppress laughter at one point. But it is still low-key funny. permalink parent award report block reply Transparency 1 points 3 days ago It's not. It's not a 1-off. The matchmaker has posted plenty of these type videos and has a well-known legit business that you can look up. None of this is new. thelovearchitects.com permalink parent award report block reply view 2 more comments... MyDadLikedBiden 1 points 3 days ago Yeah, this can’t be real. https://youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply AllahFubar 15 points 3 days ago She'll have to settle for dozens of cats. permalink parent award report block reply Transparency 9 points 3 days ago ...and box wine, because all that BIG money she made was shelled out to Blue Collar MEN like plumbers (the toilet was stopped up), Electricians (a light switch stopped working), Handymen (the door squeaks, the ceiling fan wobbles too much when she's drunk, and needed a doggie-door installed for her new little victim friend), LawnMan, Mechanic, etc, etc, etc. permalink parent award report block reply RuleoVicus 6 points 3 days ago Not always shelling out \"big money\" lol I get some customers that scoff at modern pricing (it's frightening how many idiots out there are clueless about the 2021-23 inflation), especially for my quotes. The want top tier work for methhead prices. You see, I'm just a sole White independent tradesman they view as 'cheap' help. These are the people that would fight me tooth and nail that replacement of a toilet flange isn't going to be more than $100 but happily shell out $2,500 to have 13 \"pest control\" stakes installed around their lawn or, even Jesus Christ, $450 to have a kitchen faucet replaced! permalink parent award report block reply deleted 7 points 3 days ago view 10 more comments... Transparency 5 points 3 days ago I'm a 1-man operation also. I don't deal with the cheapos. I've told people straight-up: \"I'm not the cheapest guy and I don't try to be. If price is a major factor for you, then I am likely not the guy for you.\" I'm in an industry that sounds similar to whatever you do -ie, lots of competition. I call people back same day, I have great communication, I arrive... and magically, I arrive on time. I get people legitimately calling me \"Sir\", and genuinely thanking me for calling them back, showing up, showing up on time, great work, etc. I don't negotiate. They take my price or leave it. I don't care. When people start making it \"too complicated/difficult\" I cut them loose. They NEVER turn out to be worth the aggravation, time, effort, etc. MOST of the people that seem to have genuine problems with pricing seem to be people in their 80s or older. They grew up when people worked for $5/WEEK and once they get over the line they just can't seem to keep up, IME. Not all. Not even most, IME. But that's where I see a few struggling the most (mentally) over price. permalink parent award report block reply view 3 more comments... CrackerSmurf2 14 points 3 days ago He is so not interested he watched this video and went and got his face tattooed. permalink parent award report block reply Transparency 5 points 3 days ago ☝😂😂😂😂👆 permalink parent award report block reply schism 4 points 3 days ago The best way for her to achieve this goal is to trans herself as a cue ball. permalink parent award report block reply load 1 more comments...\nTellman125 42 points 3 days ago \"Some sort of exercise with group accountability.\" What group is holding HER exercise regime accountable? Her posture is so bad, she looks like she's about to fold in half at any second. permalink parent award report block reply Hikedelics 31 points 3 days ago That one had me cracking up. I have done group exercise stuff in the past. For a long time actually. Those always seem to devolve into being more about drinking beer afterwards than the actual workout itself. On the other hand I’ve been lifting weights in my basement since March. I just looked this up yesterday and I’m at 237 workouts in 247 days, or 96%. Those groups never held me anywhere near that kind of standard. permalink parent award report block reply schnazzmizzle 10 points 3 days ago Having your own equipment is wonderful. permalink parent award report block reply bananaguard62 1 points 3 days ago What's your exercise of choice?  I'm guessing lots of disc golf? permalink parent award report block reply Hikedelics 4 points 3 days ago I’m almost exclusively weight lifting this year. Admittedly each day isn’t some kind of marathon session. I’m doing 2 lifts each work out. 6 sets with 8 reps. My rotation currently goes like this: Monday 3am: Bench Press + Barbell Squat Tuesday 3pm: Overhead Press + Dead lift Wednesday 3am: barbell curls + tricep rope push downs Thursday 3pm: Bench press + barbell squat Friday 3am:  Overhead Press + deadlift Saturday (whenever) barbell curls + tricep rope push downs Sunday (whenever) barbell skull crushers + either 5 mile run or 10 mile bike ride pulling my son in a trailer to this big play ground he likes. permalink parent award report block reply view 5 more comments... booblitchutz 16 points 3 days ago She wants a Crossfitter, but knows that’s not cool anymore. permalink parent award report block reply Trump454748 11 points 3 days ago That would actually be an excellent play area for her cats. permalink parent award report block reply\nHikedelics 31 points 3 days ago That one had me cracking up. I have done group exercise stuff in the past. For a long time actually. Those always seem to devolve into being more about drinking beer afterwards than the actual workout itself. On the other hand I’ve been lifting weights in my basement since March. I just looked this up yesterday and I’m at 237 workouts in 247 days, or 96%. Those groups never held me anywhere near that kind of standard. permalink parent award report block reply schnazzmizzle 10 points 3 days ago Having your own equipment is wonderful. permalink parent award report block reply bananaguard62 1 points 3 days ago What's your exercise of choice?  I'm guessing lots of disc golf? permalink parent award report block reply Hikedelics 4 points 3 days ago I’m almost exclusively weight lifting this year. Admittedly each day isn’t some kind of marathon session. I’m doing 2 lifts each work out. 6 sets with 8 reps. My rotation currently goes like this: Monday 3am: Bench Press + Barbell Squat Tuesday 3pm: Overhead Press + Dead lift Wednesday 3am: barbell curls + tricep rope push downs Thursday 3pm: Bench press + barbell squat Friday 3am:  Overhead Press + deadlift Saturday (whenever) barbell curls + tricep rope push downs Sunday (whenever) barbell skull crushers + either 5 mile run or 10 mile bike ride pulling my son in a trailer to this big play ground he likes. permalink parent award report block reply view 5 more comments...\nschnazzmizzle 10 points 3 days ago Having your own equipment is wonderful. permalink parent award report block reply\nbananaguard62 1 points 3 days ago What's your exercise of choice?  I'm guessing lots of disc golf? permalink parent award report block reply Hikedelics 4 points 3 days ago I’m almost exclusively weight lifting this year. Admittedly each day isn’t some kind of marathon session. I’m doing 2 lifts each work out. 6 sets with 8 reps. My rotation currently goes like this: Monday 3am: Bench Press + Barbell Squat Tuesday 3pm: Overhead Press + Dead lift Wednesday 3am: barbell curls + tricep rope push downs Thursday 3pm: Bench press + barbell squat Friday 3am:  Overhead Press + deadlift Saturday (whenever) barbell curls + tricep rope push downs Sunday (whenever) barbell skull crushers + either 5 mile run or 10 mile bike ride pulling my son in a trailer to this big play ground he likes. permalink parent award report block reply view 5 more comments...\nHikedelics 4 points 3 days ago I’m almost exclusively weight lifting this year. Admittedly each day isn’t some kind of marathon session. I’m doing 2 lifts each work out. 6 sets with 8 reps. My rotation currently goes like this: Monday 3am: Bench Press + Barbell Squat Tuesday 3pm: Overhead Press + Dead lift Wednesday 3am: barbell curls + tricep rope push downs Thursday 3pm: Bench press + barbell squat Friday 3am:  Overhead Press + deadlift Saturday (whenever) barbell curls + tricep rope push downs Sunday (whenever) barbell skull crushers + either 5 mile run or 10 mile bike ride pulling my son in a trailer to this big play ground he likes. permalink parent award report block reply view 5 more comments...\nbooblitchutz 16 points 3 days ago She wants a Crossfitter, but knows that’s not cool anymore. permalink parent award report block reply Trump454748 11 points 3 days ago That would actually be an excellent play area for her cats. permalink parent award report block reply\nTrump454748 11 points 3 days ago That would actually be an excellent play area for her cats. permalink parent award report block reply\nmikethemarine 30 points 3 days ago he HAS to have hair, But she doesn't he can't wear jewelry, but yet she does, must be religious, but ye\\t she really isn't. This person is one fucking losers, She just wants the MILLION plus wage earner permalink parent award report block reply Transparency 17 points 3 days ago This person is one fucking losers, It was  predicted by MorganStanley in 2019 that 45% (almost HALF) of women will be single, never married and childless by 2030. IIRC, it has already been moved up to OVER 50%, so we'll see how it plays out at 2030. The woman in the OP is not an exception. She is MUCH more toward the norm today. Here is the longer, maybe complete video: https://www.youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply Kolob64 7 points 3 days ago Ewww, no wonder my son is still single. permalink parent award report block reply HOSEQ 10 points 3 days ago Yes, but she also want's to be \"\"The FIRST Wife\"\".... And according to all the stats and Movies we've seen, we know where this leads.... She want's to make sure she gets Life Long Alimony AFTER she makes his life into a Living hell, and he finally dumps her, usually for the second Wife, who will be Younger, and less controlling.... permalink parent award report block reply Transparency 1 points 3 days ago Yeah, don't fret or blame him. MANY of the younger guys have already woke up and walked away. Be glad that he's not willing to be treated badly, and no... he's very likely NOT gay. Unfortunately, that is 1 of society's ways of trying to force/trick men into keeping a woman, regardless of how bad they are. \"Are you gay?\" permalink parent award report block reply view 1 more comments... A_Little_White_Duck 4 points 3 days ago After watching the full video, pretty sure it's a parody. They try to suppress laughter at one point. But it is still low-key funny. permalink parent award report block reply Transparency 1 points 3 days ago It's not. It's not a 1-off. The matchmaker has posted plenty of these type videos and has a well-known legit business that you can look up. None of this is new. thelovearchitects.com permalink parent award report block reply view 2 more comments... MyDadLikedBiden 1 points 3 days ago Yeah, this can’t be real. https://youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply\nTransparency 17 points 3 days ago This person is one fucking losers, It was  predicted by MorganStanley in 2019 that 45% (almost HALF) of women will be single, never married and childless by 2030. IIRC, it has already been moved up to OVER 50%, so we'll see how it plays out at 2030. The woman in the OP is not an exception. She is MUCH more toward the norm today. Here is the longer, maybe complete video: https://www.youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply Kolob64 7 points 3 days ago Ewww, no wonder my son is still single. permalink parent award report block reply HOSEQ 10 points 3 days ago Yes, but she also want's to be \"\"The FIRST Wife\"\".... And according to all the stats and Movies we've seen, we know where this leads.... She want's to make sure she gets Life Long Alimony AFTER she makes his life into a Living hell, and he finally dumps her, usually for the second Wife, who will be Younger, and less controlling.... permalink parent award report block reply Transparency 1 points 3 days ago Yeah, don't fret or blame him. MANY of the younger guys have already woke up and walked away. Be glad that he's not willing to be treated badly, and no... he's very likely NOT gay. Unfortunately, that is 1 of society's ways of trying to force/trick men into keeping a woman, regardless of how bad they are. \"Are you gay?\" permalink parent award report block reply view 1 more comments... A_Little_White_Duck 4 points 3 days ago After watching the full video, pretty sure it's a parody. They try to suppress laughter at one point. But it is still low-key funny. permalink parent award report block reply Transparency 1 points 3 days ago It's not. It's not a 1-off. The matchmaker has posted plenty of these type videos and has a well-known legit business that you can look up. None of this is new. thelovearchitects.com permalink parent award report block reply view 2 more comments... MyDadLikedBiden 1 points 3 days ago Yeah, this can’t be real. https://youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply\nKolob64 7 points 3 days ago Ewww, no wonder my son is still single. permalink parent award report block reply HOSEQ 10 points 3 days ago Yes, but she also want's to be \"\"The FIRST Wife\"\".... And according to all the stats and Movies we've seen, we know where this leads.... She want's to make sure she gets Life Long Alimony AFTER she makes his life into a Living hell, and he finally dumps her, usually for the second Wife, who will be Younger, and less controlling.... permalink parent award report block reply Transparency 1 points 3 days ago Yeah, don't fret or blame him. MANY of the younger guys have already woke up and walked away. Be glad that he's not willing to be treated badly, and no... he's very likely NOT gay. Unfortunately, that is 1 of society's ways of trying to force/trick men into keeping a woman, regardless of how bad they are. \"Are you gay?\" permalink parent award report block reply view 1 more comments...\nHOSEQ 10 points 3 days ago Yes, but she also want's to be \"\"The FIRST Wife\"\".... And according to all the stats and Movies we've seen, we know where this leads.... She want's to make sure she gets Life Long Alimony AFTER she makes his life into a Living hell, and he finally dumps her, usually for the second Wife, who will be Younger, and less controlling.... permalink parent award report block reply\nTransparency 1 points 3 days ago Yeah, don't fret or blame him. MANY of the younger guys have already woke up and walked away. Be glad that he's not willing to be treated badly, and no... he's very likely NOT gay. Unfortunately, that is 1 of society's ways of trying to force/trick men into keeping a woman, regardless of how bad they are. \"Are you gay?\" permalink parent award report block reply view 1 more comments...\nA_Little_White_Duck 4 points 3 days ago After watching the full video, pretty sure it's a parody. They try to suppress laughter at one point. But it is still low-key funny. permalink parent award report block reply Transparency 1 points 3 days ago It's not. It's not a 1-off. The matchmaker has posted plenty of these type videos and has a well-known legit business that you can look up. None of this is new. thelovearchitects.com permalink parent award report block reply view 2 more comments... MyDadLikedBiden 1 points 3 days ago Yeah, this can’t be real. https://youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply\nTransparency 1 points 3 days ago It's not. It's not a 1-off. The matchmaker has posted plenty of these type videos and has a well-known legit business that you can look up. None of this is new. thelovearchitects.com permalink parent award report block reply view 2 more comments...\nMyDadLikedBiden 1 points 3 days ago Yeah, this can’t be real. https://youtube.com/watch?v=00_xnbkuiXw permalink parent award report block reply\nAllahFubar 15 points 3 days ago She'll have to settle for dozens of cats. permalink parent award report block reply Transparency 9 points 3 days ago ...and box wine, because all that BIG money she made was shelled out to Blue Collar MEN like plumbers (the toilet was stopped up), Electricians (a light switch stopped working), Handymen (the door squeaks, the ceiling fan wobbles too much when she's drunk, and needed a doggie-door installed for her new little victim friend), LawnMan, Mechanic, etc, etc, etc. permalink parent award report block reply RuleoVicus 6 points 3 days ago Not always shelling out \"big money\" lol I get some customers that scoff at modern pricing (it's frightening how many idiots out there are clueless about the 2021-23 inflation), especially for my quotes. The want top tier work for methhead prices. You see, I'm just a sole White independent tradesman they view as 'cheap' help. These are the people that would fight me tooth and nail that replacement of a toilet flange isn't going to be more than $100 but happily shell out $2,500 to have 13 \"pest control\" stakes installed around their lawn or, even Jesus Christ, $450 to have a kitchen faucet replaced! permalink parent award report block reply deleted 7 points 3 days ago view 10 more comments... Transparency 5 points 3 days ago I'm a 1-man operation also. I don't deal with the cheapos. I've told people straight-up: \"I'm not the cheapest guy and I don't try to be. If price is a major factor for you, then I am likely not the guy for you.\" I'm in an industry that sounds similar to whatever you do -ie, lots of competition. I call people back same day, I have great communication, I arrive... and magically, I arrive on time. I get people legitimately calling me \"Sir\", and genuinely thanking me for calling them back, showing up, showing up on time, great work, etc. I don't negotiate. They take my price or leave it. I don't care. When people start making it \"too complicated/difficult\" I cut them loose. They NEVER turn out to be worth the aggravation, time, effort, etc. MOST of the people that seem to have genuine problems with pricing seem to be people in their 80s or older. They grew up when people worked for $5/WEEK and once they get over the line they just can't seem to keep up, IME. Not all. Not even most, IME. But that's where I see a few struggling the most (mentally) over price. permalink parent award report block reply view 3 more comments...\nTransparency 9 points 3 days ago ...and box wine, because all that BIG money she made was shelled out to Blue Collar MEN like plumbers (the toilet was stopped up), Electricians (a light switch stopped working), Handymen (the door squeaks, the ceiling fan wobbles too much when she's drunk, and needed a doggie-door installed for her new little victim friend), LawnMan, Mechanic, etc, etc, etc. permalink parent award report block reply RuleoVicus 6 points 3 days ago Not always shelling out \"big money\" lol I get some customers that scoff at modern pricing (it's frightening how many idiots out there are clueless about the 2021-23 inflation), especially for my quotes. The want top tier work for methhead prices. You see, I'm just a sole White independent tradesman they view as 'cheap' help. These are the people that would fight me tooth and nail that replacement of a toilet flange isn't going to be more than $100 but happily shell out $2,500 to have 13 \"pest control\" stakes installed around their lawn or, even Jesus Christ, $450 to have a kitchen faucet replaced! permalink parent award report block reply deleted 7 points 3 days ago view 10 more comments... Transparency 5 points 3 days ago I'm a 1-man operation also. I don't deal with the cheapos. I've told people straight-up: \"I'm not the cheapest guy and I don't try to be. If price is a major factor for you, then I am likely not the guy for you.\" I'm in an industry that sounds similar to whatever you do -ie, lots of competition. I call people back same day, I have great communication, I arrive... and magically, I arrive on time. I get people legitimately calling me \"Sir\", and genuinely thanking me for calling them back, showing up, showing up on time, great work, etc. I don't negotiate. They take my price or leave it. I don't care. When people start making it \"too complicated/difficult\" I cut them loose. They NEVER turn out to be worth the aggravation, time, effort, etc. MOST of the people that seem to have genuine problems with pricing seem to be people in their 80s or older. They grew up when people worked for $5/WEEK and once they get over the line they just can't seem to keep up, IME. Not all. Not even most, IME. But that's where I see a few struggling the most (mentally) over price. permalink parent award report block reply view 3 more comments...\nRuleoVicus 6 points 3 days ago Not always shelling out \"big money\" lol I get some customers that scoff at modern pricing (it's frightening how many idiots out there are clueless about the 2021-23 inflation), especially for my quotes. The want top tier work for methhead prices. You see, I'm just a sole White independent tradesman they view as 'cheap' help. These are the people that would fight me tooth and nail that replacement of a toilet flange isn't going to be more than $100 but happily shell out $2,500 to have 13 \"pest control\" stakes installed around their lawn or, even Jesus Christ, $450 to have a kitchen faucet replaced! permalink parent award report block reply deleted 7 points 3 days ago view 10 more comments... Transparency 5 points 3 days ago I'm a 1-man operation also. I don't deal with the cheapos. I've told people straight-up: \"I'm not the cheapest guy and I don't try to be. If price is a major factor for you, then I am likely not the guy for you.\" I'm in an industry that sounds similar to whatever you do -ie, lots of competition. I call people back same day, I have great communication, I arrive... and magically, I arrive on time. I get people legitimately calling me \"Sir\", and genuinely thanking me for calling them back, showing up, showing up on time, great work, etc. I don't negotiate. They take my price or leave it. I don't care. When people start making it \"too complicated/difficult\" I cut them loose. They NEVER turn out to be worth the aggravation, time, effort, etc. MOST of the people that seem to have genuine problems with pricing seem to be people in their 80s or older. They grew up when people worked for $5/WEEK and once they get over the line they just can't seem to keep up, IME. Not all. Not even most, IME. But that's where I see a few struggling the most (mentally) over price. permalink parent award report block reply view 3 more comments...\ndeleted 7 points 3 days ago view 10 more comments...\nTransparency 5 points 3 days ago I'm a 1-man operation also. I don't deal with the cheapos. I've told people straight-up: \"I'm not the cheapest guy and I don't try to be. If price is a major factor for you, then I am likely not the guy for you.\" I'm in an industry that sounds similar to whatever you do -ie, lots of competition. I call people back same day, I have great communication, I arrive... and magically, I arrive on time. I get people legitimately calling me \"Sir\", and genuinely thanking me for calling them back, showing up, showing up on time, great work, etc. I don't negotiate. They take my price or leave it. I don't care. When people start making it \"too complicated/difficult\" I cut them loose. They NEVER turn out to be worth the aggravation, time, effort, etc. MOST of the people that seem to have genuine problems with pricing seem to be people in their 80s or older. They grew up when people worked for $5/WEEK and once they get over the line they just can't seem to keep up, IME. Not all. Not even most, IME. But that's where I see a few struggling the most (mentally) over price. permalink parent award report block reply view 3 more comments...\nCrackerSmurf2 14 points 3 days ago He is so not interested he watched this video and went and got his face tattooed. permalink parent award report block reply Transparency 5 points 3 days ago ☝😂😂😂😂👆 permalink parent award report block reply\nTransparency 5 points 3 days ago ☝😂😂😂😂👆 permalink parent award report block reply\nschism 4 points 3 days ago The best way for her to achieve this goal is to trans herself as a cue ball. permalink parent award report block reply\naustford 78 points 3 days ago lol that interviewer can barely keep a straight face 😂 permalink award report block reply Formerlurker92 54 points 3 days ago I think she knew it was a waste of time when 7 figure salary was the first thing out. 1,000,000 is more than the top 1% its the top .34% for yearly salary. Networth is still a high bar, but she wants salary permalink parent award report block reply MAGA9428 30 points 3 days ago My thoughts exactly… You could disregard every other thing she said. That one request alone is already absurdly unreasonable. permalink parent award report block reply HuggableBear 2 points 2 days ago No one with that salary is speaking to a matchmaking service, ever. permalink parent award report block reply Big-E 17 points 3 days ago And of those men, most are married already. permalink parent award report block reply GoodGuyNixon 16 points 3 days ago Right, a millionaire probably isn’t just making a seven figure salary. His wealth comes from holdings, and he’s probably making a six figure salary. For a seven figure salary she’s looking at like a D1 college football coach, who probably isn’t going to be checking many of the other boxes. permalink parent award report block reply Mydogisbetter 11 points 3 days ago It takes 25 years to build a resume that leads to that kind of salary.  Dumb bitch isn't rooted in reality.   If he has a 7 figure salary chances are he has been married or has kids.  Truly stupid people out there. permalink parent award report block reply The_Emperor 5 points 3 days ago Or a King of some country...she wants prince charming, who goes to the gym, feeds cats, tailors his wardrobe, and had the time to bring in a million a year? She's looking for an arranged marriage into old money.  She has some of her own...her pearls and the plantation shutters behind her ain't cheap. She's like a computer data analyst...not the kind of loving persona that would attract men worthy of her. permalink parent award report block reply Formerlurker92 1 points 3 days ago Basically the only type of man that would hit her standards and be under 30 is a pro sports player. There's, what, 400 if those across all games being paid that much, if that. Not exactly a big market permalink parent award report block reply TheRedPike 36 points 3 days ago It was the smoothie that broke her. permalink parent award report block reply McFatty7 29 points 3 days ago She's like 'thanks for the free matchmaker money'. \"Sorry couldn't find your man, but if you keep paying me, I totally promise keep looking.\" She's better off with an AI boyfriend. At least that removes her from the gene pool. permalink parent award report block reply Formerlurker92 18 points 3 days ago Ai boyfriend won't pay her Kardashian money for being a frigid mid permalink parent award report block reply 3-10 17 points 3 days ago She ain’t even mid. permalink parent award report block reply McFatty7 8 points 3 days ago Mid is still being generous. More like mud. permalink parent award report block reply view 1 more comments... EastTexasMadLad 4 points 3 days ago Far cry from mid. She’s 2/10 bumped to 3 for not being obese AND fugly. permalink parent award report block reply Mortal_Wombat 8 points 3 days ago Frigid mud. What the hell is on it's head? permalink parent award report block reply Tellman125 11 points 3 days ago She's concerned about finding a guy who fits her spreadsheet of non-negotiable requirements, but actually the number of wealthy CEO bodybuilders who ARE out there for her is literally infinite--if we're talking about AI-generated ones. Reminds me of CryptoPunk NFTs and how thousands could be generated in a second. permalink parent award report block reply Transparency 4 points 3 days ago \"Sorry couldn't find your man, but if you keep paying me, I totally promise keep looking.\" I hate to see people scammed, but she really does deserve to be played that way. Can she not hear herself talk? I guarantee if a group did an intervention she still would not wake up enough to remove more than 5% of her ridiculous expectations. permalink parent award report block reply Tellman125 21 points 3 days ago She almost cracked at 0:33, after \"I'm gonna say smoothie.\" permalink parent award report block reply HunterBidensPC 13 points 3 days ago “My ideal man would drink a smoothie” This woman is a fag permalink parent award report block reply monkadelic 11 points 3 days ago Thats a protein shake!!!! I'm divorcing you, taking the kids, and ruining your life. permalink parent award report block reply Transparency 3 points 3 days ago I'm divorcing you, taking the kids, and ruining your life. Her odds of hitting 3 lotterys in a row are much better than a future containing those factors. 😂😂😂 permalink parent award report block reply RuleoVicus 1 points 3 days ago \"protein shake\" In this age of two decades of Rule 34.... permalink parent award report block reply drattastic1 13 points 3 days ago How long? How about never you gargoyle looking bitch. The few men that could live up to those standards marry top tier women and this woman is a hard\n4 or 5 (at best) with the personality of a rattlesnake that takes her down to a 1 or 2. Enjoy your cats cunt. permalink parent award report block reply Transparency 6 points 3 days ago with the personality of a rattlesnake that takes her down to a 1 or 2. Honestly, a lot of guys need to realize that women like her do not even get rated positively. That cunt WILL Destroy your life... Guaranteed! She rates a negative-pick a number. You move as far AWAY from that trash as Fast as possible!! Save YOURSELF, Gentlemen. permalink parent award report block reply RuleoVicus 1 points 3 days ago A good pump and dump later. Unlike fagos, lesbos carry far fewer diseases. Also they really like the D but in a creepy way. Approach at own risk. permalink parent award report block reply load 2 more comments...\nFormerlurker92 54 points 3 days ago I think she knew it was a waste of time when 7 figure salary was the first thing out. 1,000,000 is more than the top 1% its the top .34% for yearly salary. Networth is still a high bar, but she wants salary permalink parent award report block reply MAGA9428 30 points 3 days ago My thoughts exactly… You could disregard every other thing she said. That one request alone is already absurdly unreasonable. permalink parent award report block reply HuggableBear 2 points 2 days ago No one with that salary is speaking to a matchmaking service, ever. permalink parent award report block reply Big-E 17 points 3 days ago And of those men, most are married already. permalink parent award report block reply GoodGuyNixon 16 points 3 days ago Right, a millionaire probably isn’t just making a seven figure salary. His wealth comes from holdings, and he’s probably making a six figure salary. For a seven figure salary she’s looking at like a D1 college football coach, who probably isn’t going to be checking many of the other boxes. permalink parent award report block reply Mydogisbetter 11 points 3 days ago It takes 25 years to build a resume that leads to that kind of salary.  Dumb bitch isn't rooted in reality.   If he has a 7 figure salary chances are he has been married or has kids.  Truly stupid people out there. permalink parent award report block reply The_Emperor 5 points 3 days ago Or a King of some country...she wants prince charming, who goes to the gym, feeds cats, tailors his wardrobe, and had the time to bring in a million a year? She's looking for an arranged marriage into old money.  She has some of her own...her pearls and the plantation shutters behind her ain't cheap. She's like a computer data analyst...not the kind of loving persona that would attract men worthy of her. permalink parent award report block reply Formerlurker92 1 points 3 days ago Basically the only type of man that would hit her standards and be under 30 is a pro sports player. There's, what, 400 if those across all games being paid that much, if that. Not exactly a big market permalink parent award report block reply\nMAGA9428 30 points 3 days ago My thoughts exactly… You could disregard every other thing she said. That one request alone is already absurdly unreasonable. permalink parent award report block reply HuggableBear 2 points 2 days ago No one with that salary is speaking to a matchmaking service, ever. permalink parent award report block reply\nHuggableBear 2 points 2 days ago No one with that salary is speaking to a matchmaking service, ever. permalink parent award report block reply\nBig-E 17 points 3 days ago And of those men, most are married already. permalink parent award report block reply\nGoodGuyNixon 16 points 3 days ago Right, a millionaire probably isn’t just making a seven figure salary. His wealth comes from holdings, and he’s probably making a six figure salary. For a seven figure salary she’s looking at like a D1 college football coach, who probably isn’t going to be checking many of the other boxes. permalink parent award report block reply Mydogisbetter 11 points 3 days ago It takes 25 years to build a resume that leads to that kind of salary.  Dumb bitch isn't rooted in reality.   If he has a 7 figure salary chances are he has been married or has kids.  Truly stupid people out there. permalink parent award report block reply The_Emperor 5 points 3 days ago Or a King of some country...she wants prince charming, who goes to the gym, feeds cats, tailors his wardrobe, and had the time to bring in a million a year? She's looking for an arranged marriage into old money.  She has some of her own...her pearls and the plantation shutters behind her ain't cheap. She's like a computer data analyst...not the kind of loving persona that would attract men worthy of her. permalink parent award report block reply Formerlurker92 1 points 3 days ago Basically the only type of man that would hit her standards and be under 30 is a pro sports player. There's, what, 400 if those across all games being paid that much, if that. Not exactly a big market permalink parent award report block reply\nMydogisbetter 11 points 3 days ago It takes 25 years to build a resume that leads to that kind of salary.  Dumb bitch isn't rooted in reality.   If he has a 7 figure salary chances are he has been married or has kids.  Truly stupid people out there. permalink parent award report block reply The_Emperor 5 points 3 days ago Or a King of some country...she wants prince charming, who goes to the gym, feeds cats, tailors his wardrobe, and had the time to bring in a million a year? She's looking for an arranged marriage into old money.  She has some of her own...her pearls and the plantation shutters behind her ain't cheap. She's like a computer data analyst...not the kind of loving persona that would attract men worthy of her. permalink parent award report block reply Formerlurker92 1 points 3 days ago Basically the only type of man that would hit her standards and be under 30 is a pro sports player. There's, what, 400 if those across all games being paid that much, if that. Not exactly a big market permalink parent award report block reply\nThe_Emperor 5 points 3 days ago Or a King of some country...she wants prince charming, who goes to the gym, feeds cats, tailors his wardrobe, and had the time to bring in a million a year? She's looking for an arranged marriage into old money.  She has some of her own...her pearls and the plantation shutters behind her ain't cheap. She's like a computer data analyst...not the kind of loving persona that would attract men worthy of her. permalink parent award report block reply\nFormerlurker92 1 points 3 days ago Basically the only type of man that would hit her standards and be under 30 is a pro sports player. There's, what, 400 if those across all games being paid that much, if that. Not exactly a big market permalink parent award report block reply\nTheRedPike 36 points 3 days ago It was the smoothie that broke her. permalink parent award report block reply\nMcFatty7 29 points 3 days ago She's like 'thanks for the free matchmaker money'. \"Sorry couldn't find your man, but if you keep paying me, I totally promise keep looking.\" She's better off with an AI boyfriend. At least that removes her from the gene pool. permalink parent award report block reply Formerlurker92 18 points 3 days ago Ai boyfriend won't pay her Kardashian money for being a frigid mid permalink parent award report block reply 3-10 17 points 3 days ago She ain’t even mid. permalink parent award report block reply McFatty7 8 points 3 days ago Mid is still being generous. More like mud. permalink parent award report block reply view 1 more comments... EastTexasMadLad 4 points 3 days ago Far cry from mid. She’s 2/10 bumped to 3 for not being obese AND fugly. permalink parent award report block reply Mortal_Wombat 8 points 3 days ago Frigid mud. What the hell is on it's head? permalink parent award report block reply Tellman125 11 points 3 days ago She's concerned about finding a guy who fits her spreadsheet of non-negotiable requirements, but actually the number of wealthy CEO bodybuilders who ARE out there for her is literally infinite--if we're talking about AI-generated ones. Reminds me of CryptoPunk NFTs and how thousands could be generated in a second. permalink parent award report block reply Transparency 4 points 3 days ago \"Sorry couldn't find your man, but if you keep paying me, I totally promise keep looking.\" I hate to see people scammed, but she really does deserve to be played that way. Can she not hear herself talk? I guarantee if a group did an intervention she still would not wake up enough to remove more than 5% of her ridiculous expectations. permalink parent award report block reply\nFormerlurker92 18 points 3 days ago Ai boyfriend won't pay her Kardashian money for being a frigid mid permalink parent award report block reply 3-10 17 points 3 days ago She ain’t even mid. permalink parent award report block reply McFatty7 8 points 3 days ago Mid is still being generous. More like mud. permalink parent award report block reply view 1 more comments... EastTexasMadLad 4 points 3 days ago Far cry from mid. She’s 2/10 bumped to 3 for not being obese AND fugly. permalink parent award report block reply Mortal_Wombat 8 points 3 days ago Frigid mud. What the hell is on it's head? permalink parent award report block reply\n3-10 17 points 3 days ago She ain’t even mid. permalink parent award report block reply McFatty7 8 points 3 days ago Mid is still being generous. More like mud. permalink parent award report block reply view 1 more comments... EastTexasMadLad 4 points 3 days ago Far cry from mid. She’s 2/10 bumped to 3 for not being obese AND fugly. permalink parent award report block reply\nMcFatty7 8 points 3 days ago Mid is still being generous. More like mud. permalink parent award report block reply view 1 more comments...\nEastTexasMadLad 4 points 3 days ago Far cry from mid. She’s 2/10 bumped to 3 for not being obese AND fugly. permalink parent award report block reply\nMortal_Wombat 8 points 3 days ago Frigid mud. What the hell is on it's head? permalink parent award report block reply\nTellman125 11 points 3 days ago She's concerned about finding a guy who fits her spreadsheet of non-negotiable requirements, but actually the number of wealthy CEO bodybuilders who ARE out there for her is literally infinite--if we're talking about AI-generated ones. Reminds me of CryptoPunk NFTs and how thousands could be generated in a second. permalink parent award report block reply\nTransparency 4 points 3 days ago \"Sorry couldn't find your man, but if you keep paying me, I totally promise keep looking.\" I hate to see people scammed, but she really does deserve to be played that way. Can she not hear herself talk? I guarantee if a group did an intervention she still would not wake up enough to remove more than 5% of her ridiculous expectations. permalink parent award report block reply\nTellman125 21 points 3 days ago She almost cracked at 0:33, after \"I'm gonna say smoothie.\" permalink parent award report block reply HunterBidensPC 13 points 3 days ago “My ideal man would drink a smoothie” This woman is a fag permalink parent award report block reply monkadelic 11 points 3 days ago Thats a protein shake!!!! I'm divorcing you, taking the kids, and ruining your life. permalink parent award report block reply Transparency 3 points 3 days ago I'm divorcing you, taking the kids, and ruining your life. Her odds of hitting 3 lotterys in a row are much better than a future containing those factors. 😂😂😂 permalink parent award report block reply RuleoVicus 1 points 3 days ago \"protein shake\" In this age of two decades of Rule 34.... permalink parent award report block reply\nHunterBidensPC 13 points 3 days ago “My ideal man would drink a smoothie” This woman is a fag permalink parent award report block reply monkadelic 11 points 3 days ago Thats a protein shake!!!! I'm divorcing you, taking the kids, and ruining your life. permalink parent award report block reply Transparency 3 points 3 days ago I'm divorcing you, taking the kids, and ruining your life. Her odds of hitting 3 lotterys in a row are much better than a future containing those factors. 😂😂😂 permalink parent award report block reply RuleoVicus 1 points 3 days ago \"protein shake\" In this age of two decades of Rule 34.... permalink parent award report block reply\nmonkadelic 11 points 3 days ago Thats a protein shake!!!! I'm divorcing you, taking the kids, and ruining your life. permalink parent award report block reply Transparency 3 points 3 days ago I'm divorcing you, taking the kids, and ruining your life. Her odds of hitting 3 lotterys in a row are much better than a future containing those factors. 😂😂😂 permalink parent award report block reply RuleoVicus 1 points 3 days ago \"protein shake\" In this age of two decades of Rule 34.... permalink parent award report block reply\nTransparency 3 points 3 days ago I'm divorcing you, taking the kids, and ruining your life. Her odds of hitting 3 lotterys in a row are much better than a future containing those factors. 😂😂😂 permalink parent award report block reply\nRuleoVicus 1 points 3 days ago \"protein shake\" In this age of two decades of Rule 34.... permalink parent award report block reply\ndrattastic1 13 points 3 days ago How long? How about never you gargoyle looking bitch. The few men that could live up to those standards marry top tier women and this woman is a hard\n4 or 5 (at best) with the personality of a rattlesnake that takes her down to a 1 or 2. Enjoy your cats cunt. permalink parent award report block reply Transparency 6 points 3 days ago with the personality of a rattlesnake that takes her down to a 1 or 2. Honestly, a lot of guys need to realize that women like her do not even get rated positively. That cunt WILL Destroy your life... Guaranteed! She rates a negative-pick a number. You move as far AWAY from that trash as Fast as possible!! Save YOURSELF, Gentlemen. permalink parent award report block reply RuleoVicus 1 points 3 days ago A good pump and dump later. Unlike fagos, lesbos carry far fewer diseases. Also they really like the D but in a creepy way. Approach at own risk. permalink parent award report block reply\nTransparency 6 points 3 days ago with the personality of a rattlesnake that takes her down to a 1 or 2. Honestly, a lot of guys need to realize that women like her do not even get rated positively. That cunt WILL Destroy your life... Guaranteed! She rates a negative-pick a number. You move as far AWAY from that trash as Fast as possible!! Save YOURSELF, Gentlemen. permalink parent award report block reply\nRuleoVicus 1 points 3 days ago A good pump and dump later. Unlike fagos, lesbos carry far fewer diseases. Also they really like the D but in a creepy way. Approach at own risk. permalink parent award report block reply\nawsure 53 points 3 days ago Those eggs aren’t gonna get fertilized ever permalink award report block reply UH69MAGA 21 points 3 days ago She has a German Shepherd. permalink parent award report block reply MyDadLikedBiden 8 points 3 days ago 39andMe permalink parent award report block reply Transparency 3 points 3 days ago She has a German Shepherd. Yep: Dogpill enters the chat. (Look it up) permalink parent award report block reply 27Sandino 4 points 3 days ago Coach redpill (rip, and fuck the midget jew for killing him) used to talk about this It's far more women than people think permalink parent award report block reply SenorTrumper 2 points 2 days ago CRP RIP permalink parent award report block reply view 1 more comments... The_Emperor 1 points 3 days ago Nah, she wants a cat person over a dog person. permalink parent award report block reply Tele_Plus 0 points 3 days ago wtf permalink parent award report block reply RuleoVicus 3 points 3 days ago Why are you being brigaded with DVs? Holy shit! permalink parent award report block reply Tele_Plus 0 points 3 days ago I know!  lol I was going to add that I omitted the “lol” after the “wtf” but figured it was enough.  I either have a bot assigned to me, or people here have too much of a mob mentality, which is likely true.  If a post is voted 0 or -1, people will follow suit and downvote without even thinking. permalink parent award report block reply HillarysFUPA 9 points 3 days ago But how will she ever get an abortion in solidarity? permalink parent award report block reply Transparency 4 points 3 days ago Those eggs aren’t gonna get fertilized ever Doesn't matter if they do- she'll just get it aborted. Then pay SHIT-TONS of $$$$ in her 40s to try to have a baby, but the previous abortionS will have already defeated that. permalink parent award report block reply\nUH69MAGA 21 points 3 days ago She has a German Shepherd. permalink parent award report block reply MyDadLikedBiden 8 points 3 days ago 39andMe permalink parent award report block reply Transparency 3 points 3 days ago She has a German Shepherd. Yep: Dogpill enters the chat. (Look it up) permalink parent award report block reply 27Sandino 4 points 3 days ago Coach redpill (rip, and fuck the midget jew for killing him) used to talk about this It's far more women than people think permalink parent award report block reply SenorTrumper 2 points 2 days ago CRP RIP permalink parent award report block reply view 1 more comments... The_Emperor 1 points 3 days ago Nah, she wants a cat person over a dog person. permalink parent award report block reply Tele_Plus 0 points 3 days ago wtf permalink parent award report block reply RuleoVicus 3 points 3 days ago Why are you being brigaded with DVs? Holy shit! permalink parent award report block reply Tele_Plus 0 points 3 days ago I know!  lol I was going to add that I omitted the “lol” after the “wtf” but figured it was enough.  I either have a bot assigned to me, or people here have too much of a mob mentality, which is likely true.  If a post is voted 0 or -1, people will follow suit and downvote without even thinking. permalink parent award report block reply\nMyDadLikedBiden 8 points 3 days ago 39andMe permalink parent award report block reply\nTransparency 3 points 3 days ago She has a German Shepherd. Yep: Dogpill enters the chat. (Look it up) permalink parent award report block reply 27Sandino 4 points 3 days ago Coach redpill (rip, and fuck the midget jew for killing him) used to talk about this It's far more women than people think permalink parent award report block reply SenorTrumper 2 points 2 days ago CRP RIP permalink parent award report block reply view 1 more comments...\n27Sandino 4 points 3 days ago Coach redpill (rip, and fuck the midget jew for killing him) used to talk about this It's far more women than people think permalink parent award report block reply SenorTrumper 2 points 2 days ago CRP RIP permalink parent award report block reply view 1 more comments...\nSenorTrumper 2 points 2 days ago CRP RIP permalink parent award report block reply view 1 more comments...\nThe_Emperor 1 points 3 days ago Nah, she wants a cat person over a dog person. permalink parent award report block reply\nTele_Plus 0 points 3 days ago wtf permalink parent award report block reply RuleoVicus 3 points 3 days ago Why are you being brigaded with DVs? Holy shit! permalink parent award report block reply Tele_Plus 0 points 3 days ago I know!  lol I was going to add that I omitted the “lol” after the “wtf” but figured it was enough.  I either have a bot assigned to me, or people here have too much of a mob mentality, which is likely true.  If a post is voted 0 or -1, people will follow suit and downvote without even thinking. permalink parent award report block reply\nRuleoVicus 3 points 3 days ago Why are you being brigaded with DVs? Holy shit! permalink parent award report block reply Tele_Plus 0 points 3 days ago I know!  lol I was going to add that I omitted the “lol” after the “wtf” but figured it was enough.  I either have a bot assigned to me, or people here have too much of a mob mentality, which is likely true.  If a post is voted 0 or -1, people will follow suit and downvote without even thinking. permalink parent award report block reply\nTele_Plus 0 points 3 days ago I know!  lol I was going to add that I omitted the “lol” after the “wtf” but figured it was enough.  I either have a bot assigned to me, or people here have too much of a mob mentality, which is likely true.  If a post is voted 0 or -1, people will follow suit and downvote without even thinking. permalink parent award report block reply\nHillarysFUPA 9 points 3 days ago But how will she ever get an abortion in solidarity? permalink parent award report block reply\nTransparency 4 points 3 days ago Those eggs aren’t gonna get fertilized ever Doesn't matter if they do- she'll just get it aborted. Then pay SHIT-TONS of $$$$ in her 40s to try to have a baby, but the previous abortionS will have already defeated that. permalink parent award report block reply\nsanitaryshaver 49 points 3 days ago All that for a 3. Jesus permalink award report block reply ThorsonTT 37 points 3 days ago Female social norms affirm that every woman is a 10. permalink parent award report block reply Tellman125 10 points 3 days ago The Era of Snapchat Filter Feminism. Our country has over 160M models. I mean, if you're going by digitally altered selfies and not how they look in meatspace (also known as real life). permalink parent award report block reply RuleoVicus 7 points 3 days ago In ancient times when PoF [Plenty of Fish] was contemporary THE ONE TIME I used it I was catfished HARD. Bitch looked like a 200lb melted candle when I pulled up to her house. That's not fucking right people. permalink parent award report block reply user2827 2 points 3 days ago I remember PoF, I did meet a couple people, only one of which was not obese (that one wound up being crazy). It's easy to get caught when it's a cute face picture, but one of them literally could barely fit in her own car... permalink parent award report block reply Transparency 1 points 3 days ago The Era of Snapchat Filter Feminism. Yup. That filter use shows you beyond the shadow of ANY doubt how PATENTLY DISHONEST the majority of women actually are. permalink parent award report block reply user2827 1 points 3 days ago What are you talking about; lying about her face with makeup, her boobs with padding, her legs with tights, hair color, height, and weight... but expects an honest man. permalink parent award report block reply Transparency 1 points 3 days ago Female social norms affirm that every woman is a 10. You are not wrong. Here's proof: https://www.youtube.com/watch?v=CzJILyLdT8k permalink parent award report block reply Tellman125 21 points 3 days ago \"Be a Christian, but not take it too seriously,\" meaning to \"You must spend a lot of money (as you DO make a 7-figure salary) on all the Christmas gifts I ask for. ALL of them.\" permalink parent award report block reply IroWide 13 points 3 days ago Claim to follow Jesus, but don't actually follow Jesus and wind up in hell. permalink parent award report block reply Transparency 11 points 3 days ago \"Be a Christian, but not take it too seriously,\" meaning to No. It means that she wants to treat it like a smorgasbord, including enforcing what she wants on HIM. SHE will pick and choose and he will obey while he \"leads\". permalink parent award report block reply ThorsonTT 4 points 3 days ago Be a Christian = you must be moral and faithful.  Me, not so much. permalink parent award report block reply MediaBro 1 points 3 days ago She basically means a Cultural Christian. Keeps the trimmings of Christianity and the cultural aspect but doesn't care for the morals and the demanding nature of what it expects. Technically, these make up a good 80% of all Christians tbh, so it will actually be easier to find him. permalink parent award report block reply Mortal_Wombat 15 points 3 days ago 3? You're generous 🤣 permalink parent award report block reply 3-10 22 points 3 days ago I guess the lack of obesity is plus 2 permalink parent award report block reply Mortal_Wombat 12 points 3 days ago Sustained. Please proceed 😂 permalink parent award report block reply Transparency 2 points 3 days ago The attitude and general level of stupidity makes her a minimum -11. permalink parent award report block reply MyDadLikedBiden 10 points 3 days ago More like 𝑒 because she’s irrational . permalink parent award report block reply CommanderOfCheese 4 points 3 days ago Pi, because that's clearly what she eats too much of. permalink parent award report block reply alfredbester 3 points 3 days ago Your Dad liked that joke, too. permalink parent award report block reply RuleoVicus 4 points 3 days ago My fellow fren, I'm am the king of dad jokes. I've made up quite a few. Heard it here first- What do you call an abusive sandwich? A slappy Joe. permalink parent award report block reply scottcaver1 12 points 3 days ago Hoeflation permalink parent award report block reply TwoArizonaPedes 8 points 3 days ago This is what comes from broken homes. She has absolutely no idea what a normal, healthy, functional marriage and family looks like, so she's just going off some fantasy she created in her head. And she has no idea she has no idea. There are so many damaged women and men like this, it's tragic. permalink parent award report block reply Transparency -1 points 3 days ago You just describe a shit-ton of women today. Fuck them. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago You just describe a shit-ton of women today. And men. Good ones are out there and worth the search. permalink parent award report block reply Transparency 1 points 3 days ago A lot of men today are not worth a flip from women's perspective, because they have walked away. They don't care about any of you any longer. We don't need to advertise it... we just act polite and move on. Sex? Ok. Otherwise, yeah, uh, nah. I fit that description, except sex really isn't even on the table any more. Do some research: Women are filthy disease factories. I'm not interested in getting oral or penial cancer just to get with any of you. That's not even touching on HIV/AIDS, Herpes, etc. Now some STDs are becoming untreatable. Use your vibrator and fuck machine. More and more men are even waking up to sex, because: What you offer is not longer worth it. permalink parent award report block reply view 9 more comments... load 2 more comments...\nThorsonTT 37 points 3 days ago Female social norms affirm that every woman is a 10. permalink parent award report block reply Tellman125 10 points 3 days ago The Era of Snapchat Filter Feminism. Our country has over 160M models. I mean, if you're going by digitally altered selfies and not how they look in meatspace (also known as real life). permalink parent award report block reply RuleoVicus 7 points 3 days ago In ancient times when PoF [Plenty of Fish] was contemporary THE ONE TIME I used it I was catfished HARD. Bitch looked like a 200lb melted candle when I pulled up to her house. That's not fucking right people. permalink parent award report block reply user2827 2 points 3 days ago I remember PoF, I did meet a couple people, only one of which was not obese (that one wound up being crazy). It's easy to get caught when it's a cute face picture, but one of them literally could barely fit in her own car... permalink parent award report block reply Transparency 1 points 3 days ago The Era of Snapchat Filter Feminism. Yup. That filter use shows you beyond the shadow of ANY doubt how PATENTLY DISHONEST the majority of women actually are. permalink parent award report block reply user2827 1 points 3 days ago What are you talking about; lying about her face with makeup, her boobs with padding, her legs with tights, hair color, height, and weight... but expects an honest man. permalink parent award report block reply Transparency 1 points 3 days ago Female social norms affirm that every woman is a 10. You are not wrong. Here's proof: https://www.youtube.com/watch?v=CzJILyLdT8k permalink parent award report block reply\nTellman125 10 points 3 days ago The Era of Snapchat Filter Feminism. Our country has over 160M models. I mean, if you're going by digitally altered selfies and not how they look in meatspace (also known as real life). permalink parent award report block reply RuleoVicus 7 points 3 days ago In ancient times when PoF [Plenty of Fish] was contemporary THE ONE TIME I used it I was catfished HARD. Bitch looked like a 200lb melted candle when I pulled up to her house. That's not fucking right people. permalink parent award report block reply user2827 2 points 3 days ago I remember PoF, I did meet a couple people, only one of which was not obese (that one wound up being crazy). It's easy to get caught when it's a cute face picture, but one of them literally could barely fit in her own car... permalink parent award report block reply Transparency 1 points 3 days ago The Era of Snapchat Filter Feminism. Yup. That filter use shows you beyond the shadow of ANY doubt how PATENTLY DISHONEST the majority of women actually are. permalink parent award report block reply user2827 1 points 3 days ago What are you talking about; lying about her face with makeup, her boobs with padding, her legs with tights, hair color, height, and weight... but expects an honest man. permalink parent award report block reply\nRuleoVicus 7 points 3 days ago In ancient times when PoF [Plenty of Fish] was contemporary THE ONE TIME I used it I was catfished HARD. Bitch looked like a 200lb melted candle when I pulled up to her house. That's not fucking right people. permalink parent award report block reply user2827 2 points 3 days ago I remember PoF, I did meet a couple people, only one of which was not obese (that one wound up being crazy). It's easy to get caught when it's a cute face picture, but one of them literally could barely fit in her own car... permalink parent award report block reply\nuser2827 2 points 3 days ago I remember PoF, I did meet a couple people, only one of which was not obese (that one wound up being crazy). It's easy to get caught when it's a cute face picture, but one of them literally could barely fit in her own car... permalink parent award report block reply\nTransparency 1 points 3 days ago The Era of Snapchat Filter Feminism. Yup. That filter use shows you beyond the shadow of ANY doubt how PATENTLY DISHONEST the majority of women actually are. permalink parent award report block reply user2827 1 points 3 days ago What are you talking about; lying about her face with makeup, her boobs with padding, her legs with tights, hair color, height, and weight... but expects an honest man. permalink parent award report block reply\nuser2827 1 points 3 days ago What are you talking about; lying about her face with makeup, her boobs with padding, her legs with tights, hair color, height, and weight... but expects an honest man. permalink parent award report block reply\nTransparency 1 points 3 days ago Female social norms affirm that every woman is a 10. You are not wrong. Here's proof: https://www.youtube.com/watch?v=CzJILyLdT8k permalink parent award report block reply\nTellman125 21 points 3 days ago \"Be a Christian, but not take it too seriously,\" meaning to \"You must spend a lot of money (as you DO make a 7-figure salary) on all the Christmas gifts I ask for. ALL of them.\" permalink parent award report block reply IroWide 13 points 3 days ago Claim to follow Jesus, but don't actually follow Jesus and wind up in hell. permalink parent award report block reply Transparency 11 points 3 days ago \"Be a Christian, but not take it too seriously,\" meaning to No. It means that she wants to treat it like a smorgasbord, including enforcing what she wants on HIM. SHE will pick and choose and he will obey while he \"leads\". permalink parent award report block reply ThorsonTT 4 points 3 days ago Be a Christian = you must be moral and faithful.  Me, not so much. permalink parent award report block reply MediaBro 1 points 3 days ago She basically means a Cultural Christian. Keeps the trimmings of Christianity and the cultural aspect but doesn't care for the morals and the demanding nature of what it expects. Technically, these make up a good 80% of all Christians tbh, so it will actually be easier to find him. permalink parent award report block reply\nIroWide 13 points 3 days ago Claim to follow Jesus, but don't actually follow Jesus and wind up in hell. permalink parent award report block reply\nTransparency 11 points 3 days ago \"Be a Christian, but not take it too seriously,\" meaning to No. It means that she wants to treat it like a smorgasbord, including enforcing what she wants on HIM. SHE will pick and choose and he will obey while he \"leads\". permalink parent award report block reply\nThorsonTT 4 points 3 days ago Be a Christian = you must be moral and faithful.  Me, not so much. permalink parent award report block reply\nMediaBro 1 points 3 days ago She basically means a Cultural Christian. Keeps the trimmings of Christianity and the cultural aspect but doesn't care for the morals and the demanding nature of what it expects. Technically, these make up a good 80% of all Christians tbh, so it will actually be easier to find him. permalink parent award report block reply\nMortal_Wombat 15 points 3 days ago 3? You're generous 🤣 permalink parent award report block reply 3-10 22 points 3 days ago I guess the lack of obesity is plus 2 permalink parent award report block reply Mortal_Wombat 12 points 3 days ago Sustained. Please proceed 😂 permalink parent award report block reply Transparency 2 points 3 days ago The attitude and general level of stupidity makes her a minimum -11. permalink parent award report block reply MyDadLikedBiden 10 points 3 days ago More like 𝑒 because she’s irrational . permalink parent award report block reply CommanderOfCheese 4 points 3 days ago Pi, because that's clearly what she eats too much of. permalink parent award report block reply alfredbester 3 points 3 days ago Your Dad liked that joke, too. permalink parent award report block reply RuleoVicus 4 points 3 days ago My fellow fren, I'm am the king of dad jokes. I've made up quite a few. Heard it here first- What do you call an abusive sandwich? A slappy Joe. permalink parent award report block reply\n3-10 22 points 3 days ago I guess the lack of obesity is plus 2 permalink parent award report block reply Mortal_Wombat 12 points 3 days ago Sustained. Please proceed 😂 permalink parent award report block reply Transparency 2 points 3 days ago The attitude and general level of stupidity makes her a minimum -11. permalink parent award report block reply\nMortal_Wombat 12 points 3 days ago Sustained. Please proceed 😂 permalink parent award report block reply\nTransparency 2 points 3 days ago The attitude and general level of stupidity makes her a minimum -11. permalink parent award report block reply\nMyDadLikedBiden 10 points 3 days ago More like 𝑒 because she’s irrational . permalink parent award report block reply CommanderOfCheese 4 points 3 days ago Pi, because that's clearly what she eats too much of. permalink parent award report block reply alfredbester 3 points 3 days ago Your Dad liked that joke, too. permalink parent award report block reply RuleoVicus 4 points 3 days ago My fellow fren, I'm am the king of dad jokes. I've made up quite a few. Heard it here first- What do you call an abusive sandwich? A slappy Joe. permalink parent award report block reply\nCommanderOfCheese 4 points 3 days ago Pi, because that's clearly what she eats too much of. permalink parent award report block reply\nalfredbester 3 points 3 days ago Your Dad liked that joke, too. permalink parent award report block reply RuleoVicus 4 points 3 days ago My fellow fren, I'm am the king of dad jokes. I've made up quite a few. Heard it here first- What do you call an abusive sandwich? A slappy Joe. permalink parent award report block reply\nRuleoVicus 4 points 3 days ago My fellow fren, I'm am the king of dad jokes. I've made up quite a few. Heard it here first- What do you call an abusive sandwich? A slappy Joe. permalink parent award report block reply\nscottcaver1 12 points 3 days ago Hoeflation permalink parent award report block reply\nTwoArizonaPedes 8 points 3 days ago This is what comes from broken homes. She has absolutely no idea what a normal, healthy, functional marriage and family looks like, so she's just going off some fantasy she created in her head. And she has no idea she has no idea. There are so many damaged women and men like this, it's tragic. permalink parent award report block reply Transparency -1 points 3 days ago You just describe a shit-ton of women today. Fuck them. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago You just describe a shit-ton of women today. And men. Good ones are out there and worth the search. permalink parent award report block reply Transparency 1 points 3 days ago A lot of men today are not worth a flip from women's perspective, because they have walked away. They don't care about any of you any longer. We don't need to advertise it... we just act polite and move on. Sex? Ok. Otherwise, yeah, uh, nah. I fit that description, except sex really isn't even on the table any more. Do some research: Women are filthy disease factories. I'm not interested in getting oral or penial cancer just to get with any of you. That's not even touching on HIV/AIDS, Herpes, etc. Now some STDs are becoming untreatable. Use your vibrator and fuck machine. More and more men are even waking up to sex, because: What you offer is not longer worth it. permalink parent award report block reply view 9 more comments...\nTransparency -1 points 3 days ago You just describe a shit-ton of women today. Fuck them. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago You just describe a shit-ton of women today. And men. Good ones are out there and worth the search. permalink parent award report block reply Transparency 1 points 3 days ago A lot of men today are not worth a flip from women's perspective, because they have walked away. They don't care about any of you any longer. We don't need to advertise it... we just act polite and move on. Sex? Ok. Otherwise, yeah, uh, nah. I fit that description, except sex really isn't even on the table any more. Do some research: Women are filthy disease factories. I'm not interested in getting oral or penial cancer just to get with any of you. That's not even touching on HIV/AIDS, Herpes, etc. Now some STDs are becoming untreatable. Use your vibrator and fuck machine. More and more men are even waking up to sex, because: What you offer is not longer worth it. permalink parent award report block reply view 9 more comments...\nTwoArizonaPedes 5 points 3 days ago You just describe a shit-ton of women today. And men. Good ones are out there and worth the search. permalink parent award report block reply Transparency 1 points 3 days ago A lot of men today are not worth a flip from women's perspective, because they have walked away. They don't care about any of you any longer. We don't need to advertise it... we just act polite and move on. Sex? Ok. Otherwise, yeah, uh, nah. I fit that description, except sex really isn't even on the table any more. Do some research: Women are filthy disease factories. I'm not interested in getting oral or penial cancer just to get with any of you. That's not even touching on HIV/AIDS, Herpes, etc. Now some STDs are becoming untreatable. Use your vibrator and fuck machine. More and more men are even waking up to sex, because: What you offer is not longer worth it. permalink parent award report block reply view 9 more comments...\nTransparency 1 points 3 days ago A lot of men today are not worth a flip from women's perspective, because they have walked away. They don't care about any of you any longer. We don't need to advertise it... we just act polite and move on. Sex? Ok. Otherwise, yeah, uh, nah. I fit that description, except sex really isn't even on the table any more. Do some research: Women are filthy disease factories. I'm not interested in getting oral or penial cancer just to get with any of you. That's not even touching on HIV/AIDS, Herpes, etc. Now some STDs are becoming untreatable. Use your vibrator and fuck machine. More and more men are even waking up to sex, because: What you offer is not longer worth it. permalink parent award report block reply view 9 more comments...\nMAGA-Fett 34 points 3 days ago LOL, “I want a Christian….but he can’t take it too seriously”. permalink award report block reply Tellman125 11 points 3 days ago \"Buy me a new vacation home and 5 new sports cars--OR luxury cars--every Christmas. That's what I mean.\" permalink parent award report block reply gorilla_grip 7 points 3 days ago I seriously just spit some coffee out when she said that. permalink parent award report block reply YaharaRiver 3 points 3 days ago Code for “NO fucking muslims, nyet nada NO.” permalink parent award report block reply\nTellman125 11 points 3 days ago \"Buy me a new vacation home and 5 new sports cars--OR luxury cars--every Christmas. That's what I mean.\" permalink parent award report block reply\ngorilla_grip 7 points 3 days ago I seriously just spit some coffee out when she said that. permalink parent award report block reply\nYaharaRiver 3 points 3 days ago Code for “NO fucking muslims, nyet nada NO.” permalink parent award report block reply\nRetard_Strength 27 points 3 days ago other than the 7 figure salary, she could find what she's looking for in a gay bar permalink award report block reply\nConsrvspkgNJ 25 points 3 days ago She is gonna die smelling of cat piss..... permalink award report block reply monkadelic 11 points 3 days ago Her cats' last meal, will be her. permalink parent award report block reply RuleoVicus 2 points 3 days ago 💀 permalink parent award report block reply booblitchutz 7 points 3 days ago Or strangled to death by her jigaboo booty call. permalink parent award report block reply RuleoVicus 3 points 3 days ago Burn coal pay toll permalink parent award report block reply\nmonkadelic 11 points 3 days ago Her cats' last meal, will be her. permalink parent award report block reply RuleoVicus 2 points 3 days ago 💀 permalink parent award report block reply\nRuleoVicus 2 points 3 days ago 💀 permalink parent award report block reply\nbooblitchutz 7 points 3 days ago Or strangled to death by her jigaboo booty call. permalink parent award report block reply RuleoVicus 3 points 3 days ago Burn coal pay toll permalink parent award report block reply\nRuleoVicus 3 points 3 days ago Burn coal pay toll permalink parent award report block reply\nSlugbert 24 points 3 days ago JFC, I turned it off after she listed the wardrobe color requirements she’s expecting from her would-be unicorn. Absolutely insufferable. The matchmaker’s reaction and facial expressions were hilarious, though. permalink award report block reply\nFormerlurker92 23 points 3 days ago If he's good enough for you, he's good enough for a few. So why would he settle for you permalink award report block reply RuleoVicus 9 points 3 days ago \"A key that can open any lock is a great key. A lock that any key can open is a terrible lock.\" some based dude permalink parent award report block reply\nRuleoVicus 9 points 3 days ago \"A key that can open any lock is a great key. A lock that any key can open is a terrible lock.\" some based dude permalink parent award report block reply\nFloppybutthole 20 points 3 days ago Why would this man want you? Ok yeah there's billions of people out there but from his perspective the nice cute girl working at Starbucks is higher up on his list than you. permalink award report block reply RuprechtThaMonkeyBoy 13 points 3 days ago Hell, with those demands even a plain Jane is a better option. (The girl in the video is sub-plain Jane) permalink parent award report block reply Transparency 6 points 3 days ago the nice cute girl working at Starbucks is higher up on his list than you. ...but...but...but... She has TWO Degrees!!!! (like anybody cares. Not 1 hard-on has been produced by looking at a woman's degree.) permalink parent award report block reply Floppybutthole 4 points 3 days ago Emphasis on the word nice permalink parent award report block reply Tellman125 5 points 3 days ago And meanwhile this girl is literally asking for someone who could buy her the entire Starbucks franchise if she asked him for it. permalink parent award report block reply MyDadLikedBiden 4 points 3 days ago But Starbucks stores are corporate-owned. The cheapest way I can think of would be a hotel containing a cafe that is licensed to sell Starbucks coffee. permalink parent award report block reply\nRuprechtThaMonkeyBoy 13 points 3 days ago Hell, with those demands even a plain Jane is a better option. (The girl in the video is sub-plain Jane) permalink parent award report block reply\nTransparency 6 points 3 days ago the nice cute girl working at Starbucks is higher up on his list than you. ...but...but...but... She has TWO Degrees!!!! (like anybody cares. Not 1 hard-on has been produced by looking at a woman's degree.) permalink parent award report block reply Floppybutthole 4 points 3 days ago Emphasis on the word nice permalink parent award report block reply\nFloppybutthole 4 points 3 days ago Emphasis on the word nice permalink parent award report block reply\nTellman125 5 points 3 days ago And meanwhile this girl is literally asking for someone who could buy her the entire Starbucks franchise if she asked him for it. permalink parent award report block reply MyDadLikedBiden 4 points 3 days ago But Starbucks stores are corporate-owned. The cheapest way I can think of would be a hotel containing a cafe that is licensed to sell Starbucks coffee. permalink parent award report block reply\nMyDadLikedBiden 4 points 3 days ago But Starbucks stores are corporate-owned. The cheapest way I can think of would be a hotel containing a cafe that is licensed to sell Starbucks coffee. permalink parent award report block reply\nSeatacjoe 19 points 3 days ago This has to be a joke. permalink award report block reply LostElf 13 points 3 days ago Sadly, this probably happens all the time. So many women are mentally unfit. Their future is manless, childless, lonely, frustrated, furiously angry at the world for not living up to expectations, and propping up unamused cats on social media in a desperate bid for human connection. permalink parent award report block reply Transparency 4 points 3 days ago Millions and millions lied to and played by Feminism. permalink parent award report block reply bidensmissingbrain 4 points 3 days ago No, this is modern women. Now you know why so many men have checked out. THIS is what the alternative is. permalink parent award report block reply nakedjay 2 points 3 days ago We've gone from 6 figures, 6 feet, 6 inches to 7 figures, great body, and smoothie drinker. permalink parent award report block reply Transparency 1 points 3 days ago This has to be a joke. Oh, it's not a joke. It's not satire. Society has been publicly making fun of those imbeciles for at least several years now. They are a dime a dozen. permalink parent award report block reply\nLostElf 13 points 3 days ago Sadly, this probably happens all the time. So many women are mentally unfit. Their future is manless, childless, lonely, frustrated, furiously angry at the world for not living up to expectations, and propping up unamused cats on social media in a desperate bid for human connection. permalink parent award report block reply Transparency 4 points 3 days ago Millions and millions lied to and played by Feminism. permalink parent award report block reply\nTransparency 4 points 3 days ago Millions and millions lied to and played by Feminism. permalink parent award report block reply\nbidensmissingbrain 4 points 3 days ago No, this is modern women. Now you know why so many men have checked out. THIS is what the alternative is. permalink parent award report block reply nakedjay 2 points 3 days ago We've gone from 6 figures, 6 feet, 6 inches to 7 figures, great body, and smoothie drinker. permalink parent award report block reply\nnakedjay 2 points 3 days ago We've gone from 6 figures, 6 feet, 6 inches to 7 figures, great body, and smoothie drinker. permalink parent award report block reply\nTransparency 1 points 3 days ago This has to be a joke. Oh, it's not a joke. It's not satire. Society has been publicly making fun of those imbeciles for at least several years now. They are a dime a dozen. permalink parent award report block reply\nSavingPrivateGrace 18 points 3 days ago Beware contenders, it appears she pulls her own hair out. permalink award report block reply Mortal_Wombat 9 points 3 days ago Trichotillomania. Knew a few people that had this. Strange. permalink parent award report block reply Transparency 5 points 3 days ago Same thing birds do (pull feathers) when they are overly stressed. Birds pull their feathers, a behavior known as feather plucking, when they experience stress, boredom, or discomfort. This can lead to physical and emotional issues, making it important to address the underlying causes to help the bird recover. https://duckduckgo.com/?q=feather+plucking&atb=v498-1&ia=images&iax=images permalink parent award report block reply monkadelic 6 points 3 days ago explains the insistence he has all of his permalink parent award report block reply\nMortal_Wombat 9 points 3 days ago Trichotillomania. Knew a few people that had this. Strange. permalink parent award report block reply Transparency 5 points 3 days ago Same thing birds do (pull feathers) when they are overly stressed. Birds pull their feathers, a behavior known as feather plucking, when they experience stress, boredom, or discomfort. This can lead to physical and emotional issues, making it important to address the underlying causes to help the bird recover. https://duckduckgo.com/?q=feather+plucking&atb=v498-1&ia=images&iax=images permalink parent award report block reply\nTransparency 5 points 3 days ago Same thing birds do (pull feathers) when they are overly stressed. Birds pull their feathers, a behavior known as feather plucking, when they experience stress, boredom, or discomfort. This can lead to physical and emotional issues, making it important to address the underlying causes to help the bird recover. https://duckduckgo.com/?q=feather+plucking&atb=v498-1&ia=images&iax=images permalink parent award report block reply\nmonkadelic 6 points 3 days ago explains the insistence he has all of his permalink parent award report block reply\nTellman125 14 points 3 days ago She's very insistently asking a for a business executive who is also a health-conscious gym rat, but even setting aside what her job and her professional level may be, does she look someone who's in awesome shape? She looks more like she has the physique of an ACTUAL rat standing on its hind legs. In fact, compare her shoulders with the shoulders of the interviewer; the interview looks like SHE'S in good shape. And we see that she definitely has a job too. I assume she may be the one who released this video. permalink award report block reply LostElf 5 points 3 days ago I'm a woman so I can't speak for guys, but wouldn't most men find the interviewer more attractive? She's quieter, clearly more intelligent, has a sense of humor, doesn't croak out every statement as a question.... permalink parent award report block reply monkadelic 10 points 3 days ago I'll speak for men here.  Absolutely.  The shrew doesn't have a single attractive quality, the contrast between her and the interviewer made that even more clear. permalink parent award report block reply Crappydatum 6 points 3 days ago I have no knowledge on this, but suspect the interviewer is some kind of matchmaker? permalink parent award report block reply MyDadLikedBiden 3 points 3 days ago Yes, thelovearchitects.com permalink parent award report block reply LostElf 3 points 3 days ago Yep, take the crazy's money and put her on the laugh list. permalink parent award report block reply Crappydatum 2 points 3 days ago Win win! permalink parent award report block reply Transparency 1 points 3 days ago Unfortunately, she deserves it. I hate to see people \"scammed\", but sometimes it's fair and may turn out to be in their best interest. permalink parent award report block reply Transparency 2 points 3 days ago but suspect the interviewer is some kind of matchmaker? She is, and she started voicing this reality at least a few years ago, and she is not the only matchmaker to do so. Women today are beyond ridiculous. Even butch-lesbians are making the same complaints as men. For real. 😂😂😂🤡🌎 Just keep screaming \"Incel!!!\", ladies, because, incel or not, shit-tons of men have already walked away. We're done. You can die alone. Good riddance. permalink parent award report block reply Crappydatum 2 points 3 days ago They won't die alone, they'll have their dozen cats, and the cats will eat their corpses permalink parent award report block reply Nibba2 6 points 3 days ago Everybody finds the interviewer more attractive. Just the inflection in that demanding woman’s voice would put off anyone with options. permalink parent award report block reply Transparency 3 points 3 days ago wouldn't most men find the interviewer more attractive? MUCH more attractive. 👍👍 permalink parent award report block reply nakedjay 1 points 3 days ago I think her dream man is Patrick Bateman. permalink parent award report block reply\nLostElf 5 points 3 days ago I'm a woman so I can't speak for guys, but wouldn't most men find the interviewer more attractive? She's quieter, clearly more intelligent, has a sense of humor, doesn't croak out every statement as a question.... permalink parent award report block reply monkadelic 10 points 3 days ago I'll speak for men here.  Absolutely.  The shrew doesn't have a single attractive quality, the contrast between her and the interviewer made that even more clear. permalink parent award report block reply Crappydatum 6 points 3 days ago I have no knowledge on this, but suspect the interviewer is some kind of matchmaker? permalink parent award report block reply MyDadLikedBiden 3 points 3 days ago Yes, thelovearchitects.com permalink parent award report block reply LostElf 3 points 3 days ago Yep, take the crazy's money and put her on the laugh list. permalink parent award report block reply Crappydatum 2 points 3 days ago Win win! permalink parent award report block reply Transparency 1 points 3 days ago Unfortunately, she deserves it. I hate to see people \"scammed\", but sometimes it's fair and may turn out to be in their best interest. permalink parent award report block reply Transparency 2 points 3 days ago but suspect the interviewer is some kind of matchmaker? She is, and she started voicing this reality at least a few years ago, and she is not the only matchmaker to do so. Women today are beyond ridiculous. Even butch-lesbians are making the same complaints as men. For real. 😂😂😂🤡🌎 Just keep screaming \"Incel!!!\", ladies, because, incel or not, shit-tons of men have already walked away. We're done. You can die alone. Good riddance. permalink parent award report block reply Crappydatum 2 points 3 days ago They won't die alone, they'll have their dozen cats, and the cats will eat their corpses permalink parent award report block reply Nibba2 6 points 3 days ago Everybody finds the interviewer more attractive. Just the inflection in that demanding woman’s voice would put off anyone with options. permalink parent award report block reply Transparency 3 points 3 days ago wouldn't most men find the interviewer more attractive? MUCH more attractive. 👍👍 permalink parent award report block reply\nmonkadelic 10 points 3 days ago I'll speak for men here.  Absolutely.  The shrew doesn't have a single attractive quality, the contrast between her and the interviewer made that even more clear. permalink parent award report block reply\nCrappydatum 6 points 3 days ago I have no knowledge on this, but suspect the interviewer is some kind of matchmaker? permalink parent award report block reply MyDadLikedBiden 3 points 3 days ago Yes, thelovearchitects.com permalink parent award report block reply LostElf 3 points 3 days ago Yep, take the crazy's money and put her on the laugh list. permalink parent award report block reply Crappydatum 2 points 3 days ago Win win! permalink parent award report block reply Transparency 1 points 3 days ago Unfortunately, she deserves it. I hate to see people \"scammed\", but sometimes it's fair and may turn out to be in their best interest. permalink parent award report block reply Transparency 2 points 3 days ago but suspect the interviewer is some kind of matchmaker? She is, and she started voicing this reality at least a few years ago, and she is not the only matchmaker to do so. Women today are beyond ridiculous. Even butch-lesbians are making the same complaints as men. For real. 😂😂😂🤡🌎 Just keep screaming \"Incel!!!\", ladies, because, incel or not, shit-tons of men have already walked away. We're done. You can die alone. Good riddance. permalink parent award report block reply Crappydatum 2 points 3 days ago They won't die alone, they'll have their dozen cats, and the cats will eat their corpses permalink parent award report block reply\nMyDadLikedBiden 3 points 3 days ago Yes, thelovearchitects.com permalink parent award report block reply\nLostElf 3 points 3 days ago Yep, take the crazy's money and put her on the laugh list. permalink parent award report block reply Crappydatum 2 points 3 days ago Win win! permalink parent award report block reply Transparency 1 points 3 days ago Unfortunately, she deserves it. I hate to see people \"scammed\", but sometimes it's fair and may turn out to be in their best interest. permalink parent award report block reply\nCrappydatum 2 points 3 days ago Win win! permalink parent award report block reply\nTransparency 1 points 3 days ago Unfortunately, she deserves it. I hate to see people \"scammed\", but sometimes it's fair and may turn out to be in their best interest. permalink parent award report block reply\nTransparency 2 points 3 days ago but suspect the interviewer is some kind of matchmaker? She is, and she started voicing this reality at least a few years ago, and she is not the only matchmaker to do so. Women today are beyond ridiculous. Even butch-lesbians are making the same complaints as men. For real. 😂😂😂🤡🌎 Just keep screaming \"Incel!!!\", ladies, because, incel or not, shit-tons of men have already walked away. We're done. You can die alone. Good riddance. permalink parent award report block reply Crappydatum 2 points 3 days ago They won't die alone, they'll have their dozen cats, and the cats will eat their corpses permalink parent award report block reply\nCrappydatum 2 points 3 days ago They won't die alone, they'll have their dozen cats, and the cats will eat their corpses permalink parent award report block reply\nNibba2 6 points 3 days ago Everybody finds the interviewer more attractive. Just the inflection in that demanding woman’s voice would put off anyone with options. permalink parent award report block reply\nTransparency 3 points 3 days ago wouldn't most men find the interviewer more attractive? MUCH more attractive. 👍👍 permalink parent award report block reply\nnakedjay 1 points 3 days ago I think her dream man is Patrick Bateman. permalink parent award report block reply\nAccount 13 points 3 days ago Big tattoo guys who were forced to get them as part of Ivy League secret societies are right, she is a bitch. permalink award report block reply booblitchutz 10 points 3 days ago She’s saying she’ll “settle” for a member of Skull & Bones Society. Lol okay sugar. permalink parent award report block reply\nbooblitchutz 10 points 3 days ago She’s saying she’ll “settle” for a member of Skull & Bones Society. Lol okay sugar. permalink parent award report block reply\nRun_over_Antifa 13 points 3 days ago lol, I am sure there are plenty of cats out there for her. permalink award report block reply\nSkogin 13 points 3 days ago It’s me! She’s talking about meee!!! permalink award report block reply SnowSnake 6 points 3 days ago Then do the Sam Kinison: cum on her back, steal her cash, and slip out the window. Why's my back wet? Where's my money? Why's the window open? Boo hoo hoo! permalink parent award report block reply Skogin 5 points 3 days ago I don’t normally treat women that way, but for her, I can make an exception. permalink parent award report block reply SnowSnake 4 points 3 days ago Oh, me either. But the dark side laughs along with the idea. permalink parent award report block reply flashersenpai 1 points 3 days ago lmao permalink parent award report block reply\nSnowSnake 6 points 3 days ago Then do the Sam Kinison: cum on her back, steal her cash, and slip out the window. Why's my back wet? Where's my money? Why's the window open? Boo hoo hoo! permalink parent award report block reply Skogin 5 points 3 days ago I don’t normally treat women that way, but for her, I can make an exception. permalink parent award report block reply SnowSnake 4 points 3 days ago Oh, me either. But the dark side laughs along with the idea. permalink parent award report block reply\nSkogin 5 points 3 days ago I don’t normally treat women that way, but for her, I can make an exception. permalink parent award report block reply SnowSnake 4 points 3 days ago Oh, me either. But the dark side laughs along with the idea. permalink parent award report block reply\nSnowSnake 4 points 3 days ago Oh, me either. But the dark side laughs along with the idea. permalink parent award report block reply\nflashersenpai 1 points 3 days ago lmao permalink parent award report block reply\nitspancakees 9 points 3 days ago that man is out there... right in the mirror permalink award report block reply Transparency 2 points 3 days ago that man is out there... right in the mirror Ahhhhh, you jest! You jest! But the truth is that 1 of the reasons women today are so bitter, abrasive and insufferable is because they have had to BECOME the man that they cannot find AND LOCKDOWN. And, like it or not, women make shitty men, and they cannot even live up to their OWN standards. permalink parent award report block reply Crappydatum 1 points 3 days ago 😂😂☝️ permalink parent award report block reply\nTransparency 2 points 3 days ago that man is out there... right in the mirror Ahhhhh, you jest! You jest! But the truth is that 1 of the reasons women today are so bitter, abrasive and insufferable is because they have had to BECOME the man that they cannot find AND LOCKDOWN. And, like it or not, women make shitty men, and they cannot even live up to their OWN standards. permalink parent award report block reply\nCrappydatum 1 points 3 days ago 😂😂☝️ permalink parent award report block reply\nmydogma8yourkarma 9 points 3 days ago Corey, \"best I can do is a dozen cats\". permalink award report block reply ArtLife 2 points 3 days ago that would be a great meme. permalink parent award report block reply mydogma8yourkarma 2 points 3 days ago Ok https://patriots.win/c/TheDonald/p/1ARK5A91Sq/ permalink parent award report block reply ArtLife 1 points 3 days ago brilliant!!! love it permalink parent award report block reply\nArtLife 2 points 3 days ago that would be a great meme. permalink parent award report block reply mydogma8yourkarma 2 points 3 days ago Ok https://patriots.win/c/TheDonald/p/1ARK5A91Sq/ permalink parent award report block reply ArtLife 1 points 3 days ago brilliant!!! love it permalink parent award report block reply\nmydogma8yourkarma 2 points 3 days ago Ok https://patriots.win/c/TheDonald/p/1ARK5A91Sq/ permalink parent award report block reply ArtLife 1 points 3 days ago brilliant!!! love it permalink parent award report block reply\nArtLife 1 points 3 days ago brilliant!!! love it permalink parent award report block reply\nCrappydatum 7 points 3 days ago \"I want\" Lather rinse repeat permalink award report block reply\nOldman1234 6 points 3 days ago She's in the early stages of becoming a cat lady. permalink award report block reply booblitchutz 2 points 3 days ago Nah she’s a few weeks away from getting knocked up by the black dude she’s banging on the side. permalink parent award report block reply\nbooblitchutz 2 points 3 days ago Nah she’s a few weeks away from getting knocked up by the black dude she’s banging on the side. permalink parent award report block reply\nRight_of_Sinner 6 points 3 days ago And they complain about unrealistic expectations of them permalink award report block reply Transparency 1 points 3 days ago They're women. Get this to sink in: Nothing is ever good enough. So, they complain. When there is nothing to complain about--> They just complain LESS. If you have much experience with women: Once life finally gives you a break for a week, maybe 10 days, ---> SHE will start some shit. permalink parent award report block reply\nTransparency 1 points 3 days ago They're women. Get this to sink in: Nothing is ever good enough. So, they complain. When there is nothing to complain about--> They just complain LESS. If you have much experience with women: Once life finally gives you a break for a week, maybe 10 days, ---> SHE will start some shit. permalink parent award report block reply\nFreedomnc1776_2 6 points 3 days ago She’s a 1. Maybe a 2  she needs to lower her standards. By A LOT permalink award report block reply nakedjay 2 points 3 days ago She isn't even office hot. permalink parent award report block reply\nnakedjay 2 points 3 days ago She isn't even office hot. permalink parent award report block reply\nmagaspif 5 points 3 days ago this has to be trolling, the 7 figure salary is silly permalink award report block reply Informationinsider 2 points 3 days ago I've met a few. They were very serious. permalink parent award report block reply\nInformationinsider 2 points 3 days ago I've met a few. They were very serious. permalink parent award report block reply\nNecturusMaculosus 5 points 3 days ago I couldnt finish watching this horrible female... \"Needs to look good in blues and greens, because that's what I look good in... (while she's being interviewed in a BLACK BLOUSE AND PINK SWEATER with a WHITE PEARL NECKLACE 😂🤣😂🤣😅🤣🤣🤣🤣🤣🤣) Mentally ill. No pussy is worth this craziness! permalink award report block reply\nSnowSnake 5 points 3 days ago She may very easily find several men who mesh into her \"checklist,\" but my reverse-ask is, would any of them find her attractive, and not just physically. Like, can he expect fellatio on a regular basis and not only when you're dating. How is this woman going to set herself apart so a man with the level of choice available to him will take notice? 7 figures means he can BUY quality pussy if he wants to. permalink award report block reply Tellman125 4 points 3 days ago Her final requirement is probably \"This bodybuilder CEO I'm describing must not expect sex from me unless I am totally in the mood and he has just given me the 3 or 4 expensive gifts I asked for earlier that day.\" permalink parent award report block reply\nTellman125 4 points 3 days ago Her final requirement is probably \"This bodybuilder CEO I'm describing must not expect sex from me unless I am totally in the mood and he has just given me the 3 or 4 expensive gifts I asked for earlier that day.\" permalink parent award report block reply\nbooblitchutz 5 points 3 days ago But she’s hopping on Tinder every week giving it away to any schmo that will swipe right on her. permalink award report block reply MyDadLikedBiden 4 points 3 days ago Alas, none ever do. permalink parent award report block reply\nMyDadLikedBiden 4 points 3 days ago Alas, none ever do. permalink parent award report block reply\ngreyhound 5 points 3 days ago I think it is satire. The whole thing is here: https://youtu.be/00_xnbkuiXw permalink award report block reply Samsonlike 5 points 3 days ago I think they took a real video of the matchmaker and then spliced in an actress to play the goofy lady. At first I was in disbelief.  Then it sunk and I couldn't stop laughing. permalink parent award report block reply\nSamsonlike 5 points 3 days ago I think they took a real video of the matchmaker and then spliced in an actress to play the goofy lady. At first I was in disbelief.  Then it sunk and I couldn't stop laughing. permalink parent award report block reply\nMemeWarsVet 4 points 3 days ago Cats.  Dildo. Wine. That's your future. permalink award report block reply Transparency 1 points 3 days ago ...and Blue Collar MEN on the clock (nobody wants any of that stank old pussy). permalink parent award report block reply\nTransparency 1 points 3 days ago ...and Blue Collar MEN on the clock (nobody wants any of that stank old pussy). permalink parent award report block reply\nB0bE 4 points 3 days ago That dude is out there banging supermodels not the creatures from horror flicks. permalink award report block reply\nDeportThemAllForever 4 points 3 days ago This is got to be a skit permalink award report block reply\njhewish 4 points 3 days ago The cougar therapist nodding in the affirmative to the fucking wildabeast that has higher standards than she had in her prime with a straight face is hilarious. permalink award report block reply Transparency 1 points 3 days ago She's a pro. She started publicly putting videos up of these ridiculous women at least a few years ago, and she is not the only matchmaker to do so. permalink parent award report block reply\nTransparency 1 points 3 days ago She's a pro. She started publicly putting videos up of these ridiculous women at least a few years ago, and she is not the only matchmaker to do so. permalink parent award report block reply\nMajorPlayer 4 points 3 days ago And I get nothing in return? Lemme guess no prenup, starter marriage 5 years, divorce and marry someone else? permalink award report block reply\ndrsowells1fan 4 points 3 days ago You can thank social media for spawning a generation of well below average women who firmly believe they deserve an above average man.  She better just pour a cup of tea and turn on a Hallmark fantasy where a chubby boss babe 4 returns to her hometown to save her family's candycane factory or tree farm and finds love with a handsome salt of the earth 6' man who would never look at her in real life. permalink award report block reply\nArnoldF 4 points 3 days ago A week. lol permalink award report block reply\nSteveRogers42 4 points 3 days ago Aaahhhahahaha —pause for breath — Aaaahahahaha! permalink award report block reply\nRedFoxOnFire 4 points 3 days ago Hoeflation is real. permalink award report block reply\npresticus 4 points 3 days ago The man she's chasing has his pick of actual 10s fighting over him. She is delusional. Hypothetically if she did get her unicorn what's she going to do if he starts going bald 10 years in? About 60% of men undergo hair loss. permalink award report block reply Keep_on_winning_kag 3 points 3 days ago Shes not looking for long term. She will divorce him for her payday. She doesn't realise she's also past her prime and 10's don't want old hens. permalink parent award report block reply\nKeep_on_winning_kag 3 points 3 days ago Shes not looking for long term. She will divorce him for her payday. She doesn't realise she's also past her prime and 10's don't want old hens. permalink parent award report block reply\ngorilla_grip 4 points 3 days ago This man does not exist despite her claim that he’s out there.  There isn’t a 5’10” man with perfect full head of hair, spectacular body, handsome, makes over a million a year, Christian but doesn’t go to church, never been married, never had kids, never got tattoos, likes cats, and wants anything to to do with a horse faced washed up woman with saggy little boobs and a shaved head. And she thinks this matchmaker can find him in a week?  Wow.  This is more delusional than a tranny. permalink award report block reply\nTransparency 4 points 3 days ago They're a dime a dozen today. Society has been publicly making fun of them for years now. They are as clueless as they are serious. 100%. 👍 wHeRe hAvE aLL thE GOOD mEn GoNe? 😂😂😂 Go ahead, \"ladies\", and tell us how she is the extreme exception to the norm. I dOn'T KnOw WHERE yOu aRe MeeTiNg woMeN lIke ThAT. I Don'T kNoW ANY wOmEn LikE THAT!!! Fuck you and your lies. EVERY. SINGLE. DAY. More and More men are waking up and waking away. It's been going on for YEARS now, ...but WE are the \"Bad guys\", as usual. 😂😂😂 Millions and Millions of you women are and have been played for the fool by feminism. It's a LOOOONG haul from 40-80yo without a man, a family, children. Enjoy your wine and your little dogs that are going to feed off of you until they are rescued after you die alone. 😘👌✌ permalink award report block reply Keep_on_winning_kag 3 points 3 days ago If i were paid a dollar for every \"Dog mom\" profile i see on dating sites i'd have  amillion bucks by now. Avoid dog moms. Notice you never see \" Dog dads\". permalink parent award report block reply Transparency 2 points 3 days ago Avoid dog moms. 👍👍 1,000%. permalink parent award report block reply\nKeep_on_winning_kag 3 points 3 days ago If i were paid a dollar for every \"Dog mom\" profile i see on dating sites i'd have  amillion bucks by now. Avoid dog moms. Notice you never see \" Dog dads\". permalink parent award report block reply Transparency 2 points 3 days ago Avoid dog moms. 👍👍 1,000%. permalink parent award report block reply\nTransparency 2 points 3 days ago Avoid dog moms. 👍👍 1,000%. permalink parent award report block reply\nGuidedDisinfo 4 points 3 days ago The man who fits this list is dating women like Sydney Sweeney. permalink award report block reply\nJodokon92 4 points 3 days ago Woman: I want a man with a seven figure salary. Interviewer in her head: Annnnnndddd were done here, good luck crazy. permalink award report block reply Transparency 2 points 3 days ago That's exactly how it played out. The matchmaker is not new and has been posting these lunatics for at least a few years. She knows. 👌 permalink parent award report block reply\nTransparency 2 points 3 days ago That's exactly how it played out. The matchmaker is not new and has been posting these lunatics for at least a few years. She knows. 👌 permalink parent award report block reply\nGreyKnight 4 points 3 days ago Ahhh…6 figure salary of no longer enough… Do they just completely overestimate their worth or are they just playing a different lottery with even less to lose and buy into…? permalink award report block reply\ndeleted 4 points 3 days ago Transparency 0 points 3 days ago THAT ONE. She will never wake up, and even if she did she could never reverse enough to become a viable option for ANYONE. It's the little dogs and cats that will have to suffer with her. No, I'm not joking. 👍👍 permalink parent award report block reply\nTransparency 0 points 3 days ago THAT ONE. She will never wake up, and even if she did she could never reverse enough to become a viable option for ANYONE. It's the little dogs and cats that will have to suffer with her. No, I'm not joking. 👍👍 permalink parent award report block reply\nheavyD 4 points 3 days ago And one last thing, he must be blind. permalink award report block reply\nCommanderOfCheese 4 points 3 days ago All of a sudden that one meme song isn't so ridiculous sounding. \"I'm looking for a man in finance. With a trust fund. 6-5, blue eyes.\" permalink award report block reply\nProfHinsley 4 points 3 days ago Basically described me (as long as we're counting decimal points on the salary), but she's a shrew, so, no thanks. permalink award report block reply booblitchutz 4 points 3 days ago A lot of the things she describes in her match are qualities a man grows into after years of stability and happiness. She thinks that kind of man is just floating around single at the age of 30. permalink parent award report block reply\nbooblitchutz 4 points 3 days ago A lot of the things she describes in her match are qualities a man grows into after years of stability and happiness. She thinks that kind of man is just floating around single at the age of 30. permalink parent award report block reply\nBeelzy 3 points 3 days ago She forgot, smells good. permalink award report block reply\nmalooch 3 points 3 days ago I can’t fucking stand when girls speak like that with that inflection in their voice permalink award report block reply\nAynRand22 3 points 3 days ago Controlling much? permalink award report block reply Transparency 1 points 3 days ago It's not \"cOnTroLLiNg\" when da gurls do it. It's just \"pReFeRenCEs!\" 🤡🌎 permalink parent award report block reply\nTransparency 1 points 3 days ago It's not \"cOnTroLLiNg\" when da gurls do it. It's just \"pReFeRenCEs!\" 🤡🌎 permalink parent award report block reply\ndtrap 3 points 3 days ago With all of those demands, at least she is smoking hot... Oh wait. permalink award report block reply\nPatriotDescendant 3 points 3 days ago She's not going to get better looking over time... permalink award report block reply\nI_Am_John_Galt 3 points 3 days ago Opens up out of the gate with \"seven figure salary\"...lol! permalink award report block reply\nHikedelics 3 points 3 days ago What the fuck is that on its head? Please tell me that’s not what’s left of “her” hair? permalink award report block reply Transparency 3 points 3 days ago It's a hairband. Her hair is pulled back. permalink parent award report block reply\nTransparency 3 points 3 days ago It's a hairband. Her hair is pulled back. permalink parent award report block reply\nSilly_Wabbitt 3 points 3 days ago GTFO stank hoe....... permalink award report block reply\nskywalk 2 points 3 days ago She literally wants a male onlyfans model. permalink award report block reply\nseattlerunner 2 points 3 days ago This is parody obviously. Why are mods gay and stickying this. permalink award report block reply\nEastTexasMadLad 2 points 3 days ago This is coming from a 3/10 just cause she’s not obese. permalink award report block reply\nTrajano 2 points 3 days ago If this were not fake, I would applaud the matchmaker's professionalism. permalink award report block reply\nSunnywindows 2 points 3 days ago Hilarious… I thought maybe it’s a parody thing, but sadly, probably not. permalink award report block reply\nMapleMAGA 2 points 3 days ago I found the original video. https://youtu.be/00_xnbkuiXw?si=Na73vc6M-AQdE62w permalink award report block reply\nBilbobaggins 2 points 3 days ago I’ll be praying for this woman. How did we get here as a society? permalink award report block reply Transparency 2 points 3 days ago Feminism allowed by all of the pussy-begging simps. Instead of correcting and controlling the women, weak men have focused on babying and catering to them because their focus is to try to fuck them. permalink parent award report block reply\nTransparency 2 points 3 days ago Feminism allowed by all of the pussy-begging simps. Instead of correcting and controlling the women, weak men have focused on babying and catering to them because their focus is to try to fuck them. permalink parent award report block reply\n2016TrumpMAGA 2 points 3 days ago A woman that looks like that should be content with any man that has a job.  And that's reaching. permalink award report block reply\nSamsonlike 2 points 3 days ago She seems nice. permalink award report block reply\nWhoMeTwo 2 points 3 days ago This is a skit. permalink award report block reply\nDeaduponArousal 2 points 3 days ago Hope everyone’s enjoying deer season. Just remember: “never pass up a buck on the first day you’d be happy with on the last”. I guess another one that’s applicable is “ya can’t eat the horns”. Happy hunting ladies. permalink award report block reply\nBrewSwillis 2 points 3 days ago How many billions of dollars is this lady worth? It can be the only explanation....... unless this is a joke. permalink award report block reply\nokboomer59 2 points 3 days ago My checklist: Not her. The End. permalink award report block reply\nKolob64 2 points 3 days ago Makes me wonder if she is for real.  I had a list and my husband exceeded it, so I married him.  I only wanted a man who would support me at home, 7 figures are not necessary and my husband was broke at the time, but finishing a degree in a well paid field.  My list was very specific to me and was so much more flexible than this woman.  I wanted someone completely honest.  Notice she never mentions character. permalink award report block reply\nWrexxis780 2 points 3 days ago full head of hair Oh the irony permalink award report block reply\nKilroy 2 points 3 days ago If she wants good success, she should probably think seriously about what she's bringing to the party,  what she can do and be for the ideal man that she's seeking. Of course, she won't. permalink award report block reply\nGletkin 2 points 3 days ago This is the kind of “Christian” whose idea of a good sermon is one that explores the queer nature of the apostolic fraternity, isn’t it. permalink award report block reply\nMissSuperSaltine 2 points 3 days ago I think it’s laughable that she is demanding a man that’s top shelf when she’s mid at best. Shocking that she wants a ‘cat’ person. The delusion is strong in this one. permalink award report block reply\nGoneViking 2 points 3 days ago I know lots of 7 figure, ripped dudes that are looking for an autistic chick. permalink award report block reply\nasiatrails 2 points 3 days ago This self-centered, autistic, world revolves around me, cat lady in training, would make any decent man's life pure hell permalink award report block reply\nAgnesDomini 2 points 3 days ago FFS, she even wants to dictate what he has for breakfast and what color clothes he wears so he'll match hers? I cannot imagine that if such a man exists that SHE would be the ideal partner that HE would describe. She's as plain as the day is long, her voice is annoying, she's obviously a control freak. Hard pass, fellas! permalink award report block reply\nEaszq8 1 points 3 days ago This chick is a solid 5. And with the scrambled eggs called a brain in her head she’s not even good for a lay. permalink award report block reply\nOrangeperson 1 points 2 days ago I fit those boxes, well some of her checklist boxes, okay once I had a smoothie.  Nevertheless I would shave my head, get a neck tattoo and pull my teeth before I spent one minute with that delusional harpy. permalink award report block reply\nMPitcher1776 1 points 3 days ago Was she bald or was her hair pulled back tight?  Btw she's nutz. permalink award report block reply\nMJ_43 1 points 3 days ago Bird hand, check permalink award report block reply\nkfm2000 1 points 3 days ago Future cat-lady. permalink award report block reply\nKwdzr 1 points 3 days ago All superficial things really. permalink award report block reply\nMegaboom2025 1 points 3 days ago Zero men on earth with a 7 figure salary that want to deal with that harpy permalink award report block reply\nFecklessgod 1 points 3 days ago Is this AI? permalink award report block reply\nRagnarD 1 points 3 days ago A man like that could have any woman he wanted. What does she bring to the table except a princess attitude? permalink award report block reply\nsumadartson 1 points 2 days ago did she mention detachable balls that fit in her purse? permalink award report block reply\n1ValhallaJack 1 points 3 days ago shmeegle permalink award report block reply\nTrumpOrTreason 1 points 3 days ago \"How soon can you find this man?\"\nAnswer: \" A week\" This list of requirements she has, just proves she doesn't care about who the guy is. permalink award report block reply\nclownworld30330 1 points 3 days ago Probably AI. But good prompting. permalink award report block reply\nPsalm-118_24 1 points 3 days ago That's a dude. permalink award report block reply\nJoeBidensDementia1 -4 points 3 days ago Feel free to stop posting this worthless shit. permalink award report block reply monkadelic 4 points 3 days ago I too am cranky in the mornings.  But sometimes some distraction is ok. permalink parent award report block reply Transparency 0 points 3 days ago Nah, this is the worthless kind of shit that has woken up and SAVED many millions of men over the last several years+, and many, many more into the future. So, go fuck yourself. 👍👍 permalink parent award report block reply\nmonkadelic 4 points 3 days ago I too am cranky in the mornings.  But sometimes some distraction is ok. permalink parent award report block reply\nTransparency 0 points 3 days ago Nah, this is the worthless kind of shit that has woken up and SAVED many millions of men over the last several years+, and many, many more into the future. So, go fuck yourself. 👍👍 permalink parent award report block reply\nasdrubael_was_right -6 points 3 days ago Unpopular opinion: I don’t think she is that unreasonable with her standards. The fashion stuff is silly but that is the way women think. The seven figure salary is unrealistic too but shoot your shot, girl. She’s white and decent looking and didn’t bring up “no Nazi Drumpf supporters” so forgive me for not taking today’s rage bait. Spez: I’m dumb didn’t realize she was looking for a millionaire permalink award report block reply Redclyde75 6 points 3 days ago Decent looking? I felt like I hit my dick with a hammer looking an listening to her permalink parent award report block reply Transparency 2 points 3 days ago Everything screams that it's a woman posting what you responded to. permalink parent award report block reply asdrubael_was_right 2 points 3 days ago Jokes on you I’m into that shit. permalink parent award report block reply Redclyde75 2 points 3 days ago Good news is when you start making 7 figures she might start thinking about it permalink parent award report block reply asdrubael_was_right 1 points 3 days ago She said seven figures? Nvm I’m bad at math. Six figures is like top 10%. Seven is less than 1%. You need swimsuit model looks for that. permalink parent award report block reply booblitchutz 3 points 3 days ago I don’t think this is “rage bait” so much as it is humorous. permalink parent award report block reply ArtLife 1 points 3 days ago this kind of person may well be at a dating service because she is unpleasable, and likely simply unhappy with herself and looking for fulfillment from some nebulous mr perfect. I was on match.com in the very beginning and corresponded with a guy who listed his preferences down to what type of jewelry his match could wear. Kinda glad I never met him in person. permalink parent award report block reply Transparency 1 points 3 days ago Women like her are a dime a dozen today. What you describe fits MANY women today. ... but it's all men's fault. /s permalink parent award report block reply ArtLife 2 points 3 days ago sadly yes. some men have morphed into something weird, probably because of the whole ~girl power men are horrible but save me please mr perfect~. a normal man I don't think should even try to navigate that. permalink parent award report block reply Transparency 2 points 3 days ago More and more are not bothering and even sex is going off the table more and more every day. We are living and witnessing 1 answer to Fermi's paradox. permalink parent award report block reply\nRedclyde75 6 points 3 days ago Decent looking? I felt like I hit my dick with a hammer looking an listening to her permalink parent award report block reply Transparency 2 points 3 days ago Everything screams that it's a woman posting what you responded to. permalink parent award report block reply asdrubael_was_right 2 points 3 days ago Jokes on you I’m into that shit. permalink parent award report block reply Redclyde75 2 points 3 days ago Good news is when you start making 7 figures she might start thinking about it permalink parent award report block reply asdrubael_was_right 1 points 3 days ago She said seven figures? Nvm I’m bad at math. Six figures is like top 10%. Seven is less than 1%. You need swimsuit model looks for that. permalink parent award report block reply\nTransparency 2 points 3 days ago Everything screams that it's a woman posting what you responded to. permalink parent award report block reply\nasdrubael_was_right 2 points 3 days ago Jokes on you I’m into that shit. permalink parent award report block reply Redclyde75 2 points 3 days ago Good news is when you start making 7 figures she might start thinking about it permalink parent award report block reply asdrubael_was_right 1 points 3 days ago She said seven figures? Nvm I’m bad at math. Six figures is like top 10%. Seven is less than 1%. You need swimsuit model looks for that. permalink parent award report block reply\nRedclyde75 2 points 3 days ago Good news is when you start making 7 figures she might start thinking about it permalink parent award report block reply asdrubael_was_right 1 points 3 days ago She said seven figures? Nvm I’m bad at math. Six figures is like top 10%. Seven is less than 1%. You need swimsuit model looks for that. permalink parent award report block reply\nasdrubael_was_right 1 points 3 days ago She said seven figures? Nvm I’m bad at math. Six figures is like top 10%. Seven is less than 1%. You need swimsuit model looks for that. permalink parent award report block reply\nbooblitchutz 3 points 3 days ago I don’t think this is “rage bait” so much as it is humorous. permalink parent award report block reply\nArtLife 1 points 3 days ago this kind of person may well be at a dating service because she is unpleasable, and likely simply unhappy with herself and looking for fulfillment from some nebulous mr perfect. I was on match.com in the very beginning and corresponded with a guy who listed his preferences down to what type of jewelry his match could wear. Kinda glad I never met him in person. permalink parent award report block reply Transparency 1 points 3 days ago Women like her are a dime a dozen today. What you describe fits MANY women today. ... but it's all men's fault. /s permalink parent award report block reply ArtLife 2 points 3 days ago sadly yes. some men have morphed into something weird, probably because of the whole ~girl power men are horrible but save me please mr perfect~. a normal man I don't think should even try to navigate that. permalink parent award report block reply Transparency 2 points 3 days ago More and more are not bothering and even sex is going off the table more and more every day. We are living and witnessing 1 answer to Fermi's paradox. permalink parent award report block reply\nTransparency 1 points 3 days ago Women like her are a dime a dozen today. What you describe fits MANY women today. ... but it's all men's fault. /s permalink parent award report block reply ArtLife 2 points 3 days ago sadly yes. some men have morphed into something weird, probably because of the whole ~girl power men are horrible but save me please mr perfect~. a normal man I don't think should even try to navigate that. permalink parent award report block reply Transparency 2 points 3 days ago More and more are not bothering and even sex is going off the table more and more every day. We are living and witnessing 1 answer to Fermi's paradox. permalink parent award report block reply\nArtLife 2 points 3 days ago sadly yes. some men have morphed into something weird, probably because of the whole ~girl power men are horrible but save me please mr perfect~. a normal man I don't think should even try to navigate that. permalink parent award report block reply Transparency 2 points 3 days ago More and more are not bothering and even sex is going off the table more and more every day. We are living and witnessing 1 answer to Fermi's paradox. permalink parent award report block reply\nTransparency 2 points 3 days ago More and more are not bothering and even sex is going off the table more and more every day. We are living and witnessing 1 answer to Fermi's paradox. permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:49:31.287427Z"
}