{
  "id": "1ARK54RwjW",
  "url": "https://patriots.win/p/1ARK54RwjW/no-fool-like-a-lib-fool/c",
  "content": "542 No fool like a lib fool posted 5 days ago by restless57 13 comments award share download report block\n13 comments Sort by Top Top New Worst Old Save bull_in_a_china_shop 6 points 5 days ago The left ultimately doesn't care about policy. They just care about hurting their perceived enemies. permalink award report block reply knnbccb 4 points 5 days ago Nothing in life is free. Some sucker is paying for it. Alternatively, YOU are the product, YOU are the one being used. They make it free but your usage/participation lets them earn back everything and then some. permalink award report block reply greatpumpkin 3 points 5 days ago There's a reason the 'long march through the institutions', starts with the schools .... permalink award report block reply knnbccb 2 points 5 days ago Reminder: you can't talk about DEI without also mentioning ESG (anti-carbon 'sustainability' cult). The two go hand in hand. The globalists have the blueprint years ago. The UN's 17 goals for sustainable development https://sdgs.un.org/goals permalink award report block reply davidw881 1 points 5 days ago Following the footsteps of the Romans. permalink award report block reply RedFormanIsPeeved 1 points 5 days ago Come on James, this douche bag would be dead under the bridge. permalink award report block reply rubberkidney 1 points 5 days ago dont get me wrong im disgusted by this commie..but isnt he just asking for political donations?  hes not asking people to donate for the grocery stores and childcare.. permalink award report block reply Skabliggum2 1 points 5 days ago Or swinging from it permalink award report block reply NotMyGovernor 1 points 5 days ago Late stage socialism permalink award report block reply Knockoff 1 points 5 days ago Maybe Civics instead of “social studies?” Anything with “social” in the name is crafted by the left. permalink award report block reply GhostOfTheRepublic 1 points 5 days ago nah, James.  He would still be sipping champagne on mom's palatial estates dreaming how the world would be better if only he were in charge and that communism just needs to be done the right way. permalink award report block reply ACActual 1 points 5 days ago Trump could kill the colleges but won't because he promised Chyna could send 600,000 Spies permalink award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nbull_in_a_china_shop 6 points 5 days ago The left ultimately doesn't care about policy. They just care about hurting their perceived enemies. permalink award report block reply\nknnbccb 4 points 5 days ago Nothing in life is free. Some sucker is paying for it. Alternatively, YOU are the product, YOU are the one being used. They make it free but your usage/participation lets them earn back everything and then some. permalink award report block reply\ngreatpumpkin 3 points 5 days ago There's a reason the 'long march through the institutions', starts with the schools .... permalink award report block reply\nknnbccb 2 points 5 days ago Reminder: you can't talk about DEI without also mentioning ESG (anti-carbon 'sustainability' cult). The two go hand in hand. The globalists have the blueprint years ago. The UN's 17 goals for sustainable development https://sdgs.un.org/goals permalink award report block reply\ndavidw881 1 points 5 days ago Following the footsteps of the Romans. permalink award report block reply\nRedFormanIsPeeved 1 points 5 days ago Come on James, this douche bag would be dead under the bridge. permalink award report block reply\nrubberkidney 1 points 5 days ago dont get me wrong im disgusted by this commie..but isnt he just asking for political donations?  hes not asking people to donate for the grocery stores and childcare.. permalink award report block reply\nSkabliggum2 1 points 5 days ago Or swinging from it permalink award report block reply\nNotMyGovernor 1 points 5 days ago Late stage socialism permalink award report block reply\nKnockoff 1 points 5 days ago Maybe Civics instead of “social studies?” Anything with “social” in the name is crafted by the left. permalink award report block reply\nGhostOfTheRepublic 1 points 5 days ago nah, James.  He would still be sipping champagne on mom's palatial estates dreaming how the world would be better if only he were in charge and that communism just needs to be done the right way. permalink award report block reply\nACActual 1 points 5 days ago Trump could kill the colleges but won't because he promised Chyna could send 600,000 Spies permalink award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T20:48:52.511341Z"
}