{
  "id": "1ARK54SDys",
  "url": "https://patriots.win/p/1ARK54SDys/trump-were-not-going-to-spend-1-/c",
  "content": "463 Trump: We're not going to spend $1 trillion or $1.5 trillion on healthcare for people that came into our country illegally GEOTUS posted 5 days ago by CyanScales 8 comments award share report block Breaking911 @Breaking911 • 6d Trump on the government shutdown: \"The shutdown is caused by the Democrats, and we're not going to spend $1 trillion or $1.5 trillion on healthcare for people that came into our country illegally... They should've — as they've done always in the past — [funding] should've just\n8 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget suckmycorona 15 points 5 days ago While hard working Americans are paying nearly triple than before Obamacare. permalink award report block reply Beardholder 8 points 5 days ago Stop paying for health insurance. It's literally not worth it. It's cheaper to live your life , save your money and when you have to go to the doctor or emergency clinic it's literally cheaper to pay that one time bill than hundreds of dollars a month to basically get a few bucks off at the clinic. permalink parent award report block reply doomerglowie2 9 points 5 days ago I'm surprised a Federal Judge didn't call and interrupt President Trump when he was saying this with a \"Oh yes we are\" permalink award report block reply MissingTrump 9 points 5 days ago And that's just the healthcare. We need them gone. Don't forget all the other gubment gibs they are using. Section 8, EBT, etc. permalink award report block reply Bullet3250 8 points 5 days ago BE WARNED... that is EXACTLY THE BILL THE DEMOCRATS ARE PROPOSING IN THE HOUSE RIGHT NOW! It spends $1.5 TRILLION DOLLARS on 'healthcare' - that is with no control as to WHO GETS THE COVERAGE. permalink award report block reply knnbccb 4 points 5 days ago There is almost one year of grace period. If illegals still aren't self-deporting or surrendering themselves by now, they need to be shot. Maybe do it after the midterms, if you're scared of the 'optics'. P.S: their 'activists' and 'journalists' are fair game too. permalink award report block reply Shih_Tabed 1 points 5 days ago I agree and optics haven't mattered since 2016.  We will never be in the good light.  Might as well do something with that. permalink parent award report block reply wookiebush 1 points 5 days ago After the RepubliCANTs cave, and we all know that they will, President Trump should veto the bill and reiterate NO MONEY FOR ILLEGALS. W. permalink award report block reply\nsuckmycorona 15 points 5 days ago While hard working Americans are paying nearly triple than before Obamacare. permalink award report block reply Beardholder 8 points 5 days ago Stop paying for health insurance. It's literally not worth it. It's cheaper to live your life , save your money and when you have to go to the doctor or emergency clinic it's literally cheaper to pay that one time bill than hundreds of dollars a month to basically get a few bucks off at the clinic. permalink parent award report block reply\nBeardholder 8 points 5 days ago Stop paying for health insurance. It's literally not worth it. It's cheaper to live your life , save your money and when you have to go to the doctor or emergency clinic it's literally cheaper to pay that one time bill than hundreds of dollars a month to basically get a few bucks off at the clinic. permalink parent award report block reply\ndoomerglowie2 9 points 5 days ago I'm surprised a Federal Judge didn't call and interrupt President Trump when he was saying this with a \"Oh yes we are\" permalink award report block reply\nMissingTrump 9 points 5 days ago And that's just the healthcare. We need them gone. Don't forget all the other gubment gibs they are using. Section 8, EBT, etc. permalink award report block reply\nBullet3250 8 points 5 days ago BE WARNED... that is EXACTLY THE BILL THE DEMOCRATS ARE PROPOSING IN THE HOUSE RIGHT NOW! It spends $1.5 TRILLION DOLLARS on 'healthcare' - that is with no control as to WHO GETS THE COVERAGE. permalink award report block reply\nknnbccb 4 points 5 days ago There is almost one year of grace period. If illegals still aren't self-deporting or surrendering themselves by now, they need to be shot. Maybe do it after the midterms, if you're scared of the 'optics'. P.S: their 'activists' and 'journalists' are fair game too. permalink award report block reply Shih_Tabed 1 points 5 days ago I agree and optics haven't mattered since 2016.  We will never be in the good light.  Might as well do something with that. permalink parent award report block reply\nShih_Tabed 1 points 5 days ago I agree and optics haven't mattered since 2016.  We will never be in the good light.  Might as well do something with that. permalink parent award report block reply\nwookiebush 1 points 5 days ago After the RepubliCANTs cave, and we all know that they will, President Trump should veto the bill and reiterate NO MONEY FOR ILLEGALS. W. permalink award report block reply",
  "fetched_at": "2025-11-12T23:09:38.976376Z"
}