{
  "id": "1ARK9nNz6H",
  "url": "https://patriots.win/p/1ARK9nNz6H/j6-defendant-rejects-presidentia/c",
  "content": "1074 J6 Defendant REJECTS Presidential Pardon to Expose DOJ Corruption and Judicial Conspiracy Against Trump Supporters: “I do not need clemency, by accepting it, I absolve the sins of the state” (www.thegatewaypundit.com) posted 7 hours ago by thegatewaybandit 84 comments award share report block J6 Defendant REJECTS Presidential Pardon to Expose DOJ Corruption and Judicial Conspiracy Against Trump Supporters: \"I do not ne... Daniel Michael Morrissey, a January 6th defendant, Army veteran, and MBA holder, has become one of the most defiant figures in the J6 saga, turning down a presidential pardon from President Trump, choosing instead to blow the lid off what he call... www.thegatewaypundit.com\n84 comments Sort by Top Top New Worst Old Save Around the Web The Killer of Baldness Has Been Found! (Try This at Home) HaloGrow UncleSlayton 103 points 6 hours ago Good for him.  He's right.  He did nothing wrong to be pardoned from. permalink award report block reply MastaJoda 51 points 6 hours ago God bless him. He's a real man. permalink parent award report block reply UltraFrogMan 15 points 6 hours ago And pray for his mother permalink parent award report block reply snoopy3210 2 points 4 hours ago Nope. Seems like another Fed like Jacob Chansley who coordinated with capitol police to enter the house permalink parent award report block reply bananaguard62 1 points 1 hour ago How do I get a Certificate of Pardon with the seal? I was pardoned and got nothing. permalink parent award report block reply possibletower -56 points 6 hours ago He already accepted it. No refunds 🤣. They have a choice to accept it or deny it. He has the pardon in his possession. Writing \"return to sender\" does nothing. This fag hates Trump and is trying to get people to turn against Trump because he is one of those Q-tards and never supported Trump. I am going to laugh at his faggoty ass when he fails and then because he rescinded the pardon and if they accept the rescission he is fucking his family even moreso because he hates Trump 🤣. These faggots want an excuse to chimp out and rage against Trump. permalink parent award report block reply TheDevilMonkey 19 points 5 hours ago You talk like a fag and your shits retarded. permalink parent award report block reply Klaus73 3 points 1 hour ago Why no tattoo? permalink parent award report block reply UncleSlayton 14 points 5 hours ago Anaconda, you're so stupid that you stand out uniquely on an anonymous forum.  I'd say \"think about that\" but it would be like telling a cod to use a computer.  Even if it had thumbs it wouldn't know what to do with it. permalink parent award report block reply BeauHD 5 points 5 hours ago Is this Anaconda's latest alt? I read it argues about anything. permalink parent award report block reply UncleSlayton 3 points 5 hours ago He keeps like 10 alts at a time.  Usually autists are intelligent. permalink parent award report block reply view 1 more comments... LiteraIIyHitIer 2 points 4 hours ago How can someone be pro-Q, but anti-Trump? Did you even re-read that or think it through before posting it? permalink parent award report block reply KekistaniMemeLord -3 points 6 hours ago perhaps you'd like to explain to everyone here how an anonymous 4 chan account posted at the exact same time, down to the second, as the president of the US more than 30 times? would anyone be able to achieve this even once without doing something absurd like making a post every single second of the day? pointless to ask you these though as you're a complete bad faith shill faggot who doesn't know jack shit about Q. edit: 3 downvotes, no response. Lol get mad shills permalink parent award report block reply Sgt_Hulka 1 points 5 hours ago Dude, it’s a psy-op.  Govt. run to keep you sitting on your hands waiting for the “white hats” who are never coming. It’s a modern twist on Operation Trust. Let it go already. permalink parent award report block reply KekistaniMemeLord -3 points 5 hours ago Of course it's a psy-op. You didn't answer my question. permalink parent award report block reply view 4 more comments... airborne3502 46 points 6 hours ago Accepting a pardon reads like an admission of guilt. This man didn't do anything wrong and is making sure there's no misunderstanding. He was ushered into one of the most secure buildings in the world and then punished for it. I applaud his conviction while, at the same time, not judging the people unjustly locked up who reached for that lifeline. permalink award report block reply Female 8 points 6 hours ago Daniel Michael Morrissey ^^\nan American Hero I just heard about today Say what you will about the Gateway pundit but I really don't see any alternative Maga news. Except here, obv. permalink parent award report block reply snoopy3210 3 points 4 hours ago That’s because he’s going to be protected as he was a fed (military) on J6.. all feds that infiltrated MAGA are criminals permalink parent award report block reply pollsarefake 1 points 5 hours ago This man is an alpha just like Trump He wants to follow the example of his leader permalink parent award report block reply iamherefortheluls 1 points 1 hour ago My understanding is that legally its not 'reads like', it actually legally is. Not a lawyer, maybe I misunderstood one explaining that to me. permalink parent award report block reply Marianasoctober 29 points 6 hours ago Does it make a difference if he “accepts” it? I would think it’s still valid. permalink award report block reply 24601 28 points 6 hours ago SCOTUS: United States v. Wilson 1833 Acceptance of the pardon is necessary for validity. https://supreme.justia.com/cases/federal/us/32/150/ This is exactly why Steve Bannon has said he does not want a pardon either. permalink parent award report block reply Quietam_Unum 1 points 3 hours ago Does it make a difference if he “accepts” it? Admission of guilt? permalink parent award report block reply possibletower -48 points 6 hours ago No refunds if he accepted it and signed off on accepting the pardon. He is one of those fags who have turned on Trump and is going to say Trump was the #1 big bad the whole time. Some of those J6ers are nutjobs who never ever supported Trump and were just there to chimp out because Q told them to do so. I am going to laugh at his faggoty ass when he fails and then because he rescinded the pardon and if they accept the rescission he is fucking his family even moreso because he hates Trump 🤣. These faggots want an excuse to chimp out and rage against Trump. permalink parent award report block reply yeptheguy 37 points 6 hours ago His sentence was completed before the pardon. All it does is remove his probation, which does nothing to normal law abiding citizens. He is fighting the system which allowed this persecution to happen in the first place. Read the article faggot. permalink parent award report block reply iamherefortheluls 1 points 1 hour ago All it does is remove his probation, which does nothing to normal law abiding citizens. that heavily depends on the terms of his probation. Almost anything could be in there that would be a huge imposition on any 'law abiding citizen'. Like 'you are not allowed to access the internet' and if you borrow someone's phone to call the police after an accident you just violated probation. At a minimum, you have to report a lot about your life to your probation officer - you literally have to live your life under the glare of a state appointed nanny. Most of these are Karens who get off bossing people around. You are lucky if you get a lazy one. permalink parent award report block reply hansgruber7 10 points 6 hours ago Do you have any evidence for this claim? permalink parent award report block reply WoeToYou 9 points 6 hours ago No. Just raging like a Lefty. See it a lot here anymore. permalink parent award report block reply posedgeclk 9 points 6 hours ago It's anaconda's newest handle. permalink parent award report block reply WoeToYou 7 points 6 hours ago The only one raging here is you, retard. Read the article. permalink parent award report block reply bicentennial_john 6 points 6 hours ago Q really??  Thats the best explanation you have.  An anti-trump and pro-Q person does not exists.  Tell me which of the 5000 q posts \"told\" him to \"chimp out because Q told them to\"?? permalink parent award report block reply KekistaniMemeLord 0 points 6 hours ago he couldn't tell you. Dumb fuck bad faith shill. one of many on this site now permalink parent award report block reply UltraFrogMan 2 points 6 hours ago You misread or didnt read the article at all? permalink parent award report block reply austford 23 points 6 hours ago successful or not, we need more men with big balls ready to take big risks permalink award report block reply BigMikesSwingingCock 4 points 4 hours ago 100% agree. permalink parent award report block reply Kiwipede22 2 points 2 hours ago At this point sounds like he has nothing to lose as he has already lost everything.  Also hats off to him as he has clearly used his time to study the law all on his own.  No mean feat. permalink parent award report block reply UCantStumpTheTrump 1 points 57 minutes ago Bingo. The MSM-DNC-IC complex wanted to make sure that NO critical mass of MAGA folks ever happens again like on J6. That’s why they painted it as the worst thing since 9/11. I protested and ultimately got the FBI crawling up my ass and digging into my personal life looking for crimes (sound familiar?) but until we have a critical mass of people willing to risk their safety or freedom for what’s right, the necessary change will not occur permalink parent award report block reply SavingPrivateGrace 19 points 6 hours ago One man is going to prove that no crime was committed by him on Jan 6th and rewrite the historical event.  His story needs to be told, his book written, and Congress hears it. permalink award report block reply NonbinaryPotatohead 11 points 5 hours ago We can't even get the Epstein files. permalink parent award report block reply DeportThemAllForever 3 points 5 hours ago “You still talking about that guy?” permalink parent award report block reply RememberCharlieKirk 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply Female 2 points 6 hours ago I will elect him 2028 President over any one of these corporate shills Unless the Trump sons run, of course permalink parent award report block reply SavingPrivateGrace 4 points 6 hours ago Would be a great time for a reunion Trump Rally at the Capital when his hearing begins and such a danger to their democracy. permalink parent award report block reply 1776er 2 points 5 hours ago Trump sons are not viable candidates, they are compromised in crypto schemes and taking money from lobbyists to whisper in daddy’s ear permalink parent award report block reply Dev404 5 points 5 hours ago The J6 Panel still needs arrested, DOJ, DA, and the judges who intentionally dragged their feet and left these people in jail for years without even being charged with something. So far, from this administration, another goose egg. The criminals are still free and waiting another opportunity. permalink award report block reply notsuicidalatall 4 points 6 hours ago He lived it so his choice.  Now only if the shitbag media would blow this up the way they did the Epstein list (with the help of \"mm...MAGA\"), something might happen. permalink award report block reply Treatt 10 points 6 hours ago I'm glad I didn't grow up worshiping the five channel news media the way that the older generation did because I know that I have to look for alternative news. However the older generation is in a lot of trouble and is a liability to Maga right now because they are low info truthfully speaking. permalink parent award report block reply notsuicidalatall 4 points 6 hours ago Agreed.  I'm 52 but noticed it is mostly 60-78 y.o. that are glued to CNN, FoxNews, MSNBC, etc. permalink parent award report block reply ActNow 1 points 5 hours ago Ultimately, it's the people who see through the bs vs those who don't. Logical thinking trumped many years of MSM for me. permalink parent award report block reply notsuicidalatall 2 points 5 hours ago Yes.  I don't know if the people who don't see it are dumb, ignorant, don't want to, or just need to hang on to anything that is anti Trump/Republican/Maga. permalink parent award report block reply view 1 more comments... NZbacon 4 points 6 hours ago Who's got the details on this guy's case? permalink award report block reply RedStoneDeepState -2 points 5 hours ago He pleaded guilty to a misdemeanor picketing violation, did a few weeks in jail and was released. He then rejected the pardon and phoned a bunch of media outlets to try and monetize this idiocy. permalink parent award report block reply Kiwipede22 1 points 2 hours ago Good… all J6ers should take the system for every penny they can get.  The system deliberately fucked them over and ruined lives.  Now it is time to pay. permalink parent award report block reply UltraFrogMan 2 points 6 hours ago Based permalink award report block reply SoulSnipper 2 points 6 hours ago You could take it *and sue the bastards permalink award report block reply IlhansBrother 2 points 5 hours ago THIS PATRIOT should be hired to a top DOJ role to shut those bastards down permalink award report block reply Beelzy 2 points 4 hours ago It's his pardon, he can do whatever he wants with it, even grandstanding. permalink award report block reply RU_joe_king 2 points 4 hours ago And just like that, Big Balls has a soulmate. permalink award report block reply barwhack 2 points 5 hours ago It is - in fact - an admission of \"guilt\", legally... permalink award report block reply Kiwipede22 1 points 2 hours ago Let’s see… pushed through the door or trampled to death…. Hmm 🤔? permalink parent award report block reply NomadicKrow2 2 points 3 hours ago Shit, I dont know. I would have sat on it and not accepted. If things go sideways, I would have pulled it out like a get out of jail free card. permalink award report block reply RedStoneDeepState 2 points 5 hours ago He rejected a pardon for a misdemeanor he pleaded guilty to. The consequences of accepting or rejecting the pardon is nothing. permalink award report block reply Michalusmichalus 1 points 2 hours ago From the first president in history to be found guilty in court while not committing any crime. permalink parent award report block reply Michalusmichalus 1 points 2 hours ago I'd take a Trump pardon. This man made what I consider to be a stupid choice after the 1/6 pipe bomber was found to be a government employee. Now he kept himself in political nonsense. permalink award report block reply delnaga 1 points 4 hours ago Ballsy! permalink award report block reply ChickenStrips 1 points 3 hours ago Wow. permalink award report block reply redditadminssuckit 1 points 6 hours ago To each their own permalink award report block reply warlord30 1 points 1 hour ago Gigachad move 🫡 permalink award report block reply Choppermagic 1 points 4 hours ago If only Bondi did her job permalink award report block reply XXNNOES 1 points 2 hours ago GOD BLESS THIS PATRIOT! permalink award report block reply NoFats 1 points 6 hours ago Don't you have to request a pardon? permalink award report block reply ragnarokrobo 1 points 5 hours ago Based permalink award report block reply Kiwipede22 0 points 2 hours ago Other should also return their pardon.  I am surprised that they have not offered him millions in return for his silence.  His lawyer should be disbarred. permalink award report block reply hansgruber7 -1 points 6 hours ago Seems stupid.  Trump is the President.  He should accept the pardon and protection from political persecution.  Accepting it does nothing to absolve the sins of the state. permalink award report block reply ActNow 1 points 5 hours ago He stands out by rejecting the pardon. It has more traction when he writes his congressman. permalink parent award report block reply hansgruber7 -2 points 4 hours ago Writing congressmen is a waste of time.  He stands out as a retard. permalink parent award report block reply SanityGumby -5 points 6 hours ago Sounds stupid. Taking it doesn’t mean you can’t sue the court. Taking it doesn’t mean he still can’t pressure Congress to investigate the court. And if the judges are corrupts enough to never hear his pending case then he not only accomplished nothing but he threw away an opportunity permalink award report block reply hk416 1 points 4 hours ago Comment removed by community filter. permalink award report block reply\nUncleSlayton 103 points 6 hours ago Good for him.  He's right.  He did nothing wrong to be pardoned from. permalink award report block reply MastaJoda 51 points 6 hours ago God bless him. He's a real man. permalink parent award report block reply UltraFrogMan 15 points 6 hours ago And pray for his mother permalink parent award report block reply snoopy3210 2 points 4 hours ago Nope. Seems like another Fed like Jacob Chansley who coordinated with capitol police to enter the house permalink parent award report block reply bananaguard62 1 points 1 hour ago How do I get a Certificate of Pardon with the seal? I was pardoned and got nothing. permalink parent award report block reply possibletower -56 points 6 hours ago He already accepted it. No refunds 🤣. They have a choice to accept it or deny it. He has the pardon in his possession. Writing \"return to sender\" does nothing. This fag hates Trump and is trying to get people to turn against Trump because he is one of those Q-tards and never supported Trump. I am going to laugh at his faggoty ass when he fails and then because he rescinded the pardon and if they accept the rescission he is fucking his family even moreso because he hates Trump 🤣. These faggots want an excuse to chimp out and rage against Trump. permalink parent award report block reply TheDevilMonkey 19 points 5 hours ago You talk like a fag and your shits retarded. permalink parent award report block reply Klaus73 3 points 1 hour ago Why no tattoo? permalink parent award report block reply UncleSlayton 14 points 5 hours ago Anaconda, you're so stupid that you stand out uniquely on an anonymous forum.  I'd say \"think about that\" but it would be like telling a cod to use a computer.  Even if it had thumbs it wouldn't know what to do with it. permalink parent award report block reply BeauHD 5 points 5 hours ago Is this Anaconda's latest alt? I read it argues about anything. permalink parent award report block reply UncleSlayton 3 points 5 hours ago He keeps like 10 alts at a time.  Usually autists are intelligent. permalink parent award report block reply view 1 more comments... LiteraIIyHitIer 2 points 4 hours ago How can someone be pro-Q, but anti-Trump? Did you even re-read that or think it through before posting it? permalink parent award report block reply KekistaniMemeLord -3 points 6 hours ago perhaps you'd like to explain to everyone here how an anonymous 4 chan account posted at the exact same time, down to the second, as the president of the US more than 30 times? would anyone be able to achieve this even once without doing something absurd like making a post every single second of the day? pointless to ask you these though as you're a complete bad faith shill faggot who doesn't know jack shit about Q. edit: 3 downvotes, no response. Lol get mad shills permalink parent award report block reply Sgt_Hulka 1 points 5 hours ago Dude, it’s a psy-op.  Govt. run to keep you sitting on your hands waiting for the “white hats” who are never coming. It’s a modern twist on Operation Trust. Let it go already. permalink parent award report block reply KekistaniMemeLord -3 points 5 hours ago Of course it's a psy-op. You didn't answer my question. permalink parent award report block reply view 4 more comments...\nMastaJoda 51 points 6 hours ago God bless him. He's a real man. permalink parent award report block reply UltraFrogMan 15 points 6 hours ago And pray for his mother permalink parent award report block reply snoopy3210 2 points 4 hours ago Nope. Seems like another Fed like Jacob Chansley who coordinated with capitol police to enter the house permalink parent award report block reply bananaguard62 1 points 1 hour ago How do I get a Certificate of Pardon with the seal? I was pardoned and got nothing. permalink parent award report block reply\nUltraFrogMan 15 points 6 hours ago And pray for his mother permalink parent award report block reply\nsnoopy3210 2 points 4 hours ago Nope. Seems like another Fed like Jacob Chansley who coordinated with capitol police to enter the house permalink parent award report block reply bananaguard62 1 points 1 hour ago How do I get a Certificate of Pardon with the seal? I was pardoned and got nothing. permalink parent award report block reply\nbananaguard62 1 points 1 hour ago How do I get a Certificate of Pardon with the seal? I was pardoned and got nothing. permalink parent award report block reply\npossibletower -56 points 6 hours ago He already accepted it. No refunds 🤣. They have a choice to accept it or deny it. He has the pardon in his possession. Writing \"return to sender\" does nothing. This fag hates Trump and is trying to get people to turn against Trump because he is one of those Q-tards and never supported Trump. I am going to laugh at his faggoty ass when he fails and then because he rescinded the pardon and if they accept the rescission he is fucking his family even moreso because he hates Trump 🤣. These faggots want an excuse to chimp out and rage against Trump. permalink parent award report block reply TheDevilMonkey 19 points 5 hours ago You talk like a fag and your shits retarded. permalink parent award report block reply Klaus73 3 points 1 hour ago Why no tattoo? permalink parent award report block reply UncleSlayton 14 points 5 hours ago Anaconda, you're so stupid that you stand out uniquely on an anonymous forum.  I'd say \"think about that\" but it would be like telling a cod to use a computer.  Even if it had thumbs it wouldn't know what to do with it. permalink parent award report block reply BeauHD 5 points 5 hours ago Is this Anaconda's latest alt? I read it argues about anything. permalink parent award report block reply UncleSlayton 3 points 5 hours ago He keeps like 10 alts at a time.  Usually autists are intelligent. permalink parent award report block reply view 1 more comments... LiteraIIyHitIer 2 points 4 hours ago How can someone be pro-Q, but anti-Trump? Did you even re-read that or think it through before posting it? permalink parent award report block reply KekistaniMemeLord -3 points 6 hours ago perhaps you'd like to explain to everyone here how an anonymous 4 chan account posted at the exact same time, down to the second, as the president of the US more than 30 times? would anyone be able to achieve this even once without doing something absurd like making a post every single second of the day? pointless to ask you these though as you're a complete bad faith shill faggot who doesn't know jack shit about Q. edit: 3 downvotes, no response. Lol get mad shills permalink parent award report block reply Sgt_Hulka 1 points 5 hours ago Dude, it’s a psy-op.  Govt. run to keep you sitting on your hands waiting for the “white hats” who are never coming. It’s a modern twist on Operation Trust. Let it go already. permalink parent award report block reply KekistaniMemeLord -3 points 5 hours ago Of course it's a psy-op. You didn't answer my question. permalink parent award report block reply view 4 more comments...\nTheDevilMonkey 19 points 5 hours ago You talk like a fag and your shits retarded. permalink parent award report block reply Klaus73 3 points 1 hour ago Why no tattoo? permalink parent award report block reply\nKlaus73 3 points 1 hour ago Why no tattoo? permalink parent award report block reply\nUncleSlayton 14 points 5 hours ago Anaconda, you're so stupid that you stand out uniquely on an anonymous forum.  I'd say \"think about that\" but it would be like telling a cod to use a computer.  Even if it had thumbs it wouldn't know what to do with it. permalink parent award report block reply BeauHD 5 points 5 hours ago Is this Anaconda's latest alt? I read it argues about anything. permalink parent award report block reply UncleSlayton 3 points 5 hours ago He keeps like 10 alts at a time.  Usually autists are intelligent. permalink parent award report block reply view 1 more comments...\nBeauHD 5 points 5 hours ago Is this Anaconda's latest alt? I read it argues about anything. permalink parent award report block reply UncleSlayton 3 points 5 hours ago He keeps like 10 alts at a time.  Usually autists are intelligent. permalink parent award report block reply view 1 more comments...\nUncleSlayton 3 points 5 hours ago He keeps like 10 alts at a time.  Usually autists are intelligent. permalink parent award report block reply view 1 more comments...\nLiteraIIyHitIer 2 points 4 hours ago How can someone be pro-Q, but anti-Trump? Did you even re-read that or think it through before posting it? permalink parent award report block reply\nKekistaniMemeLord -3 points 6 hours ago perhaps you'd like to explain to everyone here how an anonymous 4 chan account posted at the exact same time, down to the second, as the president of the US more than 30 times? would anyone be able to achieve this even once without doing something absurd like making a post every single second of the day? pointless to ask you these though as you're a complete bad faith shill faggot who doesn't know jack shit about Q. edit: 3 downvotes, no response. Lol get mad shills permalink parent award report block reply Sgt_Hulka 1 points 5 hours ago Dude, it’s a psy-op.  Govt. run to keep you sitting on your hands waiting for the “white hats” who are never coming. It’s a modern twist on Operation Trust. Let it go already. permalink parent award report block reply KekistaniMemeLord -3 points 5 hours ago Of course it's a psy-op. You didn't answer my question. permalink parent award report block reply view 4 more comments...\nSgt_Hulka 1 points 5 hours ago Dude, it’s a psy-op.  Govt. run to keep you sitting on your hands waiting for the “white hats” who are never coming. It’s a modern twist on Operation Trust. Let it go already. permalink parent award report block reply KekistaniMemeLord -3 points 5 hours ago Of course it's a psy-op. You didn't answer my question. permalink parent award report block reply view 4 more comments...\nKekistaniMemeLord -3 points 5 hours ago Of course it's a psy-op. You didn't answer my question. permalink parent award report block reply view 4 more comments...\nairborne3502 46 points 6 hours ago Accepting a pardon reads like an admission of guilt. This man didn't do anything wrong and is making sure there's no misunderstanding. He was ushered into one of the most secure buildings in the world and then punished for it. I applaud his conviction while, at the same time, not judging the people unjustly locked up who reached for that lifeline. permalink award report block reply Female 8 points 6 hours ago Daniel Michael Morrissey ^^\nan American Hero I just heard about today Say what you will about the Gateway pundit but I really don't see any alternative Maga news. Except here, obv. permalink parent award report block reply snoopy3210 3 points 4 hours ago That’s because he’s going to be protected as he was a fed (military) on J6.. all feds that infiltrated MAGA are criminals permalink parent award report block reply pollsarefake 1 points 5 hours ago This man is an alpha just like Trump He wants to follow the example of his leader permalink parent award report block reply iamherefortheluls 1 points 1 hour ago My understanding is that legally its not 'reads like', it actually legally is. Not a lawyer, maybe I misunderstood one explaining that to me. permalink parent award report block reply\nFemale 8 points 6 hours ago Daniel Michael Morrissey ^^\nan American Hero I just heard about today Say what you will about the Gateway pundit but I really don't see any alternative Maga news. Except here, obv. permalink parent award report block reply snoopy3210 3 points 4 hours ago That’s because he’s going to be protected as he was a fed (military) on J6.. all feds that infiltrated MAGA are criminals permalink parent award report block reply\nsnoopy3210 3 points 4 hours ago That’s because he’s going to be protected as he was a fed (military) on J6.. all feds that infiltrated MAGA are criminals permalink parent award report block reply\npollsarefake 1 points 5 hours ago This man is an alpha just like Trump He wants to follow the example of his leader permalink parent award report block reply\niamherefortheluls 1 points 1 hour ago My understanding is that legally its not 'reads like', it actually legally is. Not a lawyer, maybe I misunderstood one explaining that to me. permalink parent award report block reply\nMarianasoctober 29 points 6 hours ago Does it make a difference if he “accepts” it? I would think it’s still valid. permalink award report block reply 24601 28 points 6 hours ago SCOTUS: United States v. Wilson 1833 Acceptance of the pardon is necessary for validity. https://supreme.justia.com/cases/federal/us/32/150/ This is exactly why Steve Bannon has said he does not want a pardon either. permalink parent award report block reply Quietam_Unum 1 points 3 hours ago Does it make a difference if he “accepts” it? Admission of guilt? permalink parent award report block reply possibletower -48 points 6 hours ago No refunds if he accepted it and signed off on accepting the pardon. He is one of those fags who have turned on Trump and is going to say Trump was the #1 big bad the whole time. Some of those J6ers are nutjobs who never ever supported Trump and were just there to chimp out because Q told them to do so. I am going to laugh at his faggoty ass when he fails and then because he rescinded the pardon and if they accept the rescission he is fucking his family even moreso because he hates Trump 🤣. These faggots want an excuse to chimp out and rage against Trump. permalink parent award report block reply yeptheguy 37 points 6 hours ago His sentence was completed before the pardon. All it does is remove his probation, which does nothing to normal law abiding citizens. He is fighting the system which allowed this persecution to happen in the first place. Read the article faggot. permalink parent award report block reply iamherefortheluls 1 points 1 hour ago All it does is remove his probation, which does nothing to normal law abiding citizens. that heavily depends on the terms of his probation. Almost anything could be in there that would be a huge imposition on any 'law abiding citizen'. Like 'you are not allowed to access the internet' and if you borrow someone's phone to call the police after an accident you just violated probation. At a minimum, you have to report a lot about your life to your probation officer - you literally have to live your life under the glare of a state appointed nanny. Most of these are Karens who get off bossing people around. You are lucky if you get a lazy one. permalink parent award report block reply hansgruber7 10 points 6 hours ago Do you have any evidence for this claim? permalink parent award report block reply WoeToYou 9 points 6 hours ago No. Just raging like a Lefty. See it a lot here anymore. permalink parent award report block reply posedgeclk 9 points 6 hours ago It's anaconda's newest handle. permalink parent award report block reply WoeToYou 7 points 6 hours ago The only one raging here is you, retard. Read the article. permalink parent award report block reply bicentennial_john 6 points 6 hours ago Q really??  Thats the best explanation you have.  An anti-trump and pro-Q person does not exists.  Tell me which of the 5000 q posts \"told\" him to \"chimp out because Q told them to\"?? permalink parent award report block reply KekistaniMemeLord 0 points 6 hours ago he couldn't tell you. Dumb fuck bad faith shill. one of many on this site now permalink parent award report block reply UltraFrogMan 2 points 6 hours ago You misread or didnt read the article at all? permalink parent award report block reply\n24601 28 points 6 hours ago SCOTUS: United States v. Wilson 1833 Acceptance of the pardon is necessary for validity. https://supreme.justia.com/cases/federal/us/32/150/ This is exactly why Steve Bannon has said he does not want a pardon either. permalink parent award report block reply\nQuietam_Unum 1 points 3 hours ago Does it make a difference if he “accepts” it? Admission of guilt? permalink parent award report block reply\npossibletower -48 points 6 hours ago No refunds if he accepted it and signed off on accepting the pardon. He is one of those fags who have turned on Trump and is going to say Trump was the #1 big bad the whole time. Some of those J6ers are nutjobs who never ever supported Trump and were just there to chimp out because Q told them to do so. I am going to laugh at his faggoty ass when he fails and then because he rescinded the pardon and if they accept the rescission he is fucking his family even moreso because he hates Trump 🤣. These faggots want an excuse to chimp out and rage against Trump. permalink parent award report block reply yeptheguy 37 points 6 hours ago His sentence was completed before the pardon. All it does is remove his probation, which does nothing to normal law abiding citizens. He is fighting the system which allowed this persecution to happen in the first place. Read the article faggot. permalink parent award report block reply iamherefortheluls 1 points 1 hour ago All it does is remove his probation, which does nothing to normal law abiding citizens. that heavily depends on the terms of his probation. Almost anything could be in there that would be a huge imposition on any 'law abiding citizen'. Like 'you are not allowed to access the internet' and if you borrow someone's phone to call the police after an accident you just violated probation. At a minimum, you have to report a lot about your life to your probation officer - you literally have to live your life under the glare of a state appointed nanny. Most of these are Karens who get off bossing people around. You are lucky if you get a lazy one. permalink parent award report block reply hansgruber7 10 points 6 hours ago Do you have any evidence for this claim? permalink parent award report block reply WoeToYou 9 points 6 hours ago No. Just raging like a Lefty. See it a lot here anymore. permalink parent award report block reply posedgeclk 9 points 6 hours ago It's anaconda's newest handle. permalink parent award report block reply WoeToYou 7 points 6 hours ago The only one raging here is you, retard. Read the article. permalink parent award report block reply bicentennial_john 6 points 6 hours ago Q really??  Thats the best explanation you have.  An anti-trump and pro-Q person does not exists.  Tell me which of the 5000 q posts \"told\" him to \"chimp out because Q told them to\"?? permalink parent award report block reply KekistaniMemeLord 0 points 6 hours ago he couldn't tell you. Dumb fuck bad faith shill. one of many on this site now permalink parent award report block reply UltraFrogMan 2 points 6 hours ago You misread or didnt read the article at all? permalink parent award report block reply\nyeptheguy 37 points 6 hours ago His sentence was completed before the pardon. All it does is remove his probation, which does nothing to normal law abiding citizens. He is fighting the system which allowed this persecution to happen in the first place. Read the article faggot. permalink parent award report block reply iamherefortheluls 1 points 1 hour ago All it does is remove his probation, which does nothing to normal law abiding citizens. that heavily depends on the terms of his probation. Almost anything could be in there that would be a huge imposition on any 'law abiding citizen'. Like 'you are not allowed to access the internet' and if you borrow someone's phone to call the police after an accident you just violated probation. At a minimum, you have to report a lot about your life to your probation officer - you literally have to live your life under the glare of a state appointed nanny. Most of these are Karens who get off bossing people around. You are lucky if you get a lazy one. permalink parent award report block reply\niamherefortheluls 1 points 1 hour ago All it does is remove his probation, which does nothing to normal law abiding citizens. that heavily depends on the terms of his probation. Almost anything could be in there that would be a huge imposition on any 'law abiding citizen'. Like 'you are not allowed to access the internet' and if you borrow someone's phone to call the police after an accident you just violated probation. At a minimum, you have to report a lot about your life to your probation officer - you literally have to live your life under the glare of a state appointed nanny. Most of these are Karens who get off bossing people around. You are lucky if you get a lazy one. permalink parent award report block reply\nhansgruber7 10 points 6 hours ago Do you have any evidence for this claim? permalink parent award report block reply WoeToYou 9 points 6 hours ago No. Just raging like a Lefty. See it a lot here anymore. permalink parent award report block reply posedgeclk 9 points 6 hours ago It's anaconda's newest handle. permalink parent award report block reply\nWoeToYou 9 points 6 hours ago No. Just raging like a Lefty. See it a lot here anymore. permalink parent award report block reply\nposedgeclk 9 points 6 hours ago It's anaconda's newest handle. permalink parent award report block reply\nWoeToYou 7 points 6 hours ago The only one raging here is you, retard. Read the article. permalink parent award report block reply\nbicentennial_john 6 points 6 hours ago Q really??  Thats the best explanation you have.  An anti-trump and pro-Q person does not exists.  Tell me which of the 5000 q posts \"told\" him to \"chimp out because Q told them to\"?? permalink parent award report block reply KekistaniMemeLord 0 points 6 hours ago he couldn't tell you. Dumb fuck bad faith shill. one of many on this site now permalink parent award report block reply\nKekistaniMemeLord 0 points 6 hours ago he couldn't tell you. Dumb fuck bad faith shill. one of many on this site now permalink parent award report block reply\nUltraFrogMan 2 points 6 hours ago You misread or didnt read the article at all? permalink parent award report block reply\naustford 23 points 6 hours ago successful or not, we need more men with big balls ready to take big risks permalink award report block reply BigMikesSwingingCock 4 points 4 hours ago 100% agree. permalink parent award report block reply Kiwipede22 2 points 2 hours ago At this point sounds like he has nothing to lose as he has already lost everything.  Also hats off to him as he has clearly used his time to study the law all on his own.  No mean feat. permalink parent award report block reply UCantStumpTheTrump 1 points 57 minutes ago Bingo. The MSM-DNC-IC complex wanted to make sure that NO critical mass of MAGA folks ever happens again like on J6. That’s why they painted it as the worst thing since 9/11. I protested and ultimately got the FBI crawling up my ass and digging into my personal life looking for crimes (sound familiar?) but until we have a critical mass of people willing to risk their safety or freedom for what’s right, the necessary change will not occur permalink parent award report block reply\nBigMikesSwingingCock 4 points 4 hours ago 100% agree. permalink parent award report block reply\nKiwipede22 2 points 2 hours ago At this point sounds like he has nothing to lose as he has already lost everything.  Also hats off to him as he has clearly used his time to study the law all on his own.  No mean feat. permalink parent award report block reply\nUCantStumpTheTrump 1 points 57 minutes ago Bingo. The MSM-DNC-IC complex wanted to make sure that NO critical mass of MAGA folks ever happens again like on J6. That’s why they painted it as the worst thing since 9/11. I protested and ultimately got the FBI crawling up my ass and digging into my personal life looking for crimes (sound familiar?) but until we have a critical mass of people willing to risk their safety or freedom for what’s right, the necessary change will not occur permalink parent award report block reply\nSavingPrivateGrace 19 points 6 hours ago One man is going to prove that no crime was committed by him on Jan 6th and rewrite the historical event.  His story needs to be told, his book written, and Congress hears it. permalink award report block reply NonbinaryPotatohead 11 points 5 hours ago We can't even get the Epstein files. permalink parent award report block reply DeportThemAllForever 3 points 5 hours ago “You still talking about that guy?” permalink parent award report block reply RememberCharlieKirk 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply Female 2 points 6 hours ago I will elect him 2028 President over any one of these corporate shills Unless the Trump sons run, of course permalink parent award report block reply SavingPrivateGrace 4 points 6 hours ago Would be a great time for a reunion Trump Rally at the Capital when his hearing begins and such a danger to their democracy. permalink parent award report block reply 1776er 2 points 5 hours ago Trump sons are not viable candidates, they are compromised in crypto schemes and taking money from lobbyists to whisper in daddy’s ear permalink parent award report block reply\nNonbinaryPotatohead 11 points 5 hours ago We can't even get the Epstein files. permalink parent award report block reply DeportThemAllForever 3 points 5 hours ago “You still talking about that guy?” permalink parent award report block reply RememberCharlieKirk 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nDeportThemAllForever 3 points 5 hours ago “You still talking about that guy?” permalink parent award report block reply RememberCharlieKirk 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nRememberCharlieKirk 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nFemale 2 points 6 hours ago I will elect him 2028 President over any one of these corporate shills Unless the Trump sons run, of course permalink parent award report block reply SavingPrivateGrace 4 points 6 hours ago Would be a great time for a reunion Trump Rally at the Capital when his hearing begins and such a danger to their democracy. permalink parent award report block reply 1776er 2 points 5 hours ago Trump sons are not viable candidates, they are compromised in crypto schemes and taking money from lobbyists to whisper in daddy’s ear permalink parent award report block reply\nSavingPrivateGrace 4 points 6 hours ago Would be a great time for a reunion Trump Rally at the Capital when his hearing begins and such a danger to their democracy. permalink parent award report block reply\n1776er 2 points 5 hours ago Trump sons are not viable candidates, they are compromised in crypto schemes and taking money from lobbyists to whisper in daddy’s ear permalink parent award report block reply\nDev404 5 points 5 hours ago The J6 Panel still needs arrested, DOJ, DA, and the judges who intentionally dragged their feet and left these people in jail for years without even being charged with something. So far, from this administration, another goose egg. The criminals are still free and waiting another opportunity. permalink award report block reply\nnotsuicidalatall 4 points 6 hours ago He lived it so his choice.  Now only if the shitbag media would blow this up the way they did the Epstein list (with the help of \"mm...MAGA\"), something might happen. permalink award report block reply Treatt 10 points 6 hours ago I'm glad I didn't grow up worshiping the five channel news media the way that the older generation did because I know that I have to look for alternative news. However the older generation is in a lot of trouble and is a liability to Maga right now because they are low info truthfully speaking. permalink parent award report block reply notsuicidalatall 4 points 6 hours ago Agreed.  I'm 52 but noticed it is mostly 60-78 y.o. that are glued to CNN, FoxNews, MSNBC, etc. permalink parent award report block reply ActNow 1 points 5 hours ago Ultimately, it's the people who see through the bs vs those who don't. Logical thinking trumped many years of MSM for me. permalink parent award report block reply notsuicidalatall 2 points 5 hours ago Yes.  I don't know if the people who don't see it are dumb, ignorant, don't want to, or just need to hang on to anything that is anti Trump/Republican/Maga. permalink parent award report block reply view 1 more comments...\nTreatt 10 points 6 hours ago I'm glad I didn't grow up worshiping the five channel news media the way that the older generation did because I know that I have to look for alternative news. However the older generation is in a lot of trouble and is a liability to Maga right now because they are low info truthfully speaking. permalink parent award report block reply notsuicidalatall 4 points 6 hours ago Agreed.  I'm 52 but noticed it is mostly 60-78 y.o. that are glued to CNN, FoxNews, MSNBC, etc. permalink parent award report block reply ActNow 1 points 5 hours ago Ultimately, it's the people who see through the bs vs those who don't. Logical thinking trumped many years of MSM for me. permalink parent award report block reply notsuicidalatall 2 points 5 hours ago Yes.  I don't know if the people who don't see it are dumb, ignorant, don't want to, or just need to hang on to anything that is anti Trump/Republican/Maga. permalink parent award report block reply view 1 more comments...\nnotsuicidalatall 4 points 6 hours ago Agreed.  I'm 52 but noticed it is mostly 60-78 y.o. that are glued to CNN, FoxNews, MSNBC, etc. permalink parent award report block reply ActNow 1 points 5 hours ago Ultimately, it's the people who see through the bs vs those who don't. Logical thinking trumped many years of MSM for me. permalink parent award report block reply notsuicidalatall 2 points 5 hours ago Yes.  I don't know if the people who don't see it are dumb, ignorant, don't want to, or just need to hang on to anything that is anti Trump/Republican/Maga. permalink parent award report block reply view 1 more comments...\nActNow 1 points 5 hours ago Ultimately, it's the people who see through the bs vs those who don't. Logical thinking trumped many years of MSM for me. permalink parent award report block reply notsuicidalatall 2 points 5 hours ago Yes.  I don't know if the people who don't see it are dumb, ignorant, don't want to, or just need to hang on to anything that is anti Trump/Republican/Maga. permalink parent award report block reply view 1 more comments...\nnotsuicidalatall 2 points 5 hours ago Yes.  I don't know if the people who don't see it are dumb, ignorant, don't want to, or just need to hang on to anything that is anti Trump/Republican/Maga. permalink parent award report block reply view 1 more comments...\nNZbacon 4 points 6 hours ago Who's got the details on this guy's case? permalink award report block reply RedStoneDeepState -2 points 5 hours ago He pleaded guilty to a misdemeanor picketing violation, did a few weeks in jail and was released. He then rejected the pardon and phoned a bunch of media outlets to try and monetize this idiocy. permalink parent award report block reply Kiwipede22 1 points 2 hours ago Good… all J6ers should take the system for every penny they can get.  The system deliberately fucked them over and ruined lives.  Now it is time to pay. permalink parent award report block reply\nRedStoneDeepState -2 points 5 hours ago He pleaded guilty to a misdemeanor picketing violation, did a few weeks in jail and was released. He then rejected the pardon and phoned a bunch of media outlets to try and monetize this idiocy. permalink parent award report block reply Kiwipede22 1 points 2 hours ago Good… all J6ers should take the system for every penny they can get.  The system deliberately fucked them over and ruined lives.  Now it is time to pay. permalink parent award report block reply\nKiwipede22 1 points 2 hours ago Good… all J6ers should take the system for every penny they can get.  The system deliberately fucked them over and ruined lives.  Now it is time to pay. permalink parent award report block reply\nUltraFrogMan 2 points 6 hours ago Based permalink award report block reply\nSoulSnipper 2 points 6 hours ago You could take it *and sue the bastards permalink award report block reply\nIlhansBrother 2 points 5 hours ago THIS PATRIOT should be hired to a top DOJ role to shut those bastards down permalink award report block reply\nBeelzy 2 points 4 hours ago It's his pardon, he can do whatever he wants with it, even grandstanding. permalink award report block reply\nRU_joe_king 2 points 4 hours ago And just like that, Big Balls has a soulmate. permalink award report block reply\nbarwhack 2 points 5 hours ago It is - in fact - an admission of \"guilt\", legally... permalink award report block reply Kiwipede22 1 points 2 hours ago Let’s see… pushed through the door or trampled to death…. Hmm 🤔? permalink parent award report block reply\nKiwipede22 1 points 2 hours ago Let’s see… pushed through the door or trampled to death…. Hmm 🤔? permalink parent award report block reply\nNomadicKrow2 2 points 3 hours ago Shit, I dont know. I would have sat on it and not accepted. If things go sideways, I would have pulled it out like a get out of jail free card. permalink award report block reply\nRedStoneDeepState 2 points 5 hours ago He rejected a pardon for a misdemeanor he pleaded guilty to. The consequences of accepting or rejecting the pardon is nothing. permalink award report block reply Michalusmichalus 1 points 2 hours ago From the first president in history to be found guilty in court while not committing any crime. permalink parent award report block reply\nMichalusmichalus 1 points 2 hours ago From the first president in history to be found guilty in court while not committing any crime. permalink parent award report block reply\nMichalusmichalus 1 points 2 hours ago I'd take a Trump pardon. This man made what I consider to be a stupid choice after the 1/6 pipe bomber was found to be a government employee. Now he kept himself in political nonsense. permalink award report block reply\ndelnaga 1 points 4 hours ago Ballsy! permalink award report block reply\nChickenStrips 1 points 3 hours ago Wow. permalink award report block reply\nredditadminssuckit 1 points 6 hours ago To each their own permalink award report block reply\nwarlord30 1 points 1 hour ago Gigachad move 🫡 permalink award report block reply\nChoppermagic 1 points 4 hours ago If only Bondi did her job permalink award report block reply\nXXNNOES 1 points 2 hours ago GOD BLESS THIS PATRIOT! permalink award report block reply\nNoFats 1 points 6 hours ago Don't you have to request a pardon? permalink award report block reply\nragnarokrobo 1 points 5 hours ago Based permalink award report block reply\nKiwipede22 0 points 2 hours ago Other should also return their pardon.  I am surprised that they have not offered him millions in return for his silence.  His lawyer should be disbarred. permalink award report block reply\nhansgruber7 -1 points 6 hours ago Seems stupid.  Trump is the President.  He should accept the pardon and protection from political persecution.  Accepting it does nothing to absolve the sins of the state. permalink award report block reply ActNow 1 points 5 hours ago He stands out by rejecting the pardon. It has more traction when he writes his congressman. permalink parent award report block reply hansgruber7 -2 points 4 hours ago Writing congressmen is a waste of time.  He stands out as a retard. permalink parent award report block reply\nActNow 1 points 5 hours ago He stands out by rejecting the pardon. It has more traction when he writes his congressman. permalink parent award report block reply hansgruber7 -2 points 4 hours ago Writing congressmen is a waste of time.  He stands out as a retard. permalink parent award report block reply\nhansgruber7 -2 points 4 hours ago Writing congressmen is a waste of time.  He stands out as a retard. permalink parent award report block reply\nSanityGumby -5 points 6 hours ago Sounds stupid. Taking it doesn’t mean you can’t sue the court. Taking it doesn’t mean he still can’t pressure Congress to investigate the court. And if the judges are corrupts enough to never hear his pending case then he not only accomplished nothing but he threw away an opportunity permalink award report block reply\nhk416 1 points 4 hours ago Comment removed by community filter. permalink award report block reply",
  "fetched_at": "2025-11-12T20:47:46.975460Z"
}