{
  "id": "1ARK53LkXQ",
  "url": "https://patriots.win/p/1ARK53LkXQ/antifa-radicals-admit-to-arson-a/c",
  "content": "1032 Antifa radicals admit to Arson attack on AfD lawmaker’s car with ‘Incendiary Device’ posted 5 days ago by Milward 38 comments award share download report block\n38 comments Sort by Top Top New Worst Old Save Deplorable556 27 points 5 days ago well slap an immigrant in a suit and call him the mayor, i never would have imagined this... permalink award report block reply Iremembermypassword 17 points 5 days ago I am sure the German Police is hard on their tracks. permalink award report block reply Kekistani 6 points 5 days ago More like hard on their cracks. permalink parent award report block reply Im_RickSteves_bitch 5 points 5 days ago kek I needed that. permalink parent award report block reply Liberats 8 points 5 days ago So it's terrorism they have admitted to. Send in the GSG9 permalink award report block reply CapitalGGeek 6 points 5 days ago https://brusselssignal.eu/2025/11/members-of-germanys-antifa-confess-to-torching-afd-politicians-car/ permalink award report block reply Yheymos 6 points 5 days ago Time for an award from the German government! permalink award report block reply BrewSwillis 3 points 5 days ago Who cares? It's not like the globalist government there is going to do anything to stop it. They are on the same side. Ever since Hitler was ousted, they really have been going 180° in the other direction. Interesting. permalink award report block reply AlexPKeaton 3 points 5 days ago \"it's just an idea\" permalink award report block reply Bullet3250 3 points 5 days ago USAID leftovers.... permalink award report block reply steini1904 4 points 5 days ago Nope, these people are indirectly payed by the German Gov through various NGOs and benefits. Antifa's hometurf was always Germany, the amount of its sub-organisation in its network here is mind boggling. There are even members in the parliaments, e.g. the German Minister of Finance, and all over the media (although another leftist faction, the Greens, are slightly more dominant there). That's why I don't think AntiFA will be declared an international terrorist organization in the US (and if it happens, it'll be a completely useless definition of who is part of AntiFA, that hardly applies to anyone). But it'd be hilarious and absolutely necessary. Like locking a Minister of Finance out of access to financial institutions, or dropping sanctions on about half a million Germans all at once, either for spreading leftist violence around the globe directly or the NGO- or donor-laundered tax payer money that funds it. permalink parent award report block reply Bullet3250 3 points 5 days ago First USAID sends money to THOSE SAME NGO's - for the same reasons, attack Nationalism and Patriotism in Europe. Second...  and it is complex... but Trump already made the call. On September 22, 2025, Trump signed an Executive Order designating Antifa as a domestic terrorist organization, directing federal agencies to investigate, disrupt, and dismantle its operations and funding sources. Domestic Terrorism is limited in the US.  so - - In October 2025 , Trump expressed intent to escalate this effort by considering Antifa for designation as a foreign terrorist organization (FTO) , stating during a White House roundtable, “Let’s get it done”. FTO designation would carry significant legal consequences , including criminalizing material support to Antifa with penalties of at least 20 years in prison, enabling asset freezes through the Office of Foreign Assets Control, and allowing surveillance and deportation of non-citizens linked to the group. I can barely wait. permalink parent award report block reply Chickensaurus 2 points 5 days ago Well, time for Congress to declare open season on them. Full immunity to hint them down and kill them. permalink award report block reply AbsurdOpinion 2 points 5 days ago \"doxing\" is a strange way to refer to the Left ORDERING and FUNDING the attacks. permalink award report block reply Weeha 2 points 5 days ago Do not pass go Do not collect Soro's $200 Straight to JAIL permalink award report block reply giggitybooped 2 points 5 days ago Why does the right keep escalating violence?? permalink award report block reply PhantomShield72 1 points 5 days ago \"Mostly Peaceful\" political statement. permalink award report block reply Idontevenknow 1 points 5 days ago Terrorists used terror? shock. awe. bewilderment permalink award report block reply that_guy_pming_tits 1 points 5 days ago Mostly peaceful, asian, incendiary device? permalink award report block reply RickSanchezC137 1 points 5 days ago Wait, Antifa is only and idea not an organization. How did an idea firebomb a car? permalink award report block reply someguy7738 1 points 5 days ago Wrong to call them \"radicals\". This is perfectly mainstream for the left. permalink award report block reply cd3dog 1 points 5 days ago We must strive to understand their motives, different culture and make allowances. permalink award report block reply Crappydatum 1 points 5 days ago It's just an idea you bigots permalink award report block reply OmegaBird 1 points 5 days ago Terrorist organization. Why are they not being shot on sight , anywhere in the world? permalink award report block reply BillyBobBrewer 0 points 5 days ago They'll be given a civic achievement award by the cucked kraut faggots. permalink award report block reply PotatusHead -11 points 5 days ago Why the FUCK do I give a SHIT about a LAWMAKER'S car in GERMANY? OH WAIT... THE MOD PINNED IT SO IT MUST BE SUPER DUPER IMPORTANT TO POST IT ON THIS TRUMP FORUM.\n\"Be here for MAGA and Trump\nWe’re a community for those who want to Make America Great Again. If your purpose here is to push other unrelated or tangential agendas, you’re not welcome.\" Meanwhile, in the U.S.A.... even this is more relevant.... https://www.youtube.com/shorts/iI8L3pcRjTw?feature=share OK FAGGOTS, let's here why you \"rely on accurate news here\" or \"it's relevant because they'll blame TRUMP\" or \"take your whiny ass to Reddit\", or even \"RRRREEEEEEEEEEEEEEEE\". permalink award report block reply Liberats 9 points 5 days ago What happened in Europe is what they are doing in America. Unless you stop it, you'll be seeing the same. That's why it important. permalink parent award report block reply MastaJoda 4 points 5 days ago ☝ permalink parent award report block reply PotatusHead 1 points 5 days ago LOL you're pointing at MY comment. permalink parent award report block reply PotatusHead 0 points 5 days ago There you go. STUPID JUSTFICATION #1. permalink parent award report block reply Liberats 2 points 5 days ago It's a fact. It's happening. You have a NYC Muslim mayor this week.\nAmerica will never be great again  if you ignore the warning signs. permalink parent award report block reply PotatusHead 1 points 4 days ago Nah. I'm just ignoring YOU. permalink parent award report block reply view 1 more comments... Repentnow 0 points 5 days ago Because it supports the fact that Antifa is a foreign terrorist organization not just a domestic terrorist organization. Being designated as an FTO allows our federal law enforcement to take proactive actions and not just react. permalink parent award report block reply PotatusHead 0 points 5 days ago There you go. STUPID JUSTIFICATION #2 permalink parent award report block reply Repentnow 1 points 5 days ago Am I wrong?  Antifa being designated as an FTO is a huge MAGA goal. permalink parent award report block reply PotatusHead 0 points 5 days ago A car caught on fire. oooooOOOOOOOOoooooo...... permalink parent award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nDeplorable556 27 points 5 days ago well slap an immigrant in a suit and call him the mayor, i never would have imagined this... permalink award report block reply\nIremembermypassword 17 points 5 days ago I am sure the German Police is hard on their tracks. permalink award report block reply Kekistani 6 points 5 days ago More like hard on their cracks. permalink parent award report block reply Im_RickSteves_bitch 5 points 5 days ago kek I needed that. permalink parent award report block reply\nKekistani 6 points 5 days ago More like hard on their cracks. permalink parent award report block reply Im_RickSteves_bitch 5 points 5 days ago kek I needed that. permalink parent award report block reply\nIm_RickSteves_bitch 5 points 5 days ago kek I needed that. permalink parent award report block reply\nLiberats 8 points 5 days ago So it's terrorism they have admitted to. Send in the GSG9 permalink award report block reply\nCapitalGGeek 6 points 5 days ago https://brusselssignal.eu/2025/11/members-of-germanys-antifa-confess-to-torching-afd-politicians-car/ permalink award report block reply\nYheymos 6 points 5 days ago Time for an award from the German government! permalink award report block reply\nBrewSwillis 3 points 5 days ago Who cares? It's not like the globalist government there is going to do anything to stop it. They are on the same side. Ever since Hitler was ousted, they really have been going 180° in the other direction. Interesting. permalink award report block reply\nAlexPKeaton 3 points 5 days ago \"it's just an idea\" permalink award report block reply\nBullet3250 3 points 5 days ago USAID leftovers.... permalink award report block reply steini1904 4 points 5 days ago Nope, these people are indirectly payed by the German Gov through various NGOs and benefits. Antifa's hometurf was always Germany, the amount of its sub-organisation in its network here is mind boggling. There are even members in the parliaments, e.g. the German Minister of Finance, and all over the media (although another leftist faction, the Greens, are slightly more dominant there). That's why I don't think AntiFA will be declared an international terrorist organization in the US (and if it happens, it'll be a completely useless definition of who is part of AntiFA, that hardly applies to anyone). But it'd be hilarious and absolutely necessary. Like locking a Minister of Finance out of access to financial institutions, or dropping sanctions on about half a million Germans all at once, either for spreading leftist violence around the globe directly or the NGO- or donor-laundered tax payer money that funds it. permalink parent award report block reply Bullet3250 3 points 5 days ago First USAID sends money to THOSE SAME NGO's - for the same reasons, attack Nationalism and Patriotism in Europe. Second...  and it is complex... but Trump already made the call. On September 22, 2025, Trump signed an Executive Order designating Antifa as a domestic terrorist organization, directing federal agencies to investigate, disrupt, and dismantle its operations and funding sources. Domestic Terrorism is limited in the US.  so - - In October 2025 , Trump expressed intent to escalate this effort by considering Antifa for designation as a foreign terrorist organization (FTO) , stating during a White House roundtable, “Let’s get it done”. FTO designation would carry significant legal consequences , including criminalizing material support to Antifa with penalties of at least 20 years in prison, enabling asset freezes through the Office of Foreign Assets Control, and allowing surveillance and deportation of non-citizens linked to the group. I can barely wait. permalink parent award report block reply\nsteini1904 4 points 5 days ago Nope, these people are indirectly payed by the German Gov through various NGOs and benefits. Antifa's hometurf was always Germany, the amount of its sub-organisation in its network here is mind boggling. There are even members in the parliaments, e.g. the German Minister of Finance, and all over the media (although another leftist faction, the Greens, are slightly more dominant there). That's why I don't think AntiFA will be declared an international terrorist organization in the US (and if it happens, it'll be a completely useless definition of who is part of AntiFA, that hardly applies to anyone). But it'd be hilarious and absolutely necessary. Like locking a Minister of Finance out of access to financial institutions, or dropping sanctions on about half a million Germans all at once, either for spreading leftist violence around the globe directly or the NGO- or donor-laundered tax payer money that funds it. permalink parent award report block reply Bullet3250 3 points 5 days ago First USAID sends money to THOSE SAME NGO's - for the same reasons, attack Nationalism and Patriotism in Europe. Second...  and it is complex... but Trump already made the call. On September 22, 2025, Trump signed an Executive Order designating Antifa as a domestic terrorist organization, directing federal agencies to investigate, disrupt, and dismantle its operations and funding sources. Domestic Terrorism is limited in the US.  so - - In October 2025 , Trump expressed intent to escalate this effort by considering Antifa for designation as a foreign terrorist organization (FTO) , stating during a White House roundtable, “Let’s get it done”. FTO designation would carry significant legal consequences , including criminalizing material support to Antifa with penalties of at least 20 years in prison, enabling asset freezes through the Office of Foreign Assets Control, and allowing surveillance and deportation of non-citizens linked to the group. I can barely wait. permalink parent award report block reply\nBullet3250 3 points 5 days ago First USAID sends money to THOSE SAME NGO's - for the same reasons, attack Nationalism and Patriotism in Europe. Second...  and it is complex... but Trump already made the call. On September 22, 2025, Trump signed an Executive Order designating Antifa as a domestic terrorist organization, directing federal agencies to investigate, disrupt, and dismantle its operations and funding sources. Domestic Terrorism is limited in the US.  so - - In October 2025 , Trump expressed intent to escalate this effort by considering Antifa for designation as a foreign terrorist organization (FTO) , stating during a White House roundtable, “Let’s get it done”. FTO designation would carry significant legal consequences , including criminalizing material support to Antifa with penalties of at least 20 years in prison, enabling asset freezes through the Office of Foreign Assets Control, and allowing surveillance and deportation of non-citizens linked to the group. I can barely wait. permalink parent award report block reply\nChickensaurus 2 points 5 days ago Well, time for Congress to declare open season on them. Full immunity to hint them down and kill them. permalink award report block reply\nAbsurdOpinion 2 points 5 days ago \"doxing\" is a strange way to refer to the Left ORDERING and FUNDING the attacks. permalink award report block reply\nWeeha 2 points 5 days ago Do not pass go Do not collect Soro's $200 Straight to JAIL permalink award report block reply\ngiggitybooped 2 points 5 days ago Why does the right keep escalating violence?? permalink award report block reply\nPhantomShield72 1 points 5 days ago \"Mostly Peaceful\" political statement. permalink award report block reply\nIdontevenknow 1 points 5 days ago Terrorists used terror? shock. awe. bewilderment permalink award report block reply\nthat_guy_pming_tits 1 points 5 days ago Mostly peaceful, asian, incendiary device? permalink award report block reply\nRickSanchezC137 1 points 5 days ago Wait, Antifa is only and idea not an organization. How did an idea firebomb a car? permalink award report block reply\nsomeguy7738 1 points 5 days ago Wrong to call them \"radicals\". This is perfectly mainstream for the left. permalink award report block reply\ncd3dog 1 points 5 days ago We must strive to understand their motives, different culture and make allowances. permalink award report block reply\nCrappydatum 1 points 5 days ago It's just an idea you bigots permalink award report block reply\nOmegaBird 1 points 5 days ago Terrorist organization. Why are they not being shot on sight , anywhere in the world? permalink award report block reply\nBillyBobBrewer 0 points 5 days ago They'll be given a civic achievement award by the cucked kraut faggots. permalink award report block reply\nPotatusHead -11 points 5 days ago Why the FUCK do I give a SHIT about a LAWMAKER'S car in GERMANY? OH WAIT... THE MOD PINNED IT SO IT MUST BE SUPER DUPER IMPORTANT TO POST IT ON THIS TRUMP FORUM.\n\"Be here for MAGA and Trump\nWe’re a community for those who want to Make America Great Again. If your purpose here is to push other unrelated or tangential agendas, you’re not welcome.\" Meanwhile, in the U.S.A.... even this is more relevant.... https://www.youtube.com/shorts/iI8L3pcRjTw?feature=share OK FAGGOTS, let's here why you \"rely on accurate news here\" or \"it's relevant because they'll blame TRUMP\" or \"take your whiny ass to Reddit\", or even \"RRRREEEEEEEEEEEEEEEE\". permalink award report block reply Liberats 9 points 5 days ago What happened in Europe is what they are doing in America. Unless you stop it, you'll be seeing the same. That's why it important. permalink parent award report block reply MastaJoda 4 points 5 days ago ☝ permalink parent award report block reply PotatusHead 1 points 5 days ago LOL you're pointing at MY comment. permalink parent award report block reply PotatusHead 0 points 5 days ago There you go. STUPID JUSTFICATION #1. permalink parent award report block reply Liberats 2 points 5 days ago It's a fact. It's happening. You have a NYC Muslim mayor this week.\nAmerica will never be great again  if you ignore the warning signs. permalink parent award report block reply PotatusHead 1 points 4 days ago Nah. I'm just ignoring YOU. permalink parent award report block reply view 1 more comments... Repentnow 0 points 5 days ago Because it supports the fact that Antifa is a foreign terrorist organization not just a domestic terrorist organization. Being designated as an FTO allows our federal law enforcement to take proactive actions and not just react. permalink parent award report block reply PotatusHead 0 points 5 days ago There you go. STUPID JUSTIFICATION #2 permalink parent award report block reply Repentnow 1 points 5 days ago Am I wrong?  Antifa being designated as an FTO is a huge MAGA goal. permalink parent award report block reply PotatusHead 0 points 5 days ago A car caught on fire. oooooOOOOOOOOoooooo...... permalink parent award report block reply\nLiberats 9 points 5 days ago What happened in Europe is what they are doing in America. Unless you stop it, you'll be seeing the same. That's why it important. permalink parent award report block reply MastaJoda 4 points 5 days ago ☝ permalink parent award report block reply PotatusHead 1 points 5 days ago LOL you're pointing at MY comment. permalink parent award report block reply PotatusHead 0 points 5 days ago There you go. STUPID JUSTFICATION #1. permalink parent award report block reply Liberats 2 points 5 days ago It's a fact. It's happening. You have a NYC Muslim mayor this week.\nAmerica will never be great again  if you ignore the warning signs. permalink parent award report block reply PotatusHead 1 points 4 days ago Nah. I'm just ignoring YOU. permalink parent award report block reply view 1 more comments...\nMastaJoda 4 points 5 days ago ☝ permalink parent award report block reply PotatusHead 1 points 5 days ago LOL you're pointing at MY comment. permalink parent award report block reply\nPotatusHead 1 points 5 days ago LOL you're pointing at MY comment. permalink parent award report block reply\nPotatusHead 0 points 5 days ago There you go. STUPID JUSTFICATION #1. permalink parent award report block reply Liberats 2 points 5 days ago It's a fact. It's happening. You have a NYC Muslim mayor this week.\nAmerica will never be great again  if you ignore the warning signs. permalink parent award report block reply PotatusHead 1 points 4 days ago Nah. I'm just ignoring YOU. permalink parent award report block reply view 1 more comments...\nLiberats 2 points 5 days ago It's a fact. It's happening. You have a NYC Muslim mayor this week.\nAmerica will never be great again  if you ignore the warning signs. permalink parent award report block reply PotatusHead 1 points 4 days ago Nah. I'm just ignoring YOU. permalink parent award report block reply view 1 more comments...\nPotatusHead 1 points 4 days ago Nah. I'm just ignoring YOU. permalink parent award report block reply view 1 more comments...\nRepentnow 0 points 5 days ago Because it supports the fact that Antifa is a foreign terrorist organization not just a domestic terrorist organization. Being designated as an FTO allows our federal law enforcement to take proactive actions and not just react. permalink parent award report block reply PotatusHead 0 points 5 days ago There you go. STUPID JUSTIFICATION #2 permalink parent award report block reply Repentnow 1 points 5 days ago Am I wrong?  Antifa being designated as an FTO is a huge MAGA goal. permalink parent award report block reply PotatusHead 0 points 5 days ago A car caught on fire. oooooOOOOOOOOoooooo...... permalink parent award report block reply\nPotatusHead 0 points 5 days ago There you go. STUPID JUSTIFICATION #2 permalink parent award report block reply Repentnow 1 points 5 days ago Am I wrong?  Antifa being designated as an FTO is a huge MAGA goal. permalink parent award report block reply PotatusHead 0 points 5 days ago A car caught on fire. oooooOOOOOOOOoooooo...... permalink parent award report block reply\nRepentnow 1 points 5 days ago Am I wrong?  Antifa being designated as an FTO is a huge MAGA goal. permalink parent award report block reply PotatusHead 0 points 5 days ago A car caught on fire. oooooOOOOOOOOoooooo...... permalink parent award report block reply\nPotatusHead 0 points 5 days ago A car caught on fire. oooooOOOOOOOOoooooo...... permalink parent award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply"
}