{
  "id": "1ARK5A8TAK",
  "url": "https://patriots.win/p/1ARK5A8TAK/wow-/c",
  "content": "369 WOW! TRUMP  TRUTH posted 3 days ago by I-am-Orlando PRO 39 comments award share download report block\n39 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow hughjasske69 23 points 3 days ago Royalties for what ??  Fucking me and everyone else ??? permalink award report block reply MR__K 4 points 3 days ago Snopes and the others say this is bullshit. But i feel like trump wouldn't post unless there was some truth. permalink parent award report block reply hughjasske69 3 points 3 days ago I've heard this before though I don't remember when it's been months ago. It was reported he was collecting royalties in the past permalink parent award report block reply redinmn 2 points 3 days ago He cant get royalties from this, it went around back in 2018 I think and back then it was shown to be a non-starter.   I sure hope Trump doesnt get sucked into posting stuff like this.  As of now, his posts have meaning.  If they become nothing but bs, nobody is going to pay attention to them anymore. permalink parent award report block reply abstain 13 points 3 days ago This is the way. Take away his money and his homes little by little. permalink award report block reply Th0mas_Paine 5 points 3 days ago Yeah, if I stole 40 mil from you and then you just stopped giving me more, I'd be crushed. permalink parent award report block reply abstain 4 points 3 days ago Clawback and he will be crushed. permalink parent award report block reply chuey_316 12 points 3 days ago I love our President, but he really needs a team to vet his social media posts at this point. This claim came from a meme by the America's Last Line of Defense FakeBook page back in January or February. All that page does is put out satire and disinformation meant to trick people, so the left can say \"haha look how dumb they are for believing that\" Posts like this do nothing but give the left ammunition. permalink award report block reply War_Hamster 7 points 3 days ago If you’re correct, and I think you are, this message needs to be spread rapidly. Obamacare is a disaster without kickbacks, but this kickback story is stealing the headlines in many feeds. Send me links and I’ll help- get this out to bigger channels. permalink parent award report block reply ianpatrick1966 5 points 3 days ago https://perma.cc/V7GN-AURA?utm_source=FactCheck.org&utm_campaign=3bd22c2453-EMAIL_CAMPAIGN_2025_02_27_04_11&utm_medium=email&utm_term=0_-3bd22c2453-48721901 https://web.archive.org/web/20250214170128/https://dunning-kruger-times.com/about-us/ permalink parent award report block reply War_Hamster 4 points 3 days ago That'll work.  Thanks. I've sent this out to the biggest names in my network. permalink parent award report block reply ianpatrick1966 1 points 3 days ago Unless your someone famous it's like pissing into the wind, my friend permalink parent award report block reply view 1 more comments... chuey_316 3 points 3 days ago Thanks fren. I had to step away for a bit and just saw War_Hamster's request. permalink parent award report block reply ianpatrick1966 3 points 3 days ago Any time.  Hopefully this is 5D chess to get the media to cover it and then he points out how much rates have gone up or something permalink parent award report block reply Redpilledyogi 2 points 3 days ago Wouldn’t be so sure.  I bet Obama’s getting money is some sneaky way.  That’s what they do in DC. permalink parent award report block reply Boomstikchik 8 points 3 days ago Royalties? Seriously? I'm not surprised, but I didn't know. It all makes sense now. Kickbacks.\nFor such a \"scandal free\" presidency - there are sure a  shit ton of scandals coming out.\nAnd I'm glad he got cut off. permalink award report block reply UltraFrogMan 5 points 3 days ago Wtf permalink award report block reply I-am-Orlando OP PRO 4 points 3 days ago Link https://truthsocial.com/@realDonaldTrump/115520378078620283 permalink award report block reply TEXinLA 4 points 3 days ago LOCK HIM UP permalink award report block reply YodaBannon 3 points 3 days ago HOLY SHIT! permalink award report block reply ArmsLibertyjUStice 1 points 3 days ago Justice requires this to be paid back to the taxpayers with interest and penalty fees. permalink award report block reply MAGALADON9 1 points 3 days ago Eyyyyyy yoooooo! Dats like snatchin da man's chain bruh. Dayum permalink award report block reply MrUnderhill 1 points 3 days ago This is not true. It started as a parody. permalink award report block reply greatpumpkin 1 points 3 days ago How much of that can the gov't clawback? permalink award report block reply TrumpOrTreason 1 points 3 days ago Why? permalink award report block reply Redpilledyogi 1 points 3 days ago Heard this was fake news but I bet Obama is getting payoffs in some form or another cause that’s how shit works in DC.  It’s just not obvious.  Don’t think Trump would put out totally fake news.\nIt’s a shot across the bow. permalink award report block reply Im_RickSteves_bitch 1 points 3 days ago Look into what other money he's been stealing over the years, and/or the people stealing it to gived to him (while taking some for themselves, obviously). permalink award report block reply redinmn 1 points 3 days ago Not actually true.  I hope Trump doesnt get sucked into this stuff. permalink award report block reply SurveilThis 1 points 3 days ago Make Barry & Big Mike live in the Obamalisk. His Chicago communist roots will be good for him. permalink award report block reply Glenlaw 0 points 3 days ago Please provide the source for this claim. permalink award report block reply Dwoj 1 points 3 days ago A link is in the comments permalink parent award report block reply chuey_316 3 points 3 days ago That link is not a source. It just links to the post without a source. Yes President Trump posted it, but what he reposted actually came from a leftist propaganda page on facebook meant to trick conservatives so the left can discredit them. permalink parent award report block reply ahamrbond 2 points 3 days ago yeah I think he fell for it. perhaps he knows something we don't tho permalink parent award report block reply etcetera 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nhughjasske69 23 points 3 days ago Royalties for what ??  Fucking me and everyone else ??? permalink award report block reply MR__K 4 points 3 days ago Snopes and the others say this is bullshit. But i feel like trump wouldn't post unless there was some truth. permalink parent award report block reply hughjasske69 3 points 3 days ago I've heard this before though I don't remember when it's been months ago. It was reported he was collecting royalties in the past permalink parent award report block reply redinmn 2 points 3 days ago He cant get royalties from this, it went around back in 2018 I think and back then it was shown to be a non-starter.   I sure hope Trump doesnt get sucked into posting stuff like this.  As of now, his posts have meaning.  If they become nothing but bs, nobody is going to pay attention to them anymore. permalink parent award report block reply\nMR__K 4 points 3 days ago Snopes and the others say this is bullshit. But i feel like trump wouldn't post unless there was some truth. permalink parent award report block reply hughjasske69 3 points 3 days ago I've heard this before though I don't remember when it's been months ago. It was reported he was collecting royalties in the past permalink parent award report block reply redinmn 2 points 3 days ago He cant get royalties from this, it went around back in 2018 I think and back then it was shown to be a non-starter.   I sure hope Trump doesnt get sucked into posting stuff like this.  As of now, his posts have meaning.  If they become nothing but bs, nobody is going to pay attention to them anymore. permalink parent award report block reply\nhughjasske69 3 points 3 days ago I've heard this before though I don't remember when it's been months ago. It was reported he was collecting royalties in the past permalink parent award report block reply redinmn 2 points 3 days ago He cant get royalties from this, it went around back in 2018 I think and back then it was shown to be a non-starter.   I sure hope Trump doesnt get sucked into posting stuff like this.  As of now, his posts have meaning.  If they become nothing but bs, nobody is going to pay attention to them anymore. permalink parent award report block reply\nredinmn 2 points 3 days ago He cant get royalties from this, it went around back in 2018 I think and back then it was shown to be a non-starter.   I sure hope Trump doesnt get sucked into posting stuff like this.  As of now, his posts have meaning.  If they become nothing but bs, nobody is going to pay attention to them anymore. permalink parent award report block reply\nabstain 13 points 3 days ago This is the way. Take away his money and his homes little by little. permalink award report block reply Th0mas_Paine 5 points 3 days ago Yeah, if I stole 40 mil from you and then you just stopped giving me more, I'd be crushed. permalink parent award report block reply abstain 4 points 3 days ago Clawback and he will be crushed. permalink parent award report block reply\nTh0mas_Paine 5 points 3 days ago Yeah, if I stole 40 mil from you and then you just stopped giving me more, I'd be crushed. permalink parent award report block reply abstain 4 points 3 days ago Clawback and he will be crushed. permalink parent award report block reply\nabstain 4 points 3 days ago Clawback and he will be crushed. permalink parent award report block reply\nchuey_316 12 points 3 days ago I love our President, but he really needs a team to vet his social media posts at this point. This claim came from a meme by the America's Last Line of Defense FakeBook page back in January or February. All that page does is put out satire and disinformation meant to trick people, so the left can say \"haha look how dumb they are for believing that\" Posts like this do nothing but give the left ammunition. permalink award report block reply War_Hamster 7 points 3 days ago If you’re correct, and I think you are, this message needs to be spread rapidly. Obamacare is a disaster without kickbacks, but this kickback story is stealing the headlines in many feeds. Send me links and I’ll help- get this out to bigger channels. permalink parent award report block reply ianpatrick1966 5 points 3 days ago https://perma.cc/V7GN-AURA?utm_source=FactCheck.org&utm_campaign=3bd22c2453-EMAIL_CAMPAIGN_2025_02_27_04_11&utm_medium=email&utm_term=0_-3bd22c2453-48721901 https://web.archive.org/web/20250214170128/https://dunning-kruger-times.com/about-us/ permalink parent award report block reply War_Hamster 4 points 3 days ago That'll work.  Thanks. I've sent this out to the biggest names in my network. permalink parent award report block reply ianpatrick1966 1 points 3 days ago Unless your someone famous it's like pissing into the wind, my friend permalink parent award report block reply view 1 more comments... chuey_316 3 points 3 days ago Thanks fren. I had to step away for a bit and just saw War_Hamster's request. permalink parent award report block reply ianpatrick1966 3 points 3 days ago Any time.  Hopefully this is 5D chess to get the media to cover it and then he points out how much rates have gone up or something permalink parent award report block reply Redpilledyogi 2 points 3 days ago Wouldn’t be so sure.  I bet Obama’s getting money is some sneaky way.  That’s what they do in DC. permalink parent award report block reply\nWar_Hamster 7 points 3 days ago If you’re correct, and I think you are, this message needs to be spread rapidly. Obamacare is a disaster without kickbacks, but this kickback story is stealing the headlines in many feeds. Send me links and I’ll help- get this out to bigger channels. permalink parent award report block reply ianpatrick1966 5 points 3 days ago https://perma.cc/V7GN-AURA?utm_source=FactCheck.org&utm_campaign=3bd22c2453-EMAIL_CAMPAIGN_2025_02_27_04_11&utm_medium=email&utm_term=0_-3bd22c2453-48721901 https://web.archive.org/web/20250214170128/https://dunning-kruger-times.com/about-us/ permalink parent award report block reply War_Hamster 4 points 3 days ago That'll work.  Thanks. I've sent this out to the biggest names in my network. permalink parent award report block reply ianpatrick1966 1 points 3 days ago Unless your someone famous it's like pissing into the wind, my friend permalink parent award report block reply view 1 more comments... chuey_316 3 points 3 days ago Thanks fren. I had to step away for a bit and just saw War_Hamster's request. permalink parent award report block reply ianpatrick1966 3 points 3 days ago Any time.  Hopefully this is 5D chess to get the media to cover it and then he points out how much rates have gone up or something permalink parent award report block reply\nianpatrick1966 5 points 3 days ago https://perma.cc/V7GN-AURA?utm_source=FactCheck.org&utm_campaign=3bd22c2453-EMAIL_CAMPAIGN_2025_02_27_04_11&utm_medium=email&utm_term=0_-3bd22c2453-48721901 https://web.archive.org/web/20250214170128/https://dunning-kruger-times.com/about-us/ permalink parent award report block reply War_Hamster 4 points 3 days ago That'll work.  Thanks. I've sent this out to the biggest names in my network. permalink parent award report block reply ianpatrick1966 1 points 3 days ago Unless your someone famous it's like pissing into the wind, my friend permalink parent award report block reply view 1 more comments... chuey_316 3 points 3 days ago Thanks fren. I had to step away for a bit and just saw War_Hamster's request. permalink parent award report block reply ianpatrick1966 3 points 3 days ago Any time.  Hopefully this is 5D chess to get the media to cover it and then he points out how much rates have gone up or something permalink parent award report block reply\nWar_Hamster 4 points 3 days ago That'll work.  Thanks. I've sent this out to the biggest names in my network. permalink parent award report block reply ianpatrick1966 1 points 3 days ago Unless your someone famous it's like pissing into the wind, my friend permalink parent award report block reply view 1 more comments...\nianpatrick1966 1 points 3 days ago Unless your someone famous it's like pissing into the wind, my friend permalink parent award report block reply view 1 more comments...\nchuey_316 3 points 3 days ago Thanks fren. I had to step away for a bit and just saw War_Hamster's request. permalink parent award report block reply ianpatrick1966 3 points 3 days ago Any time.  Hopefully this is 5D chess to get the media to cover it and then he points out how much rates have gone up or something permalink parent award report block reply\nianpatrick1966 3 points 3 days ago Any time.  Hopefully this is 5D chess to get the media to cover it and then he points out how much rates have gone up or something permalink parent award report block reply\nRedpilledyogi 2 points 3 days ago Wouldn’t be so sure.  I bet Obama’s getting money is some sneaky way.  That’s what they do in DC. permalink parent award report block reply\nBoomstikchik 8 points 3 days ago Royalties? Seriously? I'm not surprised, but I didn't know. It all makes sense now. Kickbacks.\nFor such a \"scandal free\" presidency - there are sure a  shit ton of scandals coming out.\nAnd I'm glad he got cut off. permalink award report block reply\nUltraFrogMan 5 points 3 days ago Wtf permalink award report block reply\nI-am-Orlando OP PRO 4 points 3 days ago Link https://truthsocial.com/@realDonaldTrump/115520378078620283 permalink award report block reply\nTEXinLA 4 points 3 days ago LOCK HIM UP permalink award report block reply\nYodaBannon 3 points 3 days ago HOLY SHIT! permalink award report block reply\nArmsLibertyjUStice 1 points 3 days ago Justice requires this to be paid back to the taxpayers with interest and penalty fees. permalink award report block reply\nMAGALADON9 1 points 3 days ago Eyyyyyy yoooooo! Dats like snatchin da man's chain bruh. Dayum permalink award report block reply\nMrUnderhill 1 points 3 days ago This is not true. It started as a parody. permalink award report block reply\ngreatpumpkin 1 points 3 days ago How much of that can the gov't clawback? permalink award report block reply\nTrumpOrTreason 1 points 3 days ago Why? permalink award report block reply\nRedpilledyogi 1 points 3 days ago Heard this was fake news but I bet Obama is getting payoffs in some form or another cause that’s how shit works in DC.  It’s just not obvious.  Don’t think Trump would put out totally fake news.\nIt’s a shot across the bow. permalink award report block reply\nIm_RickSteves_bitch 1 points 3 days ago Look into what other money he's been stealing over the years, and/or the people stealing it to gived to him (while taking some for themselves, obviously). permalink award report block reply\nredinmn 1 points 3 days ago Not actually true.  I hope Trump doesnt get sucked into this stuff. permalink award report block reply\nSurveilThis 1 points 3 days ago Make Barry & Big Mike live in the Obamalisk. His Chicago communist roots will be good for him. permalink award report block reply\nGlenlaw 0 points 3 days ago Please provide the source for this claim. permalink award report block reply Dwoj 1 points 3 days ago A link is in the comments permalink parent award report block reply chuey_316 3 points 3 days ago That link is not a source. It just links to the post without a source. Yes President Trump posted it, but what he reposted actually came from a leftist propaganda page on facebook meant to trick conservatives so the left can discredit them. permalink parent award report block reply ahamrbond 2 points 3 days ago yeah I think he fell for it. perhaps he knows something we don't tho permalink parent award report block reply\nDwoj 1 points 3 days ago A link is in the comments permalink parent award report block reply chuey_316 3 points 3 days ago That link is not a source. It just links to the post without a source. Yes President Trump posted it, but what he reposted actually came from a leftist propaganda page on facebook meant to trick conservatives so the left can discredit them. permalink parent award report block reply ahamrbond 2 points 3 days ago yeah I think he fell for it. perhaps he knows something we don't tho permalink parent award report block reply\nchuey_316 3 points 3 days ago That link is not a source. It just links to the post without a source. Yes President Trump posted it, but what he reposted actually came from a leftist propaganda page on facebook meant to trick conservatives so the left can discredit them. permalink parent award report block reply ahamrbond 2 points 3 days ago yeah I think he fell for it. perhaps he knows something we don't tho permalink parent award report block reply\nahamrbond 2 points 3 days ago yeah I think he fell for it. perhaps he knows something we don't tho permalink parent award report block reply\netcetera 1 points 3 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:01:44.578654Z"
}