{
  "id": "8185223",
  "title": "120If \"winning\" means losing the mid-terms, being impeached again and then thrown in a prison with i",
  "url": "https://patriots.win/p/1ARK9nOFoh/if-winning-means-losing-the-midt/c",
  "content": "120 If \"winning\" means losing the mid-terms, being impeached again and then thrown in a prison with illegal alien and H-1B guards, he's got this. posted 5 hours ago by MrMcGreenGenes 15 comments award share download report block\n15 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style Lurker404 10 points 3 hours ago Looks like he got consumed by the pro-Israel and pro-cheap labor mass immigration deep state bubble a few months ago. permalink award report block reply CrossTheRubixCube 8 points 3 hours ago Quit being a DOOMER! Zion Don is making the country great again! Soon we’ll have thousands of Chinese spies and millions of Indians all over the country, on top of what we already have. He’ll deport a handful of illegals, so we’ll only have about 50 million left in the country. We are winning BIGLY! MIGA!!! permalink award report block reply _2022_ 3 points 3 hours ago Even when we win we lose permalink award report block reply rightoverthere 2 points 4 hours ago economy is greatest it's ever been. look at the stock market! up big time and we have trillions flooding into the us from foreigners paying tariffs just to have the privilege of selling their stuff to us with money we borrowed from the same country paying the tariffs. win win permalink award report block reply HumblePepe 6 points 4 hours ago Don't forget why 50 year mortgages are amazing! permalink parent award report block reply Ostia 4 points 4 hours ago The stock market was also the highest it's ever been under Biden. That means nothing to the actual economy, And foreigners don't pay tariffs. The importer does. That's us. You literally have no idea what you're talking about. permalink parent award report block reply rightoverthere 7 points 4 hours ago yeah that's the joke permalink parent award report block reply Ostia 4 points 4 hours ago Apologies, so many here would say shit like that with a straight face. permalink parent award report block reply Porkbut 1 points 3 hours ago When youre an npc who only repeats media rhetoric because reality is beyond them, of course thats your take. permalink parent award report block reply rightoverthere 1 points 3 hours ago i'm sure you saw the subject and also assume the op was serious. If \"winning\" means losing the mid-terms, being impeached again and then thrown in a prison with illegal alien and H-1B guards, he's got this. permalink parent award report block reply Porkbut 1 points 3 hours ago Yeah thats another one of your problems, you assume alot. Like most arrogant npcs. permalink parent award report block reply rightoverthere 1 points 3 hours ago lol you assumed this. \"of course thats your take\" maybe you need to pay attention permalink parent award report block reply view 1 more comments... JesusIsMyGod114 0 points 2 hours ago You're on a trump fan-page complaining about trump?? Delete your account and leave. permalink award report block reply MrMcGreenGenes OP 2 points 2 hours ago I'm commenting about the future he's creating. My MAGA card is in good standing, but his is about to be revoked. permalink parent award report block reply\nLurker404 10 points 3 hours ago Looks like he got consumed by the pro-Israel and pro-cheap labor mass immigration deep state bubble a few months ago. permalink award report block reply\nCrossTheRubixCube 8 points 3 hours ago Quit being a DOOMER! Zion Don is making the country great again! Soon we’ll have thousands of Chinese spies and millions of Indians all over the country, on top of what we already have. He’ll deport a handful of illegals, so we’ll only have about 50 million left in the country. We are winning BIGLY! MIGA!!! permalink award report block reply\n_2022_ 3 points 3 hours ago Even when we win we lose permalink award report block reply\nrightoverthere 2 points 4 hours ago economy is greatest it's ever been. look at the stock market! up big time and we have trillions flooding into the us from foreigners paying tariffs just to have the privilege of selling their stuff to us with money we borrowed from the same country paying the tariffs. win win permalink award report block reply HumblePepe 6 points 4 hours ago Don't forget why 50 year mortgages are amazing! permalink parent award report block reply Ostia 4 points 4 hours ago The stock market was also the highest it's ever been under Biden. That means nothing to the actual economy, And foreigners don't pay tariffs. The importer does. That's us. You literally have no idea what you're talking about. permalink parent award report block reply rightoverthere 7 points 4 hours ago yeah that's the joke permalink parent award report block reply Ostia 4 points 4 hours ago Apologies, so many here would say shit like that with a straight face. permalink parent award report block reply Porkbut 1 points 3 hours ago When youre an npc who only repeats media rhetoric because reality is beyond them, of course thats your take. permalink parent award report block reply rightoverthere 1 points 3 hours ago i'm sure you saw the subject and also assume the op was serious. If \"winning\" means losing the mid-terms, being impeached again and then thrown in a prison with illegal alien and H-1B guards, he's got this. permalink parent award report block reply Porkbut 1 points 3 hours ago Yeah thats another one of your problems, you assume alot. Like most arrogant npcs. permalink parent award report block reply rightoverthere 1 points 3 hours ago lol you assumed this. \"of course thats your take\" maybe you need to pay attention permalink parent award report block reply view 1 more comments...\nHumblePepe 6 points 4 hours ago Don't forget why 50 year mortgages are amazing! permalink parent award report block reply\nOstia 4 points 4 hours ago The stock market was also the highest it's ever been under Biden. That means nothing to the actual economy, And foreigners don't pay tariffs. The importer does. That's us. You literally have no idea what you're talking about. permalink parent award report block reply rightoverthere 7 points 4 hours ago yeah that's the joke permalink parent award report block reply Ostia 4 points 4 hours ago Apologies, so many here would say shit like that with a straight face. permalink parent award report block reply\nrightoverthere 7 points 4 hours ago yeah that's the joke permalink parent award report block reply Ostia 4 points 4 hours ago Apologies, so many here would say shit like that with a straight face. permalink parent award report block reply\nOstia 4 points 4 hours ago Apologies, so many here would say shit like that with a straight face. permalink parent award report block reply\nPorkbut 1 points 3 hours ago When youre an npc who only repeats media rhetoric because reality is beyond them, of course thats your take. permalink parent award report block reply rightoverthere 1 points 3 hours ago i'm sure you saw the subject and also assume the op was serious. If \"winning\" means losing the mid-terms, being impeached again and then thrown in a prison with illegal alien and H-1B guards, he's got this. permalink parent award report block reply Porkbut 1 points 3 hours ago Yeah thats another one of your problems, you assume alot. Like most arrogant npcs. permalink parent award report block reply rightoverthere 1 points 3 hours ago lol you assumed this. \"of course thats your take\" maybe you need to pay attention permalink parent award report block reply view 1 more comments...\nrightoverthere 1 points 3 hours ago i'm sure you saw the subject and also assume the op was serious. If \"winning\" means losing the mid-terms, being impeached again and then thrown in a prison with illegal alien and H-1B guards, he's got this. permalink parent award report block reply Porkbut 1 points 3 hours ago Yeah thats another one of your problems, you assume alot. Like most arrogant npcs. permalink parent award report block reply rightoverthere 1 points 3 hours ago lol you assumed this. \"of course thats your take\" maybe you need to pay attention permalink parent award report block reply view 1 more comments...\nPorkbut 1 points 3 hours ago Yeah thats another one of your problems, you assume alot. Like most arrogant npcs. permalink parent award report block reply rightoverthere 1 points 3 hours ago lol you assumed this. \"of course thats your take\" maybe you need to pay attention permalink parent award report block reply view 1 more comments...\nrightoverthere 1 points 3 hours ago lol you assumed this. \"of course thats your take\" maybe you need to pay attention permalink parent award report block reply view 1 more comments...\nJesusIsMyGod114 0 points 2 hours ago You're on a trump fan-page complaining about trump?? Delete your account and leave. permalink award report block reply MrMcGreenGenes OP 2 points 2 hours ago I'm commenting about the future he's creating. My MAGA card is in good standing, but his is about to be revoked. permalink parent award report block reply\nMrMcGreenGenes OP 2 points 2 hours ago I'm commenting about the future he's creating. My MAGA card is in good standing, but his is about to be revoked. permalink parent award report block reply"
}