{
  "id": "8168932",
  "title": "1678I am Born Againposted7 days agoby33KYogaEmails118 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK0TUsOg/i-am-born-again/c",
  "content": "1678 I am Born Again posted 7 days ago by 33KYogaEmails 118 comments award share download report block\n118 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style henri_derelicte 104 points 7 days ago “After careful consideration, I have decided to become more extreme in my religious beliefs.\" permalink award report block reply shadypollster 41 points 7 days ago DEUS VULT!!! permalink parent award report block reply USMC1234O10 29 points 7 days ago Time to DESTROY the GOATFUCKERS permalink parent award report block reply FrankDuncan 8 points 7 days ago Just can't half do it and also you can't be weak and show mercy to their women that also hate you and want you dead. permalink parent award report block reply glow-operator-2-0 5 points 7 days ago you can't be weak and show mercy Be an equal opportunity staker. Turn them all into lawn decorations. permalink parent award report block reply view 1 more comments... TwoArizonaPedes 5 points 7 days ago FIGHT! Pick a name or organization below and get involved. At the very least, subscribe to the Youtube channels of Dr. David Wood , Ridvan Aydemir the Apostate Prophet , and Sam Shamoun and start learning. Asmirandah, Ayaan Hirsi Ali, Mina Ahadi, Ridvan Aydemir, Gavin Boby, Matthew Bracken, Ashley Bumgarner, Joyce Chernick, Pat Condell, Nonie Darwish, Turan Dursun, Kacem El Ghazzali, Zineb El Rhazoui, Omar Farooq, Brigitte Gabriel, Stephen Gash, Pamela Geller, Valentina Gomez, Keith Graves, John Guandolo, Kenza Haddock, Sarah Haider, Raymond Ibrahim, Victoria Jackson, Sabatina James, James Jesser, Dr. Ahmed Joktan, Zara Kay, Cliff Kincaid, Massin Kevin Labidi, Marine Le Pen, Ezra Levant, Derya Little, Stephen Miller, Yasmine Mohammed, Douglas Murray, Maryam Namazie, Armin Navabi, Anders Gravers Pedersen, Christian Prince, Michelle Qureshi, Dr. Nabeel Qureshi, Sarah Wajd Qureshi, Abdul Rahman, Tommy Robinson, Salman Rushdie, Aliyah Saleem, Abdullah Sameer, Sam Shamoun, Imtiaz Shams, Ali Sina, Dr. Jay Smith, Robert Spencer, Harris Sultan, Wafa Sultan, Hatun Tash, Theo van Gogh, Eva Vlaardingerbroek, Dr. Bill Warner, Geert Wilders, Dr. David Wood, David Yerushalmi, Mosab Hassan Yousef, Iman Xmuslim, and more. North America: Act For America America First Legal American Freedom Law Center Answering Muslims Apologetics Roadshow Bradley Foundation Center for the Study of Political Islam (CSPI) Christian Warrior Training Ex-Muslims of North America (EXMNA) Former Muslims United (U.S.) Gates of Vienna Jihad Watch RAIR Foundation USA (Rise Align Ignite Reclaim) Souls & Liberty Stop Islamization of America (SIOA) The Religion of Peace (TROP) Young Apostates (U.S.) Europe: Alliance of Former Muslims (Ireland) Alternative for Germany (AfD) Association of Ex-Muslims of Switzerland Britain First Central Committee for Ex-Muslims of Scandinavia Central Council of Ex-Muslims (ZdE) (Germany) Council of Ex-Muslims of Britain (CEMB) (UK) Council of Ex-Muslims of France (CEMF) Defend Christ Critique Islam (DCCI) Ex-Muslims Initiative (Austria) Ex-Muslims North Meetup Group (UK) Ex-Muslims of Scotland Ex-Muslims of Norway Ex-Muslims of the Netherlands Ex-musulmani d'Italia (Italy) Faith to Faithless (UK) Hyde Park Christian Fellowship Movement of Ex-Muslims (Belgium) Platform New Freethinkers (Netherlands) Stop Islamization of Denmark Stop Islamization of Europe (SIOE) Elsewhere: Association of Atheism (Turkey) Atheist & Agnostic Alliance (Pakistan) Atheist Alliance of the Middle East and North Africa Atheist Republic (Iran) Council of Ex-Muslims of Jordan Council of Ex-Muslims of Morocco (CEMM) Council of Ex-Muslims of New Zealand Council of Ex-Muslims of Singapore Council of Ex-Muslims of Sri Lanka Ex-Muslims of Kerala (India) Ex-Muslims of South Africa National Sovereign Action (South Korea) Faithless Hijabi (Australia) Iranian Atheists & Agnostics Iranian Humanist Atheists & Agnostics Q Society of Australia Stop Islamization of Nations (SION) permalink parent award report block reply ElectricDragon- 2 points 7 days ago Atheism is not the road forward or even the road of resistance.  It goes nowhere permalink parent award report block reply TwoArizonaPedes 4 points 6 days ago Not as an end, you're right. If you read about people who leave cults it's very common for them to become atheists immediately upon leaving, if they weren't already. After their horrific experiences with the cult they don't want to have anything to do with spiritual beliefs or organized religion. You can hardly blame them, especially ex-Muslims. It takes time to heal, to rebuild their identity and world view. Ex-Muslims, who escaped a cult whose laws say they can and should be executed for leaving, particularly need security and support among others who share the same risk. It's natural for them to form groups to support each other through that transition period. I don't fault them for that. That doesn't mean they remain atheists and many don't. As time goes on many abandon atheism and begin searching for a belief system to fill the void caused by leaving their cult. permalink parent award report block reply view 2 more comments... Spindle-spin 1 points 7 days ago If liberals want to complain about the Christian Right being combative before, they're about to see a whole new level, I'd bet. permalink parent award report block reply Wtf_socialismreally 7 points 7 days ago Even heckling them is a whole new level from what we've done. We've seriously done not even a fraction of what they've done, or even what they've accused us of doing. permalink parent award report block reply KernalMustard 3 points 7 days ago Talk is cheap. You first. permalink parent award report block reply starjello 0 points 7 days ago He won't. This place is a bullshit artist colony. permalink parent award report block reply Owmyballz 11 points 7 days ago It's not extreme, its following your religion as expressed by our Lord and Savior Jesus Christ. permalink parent award report block reply HenkZeilstra 38 points 7 days ago Jews, call them by their name. Jews. They wanted the Middle East bombed so they could glcreate greater Israel and they love to dump the Muslim gentiles in the West, majority white countries and you are paying for it in cash and blood permalink award report block reply Friendly_B 0 points 6 days ago Migrant morality: Pope doubles down on message of acceptance Pope Francis intensifies his call for compassionate immigration policies, condemning barriers to migrants as a grave moral issue. https://www.usccb.org/news/2024/migrant-morality-pope-doubles-down-message-acceptance Pope Francis: An encounter with a migrant is an encounter with Christ In his message for the World Day of Migrants and Refugees, Pope Francis invites us to see migrations as a sign of the times and as a symbol of the Church’s pilgrimage throughout history. https://www.vaticannews.va/en/pope/news/2024-06/pope-francis-message-world-day-migrants-refugees-2024-synodality.html Pope Francis: Rejecting migrants is a ‘grave sin’ https://www.americamagazine.org/faith/2024/08/28/pope-francis-driving-away-migrants-grave-sin-248662 permalink parent award report block reply Jimmy33 -5 points 7 days ago Too easy to blame the Jews. Social media algorithms are all aligned to Jew bashing. Jews are only ONE of the 13 families which live beyond nation states, pulling the strings and playing with us plebs. permalink parent award report block reply friendlyratz 14 points 7 days ago No, normies are finally noticing. Social media and the media in general was controlled to the point that you were not allowed to even criticize them. Even here people self censor, people are finally waking up and calling it how they see it. permalink parent award report block reply Jimmy33 -5 points 7 days ago FFS. Jew bashing is everywhere. Boring hive mind. permalink parent award report block reply Glory-Unto-God 7 points 7 days ago Everytime I see you people mad about it all I can think of is buzz lightyear \"years of societal brainwashing wasted\" permalink parent award report block reply view 2 more comments... BoatingAccident 1 points 7 days ago The best part  is they just use this broad brush “Jews” argument say you can’t really argue because they don’t get specific. Like all Jews are some big monolith.  Lol.  It’s very specific people and they’re not even really Jewish that are controlling things.  Jews in name only. permalink parent award report block reply view 1 more comments... bumpman -7 points 7 days ago Islamists invade your neighborhood and assault your daughters.. “Just blame the Jews” permalink parent award report block reply AVeryNakedMan 20 points 7 days ago It's very strange to recognize, but it is often Jews voting to import the Muslims into White countries. permalink parent award report block reply bumpman 7 points 7 days ago Trump has put travel bans on Islamist countries, from what I’ve seen Jews have supported this idea and every action taken against radical Islam. But you’re saying American Jews actually secretly want to be invaded by muslims? This is some backwards ass logic. permalink parent award report block reply Muzzah 4 points 7 days ago Well, to be fair, didn’t the Jewish folks just help elect a muslim communist mayor of NY city? permalink parent award report block reply view 2 more comments... Greenblatts_4skin 4 points 7 days ago \"Islam is the broom of israel\"... which will sweep white Christendom from Europe. They literally say this permalink parent award report block reply Friendly_B 1 points 6 days ago Migrant morality: Pope doubles down on message of acceptance Pope Francis intensifies his call for compassionate immigration policies, condemning barriers to migrants as a grave moral issue. https://www.usccb.org/news/2024/migrant-morality-pope-doubles-down-message-acceptance Pope Francis: An encounter with a migrant is an encounter with Christ In his message for the World Day of Migrants and Refugees, Pope Francis invites us to see migrations as a sign of the times and as a symbol of the Church’s pilgrimage throughout history. https://www.vaticannews.va/en/pope/news/2024-06/pope-francis-message-world-day-migrants-refugees-2024-synodality.html Pope Francis: Rejecting migrants is a ‘grave sin’ https://www.americamagazine.org/faith/2024/08/28/pope-francis-driving-away-migrants-grave-sin-248662 permalink parent award report block reply Mellop 0 points 7 days ago The radical muslim wants to kill you. The liberal jew also wants the radical muslim to kill you. permalink parent award report block reply StoneRealist -5 points 7 days ago You're projecting. White women by in large vote for these things to happen. Get your women under control. permalink parent award report block reply 45fan 16 points 7 days ago And who creates all that mass media that encourages such behavior in women? Islamists beat their women to keep them in line. That's illegal for the Western man. permalink parent award report block reply view 5 more comments... Tryhardneckbeard -6 points 7 days ago The data is posted everywhere on the fuckin internet that women showed up in droves to vote for this shit last night yet you get the down doots... lol. permalink parent award report block reply view 5 more comments... Judenfrei 10 points 7 days ago Islamists invade your neighborhood and assault your daughters.. “Just blame the J.e.w.s” It has a name asshole. It's called the Kalergi Plan and it was developed from the mind of a card carrying k1k3. The purpose was to flood white countries with third world shitskins. https://themillenniumreport.com/2018/05/kalergi-plan-what-everyone-needs-to-know/ permalink parent award report block reply LaptopDied 3 points 7 days ago He was Austrian - Japanese. Not a Jew. permalink parent award report block reply Friendly_B 2 points 6 days ago Hey, what's your moderator username? Just wondering since you were banned but are now unbanned. https://patriots.win/c/TheDonald/p/1ARJr3talh/x/c/4eXtOpmXvkI permalink parent award report block reply Judenfrei 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply FutureFreemason 2 points 7 days ago Yes permalink parent award report block reply Greenblatts_4skin 2 points 7 days ago The barbarians are not strong enough. Who opened the gates of Toledo? permalink parent award report block reply Albertepstein32 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply drmrboy 24 points 7 days ago 👃 permalink award report block reply ModernKnight 32 points 7 days ago The Reconquista didn't just drive out the Mohammadans. permalink parent award report block reply ragnarokrobo 11 points 7 days ago And the first crusaders killed both jews and muslims when they took Jerusalem. permalink parent award report block reply KernalMustard 3 points 7 days ago Its was about retaking the city less about who occupied it permalink parent award report block reply ragnarokrobo 1 points 7 days ago I guess Godfrey of Bouillon swearing to avenge the blood of the crucified one by shedding jewish blood while on his way to Jerusalem was more about who occupied the land along the way too then. permalink parent award report block reply view 2 more comments... LORDFALCONE 11 points 7 days ago This permalink parent award report block reply cptkloss5 4 points 7 days ago I'm starting to seriously think it was also \"planned\" when the Spaniards \"let them choose\" - and majority of them were just able to spread around the Europe as \"Christians\" permalink parent award report block reply Somebody157 21 points 7 days ago I will fight against evil for eternity. Death will not even slow me down, it will just make me stronger for next time. Death is not and end, it is a continuation of the soul. permalink award report block reply FattyWatt 17 points 7 days ago \"Socialism and communism are not about justice. They are not about equality. They are not about lifting up the poor. They are certainly not about the good of the country. Socialism and communism are about one thing only — power for the ruling class.\" -- TRUMP permalink award report block reply Jimmy33 9 points 7 days ago Proven every time permalink parent award report block reply MySidesGoUp 17 points 7 days ago Those damned ‘Brazilians’ at it again…. permalink award report block reply DT170x 18 points 7 days ago It the Amish. Always the Amish. permalink parent award report block reply WhiskeyTwoNine 2 points 7 days ago Man I wish the world at large were more like the Amish. permalink parent award report block reply Beardholder 1 points 6 days ago Eskimos* you mean ? Like come on dude. 😅 permalink parent award report block reply GuerillaYourDreams 15 points 7 days ago The Leftists have pushed me so far away that I went from hating Reagan and Thatcher to being to the right of Pinochet. permalink award report block reply ParadigmShift2070 2 points 7 days ago Hate Reagan and Thatcher even more because they were not right enough permalink parent award report block reply jsphere256 11 points 7 days ago In 20 years we went from New York bringing democracy to the Middle East to democracy bringing the Middle East to New York. permalink award report block reply ParadigmShift2070 8 points 7 days ago We? permalink parent award report block reply Handshake_Shmanshake 9 points 7 days ago I WILL NOT BE CONQUERED BY ANY FOREIGN RELIGION. Any man or woman, who thinks they are superior to me and my family because their beliefs tell them that they are, they are a piece of shit who deserves no peace. This is not their land to conquer, we're in the modern era, and these diabolical cavemen think they can impose their disgusting sharia laws on us? I hope their braindead leaders are crucified. permalink award report block reply ParadigmShift2070 1 points 7 days ago Cool it with antisemitic remarks permalink parent award report block reply Handshake_Shmanshake 1 points 6 days ago lol permalink parent award report block reply KernalMustard -3 points 7 days ago Are you Christian? permalink parent award report block reply Handshake_Shmanshake 1 points 6 days ago Raised Catholic, I don't practice religion I just keep an open mind with spirituality, and I try to treat others as I want to be treated. These fucking psycho's want to treat anyone who is not them as lesser-than, and that makes me angry to my core. permalink parent award report block reply michaelsuede 7 points 7 days ago At least we can go back to banning women from voting and keeping them in the kitchen. Not all Muslim ideas are bad. permalink award report block reply Anon1970 4 points 7 days ago Slavery is a leftist value. permalink parent award report block reply donteatthat 2 points 7 days ago Silver linings, man. I like it. permalink parent award report block reply WhiskeyTwoNine 0 points 7 days ago Broken clocks and blind squirrels permalink parent award report block reply RickSanchezC137 6 points 7 days ago God wills it! permalink award report block reply donalds_stones 5 points 7 days ago They’re forcing Islam because it’s one of the only religions that subjugates people. Makes everybody poorer and fighting amongst themselves. So easy to control. permalink award report block reply Krat 4 points 7 days ago If by crusader you mean letting the same criminals who stab murder loot and pillage cities walk scott free then yes.... permalink award report block reply Cuetardian 4 points 7 days ago St. Michael the Archangel, defend us in battle . . . Be our protection against the wickedness and snares of the devil. May God rebuke him, we humbly pray, and do thou, O Prince of the heavenly hosts, by the power of God, cast into hell Satan, and all the evil spirits, who prowl about the world seeking the ruin of souls. permalink award report block reply _M_A_G_A_ 2 points 7 days ago Amen. permalink parent award report block reply Fbiisazzhoe 4 points 7 days ago All memes no action. Black pilled today. permalink award report block reply B0bE 4 points 7 days ago I'll believe it when I see it... permalink award report block reply orange_kek_great 2 points 7 days ago Blah blah blah. You'll do nothing. permalink award report block reply starjello 1 points 7 days ago You get it. They will down vote facts however. permalink parent award report block reply cptkloss5 2 points 7 days ago lol...\"global elites\" - it's just jews permalink award report block reply WhiskeyTwoNine 2 points 7 days ago Are the Jews in the room with you right now? Where did they hurt you? permalink parent award report block reply newuser8 1 points 7 days ago Yes and yes permalink parent award report block reply cptkloss5 0 points 6 days ago in a sense yes... the whole 1/8 permalink parent award report block reply FBIsurveillance 2 points 7 days ago Im sorry my lord but sometimes apostle Paul must pick up his sword permalink award report block reply YoopersGodsCountry 2 points 6 days ago I am a card carrying member permalink award report block reply Aoikaze2000 2 points 7 days ago DEUS VULT!!! permalink award report block reply Mhmm2MoreWeeks 2 points 7 days ago I know im Jewish, but can I put on the armor and help slay those cocksuckers when the time comes? Please. permalink award report block reply sir_rockness 1 points 6 days ago None of you will do anything permalink award report block reply ModelMinority 1 points 7 days ago But first wait for the Goatfuckers to put the LGBTQWhatevers+feminists to death first and then we destroy them. permalink award report block reply Albertepstein32 1 points 6 days ago I wonder what religion these global elites are. . . permalink award report block reply jdemarco2014 1 points 7 days ago We need to slaughter the Jews too because they facilitate the fucking Muslim invasion permalink award report block reply nod32 1 points 7 days ago \"global elites\" name (((them))) u coward permalink award report block reply Klaus73 1 points 7 days ago Sabaton intensifies permalink award report block reply KungPaoMcChicken 1 points 7 days ago When you tip your ride share driver $5 because he told you his partner is almost due to give birth but they split up recently and she's a narcissistic bitch and one of the most difficult things about life is being hard to work out if she's the one for you. permalink award report block reply Imnotnorm 0 points 7 days ago Yeah... it's those \"global elites\" again permalink award report block reply Pied-Trumper 0 points 7 days ago Elites > bankers > international capitalist cabal > people who’ve been kicked out of every country they’ve been in and it’s never been their fault We need the Muslims out but we also need to stop them at the gates, and we all know who tends to open gates so the enemy can come in. The problem won’t be solved as long as long as bad actors intentionally sidestep calling out who’s behind it all. permalink award report block reply Capoditutticapi1 0 points 7 days ago Need to \"level up\"! The medieval aesthetic is gone; the ethos of holy war is translated into 21st-century combined-arms warfare. Here’s how the archetype breaks down: Individual Protection (Armor)Plate Carrier / Body Armor  Level IV ceramic/composite plates (stops 7.62×51 AP) in a Crye Precision JPC 2.0 or LBT-6094. Soft armor panels in cummerbund and shoulder yolks. Crusader branding: Laser-engraved or embroidered Jerusalem cross on the front placard; subdued black or coyote-brown thread so it’s visible only up close. Some units use IR-reflective crosses that glow under night-vision for IFF. Helmet  Ops-Core FAST XP or Team Wendy EXFIL Ballistic. Crusader touch: Helmet cover with stenciled Chi-Rho (☧) or “Deus Vult” in micro-font; counterweight pouch holds a small New Testament or rosary beads instead of batteries. Uniform  Crye G3/G4 combat pants and shirt in Multicam or solid ranger-green. Patches: Subdued morale patch with Latin motto (“In Hoc Signo Vinces”) on shoulder; Velcro field cross on non-dominant arm for medics/chaplains. Boots & Gloves  Salomon or Lowa mountain boots; Mechanix or Oakley SI gloves. Nothing medieval survives here. Primary Weapon & Lethal LoadoutRifle  11.5–14.5″ AR-15 platform (LMT, Knights, or Daniel Defense) in 5.56×45. Suppressor (SureFire RC2), LPVO optic (1-8× Vortex Razor or Nightforce ATACR), PEQ-15/MAWL laser, offset RMR. Crusader engraving: Lower receiver rollmark “CRUX” or custom dust cover with Psalm 144:1 (“Blessed be the Lord my strength, which teacheth my hands to war…”). Sidearm  Glock 19 or Sig P320 X-Carry with RMR and X300 light; holstered in Safariland 6354RDS.  Spare mags on belt in Esstac Kywi pouches. Melee Backup (Symbolic)  A modern combat knife (Benchmade SOCP or Winkler RnD) carried inverted on plate carrier—purely ceremonial nod to the sword. Some carry a titanium rosary wrapped around the grip. Mobility & TransportGround Mobility  Up-armored Toyota Hilux technicals or Polaris MRZR 4×4 buggies with M240/Mk47 gun mounts. Crusader livery: Small magnetic Templar cross on doors; drone-jammer dome painted white with red cross. Air Insertion  MH-60M Black Hawks or CV-22 Ospreys flown by contracted 160th SOAR aviators. Fast-rope or SPIE-rig insertion under NVGs. Drones  FPV loitering munitions (Switchblade 600) launched from tube carriers on chest rigs. ISR quadcopters (DJI Mavic 3T) marked with micro-cross decals. Unit Structure & CommandFireteam (4–6 men)  Team leader with radio (AN/PRC-163), grenadier with M320 40 mm, DM with 7.62 SCAR-H SSR, auto-rifleman with KAC LAMG, JTAC/medic. Chaplain-combatant carries a short-barrel 300 BLK PDW and administers last rites via headset. Call Signs & Comms  “Templar-6,” “Knight-1,” etc. Secure comms via Silvus StreamCaster MANET radios; encrypted prayer channel for morale. Visual Snapshot: The 2025 Crusader in ActionNight-vision footage: six operators fast-roping from a blacked-out Black Hawk onto a rooftop in some contested urban strip. IR lasers flick on, suppressed 5.56 cracks in controlled pairs. One kneels to render aid—his IFAK pouch has a white cross glowing under IR. A Switchblade 600 arcs overhead, guided by a tablet stamped with a Chi-Rho. The only sounds are breathing, muffled shots, and the occasional Latin phrase over comms: “Pro Deo et patria.”No chainmail, no destrier, no two-handed sword. Just night-vision, body armor, precision rifles, and the same ancient war cry—now whispered into a Peltor headset... permalink award report block reply I_heart_blastbeats 0 points 7 days ago Honestly America needs this. IF there were another 9/11 scale terrorist attack on NYC Trump would nuke the whole fucking middle east. Getting rid of this kid fucking, goat fucking, pedo-god worshiping faggtos would be a great thing for humanity. Then we can work on the joos and christians next. All Abrahamic religions need to fucking die and the world needs to embrace Paganism. The Egyptians, many Afrikan, Caribbean the pre-hispanic, native american, many asian religions all have roots in paganism. Europeans already figured all of this out hundreds of thousands of years ago. Then the joos ruined it all. The lies of the bastard son and the whore mother have polluted our lives for far too long! Embrace the traditions, gods, songs and rituals of our ancestors and fuck these sand people! permalink award report block reply keeman 0 points 7 days ago The principal outcome of the crusades was European Christians sacking Constantinople and thereby letting the Muslim Turks take it.  You may have noticed that the entire area is currently Islamic, except for Isreal which is Zionist.  So good job crusaders! permalink award report block reply Magaman4200 0 points 7 days ago I like to think we are built different here in the US compared to EU fags permalink award report block reply flashersenpai -3 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans Let's talk about Muslims some more keep losing permalink award report block reply KernalMustard 2 points 7 days ago We warned them. Cant help those that refuse to listen permalink parent award report block reply\nhenri_derelicte 104 points 7 days ago “After careful consideration, I have decided to become more extreme in my religious beliefs.\" permalink award report block reply shadypollster 41 points 7 days ago DEUS VULT!!! permalink parent award report block reply USMC1234O10 29 points 7 days ago Time to DESTROY the GOATFUCKERS permalink parent award report block reply FrankDuncan 8 points 7 days ago Just can't half do it and also you can't be weak and show mercy to their women that also hate you and want you dead. permalink parent award report block reply glow-operator-2-0 5 points 7 days ago you can't be weak and show mercy Be an equal opportunity staker. Turn them all into lawn decorations. permalink parent award report block reply view 1 more comments... TwoArizonaPedes 5 points 7 days ago FIGHT! Pick a name or organization below and get involved. At the very least, subscribe to the Youtube channels of Dr. David Wood , Ridvan Aydemir the Apostate Prophet , and Sam Shamoun and start learning. Asmirandah, Ayaan Hirsi Ali, Mina Ahadi, Ridvan Aydemir, Gavin Boby, Matthew Bracken, Ashley Bumgarner, Joyce Chernick, Pat Condell, Nonie Darwish, Turan Dursun, Kacem El Ghazzali, Zineb El Rhazoui, Omar Farooq, Brigitte Gabriel, Stephen Gash, Pamela Geller, Valentina Gomez, Keith Graves, John Guandolo, Kenza Haddock, Sarah Haider, Raymond Ibrahim, Victoria Jackson, Sabatina James, James Jesser, Dr. Ahmed Joktan, Zara Kay, Cliff Kincaid, Massin Kevin Labidi, Marine Le Pen, Ezra Levant, Derya Little, Stephen Miller, Yasmine Mohammed, Douglas Murray, Maryam Namazie, Armin Navabi, Anders Gravers Pedersen, Christian Prince, Michelle Qureshi, Dr. Nabeel Qureshi, Sarah Wajd Qureshi, Abdul Rahman, Tommy Robinson, Salman Rushdie, Aliyah Saleem, Abdullah Sameer, Sam Shamoun, Imtiaz Shams, Ali Sina, Dr. Jay Smith, Robert Spencer, Harris Sultan, Wafa Sultan, Hatun Tash, Theo van Gogh, Eva Vlaardingerbroek, Dr. Bill Warner, Geert Wilders, Dr. David Wood, David Yerushalmi, Mosab Hassan Yousef, Iman Xmuslim, and more. North America: Act For America America First Legal American Freedom Law Center Answering Muslims Apologetics Roadshow Bradley Foundation Center for the Study of Political Islam (CSPI) Christian Warrior Training Ex-Muslims of North America (EXMNA) Former Muslims United (U.S.) Gates of Vienna Jihad Watch RAIR Foundation USA (Rise Align Ignite Reclaim) Souls & Liberty Stop Islamization of America (SIOA) The Religion of Peace (TROP) Young Apostates (U.S.) Europe: Alliance of Former Muslims (Ireland) Alternative for Germany (AfD) Association of Ex-Muslims of Switzerland Britain First Central Committee for Ex-Muslims of Scandinavia Central Council of Ex-Muslims (ZdE) (Germany) Council of Ex-Muslims of Britain (CEMB) (UK) Council of Ex-Muslims of France (CEMF) Defend Christ Critique Islam (DCCI) Ex-Muslims Initiative (Austria) Ex-Muslims North Meetup Group (UK) Ex-Muslims of Scotland Ex-Muslims of Norway Ex-Muslims of the Netherlands Ex-musulmani d'Italia (Italy) Faith to Faithless (UK) Hyde Park Christian Fellowship Movement of Ex-Muslims (Belgium) Platform New Freethinkers (Netherlands) Stop Islamization of Denmark Stop Islamization of Europe (SIOE) Elsewhere: Association of Atheism (Turkey) Atheist & Agnostic Alliance (Pakistan) Atheist Alliance of the Middle East and North Africa Atheist Republic (Iran) Council of Ex-Muslims of Jordan Council of Ex-Muslims of Morocco (CEMM) Council of Ex-Muslims of New Zealand Council of Ex-Muslims of Singapore Council of Ex-Muslims of Sri Lanka Ex-Muslims of Kerala (India) Ex-Muslims of South Africa National Sovereign Action (South Korea) Faithless Hijabi (Australia) Iranian Atheists & Agnostics Iranian Humanist Atheists & Agnostics Q Society of Australia Stop Islamization of Nations (SION) permalink parent award report block reply ElectricDragon- 2 points 7 days ago Atheism is not the road forward or even the road of resistance.  It goes nowhere permalink parent award report block reply TwoArizonaPedes 4 points 6 days ago Not as an end, you're right. If you read about people who leave cults it's very common for them to become atheists immediately upon leaving, if they weren't already. After their horrific experiences with the cult they don't want to have anything to do with spiritual beliefs or organized religion. You can hardly blame them, especially ex-Muslims. It takes time to heal, to rebuild their identity and world view. Ex-Muslims, who escaped a cult whose laws say they can and should be executed for leaving, particularly need security and support among others who share the same risk. It's natural for them to form groups to support each other through that transition period. I don't fault them for that. That doesn't mean they remain atheists and many don't. As time goes on many abandon atheism and begin searching for a belief system to fill the void caused by leaving their cult. permalink parent award report block reply view 2 more comments... Spindle-spin 1 points 7 days ago If liberals want to complain about the Christian Right being combative before, they're about to see a whole new level, I'd bet. permalink parent award report block reply Wtf_socialismreally 7 points 7 days ago Even heckling them is a whole new level from what we've done. We've seriously done not even a fraction of what they've done, or even what they've accused us of doing. permalink parent award report block reply KernalMustard 3 points 7 days ago Talk is cheap. You first. permalink parent award report block reply starjello 0 points 7 days ago He won't. This place is a bullshit artist colony. permalink parent award report block reply Owmyballz 11 points 7 days ago It's not extreme, its following your religion as expressed by our Lord and Savior Jesus Christ. permalink parent award report block reply\nshadypollster 41 points 7 days ago DEUS VULT!!! permalink parent award report block reply USMC1234O10 29 points 7 days ago Time to DESTROY the GOATFUCKERS permalink parent award report block reply FrankDuncan 8 points 7 days ago Just can't half do it and also you can't be weak and show mercy to their women that also hate you and want you dead. permalink parent award report block reply glow-operator-2-0 5 points 7 days ago you can't be weak and show mercy Be an equal opportunity staker. Turn them all into lawn decorations. permalink parent award report block reply view 1 more comments... TwoArizonaPedes 5 points 7 days ago FIGHT! Pick a name or organization below and get involved. At the very least, subscribe to the Youtube channels of Dr. David Wood , Ridvan Aydemir the Apostate Prophet , and Sam Shamoun and start learning. Asmirandah, Ayaan Hirsi Ali, Mina Ahadi, Ridvan Aydemir, Gavin Boby, Matthew Bracken, Ashley Bumgarner, Joyce Chernick, Pat Condell, Nonie Darwish, Turan Dursun, Kacem El Ghazzali, Zineb El Rhazoui, Omar Farooq, Brigitte Gabriel, Stephen Gash, Pamela Geller, Valentina Gomez, Keith Graves, John Guandolo, Kenza Haddock, Sarah Haider, Raymond Ibrahim, Victoria Jackson, Sabatina James, James Jesser, Dr. Ahmed Joktan, Zara Kay, Cliff Kincaid, Massin Kevin Labidi, Marine Le Pen, Ezra Levant, Derya Little, Stephen Miller, Yasmine Mohammed, Douglas Murray, Maryam Namazie, Armin Navabi, Anders Gravers Pedersen, Christian Prince, Michelle Qureshi, Dr. Nabeel Qureshi, Sarah Wajd Qureshi, Abdul Rahman, Tommy Robinson, Salman Rushdie, Aliyah Saleem, Abdullah Sameer, Sam Shamoun, Imtiaz Shams, Ali Sina, Dr. Jay Smith, Robert Spencer, Harris Sultan, Wafa Sultan, Hatun Tash, Theo van Gogh, Eva Vlaardingerbroek, Dr. Bill Warner, Geert Wilders, Dr. David Wood, David Yerushalmi, Mosab Hassan Yousef, Iman Xmuslim, and more. North America: Act For America America First Legal American Freedom Law Center Answering Muslims Apologetics Roadshow Bradley Foundation Center for the Study of Political Islam (CSPI) Christian Warrior Training Ex-Muslims of North America (EXMNA) Former Muslims United (U.S.) Gates of Vienna Jihad Watch RAIR Foundation USA (Rise Align Ignite Reclaim) Souls & Liberty Stop Islamization of America (SIOA) The Religion of Peace (TROP) Young Apostates (U.S.) Europe: Alliance of Former Muslims (Ireland) Alternative for Germany (AfD) Association of Ex-Muslims of Switzerland Britain First Central Committee for Ex-Muslims of Scandinavia Central Council of Ex-Muslims (ZdE) (Germany) Council of Ex-Muslims of Britain (CEMB) (UK) Council of Ex-Muslims of France (CEMF) Defend Christ Critique Islam (DCCI) Ex-Muslims Initiative (Austria) Ex-Muslims North Meetup Group (UK) Ex-Muslims of Scotland Ex-Muslims of Norway Ex-Muslims of the Netherlands Ex-musulmani d'Italia (Italy) Faith to Faithless (UK) Hyde Park Christian Fellowship Movement of Ex-Muslims (Belgium) Platform New Freethinkers (Netherlands) Stop Islamization of Denmark Stop Islamization of Europe (SIOE) Elsewhere: Association of Atheism (Turkey) Atheist & Agnostic Alliance (Pakistan) Atheist Alliance of the Middle East and North Africa Atheist Republic (Iran) Council of Ex-Muslims of Jordan Council of Ex-Muslims of Morocco (CEMM) Council of Ex-Muslims of New Zealand Council of Ex-Muslims of Singapore Council of Ex-Muslims of Sri Lanka Ex-Muslims of Kerala (India) Ex-Muslims of South Africa National Sovereign Action (South Korea) Faithless Hijabi (Australia) Iranian Atheists & Agnostics Iranian Humanist Atheists & Agnostics Q Society of Australia Stop Islamization of Nations (SION) permalink parent award report block reply ElectricDragon- 2 points 7 days ago Atheism is not the road forward or even the road of resistance.  It goes nowhere permalink parent award report block reply TwoArizonaPedes 4 points 6 days ago Not as an end, you're right. If you read about people who leave cults it's very common for them to become atheists immediately upon leaving, if they weren't already. After their horrific experiences with the cult they don't want to have anything to do with spiritual beliefs or organized religion. You can hardly blame them, especially ex-Muslims. It takes time to heal, to rebuild their identity and world view. Ex-Muslims, who escaped a cult whose laws say they can and should be executed for leaving, particularly need security and support among others who share the same risk. It's natural for them to form groups to support each other through that transition period. I don't fault them for that. That doesn't mean they remain atheists and many don't. As time goes on many abandon atheism and begin searching for a belief system to fill the void caused by leaving their cult. permalink parent award report block reply view 2 more comments... Spindle-spin 1 points 7 days ago If liberals want to complain about the Christian Right being combative before, they're about to see a whole new level, I'd bet. permalink parent award report block reply Wtf_socialismreally 7 points 7 days ago Even heckling them is a whole new level from what we've done. We've seriously done not even a fraction of what they've done, or even what they've accused us of doing. permalink parent award report block reply KernalMustard 3 points 7 days ago Talk is cheap. You first. permalink parent award report block reply starjello 0 points 7 days ago He won't. This place is a bullshit artist colony. permalink parent award report block reply\nUSMC1234O10 29 points 7 days ago Time to DESTROY the GOATFUCKERS permalink parent award report block reply FrankDuncan 8 points 7 days ago Just can't half do it and also you can't be weak and show mercy to their women that also hate you and want you dead. permalink parent award report block reply glow-operator-2-0 5 points 7 days ago you can't be weak and show mercy Be an equal opportunity staker. Turn them all into lawn decorations. permalink parent award report block reply view 1 more comments...\nFrankDuncan 8 points 7 days ago Just can't half do it and also you can't be weak and show mercy to their women that also hate you and want you dead. permalink parent award report block reply glow-operator-2-0 5 points 7 days ago you can't be weak and show mercy Be an equal opportunity staker. Turn them all into lawn decorations. permalink parent award report block reply view 1 more comments...\nglow-operator-2-0 5 points 7 days ago you can't be weak and show mercy Be an equal opportunity staker. Turn them all into lawn decorations. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 5 points 7 days ago FIGHT! Pick a name or organization below and get involved. At the very least, subscribe to the Youtube channels of Dr. David Wood , Ridvan Aydemir the Apostate Prophet , and Sam Shamoun and start learning. Asmirandah, Ayaan Hirsi Ali, Mina Ahadi, Ridvan Aydemir, Gavin Boby, Matthew Bracken, Ashley Bumgarner, Joyce Chernick, Pat Condell, Nonie Darwish, Turan Dursun, Kacem El Ghazzali, Zineb El Rhazoui, Omar Farooq, Brigitte Gabriel, Stephen Gash, Pamela Geller, Valentina Gomez, Keith Graves, John Guandolo, Kenza Haddock, Sarah Haider, Raymond Ibrahim, Victoria Jackson, Sabatina James, James Jesser, Dr. Ahmed Joktan, Zara Kay, Cliff Kincaid, Massin Kevin Labidi, Marine Le Pen, Ezra Levant, Derya Little, Stephen Miller, Yasmine Mohammed, Douglas Murray, Maryam Namazie, Armin Navabi, Anders Gravers Pedersen, Christian Prince, Michelle Qureshi, Dr. Nabeel Qureshi, Sarah Wajd Qureshi, Abdul Rahman, Tommy Robinson, Salman Rushdie, Aliyah Saleem, Abdullah Sameer, Sam Shamoun, Imtiaz Shams, Ali Sina, Dr. Jay Smith, Robert Spencer, Harris Sultan, Wafa Sultan, Hatun Tash, Theo van Gogh, Eva Vlaardingerbroek, Dr. Bill Warner, Geert Wilders, Dr. David Wood, David Yerushalmi, Mosab Hassan Yousef, Iman Xmuslim, and more. North America: Act For America America First Legal American Freedom Law Center Answering Muslims Apologetics Roadshow Bradley Foundation Center for the Study of Political Islam (CSPI) Christian Warrior Training Ex-Muslims of North America (EXMNA) Former Muslims United (U.S.) Gates of Vienna Jihad Watch RAIR Foundation USA (Rise Align Ignite Reclaim) Souls & Liberty Stop Islamization of America (SIOA) The Religion of Peace (TROP) Young Apostates (U.S.) Europe: Alliance of Former Muslims (Ireland) Alternative for Germany (AfD) Association of Ex-Muslims of Switzerland Britain First Central Committee for Ex-Muslims of Scandinavia Central Council of Ex-Muslims (ZdE) (Germany) Council of Ex-Muslims of Britain (CEMB) (UK) Council of Ex-Muslims of France (CEMF) Defend Christ Critique Islam (DCCI) Ex-Muslims Initiative (Austria) Ex-Muslims North Meetup Group (UK) Ex-Muslims of Scotland Ex-Muslims of Norway Ex-Muslims of the Netherlands Ex-musulmani d'Italia (Italy) Faith to Faithless (UK) Hyde Park Christian Fellowship Movement of Ex-Muslims (Belgium) Platform New Freethinkers (Netherlands) Stop Islamization of Denmark Stop Islamization of Europe (SIOE) Elsewhere: Association of Atheism (Turkey) Atheist & Agnostic Alliance (Pakistan) Atheist Alliance of the Middle East and North Africa Atheist Republic (Iran) Council of Ex-Muslims of Jordan Council of Ex-Muslims of Morocco (CEMM) Council of Ex-Muslims of New Zealand Council of Ex-Muslims of Singapore Council of Ex-Muslims of Sri Lanka Ex-Muslims of Kerala (India) Ex-Muslims of South Africa National Sovereign Action (South Korea) Faithless Hijabi (Australia) Iranian Atheists & Agnostics Iranian Humanist Atheists & Agnostics Q Society of Australia Stop Islamization of Nations (SION) permalink parent award report block reply ElectricDragon- 2 points 7 days ago Atheism is not the road forward or even the road of resistance.  It goes nowhere permalink parent award report block reply TwoArizonaPedes 4 points 6 days ago Not as an end, you're right. If you read about people who leave cults it's very common for them to become atheists immediately upon leaving, if they weren't already. After their horrific experiences with the cult they don't want to have anything to do with spiritual beliefs or organized religion. You can hardly blame them, especially ex-Muslims. It takes time to heal, to rebuild their identity and world view. Ex-Muslims, who escaped a cult whose laws say they can and should be executed for leaving, particularly need security and support among others who share the same risk. It's natural for them to form groups to support each other through that transition period. I don't fault them for that. That doesn't mean they remain atheists and many don't. As time goes on many abandon atheism and begin searching for a belief system to fill the void caused by leaving their cult. permalink parent award report block reply view 2 more comments...\nElectricDragon- 2 points 7 days ago Atheism is not the road forward or even the road of resistance.  It goes nowhere permalink parent award report block reply TwoArizonaPedes 4 points 6 days ago Not as an end, you're right. If you read about people who leave cults it's very common for them to become atheists immediately upon leaving, if they weren't already. After their horrific experiences with the cult they don't want to have anything to do with spiritual beliefs or organized religion. You can hardly blame them, especially ex-Muslims. It takes time to heal, to rebuild their identity and world view. Ex-Muslims, who escaped a cult whose laws say they can and should be executed for leaving, particularly need security and support among others who share the same risk. It's natural for them to form groups to support each other through that transition period. I don't fault them for that. That doesn't mean they remain atheists and many don't. As time goes on many abandon atheism and begin searching for a belief system to fill the void caused by leaving their cult. permalink parent award report block reply view 2 more comments...\nTwoArizonaPedes 4 points 6 days ago Not as an end, you're right. If you read about people who leave cults it's very common for them to become atheists immediately upon leaving, if they weren't already. After their horrific experiences with the cult they don't want to have anything to do with spiritual beliefs or organized religion. You can hardly blame them, especially ex-Muslims. It takes time to heal, to rebuild their identity and world view. Ex-Muslims, who escaped a cult whose laws say they can and should be executed for leaving, particularly need security and support among others who share the same risk. It's natural for them to form groups to support each other through that transition period. I don't fault them for that. That doesn't mean they remain atheists and many don't. As time goes on many abandon atheism and begin searching for a belief system to fill the void caused by leaving their cult. permalink parent award report block reply view 2 more comments...\nSpindle-spin 1 points 7 days ago If liberals want to complain about the Christian Right being combative before, they're about to see a whole new level, I'd bet. permalink parent award report block reply Wtf_socialismreally 7 points 7 days ago Even heckling them is a whole new level from what we've done. We've seriously done not even a fraction of what they've done, or even what they've accused us of doing. permalink parent award report block reply KernalMustard 3 points 7 days ago Talk is cheap. You first. permalink parent award report block reply starjello 0 points 7 days ago He won't. This place is a bullshit artist colony. permalink parent award report block reply\nWtf_socialismreally 7 points 7 days ago Even heckling them is a whole new level from what we've done. We've seriously done not even a fraction of what they've done, or even what they've accused us of doing. permalink parent award report block reply\nKernalMustard 3 points 7 days ago Talk is cheap. You first. permalink parent award report block reply starjello 0 points 7 days ago He won't. This place is a bullshit artist colony. permalink parent award report block reply\nstarjello 0 points 7 days ago He won't. This place is a bullshit artist colony. permalink parent award report block reply\nOwmyballz 11 points 7 days ago It's not extreme, its following your religion as expressed by our Lord and Savior Jesus Christ. permalink parent award report block reply\nHenkZeilstra 38 points 7 days ago Jews, call them by their name. Jews. They wanted the Middle East bombed so they could glcreate greater Israel and they love to dump the Muslim gentiles in the West, majority white countries and you are paying for it in cash and blood permalink award report block reply Friendly_B 0 points 6 days ago Migrant morality: Pope doubles down on message of acceptance Pope Francis intensifies his call for compassionate immigration policies, condemning barriers to migrants as a grave moral issue. https://www.usccb.org/news/2024/migrant-morality-pope-doubles-down-message-acceptance Pope Francis: An encounter with a migrant is an encounter with Christ In his message for the World Day of Migrants and Refugees, Pope Francis invites us to see migrations as a sign of the times and as a symbol of the Church’s pilgrimage throughout history. https://www.vaticannews.va/en/pope/news/2024-06/pope-francis-message-world-day-migrants-refugees-2024-synodality.html Pope Francis: Rejecting migrants is a ‘grave sin’ https://www.americamagazine.org/faith/2024/08/28/pope-francis-driving-away-migrants-grave-sin-248662 permalink parent award report block reply Jimmy33 -5 points 7 days ago Too easy to blame the Jews. Social media algorithms are all aligned to Jew bashing. Jews are only ONE of the 13 families which live beyond nation states, pulling the strings and playing with us plebs. permalink parent award report block reply friendlyratz 14 points 7 days ago No, normies are finally noticing. Social media and the media in general was controlled to the point that you were not allowed to even criticize them. Even here people self censor, people are finally waking up and calling it how they see it. permalink parent award report block reply Jimmy33 -5 points 7 days ago FFS. Jew bashing is everywhere. Boring hive mind. permalink parent award report block reply Glory-Unto-God 7 points 7 days ago Everytime I see you people mad about it all I can think of is buzz lightyear \"years of societal brainwashing wasted\" permalink parent award report block reply view 2 more comments... BoatingAccident 1 points 7 days ago The best part  is they just use this broad brush “Jews” argument say you can’t really argue because they don’t get specific. Like all Jews are some big monolith.  Lol.  It’s very specific people and they’re not even really Jewish that are controlling things.  Jews in name only. permalink parent award report block reply view 1 more comments... bumpman -7 points 7 days ago Islamists invade your neighborhood and assault your daughters.. “Just blame the Jews” permalink parent award report block reply AVeryNakedMan 20 points 7 days ago It's very strange to recognize, but it is often Jews voting to import the Muslims into White countries. permalink parent award report block reply bumpman 7 points 7 days ago Trump has put travel bans on Islamist countries, from what I’ve seen Jews have supported this idea and every action taken against radical Islam. But you’re saying American Jews actually secretly want to be invaded by muslims? This is some backwards ass logic. permalink parent award report block reply Muzzah 4 points 7 days ago Well, to be fair, didn’t the Jewish folks just help elect a muslim communist mayor of NY city? permalink parent award report block reply view 2 more comments... Greenblatts_4skin 4 points 7 days ago \"Islam is the broom of israel\"... which will sweep white Christendom from Europe. They literally say this permalink parent award report block reply Friendly_B 1 points 6 days ago Migrant morality: Pope doubles down on message of acceptance Pope Francis intensifies his call for compassionate immigration policies, condemning barriers to migrants as a grave moral issue. https://www.usccb.org/news/2024/migrant-morality-pope-doubles-down-message-acceptance Pope Francis: An encounter with a migrant is an encounter with Christ In his message for the World Day of Migrants and Refugees, Pope Francis invites us to see migrations as a sign of the times and as a symbol of the Church’s pilgrimage throughout history. https://www.vaticannews.va/en/pope/news/2024-06/pope-francis-message-world-day-migrants-refugees-2024-synodality.html Pope Francis: Rejecting migrants is a ‘grave sin’ https://www.americamagazine.org/faith/2024/08/28/pope-francis-driving-away-migrants-grave-sin-248662 permalink parent award report block reply Mellop 0 points 7 days ago The radical muslim wants to kill you. The liberal jew also wants the radical muslim to kill you. permalink parent award report block reply StoneRealist -5 points 7 days ago You're projecting. White women by in large vote for these things to happen. Get your women under control. permalink parent award report block reply 45fan 16 points 7 days ago And who creates all that mass media that encourages such behavior in women? Islamists beat their women to keep them in line. That's illegal for the Western man. permalink parent award report block reply view 5 more comments... Tryhardneckbeard -6 points 7 days ago The data is posted everywhere on the fuckin internet that women showed up in droves to vote for this shit last night yet you get the down doots... lol. permalink parent award report block reply view 5 more comments... Judenfrei 10 points 7 days ago Islamists invade your neighborhood and assault your daughters.. “Just blame the J.e.w.s” It has a name asshole. It's called the Kalergi Plan and it was developed from the mind of a card carrying k1k3. The purpose was to flood white countries with third world shitskins. https://themillenniumreport.com/2018/05/kalergi-plan-what-everyone-needs-to-know/ permalink parent award report block reply LaptopDied 3 points 7 days ago He was Austrian - Japanese. Not a Jew. permalink parent award report block reply Friendly_B 2 points 6 days ago Hey, what's your moderator username? Just wondering since you were banned but are now unbanned. https://patriots.win/c/TheDonald/p/1ARJr3talh/x/c/4eXtOpmXvkI permalink parent award report block reply Judenfrei 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply FutureFreemason 2 points 7 days ago Yes permalink parent award report block reply Greenblatts_4skin 2 points 7 days ago The barbarians are not strong enough. Who opened the gates of Toledo? permalink parent award report block reply Albertepstein32 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply\nFriendly_B 0 points 6 days ago Migrant morality: Pope doubles down on message of acceptance Pope Francis intensifies his call for compassionate immigration policies, condemning barriers to migrants as a grave moral issue. https://www.usccb.org/news/2024/migrant-morality-pope-doubles-down-message-acceptance Pope Francis: An encounter with a migrant is an encounter with Christ In his message for the World Day of Migrants and Refugees, Pope Francis invites us to see migrations as a sign of the times and as a symbol of the Church’s pilgrimage throughout history. https://www.vaticannews.va/en/pope/news/2024-06/pope-francis-message-world-day-migrants-refugees-2024-synodality.html Pope Francis: Rejecting migrants is a ‘grave sin’ https://www.americamagazine.org/faith/2024/08/28/pope-francis-driving-away-migrants-grave-sin-248662 permalink parent award report block reply\nJimmy33 -5 points 7 days ago Too easy to blame the Jews. Social media algorithms are all aligned to Jew bashing. Jews are only ONE of the 13 families which live beyond nation states, pulling the strings and playing with us plebs. permalink parent award report block reply friendlyratz 14 points 7 days ago No, normies are finally noticing. Social media and the media in general was controlled to the point that you were not allowed to even criticize them. Even here people self censor, people are finally waking up and calling it how they see it. permalink parent award report block reply Jimmy33 -5 points 7 days ago FFS. Jew bashing is everywhere. Boring hive mind. permalink parent award report block reply Glory-Unto-God 7 points 7 days ago Everytime I see you people mad about it all I can think of is buzz lightyear \"years of societal brainwashing wasted\" permalink parent award report block reply view 2 more comments... BoatingAccident 1 points 7 days ago The best part  is they just use this broad brush “Jews” argument say you can’t really argue because they don’t get specific. Like all Jews are some big monolith.  Lol.  It’s very specific people and they’re not even really Jewish that are controlling things.  Jews in name only. permalink parent award report block reply view 1 more comments...\nfriendlyratz 14 points 7 days ago No, normies are finally noticing. Social media and the media in general was controlled to the point that you were not allowed to even criticize them. Even here people self censor, people are finally waking up and calling it how they see it. permalink parent award report block reply Jimmy33 -5 points 7 days ago FFS. Jew bashing is everywhere. Boring hive mind. permalink parent award report block reply Glory-Unto-God 7 points 7 days ago Everytime I see you people mad about it all I can think of is buzz lightyear \"years of societal brainwashing wasted\" permalink parent award report block reply view 2 more comments... BoatingAccident 1 points 7 days ago The best part  is they just use this broad brush “Jews” argument say you can’t really argue because they don’t get specific. Like all Jews are some big monolith.  Lol.  It’s very specific people and they’re not even really Jewish that are controlling things.  Jews in name only. permalink parent award report block reply view 1 more comments...\nJimmy33 -5 points 7 days ago FFS. Jew bashing is everywhere. Boring hive mind. permalink parent award report block reply Glory-Unto-God 7 points 7 days ago Everytime I see you people mad about it all I can think of is buzz lightyear \"years of societal brainwashing wasted\" permalink parent award report block reply view 2 more comments... BoatingAccident 1 points 7 days ago The best part  is they just use this broad brush “Jews” argument say you can’t really argue because they don’t get specific. Like all Jews are some big monolith.  Lol.  It’s very specific people and they’re not even really Jewish that are controlling things.  Jews in name only. permalink parent award report block reply view 1 more comments...\nGlory-Unto-God 7 points 7 days ago Everytime I see you people mad about it all I can think of is buzz lightyear \"years of societal brainwashing wasted\" permalink parent award report block reply view 2 more comments...\nBoatingAccident 1 points 7 days ago The best part  is they just use this broad brush “Jews” argument say you can’t really argue because they don’t get specific. Like all Jews are some big monolith.  Lol.  It’s very specific people and they’re not even really Jewish that are controlling things.  Jews in name only. permalink parent award report block reply view 1 more comments...\nbumpman -7 points 7 days ago Islamists invade your neighborhood and assault your daughters.. “Just blame the Jews” permalink parent award report block reply AVeryNakedMan 20 points 7 days ago It's very strange to recognize, but it is often Jews voting to import the Muslims into White countries. permalink parent award report block reply bumpman 7 points 7 days ago Trump has put travel bans on Islamist countries, from what I’ve seen Jews have supported this idea and every action taken against radical Islam. But you’re saying American Jews actually secretly want to be invaded by muslims? This is some backwards ass logic. permalink parent award report block reply Muzzah 4 points 7 days ago Well, to be fair, didn’t the Jewish folks just help elect a muslim communist mayor of NY city? permalink parent award report block reply view 2 more comments... Greenblatts_4skin 4 points 7 days ago \"Islam is the broom of israel\"... which will sweep white Christendom from Europe. They literally say this permalink parent award report block reply Friendly_B 1 points 6 days ago Migrant morality: Pope doubles down on message of acceptance Pope Francis intensifies his call for compassionate immigration policies, condemning barriers to migrants as a grave moral issue. https://www.usccb.org/news/2024/migrant-morality-pope-doubles-down-message-acceptance Pope Francis: An encounter with a migrant is an encounter with Christ In his message for the World Day of Migrants and Refugees, Pope Francis invites us to see migrations as a sign of the times and as a symbol of the Church’s pilgrimage throughout history. https://www.vaticannews.va/en/pope/news/2024-06/pope-francis-message-world-day-migrants-refugees-2024-synodality.html Pope Francis: Rejecting migrants is a ‘grave sin’ https://www.americamagazine.org/faith/2024/08/28/pope-francis-driving-away-migrants-grave-sin-248662 permalink parent award report block reply Mellop 0 points 7 days ago The radical muslim wants to kill you. The liberal jew also wants the radical muslim to kill you. permalink parent award report block reply StoneRealist -5 points 7 days ago You're projecting. White women by in large vote for these things to happen. Get your women under control. permalink parent award report block reply 45fan 16 points 7 days ago And who creates all that mass media that encourages such behavior in women? Islamists beat their women to keep them in line. That's illegal for the Western man. permalink parent award report block reply view 5 more comments... Tryhardneckbeard -6 points 7 days ago The data is posted everywhere on the fuckin internet that women showed up in droves to vote for this shit last night yet you get the down doots... lol. permalink parent award report block reply view 5 more comments... Judenfrei 10 points 7 days ago Islamists invade your neighborhood and assault your daughters.. “Just blame the J.e.w.s” It has a name asshole. It's called the Kalergi Plan and it was developed from the mind of a card carrying k1k3. The purpose was to flood white countries with third world shitskins. https://themillenniumreport.com/2018/05/kalergi-plan-what-everyone-needs-to-know/ permalink parent award report block reply LaptopDied 3 points 7 days ago He was Austrian - Japanese. Not a Jew. permalink parent award report block reply Friendly_B 2 points 6 days ago Hey, what's your moderator username? Just wondering since you were banned but are now unbanned. https://patriots.win/c/TheDonald/p/1ARJr3talh/x/c/4eXtOpmXvkI permalink parent award report block reply Judenfrei 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply FutureFreemason 2 points 7 days ago Yes permalink parent award report block reply Greenblatts_4skin 2 points 7 days ago The barbarians are not strong enough. Who opened the gates of Toledo? permalink parent award report block reply\nAVeryNakedMan 20 points 7 days ago It's very strange to recognize, but it is often Jews voting to import the Muslims into White countries. permalink parent award report block reply bumpman 7 points 7 days ago Trump has put travel bans on Islamist countries, from what I’ve seen Jews have supported this idea and every action taken against radical Islam. But you’re saying American Jews actually secretly want to be invaded by muslims? This is some backwards ass logic. permalink parent award report block reply Muzzah 4 points 7 days ago Well, to be fair, didn’t the Jewish folks just help elect a muslim communist mayor of NY city? permalink parent award report block reply view 2 more comments... Greenblatts_4skin 4 points 7 days ago \"Islam is the broom of israel\"... which will sweep white Christendom from Europe. They literally say this permalink parent award report block reply Friendly_B 1 points 6 days ago Migrant morality: Pope doubles down on message of acceptance Pope Francis intensifies his call for compassionate immigration policies, condemning barriers to migrants as a grave moral issue. https://www.usccb.org/news/2024/migrant-morality-pope-doubles-down-message-acceptance Pope Francis: An encounter with a migrant is an encounter with Christ In his message for the World Day of Migrants and Refugees, Pope Francis invites us to see migrations as a sign of the times and as a symbol of the Church’s pilgrimage throughout history. https://www.vaticannews.va/en/pope/news/2024-06/pope-francis-message-world-day-migrants-refugees-2024-synodality.html Pope Francis: Rejecting migrants is a ‘grave sin’ https://www.americamagazine.org/faith/2024/08/28/pope-francis-driving-away-migrants-grave-sin-248662 permalink parent award report block reply Mellop 0 points 7 days ago The radical muslim wants to kill you. The liberal jew also wants the radical muslim to kill you. permalink parent award report block reply StoneRealist -5 points 7 days ago You're projecting. White women by in large vote for these things to happen. Get your women under control. permalink parent award report block reply 45fan 16 points 7 days ago And who creates all that mass media that encourages such behavior in women? Islamists beat their women to keep them in line. That's illegal for the Western man. permalink parent award report block reply view 5 more comments... Tryhardneckbeard -6 points 7 days ago The data is posted everywhere on the fuckin internet that women showed up in droves to vote for this shit last night yet you get the down doots... lol. permalink parent award report block reply view 5 more comments...\nbumpman 7 points 7 days ago Trump has put travel bans on Islamist countries, from what I’ve seen Jews have supported this idea and every action taken against radical Islam. But you’re saying American Jews actually secretly want to be invaded by muslims? This is some backwards ass logic. permalink parent award report block reply Muzzah 4 points 7 days ago Well, to be fair, didn’t the Jewish folks just help elect a muslim communist mayor of NY city? permalink parent award report block reply view 2 more comments... Greenblatts_4skin 4 points 7 days ago \"Islam is the broom of israel\"... which will sweep white Christendom from Europe. They literally say this permalink parent award report block reply\nMuzzah 4 points 7 days ago Well, to be fair, didn’t the Jewish folks just help elect a muslim communist mayor of NY city? permalink parent award report block reply view 2 more comments...\nGreenblatts_4skin 4 points 7 days ago \"Islam is the broom of israel\"... which will sweep white Christendom from Europe. They literally say this permalink parent award report block reply\nFriendly_B 1 points 6 days ago Migrant morality: Pope doubles down on message of acceptance Pope Francis intensifies his call for compassionate immigration policies, condemning barriers to migrants as a grave moral issue. https://www.usccb.org/news/2024/migrant-morality-pope-doubles-down-message-acceptance Pope Francis: An encounter with a migrant is an encounter with Christ In his message for the World Day of Migrants and Refugees, Pope Francis invites us to see migrations as a sign of the times and as a symbol of the Church’s pilgrimage throughout history. https://www.vaticannews.va/en/pope/news/2024-06/pope-francis-message-world-day-migrants-refugees-2024-synodality.html Pope Francis: Rejecting migrants is a ‘grave sin’ https://www.americamagazine.org/faith/2024/08/28/pope-francis-driving-away-migrants-grave-sin-248662 permalink parent award report block reply\nMellop 0 points 7 days ago The radical muslim wants to kill you. The liberal jew also wants the radical muslim to kill you. permalink parent award report block reply\nStoneRealist -5 points 7 days ago You're projecting. White women by in large vote for these things to happen. Get your women under control. permalink parent award report block reply 45fan 16 points 7 days ago And who creates all that mass media that encourages such behavior in women? Islamists beat their women to keep them in line. That's illegal for the Western man. permalink parent award report block reply view 5 more comments... Tryhardneckbeard -6 points 7 days ago The data is posted everywhere on the fuckin internet that women showed up in droves to vote for this shit last night yet you get the down doots... lol. permalink parent award report block reply view 5 more comments...\n45fan 16 points 7 days ago And who creates all that mass media that encourages such behavior in women? Islamists beat their women to keep them in line. That's illegal for the Western man. permalink parent award report block reply view 5 more comments...\nTryhardneckbeard -6 points 7 days ago The data is posted everywhere on the fuckin internet that women showed up in droves to vote for this shit last night yet you get the down doots... lol. permalink parent award report block reply view 5 more comments...\nJudenfrei 10 points 7 days ago Islamists invade your neighborhood and assault your daughters.. “Just blame the J.e.w.s” It has a name asshole. It's called the Kalergi Plan and it was developed from the mind of a card carrying k1k3. The purpose was to flood white countries with third world shitskins. https://themillenniumreport.com/2018/05/kalergi-plan-what-everyone-needs-to-know/ permalink parent award report block reply LaptopDied 3 points 7 days ago He was Austrian - Japanese. Not a Jew. permalink parent award report block reply Friendly_B 2 points 6 days ago Hey, what's your moderator username? Just wondering since you were banned but are now unbanned. https://patriots.win/c/TheDonald/p/1ARJr3talh/x/c/4eXtOpmXvkI permalink parent award report block reply Judenfrei 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nLaptopDied 3 points 7 days ago He was Austrian - Japanese. Not a Jew. permalink parent award report block reply\nFriendly_B 2 points 6 days ago Hey, what's your moderator username? Just wondering since you were banned but are now unbanned. https://patriots.win/c/TheDonald/p/1ARJr3talh/x/c/4eXtOpmXvkI permalink parent award report block reply Judenfrei 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nJudenfrei 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nFutureFreemason 2 points 7 days ago Yes permalink parent award report block reply\nGreenblatts_4skin 2 points 7 days ago The barbarians are not strong enough. Who opened the gates of Toledo? permalink parent award report block reply\nAlbertepstein32 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply\ndrmrboy 24 points 7 days ago 👃 permalink award report block reply ModernKnight 32 points 7 days ago The Reconquista didn't just drive out the Mohammadans. permalink parent award report block reply ragnarokrobo 11 points 7 days ago And the first crusaders killed both jews and muslims when they took Jerusalem. permalink parent award report block reply KernalMustard 3 points 7 days ago Its was about retaking the city less about who occupied it permalink parent award report block reply ragnarokrobo 1 points 7 days ago I guess Godfrey of Bouillon swearing to avenge the blood of the crucified one by shedding jewish blood while on his way to Jerusalem was more about who occupied the land along the way too then. permalink parent award report block reply view 2 more comments... LORDFALCONE 11 points 7 days ago This permalink parent award report block reply cptkloss5 4 points 7 days ago I'm starting to seriously think it was also \"planned\" when the Spaniards \"let them choose\" - and majority of them were just able to spread around the Europe as \"Christians\" permalink parent award report block reply\nModernKnight 32 points 7 days ago The Reconquista didn't just drive out the Mohammadans. permalink parent award report block reply ragnarokrobo 11 points 7 days ago And the first crusaders killed both jews and muslims when they took Jerusalem. permalink parent award report block reply KernalMustard 3 points 7 days ago Its was about retaking the city less about who occupied it permalink parent award report block reply ragnarokrobo 1 points 7 days ago I guess Godfrey of Bouillon swearing to avenge the blood of the crucified one by shedding jewish blood while on his way to Jerusalem was more about who occupied the land along the way too then. permalink parent award report block reply view 2 more comments... LORDFALCONE 11 points 7 days ago This permalink parent award report block reply cptkloss5 4 points 7 days ago I'm starting to seriously think it was also \"planned\" when the Spaniards \"let them choose\" - and majority of them were just able to spread around the Europe as \"Christians\" permalink parent award report block reply\nragnarokrobo 11 points 7 days ago And the first crusaders killed both jews and muslims when they took Jerusalem. permalink parent award report block reply KernalMustard 3 points 7 days ago Its was about retaking the city less about who occupied it permalink parent award report block reply ragnarokrobo 1 points 7 days ago I guess Godfrey of Bouillon swearing to avenge the blood of the crucified one by shedding jewish blood while on his way to Jerusalem was more about who occupied the land along the way too then. permalink parent award report block reply view 2 more comments...\nKernalMustard 3 points 7 days ago Its was about retaking the city less about who occupied it permalink parent award report block reply ragnarokrobo 1 points 7 days ago I guess Godfrey of Bouillon swearing to avenge the blood of the crucified one by shedding jewish blood while on his way to Jerusalem was more about who occupied the land along the way too then. permalink parent award report block reply view 2 more comments...\nragnarokrobo 1 points 7 days ago I guess Godfrey of Bouillon swearing to avenge the blood of the crucified one by shedding jewish blood while on his way to Jerusalem was more about who occupied the land along the way too then. permalink parent award report block reply view 2 more comments...\nLORDFALCONE 11 points 7 days ago This permalink parent award report block reply\ncptkloss5 4 points 7 days ago I'm starting to seriously think it was also \"planned\" when the Spaniards \"let them choose\" - and majority of them were just able to spread around the Europe as \"Christians\" permalink parent award report block reply\nSomebody157 21 points 7 days ago I will fight against evil for eternity. Death will not even slow me down, it will just make me stronger for next time. Death is not and end, it is a continuation of the soul. permalink award report block reply\nFattyWatt 17 points 7 days ago \"Socialism and communism are not about justice. They are not about equality. They are not about lifting up the poor. They are certainly not about the good of the country. Socialism and communism are about one thing only — power for the ruling class.\" -- TRUMP permalink award report block reply Jimmy33 9 points 7 days ago Proven every time permalink parent award report block reply\nJimmy33 9 points 7 days ago Proven every time permalink parent award report block reply\nMySidesGoUp 17 points 7 days ago Those damned ‘Brazilians’ at it again…. permalink award report block reply DT170x 18 points 7 days ago It the Amish. Always the Amish. permalink parent award report block reply WhiskeyTwoNine 2 points 7 days ago Man I wish the world at large were more like the Amish. permalink parent award report block reply Beardholder 1 points 6 days ago Eskimos* you mean ? Like come on dude. 😅 permalink parent award report block reply\nDT170x 18 points 7 days ago It the Amish. Always the Amish. permalink parent award report block reply WhiskeyTwoNine 2 points 7 days ago Man I wish the world at large were more like the Amish. permalink parent award report block reply\nWhiskeyTwoNine 2 points 7 days ago Man I wish the world at large were more like the Amish. permalink parent award report block reply\nBeardholder 1 points 6 days ago Eskimos* you mean ? Like come on dude. 😅 permalink parent award report block reply\nGuerillaYourDreams 15 points 7 days ago The Leftists have pushed me so far away that I went from hating Reagan and Thatcher to being to the right of Pinochet. permalink award report block reply ParadigmShift2070 2 points 7 days ago Hate Reagan and Thatcher even more because they were not right enough permalink parent award report block reply\nParadigmShift2070 2 points 7 days ago Hate Reagan and Thatcher even more because they were not right enough permalink parent award report block reply\njsphere256 11 points 7 days ago In 20 years we went from New York bringing democracy to the Middle East to democracy bringing the Middle East to New York. permalink award report block reply ParadigmShift2070 8 points 7 days ago We? permalink parent award report block reply\nParadigmShift2070 8 points 7 days ago We? permalink parent award report block reply\nHandshake_Shmanshake 9 points 7 days ago I WILL NOT BE CONQUERED BY ANY FOREIGN RELIGION. Any man or woman, who thinks they are superior to me and my family because their beliefs tell them that they are, they are a piece of shit who deserves no peace. This is not their land to conquer, we're in the modern era, and these diabolical cavemen think they can impose their disgusting sharia laws on us? I hope their braindead leaders are crucified. permalink award report block reply ParadigmShift2070 1 points 7 days ago Cool it with antisemitic remarks permalink parent award report block reply Handshake_Shmanshake 1 points 6 days ago lol permalink parent award report block reply KernalMustard -3 points 7 days ago Are you Christian? permalink parent award report block reply Handshake_Shmanshake 1 points 6 days ago Raised Catholic, I don't practice religion I just keep an open mind with spirituality, and I try to treat others as I want to be treated. These fucking psycho's want to treat anyone who is not them as lesser-than, and that makes me angry to my core. permalink parent award report block reply\nParadigmShift2070 1 points 7 days ago Cool it with antisemitic remarks permalink parent award report block reply Handshake_Shmanshake 1 points 6 days ago lol permalink parent award report block reply\nHandshake_Shmanshake 1 points 6 days ago lol permalink parent award report block reply\nKernalMustard -3 points 7 days ago Are you Christian? permalink parent award report block reply Handshake_Shmanshake 1 points 6 days ago Raised Catholic, I don't practice religion I just keep an open mind with spirituality, and I try to treat others as I want to be treated. These fucking psycho's want to treat anyone who is not them as lesser-than, and that makes me angry to my core. permalink parent award report block reply\nHandshake_Shmanshake 1 points 6 days ago Raised Catholic, I don't practice religion I just keep an open mind with spirituality, and I try to treat others as I want to be treated. These fucking psycho's want to treat anyone who is not them as lesser-than, and that makes me angry to my core. permalink parent award report block reply\nmichaelsuede 7 points 7 days ago At least we can go back to banning women from voting and keeping them in the kitchen. Not all Muslim ideas are bad. permalink award report block reply Anon1970 4 points 7 days ago Slavery is a leftist value. permalink parent award report block reply donteatthat 2 points 7 days ago Silver linings, man. I like it. permalink parent award report block reply WhiskeyTwoNine 0 points 7 days ago Broken clocks and blind squirrels permalink parent award report block reply\nAnon1970 4 points 7 days ago Slavery is a leftist value. permalink parent award report block reply\ndonteatthat 2 points 7 days ago Silver linings, man. I like it. permalink parent award report block reply WhiskeyTwoNine 0 points 7 days ago Broken clocks and blind squirrels permalink parent award report block reply\nWhiskeyTwoNine 0 points 7 days ago Broken clocks and blind squirrels permalink parent award report block reply\nRickSanchezC137 6 points 7 days ago God wills it! permalink award report block reply\ndonalds_stones 5 points 7 days ago They’re forcing Islam because it’s one of the only religions that subjugates people. Makes everybody poorer and fighting amongst themselves. So easy to control. permalink award report block reply\nKrat 4 points 7 days ago If by crusader you mean letting the same criminals who stab murder loot and pillage cities walk scott free then yes.... permalink award report block reply\nCuetardian 4 points 7 days ago St. Michael the Archangel, defend us in battle . . . Be our protection against the wickedness and snares of the devil. May God rebuke him, we humbly pray, and do thou, O Prince of the heavenly hosts, by the power of God, cast into hell Satan, and all the evil spirits, who prowl about the world seeking the ruin of souls. permalink award report block reply _M_A_G_A_ 2 points 7 days ago Amen. permalink parent award report block reply\n_M_A_G_A_ 2 points 7 days ago Amen. permalink parent award report block reply\nFbiisazzhoe 4 points 7 days ago All memes no action. Black pilled today. permalink award report block reply\nB0bE 4 points 7 days ago I'll believe it when I see it... permalink award report block reply\norange_kek_great 2 points 7 days ago Blah blah blah. You'll do nothing. permalink award report block reply starjello 1 points 7 days ago You get it. They will down vote facts however. permalink parent award report block reply\nstarjello 1 points 7 days ago You get it. They will down vote facts however. permalink parent award report block reply\ncptkloss5 2 points 7 days ago lol...\"global elites\" - it's just jews permalink award report block reply WhiskeyTwoNine 2 points 7 days ago Are the Jews in the room with you right now? Where did they hurt you? permalink parent award report block reply newuser8 1 points 7 days ago Yes and yes permalink parent award report block reply cptkloss5 0 points 6 days ago in a sense yes... the whole 1/8 permalink parent award report block reply\nWhiskeyTwoNine 2 points 7 days ago Are the Jews in the room with you right now? Where did they hurt you? permalink parent award report block reply newuser8 1 points 7 days ago Yes and yes permalink parent award report block reply cptkloss5 0 points 6 days ago in a sense yes... the whole 1/8 permalink parent award report block reply\nnewuser8 1 points 7 days ago Yes and yes permalink parent award report block reply\ncptkloss5 0 points 6 days ago in a sense yes... the whole 1/8 permalink parent award report block reply\nFBIsurveillance 2 points 7 days ago Im sorry my lord but sometimes apostle Paul must pick up his sword permalink award report block reply\nYoopersGodsCountry 2 points 6 days ago I am a card carrying member permalink award report block reply\nAoikaze2000 2 points 7 days ago DEUS VULT!!! permalink award report block reply\nMhmm2MoreWeeks 2 points 7 days ago I know im Jewish, but can I put on the armor and help slay those cocksuckers when the time comes? Please. permalink award report block reply\nsir_rockness 1 points 6 days ago None of you will do anything permalink award report block reply\nModelMinority 1 points 7 days ago But first wait for the Goatfuckers to put the LGBTQWhatevers+feminists to death first and then we destroy them. permalink award report block reply\nAlbertepstein32 1 points 6 days ago I wonder what religion these global elites are. . . permalink award report block reply\njdemarco2014 1 points 7 days ago We need to slaughter the Jews too because they facilitate the fucking Muslim invasion permalink award report block reply\nnod32 1 points 7 days ago \"global elites\" name (((them))) u coward permalink award report block reply\nKlaus73 1 points 7 days ago Sabaton intensifies permalink award report block reply\nKungPaoMcChicken 1 points 7 days ago When you tip your ride share driver $5 because he told you his partner is almost due to give birth but they split up recently and she's a narcissistic bitch and one of the most difficult things about life is being hard to work out if she's the one for you. permalink award report block reply\nImnotnorm 0 points 7 days ago Yeah... it's those \"global elites\" again permalink award report block reply\nPied-Trumper 0 points 7 days ago Elites > bankers > international capitalist cabal > people who’ve been kicked out of every country they’ve been in and it’s never been their fault We need the Muslims out but we also need to stop them at the gates, and we all know who tends to open gates so the enemy can come in. The problem won’t be solved as long as long as bad actors intentionally sidestep calling out who’s behind it all. permalink award report block reply\nCapoditutticapi1 0 points 7 days ago Need to \"level up\"! The medieval aesthetic is gone; the ethos of holy war is translated into 21st-century combined-arms warfare. Here’s how the archetype breaks down: Individual Protection (Armor)Plate Carrier / Body Armor  Level IV ceramic/composite plates (stops 7.62×51 AP) in a Crye Precision JPC 2.0 or LBT-6094. Soft armor panels in cummerbund and shoulder yolks. Crusader branding: Laser-engraved or embroidered Jerusalem cross on the front placard; subdued black or coyote-brown thread so it’s visible only up close. Some units use IR-reflective crosses that glow under night-vision for IFF. Helmet  Ops-Core FAST XP or Team Wendy EXFIL Ballistic. Crusader touch: Helmet cover with stenciled Chi-Rho (☧) or “Deus Vult” in micro-font; counterweight pouch holds a small New Testament or rosary beads instead of batteries. Uniform  Crye G3/G4 combat pants and shirt in Multicam or solid ranger-green. Patches: Subdued morale patch with Latin motto (“In Hoc Signo Vinces”) on shoulder; Velcro field cross on non-dominant arm for medics/chaplains. Boots & Gloves  Salomon or Lowa mountain boots; Mechanix or Oakley SI gloves. Nothing medieval survives here. Primary Weapon & Lethal LoadoutRifle  11.5–14.5″ AR-15 platform (LMT, Knights, or Daniel Defense) in 5.56×45. Suppressor (SureFire RC2), LPVO optic (1-8× Vortex Razor or Nightforce ATACR), PEQ-15/MAWL laser, offset RMR. Crusader engraving: Lower receiver rollmark “CRUX” or custom dust cover with Psalm 144:1 (“Blessed be the Lord my strength, which teacheth my hands to war…”). Sidearm  Glock 19 or Sig P320 X-Carry with RMR and X300 light; holstered in Safariland 6354RDS.  Spare mags on belt in Esstac Kywi pouches. Melee Backup (Symbolic)  A modern combat knife (Benchmade SOCP or Winkler RnD) carried inverted on plate carrier—purely ceremonial nod to the sword. Some carry a titanium rosary wrapped around the grip. Mobility & TransportGround Mobility  Up-armored Toyota Hilux technicals or Polaris MRZR 4×4 buggies with M240/Mk47 gun mounts. Crusader livery: Small magnetic Templar cross on doors; drone-jammer dome painted white with red cross. Air Insertion  MH-60M Black Hawks or CV-22 Ospreys flown by contracted 160th SOAR aviators. Fast-rope or SPIE-rig insertion under NVGs. Drones  FPV loitering munitions (Switchblade 600) launched from tube carriers on chest rigs. ISR quadcopters (DJI Mavic 3T) marked with micro-cross decals. Unit Structure & CommandFireteam (4–6 men)  Team leader with radio (AN/PRC-163), grenadier with M320 40 mm, DM with 7.62 SCAR-H SSR, auto-rifleman with KAC LAMG, JTAC/medic. Chaplain-combatant carries a short-barrel 300 BLK PDW and administers last rites via headset. Call Signs & Comms  “Templar-6,” “Knight-1,” etc. Secure comms via Silvus StreamCaster MANET radios; encrypted prayer channel for morale. Visual Snapshot: The 2025 Crusader in ActionNight-vision footage: six operators fast-roping from a blacked-out Black Hawk onto a rooftop in some contested urban strip. IR lasers flick on, suppressed 5.56 cracks in controlled pairs. One kneels to render aid—his IFAK pouch has a white cross glowing under IR. A Switchblade 600 arcs overhead, guided by a tablet stamped with a Chi-Rho. The only sounds are breathing, muffled shots, and the occasional Latin phrase over comms: “Pro Deo et patria.”No chainmail, no destrier, no two-handed sword. Just night-vision, body armor, precision rifles, and the same ancient war cry—now whispered into a Peltor headset... permalink award report block reply\nI_heart_blastbeats 0 points 7 days ago Honestly America needs this. IF there were another 9/11 scale terrorist attack on NYC Trump would nuke the whole fucking middle east. Getting rid of this kid fucking, goat fucking, pedo-god worshiping faggtos would be a great thing for humanity. Then we can work on the joos and christians next. All Abrahamic religions need to fucking die and the world needs to embrace Paganism. The Egyptians, many Afrikan, Caribbean the pre-hispanic, native american, many asian religions all have roots in paganism. Europeans already figured all of this out hundreds of thousands of years ago. Then the joos ruined it all. The lies of the bastard son and the whore mother have polluted our lives for far too long! Embrace the traditions, gods, songs and rituals of our ancestors and fuck these sand people! permalink award report block reply\nkeeman 0 points 7 days ago The principal outcome of the crusades was European Christians sacking Constantinople and thereby letting the Muslim Turks take it.  You may have noticed that the entire area is currently Islamic, except for Isreal which is Zionist.  So good job crusaders! permalink award report block reply\nMagaman4200 0 points 7 days ago I like to think we are built different here in the US compared to EU fags permalink award report block reply\nflashersenpai -3 points 7 days ago Republicans lose supermajority in Mississippi and races in GA, including 30 point shifts away from Republicans Let's talk about Muslims some more keep losing permalink award report block reply KernalMustard 2 points 7 days ago We warned them. Cant help those that refuse to listen permalink parent award report block reply\nKernalMustard 2 points 7 days ago We warned them. Cant help those that refuse to listen permalink parent award report block reply",
  "fetched_at": "2025-11-12T19:58:26.836099Z"
}