{
  "id": "1ARK9hiH5D",
  "url": "https://patriots.win/p/1ARK9hiH5D/breaking-president-trump-pardone/c",
  "content": "485 Breaking: President Trump pardoned the 2020 Alternative Electors. posted 2 days ago by kinbergfan 12 comments award share report block Ed Martin @EdMartinDOJ • 3d Breaking: President Trump pardoned the 2020 Alternative Electors. Thank you: @POTUS for allowing me, as U.S. Pardon Attorney, to work with @WhiteHouse, along with  @AGPamBondi, @DAGToddBlanche & SG John Sauer, to achieve your intent—let their healing begin. #Federalist74 ⚖️\n12 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Bullet3250 9 points 2 days ago Arrest those who forced FALSE CHARGES onto what is EXACTLY the Constitutional procedure for when major elections are Challenged. LOCK THEM UP. End this LAWFARE GARBAGE!! permalink award report block reply Knockoff 7 points 2 days ago Dems do it in 1876: “Alternate electors”\nRepublicans do it in 2020: “fake electors” that get prosecuted permalink award report block reply ChrisSuperDude 3 points 2 days ago I saw a video a while back about the 1876 election and it was titled something like “the most corrupt election in history.” The first thing I said was “Until Rutherford B Hayes starts arresting his opponents, 2020 is still the most corrupt.” permalink parent award report block reply rebuildingMyself 2 points 2 days ago They, and their Hollywood puppets, were literally pushing alternate electors when they got their asses handed to them in 2016. permalink parent award report block reply AlwaysTrumper2020 6 points 2 days ago I knew one of them.  Sadly, he passed away in September. permalink award report block reply God-is-good 2 points 2 days ago Condolences. May He Rest In Peace. permalink parent award report block reply Monzie 1 points 2 days ago It's insane that he even had to pardon them in the first place. What a travesty of justice. Alternate electors are a thing. permalink award report block reply Rakkasan91b 1 points 2 days ago Yeah, that's great now how about you get Bondi to make some fucking arrests already. permalink award report block reply maganopolis 1 points 2 days ago I hope he uses the backlash to raise the profile of this pipebomber revelation permalink award report block reply Whatyougotson 1 points 2 days ago Didnt jenna ellis turn on trump at some point or maybe im mistaken. permalink award report block reply goldkeyboardwarrior 1 points 2 days ago If I remember correctly she turned on him and made a plea deal in the Georgia case (which Trump’s pardon doesn’t cover since it’s state charges) in exchange for agreeing to testify for the prosecution. Don’t remember all of the details but I think she argued lawyer fees to fight it would bankrupt her. permalink parent award report block reply John_Calhoun 1 points 2 days ago The alternate elctors got busted? permalink award report block reply\nBullet3250 9 points 2 days ago Arrest those who forced FALSE CHARGES onto what is EXACTLY the Constitutional procedure for when major elections are Challenged. LOCK THEM UP. End this LAWFARE GARBAGE!! permalink award report block reply\nKnockoff 7 points 2 days ago Dems do it in 1876: “Alternate electors”\nRepublicans do it in 2020: “fake electors” that get prosecuted permalink award report block reply ChrisSuperDude 3 points 2 days ago I saw a video a while back about the 1876 election and it was titled something like “the most corrupt election in history.” The first thing I said was “Until Rutherford B Hayes starts arresting his opponents, 2020 is still the most corrupt.” permalink parent award report block reply rebuildingMyself 2 points 2 days ago They, and their Hollywood puppets, were literally pushing alternate electors when they got their asses handed to them in 2016. permalink parent award report block reply\nChrisSuperDude 3 points 2 days ago I saw a video a while back about the 1876 election and it was titled something like “the most corrupt election in history.” The first thing I said was “Until Rutherford B Hayes starts arresting his opponents, 2020 is still the most corrupt.” permalink parent award report block reply\nrebuildingMyself 2 points 2 days ago They, and their Hollywood puppets, were literally pushing alternate electors when they got their asses handed to them in 2016. permalink parent award report block reply\nAlwaysTrumper2020 6 points 2 days ago I knew one of them.  Sadly, he passed away in September. permalink award report block reply God-is-good 2 points 2 days ago Condolences. May He Rest In Peace. permalink parent award report block reply\nGod-is-good 2 points 2 days ago Condolences. May He Rest In Peace. permalink parent award report block reply\nMonzie 1 points 2 days ago It's insane that he even had to pardon them in the first place. What a travesty of justice. Alternate electors are a thing. permalink award report block reply\nRakkasan91b 1 points 2 days ago Yeah, that's great now how about you get Bondi to make some fucking arrests already. permalink award report block reply\nmaganopolis 1 points 2 days ago I hope he uses the backlash to raise the profile of this pipebomber revelation permalink award report block reply\nWhatyougotson 1 points 2 days ago Didnt jenna ellis turn on trump at some point or maybe im mistaken. permalink award report block reply goldkeyboardwarrior 1 points 2 days ago If I remember correctly she turned on him and made a plea deal in the Georgia case (which Trump’s pardon doesn’t cover since it’s state charges) in exchange for agreeing to testify for the prosecution. Don’t remember all of the details but I think she argued lawyer fees to fight it would bankrupt her. permalink parent award report block reply\ngoldkeyboardwarrior 1 points 2 days ago If I remember correctly she turned on him and made a plea deal in the Georgia case (which Trump’s pardon doesn’t cover since it’s state charges) in exchange for agreeing to testify for the prosecution. Don’t remember all of the details but I think she argued lawyer fees to fight it would bankrupt her. permalink parent award report block reply\nJohn_Calhoun 1 points 2 days ago The alternate elctors got busted? permalink award report block reply",
  "fetched_at": "2025-11-12T23:17:38.784060Z"
}