{
  "id": "1ARK9hjNoO",
  "url": "https://patriots.win/p/1ARK9hjNoO/aocs-attempts-at-using-math-to-c/c",
  "content": "919 AOC's Attempts at Using Math to Convince Senate Dems to Keep the Government Closed Too Funny NOT to Share (twitchy.com) posted 2 days ago by Eruditio 46 comments award share report block AOC's Attempts at Using Math to Convince Senate Dems to Keep the Government Closed Too Funny NOT to Share AOC's math fails in her plea to Senate Dems during government shutdown talks, hilariously shared. twitchy.com\n46 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil IlhansBrother 48 points 2 days ago It’s like when my co-worker calls in sick and NOBODY MISSES his work. It makes management think “why do we even pay this guy” permalink award report block reply BeauHD 15 points 2 days ago Well, for the federal government, it goes like this: Management? What's that? permalink parent award report block reply XxxRDTPRNxxX 9 points 2 days ago Yeah, there is no boss, only a handbook and a rigid set of stupid rules and procedures you become a master at manipulating through your career. permalink parent award report block reply IncredibleMrE1 33 points 2 days ago That picture is 50 lbs ago. permalink award report block reply TheDevilMonkey 10 points 2 days ago AObese. permalink parent award report block reply orange_popcicle 3 points 2 days ago AOC? Try A1C permalink parent award report block reply BlackPilledMAGA 6 points 2 days ago Now she's a fat donkey monkey. permalink parent award report block reply MAGAnic316 6 points 2 days ago Deep down she loved being Alex Stein’s big booty Latina. She yearns for him. permalink parent award report block reply carpetxparmesan 3 points 2 days ago He's not ginger enough to get her twat wet. Sorry, stein, should have been WHITER. Ya too black, darkie! Cry more that you weren't born with ginger genetics, Alex! permalink parent award report block reply KernalMustard 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply EgregiousPhilbin 3 points 2 days ago Your comment was removed. What was the gist? It better be bad because why is this place censoring? permalink parent award report block reply JoePlumber 20 points 2 days ago I asked Grok about the dumbest Congress Critters and it came up with: Analysis:\nAOC speaks fluently, high verbal IQ (~110-115). But quantitative reasoning near bottom-tier—repeated arithmetic/category errors on budgets, incentives, stats. Can't distinguish stocks/flows, incentives/cash. Policy arguments collapse under basic scrutiny. Emotional framing > data.\nEstimated IQ Range: 95-105 overall (verbal strong, math/reasoning ~80-85). Lowest quantitative literacy in Congress.\nVerdict: AOC is the weakest on basic math/economic logic. Hank Johnson is dumber on physics/spatial, but AOC fails harder on numbers that matter for her job. permalink award report block reply Tardigrade 5 points 2 days ago I'm willing to cut Hank a bit of slack if the rumors are true that he had hepatic encephalopathy at the time. permalink parent award report block reply Valiazaner 9 points 2 days ago I felt so bad for that Admiral having to sit through that and calmy explain to a Congressmen how an island works. permalink parent award report block reply SteveRogers42 2 points 2 days ago And not break out laughing. permalink parent award report block reply JoePlumber 3 points 2 days ago Idk if Grok factored that in. To be transparent it takes John Kennedy in the lowest-5 too which is definitely not accurate. permalink parent award report block reply SicSemperTyrannis2 -3 points 2 days ago Does hepatic encephalopathy cause islands to capsize? permalink parent award report block reply carpetxparmesan 3 points 2 days ago I mean...yeah... in your MIND. What do you think causes it? Inability to filter, neutralize and excrete toxins. It's like being drunk but it doesn't just wear off and by the time you get it, you're so sick, that's probably the least of your problems. It's not funny, but if you live with someone that has it on a regular basis, it can be kind of funny. They act drunk  because it's a similar mechanism. Often comes with brain fog too, so not only are you malfunctioning, even the usual logic functions are impaired. Both drunk and retarded. It's like a potato on a bottle of vodka. Sad, often annoying, but occasionally funny. permalink parent award report block reply CommanderOfCheese 4 points 2 days ago AOC is not speaking off the cuff or writing her own speeches. permalink parent award report block reply SicSemperTyrannis2 -2 points 2 days ago AOC is the weakest link! Hank Johnson: hold my beer Maxine Waters: hold up y'all, sheeeeit permalink parent award report block reply carpetxparmesan 1 points 2 days ago Diversity is our strength. Equal representation! permalink parent award report block reply SicSemperTyrannis2 2 points 1 day ago Dumbasses get representation, too! permalink parent award report block reply Valiazaner 17 points 2 days ago Whose math is worth, AOC or Scott Steiner? https://www.youtube.com/watch?v=8VIVGgzMWsc permalink award report block reply Crappydatum 7 points 2 days ago Ok that was funny permalink parent award report block reply that_sound 5 points 2 days ago The numbers don't lie! permalink parent award report block reply carpetxparmesan 2 points 2 days ago P'cents! permalink parent award report block reply GnuYow 2 points 2 days ago Typography version: https://www.youtube.com/watch?v=WFoC3TR5rzI permalink parent award report block reply carpetxparmesan 1 points 2 days ago Forget Khan Academy. They ain't got a chance. Steiner Math Academy is now open, all vouchers accepted. Enroll if you wan to be satisfied that your mathlete is a genetic freak and gets all the girls. Fat nerds need not apply. Only pure mental muscle. permalink parent award report block reply Rydanovich 15 points 2 days ago $177 in snap is bullshit. I've seen people rack in $800 and more. permalink award report block reply IlhanOmarsFagBrother 4 points 2 days ago That's probably per person not per household permalink parent award report block reply Rydanovich 2 points 2 days ago It is, but there's a lot of gimmicky bullshit around it all. A lot of deductions, exemptions, and additives to exploit. It's why there are so many single mothers with multiple kids on snap. permalink parent award report block reply Bogey 10 points 2 days ago \"The numbers don't lie and they spell disaster\" -AOC permalink award report block reply SavingPrivateGrace 8 points 2 days ago Stupid bitch actually thought social progressive communism would work when they allowed an invasion of illegals and put them all on our public assistance programs to help facilitate a Democrat Utopia.  All done with no regard to math. permalink award report block reply EgregiousPhilbin 2 points 2 days ago When are men going to stop simping? It's enough already with these emotional crazy ass bitches. permalink parent award report block reply Live_free_or_die_55 5 points 2 days ago Deport the donkey face ❗️ permalink award report block reply FusionBlack 4 points 2 days ago Ho math. permalink award report block reply tuaris 4 points 2 days ago The more attention we give her, the more political capital she gains.  Doesn't matter if it's positive or negative attention. permalink award report block reply Siteless_Vagrant 2 points 2 days ago This. Conservative media got Mamdami elected. Edit: getting sick of your shit, auto correct. permalink parent award report block reply ReturnOfSmarm 3 points 2 days ago https://youtu.be/_xjgI5oN8DM permalink award report block reply whybag 2 points 2 days ago Remember when Tucker displayed this AOC photo on his program, and people accused him of posting a photoshop because her eyes are so retarded? permalink award report block reply Smurfection 2 points 2 days ago At this point, I want to bring back county farms,  Before Dems like Roosevelt and Johnson got it into their heads that the Federal Government had to provide each and every citizen, counties used to do that.  They system kind of collapsed in the early 20th century though because of all the immigrants from Europe who transformed all the big cities into Democrat bastions of perfidy, corruption, mobsters and drunks. Aside from asylums, where actual mentally ill people went, not crazy criminals that brought on their psychosis by narcotics, people who were indigent could go work on a county farm.  Men and women lived separately and there were some housing for families that fell on hard times. The people there would work the farm, process the raw agricultural product and then receive some money that was put into an account for them.   They worked the farm until they had enough to go get housing or found gainful employment.  One catch though, the person had to live in the communal housing, no alcohol, meals in common, Private property that wasn't needed had to be stored or sold off.  Often county farms were run by local churches so the workers had to attend church services on Sundays and sometimes, complete a Bible study.   Also, the workers right to freely come and go was restricted.  They had to stay on the farm and there were curfews.  Most of them didn't allow gambling either.  To leave the farm, they had to show they had housing or gainful employment or a relative with housing was taking the person in. permalink award report block reply SicSemperTyrannis2 -3 points 2 days ago TIL MCFGA Make County Farms Great Again Also, updoot for using \"perfidy,\" we should use that at the nearest antifa meeting to watch their heads explode permalink parent award report block reply 5DchessWatch 2 points 2 days ago She's correct about the ACA number--the avg aca subsidy was that, in 2025 its over 600.  Dont know about snap . But it doesn't matter Because ACA is horrific corporatism, not socialism-- and the subsidy is only for the poor.  The middle class again, is the one screwed the hardest. People's premiums have gone asymptotic It's worse than having nothing at all.  Obama has nearly destroyed this country with it; and its been a gift to the healthcare systems and healthcare insurance industry at the cost of end user wealth accumulation. We should always be trying to increase wealth of the middle class working person.  Period. That's the foundational principle of america.  Leave people alone so they can work and be fruitful.  Only intervening to preserve other people's / everyone's rights. permalink award report block reply Nibba2 1 points 2 days ago What’s the math? Is she saying that is a lot of dollars to each person? Is she saying it’s too much help to quit giving people? What is her point in this post? I’ve met people on food stamps in the early 2000’s who received more than all of that combined in food stamps alone… permalink award report block reply pedeypete 1 points 2 days ago bug eyed c&nt permalink award report block reply Speedgraphic69 1 points 2 days ago Total dipshit permalink award report block reply\nIlhansBrother 48 points 2 days ago It’s like when my co-worker calls in sick and NOBODY MISSES his work. It makes management think “why do we even pay this guy” permalink award report block reply BeauHD 15 points 2 days ago Well, for the federal government, it goes like this: Management? What's that? permalink parent award report block reply XxxRDTPRNxxX 9 points 2 days ago Yeah, there is no boss, only a handbook and a rigid set of stupid rules and procedures you become a master at manipulating through your career. permalink parent award report block reply\nBeauHD 15 points 2 days ago Well, for the federal government, it goes like this: Management? What's that? permalink parent award report block reply XxxRDTPRNxxX 9 points 2 days ago Yeah, there is no boss, only a handbook and a rigid set of stupid rules and procedures you become a master at manipulating through your career. permalink parent award report block reply\nXxxRDTPRNxxX 9 points 2 days ago Yeah, there is no boss, only a handbook and a rigid set of stupid rules and procedures you become a master at manipulating through your career. permalink parent award report block reply\nIncredibleMrE1 33 points 2 days ago That picture is 50 lbs ago. permalink award report block reply TheDevilMonkey 10 points 2 days ago AObese. permalink parent award report block reply orange_popcicle 3 points 2 days ago AOC? Try A1C permalink parent award report block reply BlackPilledMAGA 6 points 2 days ago Now she's a fat donkey monkey. permalink parent award report block reply MAGAnic316 6 points 2 days ago Deep down she loved being Alex Stein’s big booty Latina. She yearns for him. permalink parent award report block reply carpetxparmesan 3 points 2 days ago He's not ginger enough to get her twat wet. Sorry, stein, should have been WHITER. Ya too black, darkie! Cry more that you weren't born with ginger genetics, Alex! permalink parent award report block reply KernalMustard 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply EgregiousPhilbin 3 points 2 days ago Your comment was removed. What was the gist? It better be bad because why is this place censoring? permalink parent award report block reply\nTheDevilMonkey 10 points 2 days ago AObese. permalink parent award report block reply orange_popcicle 3 points 2 days ago AOC? Try A1C permalink parent award report block reply\norange_popcicle 3 points 2 days ago AOC? Try A1C permalink parent award report block reply\nBlackPilledMAGA 6 points 2 days ago Now she's a fat donkey monkey. permalink parent award report block reply\nMAGAnic316 6 points 2 days ago Deep down she loved being Alex Stein’s big booty Latina. She yearns for him. permalink parent award report block reply carpetxparmesan 3 points 2 days ago He's not ginger enough to get her twat wet. Sorry, stein, should have been WHITER. Ya too black, darkie! Cry more that you weren't born with ginger genetics, Alex! permalink parent award report block reply\ncarpetxparmesan 3 points 2 days ago He's not ginger enough to get her twat wet. Sorry, stein, should have been WHITER. Ya too black, darkie! Cry more that you weren't born with ginger genetics, Alex! permalink parent award report block reply\nKernalMustard 1 points 2 days ago Comment removed by community moderators. permalink parent award report block reply EgregiousPhilbin 3 points 2 days ago Your comment was removed. What was the gist? It better be bad because why is this place censoring? permalink parent award report block reply\nEgregiousPhilbin 3 points 2 days ago Your comment was removed. What was the gist? It better be bad because why is this place censoring? permalink parent award report block reply\nJoePlumber 20 points 2 days ago I asked Grok about the dumbest Congress Critters and it came up with: Analysis:\nAOC speaks fluently, high verbal IQ (~110-115). But quantitative reasoning near bottom-tier—repeated arithmetic/category errors on budgets, incentives, stats. Can't distinguish stocks/flows, incentives/cash. Policy arguments collapse under basic scrutiny. Emotional framing > data.\nEstimated IQ Range: 95-105 overall (verbal strong, math/reasoning ~80-85). Lowest quantitative literacy in Congress.\nVerdict: AOC is the weakest on basic math/economic logic. Hank Johnson is dumber on physics/spatial, but AOC fails harder on numbers that matter for her job. permalink award report block reply Tardigrade 5 points 2 days ago I'm willing to cut Hank a bit of slack if the rumors are true that he had hepatic encephalopathy at the time. permalink parent award report block reply Valiazaner 9 points 2 days ago I felt so bad for that Admiral having to sit through that and calmy explain to a Congressmen how an island works. permalink parent award report block reply SteveRogers42 2 points 2 days ago And not break out laughing. permalink parent award report block reply JoePlumber 3 points 2 days ago Idk if Grok factored that in. To be transparent it takes John Kennedy in the lowest-5 too which is definitely not accurate. permalink parent award report block reply SicSemperTyrannis2 -3 points 2 days ago Does hepatic encephalopathy cause islands to capsize? permalink parent award report block reply carpetxparmesan 3 points 2 days ago I mean...yeah... in your MIND. What do you think causes it? Inability to filter, neutralize and excrete toxins. It's like being drunk but it doesn't just wear off and by the time you get it, you're so sick, that's probably the least of your problems. It's not funny, but if you live with someone that has it on a regular basis, it can be kind of funny. They act drunk  because it's a similar mechanism. Often comes with brain fog too, so not only are you malfunctioning, even the usual logic functions are impaired. Both drunk and retarded. It's like a potato on a bottle of vodka. Sad, often annoying, but occasionally funny. permalink parent award report block reply CommanderOfCheese 4 points 2 days ago AOC is not speaking off the cuff or writing her own speeches. permalink parent award report block reply SicSemperTyrannis2 -2 points 2 days ago AOC is the weakest link! Hank Johnson: hold my beer Maxine Waters: hold up y'all, sheeeeit permalink parent award report block reply carpetxparmesan 1 points 2 days ago Diversity is our strength. Equal representation! permalink parent award report block reply SicSemperTyrannis2 2 points 1 day ago Dumbasses get representation, too! permalink parent award report block reply\nTardigrade 5 points 2 days ago I'm willing to cut Hank a bit of slack if the rumors are true that he had hepatic encephalopathy at the time. permalink parent award report block reply Valiazaner 9 points 2 days ago I felt so bad for that Admiral having to sit through that and calmy explain to a Congressmen how an island works. permalink parent award report block reply SteveRogers42 2 points 2 days ago And not break out laughing. permalink parent award report block reply JoePlumber 3 points 2 days ago Idk if Grok factored that in. To be transparent it takes John Kennedy in the lowest-5 too which is definitely not accurate. permalink parent award report block reply SicSemperTyrannis2 -3 points 2 days ago Does hepatic encephalopathy cause islands to capsize? permalink parent award report block reply carpetxparmesan 3 points 2 days ago I mean...yeah... in your MIND. What do you think causes it? Inability to filter, neutralize and excrete toxins. It's like being drunk but it doesn't just wear off and by the time you get it, you're so sick, that's probably the least of your problems. It's not funny, but if you live with someone that has it on a regular basis, it can be kind of funny. They act drunk  because it's a similar mechanism. Often comes with brain fog too, so not only are you malfunctioning, even the usual logic functions are impaired. Both drunk and retarded. It's like a potato on a bottle of vodka. Sad, often annoying, but occasionally funny. permalink parent award report block reply\nValiazaner 9 points 2 days ago I felt so bad for that Admiral having to sit through that and calmy explain to a Congressmen how an island works. permalink parent award report block reply SteveRogers42 2 points 2 days ago And not break out laughing. permalink parent award report block reply\nSteveRogers42 2 points 2 days ago And not break out laughing. permalink parent award report block reply\nJoePlumber 3 points 2 days ago Idk if Grok factored that in. To be transparent it takes John Kennedy in the lowest-5 too which is definitely not accurate. permalink parent award report block reply\nSicSemperTyrannis2 -3 points 2 days ago Does hepatic encephalopathy cause islands to capsize? permalink parent award report block reply carpetxparmesan 3 points 2 days ago I mean...yeah... in your MIND. What do you think causes it? Inability to filter, neutralize and excrete toxins. It's like being drunk but it doesn't just wear off and by the time you get it, you're so sick, that's probably the least of your problems. It's not funny, but if you live with someone that has it on a regular basis, it can be kind of funny. They act drunk  because it's a similar mechanism. Often comes with brain fog too, so not only are you malfunctioning, even the usual logic functions are impaired. Both drunk and retarded. It's like a potato on a bottle of vodka. Sad, often annoying, but occasionally funny. permalink parent award report block reply\ncarpetxparmesan 3 points 2 days ago I mean...yeah... in your MIND. What do you think causes it? Inability to filter, neutralize and excrete toxins. It's like being drunk but it doesn't just wear off and by the time you get it, you're so sick, that's probably the least of your problems. It's not funny, but if you live with someone that has it on a regular basis, it can be kind of funny. They act drunk  because it's a similar mechanism. Often comes with brain fog too, so not only are you malfunctioning, even the usual logic functions are impaired. Both drunk and retarded. It's like a potato on a bottle of vodka. Sad, often annoying, but occasionally funny. permalink parent award report block reply\nCommanderOfCheese 4 points 2 days ago AOC is not speaking off the cuff or writing her own speeches. permalink parent award report block reply\nSicSemperTyrannis2 -2 points 2 days ago AOC is the weakest link! Hank Johnson: hold my beer Maxine Waters: hold up y'all, sheeeeit permalink parent award report block reply carpetxparmesan 1 points 2 days ago Diversity is our strength. Equal representation! permalink parent award report block reply SicSemperTyrannis2 2 points 1 day ago Dumbasses get representation, too! permalink parent award report block reply\ncarpetxparmesan 1 points 2 days ago Diversity is our strength. Equal representation! permalink parent award report block reply SicSemperTyrannis2 2 points 1 day ago Dumbasses get representation, too! permalink parent award report block reply\nSicSemperTyrannis2 2 points 1 day ago Dumbasses get representation, too! permalink parent award report block reply\nValiazaner 17 points 2 days ago Whose math is worth, AOC or Scott Steiner? https://www.youtube.com/watch?v=8VIVGgzMWsc permalink award report block reply Crappydatum 7 points 2 days ago Ok that was funny permalink parent award report block reply that_sound 5 points 2 days ago The numbers don't lie! permalink parent award report block reply carpetxparmesan 2 points 2 days ago P'cents! permalink parent award report block reply GnuYow 2 points 2 days ago Typography version: https://www.youtube.com/watch?v=WFoC3TR5rzI permalink parent award report block reply carpetxparmesan 1 points 2 days ago Forget Khan Academy. They ain't got a chance. Steiner Math Academy is now open, all vouchers accepted. Enroll if you wan to be satisfied that your mathlete is a genetic freak and gets all the girls. Fat nerds need not apply. Only pure mental muscle. permalink parent award report block reply\nCrappydatum 7 points 2 days ago Ok that was funny permalink parent award report block reply\nthat_sound 5 points 2 days ago The numbers don't lie! permalink parent award report block reply carpetxparmesan 2 points 2 days ago P'cents! permalink parent award report block reply\ncarpetxparmesan 2 points 2 days ago P'cents! permalink parent award report block reply\nGnuYow 2 points 2 days ago Typography version: https://www.youtube.com/watch?v=WFoC3TR5rzI permalink parent award report block reply carpetxparmesan 1 points 2 days ago Forget Khan Academy. They ain't got a chance. Steiner Math Academy is now open, all vouchers accepted. Enroll if you wan to be satisfied that your mathlete is a genetic freak and gets all the girls. Fat nerds need not apply. Only pure mental muscle. permalink parent award report block reply\ncarpetxparmesan 1 points 2 days ago Forget Khan Academy. They ain't got a chance. Steiner Math Academy is now open, all vouchers accepted. Enroll if you wan to be satisfied that your mathlete is a genetic freak and gets all the girls. Fat nerds need not apply. Only pure mental muscle. permalink parent award report block reply\nRydanovich 15 points 2 days ago $177 in snap is bullshit. I've seen people rack in $800 and more. permalink award report block reply IlhanOmarsFagBrother 4 points 2 days ago That's probably per person not per household permalink parent award report block reply Rydanovich 2 points 2 days ago It is, but there's a lot of gimmicky bullshit around it all. A lot of deductions, exemptions, and additives to exploit. It's why there are so many single mothers with multiple kids on snap. permalink parent award report block reply\nIlhanOmarsFagBrother 4 points 2 days ago That's probably per person not per household permalink parent award report block reply Rydanovich 2 points 2 days ago It is, but there's a lot of gimmicky bullshit around it all. A lot of deductions, exemptions, and additives to exploit. It's why there are so many single mothers with multiple kids on snap. permalink parent award report block reply\nRydanovich 2 points 2 days ago It is, but there's a lot of gimmicky bullshit around it all. A lot of deductions, exemptions, and additives to exploit. It's why there are so many single mothers with multiple kids on snap. permalink parent award report block reply\nBogey 10 points 2 days ago \"The numbers don't lie and they spell disaster\" -AOC permalink award report block reply\nSavingPrivateGrace 8 points 2 days ago Stupid bitch actually thought social progressive communism would work when they allowed an invasion of illegals and put them all on our public assistance programs to help facilitate a Democrat Utopia.  All done with no regard to math. permalink award report block reply EgregiousPhilbin 2 points 2 days ago When are men going to stop simping? It's enough already with these emotional crazy ass bitches. permalink parent award report block reply\nEgregiousPhilbin 2 points 2 days ago When are men going to stop simping? It's enough already with these emotional crazy ass bitches. permalink parent award report block reply\nLive_free_or_die_55 5 points 2 days ago Deport the donkey face ❗️ permalink award report block reply\nFusionBlack 4 points 2 days ago Ho math. permalink award report block reply\ntuaris 4 points 2 days ago The more attention we give her, the more political capital she gains.  Doesn't matter if it's positive or negative attention. permalink award report block reply Siteless_Vagrant 2 points 2 days ago This. Conservative media got Mamdami elected. Edit: getting sick of your shit, auto correct. permalink parent award report block reply\nSiteless_Vagrant 2 points 2 days ago This. Conservative media got Mamdami elected. Edit: getting sick of your shit, auto correct. permalink parent award report block reply\nReturnOfSmarm 3 points 2 days ago https://youtu.be/_xjgI5oN8DM permalink award report block reply\nwhybag 2 points 2 days ago Remember when Tucker displayed this AOC photo on his program, and people accused him of posting a photoshop because her eyes are so retarded? permalink award report block reply\nSmurfection 2 points 2 days ago At this point, I want to bring back county farms,  Before Dems like Roosevelt and Johnson got it into their heads that the Federal Government had to provide each and every citizen, counties used to do that.  They system kind of collapsed in the early 20th century though because of all the immigrants from Europe who transformed all the big cities into Democrat bastions of perfidy, corruption, mobsters and drunks. Aside from asylums, where actual mentally ill people went, not crazy criminals that brought on their psychosis by narcotics, people who were indigent could go work on a county farm.  Men and women lived separately and there were some housing for families that fell on hard times. The people there would work the farm, process the raw agricultural product and then receive some money that was put into an account for them.   They worked the farm until they had enough to go get housing or found gainful employment.  One catch though, the person had to live in the communal housing, no alcohol, meals in common, Private property that wasn't needed had to be stored or sold off.  Often county farms were run by local churches so the workers had to attend church services on Sundays and sometimes, complete a Bible study.   Also, the workers right to freely come and go was restricted.  They had to stay on the farm and there were curfews.  Most of them didn't allow gambling either.  To leave the farm, they had to show they had housing or gainful employment or a relative with housing was taking the person in. permalink award report block reply SicSemperTyrannis2 -3 points 2 days ago TIL MCFGA Make County Farms Great Again Also, updoot for using \"perfidy,\" we should use that at the nearest antifa meeting to watch their heads explode permalink parent award report block reply\nSicSemperTyrannis2 -3 points 2 days ago TIL MCFGA Make County Farms Great Again Also, updoot for using \"perfidy,\" we should use that at the nearest antifa meeting to watch their heads explode permalink parent award report block reply\n5DchessWatch 2 points 2 days ago She's correct about the ACA number--the avg aca subsidy was that, in 2025 its over 600.  Dont know about snap . But it doesn't matter Because ACA is horrific corporatism, not socialism-- and the subsidy is only for the poor.  The middle class again, is the one screwed the hardest. People's premiums have gone asymptotic It's worse than having nothing at all.  Obama has nearly destroyed this country with it; and its been a gift to the healthcare systems and healthcare insurance industry at the cost of end user wealth accumulation. We should always be trying to increase wealth of the middle class working person.  Period. That's the foundational principle of america.  Leave people alone so they can work and be fruitful.  Only intervening to preserve other people's / everyone's rights. permalink award report block reply\nNibba2 1 points 2 days ago What’s the math? Is she saying that is a lot of dollars to each person? Is she saying it’s too much help to quit giving people? What is her point in this post? I’ve met people on food stamps in the early 2000’s who received more than all of that combined in food stamps alone… permalink award report block reply\npedeypete 1 points 2 days ago bug eyed c&nt permalink award report block reply\nSpeedgraphic69 1 points 2 days ago Total dipshit permalink award report block reply",
  "fetched_at": "2025-11-12T23:06:14.600458Z"
}