{
  "id": "1ARK512lRJ",
  "url": "https://patriots.win/p/1ARK512lRJ/pray-without-ceasing/c",
  "content": "449 Pray without ceasing posted 6 days ago by Magaman4200 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save SurveilThis 9 points 6 days ago Nope. Pray, then get off your ass and do something today. Repeat tomorrow. And again. permalink award report block reply rebuildingMyself 2 points 6 days ago God only helps those who help themselves permalink parent award report block reply FattestConsequence 1 points 6 days ago Not biblical in the least permalink parent award report block reply Magaman4200 OP 1 points 6 days ago No one ever said not to do anything LOL ... 1 Thessalonians 5:17, which urges believers to maintain a continual, persistent attitude of prayer.\nThis does not require constant verbal prayer but rather a lifestyle of constant awareness of God's presence and readiness to communicate with Him throughout daily activities. permalink parent award report block reply TheLesserBambino 8 points 6 days ago Lord Jesus Christ, Son of God, have mercy on me, a sinner. permalink award report block reply Magaman4200 OP 7 points 6 days ago Christ In Garden of Gethsemane\nby Heinrich Hofmann In the Garden of Gethsemane, on the night before his crucifixion, Jesus prayed intensely amid great anguish, as described in the Gospels of Matthew, Mark, and Luke. ￼ ￼ After the Last Supper, he went there with his disciples and separated himself to pray, expressing his deep sorrow and distress over the suffering he was about to endure—the “cup” symbolizing God’s wrath and the crucifixion. ￼ ￼ His prayer, repeated multiple times, was essentially a plea to God the Father: “If it is possible, let this cup pass from me; yet not as I will, but as you will” (Matthew 26:39), demonstrating his humanity in facing the horror ahead while fully submitting to divine will. ￼ ￼ Luke’s account adds that an angel appeared to strengthen him, and his sweat became like drops of blood due to the agony (Luke 22:43-44). ￼ This moment highlights Jesus’ obedience, trust in God, and the spiritual battle against temptation to avoid the cross, ultimately leading to his permalink award report block reply ilovedjt202547 5 points 6 days ago My heart when he says could you not watch with me for an hour? Anytime I'm woken up in the middle of the night I always pray and stay with the Lord comforting Him in the garden permalink award report block reply mailinvoter 5 points 6 days ago You should pray for guidance. Don't beg for someone to do everything for you. permalink award report block reply Magaman4200 OP 1 points 6 days ago Trust the Lord, but paddle away from the rocks, fren. permalink parent award report block reply Awakened 0 points 6 days ago Poor, God. Never gets a moment of peace. Nothing more annoying than someone who never shuts up. Please try to keep it on point at least. From the heart, but on point. Ecclesiastes 5:2\nBe not rash with thy mouth, and let not thine heart be hasty to utter any thing before God: for God is in heaven, and thou upon earth: therefore let thy words be few. https://youtu.be/OaIUkv-9HiE?si=SJGHiAlURUSfOxtR permalink award report block reply\nSurveilThis 9 points 6 days ago Nope. Pray, then get off your ass and do something today. Repeat tomorrow. And again. permalink award report block reply rebuildingMyself 2 points 6 days ago God only helps those who help themselves permalink parent award report block reply FattestConsequence 1 points 6 days ago Not biblical in the least permalink parent award report block reply Magaman4200 OP 1 points 6 days ago No one ever said not to do anything LOL ... 1 Thessalonians 5:17, which urges believers to maintain a continual, persistent attitude of prayer.\nThis does not require constant verbal prayer but rather a lifestyle of constant awareness of God's presence and readiness to communicate with Him throughout daily activities. permalink parent award report block reply\nrebuildingMyself 2 points 6 days ago God only helps those who help themselves permalink parent award report block reply FattestConsequence 1 points 6 days ago Not biblical in the least permalink parent award report block reply\nFattestConsequence 1 points 6 days ago Not biblical in the least permalink parent award report block reply\nMagaman4200 OP 1 points 6 days ago No one ever said not to do anything LOL ... 1 Thessalonians 5:17, which urges believers to maintain a continual, persistent attitude of prayer.\nThis does not require constant verbal prayer but rather a lifestyle of constant awareness of God's presence and readiness to communicate with Him throughout daily activities. permalink parent award report block reply\nTheLesserBambino 8 points 6 days ago Lord Jesus Christ, Son of God, have mercy on me, a sinner. permalink award report block reply\nMagaman4200 OP 7 points 6 days ago Christ In Garden of Gethsemane\nby Heinrich Hofmann In the Garden of Gethsemane, on the night before his crucifixion, Jesus prayed intensely amid great anguish, as described in the Gospels of Matthew, Mark, and Luke. ￼ ￼ After the Last Supper, he went there with his disciples and separated himself to pray, expressing his deep sorrow and distress over the suffering he was about to endure—the “cup” symbolizing God’s wrath and the crucifixion. ￼ ￼ His prayer, repeated multiple times, was essentially a plea to God the Father: “If it is possible, let this cup pass from me; yet not as I will, but as you will” (Matthew 26:39), demonstrating his humanity in facing the horror ahead while fully submitting to divine will. ￼ ￼ Luke’s account adds that an angel appeared to strengthen him, and his sweat became like drops of blood due to the agony (Luke 22:43-44). ￼ This moment highlights Jesus’ obedience, trust in God, and the spiritual battle against temptation to avoid the cross, ultimately leading to his permalink award report block reply\nilovedjt202547 5 points 6 days ago My heart when he says could you not watch with me for an hour? Anytime I'm woken up in the middle of the night I always pray and stay with the Lord comforting Him in the garden permalink award report block reply\nmailinvoter 5 points 6 days ago You should pray for guidance. Don't beg for someone to do everything for you. permalink award report block reply Magaman4200 OP 1 points 6 days ago Trust the Lord, but paddle away from the rocks, fren. permalink parent award report block reply\nMagaman4200 OP 1 points 6 days ago Trust the Lord, but paddle away from the rocks, fren. permalink parent award report block reply\nAwakened 0 points 6 days ago Poor, God. Never gets a moment of peace. Nothing more annoying than someone who never shuts up. Please try to keep it on point at least. From the heart, but on point. Ecclesiastes 5:2\nBe not rash with thy mouth, and let not thine heart be hasty to utter any thing before God: for God is in heaven, and thou upon earth: therefore let thy words be few. https://youtu.be/OaIUkv-9HiE?si=SJGHiAlURUSfOxtR permalink award report block reply",
  "fetched_at": "2025-11-12T20:47:19.415860Z"
}