{
  "id": "1ARK0UcRhp",
  "url": "https://patriots.win/p/1ARK0UcRhp/the-only-way-to-save-america-is-/c",
  "content": "490 The only way to save America is by having a total muslim ban. posted 7 days ago by Capoditutticapi1 44 comments award share report block Valentina Gomez @ValentinaForUSA • 7d The only way to save America is by having a total muslim ban. I will ban burqas, public prayer, halal food & sharia cities only if you help me get to Congress. New York = muslim Michigan = muslim Minnesota = muslim You’re not being tolerant, you’re being conquered.\n44 comments Sort by Top Top New Worst Old Save josiborg 16 points 7 days ago Joos own all Hollywood, media, etc. They're like 20% or something more billionaires in America and 0.1% are military. They make up half of Congress, half of wall Street. Ban them too. Ban all dual citizenship. Still don't trust her. Too manufactured (?). permalink award report block reply FBIAREFAGGOTS 10 points 7 days ago Make America American Again permalink parent award report block reply Scumbag-reddit 2 points 6 days ago Jews also own/fund the radical islam permalink parent award report block reply PoohBearBalloon 12 points 7 days ago She's hot but if you scroll down her X account there's tons of pro Israel propaganda....hard pass. permalink award report block reply Capoditutticapi1 OP 5 points 7 days ago Dammit! permalink parent award report block reply Filo76 10 points 7 days ago Born in Columbia and she's more patriotic than most Americans. permalink award report block reply Captntrouble 8 points 7 days ago Separation of church and state: a definition permalink award report block reply perma-maga 15 points 7 days ago Islam is not a religion. It's founder taught \"kill the apostate and the unbeliever\" - that's cult, not religion. permalink parent award report block reply Capoditutticapi1 OP 6 points 7 days ago True... Establishment Clause and Free Exercise Clause... I still like her attitude, and hope she learns to channel her fierce love of country in accordance to the Constitution. permalink parent award report block reply Hikedelics 4 points 7 days ago Exactly. Separate the church of Islam as far as possible from our nation state. permalink parent award report block reply Maskurbator 0 points 7 days ago That's so misunderstood...\nIt means the Tate can dictate to the church. Not that religion can't play a role on politics. permalink parent award report block reply FerkenBlerkin 6 points 7 days ago She's not wrong about Islam, but that AIPAC money severely limits who she's allowed to question or criticize. She use to criticize pretty much everyone until she got that hush money permalink award report block reply SanityGumby 4 points 6 days ago No, repealing the 19th is what’s required permalink award report block reply RedPillosopher1776 4 points 7 days ago The only way to save America is to return it to the White Christian nation it was always supposed to be. Multi-racial societies will always be divided. Multi-cultural societies will always be divided. A nation is a people with a shared identity and culture, you cannot have a a shared identity or a shared culture when everyone is of a different tace and background. permalink award report block reply DEPORT50M 3 points 7 days ago She needs deporting too permalink award report block reply MocksFordComma 2 points 7 days ago Jesus Christ she is so hot. permalink award report block reply Capoditutticapi1 OP 6 points 7 days ago Badass and loves Jesus hot! permalink parent award report block reply Th3Cho0sing0ne 5 points 7 days ago I'm sure he'd agree.  I do, as well. permalink parent award report block reply Fistfullofgreyhair 3 points 7 days ago So she’s our AOA…much better than AOC? permalink parent award report block reply Zskills 3 points 7 days ago Wait until she hits the wall and stops shaving her unibrow permalink parent award report block reply MocksFordComma 1 points 7 days ago Yeah well today ain't that day, is it? permalink parent award report block reply South_Florida_Guy 2 points 7 days ago Unbelievably so permalink parent award report block reply RaymondBPanelli 2 points 6 days ago Gotta be careful, laws made against Islam can be turned on Christianity. How about we mandate bacon consumption for American citizenship and kill two birds with one stone? permalink award report block reply DJT4MoreYears 1 points 6 days ago This country was founded on Christianity, NOT Islam. Besides, Christianity is already under attack. We need to save it. permalink parent award report block reply thelastlast 2 points 7 days ago this bitch is an influencer but I do support this platform. permalink award report block reply Spiritof2015 2 points 7 days ago Islam is a terrorist organization. permalink award report block reply Purple_Drank 2 points 7 days ago Tolerance is NOT a Christian virtue. permalink award report block reply Tacoboutit 2 points 6 days ago Remember when you kept your sex life within your home and nobody complained. Well, that's what needs to happen with this Sharia shit. If they want it.....keep it out of sight. Don't subject the rest of us to your bullshit. permalink award report block reply Capoditutticapi1 OP 1 points 7 days ago Just gonna leave this here... https://x.com/ImMeme0/status/1986265681437094340 permalink award report block reply BillGall2 1 points 6 days ago Is she a US citizen?  Just asking for a friend. permalink award report block reply dtrap 1 points 6 days ago I wonder if she feels like that towards the other religion... permalink award report block reply South_Florida_Guy 1 points 7 days ago This lady is the spirit animal of all of my politics in a smoking hot package, jeez permalink award report block reply maleitch 0 points 7 days ago https://www.jfrej.org/news/2025/06/jews4zohran permalink award report block reply BidenShowerDrool 2 points 7 days ago right up there with the activist group Chickens for KFC. 🤣 permalink parent award report block reply Darkpoisonousshaddow -1 points 7 days ago It's worth noting that Islam believes jesus is a profet and will return. The Jews, not so much. permalink award report block reply Zskills -1 points 7 days ago Ban public prayer? How exactly would you do that ? permalink award report block reply Capoditutticapi1 OP 2 points 7 days ago Arrest them for blocking sidewalks, streets, roadways, public building entrances, etc., while rug praying en masse... If the praying impedes or interferes with others rights in public then it's disorderly conduct... Banning public prayer that isn't interfering with others public rights isn't doable... permalink parent award report block reply Zskills 1 points 7 days ago You don't need to pass any new laws to make that happen though.   So what exactly is being banned,  all those things are already banned permalink parent award report block reply Capoditutticapi1 OP 2 points 7 days ago You asked specifically about banning public prayer, I gave you an answer to what I believe is in accordance with the law. The other \"things\" Valentina wants to ban would be more appropriate for her to address as it's her platform. I will agree that burqas could be banned in private establishments including banking institutions, jewelry stores, restaurants, and, public institutions with dress codes such as schools, hospitals, nuclear facilities, etc... Reasons..., many, but two would be top of the list. 1) Concealment of identity and weapons for nefarious purposes. 2) Inspiration for non-muslims to conceal identity and weapons for nefarious purposes. The U.S. Constitution's Supremacy Clause ensures that federal and state laws take precedence over any foreign or religious legal codes, including Sharia (Islamic law), in civil or criminal matters. Valentina may be suggesting \"banning\" Sharia at the state level across the US. Currently only Alabama, Arizona, Kansas, Louisiana, North Carolina, Tennessee, Texas, explicitly reference foreign or religious law bans including Sharia. Her generalizations need to be refined if she wants to be a serious candidate... She's got spunk... Needs to mature politically... She's running as a Republican for U.S. House seat in Texas's 31st Congressional District permalink parent award report block reply Zskills 2 points 6 days ago That was all well reasoned and I hope she wins her election permalink parent award report block reply BidenShowerDrool 2 points 7 days ago Didn't Biden's FBI and local blackshirts arrest people for praying outside abortion clinics? permalink parent award report block reply Zskills 2 points 7 days ago No.  It was an egregious miscarriage of justice but that is an oversimplification. The FACE act should be repealed though. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\njosiborg 16 points 7 days ago Joos own all Hollywood, media, etc. They're like 20% or something more billionaires in America and 0.1% are military. They make up half of Congress, half of wall Street. Ban them too. Ban all dual citizenship. Still don't trust her. Too manufactured (?). permalink award report block reply FBIAREFAGGOTS 10 points 7 days ago Make America American Again permalink parent award report block reply Scumbag-reddit 2 points 6 days ago Jews also own/fund the radical islam permalink parent award report block reply\nFBIAREFAGGOTS 10 points 7 days ago Make America American Again permalink parent award report block reply\nScumbag-reddit 2 points 6 days ago Jews also own/fund the radical islam permalink parent award report block reply\nPoohBearBalloon 12 points 7 days ago She's hot but if you scroll down her X account there's tons of pro Israel propaganda....hard pass. permalink award report block reply Capoditutticapi1 OP 5 points 7 days ago Dammit! permalink parent award report block reply\nCapoditutticapi1 OP 5 points 7 days ago Dammit! permalink parent award report block reply\nFilo76 10 points 7 days ago Born in Columbia and she's more patriotic than most Americans. permalink award report block reply\nCaptntrouble 8 points 7 days ago Separation of church and state: a definition permalink award report block reply perma-maga 15 points 7 days ago Islam is not a religion. It's founder taught \"kill the apostate and the unbeliever\" - that's cult, not religion. permalink parent award report block reply Capoditutticapi1 OP 6 points 7 days ago True... Establishment Clause and Free Exercise Clause... I still like her attitude, and hope she learns to channel her fierce love of country in accordance to the Constitution. permalink parent award report block reply Hikedelics 4 points 7 days ago Exactly. Separate the church of Islam as far as possible from our nation state. permalink parent award report block reply Maskurbator 0 points 7 days ago That's so misunderstood...\nIt means the Tate can dictate to the church. Not that religion can't play a role on politics. permalink parent award report block reply\nperma-maga 15 points 7 days ago Islam is not a religion. It's founder taught \"kill the apostate and the unbeliever\" - that's cult, not religion. permalink parent award report block reply\nCapoditutticapi1 OP 6 points 7 days ago True... Establishment Clause and Free Exercise Clause... I still like her attitude, and hope she learns to channel her fierce love of country in accordance to the Constitution. permalink parent award report block reply\nHikedelics 4 points 7 days ago Exactly. Separate the church of Islam as far as possible from our nation state. permalink parent award report block reply\nMaskurbator 0 points 7 days ago That's so misunderstood...\nIt means the Tate can dictate to the church. Not that religion can't play a role on politics. permalink parent award report block reply\nFerkenBlerkin 6 points 7 days ago She's not wrong about Islam, but that AIPAC money severely limits who she's allowed to question or criticize. She use to criticize pretty much everyone until she got that hush money permalink award report block reply\nSanityGumby 4 points 6 days ago No, repealing the 19th is what’s required permalink award report block reply\nRedPillosopher1776 4 points 7 days ago The only way to save America is to return it to the White Christian nation it was always supposed to be. Multi-racial societies will always be divided. Multi-cultural societies will always be divided. A nation is a people with a shared identity and culture, you cannot have a a shared identity or a shared culture when everyone is of a different tace and background. permalink award report block reply\nDEPORT50M 3 points 7 days ago She needs deporting too permalink award report block reply\nMocksFordComma 2 points 7 days ago Jesus Christ she is so hot. permalink award report block reply Capoditutticapi1 OP 6 points 7 days ago Badass and loves Jesus hot! permalink parent award report block reply Th3Cho0sing0ne 5 points 7 days ago I'm sure he'd agree.  I do, as well. permalink parent award report block reply Fistfullofgreyhair 3 points 7 days ago So she’s our AOA…much better than AOC? permalink parent award report block reply Zskills 3 points 7 days ago Wait until she hits the wall and stops shaving her unibrow permalink parent award report block reply MocksFordComma 1 points 7 days ago Yeah well today ain't that day, is it? permalink parent award report block reply South_Florida_Guy 2 points 7 days ago Unbelievably so permalink parent award report block reply\nCapoditutticapi1 OP 6 points 7 days ago Badass and loves Jesus hot! permalink parent award report block reply\nTh3Cho0sing0ne 5 points 7 days ago I'm sure he'd agree.  I do, as well. permalink parent award report block reply\nFistfullofgreyhair 3 points 7 days ago So she’s our AOA…much better than AOC? permalink parent award report block reply\nZskills 3 points 7 days ago Wait until she hits the wall and stops shaving her unibrow permalink parent award report block reply MocksFordComma 1 points 7 days ago Yeah well today ain't that day, is it? permalink parent award report block reply\nMocksFordComma 1 points 7 days ago Yeah well today ain't that day, is it? permalink parent award report block reply\nSouth_Florida_Guy 2 points 7 days ago Unbelievably so permalink parent award report block reply\nRaymondBPanelli 2 points 6 days ago Gotta be careful, laws made against Islam can be turned on Christianity. How about we mandate bacon consumption for American citizenship and kill two birds with one stone? permalink award report block reply DJT4MoreYears 1 points 6 days ago This country was founded on Christianity, NOT Islam. Besides, Christianity is already under attack. We need to save it. permalink parent award report block reply\nDJT4MoreYears 1 points 6 days ago This country was founded on Christianity, NOT Islam. Besides, Christianity is already under attack. We need to save it. permalink parent award report block reply\nthelastlast 2 points 7 days ago this bitch is an influencer but I do support this platform. permalink award report block reply\nSpiritof2015 2 points 7 days ago Islam is a terrorist organization. permalink award report block reply\nPurple_Drank 2 points 7 days ago Tolerance is NOT a Christian virtue. permalink award report block reply\nTacoboutit 2 points 6 days ago Remember when you kept your sex life within your home and nobody complained. Well, that's what needs to happen with this Sharia shit. If they want it.....keep it out of sight. Don't subject the rest of us to your bullshit. permalink award report block reply\nCapoditutticapi1 OP 1 points 7 days ago Just gonna leave this here... https://x.com/ImMeme0/status/1986265681437094340 permalink award report block reply\nBillGall2 1 points 6 days ago Is she a US citizen?  Just asking for a friend. permalink award report block reply\ndtrap 1 points 6 days ago I wonder if she feels like that towards the other religion... permalink award report block reply\nSouth_Florida_Guy 1 points 7 days ago This lady is the spirit animal of all of my politics in a smoking hot package, jeez permalink award report block reply\nmaleitch 0 points 7 days ago https://www.jfrej.org/news/2025/06/jews4zohran permalink award report block reply BidenShowerDrool 2 points 7 days ago right up there with the activist group Chickens for KFC. 🤣 permalink parent award report block reply\nBidenShowerDrool 2 points 7 days ago right up there with the activist group Chickens for KFC. 🤣 permalink parent award report block reply\nDarkpoisonousshaddow -1 points 7 days ago It's worth noting that Islam believes jesus is a profet and will return. The Jews, not so much. permalink award report block reply\nZskills -1 points 7 days ago Ban public prayer? How exactly would you do that ? permalink award report block reply Capoditutticapi1 OP 2 points 7 days ago Arrest them for blocking sidewalks, streets, roadways, public building entrances, etc., while rug praying en masse... If the praying impedes or interferes with others rights in public then it's disorderly conduct... Banning public prayer that isn't interfering with others public rights isn't doable... permalink parent award report block reply Zskills 1 points 7 days ago You don't need to pass any new laws to make that happen though.   So what exactly is being banned,  all those things are already banned permalink parent award report block reply Capoditutticapi1 OP 2 points 7 days ago You asked specifically about banning public prayer, I gave you an answer to what I believe is in accordance with the law. The other \"things\" Valentina wants to ban would be more appropriate for her to address as it's her platform. I will agree that burqas could be banned in private establishments including banking institutions, jewelry stores, restaurants, and, public institutions with dress codes such as schools, hospitals, nuclear facilities, etc... Reasons..., many, but two would be top of the list. 1) Concealment of identity and weapons for nefarious purposes. 2) Inspiration for non-muslims to conceal identity and weapons for nefarious purposes. The U.S. Constitution's Supremacy Clause ensures that federal and state laws take precedence over any foreign or religious legal codes, including Sharia (Islamic law), in civil or criminal matters. Valentina may be suggesting \"banning\" Sharia at the state level across the US. Currently only Alabama, Arizona, Kansas, Louisiana, North Carolina, Tennessee, Texas, explicitly reference foreign or religious law bans including Sharia. Her generalizations need to be refined if she wants to be a serious candidate... She's got spunk... Needs to mature politically... She's running as a Republican for U.S. House seat in Texas's 31st Congressional District permalink parent award report block reply Zskills 2 points 6 days ago That was all well reasoned and I hope she wins her election permalink parent award report block reply BidenShowerDrool 2 points 7 days ago Didn't Biden's FBI and local blackshirts arrest people for praying outside abortion clinics? permalink parent award report block reply Zskills 2 points 7 days ago No.  It was an egregious miscarriage of justice but that is an oversimplification. The FACE act should be repealed though. permalink parent award report block reply\nCapoditutticapi1 OP 2 points 7 days ago Arrest them for blocking sidewalks, streets, roadways, public building entrances, etc., while rug praying en masse... If the praying impedes or interferes with others rights in public then it's disorderly conduct... Banning public prayer that isn't interfering with others public rights isn't doable... permalink parent award report block reply Zskills 1 points 7 days ago You don't need to pass any new laws to make that happen though.   So what exactly is being banned,  all those things are already banned permalink parent award report block reply Capoditutticapi1 OP 2 points 7 days ago You asked specifically about banning public prayer, I gave you an answer to what I believe is in accordance with the law. The other \"things\" Valentina wants to ban would be more appropriate for her to address as it's her platform. I will agree that burqas could be banned in private establishments including banking institutions, jewelry stores, restaurants, and, public institutions with dress codes such as schools, hospitals, nuclear facilities, etc... Reasons..., many, but two would be top of the list. 1) Concealment of identity and weapons for nefarious purposes. 2) Inspiration for non-muslims to conceal identity and weapons for nefarious purposes. The U.S. Constitution's Supremacy Clause ensures that federal and state laws take precedence over any foreign or religious legal codes, including Sharia (Islamic law), in civil or criminal matters. Valentina may be suggesting \"banning\" Sharia at the state level across the US. Currently only Alabama, Arizona, Kansas, Louisiana, North Carolina, Tennessee, Texas, explicitly reference foreign or religious law bans including Sharia. Her generalizations need to be refined if she wants to be a serious candidate... She's got spunk... Needs to mature politically... She's running as a Republican for U.S. House seat in Texas's 31st Congressional District permalink parent award report block reply Zskills 2 points 6 days ago That was all well reasoned and I hope she wins her election permalink parent award report block reply\nZskills 1 points 7 days ago You don't need to pass any new laws to make that happen though.   So what exactly is being banned,  all those things are already banned permalink parent award report block reply Capoditutticapi1 OP 2 points 7 days ago You asked specifically about banning public prayer, I gave you an answer to what I believe is in accordance with the law. The other \"things\" Valentina wants to ban would be more appropriate for her to address as it's her platform. I will agree that burqas could be banned in private establishments including banking institutions, jewelry stores, restaurants, and, public institutions with dress codes such as schools, hospitals, nuclear facilities, etc... Reasons..., many, but two would be top of the list. 1) Concealment of identity and weapons for nefarious purposes. 2) Inspiration for non-muslims to conceal identity and weapons for nefarious purposes. The U.S. Constitution's Supremacy Clause ensures that federal and state laws take precedence over any foreign or religious legal codes, including Sharia (Islamic law), in civil or criminal matters. Valentina may be suggesting \"banning\" Sharia at the state level across the US. Currently only Alabama, Arizona, Kansas, Louisiana, North Carolina, Tennessee, Texas, explicitly reference foreign or religious law bans including Sharia. Her generalizations need to be refined if she wants to be a serious candidate... She's got spunk... Needs to mature politically... She's running as a Republican for U.S. House seat in Texas's 31st Congressional District permalink parent award report block reply Zskills 2 points 6 days ago That was all well reasoned and I hope she wins her election permalink parent award report block reply\nCapoditutticapi1 OP 2 points 7 days ago You asked specifically about banning public prayer, I gave you an answer to what I believe is in accordance with the law. The other \"things\" Valentina wants to ban would be more appropriate for her to address as it's her platform. I will agree that burqas could be banned in private establishments including banking institutions, jewelry stores, restaurants, and, public institutions with dress codes such as schools, hospitals, nuclear facilities, etc... Reasons..., many, but two would be top of the list. 1) Concealment of identity and weapons for nefarious purposes. 2) Inspiration for non-muslims to conceal identity and weapons for nefarious purposes. The U.S. Constitution's Supremacy Clause ensures that federal and state laws take precedence over any foreign or religious legal codes, including Sharia (Islamic law), in civil or criminal matters. Valentina may be suggesting \"banning\" Sharia at the state level across the US. Currently only Alabama, Arizona, Kansas, Louisiana, North Carolina, Tennessee, Texas, explicitly reference foreign or religious law bans including Sharia. Her generalizations need to be refined if she wants to be a serious candidate... She's got spunk... Needs to mature politically... She's running as a Republican for U.S. House seat in Texas's 31st Congressional District permalink parent award report block reply Zskills 2 points 6 days ago That was all well reasoned and I hope she wins her election permalink parent award report block reply\nZskills 2 points 6 days ago That was all well reasoned and I hope she wins her election permalink parent award report block reply\nBidenShowerDrool 2 points 7 days ago Didn't Biden's FBI and local blackshirts arrest people for praying outside abortion clinics? permalink parent award report block reply Zskills 2 points 7 days ago No.  It was an egregious miscarriage of justice but that is an oversimplification. The FACE act should be repealed though. permalink parent award report block reply\nZskills 2 points 7 days ago No.  It was an egregious miscarriage of justice but that is an oversimplification. The FACE act should be repealed though. permalink parent award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:43:57.590748Z"
}