{
  "id": "1ARK9jzLRD",
  "url": "https://patriots.win/p/1ARK9jzLRD/approval-of-the-deal-by-congress/c",
  "content": "583 Approval of the deal by Congress to end the government shutdown\n\nAll:  Approve +8%\n\nBy party \nDemocrats:  Disapprove -16\nRepublican:  Approve +45 posted 2 days ago by TrumpCare 17 comments award share report block OSZ @OpenSourceZone • 2d Approval of the deal by Congress to end the government shutdown All: 🟢 Approve +8% By party Democrats: 🔴 Disapprove -16 Republican: 🟢 Approve +45 YouGov poll | 11/10\n17 comments Sort by Top Top New Worst Old Save RustySheckelford 24 points 2 days ago Only DJT could trick Democrats into supporting a govt shutdown permalink award report block reply anotherthing 14 points 1 day ago The Democrats have tricked the GOP in to demanding Biden era levels of spending. A year ago, we were bitching about all the spending. Apparently, it's now a \"good thing\". permalink parent award report block reply MakeAmericaGreat9 10 points 1 day ago Don't we have go rehire all of the faggots we fired? permalink parent award report block reply Tokyo_Proud_Boys 4 points 1 day ago No, just to be ironic we should replace them all with H1B1 visa holders. Just them. permalink parent award report block reply Repentnow 3 points 1 day ago No one was fired. They were furloughed. Yes, they will go back to their jobs. permalink parent award report block reply ckover9000 21 points 1 day ago Fuck that keep it shut down. It's been a month and a half and the only people that even noticed are welfare leeches. permalink award report block reply bh506407 15 points 1 day ago Yeah, it’s pretty funny. Regular working stiffs have had zero impact by this shutdown. Gee, I wonder why all of us want limited government and lower taxes…? permalink parent award report block reply FireTheCannons1776 3 points 1 day ago 392M on SS benefits according to DOGE.  Math that. Edit: Eligible for SS benefits.  How big is the US pop? permalink parent award report block reply Repentnow 2 points 1 day ago False. 392M issued SSNs. permalink parent award report block reply NomadicKrow2 1 points 1 day ago YOU MIGHT BE A DEMOCRAT! j/k, I don't care. I'd liked to have seen the world continue as normal without snap for another month, though, just to make a point. permalink parent award report block reply ltbadpuppy 1 points 1 day ago Your local air traffic controllers working for free this entire time would beg to differ permalink parent award report block reply Deplorable_in_PA 9 points 1 day ago This is a rare win for the Republicans.  They stood firmly and didn't cave to the dems.  I was pleasantly surprised at their unity and steadfastness.  We need more of this! permalink award report block reply BrionK 8 points 1 day ago Imagine making a big deal about doing your job.\nFor fuck sakes I hate these lazy faggots. permalink award report block reply LiberalsAreMental 3 points 1 day ago POTUS has the power to adjourn Congress. He should have adjourned Congress for at least 6 months, yesterday. Anyone dependent on Fed.Gov needs to starve. permalink award report block reply Repentnow 2 points 1 day ago POTUS has the power to adjourn Congress. He does not. The only exception (which has never been used) is if the House and Senate disagree on a time of adjournment. Article II, Section 3 of the U.S. Constitution: \"...may, on extraordinary Occasions, convene both Houses, or either of them, and in Case of Disagreement between them, with Respect to the Time of Adjournment, he may adjourn them to such Time as he shall think proper...\" permalink parent award report block reply electricboogaloo 2 points 1 day ago The biggest takeaway from this shutdown is that EBT is a scourge on our society and should stay unfunded forever. Go to food pantry for rice and beans. None of these assholes are starving. Most are obese and will get diabetes on our dime, then will get medical care for all their weight related health issues on our dime. Meanwhile they bitch about “racial inequalities” while they leave a mess wherever they go cause they believe they are owed everything and value nothing they are given. What a fucked up system. permalink award report block reply MehNahMehNah 1 points 1 day ago MAGA: no response because it sucked either way permalink award report block reply\nRustySheckelford 24 points 2 days ago Only DJT could trick Democrats into supporting a govt shutdown permalink award report block reply anotherthing 14 points 1 day ago The Democrats have tricked the GOP in to demanding Biden era levels of spending. A year ago, we were bitching about all the spending. Apparently, it's now a \"good thing\". permalink parent award report block reply MakeAmericaGreat9 10 points 1 day ago Don't we have go rehire all of the faggots we fired? permalink parent award report block reply Tokyo_Proud_Boys 4 points 1 day ago No, just to be ironic we should replace them all with H1B1 visa holders. Just them. permalink parent award report block reply Repentnow 3 points 1 day ago No one was fired. They were furloughed. Yes, they will go back to their jobs. permalink parent award report block reply\nanotherthing 14 points 1 day ago The Democrats have tricked the GOP in to demanding Biden era levels of spending. A year ago, we were bitching about all the spending. Apparently, it's now a \"good thing\". permalink parent award report block reply\nMakeAmericaGreat9 10 points 1 day ago Don't we have go rehire all of the faggots we fired? permalink parent award report block reply Tokyo_Proud_Boys 4 points 1 day ago No, just to be ironic we should replace them all with H1B1 visa holders. Just them. permalink parent award report block reply Repentnow 3 points 1 day ago No one was fired. They were furloughed. Yes, they will go back to their jobs. permalink parent award report block reply\nTokyo_Proud_Boys 4 points 1 day ago No, just to be ironic we should replace them all with H1B1 visa holders. Just them. permalink parent award report block reply\nRepentnow 3 points 1 day ago No one was fired. They were furloughed. Yes, they will go back to their jobs. permalink parent award report block reply\nckover9000 21 points 1 day ago Fuck that keep it shut down. It's been a month and a half and the only people that even noticed are welfare leeches. permalink award report block reply bh506407 15 points 1 day ago Yeah, it’s pretty funny. Regular working stiffs have had zero impact by this shutdown. Gee, I wonder why all of us want limited government and lower taxes…? permalink parent award report block reply FireTheCannons1776 3 points 1 day ago 392M on SS benefits according to DOGE.  Math that. Edit: Eligible for SS benefits.  How big is the US pop? permalink parent award report block reply Repentnow 2 points 1 day ago False. 392M issued SSNs. permalink parent award report block reply NomadicKrow2 1 points 1 day ago YOU MIGHT BE A DEMOCRAT! j/k, I don't care. I'd liked to have seen the world continue as normal without snap for another month, though, just to make a point. permalink parent award report block reply ltbadpuppy 1 points 1 day ago Your local air traffic controllers working for free this entire time would beg to differ permalink parent award report block reply\nbh506407 15 points 1 day ago Yeah, it’s pretty funny. Regular working stiffs have had zero impact by this shutdown. Gee, I wonder why all of us want limited government and lower taxes…? permalink parent award report block reply\nFireTheCannons1776 3 points 1 day ago 392M on SS benefits according to DOGE.  Math that. Edit: Eligible for SS benefits.  How big is the US pop? permalink parent award report block reply Repentnow 2 points 1 day ago False. 392M issued SSNs. permalink parent award report block reply\nRepentnow 2 points 1 day ago False. 392M issued SSNs. permalink parent award report block reply\nNomadicKrow2 1 points 1 day ago YOU MIGHT BE A DEMOCRAT! j/k, I don't care. I'd liked to have seen the world continue as normal without snap for another month, though, just to make a point. permalink parent award report block reply\nltbadpuppy 1 points 1 day ago Your local air traffic controllers working for free this entire time would beg to differ permalink parent award report block reply\nDeplorable_in_PA 9 points 1 day ago This is a rare win for the Republicans.  They stood firmly and didn't cave to the dems.  I was pleasantly surprised at their unity and steadfastness.  We need more of this! permalink award report block reply\nBrionK 8 points 1 day ago Imagine making a big deal about doing your job.\nFor fuck sakes I hate these lazy faggots. permalink award report block reply\nLiberalsAreMental 3 points 1 day ago POTUS has the power to adjourn Congress. He should have adjourned Congress for at least 6 months, yesterday. Anyone dependent on Fed.Gov needs to starve. permalink award report block reply Repentnow 2 points 1 day ago POTUS has the power to adjourn Congress. He does not. The only exception (which has never been used) is if the House and Senate disagree on a time of adjournment. Article II, Section 3 of the U.S. Constitution: \"...may, on extraordinary Occasions, convene both Houses, or either of them, and in Case of Disagreement between them, with Respect to the Time of Adjournment, he may adjourn them to such Time as he shall think proper...\" permalink parent award report block reply\nRepentnow 2 points 1 day ago POTUS has the power to adjourn Congress. He does not. The only exception (which has never been used) is if the House and Senate disagree on a time of adjournment. Article II, Section 3 of the U.S. Constitution: \"...may, on extraordinary Occasions, convene both Houses, or either of them, and in Case of Disagreement between them, with Respect to the Time of Adjournment, he may adjourn them to such Time as he shall think proper...\" permalink parent award report block reply\nelectricboogaloo 2 points 1 day ago The biggest takeaway from this shutdown is that EBT is a scourge on our society and should stay unfunded forever. Go to food pantry for rice and beans. None of these assholes are starving. Most are obese and will get diabetes on our dime, then will get medical care for all their weight related health issues on our dime. Meanwhile they bitch about “racial inequalities” while they leave a mess wherever they go cause they believe they are owed everything and value nothing they are given. What a fucked up system. permalink award report block reply\nMehNahMehNah 1 points 1 day ago MAGA: no response because it sucked either way permalink award report block reply",
  "fetched_at": "2025-11-12T21:04:44.248963Z"
}