{
  "id": "1ARK9nNyhY",
  "url": "https://patriots.win/p/1ARK9nNyhY/trump-on-h1b-visas-we-have-to-br/c",
  "content": "17 Trump on H1-B Visas: WE HAVE TO BRING IN TALENT posted 10 hours ago by PUNCHSPLOSION 8 comments award share report block\n8 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno Wizard_Glick 6 points 9 hours ago Trump is wrong... permalink award report block reply Justjayce 3 points 9 hours ago I'm sorry.. Trump is fucking stupid as fuck if he thinks this is what we want. permalink award report block reply henri_derelicte 2 points 9 hours ago The problem is we’re not bringing in talent. The programs used to bring in talent are being used to bring in low-quality cheap foreign labor permalink award report block reply Marina 2 points 9 hours ago Laura is DeSantis First. Fox is always been Never Trumpers. Definitely need a debate. Fox is pushing to Destroy MAGA and put in that Fake DeSantis over JD Vance permalink award report block reply mty_green_go 1 points 9 hours ago NO WE DONT. FUCK YOU AND YOUR VISAS permalink award report block reply NeutronDon1 1 points 8 hours ago By talent, does he mean cheap labor? permalink award report block reply keeptherepublic1776 1 points 8 hours ago Fuck trump. Between this and off shore Americans are done permalink award report block reply Tmntnyc 1 points 8 hours ago If we want home-grown STEM talent in America, parents need to push their kids to study and test better. Due to grade inflation, this country's academic rigor has gone down the shitter. The worst culprit for grade inflation is that school funding is directly related to state test scores and graduation rates. So to secure funding, they will pass students that deserve to fail. The No Child Left Behind act is one of the causes. I kind of agree with Trump. Look at test scores nation wide, kids suck at math and science. In Asia they gruelingly study and test for higher level math and science and are extremely competitive. Average high schoolers in America now can barely read at a 5th grade level and nobody knows math beyond arithmetic anymore. Industry poachers engineers from Asia because they're disciplined and have more raw competency in math and science than Dennis from Pittsburg permalink award report block reply\nWizard_Glick 6 points 9 hours ago Trump is wrong... permalink award report block reply\nJustjayce 3 points 9 hours ago I'm sorry.. Trump is fucking stupid as fuck if he thinks this is what we want. permalink award report block reply\nhenri_derelicte 2 points 9 hours ago The problem is we’re not bringing in talent. The programs used to bring in talent are being used to bring in low-quality cheap foreign labor permalink award report block reply\nMarina 2 points 9 hours ago Laura is DeSantis First. Fox is always been Never Trumpers. Definitely need a debate. Fox is pushing to Destroy MAGA and put in that Fake DeSantis over JD Vance permalink award report block reply\nmty_green_go 1 points 9 hours ago NO WE DONT. FUCK YOU AND YOUR VISAS permalink award report block reply\nNeutronDon1 1 points 8 hours ago By talent, does he mean cheap labor? permalink award report block reply\nkeeptherepublic1776 1 points 8 hours ago Fuck trump. Between this and off shore Americans are done permalink award report block reply\nTmntnyc 1 points 8 hours ago If we want home-grown STEM talent in America, parents need to push their kids to study and test better. Due to grade inflation, this country's academic rigor has gone down the shitter. The worst culprit for grade inflation is that school funding is directly related to state test scores and graduation rates. So to secure funding, they will pass students that deserve to fail. The No Child Left Behind act is one of the causes. I kind of agree with Trump. Look at test scores nation wide, kids suck at math and science. In Asia they gruelingly study and test for higher level math and science and are extremely competitive. Average high schoolers in America now can barely read at a 5th grade level and nobody knows math beyond arithmetic anymore. Industry poachers engineers from Asia because they're disciplined and have more raw competency in math and science than Dennis from Pittsburg permalink award report block reply",
  "fetched_at": "2025-11-12T23:25:03.328342Z"
}