{
  "id": "8182655",
  "title": "1307Comer Bombshell: Dementia Joe Had ‘No Notes,’ Took No Known Meetings on Autopen Pardons(www.brei",
  "url": "https://patriots.win/p/1ARK9k0AeT/comer-bombshell-dementia-joe-had/c",
  "content": "1307 Comer Bombshell: Dementia Joe Had ‘No Notes,’ Took No Known Meetings on Autopen Pardons (www.breitbart.com) 🚨  LOCK THEM UP  🚨 posted 1 day ago by Zacktopia33 82 comments award share report block Exclusive -- Rep. Comer Bombshell: Joe Biden Had 'No Notes,' Took No Known Meetings on Autopen Pardons Monday on \"The Alex Marlow Show,\" Rep. James Comer (R-KY) discussed the Biden pardons. Comer said, \"There were no notes of Joe Biden ever sitting on in | Clips www.breitbart.com\n82 comments Sort by Top Top New Worst Old Save The Real Story Behind His Exit No One Saw Coming Read More Ads by Ad.Style Greenhills 85 points 1 day ago That’s because hunter was selling pardons at $250k a pop. permalink award report block reply Bullet3250 23 points 1 day ago yes.... permalink parent award report block reply Deportthemall23 15 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply breadbaker 8 points 1 day ago way underrated comment. permalink parent award report block reply drattastic1 10 points 1 day ago Prison is coming..... Lol, just kidding. permalink parent award report block reply NimblePepeCentipede 3 points 1 day ago .....how about a strongly worded letter? permalink parent award report block reply AVeryNakedMan 4 points 1 day ago A letter might hurt the feelings of those people who tried to destroy America. Best I can do is a tweet. permalink parent award report block reply mohel 0 points 1 day ago Trump will be gone in 3 years. They don't don't want to expose themselves to the wrath of the uniparty. permalink parent award report block reply Aquamine-Amarine 7 points 1 day ago Drugs are expensive. permalink parent award report block reply Choppermagic 3 points 1 day ago buy a shitty Hunter painting and get a pardon for free permalink parent award report block reply booblitchutz 3 points 1 day ago No way was it that cheap. It was either given to insiders free or the price tag was exorbitant. permalink parent award report block reply load 2 more comments... CatalystForChange 43 points 1 day ago As always the unanswered question that millions of Americans are asking is WTF is DOJ doing about all of these accusations? permalink award report block reply airborne3502 19 points 1 day ago Not to be overly optimistic, but President Trump hasn't let up on the autopen issue. I imagine he's pushing his DOJ hard on it. He seems happy with Bondi, even though we aren't, so maybe things are happening we aren't aware of. permalink parent award report block reply bck- 8 points 1 day ago No dude, the people on here are way more aware than Trump is!! permalink parent award report block reply goldwater4ever 4 points 1 day ago I use to think the campaign/administration had folks here lurking to see what the base was saying and how it was responding to happenings going on.. not anymore.. permalink parent award report block reply bck- 11 points 1 day ago They most likely do. The only reason you don’t feel that way anymore is because this website has been infiltrated by bots and bad actors who are quick to jump on Trump the same way leftists do permalink parent award report block reply view 1 more comments... PhoneBandit 8 points 1 day ago They are on here but only to push back against anti Trump sentiment or anti Israel sentiment. They were really active about the Epstein stuff saying Epstein was just a really bad guy who didn't traffic girls to anyone but himself. permalink parent award report block reply view 2 more comments... Klaus73 1 points 1 day ago more aware who Changpeng Zhao is I hope :-) permalink parent award report block reply trumpORbust 1 points 1 day ago I am permalink parent award report block reply Dev404 5 points 1 day ago Unfortunately, that's the same optimism we had that resulted in his reelection being stolen and to this day, nothing done about it. I'm of the opinion that Bondi and Kash aren't doing a damn thing and he's being misled that something's going to happen or Trump doesn't actually care and is using it to bait us like he did with \"Hillary 4 Prison\" that never even began when he got into office. permalink parent award report block reply airborne3502 0 points 1 day ago He cares. President Trump has everything to lose if they don't do their jobs. At her confirmation hearing, Bondi wanted to talk about what she saw in Pennsylvania, during the stolen election, so it's something on her radar. Nobody would let her. The deep state isn't going to let up on Trump, or his family, unless he wins this fight. That bullet hit his ear, not mine. Like he said, he's standing in the way between them and us. permalink parent award report block reply Klaus73 -2 points 1 day ago Trump has nothing to lose; dudes made billions in family fortune since he took office. He isn't running a 3rd term. He's pushing 80. Bondi was likely part of a deal; She likely was planted as a leash on Trump to make sure he doesn't go after the folks that actually tried to kill him. Shes an insurance policy; Trump will be permitted to live and get rich. Kash is a clown so Trump was allowed to put him there as he was a mediocre performer before he became director. Notice how anyone of significance is not being looked into? The folks that were on the Epstien list are probably the same folk undermining Trump and likely the same folks that paid to try and have him killed in Butler. After they came close he was probably told the next time will be a \"heart attack\" or something similar. permalink parent award report block reply spezisacuckold -1 points 1 day ago Trump's happy with Bondi because he probably has a thing for her permalink parent award report block reply Bullet3250 9 points 1 day ago It is very difficult to keep tabs on ALL THE CRIMES COMMITTED IN DC... by Bureaucrats. So here is the latest on the Congressional investigation into the Biden Autopen: Oversight Committee Releases Report on the Biden Autopen Presidency. Published: Oct 28, 2025. https://oversight.house.gov/release/oversight-committee-releases-report-on-the-biden-autopen-presidency/ permalink parent award report block reply bill_in_texas 6 points 1 day ago A congressional oversight report and a buck fifty, plus tax, can get you a senior small coffee at McDonald's, if you're over 55 years old. permalink parent award report block reply Bullet3250 4 points 1 day ago The entire shooting match is based on whether or not BIDEN MADE THE PARDONS.... and how you can prove in court that HE DID NOT. I really don't know the answer to that.  The Founders wanted the President to have ultimate power to issue a Pardon... I suppose the Supremes are 'again' going to have to re-interpret what that means - as the Democrats ABUSED THE LANGUAGE AND THE PROCESS YET AGAIN. permalink parent award report block reply bill_in_texas 1 points 1 day ago All that has to be done is to get Brandon in a deposition when he's having a good day. President Biden, did you order the pardons of all these people [shows him the list]. Brandon:  Yes, I sure did, every one. Thank you, President Biden. Your honor, we're asking for immediate dismissal of this obviously partisan case on the grounds that there is no case, President Biden just told you he ordered each and every pardon. Judge:  Case dismissed, pardons upheld. Anyone who sees this going in a different direction, let me know.  No court, even the SC, is going to rule that Brandon was incapacitated enough to not be able to do official functions like pardons while he was in office.  They just won't want to go there, because of the hornet's nest it would kick over. permalink parent award report block reply view 3 more comments... NoMoreShinesBilly 1 points 1 day ago ^^^^^^^^^^^^^ permalink parent award report block reply ADAM_SCHITT 3 points 1 day ago Congressional investigations lead nowhere. If the DOJ isn't doing it, it's meaningless. permalink parent award report block reply Steve56775 1 points 1 day ago Bondi= The Bulldog! permalink parent award report block reply Throwingway22 1 points 1 day ago That's not really an unanswered question, though. The autopen pardon is in a binary state, with a Rubicon in between. Unless and until anyone thinks Trump is ready to tell the courts to go fuck themselves, there will be no movement on Autopen pardons. There is no form and substance requirement to a pardon in the Constitution. It would be completely uncharted territory to declare an autopen pardon void. A move of pure power. There are dozens of other issues where Trump's authority to act is far clearer, and he's still letting the court process play out. permalink parent award report block reply Trumpwon306 18 points 1 day ago Can't wait for nothing to be done about bombshell #704892734123497 permalink award report block reply SavingPrivateGrace 8 points 1 day ago Corn Pop was a bad dude and so were his gangsters.  The list of pardons cross matches the list of auto-pen abusers. permalink award report block reply bill_in_texas 9 points 1 day ago In actuality, Corn Pop was the hero of the story, the leader of the neighborhood watch that protected the neighborhood kids from pedos that like to have kids rub the hair on their legs, sit in their laps, sniff them, take inappropriate showers with, and much, much worse. permalink parent award report block reply StoopidAsshole69 3 points 1 day ago There was something about Joe that didn’t sit well with Corn Pop. permalink parent award report block reply Bullet3250 3 points 1 day ago Hairy legs.... one pardon for each hair!! permalink parent award report block reply Flataxandmaga 2 points 1 day ago pardoned a lot of leg rubbers. permalink parent award report block reply Redditcensorsyouandi 6 points 1 day ago Biden taking notes is one of the most ludicrous images my brain can conjure this morning. Ray Charles painting elephants seems less ridiculous permalink award report block reply Speedgraphic69 6 points 1 day ago 10 per cent for the Big Guy permalink award report block reply PhoneBandit 5 points 1 day ago Joe is never going to prison. Why do we sticky articles like this? If Joe was going to prison he would be on trial right now. permalink award report block reply CentipedeDemon 1 points 23 hours ago Nothing would be stickied at all with that criteria. The deep state is free to do whatever they want. permalink parent award report block reply PhoneBandit 1 points 22 hours ago We could sticky articles of reporters continuously asking the Trump admin for the Epstein list or why we haven't arrested the people conspiring against Trump. permalink parent award report block reply IvIA6A 4 points 1 day ago If Biden is going to be going around still doing speeches and screaming about democracy, he needs to be held accountable, but the doj is never going to prosecute. permalink award report block reply spezisacuckold 1 points 1 day ago He needs to be held accountable regardless of what he does or doesn't do out of office. permalink parent award report block reply IvIA6A 2 points 1 day ago They've already signalled they're not going to touch him because he's old and demented. permalink parent award report block reply Steve56775 1 points 1 day ago Bondi! permalink parent award report block reply current_horror 4 points 1 day ago I always wondered why they were constantly referring to “memos” in every investigation. Turns it they were just normalizing the idea that no memo = didn’t happen. Because then they can do whatever they want and claim it didn’t happen because… they didn’t write it down. That’s how dumb they think we are. permalink award report block reply Tulkas71 4 points 1 day ago I doubt he was involved in the Afgan pull out either permalink award report block reply Throwingway22 3 points 1 day ago The autopen pardon is in a binary state, with a Rubicon in between. Unless and until anyone thinks Trump is ready to tell the courts to go fuck themselves, there will be no movement on Autopen pardons. There is no form and substance requirement to a pardon in the Constitution. It would be completely uncharted territory to declare an autopen pardon void. A move of pure power. There are dozens of other issues where Trump's authority to act is far clearer, and he's still letting the court process play out. permalink award report block reply zooty 3 points 1 day ago Dang, that's a shocker. I'll go right out and vote for a republican administration which can install a DOJ to do something about this! permalink award report block reply IvIA6A 3 points 1 day ago Makes it all worth it doesn't it, just watching them get away with it when the evidence is right there. permalink parent award report block reply YodaBannon 3 points 1 day ago FJB permalink award report block reply PhantomShield72 2 points 1 day ago Cool. Go ahead and put that on Bondi's desk on your way out... permalink award report block reply MemeWarsVet 2 points 1 day ago -1 for use of \"bombshell.\" permalink award report block reply TheSHazDroid 2 points 1 day ago The United States of America was on autopilot for four years. permalink award report block reply Bullet3250 1 points 1 day ago I don't think it was autopilot.... -_- permalink parent award report block reply Build_Back_Bankrupt 3 points 1 day ago More like remote control. permalink parent award report block reply Now_On_to_Mars 2 points 1 day ago Joe's Notes hahah crayon doodles of ice cream cones permalink award report block reply NoMoreShinesBilly 2 points 1 day ago it is obvious to the ENTIRE WORLD that potato was not in charge.  what is the consequence?  none.  Got it.  Get the tens of millions of illegal aliens deported.  Reform our election laws, change the census, do something that matters. permalink award report block reply referencevariable 2 points 1 day ago Bombshell? We know he had no idea. The bombshell would be the Supreme Court declaring them void unless evidence can be presented proving them valid. They are THE authority to make this call, but like their abdication of adjudication of the 2020 TX versus PA case, they are shameful cowards other than Alito and Thomas so you can expect them to be silent. permalink award report block reply 2025WhatIsTrue 2 points 1 day ago Likely it was staff members who sold/\"awarded\" the pardons. GET EVERY ONE OF THEM IN FRONT OF A SPECIAL PROSECUTOR UNDER OATH. permalink award report block reply anti_masker 2 points 1 day ago old retard permalink award report block reply 26magarat 2 points 1 day ago I thought he had those notes to identify which reporters were which? permalink award report block reply rebuildingMyself 2 points 1 day ago He was always a mindless puppet, which is how the Uniparty prefers our Presidents. I bet the only reason he was appointed was to return some favors (same with Hillary but MAGA fucked that up) permalink award report block reply Klaus73 1 points 1 day ago Who is Changpeng Zhao? If you cannot answer that then perhaps you might understand why this whole autopen thing is a distraction. permalink award report block reply unotrumpcard 1 points 1 day ago They pardon chinese scammer Changpeng Zhao without Biden even knowing who he was. permalink award report block reply Parhelion12 1 points 1 day ago BOMBSHELL permalink award report block reply Dantalian 1 points 23 hours ago He lost the ability to write before they installed him like a toilet. permalink award report block reply Nomad2013 1 points 1 day ago Don’t worry folks!  Bondi won’t do anything with it! permalink award report block reply FromTheTopRope 1 points 1 day ago Dumb people think smart people don't have to take notes. permalink award report block reply BoughtByBloomberg2 1 points 1 day ago Despite this being obvious that his staffers just forged his signature. This  is a red herring. Go after NGOs that fund leftists. Go after judges and juries that let leftists run free. permalink award report block reply ParticleCannon 1 points 1 day ago If you didn't write it down it didn't happen permalink award report block reply Senaleb 1 points 1 day ago wow big news, nothing will happen. Comer has become the most ineffectual leader who yells about all these cases but none of them get anything accomplished. permalink award report block reply CyanScales 1 points 1 day ago Thats my issue, if you can prove Joe intended to pardon, and someone did it for him, that would probably be legal. You can have your atty sign your documents if you have it in writing. Joe seems to have had nothing to do with the pardons. permalink award report block reply SBOJ_JOBS 1 points 1 day ago I was told Joe kept notes on the tops of his mid-meeting pudding cups, but they went into the trash can with his empties. permalink award report block reply BigCovfefe 0 points 1 day ago Expected this to be another dumb gateway pundit link.  But no. permalink award report block reply\nGreenhills 85 points 1 day ago That’s because hunter was selling pardons at $250k a pop. permalink award report block reply Bullet3250 23 points 1 day ago yes.... permalink parent award report block reply Deportthemall23 15 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply breadbaker 8 points 1 day ago way underrated comment. permalink parent award report block reply drattastic1 10 points 1 day ago Prison is coming..... Lol, just kidding. permalink parent award report block reply NimblePepeCentipede 3 points 1 day ago .....how about a strongly worded letter? permalink parent award report block reply AVeryNakedMan 4 points 1 day ago A letter might hurt the feelings of those people who tried to destroy America. Best I can do is a tweet. permalink parent award report block reply mohel 0 points 1 day ago Trump will be gone in 3 years. They don't don't want to expose themselves to the wrath of the uniparty. permalink parent award report block reply Aquamine-Amarine 7 points 1 day ago Drugs are expensive. permalink parent award report block reply Choppermagic 3 points 1 day ago buy a shitty Hunter painting and get a pardon for free permalink parent award report block reply booblitchutz 3 points 1 day ago No way was it that cheap. It was either given to insiders free or the price tag was exorbitant. permalink parent award report block reply load 2 more comments...\nBullet3250 23 points 1 day ago yes.... permalink parent award report block reply Deportthemall23 15 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply breadbaker 8 points 1 day ago way underrated comment. permalink parent award report block reply\nDeportthemall23 15 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply breadbaker 8 points 1 day ago way underrated comment. permalink parent award report block reply\nbreadbaker 8 points 1 day ago way underrated comment. permalink parent award report block reply\ndrattastic1 10 points 1 day ago Prison is coming..... Lol, just kidding. permalink parent award report block reply NimblePepeCentipede 3 points 1 day ago .....how about a strongly worded letter? permalink parent award report block reply AVeryNakedMan 4 points 1 day ago A letter might hurt the feelings of those people who tried to destroy America. Best I can do is a tweet. permalink parent award report block reply mohel 0 points 1 day ago Trump will be gone in 3 years. They don't don't want to expose themselves to the wrath of the uniparty. permalink parent award report block reply\nNimblePepeCentipede 3 points 1 day ago .....how about a strongly worded letter? permalink parent award report block reply AVeryNakedMan 4 points 1 day ago A letter might hurt the feelings of those people who tried to destroy America. Best I can do is a tweet. permalink parent award report block reply mohel 0 points 1 day ago Trump will be gone in 3 years. They don't don't want to expose themselves to the wrath of the uniparty. permalink parent award report block reply\nAVeryNakedMan 4 points 1 day ago A letter might hurt the feelings of those people who tried to destroy America. Best I can do is a tweet. permalink parent award report block reply\nmohel 0 points 1 day ago Trump will be gone in 3 years. They don't don't want to expose themselves to the wrath of the uniparty. permalink parent award report block reply\nAquamine-Amarine 7 points 1 day ago Drugs are expensive. permalink parent award report block reply\nChoppermagic 3 points 1 day ago buy a shitty Hunter painting and get a pardon for free permalink parent award report block reply\nbooblitchutz 3 points 1 day ago No way was it that cheap. It was either given to insiders free or the price tag was exorbitant. permalink parent award report block reply\nCatalystForChange 43 points 1 day ago As always the unanswered question that millions of Americans are asking is WTF is DOJ doing about all of these accusations? permalink award report block reply airborne3502 19 points 1 day ago Not to be overly optimistic, but President Trump hasn't let up on the autopen issue. I imagine he's pushing his DOJ hard on it. He seems happy with Bondi, even though we aren't, so maybe things are happening we aren't aware of. permalink parent award report block reply bck- 8 points 1 day ago No dude, the people on here are way more aware than Trump is!! permalink parent award report block reply goldwater4ever 4 points 1 day ago I use to think the campaign/administration had folks here lurking to see what the base was saying and how it was responding to happenings going on.. not anymore.. permalink parent award report block reply bck- 11 points 1 day ago They most likely do. The only reason you don’t feel that way anymore is because this website has been infiltrated by bots and bad actors who are quick to jump on Trump the same way leftists do permalink parent award report block reply view 1 more comments... PhoneBandit 8 points 1 day ago They are on here but only to push back against anti Trump sentiment or anti Israel sentiment. They were really active about the Epstein stuff saying Epstein was just a really bad guy who didn't traffic girls to anyone but himself. permalink parent award report block reply view 2 more comments... Klaus73 1 points 1 day ago more aware who Changpeng Zhao is I hope :-) permalink parent award report block reply trumpORbust 1 points 1 day ago I am permalink parent award report block reply Dev404 5 points 1 day ago Unfortunately, that's the same optimism we had that resulted in his reelection being stolen and to this day, nothing done about it. I'm of the opinion that Bondi and Kash aren't doing a damn thing and he's being misled that something's going to happen or Trump doesn't actually care and is using it to bait us like he did with \"Hillary 4 Prison\" that never even began when he got into office. permalink parent award report block reply airborne3502 0 points 1 day ago He cares. President Trump has everything to lose if they don't do their jobs. At her confirmation hearing, Bondi wanted to talk about what she saw in Pennsylvania, during the stolen election, so it's something on her radar. Nobody would let her. The deep state isn't going to let up on Trump, or his family, unless he wins this fight. That bullet hit his ear, not mine. Like he said, he's standing in the way between them and us. permalink parent award report block reply Klaus73 -2 points 1 day ago Trump has nothing to lose; dudes made billions in family fortune since he took office. He isn't running a 3rd term. He's pushing 80. Bondi was likely part of a deal; She likely was planted as a leash on Trump to make sure he doesn't go after the folks that actually tried to kill him. Shes an insurance policy; Trump will be permitted to live and get rich. Kash is a clown so Trump was allowed to put him there as he was a mediocre performer before he became director. Notice how anyone of significance is not being looked into? The folks that were on the Epstien list are probably the same folk undermining Trump and likely the same folks that paid to try and have him killed in Butler. After they came close he was probably told the next time will be a \"heart attack\" or something similar. permalink parent award report block reply spezisacuckold -1 points 1 day ago Trump's happy with Bondi because he probably has a thing for her permalink parent award report block reply Bullet3250 9 points 1 day ago It is very difficult to keep tabs on ALL THE CRIMES COMMITTED IN DC... by Bureaucrats. So here is the latest on the Congressional investigation into the Biden Autopen: Oversight Committee Releases Report on the Biden Autopen Presidency. Published: Oct 28, 2025. https://oversight.house.gov/release/oversight-committee-releases-report-on-the-biden-autopen-presidency/ permalink parent award report block reply bill_in_texas 6 points 1 day ago A congressional oversight report and a buck fifty, plus tax, can get you a senior small coffee at McDonald's, if you're over 55 years old. permalink parent award report block reply Bullet3250 4 points 1 day ago The entire shooting match is based on whether or not BIDEN MADE THE PARDONS.... and how you can prove in court that HE DID NOT. I really don't know the answer to that.  The Founders wanted the President to have ultimate power to issue a Pardon... I suppose the Supremes are 'again' going to have to re-interpret what that means - as the Democrats ABUSED THE LANGUAGE AND THE PROCESS YET AGAIN. permalink parent award report block reply bill_in_texas 1 points 1 day ago All that has to be done is to get Brandon in a deposition when he's having a good day. President Biden, did you order the pardons of all these people [shows him the list]. Brandon:  Yes, I sure did, every one. Thank you, President Biden. Your honor, we're asking for immediate dismissal of this obviously partisan case on the grounds that there is no case, President Biden just told you he ordered each and every pardon. Judge:  Case dismissed, pardons upheld. Anyone who sees this going in a different direction, let me know.  No court, even the SC, is going to rule that Brandon was incapacitated enough to not be able to do official functions like pardons while he was in office.  They just won't want to go there, because of the hornet's nest it would kick over. permalink parent award report block reply view 3 more comments... NoMoreShinesBilly 1 points 1 day ago ^^^^^^^^^^^^^ permalink parent award report block reply ADAM_SCHITT 3 points 1 day ago Congressional investigations lead nowhere. If the DOJ isn't doing it, it's meaningless. permalink parent award report block reply Steve56775 1 points 1 day ago Bondi= The Bulldog! permalink parent award report block reply Throwingway22 1 points 1 day ago That's not really an unanswered question, though. The autopen pardon is in a binary state, with a Rubicon in between. Unless and until anyone thinks Trump is ready to tell the courts to go fuck themselves, there will be no movement on Autopen pardons. There is no form and substance requirement to a pardon in the Constitution. It would be completely uncharted territory to declare an autopen pardon void. A move of pure power. There are dozens of other issues where Trump's authority to act is far clearer, and he's still letting the court process play out. permalink parent award report block reply\nairborne3502 19 points 1 day ago Not to be overly optimistic, but President Trump hasn't let up on the autopen issue. I imagine he's pushing his DOJ hard on it. He seems happy with Bondi, even though we aren't, so maybe things are happening we aren't aware of. permalink parent award report block reply bck- 8 points 1 day ago No dude, the people on here are way more aware than Trump is!! permalink parent award report block reply goldwater4ever 4 points 1 day ago I use to think the campaign/administration had folks here lurking to see what the base was saying and how it was responding to happenings going on.. not anymore.. permalink parent award report block reply bck- 11 points 1 day ago They most likely do. The only reason you don’t feel that way anymore is because this website has been infiltrated by bots and bad actors who are quick to jump on Trump the same way leftists do permalink parent award report block reply view 1 more comments... PhoneBandit 8 points 1 day ago They are on here but only to push back against anti Trump sentiment or anti Israel sentiment. They were really active about the Epstein stuff saying Epstein was just a really bad guy who didn't traffic girls to anyone but himself. permalink parent award report block reply view 2 more comments... Klaus73 1 points 1 day ago more aware who Changpeng Zhao is I hope :-) permalink parent award report block reply trumpORbust 1 points 1 day ago I am permalink parent award report block reply Dev404 5 points 1 day ago Unfortunately, that's the same optimism we had that resulted in his reelection being stolen and to this day, nothing done about it. I'm of the opinion that Bondi and Kash aren't doing a damn thing and he's being misled that something's going to happen or Trump doesn't actually care and is using it to bait us like he did with \"Hillary 4 Prison\" that never even began when he got into office. permalink parent award report block reply airborne3502 0 points 1 day ago He cares. President Trump has everything to lose if they don't do their jobs. At her confirmation hearing, Bondi wanted to talk about what she saw in Pennsylvania, during the stolen election, so it's something on her radar. Nobody would let her. The deep state isn't going to let up on Trump, or his family, unless he wins this fight. That bullet hit his ear, not mine. Like he said, he's standing in the way between them and us. permalink parent award report block reply Klaus73 -2 points 1 day ago Trump has nothing to lose; dudes made billions in family fortune since he took office. He isn't running a 3rd term. He's pushing 80. Bondi was likely part of a deal; She likely was planted as a leash on Trump to make sure he doesn't go after the folks that actually tried to kill him. Shes an insurance policy; Trump will be permitted to live and get rich. Kash is a clown so Trump was allowed to put him there as he was a mediocre performer before he became director. Notice how anyone of significance is not being looked into? The folks that were on the Epstien list are probably the same folk undermining Trump and likely the same folks that paid to try and have him killed in Butler. After they came close he was probably told the next time will be a \"heart attack\" or something similar. permalink parent award report block reply spezisacuckold -1 points 1 day ago Trump's happy with Bondi because he probably has a thing for her permalink parent award report block reply\nbck- 8 points 1 day ago No dude, the people on here are way more aware than Trump is!! permalink parent award report block reply goldwater4ever 4 points 1 day ago I use to think the campaign/administration had folks here lurking to see what the base was saying and how it was responding to happenings going on.. not anymore.. permalink parent award report block reply bck- 11 points 1 day ago They most likely do. The only reason you don’t feel that way anymore is because this website has been infiltrated by bots and bad actors who are quick to jump on Trump the same way leftists do permalink parent award report block reply view 1 more comments... PhoneBandit 8 points 1 day ago They are on here but only to push back against anti Trump sentiment or anti Israel sentiment. They were really active about the Epstein stuff saying Epstein was just a really bad guy who didn't traffic girls to anyone but himself. permalink parent award report block reply view 2 more comments... Klaus73 1 points 1 day ago more aware who Changpeng Zhao is I hope :-) permalink parent award report block reply trumpORbust 1 points 1 day ago I am permalink parent award report block reply\ngoldwater4ever 4 points 1 day ago I use to think the campaign/administration had folks here lurking to see what the base was saying and how it was responding to happenings going on.. not anymore.. permalink parent award report block reply bck- 11 points 1 day ago They most likely do. The only reason you don’t feel that way anymore is because this website has been infiltrated by bots and bad actors who are quick to jump on Trump the same way leftists do permalink parent award report block reply view 1 more comments... PhoneBandit 8 points 1 day ago They are on here but only to push back against anti Trump sentiment or anti Israel sentiment. They were really active about the Epstein stuff saying Epstein was just a really bad guy who didn't traffic girls to anyone but himself. permalink parent award report block reply view 2 more comments...\nbck- 11 points 1 day ago They most likely do. The only reason you don’t feel that way anymore is because this website has been infiltrated by bots and bad actors who are quick to jump on Trump the same way leftists do permalink parent award report block reply view 1 more comments...\nPhoneBandit 8 points 1 day ago They are on here but only to push back against anti Trump sentiment or anti Israel sentiment. They were really active about the Epstein stuff saying Epstein was just a really bad guy who didn't traffic girls to anyone but himself. permalink parent award report block reply view 2 more comments...\nKlaus73 1 points 1 day ago more aware who Changpeng Zhao is I hope :-) permalink parent award report block reply\ntrumpORbust 1 points 1 day ago I am permalink parent award report block reply\nDev404 5 points 1 day ago Unfortunately, that's the same optimism we had that resulted in his reelection being stolen and to this day, nothing done about it. I'm of the opinion that Bondi and Kash aren't doing a damn thing and he's being misled that something's going to happen or Trump doesn't actually care and is using it to bait us like he did with \"Hillary 4 Prison\" that never even began when he got into office. permalink parent award report block reply airborne3502 0 points 1 day ago He cares. President Trump has everything to lose if they don't do their jobs. At her confirmation hearing, Bondi wanted to talk about what she saw in Pennsylvania, during the stolen election, so it's something on her radar. Nobody would let her. The deep state isn't going to let up on Trump, or his family, unless he wins this fight. That bullet hit his ear, not mine. Like he said, he's standing in the way between them and us. permalink parent award report block reply Klaus73 -2 points 1 day ago Trump has nothing to lose; dudes made billions in family fortune since he took office. He isn't running a 3rd term. He's pushing 80. Bondi was likely part of a deal; She likely was planted as a leash on Trump to make sure he doesn't go after the folks that actually tried to kill him. Shes an insurance policy; Trump will be permitted to live and get rich. Kash is a clown so Trump was allowed to put him there as he was a mediocre performer before he became director. Notice how anyone of significance is not being looked into? The folks that were on the Epstien list are probably the same folk undermining Trump and likely the same folks that paid to try and have him killed in Butler. After they came close he was probably told the next time will be a \"heart attack\" or something similar. permalink parent award report block reply\nairborne3502 0 points 1 day ago He cares. President Trump has everything to lose if they don't do their jobs. At her confirmation hearing, Bondi wanted to talk about what she saw in Pennsylvania, during the stolen election, so it's something on her radar. Nobody would let her. The deep state isn't going to let up on Trump, or his family, unless he wins this fight. That bullet hit his ear, not mine. Like he said, he's standing in the way between them and us. permalink parent award report block reply Klaus73 -2 points 1 day ago Trump has nothing to lose; dudes made billions in family fortune since he took office. He isn't running a 3rd term. He's pushing 80. Bondi was likely part of a deal; She likely was planted as a leash on Trump to make sure he doesn't go after the folks that actually tried to kill him. Shes an insurance policy; Trump will be permitted to live and get rich. Kash is a clown so Trump was allowed to put him there as he was a mediocre performer before he became director. Notice how anyone of significance is not being looked into? The folks that were on the Epstien list are probably the same folk undermining Trump and likely the same folks that paid to try and have him killed in Butler. After they came close he was probably told the next time will be a \"heart attack\" or something similar. permalink parent award report block reply\nKlaus73 -2 points 1 day ago Trump has nothing to lose; dudes made billions in family fortune since he took office. He isn't running a 3rd term. He's pushing 80. Bondi was likely part of a deal; She likely was planted as a leash on Trump to make sure he doesn't go after the folks that actually tried to kill him. Shes an insurance policy; Trump will be permitted to live and get rich. Kash is a clown so Trump was allowed to put him there as he was a mediocre performer before he became director. Notice how anyone of significance is not being looked into? The folks that were on the Epstien list are probably the same folk undermining Trump and likely the same folks that paid to try and have him killed in Butler. After they came close he was probably told the next time will be a \"heart attack\" or something similar. permalink parent award report block reply\nspezisacuckold -1 points 1 day ago Trump's happy with Bondi because he probably has a thing for her permalink parent award report block reply\nBullet3250 9 points 1 day ago It is very difficult to keep tabs on ALL THE CRIMES COMMITTED IN DC... by Bureaucrats. So here is the latest on the Congressional investigation into the Biden Autopen: Oversight Committee Releases Report on the Biden Autopen Presidency. Published: Oct 28, 2025. https://oversight.house.gov/release/oversight-committee-releases-report-on-the-biden-autopen-presidency/ permalink parent award report block reply bill_in_texas 6 points 1 day ago A congressional oversight report and a buck fifty, plus tax, can get you a senior small coffee at McDonald's, if you're over 55 years old. permalink parent award report block reply Bullet3250 4 points 1 day ago The entire shooting match is based on whether or not BIDEN MADE THE PARDONS.... and how you can prove in court that HE DID NOT. I really don't know the answer to that.  The Founders wanted the President to have ultimate power to issue a Pardon... I suppose the Supremes are 'again' going to have to re-interpret what that means - as the Democrats ABUSED THE LANGUAGE AND THE PROCESS YET AGAIN. permalink parent award report block reply bill_in_texas 1 points 1 day ago All that has to be done is to get Brandon in a deposition when he's having a good day. President Biden, did you order the pardons of all these people [shows him the list]. Brandon:  Yes, I sure did, every one. Thank you, President Biden. Your honor, we're asking for immediate dismissal of this obviously partisan case on the grounds that there is no case, President Biden just told you he ordered each and every pardon. Judge:  Case dismissed, pardons upheld. Anyone who sees this going in a different direction, let me know.  No court, even the SC, is going to rule that Brandon was incapacitated enough to not be able to do official functions like pardons while he was in office.  They just won't want to go there, because of the hornet's nest it would kick over. permalink parent award report block reply view 3 more comments... NoMoreShinesBilly 1 points 1 day ago ^^^^^^^^^^^^^ permalink parent award report block reply ADAM_SCHITT 3 points 1 day ago Congressional investigations lead nowhere. If the DOJ isn't doing it, it's meaningless. permalink parent award report block reply\nbill_in_texas 6 points 1 day ago A congressional oversight report and a buck fifty, plus tax, can get you a senior small coffee at McDonald's, if you're over 55 years old. permalink parent award report block reply Bullet3250 4 points 1 day ago The entire shooting match is based on whether or not BIDEN MADE THE PARDONS.... and how you can prove in court that HE DID NOT. I really don't know the answer to that.  The Founders wanted the President to have ultimate power to issue a Pardon... I suppose the Supremes are 'again' going to have to re-interpret what that means - as the Democrats ABUSED THE LANGUAGE AND THE PROCESS YET AGAIN. permalink parent award report block reply bill_in_texas 1 points 1 day ago All that has to be done is to get Brandon in a deposition when he's having a good day. President Biden, did you order the pardons of all these people [shows him the list]. Brandon:  Yes, I sure did, every one. Thank you, President Biden. Your honor, we're asking for immediate dismissal of this obviously partisan case on the grounds that there is no case, President Biden just told you he ordered each and every pardon. Judge:  Case dismissed, pardons upheld. Anyone who sees this going in a different direction, let me know.  No court, even the SC, is going to rule that Brandon was incapacitated enough to not be able to do official functions like pardons while he was in office.  They just won't want to go there, because of the hornet's nest it would kick over. permalink parent award report block reply view 3 more comments... NoMoreShinesBilly 1 points 1 day ago ^^^^^^^^^^^^^ permalink parent award report block reply\nBullet3250 4 points 1 day ago The entire shooting match is based on whether or not BIDEN MADE THE PARDONS.... and how you can prove in court that HE DID NOT. I really don't know the answer to that.  The Founders wanted the President to have ultimate power to issue a Pardon... I suppose the Supremes are 'again' going to have to re-interpret what that means - as the Democrats ABUSED THE LANGUAGE AND THE PROCESS YET AGAIN. permalink parent award report block reply bill_in_texas 1 points 1 day ago All that has to be done is to get Brandon in a deposition when he's having a good day. President Biden, did you order the pardons of all these people [shows him the list]. Brandon:  Yes, I sure did, every one. Thank you, President Biden. Your honor, we're asking for immediate dismissal of this obviously partisan case on the grounds that there is no case, President Biden just told you he ordered each and every pardon. Judge:  Case dismissed, pardons upheld. Anyone who sees this going in a different direction, let me know.  No court, even the SC, is going to rule that Brandon was incapacitated enough to not be able to do official functions like pardons while he was in office.  They just won't want to go there, because of the hornet's nest it would kick over. permalink parent award report block reply view 3 more comments...\nbill_in_texas 1 points 1 day ago All that has to be done is to get Brandon in a deposition when he's having a good day. President Biden, did you order the pardons of all these people [shows him the list]. Brandon:  Yes, I sure did, every one. Thank you, President Biden. Your honor, we're asking for immediate dismissal of this obviously partisan case on the grounds that there is no case, President Biden just told you he ordered each and every pardon. Judge:  Case dismissed, pardons upheld. Anyone who sees this going in a different direction, let me know.  No court, even the SC, is going to rule that Brandon was incapacitated enough to not be able to do official functions like pardons while he was in office.  They just won't want to go there, because of the hornet's nest it would kick over. permalink parent award report block reply view 3 more comments...\nNoMoreShinesBilly 1 points 1 day ago ^^^^^^^^^^^^^ permalink parent award report block reply\nADAM_SCHITT 3 points 1 day ago Congressional investigations lead nowhere. If the DOJ isn't doing it, it's meaningless. permalink parent award report block reply\nSteve56775 1 points 1 day ago Bondi= The Bulldog! permalink parent award report block reply\nThrowingway22 1 points 1 day ago That's not really an unanswered question, though. The autopen pardon is in a binary state, with a Rubicon in between. Unless and until anyone thinks Trump is ready to tell the courts to go fuck themselves, there will be no movement on Autopen pardons. There is no form and substance requirement to a pardon in the Constitution. It would be completely uncharted territory to declare an autopen pardon void. A move of pure power. There are dozens of other issues where Trump's authority to act is far clearer, and he's still letting the court process play out. permalink parent award report block reply\nTrumpwon306 18 points 1 day ago Can't wait for nothing to be done about bombshell #704892734123497 permalink award report block reply\nSavingPrivateGrace 8 points 1 day ago Corn Pop was a bad dude and so were his gangsters.  The list of pardons cross matches the list of auto-pen abusers. permalink award report block reply bill_in_texas 9 points 1 day ago In actuality, Corn Pop was the hero of the story, the leader of the neighborhood watch that protected the neighborhood kids from pedos that like to have kids rub the hair on their legs, sit in their laps, sniff them, take inappropriate showers with, and much, much worse. permalink parent award report block reply StoopidAsshole69 3 points 1 day ago There was something about Joe that didn’t sit well with Corn Pop. permalink parent award report block reply Bullet3250 3 points 1 day ago Hairy legs.... one pardon for each hair!! permalink parent award report block reply Flataxandmaga 2 points 1 day ago pardoned a lot of leg rubbers. permalink parent award report block reply\nbill_in_texas 9 points 1 day ago In actuality, Corn Pop was the hero of the story, the leader of the neighborhood watch that protected the neighborhood kids from pedos that like to have kids rub the hair on their legs, sit in their laps, sniff them, take inappropriate showers with, and much, much worse. permalink parent award report block reply StoopidAsshole69 3 points 1 day ago There was something about Joe that didn’t sit well with Corn Pop. permalink parent award report block reply\nStoopidAsshole69 3 points 1 day ago There was something about Joe that didn’t sit well with Corn Pop. permalink parent award report block reply\nBullet3250 3 points 1 day ago Hairy legs.... one pardon for each hair!! permalink parent award report block reply Flataxandmaga 2 points 1 day ago pardoned a lot of leg rubbers. permalink parent award report block reply\nFlataxandmaga 2 points 1 day ago pardoned a lot of leg rubbers. permalink parent award report block reply\nRedditcensorsyouandi 6 points 1 day ago Biden taking notes is one of the most ludicrous images my brain can conjure this morning. Ray Charles painting elephants seems less ridiculous permalink award report block reply\nSpeedgraphic69 6 points 1 day ago 10 per cent for the Big Guy permalink award report block reply\nPhoneBandit 5 points 1 day ago Joe is never going to prison. Why do we sticky articles like this? If Joe was going to prison he would be on trial right now. permalink award report block reply CentipedeDemon 1 points 23 hours ago Nothing would be stickied at all with that criteria. The deep state is free to do whatever they want. permalink parent award report block reply PhoneBandit 1 points 22 hours ago We could sticky articles of reporters continuously asking the Trump admin for the Epstein list or why we haven't arrested the people conspiring against Trump. permalink parent award report block reply\nCentipedeDemon 1 points 23 hours ago Nothing would be stickied at all with that criteria. The deep state is free to do whatever they want. permalink parent award report block reply PhoneBandit 1 points 22 hours ago We could sticky articles of reporters continuously asking the Trump admin for the Epstein list or why we haven't arrested the people conspiring against Trump. permalink parent award report block reply\nPhoneBandit 1 points 22 hours ago We could sticky articles of reporters continuously asking the Trump admin for the Epstein list or why we haven't arrested the people conspiring against Trump. permalink parent award report block reply\nIvIA6A 4 points 1 day ago If Biden is going to be going around still doing speeches and screaming about democracy, he needs to be held accountable, but the doj is never going to prosecute. permalink award report block reply spezisacuckold 1 points 1 day ago He needs to be held accountable regardless of what he does or doesn't do out of office. permalink parent award report block reply IvIA6A 2 points 1 day ago They've already signalled they're not going to touch him because he's old and demented. permalink parent award report block reply Steve56775 1 points 1 day ago Bondi! permalink parent award report block reply\nspezisacuckold 1 points 1 day ago He needs to be held accountable regardless of what he does or doesn't do out of office. permalink parent award report block reply IvIA6A 2 points 1 day ago They've already signalled they're not going to touch him because he's old and demented. permalink parent award report block reply\nIvIA6A 2 points 1 day ago They've already signalled they're not going to touch him because he's old and demented. permalink parent award report block reply\nSteve56775 1 points 1 day ago Bondi! permalink parent award report block reply\ncurrent_horror 4 points 1 day ago I always wondered why they were constantly referring to “memos” in every investigation. Turns it they were just normalizing the idea that no memo = didn’t happen. Because then they can do whatever they want and claim it didn’t happen because… they didn’t write it down. That’s how dumb they think we are. permalink award report block reply\nTulkas71 4 points 1 day ago I doubt he was involved in the Afgan pull out either permalink award report block reply\nThrowingway22 3 points 1 day ago The autopen pardon is in a binary state, with a Rubicon in between. Unless and until anyone thinks Trump is ready to tell the courts to go fuck themselves, there will be no movement on Autopen pardons. There is no form and substance requirement to a pardon in the Constitution. It would be completely uncharted territory to declare an autopen pardon void. A move of pure power. There are dozens of other issues where Trump's authority to act is far clearer, and he's still letting the court process play out. permalink award report block reply\nzooty 3 points 1 day ago Dang, that's a shocker. I'll go right out and vote for a republican administration which can install a DOJ to do something about this! permalink award report block reply IvIA6A 3 points 1 day ago Makes it all worth it doesn't it, just watching them get away with it when the evidence is right there. permalink parent award report block reply\nIvIA6A 3 points 1 day ago Makes it all worth it doesn't it, just watching them get away with it when the evidence is right there. permalink parent award report block reply\nYodaBannon 3 points 1 day ago FJB permalink award report block reply\nPhantomShield72 2 points 1 day ago Cool. Go ahead and put that on Bondi's desk on your way out... permalink award report block reply\nMemeWarsVet 2 points 1 day ago -1 for use of \"bombshell.\" permalink award report block reply\nTheSHazDroid 2 points 1 day ago The United States of America was on autopilot for four years. permalink award report block reply Bullet3250 1 points 1 day ago I don't think it was autopilot.... -_- permalink parent award report block reply Build_Back_Bankrupt 3 points 1 day ago More like remote control. permalink parent award report block reply\nBullet3250 1 points 1 day ago I don't think it was autopilot.... -_- permalink parent award report block reply Build_Back_Bankrupt 3 points 1 day ago More like remote control. permalink parent award report block reply\nBuild_Back_Bankrupt 3 points 1 day ago More like remote control. permalink parent award report block reply\nNow_On_to_Mars 2 points 1 day ago Joe's Notes hahah crayon doodles of ice cream cones permalink award report block reply\nNoMoreShinesBilly 2 points 1 day ago it is obvious to the ENTIRE WORLD that potato was not in charge.  what is the consequence?  none.  Got it.  Get the tens of millions of illegal aliens deported.  Reform our election laws, change the census, do something that matters. permalink award report block reply\nreferencevariable 2 points 1 day ago Bombshell? We know he had no idea. The bombshell would be the Supreme Court declaring them void unless evidence can be presented proving them valid. They are THE authority to make this call, but like their abdication of adjudication of the 2020 TX versus PA case, they are shameful cowards other than Alito and Thomas so you can expect them to be silent. permalink award report block reply\n2025WhatIsTrue 2 points 1 day ago Likely it was staff members who sold/\"awarded\" the pardons. GET EVERY ONE OF THEM IN FRONT OF A SPECIAL PROSECUTOR UNDER OATH. permalink award report block reply\nanti_masker 2 points 1 day ago old retard permalink award report block reply\n26magarat 2 points 1 day ago I thought he had those notes to identify which reporters were which? permalink award report block reply\nrebuildingMyself 2 points 1 day ago He was always a mindless puppet, which is how the Uniparty prefers our Presidents. I bet the only reason he was appointed was to return some favors (same with Hillary but MAGA fucked that up) permalink award report block reply\nKlaus73 1 points 1 day ago Who is Changpeng Zhao? If you cannot answer that then perhaps you might understand why this whole autopen thing is a distraction. permalink award report block reply\nunotrumpcard 1 points 1 day ago They pardon chinese scammer Changpeng Zhao without Biden even knowing who he was. permalink award report block reply\nParhelion12 1 points 1 day ago BOMBSHELL permalink award report block reply\nDantalian 1 points 23 hours ago He lost the ability to write before they installed him like a toilet. permalink award report block reply\nNomad2013 1 points 1 day ago Don’t worry folks!  Bondi won’t do anything with it! permalink award report block reply\nFromTheTopRope 1 points 1 day ago Dumb people think smart people don't have to take notes. permalink award report block reply\nBoughtByBloomberg2 1 points 1 day ago Despite this being obvious that his staffers just forged his signature. This  is a red herring. Go after NGOs that fund leftists. Go after judges and juries that let leftists run free. permalink award report block reply\nParticleCannon 1 points 1 day ago If you didn't write it down it didn't happen permalink award report block reply\nSenaleb 1 points 1 day ago wow big news, nothing will happen. Comer has become the most ineffectual leader who yells about all these cases but none of them get anything accomplished. permalink award report block reply\nCyanScales 1 points 1 day ago Thats my issue, if you can prove Joe intended to pardon, and someone did it for him, that would probably be legal. You can have your atty sign your documents if you have it in writing. Joe seems to have had nothing to do with the pardons. permalink award report block reply\nSBOJ_JOBS 1 points 1 day ago I was told Joe kept notes on the tops of his mid-meeting pudding cups, but they went into the trash can with his empties. permalink award report block reply\nBigCovfefe 0 points 1 day ago Expected this to be another dumb gateway pundit link.  But no. permalink award report block reply"
}