{
  "id": "8185420",
  "title": "72Tucker: “Lindsey Graham is a force against Christianity… That’s just a fact.”posted3 hours agobyBi",
  "url": "https://patriots.win/p/1ARK9nOnui/tucker-lindsey-graham-is-a-force/c",
  "content": "73 Tucker: “Lindsey Graham is a force against Christianity… That’s just a fact.” posted 3 hours ago by Bidensuckscocks 8 comments award share report block\n8 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Wexit-Delecto 5 points 3 hours ago Anyone who wants to send Christians off to die in distant shitholes is anti Christian. It's not hard. permalink award report block reply Datamancer 5 points 3 hours ago Depends,  is it a legitimate crusade to rid the world of the Christ deniers who are sworn to destroy the Christian West through violence and subterfuge? permalink parent award report block reply Wexit-Delecto 2 points 3 hours ago No we're all just helping people of another race and another religion colonize some distant part of the earth in exchange for exactly nothing. permalink parent award report block reply wst4 2 points 2 hours ago Most faggots are.. permalink award report block reply Area82 1 points 35 minutes ago My thoughts also. permalink parent award report block reply AgnosticTemplar 1 points 3 hours ago Lindsay Graham is a force against white civilization. permalink award report block reply TrumpWonByALandslide 1 points 3 hours ago Lindsey Graham is a faggot in every sense of the word. permalink award report block reply Be_The_Change 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply\nWexit-Delecto 5 points 3 hours ago Anyone who wants to send Christians off to die in distant shitholes is anti Christian. It's not hard. permalink award report block reply Datamancer 5 points 3 hours ago Depends,  is it a legitimate crusade to rid the world of the Christ deniers who are sworn to destroy the Christian West through violence and subterfuge? permalink parent award report block reply Wexit-Delecto 2 points 3 hours ago No we're all just helping people of another race and another religion colonize some distant part of the earth in exchange for exactly nothing. permalink parent award report block reply\nDatamancer 5 points 3 hours ago Depends,  is it a legitimate crusade to rid the world of the Christ deniers who are sworn to destroy the Christian West through violence and subterfuge? permalink parent award report block reply Wexit-Delecto 2 points 3 hours ago No we're all just helping people of another race and another religion colonize some distant part of the earth in exchange for exactly nothing. permalink parent award report block reply\nWexit-Delecto 2 points 3 hours ago No we're all just helping people of another race and another religion colonize some distant part of the earth in exchange for exactly nothing. permalink parent award report block reply\nwst4 2 points 2 hours ago Most faggots are.. permalink award report block reply Area82 1 points 35 minutes ago My thoughts also. permalink parent award report block reply\nArea82 1 points 35 minutes ago My thoughts also. permalink parent award report block reply\nAgnosticTemplar 1 points 3 hours ago Lindsay Graham is a force against white civilization. permalink award report block reply\nTrumpWonByALandslide 1 points 3 hours ago Lindsey Graham is a faggot in every sense of the word. permalink award report block reply\nBe_The_Change 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply"
}