{
  "id": "8175924",
  "title": "1154Peter Thiel’s email to Zuck & Andreessen in Jan-2020 predicted socialism: Too much student debt ",
  "url": "https://patriots.win/p/1ARK56kvxs/peter-thiels-email-to-zuck--andr/c",
  "content": "1154 Peter Thiel’s email to Zuck & Andreessen in Jan-2020 predicted socialism: Too much student debt and lack of affordable housing keeps young people with negative capital for too long. And without a stake in the capitalist system, they will turn against it. (hotair.com) posted 4 days ago by rdvs34283 234 comments award share report block Peter Thiel: There's a Reason Young People Are Voting Mamdani Peter Thiel warns about the rise of socialism among young voters due to economic challenges. hotair.com\n234 comments Sort by Top Top New Worst Old Save militantnationalist6 112 points 4 days ago He’s right but all this is fixed through mass deportations. And it’s funny because the left has never met a third worlder that they didn’t want to import which only makes these problems worse. permalink award report block reply Bigstick7 44 points 4 days ago Mass deportations and a fixing if a lot of our systems the government has corrupted. Student loans are one of them, government should be out of them. Shackling kids with debt before they are smart enough to understand the consequences. No you should have to walk into a bank like anyone else asking for a loan and ask for money and give the case as why they should and how you will pay it back. Going to be a kindergarten teacher asking to go borrow for an Ivy League school, denied here's 20k go community college. Instead we have the government handing out loans basically unfettered to anyone for anything even if they don't have a prayer of paying them back. What happened the cost of college has exploded. permalink parent award report block reply LordKuroTheGreat 24 points 4 days ago And not only do they not have the life experience to understand the consequences (by design, since schools keep them immature on purpose), but they usually have every adult in their life telling them it's the only way forward and that they're trash and failures if they don't. permalink parent award report block reply that1guy1981 6 points 4 days ago Mass deportation needs to deport 10M to even blunt the housing affordability.  20M would correct it.  Were at close to 1M with the estimated self deportations? permalink parent award report block reply CleanUpPhillyTrump24 5 points 4 days ago 1.5 self deportations, 600K assisted deportations. permalink parent award report block reply Nibba2 9 points 4 days ago If the loans could be defaulted on, also make the colleges responsible for the debt. If they believe they are doing quality work then certainly they would have confidence in their students success. I bet a lot more vetting and scrutiny would happen. Cost of college would go down. But instead people have it on their backs for life. Too many dirtbags guiding the impressionable into worthless directions too. They know what they are doing to. permalink parent award report block reply Axiom502 8 points 4 days ago Default is one thing. Perpetual indentured servitude to fund commie think tanks is another. Most responsible graduates are making their payments but can never escape the crushing total debt and the monthly payments eliminate their ability to invest and buy into the economy. permalink parent award report block reply N14205ST205 3 points 4 days ago They also need to make student loans dischargeable in bankruptcy. It's why the debt just keeps accumulating for many. They literally don't have an option to reset from a clean slate. Also, the government getting so involved in the student loan business was a catastrophic mistake. Someone has to pay for the whole thing- the government's not a charity. permalink parent award report block reply GorillaTactics 1 points 4 days ago Just have a plan for some entirely predictable consequences. For instance, every doctor, upon completing medical school, will declare bankruptcy and discharge those loans as part of a standard new doctor financial plan. Considering how long it takes them to get through residency getting paid poverty wages, and start actually making money, they will suffer little from the hit on their credit before it drops off their score. permalink parent award report block reply Nibba2 2 points 4 days ago Yeah. There isn’t a very good answer to it all. permalink parent award report block reply view 1 more comments... Bigstick7 1 points 4 days ago I agree over 800 billion in endowments throughout all these colleges. Use these for defaulted loans. permalink parent award report block reply Unboosted 2 points 4 days ago They dont teach kids how to manage money in school anymore. They dont teach them how to bank, budget, save, write a check. Nothing. permalink parent award report block reply Bigstick7 2 points 4 days ago Accounting and economics should be a requirement in highschool. permalink parent award report block reply Viewer01 -1 points 4 days ago It’s never going to happen. Balancing the budget will crash the economy. You can’t vaporize 2 trillion in spending and not crush your gdp and put a lot of people out of work. I’m not saying I agree with it. I’m just explaining why none of what you suggest will ever happen permalink parent award report block reply KernalMustard 5 points 4 days ago Sometimes you have to break a few eggs to make a omelette. permalink parent award report block reply CleanUpPhillyTrump24 2 points 4 days ago They're replacing gov spending with private investment. It's working. permalink parent award report block reply XxxRDTPRNxxX 10 points 4 days ago And ban corporations from renting more than 10 homes unless they build those homes from scratch. Start inflating the supply too! A house is supposed to be a place to live, not an investment that gets you rich as you age. permalink parent award report block reply Viewer01 15 points 4 days ago Ban them from owning single family altogether. If mom and pop want to retire and rent their house out fine. Fuck off with black stone paying cash for a neighborhood. permalink parent award report block reply booblitchutz 8 points 4 days ago No, a house is an asset, as well. I agree the values have been grossly inflated to enrich banks. permalink parent award report block reply Unboosted 2 points 4 days ago Property taxes are high to enrich the bankrupt democratic party. 2026 is our time to show our power and not pay taxes. File an extension at least and watch what happens. We all need to say \"no taxation without representation no taxes for slush funds, no taxes for 3rd worlders, no taxes in 2026.\" permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago A car is an asset too. That doesn't mean only boomers should get to drive, just so they can sell their car for 10x what they paid for it. permalink parent award report block reply YearninNation 2 points 4 days ago How about addressing usury, compound interest, mandatory insurance. and income tax? permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago What about people who say what about whataboutism? What about them? permalink parent award report block reply YearninNation 1 points 3 days ago What about them? permalink parent award report block reply Bboop 2 points 4 days ago Yes this exactly!! permalink parent award report block reply RedStoneDeepState -9 points 4 days ago \"just become a communist shithole to fight communism\" permalink parent award report block reply CPT88 1 points 4 days ago Thats not enough. What you need is no corporations, trusts or foreigners to own residential property. An individual person can own no more than 4 properties. 2 exceptions: If you build a new property these rules don't count for 35 years. This way BTR companies can operate and encourage building over rent seeking. Charitable housing. Rent must be 50% or less than market. Penalty for fraud around this is loss of the property. Ultimately homes can be good for people, or good for investors. Society needs to get priorities straight here. In the same vein we need to remove property tax on residential and I'd do something similar with farms. We need to stop investment groups living in the city owning all the farmland and ensure families can own and run these things. permalink parent award report block reply load 9 more comments... labajada 4 points 4 days ago The \"guaranteed\" student loan administration scam was happening long before the active destruction of western freedom. back in the pit, slave! permalink parent award report block reply HuggableBear 4 points 4 days ago People under 35 - 40 years old literally don't remember a time when America was American. Y'all don't realize, this is not fixable. Revolution is inevitable. permalink parent award report block reply CommonSenseAmerican 1 points 4 days ago My generation is probably the last that finds most teenagers and younger adults not the least bit threatening and very pussylike, they have big mouths but that is about it. I blame it on being raised with cellphones and online interactions with friends, instead of meaningful IRL interactions. permalink parent award report block reply HuggableBear 2 points 3 days ago They aren't very threatening. They are indeed pussies. And it is for exactly the reasons you laid out. What happens to this country when you're 80 and those pussies are 45? permalink parent award report block reply CommonSenseAmerican 1 points 3 days ago Hopefully they become wiser with time and forget the idiotic socialist shit, and begin to see things from a taxpayer perspective. Multiple generations of spoiled children really doesn't make the future look great however they are easily amused by tiktok. permalink parent award report block reply BooKoo 2 points 4 days ago Obama was the \"Deporter in Chief\" soooo why aren't we all driving Lambos now? permalink parent award report block reply militantnationalist6 1 points 4 days ago Look, I’m sure we’re on the same side, but it’s hard for me to imagine that there’s somebody this stupid how many total people did he deport compared to how many illegals there are would you consider that Obama did mass deportations ? Because I don’t. And this is even before we talk about the treason that was committed by the Biden regime. permalink parent award report block reply BooKoo 1 points 4 days ago how do you define \"mass\"?\nGoing off the pure numbers he deported more than this current administration so far and also more than the previous Trump administration did during its four years. I mean just look it up I'm not pulling it out of my ass. permalink parent award report block reply load 47 more comments... fazaman 50 points 4 days ago Any why is college so expensive? Government. (Guarantee student loans) Why is housing so expensive? Government. (Mass immigration) Neither of which is an indictment on capitalism. permalink award report block reply rebuildingMyself 19 points 4 days ago Not to mention the array of toxic useless degrees in Marxism or \"activism\" that provide zero marketable skills any company would want in their offices. permalink parent award report block reply stealthboy 18 points 4 days ago However all problems are blamed on capitalism, conservatives, and Republicans.  So the ignorant masses keep voting for leadership to just build more government. permalink parent award report block reply HockeyMom4Trump 5 points 4 days ago Not just mass immigration. Government also got in the business of subsidizing housing. That needs to end too. permalink parent award report block reply fazaman 1 points 4 days ago Oh, sure. It's just one of several factors, basically all caused by the government. I was just pointing out one major recent cause. permalink parent award report block reply HKFan 4 points 4 days ago healthcare too permalink parent award report block reply fazaman 2 points 4 days ago Very much so. permalink parent award report block reply Pearcesarrow 3 points 4 days ago True, but I would also add that corporations like blackrock should not be allowed to buy up housing supply. Build housing sure but not buy up preexisting housing supply to make profit from permalink parent award report block reply load 5 more comments... NYforTrump 38 points 4 days ago Colleges are hiking up their tuition due to guaranteed government loans and there's not enough housing to house Biden's 20 million illegals.  Cut off the loans, force schools to compete with each other on merit, deport all illegals.  Problem solved. permalink award report block reply rebuildingMyself 16 points 4 days ago Also allowing foreign investors to buy up the housing to park their wealth puts pressure on supply permalink parent award report block reply FlyCatcher94 2 points 4 days ago Not wrong permalink parent award report block reply TheAttackTitan 1 points 4 days ago Schools shouldn’t be paid until after you graduate. You don’t pay for dinner before you’re served, you don’t pay for a haircut before the barber pulls out the scissors, you don’t pay for home renovations until after services have been rendered. But for college, you pay your semester tuition up front and in full. Why does school deserve be different? Sure it’s expensive, take out a loan for it. Lock in your rate before you enroll, and start paying it after you graduate. That’ll keep costs down - college will need to keep costs affordable and focus on job placement and career readiness if they’re ever going to expect a return on their investment in you. And college should be responsible for your job placement. You can’t pay for a loan without a job. If you can’t get a job, and you provide proof that you’ve been applying to jobs and tried to get a job, then the college should put that endowment to good use. If they fail to prepare you adequately for the future, that’s on them for not doing a good enough job. permalink parent award report block reply Bazhosh 1 points 4 days ago You pay for gas before you drive... permalink parent award report block reply ThunderSizzle 2 points 4 days ago Not with a credit card.  You offer proof you can pay,  but the transaction isn't locked in until after you have the gas. permalink parent award report block reply NYforTrump 1 points 4 days ago We used to be able to pump before paying.  Bunch of assholes ruined it. permalink parent award report block reply TheAttackTitan 1 points 3 days ago This is a stupid observation. If you pay for gas with cash, you’re purchasing an agreed upon quantity of gallons. If you pay with a credit card, your credit account is checked for sufficient line of credit, then the pump lets you pump as much as you want, and you get charged after the gas has been dispensed. Yes of course you can’t drive before you get gas, but the gas is still transactional. College is not transactional. You buy everything up front with no guarantee of the outcome or quality of the final product. permalink parent award report block reply Bboop 1 points 4 days ago Amen permalink parent award report block reply FromNC 1 points 4 days ago Students already have the ability to shop for lower cost schools and they don’t. The UNC curriculum is used throughout almost all major NC colleges yet I was able to get an engineering degree for $32k while another school with the same curriculum cost $90k. permalink parent award report block reply load 3 more comments... Plsdontfireme 18 points 4 days ago Make colleges liable for false advertising. Drain their endowments to pay off fraudulent student loans. permalink award report block reply RuprechtThaMonkeyBoy 10 points 4 days ago This. Privatize, and move the debt to colleges. Let the debtors learn their first real skill in life: negotiation. If debtors are smart enough they negotiate a settlement for what their bullshit degrees are truly worth: pennies on the dollar. permalink parent award report block reply tholinz 5 points 4 days ago Imagine if colleges had to provide financing... all of this shit would get solved within a year permalink parent award report block reply deleted 2 points 4 days ago CommonSenseAmerican 1 points 4 days ago Also they are the only institutions that legally and exclusively allow African specific racial classes to exist along with quotas. Will Whites Americans be afforded the same when they become a minority at colleges, doubtful. permalink parent award report block reply Nibba2 2 points 4 days ago There was a college I drove by, it’s well known and has a large student base. Around the town, they advertised “highest graduation rate in the greater area!” That’s not something to be proud of. That’s just saying you’re essentially ITT tech and a diploma mill. Let’s see your students success rates. How much they are paid compared to your competition. How well the program teaches. permalink parent award report block reply armyofpedes4usa 17 points 4 days ago Friendly reminder: Peter Thiel is a co-founder of Palantir. He's not exactly on our side. permalink award report block reply LORDFALCONE 9 points 4 days ago Peter Thiel perfect anagram for The Reptile. Also gay and Jewish, literally permalink parent award report block reply TrumpAndGodWin 3 points 4 days ago Was he the one that made a crazy comment about being afraid of Christians throwing him off a roof (one of the top jews at Palantir said it)? permalink parent award report block reply Ritchie_Blackadder 2 points 4 days ago Too Gruish permalink parent award report block reply Wearyman 5 points 4 days ago Well, these commies DO always tell us exactly what they plan to do. permalink parent award report block reply Dangerous 1 points 4 days ago The fact this truth is buried under normie slop about boomers and capitalism is just proof we already lost and that this place has been artificially converted to MIGA through prolific use of bots... permalink parent award report block reply RuprechtThaMonkeyBoy 12 points 4 days ago And who convinced these dumbass Millennials and older Gen Z’s to rack up college debt pursuing useless woke degrees? Obama and Company. It’s all part of their “long-march” strategy to fundamentally transform America. It’s not about the left’s candidate qualifications, it’s about putting someone in office that will acquiesce to their “Change” central committee who does the work and autopens the orders. permalink award report block reply CryingBanshee 29 points 4 days ago Um WHAT?!  This is such an out-of-touch take. Im an older millennial, born early 1980s. From the time I entered school in the mid-late 80s my teachers were constantly talking about going to college, how to use student loans, how quickly student loans will be paid back with a great job post-college. My parents and grandparents, church members, every boomer I knew told us to go to college no matter what as that was the best way to be successful and have a great career.  By the time Obama came around older millennials had already graduated from college and some from grad school with tens to hundreds of thousands in debt. permalink parent award report block reply Tele_Plus 10 points 4 days ago You and I are “xennials” (I was born in ‘83).  The shit millennials came about a decade after us and we get blamed too because of them.  Same thing with Boomers.  My mom is a younger boomer (they call them “Jonesers”), and  she says the hippies were the older boomers, and she was in middle school and listening to the Monkees when all that was going on. She wants absolutely NOTHING to do with the other half of her generation and has nothing in common with them. I do agree though that many of us went all in on college, but a lot of older folks forget we were told all our lives that you’re basically a failure and going nowhere in life if you don’t get a college degree. Also, for a good while even the most entry level office job required a college degree, didn’t matter in what field, just a degree. Meanwhile the kids they shamed for not being the top of their class were told “you might as well go to the tech school because you’re not smart enough to be academically successful” - those people are making good money in the trades. permalink parent award report block reply HockeyMom4Trump 2 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. “Xennials” “Jonesers” this is beginning to sound like the left gender spectrum…binary, non-binary, furry. The secret to financial success? It is pretty damn easy. First, stop blaming. Don’t be a victim. Work a job. Live below your means. Save. Eat ramen noodles and drink tap water if you have to. Don’t worry about trying to impress anyone else. Don’t lease a car you can’t afford. Walk. Take a bus. When my husband and I were starting out we worked and worked and saved and saved. When my parents were young they worked and worked and saved and saved. Now my sons are starting out. They work and work and save and save. Never be a victim. Stop whining. Stop the generation bullshit. Live below your means. No more victim. permalink parent award report block reply mav7579 1 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. This There are good and bad people in every generation.  It isn't the rank and file boomer that created these problems that the younger people complain about. The generation division thing is just another scam to divide people, no different than dividing people by their race, gender, etc. permalink parent award report block reply Tele_Plus -1 points 4 days ago That’s great for you, and for your kids.  But it’s still more nuanced than you think. I never said I was living outside my means or anything like that.  If I was going to play victim I wouldn’t be on this website and hanging out with MAGA.  We aren’t all occupy Wall Street types and we don’t all blame the system for everything.  (Well, no, the public school system is certainly to blame for a lot, and still is, as is most of government.) This is not playing victim, it’s recognizing how we were set up for failure, so we don’t do the same thing to our kids.  In fact there are a lot of millennials who are MAGA for this reason.  Many, including my wife and I, are now homeschooling our kids and encouraging them to consider careers in trades, and to avoid college unless it’s for something practical like nursing. permalink parent award report block reply RedStoneDeepState -8 points 4 days ago The shit millennials came about a decade after us Nope, you are the age of the anti war protesters under Bush. When I talk badly about millennials I am talking about your age. permalink parent award report block reply XcaliburCaliber 1 points 4 days ago Are you nuts? Millenials are also known as the 9/11 generation. I am not claiming we should or should not have been involved in OIF or OEF but we overwhelmingly fought all the sandbox wars starting after 9/11. Gen x kicked it off in a big way at more of an 80%/20% split. As soon as the millenials were old enough to join the ration flipped. Yes, there absolutely were lots of millennial anti-war protesters on social media. Gen x didn’t have any major conflicts to the same degree as millenials to even protest against. Boomers were more protest queens but gen-x still had the anti apartheid protests, the AIDS act ups and “die-ins”, green peace, ant-nuclear, and I’m certain I’m missing some. Moral of the story, it makes no sense to judge an entire generation based on their losers, save it for the jokes. Millenials losers are great to dunk on for fun. As one, the opportunity is ripe. Oh, and of the full time employed cohorts,  millenials work more hours than gen-x. permalink parent award report block reply view 1 more comments... HoganT 1 points 4 days ago Ok, boomer. You’re the one that has spent your entire life voting us down the river to where we are today. permalink parent award report block reply view 1 more comments... deleted 5 points 4 days ago TravisRSCX 6 points 4 days ago Honestly government guaranteed loans have driven up college costs the most. Goes along with the 40 million people on snap benefits driving up food costs as well. I’m all for assisting people that need assistance, but the ones taking advantage of this needs to be taken off this. permalink parent award report block reply deleted 4 points 4 days ago view 2 more comments... HockeyMom4Trump 3 points 4 days ago Government needs to get out of the loan business. permalink parent award report block reply PsychoDodo 1 points 4 days ago This. Welfare and socalist programs drive out the capitalist push since it gives an unfair advantage to those that use (or lack of use) them. The hard worker and middle class gets crushed in the press against those with old wealth (The rich get richer) and those on assistance (the poor loafing around and coasting rather than utilizing it to speed run to the top) When you can get a grant for your gender studies so the collage  jacks up the cost of it to $80,000 to grift off the govt handout, pay $60/mo rent and get $4000/mo in food stamps it obliterates anyone in the middle class from even having a chance. Toss in DEI quotas and you're really fucked. You either can't get into the program because it's full up or you can't afford it. permalink parent award report block reply CryingBanshee 4 points 4 days ago Regardless of you GI benefits, I would bet you were told throughout your entire k-12 schooling that you should go to college, and student loans were a tool to get through college, and that student loans would pay themselves back when you got a great job after college.\nThat you didnt graduate from debt is great, but my point was that going to college come hell or high debt was ingrained in us from a young age through school and society, decades before Obama was a politician. permalink parent award report block reply deleted 3 points 4 days ago view 1 more comments... HockeyMom4Trump 0 points 4 days ago Your username is fitting. Cryingbanshee. I am seeing a lot of whining from you. I have two sons. Both attended college. One is still there. Another graduated law school. No debt. They have worked their asses off. There are ways to attend school and not take out loans. If you did this, perhaps instead of whining, figure out how to get a job and start paying back your debt. No one forced you to do anything. permalink parent award report block reply view 1 more comments... Saltyminer11 4 points 4 days ago The colleges and universities started going after every breathing human to go to college. Lowering standards and accepting people who really had no business going past high school. The money got easier so they lowered the standards. Whether one agrees or not, not everyone is college material. permalink parent award report block reply Aquamine-Amarine 2 points 4 days ago I agree with you, I was born in the 90's. The schools, teachers, parents, etc. have been pushing this stuff onto impressionable kids for a long time. Kids don't know any better, they don't understand the huge amount of debt they're taking on. They want to trust what the adults around them are saying because surely they wouldn't lie to them, right? Except they WERE lied to. College ended up not being worth it for some people. permalink parent award report block reply RuprechtThaMonkeyBoy 1 points 4 days ago You’re the exception, not the rule. Being born in the early eighties, plus having parents with the values you described definitely put you on firm footing. To be fair the start of college degree inflation originated under the Bush Jr. administration, when the utilization of GI Bill benefits  fattened the wallets of our Universities. Like anything else in life where the government is a large customer, prices go up. Back in 2008, Tulane Freeman School of business was offering an Executive MBA for $55k. It’s now $100k. While seriously inflated, you could still pay that off in a reasonable time based upon the doors it would open. A masters degree in social work at the same tuition? Best of luck. The dumb degree part came later when the Obama’s pushed for woke liberal arts degrees over STEM-focused ones. permalink parent award report block reply BoltCarrierGroup 1 points 4 days ago GI bill recipients are a tiny fraction of any of the money colleges receive. Only half of veterans even use a portion of their GI bill. But less than a fifth of veterans have a Bachelor's degree so it shows most don’t use the entire benefit, just a portion. Student loans are what drove government inflation of tuition, not the GI bill. GI bill has been around since ww2 permalink parent award report block reply load 5 more comments... ViagraFalls 15 points 4 days ago That was the boomer message to the youth. Go to college. It’s the most wonderful thing in the world. permalink parent award report block reply Klaus73 6 points 4 days ago It is if you bothered to go into a productive field. Learning on the job is great; but your seniors get busy and likely don't have the time to teach you the finer points of structural engineering or architecture which can cost lives when a novice fucks up. The problem is that folks opened and branched into useless fields and when they realized there were no jobs for that field...they MADE jobs by teaching the dead end to others. permalink parent award report block reply ViagraFalls 1 points 4 days ago You forgot any more legitimate fields but they shipped the jobs somewhere else or bright in H1-B holders. You didn’t mention the correlation offered as causation. People with college degrees make more money in their lifetimes even if it’s basket weaving. School and work success are tied to intelligence and conscientiousness. College can be 4 years or more and $10s of thousands of dollars just to try showing you have more conscientious and maybe intelligence. permalink parent award report block reply PatriotSkorzeny 1 points 4 days ago Egyptology. permalink parent award report block reply Klaus73 1 points 4 days ago Perfect example - really all colleges should be required to show job stats for every occupation. permalink parent award report block reply MyNameIsTaxpayer 2 points 4 days ago Boomers propping up that self-esteem permalink parent award report block reply Smurfection 11 points 4 days ago I think this is true and very real.  For most of our lived American history, Boomers have been been the more numerous generational cohort and because of their numbers, they've never had to really struggle other than finding a new job or being drafted for the Vietnam War.  Nixon ended the draft. That generation has never known how to save or every experienced a situation where money didn't grow on trees and they got the inheritance from the Greatest Generation in more ways than one. Thus, they have no idea how misled and taken advantage of the millennials and Gen Z are.  Heck, they don't even admit the substance abuse problem, gang problem and single parent problem smacked Gen X right in the face, because the Boomers caused the sexual revolution, the proliferation of narcotics and education is the answer (that is, college) as the solution to every problem. They however went to public school went it actually taught real subjects.  College was pretty cheap up until the 1980's.  It was somewhere along that time that government started backing student loans and as the amount being backed rose, the colleges just increased tuition.  At the same time, colleges got more irrelevant and stupid along with public education.  They started teaching more and more Marxist trash and less and less of real subjects.   I think it was explained in something I read that colleges needed to hire more female professors because Boomers were insisting on equal rights for women but there weren't enough actual academic women who could teach actual academic subjects, so they started hiring women to teach Gender Theory and women studies.  This eventually morphed into gay studies, Queer studies, black studies etc.   These aren't real studies and they aren't academic.  They're marxist propaganda and there's literally no dissent among \"scholars\" who teach these studies.  It's almost pure propaganda.   In time, the political propaganda that came from the \"studies\" departments took over academia wholesale and now we're living in \"math is racist\" times. The average student walks out of college with $100 K in student loans, very little prospects for a good job and a degree in something that relies on being hired or subsidies by the government such as social work, any political marxist things, gender theory, etc. I've been hoping for this repudiation of Boomers my whole life.  I always thought, as  a Gen X woman, the moment Boomers didn't have all the clout anymore, there was going to be a seismic change in our politics.  What boomers took as unquestioned principles were going to be challenged and crash and burn.  Boomer may have been young and optimistic when they started their revolution, but they didn't accomplish anything but screw up life for everyone generation after them while claiming they were the young generation while into the 60's and 70's.  A lot of them still think they're hip and cool. The sad fact is Gen X pretty much knows this but the reality is Gen X can't do anything about fixing the problem the right way because thanks to the pill and abortion and the myth of overpopulation, Gen X has been decimated and is too small a cohort to ever really gain political clout.  It's got to come down to Gen X convincing MIllennials not to become socialists and communists. permalink award report block reply Wearyman 7 points 4 days ago Fellow Gen X here.  You hit the nail on the head.  Boomers really don't get it.  With only a few exceptions, as a cohort their entire lives they had it almost embarrassingly easy.  Despite that they embraced Communism and Socialism writ large as well as Abortion and every other leftist bullshit philosophy and through that utterly destroyed GenX physically (Through the murder of more than half our numbers) and nearly economically, by not passing on the economies and the wealth that was passed to them by the Greatest and Silent generations. GenX understands the suffering of the Z's and even the late Millennials.  We know, because we suffered at the hands of Boomers too, just in a different way.  But we are so small as a cohort we can't do anything about it. permalink parent award report block reply Smurfection 1 points 4 days ago Exactly right.  Boomers thought they'd be honored as the greatest generation even more than the greatest generations but in reality, they are the absolute worse generation since the antebellum days before the Civil War. permalink parent award report block reply mav7579 -1 points 4 days ago Why do you throw all boomer in one category?  The majority of boomers are not upper class or even upper middle class.  Most of them are working class (or lower) and experienced many difficulties.  Many boomers started with nothing.  When they were starting out, they  were hit with the 70 stagflation followed by a nasty recession in the early 80s.  There were numerous recessions after that (late 80s, early 90s, early 00s, and the big one (2008).  Perhaps boomers with money lucked out. permalink parent award report block reply mav7579 3 points 4 days ago Like the average rank and file boomer had any clout to change anything.  Append the word \"elites\" after each mention of boomer and your post makes more sense. permalink parent award report block reply Smurfection 1 points 4 days ago it wasn't elitist boomers that burned their bras and went around saying the only difference between men and women is genitals.  It was boomer women en masse.  The same ones that pushed for no-fault divorce, family courts that are way too friendly to mothers that break up families.  It was both men and women who shacked up and said \"marriage is just a peace of paper\".  Shacking up was rare and almost unheard of before Boomers decided \"marriage is a piece of paper\" and now, almost all couples shack up.  Due to the inherent instability in shacking up, the postpones marriages and having children.  Whereas a first child born to a woman historically is between 18 and 22, it's now being pushed out to age 30 and older. It's boomers that started with the push to legalize drugs, laughed at people who said the gang problem was a real problem and it was boomers that glorified and apologized for gang culture from 2LiveCrew right on up to the LA riots. Bill Clinton wasn't an elitist when as a the son of a single mom from Arkansas, he dodged the draft and told the draft official he \"Loathed the military\".   Obama wasn't an elitist when he arrived at Occidental and decided he would make friends with only communists and socialists. Hillary wasn't an elitist when she befriended Saul Alinsky. permalink parent award report block reply mav7579 1 points 3 days ago It was boomer women en masse. Ok so it's boomer women.  Why blame the hard working men that were victims of no-fault divorce? BTW those guys did become elitists. permalink parent award report block reply Smurfection 2 points 2 days ago umm, no.  IT's was boomer men that decided they shouldn't be alcholics like their dads and instead became junkies, then alcoholics.  They started yelling that pornography was a constitutional right under \"Freedom of speech\" and then decided they need to \"test a car out on a drive before they buy it\" but left hoardes of children with loose women and walked out on their obligations. The men stopped being sober, responsible men which is what made women decide they could \"bring home the bacon and fry and it up in a pan\". Both sexes and genders of the Boomer generation failed miserably in every way and only ever looked at their own creature comforts and now in their old age, they think they've earned the respect of younger generations.  Just because they spat, ,squashed, rejected and turned their backs on their parents, the greatest and silent generations until they were thirty five years old and then started lauding them as the best thing since sliced bread, they think they should be understood and lauded now.  Bullshit!  As a generation, boomers were selfish brats that had everything great about western civiliation handed to them on a silver platter and decide to exchange it for dung worshipping gurus, nonsense books and ubiquitous porn. permalink parent award report block reply view 2 more comments... flashersenpai -1 points 4 days ago do they vote or not? are they glued to cable news or not? permalink parent award report block reply RedStoneDeepState -1 points 4 days ago they've never had to really struggle other than finding a new job or being drafted for the Vietnam War ...stagflation was a fucking bitch. I have it better than Boomers as Gen Z - you fuckers are just lazy The average student walks out of college with $100 K in student loans Average student loan debt is $38,290. If I graduated college like that with no equity at 22 like a \"normal person\" I would still have a net worth of about 300k right now at 26. I am at about 2.5 million though at 26, despite the fact that I came from a single father household that was paycheck to paycheck. permalink parent award report block reply Smurfection 1 points 4 days ago You've done well for yourself.  I took the $100,000 number for the entire amount of debt my nieces and nephews had respectively after college. I'm not a boomer.  I'm Gen X. so do you think there isn't a debt crisis with Gen Z and buying a home is affordable?   My Gen Z kids don't think it's affordable for most Gen Z. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago so do you think there isn't a debt crisis with Gen Z and buying a home is affordable? Not really. That is my net worth - real estate. I have 5 quadplexes and for each unit they rent for about 720 a month. Each quadplex cost something between 300k and 400k each. I have a house in Camden Arkansas renting for 650 a month. 15k + 30k in rennovations. I have my house in Huntsville I live in. 95k. I have 3 pieces of land, one in Colorado, one in Arkansas and one in Alabama - 75 acres in total. There is a condo in Ulaanbaatar Mongolia that rents for $650 USD a month. With our jobs I make 137k, my wife makes 86k. Granted I started working at 15 and put most of my money into hard assets. Guns. Then I took my collection down from ~300 to 60. That was my seed money for real estate investing. Granted we are both engineers in the city with the most engineers per capita in the country. permalink parent award report block reply MySidesGoUp 8 points 4 days ago The same Thiel running around praising the antichrist awakening… permalink award report block reply Nellie_the_Beaut 3 points 4 days ago And bought himself and his “husband” New Zealand citizenship and has a huge land parcel with bunker there, along with all the other uber wealthy swells, for the “end times”? permalink parent award report block reply Klaus73 7 points 4 days ago ..and so Peter Thiel helped build socialisms control mechanisms..Paypal and Palantir are cornerstones of a socialist society where everything is managed and controlled by centralized power. permalink award report block reply Dangerous 5 points 4 days ago The struggle that the Japanese entertainment industry has had with payment processors for the last year proves this. They can shut down any transaction they want at any time for the most disagreeable of reasons and even entire nations can't do anything about it in a timely fashion permalink parent award report block reply Klaus73 1 points 4 days ago Yeeeeep. But hey he gave Trump money so...nothing to see here. Folks are boned. permalink parent award report block reply guywholikesDjtof2024 6 points 4 days ago This is a neutral statement anyone can make. Thieeeel is trying to get us to be in a technocratic EatZeBugz spy dystopia. Soros and gates sure do. We must not allow it ever. RICO palantir, its funders, powerful people, its employees, the whole works. permalink award report block reply DeplorableNeandertal 3 points 4 days ago I agree with you but how thin can maga be spread before it’s diluted to nothing. We are practically already there, the shutdown has totally derailed the administration. And now the left has carefully constructed sound bites and clickbait to turn the EBT Americans and the youfs totally against us. On top of the already existing Israel fatigue I don’t know how Trump can recover. Maybe this end the filibuster rhetoric will hop off the headline and into reality but I doubt it. permalink parent award report block reply Klaus73 1 points 4 days ago Your not wrong. Its not just the left though that is trying to craft a narrative and even now when the right lies to its own base rather then simply facing the music it only emboldens the left not to let up - because every time the right lies the left will put it on blast everywhere and it bolsters their numbers. Trump is burning through political capital and is trying tp end the fillibuster because he has pretty much ruined any chance of good will with past decisions; he didn't seek out the more level headed democrats - instead he just chose to ignore them even though they still represent his people (Americans) and without the fillibuster its only a matter of time before some of the more fair-weather republicans (RINOS) see the opportunity to get rid of him; and if the midterms go poorly they will and if Trump persists trying to gaslight folks that the tough times that were expected in enacting his goals are not that bad; people are going to call bullshit and go to people offering a lie that seems better. I worry Trump isn't driving; his own admin is running itself and just letting him say shit; the project 2025 types don't always align with MAGA and don't always align with America; they'll let Trump burn for their own goals. Folks need to have a hard talk and the government needs to acknowledge the how and why rather then pretending otherwise. Both sides are talking out of both sides of their mouth like with this SNAP shit and really its going to cost the republicans whatever they gained. permalink parent award report block reply sleepinggiant 6 points 4 days ago Guess 92% of productivity gains over the past 40 years shouldnt have gone to corporations permalink award report block reply doodaddy 5 points 4 days ago Are we trying to frame Thiel, and especially Zuck and Andreessen as robber barons with hearts of gold?  These guys would kill their own mother for a dollar. permalink award report block reply CleanUpPhillyTrump24 4 points 4 days ago I would put Tiny Houses or modular/pre fab ADUs on my small vacant lots if ONLY THE CITY WOULD LET ME. That would mean I could rent them for half to three quarters the going average rent in that zip code, which is fine. I'd just plan to do two instead of one. That would be a whole new business model for me. BUT THE CITY WILL NOT ALLOW IT. These are very high end, lux little structures. They're just small. It would allow me to create side yards, front yards, back yards, out of the remainder of the tiny lot. These would be charming, sought after solutions to living in the city. BUT THE DEMS HERE REFUSE TO LET BUILDERS BUILD PRIVATE AFFORDABLE HOUSING. The reason for this high rent and partly the reason for high home prices is that too many cities that have potential for more housing stock just prevent new construction so that Trump voters won't move in. Blue city Dems ONLY want welfare cases to live in Philly. Anyone else risks their monopoly. I have vacant lots that are so small that I have to get variances to go higher, build taller. To replace the house that was there with the exact dimensions is not most of the time feasible on cost. It costs as much or more to build new as it was. You won't get more than you spend. But to build by right on property you own, the city won't let you adapt without going through a long expensive process requiring architects, lawyers. Philly had affordable housing built by the private market when the city allowed builders to build it. But Dems only want to be able to hand property they seize to their donors who get \"community development block grants\" that build non-property tax paying public housing that is a blight on the city. permalink award report block reply grannylovestrump 4 points 4 days ago and the worst part they don't understand is the commies are intentiionally crashing the economy to usher it in so they blame us when it is the commies and now they will bow down to their oppressors and what they thought was bad will now get worst. My children perish for lack of knowledge permalink award report block reply LORDFALCONE 3 points 4 days ago Is this the gay Jew who has exclusive satanic parties at Dracula's castle on Halloween every year? permalink award report block reply HankScorpio 3 points 4 days ago The Reptile. permalink award report block reply mav7579 3 points 4 days ago Isn't that JD Vance's guy? permalink award report block reply True_Curmudgeon 3 points 4 days ago I hate having these conversations in the context of keeping our Globalist central bank and those it serves around permalink award report block reply Creepy_Joe 3 points 4 days ago If you dumb ass boomers can't figure out why your kids hate you when they are riddled with $500,000 in debt before their first real job, while the average house costs $400,000, and they are being called lazy by you boomer assholes who paid $500 for your degree, and bought your first home for $5,000 and a six pack of Bud Light, then you're the problem. permalink award report block reply carbonsteel 2 points 4 days ago Here is a simple answer  0% interest student loans …. That’s it . Allow everyone to roll over existing loans into permalink award report block reply YearninNation 2 points 4 days ago How about addressing usury, compound interest, mandatory insurance. and income tax? permalink award report block reply DustyGoose 2 points 4 days ago This makes sense, but I was told Thiel was the antichrist? permalink award report block reply jsphere256 2 points 4 days ago Who is taking their capital? permalink award report block reply Yignuced 2 points 4 days ago I don’t understand this at all.  How do they not have a stake in the capitalist system?  Everyone has a stake.  Peter Theil and others are putting that thought in the heads of young people, IMO.  “You don’t have a stake because boomers and billionaires ruined our economy and horde money from you.  Communism will level the playing field”.  Peter Theil is gay and so is this theory. permalink award report block reply henri_derelicte 2 points 4 days ago We need to be mindful of the semantics of “affordable housing.” Housing should be affordable in the sense that the average person can buy it. When leftists refer to affordable housing, they typically mean something government-mandated for people below a certain income level. I hate seeing the YIMBY types because they think upzoning is the only solution to our problems. In reality, it allows governments to get more people and more tax revenue without solving the underlying problems (namely crime) of certain neighborhoods. Deal with the crime problems and there will be large swaths of housing that is affordable for people to purchase permalink award report block reply gunzby 2 points 4 days ago All you need is a pied piper to convince the dumb masses that they'll get everything for nothing and they will dutifully line up not knowing they will get nothing and it'll cost them everything. permalink award report block reply MegoThor 2 points 4 days ago That’s a feature, not a bug. permalink award report block reply Awakened 1 points 4 days ago No shit. End immigration and then welfare and everything is fixed. Won't happen though. Globalization is here. Trump is spending more time on overseas problems than home. permalink award report block reply Magaman4200 1 points 4 days ago Valid concerns - supply and demand issues can be resolved through deporting illegals permalink award report block reply LordCommissarYarrick 1 points 4 days ago People and corporations buying up multiple homes sure don't help anything. There should be a limit to how many houses one can buy. permalink award report block reply Obambi 1 points 4 days ago He’s right about the student debt crisis. Trump doesn’t understand that his own GOP wants him to go after student loan debt people to never get that young college people ever. That’s why they killed Kirk, he was getting the young folks. permalink award report block reply DITTOPatriot 1 points 4 days ago The administration hasn't even reached Biden levels of deportation. The border is better for sure, but that was the easy fix. permalink award report block reply Liberats 1 points 4 days ago There is a reason. They are stupid. permalink award report block reply Saltyminer11 1 points 4 days ago And the fact they are being propagandised into it. permalink award report block reply gb1787 1 points 4 days ago Wait till these retards find out what stake they get in a socialist system permalink award report block reply henri_derelicte 1 points 4 days ago The reason people want socialism is because they think they’ll be subsidized. Look at how things are going in the UK. Who’s really getting subsidized? Not regular White Britons. It’s the Somalis (only 10% of them have a full time job) getting subsidized. permalink parent award report block reply RedCalifornia 1 points 4 days ago By design. permalink award report block reply Papabravo12 1 points 4 days ago To me it’s mostly about education. We don’t actually teach anyone history from a pro American perspective anymore. Yes, the economic factors are what making communism appealing and the desire to burn it all down, but it doesn’t help that we teach the young people that it’s just as good of a system (even though it’s never worked) and doesn’t kill people, white American men do permalink award report block reply FusionBlack 1 points 4 days ago Most of our ills sprout from the pampered expected lifestyles people \"demand\". Just look at the response to the SNAP cut backs. Generations now making it a lifestyle . Four kids from different breeders and the country is made to support the bad decisions of these \"victims\" as portrayed by the media. Everyone Demands a new home ,food, healthcare and a basic income even illegals and the vermin legal citizens that support them.\nI didn't ask for any help when I was destitute . I worked 2 jobs and survived on $20 a week for food. The day old bread store was a staple. If we ever had a large downturn in the economy or God forbid a war the violence would be unfathomable. Maybe its needed for a course corrector. permalink award report block reply 2016TrumpMAGA 1 points 4 days ago I blame it all on student loans. You cannot enslave young people with tens of thousands of dollars in debt, requiring them to make thousand dollar a month payments through their twenties and early thirties and expect them to be able to start families and buy homes. Average student loan debt is almost $40,000.  If you graduated at age 22 with $40,000 in student loan debt, you pay $470/month until you are 32 to pay it off.  That is ridiculous. The average student loan debt for graduate school is about $88,220.  That's $1025/month, PLUS $470/month.  For a doctorate it's $250,000.  $2900/month. None of which has a hope in hell of being repaid because some fucking jeet with a fake degree he paid $1000 for will hire other fucking jeets with fake degrees. Student loans need to end NOW, the interest rate on outstanding balances lowered to zero, discharge in bankruptcy permitted, and repayment implemented by payroll deductions over the next 30 years (a $50,000 student loan with zero interest paid off over the next 30 years is only $138/month) with tax benefits for early payoff. permalink award report block reply DenturesNancy 1 points 4 days ago one must also factors in that our elected officials swear allegiance to Israel and Israel only, leaving Americans homeless and without care.  protecting Israel's genociding people around it has pushed everyone including myself into siding with the oppressed.  Israel is rich, powerful and does not need our taxpayers money to have free Healthcare, free college, and free universal welfare.  I want my tax money to stay in the US and help OUR people first.  Trump's approval has gone way down and the Republicunts are in free fall.  I don't want to keep voting republican just because, and I don't want to vote for the demons.  where does that leave me?  not vote at all?  Trump and the GOP must think very hard about answering the above questions, because come 2026 and 2028, if those are not answered, people will just sit it out or decide to just vote democrap to speed up the downfall.  I tired of being played around with at every election just to see the person I voted for make backroom deals or declare that helping Israel is commanded by God. permalink award report block reply GottaSitStand 1 points 4 days ago We need merit-based immigration, not a lottery. With quotas (zero) for hostile countries and fewer restrictions, with no cap on visitors from Poland, and even a simple migration process for Polish people. There is value in having great companies formed here in the USA, but we need more people coming here who are culturally similar to European Americans and share our values. permalink award report block reply jonnyuno 1 points 4 days ago Again, blue hellholes voted for communists. What is this a surprise?    Also, yes deporting all, including Mamdani will also resolve the problem more quickly. permalink award report block reply bagel_fragility 1 points 4 days ago unchecked usury leads to communism permalink award report block reply citydwellertrumpfan 1 points 4 days ago He is right. One of Thiels interesting ideas is seasteading. Living on floating platforms just offshore. This could increase freedom. https://en.wikipedia.org/wiki/Seasteading permalink award report block reply 5DchessWatch 1 points 4 days ago Damn son, that hits a least one big nail on the head. permalink award report block reply HockeyMom4Trump 1 points 4 days ago It’s sort of always been this way. Always a socialist until you get a job and start making your own money. Stop buying so much shit. Live within your means. No one needs a $45 water bottle and an expensive car payment. People have lost their minds to consumerism. No one needs a $34.95 apple slicer from William Sonoma. For years we’ve plucked apples from trees and eaten them simply by taking a bite. permalink award report block reply mav7579 0 points 4 days ago This\nPeople worry too much about impressing others.\nWant the standard of living of someone who started out in the 50s?  Buy the housing and vehicles like they did and go easy on the modern day luxuries. permalink parent award report block reply the_new_one 7 points 4 days ago Comment removed upon the user being banned. permalink award report block reply tholinz 7 points 4 days ago Yes but socialism is only going to make all of this worse. permalink parent award report block reply joggin_noggin 4 points 4 days ago If your savings account has $5 in it when payday rolls around, you don't really care about worse because you can't conceptualize being forced at gunpoint to go work in the mines or the fields as a realistic consequence of voting for socialism. permalink parent award report block reply HockeyMom4Trump -5 points 4 days ago No one seems to understand that when you are young, everything is expensive! It’s called starting out. My parents struggled. My grandparents struggled. When you look at life compared to life, young people today have it pretty damn good. My mom and dad had to work their asses off. My dad worked three jobs and was never home when he was young. He worked his day job. Came home, ate a quick dinner (no Door Dash) and then he went and worked mopping floors and cleaning buildings. Then on the weekend he had another job, Every young person sees years and years of struggle and hard work and assumes that came easy. Oh look, grandma and grandpa have a nice house and boat! Waahhh! I have to work. Meanwhile, that took years for grandpa and grandma to earn and build. Every old person I know had a rougher time than the young people I know today. Much rougher. permalink parent award report block reply MasterChief 6 points 4 days ago Pick yerself up by the bootstraps, walk right in to the CEO's office give them a firm handshake and a smile and ask them \"when do I start?\" These young whipper snappers are just so lazy, and have never experienced hardship! They have no idea how bad we had it! permalink parent award report block reply Dangerous 3 points 4 days ago Then they can all continue to get by without forcing the young to pay for medicaid and other socialist government programs. After all, why destroy the young with the burden of socialism if you hate socialism so much? permalink parent award report block reply TheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nmilitantnationalist6 112 points 4 days ago He’s right but all this is fixed through mass deportations. And it’s funny because the left has never met a third worlder that they didn’t want to import which only makes these problems worse. permalink award report block reply Bigstick7 44 points 4 days ago Mass deportations and a fixing if a lot of our systems the government has corrupted. Student loans are one of them, government should be out of them. Shackling kids with debt before they are smart enough to understand the consequences. No you should have to walk into a bank like anyone else asking for a loan and ask for money and give the case as why they should and how you will pay it back. Going to be a kindergarten teacher asking to go borrow for an Ivy League school, denied here's 20k go community college. Instead we have the government handing out loans basically unfettered to anyone for anything even if they don't have a prayer of paying them back. What happened the cost of college has exploded. permalink parent award report block reply LordKuroTheGreat 24 points 4 days ago And not only do they not have the life experience to understand the consequences (by design, since schools keep them immature on purpose), but they usually have every adult in their life telling them it's the only way forward and that they're trash and failures if they don't. permalink parent award report block reply that1guy1981 6 points 4 days ago Mass deportation needs to deport 10M to even blunt the housing affordability.  20M would correct it.  Were at close to 1M with the estimated self deportations? permalink parent award report block reply CleanUpPhillyTrump24 5 points 4 days ago 1.5 self deportations, 600K assisted deportations. permalink parent award report block reply Nibba2 9 points 4 days ago If the loans could be defaulted on, also make the colleges responsible for the debt. If they believe they are doing quality work then certainly they would have confidence in their students success. I bet a lot more vetting and scrutiny would happen. Cost of college would go down. But instead people have it on their backs for life. Too many dirtbags guiding the impressionable into worthless directions too. They know what they are doing to. permalink parent award report block reply Axiom502 8 points 4 days ago Default is one thing. Perpetual indentured servitude to fund commie think tanks is another. Most responsible graduates are making their payments but can never escape the crushing total debt and the monthly payments eliminate their ability to invest and buy into the economy. permalink parent award report block reply N14205ST205 3 points 4 days ago They also need to make student loans dischargeable in bankruptcy. It's why the debt just keeps accumulating for many. They literally don't have an option to reset from a clean slate. Also, the government getting so involved in the student loan business was a catastrophic mistake. Someone has to pay for the whole thing- the government's not a charity. permalink parent award report block reply GorillaTactics 1 points 4 days ago Just have a plan for some entirely predictable consequences. For instance, every doctor, upon completing medical school, will declare bankruptcy and discharge those loans as part of a standard new doctor financial plan. Considering how long it takes them to get through residency getting paid poverty wages, and start actually making money, they will suffer little from the hit on their credit before it drops off their score. permalink parent award report block reply Nibba2 2 points 4 days ago Yeah. There isn’t a very good answer to it all. permalink parent award report block reply view 1 more comments... Bigstick7 1 points 4 days ago I agree over 800 billion in endowments throughout all these colleges. Use these for defaulted loans. permalink parent award report block reply Unboosted 2 points 4 days ago They dont teach kids how to manage money in school anymore. They dont teach them how to bank, budget, save, write a check. Nothing. permalink parent award report block reply Bigstick7 2 points 4 days ago Accounting and economics should be a requirement in highschool. permalink parent award report block reply Viewer01 -1 points 4 days ago It’s never going to happen. Balancing the budget will crash the economy. You can’t vaporize 2 trillion in spending and not crush your gdp and put a lot of people out of work. I’m not saying I agree with it. I’m just explaining why none of what you suggest will ever happen permalink parent award report block reply KernalMustard 5 points 4 days ago Sometimes you have to break a few eggs to make a omelette. permalink parent award report block reply CleanUpPhillyTrump24 2 points 4 days ago They're replacing gov spending with private investment. It's working. permalink parent award report block reply XxxRDTPRNxxX 10 points 4 days ago And ban corporations from renting more than 10 homes unless they build those homes from scratch. Start inflating the supply too! A house is supposed to be a place to live, not an investment that gets you rich as you age. permalink parent award report block reply Viewer01 15 points 4 days ago Ban them from owning single family altogether. If mom and pop want to retire and rent their house out fine. Fuck off with black stone paying cash for a neighborhood. permalink parent award report block reply booblitchutz 8 points 4 days ago No, a house is an asset, as well. I agree the values have been grossly inflated to enrich banks. permalink parent award report block reply Unboosted 2 points 4 days ago Property taxes are high to enrich the bankrupt democratic party. 2026 is our time to show our power and not pay taxes. File an extension at least and watch what happens. We all need to say \"no taxation without representation no taxes for slush funds, no taxes for 3rd worlders, no taxes in 2026.\" permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago A car is an asset too. That doesn't mean only boomers should get to drive, just so they can sell their car for 10x what they paid for it. permalink parent award report block reply YearninNation 2 points 4 days ago How about addressing usury, compound interest, mandatory insurance. and income tax? permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago What about people who say what about whataboutism? What about them? permalink parent award report block reply YearninNation 1 points 3 days ago What about them? permalink parent award report block reply Bboop 2 points 4 days ago Yes this exactly!! permalink parent award report block reply RedStoneDeepState -9 points 4 days ago \"just become a communist shithole to fight communism\" permalink parent award report block reply CPT88 1 points 4 days ago Thats not enough. What you need is no corporations, trusts or foreigners to own residential property. An individual person can own no more than 4 properties. 2 exceptions: If you build a new property these rules don't count for 35 years. This way BTR companies can operate and encourage building over rent seeking. Charitable housing. Rent must be 50% or less than market. Penalty for fraud around this is loss of the property. Ultimately homes can be good for people, or good for investors. Society needs to get priorities straight here. In the same vein we need to remove property tax on residential and I'd do something similar with farms. We need to stop investment groups living in the city owning all the farmland and ensure families can own and run these things. permalink parent award report block reply load 9 more comments... labajada 4 points 4 days ago The \"guaranteed\" student loan administration scam was happening long before the active destruction of western freedom. back in the pit, slave! permalink parent award report block reply HuggableBear 4 points 4 days ago People under 35 - 40 years old literally don't remember a time when America was American. Y'all don't realize, this is not fixable. Revolution is inevitable. permalink parent award report block reply CommonSenseAmerican 1 points 4 days ago My generation is probably the last that finds most teenagers and younger adults not the least bit threatening and very pussylike, they have big mouths but that is about it. I blame it on being raised with cellphones and online interactions with friends, instead of meaningful IRL interactions. permalink parent award report block reply HuggableBear 2 points 3 days ago They aren't very threatening. They are indeed pussies. And it is for exactly the reasons you laid out. What happens to this country when you're 80 and those pussies are 45? permalink parent award report block reply CommonSenseAmerican 1 points 3 days ago Hopefully they become wiser with time and forget the idiotic socialist shit, and begin to see things from a taxpayer perspective. Multiple generations of spoiled children really doesn't make the future look great however they are easily amused by tiktok. permalink parent award report block reply BooKoo 2 points 4 days ago Obama was the \"Deporter in Chief\" soooo why aren't we all driving Lambos now? permalink parent award report block reply militantnationalist6 1 points 4 days ago Look, I’m sure we’re on the same side, but it’s hard for me to imagine that there’s somebody this stupid how many total people did he deport compared to how many illegals there are would you consider that Obama did mass deportations ? Because I don’t. And this is even before we talk about the treason that was committed by the Biden regime. permalink parent award report block reply BooKoo 1 points 4 days ago how do you define \"mass\"?\nGoing off the pure numbers he deported more than this current administration so far and also more than the previous Trump administration did during its four years. I mean just look it up I'm not pulling it out of my ass. permalink parent award report block reply load 47 more comments...\nBigstick7 44 points 4 days ago Mass deportations and a fixing if a lot of our systems the government has corrupted. Student loans are one of them, government should be out of them. Shackling kids with debt before they are smart enough to understand the consequences. No you should have to walk into a bank like anyone else asking for a loan and ask for money and give the case as why they should and how you will pay it back. Going to be a kindergarten teacher asking to go borrow for an Ivy League school, denied here's 20k go community college. Instead we have the government handing out loans basically unfettered to anyone for anything even if they don't have a prayer of paying them back. What happened the cost of college has exploded. permalink parent award report block reply LordKuroTheGreat 24 points 4 days ago And not only do they not have the life experience to understand the consequences (by design, since schools keep them immature on purpose), but they usually have every adult in their life telling them it's the only way forward and that they're trash and failures if they don't. permalink parent award report block reply that1guy1981 6 points 4 days ago Mass deportation needs to deport 10M to even blunt the housing affordability.  20M would correct it.  Were at close to 1M with the estimated self deportations? permalink parent award report block reply CleanUpPhillyTrump24 5 points 4 days ago 1.5 self deportations, 600K assisted deportations. permalink parent award report block reply Nibba2 9 points 4 days ago If the loans could be defaulted on, also make the colleges responsible for the debt. If they believe they are doing quality work then certainly they would have confidence in their students success. I bet a lot more vetting and scrutiny would happen. Cost of college would go down. But instead people have it on their backs for life. Too many dirtbags guiding the impressionable into worthless directions too. They know what they are doing to. permalink parent award report block reply Axiom502 8 points 4 days ago Default is one thing. Perpetual indentured servitude to fund commie think tanks is another. Most responsible graduates are making their payments but can never escape the crushing total debt and the monthly payments eliminate their ability to invest and buy into the economy. permalink parent award report block reply N14205ST205 3 points 4 days ago They also need to make student loans dischargeable in bankruptcy. It's why the debt just keeps accumulating for many. They literally don't have an option to reset from a clean slate. Also, the government getting so involved in the student loan business was a catastrophic mistake. Someone has to pay for the whole thing- the government's not a charity. permalink parent award report block reply GorillaTactics 1 points 4 days ago Just have a plan for some entirely predictable consequences. For instance, every doctor, upon completing medical school, will declare bankruptcy and discharge those loans as part of a standard new doctor financial plan. Considering how long it takes them to get through residency getting paid poverty wages, and start actually making money, they will suffer little from the hit on their credit before it drops off their score. permalink parent award report block reply Nibba2 2 points 4 days ago Yeah. There isn’t a very good answer to it all. permalink parent award report block reply view 1 more comments... Bigstick7 1 points 4 days ago I agree over 800 billion in endowments throughout all these colleges. Use these for defaulted loans. permalink parent award report block reply Unboosted 2 points 4 days ago They dont teach kids how to manage money in school anymore. They dont teach them how to bank, budget, save, write a check. Nothing. permalink parent award report block reply Bigstick7 2 points 4 days ago Accounting and economics should be a requirement in highschool. permalink parent award report block reply Viewer01 -1 points 4 days ago It’s never going to happen. Balancing the budget will crash the economy. You can’t vaporize 2 trillion in spending and not crush your gdp and put a lot of people out of work. I’m not saying I agree with it. I’m just explaining why none of what you suggest will ever happen permalink parent award report block reply KernalMustard 5 points 4 days ago Sometimes you have to break a few eggs to make a omelette. permalink parent award report block reply CleanUpPhillyTrump24 2 points 4 days ago They're replacing gov spending with private investment. It's working. permalink parent award report block reply\nLordKuroTheGreat 24 points 4 days ago And not only do they not have the life experience to understand the consequences (by design, since schools keep them immature on purpose), but they usually have every adult in their life telling them it's the only way forward and that they're trash and failures if they don't. permalink parent award report block reply that1guy1981 6 points 4 days ago Mass deportation needs to deport 10M to even blunt the housing affordability.  20M would correct it.  Were at close to 1M with the estimated self deportations? permalink parent award report block reply CleanUpPhillyTrump24 5 points 4 days ago 1.5 self deportations, 600K assisted deportations. permalink parent award report block reply\nthat1guy1981 6 points 4 days ago Mass deportation needs to deport 10M to even blunt the housing affordability.  20M would correct it.  Were at close to 1M with the estimated self deportations? permalink parent award report block reply CleanUpPhillyTrump24 5 points 4 days ago 1.5 self deportations, 600K assisted deportations. permalink parent award report block reply\nCleanUpPhillyTrump24 5 points 4 days ago 1.5 self deportations, 600K assisted deportations. permalink parent award report block reply\nNibba2 9 points 4 days ago If the loans could be defaulted on, also make the colleges responsible for the debt. If they believe they are doing quality work then certainly they would have confidence in their students success. I bet a lot more vetting and scrutiny would happen. Cost of college would go down. But instead people have it on their backs for life. Too many dirtbags guiding the impressionable into worthless directions too. They know what they are doing to. permalink parent award report block reply Axiom502 8 points 4 days ago Default is one thing. Perpetual indentured servitude to fund commie think tanks is another. Most responsible graduates are making their payments but can never escape the crushing total debt and the monthly payments eliminate their ability to invest and buy into the economy. permalink parent award report block reply N14205ST205 3 points 4 days ago They also need to make student loans dischargeable in bankruptcy. It's why the debt just keeps accumulating for many. They literally don't have an option to reset from a clean slate. Also, the government getting so involved in the student loan business was a catastrophic mistake. Someone has to pay for the whole thing- the government's not a charity. permalink parent award report block reply GorillaTactics 1 points 4 days ago Just have a plan for some entirely predictable consequences. For instance, every doctor, upon completing medical school, will declare bankruptcy and discharge those loans as part of a standard new doctor financial plan. Considering how long it takes them to get through residency getting paid poverty wages, and start actually making money, they will suffer little from the hit on their credit before it drops off their score. permalink parent award report block reply Nibba2 2 points 4 days ago Yeah. There isn’t a very good answer to it all. permalink parent award report block reply view 1 more comments... Bigstick7 1 points 4 days ago I agree over 800 billion in endowments throughout all these colleges. Use these for defaulted loans. permalink parent award report block reply\nAxiom502 8 points 4 days ago Default is one thing. Perpetual indentured servitude to fund commie think tanks is another. Most responsible graduates are making their payments but can never escape the crushing total debt and the monthly payments eliminate their ability to invest and buy into the economy. permalink parent award report block reply\nN14205ST205 3 points 4 days ago They also need to make student loans dischargeable in bankruptcy. It's why the debt just keeps accumulating for many. They literally don't have an option to reset from a clean slate. Also, the government getting so involved in the student loan business was a catastrophic mistake. Someone has to pay for the whole thing- the government's not a charity. permalink parent award report block reply\nGorillaTactics 1 points 4 days ago Just have a plan for some entirely predictable consequences. For instance, every doctor, upon completing medical school, will declare bankruptcy and discharge those loans as part of a standard new doctor financial plan. Considering how long it takes them to get through residency getting paid poverty wages, and start actually making money, they will suffer little from the hit on their credit before it drops off their score. permalink parent award report block reply Nibba2 2 points 4 days ago Yeah. There isn’t a very good answer to it all. permalink parent award report block reply view 1 more comments...\nNibba2 2 points 4 days ago Yeah. There isn’t a very good answer to it all. permalink parent award report block reply view 1 more comments...\nBigstick7 1 points 4 days ago I agree over 800 billion in endowments throughout all these colleges. Use these for defaulted loans. permalink parent award report block reply\nUnboosted 2 points 4 days ago They dont teach kids how to manage money in school anymore. They dont teach them how to bank, budget, save, write a check. Nothing. permalink parent award report block reply Bigstick7 2 points 4 days ago Accounting and economics should be a requirement in highschool. permalink parent award report block reply\nBigstick7 2 points 4 days ago Accounting and economics should be a requirement in highschool. permalink parent award report block reply\nViewer01 -1 points 4 days ago It’s never going to happen. Balancing the budget will crash the economy. You can’t vaporize 2 trillion in spending and not crush your gdp and put a lot of people out of work. I’m not saying I agree with it. I’m just explaining why none of what you suggest will ever happen permalink parent award report block reply KernalMustard 5 points 4 days ago Sometimes you have to break a few eggs to make a omelette. permalink parent award report block reply CleanUpPhillyTrump24 2 points 4 days ago They're replacing gov spending with private investment. It's working. permalink parent award report block reply\nKernalMustard 5 points 4 days ago Sometimes you have to break a few eggs to make a omelette. permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 4 days ago They're replacing gov spending with private investment. It's working. permalink parent award report block reply\nXxxRDTPRNxxX 10 points 4 days ago And ban corporations from renting more than 10 homes unless they build those homes from scratch. Start inflating the supply too! A house is supposed to be a place to live, not an investment that gets you rich as you age. permalink parent award report block reply Viewer01 15 points 4 days ago Ban them from owning single family altogether. If mom and pop want to retire and rent their house out fine. Fuck off with black stone paying cash for a neighborhood. permalink parent award report block reply booblitchutz 8 points 4 days ago No, a house is an asset, as well. I agree the values have been grossly inflated to enrich banks. permalink parent award report block reply Unboosted 2 points 4 days ago Property taxes are high to enrich the bankrupt democratic party. 2026 is our time to show our power and not pay taxes. File an extension at least and watch what happens. We all need to say \"no taxation without representation no taxes for slush funds, no taxes for 3rd worlders, no taxes in 2026.\" permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago A car is an asset too. That doesn't mean only boomers should get to drive, just so they can sell their car for 10x what they paid for it. permalink parent award report block reply YearninNation 2 points 4 days ago How about addressing usury, compound interest, mandatory insurance. and income tax? permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago What about people who say what about whataboutism? What about them? permalink parent award report block reply YearninNation 1 points 3 days ago What about them? permalink parent award report block reply Bboop 2 points 4 days ago Yes this exactly!! permalink parent award report block reply RedStoneDeepState -9 points 4 days ago \"just become a communist shithole to fight communism\" permalink parent award report block reply CPT88 1 points 4 days ago Thats not enough. What you need is no corporations, trusts or foreigners to own residential property. An individual person can own no more than 4 properties. 2 exceptions: If you build a new property these rules don't count for 35 years. This way BTR companies can operate and encourage building over rent seeking. Charitable housing. Rent must be 50% or less than market. Penalty for fraud around this is loss of the property. Ultimately homes can be good for people, or good for investors. Society needs to get priorities straight here. In the same vein we need to remove property tax on residential and I'd do something similar with farms. We need to stop investment groups living in the city owning all the farmland and ensure families can own and run these things. permalink parent award report block reply load 9 more comments...\nViewer01 15 points 4 days ago Ban them from owning single family altogether. If mom and pop want to retire and rent their house out fine. Fuck off with black stone paying cash for a neighborhood. permalink parent award report block reply\nbooblitchutz 8 points 4 days ago No, a house is an asset, as well. I agree the values have been grossly inflated to enrich banks. permalink parent award report block reply Unboosted 2 points 4 days ago Property taxes are high to enrich the bankrupt democratic party. 2026 is our time to show our power and not pay taxes. File an extension at least and watch what happens. We all need to say \"no taxation without representation no taxes for slush funds, no taxes for 3rd worlders, no taxes in 2026.\" permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago A car is an asset too. That doesn't mean only boomers should get to drive, just so they can sell their car for 10x what they paid for it. permalink parent award report block reply\nUnboosted 2 points 4 days ago Property taxes are high to enrich the bankrupt democratic party. 2026 is our time to show our power and not pay taxes. File an extension at least and watch what happens. We all need to say \"no taxation without representation no taxes for slush funds, no taxes for 3rd worlders, no taxes in 2026.\" permalink parent award report block reply\nXxxRDTPRNxxX 1 points 4 days ago A car is an asset too. That doesn't mean only boomers should get to drive, just so they can sell their car for 10x what they paid for it. permalink parent award report block reply\nYearninNation 2 points 4 days ago How about addressing usury, compound interest, mandatory insurance. and income tax? permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago What about people who say what about whataboutism? What about them? permalink parent award report block reply YearninNation 1 points 3 days ago What about them? permalink parent award report block reply\nXxxRDTPRNxxX 1 points 4 days ago What about people who say what about whataboutism? What about them? permalink parent award report block reply YearninNation 1 points 3 days ago What about them? permalink parent award report block reply\nYearninNation 1 points 3 days ago What about them? permalink parent award report block reply\nBboop 2 points 4 days ago Yes this exactly!! permalink parent award report block reply RedStoneDeepState -9 points 4 days ago \"just become a communist shithole to fight communism\" permalink parent award report block reply\nRedStoneDeepState -9 points 4 days ago \"just become a communist shithole to fight communism\" permalink parent award report block reply\nCPT88 1 points 4 days ago Thats not enough. What you need is no corporations, trusts or foreigners to own residential property. An individual person can own no more than 4 properties. 2 exceptions: If you build a new property these rules don't count for 35 years. This way BTR companies can operate and encourage building over rent seeking. Charitable housing. Rent must be 50% or less than market. Penalty for fraud around this is loss of the property. Ultimately homes can be good for people, or good for investors. Society needs to get priorities straight here. In the same vein we need to remove property tax on residential and I'd do something similar with farms. We need to stop investment groups living in the city owning all the farmland and ensure families can own and run these things. permalink parent award report block reply\nlabajada 4 points 4 days ago The \"guaranteed\" student loan administration scam was happening long before the active destruction of western freedom. back in the pit, slave! permalink parent award report block reply\nHuggableBear 4 points 4 days ago People under 35 - 40 years old literally don't remember a time when America was American. Y'all don't realize, this is not fixable. Revolution is inevitable. permalink parent award report block reply CommonSenseAmerican 1 points 4 days ago My generation is probably the last that finds most teenagers and younger adults not the least bit threatening and very pussylike, they have big mouths but that is about it. I blame it on being raised with cellphones and online interactions with friends, instead of meaningful IRL interactions. permalink parent award report block reply HuggableBear 2 points 3 days ago They aren't very threatening. They are indeed pussies. And it is for exactly the reasons you laid out. What happens to this country when you're 80 and those pussies are 45? permalink parent award report block reply CommonSenseAmerican 1 points 3 days ago Hopefully they become wiser with time and forget the idiotic socialist shit, and begin to see things from a taxpayer perspective. Multiple generations of spoiled children really doesn't make the future look great however they are easily amused by tiktok. permalink parent award report block reply\nCommonSenseAmerican 1 points 4 days ago My generation is probably the last that finds most teenagers and younger adults not the least bit threatening and very pussylike, they have big mouths but that is about it. I blame it on being raised with cellphones and online interactions with friends, instead of meaningful IRL interactions. permalink parent award report block reply HuggableBear 2 points 3 days ago They aren't very threatening. They are indeed pussies. And it is for exactly the reasons you laid out. What happens to this country when you're 80 and those pussies are 45? permalink parent award report block reply CommonSenseAmerican 1 points 3 days ago Hopefully they become wiser with time and forget the idiotic socialist shit, and begin to see things from a taxpayer perspective. Multiple generations of spoiled children really doesn't make the future look great however they are easily amused by tiktok. permalink parent award report block reply\nHuggableBear 2 points 3 days ago They aren't very threatening. They are indeed pussies. And it is for exactly the reasons you laid out. What happens to this country when you're 80 and those pussies are 45? permalink parent award report block reply CommonSenseAmerican 1 points 3 days ago Hopefully they become wiser with time and forget the idiotic socialist shit, and begin to see things from a taxpayer perspective. Multiple generations of spoiled children really doesn't make the future look great however they are easily amused by tiktok. permalink parent award report block reply\nCommonSenseAmerican 1 points 3 days ago Hopefully they become wiser with time and forget the idiotic socialist shit, and begin to see things from a taxpayer perspective. Multiple generations of spoiled children really doesn't make the future look great however they are easily amused by tiktok. permalink parent award report block reply\nBooKoo 2 points 4 days ago Obama was the \"Deporter in Chief\" soooo why aren't we all driving Lambos now? permalink parent award report block reply militantnationalist6 1 points 4 days ago Look, I’m sure we’re on the same side, but it’s hard for me to imagine that there’s somebody this stupid how many total people did he deport compared to how many illegals there are would you consider that Obama did mass deportations ? Because I don’t. And this is even before we talk about the treason that was committed by the Biden regime. permalink parent award report block reply BooKoo 1 points 4 days ago how do you define \"mass\"?\nGoing off the pure numbers he deported more than this current administration so far and also more than the previous Trump administration did during its four years. I mean just look it up I'm not pulling it out of my ass. permalink parent award report block reply\nmilitantnationalist6 1 points 4 days ago Look, I’m sure we’re on the same side, but it’s hard for me to imagine that there’s somebody this stupid how many total people did he deport compared to how many illegals there are would you consider that Obama did mass deportations ? Because I don’t. And this is even before we talk about the treason that was committed by the Biden regime. permalink parent award report block reply BooKoo 1 points 4 days ago how do you define \"mass\"?\nGoing off the pure numbers he deported more than this current administration so far and also more than the previous Trump administration did during its four years. I mean just look it up I'm not pulling it out of my ass. permalink parent award report block reply\nBooKoo 1 points 4 days ago how do you define \"mass\"?\nGoing off the pure numbers he deported more than this current administration so far and also more than the previous Trump administration did during its four years. I mean just look it up I'm not pulling it out of my ass. permalink parent award report block reply\nfazaman 50 points 4 days ago Any why is college so expensive? Government. (Guarantee student loans) Why is housing so expensive? Government. (Mass immigration) Neither of which is an indictment on capitalism. permalink award report block reply rebuildingMyself 19 points 4 days ago Not to mention the array of toxic useless degrees in Marxism or \"activism\" that provide zero marketable skills any company would want in their offices. permalink parent award report block reply stealthboy 18 points 4 days ago However all problems are blamed on capitalism, conservatives, and Republicans.  So the ignorant masses keep voting for leadership to just build more government. permalink parent award report block reply HockeyMom4Trump 5 points 4 days ago Not just mass immigration. Government also got in the business of subsidizing housing. That needs to end too. permalink parent award report block reply fazaman 1 points 4 days ago Oh, sure. It's just one of several factors, basically all caused by the government. I was just pointing out one major recent cause. permalink parent award report block reply HKFan 4 points 4 days ago healthcare too permalink parent award report block reply fazaman 2 points 4 days ago Very much so. permalink parent award report block reply Pearcesarrow 3 points 4 days ago True, but I would also add that corporations like blackrock should not be allowed to buy up housing supply. Build housing sure but not buy up preexisting housing supply to make profit from permalink parent award report block reply load 5 more comments...\nrebuildingMyself 19 points 4 days ago Not to mention the array of toxic useless degrees in Marxism or \"activism\" that provide zero marketable skills any company would want in their offices. permalink parent award report block reply\nstealthboy 18 points 4 days ago However all problems are blamed on capitalism, conservatives, and Republicans.  So the ignorant masses keep voting for leadership to just build more government. permalink parent award report block reply\nHockeyMom4Trump 5 points 4 days ago Not just mass immigration. Government also got in the business of subsidizing housing. That needs to end too. permalink parent award report block reply fazaman 1 points 4 days ago Oh, sure. It's just one of several factors, basically all caused by the government. I was just pointing out one major recent cause. permalink parent award report block reply\nfazaman 1 points 4 days ago Oh, sure. It's just one of several factors, basically all caused by the government. I was just pointing out one major recent cause. permalink parent award report block reply\nHKFan 4 points 4 days ago healthcare too permalink parent award report block reply fazaman 2 points 4 days ago Very much so. permalink parent award report block reply\nfazaman 2 points 4 days ago Very much so. permalink parent award report block reply\nPearcesarrow 3 points 4 days ago True, but I would also add that corporations like blackrock should not be allowed to buy up housing supply. Build housing sure but not buy up preexisting housing supply to make profit from permalink parent award report block reply\nNYforTrump 38 points 4 days ago Colleges are hiking up their tuition due to guaranteed government loans and there's not enough housing to house Biden's 20 million illegals.  Cut off the loans, force schools to compete with each other on merit, deport all illegals.  Problem solved. permalink award report block reply rebuildingMyself 16 points 4 days ago Also allowing foreign investors to buy up the housing to park their wealth puts pressure on supply permalink parent award report block reply FlyCatcher94 2 points 4 days ago Not wrong permalink parent award report block reply TheAttackTitan 1 points 4 days ago Schools shouldn’t be paid until after you graduate. You don’t pay for dinner before you’re served, you don’t pay for a haircut before the barber pulls out the scissors, you don’t pay for home renovations until after services have been rendered. But for college, you pay your semester tuition up front and in full. Why does school deserve be different? Sure it’s expensive, take out a loan for it. Lock in your rate before you enroll, and start paying it after you graduate. That’ll keep costs down - college will need to keep costs affordable and focus on job placement and career readiness if they’re ever going to expect a return on their investment in you. And college should be responsible for your job placement. You can’t pay for a loan without a job. If you can’t get a job, and you provide proof that you’ve been applying to jobs and tried to get a job, then the college should put that endowment to good use. If they fail to prepare you adequately for the future, that’s on them for not doing a good enough job. permalink parent award report block reply Bazhosh 1 points 4 days ago You pay for gas before you drive... permalink parent award report block reply ThunderSizzle 2 points 4 days ago Not with a credit card.  You offer proof you can pay,  but the transaction isn't locked in until after you have the gas. permalink parent award report block reply NYforTrump 1 points 4 days ago We used to be able to pump before paying.  Bunch of assholes ruined it. permalink parent award report block reply TheAttackTitan 1 points 3 days ago This is a stupid observation. If you pay for gas with cash, you’re purchasing an agreed upon quantity of gallons. If you pay with a credit card, your credit account is checked for sufficient line of credit, then the pump lets you pump as much as you want, and you get charged after the gas has been dispensed. Yes of course you can’t drive before you get gas, but the gas is still transactional. College is not transactional. You buy everything up front with no guarantee of the outcome or quality of the final product. permalink parent award report block reply Bboop 1 points 4 days ago Amen permalink parent award report block reply FromNC 1 points 4 days ago Students already have the ability to shop for lower cost schools and they don’t. The UNC curriculum is used throughout almost all major NC colleges yet I was able to get an engineering degree for $32k while another school with the same curriculum cost $90k. permalink parent award report block reply load 3 more comments...\nrebuildingMyself 16 points 4 days ago Also allowing foreign investors to buy up the housing to park their wealth puts pressure on supply permalink parent award report block reply\nFlyCatcher94 2 points 4 days ago Not wrong permalink parent award report block reply\nTheAttackTitan 1 points 4 days ago Schools shouldn’t be paid until after you graduate. You don’t pay for dinner before you’re served, you don’t pay for a haircut before the barber pulls out the scissors, you don’t pay for home renovations until after services have been rendered. But for college, you pay your semester tuition up front and in full. Why does school deserve be different? Sure it’s expensive, take out a loan for it. Lock in your rate before you enroll, and start paying it after you graduate. That’ll keep costs down - college will need to keep costs affordable and focus on job placement and career readiness if they’re ever going to expect a return on their investment in you. And college should be responsible for your job placement. You can’t pay for a loan without a job. If you can’t get a job, and you provide proof that you’ve been applying to jobs and tried to get a job, then the college should put that endowment to good use. If they fail to prepare you adequately for the future, that’s on them for not doing a good enough job. permalink parent award report block reply Bazhosh 1 points 4 days ago You pay for gas before you drive... permalink parent award report block reply ThunderSizzle 2 points 4 days ago Not with a credit card.  You offer proof you can pay,  but the transaction isn't locked in until after you have the gas. permalink parent award report block reply NYforTrump 1 points 4 days ago We used to be able to pump before paying.  Bunch of assholes ruined it. permalink parent award report block reply TheAttackTitan 1 points 3 days ago This is a stupid observation. If you pay for gas with cash, you’re purchasing an agreed upon quantity of gallons. If you pay with a credit card, your credit account is checked for sufficient line of credit, then the pump lets you pump as much as you want, and you get charged after the gas has been dispensed. Yes of course you can’t drive before you get gas, but the gas is still transactional. College is not transactional. You buy everything up front with no guarantee of the outcome or quality of the final product. permalink parent award report block reply\nBazhosh 1 points 4 days ago You pay for gas before you drive... permalink parent award report block reply ThunderSizzle 2 points 4 days ago Not with a credit card.  You offer proof you can pay,  but the transaction isn't locked in until after you have the gas. permalink parent award report block reply NYforTrump 1 points 4 days ago We used to be able to pump before paying.  Bunch of assholes ruined it. permalink parent award report block reply TheAttackTitan 1 points 3 days ago This is a stupid observation. If you pay for gas with cash, you’re purchasing an agreed upon quantity of gallons. If you pay with a credit card, your credit account is checked for sufficient line of credit, then the pump lets you pump as much as you want, and you get charged after the gas has been dispensed. Yes of course you can’t drive before you get gas, but the gas is still transactional. College is not transactional. You buy everything up front with no guarantee of the outcome or quality of the final product. permalink parent award report block reply\nThunderSizzle 2 points 4 days ago Not with a credit card.  You offer proof you can pay,  but the transaction isn't locked in until after you have the gas. permalink parent award report block reply\nNYforTrump 1 points 4 days ago We used to be able to pump before paying.  Bunch of assholes ruined it. permalink parent award report block reply\nTheAttackTitan 1 points 3 days ago This is a stupid observation. If you pay for gas with cash, you’re purchasing an agreed upon quantity of gallons. If you pay with a credit card, your credit account is checked for sufficient line of credit, then the pump lets you pump as much as you want, and you get charged after the gas has been dispensed. Yes of course you can’t drive before you get gas, but the gas is still transactional. College is not transactional. You buy everything up front with no guarantee of the outcome or quality of the final product. permalink parent award report block reply\nBboop 1 points 4 days ago Amen permalink parent award report block reply\nFromNC 1 points 4 days ago Students already have the ability to shop for lower cost schools and they don’t. The UNC curriculum is used throughout almost all major NC colleges yet I was able to get an engineering degree for $32k while another school with the same curriculum cost $90k. permalink parent award report block reply\nPlsdontfireme 18 points 4 days ago Make colleges liable for false advertising. Drain their endowments to pay off fraudulent student loans. permalink award report block reply RuprechtThaMonkeyBoy 10 points 4 days ago This. Privatize, and move the debt to colleges. Let the debtors learn their first real skill in life: negotiation. If debtors are smart enough they negotiate a settlement for what their bullshit degrees are truly worth: pennies on the dollar. permalink parent award report block reply tholinz 5 points 4 days ago Imagine if colleges had to provide financing... all of this shit would get solved within a year permalink parent award report block reply deleted 2 points 4 days ago CommonSenseAmerican 1 points 4 days ago Also they are the only institutions that legally and exclusively allow African specific racial classes to exist along with quotas. Will Whites Americans be afforded the same when they become a minority at colleges, doubtful. permalink parent award report block reply Nibba2 2 points 4 days ago There was a college I drove by, it’s well known and has a large student base. Around the town, they advertised “highest graduation rate in the greater area!” That’s not something to be proud of. That’s just saying you’re essentially ITT tech and a diploma mill. Let’s see your students success rates. How much they are paid compared to your competition. How well the program teaches. permalink parent award report block reply\nRuprechtThaMonkeyBoy 10 points 4 days ago This. Privatize, and move the debt to colleges. Let the debtors learn their first real skill in life: negotiation. If debtors are smart enough they negotiate a settlement for what their bullshit degrees are truly worth: pennies on the dollar. permalink parent award report block reply\ntholinz 5 points 4 days ago Imagine if colleges had to provide financing... all of this shit would get solved within a year permalink parent award report block reply deleted 2 points 4 days ago CommonSenseAmerican 1 points 4 days ago Also they are the only institutions that legally and exclusively allow African specific racial classes to exist along with quotas. Will Whites Americans be afforded the same when they become a minority at colleges, doubtful. permalink parent award report block reply\ndeleted 2 points 4 days ago CommonSenseAmerican 1 points 4 days ago Also they are the only institutions that legally and exclusively allow African specific racial classes to exist along with quotas. Will Whites Americans be afforded the same when they become a minority at colleges, doubtful. permalink parent award report block reply\nCommonSenseAmerican 1 points 4 days ago Also they are the only institutions that legally and exclusively allow African specific racial classes to exist along with quotas. Will Whites Americans be afforded the same when they become a minority at colleges, doubtful. permalink parent award report block reply\nNibba2 2 points 4 days ago There was a college I drove by, it’s well known and has a large student base. Around the town, they advertised “highest graduation rate in the greater area!” That’s not something to be proud of. That’s just saying you’re essentially ITT tech and a diploma mill. Let’s see your students success rates. How much they are paid compared to your competition. How well the program teaches. permalink parent award report block reply\narmyofpedes4usa 17 points 4 days ago Friendly reminder: Peter Thiel is a co-founder of Palantir. He's not exactly on our side. permalink award report block reply LORDFALCONE 9 points 4 days ago Peter Thiel perfect anagram for The Reptile. Also gay and Jewish, literally permalink parent award report block reply TrumpAndGodWin 3 points 4 days ago Was he the one that made a crazy comment about being afraid of Christians throwing him off a roof (one of the top jews at Palantir said it)? permalink parent award report block reply Ritchie_Blackadder 2 points 4 days ago Too Gruish permalink parent award report block reply Wearyman 5 points 4 days ago Well, these commies DO always tell us exactly what they plan to do. permalink parent award report block reply Dangerous 1 points 4 days ago The fact this truth is buried under normie slop about boomers and capitalism is just proof we already lost and that this place has been artificially converted to MIGA through prolific use of bots... permalink parent award report block reply\nLORDFALCONE 9 points 4 days ago Peter Thiel perfect anagram for The Reptile. Also gay and Jewish, literally permalink parent award report block reply TrumpAndGodWin 3 points 4 days ago Was he the one that made a crazy comment about being afraid of Christians throwing him off a roof (one of the top jews at Palantir said it)? permalink parent award report block reply Ritchie_Blackadder 2 points 4 days ago Too Gruish permalink parent award report block reply\nTrumpAndGodWin 3 points 4 days ago Was he the one that made a crazy comment about being afraid of Christians throwing him off a roof (one of the top jews at Palantir said it)? permalink parent award report block reply\nRitchie_Blackadder 2 points 4 days ago Too Gruish permalink parent award report block reply\nWearyman 5 points 4 days ago Well, these commies DO always tell us exactly what they plan to do. permalink parent award report block reply\nDangerous 1 points 4 days ago The fact this truth is buried under normie slop about boomers and capitalism is just proof we already lost and that this place has been artificially converted to MIGA through prolific use of bots... permalink parent award report block reply\nRuprechtThaMonkeyBoy 12 points 4 days ago And who convinced these dumbass Millennials and older Gen Z’s to rack up college debt pursuing useless woke degrees? Obama and Company. It’s all part of their “long-march” strategy to fundamentally transform America. It’s not about the left’s candidate qualifications, it’s about putting someone in office that will acquiesce to their “Change” central committee who does the work and autopens the orders. permalink award report block reply CryingBanshee 29 points 4 days ago Um WHAT?!  This is such an out-of-touch take. Im an older millennial, born early 1980s. From the time I entered school in the mid-late 80s my teachers were constantly talking about going to college, how to use student loans, how quickly student loans will be paid back with a great job post-college. My parents and grandparents, church members, every boomer I knew told us to go to college no matter what as that was the best way to be successful and have a great career.  By the time Obama came around older millennials had already graduated from college and some from grad school with tens to hundreds of thousands in debt. permalink parent award report block reply Tele_Plus 10 points 4 days ago You and I are “xennials” (I was born in ‘83).  The shit millennials came about a decade after us and we get blamed too because of them.  Same thing with Boomers.  My mom is a younger boomer (they call them “Jonesers”), and  she says the hippies were the older boomers, and she was in middle school and listening to the Monkees when all that was going on. She wants absolutely NOTHING to do with the other half of her generation and has nothing in common with them. I do agree though that many of us went all in on college, but a lot of older folks forget we were told all our lives that you’re basically a failure and going nowhere in life if you don’t get a college degree. Also, for a good while even the most entry level office job required a college degree, didn’t matter in what field, just a degree. Meanwhile the kids they shamed for not being the top of their class were told “you might as well go to the tech school because you’re not smart enough to be academically successful” - those people are making good money in the trades. permalink parent award report block reply HockeyMom4Trump 2 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. “Xennials” “Jonesers” this is beginning to sound like the left gender spectrum…binary, non-binary, furry. The secret to financial success? It is pretty damn easy. First, stop blaming. Don’t be a victim. Work a job. Live below your means. Save. Eat ramen noodles and drink tap water if you have to. Don’t worry about trying to impress anyone else. Don’t lease a car you can’t afford. Walk. Take a bus. When my husband and I were starting out we worked and worked and saved and saved. When my parents were young they worked and worked and saved and saved. Now my sons are starting out. They work and work and save and save. Never be a victim. Stop whining. Stop the generation bullshit. Live below your means. No more victim. permalink parent award report block reply mav7579 1 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. This There are good and bad people in every generation.  It isn't the rank and file boomer that created these problems that the younger people complain about. The generation division thing is just another scam to divide people, no different than dividing people by their race, gender, etc. permalink parent award report block reply Tele_Plus -1 points 4 days ago That’s great for you, and for your kids.  But it’s still more nuanced than you think. I never said I was living outside my means or anything like that.  If I was going to play victim I wouldn’t be on this website and hanging out with MAGA.  We aren’t all occupy Wall Street types and we don’t all blame the system for everything.  (Well, no, the public school system is certainly to blame for a lot, and still is, as is most of government.) This is not playing victim, it’s recognizing how we were set up for failure, so we don’t do the same thing to our kids.  In fact there are a lot of millennials who are MAGA for this reason.  Many, including my wife and I, are now homeschooling our kids and encouraging them to consider careers in trades, and to avoid college unless it’s for something practical like nursing. permalink parent award report block reply RedStoneDeepState -8 points 4 days ago The shit millennials came about a decade after us Nope, you are the age of the anti war protesters under Bush. When I talk badly about millennials I am talking about your age. permalink parent award report block reply XcaliburCaliber 1 points 4 days ago Are you nuts? Millenials are also known as the 9/11 generation. I am not claiming we should or should not have been involved in OIF or OEF but we overwhelmingly fought all the sandbox wars starting after 9/11. Gen x kicked it off in a big way at more of an 80%/20% split. As soon as the millenials were old enough to join the ration flipped. Yes, there absolutely were lots of millennial anti-war protesters on social media. Gen x didn’t have any major conflicts to the same degree as millenials to even protest against. Boomers were more protest queens but gen-x still had the anti apartheid protests, the AIDS act ups and “die-ins”, green peace, ant-nuclear, and I’m certain I’m missing some. Moral of the story, it makes no sense to judge an entire generation based on their losers, save it for the jokes. Millenials losers are great to dunk on for fun. As one, the opportunity is ripe. Oh, and of the full time employed cohorts,  millenials work more hours than gen-x. permalink parent award report block reply view 1 more comments... HoganT 1 points 4 days ago Ok, boomer. You’re the one that has spent your entire life voting us down the river to where we are today. permalink parent award report block reply view 1 more comments... deleted 5 points 4 days ago TravisRSCX 6 points 4 days ago Honestly government guaranteed loans have driven up college costs the most. Goes along with the 40 million people on snap benefits driving up food costs as well. I’m all for assisting people that need assistance, but the ones taking advantage of this needs to be taken off this. permalink parent award report block reply deleted 4 points 4 days ago view 2 more comments... HockeyMom4Trump 3 points 4 days ago Government needs to get out of the loan business. permalink parent award report block reply PsychoDodo 1 points 4 days ago This. Welfare and socalist programs drive out the capitalist push since it gives an unfair advantage to those that use (or lack of use) them. The hard worker and middle class gets crushed in the press against those with old wealth (The rich get richer) and those on assistance (the poor loafing around and coasting rather than utilizing it to speed run to the top) When you can get a grant for your gender studies so the collage  jacks up the cost of it to $80,000 to grift off the govt handout, pay $60/mo rent and get $4000/mo in food stamps it obliterates anyone in the middle class from even having a chance. Toss in DEI quotas and you're really fucked. You either can't get into the program because it's full up or you can't afford it. permalink parent award report block reply CryingBanshee 4 points 4 days ago Regardless of you GI benefits, I would bet you were told throughout your entire k-12 schooling that you should go to college, and student loans were a tool to get through college, and that student loans would pay themselves back when you got a great job after college.\nThat you didnt graduate from debt is great, but my point was that going to college come hell or high debt was ingrained in us from a young age through school and society, decades before Obama was a politician. permalink parent award report block reply deleted 3 points 4 days ago view 1 more comments... HockeyMom4Trump 0 points 4 days ago Your username is fitting. Cryingbanshee. I am seeing a lot of whining from you. I have two sons. Both attended college. One is still there. Another graduated law school. No debt. They have worked their asses off. There are ways to attend school and not take out loans. If you did this, perhaps instead of whining, figure out how to get a job and start paying back your debt. No one forced you to do anything. permalink parent award report block reply view 1 more comments... Saltyminer11 4 points 4 days ago The colleges and universities started going after every breathing human to go to college. Lowering standards and accepting people who really had no business going past high school. The money got easier so they lowered the standards. Whether one agrees or not, not everyone is college material. permalink parent award report block reply Aquamine-Amarine 2 points 4 days ago I agree with you, I was born in the 90's. The schools, teachers, parents, etc. have been pushing this stuff onto impressionable kids for a long time. Kids don't know any better, they don't understand the huge amount of debt they're taking on. They want to trust what the adults around them are saying because surely they wouldn't lie to them, right? Except they WERE lied to. College ended up not being worth it for some people. permalink parent award report block reply RuprechtThaMonkeyBoy 1 points 4 days ago You’re the exception, not the rule. Being born in the early eighties, plus having parents with the values you described definitely put you on firm footing. To be fair the start of college degree inflation originated under the Bush Jr. administration, when the utilization of GI Bill benefits  fattened the wallets of our Universities. Like anything else in life where the government is a large customer, prices go up. Back in 2008, Tulane Freeman School of business was offering an Executive MBA for $55k. It’s now $100k. While seriously inflated, you could still pay that off in a reasonable time based upon the doors it would open. A masters degree in social work at the same tuition? Best of luck. The dumb degree part came later when the Obama’s pushed for woke liberal arts degrees over STEM-focused ones. permalink parent award report block reply BoltCarrierGroup 1 points 4 days ago GI bill recipients are a tiny fraction of any of the money colleges receive. Only half of veterans even use a portion of their GI bill. But less than a fifth of veterans have a Bachelor's degree so it shows most don’t use the entire benefit, just a portion. Student loans are what drove government inflation of tuition, not the GI bill. GI bill has been around since ww2 permalink parent award report block reply load 5 more comments... ViagraFalls 15 points 4 days ago That was the boomer message to the youth. Go to college. It’s the most wonderful thing in the world. permalink parent award report block reply Klaus73 6 points 4 days ago It is if you bothered to go into a productive field. Learning on the job is great; but your seniors get busy and likely don't have the time to teach you the finer points of structural engineering or architecture which can cost lives when a novice fucks up. The problem is that folks opened and branched into useless fields and when they realized there were no jobs for that field...they MADE jobs by teaching the dead end to others. permalink parent award report block reply ViagraFalls 1 points 4 days ago You forgot any more legitimate fields but they shipped the jobs somewhere else or bright in H1-B holders. You didn’t mention the correlation offered as causation. People with college degrees make more money in their lifetimes even if it’s basket weaving. School and work success are tied to intelligence and conscientiousness. College can be 4 years or more and $10s of thousands of dollars just to try showing you have more conscientious and maybe intelligence. permalink parent award report block reply PatriotSkorzeny 1 points 4 days ago Egyptology. permalink parent award report block reply Klaus73 1 points 4 days ago Perfect example - really all colleges should be required to show job stats for every occupation. permalink parent award report block reply MyNameIsTaxpayer 2 points 4 days ago Boomers propping up that self-esteem permalink parent award report block reply\nCryingBanshee 29 points 4 days ago Um WHAT?!  This is such an out-of-touch take. Im an older millennial, born early 1980s. From the time I entered school in the mid-late 80s my teachers were constantly talking about going to college, how to use student loans, how quickly student loans will be paid back with a great job post-college. My parents and grandparents, church members, every boomer I knew told us to go to college no matter what as that was the best way to be successful and have a great career.  By the time Obama came around older millennials had already graduated from college and some from grad school with tens to hundreds of thousands in debt. permalink parent award report block reply Tele_Plus 10 points 4 days ago You and I are “xennials” (I was born in ‘83).  The shit millennials came about a decade after us and we get blamed too because of them.  Same thing with Boomers.  My mom is a younger boomer (they call them “Jonesers”), and  she says the hippies were the older boomers, and she was in middle school and listening to the Monkees when all that was going on. She wants absolutely NOTHING to do with the other half of her generation and has nothing in common with them. I do agree though that many of us went all in on college, but a lot of older folks forget we were told all our lives that you’re basically a failure and going nowhere in life if you don’t get a college degree. Also, for a good while even the most entry level office job required a college degree, didn’t matter in what field, just a degree. Meanwhile the kids they shamed for not being the top of their class were told “you might as well go to the tech school because you’re not smart enough to be academically successful” - those people are making good money in the trades. permalink parent award report block reply HockeyMom4Trump 2 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. “Xennials” “Jonesers” this is beginning to sound like the left gender spectrum…binary, non-binary, furry. The secret to financial success? It is pretty damn easy. First, stop blaming. Don’t be a victim. Work a job. Live below your means. Save. Eat ramen noodles and drink tap water if you have to. Don’t worry about trying to impress anyone else. Don’t lease a car you can’t afford. Walk. Take a bus. When my husband and I were starting out we worked and worked and saved and saved. When my parents were young they worked and worked and saved and saved. Now my sons are starting out. They work and work and save and save. Never be a victim. Stop whining. Stop the generation bullshit. Live below your means. No more victim. permalink parent award report block reply mav7579 1 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. This There are good and bad people in every generation.  It isn't the rank and file boomer that created these problems that the younger people complain about. The generation division thing is just another scam to divide people, no different than dividing people by their race, gender, etc. permalink parent award report block reply Tele_Plus -1 points 4 days ago That’s great for you, and for your kids.  But it’s still more nuanced than you think. I never said I was living outside my means or anything like that.  If I was going to play victim I wouldn’t be on this website and hanging out with MAGA.  We aren’t all occupy Wall Street types and we don’t all blame the system for everything.  (Well, no, the public school system is certainly to blame for a lot, and still is, as is most of government.) This is not playing victim, it’s recognizing how we were set up for failure, so we don’t do the same thing to our kids.  In fact there are a lot of millennials who are MAGA for this reason.  Many, including my wife and I, are now homeschooling our kids and encouraging them to consider careers in trades, and to avoid college unless it’s for something practical like nursing. permalink parent award report block reply RedStoneDeepState -8 points 4 days ago The shit millennials came about a decade after us Nope, you are the age of the anti war protesters under Bush. When I talk badly about millennials I am talking about your age. permalink parent award report block reply XcaliburCaliber 1 points 4 days ago Are you nuts? Millenials are also known as the 9/11 generation. I am not claiming we should or should not have been involved in OIF or OEF but we overwhelmingly fought all the sandbox wars starting after 9/11. Gen x kicked it off in a big way at more of an 80%/20% split. As soon as the millenials were old enough to join the ration flipped. Yes, there absolutely were lots of millennial anti-war protesters on social media. Gen x didn’t have any major conflicts to the same degree as millenials to even protest against. Boomers were more protest queens but gen-x still had the anti apartheid protests, the AIDS act ups and “die-ins”, green peace, ant-nuclear, and I’m certain I’m missing some. Moral of the story, it makes no sense to judge an entire generation based on their losers, save it for the jokes. Millenials losers are great to dunk on for fun. As one, the opportunity is ripe. Oh, and of the full time employed cohorts,  millenials work more hours than gen-x. permalink parent award report block reply view 1 more comments... HoganT 1 points 4 days ago Ok, boomer. You’re the one that has spent your entire life voting us down the river to where we are today. permalink parent award report block reply view 1 more comments... deleted 5 points 4 days ago TravisRSCX 6 points 4 days ago Honestly government guaranteed loans have driven up college costs the most. Goes along with the 40 million people on snap benefits driving up food costs as well. I’m all for assisting people that need assistance, but the ones taking advantage of this needs to be taken off this. permalink parent award report block reply deleted 4 points 4 days ago view 2 more comments... HockeyMom4Trump 3 points 4 days ago Government needs to get out of the loan business. permalink parent award report block reply PsychoDodo 1 points 4 days ago This. Welfare and socalist programs drive out the capitalist push since it gives an unfair advantage to those that use (or lack of use) them. The hard worker and middle class gets crushed in the press against those with old wealth (The rich get richer) and those on assistance (the poor loafing around and coasting rather than utilizing it to speed run to the top) When you can get a grant for your gender studies so the collage  jacks up the cost of it to $80,000 to grift off the govt handout, pay $60/mo rent and get $4000/mo in food stamps it obliterates anyone in the middle class from even having a chance. Toss in DEI quotas and you're really fucked. You either can't get into the program because it's full up or you can't afford it. permalink parent award report block reply CryingBanshee 4 points 4 days ago Regardless of you GI benefits, I would bet you were told throughout your entire k-12 schooling that you should go to college, and student loans were a tool to get through college, and that student loans would pay themselves back when you got a great job after college.\nThat you didnt graduate from debt is great, but my point was that going to college come hell or high debt was ingrained in us from a young age through school and society, decades before Obama was a politician. permalink parent award report block reply deleted 3 points 4 days ago view 1 more comments... HockeyMom4Trump 0 points 4 days ago Your username is fitting. Cryingbanshee. I am seeing a lot of whining from you. I have two sons. Both attended college. One is still there. Another graduated law school. No debt. They have worked their asses off. There are ways to attend school and not take out loans. If you did this, perhaps instead of whining, figure out how to get a job and start paying back your debt. No one forced you to do anything. permalink parent award report block reply view 1 more comments... Saltyminer11 4 points 4 days ago The colleges and universities started going after every breathing human to go to college. Lowering standards and accepting people who really had no business going past high school. The money got easier so they lowered the standards. Whether one agrees or not, not everyone is college material. permalink parent award report block reply Aquamine-Amarine 2 points 4 days ago I agree with you, I was born in the 90's. The schools, teachers, parents, etc. have been pushing this stuff onto impressionable kids for a long time. Kids don't know any better, they don't understand the huge amount of debt they're taking on. They want to trust what the adults around them are saying because surely they wouldn't lie to them, right? Except they WERE lied to. College ended up not being worth it for some people. permalink parent award report block reply RuprechtThaMonkeyBoy 1 points 4 days ago You’re the exception, not the rule. Being born in the early eighties, plus having parents with the values you described definitely put you on firm footing. To be fair the start of college degree inflation originated under the Bush Jr. administration, when the utilization of GI Bill benefits  fattened the wallets of our Universities. Like anything else in life where the government is a large customer, prices go up. Back in 2008, Tulane Freeman School of business was offering an Executive MBA for $55k. It’s now $100k. While seriously inflated, you could still pay that off in a reasonable time based upon the doors it would open. A masters degree in social work at the same tuition? Best of luck. The dumb degree part came later when the Obama’s pushed for woke liberal arts degrees over STEM-focused ones. permalink parent award report block reply BoltCarrierGroup 1 points 4 days ago GI bill recipients are a tiny fraction of any of the money colleges receive. Only half of veterans even use a portion of their GI bill. But less than a fifth of veterans have a Bachelor's degree so it shows most don’t use the entire benefit, just a portion. Student loans are what drove government inflation of tuition, not the GI bill. GI bill has been around since ww2 permalink parent award report block reply load 5 more comments...\nTele_Plus 10 points 4 days ago You and I are “xennials” (I was born in ‘83).  The shit millennials came about a decade after us and we get blamed too because of them.  Same thing with Boomers.  My mom is a younger boomer (they call them “Jonesers”), and  she says the hippies were the older boomers, and she was in middle school and listening to the Monkees when all that was going on. She wants absolutely NOTHING to do with the other half of her generation and has nothing in common with them. I do agree though that many of us went all in on college, but a lot of older folks forget we were told all our lives that you’re basically a failure and going nowhere in life if you don’t get a college degree. Also, for a good while even the most entry level office job required a college degree, didn’t matter in what field, just a degree. Meanwhile the kids they shamed for not being the top of their class were told “you might as well go to the tech school because you’re not smart enough to be academically successful” - those people are making good money in the trades. permalink parent award report block reply HockeyMom4Trump 2 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. “Xennials” “Jonesers” this is beginning to sound like the left gender spectrum…binary, non-binary, furry. The secret to financial success? It is pretty damn easy. First, stop blaming. Don’t be a victim. Work a job. Live below your means. Save. Eat ramen noodles and drink tap water if you have to. Don’t worry about trying to impress anyone else. Don’t lease a car you can’t afford. Walk. Take a bus. When my husband and I were starting out we worked and worked and saved and saved. When my parents were young they worked and worked and saved and saved. Now my sons are starting out. They work and work and save and save. Never be a victim. Stop whining. Stop the generation bullshit. Live below your means. No more victim. permalink parent award report block reply mav7579 1 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. This There are good and bad people in every generation.  It isn't the rank and file boomer that created these problems that the younger people complain about. The generation division thing is just another scam to divide people, no different than dividing people by their race, gender, etc. permalink parent award report block reply Tele_Plus -1 points 4 days ago That’s great for you, and for your kids.  But it’s still more nuanced than you think. I never said I was living outside my means or anything like that.  If I was going to play victim I wouldn’t be on this website and hanging out with MAGA.  We aren’t all occupy Wall Street types and we don’t all blame the system for everything.  (Well, no, the public school system is certainly to blame for a lot, and still is, as is most of government.) This is not playing victim, it’s recognizing how we were set up for failure, so we don’t do the same thing to our kids.  In fact there are a lot of millennials who are MAGA for this reason.  Many, including my wife and I, are now homeschooling our kids and encouraging them to consider careers in trades, and to avoid college unless it’s for something practical like nursing. permalink parent award report block reply RedStoneDeepState -8 points 4 days ago The shit millennials came about a decade after us Nope, you are the age of the anti war protesters under Bush. When I talk badly about millennials I am talking about your age. permalink parent award report block reply XcaliburCaliber 1 points 4 days ago Are you nuts? Millenials are also known as the 9/11 generation. I am not claiming we should or should not have been involved in OIF or OEF but we overwhelmingly fought all the sandbox wars starting after 9/11. Gen x kicked it off in a big way at more of an 80%/20% split. As soon as the millenials were old enough to join the ration flipped. Yes, there absolutely were lots of millennial anti-war protesters on social media. Gen x didn’t have any major conflicts to the same degree as millenials to even protest against. Boomers were more protest queens but gen-x still had the anti apartheid protests, the AIDS act ups and “die-ins”, green peace, ant-nuclear, and I’m certain I’m missing some. Moral of the story, it makes no sense to judge an entire generation based on their losers, save it for the jokes. Millenials losers are great to dunk on for fun. As one, the opportunity is ripe. Oh, and of the full time employed cohorts,  millenials work more hours than gen-x. permalink parent award report block reply view 1 more comments... HoganT 1 points 4 days ago Ok, boomer. You’re the one that has spent your entire life voting us down the river to where we are today. permalink parent award report block reply view 1 more comments...\nHockeyMom4Trump 2 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. “Xennials” “Jonesers” this is beginning to sound like the left gender spectrum…binary, non-binary, furry. The secret to financial success? It is pretty damn easy. First, stop blaming. Don’t be a victim. Work a job. Live below your means. Save. Eat ramen noodles and drink tap water if you have to. Don’t worry about trying to impress anyone else. Don’t lease a car you can’t afford. Walk. Take a bus. When my husband and I were starting out we worked and worked and saved and saved. When my parents were young they worked and worked and saved and saved. Now my sons are starting out. They work and work and save and save. Never be a victim. Stop whining. Stop the generation bullshit. Live below your means. No more victim. permalink parent award report block reply mav7579 1 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. This There are good and bad people in every generation.  It isn't the rank and file boomer that created these problems that the younger people complain about. The generation division thing is just another scam to divide people, no different than dividing people by their race, gender, etc. permalink parent award report block reply Tele_Plus -1 points 4 days ago That’s great for you, and for your kids.  But it’s still more nuanced than you think. I never said I was living outside my means or anything like that.  If I was going to play victim I wouldn’t be on this website and hanging out with MAGA.  We aren’t all occupy Wall Street types and we don’t all blame the system for everything.  (Well, no, the public school system is certainly to blame for a lot, and still is, as is most of government.) This is not playing victim, it’s recognizing how we were set up for failure, so we don’t do the same thing to our kids.  In fact there are a lot of millennials who are MAGA for this reason.  Many, including my wife and I, are now homeschooling our kids and encouraging them to consider careers in trades, and to avoid college unless it’s for something practical like nursing. permalink parent award report block reply\nmav7579 1 points 4 days ago I am exhausted with being divided into generations. Stop falling for the bullshit. This There are good and bad people in every generation.  It isn't the rank and file boomer that created these problems that the younger people complain about. The generation division thing is just another scam to divide people, no different than dividing people by their race, gender, etc. permalink parent award report block reply\nTele_Plus -1 points 4 days ago That’s great for you, and for your kids.  But it’s still more nuanced than you think. I never said I was living outside my means or anything like that.  If I was going to play victim I wouldn’t be on this website and hanging out with MAGA.  We aren’t all occupy Wall Street types and we don’t all blame the system for everything.  (Well, no, the public school system is certainly to blame for a lot, and still is, as is most of government.) This is not playing victim, it’s recognizing how we were set up for failure, so we don’t do the same thing to our kids.  In fact there are a lot of millennials who are MAGA for this reason.  Many, including my wife and I, are now homeschooling our kids and encouraging them to consider careers in trades, and to avoid college unless it’s for something practical like nursing. permalink parent award report block reply\nRedStoneDeepState -8 points 4 days ago The shit millennials came about a decade after us Nope, you are the age of the anti war protesters under Bush. When I talk badly about millennials I am talking about your age. permalink parent award report block reply XcaliburCaliber 1 points 4 days ago Are you nuts? Millenials are also known as the 9/11 generation. I am not claiming we should or should not have been involved in OIF or OEF but we overwhelmingly fought all the sandbox wars starting after 9/11. Gen x kicked it off in a big way at more of an 80%/20% split. As soon as the millenials were old enough to join the ration flipped. Yes, there absolutely were lots of millennial anti-war protesters on social media. Gen x didn’t have any major conflicts to the same degree as millenials to even protest against. Boomers were more protest queens but gen-x still had the anti apartheid protests, the AIDS act ups and “die-ins”, green peace, ant-nuclear, and I’m certain I’m missing some. Moral of the story, it makes no sense to judge an entire generation based on their losers, save it for the jokes. Millenials losers are great to dunk on for fun. As one, the opportunity is ripe. Oh, and of the full time employed cohorts,  millenials work more hours than gen-x. permalink parent award report block reply view 1 more comments... HoganT 1 points 4 days ago Ok, boomer. You’re the one that has spent your entire life voting us down the river to where we are today. permalink parent award report block reply view 1 more comments...\nXcaliburCaliber 1 points 4 days ago Are you nuts? Millenials are also known as the 9/11 generation. I am not claiming we should or should not have been involved in OIF or OEF but we overwhelmingly fought all the sandbox wars starting after 9/11. Gen x kicked it off in a big way at more of an 80%/20% split. As soon as the millenials were old enough to join the ration flipped. Yes, there absolutely were lots of millennial anti-war protesters on social media. Gen x didn’t have any major conflicts to the same degree as millenials to even protest against. Boomers were more protest queens but gen-x still had the anti apartheid protests, the AIDS act ups and “die-ins”, green peace, ant-nuclear, and I’m certain I’m missing some. Moral of the story, it makes no sense to judge an entire generation based on their losers, save it for the jokes. Millenials losers are great to dunk on for fun. As one, the opportunity is ripe. Oh, and of the full time employed cohorts,  millenials work more hours than gen-x. permalink parent award report block reply view 1 more comments...\nHoganT 1 points 4 days ago Ok, boomer. You’re the one that has spent your entire life voting us down the river to where we are today. permalink parent award report block reply view 1 more comments...\ndeleted 5 points 4 days ago TravisRSCX 6 points 4 days ago Honestly government guaranteed loans have driven up college costs the most. Goes along with the 40 million people on snap benefits driving up food costs as well. I’m all for assisting people that need assistance, but the ones taking advantage of this needs to be taken off this. permalink parent award report block reply deleted 4 points 4 days ago view 2 more comments... HockeyMom4Trump 3 points 4 days ago Government needs to get out of the loan business. permalink parent award report block reply PsychoDodo 1 points 4 days ago This. Welfare and socalist programs drive out the capitalist push since it gives an unfair advantage to those that use (or lack of use) them. The hard worker and middle class gets crushed in the press against those with old wealth (The rich get richer) and those on assistance (the poor loafing around and coasting rather than utilizing it to speed run to the top) When you can get a grant for your gender studies so the collage  jacks up the cost of it to $80,000 to grift off the govt handout, pay $60/mo rent and get $4000/mo in food stamps it obliterates anyone in the middle class from even having a chance. Toss in DEI quotas and you're really fucked. You either can't get into the program because it's full up or you can't afford it. permalink parent award report block reply CryingBanshee 4 points 4 days ago Regardless of you GI benefits, I would bet you were told throughout your entire k-12 schooling that you should go to college, and student loans were a tool to get through college, and that student loans would pay themselves back when you got a great job after college.\nThat you didnt graduate from debt is great, but my point was that going to college come hell or high debt was ingrained in us from a young age through school and society, decades before Obama was a politician. permalink parent award report block reply deleted 3 points 4 days ago view 1 more comments... HockeyMom4Trump 0 points 4 days ago Your username is fitting. Cryingbanshee. I am seeing a lot of whining from you. I have two sons. Both attended college. One is still there. Another graduated law school. No debt. They have worked their asses off. There are ways to attend school and not take out loans. If you did this, perhaps instead of whining, figure out how to get a job and start paying back your debt. No one forced you to do anything. permalink parent award report block reply view 1 more comments...\nTravisRSCX 6 points 4 days ago Honestly government guaranteed loans have driven up college costs the most. Goes along with the 40 million people on snap benefits driving up food costs as well. I’m all for assisting people that need assistance, but the ones taking advantage of this needs to be taken off this. permalink parent award report block reply deleted 4 points 4 days ago view 2 more comments... HockeyMom4Trump 3 points 4 days ago Government needs to get out of the loan business. permalink parent award report block reply PsychoDodo 1 points 4 days ago This. Welfare and socalist programs drive out the capitalist push since it gives an unfair advantage to those that use (or lack of use) them. The hard worker and middle class gets crushed in the press against those with old wealth (The rich get richer) and those on assistance (the poor loafing around and coasting rather than utilizing it to speed run to the top) When you can get a grant for your gender studies so the collage  jacks up the cost of it to $80,000 to grift off the govt handout, pay $60/mo rent and get $4000/mo in food stamps it obliterates anyone in the middle class from even having a chance. Toss in DEI quotas and you're really fucked. You either can't get into the program because it's full up or you can't afford it. permalink parent award report block reply\ndeleted 4 points 4 days ago view 2 more comments...\nHockeyMom4Trump 3 points 4 days ago Government needs to get out of the loan business. permalink parent award report block reply\nPsychoDodo 1 points 4 days ago This. Welfare and socalist programs drive out the capitalist push since it gives an unfair advantage to those that use (or lack of use) them. The hard worker and middle class gets crushed in the press against those with old wealth (The rich get richer) and those on assistance (the poor loafing around and coasting rather than utilizing it to speed run to the top) When you can get a grant for your gender studies so the collage  jacks up the cost of it to $80,000 to grift off the govt handout, pay $60/mo rent and get $4000/mo in food stamps it obliterates anyone in the middle class from even having a chance. Toss in DEI quotas and you're really fucked. You either can't get into the program because it's full up or you can't afford it. permalink parent award report block reply\nCryingBanshee 4 points 4 days ago Regardless of you GI benefits, I would bet you were told throughout your entire k-12 schooling that you should go to college, and student loans were a tool to get through college, and that student loans would pay themselves back when you got a great job after college.\nThat you didnt graduate from debt is great, but my point was that going to college come hell or high debt was ingrained in us from a young age through school and society, decades before Obama was a politician. permalink parent award report block reply deleted 3 points 4 days ago view 1 more comments... HockeyMom4Trump 0 points 4 days ago Your username is fitting. Cryingbanshee. I am seeing a lot of whining from you. I have two sons. Both attended college. One is still there. Another graduated law school. No debt. They have worked their asses off. There are ways to attend school and not take out loans. If you did this, perhaps instead of whining, figure out how to get a job and start paying back your debt. No one forced you to do anything. permalink parent award report block reply view 1 more comments...\ndeleted 3 points 4 days ago view 1 more comments...\nHockeyMom4Trump 0 points 4 days ago Your username is fitting. Cryingbanshee. I am seeing a lot of whining from you. I have two sons. Both attended college. One is still there. Another graduated law school. No debt. They have worked their asses off. There are ways to attend school and not take out loans. If you did this, perhaps instead of whining, figure out how to get a job and start paying back your debt. No one forced you to do anything. permalink parent award report block reply view 1 more comments...\nSaltyminer11 4 points 4 days ago The colleges and universities started going after every breathing human to go to college. Lowering standards and accepting people who really had no business going past high school. The money got easier so they lowered the standards. Whether one agrees or not, not everyone is college material. permalink parent award report block reply\nAquamine-Amarine 2 points 4 days ago I agree with you, I was born in the 90's. The schools, teachers, parents, etc. have been pushing this stuff onto impressionable kids for a long time. Kids don't know any better, they don't understand the huge amount of debt they're taking on. They want to trust what the adults around them are saying because surely they wouldn't lie to them, right? Except they WERE lied to. College ended up not being worth it for some people. permalink parent award report block reply\nRuprechtThaMonkeyBoy 1 points 4 days ago You’re the exception, not the rule. Being born in the early eighties, plus having parents with the values you described definitely put you on firm footing. To be fair the start of college degree inflation originated under the Bush Jr. administration, when the utilization of GI Bill benefits  fattened the wallets of our Universities. Like anything else in life where the government is a large customer, prices go up. Back in 2008, Tulane Freeman School of business was offering an Executive MBA for $55k. It’s now $100k. While seriously inflated, you could still pay that off in a reasonable time based upon the doors it would open. A masters degree in social work at the same tuition? Best of luck. The dumb degree part came later when the Obama’s pushed for woke liberal arts degrees over STEM-focused ones. permalink parent award report block reply BoltCarrierGroup 1 points 4 days ago GI bill recipients are a tiny fraction of any of the money colleges receive. Only half of veterans even use a portion of their GI bill. But less than a fifth of veterans have a Bachelor's degree so it shows most don’t use the entire benefit, just a portion. Student loans are what drove government inflation of tuition, not the GI bill. GI bill has been around since ww2 permalink parent award report block reply\nBoltCarrierGroup 1 points 4 days ago GI bill recipients are a tiny fraction of any of the money colleges receive. Only half of veterans even use a portion of their GI bill. But less than a fifth of veterans have a Bachelor's degree so it shows most don’t use the entire benefit, just a portion. Student loans are what drove government inflation of tuition, not the GI bill. GI bill has been around since ww2 permalink parent award report block reply\nViagraFalls 15 points 4 days ago That was the boomer message to the youth. Go to college. It’s the most wonderful thing in the world. permalink parent award report block reply Klaus73 6 points 4 days ago It is if you bothered to go into a productive field. Learning on the job is great; but your seniors get busy and likely don't have the time to teach you the finer points of structural engineering or architecture which can cost lives when a novice fucks up. The problem is that folks opened and branched into useless fields and when they realized there were no jobs for that field...they MADE jobs by teaching the dead end to others. permalink parent award report block reply ViagraFalls 1 points 4 days ago You forgot any more legitimate fields but they shipped the jobs somewhere else or bright in H1-B holders. You didn’t mention the correlation offered as causation. People with college degrees make more money in their lifetimes even if it’s basket weaving. School and work success are tied to intelligence and conscientiousness. College can be 4 years or more and $10s of thousands of dollars just to try showing you have more conscientious and maybe intelligence. permalink parent award report block reply PatriotSkorzeny 1 points 4 days ago Egyptology. permalink parent award report block reply Klaus73 1 points 4 days ago Perfect example - really all colleges should be required to show job stats for every occupation. permalink parent award report block reply MyNameIsTaxpayer 2 points 4 days ago Boomers propping up that self-esteem permalink parent award report block reply\nKlaus73 6 points 4 days ago It is if you bothered to go into a productive field. Learning on the job is great; but your seniors get busy and likely don't have the time to teach you the finer points of structural engineering or architecture which can cost lives when a novice fucks up. The problem is that folks opened and branched into useless fields and when they realized there were no jobs for that field...they MADE jobs by teaching the dead end to others. permalink parent award report block reply ViagraFalls 1 points 4 days ago You forgot any more legitimate fields but they shipped the jobs somewhere else or bright in H1-B holders. You didn’t mention the correlation offered as causation. People with college degrees make more money in their lifetimes even if it’s basket weaving. School and work success are tied to intelligence and conscientiousness. College can be 4 years or more and $10s of thousands of dollars just to try showing you have more conscientious and maybe intelligence. permalink parent award report block reply PatriotSkorzeny 1 points 4 days ago Egyptology. permalink parent award report block reply Klaus73 1 points 4 days ago Perfect example - really all colleges should be required to show job stats for every occupation. permalink parent award report block reply\nViagraFalls 1 points 4 days ago You forgot any more legitimate fields but they shipped the jobs somewhere else or bright in H1-B holders. You didn’t mention the correlation offered as causation. People with college degrees make more money in their lifetimes even if it’s basket weaving. School and work success are tied to intelligence and conscientiousness. College can be 4 years or more and $10s of thousands of dollars just to try showing you have more conscientious and maybe intelligence. permalink parent award report block reply\nPatriotSkorzeny 1 points 4 days ago Egyptology. permalink parent award report block reply Klaus73 1 points 4 days ago Perfect example - really all colleges should be required to show job stats for every occupation. permalink parent award report block reply\nKlaus73 1 points 4 days ago Perfect example - really all colleges should be required to show job stats for every occupation. permalink parent award report block reply\nMyNameIsTaxpayer 2 points 4 days ago Boomers propping up that self-esteem permalink parent award report block reply\nSmurfection 11 points 4 days ago I think this is true and very real.  For most of our lived American history, Boomers have been been the more numerous generational cohort and because of their numbers, they've never had to really struggle other than finding a new job or being drafted for the Vietnam War.  Nixon ended the draft. That generation has never known how to save or every experienced a situation where money didn't grow on trees and they got the inheritance from the Greatest Generation in more ways than one. Thus, they have no idea how misled and taken advantage of the millennials and Gen Z are.  Heck, they don't even admit the substance abuse problem, gang problem and single parent problem smacked Gen X right in the face, because the Boomers caused the sexual revolution, the proliferation of narcotics and education is the answer (that is, college) as the solution to every problem. They however went to public school went it actually taught real subjects.  College was pretty cheap up until the 1980's.  It was somewhere along that time that government started backing student loans and as the amount being backed rose, the colleges just increased tuition.  At the same time, colleges got more irrelevant and stupid along with public education.  They started teaching more and more Marxist trash and less and less of real subjects.   I think it was explained in something I read that colleges needed to hire more female professors because Boomers were insisting on equal rights for women but there weren't enough actual academic women who could teach actual academic subjects, so they started hiring women to teach Gender Theory and women studies.  This eventually morphed into gay studies, Queer studies, black studies etc.   These aren't real studies and they aren't academic.  They're marxist propaganda and there's literally no dissent among \"scholars\" who teach these studies.  It's almost pure propaganda.   In time, the political propaganda that came from the \"studies\" departments took over academia wholesale and now we're living in \"math is racist\" times. The average student walks out of college with $100 K in student loans, very little prospects for a good job and a degree in something that relies on being hired or subsidies by the government such as social work, any political marxist things, gender theory, etc. I've been hoping for this repudiation of Boomers my whole life.  I always thought, as  a Gen X woman, the moment Boomers didn't have all the clout anymore, there was going to be a seismic change in our politics.  What boomers took as unquestioned principles were going to be challenged and crash and burn.  Boomer may have been young and optimistic when they started their revolution, but they didn't accomplish anything but screw up life for everyone generation after them while claiming they were the young generation while into the 60's and 70's.  A lot of them still think they're hip and cool. The sad fact is Gen X pretty much knows this but the reality is Gen X can't do anything about fixing the problem the right way because thanks to the pill and abortion and the myth of overpopulation, Gen X has been decimated and is too small a cohort to ever really gain political clout.  It's got to come down to Gen X convincing MIllennials not to become socialists and communists. permalink award report block reply Wearyman 7 points 4 days ago Fellow Gen X here.  You hit the nail on the head.  Boomers really don't get it.  With only a few exceptions, as a cohort their entire lives they had it almost embarrassingly easy.  Despite that they embraced Communism and Socialism writ large as well as Abortion and every other leftist bullshit philosophy and through that utterly destroyed GenX physically (Through the murder of more than half our numbers) and nearly economically, by not passing on the economies and the wealth that was passed to them by the Greatest and Silent generations. GenX understands the suffering of the Z's and even the late Millennials.  We know, because we suffered at the hands of Boomers too, just in a different way.  But we are so small as a cohort we can't do anything about it. permalink parent award report block reply Smurfection 1 points 4 days ago Exactly right.  Boomers thought they'd be honored as the greatest generation even more than the greatest generations but in reality, they are the absolute worse generation since the antebellum days before the Civil War. permalink parent award report block reply mav7579 -1 points 4 days ago Why do you throw all boomer in one category?  The majority of boomers are not upper class or even upper middle class.  Most of them are working class (or lower) and experienced many difficulties.  Many boomers started with nothing.  When they were starting out, they  were hit with the 70 stagflation followed by a nasty recession in the early 80s.  There were numerous recessions after that (late 80s, early 90s, early 00s, and the big one (2008).  Perhaps boomers with money lucked out. permalink parent award report block reply mav7579 3 points 4 days ago Like the average rank and file boomer had any clout to change anything.  Append the word \"elites\" after each mention of boomer and your post makes more sense. permalink parent award report block reply Smurfection 1 points 4 days ago it wasn't elitist boomers that burned their bras and went around saying the only difference between men and women is genitals.  It was boomer women en masse.  The same ones that pushed for no-fault divorce, family courts that are way too friendly to mothers that break up families.  It was both men and women who shacked up and said \"marriage is just a peace of paper\".  Shacking up was rare and almost unheard of before Boomers decided \"marriage is a piece of paper\" and now, almost all couples shack up.  Due to the inherent instability in shacking up, the postpones marriages and having children.  Whereas a first child born to a woman historically is between 18 and 22, it's now being pushed out to age 30 and older. It's boomers that started with the push to legalize drugs, laughed at people who said the gang problem was a real problem and it was boomers that glorified and apologized for gang culture from 2LiveCrew right on up to the LA riots. Bill Clinton wasn't an elitist when as a the son of a single mom from Arkansas, he dodged the draft and told the draft official he \"Loathed the military\".   Obama wasn't an elitist when he arrived at Occidental and decided he would make friends with only communists and socialists. Hillary wasn't an elitist when she befriended Saul Alinsky. permalink parent award report block reply mav7579 1 points 3 days ago It was boomer women en masse. Ok so it's boomer women.  Why blame the hard working men that were victims of no-fault divorce? BTW those guys did become elitists. permalink parent award report block reply Smurfection 2 points 2 days ago umm, no.  IT's was boomer men that decided they shouldn't be alcholics like their dads and instead became junkies, then alcoholics.  They started yelling that pornography was a constitutional right under \"Freedom of speech\" and then decided they need to \"test a car out on a drive before they buy it\" but left hoardes of children with loose women and walked out on their obligations. The men stopped being sober, responsible men which is what made women decide they could \"bring home the bacon and fry and it up in a pan\". Both sexes and genders of the Boomer generation failed miserably in every way and only ever looked at their own creature comforts and now in their old age, they think they've earned the respect of younger generations.  Just because they spat, ,squashed, rejected and turned their backs on their parents, the greatest and silent generations until they were thirty five years old and then started lauding them as the best thing since sliced bread, they think they should be understood and lauded now.  Bullshit!  As a generation, boomers were selfish brats that had everything great about western civiliation handed to them on a silver platter and decide to exchange it for dung worshipping gurus, nonsense books and ubiquitous porn. permalink parent award report block reply view 2 more comments... flashersenpai -1 points 4 days ago do they vote or not? are they glued to cable news or not? permalink parent award report block reply RedStoneDeepState -1 points 4 days ago they've never had to really struggle other than finding a new job or being drafted for the Vietnam War ...stagflation was a fucking bitch. I have it better than Boomers as Gen Z - you fuckers are just lazy The average student walks out of college with $100 K in student loans Average student loan debt is $38,290. If I graduated college like that with no equity at 22 like a \"normal person\" I would still have a net worth of about 300k right now at 26. I am at about 2.5 million though at 26, despite the fact that I came from a single father household that was paycheck to paycheck. permalink parent award report block reply Smurfection 1 points 4 days ago You've done well for yourself.  I took the $100,000 number for the entire amount of debt my nieces and nephews had respectively after college. I'm not a boomer.  I'm Gen X. so do you think there isn't a debt crisis with Gen Z and buying a home is affordable?   My Gen Z kids don't think it's affordable for most Gen Z. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago so do you think there isn't a debt crisis with Gen Z and buying a home is affordable? Not really. That is my net worth - real estate. I have 5 quadplexes and for each unit they rent for about 720 a month. Each quadplex cost something between 300k and 400k each. I have a house in Camden Arkansas renting for 650 a month. 15k + 30k in rennovations. I have my house in Huntsville I live in. 95k. I have 3 pieces of land, one in Colorado, one in Arkansas and one in Alabama - 75 acres in total. There is a condo in Ulaanbaatar Mongolia that rents for $650 USD a month. With our jobs I make 137k, my wife makes 86k. Granted I started working at 15 and put most of my money into hard assets. Guns. Then I took my collection down from ~300 to 60. That was my seed money for real estate investing. Granted we are both engineers in the city with the most engineers per capita in the country. permalink parent award report block reply\nWearyman 7 points 4 days ago Fellow Gen X here.  You hit the nail on the head.  Boomers really don't get it.  With only a few exceptions, as a cohort their entire lives they had it almost embarrassingly easy.  Despite that they embraced Communism and Socialism writ large as well as Abortion and every other leftist bullshit philosophy and through that utterly destroyed GenX physically (Through the murder of more than half our numbers) and nearly economically, by not passing on the economies and the wealth that was passed to them by the Greatest and Silent generations. GenX understands the suffering of the Z's and even the late Millennials.  We know, because we suffered at the hands of Boomers too, just in a different way.  But we are so small as a cohort we can't do anything about it. permalink parent award report block reply Smurfection 1 points 4 days ago Exactly right.  Boomers thought they'd be honored as the greatest generation even more than the greatest generations but in reality, they are the absolute worse generation since the antebellum days before the Civil War. permalink parent award report block reply mav7579 -1 points 4 days ago Why do you throw all boomer in one category?  The majority of boomers are not upper class or even upper middle class.  Most of them are working class (or lower) and experienced many difficulties.  Many boomers started with nothing.  When they were starting out, they  were hit with the 70 stagflation followed by a nasty recession in the early 80s.  There were numerous recessions after that (late 80s, early 90s, early 00s, and the big one (2008).  Perhaps boomers with money lucked out. permalink parent award report block reply\nSmurfection 1 points 4 days ago Exactly right.  Boomers thought they'd be honored as the greatest generation even more than the greatest generations but in reality, they are the absolute worse generation since the antebellum days before the Civil War. permalink parent award report block reply\nmav7579 -1 points 4 days ago Why do you throw all boomer in one category?  The majority of boomers are not upper class or even upper middle class.  Most of them are working class (or lower) and experienced many difficulties.  Many boomers started with nothing.  When they were starting out, they  were hit with the 70 stagflation followed by a nasty recession in the early 80s.  There were numerous recessions after that (late 80s, early 90s, early 00s, and the big one (2008).  Perhaps boomers with money lucked out. permalink parent award report block reply\nmav7579 3 points 4 days ago Like the average rank and file boomer had any clout to change anything.  Append the word \"elites\" after each mention of boomer and your post makes more sense. permalink parent award report block reply Smurfection 1 points 4 days ago it wasn't elitist boomers that burned their bras and went around saying the only difference between men and women is genitals.  It was boomer women en masse.  The same ones that pushed for no-fault divorce, family courts that are way too friendly to mothers that break up families.  It was both men and women who shacked up and said \"marriage is just a peace of paper\".  Shacking up was rare and almost unheard of before Boomers decided \"marriage is a piece of paper\" and now, almost all couples shack up.  Due to the inherent instability in shacking up, the postpones marriages and having children.  Whereas a first child born to a woman historically is between 18 and 22, it's now being pushed out to age 30 and older. It's boomers that started with the push to legalize drugs, laughed at people who said the gang problem was a real problem and it was boomers that glorified and apologized for gang culture from 2LiveCrew right on up to the LA riots. Bill Clinton wasn't an elitist when as a the son of a single mom from Arkansas, he dodged the draft and told the draft official he \"Loathed the military\".   Obama wasn't an elitist when he arrived at Occidental and decided he would make friends with only communists and socialists. Hillary wasn't an elitist when she befriended Saul Alinsky. permalink parent award report block reply mav7579 1 points 3 days ago It was boomer women en masse. Ok so it's boomer women.  Why blame the hard working men that were victims of no-fault divorce? BTW those guys did become elitists. permalink parent award report block reply Smurfection 2 points 2 days ago umm, no.  IT's was boomer men that decided they shouldn't be alcholics like their dads and instead became junkies, then alcoholics.  They started yelling that pornography was a constitutional right under \"Freedom of speech\" and then decided they need to \"test a car out on a drive before they buy it\" but left hoardes of children with loose women and walked out on their obligations. The men stopped being sober, responsible men which is what made women decide they could \"bring home the bacon and fry and it up in a pan\". Both sexes and genders of the Boomer generation failed miserably in every way and only ever looked at their own creature comforts and now in their old age, they think they've earned the respect of younger generations.  Just because they spat, ,squashed, rejected and turned their backs on their parents, the greatest and silent generations until they were thirty five years old and then started lauding them as the best thing since sliced bread, they think they should be understood and lauded now.  Bullshit!  As a generation, boomers were selfish brats that had everything great about western civiliation handed to them on a silver platter and decide to exchange it for dung worshipping gurus, nonsense books and ubiquitous porn. permalink parent award report block reply view 2 more comments... flashersenpai -1 points 4 days ago do they vote or not? are they glued to cable news or not? permalink parent award report block reply\nSmurfection 1 points 4 days ago it wasn't elitist boomers that burned their bras and went around saying the only difference between men and women is genitals.  It was boomer women en masse.  The same ones that pushed for no-fault divorce, family courts that are way too friendly to mothers that break up families.  It was both men and women who shacked up and said \"marriage is just a peace of paper\".  Shacking up was rare and almost unheard of before Boomers decided \"marriage is a piece of paper\" and now, almost all couples shack up.  Due to the inherent instability in shacking up, the postpones marriages and having children.  Whereas a first child born to a woman historically is between 18 and 22, it's now being pushed out to age 30 and older. It's boomers that started with the push to legalize drugs, laughed at people who said the gang problem was a real problem and it was boomers that glorified and apologized for gang culture from 2LiveCrew right on up to the LA riots. Bill Clinton wasn't an elitist when as a the son of a single mom from Arkansas, he dodged the draft and told the draft official he \"Loathed the military\".   Obama wasn't an elitist when he arrived at Occidental and decided he would make friends with only communists and socialists. Hillary wasn't an elitist when she befriended Saul Alinsky. permalink parent award report block reply mav7579 1 points 3 days ago It was boomer women en masse. Ok so it's boomer women.  Why blame the hard working men that were victims of no-fault divorce? BTW those guys did become elitists. permalink parent award report block reply Smurfection 2 points 2 days ago umm, no.  IT's was boomer men that decided they shouldn't be alcholics like their dads and instead became junkies, then alcoholics.  They started yelling that pornography was a constitutional right under \"Freedom of speech\" and then decided they need to \"test a car out on a drive before they buy it\" but left hoardes of children with loose women and walked out on their obligations. The men stopped being sober, responsible men which is what made women decide they could \"bring home the bacon and fry and it up in a pan\". Both sexes and genders of the Boomer generation failed miserably in every way and only ever looked at their own creature comforts and now in their old age, they think they've earned the respect of younger generations.  Just because they spat, ,squashed, rejected and turned their backs on their parents, the greatest and silent generations until they were thirty five years old and then started lauding them as the best thing since sliced bread, they think they should be understood and lauded now.  Bullshit!  As a generation, boomers were selfish brats that had everything great about western civiliation handed to them on a silver platter and decide to exchange it for dung worshipping gurus, nonsense books and ubiquitous porn. permalink parent award report block reply view 2 more comments...\nmav7579 1 points 3 days ago It was boomer women en masse. Ok so it's boomer women.  Why blame the hard working men that were victims of no-fault divorce? BTW those guys did become elitists. permalink parent award report block reply Smurfection 2 points 2 days ago umm, no.  IT's was boomer men that decided they shouldn't be alcholics like their dads and instead became junkies, then alcoholics.  They started yelling that pornography was a constitutional right under \"Freedom of speech\" and then decided they need to \"test a car out on a drive before they buy it\" but left hoardes of children with loose women and walked out on their obligations. The men stopped being sober, responsible men which is what made women decide they could \"bring home the bacon and fry and it up in a pan\". Both sexes and genders of the Boomer generation failed miserably in every way and only ever looked at their own creature comforts and now in their old age, they think they've earned the respect of younger generations.  Just because they spat, ,squashed, rejected and turned their backs on their parents, the greatest and silent generations until they were thirty five years old and then started lauding them as the best thing since sliced bread, they think they should be understood and lauded now.  Bullshit!  As a generation, boomers were selfish brats that had everything great about western civiliation handed to them on a silver platter and decide to exchange it for dung worshipping gurus, nonsense books and ubiquitous porn. permalink parent award report block reply view 2 more comments...\nSmurfection 2 points 2 days ago umm, no.  IT's was boomer men that decided they shouldn't be alcholics like their dads and instead became junkies, then alcoholics.  They started yelling that pornography was a constitutional right under \"Freedom of speech\" and then decided they need to \"test a car out on a drive before they buy it\" but left hoardes of children with loose women and walked out on their obligations. The men stopped being sober, responsible men which is what made women decide they could \"bring home the bacon and fry and it up in a pan\". Both sexes and genders of the Boomer generation failed miserably in every way and only ever looked at their own creature comforts and now in their old age, they think they've earned the respect of younger generations.  Just because they spat, ,squashed, rejected and turned their backs on their parents, the greatest and silent generations until they were thirty five years old and then started lauding them as the best thing since sliced bread, they think they should be understood and lauded now.  Bullshit!  As a generation, boomers were selfish brats that had everything great about western civiliation handed to them on a silver platter and decide to exchange it for dung worshipping gurus, nonsense books and ubiquitous porn. permalink parent award report block reply view 2 more comments...\nflashersenpai -1 points 4 days ago do they vote or not? are they glued to cable news or not? permalink parent award report block reply\nRedStoneDeepState -1 points 4 days ago they've never had to really struggle other than finding a new job or being drafted for the Vietnam War ...stagflation was a fucking bitch. I have it better than Boomers as Gen Z - you fuckers are just lazy The average student walks out of college with $100 K in student loans Average student loan debt is $38,290. If I graduated college like that with no equity at 22 like a \"normal person\" I would still have a net worth of about 300k right now at 26. I am at about 2.5 million though at 26, despite the fact that I came from a single father household that was paycheck to paycheck. permalink parent award report block reply Smurfection 1 points 4 days ago You've done well for yourself.  I took the $100,000 number for the entire amount of debt my nieces and nephews had respectively after college. I'm not a boomer.  I'm Gen X. so do you think there isn't a debt crisis with Gen Z and buying a home is affordable?   My Gen Z kids don't think it's affordable for most Gen Z. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago so do you think there isn't a debt crisis with Gen Z and buying a home is affordable? Not really. That is my net worth - real estate. I have 5 quadplexes and for each unit they rent for about 720 a month. Each quadplex cost something between 300k and 400k each. I have a house in Camden Arkansas renting for 650 a month. 15k + 30k in rennovations. I have my house in Huntsville I live in. 95k. I have 3 pieces of land, one in Colorado, one in Arkansas and one in Alabama - 75 acres in total. There is a condo in Ulaanbaatar Mongolia that rents for $650 USD a month. With our jobs I make 137k, my wife makes 86k. Granted I started working at 15 and put most of my money into hard assets. Guns. Then I took my collection down from ~300 to 60. That was my seed money for real estate investing. Granted we are both engineers in the city with the most engineers per capita in the country. permalink parent award report block reply\nSmurfection 1 points 4 days ago You've done well for yourself.  I took the $100,000 number for the entire amount of debt my nieces and nephews had respectively after college. I'm not a boomer.  I'm Gen X. so do you think there isn't a debt crisis with Gen Z and buying a home is affordable?   My Gen Z kids don't think it's affordable for most Gen Z. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago so do you think there isn't a debt crisis with Gen Z and buying a home is affordable? Not really. That is my net worth - real estate. I have 5 quadplexes and for each unit they rent for about 720 a month. Each quadplex cost something between 300k and 400k each. I have a house in Camden Arkansas renting for 650 a month. 15k + 30k in rennovations. I have my house in Huntsville I live in. 95k. I have 3 pieces of land, one in Colorado, one in Arkansas and one in Alabama - 75 acres in total. There is a condo in Ulaanbaatar Mongolia that rents for $650 USD a month. With our jobs I make 137k, my wife makes 86k. Granted I started working at 15 and put most of my money into hard assets. Guns. Then I took my collection down from ~300 to 60. That was my seed money for real estate investing. Granted we are both engineers in the city with the most engineers per capita in the country. permalink parent award report block reply\nRedStoneDeepState -3 points 4 days ago so do you think there isn't a debt crisis with Gen Z and buying a home is affordable? Not really. That is my net worth - real estate. I have 5 quadplexes and for each unit they rent for about 720 a month. Each quadplex cost something between 300k and 400k each. I have a house in Camden Arkansas renting for 650 a month. 15k + 30k in rennovations. I have my house in Huntsville I live in. 95k. I have 3 pieces of land, one in Colorado, one in Arkansas and one in Alabama - 75 acres in total. There is a condo in Ulaanbaatar Mongolia that rents for $650 USD a month. With our jobs I make 137k, my wife makes 86k. Granted I started working at 15 and put most of my money into hard assets. Guns. Then I took my collection down from ~300 to 60. That was my seed money for real estate investing. Granted we are both engineers in the city with the most engineers per capita in the country. permalink parent award report block reply\nMySidesGoUp 8 points 4 days ago The same Thiel running around praising the antichrist awakening… permalink award report block reply Nellie_the_Beaut 3 points 4 days ago And bought himself and his “husband” New Zealand citizenship and has a huge land parcel with bunker there, along with all the other uber wealthy swells, for the “end times”? permalink parent award report block reply\nNellie_the_Beaut 3 points 4 days ago And bought himself and his “husband” New Zealand citizenship and has a huge land parcel with bunker there, along with all the other uber wealthy swells, for the “end times”? permalink parent award report block reply\nKlaus73 7 points 4 days ago ..and so Peter Thiel helped build socialisms control mechanisms..Paypal and Palantir are cornerstones of a socialist society where everything is managed and controlled by centralized power. permalink award report block reply Dangerous 5 points 4 days ago The struggle that the Japanese entertainment industry has had with payment processors for the last year proves this. They can shut down any transaction they want at any time for the most disagreeable of reasons and even entire nations can't do anything about it in a timely fashion permalink parent award report block reply Klaus73 1 points 4 days ago Yeeeeep. But hey he gave Trump money so...nothing to see here. Folks are boned. permalink parent award report block reply\nDangerous 5 points 4 days ago The struggle that the Japanese entertainment industry has had with payment processors for the last year proves this. They can shut down any transaction they want at any time for the most disagreeable of reasons and even entire nations can't do anything about it in a timely fashion permalink parent award report block reply Klaus73 1 points 4 days ago Yeeeeep. But hey he gave Trump money so...nothing to see here. Folks are boned. permalink parent award report block reply\nKlaus73 1 points 4 days ago Yeeeeep. But hey he gave Trump money so...nothing to see here. Folks are boned. permalink parent award report block reply\nguywholikesDjtof2024 6 points 4 days ago This is a neutral statement anyone can make. Thieeeel is trying to get us to be in a technocratic EatZeBugz spy dystopia. Soros and gates sure do. We must not allow it ever. RICO palantir, its funders, powerful people, its employees, the whole works. permalink award report block reply DeplorableNeandertal 3 points 4 days ago I agree with you but how thin can maga be spread before it’s diluted to nothing. We are practically already there, the shutdown has totally derailed the administration. And now the left has carefully constructed sound bites and clickbait to turn the EBT Americans and the youfs totally against us. On top of the already existing Israel fatigue I don’t know how Trump can recover. Maybe this end the filibuster rhetoric will hop off the headline and into reality but I doubt it. permalink parent award report block reply Klaus73 1 points 4 days ago Your not wrong. Its not just the left though that is trying to craft a narrative and even now when the right lies to its own base rather then simply facing the music it only emboldens the left not to let up - because every time the right lies the left will put it on blast everywhere and it bolsters their numbers. Trump is burning through political capital and is trying tp end the fillibuster because he has pretty much ruined any chance of good will with past decisions; he didn't seek out the more level headed democrats - instead he just chose to ignore them even though they still represent his people (Americans) and without the fillibuster its only a matter of time before some of the more fair-weather republicans (RINOS) see the opportunity to get rid of him; and if the midterms go poorly they will and if Trump persists trying to gaslight folks that the tough times that were expected in enacting his goals are not that bad; people are going to call bullshit and go to people offering a lie that seems better. I worry Trump isn't driving; his own admin is running itself and just letting him say shit; the project 2025 types don't always align with MAGA and don't always align with America; they'll let Trump burn for their own goals. Folks need to have a hard talk and the government needs to acknowledge the how and why rather then pretending otherwise. Both sides are talking out of both sides of their mouth like with this SNAP shit and really its going to cost the republicans whatever they gained. permalink parent award report block reply\nDeplorableNeandertal 3 points 4 days ago I agree with you but how thin can maga be spread before it’s diluted to nothing. We are practically already there, the shutdown has totally derailed the administration. And now the left has carefully constructed sound bites and clickbait to turn the EBT Americans and the youfs totally against us. On top of the already existing Israel fatigue I don’t know how Trump can recover. Maybe this end the filibuster rhetoric will hop off the headline and into reality but I doubt it. permalink parent award report block reply Klaus73 1 points 4 days ago Your not wrong. Its not just the left though that is trying to craft a narrative and even now when the right lies to its own base rather then simply facing the music it only emboldens the left not to let up - because every time the right lies the left will put it on blast everywhere and it bolsters their numbers. Trump is burning through political capital and is trying tp end the fillibuster because he has pretty much ruined any chance of good will with past decisions; he didn't seek out the more level headed democrats - instead he just chose to ignore them even though they still represent his people (Americans) and without the fillibuster its only a matter of time before some of the more fair-weather republicans (RINOS) see the opportunity to get rid of him; and if the midterms go poorly they will and if Trump persists trying to gaslight folks that the tough times that were expected in enacting his goals are not that bad; people are going to call bullshit and go to people offering a lie that seems better. I worry Trump isn't driving; his own admin is running itself and just letting him say shit; the project 2025 types don't always align with MAGA and don't always align with America; they'll let Trump burn for their own goals. Folks need to have a hard talk and the government needs to acknowledge the how and why rather then pretending otherwise. Both sides are talking out of both sides of their mouth like with this SNAP shit and really its going to cost the republicans whatever they gained. permalink parent award report block reply\nKlaus73 1 points 4 days ago Your not wrong. Its not just the left though that is trying to craft a narrative and even now when the right lies to its own base rather then simply facing the music it only emboldens the left not to let up - because every time the right lies the left will put it on blast everywhere and it bolsters their numbers. Trump is burning through political capital and is trying tp end the fillibuster because he has pretty much ruined any chance of good will with past decisions; he didn't seek out the more level headed democrats - instead he just chose to ignore them even though they still represent his people (Americans) and without the fillibuster its only a matter of time before some of the more fair-weather republicans (RINOS) see the opportunity to get rid of him; and if the midterms go poorly they will and if Trump persists trying to gaslight folks that the tough times that were expected in enacting his goals are not that bad; people are going to call bullshit and go to people offering a lie that seems better. I worry Trump isn't driving; his own admin is running itself and just letting him say shit; the project 2025 types don't always align with MAGA and don't always align with America; they'll let Trump burn for their own goals. Folks need to have a hard talk and the government needs to acknowledge the how and why rather then pretending otherwise. Both sides are talking out of both sides of their mouth like with this SNAP shit and really its going to cost the republicans whatever they gained. permalink parent award report block reply\nsleepinggiant 6 points 4 days ago Guess 92% of productivity gains over the past 40 years shouldnt have gone to corporations permalink award report block reply\ndoodaddy 5 points 4 days ago Are we trying to frame Thiel, and especially Zuck and Andreessen as robber barons with hearts of gold?  These guys would kill their own mother for a dollar. permalink award report block reply\nCleanUpPhillyTrump24 4 points 4 days ago I would put Tiny Houses or modular/pre fab ADUs on my small vacant lots if ONLY THE CITY WOULD LET ME. That would mean I could rent them for half to three quarters the going average rent in that zip code, which is fine. I'd just plan to do two instead of one. That would be a whole new business model for me. BUT THE CITY WILL NOT ALLOW IT. These are very high end, lux little structures. They're just small. It would allow me to create side yards, front yards, back yards, out of the remainder of the tiny lot. These would be charming, sought after solutions to living in the city. BUT THE DEMS HERE REFUSE TO LET BUILDERS BUILD PRIVATE AFFORDABLE HOUSING. The reason for this high rent and partly the reason for high home prices is that too many cities that have potential for more housing stock just prevent new construction so that Trump voters won't move in. Blue city Dems ONLY want welfare cases to live in Philly. Anyone else risks their monopoly. I have vacant lots that are so small that I have to get variances to go higher, build taller. To replace the house that was there with the exact dimensions is not most of the time feasible on cost. It costs as much or more to build new as it was. You won't get more than you spend. But to build by right on property you own, the city won't let you adapt without going through a long expensive process requiring architects, lawyers. Philly had affordable housing built by the private market when the city allowed builders to build it. But Dems only want to be able to hand property they seize to their donors who get \"community development block grants\" that build non-property tax paying public housing that is a blight on the city. permalink award report block reply\ngrannylovestrump 4 points 4 days ago and the worst part they don't understand is the commies are intentiionally crashing the economy to usher it in so they blame us when it is the commies and now they will bow down to their oppressors and what they thought was bad will now get worst. My children perish for lack of knowledge permalink award report block reply\nLORDFALCONE 3 points 4 days ago Is this the gay Jew who has exclusive satanic parties at Dracula's castle on Halloween every year? permalink award report block reply\nHankScorpio 3 points 4 days ago The Reptile. permalink award report block reply\nmav7579 3 points 4 days ago Isn't that JD Vance's guy? permalink award report block reply\nTrue_Curmudgeon 3 points 4 days ago I hate having these conversations in the context of keeping our Globalist central bank and those it serves around permalink award report block reply\nCreepy_Joe 3 points 4 days ago If you dumb ass boomers can't figure out why your kids hate you when they are riddled with $500,000 in debt before their first real job, while the average house costs $400,000, and they are being called lazy by you boomer assholes who paid $500 for your degree, and bought your first home for $5,000 and a six pack of Bud Light, then you're the problem. permalink award report block reply\ncarbonsteel 2 points 4 days ago Here is a simple answer  0% interest student loans …. That’s it . Allow everyone to roll over existing loans into permalink award report block reply\nYearninNation 2 points 4 days ago How about addressing usury, compound interest, mandatory insurance. and income tax? permalink award report block reply\nDustyGoose 2 points 4 days ago This makes sense, but I was told Thiel was the antichrist? permalink award report block reply\njsphere256 2 points 4 days ago Who is taking their capital? permalink award report block reply\nYignuced 2 points 4 days ago I don’t understand this at all.  How do they not have a stake in the capitalist system?  Everyone has a stake.  Peter Theil and others are putting that thought in the heads of young people, IMO.  “You don’t have a stake because boomers and billionaires ruined our economy and horde money from you.  Communism will level the playing field”.  Peter Theil is gay and so is this theory. permalink award report block reply\nhenri_derelicte 2 points 4 days ago We need to be mindful of the semantics of “affordable housing.” Housing should be affordable in the sense that the average person can buy it. When leftists refer to affordable housing, they typically mean something government-mandated for people below a certain income level. I hate seeing the YIMBY types because they think upzoning is the only solution to our problems. In reality, it allows governments to get more people and more tax revenue without solving the underlying problems (namely crime) of certain neighborhoods. Deal with the crime problems and there will be large swaths of housing that is affordable for people to purchase permalink award report block reply\ngunzby 2 points 4 days ago All you need is a pied piper to convince the dumb masses that they'll get everything for nothing and they will dutifully line up not knowing they will get nothing and it'll cost them everything. permalink award report block reply\nMegoThor 2 points 4 days ago That’s a feature, not a bug. permalink award report block reply\nAwakened 1 points 4 days ago No shit. End immigration and then welfare and everything is fixed. Won't happen though. Globalization is here. Trump is spending more time on overseas problems than home. permalink award report block reply\nMagaman4200 1 points 4 days ago Valid concerns - supply and demand issues can be resolved through deporting illegals permalink award report block reply\nLordCommissarYarrick 1 points 4 days ago People and corporations buying up multiple homes sure don't help anything. There should be a limit to how many houses one can buy. permalink award report block reply\nObambi 1 points 4 days ago He’s right about the student debt crisis. Trump doesn’t understand that his own GOP wants him to go after student loan debt people to never get that young college people ever. That’s why they killed Kirk, he was getting the young folks. permalink award report block reply\nDITTOPatriot 1 points 4 days ago The administration hasn't even reached Biden levels of deportation. The border is better for sure, but that was the easy fix. permalink award report block reply\nLiberats 1 points 4 days ago There is a reason. They are stupid. permalink award report block reply\nSaltyminer11 1 points 4 days ago And the fact they are being propagandised into it. permalink award report block reply\ngb1787 1 points 4 days ago Wait till these retards find out what stake they get in a socialist system permalink award report block reply henri_derelicte 1 points 4 days ago The reason people want socialism is because they think they’ll be subsidized. Look at how things are going in the UK. Who’s really getting subsidized? Not regular White Britons. It’s the Somalis (only 10% of them have a full time job) getting subsidized. permalink parent award report block reply\nhenri_derelicte 1 points 4 days ago The reason people want socialism is because they think they’ll be subsidized. Look at how things are going in the UK. Who’s really getting subsidized? Not regular White Britons. It’s the Somalis (only 10% of them have a full time job) getting subsidized. permalink parent award report block reply\nRedCalifornia 1 points 4 days ago By design. permalink award report block reply\nPapabravo12 1 points 4 days ago To me it’s mostly about education. We don’t actually teach anyone history from a pro American perspective anymore. Yes, the economic factors are what making communism appealing and the desire to burn it all down, but it doesn’t help that we teach the young people that it’s just as good of a system (even though it’s never worked) and doesn’t kill people, white American men do permalink award report block reply\nFusionBlack 1 points 4 days ago Most of our ills sprout from the pampered expected lifestyles people \"demand\". Just look at the response to the SNAP cut backs. Generations now making it a lifestyle . Four kids from different breeders and the country is made to support the bad decisions of these \"victims\" as portrayed by the media. Everyone Demands a new home ,food, healthcare and a basic income even illegals and the vermin legal citizens that support them.\nI didn't ask for any help when I was destitute . I worked 2 jobs and survived on $20 a week for food. The day old bread store was a staple. If we ever had a large downturn in the economy or God forbid a war the violence would be unfathomable. Maybe its needed for a course corrector. permalink award report block reply\n2016TrumpMAGA 1 points 4 days ago I blame it all on student loans. You cannot enslave young people with tens of thousands of dollars in debt, requiring them to make thousand dollar a month payments through their twenties and early thirties and expect them to be able to start families and buy homes. Average student loan debt is almost $40,000.  If you graduated at age 22 with $40,000 in student loan debt, you pay $470/month until you are 32 to pay it off.  That is ridiculous. The average student loan debt for graduate school is about $88,220.  That's $1025/month, PLUS $470/month.  For a doctorate it's $250,000.  $2900/month. None of which has a hope in hell of being repaid because some fucking jeet with a fake degree he paid $1000 for will hire other fucking jeets with fake degrees. Student loans need to end NOW, the interest rate on outstanding balances lowered to zero, discharge in bankruptcy permitted, and repayment implemented by payroll deductions over the next 30 years (a $50,000 student loan with zero interest paid off over the next 30 years is only $138/month) with tax benefits for early payoff. permalink award report block reply\nDenturesNancy 1 points 4 days ago one must also factors in that our elected officials swear allegiance to Israel and Israel only, leaving Americans homeless and without care.  protecting Israel's genociding people around it has pushed everyone including myself into siding with the oppressed.  Israel is rich, powerful and does not need our taxpayers money to have free Healthcare, free college, and free universal welfare.  I want my tax money to stay in the US and help OUR people first.  Trump's approval has gone way down and the Republicunts are in free fall.  I don't want to keep voting republican just because, and I don't want to vote for the demons.  where does that leave me?  not vote at all?  Trump and the GOP must think very hard about answering the above questions, because come 2026 and 2028, if those are not answered, people will just sit it out or decide to just vote democrap to speed up the downfall.  I tired of being played around with at every election just to see the person I voted for make backroom deals or declare that helping Israel is commanded by God. permalink award report block reply\nGottaSitStand 1 points 4 days ago We need merit-based immigration, not a lottery. With quotas (zero) for hostile countries and fewer restrictions, with no cap on visitors from Poland, and even a simple migration process for Polish people. There is value in having great companies formed here in the USA, but we need more people coming here who are culturally similar to European Americans and share our values. permalink award report block reply\njonnyuno 1 points 4 days ago Again, blue hellholes voted for communists. What is this a surprise?    Also, yes deporting all, including Mamdani will also resolve the problem more quickly. permalink award report block reply\nbagel_fragility 1 points 4 days ago unchecked usury leads to communism permalink award report block reply\ncitydwellertrumpfan 1 points 4 days ago He is right. One of Thiels interesting ideas is seasteading. Living on floating platforms just offshore. This could increase freedom. https://en.wikipedia.org/wiki/Seasteading permalink award report block reply\n5DchessWatch 1 points 4 days ago Damn son, that hits a least one big nail on the head. permalink award report block reply\nHockeyMom4Trump 1 points 4 days ago It’s sort of always been this way. Always a socialist until you get a job and start making your own money. Stop buying so much shit. Live within your means. No one needs a $45 water bottle and an expensive car payment. People have lost their minds to consumerism. No one needs a $34.95 apple slicer from William Sonoma. For years we’ve plucked apples from trees and eaten them simply by taking a bite. permalink award report block reply mav7579 0 points 4 days ago This\nPeople worry too much about impressing others.\nWant the standard of living of someone who started out in the 50s?  Buy the housing and vehicles like they did and go easy on the modern day luxuries. permalink parent award report block reply\nmav7579 0 points 4 days ago This\nPeople worry too much about impressing others.\nWant the standard of living of someone who started out in the 50s?  Buy the housing and vehicles like they did and go easy on the modern day luxuries. permalink parent award report block reply\nthe_new_one 7 points 4 days ago Comment removed upon the user being banned. permalink award report block reply tholinz 7 points 4 days ago Yes but socialism is only going to make all of this worse. permalink parent award report block reply joggin_noggin 4 points 4 days ago If your savings account has $5 in it when payday rolls around, you don't really care about worse because you can't conceptualize being forced at gunpoint to go work in the mines or the fields as a realistic consequence of voting for socialism. permalink parent award report block reply HockeyMom4Trump -5 points 4 days ago No one seems to understand that when you are young, everything is expensive! It’s called starting out. My parents struggled. My grandparents struggled. When you look at life compared to life, young people today have it pretty damn good. My mom and dad had to work their asses off. My dad worked three jobs and was never home when he was young. He worked his day job. Came home, ate a quick dinner (no Door Dash) and then he went and worked mopping floors and cleaning buildings. Then on the weekend he had another job, Every young person sees years and years of struggle and hard work and assumes that came easy. Oh look, grandma and grandpa have a nice house and boat! Waahhh! I have to work. Meanwhile, that took years for grandpa and grandma to earn and build. Every old person I know had a rougher time than the young people I know today. Much rougher. permalink parent award report block reply MasterChief 6 points 4 days ago Pick yerself up by the bootstraps, walk right in to the CEO's office give them a firm handshake and a smile and ask them \"when do I start?\" These young whipper snappers are just so lazy, and have never experienced hardship! They have no idea how bad we had it! permalink parent award report block reply Dangerous 3 points 4 days ago Then they can all continue to get by without forcing the young to pay for medicaid and other socialist government programs. After all, why destroy the young with the burden of socialism if you hate socialism so much? permalink parent award report block reply\ntholinz 7 points 4 days ago Yes but socialism is only going to make all of this worse. permalink parent award report block reply joggin_noggin 4 points 4 days ago If your savings account has $5 in it when payday rolls around, you don't really care about worse because you can't conceptualize being forced at gunpoint to go work in the mines or the fields as a realistic consequence of voting for socialism. permalink parent award report block reply\njoggin_noggin 4 points 4 days ago If your savings account has $5 in it when payday rolls around, you don't really care about worse because you can't conceptualize being forced at gunpoint to go work in the mines or the fields as a realistic consequence of voting for socialism. permalink parent award report block reply\nHockeyMom4Trump -5 points 4 days ago No one seems to understand that when you are young, everything is expensive! It’s called starting out. My parents struggled. My grandparents struggled. When you look at life compared to life, young people today have it pretty damn good. My mom and dad had to work their asses off. My dad worked three jobs and was never home when he was young. He worked his day job. Came home, ate a quick dinner (no Door Dash) and then he went and worked mopping floors and cleaning buildings. Then on the weekend he had another job, Every young person sees years and years of struggle and hard work and assumes that came easy. Oh look, grandma and grandpa have a nice house and boat! Waahhh! I have to work. Meanwhile, that took years for grandpa and grandma to earn and build. Every old person I know had a rougher time than the young people I know today. Much rougher. permalink parent award report block reply MasterChief 6 points 4 days ago Pick yerself up by the bootstraps, walk right in to the CEO's office give them a firm handshake and a smile and ask them \"when do I start?\" These young whipper snappers are just so lazy, and have never experienced hardship! They have no idea how bad we had it! permalink parent award report block reply Dangerous 3 points 4 days ago Then they can all continue to get by without forcing the young to pay for medicaid and other socialist government programs. After all, why destroy the young with the burden of socialism if you hate socialism so much? permalink parent award report block reply\nMasterChief 6 points 4 days ago Pick yerself up by the bootstraps, walk right in to the CEO's office give them a firm handshake and a smile and ask them \"when do I start?\" These young whipper snappers are just so lazy, and have never experienced hardship! They have no idea how bad we had it! permalink parent award report block reply\nDangerous 3 points 4 days ago Then they can all continue to get by without forcing the young to pay for medicaid and other socialist government programs. After all, why destroy the young with the burden of socialism if you hate socialism so much? permalink parent award report block reply\nTheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply"
}