{
  "id": "8185389",
  "title": "58Meet Vanessa Hall-Harper, a Tulsa City Councilmember. She had an unhinged meltdown against White p",
  "url": "https://patriots.win/p/1ARK9nOXGb/meet-vanessa-hallharper-a-tulsa-/c",
  "content": "58 Meet Vanessa Hall-Harper, a Tulsa City Councilmember. She had an unhinged meltdown against White people and the city flag, claiming it’s racist & Oklahoma and America represent the KKK. Your taxes pay her salary. SHE SHOULD RESIGN. You can contact her here 9185961921 or email dist1@tulsacouncil.org posted 4 hours ago by Hammond 7 comments award share report block Libs of TikTok @libsoftiktok • 5h Meet Vanessa Hall-Harper, a Tulsa City Councilmember. She had an unhinged meltdown against white people and the city flag, claiming it’s racist and Oklahoma and America represent the KKK. Your taxes pay her salary. SHE SHOULD RESIGN. You can contact her here 9185961921 or\n7 comments Sort by Top Top New Worst Old Save DirtyDiaperJoe 6 points 4 hours ago This crazy bitch.  They haven't found ONE new \"victim\" of the race massacre, which incidentally, before the new narrative was written, more WHITE people were killed during it. And here we are, digging up graves and desecrating burials trying to find more black \"victims\" to fit the narrative.  This happened in 1921.  When birth certificates AND death certificates were a thing.  Everyone's been accounted for.  Years ago I might add.  There's no Uncle Rastus who was killed and not accounted for...hell, they can't even find any relatives of any more supposed victims.  It's all 100% horseshit made up by the grievance committee so they can get \"their\" reparations...and she's ALWAYS been a crazy bitch.  This is nothing new. permalink award report block reply sobriquet 1 points 3 hours ago Always be hustling 💯 permalink parent award report block reply NotYourMan 1 points 3 hours ago Here comments are funny because the democrats created the KKK and all members were democrats.  Ignorance of history is the worst. permalink parent award report block reply Okie_Life 2 points 3 hours ago “Skinfolk ain’t kinfolk” this lady is crazy. Who’s going to tell her that Tulsa has a black mayor? Provided he is trying to give reparations to rebuild greenwood. Also fun fact, I learned about what happened in 1921 in school, but before 2021 we called it the race riots, and then suddenly it shifted to race massacre. permalink award report block reply DirtyDiaperJoe 1 points 2 hours ago Fun fact.  It was the black people who kicked this off, when they decided to storm the jail to break the black guy out of the it!  Yes, they were going to actually break into the jail and \"free\" the black guy who had sexually assaulted a white girl in an elevator.  And guess what?  The white people got pissed about it and retaliated and burned their shit to the ground. permalink parent award report block reply NotYourMan 2 points 3 hours ago Racism must not be tolerated at all.  Racism against whites is just as bad as any other race.  There is no systemic racism against blacks in the US; no laws that are anti-black.  She must resign or be impeached. permalink award report block reply Hammond OP 1 points 4 hours ago Link: https://x.com/libsoftiktok/status/1988623201635561634 permalink award report block reply\nDirtyDiaperJoe 6 points 4 hours ago This crazy bitch.  They haven't found ONE new \"victim\" of the race massacre, which incidentally, before the new narrative was written, more WHITE people were killed during it. And here we are, digging up graves and desecrating burials trying to find more black \"victims\" to fit the narrative.  This happened in 1921.  When birth certificates AND death certificates were a thing.  Everyone's been accounted for.  Years ago I might add.  There's no Uncle Rastus who was killed and not accounted for...hell, they can't even find any relatives of any more supposed victims.  It's all 100% horseshit made up by the grievance committee so they can get \"their\" reparations...and she's ALWAYS been a crazy bitch.  This is nothing new. permalink award report block reply sobriquet 1 points 3 hours ago Always be hustling 💯 permalink parent award report block reply NotYourMan 1 points 3 hours ago Here comments are funny because the democrats created the KKK and all members were democrats.  Ignorance of history is the worst. permalink parent award report block reply\nsobriquet 1 points 3 hours ago Always be hustling 💯 permalink parent award report block reply\nNotYourMan 1 points 3 hours ago Here comments are funny because the democrats created the KKK and all members were democrats.  Ignorance of history is the worst. permalink parent award report block reply\nOkie_Life 2 points 3 hours ago “Skinfolk ain’t kinfolk” this lady is crazy. Who’s going to tell her that Tulsa has a black mayor? Provided he is trying to give reparations to rebuild greenwood. Also fun fact, I learned about what happened in 1921 in school, but before 2021 we called it the race riots, and then suddenly it shifted to race massacre. permalink award report block reply DirtyDiaperJoe 1 points 2 hours ago Fun fact.  It was the black people who kicked this off, when they decided to storm the jail to break the black guy out of the it!  Yes, they were going to actually break into the jail and \"free\" the black guy who had sexually assaulted a white girl in an elevator.  And guess what?  The white people got pissed about it and retaliated and burned their shit to the ground. permalink parent award report block reply\nDirtyDiaperJoe 1 points 2 hours ago Fun fact.  It was the black people who kicked this off, when they decided to storm the jail to break the black guy out of the it!  Yes, they were going to actually break into the jail and \"free\" the black guy who had sexually assaulted a white girl in an elevator.  And guess what?  The white people got pissed about it and retaliated and burned their shit to the ground. permalink parent award report block reply\nNotYourMan 2 points 3 hours ago Racism must not be tolerated at all.  Racism against whites is just as bad as any other race.  There is no systemic racism against blacks in the US; no laws that are anti-black.  She must resign or be impeached. permalink award report block reply\nHammond OP 1 points 4 hours ago Link: https://x.com/libsoftiktok/status/1988623201635561634 permalink award report block reply"
}