{
  "id": "8171949",
  "title": "1191What TX tells (legal) truck drivers to do to protect their cargo.YESposted6 days agobyDebunkTheL",
  "url": "https://patriots.win/p/1ARK52DM1B/what-tx-tells-legal-truck-driver/c",
  "content": "1191 What TX tells (legal) truck drivers to do to protect their cargo. YES posted 6 days ago by DebunkTheLeft 124 comments award share report block Anticommie @QueenAnticommie • 6d I think I might have to move to Texas!\n124 comments Sort by Top Top New Worst Old Save LolOkFBI 90 points 6 days ago I wish the entire country adhered to the 2nd amendment as well as Texas does. Nationwide truckers should be allowed to cross state lines with guns. permalink award report block reply posedgeclk 29 points 6 days ago A lot of them do anyway. permalink parent award report block reply friedchicken 13 points 6 days ago Because they have to... but then the corrupt law can selectively fuck you if you say/do something they don't like politically. That's the problem with these unenforced laws. permalink parent award report block reply SicSemperTyrannis2 8 points 6 days ago Totalitarianism is the condition when everyone is a criminal and the government just decides who to not prosecute. permalink parent award report block reply General_Grievance 2 points 5 days ago anarcho-tyranny I believe is the correct word For what you describe permalink parent award report block reply view 2 more comments... friedchicken 1 points 5 days ago I've not heard this before, but it's exactly right. On a high level, this is what we see with politicians.  Power brokers only allow their ascent in politics if they have sufficient kompromat; i.e. epstein. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Ok but they shouldn't be subject to prosecution for it. permalink parent award report block reply RedStoneDeepState 11 points 6 days ago Texas has worse than average gun rights. permalink parent award report block reply basedkekistani 18 points 6 days ago Yeah the challenge is the gun rights and the self defense laws don't line up everywhere. Texas does good for Stand your ground and Castle doctrine, but not as good with general gun rights. Other states have better gun rights, but worse self defense laws. permalink parent award report block reply KekistanPM 19 points 6 days ago There isn't a state in the union where I feel immune from being dragged through legal hell for shooting an intruder trying to hurt my family in my home. Even if the law is on my side, there are sleazy judges, bought DA's and demonic activists everywhere. permalink parent award report block reply basedkekistani 4 points 6 days ago I agree with you if you are anywhere near a major city. permalink parent award report block reply JediDwag 4 points 6 days ago Better to be judged by 12 than carried by 6. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago Texas law mandates you get drawn through a part of the process. All self defense shootings go in front of a grand jury there. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago That's what you need insurance for that purpose. The pussification of America! We used to hang horse thieves ... MAGA permalink parent award report block reply RedStoneDeepState 5 points 6 days ago 28 states have explicit stand your ground laws, another 10 it is the default legal process but not explicit, and 49 states have castle doctrine. Texas has a law that all self defense shootings have to go in front of a grand jury though, which results in not honoring self defense. permalink parent award report block reply GallowsTime 3 points 6 days ago Here's the Community Service Notice: Know your state's stupid and gay gun laws. (because all gun laws are stupid and gay) Know the new laws. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago What \"general gun rights\" are bad in TX? permalink parent award report block reply ALargeRaccoon 2 points 6 days ago Honestly, I think Missouri has the best, but I'm not sure if castle doctrine extends to vehicles there. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago That's where the couple of lawyers went down for defending their home, so I'm going to say \"no.\" permalink parent award report block reply lul_cheto 2 points 6 days ago What makes them worse then average? permalink parent award report block reply RedStoneDeepState 5 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. permalink parent award report block reply lul_cheto 2 points 6 days ago Its the same in all states with constitutional carry.. that sign is a notice of trespassing if one has a gun. The grand jury thing is gay tho. permalink parent award report block reply view 18 more comments... Xinnietheflu3 1 points 5 days ago Dont forget 51% as well. permalink parent award report block reply FerkenBlerkin 3 points 6 days ago Hate to tell you this, but Texas isn't even in the top 5 gun-friendly states. Please Lord don't let my state become Texas. permalink parent award report block reply RedStoneDeepState 3 points 6 days ago I wouldnt put Alabama in the top 10 but its still ahead of Texas. All of the deep south + Wyoming, Idaho, Dakotas, Montana, and Oklahoma are better than Texas. permalink parent award report block reply LolOkFBI 2 points 6 days ago I didn't realize this, what's better? permalink parent award report block reply FerkenBlerkin 5 points 6 days ago New Hampshire and West Virginia are the pinnacle of 2A freedom. No taxes.  No permit.  No limitations on ammo type.  No state restrictions on firearms. permalink parent award report block reply Thrasymachus 4 points 6 days ago New Hampshire, no shit, I swear sometimes I forget that's a real state.  Does anything go on up there?  Are we all sleeping (or maybe just me) on New Hampshire? permalink parent award report block reply view 1 more comments... RedStoneDeepState 2 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. Think about both of those rules separately and together - not a good situation. permalink parent award report block reply fucktheleft 2 points 6 days ago I don't feel like researching it. What makes them unfriendly to guns? permalink parent award report block reply RedStoneDeepState 5 points 6 days ago Texas has a law that all self defense shootings have to go in front of a grand jury Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice. permalink parent award report block reply FerkenBlerkin 5 points 6 days ago You can read about each state at https://ammo.com/articles/most-gun-friendly-states . Short list:  taxes on 2A items (guns/ammo), and you need a permit to carry. permalink parent award report block reply lul_cheto 0 points 6 days ago Such as? And in no other state can you defend property with deadly force.. permalink parent award report block reply FerkenBlerkin 1 points 6 days ago You're kidding, right? permalink parent award report block reply lul_cheto 1 points 6 days ago No, please inform me.\nThanks. permalink parent award report block reply view 12 more comments... Hikedelics 2 points 6 days ago In most states you can. For legal purposes your vehicle is considered an extension of your home and that brings a lot of protection for self defense along with it. The fact that those trucks actually have sleeping quarters built in only reinforces that argument. You aren’t supposed to bring in guns from out of state into New York BUT there are protections for people passing through. So if your destination is somewhere in the state, that’s a no go, but if you’re on your way to say Vermont or Maine or something you can bring your guns with you. Even if you have to stop over night. I would imagine that would apply to most truckers. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago GOD BLESS TEXAS!! permalink parent award report block reply load 1 more comments... Fresnor 42 points 6 days ago All truckers should be armed.  That is allowed by the 2nd Amendment, as well as reciprocity.  States need to be fined and officials arrested for violating these laws. permalink award report block reply pickleball_jones 21 points 6 days ago The officer is mistaken here. Your truck cab is your “home” and is legally protectable. Your trailer, that is not a fifth wheel or camper, is not legally recognized as your home in this situation. If the paperwork gets filed wrong you are going to prison if you shoot someone for breaking into your trailer full of overly insured consumer goods. Not worth it trucker bros. permalink award report block reply deleted 14 points 6 days ago Build_Back_Bankrupt 17 points 6 days ago What if they have property that I rightfully bought and paid for? permalink parent award report block reply Maganifice7 8 points 6 days ago Icwutudithere permalink parent award report block reply TwoArizonaPedes 8 points 6 days ago kek permalink parent award report block reply Taylor3006 5 points 6 days ago Understand there is no \"legal\" homicide in Texas. What you have are lawful uses of deadly force, used in specific instances that are defenses to the charge of homicide/murder. And they are quite specific. But yes, it is a defense to use deadly force to protect or retrieve your property if someone is in possession of it illegally. Almost every case goes in front of a grand jury as a safeguard against abuse. AND you have prosecutors who will sometimes refuse to go after people even if the grand jury says there is enough evidence that a crime may have been committed. permalink parent award report block reply STRONGLYWORDEDLETTER 1 points 6 days ago No you cannot. permalink parent award report block reply Jack_HinsonTN 8 points 6 days ago He's not an officer either.  The patch on his sleeve says \"Security.\" permalink parent award report block reply booblitchutz 6 points 6 days ago Plus if you’re White you shoot ONE OF THEM in a democrat run area, no matter what you’ll see some charges and even if you DO beat the rap, you won’t beat the ride. permalink parent award report block reply D__1 1 points 6 days ago Just throw the body in the the back of the truck and drive a county or two over... permalink parent award report block reply lul_cheto 2 points 6 days ago In texas you can stop a felony at night with deadly force, even if that just includes property. permalink parent award report block reply Taylor3006 3 points 6 days ago In Texas, you can use deadly force to stop most felonies at any time of the day or night. The only defense that mentions the time of day is \"criminal mischief at night\" which is pretty broad. You can not use force to stop some felonies like passing bad checks, bribery, embezzlement, etc. Deadly force can be used to stop crimes against people or property, felonies or not. Just remember that every case is held to a \"reasonable man\" standard. If you shoot someone for picking a flower on your property or kill some kid who is TP'ing your house, would a reasonable man have done the same thing under the same circumstances? There is a reason we call them \"defenses\" and not something else. It is just a defense in court. permalink parent award report block reply lul_cheto 1 points 5 days ago Felonies sure, but im speaking about simple theft. permalink parent award report block reply YaharaRiver 2 points 6 days ago Depends! In Wisconsin, the Castle Doctrine applies to all outbuildings if they are part of the residential lot and devoted to residential use under Wisconsin Statute § 895.07(1)(h). This includes structures like garages, porches, basements, driveways, sidewalks, patios, and fences—areas typically under the homeowner’s exclusive control. The key factor is whether the area is functionally tied to the home and used in connection with residential life. So - not the street out front, gotta wait until he steps onto the lawn 😂👍 permalink parent award report block reply load 4 more comments... RichieSprouse 15 points 6 days ago Amen, love Texas permalink award report block reply redditadminssuckit 12 points 6 days ago All criminals should be shot permalink award report block reply PM_ME_UR_MAGIC_CARDS 3 points 6 days ago Careful, you might trigger the suicidal empathy crowd talking like that (liberal women) permalink parent award report block reply Roadpower 10 points 6 days ago Hmm, is that a legitimate peace officer or ranger? I have my doubts that is said in a official capacity. permalink award report block reply Jack_HinsonTN 5 points 6 days ago Patch on his sleeve says \"Security\" so your doubts are correct. permalink parent award report block reply labajada 3 points 6 days ago mall cop permalink parent award report block reply Roadpower 3 points 6 days ago Yeah I just took a closer look, you're right. The guy commenting on the exchange between the driver and mall cop must have not taken a closer look either. permalink parent award report block reply ThisTrainHasNoBrakes 2 points 6 days ago All I see is a tan Rob Schneider. permalink parent award report block reply deleted 10 points 6 days ago _Eric_Ciaramella_ 2 points 6 days ago fatigue is real permalink parent award report block reply YaharaRiver 7 points 6 days ago Castle Doctrine. Wisconsin also has this. permalink award report block reply Aambrick 6 points 6 days ago As it should be permalink award report block reply 10gauge 5 points 6 days ago My shit is my kingdom and castle.  All of it is protected. 2A permalink award report block reply ingrowntoenail 4 points 6 days ago Fuck yeah! permalink award report block reply Damadhatter 3 points 6 days ago Video was cut off early it ended with \"well lucky for you this is Texas and if you drive your truck right over there around the corner to Snead's Feed and Seed  we can get you set up with a nice Glock or Beretta maybe..... Just need to have Snead size you out for it. And I get point for referrals so tell em officer Jones sent you\" permalink award report block reply mcoulton 3 points 6 days ago This is my own private domicile, bitch permalink award report block reply SimaYi 3 points 6 days ago Common fucking sense. permalink award report block reply TwoArizonaPedes 3 points 6 days ago It should be like that across the country. permalink award report block reply throttlejohnson 2 points 6 days ago castle doctrine permalink award report block reply SweetBeef 2 points 6 days ago shoot 'em down permalink award report block reply magafren 2 points 6 days ago Welcome to Texas! Castle doctrine in effect. This must be in South east Houston, definitely good advice permalink award report block reply TrumpRideorDie74 1 points 6 days ago This, I can upvote whole-heartedly 👍👍 permalink award report block reply FuckU/Spez 1 points 6 days ago Am I gonna have to get myself a semi truck now?  Just gonna have to stay away from the Lot Lizzards and we good! permalink award report block reply Toddyoungsvagina 1 points 6 days ago Are you guys going to get dragged into somebody’s office tomorrow permalink award report block reply MasterChief 1 points 6 days ago Fake video, fake police officer, look at his garb. permalink award report block reply glow-operator-2-0 1 points 5 days ago I've seen a lot of places I've been around the world I've seen some pretty faces Been with some beautiful girls After all I've witnessed One thing still amazes me Just like a miracle, you have to see to believe Cause God blessed Texas With His own hand Brought down angels from the promised land Gave 'em a place where they could dance If you wanna see heaven, brother, here's your chance I've been sent to spread the message God blessed Texas First, He let the sun shine Then He made the waters deep Then He gave us moonlight For all the world to see Well everybody knows that the Lord works in mysterious ways He took a rest, then on the very next day Well I've been sent to spread the message God blessed Texas permalink award report block reply DITTOPatriot 1 points 6 days ago TX is all hat and no cattle when it comes to gun rights. permalink award report block reply TrumpRideorDie74 1 points 6 days ago For us from anywhere else, what did that mean? 😅 permalink parent award report block reply GTHAYS 1 points 6 days ago I would check with a lawyer before putting my life in the hands of some 20ish YO security guard.  Plus it's most of those truck companies policy that you can't have a firearm.  Not to even get into the BS with jurisdictions you pass thru with a myriad of stupid laws.  Love the thought, but I don't want my ass stretched out in some jail or prison finding out this kid is wrong. permalink award report block reply bill_in_texas 1 points 6 days ago Baytown Police will BTFO of people for little or no reason.  There's a video of a guy in a grocery store parking lot, doing nothing wrong.  Two Baytown officers engage him in a consensual conversation, and eventually. BTFO of him, putting him in the hospital.  No crime committed.  Another one BTFO a kid in front of a convenience store.  Same issue....no actual crime. permalink award report block reply ViagraFalls 1 points 5 days ago But… but… this is racist! permalink award report block reply TerrorAndSlaughter 1 points 5 days ago Property is essential to civilization.  When property isn't protected, property is destroyed.  A lack of property is poverty. permalink award report block reply PoleWatcher 1 points 5 days ago I would not take that advice. If someone is tinkering around call the cops, until your life is threatened keep it bolstered. It is never that cut and dry and really depends on the DA in that area. permalink award report block reply FerkenBlerkin 1 points 6 days ago No doubt.  One northern state hidden away like an oasis in a 2A desert. permalink award report block reply FerkenBlerkin 0 points 6 days ago Lol whats with the vaxxed shit? Did I trigger you, Vaquero? Is that really how you respond to people who upset you? Estupido, quien en puta. That link I sent you was from 2025. Don't conceal without a permit in Texas, cowboy. Tu comprende, vaquero? La prision. Btw your state is ranked NINTH in the list of gun-friendly states. Do better. Fucking Austin and Dallas liberals did you dirty. https://ammo.com/articles/most-gun-friendly-states#new-hampshire Stay mad, putito permalink award report block reply Bastard -1 points 6 days ago Honest cop is going to get fired. permalink award report block reply\nLolOkFBI 90 points 6 days ago I wish the entire country adhered to the 2nd amendment as well as Texas does. Nationwide truckers should be allowed to cross state lines with guns. permalink award report block reply posedgeclk 29 points 6 days ago A lot of them do anyway. permalink parent award report block reply friedchicken 13 points 6 days ago Because they have to... but then the corrupt law can selectively fuck you if you say/do something they don't like politically. That's the problem with these unenforced laws. permalink parent award report block reply SicSemperTyrannis2 8 points 6 days ago Totalitarianism is the condition when everyone is a criminal and the government just decides who to not prosecute. permalink parent award report block reply General_Grievance 2 points 5 days ago anarcho-tyranny I believe is the correct word For what you describe permalink parent award report block reply view 2 more comments... friedchicken 1 points 5 days ago I've not heard this before, but it's exactly right. On a high level, this is what we see with politicians.  Power brokers only allow their ascent in politics if they have sufficient kompromat; i.e. epstein. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Ok but they shouldn't be subject to prosecution for it. permalink parent award report block reply RedStoneDeepState 11 points 6 days ago Texas has worse than average gun rights. permalink parent award report block reply basedkekistani 18 points 6 days ago Yeah the challenge is the gun rights and the self defense laws don't line up everywhere. Texas does good for Stand your ground and Castle doctrine, but not as good with general gun rights. Other states have better gun rights, but worse self defense laws. permalink parent award report block reply KekistanPM 19 points 6 days ago There isn't a state in the union where I feel immune from being dragged through legal hell for shooting an intruder trying to hurt my family in my home. Even if the law is on my side, there are sleazy judges, bought DA's and demonic activists everywhere. permalink parent award report block reply basedkekistani 4 points 6 days ago I agree with you if you are anywhere near a major city. permalink parent award report block reply JediDwag 4 points 6 days ago Better to be judged by 12 than carried by 6. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago Texas law mandates you get drawn through a part of the process. All self defense shootings go in front of a grand jury there. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago That's what you need insurance for that purpose. The pussification of America! We used to hang horse thieves ... MAGA permalink parent award report block reply RedStoneDeepState 5 points 6 days ago 28 states have explicit stand your ground laws, another 10 it is the default legal process but not explicit, and 49 states have castle doctrine. Texas has a law that all self defense shootings have to go in front of a grand jury though, which results in not honoring self defense. permalink parent award report block reply GallowsTime 3 points 6 days ago Here's the Community Service Notice: Know your state's stupid and gay gun laws. (because all gun laws are stupid and gay) Know the new laws. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago What \"general gun rights\" are bad in TX? permalink parent award report block reply ALargeRaccoon 2 points 6 days ago Honestly, I think Missouri has the best, but I'm not sure if castle doctrine extends to vehicles there. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago That's where the couple of lawyers went down for defending their home, so I'm going to say \"no.\" permalink parent award report block reply lul_cheto 2 points 6 days ago What makes them worse then average? permalink parent award report block reply RedStoneDeepState 5 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. permalink parent award report block reply lul_cheto 2 points 6 days ago Its the same in all states with constitutional carry.. that sign is a notice of trespassing if one has a gun. The grand jury thing is gay tho. permalink parent award report block reply view 18 more comments... Xinnietheflu3 1 points 5 days ago Dont forget 51% as well. permalink parent award report block reply FerkenBlerkin 3 points 6 days ago Hate to tell you this, but Texas isn't even in the top 5 gun-friendly states. Please Lord don't let my state become Texas. permalink parent award report block reply RedStoneDeepState 3 points 6 days ago I wouldnt put Alabama in the top 10 but its still ahead of Texas. All of the deep south + Wyoming, Idaho, Dakotas, Montana, and Oklahoma are better than Texas. permalink parent award report block reply LolOkFBI 2 points 6 days ago I didn't realize this, what's better? permalink parent award report block reply FerkenBlerkin 5 points 6 days ago New Hampshire and West Virginia are the pinnacle of 2A freedom. No taxes.  No permit.  No limitations on ammo type.  No state restrictions on firearms. permalink parent award report block reply Thrasymachus 4 points 6 days ago New Hampshire, no shit, I swear sometimes I forget that's a real state.  Does anything go on up there?  Are we all sleeping (or maybe just me) on New Hampshire? permalink parent award report block reply view 1 more comments... RedStoneDeepState 2 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. Think about both of those rules separately and together - not a good situation. permalink parent award report block reply fucktheleft 2 points 6 days ago I don't feel like researching it. What makes them unfriendly to guns? permalink parent award report block reply RedStoneDeepState 5 points 6 days ago Texas has a law that all self defense shootings have to go in front of a grand jury Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice. permalink parent award report block reply FerkenBlerkin 5 points 6 days ago You can read about each state at https://ammo.com/articles/most-gun-friendly-states . Short list:  taxes on 2A items (guns/ammo), and you need a permit to carry. permalink parent award report block reply lul_cheto 0 points 6 days ago Such as? And in no other state can you defend property with deadly force.. permalink parent award report block reply FerkenBlerkin 1 points 6 days ago You're kidding, right? permalink parent award report block reply lul_cheto 1 points 6 days ago No, please inform me.\nThanks. permalink parent award report block reply view 12 more comments... Hikedelics 2 points 6 days ago In most states you can. For legal purposes your vehicle is considered an extension of your home and that brings a lot of protection for self defense along with it. The fact that those trucks actually have sleeping quarters built in only reinforces that argument. You aren’t supposed to bring in guns from out of state into New York BUT there are protections for people passing through. So if your destination is somewhere in the state, that’s a no go, but if you’re on your way to say Vermont or Maine or something you can bring your guns with you. Even if you have to stop over night. I would imagine that would apply to most truckers. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago GOD BLESS TEXAS!! permalink parent award report block reply load 1 more comments...\nposedgeclk 29 points 6 days ago A lot of them do anyway. permalink parent award report block reply friedchicken 13 points 6 days ago Because they have to... but then the corrupt law can selectively fuck you if you say/do something they don't like politically. That's the problem with these unenforced laws. permalink parent award report block reply SicSemperTyrannis2 8 points 6 days ago Totalitarianism is the condition when everyone is a criminal and the government just decides who to not prosecute. permalink parent award report block reply General_Grievance 2 points 5 days ago anarcho-tyranny I believe is the correct word For what you describe permalink parent award report block reply view 2 more comments... friedchicken 1 points 5 days ago I've not heard this before, but it's exactly right. On a high level, this is what we see with politicians.  Power brokers only allow their ascent in politics if they have sufficient kompromat; i.e. epstein. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Ok but they shouldn't be subject to prosecution for it. permalink parent award report block reply\nfriedchicken 13 points 6 days ago Because they have to... but then the corrupt law can selectively fuck you if you say/do something they don't like politically. That's the problem with these unenforced laws. permalink parent award report block reply SicSemperTyrannis2 8 points 6 days ago Totalitarianism is the condition when everyone is a criminal and the government just decides who to not prosecute. permalink parent award report block reply General_Grievance 2 points 5 days ago anarcho-tyranny I believe is the correct word For what you describe permalink parent award report block reply view 2 more comments... friedchicken 1 points 5 days ago I've not heard this before, but it's exactly right. On a high level, this is what we see with politicians.  Power brokers only allow their ascent in politics if they have sufficient kompromat; i.e. epstein. permalink parent award report block reply\nSicSemperTyrannis2 8 points 6 days ago Totalitarianism is the condition when everyone is a criminal and the government just decides who to not prosecute. permalink parent award report block reply General_Grievance 2 points 5 days ago anarcho-tyranny I believe is the correct word For what you describe permalink parent award report block reply view 2 more comments... friedchicken 1 points 5 days ago I've not heard this before, but it's exactly right. On a high level, this is what we see with politicians.  Power brokers only allow their ascent in politics if they have sufficient kompromat; i.e. epstein. permalink parent award report block reply\nGeneral_Grievance 2 points 5 days ago anarcho-tyranny I believe is the correct word For what you describe permalink parent award report block reply view 2 more comments...\nfriedchicken 1 points 5 days ago I've not heard this before, but it's exactly right. On a high level, this is what we see with politicians.  Power brokers only allow their ascent in politics if they have sufficient kompromat; i.e. epstein. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Ok but they shouldn't be subject to prosecution for it. permalink parent award report block reply\nRedStoneDeepState 11 points 6 days ago Texas has worse than average gun rights. permalink parent award report block reply basedkekistani 18 points 6 days ago Yeah the challenge is the gun rights and the self defense laws don't line up everywhere. Texas does good for Stand your ground and Castle doctrine, but not as good with general gun rights. Other states have better gun rights, but worse self defense laws. permalink parent award report block reply KekistanPM 19 points 6 days ago There isn't a state in the union where I feel immune from being dragged through legal hell for shooting an intruder trying to hurt my family in my home. Even if the law is on my side, there are sleazy judges, bought DA's and demonic activists everywhere. permalink parent award report block reply basedkekistani 4 points 6 days ago I agree with you if you are anywhere near a major city. permalink parent award report block reply JediDwag 4 points 6 days ago Better to be judged by 12 than carried by 6. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago Texas law mandates you get drawn through a part of the process. All self defense shootings go in front of a grand jury there. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago That's what you need insurance for that purpose. The pussification of America! We used to hang horse thieves ... MAGA permalink parent award report block reply RedStoneDeepState 5 points 6 days ago 28 states have explicit stand your ground laws, another 10 it is the default legal process but not explicit, and 49 states have castle doctrine. Texas has a law that all self defense shootings have to go in front of a grand jury though, which results in not honoring self defense. permalink parent award report block reply GallowsTime 3 points 6 days ago Here's the Community Service Notice: Know your state's stupid and gay gun laws. (because all gun laws are stupid and gay) Know the new laws. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago What \"general gun rights\" are bad in TX? permalink parent award report block reply ALargeRaccoon 2 points 6 days ago Honestly, I think Missouri has the best, but I'm not sure if castle doctrine extends to vehicles there. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago That's where the couple of lawyers went down for defending their home, so I'm going to say \"no.\" permalink parent award report block reply lul_cheto 2 points 6 days ago What makes them worse then average? permalink parent award report block reply RedStoneDeepState 5 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. permalink parent award report block reply lul_cheto 2 points 6 days ago Its the same in all states with constitutional carry.. that sign is a notice of trespassing if one has a gun. The grand jury thing is gay tho. permalink parent award report block reply view 18 more comments... Xinnietheflu3 1 points 5 days ago Dont forget 51% as well. permalink parent award report block reply\nbasedkekistani 18 points 6 days ago Yeah the challenge is the gun rights and the self defense laws don't line up everywhere. Texas does good for Stand your ground and Castle doctrine, but not as good with general gun rights. Other states have better gun rights, but worse self defense laws. permalink parent award report block reply KekistanPM 19 points 6 days ago There isn't a state in the union where I feel immune from being dragged through legal hell for shooting an intruder trying to hurt my family in my home. Even if the law is on my side, there are sleazy judges, bought DA's and demonic activists everywhere. permalink parent award report block reply basedkekistani 4 points 6 days ago I agree with you if you are anywhere near a major city. permalink parent award report block reply JediDwag 4 points 6 days ago Better to be judged by 12 than carried by 6. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago Texas law mandates you get drawn through a part of the process. All self defense shootings go in front of a grand jury there. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago That's what you need insurance for that purpose. The pussification of America! We used to hang horse thieves ... MAGA permalink parent award report block reply RedStoneDeepState 5 points 6 days ago 28 states have explicit stand your ground laws, another 10 it is the default legal process but not explicit, and 49 states have castle doctrine. Texas has a law that all self defense shootings have to go in front of a grand jury though, which results in not honoring self defense. permalink parent award report block reply GallowsTime 3 points 6 days ago Here's the Community Service Notice: Know your state's stupid and gay gun laws. (because all gun laws are stupid and gay) Know the new laws. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago What \"general gun rights\" are bad in TX? permalink parent award report block reply\nKekistanPM 19 points 6 days ago There isn't a state in the union where I feel immune from being dragged through legal hell for shooting an intruder trying to hurt my family in my home. Even if the law is on my side, there are sleazy judges, bought DA's and demonic activists everywhere. permalink parent award report block reply basedkekistani 4 points 6 days ago I agree with you if you are anywhere near a major city. permalink parent award report block reply JediDwag 4 points 6 days ago Better to be judged by 12 than carried by 6. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago Texas law mandates you get drawn through a part of the process. All self defense shootings go in front of a grand jury there. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago That's what you need insurance for that purpose. The pussification of America! We used to hang horse thieves ... MAGA permalink parent award report block reply\nbasedkekistani 4 points 6 days ago I agree with you if you are anywhere near a major city. permalink parent award report block reply\nJediDwag 4 points 6 days ago Better to be judged by 12 than carried by 6. permalink parent award report block reply\nRedStoneDeepState 2 points 6 days ago Texas law mandates you get drawn through a part of the process. All self defense shootings go in front of a grand jury there. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago That's what you need insurance for that purpose. The pussification of America! We used to hang horse thieves ... MAGA permalink parent award report block reply\nRedStoneDeepState 5 points 6 days ago 28 states have explicit stand your ground laws, another 10 it is the default legal process but not explicit, and 49 states have castle doctrine. Texas has a law that all self defense shootings have to go in front of a grand jury though, which results in not honoring self defense. permalink parent award report block reply GallowsTime 3 points 6 days ago Here's the Community Service Notice: Know your state's stupid and gay gun laws. (because all gun laws are stupid and gay) Know the new laws. permalink parent award report block reply\nGallowsTime 3 points 6 days ago Here's the Community Service Notice: Know your state's stupid and gay gun laws. (because all gun laws are stupid and gay) Know the new laws. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago What \"general gun rights\" are bad in TX? permalink parent award report block reply\nALargeRaccoon 2 points 6 days ago Honestly, I think Missouri has the best, but I'm not sure if castle doctrine extends to vehicles there. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago That's where the couple of lawyers went down for defending their home, so I'm going to say \"no.\" permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago That's where the couple of lawyers went down for defending their home, so I'm going to say \"no.\" permalink parent award report block reply\nlul_cheto 2 points 6 days ago What makes them worse then average? permalink parent award report block reply RedStoneDeepState 5 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. permalink parent award report block reply lul_cheto 2 points 6 days ago Its the same in all states with constitutional carry.. that sign is a notice of trespassing if one has a gun. The grand jury thing is gay tho. permalink parent award report block reply view 18 more comments... Xinnietheflu3 1 points 5 days ago Dont forget 51% as well. permalink parent award report block reply\nRedStoneDeepState 5 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. permalink parent award report block reply lul_cheto 2 points 6 days ago Its the same in all states with constitutional carry.. that sign is a notice of trespassing if one has a gun. The grand jury thing is gay tho. permalink parent award report block reply view 18 more comments... Xinnietheflu3 1 points 5 days ago Dont forget 51% as well. permalink parent award report block reply\nlul_cheto 2 points 6 days ago Its the same in all states with constitutional carry.. that sign is a notice of trespassing if one has a gun. The grand jury thing is gay tho. permalink parent award report block reply view 18 more comments...\nXinnietheflu3 1 points 5 days ago Dont forget 51% as well. permalink parent award report block reply\nFerkenBlerkin 3 points 6 days ago Hate to tell you this, but Texas isn't even in the top 5 gun-friendly states. Please Lord don't let my state become Texas. permalink parent award report block reply RedStoneDeepState 3 points 6 days ago I wouldnt put Alabama in the top 10 but its still ahead of Texas. All of the deep south + Wyoming, Idaho, Dakotas, Montana, and Oklahoma are better than Texas. permalink parent award report block reply LolOkFBI 2 points 6 days ago I didn't realize this, what's better? permalink parent award report block reply FerkenBlerkin 5 points 6 days ago New Hampshire and West Virginia are the pinnacle of 2A freedom. No taxes.  No permit.  No limitations on ammo type.  No state restrictions on firearms. permalink parent award report block reply Thrasymachus 4 points 6 days ago New Hampshire, no shit, I swear sometimes I forget that's a real state.  Does anything go on up there?  Are we all sleeping (or maybe just me) on New Hampshire? permalink parent award report block reply view 1 more comments... RedStoneDeepState 2 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. Think about both of those rules separately and together - not a good situation. permalink parent award report block reply fucktheleft 2 points 6 days ago I don't feel like researching it. What makes them unfriendly to guns? permalink parent award report block reply RedStoneDeepState 5 points 6 days ago Texas has a law that all self defense shootings have to go in front of a grand jury Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice. permalink parent award report block reply FerkenBlerkin 5 points 6 days ago You can read about each state at https://ammo.com/articles/most-gun-friendly-states . Short list:  taxes on 2A items (guns/ammo), and you need a permit to carry. permalink parent award report block reply lul_cheto 0 points 6 days ago Such as? And in no other state can you defend property with deadly force.. permalink parent award report block reply FerkenBlerkin 1 points 6 days ago You're kidding, right? permalink parent award report block reply lul_cheto 1 points 6 days ago No, please inform me.\nThanks. permalink parent award report block reply view 12 more comments...\nRedStoneDeepState 3 points 6 days ago I wouldnt put Alabama in the top 10 but its still ahead of Texas. All of the deep south + Wyoming, Idaho, Dakotas, Montana, and Oklahoma are better than Texas. permalink parent award report block reply\nLolOkFBI 2 points 6 days ago I didn't realize this, what's better? permalink parent award report block reply FerkenBlerkin 5 points 6 days ago New Hampshire and West Virginia are the pinnacle of 2A freedom. No taxes.  No permit.  No limitations on ammo type.  No state restrictions on firearms. permalink parent award report block reply Thrasymachus 4 points 6 days ago New Hampshire, no shit, I swear sometimes I forget that's a real state.  Does anything go on up there?  Are we all sleeping (or maybe just me) on New Hampshire? permalink parent award report block reply view 1 more comments... RedStoneDeepState 2 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. Think about both of those rules separately and together - not a good situation. permalink parent award report block reply\nFerkenBlerkin 5 points 6 days ago New Hampshire and West Virginia are the pinnacle of 2A freedom. No taxes.  No permit.  No limitations on ammo type.  No state restrictions on firearms. permalink parent award report block reply Thrasymachus 4 points 6 days ago New Hampshire, no shit, I swear sometimes I forget that's a real state.  Does anything go on up there?  Are we all sleeping (or maybe just me) on New Hampshire? permalink parent award report block reply view 1 more comments...\nThrasymachus 4 points 6 days ago New Hampshire, no shit, I swear sometimes I forget that's a real state.  Does anything go on up there?  Are we all sleeping (or maybe just me) on New Hampshire? permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 2 points 6 days ago Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice and Texas has a law that all self defense shootings have to go in front of a grand jury. Think about both of those rules separately and together - not a good situation. permalink parent award report block reply\nfucktheleft 2 points 6 days ago I don't feel like researching it. What makes them unfriendly to guns? permalink parent award report block reply RedStoneDeepState 5 points 6 days ago Texas has a law that all self defense shootings have to go in front of a grand jury Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice. permalink parent award report block reply FerkenBlerkin 5 points 6 days ago You can read about each state at https://ammo.com/articles/most-gun-friendly-states . Short list:  taxes on 2A items (guns/ammo), and you need a permit to carry. permalink parent award report block reply\nRedStoneDeepState 5 points 6 days ago Texas has a law that all self defense shootings have to go in front of a grand jury Texas has 30.05, 30.06, and 30.07 signs banning concealed carry as a criminal offense in most \"corporate\" buildings without prior trespass notice. permalink parent award report block reply\nFerkenBlerkin 5 points 6 days ago You can read about each state at https://ammo.com/articles/most-gun-friendly-states . Short list:  taxes on 2A items (guns/ammo), and you need a permit to carry. permalink parent award report block reply\nlul_cheto 0 points 6 days ago Such as? And in no other state can you defend property with deadly force.. permalink parent award report block reply FerkenBlerkin 1 points 6 days ago You're kidding, right? permalink parent award report block reply lul_cheto 1 points 6 days ago No, please inform me.\nThanks. permalink parent award report block reply view 12 more comments...\nFerkenBlerkin 1 points 6 days ago You're kidding, right? permalink parent award report block reply lul_cheto 1 points 6 days ago No, please inform me.\nThanks. permalink parent award report block reply view 12 more comments...\nlul_cheto 1 points 6 days ago No, please inform me.\nThanks. permalink parent award report block reply view 12 more comments...\nHikedelics 2 points 6 days ago In most states you can. For legal purposes your vehicle is considered an extension of your home and that brings a lot of protection for self defense along with it. The fact that those trucks actually have sleeping quarters built in only reinforces that argument. You aren’t supposed to bring in guns from out of state into New York BUT there are protections for people passing through. So if your destination is somewhere in the state, that’s a no go, but if you’re on your way to say Vermont or Maine or something you can bring your guns with you. Even if you have to stop over night. I would imagine that would apply to most truckers. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago GOD BLESS TEXAS!! permalink parent award report block reply\nFresnor 42 points 6 days ago All truckers should be armed.  That is allowed by the 2nd Amendment, as well as reciprocity.  States need to be fined and officials arrested for violating these laws. permalink award report block reply\npickleball_jones 21 points 6 days ago The officer is mistaken here. Your truck cab is your “home” and is legally protectable. Your trailer, that is not a fifth wheel or camper, is not legally recognized as your home in this situation. If the paperwork gets filed wrong you are going to prison if you shoot someone for breaking into your trailer full of overly insured consumer goods. Not worth it trucker bros. permalink award report block reply deleted 14 points 6 days ago Build_Back_Bankrupt 17 points 6 days ago What if they have property that I rightfully bought and paid for? permalink parent award report block reply Maganifice7 8 points 6 days ago Icwutudithere permalink parent award report block reply TwoArizonaPedes 8 points 6 days ago kek permalink parent award report block reply Taylor3006 5 points 6 days ago Understand there is no \"legal\" homicide in Texas. What you have are lawful uses of deadly force, used in specific instances that are defenses to the charge of homicide/murder. And they are quite specific. But yes, it is a defense to use deadly force to protect or retrieve your property if someone is in possession of it illegally. Almost every case goes in front of a grand jury as a safeguard against abuse. AND you have prosecutors who will sometimes refuse to go after people even if the grand jury says there is enough evidence that a crime may have been committed. permalink parent award report block reply STRONGLYWORDEDLETTER 1 points 6 days ago No you cannot. permalink parent award report block reply Jack_HinsonTN 8 points 6 days ago He's not an officer either.  The patch on his sleeve says \"Security.\" permalink parent award report block reply booblitchutz 6 points 6 days ago Plus if you’re White you shoot ONE OF THEM in a democrat run area, no matter what you’ll see some charges and even if you DO beat the rap, you won’t beat the ride. permalink parent award report block reply D__1 1 points 6 days ago Just throw the body in the the back of the truck and drive a county or two over... permalink parent award report block reply lul_cheto 2 points 6 days ago In texas you can stop a felony at night with deadly force, even if that just includes property. permalink parent award report block reply Taylor3006 3 points 6 days ago In Texas, you can use deadly force to stop most felonies at any time of the day or night. The only defense that mentions the time of day is \"criminal mischief at night\" which is pretty broad. You can not use force to stop some felonies like passing bad checks, bribery, embezzlement, etc. Deadly force can be used to stop crimes against people or property, felonies or not. Just remember that every case is held to a \"reasonable man\" standard. If you shoot someone for picking a flower on your property or kill some kid who is TP'ing your house, would a reasonable man have done the same thing under the same circumstances? There is a reason we call them \"defenses\" and not something else. It is just a defense in court. permalink parent award report block reply lul_cheto 1 points 5 days ago Felonies sure, but im speaking about simple theft. permalink parent award report block reply YaharaRiver 2 points 6 days ago Depends! In Wisconsin, the Castle Doctrine applies to all outbuildings if they are part of the residential lot and devoted to residential use under Wisconsin Statute § 895.07(1)(h). This includes structures like garages, porches, basements, driveways, sidewalks, patios, and fences—areas typically under the homeowner’s exclusive control. The key factor is whether the area is functionally tied to the home and used in connection with residential life. So - not the street out front, gotta wait until he steps onto the lawn 😂👍 permalink parent award report block reply load 4 more comments...\ndeleted 14 points 6 days ago Build_Back_Bankrupt 17 points 6 days ago What if they have property that I rightfully bought and paid for? permalink parent award report block reply Maganifice7 8 points 6 days ago Icwutudithere permalink parent award report block reply TwoArizonaPedes 8 points 6 days ago kek permalink parent award report block reply Taylor3006 5 points 6 days ago Understand there is no \"legal\" homicide in Texas. What you have are lawful uses of deadly force, used in specific instances that are defenses to the charge of homicide/murder. And they are quite specific. But yes, it is a defense to use deadly force to protect or retrieve your property if someone is in possession of it illegally. Almost every case goes in front of a grand jury as a safeguard against abuse. AND you have prosecutors who will sometimes refuse to go after people even if the grand jury says there is enough evidence that a crime may have been committed. permalink parent award report block reply STRONGLYWORDEDLETTER 1 points 6 days ago No you cannot. permalink parent award report block reply\nBuild_Back_Bankrupt 17 points 6 days ago What if they have property that I rightfully bought and paid for? permalink parent award report block reply Maganifice7 8 points 6 days ago Icwutudithere permalink parent award report block reply TwoArizonaPedes 8 points 6 days ago kek permalink parent award report block reply\nMaganifice7 8 points 6 days ago Icwutudithere permalink parent award report block reply\nTwoArizonaPedes 8 points 6 days ago kek permalink parent award report block reply\nTaylor3006 5 points 6 days ago Understand there is no \"legal\" homicide in Texas. What you have are lawful uses of deadly force, used in specific instances that are defenses to the charge of homicide/murder. And they are quite specific. But yes, it is a defense to use deadly force to protect or retrieve your property if someone is in possession of it illegally. Almost every case goes in front of a grand jury as a safeguard against abuse. AND you have prosecutors who will sometimes refuse to go after people even if the grand jury says there is enough evidence that a crime may have been committed. permalink parent award report block reply\nSTRONGLYWORDEDLETTER 1 points 6 days ago No you cannot. permalink parent award report block reply\nJack_HinsonTN 8 points 6 days ago He's not an officer either.  The patch on his sleeve says \"Security.\" permalink parent award report block reply\nbooblitchutz 6 points 6 days ago Plus if you’re White you shoot ONE OF THEM in a democrat run area, no matter what you’ll see some charges and even if you DO beat the rap, you won’t beat the ride. permalink parent award report block reply D__1 1 points 6 days ago Just throw the body in the the back of the truck and drive a county or two over... permalink parent award report block reply\nD__1 1 points 6 days ago Just throw the body in the the back of the truck and drive a county or two over... permalink parent award report block reply\nlul_cheto 2 points 6 days ago In texas you can stop a felony at night with deadly force, even if that just includes property. permalink parent award report block reply Taylor3006 3 points 6 days ago In Texas, you can use deadly force to stop most felonies at any time of the day or night. The only defense that mentions the time of day is \"criminal mischief at night\" which is pretty broad. You can not use force to stop some felonies like passing bad checks, bribery, embezzlement, etc. Deadly force can be used to stop crimes against people or property, felonies or not. Just remember that every case is held to a \"reasonable man\" standard. If you shoot someone for picking a flower on your property or kill some kid who is TP'ing your house, would a reasonable man have done the same thing under the same circumstances? There is a reason we call them \"defenses\" and not something else. It is just a defense in court. permalink parent award report block reply lul_cheto 1 points 5 days ago Felonies sure, but im speaking about simple theft. permalink parent award report block reply\nTaylor3006 3 points 6 days ago In Texas, you can use deadly force to stop most felonies at any time of the day or night. The only defense that mentions the time of day is \"criminal mischief at night\" which is pretty broad. You can not use force to stop some felonies like passing bad checks, bribery, embezzlement, etc. Deadly force can be used to stop crimes against people or property, felonies or not. Just remember that every case is held to a \"reasonable man\" standard. If you shoot someone for picking a flower on your property or kill some kid who is TP'ing your house, would a reasonable man have done the same thing under the same circumstances? There is a reason we call them \"defenses\" and not something else. It is just a defense in court. permalink parent award report block reply lul_cheto 1 points 5 days ago Felonies sure, but im speaking about simple theft. permalink parent award report block reply\nlul_cheto 1 points 5 days ago Felonies sure, but im speaking about simple theft. permalink parent award report block reply\nYaharaRiver 2 points 6 days ago Depends! In Wisconsin, the Castle Doctrine applies to all outbuildings if they are part of the residential lot and devoted to residential use under Wisconsin Statute § 895.07(1)(h). This includes structures like garages, porches, basements, driveways, sidewalks, patios, and fences—areas typically under the homeowner’s exclusive control. The key factor is whether the area is functionally tied to the home and used in connection with residential life. So - not the street out front, gotta wait until he steps onto the lawn 😂👍 permalink parent award report block reply\nRichieSprouse 15 points 6 days ago Amen, love Texas permalink award report block reply\nredditadminssuckit 12 points 6 days ago All criminals should be shot permalink award report block reply PM_ME_UR_MAGIC_CARDS 3 points 6 days ago Careful, you might trigger the suicidal empathy crowd talking like that (liberal women) permalink parent award report block reply\nPM_ME_UR_MAGIC_CARDS 3 points 6 days ago Careful, you might trigger the suicidal empathy crowd talking like that (liberal women) permalink parent award report block reply\nRoadpower 10 points 6 days ago Hmm, is that a legitimate peace officer or ranger? I have my doubts that is said in a official capacity. permalink award report block reply Jack_HinsonTN 5 points 6 days ago Patch on his sleeve says \"Security\" so your doubts are correct. permalink parent award report block reply labajada 3 points 6 days ago mall cop permalink parent award report block reply Roadpower 3 points 6 days ago Yeah I just took a closer look, you're right. The guy commenting on the exchange between the driver and mall cop must have not taken a closer look either. permalink parent award report block reply ThisTrainHasNoBrakes 2 points 6 days ago All I see is a tan Rob Schneider. permalink parent award report block reply\nJack_HinsonTN 5 points 6 days ago Patch on his sleeve says \"Security\" so your doubts are correct. permalink parent award report block reply\nlabajada 3 points 6 days ago mall cop permalink parent award report block reply Roadpower 3 points 6 days ago Yeah I just took a closer look, you're right. The guy commenting on the exchange between the driver and mall cop must have not taken a closer look either. permalink parent award report block reply\nRoadpower 3 points 6 days ago Yeah I just took a closer look, you're right. The guy commenting on the exchange between the driver and mall cop must have not taken a closer look either. permalink parent award report block reply\nThisTrainHasNoBrakes 2 points 6 days ago All I see is a tan Rob Schneider. permalink parent award report block reply\ndeleted 10 points 6 days ago _Eric_Ciaramella_ 2 points 6 days ago fatigue is real permalink parent award report block reply\n_Eric_Ciaramella_ 2 points 6 days ago fatigue is real permalink parent award report block reply\nYaharaRiver 7 points 6 days ago Castle Doctrine. Wisconsin also has this. permalink award report block reply\nAambrick 6 points 6 days ago As it should be permalink award report block reply\n10gauge 5 points 6 days ago My shit is my kingdom and castle.  All of it is protected. 2A permalink award report block reply\ningrowntoenail 4 points 6 days ago Fuck yeah! permalink award report block reply\nDamadhatter 3 points 6 days ago Video was cut off early it ended with \"well lucky for you this is Texas and if you drive your truck right over there around the corner to Snead's Feed and Seed  we can get you set up with a nice Glock or Beretta maybe..... Just need to have Snead size you out for it. And I get point for referrals so tell em officer Jones sent you\" permalink award report block reply\nmcoulton 3 points 6 days ago This is my own private domicile, bitch permalink award report block reply\nSimaYi 3 points 6 days ago Common fucking sense. permalink award report block reply\nTwoArizonaPedes 3 points 6 days ago It should be like that across the country. permalink award report block reply\nthrottlejohnson 2 points 6 days ago castle doctrine permalink award report block reply\nSweetBeef 2 points 6 days ago shoot 'em down permalink award report block reply\nmagafren 2 points 6 days ago Welcome to Texas! Castle doctrine in effect. This must be in South east Houston, definitely good advice permalink award report block reply\nTrumpRideorDie74 1 points 6 days ago This, I can upvote whole-heartedly 👍👍 permalink award report block reply\nFuckU/Spez 1 points 6 days ago Am I gonna have to get myself a semi truck now?  Just gonna have to stay away from the Lot Lizzards and we good! permalink award report block reply\nToddyoungsvagina 1 points 6 days ago Are you guys going to get dragged into somebody’s office tomorrow permalink award report block reply\nMasterChief 1 points 6 days ago Fake video, fake police officer, look at his garb. permalink award report block reply\nglow-operator-2-0 1 points 5 days ago I've seen a lot of places I've been around the world I've seen some pretty faces Been with some beautiful girls After all I've witnessed One thing still amazes me Just like a miracle, you have to see to believe Cause God blessed Texas With His own hand Brought down angels from the promised land Gave 'em a place where they could dance If you wanna see heaven, brother, here's your chance I've been sent to spread the message God blessed Texas First, He let the sun shine Then He made the waters deep Then He gave us moonlight For all the world to see Well everybody knows that the Lord works in mysterious ways He took a rest, then on the very next day Well I've been sent to spread the message God blessed Texas permalink award report block reply\nDITTOPatriot 1 points 6 days ago TX is all hat and no cattle when it comes to gun rights. permalink award report block reply TrumpRideorDie74 1 points 6 days ago For us from anywhere else, what did that mean? 😅 permalink parent award report block reply\nTrumpRideorDie74 1 points 6 days ago For us from anywhere else, what did that mean? 😅 permalink parent award report block reply\nGTHAYS 1 points 6 days ago I would check with a lawyer before putting my life in the hands of some 20ish YO security guard.  Plus it's most of those truck companies policy that you can't have a firearm.  Not to even get into the BS with jurisdictions you pass thru with a myriad of stupid laws.  Love the thought, but I don't want my ass stretched out in some jail or prison finding out this kid is wrong. permalink award report block reply\nbill_in_texas 1 points 6 days ago Baytown Police will BTFO of people for little or no reason.  There's a video of a guy in a grocery store parking lot, doing nothing wrong.  Two Baytown officers engage him in a consensual conversation, and eventually. BTFO of him, putting him in the hospital.  No crime committed.  Another one BTFO a kid in front of a convenience store.  Same issue....no actual crime. permalink award report block reply\nViagraFalls 1 points 5 days ago But… but… this is racist! permalink award report block reply\nTerrorAndSlaughter 1 points 5 days ago Property is essential to civilization.  When property isn't protected, property is destroyed.  A lack of property is poverty. permalink award report block reply\nPoleWatcher 1 points 5 days ago I would not take that advice. If someone is tinkering around call the cops, until your life is threatened keep it bolstered. It is never that cut and dry and really depends on the DA in that area. permalink award report block reply\nFerkenBlerkin 1 points 6 days ago No doubt.  One northern state hidden away like an oasis in a 2A desert. permalink award report block reply\nFerkenBlerkin 0 points 6 days ago Lol whats with the vaxxed shit? Did I trigger you, Vaquero? Is that really how you respond to people who upset you? Estupido, quien en puta. That link I sent you was from 2025. Don't conceal without a permit in Texas, cowboy. Tu comprende, vaquero? La prision. Btw your state is ranked NINTH in the list of gun-friendly states. Do better. Fucking Austin and Dallas liberals did you dirty. https://ammo.com/articles/most-gun-friendly-states#new-hampshire Stay mad, putito permalink award report block reply\nBastard -1 points 6 days ago Honest cop is going to get fired. permalink award report block reply"
}