{
  "id": "1ARK9iq7ZR",
  "url": "https://patriots.win/p/1ARK9iq7ZR/npc-programming-has-been-updated/c",
  "content": "334 NPC programming has been updated posted 2 days ago by awookienookie 20 comments award share download report block\n20 comments Sort by Top Top New Worst Old Save SHILL_DETECTOR 16 points 2 days ago because they didnt get their 1.5 trillion for illegals??? permalink award report block reply patrioticwinning3 1 points 2 days ago Nope!  Globohomo Thune managed to do the bare minimum, once again to keep from being ousted :p permalink parent award report block reply DJT_MFers1 9 points 2 days ago It’s a who’s who of some of the shittiest people in America permalink award report block reply patrioticwinning3 2 points 2 days ago I'm proud to say IDK the vast majority of them :p permalink parent award report block reply DaninElkhart 8 points 2 days ago Never thought I'd see the most evil of the DemoKKKrat party angry about ending a \"government shut-down\". Hell, I wanted it shut down for ever. permalink award report block reply Breacherbear 6 points 2 days ago We just cant have nice things, can we? permalink parent award report block reply Muttsbitetoo 6 points 2 days ago Soros big mad permalink award report block reply SubmarineGuy 6 points 2 days ago Liberal tears! Yummy! Can you overdose on schadenfreude? permalink award report block reply TruculentGoose 5 points 2 days ago Delicious! permalink award report block reply Awakened 3 points 2 days ago Why in the world were you down voted? Updoot from me. permalink parent award report block reply TruculentGoose 3 points 2 days ago Prob someone from the list lurking lol permalink parent award report block reply Ifeargovtmorethan 4 points 2 days ago Lib Losers V3.4 Install complete permalink award report block reply PatriotSkorzeny 2 points 2 days ago Many mamdanis will be s”elected”. permalink award report block reply War_Hamster 4 points 2 days ago Yup, their new tactic is to out-populist the populist MAGA movement. We'd better some results before the mid-terms. permalink parent award report block reply TheSwampThang 2 points 2 days ago Politics is comprise.  Being able to negotiate better and having a plan to gradually accomplish goals is a political skill. permalink award report block reply chahn1138 1 points 2 days ago May not be getting it....I'd be nothing but pleased to learn that that lot hated me! permalink award report block reply BlackJack1776 1 points 2 days ago 🐕 🌩 gibberish, in ALL CAPS, no less. permalink award report block reply patrioticwinning3 1 points 2 days ago AOC is pleased....\"Neee-Haw Neee-Haw!\" :p permalink award report block reply Smurfection 1 points 2 days ago Schumer is the first of the old guard that's going to go, well, I guess Feinstein and Pelosi are gone too.   Anywho, I predict that within six months, Democrats are going to be calling for censorship of blue sky because it interfere's with the Dems plans and derails the narrative. permalink award report block reply aaafirefly123 0 points 2 days ago Knew this was coming. Schumer is done. He won’t last much longer as the party radicals coup him. permalink award report block reply\nSHILL_DETECTOR 16 points 2 days ago because they didnt get their 1.5 trillion for illegals??? permalink award report block reply patrioticwinning3 1 points 2 days ago Nope!  Globohomo Thune managed to do the bare minimum, once again to keep from being ousted :p permalink parent award report block reply\npatrioticwinning3 1 points 2 days ago Nope!  Globohomo Thune managed to do the bare minimum, once again to keep from being ousted :p permalink parent award report block reply\nDJT_MFers1 9 points 2 days ago It’s a who’s who of some of the shittiest people in America permalink award report block reply patrioticwinning3 2 points 2 days ago I'm proud to say IDK the vast majority of them :p permalink parent award report block reply\npatrioticwinning3 2 points 2 days ago I'm proud to say IDK the vast majority of them :p permalink parent award report block reply\nDaninElkhart 8 points 2 days ago Never thought I'd see the most evil of the DemoKKKrat party angry about ending a \"government shut-down\". Hell, I wanted it shut down for ever. permalink award report block reply Breacherbear 6 points 2 days ago We just cant have nice things, can we? permalink parent award report block reply\nBreacherbear 6 points 2 days ago We just cant have nice things, can we? permalink parent award report block reply\nMuttsbitetoo 6 points 2 days ago Soros big mad permalink award report block reply\nSubmarineGuy 6 points 2 days ago Liberal tears! Yummy! Can you overdose on schadenfreude? permalink award report block reply\nTruculentGoose 5 points 2 days ago Delicious! permalink award report block reply Awakened 3 points 2 days ago Why in the world were you down voted? Updoot from me. permalink parent award report block reply TruculentGoose 3 points 2 days ago Prob someone from the list lurking lol permalink parent award report block reply\nAwakened 3 points 2 days ago Why in the world were you down voted? Updoot from me. permalink parent award report block reply TruculentGoose 3 points 2 days ago Prob someone from the list lurking lol permalink parent award report block reply\nTruculentGoose 3 points 2 days ago Prob someone from the list lurking lol permalink parent award report block reply\nIfeargovtmorethan 4 points 2 days ago Lib Losers V3.4 Install complete permalink award report block reply\nPatriotSkorzeny 2 points 2 days ago Many mamdanis will be s”elected”. permalink award report block reply War_Hamster 4 points 2 days ago Yup, their new tactic is to out-populist the populist MAGA movement. We'd better some results before the mid-terms. permalink parent award report block reply\nWar_Hamster 4 points 2 days ago Yup, their new tactic is to out-populist the populist MAGA movement. We'd better some results before the mid-terms. permalink parent award report block reply\nTheSwampThang 2 points 2 days ago Politics is comprise.  Being able to negotiate better and having a plan to gradually accomplish goals is a political skill. permalink award report block reply\nchahn1138 1 points 2 days ago May not be getting it....I'd be nothing but pleased to learn that that lot hated me! permalink award report block reply\nBlackJack1776 1 points 2 days ago 🐕 🌩 gibberish, in ALL CAPS, no less. permalink award report block reply\npatrioticwinning3 1 points 2 days ago AOC is pleased....\"Neee-Haw Neee-Haw!\" :p permalink award report block reply\nSmurfection 1 points 2 days ago Schumer is the first of the old guard that's going to go, well, I guess Feinstein and Pelosi are gone too.   Anywho, I predict that within six months, Democrats are going to be calling for censorship of blue sky because it interfere's with the Dems plans and derails the narrative. permalink award report block reply\naaafirefly123 0 points 2 days ago Knew this was coming. Schumer is done. He won’t last much longer as the party radicals coup him. permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:02.305242Z"
}