{
  "id": "1ARK9mFrhB",
  "url": "https://patriots.win/p/1ARK9mFrhB/breaking-fbi-bribe-file-exposes-/c",
  "content": "124 🚨🚨🚨BREAKING: FBI BRIBE FILE EXPOSES $10 MILLION BIDEN PAYOFF FROM UKRAINE The biggest scandal in modern American history just went nuclear. According to documents the FBI tried to bury, a confidential source told investigators that Joe and Hunter Biden were each paid $5 million in bribes. posted 21 hours ago by MEME-SUPREME 6 comments award share report block Jim Ferguson @JimFergusonUK • 2d 🚨 BREAKING: FBI BRIBE FILE EXPOSES $10 MILLION BIDEN PAYOFF FROM UKRAINE 🚨 The biggest scandal in modern American history just went nuclear. According to documents the FBI tried to bury, a confidential source told investigators that Joe and Hunter Biden were each paid $5\n6 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Toecutter7N6 8 points 21 hours ago So. Nothing will be done. permalink award report block reply Zhongda 3 points 21 hours ago Yeah, great.  Let's send more money and weapons to them anyways because muh Russia. permalink award report block reply FusionBlack 3 points 19 hours ago Breaking. Nothing will happen. In other news learn to speak indian and Chinese. Your my ew employer will need you to. permalink award report block reply 12points 2 points 20 hours ago Old news. permalink award report block reply DeadOverRed 2 points 19 hours ago Pretty disappointed they only got $10million to destroy the United States. permalink award report block reply NancyPeloci 2 points 20 hours ago Wow 3 flashing red lights, Breaking, Nuclear AND ALERT?  Plus all those capitalized letters?!   I better click on it at least 3 times. permalink award report block reply TinfoilHardhat 1 points 19 hours ago So we just wait for it to leave Blondi's desk, right? permalink award report block reply\nToecutter7N6 8 points 21 hours ago So. Nothing will be done. permalink award report block reply\nZhongda 3 points 21 hours ago Yeah, great.  Let's send more money and weapons to them anyways because muh Russia. permalink award report block reply\nFusionBlack 3 points 19 hours ago Breaking. Nothing will happen. In other news learn to speak indian and Chinese. Your my ew employer will need you to. permalink award report block reply\n12points 2 points 20 hours ago Old news. permalink award report block reply\nDeadOverRed 2 points 19 hours ago Pretty disappointed they only got $10million to destroy the United States. permalink award report block reply\nNancyPeloci 2 points 20 hours ago Wow 3 flashing red lights, Breaking, Nuclear AND ALERT?  Plus all those capitalized letters?!   I better click on it at least 3 times. permalink award report block reply\nTinfoilHardhat 1 points 19 hours ago So we just wait for it to leave Blondi's desk, right? permalink award report block reply",
  "fetched_at": "2025-11-12T23:28:02.756056Z"
}