{
  "id": "1ARK5A8kPl",
  "url": "https://patriots.win/p/1ARK5A8kPl/us-dept-of-agriculture-memo-orde/c",
  "content": "1220 US Dept of Agriculture memo orders  \"States must immediately undo any steps taken to issue full  SNAP benefits for November 2025\" posted 3 days ago by I-am-Orlando PRO 79 comments award share download report block\n79 comments Sort by Top Top New Worst Old Save The Real Story Behind His Exit No One Saw Coming Read More Ads by Ad.Style snakeoil 99 points 3 days ago Let it burn permalink award report block reply BeauHD 24 points 3 days ago Agro Inferno! permalink parent award report block reply USMC1234O10 5 points 3 days ago I fucked many a whore to that song. permalink parent award report block reply trumpORbust 14 points 3 days ago Did you pay them in EBT credits? permalink parent award report block reply USMC1234O10 -7 points 3 days ago I paid them with some fuckin cock in the ass. permalink parent award report block reply view 5 more comments... popcycle 3 points 3 days ago Corn baby corn permalink parent award report block reply ALT26 1 points 3 days ago Afro Inferno! permalink parent award report block reply deleted 0 points 3 days ago Kraken_V_Algorithm 0 points 3 days ago Same thing. permalink parent award report block reply BlackCrimesMatter 9 points 3 days ago Cut all federal funding to states that did this. Problem will solve itself. permalink parent award report block reply snuggs316 2 points 3 days ago hochul announced this morning that she was doing this very thing.  from an emergency fund. shrugs so use it...but the next hurricane/winter storm, etc...federal taxpayers will not be bailing ny out.  considering the debt the state is in, i'm not sure where she's going to majick the money from. permalink parent award report block reply HuggableBear 5 points 3 days ago Don't pay out 100% to the parasites, just continue to pay 65% Just can't stop winning, guise permalink parent award report block reply AVeryNakedMan 4 points 3 days ago Burn those calories. Intermittent fasting is so hot right now. permalink parent award report block reply DRKMSTR 52 points 3 days ago Liability letter. \"You paid out, we didn't authorize, we won't pay you back\" Simple as that, not a \"screw you buddy\" letter, but a \"you can't hold us liable\" letter. permalink award report block reply JLoonacy 7 points 3 days ago Exactly. Many states had already decided to pay at least partial SNAP payments from various emergency reserve funds before the federal judge had ordered Trump to pay SNAP in full. The states were not expecting to be paid back with federal funds when they decided to pass these partial payments, so this is definitely just more CYA paperwork from the federal government. permalink parent award report block reply HunterBidensPC 2 points 3 days ago Would love to see a judge argue against this. Surely many will permalink parent award report block reply Zhongda 40 points 3 days ago And how many commie judges will issue injunctions and clog up the courts for the next month, hm?  Asking for a friend. permalink award report block reply DT170x 21 points 3 days ago All of them and then some. permalink parent award report block reply JoePlumber 3 points 3 days ago Did you even read the letter? permalink parent award report block reply MasterChief08 -2 points 3 days ago Doesn't matter. Stopping Trump is easier than ordering Trump to do something especially if even the leftwing justices in SCOTUS don't think it's possible. Government can't act fast enough to dispense money. The parasitic class is fucked  - mostly leftist Democrats permalink parent award report block reply SavingPrivateGrace 30 points 3 days ago What a mess.  The States began full SNAP benefits on EBT cards based on a District Court orders.  It went from 50% reduction to now 35% reduction of max benefit.  Such a fiasco.  The fear the EBT queens is real. permalink award report block reply conservativefrank 6 points 3 days ago In the media, it's blamed on Trump. Most people will blame Trump. The midterms will be a bloodbath for MAGA and Republicans. permalink parent award report block reply Appeal2Heaven98 8 points 3 days ago They really are making life a living hell for Trump. Forcing the longest government shutdown in history, trying to force him to keep SNAP or get blamed for \"starving families,\" courts trying to prevent him from using tariffs, stopping just about everything else he wants to do... permalink parent award report block reply ciaramella_is_gay 4 points 3 days ago Yeah and at what point do we fight back the way they fight us? We will never win because we are fucking pussies that think the law will save us, when they're using it to stall Trump until his term is done and it's back to dumb shit all over again. permalink parent award report block reply 6iggu56icku5 1 points 3 days ago We play by the rules they define, yet they consistently break themselves. What do you do on the playground with a bully that cheats? permalink parent award report block reply view 1 more comments... AVeryNakedMan 7 points 3 days ago X.com is the media now. A single tweet can get more views than CNN gets in a month. permalink parent award report block reply they-see-me-trollin 6 points 3 days ago this.  legacy media is failing so hard, their audiences are down 90%+ across the board.  joe rogan, tim pool, tucker each have higher viewership than all legacy media combined.  zack hoyt has more than every single legacy media personality, including both prime time and late night, and in many cases, more than entire outlets combined. permalink parent award report block reply ianpatrick1966 1 points 3 days ago Exactly every normie thinks \"trump is starving poor people\" the optics of this has been BEYOND horrible. permalink parent award report block reply thatsallphoax 1 points 3 days ago Cult members who only get their news from CNN perhaps. Most of my timeline is aware that the government was shut down because the Dems voted to keep it shut down 14 times. permalink parent award report block reply popcycle 4 points 3 days ago a mess or a pre arranged conspiracy?  the court ruling comes down, the big blue states grab all the reserve, little or none left for the red states. that doesn't seem accidental, it seems like a gambit to turn red state sbap recipients against Trump. if it was just random chance would it have been Ca, Ore, Wis, NY, Pa, NJ, and so forth? permalink parent award report block reply they-see-me-trollin 3 points 3 days ago anyone who did that was violating the law, even with the junky court order. (1) the november outlays are $9b, but the contingency account only has $5b in it.  even if it was a legitimate and lawful court order, it was physically impossible to comply with. (2) the contingency account isn't earmarked for benefits.  the account is earmarked for SNAP operations as a whole, not benefits.  by the doctrine of executive allocation discretion, Trump could say all of the contingency account is being used for fraud investigations and eligibility reviews, because those are plainly within the operations covered by the statute.  and executive allocation discretion is not even reviewable by federal courts... they have no jurisdiction to even hear the case.  this is why they had to get an activist judge in the first place. in other words, without actual appropriations, anyone distributing funds was acting in violation of law. permalink parent award report block reply Shitsbrokeyo 2 points 3 days ago Isn't the S for supplemental?  Sounds like it needs to go away. permalink parent award report block reply Hanging_Chad 19 points 3 days ago based permalink award report block reply deleted 15 points 3 days ago Zskills 9 points 3 days ago Nice permalink parent award report block reply I-am-Orlando OP PRO 14 points 3 days ago Link https://x.com/MacFarlaneNews/status/1987564842207912334?s=20 permalink award report block reply snoopy3210 7 points 3 days ago This is done to blame Trump for millions losing snap benefits. Whoever wrote the memo must be fired immediately. It could have said: freeze instead of Undo. It could have said: our admin intends to find ways to reopen the government and pay snap benefits. But no. Total gift to the democrats, by a democrat staffer writing that memo. permalink parent award report block reply conservativefrank 4 points 3 days ago The Dems can open the government by giving up on free healthcare for illegals. The leftists refuse to give up on free healthcare for illegals. permalink parent award report block reply deleted 7 points 3 days ago anti_masker 9 points 3 days ago Grape drink sales reach an all-time low. permalink parent award report block reply NoStepNovember 7 points 3 days ago Smoke alarm battery stock still not affected. Safe investment. permalink parent award report block reply they-see-me-trollin 2 points 3 days ago and sunscreen. permalink parent award report block reply Uniquename99999999 1 points 3 days ago Purple drank permalink parent award report block reply MAGAguitar 5 points 3 days ago 🫰🏻 💸 permalink award report block reply raptormissle 5 points 3 days ago Restrict all SNAP benefits to fruits and vegetables with a cap of $100. permalink award report block reply BartzFFV 3 points 3 days ago Yeah starve them with toxic plant matter. permalink parent award report block reply conservativefrank 1 points 3 days ago You'd solve two problems. People would be fed, and they'd be healthier, reducing health care costs. permalink parent award report block reply Hikedelics 0 points 3 days ago And allow that for a max of say, ~18 months. After that restrict it to strychnine and thallium. permalink parent award report block reply JoePlumber 5 points 3 days ago I am getting visions of Michael Scott talking about his multiple vasectomies. permalink award report block reply SGT_Glowie 3 points 3 days ago Snip snap snip snap permalink parent award report block reply JoePlumber 4 points 3 days ago One of the funniest scenes in the whole series and also one of the funniest episodes. permalink parent award report block reply FrmrAmericanRepublic 5 points 3 days ago Awwwww sheeeeeeeit Looks like the sub80's won't get their free bullshit. Oh no, what a tragedy. permalink award report block reply Wesmacker 2 points 3 days ago Lol permalink parent award report block reply Lemonhead965 4 points 3 days ago CA won't. CA Counties are using their slush funds to give out debit cards. permalink award report block reply YaharaRiver 4 points 3 days ago Governor Tony Evers used Wisconsin money to fill SNAP accounts. That means Wisconsin SNAPpers will get November money TWICE.  Once from WI and again when the govt goes off shutdown. Their overreach needs to be reversed immediately!!  And too fucking bad if you already spent it.  Your account balance will be in the negative! permalink award report block reply Doomers_for_Trump 3 points 3 days ago That faggot cant be gone soon enough. permalink parent award report block reply Appeal2Heaven98 3 points 3 days ago Minnesota won't give a shit. Sue the state. Put an extra charge on Keith Ellison while you're at it. permalink award report block reply vongregormench 3 points 3 days ago Thanks random judge for issuing an illegal order to raid another program and causing a giant unecessary additional government cluster fuck. permalink award report block reply HellNoKameltoe 3 points 3 days ago stop asking them to do things, issue a warning, 24hr tops then punish severely for non-compliance. permalink award report block reply BadBrainsBuzzcocks 3 points 3 days ago Awesome. So along with the poor cleaning lady Juanita with 5 kids getting deported pander stories, we now have a barrage of fat low IQ Shaniqua with 10 starving bastards coverage. It's endless and constant. We'll get the blame. I know it's the right thing. I want a full audit and work requirements. Our messaging hasn't been great. permalink award report block reply South_Florida_Guy 2 points 3 days ago Get a job! permalink award report block reply Forty_Five 2 points 3 days ago If forced to work or starve democrats will steal from those who work. permalink award report block reply Quiznos585 2 points 3 days ago RI federal judge incoming in 3….2…1…… permalink award report block reply dres3 1 points 3 days ago To explain this to SNAP recipients. Trump is trying to fill it, the courts are trying to empty it.  It is more nuance, but that is the 'dreaded rabbit hole' territory they don't wanna hear. permalink award report block reply SisterCovfefeToo 1 points 3 days ago States are still allowed to fund 65% of the max. allotment. permalink award report block reply TidewaterYank 1 points 3 days ago Fauci got cartloads of money for pushing drugs....Zero collects for pushing insurance. permalink award report block reply terribletwos 1 points 3 days ago Let the state absorb the costs too. permalink award report block reply OldBark2 1 points 3 days ago Or WHAT o'mighty dept of Agriculture??? permalink award report block reply Wesmacker 1 points 3 days ago The illegals are still getting 65% of their typical amount... permalink award report block reply mikethemarine 1 points 3 days ago I say let them do it and DON'T reimbursed them for any of it permalink award report block reply conservativefrank 0 points 3 days ago So the people who got food and ate it have to regurgitate it? permalink award report block reply BoomShtick 2 points 3 days ago No, their account balance should be negative permalink parent award report block reply new_guy2 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nsnakeoil 99 points 3 days ago Let it burn permalink award report block reply BeauHD 24 points 3 days ago Agro Inferno! permalink parent award report block reply USMC1234O10 5 points 3 days ago I fucked many a whore to that song. permalink parent award report block reply trumpORbust 14 points 3 days ago Did you pay them in EBT credits? permalink parent award report block reply USMC1234O10 -7 points 3 days ago I paid them with some fuckin cock in the ass. permalink parent award report block reply view 5 more comments... popcycle 3 points 3 days ago Corn baby corn permalink parent award report block reply ALT26 1 points 3 days ago Afro Inferno! permalink parent award report block reply deleted 0 points 3 days ago Kraken_V_Algorithm 0 points 3 days ago Same thing. permalink parent award report block reply BlackCrimesMatter 9 points 3 days ago Cut all federal funding to states that did this. Problem will solve itself. permalink parent award report block reply snuggs316 2 points 3 days ago hochul announced this morning that she was doing this very thing.  from an emergency fund. shrugs so use it...but the next hurricane/winter storm, etc...federal taxpayers will not be bailing ny out.  considering the debt the state is in, i'm not sure where she's going to majick the money from. permalink parent award report block reply HuggableBear 5 points 3 days ago Don't pay out 100% to the parasites, just continue to pay 65% Just can't stop winning, guise permalink parent award report block reply AVeryNakedMan 4 points 3 days ago Burn those calories. Intermittent fasting is so hot right now. permalink parent award report block reply\nBeauHD 24 points 3 days ago Agro Inferno! permalink parent award report block reply USMC1234O10 5 points 3 days ago I fucked many a whore to that song. permalink parent award report block reply trumpORbust 14 points 3 days ago Did you pay them in EBT credits? permalink parent award report block reply USMC1234O10 -7 points 3 days ago I paid them with some fuckin cock in the ass. permalink parent award report block reply view 5 more comments... popcycle 3 points 3 days ago Corn baby corn permalink parent award report block reply ALT26 1 points 3 days ago Afro Inferno! permalink parent award report block reply deleted 0 points 3 days ago Kraken_V_Algorithm 0 points 3 days ago Same thing. permalink parent award report block reply\nUSMC1234O10 5 points 3 days ago I fucked many a whore to that song. permalink parent award report block reply trumpORbust 14 points 3 days ago Did you pay them in EBT credits? permalink parent award report block reply USMC1234O10 -7 points 3 days ago I paid them with some fuckin cock in the ass. permalink parent award report block reply view 5 more comments...\ntrumpORbust 14 points 3 days ago Did you pay them in EBT credits? permalink parent award report block reply USMC1234O10 -7 points 3 days ago I paid them with some fuckin cock in the ass. permalink parent award report block reply view 5 more comments...\nUSMC1234O10 -7 points 3 days ago I paid them with some fuckin cock in the ass. permalink parent award report block reply view 5 more comments...\npopcycle 3 points 3 days ago Corn baby corn permalink parent award report block reply\nALT26 1 points 3 days ago Afro Inferno! permalink parent award report block reply\ndeleted 0 points 3 days ago Kraken_V_Algorithm 0 points 3 days ago Same thing. permalink parent award report block reply\nKraken_V_Algorithm 0 points 3 days ago Same thing. permalink parent award report block reply\nBlackCrimesMatter 9 points 3 days ago Cut all federal funding to states that did this. Problem will solve itself. permalink parent award report block reply snuggs316 2 points 3 days ago hochul announced this morning that she was doing this very thing.  from an emergency fund. shrugs so use it...but the next hurricane/winter storm, etc...federal taxpayers will not be bailing ny out.  considering the debt the state is in, i'm not sure where she's going to majick the money from. permalink parent award report block reply\nsnuggs316 2 points 3 days ago hochul announced this morning that she was doing this very thing.  from an emergency fund. shrugs so use it...but the next hurricane/winter storm, etc...federal taxpayers will not be bailing ny out.  considering the debt the state is in, i'm not sure where she's going to majick the money from. permalink parent award report block reply\nHuggableBear 5 points 3 days ago Don't pay out 100% to the parasites, just continue to pay 65% Just can't stop winning, guise permalink parent award report block reply\nAVeryNakedMan 4 points 3 days ago Burn those calories. Intermittent fasting is so hot right now. permalink parent award report block reply\nDRKMSTR 52 points 3 days ago Liability letter. \"You paid out, we didn't authorize, we won't pay you back\" Simple as that, not a \"screw you buddy\" letter, but a \"you can't hold us liable\" letter. permalink award report block reply JLoonacy 7 points 3 days ago Exactly. Many states had already decided to pay at least partial SNAP payments from various emergency reserve funds before the federal judge had ordered Trump to pay SNAP in full. The states were not expecting to be paid back with federal funds when they decided to pass these partial payments, so this is definitely just more CYA paperwork from the federal government. permalink parent award report block reply HunterBidensPC 2 points 3 days ago Would love to see a judge argue against this. Surely many will permalink parent award report block reply\nJLoonacy 7 points 3 days ago Exactly. Many states had already decided to pay at least partial SNAP payments from various emergency reserve funds before the federal judge had ordered Trump to pay SNAP in full. The states were not expecting to be paid back with federal funds when they decided to pass these partial payments, so this is definitely just more CYA paperwork from the federal government. permalink parent award report block reply\nHunterBidensPC 2 points 3 days ago Would love to see a judge argue against this. Surely many will permalink parent award report block reply\nZhongda 40 points 3 days ago And how many commie judges will issue injunctions and clog up the courts for the next month, hm?  Asking for a friend. permalink award report block reply DT170x 21 points 3 days ago All of them and then some. permalink parent award report block reply JoePlumber 3 points 3 days ago Did you even read the letter? permalink parent award report block reply MasterChief08 -2 points 3 days ago Doesn't matter. Stopping Trump is easier than ordering Trump to do something especially if even the leftwing justices in SCOTUS don't think it's possible. Government can't act fast enough to dispense money. The parasitic class is fucked  - mostly leftist Democrats permalink parent award report block reply\nDT170x 21 points 3 days ago All of them and then some. permalink parent award report block reply\nJoePlumber 3 points 3 days ago Did you even read the letter? permalink parent award report block reply\nMasterChief08 -2 points 3 days ago Doesn't matter. Stopping Trump is easier than ordering Trump to do something especially if even the leftwing justices in SCOTUS don't think it's possible. Government can't act fast enough to dispense money. The parasitic class is fucked  - mostly leftist Democrats permalink parent award report block reply\nSavingPrivateGrace 30 points 3 days ago What a mess.  The States began full SNAP benefits on EBT cards based on a District Court orders.  It went from 50% reduction to now 35% reduction of max benefit.  Such a fiasco.  The fear the EBT queens is real. permalink award report block reply conservativefrank 6 points 3 days ago In the media, it's blamed on Trump. Most people will blame Trump. The midterms will be a bloodbath for MAGA and Republicans. permalink parent award report block reply Appeal2Heaven98 8 points 3 days ago They really are making life a living hell for Trump. Forcing the longest government shutdown in history, trying to force him to keep SNAP or get blamed for \"starving families,\" courts trying to prevent him from using tariffs, stopping just about everything else he wants to do... permalink parent award report block reply ciaramella_is_gay 4 points 3 days ago Yeah and at what point do we fight back the way they fight us? We will never win because we are fucking pussies that think the law will save us, when they're using it to stall Trump until his term is done and it's back to dumb shit all over again. permalink parent award report block reply 6iggu56icku5 1 points 3 days ago We play by the rules they define, yet they consistently break themselves. What do you do on the playground with a bully that cheats? permalink parent award report block reply view 1 more comments... AVeryNakedMan 7 points 3 days ago X.com is the media now. A single tweet can get more views than CNN gets in a month. permalink parent award report block reply they-see-me-trollin 6 points 3 days ago this.  legacy media is failing so hard, their audiences are down 90%+ across the board.  joe rogan, tim pool, tucker each have higher viewership than all legacy media combined.  zack hoyt has more than every single legacy media personality, including both prime time and late night, and in many cases, more than entire outlets combined. permalink parent award report block reply ianpatrick1966 1 points 3 days ago Exactly every normie thinks \"trump is starving poor people\" the optics of this has been BEYOND horrible. permalink parent award report block reply thatsallphoax 1 points 3 days ago Cult members who only get their news from CNN perhaps. Most of my timeline is aware that the government was shut down because the Dems voted to keep it shut down 14 times. permalink parent award report block reply popcycle 4 points 3 days ago a mess or a pre arranged conspiracy?  the court ruling comes down, the big blue states grab all the reserve, little or none left for the red states. that doesn't seem accidental, it seems like a gambit to turn red state sbap recipients against Trump. if it was just random chance would it have been Ca, Ore, Wis, NY, Pa, NJ, and so forth? permalink parent award report block reply they-see-me-trollin 3 points 3 days ago anyone who did that was violating the law, even with the junky court order. (1) the november outlays are $9b, but the contingency account only has $5b in it.  even if it was a legitimate and lawful court order, it was physically impossible to comply with. (2) the contingency account isn't earmarked for benefits.  the account is earmarked for SNAP operations as a whole, not benefits.  by the doctrine of executive allocation discretion, Trump could say all of the contingency account is being used for fraud investigations and eligibility reviews, because those are plainly within the operations covered by the statute.  and executive allocation discretion is not even reviewable by federal courts... they have no jurisdiction to even hear the case.  this is why they had to get an activist judge in the first place. in other words, without actual appropriations, anyone distributing funds was acting in violation of law. permalink parent award report block reply Shitsbrokeyo 2 points 3 days ago Isn't the S for supplemental?  Sounds like it needs to go away. permalink parent award report block reply\nconservativefrank 6 points 3 days ago In the media, it's blamed on Trump. Most people will blame Trump. The midterms will be a bloodbath for MAGA and Republicans. permalink parent award report block reply Appeal2Heaven98 8 points 3 days ago They really are making life a living hell for Trump. Forcing the longest government shutdown in history, trying to force him to keep SNAP or get blamed for \"starving families,\" courts trying to prevent him from using tariffs, stopping just about everything else he wants to do... permalink parent award report block reply ciaramella_is_gay 4 points 3 days ago Yeah and at what point do we fight back the way they fight us? We will never win because we are fucking pussies that think the law will save us, when they're using it to stall Trump until his term is done and it's back to dumb shit all over again. permalink parent award report block reply 6iggu56icku5 1 points 3 days ago We play by the rules they define, yet they consistently break themselves. What do you do on the playground with a bully that cheats? permalink parent award report block reply view 1 more comments... AVeryNakedMan 7 points 3 days ago X.com is the media now. A single tweet can get more views than CNN gets in a month. permalink parent award report block reply they-see-me-trollin 6 points 3 days ago this.  legacy media is failing so hard, their audiences are down 90%+ across the board.  joe rogan, tim pool, tucker each have higher viewership than all legacy media combined.  zack hoyt has more than every single legacy media personality, including both prime time and late night, and in many cases, more than entire outlets combined. permalink parent award report block reply ianpatrick1966 1 points 3 days ago Exactly every normie thinks \"trump is starving poor people\" the optics of this has been BEYOND horrible. permalink parent award report block reply thatsallphoax 1 points 3 days ago Cult members who only get their news from CNN perhaps. Most of my timeline is aware that the government was shut down because the Dems voted to keep it shut down 14 times. permalink parent award report block reply\nAppeal2Heaven98 8 points 3 days ago They really are making life a living hell for Trump. Forcing the longest government shutdown in history, trying to force him to keep SNAP or get blamed for \"starving families,\" courts trying to prevent him from using tariffs, stopping just about everything else he wants to do... permalink parent award report block reply ciaramella_is_gay 4 points 3 days ago Yeah and at what point do we fight back the way they fight us? We will never win because we are fucking pussies that think the law will save us, when they're using it to stall Trump until his term is done and it's back to dumb shit all over again. permalink parent award report block reply 6iggu56icku5 1 points 3 days ago We play by the rules they define, yet they consistently break themselves. What do you do on the playground with a bully that cheats? permalink parent award report block reply view 1 more comments...\nciaramella_is_gay 4 points 3 days ago Yeah and at what point do we fight back the way they fight us? We will never win because we are fucking pussies that think the law will save us, when they're using it to stall Trump until his term is done and it's back to dumb shit all over again. permalink parent award report block reply 6iggu56icku5 1 points 3 days ago We play by the rules they define, yet they consistently break themselves. What do you do on the playground with a bully that cheats? permalink parent award report block reply view 1 more comments...\n6iggu56icku5 1 points 3 days ago We play by the rules they define, yet they consistently break themselves. What do you do on the playground with a bully that cheats? permalink parent award report block reply view 1 more comments...\nAVeryNakedMan 7 points 3 days ago X.com is the media now. A single tweet can get more views than CNN gets in a month. permalink parent award report block reply they-see-me-trollin 6 points 3 days ago this.  legacy media is failing so hard, their audiences are down 90%+ across the board.  joe rogan, tim pool, tucker each have higher viewership than all legacy media combined.  zack hoyt has more than every single legacy media personality, including both prime time and late night, and in many cases, more than entire outlets combined. permalink parent award report block reply\nthey-see-me-trollin 6 points 3 days ago this.  legacy media is failing so hard, their audiences are down 90%+ across the board.  joe rogan, tim pool, tucker each have higher viewership than all legacy media combined.  zack hoyt has more than every single legacy media personality, including both prime time and late night, and in many cases, more than entire outlets combined. permalink parent award report block reply\nianpatrick1966 1 points 3 days ago Exactly every normie thinks \"trump is starving poor people\" the optics of this has been BEYOND horrible. permalink parent award report block reply thatsallphoax 1 points 3 days ago Cult members who only get their news from CNN perhaps. Most of my timeline is aware that the government was shut down because the Dems voted to keep it shut down 14 times. permalink parent award report block reply\nthatsallphoax 1 points 3 days ago Cult members who only get their news from CNN perhaps. Most of my timeline is aware that the government was shut down because the Dems voted to keep it shut down 14 times. permalink parent award report block reply\npopcycle 4 points 3 days ago a mess or a pre arranged conspiracy?  the court ruling comes down, the big blue states grab all the reserve, little or none left for the red states. that doesn't seem accidental, it seems like a gambit to turn red state sbap recipients against Trump. if it was just random chance would it have been Ca, Ore, Wis, NY, Pa, NJ, and so forth? permalink parent award report block reply\nthey-see-me-trollin 3 points 3 days ago anyone who did that was violating the law, even with the junky court order. (1) the november outlays are $9b, but the contingency account only has $5b in it.  even if it was a legitimate and lawful court order, it was physically impossible to comply with. (2) the contingency account isn't earmarked for benefits.  the account is earmarked for SNAP operations as a whole, not benefits.  by the doctrine of executive allocation discretion, Trump could say all of the contingency account is being used for fraud investigations and eligibility reviews, because those are plainly within the operations covered by the statute.  and executive allocation discretion is not even reviewable by federal courts... they have no jurisdiction to even hear the case.  this is why they had to get an activist judge in the first place. in other words, without actual appropriations, anyone distributing funds was acting in violation of law. permalink parent award report block reply\nShitsbrokeyo 2 points 3 days ago Isn't the S for supplemental?  Sounds like it needs to go away. permalink parent award report block reply\nHanging_Chad 19 points 3 days ago based permalink award report block reply\ndeleted 15 points 3 days ago Zskills 9 points 3 days ago Nice permalink parent award report block reply\nZskills 9 points 3 days ago Nice permalink parent award report block reply\nI-am-Orlando OP PRO 14 points 3 days ago Link https://x.com/MacFarlaneNews/status/1987564842207912334?s=20 permalink award report block reply snoopy3210 7 points 3 days ago This is done to blame Trump for millions losing snap benefits. Whoever wrote the memo must be fired immediately. It could have said: freeze instead of Undo. It could have said: our admin intends to find ways to reopen the government and pay snap benefits. But no. Total gift to the democrats, by a democrat staffer writing that memo. permalink parent award report block reply conservativefrank 4 points 3 days ago The Dems can open the government by giving up on free healthcare for illegals. The leftists refuse to give up on free healthcare for illegals. permalink parent award report block reply\nsnoopy3210 7 points 3 days ago This is done to blame Trump for millions losing snap benefits. Whoever wrote the memo must be fired immediately. It could have said: freeze instead of Undo. It could have said: our admin intends to find ways to reopen the government and pay snap benefits. But no. Total gift to the democrats, by a democrat staffer writing that memo. permalink parent award report block reply conservativefrank 4 points 3 days ago The Dems can open the government by giving up on free healthcare for illegals. The leftists refuse to give up on free healthcare for illegals. permalink parent award report block reply\nconservativefrank 4 points 3 days ago The Dems can open the government by giving up on free healthcare for illegals. The leftists refuse to give up on free healthcare for illegals. permalink parent award report block reply\ndeleted 7 points 3 days ago anti_masker 9 points 3 days ago Grape drink sales reach an all-time low. permalink parent award report block reply NoStepNovember 7 points 3 days ago Smoke alarm battery stock still not affected. Safe investment. permalink parent award report block reply they-see-me-trollin 2 points 3 days ago and sunscreen. permalink parent award report block reply Uniquename99999999 1 points 3 days ago Purple drank permalink parent award report block reply\nanti_masker 9 points 3 days ago Grape drink sales reach an all-time low. permalink parent award report block reply NoStepNovember 7 points 3 days ago Smoke alarm battery stock still not affected. Safe investment. permalink parent award report block reply they-see-me-trollin 2 points 3 days ago and sunscreen. permalink parent award report block reply Uniquename99999999 1 points 3 days ago Purple drank permalink parent award report block reply\nNoStepNovember 7 points 3 days ago Smoke alarm battery stock still not affected. Safe investment. permalink parent award report block reply they-see-me-trollin 2 points 3 days ago and sunscreen. permalink parent award report block reply\nthey-see-me-trollin 2 points 3 days ago and sunscreen. permalink parent award report block reply\nUniquename99999999 1 points 3 days ago Purple drank permalink parent award report block reply\nMAGAguitar 5 points 3 days ago 🫰🏻 💸 permalink award report block reply\nraptormissle 5 points 3 days ago Restrict all SNAP benefits to fruits and vegetables with a cap of $100. permalink award report block reply BartzFFV 3 points 3 days ago Yeah starve them with toxic plant matter. permalink parent award report block reply conservativefrank 1 points 3 days ago You'd solve two problems. People would be fed, and they'd be healthier, reducing health care costs. permalink parent award report block reply Hikedelics 0 points 3 days ago And allow that for a max of say, ~18 months. After that restrict it to strychnine and thallium. permalink parent award report block reply\nBartzFFV 3 points 3 days ago Yeah starve them with toxic plant matter. permalink parent award report block reply\nconservativefrank 1 points 3 days ago You'd solve two problems. People would be fed, and they'd be healthier, reducing health care costs. permalink parent award report block reply\nHikedelics 0 points 3 days ago And allow that for a max of say, ~18 months. After that restrict it to strychnine and thallium. permalink parent award report block reply\nJoePlumber 5 points 3 days ago I am getting visions of Michael Scott talking about his multiple vasectomies. permalink award report block reply SGT_Glowie 3 points 3 days ago Snip snap snip snap permalink parent award report block reply JoePlumber 4 points 3 days ago One of the funniest scenes in the whole series and also one of the funniest episodes. permalink parent award report block reply\nSGT_Glowie 3 points 3 days ago Snip snap snip snap permalink parent award report block reply JoePlumber 4 points 3 days ago One of the funniest scenes in the whole series and also one of the funniest episodes. permalink parent award report block reply\nJoePlumber 4 points 3 days ago One of the funniest scenes in the whole series and also one of the funniest episodes. permalink parent award report block reply\nFrmrAmericanRepublic 5 points 3 days ago Awwwww sheeeeeeeit Looks like the sub80's won't get their free bullshit. Oh no, what a tragedy. permalink award report block reply Wesmacker 2 points 3 days ago Lol permalink parent award report block reply\nWesmacker 2 points 3 days ago Lol permalink parent award report block reply\nLemonhead965 4 points 3 days ago CA won't. CA Counties are using their slush funds to give out debit cards. permalink award report block reply\nYaharaRiver 4 points 3 days ago Governor Tony Evers used Wisconsin money to fill SNAP accounts. That means Wisconsin SNAPpers will get November money TWICE.  Once from WI and again when the govt goes off shutdown. Their overreach needs to be reversed immediately!!  And too fucking bad if you already spent it.  Your account balance will be in the negative! permalink award report block reply Doomers_for_Trump 3 points 3 days ago That faggot cant be gone soon enough. permalink parent award report block reply\nDoomers_for_Trump 3 points 3 days ago That faggot cant be gone soon enough. permalink parent award report block reply\nAppeal2Heaven98 3 points 3 days ago Minnesota won't give a shit. Sue the state. Put an extra charge on Keith Ellison while you're at it. permalink award report block reply\nvongregormench 3 points 3 days ago Thanks random judge for issuing an illegal order to raid another program and causing a giant unecessary additional government cluster fuck. permalink award report block reply\nHellNoKameltoe 3 points 3 days ago stop asking them to do things, issue a warning, 24hr tops then punish severely for non-compliance. permalink award report block reply\nBadBrainsBuzzcocks 3 points 3 days ago Awesome. So along with the poor cleaning lady Juanita with 5 kids getting deported pander stories, we now have a barrage of fat low IQ Shaniqua with 10 starving bastards coverage. It's endless and constant. We'll get the blame. I know it's the right thing. I want a full audit and work requirements. Our messaging hasn't been great. permalink award report block reply\nSouth_Florida_Guy 2 points 3 days ago Get a job! permalink award report block reply\nForty_Five 2 points 3 days ago If forced to work or starve democrats will steal from those who work. permalink award report block reply\nQuiznos585 2 points 3 days ago RI federal judge incoming in 3….2…1…… permalink award report block reply\ndres3 1 points 3 days ago To explain this to SNAP recipients. Trump is trying to fill it, the courts are trying to empty it.  It is more nuance, but that is the 'dreaded rabbit hole' territory they don't wanna hear. permalink award report block reply\nSisterCovfefeToo 1 points 3 days ago States are still allowed to fund 65% of the max. allotment. permalink award report block reply\nTidewaterYank 1 points 3 days ago Fauci got cartloads of money for pushing drugs....Zero collects for pushing insurance. permalink award report block reply\nterribletwos 1 points 3 days ago Let the state absorb the costs too. permalink award report block reply\nOldBark2 1 points 3 days ago Or WHAT o'mighty dept of Agriculture??? permalink award report block reply\nWesmacker 1 points 3 days ago The illegals are still getting 65% of their typical amount... permalink award report block reply\nmikethemarine 1 points 3 days ago I say let them do it and DON'T reimbursed them for any of it permalink award report block reply\nconservativefrank 0 points 3 days ago So the people who got food and ate it have to regurgitate it? permalink award report block reply BoomShtick 2 points 3 days ago No, their account balance should be negative permalink parent award report block reply\nBoomShtick 2 points 3 days ago No, their account balance should be negative permalink parent award report block reply\nnew_guy2 1 points 3 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:42:59.832357Z"
}