{
  "id": "1ARK9nP5MW",
  "url": "https://patriots.win/p/1ARK9nP5MW/apple-announces-digital-id/c",
  "content": "234 Apple announces \"digital ID\" 🚫  1984  🚫 posted 4 hours ago by PatriotSam 58 comments award share report block Leading Report @LeadingReport • 4h BREAKING: Apple announces “digital ID.”\n58 comments Sort by Top Top New Worst Old Save guywholikesDjtof2024 48 points 3 hours ago What does this mean? This is vague. permalink award report block reply Jackhererer 52 points 3 hours ago But it's breaking Twitter post with no information so it gets stickied. permalink parent award report block reply PapaPepe 9 points 2 hours ago The only way to make it stop is if you downvote worthless siren/breaking/amazing posts permalink parent award report block reply Jackhererer 3 points 2 hours ago Don't think that will stop it.  Too many idiots just auto up vote it cause it's stickied... permalink parent award report block reply staroframphansbhole 3 points 2 hours ago It's really mildly interesting consumer tech news that is worded in such a way to appeal to the amygdalas of boomers weary of a one world government. permalink parent award report block reply SpellingContable 2 points 2 hours ago Im not sure that boomers are wary of a one world government. In theory its gen X and anyone else who is not female, gay or soy. Everyone should be wary of the George Soros/Bill Gates/Chick in charge of the EU types. As well as the muslims and the zionists. FFS, take a look at England and Europe with the raping and the stabbings of peace. permalink parent award report block reply CantStumpIWin 1 points 2 hours ago Why do you think that is? permalink parent award report block reply ncswicn 0 points 2 hours ago https://search.brave.com/search?q=BREAKING%3A+Apple+announces+%E2%80%9Cdigital+ID.%E2%80%9D&source=desktop&conversation=b4f9e9d8f463f2251528a9&summary=1 permalink parent award report block reply explodejoystick 7 points 3 hours ago So naturally it should be stickied! permalink parent award report block reply PatriotSam OP -1 points 3 hours ago Mods know what's up permalink parent award report block reply staroframphansbhole 10 points 2 hours ago Mods know what's up Netanyahu's asshole permalink parent award report block reply Zskills 4 points 2 hours ago Deep, deep in there.  WAY up there.  I'm talking small intestine, swimming in what he had for lunch a few hours ago. permalink parent award report block reply PatriotSam OP 0 points 2 hours ago 😶 permalink parent award report block reply staroframphansbhole 6 points 2 hours ago You can add your US passport to Apple Wallet. You've already been able to do that for certain US state IDs for multiple years now. Google also has their own version of it. SUPER BREAKING OMG permalink parent award report block reply rdvs34283 4 points 3 hours ago Here's the apple news release: https://www.apple.com/newsroom/2025/11/apple-introduces-digital-id-a-new-way-to-create-and-present-an-id-in-apple-wallet/ Digital ID offers a secure and private way for users to create an ID in Apple Wallet using information from their U.S. passport, and present their ID with iPhone or Apple Watch permalink parent award report block reply cyberwar 4 points 2 hours ago this is so discriminatory to the blaxxxes permalink parent award report block reply JBlaze056 2 points 2 hours ago You have identified an issue and are asking the proper question.  Well played. permalink parent award report block reply load 7 more comments... SHILL_DETECTOR 24 points 3 hours ago BREAKING!!!!!!!!!!!!!!!!!!111111111111111111111111111111111111111 permalink award report block reply covfefecat 11 points 3 hours ago 🚨 🚨 🚨 permalink parent award report block reply Combat_Hamster 2 points 2 hours ago 👨‍🚀🔫👮‍♂️ permalink parent award report block reply GrumpyAmerican 20 points 3 hours ago So now there’s no reason not to require ID to vote permalink award report block reply PatriotSam OP 10 points 2 hours ago Positive spin! permalink parent award report block reply guywholikesDjtof2024 1 points 2 hours ago and Lefties LOOOOVE Apple, so.... permalink parent award report block reply TD_Covfefe_Crusader 1 points 1 hour ago Voter ID isn't so consequential when they allow foreign nationals to register and vote anyway. permalink parent award report block reply JohnBarronGalt 13 points 2 hours ago Allowing U.S. users to store a digital version of their passport in Apple Wallet for use at TSA checkpoints during domestic travel. This feature enhances convenience and security, but it does not replace the physical passport for international travel. Fake and Gay. permalink award report block reply 2008RonPaul2012 1 points 2 hours ago Water boils at 212° and this water is only 200° so that means there is nothing to worry about, frogs. permalink parent award report block reply Vice_Ser 5 points 3 hours ago https://www.apple.com/newsroom/2025/11/apple-introduces-digital-id-a-new-way-to-create-and-present-an-id-in-apple-wallet/ permalink award report block reply PatriotSam OP 4 points 2 hours ago Thank you I was just about to post this. TLDR it means that Apple is working with the government so you can use forms of ID like your own passport to create an ID with them instead of going to the DMV. It's even deeper than I thought it was. So this effectively means that liberals have even less of an excuse for not wanting IDs to vote because Apple just made it easier to get one. permalink parent award report block reply Vice_Ser 5 points 2 hours ago EU managed it in Europe. Our government uses Apple as a pass-through to control us. Truly wild permalink parent award report block reply booblitchutz 3 points 2 hours ago What could go wrong?!! permalink parent award report block reply Vice_Ser 2 points 2 hours ago lol just worry about your 50-year mortgage payments!! permalink parent award report block reply booblitchutz 2 points 2 hours ago Hey I've paid 15 years on my 50 year mortgage and I've already paid $1000 on my principal! permalink parent award report block reply Big-E 3 points 2 hours ago Haha- yeah-NO! permalink award report block reply cciv 3 points 2 hours ago This is stupid.  Why is it stickied? AppleID has been a thing for at least 20 years. permalink award report block reply ncswicn 2 points 2 hours ago https://www.apple.com/newsroom/2025/11/apple-introduces-digital-id-a-new-way-to-create-and-present-an-id-in-apple-wallet/ permalink award report block reply UncleSlayton 2 points 3 hours ago Is Leading Report the Twitter account run by that scrawny furry faggot?  I remember it was a bullshit factory before the election. permalink award report block reply guywholikesDjtof2024 3 points 3 hours ago no that was Rawsalerts permalink parent award report block reply Lol_Garrus 2 points 3 hours ago Digital ID for what? permalink award report block reply PatriotSam OP 0 points 2 hours ago They're basically going to allow you to use forms of government documents such as a passport in order to get an ID through them instead of the DMV. You'll also be able to present this ID through Apple products. permalink parent award report block reply vongregormench 2 points 3 hours ago Who cares? permalink award report block reply SDsc0rch 2 points 2 hours ago \"Digital ID gives more people a way to create and present an ID in Apple Wallet even if they do not have a REAL ID-compliant driver’s license or state ID. Digital ID is not a replacement for a physical passport, and cannot be used for international travel and border crossing in lieu of a U.S. passport.\" my question is... WHO is this for?? permalink award report block reply guywholikesDjtof2024 2 points 2 hours ago not a replacement <--YOU'RE HERE will be intertwined will replace will take over permalink parent award report block reply SDsc0rch 2 points 9 minutes ago yep, the camel's nose in the tent permalink parent award report block reply deeluna 1 points 1 hour ago Digital ID, useful... to the ones issuing it to control everything. permalink award report block reply Coslin 1 points 2 hours ago Yea, I'll just carry my passport. Thanks. permalink award report block reply booblitchutz 1 points 2 hours ago These go to eleven. permalink parent award report block reply SDsc0rch 1 points 2 hours ago from the linked article: \"Digital ID is not a replacement for a physical passport, and cannot be used for international travel and border crossing in lieu of a U.S. passport.\" permalink parent award report block reply SickIcarus 1 points 2 hours ago Honestly, I’m ok with this. In fact, I wish I could use my drivers license in my iPhone and I could stop carrying a wallet entirely. Edit: I already use my iPhone for my flight’s boarding pass - can’t write SSSS on my  phone! permalink award report block reply PatriotSam OP 1 points 2 hours ago Yes it seems more convenient than anything else. Other than Apple getting access to your information, but you know if they already have that anyways permalink parent award report block reply SickIcarus 2 points 2 hours ago Right? “Oh no, Apple has my ID - they’re going to steal my identity!” Unless the concern is their servers get hacked - but that’s why you maintain a credit freeze on all 3 agencies anyways. Like what, T-MO’s never getting hacked? Lol! “But they’ll know what apps you download and what websites you visit!” They already know all that anyways. They already know exactly who I am, so who cares? Steps can be taken (and should be taken) to obfuscate that info already anyways, having my ID in Apple Wallet won’t change anything for the negative. permalink parent award report block reply _Sully_ 1 points 2 hours ago This is probably just announcing tech for storing your ID on your phone. We'd know for sure if this wasn't vague and meaningless. permalink award report block reply For_All_Mankind 1 points 2 hours ago So you can load your ID/Passport into apple wallet? This is hardly newsworthy… permalink award report block reply PatriotSam OP 2 points 2 hours ago No they are giving you the option to get a government ID through them. Instead of going to the DMV. permalink parent award report block reply howardlong75 1 points 1 hour ago Retarded permalink award report block reply\nguywholikesDjtof2024 48 points 3 hours ago What does this mean? This is vague. permalink award report block reply Jackhererer 52 points 3 hours ago But it's breaking Twitter post with no information so it gets stickied. permalink parent award report block reply PapaPepe 9 points 2 hours ago The only way to make it stop is if you downvote worthless siren/breaking/amazing posts permalink parent award report block reply Jackhererer 3 points 2 hours ago Don't think that will stop it.  Too many idiots just auto up vote it cause it's stickied... permalink parent award report block reply staroframphansbhole 3 points 2 hours ago It's really mildly interesting consumer tech news that is worded in such a way to appeal to the amygdalas of boomers weary of a one world government. permalink parent award report block reply SpellingContable 2 points 2 hours ago Im not sure that boomers are wary of a one world government. In theory its gen X and anyone else who is not female, gay or soy. Everyone should be wary of the George Soros/Bill Gates/Chick in charge of the EU types. As well as the muslims and the zionists. FFS, take a look at England and Europe with the raping and the stabbings of peace. permalink parent award report block reply CantStumpIWin 1 points 2 hours ago Why do you think that is? permalink parent award report block reply ncswicn 0 points 2 hours ago https://search.brave.com/search?q=BREAKING%3A+Apple+announces+%E2%80%9Cdigital+ID.%E2%80%9D&source=desktop&conversation=b4f9e9d8f463f2251528a9&summary=1 permalink parent award report block reply explodejoystick 7 points 3 hours ago So naturally it should be stickied! permalink parent award report block reply PatriotSam OP -1 points 3 hours ago Mods know what's up permalink parent award report block reply staroframphansbhole 10 points 2 hours ago Mods know what's up Netanyahu's asshole permalink parent award report block reply Zskills 4 points 2 hours ago Deep, deep in there.  WAY up there.  I'm talking small intestine, swimming in what he had for lunch a few hours ago. permalink parent award report block reply PatriotSam OP 0 points 2 hours ago 😶 permalink parent award report block reply staroframphansbhole 6 points 2 hours ago You can add your US passport to Apple Wallet. You've already been able to do that for certain US state IDs for multiple years now. Google also has their own version of it. SUPER BREAKING OMG permalink parent award report block reply rdvs34283 4 points 3 hours ago Here's the apple news release: https://www.apple.com/newsroom/2025/11/apple-introduces-digital-id-a-new-way-to-create-and-present-an-id-in-apple-wallet/ Digital ID offers a secure and private way for users to create an ID in Apple Wallet using information from their U.S. passport, and present their ID with iPhone or Apple Watch permalink parent award report block reply cyberwar 4 points 2 hours ago this is so discriminatory to the blaxxxes permalink parent award report block reply JBlaze056 2 points 2 hours ago You have identified an issue and are asking the proper question.  Well played. permalink parent award report block reply load 7 more comments...\nJackhererer 52 points 3 hours ago But it's breaking Twitter post with no information so it gets stickied. permalink parent award report block reply PapaPepe 9 points 2 hours ago The only way to make it stop is if you downvote worthless siren/breaking/amazing posts permalink parent award report block reply Jackhererer 3 points 2 hours ago Don't think that will stop it.  Too many idiots just auto up vote it cause it's stickied... permalink parent award report block reply staroframphansbhole 3 points 2 hours ago It's really mildly interesting consumer tech news that is worded in such a way to appeal to the amygdalas of boomers weary of a one world government. permalink parent award report block reply SpellingContable 2 points 2 hours ago Im not sure that boomers are wary of a one world government. In theory its gen X and anyone else who is not female, gay or soy. Everyone should be wary of the George Soros/Bill Gates/Chick in charge of the EU types. As well as the muslims and the zionists. FFS, take a look at England and Europe with the raping and the stabbings of peace. permalink parent award report block reply CantStumpIWin 1 points 2 hours ago Why do you think that is? permalink parent award report block reply ncswicn 0 points 2 hours ago https://search.brave.com/search?q=BREAKING%3A+Apple+announces+%E2%80%9Cdigital+ID.%E2%80%9D&source=desktop&conversation=b4f9e9d8f463f2251528a9&summary=1 permalink parent award report block reply\nPapaPepe 9 points 2 hours ago The only way to make it stop is if you downvote worthless siren/breaking/amazing posts permalink parent award report block reply Jackhererer 3 points 2 hours ago Don't think that will stop it.  Too many idiots just auto up vote it cause it's stickied... permalink parent award report block reply\nJackhererer 3 points 2 hours ago Don't think that will stop it.  Too many idiots just auto up vote it cause it's stickied... permalink parent award report block reply\nstaroframphansbhole 3 points 2 hours ago It's really mildly interesting consumer tech news that is worded in such a way to appeal to the amygdalas of boomers weary of a one world government. permalink parent award report block reply SpellingContable 2 points 2 hours ago Im not sure that boomers are wary of a one world government. In theory its gen X and anyone else who is not female, gay or soy. Everyone should be wary of the George Soros/Bill Gates/Chick in charge of the EU types. As well as the muslims and the zionists. FFS, take a look at England and Europe with the raping and the stabbings of peace. permalink parent award report block reply\nSpellingContable 2 points 2 hours ago Im not sure that boomers are wary of a one world government. In theory its gen X and anyone else who is not female, gay or soy. Everyone should be wary of the George Soros/Bill Gates/Chick in charge of the EU types. As well as the muslims and the zionists. FFS, take a look at England and Europe with the raping and the stabbings of peace. permalink parent award report block reply\nCantStumpIWin 1 points 2 hours ago Why do you think that is? permalink parent award report block reply\nncswicn 0 points 2 hours ago https://search.brave.com/search?q=BREAKING%3A+Apple+announces+%E2%80%9Cdigital+ID.%E2%80%9D&source=desktop&conversation=b4f9e9d8f463f2251528a9&summary=1 permalink parent award report block reply\nexplodejoystick 7 points 3 hours ago So naturally it should be stickied! permalink parent award report block reply PatriotSam OP -1 points 3 hours ago Mods know what's up permalink parent award report block reply staroframphansbhole 10 points 2 hours ago Mods know what's up Netanyahu's asshole permalink parent award report block reply Zskills 4 points 2 hours ago Deep, deep in there.  WAY up there.  I'm talking small intestine, swimming in what he had for lunch a few hours ago. permalink parent award report block reply PatriotSam OP 0 points 2 hours ago 😶 permalink parent award report block reply\nPatriotSam OP -1 points 3 hours ago Mods know what's up permalink parent award report block reply staroframphansbhole 10 points 2 hours ago Mods know what's up Netanyahu's asshole permalink parent award report block reply Zskills 4 points 2 hours ago Deep, deep in there.  WAY up there.  I'm talking small intestine, swimming in what he had for lunch a few hours ago. permalink parent award report block reply PatriotSam OP 0 points 2 hours ago 😶 permalink parent award report block reply\nstaroframphansbhole 10 points 2 hours ago Mods know what's up Netanyahu's asshole permalink parent award report block reply Zskills 4 points 2 hours ago Deep, deep in there.  WAY up there.  I'm talking small intestine, swimming in what he had for lunch a few hours ago. permalink parent award report block reply PatriotSam OP 0 points 2 hours ago 😶 permalink parent award report block reply\nZskills 4 points 2 hours ago Deep, deep in there.  WAY up there.  I'm talking small intestine, swimming in what he had for lunch a few hours ago. permalink parent award report block reply\nPatriotSam OP 0 points 2 hours ago 😶 permalink parent award report block reply\nstaroframphansbhole 6 points 2 hours ago You can add your US passport to Apple Wallet. You've already been able to do that for certain US state IDs for multiple years now. Google also has their own version of it. SUPER BREAKING OMG permalink parent award report block reply\nrdvs34283 4 points 3 hours ago Here's the apple news release: https://www.apple.com/newsroom/2025/11/apple-introduces-digital-id-a-new-way-to-create-and-present-an-id-in-apple-wallet/ Digital ID offers a secure and private way for users to create an ID in Apple Wallet using information from their U.S. passport, and present their ID with iPhone or Apple Watch permalink parent award report block reply cyberwar 4 points 2 hours ago this is so discriminatory to the blaxxxes permalink parent award report block reply\ncyberwar 4 points 2 hours ago this is so discriminatory to the blaxxxes permalink parent award report block reply\nJBlaze056 2 points 2 hours ago You have identified an issue and are asking the proper question.  Well played. permalink parent award report block reply\nSHILL_DETECTOR 24 points 3 hours ago BREAKING!!!!!!!!!!!!!!!!!!111111111111111111111111111111111111111 permalink award report block reply covfefecat 11 points 3 hours ago 🚨 🚨 🚨 permalink parent award report block reply Combat_Hamster 2 points 2 hours ago 👨‍🚀🔫👮‍♂️ permalink parent award report block reply\ncovfefecat 11 points 3 hours ago 🚨 🚨 🚨 permalink parent award report block reply Combat_Hamster 2 points 2 hours ago 👨‍🚀🔫👮‍♂️ permalink parent award report block reply\nCombat_Hamster 2 points 2 hours ago 👨‍🚀🔫👮‍♂️ permalink parent award report block reply\nGrumpyAmerican 20 points 3 hours ago So now there’s no reason not to require ID to vote permalink award report block reply PatriotSam OP 10 points 2 hours ago Positive spin! permalink parent award report block reply guywholikesDjtof2024 1 points 2 hours ago and Lefties LOOOOVE Apple, so.... permalink parent award report block reply TD_Covfefe_Crusader 1 points 1 hour ago Voter ID isn't so consequential when they allow foreign nationals to register and vote anyway. permalink parent award report block reply\nPatriotSam OP 10 points 2 hours ago Positive spin! permalink parent award report block reply\nguywholikesDjtof2024 1 points 2 hours ago and Lefties LOOOOVE Apple, so.... permalink parent award report block reply\nTD_Covfefe_Crusader 1 points 1 hour ago Voter ID isn't so consequential when they allow foreign nationals to register and vote anyway. permalink parent award report block reply\nJohnBarronGalt 13 points 2 hours ago Allowing U.S. users to store a digital version of their passport in Apple Wallet for use at TSA checkpoints during domestic travel. This feature enhances convenience and security, but it does not replace the physical passport for international travel. Fake and Gay. permalink award report block reply 2008RonPaul2012 1 points 2 hours ago Water boils at 212° and this water is only 200° so that means there is nothing to worry about, frogs. permalink parent award report block reply\n2008RonPaul2012 1 points 2 hours ago Water boils at 212° and this water is only 200° so that means there is nothing to worry about, frogs. permalink parent award report block reply\nVice_Ser 5 points 3 hours ago https://www.apple.com/newsroom/2025/11/apple-introduces-digital-id-a-new-way-to-create-and-present-an-id-in-apple-wallet/ permalink award report block reply PatriotSam OP 4 points 2 hours ago Thank you I was just about to post this. TLDR it means that Apple is working with the government so you can use forms of ID like your own passport to create an ID with them instead of going to the DMV. It's even deeper than I thought it was. So this effectively means that liberals have even less of an excuse for not wanting IDs to vote because Apple just made it easier to get one. permalink parent award report block reply Vice_Ser 5 points 2 hours ago EU managed it in Europe. Our government uses Apple as a pass-through to control us. Truly wild permalink parent award report block reply booblitchutz 3 points 2 hours ago What could go wrong?!! permalink parent award report block reply Vice_Ser 2 points 2 hours ago lol just worry about your 50-year mortgage payments!! permalink parent award report block reply booblitchutz 2 points 2 hours ago Hey I've paid 15 years on my 50 year mortgage and I've already paid $1000 on my principal! permalink parent award report block reply\nPatriotSam OP 4 points 2 hours ago Thank you I was just about to post this. TLDR it means that Apple is working with the government so you can use forms of ID like your own passport to create an ID with them instead of going to the DMV. It's even deeper than I thought it was. So this effectively means that liberals have even less of an excuse for not wanting IDs to vote because Apple just made it easier to get one. permalink parent award report block reply Vice_Ser 5 points 2 hours ago EU managed it in Europe. Our government uses Apple as a pass-through to control us. Truly wild permalink parent award report block reply booblitchutz 3 points 2 hours ago What could go wrong?!! permalink parent award report block reply Vice_Ser 2 points 2 hours ago lol just worry about your 50-year mortgage payments!! permalink parent award report block reply booblitchutz 2 points 2 hours ago Hey I've paid 15 years on my 50 year mortgage and I've already paid $1000 on my principal! permalink parent award report block reply\nVice_Ser 5 points 2 hours ago EU managed it in Europe. Our government uses Apple as a pass-through to control us. Truly wild permalink parent award report block reply\nbooblitchutz 3 points 2 hours ago What could go wrong?!! permalink parent award report block reply Vice_Ser 2 points 2 hours ago lol just worry about your 50-year mortgage payments!! permalink parent award report block reply booblitchutz 2 points 2 hours ago Hey I've paid 15 years on my 50 year mortgage and I've already paid $1000 on my principal! permalink parent award report block reply\nVice_Ser 2 points 2 hours ago lol just worry about your 50-year mortgage payments!! permalink parent award report block reply booblitchutz 2 points 2 hours ago Hey I've paid 15 years on my 50 year mortgage and I've already paid $1000 on my principal! permalink parent award report block reply\nbooblitchutz 2 points 2 hours ago Hey I've paid 15 years on my 50 year mortgage and I've already paid $1000 on my principal! permalink parent award report block reply\nBig-E 3 points 2 hours ago Haha- yeah-NO! permalink award report block reply\ncciv 3 points 2 hours ago This is stupid.  Why is it stickied? AppleID has been a thing for at least 20 years. permalink award report block reply\nncswicn 2 points 2 hours ago https://www.apple.com/newsroom/2025/11/apple-introduces-digital-id-a-new-way-to-create-and-present-an-id-in-apple-wallet/ permalink award report block reply\nUncleSlayton 2 points 3 hours ago Is Leading Report the Twitter account run by that scrawny furry faggot?  I remember it was a bullshit factory before the election. permalink award report block reply guywholikesDjtof2024 3 points 3 hours ago no that was Rawsalerts permalink parent award report block reply\nguywholikesDjtof2024 3 points 3 hours ago no that was Rawsalerts permalink parent award report block reply\nLol_Garrus 2 points 3 hours ago Digital ID for what? permalink award report block reply PatriotSam OP 0 points 2 hours ago They're basically going to allow you to use forms of government documents such as a passport in order to get an ID through them instead of the DMV. You'll also be able to present this ID through Apple products. permalink parent award report block reply\nPatriotSam OP 0 points 2 hours ago They're basically going to allow you to use forms of government documents such as a passport in order to get an ID through them instead of the DMV. You'll also be able to present this ID through Apple products. permalink parent award report block reply\nvongregormench 2 points 3 hours ago Who cares? permalink award report block reply\nSDsc0rch 2 points 2 hours ago \"Digital ID gives more people a way to create and present an ID in Apple Wallet even if they do not have a REAL ID-compliant driver’s license or state ID. Digital ID is not a replacement for a physical passport, and cannot be used for international travel and border crossing in lieu of a U.S. passport.\" my question is... WHO is this for?? permalink award report block reply guywholikesDjtof2024 2 points 2 hours ago not a replacement <--YOU'RE HERE will be intertwined will replace will take over permalink parent award report block reply SDsc0rch 2 points 9 minutes ago yep, the camel's nose in the tent permalink parent award report block reply\nguywholikesDjtof2024 2 points 2 hours ago not a replacement <--YOU'RE HERE will be intertwined will replace will take over permalink parent award report block reply SDsc0rch 2 points 9 minutes ago yep, the camel's nose in the tent permalink parent award report block reply\nSDsc0rch 2 points 9 minutes ago yep, the camel's nose in the tent permalink parent award report block reply\ndeeluna 1 points 1 hour ago Digital ID, useful... to the ones issuing it to control everything. permalink award report block reply\nCoslin 1 points 2 hours ago Yea, I'll just carry my passport. Thanks. permalink award report block reply booblitchutz 1 points 2 hours ago These go to eleven. permalink parent award report block reply SDsc0rch 1 points 2 hours ago from the linked article: \"Digital ID is not a replacement for a physical passport, and cannot be used for international travel and border crossing in lieu of a U.S. passport.\" permalink parent award report block reply\nbooblitchutz 1 points 2 hours ago These go to eleven. permalink parent award report block reply\nSDsc0rch 1 points 2 hours ago from the linked article: \"Digital ID is not a replacement for a physical passport, and cannot be used for international travel and border crossing in lieu of a U.S. passport.\" permalink parent award report block reply\nSickIcarus 1 points 2 hours ago Honestly, I’m ok with this. In fact, I wish I could use my drivers license in my iPhone and I could stop carrying a wallet entirely. Edit: I already use my iPhone for my flight’s boarding pass - can’t write SSSS on my  phone! permalink award report block reply PatriotSam OP 1 points 2 hours ago Yes it seems more convenient than anything else. Other than Apple getting access to your information, but you know if they already have that anyways permalink parent award report block reply SickIcarus 2 points 2 hours ago Right? “Oh no, Apple has my ID - they’re going to steal my identity!” Unless the concern is their servers get hacked - but that’s why you maintain a credit freeze on all 3 agencies anyways. Like what, T-MO’s never getting hacked? Lol! “But they’ll know what apps you download and what websites you visit!” They already know all that anyways. They already know exactly who I am, so who cares? Steps can be taken (and should be taken) to obfuscate that info already anyways, having my ID in Apple Wallet won’t change anything for the negative. permalink parent award report block reply\nPatriotSam OP 1 points 2 hours ago Yes it seems more convenient than anything else. Other than Apple getting access to your information, but you know if they already have that anyways permalink parent award report block reply SickIcarus 2 points 2 hours ago Right? “Oh no, Apple has my ID - they’re going to steal my identity!” Unless the concern is their servers get hacked - but that’s why you maintain a credit freeze on all 3 agencies anyways. Like what, T-MO’s never getting hacked? Lol! “But they’ll know what apps you download and what websites you visit!” They already know all that anyways. They already know exactly who I am, so who cares? Steps can be taken (and should be taken) to obfuscate that info already anyways, having my ID in Apple Wallet won’t change anything for the negative. permalink parent award report block reply\nSickIcarus 2 points 2 hours ago Right? “Oh no, Apple has my ID - they’re going to steal my identity!” Unless the concern is their servers get hacked - but that’s why you maintain a credit freeze on all 3 agencies anyways. Like what, T-MO’s never getting hacked? Lol! “But they’ll know what apps you download and what websites you visit!” They already know all that anyways. They already know exactly who I am, so who cares? Steps can be taken (and should be taken) to obfuscate that info already anyways, having my ID in Apple Wallet won’t change anything for the negative. permalink parent award report block reply\n_Sully_ 1 points 2 hours ago This is probably just announcing tech for storing your ID on your phone. We'd know for sure if this wasn't vague and meaningless. permalink award report block reply\nFor_All_Mankind 1 points 2 hours ago So you can load your ID/Passport into apple wallet? This is hardly newsworthy… permalink award report block reply PatriotSam OP 2 points 2 hours ago No they are giving you the option to get a government ID through them. Instead of going to the DMV. permalink parent award report block reply\nPatriotSam OP 2 points 2 hours ago No they are giving you the option to get a government ID through them. Instead of going to the DMV. permalink parent award report block reply\nhowardlong75 1 points 1 hour ago Retarded permalink award report block reply",
  "fetched_at": "2025-11-12T20:52:21.215669Z"
}