{
  "id": "1ARK9hiHTy",
  "url": "https://patriots.win/p/1ARK9hiHTy/i-dont-even-care-as-long-as-you-/c",
  "content": "314 I don't even care, as long as you never come back. posted 2 days ago by Taraa 26 comments award share download report block\n26 comments Sort by Top Top New Worst Old Save Rydanovich 32 points 2 days ago Wait til he gets over there and the government seizes his assets and dumps him in a camp. permalink award report block reply WhatUCan 4 points 2 days ago You wish They will probably throw him a parade permalink parent award report block reply Bullwinkle 20 points 2 days ago You think we care if you ripped off big banks? At least you will no longer be ripping off taxpayers. Bye permalink award report block reply Strike08 9 points 2 days ago Also big banks know that they just need to give a share to the ccp when they want to collect the debt. Guess who will find out that the banks can find you in China as well permalink parent award report block reply KilroyJCNJ 16 points 2 days ago Cheaper in the long run permalink award report block reply maga_espada 13 points 2 days ago A single 9mm round is even cheaper. permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago Rope is reusable. permalink parent award report block reply LostElf 9 points 2 days ago Just fuckin' leave already. Hurry. Now. GO. permalink award report block reply Beyond_Insemination 9 points 2 days ago This is a reminder that traditional Chinese sentiment does not recognize bold, overt moves as something a celebrated tactician would do. Their war stories are that of quiet, subtle subversion, hoodwinking, and playing a victim as a means to an end that are the most revered in Chinese culture. They are in a 100 year marathon, and have made great progress. permalink award report block reply Beelzy 6 points 2 days ago Lol, he thinks so much of himself. He's just an insignificant numeral on a spreadsheet's bottom line deduction. permalink award report block reply Smurfection 5 points 2 days ago It's not just the Chinese student here.  He's just the one that picked up enough American snarkiness to make it a blast post. Everyone who comes to America sees us as a giant piggy bank for them to Max Out before they have to flee.  Then they come back and do it again. permalink award report block reply YaharaRiver 4 points 2 days ago It takes approximately 150 seconds for the USA to make $140,000 which generated $29 trillion in 2024 (before tariffs!). 2.5 minutes 😂 See ya!! permalink award report block reply Rock9Head 4 points 2 days ago I assume he worked on Top Secret projects. We shouldn’t be educating our enemies that steal. permalink award report block reply ALargeRaccoon 3 points 2 days ago When I was in college, I heard they'd do this with cars too. Buy a brand new top tier trim of whatever they want, and pay just enough so they don't come repossess it then abandon it somewhere when the leave to go back to China. permalink award report block reply God-is-good 3 points 2 days ago “Grab hag” culture goes global permalink award report block reply GontMawr 3 points 2 days ago Its a good job mega banking corporations are behest to their country of origin rules and not some international code that ignores borders......isn't it? Good luck getting credit in the future dipshit, especially with that useless feminism degree. permalink award report block reply Transparency 3 points 2 days ago $140,000 is lunch money to those banks. Pffffttt. Move along, chinkboy. permalink award report block reply covfefe77 2 points 2 days ago american imperialism? you burned your own culture for marx. enjoy your imminent ruin permalink award report block reply DangerousAmerican76 2 points 2 days ago Yeah this never happened, the Chinese are not this stupid, debt to banks is global, there is no escape and this person has embarrassed china and lost face for their nation which is like culture suicide there permalink award report block reply redinmn 2 points 2 days ago Its sad that this person actually thinks the cost of 1/3 of a new house is something that will teach us a lesson. permalink award report block reply MatterThatMetals 2 points 2 days ago Smoke and mirrors anyway ... bye bye permalink award report block reply Major_Nutt 2 points 2 days ago Bro thinks $140,000 is a \"big hit to financial institutions\", when in reality that's a rounding error. permalink award report block reply PepesJusticeBoner 1 points 2 days ago Oh no don't defraud the big banks! Please anything but that! EVEN BETTER it means this little CCP agent will need a whole new identity if he ever tries to return and set up a life in the US. permalink award report block reply Whatyougotson 1 points 2 days ago 3 years worth of average yearly work of a single person. Really not stickin it to the man. . Also this is fake and gay. permalink award report block reply SultansShadow 1 points 2 days ago Hell is surrounded by piles of money for them to enjoy their intense ingratitude 🔥 permalink award report block reply boomerbutnotOKBoomer 1 points 2 days ago FAKE. FAKE AND GAY. reads like the same people who wrote the fake emails from Charlie Kirk's fake assassin. CIA is so lame. permalink award report block reply\nRydanovich 32 points 2 days ago Wait til he gets over there and the government seizes his assets and dumps him in a camp. permalink award report block reply WhatUCan 4 points 2 days ago You wish They will probably throw him a parade permalink parent award report block reply\nWhatUCan 4 points 2 days ago You wish They will probably throw him a parade permalink parent award report block reply\nBullwinkle 20 points 2 days ago You think we care if you ripped off big banks? At least you will no longer be ripping off taxpayers. Bye permalink award report block reply Strike08 9 points 2 days ago Also big banks know that they just need to give a share to the ccp when they want to collect the debt. Guess who will find out that the banks can find you in China as well permalink parent award report block reply\nStrike08 9 points 2 days ago Also big banks know that they just need to give a share to the ccp when they want to collect the debt. Guess who will find out that the banks can find you in China as well permalink parent award report block reply\nKilroyJCNJ 16 points 2 days ago Cheaper in the long run permalink award report block reply maga_espada 13 points 2 days ago A single 9mm round is even cheaper. permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago Rope is reusable. permalink parent award report block reply\nmaga_espada 13 points 2 days ago A single 9mm round is even cheaper. permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago Rope is reusable. permalink parent award report block reply\nConfusedAngryArmed 2 points 2 days ago Rope is reusable. permalink parent award report block reply\nLostElf 9 points 2 days ago Just fuckin' leave already. Hurry. Now. GO. permalink award report block reply\nBeyond_Insemination 9 points 2 days ago This is a reminder that traditional Chinese sentiment does not recognize bold, overt moves as something a celebrated tactician would do. Their war stories are that of quiet, subtle subversion, hoodwinking, and playing a victim as a means to an end that are the most revered in Chinese culture. They are in a 100 year marathon, and have made great progress. permalink award report block reply\nBeelzy 6 points 2 days ago Lol, he thinks so much of himself. He's just an insignificant numeral on a spreadsheet's bottom line deduction. permalink award report block reply\nSmurfection 5 points 2 days ago It's not just the Chinese student here.  He's just the one that picked up enough American snarkiness to make it a blast post. Everyone who comes to America sees us as a giant piggy bank for them to Max Out before they have to flee.  Then they come back and do it again. permalink award report block reply\nYaharaRiver 4 points 2 days ago It takes approximately 150 seconds for the USA to make $140,000 which generated $29 trillion in 2024 (before tariffs!). 2.5 minutes 😂 See ya!! permalink award report block reply\nRock9Head 4 points 2 days ago I assume he worked on Top Secret projects. We shouldn’t be educating our enemies that steal. permalink award report block reply\nALargeRaccoon 3 points 2 days ago When I was in college, I heard they'd do this with cars too. Buy a brand new top tier trim of whatever they want, and pay just enough so they don't come repossess it then abandon it somewhere when the leave to go back to China. permalink award report block reply\nGod-is-good 3 points 2 days ago “Grab hag” culture goes global permalink award report block reply\nGontMawr 3 points 2 days ago Its a good job mega banking corporations are behest to their country of origin rules and not some international code that ignores borders......isn't it? Good luck getting credit in the future dipshit, especially with that useless feminism degree. permalink award report block reply\nTransparency 3 points 2 days ago $140,000 is lunch money to those banks. Pffffttt. Move along, chinkboy. permalink award report block reply\ncovfefe77 2 points 2 days ago american imperialism? you burned your own culture for marx. enjoy your imminent ruin permalink award report block reply\nDangerousAmerican76 2 points 2 days ago Yeah this never happened, the Chinese are not this stupid, debt to banks is global, there is no escape and this person has embarrassed china and lost face for their nation which is like culture suicide there permalink award report block reply\nredinmn 2 points 2 days ago Its sad that this person actually thinks the cost of 1/3 of a new house is something that will teach us a lesson. permalink award report block reply\nMatterThatMetals 2 points 2 days ago Smoke and mirrors anyway ... bye bye permalink award report block reply\nMajor_Nutt 2 points 2 days ago Bro thinks $140,000 is a \"big hit to financial institutions\", when in reality that's a rounding error. permalink award report block reply\nPepesJusticeBoner 1 points 2 days ago Oh no don't defraud the big banks! Please anything but that! EVEN BETTER it means this little CCP agent will need a whole new identity if he ever tries to return and set up a life in the US. permalink award report block reply\nWhatyougotson 1 points 2 days ago 3 years worth of average yearly work of a single person. Really not stickin it to the man. . Also this is fake and gay. permalink award report block reply\nSultansShadow 1 points 2 days ago Hell is surrounded by piles of money for them to enjoy their intense ingratitude 🔥 permalink award report block reply\nboomerbutnotOKBoomer 1 points 2 days ago FAKE. FAKE AND GAY. reads like the same people who wrote the fake emails from Charlie Kirk's fake assassin. CIA is so lame. permalink award report block reply",
  "fetched_at": "2025-11-12T21:23:38.738058Z"
}