{
  "id": "1ARK514PKb",
  "url": "https://patriots.win/p/1ARK514PKb/if-you-have-x-you/c",
  "content": "1738 if you have $X, you… posted 6 days ago by Hanging_Chad 133 comments award share report block ib @novapilgrim • 7d If you have $0, you get welfare. If you have $50 million, you get a bailout. If you have $2,300 in savings, you qualify to fund the whole system and get lectured to budget better.\n133 comments Sort by Top Top New Worst Old Save Stanwyk74 117 points 6 days ago And watch others get free college while your kids have to take out loans because we’re so rich! permalink award report block reply rebuildingMyself 60 points 6 days ago Was always fun seeing minority students from families wealthier than mine go to the same college as me on race-based scholarships (some full rides) permalink parent award report block reply DeepStateParasite 39 points 6 days ago Omg, watched an immigrant family living in a much bigger house with nicer, newer cars get free tuition money while I didn't - presumably because I didn't have enough debt and high enough monthly payments in my own budget.  Uh... because I planned to avoid that situation for my family. Reward - my taxes going for their kid getting a grant for living a fancier lifestyle. 👌 permalink parent award report block reply rebuildingMyself 21 points 6 days ago All us freshmen in college rolled our eyes about being White males which means as little help as humanly possible unless it was some merit-based scholarship at best permalink parent award report block reply Stanwyk74 11 points 6 days ago Thank God for my Irish mother’s family who barely had money to pit shoes on their feet…or food on the table ….literally! So spoiled by her milky white skin privilege permalink parent award report block reply Stanwyk74 19 points 6 days ago Yep! And much of Europe has free college on the American taxpayer back too…fun to see. permalink parent award report block reply TwoArizonaPedes 11 points 6 days ago Americans can take many of those courses, too. Americans can earn a German undergraduate or graduate degree without speaking German and without paying tuition: about 900 undergraduate or graduate degrees are offered exclusively in English, with courses ranging from engineering to social sciences. Norwegian universities do not charge tuition fees for international students and many programs are taught in English. Slovenia has about 150 English programs available and foreign nationals only pay a small fee when they enroll. Brazilian universities have some programs that are taught in English and charge only minor registration fees. permalink parent award report block reply HockeyMom4Trump 4 points 6 days ago I need to know more about this! permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 6 days ago Can you put down an Indian sounding name, apply to a degree factory in India, and get a job here in the US? :p permalink parent award report block reply Klaus73 2 points 6 days ago Do Israel next! permalink parent award report block reply Gadsden 8 points 6 days ago I work for dhs. I started at the very beginning of trumps first term. It was great under trump. Then, in the first year of bidens presidency, during all the covid bullshit, we were told to join a teams meeting randomly. My entire team stopped what we were doing and went to this mandatory meeting. I thought it might be about the covid shot or even layoffs. Wrong. We joined a meeting where a 20 something girl with a thick accent was in the middle of a lecture. Within a couple seconds it became clear that the lecture was about how we, as American citizens, should be doing MORE for her than paying for her to go to Harvard. As an illegal, it wasn't enough that she had a free ride to Harvard, the other students could tell she didn't come from moneybecause she couldn't attend concerts and fancy dinners with the other student. We should do more for her. I listened for a couple minutes before telling my team to go back to work. I would have inturrupted the meeting to tell her to fuck off, but the chat and mic were locked. I did about the only thing I could and sent some emails up the chain, but I basically got a lot of agreement from the higher up positions, but an apologetic \"there's nothing we can do.\" What garbage. permalink parent award report block reply Rudy_DankMemer 3 points 6 days ago I work for dhs how often do you have to deal with (any alphabet) glowfags from the field? and how do you not lose your shit? permalink parent award report block reply Gadsden 6 points 6 days ago Not often. I work from a tiny little office no one worries about. My biggest issue is that the Trump admin didn't really fix any problems with the bureaucracy. Pretty much every office I know of is still run by the only liberals in that office. It's annoying, to be honest. permalink parent award report block reply AVeryNakedMan 6 points 6 days ago One half white, half hispanic kid in my high school was named Michael and everyone knew him as a pale nerdy white kid. When it came time to apply for colleges, he called himself Miguel on his applications, and wrote essays about the hardships of growing up biracial. permalink parent award report block reply TwoArizonaPedes 8 points 6 days ago There are a lot of tuition-free programs. You can get a master's in IT from an accredited U.S. university while sitting at home in your pajamas for <$6K. The idea that you need to go into debt to get a college degree is a myth that needs to die. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply deleted 5 points 6 days ago Valiazaner 5 points 6 days ago Mathematician and physicist is good too. Can do science or Wall Street. permalink parent award report block reply diverscale 5 points 6 days ago But I wuz gonna be rocket surgeon and shiiiiiiiet permalink parent award report block reply Stanwyk74 1 points 6 days ago Well you absolutely need a degree for almost any white collar job so there’s that….whether or not it should be that way is irrelevant and I agree shouldn’t be. permalink parent award report block reply yuge_covfefe 2 points 6 days ago I had a GitHub account and a dozen open source projects. My resume was a link to my source code. Like it, hire me. Don't like it, we probably shouldn't work together anyway. Guess what, I got hired and did great. Degrees in 2025 are unnecessary for a lot of professions. I never did bother finishing college. It has never held me back. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply ParticleCannon 4 points 6 days ago Ah the joys of privilege permalink parent award report block reply HieronymusRekt 4 points 6 days ago I was lucky enough to see it happen to myself... I was number 15 in my class of 230+, didn't receive a single scholarship to a fucking state schools engineering program. Meanwhile all the brown people also in the top 20-25 were getting scholarships left and right. permalink parent award report block reply Stanwyk74 3 points 6 days ago Same thing with NCAA sports recruiting. Whites can be nationally ranked running backs,  wide receivers and get zero D1 scholarship offers.  My son was an all area defensive player and received 1 offer from a small private college while his defensive teammate who was average at best but brown…received many offers. permalink parent award report block reply Pepbrandt 2 points 6 days ago It's THEIR turn! And don't worry, their next generation will remember their great great great grandparent's unfairness and it'll be THEIR turn too! permalink parent award report block reply load 7 more comments... Krat 43 points 6 days ago You dont get welfare though, that goes to invaders looking to overthrow and destroy you first permalink award report block reply Cheesemaker 9 points 6 days ago And most of them don't actually have $0. They're just illegal so they go to front of line and don't pay taxes because they don't report anything. permalink parent award report block reply maverick202 2 points 6 days ago Makes me wonder who are these 2 millions illigals who took $1k to go back to their country if they're handed free housing, schools, meals, Healthcare and free money here. permalink parent award report block reply UCantStumpTheTrump 3 points 6 days ago Warning: this poster is a Democrat from Chicago who routinely insults the users on this site calling them “incels” and “white trash.” Hit that deport button whenever you see u/maverick202 permalink parent award report block reply maverick202 -1 points 6 days ago Sigh you can't even one thing right, son. Put a link to my messages to make it easier for them to find those posts. Also link posts where I call blacks joggers/Shaniqua and call Indian jeets so it's easier for people to report me. permalink parent award report block reply view 12 more comments... UrShulgi 25 points 6 days ago I get where this is supposed to be going, but I disagree with it. People with 50 million pay over half of the income tax, while being a single digit percentage portion of the population.  Also, the 'bail outs' from 'too big to fail' were almost entirely self funded.  TARP (toxic assets relief program) actually MADE MONEY at first, although it ended up netting a 31 billion total cost when it ended.  The fines the 'big banks' paid for the mortgage side of things ended up fully funding HAMP, HARP, and several other programs, where people were able to modify or refinance their mortgages to crazy low rates (2%), short sell existing properties at a loss with the remaining debt being waived, etc... resulting in billions of savings for home owners.  So while the investment banks are the ones that really fucked up with their derivatives and swaps, the government saved our entire economy from blowing up for 31 billion...a pretty good fucking deal.  Homeowners ultimately benefited from the modification/refi programs that the big banks funded in fines they paid (110 billion in fines).  So overall, the system saved itself and benefited home owners. Not saying they were perfect citizens, but this 'blame the rich' shit is fucking commie propaganda.  The rich pay the lions share of taxes, create the jobs we all support ourselves with, and even when they fuck up, they end up paying it all back and then some. permalink award report block reply indigo_truther 5 points 6 days ago I always wondered if it was wise to prop up an obviously broken system. Sure, it would have been awful for a while, but would something better have emerged? permalink parent award report block reply vongregormench 6 points 6 days ago A bunch of mistakes were made and nothing was done to correct the system. Politicians will forget that pushing home loans to unqualified borrowers is dumb and do the same thing again in a few years. permalink parent award report block reply Error404 1 points 6 days ago This^^  it kept the broken/rigged system alive.  Allowed much further inflation/gay evaluation of assets.  Somehow I don't think properties doubling and sometimes even tripling since then is evidence of a fair/balanced/corrupt-free system. permalink parent award report block reply Awakened 0 points 6 days ago Yeah, but what they pay isn't as destructive to their overall budget and lively hood. They don't have to scrimp and save just to survive. But to be clear, all income, payroll, and property tax are theft. We need to cut the government to the bone. permalink parent award report block reply hatredcopter -4 points 6 days ago What kind of retarded pro-bank fan fiction is this shit? permalink parent award report block reply UrShulgi 6 points 6 days ago My friend, I worked in the belly of the beast while it was all going down.  You're welcome to try and point out any factual inconsistencies you can find, but look it up...TARP cost 31 billion, the mortgage banks paid 110 billion in fines which funded programs like HAMP/HARP.  Or is this just more hate the wealthy commie shit? permalink parent award report block reply IHaveABetterSolution 2 points 6 days ago I was under the impression the money supply was expanded during both the great recession and the more recent 2023 SVB and related bailouts. That isn't the case? M1, M2, whatever. Novel money being created. Genuinely curious, not never been in the belly of the beast and don't ever care to be. permalink parent award report block reply UrShulgi 2 points 6 days ago No.  M1 is liquid money, including physical currency and money held in checking accounts.  M2 includes all of M1 and everything that is semi-liquid, which includes stuff like savings accounts, CDs under 100k, and money market accounts. TARP instead allowed the US Treasury to purchase and/or guarantee bad assets on the books of banks, which was the big problem.  By purchasing or guaranteeing them, the bank could still consider them as solid assets.  The price was an interest rate which the banks paid until the assets were either paid back, or no longer needing guaranteed.  These types of funds don't hit M1 or M2. permalink parent award report block reply hatredcopter -6 points 6 days ago Ah, an appeal to authority to justify the pro-bank fan fiction.\nIts such a noble thing that the banks funded these programs - through fines for wrongdoing. And it cost the US government \"only\" 31 billion. What a great deal. And everyone lived happily ever after. permalink parent award report block reply UrShulgi 4 points 6 days ago If you're going to say stupid shit like someone who worked in the industry telling you about stuff that happened while it was going down is an 'appeal to authority', I can't even argue with you.  You're literally a fucking retard who writes off 1st hand knowledge of what happened.  Also, you're not even using the fallacy correctly: The appeal to authority fallacy is when an argument is based on the idea that a claim is true simply because an authority figure said it, rather than on evidence and facts. I was sharing my personal knowledge and not pointing to some major figure involved in the scandal as the only reason I'm right. I supported what I said about it with easily verifiable facts and numbers about how much the programs cost.  You can literally look up what I said to prove that I'm right. permalink parent award report block reply view 3 more comments... HoganP -1 points 6 days ago \"Appeal to authority\" is what every lefty faggot ever cries about when they aren't crying about listening to \"experts\" when one tells them something contrary to the bullshit narrative they are glued to like it's religious dogma. Our government wipes its ass with 31 billion for trivial bullshit. permalink parent award report block reply view 1 more comments... vongregormench -1 points 6 days ago Buddy. The federal government would have exploded the currency if they had funded the bailout. They guaranteed loans that were paid back. They set up the structure of the bailout, allowing a bunch of big banks to absorb the losses. That’s what happened. Sorry if that makes you mad. If they allowed the failure to happen the federal government would have been on the hook for hundreds of billions of FDIC insured accounts. permalink parent award report block reply hatredcopter 2 points 6 days ago Good, that's what happens when you decide to insure shit, you might have to pay it out. Maybe not do that next time. Probably shouldn't have let savings and investment banks merge either if you didn't want to have to cover investment risk with your deposit insurance. It took less than ten years for this shit to play out. And where are we now? Banks are more consolidated and embedded in everything than ever before. Groups that benefited directly from the government's actions own trillions in assets and push commie DEI bullshit through the companies they own. Home ownership, the pretend goal of the actions, is down while these companies buy them up instead. FDIC - FDR. Democrat policy.\nGLBA - Clinton. Democrat policy.\nBank bailouts - Obama. Democrat policy. permalink parent award report block reply Hanging_Chad OP 1 points 6 days ago hundreds of billions of accounts? permalink parent award report block reply vongregormench 0 points 6 days ago Fuck off. You can figure it out. permalink parent award report block reply Perseverant 20 points 6 days ago I'm middle class, but in terms of delayed gratification, financial literacy, and financial responsibility, I am probably the top 1-3% of Americans. It has been brutal knowing just how far the fiscal decisions of Joetato's handlers have set our family back in terms of additional years of my life I now have to work to be where I would've been had a pet rock been president instead. I can only imagine what the average family is dealing with.  It has been absolutely brutal seeing two promotions of buying power just....  erased...  by inflation.  Feel like I've been swimming up a waterfall the last few years to try to stay on-track with our goals. I still think life is good and we have joy in our household, but the evils that the corrupt have subjected our country to tick me off. permalink award report block reply UncleTrumpsBand 3 points 6 days ago I feel for you fren. Imagine how rough it is on kids trying start a career. A kick in the nuts, it is. permalink parent award report block reply Perseverant 2 points 6 days ago Yeah, I feel really bad for kids fresh out of college.  Indians getting jobs instead of them.  H1B, inflation, foreign invaders. Tough times are going to make tough men and break a lot of other people.  There is always hope (my hope is in Jesus), and striving for something better through responsible living is always worth it, but the next generation is being handed a lemon of a country. permalink parent award report block reply Awakened 2 points 6 days ago I hear and feel this. permalink parent award report block reply Perseverant 2 points 6 days ago Hang in there, fren. permalink parent award report block reply Awakened 2 points 6 days ago Thank you. You as well. permalink parent award report block reply jlange94 12 points 6 days ago Growing up middle class and now living and working in the middle class, all I've recognized is that the poor gets handouts and benefits everywhere without working or supporting the system that supports them, while everyone else fronts the massive bill for them. So fuck them. As for the upper class, they are so wealthy that even though they get taxed a ton, it doesn't affect them much because they can still afford it and live comfortably. This leaves the middle class which is not only expected to front the bill for the lower class like the upper class does but also is not afforded the same benefits and handouts that the poor gets. So we continue to be fucked in all this. You don't have to wonder why generations of the middle class now are pissed and will vote for Trump and other to blow up the system. At this point, I'm willing to vote in the most radical candidate possible. To even get a little change you need a seriously radical force to cause it. permalink award report block reply KEK_1776_KEK 9 points 6 days ago My mother is in her late 70s, she gets $30 a month on EBT after working in retail for decades. Obese black women and illegals get hundreds and more. permalink award report block reply altaG12 1 points 6 days ago Not sure why, most people on welfare are white permalink parent award report block reply UncleTrumpsBand 1 points 6 days ago That’ll get you 2 big mac meals and one mcflurry  that you GET to ration for the month tho! Shouldn't you be happy!?!?!?!?!?! permalink parent award report block reply Psarg 9 points 6 days ago If I make $0 I'm homeless permalink award report block reply Beachbum2023 1 points 6 days ago You have to have a paid for living arrangement to milk the system properly. Either section 8 or mom's basement. Or a trust with a paid off home. permalink parent award report block reply TwoArizonaPedes 7 points 6 days ago Even if you have $0 you don't always get welfare if you don't check the \"right\" boxes. permalink award report block reply Forty_Five 5 points 6 days ago It makes perfect sense when you understand their goal is to create an aristocracy with a slave class that's dependent on them for survival. permalink award report block reply LostElf 1 points 6 days ago And when robots improve sufficiently, into the mass graves go the human slaves. permalink parent award report block reply jiujiujiu 5 points 6 days ago You’re welcome everyone permalink award report block reply ProfessorJagoff 5 points 6 days ago I think I pay around 20k a year all things included but sales tax, around 25% of my income, property tax really hurts. But I'm pretty sure those who make more than $50million pay most of the bill. The issue is how much we are spending IMO. permalink award report block reply LostElf 4 points 6 days ago While absorbing the blame for everything and the credit for nothing, plus you get laughed at and called names! It's awesome! permalink award report block reply UncleTrumpsBand 3 points 6 days ago Lazy millennial, why dont you just work 12 jobs so you can buy a $500,000 2 bed 1 bath at 7% you lazy ungrateful pos permalink parent award report block reply patrioticwinning3 3 points 6 days ago LMAO XD  Sad but true! permalink award report block reply vongregormench 3 points 6 days ago Individuals don’t get bailouts. When the banks were bailed out the investors lost all their money. Any of the banks that actually got absorbed by the surviving banks forced by Obama the stock value went to zero. Who got a bailout? Just the banks and the account holders. What bailout are we referring to? permalink award report block reply sixfingerdildo 1 points 6 days ago what investors lost all their money? permalink parent award report block reply vongregormench 1 points 6 days ago Stock holders permalink parent award report block reply sixfingerdildo 2 points 6 days ago your comment is strange. are you implying that nobody got a bailout except \"the banks\" and fdic insured depositors? permalink parent award report block reply vongregormench 1 points 6 days ago Corporations were bailed out, so CEOs lost pay, and stockholders lost money. The bailouts were loans which were repaid. Those loans kept the accounts afloat ao people that loaned money to the banks, or account holders. The bailouts weren’t free money. They were people being paid for the money they put in. Nobody got a bailout because they had fifty million. There is a legal order to who gets paid first when a company goes under. Last place is stockholders. OP is implying that millionaires got free money. It’s dumb. -edit I realize some sentences are incomplete. I don’t care. You’ll get the gist of it. permalink parent award report block reply view 5 more comments... UrShulgi 1 points 6 days ago Bear Stears, the first big investment bank to fail, was publicly traded (owned by investors), and went from 25 billion market cap to 1 billion when the crash happened.  There are other examples, but this is the one most people probably remember as the fire alarm moment that kicked it all off.  Countrywide went from 25 billion to being bought by Bank of America for 4 billion.  Washington Mutual had 100% of shareholder value wiped when the government had to take them over.  The list goes on...but it was hundreds of billions that investors lost. permalink parent award report block reply sixfingerdildo 2 points 6 days ago pension funds, mutual funds, etc. foreign capital. some insiders, some institutionals. but when you say \"investors\", in the context of the op (only the middle class gets hit), those institutionals, insiders, etc still got a net bailout and still didn't \"lose everything\". The bailouts truly prevented them from losing it all while Main Street saw real drops in their pension funds, their real estate values and their employment. : also, the global debt is worse than ever, inflation has killed the middle class and wealth disparity is as bad if not worse than ever. permalink parent award report block reply AntiCommieAktion 2 points 6 days ago Middle class almost always gets the short end of the stick permalink award report block reply BoomShtick 2 points 6 days ago Middle/working class gets fucked, always been that way since I have been alive permalink award report block reply FusionBlack 2 points 6 days ago Couldn't have said it better permalink award report block reply Pepbrandt 2 points 6 days ago At this point it's more like Whale Fair. permalink award report block reply GhostOfKirk 2 points 6 days ago We need to sue for access to SNAP benefits. It’s like paying for the entire grocery bill then being the only one not getting a plate. Give me benefits or let me opt out and refund my taxes. permalink award report block reply Pied-Trumper 2 points 6 days ago Well yeah, the 50 million allows you to bribe on behalf of everyone, including foreign entities. The $0 and welfare makes you dependent on the party promising and giving you those things. $2300 gives you independent though and enough knowledge to know the American Dream was alive when we were nationalists with a common history and ethnic/religious bond. permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply spinometer2 1 points 6 days ago not quite true but directionally correct permalink award report block reply Markosis17 1 points 6 days ago What is savings? permalink award report block reply DrinkTeaNotKoolaid 1 points 6 days ago Fxcking A bubba! ,,,,,,,bubbet,,,,,, permalink award report block reply Mhmm2MoreWeeks 1 points 6 days ago This is why the Education system is so in urgent need of being remade. Wealth is not generated from labor. A job merely lets you tread water. Residual income on services is how you get rich. That or you get real good at financial markets/crypto/stock. Most people who complain about money do not even try to make more. permalink award report block reply sixfingerdildo 8 points 6 days ago you sound like a scammer. \"buy my book, you make money! look me my beautfil wimmen!\" permalink parent award report block reply Perseverant 4 points 6 days ago How to get rich? Sell a book about how to get rich. permalink parent award report block reply UncleTrumpsBand 2 points 6 days ago Step 3. Profit. permalink parent award report block reply UrShulgi 2 points 6 days ago Saying that labor doesn't produce wealth isn't quite right.  If the labor is spent in the production of things, the thing exists afterwards and has value, and the worker was paid for their labor. A builder hires construction workers to build a house.  The workers provide for their families with the money they get.  The builder makes a profit on building the house.  The buyer of the house has a huge asset (the house) that's still worth a lot of money.  The labor created the profit for the builder and created the thing that has value (the house).  Labor created wealth. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply user2827 1 points 6 days ago Won't make sense to the young guys, but there was a saying, \"you don't get rich signing the back of the check.\" The plan of finding ways to build residual income or investing (although crypto is closer to a ponzi scheme than many want to admit) is almost critical, but wages have been so far outshined by inflation, that the options for people are getting slimmer. The welfare cliff is now somewhere in the ballpark of 30-35$/hr. That makes it increasingly easy to just give up on producing and take the \"benefits\"... permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply DresdenFirebomber 0 points 6 days ago A woman pointing out parasitism is peak irony. Only class who can say their assets shrunk as marriage dipped in popularity, because they can only make anything from stealing. permalink award report block reply bluewhiteandred 0 points 6 days ago see gervais principle and how it plugs in here https://www.ribbonfarm.com/2009/10/07/the-gervais-principle-or-the-office-according-to-the-office/ permalink award report block reply Northpoint12 0 points 6 days ago If you have 2300.oo in savings then your basically broke. Well, I guess that is your lecture from me. You do need to budget better or earn more money. permalink award report block reply UncleTrumpsBand 1 points 6 days ago Um, this is a large majority of those under 30. You sound ignorant to the situation and it is alot more nuanced than - “lazy damn kids” permalink parent award report block reply Northpoint12 0 points 1 day ago I remember seeing all the billboards around my town advertising sign on bonuses and benefits/good wage. The 'kids' around town didnt bother to apply. At the local walmart I asked a manager why they have so many registers but only a few open? She told me that the high school kids do not want to work on the weekend. So, They end up getting fired. They cannot find good people to work. I walked down an isle and this worker scared the shi* out of me. She was a koolaid head and tatoos everywhere with metal in her head. I got out of there quick. On leaving I saw a guy in a dress at a cash register. Your right \"Lazy Damn kids\" is actually an understatement. Weird people fits better. The other day I saw a billboard advertising 26/hr with sign up bonus for one of the local factories. This is because ICE has come to town I suspect. Of course, Any factory job beats the heck out of working at walmart or a gas station. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply AlmostFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply 0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply takebackyourfreedom 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nStanwyk74 117 points 6 days ago And watch others get free college while your kids have to take out loans because we’re so rich! permalink award report block reply rebuildingMyself 60 points 6 days ago Was always fun seeing minority students from families wealthier than mine go to the same college as me on race-based scholarships (some full rides) permalink parent award report block reply DeepStateParasite 39 points 6 days ago Omg, watched an immigrant family living in a much bigger house with nicer, newer cars get free tuition money while I didn't - presumably because I didn't have enough debt and high enough monthly payments in my own budget.  Uh... because I planned to avoid that situation for my family. Reward - my taxes going for their kid getting a grant for living a fancier lifestyle. 👌 permalink parent award report block reply rebuildingMyself 21 points 6 days ago All us freshmen in college rolled our eyes about being White males which means as little help as humanly possible unless it was some merit-based scholarship at best permalink parent award report block reply Stanwyk74 11 points 6 days ago Thank God for my Irish mother’s family who barely had money to pit shoes on their feet…or food on the table ….literally! So spoiled by her milky white skin privilege permalink parent award report block reply Stanwyk74 19 points 6 days ago Yep! And much of Europe has free college on the American taxpayer back too…fun to see. permalink parent award report block reply TwoArizonaPedes 11 points 6 days ago Americans can take many of those courses, too. Americans can earn a German undergraduate or graduate degree without speaking German and without paying tuition: about 900 undergraduate or graduate degrees are offered exclusively in English, with courses ranging from engineering to social sciences. Norwegian universities do not charge tuition fees for international students and many programs are taught in English. Slovenia has about 150 English programs available and foreign nationals only pay a small fee when they enroll. Brazilian universities have some programs that are taught in English and charge only minor registration fees. permalink parent award report block reply HockeyMom4Trump 4 points 6 days ago I need to know more about this! permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 6 days ago Can you put down an Indian sounding name, apply to a degree factory in India, and get a job here in the US? :p permalink parent award report block reply Klaus73 2 points 6 days ago Do Israel next! permalink parent award report block reply Gadsden 8 points 6 days ago I work for dhs. I started at the very beginning of trumps first term. It was great under trump. Then, in the first year of bidens presidency, during all the covid bullshit, we were told to join a teams meeting randomly. My entire team stopped what we were doing and went to this mandatory meeting. I thought it might be about the covid shot or even layoffs. Wrong. We joined a meeting where a 20 something girl with a thick accent was in the middle of a lecture. Within a couple seconds it became clear that the lecture was about how we, as American citizens, should be doing MORE for her than paying for her to go to Harvard. As an illegal, it wasn't enough that she had a free ride to Harvard, the other students could tell she didn't come from moneybecause she couldn't attend concerts and fancy dinners with the other student. We should do more for her. I listened for a couple minutes before telling my team to go back to work. I would have inturrupted the meeting to tell her to fuck off, but the chat and mic were locked. I did about the only thing I could and sent some emails up the chain, but I basically got a lot of agreement from the higher up positions, but an apologetic \"there's nothing we can do.\" What garbage. permalink parent award report block reply Rudy_DankMemer 3 points 6 days ago I work for dhs how often do you have to deal with (any alphabet) glowfags from the field? and how do you not lose your shit? permalink parent award report block reply Gadsden 6 points 6 days ago Not often. I work from a tiny little office no one worries about. My biggest issue is that the Trump admin didn't really fix any problems with the bureaucracy. Pretty much every office I know of is still run by the only liberals in that office. It's annoying, to be honest. permalink parent award report block reply AVeryNakedMan 6 points 6 days ago One half white, half hispanic kid in my high school was named Michael and everyone knew him as a pale nerdy white kid. When it came time to apply for colleges, he called himself Miguel on his applications, and wrote essays about the hardships of growing up biracial. permalink parent award report block reply TwoArizonaPedes 8 points 6 days ago There are a lot of tuition-free programs. You can get a master's in IT from an accredited U.S. university while sitting at home in your pajamas for <$6K. The idea that you need to go into debt to get a college degree is a myth that needs to die. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply deleted 5 points 6 days ago Valiazaner 5 points 6 days ago Mathematician and physicist is good too. Can do science or Wall Street. permalink parent award report block reply diverscale 5 points 6 days ago But I wuz gonna be rocket surgeon and shiiiiiiiet permalink parent award report block reply Stanwyk74 1 points 6 days ago Well you absolutely need a degree for almost any white collar job so there’s that….whether or not it should be that way is irrelevant and I agree shouldn’t be. permalink parent award report block reply yuge_covfefe 2 points 6 days ago I had a GitHub account and a dozen open source projects. My resume was a link to my source code. Like it, hire me. Don't like it, we probably shouldn't work together anyway. Guess what, I got hired and did great. Degrees in 2025 are unnecessary for a lot of professions. I never did bother finishing college. It has never held me back. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply ParticleCannon 4 points 6 days ago Ah the joys of privilege permalink parent award report block reply HieronymusRekt 4 points 6 days ago I was lucky enough to see it happen to myself... I was number 15 in my class of 230+, didn't receive a single scholarship to a fucking state schools engineering program. Meanwhile all the brown people also in the top 20-25 were getting scholarships left and right. permalink parent award report block reply Stanwyk74 3 points 6 days ago Same thing with NCAA sports recruiting. Whites can be nationally ranked running backs,  wide receivers and get zero D1 scholarship offers.  My son was an all area defensive player and received 1 offer from a small private college while his defensive teammate who was average at best but brown…received many offers. permalink parent award report block reply Pepbrandt 2 points 6 days ago It's THEIR turn! And don't worry, their next generation will remember their great great great grandparent's unfairness and it'll be THEIR turn too! permalink parent award report block reply load 7 more comments...\nrebuildingMyself 60 points 6 days ago Was always fun seeing minority students from families wealthier than mine go to the same college as me on race-based scholarships (some full rides) permalink parent award report block reply DeepStateParasite 39 points 6 days ago Omg, watched an immigrant family living in a much bigger house with nicer, newer cars get free tuition money while I didn't - presumably because I didn't have enough debt and high enough monthly payments in my own budget.  Uh... because I planned to avoid that situation for my family. Reward - my taxes going for their kid getting a grant for living a fancier lifestyle. 👌 permalink parent award report block reply rebuildingMyself 21 points 6 days ago All us freshmen in college rolled our eyes about being White males which means as little help as humanly possible unless it was some merit-based scholarship at best permalink parent award report block reply Stanwyk74 11 points 6 days ago Thank God for my Irish mother’s family who barely had money to pit shoes on their feet…or food on the table ….literally! So spoiled by her milky white skin privilege permalink parent award report block reply Stanwyk74 19 points 6 days ago Yep! And much of Europe has free college on the American taxpayer back too…fun to see. permalink parent award report block reply TwoArizonaPedes 11 points 6 days ago Americans can take many of those courses, too. Americans can earn a German undergraduate or graduate degree without speaking German and without paying tuition: about 900 undergraduate or graduate degrees are offered exclusively in English, with courses ranging from engineering to social sciences. Norwegian universities do not charge tuition fees for international students and many programs are taught in English. Slovenia has about 150 English programs available and foreign nationals only pay a small fee when they enroll. Brazilian universities have some programs that are taught in English and charge only minor registration fees. permalink parent award report block reply HockeyMom4Trump 4 points 6 days ago I need to know more about this! permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 6 days ago Can you put down an Indian sounding name, apply to a degree factory in India, and get a job here in the US? :p permalink parent award report block reply Klaus73 2 points 6 days ago Do Israel next! permalink parent award report block reply Gadsden 8 points 6 days ago I work for dhs. I started at the very beginning of trumps first term. It was great under trump. Then, in the first year of bidens presidency, during all the covid bullshit, we were told to join a teams meeting randomly. My entire team stopped what we were doing and went to this mandatory meeting. I thought it might be about the covid shot or even layoffs. Wrong. We joined a meeting where a 20 something girl with a thick accent was in the middle of a lecture. Within a couple seconds it became clear that the lecture was about how we, as American citizens, should be doing MORE for her than paying for her to go to Harvard. As an illegal, it wasn't enough that she had a free ride to Harvard, the other students could tell she didn't come from moneybecause she couldn't attend concerts and fancy dinners with the other student. We should do more for her. I listened for a couple minutes before telling my team to go back to work. I would have inturrupted the meeting to tell her to fuck off, but the chat and mic were locked. I did about the only thing I could and sent some emails up the chain, but I basically got a lot of agreement from the higher up positions, but an apologetic \"there's nothing we can do.\" What garbage. permalink parent award report block reply Rudy_DankMemer 3 points 6 days ago I work for dhs how often do you have to deal with (any alphabet) glowfags from the field? and how do you not lose your shit? permalink parent award report block reply Gadsden 6 points 6 days ago Not often. I work from a tiny little office no one worries about. My biggest issue is that the Trump admin didn't really fix any problems with the bureaucracy. Pretty much every office I know of is still run by the only liberals in that office. It's annoying, to be honest. permalink parent award report block reply AVeryNakedMan 6 points 6 days ago One half white, half hispanic kid in my high school was named Michael and everyone knew him as a pale nerdy white kid. When it came time to apply for colleges, he called himself Miguel on his applications, and wrote essays about the hardships of growing up biracial. permalink parent award report block reply\nDeepStateParasite 39 points 6 days ago Omg, watched an immigrant family living in a much bigger house with nicer, newer cars get free tuition money while I didn't - presumably because I didn't have enough debt and high enough monthly payments in my own budget.  Uh... because I planned to avoid that situation for my family. Reward - my taxes going for their kid getting a grant for living a fancier lifestyle. 👌 permalink parent award report block reply rebuildingMyself 21 points 6 days ago All us freshmen in college rolled our eyes about being White males which means as little help as humanly possible unless it was some merit-based scholarship at best permalink parent award report block reply Stanwyk74 11 points 6 days ago Thank God for my Irish mother’s family who barely had money to pit shoes on their feet…or food on the table ….literally! So spoiled by her milky white skin privilege permalink parent award report block reply\nrebuildingMyself 21 points 6 days ago All us freshmen in college rolled our eyes about being White males which means as little help as humanly possible unless it was some merit-based scholarship at best permalink parent award report block reply Stanwyk74 11 points 6 days ago Thank God for my Irish mother’s family who barely had money to pit shoes on their feet…or food on the table ….literally! So spoiled by her milky white skin privilege permalink parent award report block reply\nStanwyk74 11 points 6 days ago Thank God for my Irish mother’s family who barely had money to pit shoes on their feet…or food on the table ….literally! So spoiled by her milky white skin privilege permalink parent award report block reply\nStanwyk74 19 points 6 days ago Yep! And much of Europe has free college on the American taxpayer back too…fun to see. permalink parent award report block reply TwoArizonaPedes 11 points 6 days ago Americans can take many of those courses, too. Americans can earn a German undergraduate or graduate degree without speaking German and without paying tuition: about 900 undergraduate or graduate degrees are offered exclusively in English, with courses ranging from engineering to social sciences. Norwegian universities do not charge tuition fees for international students and many programs are taught in English. Slovenia has about 150 English programs available and foreign nationals only pay a small fee when they enroll. Brazilian universities have some programs that are taught in English and charge only minor registration fees. permalink parent award report block reply HockeyMom4Trump 4 points 6 days ago I need to know more about this! permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 6 days ago Can you put down an Indian sounding name, apply to a degree factory in India, and get a job here in the US? :p permalink parent award report block reply Klaus73 2 points 6 days ago Do Israel next! permalink parent award report block reply\nTwoArizonaPedes 11 points 6 days ago Americans can take many of those courses, too. Americans can earn a German undergraduate or graduate degree without speaking German and without paying tuition: about 900 undergraduate or graduate degrees are offered exclusively in English, with courses ranging from engineering to social sciences. Norwegian universities do not charge tuition fees for international students and many programs are taught in English. Slovenia has about 150 English programs available and foreign nationals only pay a small fee when they enroll. Brazilian universities have some programs that are taught in English and charge only minor registration fees. permalink parent award report block reply HockeyMom4Trump 4 points 6 days ago I need to know more about this! permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 6 days ago Can you put down an Indian sounding name, apply to a degree factory in India, and get a job here in the US? :p permalink parent award report block reply\nHockeyMom4Trump 4 points 6 days ago I need to know more about this! permalink parent award report block reply view 1 more comments...\npatrioticwinning3 1 points 6 days ago Can you put down an Indian sounding name, apply to a degree factory in India, and get a job here in the US? :p permalink parent award report block reply\nKlaus73 2 points 6 days ago Do Israel next! permalink parent award report block reply\nGadsden 8 points 6 days ago I work for dhs. I started at the very beginning of trumps first term. It was great under trump. Then, in the first year of bidens presidency, during all the covid bullshit, we were told to join a teams meeting randomly. My entire team stopped what we were doing and went to this mandatory meeting. I thought it might be about the covid shot or even layoffs. Wrong. We joined a meeting where a 20 something girl with a thick accent was in the middle of a lecture. Within a couple seconds it became clear that the lecture was about how we, as American citizens, should be doing MORE for her than paying for her to go to Harvard. As an illegal, it wasn't enough that she had a free ride to Harvard, the other students could tell she didn't come from moneybecause she couldn't attend concerts and fancy dinners with the other student. We should do more for her. I listened for a couple minutes before telling my team to go back to work. I would have inturrupted the meeting to tell her to fuck off, but the chat and mic were locked. I did about the only thing I could and sent some emails up the chain, but I basically got a lot of agreement from the higher up positions, but an apologetic \"there's nothing we can do.\" What garbage. permalink parent award report block reply Rudy_DankMemer 3 points 6 days ago I work for dhs how often do you have to deal with (any alphabet) glowfags from the field? and how do you not lose your shit? permalink parent award report block reply Gadsden 6 points 6 days ago Not often. I work from a tiny little office no one worries about. My biggest issue is that the Trump admin didn't really fix any problems with the bureaucracy. Pretty much every office I know of is still run by the only liberals in that office. It's annoying, to be honest. permalink parent award report block reply\nRudy_DankMemer 3 points 6 days ago I work for dhs how often do you have to deal with (any alphabet) glowfags from the field? and how do you not lose your shit? permalink parent award report block reply Gadsden 6 points 6 days ago Not often. I work from a tiny little office no one worries about. My biggest issue is that the Trump admin didn't really fix any problems with the bureaucracy. Pretty much every office I know of is still run by the only liberals in that office. It's annoying, to be honest. permalink parent award report block reply\nGadsden 6 points 6 days ago Not often. I work from a tiny little office no one worries about. My biggest issue is that the Trump admin didn't really fix any problems with the bureaucracy. Pretty much every office I know of is still run by the only liberals in that office. It's annoying, to be honest. permalink parent award report block reply\nAVeryNakedMan 6 points 6 days ago One half white, half hispanic kid in my high school was named Michael and everyone knew him as a pale nerdy white kid. When it came time to apply for colleges, he called himself Miguel on his applications, and wrote essays about the hardships of growing up biracial. permalink parent award report block reply\nTwoArizonaPedes 8 points 6 days ago There are a lot of tuition-free programs. You can get a master's in IT from an accredited U.S. university while sitting at home in your pajamas for <$6K. The idea that you need to go into debt to get a college degree is a myth that needs to die. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\ndeleted 5 points 6 days ago Valiazaner 5 points 6 days ago Mathematician and physicist is good too. Can do science or Wall Street. permalink parent award report block reply diverscale 5 points 6 days ago But I wuz gonna be rocket surgeon and shiiiiiiiet permalink parent award report block reply Stanwyk74 1 points 6 days ago Well you absolutely need a degree for almost any white collar job so there’s that….whether or not it should be that way is irrelevant and I agree shouldn’t be. permalink parent award report block reply yuge_covfefe 2 points 6 days ago I had a GitHub account and a dozen open source projects. My resume was a link to my source code. Like it, hire me. Don't like it, we probably shouldn't work together anyway. Guess what, I got hired and did great. Degrees in 2025 are unnecessary for a lot of professions. I never did bother finishing college. It has never held me back. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nValiazaner 5 points 6 days ago Mathematician and physicist is good too. Can do science or Wall Street. permalink parent award report block reply diverscale 5 points 6 days ago But I wuz gonna be rocket surgeon and shiiiiiiiet permalink parent award report block reply\ndiverscale 5 points 6 days ago But I wuz gonna be rocket surgeon and shiiiiiiiet permalink parent award report block reply\nStanwyk74 1 points 6 days ago Well you absolutely need a degree for almost any white collar job so there’s that….whether or not it should be that way is irrelevant and I agree shouldn’t be. permalink parent award report block reply yuge_covfefe 2 points 6 days ago I had a GitHub account and a dozen open source projects. My resume was a link to my source code. Like it, hire me. Don't like it, we probably shouldn't work together anyway. Guess what, I got hired and did great. Degrees in 2025 are unnecessary for a lot of professions. I never did bother finishing college. It has never held me back. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nyuge_covfefe 2 points 6 days ago I had a GitHub account and a dozen open source projects. My resume was a link to my source code. Like it, hire me. Don't like it, we probably shouldn't work together anyway. Guess what, I got hired and did great. Degrees in 2025 are unnecessary for a lot of professions. I never did bother finishing college. It has never held me back. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nParticleCannon 4 points 6 days ago Ah the joys of privilege permalink parent award report block reply\nHieronymusRekt 4 points 6 days ago I was lucky enough to see it happen to myself... I was number 15 in my class of 230+, didn't receive a single scholarship to a fucking state schools engineering program. Meanwhile all the brown people also in the top 20-25 were getting scholarships left and right. permalink parent award report block reply Stanwyk74 3 points 6 days ago Same thing with NCAA sports recruiting. Whites can be nationally ranked running backs,  wide receivers and get zero D1 scholarship offers.  My son was an all area defensive player and received 1 offer from a small private college while his defensive teammate who was average at best but brown…received many offers. permalink parent award report block reply Pepbrandt 2 points 6 days ago It's THEIR turn! And don't worry, their next generation will remember their great great great grandparent's unfairness and it'll be THEIR turn too! permalink parent award report block reply\nStanwyk74 3 points 6 days ago Same thing with NCAA sports recruiting. Whites can be nationally ranked running backs,  wide receivers and get zero D1 scholarship offers.  My son was an all area defensive player and received 1 offer from a small private college while his defensive teammate who was average at best but brown…received many offers. permalink parent award report block reply\nPepbrandt 2 points 6 days ago It's THEIR turn! And don't worry, their next generation will remember their great great great grandparent's unfairness and it'll be THEIR turn too! permalink parent award report block reply\nKrat 43 points 6 days ago You dont get welfare though, that goes to invaders looking to overthrow and destroy you first permalink award report block reply Cheesemaker 9 points 6 days ago And most of them don't actually have $0. They're just illegal so they go to front of line and don't pay taxes because they don't report anything. permalink parent award report block reply maverick202 2 points 6 days ago Makes me wonder who are these 2 millions illigals who took $1k to go back to their country if they're handed free housing, schools, meals, Healthcare and free money here. permalink parent award report block reply UCantStumpTheTrump 3 points 6 days ago Warning: this poster is a Democrat from Chicago who routinely insults the users on this site calling them “incels” and “white trash.” Hit that deport button whenever you see u/maverick202 permalink parent award report block reply maverick202 -1 points 6 days ago Sigh you can't even one thing right, son. Put a link to my messages to make it easier for them to find those posts. Also link posts where I call blacks joggers/Shaniqua and call Indian jeets so it's easier for people to report me. permalink parent award report block reply view 12 more comments...\nCheesemaker 9 points 6 days ago And most of them don't actually have $0. They're just illegal so they go to front of line and don't pay taxes because they don't report anything. permalink parent award report block reply maverick202 2 points 6 days ago Makes me wonder who are these 2 millions illigals who took $1k to go back to their country if they're handed free housing, schools, meals, Healthcare and free money here. permalink parent award report block reply UCantStumpTheTrump 3 points 6 days ago Warning: this poster is a Democrat from Chicago who routinely insults the users on this site calling them “incels” and “white trash.” Hit that deport button whenever you see u/maverick202 permalink parent award report block reply maverick202 -1 points 6 days ago Sigh you can't even one thing right, son. Put a link to my messages to make it easier for them to find those posts. Also link posts where I call blacks joggers/Shaniqua and call Indian jeets so it's easier for people to report me. permalink parent award report block reply view 12 more comments...\nmaverick202 2 points 6 days ago Makes me wonder who are these 2 millions illigals who took $1k to go back to their country if they're handed free housing, schools, meals, Healthcare and free money here. permalink parent award report block reply UCantStumpTheTrump 3 points 6 days ago Warning: this poster is a Democrat from Chicago who routinely insults the users on this site calling them “incels” and “white trash.” Hit that deport button whenever you see u/maverick202 permalink parent award report block reply maverick202 -1 points 6 days ago Sigh you can't even one thing right, son. Put a link to my messages to make it easier for them to find those posts. Also link posts where I call blacks joggers/Shaniqua and call Indian jeets so it's easier for people to report me. permalink parent award report block reply view 12 more comments...\nUCantStumpTheTrump 3 points 6 days ago Warning: this poster is a Democrat from Chicago who routinely insults the users on this site calling them “incels” and “white trash.” Hit that deport button whenever you see u/maverick202 permalink parent award report block reply maverick202 -1 points 6 days ago Sigh you can't even one thing right, son. Put a link to my messages to make it easier for them to find those posts. Also link posts where I call blacks joggers/Shaniqua and call Indian jeets so it's easier for people to report me. permalink parent award report block reply view 12 more comments...\nmaverick202 -1 points 6 days ago Sigh you can't even one thing right, son. Put a link to my messages to make it easier for them to find those posts. Also link posts where I call blacks joggers/Shaniqua and call Indian jeets so it's easier for people to report me. permalink parent award report block reply view 12 more comments...\nUrShulgi 25 points 6 days ago I get where this is supposed to be going, but I disagree with it. People with 50 million pay over half of the income tax, while being a single digit percentage portion of the population.  Also, the 'bail outs' from 'too big to fail' were almost entirely self funded.  TARP (toxic assets relief program) actually MADE MONEY at first, although it ended up netting a 31 billion total cost when it ended.  The fines the 'big banks' paid for the mortgage side of things ended up fully funding HAMP, HARP, and several other programs, where people were able to modify or refinance their mortgages to crazy low rates (2%), short sell existing properties at a loss with the remaining debt being waived, etc... resulting in billions of savings for home owners.  So while the investment banks are the ones that really fucked up with their derivatives and swaps, the government saved our entire economy from blowing up for 31 billion...a pretty good fucking deal.  Homeowners ultimately benefited from the modification/refi programs that the big banks funded in fines they paid (110 billion in fines).  So overall, the system saved itself and benefited home owners. Not saying they were perfect citizens, but this 'blame the rich' shit is fucking commie propaganda.  The rich pay the lions share of taxes, create the jobs we all support ourselves with, and even when they fuck up, they end up paying it all back and then some. permalink award report block reply indigo_truther 5 points 6 days ago I always wondered if it was wise to prop up an obviously broken system. Sure, it would have been awful for a while, but would something better have emerged? permalink parent award report block reply vongregormench 6 points 6 days ago A bunch of mistakes were made and nothing was done to correct the system. Politicians will forget that pushing home loans to unqualified borrowers is dumb and do the same thing again in a few years. permalink parent award report block reply Error404 1 points 6 days ago This^^  it kept the broken/rigged system alive.  Allowed much further inflation/gay evaluation of assets.  Somehow I don't think properties doubling and sometimes even tripling since then is evidence of a fair/balanced/corrupt-free system. permalink parent award report block reply Awakened 0 points 6 days ago Yeah, but what they pay isn't as destructive to their overall budget and lively hood. They don't have to scrimp and save just to survive. But to be clear, all income, payroll, and property tax are theft. We need to cut the government to the bone. permalink parent award report block reply hatredcopter -4 points 6 days ago What kind of retarded pro-bank fan fiction is this shit? permalink parent award report block reply UrShulgi 6 points 6 days ago My friend, I worked in the belly of the beast while it was all going down.  You're welcome to try and point out any factual inconsistencies you can find, but look it up...TARP cost 31 billion, the mortgage banks paid 110 billion in fines which funded programs like HAMP/HARP.  Or is this just more hate the wealthy commie shit? permalink parent award report block reply IHaveABetterSolution 2 points 6 days ago I was under the impression the money supply was expanded during both the great recession and the more recent 2023 SVB and related bailouts. That isn't the case? M1, M2, whatever. Novel money being created. Genuinely curious, not never been in the belly of the beast and don't ever care to be. permalink parent award report block reply UrShulgi 2 points 6 days ago No.  M1 is liquid money, including physical currency and money held in checking accounts.  M2 includes all of M1 and everything that is semi-liquid, which includes stuff like savings accounts, CDs under 100k, and money market accounts. TARP instead allowed the US Treasury to purchase and/or guarantee bad assets on the books of banks, which was the big problem.  By purchasing or guaranteeing them, the bank could still consider them as solid assets.  The price was an interest rate which the banks paid until the assets were either paid back, or no longer needing guaranteed.  These types of funds don't hit M1 or M2. permalink parent award report block reply hatredcopter -6 points 6 days ago Ah, an appeal to authority to justify the pro-bank fan fiction.\nIts such a noble thing that the banks funded these programs - through fines for wrongdoing. And it cost the US government \"only\" 31 billion. What a great deal. And everyone lived happily ever after. permalink parent award report block reply UrShulgi 4 points 6 days ago If you're going to say stupid shit like someone who worked in the industry telling you about stuff that happened while it was going down is an 'appeal to authority', I can't even argue with you.  You're literally a fucking retard who writes off 1st hand knowledge of what happened.  Also, you're not even using the fallacy correctly: The appeal to authority fallacy is when an argument is based on the idea that a claim is true simply because an authority figure said it, rather than on evidence and facts. I was sharing my personal knowledge and not pointing to some major figure involved in the scandal as the only reason I'm right. I supported what I said about it with easily verifiable facts and numbers about how much the programs cost.  You can literally look up what I said to prove that I'm right. permalink parent award report block reply view 3 more comments... HoganP -1 points 6 days ago \"Appeal to authority\" is what every lefty faggot ever cries about when they aren't crying about listening to \"experts\" when one tells them something contrary to the bullshit narrative they are glued to like it's religious dogma. Our government wipes its ass with 31 billion for trivial bullshit. permalink parent award report block reply view 1 more comments... vongregormench -1 points 6 days ago Buddy. The federal government would have exploded the currency if they had funded the bailout. They guaranteed loans that were paid back. They set up the structure of the bailout, allowing a bunch of big banks to absorb the losses. That’s what happened. Sorry if that makes you mad. If they allowed the failure to happen the federal government would have been on the hook for hundreds of billions of FDIC insured accounts. permalink parent award report block reply hatredcopter 2 points 6 days ago Good, that's what happens when you decide to insure shit, you might have to pay it out. Maybe not do that next time. Probably shouldn't have let savings and investment banks merge either if you didn't want to have to cover investment risk with your deposit insurance. It took less than ten years for this shit to play out. And where are we now? Banks are more consolidated and embedded in everything than ever before. Groups that benefited directly from the government's actions own trillions in assets and push commie DEI bullshit through the companies they own. Home ownership, the pretend goal of the actions, is down while these companies buy them up instead. FDIC - FDR. Democrat policy.\nGLBA - Clinton. Democrat policy.\nBank bailouts - Obama. Democrat policy. permalink parent award report block reply Hanging_Chad OP 1 points 6 days ago hundreds of billions of accounts? permalink parent award report block reply vongregormench 0 points 6 days ago Fuck off. You can figure it out. permalink parent award report block reply\nindigo_truther 5 points 6 days ago I always wondered if it was wise to prop up an obviously broken system. Sure, it would have been awful for a while, but would something better have emerged? permalink parent award report block reply vongregormench 6 points 6 days ago A bunch of mistakes were made and nothing was done to correct the system. Politicians will forget that pushing home loans to unqualified borrowers is dumb and do the same thing again in a few years. permalink parent award report block reply Error404 1 points 6 days ago This^^  it kept the broken/rigged system alive.  Allowed much further inflation/gay evaluation of assets.  Somehow I don't think properties doubling and sometimes even tripling since then is evidence of a fair/balanced/corrupt-free system. permalink parent award report block reply\nvongregormench 6 points 6 days ago A bunch of mistakes were made and nothing was done to correct the system. Politicians will forget that pushing home loans to unqualified borrowers is dumb and do the same thing again in a few years. permalink parent award report block reply\nError404 1 points 6 days ago This^^  it kept the broken/rigged system alive.  Allowed much further inflation/gay evaluation of assets.  Somehow I don't think properties doubling and sometimes even tripling since then is evidence of a fair/balanced/corrupt-free system. permalink parent award report block reply\nAwakened 0 points 6 days ago Yeah, but what they pay isn't as destructive to their overall budget and lively hood. They don't have to scrimp and save just to survive. But to be clear, all income, payroll, and property tax are theft. We need to cut the government to the bone. permalink parent award report block reply\nhatredcopter -4 points 6 days ago What kind of retarded pro-bank fan fiction is this shit? permalink parent award report block reply UrShulgi 6 points 6 days ago My friend, I worked in the belly of the beast while it was all going down.  You're welcome to try and point out any factual inconsistencies you can find, but look it up...TARP cost 31 billion, the mortgage banks paid 110 billion in fines which funded programs like HAMP/HARP.  Or is this just more hate the wealthy commie shit? permalink parent award report block reply IHaveABetterSolution 2 points 6 days ago I was under the impression the money supply was expanded during both the great recession and the more recent 2023 SVB and related bailouts. That isn't the case? M1, M2, whatever. Novel money being created. Genuinely curious, not never been in the belly of the beast and don't ever care to be. permalink parent award report block reply UrShulgi 2 points 6 days ago No.  M1 is liquid money, including physical currency and money held in checking accounts.  M2 includes all of M1 and everything that is semi-liquid, which includes stuff like savings accounts, CDs under 100k, and money market accounts. TARP instead allowed the US Treasury to purchase and/or guarantee bad assets on the books of banks, which was the big problem.  By purchasing or guaranteeing them, the bank could still consider them as solid assets.  The price was an interest rate which the banks paid until the assets were either paid back, or no longer needing guaranteed.  These types of funds don't hit M1 or M2. permalink parent award report block reply hatredcopter -6 points 6 days ago Ah, an appeal to authority to justify the pro-bank fan fiction.\nIts such a noble thing that the banks funded these programs - through fines for wrongdoing. And it cost the US government \"only\" 31 billion. What a great deal. And everyone lived happily ever after. permalink parent award report block reply UrShulgi 4 points 6 days ago If you're going to say stupid shit like someone who worked in the industry telling you about stuff that happened while it was going down is an 'appeal to authority', I can't even argue with you.  You're literally a fucking retard who writes off 1st hand knowledge of what happened.  Also, you're not even using the fallacy correctly: The appeal to authority fallacy is when an argument is based on the idea that a claim is true simply because an authority figure said it, rather than on evidence and facts. I was sharing my personal knowledge and not pointing to some major figure involved in the scandal as the only reason I'm right. I supported what I said about it with easily verifiable facts and numbers about how much the programs cost.  You can literally look up what I said to prove that I'm right. permalink parent award report block reply view 3 more comments... HoganP -1 points 6 days ago \"Appeal to authority\" is what every lefty faggot ever cries about when they aren't crying about listening to \"experts\" when one tells them something contrary to the bullshit narrative they are glued to like it's religious dogma. Our government wipes its ass with 31 billion for trivial bullshit. permalink parent award report block reply view 1 more comments... vongregormench -1 points 6 days ago Buddy. The federal government would have exploded the currency if they had funded the bailout. They guaranteed loans that were paid back. They set up the structure of the bailout, allowing a bunch of big banks to absorb the losses. That’s what happened. Sorry if that makes you mad. If they allowed the failure to happen the federal government would have been on the hook for hundreds of billions of FDIC insured accounts. permalink parent award report block reply hatredcopter 2 points 6 days ago Good, that's what happens when you decide to insure shit, you might have to pay it out. Maybe not do that next time. Probably shouldn't have let savings and investment banks merge either if you didn't want to have to cover investment risk with your deposit insurance. It took less than ten years for this shit to play out. And where are we now? Banks are more consolidated and embedded in everything than ever before. Groups that benefited directly from the government's actions own trillions in assets and push commie DEI bullshit through the companies they own. Home ownership, the pretend goal of the actions, is down while these companies buy them up instead. FDIC - FDR. Democrat policy.\nGLBA - Clinton. Democrat policy.\nBank bailouts - Obama. Democrat policy. permalink parent award report block reply Hanging_Chad OP 1 points 6 days ago hundreds of billions of accounts? permalink parent award report block reply vongregormench 0 points 6 days ago Fuck off. You can figure it out. permalink parent award report block reply\nUrShulgi 6 points 6 days ago My friend, I worked in the belly of the beast while it was all going down.  You're welcome to try and point out any factual inconsistencies you can find, but look it up...TARP cost 31 billion, the mortgage banks paid 110 billion in fines which funded programs like HAMP/HARP.  Or is this just more hate the wealthy commie shit? permalink parent award report block reply IHaveABetterSolution 2 points 6 days ago I was under the impression the money supply was expanded during both the great recession and the more recent 2023 SVB and related bailouts. That isn't the case? M1, M2, whatever. Novel money being created. Genuinely curious, not never been in the belly of the beast and don't ever care to be. permalink parent award report block reply UrShulgi 2 points 6 days ago No.  M1 is liquid money, including physical currency and money held in checking accounts.  M2 includes all of M1 and everything that is semi-liquid, which includes stuff like savings accounts, CDs under 100k, and money market accounts. TARP instead allowed the US Treasury to purchase and/or guarantee bad assets on the books of banks, which was the big problem.  By purchasing or guaranteeing them, the bank could still consider them as solid assets.  The price was an interest rate which the banks paid until the assets were either paid back, or no longer needing guaranteed.  These types of funds don't hit M1 or M2. permalink parent award report block reply hatredcopter -6 points 6 days ago Ah, an appeal to authority to justify the pro-bank fan fiction.\nIts such a noble thing that the banks funded these programs - through fines for wrongdoing. And it cost the US government \"only\" 31 billion. What a great deal. And everyone lived happily ever after. permalink parent award report block reply UrShulgi 4 points 6 days ago If you're going to say stupid shit like someone who worked in the industry telling you about stuff that happened while it was going down is an 'appeal to authority', I can't even argue with you.  You're literally a fucking retard who writes off 1st hand knowledge of what happened.  Also, you're not even using the fallacy correctly: The appeal to authority fallacy is when an argument is based on the idea that a claim is true simply because an authority figure said it, rather than on evidence and facts. I was sharing my personal knowledge and not pointing to some major figure involved in the scandal as the only reason I'm right. I supported what I said about it with easily verifiable facts and numbers about how much the programs cost.  You can literally look up what I said to prove that I'm right. permalink parent award report block reply view 3 more comments... HoganP -1 points 6 days ago \"Appeal to authority\" is what every lefty faggot ever cries about when they aren't crying about listening to \"experts\" when one tells them something contrary to the bullshit narrative they are glued to like it's religious dogma. Our government wipes its ass with 31 billion for trivial bullshit. permalink parent award report block reply view 1 more comments...\nIHaveABetterSolution 2 points 6 days ago I was under the impression the money supply was expanded during both the great recession and the more recent 2023 SVB and related bailouts. That isn't the case? M1, M2, whatever. Novel money being created. Genuinely curious, not never been in the belly of the beast and don't ever care to be. permalink parent award report block reply UrShulgi 2 points 6 days ago No.  M1 is liquid money, including physical currency and money held in checking accounts.  M2 includes all of M1 and everything that is semi-liquid, which includes stuff like savings accounts, CDs under 100k, and money market accounts. TARP instead allowed the US Treasury to purchase and/or guarantee bad assets on the books of banks, which was the big problem.  By purchasing or guaranteeing them, the bank could still consider them as solid assets.  The price was an interest rate which the banks paid until the assets were either paid back, or no longer needing guaranteed.  These types of funds don't hit M1 or M2. permalink parent award report block reply\nUrShulgi 2 points 6 days ago No.  M1 is liquid money, including physical currency and money held in checking accounts.  M2 includes all of M1 and everything that is semi-liquid, which includes stuff like savings accounts, CDs under 100k, and money market accounts. TARP instead allowed the US Treasury to purchase and/or guarantee bad assets on the books of banks, which was the big problem.  By purchasing or guaranteeing them, the bank could still consider them as solid assets.  The price was an interest rate which the banks paid until the assets were either paid back, or no longer needing guaranteed.  These types of funds don't hit M1 or M2. permalink parent award report block reply\nhatredcopter -6 points 6 days ago Ah, an appeal to authority to justify the pro-bank fan fiction.\nIts such a noble thing that the banks funded these programs - through fines for wrongdoing. And it cost the US government \"only\" 31 billion. What a great deal. And everyone lived happily ever after. permalink parent award report block reply UrShulgi 4 points 6 days ago If you're going to say stupid shit like someone who worked in the industry telling you about stuff that happened while it was going down is an 'appeal to authority', I can't even argue with you.  You're literally a fucking retard who writes off 1st hand knowledge of what happened.  Also, you're not even using the fallacy correctly: The appeal to authority fallacy is when an argument is based on the idea that a claim is true simply because an authority figure said it, rather than on evidence and facts. I was sharing my personal knowledge and not pointing to some major figure involved in the scandal as the only reason I'm right. I supported what I said about it with easily verifiable facts and numbers about how much the programs cost.  You can literally look up what I said to prove that I'm right. permalink parent award report block reply view 3 more comments... HoganP -1 points 6 days ago \"Appeal to authority\" is what every lefty faggot ever cries about when they aren't crying about listening to \"experts\" when one tells them something contrary to the bullshit narrative they are glued to like it's religious dogma. Our government wipes its ass with 31 billion for trivial bullshit. permalink parent award report block reply view 1 more comments...\nUrShulgi 4 points 6 days ago If you're going to say stupid shit like someone who worked in the industry telling you about stuff that happened while it was going down is an 'appeal to authority', I can't even argue with you.  You're literally a fucking retard who writes off 1st hand knowledge of what happened.  Also, you're not even using the fallacy correctly: The appeal to authority fallacy is when an argument is based on the idea that a claim is true simply because an authority figure said it, rather than on evidence and facts. I was sharing my personal knowledge and not pointing to some major figure involved in the scandal as the only reason I'm right. I supported what I said about it with easily verifiable facts and numbers about how much the programs cost.  You can literally look up what I said to prove that I'm right. permalink parent award report block reply view 3 more comments...\nHoganP -1 points 6 days ago \"Appeal to authority\" is what every lefty faggot ever cries about when they aren't crying about listening to \"experts\" when one tells them something contrary to the bullshit narrative they are glued to like it's religious dogma. Our government wipes its ass with 31 billion for trivial bullshit. permalink parent award report block reply view 1 more comments...\nvongregormench -1 points 6 days ago Buddy. The federal government would have exploded the currency if they had funded the bailout. They guaranteed loans that were paid back. They set up the structure of the bailout, allowing a bunch of big banks to absorb the losses. That’s what happened. Sorry if that makes you mad. If they allowed the failure to happen the federal government would have been on the hook for hundreds of billions of FDIC insured accounts. permalink parent award report block reply hatredcopter 2 points 6 days ago Good, that's what happens when you decide to insure shit, you might have to pay it out. Maybe not do that next time. Probably shouldn't have let savings and investment banks merge either if you didn't want to have to cover investment risk with your deposit insurance. It took less than ten years for this shit to play out. And where are we now? Banks are more consolidated and embedded in everything than ever before. Groups that benefited directly from the government's actions own trillions in assets and push commie DEI bullshit through the companies they own. Home ownership, the pretend goal of the actions, is down while these companies buy them up instead. FDIC - FDR. Democrat policy.\nGLBA - Clinton. Democrat policy.\nBank bailouts - Obama. Democrat policy. permalink parent award report block reply Hanging_Chad OP 1 points 6 days ago hundreds of billions of accounts? permalink parent award report block reply vongregormench 0 points 6 days ago Fuck off. You can figure it out. permalink parent award report block reply\nhatredcopter 2 points 6 days ago Good, that's what happens when you decide to insure shit, you might have to pay it out. Maybe not do that next time. Probably shouldn't have let savings and investment banks merge either if you didn't want to have to cover investment risk with your deposit insurance. It took less than ten years for this shit to play out. And where are we now? Banks are more consolidated and embedded in everything than ever before. Groups that benefited directly from the government's actions own trillions in assets and push commie DEI bullshit through the companies they own. Home ownership, the pretend goal of the actions, is down while these companies buy them up instead. FDIC - FDR. Democrat policy.\nGLBA - Clinton. Democrat policy.\nBank bailouts - Obama. Democrat policy. permalink parent award report block reply\nHanging_Chad OP 1 points 6 days ago hundreds of billions of accounts? permalink parent award report block reply vongregormench 0 points 6 days ago Fuck off. You can figure it out. permalink parent award report block reply\nvongregormench 0 points 6 days ago Fuck off. You can figure it out. permalink parent award report block reply\nPerseverant 20 points 6 days ago I'm middle class, but in terms of delayed gratification, financial literacy, and financial responsibility, I am probably the top 1-3% of Americans. It has been brutal knowing just how far the fiscal decisions of Joetato's handlers have set our family back in terms of additional years of my life I now have to work to be where I would've been had a pet rock been president instead. I can only imagine what the average family is dealing with.  It has been absolutely brutal seeing two promotions of buying power just....  erased...  by inflation.  Feel like I've been swimming up a waterfall the last few years to try to stay on-track with our goals. I still think life is good and we have joy in our household, but the evils that the corrupt have subjected our country to tick me off. permalink award report block reply UncleTrumpsBand 3 points 6 days ago I feel for you fren. Imagine how rough it is on kids trying start a career. A kick in the nuts, it is. permalink parent award report block reply Perseverant 2 points 6 days ago Yeah, I feel really bad for kids fresh out of college.  Indians getting jobs instead of them.  H1B, inflation, foreign invaders. Tough times are going to make tough men and break a lot of other people.  There is always hope (my hope is in Jesus), and striving for something better through responsible living is always worth it, but the next generation is being handed a lemon of a country. permalink parent award report block reply Awakened 2 points 6 days ago I hear and feel this. permalink parent award report block reply Perseverant 2 points 6 days ago Hang in there, fren. permalink parent award report block reply Awakened 2 points 6 days ago Thank you. You as well. permalink parent award report block reply\nUncleTrumpsBand 3 points 6 days ago I feel for you fren. Imagine how rough it is on kids trying start a career. A kick in the nuts, it is. permalink parent award report block reply Perseverant 2 points 6 days ago Yeah, I feel really bad for kids fresh out of college.  Indians getting jobs instead of them.  H1B, inflation, foreign invaders. Tough times are going to make tough men and break a lot of other people.  There is always hope (my hope is in Jesus), and striving for something better through responsible living is always worth it, but the next generation is being handed a lemon of a country. permalink parent award report block reply\nPerseverant 2 points 6 days ago Yeah, I feel really bad for kids fresh out of college.  Indians getting jobs instead of them.  H1B, inflation, foreign invaders. Tough times are going to make tough men and break a lot of other people.  There is always hope (my hope is in Jesus), and striving for something better through responsible living is always worth it, but the next generation is being handed a lemon of a country. permalink parent award report block reply\nAwakened 2 points 6 days ago I hear and feel this. permalink parent award report block reply Perseverant 2 points 6 days ago Hang in there, fren. permalink parent award report block reply Awakened 2 points 6 days ago Thank you. You as well. permalink parent award report block reply\nPerseverant 2 points 6 days ago Hang in there, fren. permalink parent award report block reply Awakened 2 points 6 days ago Thank you. You as well. permalink parent award report block reply\nAwakened 2 points 6 days ago Thank you. You as well. permalink parent award report block reply\njlange94 12 points 6 days ago Growing up middle class and now living and working in the middle class, all I've recognized is that the poor gets handouts and benefits everywhere without working or supporting the system that supports them, while everyone else fronts the massive bill for them. So fuck them. As for the upper class, they are so wealthy that even though they get taxed a ton, it doesn't affect them much because they can still afford it and live comfortably. This leaves the middle class which is not only expected to front the bill for the lower class like the upper class does but also is not afforded the same benefits and handouts that the poor gets. So we continue to be fucked in all this. You don't have to wonder why generations of the middle class now are pissed and will vote for Trump and other to blow up the system. At this point, I'm willing to vote in the most radical candidate possible. To even get a little change you need a seriously radical force to cause it. permalink award report block reply\nKEK_1776_KEK 9 points 6 days ago My mother is in her late 70s, she gets $30 a month on EBT after working in retail for decades. Obese black women and illegals get hundreds and more. permalink award report block reply altaG12 1 points 6 days ago Not sure why, most people on welfare are white permalink parent award report block reply UncleTrumpsBand 1 points 6 days ago That’ll get you 2 big mac meals and one mcflurry  that you GET to ration for the month tho! Shouldn't you be happy!?!?!?!?!?! permalink parent award report block reply\naltaG12 1 points 6 days ago Not sure why, most people on welfare are white permalink parent award report block reply\nUncleTrumpsBand 1 points 6 days ago That’ll get you 2 big mac meals and one mcflurry  that you GET to ration for the month tho! Shouldn't you be happy!?!?!?!?!?! permalink parent award report block reply\nPsarg 9 points 6 days ago If I make $0 I'm homeless permalink award report block reply Beachbum2023 1 points 6 days ago You have to have a paid for living arrangement to milk the system properly. Either section 8 or mom's basement. Or a trust with a paid off home. permalink parent award report block reply\nBeachbum2023 1 points 6 days ago You have to have a paid for living arrangement to milk the system properly. Either section 8 or mom's basement. Or a trust with a paid off home. permalink parent award report block reply\nTwoArizonaPedes 7 points 6 days ago Even if you have $0 you don't always get welfare if you don't check the \"right\" boxes. permalink award report block reply\nForty_Five 5 points 6 days ago It makes perfect sense when you understand their goal is to create an aristocracy with a slave class that's dependent on them for survival. permalink award report block reply LostElf 1 points 6 days ago And when robots improve sufficiently, into the mass graves go the human slaves. permalink parent award report block reply\nLostElf 1 points 6 days ago And when robots improve sufficiently, into the mass graves go the human slaves. permalink parent award report block reply\njiujiujiu 5 points 6 days ago You’re welcome everyone permalink award report block reply\nProfessorJagoff 5 points 6 days ago I think I pay around 20k a year all things included but sales tax, around 25% of my income, property tax really hurts. But I'm pretty sure those who make more than $50million pay most of the bill. The issue is how much we are spending IMO. permalink award report block reply\nLostElf 4 points 6 days ago While absorbing the blame for everything and the credit for nothing, plus you get laughed at and called names! It's awesome! permalink award report block reply UncleTrumpsBand 3 points 6 days ago Lazy millennial, why dont you just work 12 jobs so you can buy a $500,000 2 bed 1 bath at 7% you lazy ungrateful pos permalink parent award report block reply\nUncleTrumpsBand 3 points 6 days ago Lazy millennial, why dont you just work 12 jobs so you can buy a $500,000 2 bed 1 bath at 7% you lazy ungrateful pos permalink parent award report block reply\npatrioticwinning3 3 points 6 days ago LMAO XD  Sad but true! permalink award report block reply\nvongregormench 3 points 6 days ago Individuals don’t get bailouts. When the banks were bailed out the investors lost all their money. Any of the banks that actually got absorbed by the surviving banks forced by Obama the stock value went to zero. Who got a bailout? Just the banks and the account holders. What bailout are we referring to? permalink award report block reply sixfingerdildo 1 points 6 days ago what investors lost all their money? permalink parent award report block reply vongregormench 1 points 6 days ago Stock holders permalink parent award report block reply sixfingerdildo 2 points 6 days ago your comment is strange. are you implying that nobody got a bailout except \"the banks\" and fdic insured depositors? permalink parent award report block reply vongregormench 1 points 6 days ago Corporations were bailed out, so CEOs lost pay, and stockholders lost money. The bailouts were loans which were repaid. Those loans kept the accounts afloat ao people that loaned money to the banks, or account holders. The bailouts weren’t free money. They were people being paid for the money they put in. Nobody got a bailout because they had fifty million. There is a legal order to who gets paid first when a company goes under. Last place is stockholders. OP is implying that millionaires got free money. It’s dumb. -edit I realize some sentences are incomplete. I don’t care. You’ll get the gist of it. permalink parent award report block reply view 5 more comments... UrShulgi 1 points 6 days ago Bear Stears, the first big investment bank to fail, was publicly traded (owned by investors), and went from 25 billion market cap to 1 billion when the crash happened.  There are other examples, but this is the one most people probably remember as the fire alarm moment that kicked it all off.  Countrywide went from 25 billion to being bought by Bank of America for 4 billion.  Washington Mutual had 100% of shareholder value wiped when the government had to take them over.  The list goes on...but it was hundreds of billions that investors lost. permalink parent award report block reply sixfingerdildo 2 points 6 days ago pension funds, mutual funds, etc. foreign capital. some insiders, some institutionals. but when you say \"investors\", in the context of the op (only the middle class gets hit), those institutionals, insiders, etc still got a net bailout and still didn't \"lose everything\". The bailouts truly prevented them from losing it all while Main Street saw real drops in their pension funds, their real estate values and their employment. : also, the global debt is worse than ever, inflation has killed the middle class and wealth disparity is as bad if not worse than ever. permalink parent award report block reply\nsixfingerdildo 1 points 6 days ago what investors lost all their money? permalink parent award report block reply vongregormench 1 points 6 days ago Stock holders permalink parent award report block reply sixfingerdildo 2 points 6 days ago your comment is strange. are you implying that nobody got a bailout except \"the banks\" and fdic insured depositors? permalink parent award report block reply vongregormench 1 points 6 days ago Corporations were bailed out, so CEOs lost pay, and stockholders lost money. The bailouts were loans which were repaid. Those loans kept the accounts afloat ao people that loaned money to the banks, or account holders. The bailouts weren’t free money. They were people being paid for the money they put in. Nobody got a bailout because they had fifty million. There is a legal order to who gets paid first when a company goes under. Last place is stockholders. OP is implying that millionaires got free money. It’s dumb. -edit I realize some sentences are incomplete. I don’t care. You’ll get the gist of it. permalink parent award report block reply view 5 more comments... UrShulgi 1 points 6 days ago Bear Stears, the first big investment bank to fail, was publicly traded (owned by investors), and went from 25 billion market cap to 1 billion when the crash happened.  There are other examples, but this is the one most people probably remember as the fire alarm moment that kicked it all off.  Countrywide went from 25 billion to being bought by Bank of America for 4 billion.  Washington Mutual had 100% of shareholder value wiped when the government had to take them over.  The list goes on...but it was hundreds of billions that investors lost. permalink parent award report block reply sixfingerdildo 2 points 6 days ago pension funds, mutual funds, etc. foreign capital. some insiders, some institutionals. but when you say \"investors\", in the context of the op (only the middle class gets hit), those institutionals, insiders, etc still got a net bailout and still didn't \"lose everything\". The bailouts truly prevented them from losing it all while Main Street saw real drops in their pension funds, their real estate values and their employment. : also, the global debt is worse than ever, inflation has killed the middle class and wealth disparity is as bad if not worse than ever. permalink parent award report block reply\nvongregormench 1 points 6 days ago Stock holders permalink parent award report block reply sixfingerdildo 2 points 6 days ago your comment is strange. are you implying that nobody got a bailout except \"the banks\" and fdic insured depositors? permalink parent award report block reply vongregormench 1 points 6 days ago Corporations were bailed out, so CEOs lost pay, and stockholders lost money. The bailouts were loans which were repaid. Those loans kept the accounts afloat ao people that loaned money to the banks, or account holders. The bailouts weren’t free money. They were people being paid for the money they put in. Nobody got a bailout because they had fifty million. There is a legal order to who gets paid first when a company goes under. Last place is stockholders. OP is implying that millionaires got free money. It’s dumb. -edit I realize some sentences are incomplete. I don’t care. You’ll get the gist of it. permalink parent award report block reply view 5 more comments...\nsixfingerdildo 2 points 6 days ago your comment is strange. are you implying that nobody got a bailout except \"the banks\" and fdic insured depositors? permalink parent award report block reply vongregormench 1 points 6 days ago Corporations were bailed out, so CEOs lost pay, and stockholders lost money. The bailouts were loans which were repaid. Those loans kept the accounts afloat ao people that loaned money to the banks, or account holders. The bailouts weren’t free money. They were people being paid for the money they put in. Nobody got a bailout because they had fifty million. There is a legal order to who gets paid first when a company goes under. Last place is stockholders. OP is implying that millionaires got free money. It’s dumb. -edit I realize some sentences are incomplete. I don’t care. You’ll get the gist of it. permalink parent award report block reply view 5 more comments...\nvongregormench 1 points 6 days ago Corporations were bailed out, so CEOs lost pay, and stockholders lost money. The bailouts were loans which were repaid. Those loans kept the accounts afloat ao people that loaned money to the banks, or account holders. The bailouts weren’t free money. They were people being paid for the money they put in. Nobody got a bailout because they had fifty million. There is a legal order to who gets paid first when a company goes under. Last place is stockholders. OP is implying that millionaires got free money. It’s dumb. -edit I realize some sentences are incomplete. I don’t care. You’ll get the gist of it. permalink parent award report block reply view 5 more comments...\nUrShulgi 1 points 6 days ago Bear Stears, the first big investment bank to fail, was publicly traded (owned by investors), and went from 25 billion market cap to 1 billion when the crash happened.  There are other examples, but this is the one most people probably remember as the fire alarm moment that kicked it all off.  Countrywide went from 25 billion to being bought by Bank of America for 4 billion.  Washington Mutual had 100% of shareholder value wiped when the government had to take them over.  The list goes on...but it was hundreds of billions that investors lost. permalink parent award report block reply sixfingerdildo 2 points 6 days ago pension funds, mutual funds, etc. foreign capital. some insiders, some institutionals. but when you say \"investors\", in the context of the op (only the middle class gets hit), those institutionals, insiders, etc still got a net bailout and still didn't \"lose everything\". The bailouts truly prevented them from losing it all while Main Street saw real drops in their pension funds, their real estate values and their employment. : also, the global debt is worse than ever, inflation has killed the middle class and wealth disparity is as bad if not worse than ever. permalink parent award report block reply\nsixfingerdildo 2 points 6 days ago pension funds, mutual funds, etc. foreign capital. some insiders, some institutionals. but when you say \"investors\", in the context of the op (only the middle class gets hit), those institutionals, insiders, etc still got a net bailout and still didn't \"lose everything\". The bailouts truly prevented them from losing it all while Main Street saw real drops in their pension funds, their real estate values and their employment. : also, the global debt is worse than ever, inflation has killed the middle class and wealth disparity is as bad if not worse than ever. permalink parent award report block reply\nAntiCommieAktion 2 points 6 days ago Middle class almost always gets the short end of the stick permalink award report block reply\nBoomShtick 2 points 6 days ago Middle/working class gets fucked, always been that way since I have been alive permalink award report block reply\nFusionBlack 2 points 6 days ago Couldn't have said it better permalink award report block reply\nPepbrandt 2 points 6 days ago At this point it's more like Whale Fair. permalink award report block reply\nGhostOfKirk 2 points 6 days ago We need to sue for access to SNAP benefits. It’s like paying for the entire grocery bill then being the only one not getting a plate. Give me benefits or let me opt out and refund my taxes. permalink award report block reply\nPied-Trumper 2 points 6 days ago Well yeah, the 50 million allows you to bribe on behalf of everyone, including foreign entities. The $0 and welfare makes you dependent on the party promising and giving you those things. $2300 gives you independent though and enough knowledge to know the American Dream was alive when we were nationalists with a common history and ethnic/religious bond. permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nspinometer2 1 points 6 days ago not quite true but directionally correct permalink award report block reply\nMarkosis17 1 points 6 days ago What is savings? permalink award report block reply\nDrinkTeaNotKoolaid 1 points 6 days ago Fxcking A bubba! ,,,,,,,bubbet,,,,,, permalink award report block reply\nMhmm2MoreWeeks 1 points 6 days ago This is why the Education system is so in urgent need of being remade. Wealth is not generated from labor. A job merely lets you tread water. Residual income on services is how you get rich. That or you get real good at financial markets/crypto/stock. Most people who complain about money do not even try to make more. permalink award report block reply sixfingerdildo 8 points 6 days ago you sound like a scammer. \"buy my book, you make money! look me my beautfil wimmen!\" permalink parent award report block reply Perseverant 4 points 6 days ago How to get rich? Sell a book about how to get rich. permalink parent award report block reply UncleTrumpsBand 2 points 6 days ago Step 3. Profit. permalink parent award report block reply UrShulgi 2 points 6 days ago Saying that labor doesn't produce wealth isn't quite right.  If the labor is spent in the production of things, the thing exists afterwards and has value, and the worker was paid for their labor. A builder hires construction workers to build a house.  The workers provide for their families with the money they get.  The builder makes a profit on building the house.  The buyer of the house has a huge asset (the house) that's still worth a lot of money.  The labor created the profit for the builder and created the thing that has value (the house).  Labor created wealth. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply user2827 1 points 6 days ago Won't make sense to the young guys, but there was a saying, \"you don't get rich signing the back of the check.\" The plan of finding ways to build residual income or investing (although crypto is closer to a ponzi scheme than many want to admit) is almost critical, but wages have been so far outshined by inflation, that the options for people are getting slimmer. The welfare cliff is now somewhere in the ballpark of 30-35$/hr. That makes it increasingly easy to just give up on producing and take the \"benefits\"... permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nsixfingerdildo 8 points 6 days ago you sound like a scammer. \"buy my book, you make money! look me my beautfil wimmen!\" permalink parent award report block reply Perseverant 4 points 6 days ago How to get rich? Sell a book about how to get rich. permalink parent award report block reply UncleTrumpsBand 2 points 6 days ago Step 3. Profit. permalink parent award report block reply\nPerseverant 4 points 6 days ago How to get rich? Sell a book about how to get rich. permalink parent award report block reply UncleTrumpsBand 2 points 6 days ago Step 3. Profit. permalink parent award report block reply\nUncleTrumpsBand 2 points 6 days ago Step 3. Profit. permalink parent award report block reply\nUrShulgi 2 points 6 days ago Saying that labor doesn't produce wealth isn't quite right.  If the labor is spent in the production of things, the thing exists afterwards and has value, and the worker was paid for their labor. A builder hires construction workers to build a house.  The workers provide for their families with the money they get.  The builder makes a profit on building the house.  The buyer of the house has a huge asset (the house) that's still worth a lot of money.  The labor created the profit for the builder and created the thing that has value (the house).  Labor created wealth. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nuser2827 1 points 6 days ago Won't make sense to the young guys, but there was a saying, \"you don't get rich signing the back of the check.\" The plan of finding ways to build residual income or investing (although crypto is closer to a ponzi scheme than many want to admit) is almost critical, but wages have been so far outshined by inflation, that the options for people are getting slimmer. The welfare cliff is now somewhere in the ballpark of 30-35$/hr. That makes it increasingly easy to just give up on producing and take the \"benefits\"... permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nDresdenFirebomber 0 points 6 days ago A woman pointing out parasitism is peak irony. Only class who can say their assets shrunk as marriage dipped in popularity, because they can only make anything from stealing. permalink award report block reply\nbluewhiteandred 0 points 6 days ago see gervais principle and how it plugs in here https://www.ribbonfarm.com/2009/10/07/the-gervais-principle-or-the-office-according-to-the-office/ permalink award report block reply\nNorthpoint12 0 points 6 days ago If you have 2300.oo in savings then your basically broke. Well, I guess that is your lecture from me. You do need to budget better or earn more money. permalink award report block reply UncleTrumpsBand 1 points 6 days ago Um, this is a large majority of those under 30. You sound ignorant to the situation and it is alot more nuanced than - “lazy damn kids” permalink parent award report block reply Northpoint12 0 points 1 day ago I remember seeing all the billboards around my town advertising sign on bonuses and benefits/good wage. The 'kids' around town didnt bother to apply. At the local walmart I asked a manager why they have so many registers but only a few open? She told me that the high school kids do not want to work on the weekend. So, They end up getting fired. They cannot find good people to work. I walked down an isle and this worker scared the shi* out of me. She was a koolaid head and tatoos everywhere with metal in her head. I got out of there quick. On leaving I saw a guy in a dress at a cash register. Your right \"Lazy Damn kids\" is actually an understatement. Weird people fits better. The other day I saw a billboard advertising 26/hr with sign up bonus for one of the local factories. This is because ICE has come to town I suspect. Of course, Any factory job beats the heck out of working at walmart or a gas station. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nUncleTrumpsBand 1 points 6 days ago Um, this is a large majority of those under 30. You sound ignorant to the situation and it is alot more nuanced than - “lazy damn kids” permalink parent award report block reply Northpoint12 0 points 1 day ago I remember seeing all the billboards around my town advertising sign on bonuses and benefits/good wage. The 'kids' around town didnt bother to apply. At the local walmart I asked a manager why they have so many registers but only a few open? She told me that the high school kids do not want to work on the weekend. So, They end up getting fired. They cannot find good people to work. I walked down an isle and this worker scared the shi* out of me. She was a koolaid head and tatoos everywhere with metal in her head. I got out of there quick. On leaving I saw a guy in a dress at a cash register. Your right \"Lazy Damn kids\" is actually an understatement. Weird people fits better. The other day I saw a billboard advertising 26/hr with sign up bonus for one of the local factories. This is because ICE has come to town I suspect. Of course, Any factory job beats the heck out of working at walmart or a gas station. permalink parent award report block reply\nNorthpoint12 0 points 1 day ago I remember seeing all the billboards around my town advertising sign on bonuses and benefits/good wage. The 'kids' around town didnt bother to apply. At the local walmart I asked a manager why they have so many registers but only a few open? She told me that the high school kids do not want to work on the weekend. So, They end up getting fired. They cannot find good people to work. I walked down an isle and this worker scared the shi* out of me. She was a koolaid head and tatoos everywhere with metal in her head. I got out of there quick. On leaving I saw a guy in a dress at a cash register. Your right \"Lazy Damn kids\" is actually an understatement. Weird people fits better. The other day I saw a billboard advertising 26/hr with sign up bonus for one of the local factories. This is because ICE has come to town I suspect. Of course, Any factory job beats the heck out of working at walmart or a gas station. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nRememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nAlmostFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\n0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\ntakebackyourfreedom 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:07:42.433637Z"
}