{
  "id": "1ARK590M5u",
  "url": "https://patriots.win/p/1ARK590M5u/theres-nothing-to-see-here-just-/c",
  "content": "1213 There’s nothing to see here. Just a simple and honest mistake from our dear friends in Maricopa County…. posted 4 days ago by alienjoe 66 comments award share download report block\n66 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno IllIllIll 97 points 4 days ago Arizona is a narco-state. permalink award report block reply The_Return_of_User_x 34 points 4 days ago If the result is not the one you wish, try try again. permalink parent award report block reply mikethemarine 25 points 4 days ago the left will say there wasn't enough ballots in there to effect the outcome of the election The meaning to this is we cheated enough already and didn't need those ballots permalink parent award report block reply MAGAllDayLong 28 points 4 days ago Agreed, the prop passed 51/49 which means we all have to pay $26/year extra in property taxes.\nA) Who in their right mind would vote yes to be taxed more?!?\nB) The vote was obviously rigged because it was the same 51/49 BS percentage that  they always use. permalink parent award report block reply ThePatriotGames2016 21 points 4 days ago they've been riding on that 50/50 split bullshit for 60 years. I'm convinced if there is anything close to a 50/50 split, it's bullshit. They've been rigging since Reagan beat the shit out of them in the 80s. From HW Bush, they've been fucking with elections. They rely on the 50/50 shit so they can slide things by unnoticed. permalink parent award report block reply Friendly_B 3 points 4 days ago I remember it being 50/50 in the 80s a lot.  Late 80s early 90s. permalink parent award report block reply Nomad899 5 points 4 days ago Look up prop A in commiefornia….they raised sales tax in norcal by almost a full% permalink parent award report block reply mohel 2 points 4 days ago Nobody knows how the f**k did it happen. Vote harder. permalink parent award report block reply suckmycorona 3 points 4 days ago 51/49 everytime.  It’s an insult, I wish they would just do 90/10 to shake it up a bit. permalink parent award report block reply ListenToSavage 6 points 4 days ago How hard would you like to get punched in the balls? \"Arizona voted overwhelmingly 51 to 49, very hard.\" permalink parent award report block reply keeman 5 points 4 days ago If drugs were legal (as they were for the first 130 years of our history) there would be no such thing as a \"narco-state\".  Drug illegalization is progressivist bullshit and if we want to truly drain the swamp we need to kick it aside.  You wanna fuck yourself up with drugs that is a you thing.  The rest of us can regulate societal behavior by mocking it. permalink parent award report block reply Klown_Kutz 3 points 3 days ago Yeah no. Take this tired old Libertopian bullshit elsewhere. It will never make America great. permalink parent award report block reply Washington_Redskins 1 points 3 days ago If all drugs were completely legal methamphetamines and Fentanyl would devastate American society the same way opium did to China during the Opium Wars.Considering the million plus that have been killed by Fentanyl and meth, the USA would be justified in using nuclear weapons against the countries making the.drugs. Other countries would be reluctant to make drugs to send to America if they knew they were going to get nuked. permalink parent award report block reply BaronFalcon 2 points 3 days ago That's the same thing they said about alcohol. Take your moral legislation somewhere else. permalink parent award report block reply Washington_Redskins 1 points 3 days ago The reality of history shows otherwise. Even small amounts of legalization such as in Portland have created much worse disasters with far more deaths. Legalizing things like Fentanyl and meth doesn't help. It's not about morality it's about reality. Alcohol can also debilitate but it does not kill and devastate Society as much as Fentanyl and meth do despite what all the people who hate alcohol say. Please take your this is about legislating morality opinion elsewhere as that is absolutely not what this is about. permalink parent award report block reply OldZilla 49 points 4 days ago Somebody please explain why after Kari Lake pointing this shit out that nobody had done anything about these cheating fucks. I mean seriously. Arizona is the the testing grounds for stealing elections. permalink award report block reply KernalMustard 25 points 4 days ago I explained it 3 days ago. Dems have run of the house. GOP allow them. Both sides grift. So  the GOP does nothing because it would end the grift for everyone. Dems open the vault the GOP keeps it open. Everyone involved benefits. permalink parent award report block reply Nomad899 9 points 4 days ago Every Politician benefits….we tax payers get fucked again permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago It's the American way! permalink parent award report block reply mohel 0 points 4 days ago Just bend over permalink parent award report block reply keeman 6 points 4 days ago TLDR for the short attention span:  RINOS want Ds to win because it helps them. permalink parent award report block reply suckmycorona 3 points 4 days ago They’re happy with the sloppy seconds. permalink parent award report block reply mohel -1 points 4 days ago They are. permalink parent award report block reply ListenToSavage 5 points 4 days ago Paul Gosar reiterated during his '09 campaign he was only going to Washington for 1 term to \"get things  done,\" then going back to his dental profession. Well that was 15 years ago and Pauly G hasn't drilled a cavity since. permalink parent award report block reply Sgt_Hulka 1 points 3 days ago How much has his personal fortune increased? permalink parent award report block reply BaronFalcon 1 points 3 days ago Uniparty. The idea of left and right is the grift. Convincing people that there's actually left and right in DC is joke they play on us to keep us fighting. Bread and circuses, division, envy... permalink parent award report block reply XxxRDTPRNxxX 12 points 4 days ago They stole a national election in broad daylight and then told us not to believe our lying eyes. Nothing was ever done about that, even after the victim of said fraud regained full control of the military. permalink parent award report block reply julianReyes 5 points 4 days ago People here support third world elections , I can bring up hundreds of posts here trying to dunk on Lake for doing the right thing and kneeling harder than female FBI agents to Xiden. permalink parent award report block reply Washington_Redskins 2 points 3 days ago No standing. Judges have become a plague on America... we need to find a better system and fire every single judge.. and legally prosecute all the ones who are working with the leftist for political gain permalink parent award report block reply ItsFunToSay-M-A-G-A 27 points 4 days ago \"Generated with AI, which can make mistakes\" The news article or the election results??? permalink award report block reply LogicCircuits 12 points 4 days ago That refers to the article summary blurb permalink parent award report block reply Hanging_Chad 7 points 4 days ago DominionAI™ permalink parent award report block reply keeman 4 points 4 days ago Both.  AI mistakes are because it has no idea what it is talking about and just continues sentences in ways which are like other things it has been trained with.  Election results are more sinister. permalink parent award report block reply patrioticwinning3 24 points 4 days ago Zero riggers arrested = zero incentive not to rig! permalink award report block reply Hanging_Chad 12 points 4 days ago all riggers arrested = no more rigging permalink parent award report block reply guywholikesDjtof2024 6 points 4 days ago scam ponzi, kash, bongino fired and only J6'ers hired = no more deepstate permalink parent award report block reply Hanging_Chad 4 points 4 days ago is Bongino gonna resign? permalink parent award report block reply Sgt_Hulka 3 points 3 days ago Love to know what they have on him Ive never liked that blockhead. permalink parent award report block reply the-new-style 2 points 3 days ago Total Rigger Death permalink parent award report block reply Marianasoctober 7 points 4 days ago And 99.9% will be pro dem. Statistically impossible but it will be. permalink award report block reply Drewniverse 6 points 4 days ago \"Jennier Lier\" Makes sense. permalink award report block reply TruthWillOut 2 points 3 days ago Indeed! permalink parent award report block reply PhantomShield72 2 points 3 days ago Quanell Rigger agrees with Jennifer Lier - nothing to see here! permalink parent award report block reply MagaJay02 6 points 4 days ago Um. An \"accident\" like this should be illegal in nature. Similar to malpractice at least permalink award report block reply Hikedelics 5 points 4 days ago The saddest thing about this is that I even have to ask “which election?” permalink award report block reply maggiemay 3 points 3 days ago Why would anyone put full bins of ballots INTO a drop box? What kind of idiot would make an error like that? It's not even plausible.  The excuse is lamer than the admission. permalink award report block reply lefty295 3 points 4 days ago Not saying you’re a lier, but I’m not saying you’re a truther either. permalink award report block reply Washington_Redskins 2 points 3 days ago We all might have several thousand totes that are full of ballots that we found and should send to Maricopa County that are just as a legitimate permalink award report block reply MAGA-Fett 2 points 3 days ago My dad works in the Maricopa County elections. He says the US Post Office sent back many boxes of ballots from houses that the voter no longer lives there. Probably something near 250k ballots. The whole process is so broken for this dumb “all mail in ballot” election. permalink award report block reply Steve56775 1 points 3 days ago If you want to vote multiple times in Nevada just go to any apartment complex when ballots are mailed. The community mailboxes are littered with them. Collect as many as you want and mail them in. Make sure all the illegals get handful. permalink parent award report block reply joesfbi 2 points 4 days ago Every time I think about moving to Arizona, Maricopa County reminds why its a bad idea. permalink award report block reply Rosebud4Jesus 2 points 4 days ago Has Trump put anyone in charge of Elections and Election Fraud?\nTo clean voter rolls, etc.  He needs someone who is MAGA and believes the 2020 election was stolen. permalink award report block reply RexCollumSilvarum 1 points 4 days ago The Deputy Elections Director is named Jennifer... Lier ? The jokes write themselves with these people. permalink award report block reply ThisIsHowItStarts 1 points 4 days ago Tabulated = we will cheat permalink award report block reply NZbacon 1 points 3 days ago We hear about that place far too often! permalink award report block reply seattlerunner 1 points 4 days ago What will be done about it? permalink award report block reply YT45 1 points 4 days ago And the current lead margin is…? permalink award report block reply MAGAllDayLong 3 points 4 days ago 51/49 like they always use to cheat. Thankfully only a prop we were voting on. Still infuriating. permalink parent award report block reply BeholdaPaleHorse 1 points 4 days ago Of course her name is Lier permalink award report block reply ThePatriotGames2016 1 points 4 days ago amazing how something always goes wrong there. permalink award report block reply thevagabond 1 points 3 days ago two more weeks guys....just hear me out... permalink award report block reply MAGALADON9 1 points 3 days ago \" Generated by A.I. which can make mistakes\" Ok permalink award report block reply Riehlpissed 1 points 3 days ago Tie Jen upside down to a post and feed her Xlax permalink award report block reply Twitter 1 points 4 days ago do your job you dumb blonde bitch permalink award report block reply Darkpoisonousshaddow 1 points 4 days ago Still waiting for trump to sort this out. I'll be retired before it ends up on Bondi's desk and dead before it gets passed on to Kash. permalink award report block reply TexasBrowncoat 1 points 3 days ago Jail time is not punishment enough for this crap. Necktie Justice is the only way to stop this from happening. permalink award report block reply Hanging_Chad 1 points 4 days ago no standing permalink award report block reply SimaYi 0 points 4 days ago Voting is fake and gay. permalink award report block reply Sugz_Da_Feefth -2 points 4 days ago Too late. Faux already called it. permalink award report block reply\nIllIllIll 97 points 4 days ago Arizona is a narco-state. permalink award report block reply The_Return_of_User_x 34 points 4 days ago If the result is not the one you wish, try try again. permalink parent award report block reply mikethemarine 25 points 4 days ago the left will say there wasn't enough ballots in there to effect the outcome of the election The meaning to this is we cheated enough already and didn't need those ballots permalink parent award report block reply MAGAllDayLong 28 points 4 days ago Agreed, the prop passed 51/49 which means we all have to pay $26/year extra in property taxes.\nA) Who in their right mind would vote yes to be taxed more?!?\nB) The vote was obviously rigged because it was the same 51/49 BS percentage that  they always use. permalink parent award report block reply ThePatriotGames2016 21 points 4 days ago they've been riding on that 50/50 split bullshit for 60 years. I'm convinced if there is anything close to a 50/50 split, it's bullshit. They've been rigging since Reagan beat the shit out of them in the 80s. From HW Bush, they've been fucking with elections. They rely on the 50/50 shit so they can slide things by unnoticed. permalink parent award report block reply Friendly_B 3 points 4 days ago I remember it being 50/50 in the 80s a lot.  Late 80s early 90s. permalink parent award report block reply Nomad899 5 points 4 days ago Look up prop A in commiefornia….they raised sales tax in norcal by almost a full% permalink parent award report block reply mohel 2 points 4 days ago Nobody knows how the f**k did it happen. Vote harder. permalink parent award report block reply suckmycorona 3 points 4 days ago 51/49 everytime.  It’s an insult, I wish they would just do 90/10 to shake it up a bit. permalink parent award report block reply ListenToSavage 6 points 4 days ago How hard would you like to get punched in the balls? \"Arizona voted overwhelmingly 51 to 49, very hard.\" permalink parent award report block reply keeman 5 points 4 days ago If drugs were legal (as they were for the first 130 years of our history) there would be no such thing as a \"narco-state\".  Drug illegalization is progressivist bullshit and if we want to truly drain the swamp we need to kick it aside.  You wanna fuck yourself up with drugs that is a you thing.  The rest of us can regulate societal behavior by mocking it. permalink parent award report block reply Klown_Kutz 3 points 3 days ago Yeah no. Take this tired old Libertopian bullshit elsewhere. It will never make America great. permalink parent award report block reply Washington_Redskins 1 points 3 days ago If all drugs were completely legal methamphetamines and Fentanyl would devastate American society the same way opium did to China during the Opium Wars.Considering the million plus that have been killed by Fentanyl and meth, the USA would be justified in using nuclear weapons against the countries making the.drugs. Other countries would be reluctant to make drugs to send to America if they knew they were going to get nuked. permalink parent award report block reply BaronFalcon 2 points 3 days ago That's the same thing they said about alcohol. Take your moral legislation somewhere else. permalink parent award report block reply Washington_Redskins 1 points 3 days ago The reality of history shows otherwise. Even small amounts of legalization such as in Portland have created much worse disasters with far more deaths. Legalizing things like Fentanyl and meth doesn't help. It's not about morality it's about reality. Alcohol can also debilitate but it does not kill and devastate Society as much as Fentanyl and meth do despite what all the people who hate alcohol say. Please take your this is about legislating morality opinion elsewhere as that is absolutely not what this is about. permalink parent award report block reply\nThe_Return_of_User_x 34 points 4 days ago If the result is not the one you wish, try try again. permalink parent award report block reply mikethemarine 25 points 4 days ago the left will say there wasn't enough ballots in there to effect the outcome of the election The meaning to this is we cheated enough already and didn't need those ballots permalink parent award report block reply\nmikethemarine 25 points 4 days ago the left will say there wasn't enough ballots in there to effect the outcome of the election The meaning to this is we cheated enough already and didn't need those ballots permalink parent award report block reply\nMAGAllDayLong 28 points 4 days ago Agreed, the prop passed 51/49 which means we all have to pay $26/year extra in property taxes.\nA) Who in their right mind would vote yes to be taxed more?!?\nB) The vote was obviously rigged because it was the same 51/49 BS percentage that  they always use. permalink parent award report block reply ThePatriotGames2016 21 points 4 days ago they've been riding on that 50/50 split bullshit for 60 years. I'm convinced if there is anything close to a 50/50 split, it's bullshit. They've been rigging since Reagan beat the shit out of them in the 80s. From HW Bush, they've been fucking with elections. They rely on the 50/50 shit so they can slide things by unnoticed. permalink parent award report block reply Friendly_B 3 points 4 days ago I remember it being 50/50 in the 80s a lot.  Late 80s early 90s. permalink parent award report block reply Nomad899 5 points 4 days ago Look up prop A in commiefornia….they raised sales tax in norcal by almost a full% permalink parent award report block reply mohel 2 points 4 days ago Nobody knows how the f**k did it happen. Vote harder. permalink parent award report block reply suckmycorona 3 points 4 days ago 51/49 everytime.  It’s an insult, I wish they would just do 90/10 to shake it up a bit. permalink parent award report block reply ListenToSavage 6 points 4 days ago How hard would you like to get punched in the balls? \"Arizona voted overwhelmingly 51 to 49, very hard.\" permalink parent award report block reply\nThePatriotGames2016 21 points 4 days ago they've been riding on that 50/50 split bullshit for 60 years. I'm convinced if there is anything close to a 50/50 split, it's bullshit. They've been rigging since Reagan beat the shit out of them in the 80s. From HW Bush, they've been fucking with elections. They rely on the 50/50 shit so they can slide things by unnoticed. permalink parent award report block reply Friendly_B 3 points 4 days ago I remember it being 50/50 in the 80s a lot.  Late 80s early 90s. permalink parent award report block reply\nFriendly_B 3 points 4 days ago I remember it being 50/50 in the 80s a lot.  Late 80s early 90s. permalink parent award report block reply\nNomad899 5 points 4 days ago Look up prop A in commiefornia….they raised sales tax in norcal by almost a full% permalink parent award report block reply mohel 2 points 4 days ago Nobody knows how the f**k did it happen. Vote harder. permalink parent award report block reply\nmohel 2 points 4 days ago Nobody knows how the f**k did it happen. Vote harder. permalink parent award report block reply\nsuckmycorona 3 points 4 days ago 51/49 everytime.  It’s an insult, I wish they would just do 90/10 to shake it up a bit. permalink parent award report block reply ListenToSavage 6 points 4 days ago How hard would you like to get punched in the balls? \"Arizona voted overwhelmingly 51 to 49, very hard.\" permalink parent award report block reply\nListenToSavage 6 points 4 days ago How hard would you like to get punched in the balls? \"Arizona voted overwhelmingly 51 to 49, very hard.\" permalink parent award report block reply\nkeeman 5 points 4 days ago If drugs were legal (as they were for the first 130 years of our history) there would be no such thing as a \"narco-state\".  Drug illegalization is progressivist bullshit and if we want to truly drain the swamp we need to kick it aside.  You wanna fuck yourself up with drugs that is a you thing.  The rest of us can regulate societal behavior by mocking it. permalink parent award report block reply Klown_Kutz 3 points 3 days ago Yeah no. Take this tired old Libertopian bullshit elsewhere. It will never make America great. permalink parent award report block reply Washington_Redskins 1 points 3 days ago If all drugs were completely legal methamphetamines and Fentanyl would devastate American society the same way opium did to China during the Opium Wars.Considering the million plus that have been killed by Fentanyl and meth, the USA would be justified in using nuclear weapons against the countries making the.drugs. Other countries would be reluctant to make drugs to send to America if they knew they were going to get nuked. permalink parent award report block reply BaronFalcon 2 points 3 days ago That's the same thing they said about alcohol. Take your moral legislation somewhere else. permalink parent award report block reply Washington_Redskins 1 points 3 days ago The reality of history shows otherwise. Even small amounts of legalization such as in Portland have created much worse disasters with far more deaths. Legalizing things like Fentanyl and meth doesn't help. It's not about morality it's about reality. Alcohol can also debilitate but it does not kill and devastate Society as much as Fentanyl and meth do despite what all the people who hate alcohol say. Please take your this is about legislating morality opinion elsewhere as that is absolutely not what this is about. permalink parent award report block reply\nKlown_Kutz 3 points 3 days ago Yeah no. Take this tired old Libertopian bullshit elsewhere. It will never make America great. permalink parent award report block reply\nWashington_Redskins 1 points 3 days ago If all drugs were completely legal methamphetamines and Fentanyl would devastate American society the same way opium did to China during the Opium Wars.Considering the million plus that have been killed by Fentanyl and meth, the USA would be justified in using nuclear weapons against the countries making the.drugs. Other countries would be reluctant to make drugs to send to America if they knew they were going to get nuked. permalink parent award report block reply BaronFalcon 2 points 3 days ago That's the same thing they said about alcohol. Take your moral legislation somewhere else. permalink parent award report block reply Washington_Redskins 1 points 3 days ago The reality of history shows otherwise. Even small amounts of legalization such as in Portland have created much worse disasters with far more deaths. Legalizing things like Fentanyl and meth doesn't help. It's not about morality it's about reality. Alcohol can also debilitate but it does not kill and devastate Society as much as Fentanyl and meth do despite what all the people who hate alcohol say. Please take your this is about legislating morality opinion elsewhere as that is absolutely not what this is about. permalink parent award report block reply\nBaronFalcon 2 points 3 days ago That's the same thing they said about alcohol. Take your moral legislation somewhere else. permalink parent award report block reply Washington_Redskins 1 points 3 days ago The reality of history shows otherwise. Even small amounts of legalization such as in Portland have created much worse disasters with far more deaths. Legalizing things like Fentanyl and meth doesn't help. It's not about morality it's about reality. Alcohol can also debilitate but it does not kill and devastate Society as much as Fentanyl and meth do despite what all the people who hate alcohol say. Please take your this is about legislating morality opinion elsewhere as that is absolutely not what this is about. permalink parent award report block reply\nWashington_Redskins 1 points 3 days ago The reality of history shows otherwise. Even small amounts of legalization such as in Portland have created much worse disasters with far more deaths. Legalizing things like Fentanyl and meth doesn't help. It's not about morality it's about reality. Alcohol can also debilitate but it does not kill and devastate Society as much as Fentanyl and meth do despite what all the people who hate alcohol say. Please take your this is about legislating morality opinion elsewhere as that is absolutely not what this is about. permalink parent award report block reply\nOldZilla 49 points 4 days ago Somebody please explain why after Kari Lake pointing this shit out that nobody had done anything about these cheating fucks. I mean seriously. Arizona is the the testing grounds for stealing elections. permalink award report block reply KernalMustard 25 points 4 days ago I explained it 3 days ago. Dems have run of the house. GOP allow them. Both sides grift. So  the GOP does nothing because it would end the grift for everyone. Dems open the vault the GOP keeps it open. Everyone involved benefits. permalink parent award report block reply Nomad899 9 points 4 days ago Every Politician benefits….we tax payers get fucked again permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago It's the American way! permalink parent award report block reply mohel 0 points 4 days ago Just bend over permalink parent award report block reply keeman 6 points 4 days ago TLDR for the short attention span:  RINOS want Ds to win because it helps them. permalink parent award report block reply suckmycorona 3 points 4 days ago They’re happy with the sloppy seconds. permalink parent award report block reply mohel -1 points 4 days ago They are. permalink parent award report block reply ListenToSavage 5 points 4 days ago Paul Gosar reiterated during his '09 campaign he was only going to Washington for 1 term to \"get things  done,\" then going back to his dental profession. Well that was 15 years ago and Pauly G hasn't drilled a cavity since. permalink parent award report block reply Sgt_Hulka 1 points 3 days ago How much has his personal fortune increased? permalink parent award report block reply BaronFalcon 1 points 3 days ago Uniparty. The idea of left and right is the grift. Convincing people that there's actually left and right in DC is joke they play on us to keep us fighting. Bread and circuses, division, envy... permalink parent award report block reply XxxRDTPRNxxX 12 points 4 days ago They stole a national election in broad daylight and then told us not to believe our lying eyes. Nothing was ever done about that, even after the victim of said fraud regained full control of the military. permalink parent award report block reply julianReyes 5 points 4 days ago People here support third world elections , I can bring up hundreds of posts here trying to dunk on Lake for doing the right thing and kneeling harder than female FBI agents to Xiden. permalink parent award report block reply Washington_Redskins 2 points 3 days ago No standing. Judges have become a plague on America... we need to find a better system and fire every single judge.. and legally prosecute all the ones who are working with the leftist for political gain permalink parent award report block reply\nKernalMustard 25 points 4 days ago I explained it 3 days ago. Dems have run of the house. GOP allow them. Both sides grift. So  the GOP does nothing because it would end the grift for everyone. Dems open the vault the GOP keeps it open. Everyone involved benefits. permalink parent award report block reply Nomad899 9 points 4 days ago Every Politician benefits….we tax payers get fucked again permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago It's the American way! permalink parent award report block reply mohel 0 points 4 days ago Just bend over permalink parent award report block reply keeman 6 points 4 days ago TLDR for the short attention span:  RINOS want Ds to win because it helps them. permalink parent award report block reply suckmycorona 3 points 4 days ago They’re happy with the sloppy seconds. permalink parent award report block reply mohel -1 points 4 days ago They are. permalink parent award report block reply ListenToSavage 5 points 4 days ago Paul Gosar reiterated during his '09 campaign he was only going to Washington for 1 term to \"get things  done,\" then going back to his dental profession. Well that was 15 years ago and Pauly G hasn't drilled a cavity since. permalink parent award report block reply Sgt_Hulka 1 points 3 days ago How much has his personal fortune increased? permalink parent award report block reply BaronFalcon 1 points 3 days ago Uniparty. The idea of left and right is the grift. Convincing people that there's actually left and right in DC is joke they play on us to keep us fighting. Bread and circuses, division, envy... permalink parent award report block reply\nNomad899 9 points 4 days ago Every Politician benefits….we tax payers get fucked again permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago It's the American way! permalink parent award report block reply mohel 0 points 4 days ago Just bend over permalink parent award report block reply\nHeavyMetalPatriot 2 points 4 days ago It's the American way! permalink parent award report block reply mohel 0 points 4 days ago Just bend over permalink parent award report block reply\nmohel 0 points 4 days ago Just bend over permalink parent award report block reply\nkeeman 6 points 4 days ago TLDR for the short attention span:  RINOS want Ds to win because it helps them. permalink parent award report block reply suckmycorona 3 points 4 days ago They’re happy with the sloppy seconds. permalink parent award report block reply mohel -1 points 4 days ago They are. permalink parent award report block reply\nsuckmycorona 3 points 4 days ago They’re happy with the sloppy seconds. permalink parent award report block reply mohel -1 points 4 days ago They are. permalink parent award report block reply\nmohel -1 points 4 days ago They are. permalink parent award report block reply\nListenToSavage 5 points 4 days ago Paul Gosar reiterated during his '09 campaign he was only going to Washington for 1 term to \"get things  done,\" then going back to his dental profession. Well that was 15 years ago and Pauly G hasn't drilled a cavity since. permalink parent award report block reply Sgt_Hulka 1 points 3 days ago How much has his personal fortune increased? permalink parent award report block reply\nSgt_Hulka 1 points 3 days ago How much has his personal fortune increased? permalink parent award report block reply\nBaronFalcon 1 points 3 days ago Uniparty. The idea of left and right is the grift. Convincing people that there's actually left and right in DC is joke they play on us to keep us fighting. Bread and circuses, division, envy... permalink parent award report block reply\nXxxRDTPRNxxX 12 points 4 days ago They stole a national election in broad daylight and then told us not to believe our lying eyes. Nothing was ever done about that, even after the victim of said fraud regained full control of the military. permalink parent award report block reply\njulianReyes 5 points 4 days ago People here support third world elections , I can bring up hundreds of posts here trying to dunk on Lake for doing the right thing and kneeling harder than female FBI agents to Xiden. permalink parent award report block reply\nWashington_Redskins 2 points 3 days ago No standing. Judges have become a plague on America... we need to find a better system and fire every single judge.. and legally prosecute all the ones who are working with the leftist for political gain permalink parent award report block reply\nItsFunToSay-M-A-G-A 27 points 4 days ago \"Generated with AI, which can make mistakes\" The news article or the election results??? permalink award report block reply LogicCircuits 12 points 4 days ago That refers to the article summary blurb permalink parent award report block reply Hanging_Chad 7 points 4 days ago DominionAI™ permalink parent award report block reply keeman 4 points 4 days ago Both.  AI mistakes are because it has no idea what it is talking about and just continues sentences in ways which are like other things it has been trained with.  Election results are more sinister. permalink parent award report block reply\nLogicCircuits 12 points 4 days ago That refers to the article summary blurb permalink parent award report block reply\nHanging_Chad 7 points 4 days ago DominionAI™ permalink parent award report block reply\nkeeman 4 points 4 days ago Both.  AI mistakes are because it has no idea what it is talking about and just continues sentences in ways which are like other things it has been trained with.  Election results are more sinister. permalink parent award report block reply\npatrioticwinning3 24 points 4 days ago Zero riggers arrested = zero incentive not to rig! permalink award report block reply Hanging_Chad 12 points 4 days ago all riggers arrested = no more rigging permalink parent award report block reply guywholikesDjtof2024 6 points 4 days ago scam ponzi, kash, bongino fired and only J6'ers hired = no more deepstate permalink parent award report block reply Hanging_Chad 4 points 4 days ago is Bongino gonna resign? permalink parent award report block reply Sgt_Hulka 3 points 3 days ago Love to know what they have on him Ive never liked that blockhead. permalink parent award report block reply the-new-style 2 points 3 days ago Total Rigger Death permalink parent award report block reply\nHanging_Chad 12 points 4 days ago all riggers arrested = no more rigging permalink parent award report block reply guywholikesDjtof2024 6 points 4 days ago scam ponzi, kash, bongino fired and only J6'ers hired = no more deepstate permalink parent award report block reply Hanging_Chad 4 points 4 days ago is Bongino gonna resign? permalink parent award report block reply Sgt_Hulka 3 points 3 days ago Love to know what they have on him Ive never liked that blockhead. permalink parent award report block reply the-new-style 2 points 3 days ago Total Rigger Death permalink parent award report block reply\nguywholikesDjtof2024 6 points 4 days ago scam ponzi, kash, bongino fired and only J6'ers hired = no more deepstate permalink parent award report block reply Hanging_Chad 4 points 4 days ago is Bongino gonna resign? permalink parent award report block reply Sgt_Hulka 3 points 3 days ago Love to know what they have on him Ive never liked that blockhead. permalink parent award report block reply\nHanging_Chad 4 points 4 days ago is Bongino gonna resign? permalink parent award report block reply Sgt_Hulka 3 points 3 days ago Love to know what they have on him Ive never liked that blockhead. permalink parent award report block reply\nSgt_Hulka 3 points 3 days ago Love to know what they have on him Ive never liked that blockhead. permalink parent award report block reply\nthe-new-style 2 points 3 days ago Total Rigger Death permalink parent award report block reply\nMarianasoctober 7 points 4 days ago And 99.9% will be pro dem. Statistically impossible but it will be. permalink award report block reply\nDrewniverse 6 points 4 days ago \"Jennier Lier\" Makes sense. permalink award report block reply TruthWillOut 2 points 3 days ago Indeed! permalink parent award report block reply PhantomShield72 2 points 3 days ago Quanell Rigger agrees with Jennifer Lier - nothing to see here! permalink parent award report block reply\nTruthWillOut 2 points 3 days ago Indeed! permalink parent award report block reply\nPhantomShield72 2 points 3 days ago Quanell Rigger agrees with Jennifer Lier - nothing to see here! permalink parent award report block reply\nMagaJay02 6 points 4 days ago Um. An \"accident\" like this should be illegal in nature. Similar to malpractice at least permalink award report block reply\nHikedelics 5 points 4 days ago The saddest thing about this is that I even have to ask “which election?” permalink award report block reply\nmaggiemay 3 points 3 days ago Why would anyone put full bins of ballots INTO a drop box? What kind of idiot would make an error like that? It's not even plausible.  The excuse is lamer than the admission. permalink award report block reply\nlefty295 3 points 4 days ago Not saying you’re a lier, but I’m not saying you’re a truther either. permalink award report block reply\nWashington_Redskins 2 points 3 days ago We all might have several thousand totes that are full of ballots that we found and should send to Maricopa County that are just as a legitimate permalink award report block reply\nMAGA-Fett 2 points 3 days ago My dad works in the Maricopa County elections. He says the US Post Office sent back many boxes of ballots from houses that the voter no longer lives there. Probably something near 250k ballots. The whole process is so broken for this dumb “all mail in ballot” election. permalink award report block reply Steve56775 1 points 3 days ago If you want to vote multiple times in Nevada just go to any apartment complex when ballots are mailed. The community mailboxes are littered with them. Collect as many as you want and mail them in. Make sure all the illegals get handful. permalink parent award report block reply\nSteve56775 1 points 3 days ago If you want to vote multiple times in Nevada just go to any apartment complex when ballots are mailed. The community mailboxes are littered with them. Collect as many as you want and mail them in. Make sure all the illegals get handful. permalink parent award report block reply\njoesfbi 2 points 4 days ago Every time I think about moving to Arizona, Maricopa County reminds why its a bad idea. permalink award report block reply\nRosebud4Jesus 2 points 4 days ago Has Trump put anyone in charge of Elections and Election Fraud?\nTo clean voter rolls, etc.  He needs someone who is MAGA and believes the 2020 election was stolen. permalink award report block reply\nRexCollumSilvarum 1 points 4 days ago The Deputy Elections Director is named Jennifer... Lier ? The jokes write themselves with these people. permalink award report block reply\nThisIsHowItStarts 1 points 4 days ago Tabulated = we will cheat permalink award report block reply\nNZbacon 1 points 3 days ago We hear about that place far too often! permalink award report block reply\nseattlerunner 1 points 4 days ago What will be done about it? permalink award report block reply\nYT45 1 points 4 days ago And the current lead margin is…? permalink award report block reply MAGAllDayLong 3 points 4 days ago 51/49 like they always use to cheat. Thankfully only a prop we were voting on. Still infuriating. permalink parent award report block reply\nMAGAllDayLong 3 points 4 days ago 51/49 like they always use to cheat. Thankfully only a prop we were voting on. Still infuriating. permalink parent award report block reply\nBeholdaPaleHorse 1 points 4 days ago Of course her name is Lier permalink award report block reply\nThePatriotGames2016 1 points 4 days ago amazing how something always goes wrong there. permalink award report block reply\nthevagabond 1 points 3 days ago two more weeks guys....just hear me out... permalink award report block reply\nMAGALADON9 1 points 3 days ago \" Generated by A.I. which can make mistakes\" Ok permalink award report block reply\nRiehlpissed 1 points 3 days ago Tie Jen upside down to a post and feed her Xlax permalink award report block reply\nTwitter 1 points 4 days ago do your job you dumb blonde bitch permalink award report block reply\nDarkpoisonousshaddow 1 points 4 days ago Still waiting for trump to sort this out. I'll be retired before it ends up on Bondi's desk and dead before it gets passed on to Kash. permalink award report block reply\nTexasBrowncoat 1 points 3 days ago Jail time is not punishment enough for this crap. Necktie Justice is the only way to stop this from happening. permalink award report block reply\nHanging_Chad 1 points 4 days ago no standing permalink award report block reply\nSimaYi 0 points 4 days ago Voting is fake and gay. permalink award report block reply\nSugz_Da_Feefth -2 points 4 days ago Too late. Faux already called it. permalink award report block reply",
  "fetched_at": "2025-11-12T21:15:44.179119Z"
}