{
  "id": "1ARK9hi029",
  "url": "https://patriots.win/p/1ARK9hi029/the-clinton-foundation/c",
  "content": "488 The. Clinton. Foundation. ☠️ ROT IN HELL ☠️ posted 2 days ago by blue5707 7 comments award share report block Wall Street Mav @WallStreetMav • 3d Military funding lapsed and a Republican mega-donor wrote a $100 million+ check to fund one pay period for the entire military. SNAP benefits lapsed and not a single Democrat has offered to fund the program for any length of time.\n7 comments Sort by Top Top New Worst Old Save JohnLedoe 5 points 2 days ago Well, of course they didn't.  They're only good at taking other people's money, not giving their own. permalink award report block reply realPixelDust 3 points 2 days ago 115 billion dollars a year - and that was only in 2023, it is higher now - I do not think anyone could have done what Timothy Mellon did for the military, for snap. You are talking like 15+ billion for one month. No one can donate that. No one has that kind of cash on-hand. WSM x account is increasingly retarded & am starting to think it is run by a pajeet. permalink award report block reply Oodles 3 points 2 days ago Because SNAP actually funds Democrats Not just the deadbeats that you think it does, but at least 154 Democratic lawmakers or their fundraising organizations accepted contributions from a handful of top food companies during the last campaign cycle. That includes 51 congressional Democrats – one in five – who have done so while publicly blasting corporate greed in the food industry. permalink award report block reply rebuildingMyself 3 points 2 days ago Democrats only virtue signal with someone else's money permalink award report block reply Smurfection 2 points 2 days ago That should tell you everything you need to know about how \"compassionate\" Democrats actually are.  The Democrats do not care about the poor and oppressed.  They use them for political narratives to attack Republicans, not because they actually want to do right by them. permalink award report block reply PatriotDescendant 2 points 2 days ago Love what the guy did, but remember, it was merely an interest free loan that will now be repaid in full. Doesn't diminish the fundamental honor just flat out badassness of the act! permalink award report block reply\nJohnLedoe 5 points 2 days ago Well, of course they didn't.  They're only good at taking other people's money, not giving their own. permalink award report block reply\nrealPixelDust 3 points 2 days ago 115 billion dollars a year - and that was only in 2023, it is higher now - I do not think anyone could have done what Timothy Mellon did for the military, for snap. You are talking like 15+ billion for one month. No one can donate that. No one has that kind of cash on-hand. WSM x account is increasingly retarded & am starting to think it is run by a pajeet. permalink award report block reply\nOodles 3 points 2 days ago Because SNAP actually funds Democrats Not just the deadbeats that you think it does, but at least 154 Democratic lawmakers or their fundraising organizations accepted contributions from a handful of top food companies during the last campaign cycle. That includes 51 congressional Democrats – one in five – who have done so while publicly blasting corporate greed in the food industry. permalink award report block reply\nrebuildingMyself 3 points 2 days ago Democrats only virtue signal with someone else's money permalink award report block reply\nSmurfection 2 points 2 days ago That should tell you everything you need to know about how \"compassionate\" Democrats actually are.  The Democrats do not care about the poor and oppressed.  They use them for political narratives to attack Republicans, not because they actually want to do right by them. permalink award report block reply\nPatriotDescendant 2 points 2 days ago Love what the guy did, but remember, it was merely an interest free loan that will now be repaid in full. Doesn't diminish the fundamental honor just flat out badassness of the act! permalink award report block reply",
  "fetched_at": "2025-11-12T20:51:18.013024Z"
}