{
  "id": "1ARK54TroE",
  "url": "https://patriots.win/p/1ARK54TroE/trump-should-pass-an-eo-stating-/c",
  "content": "298 Trump should pass an EO stating anyone who shoplifts or robs while on benefits loses those benefits posted 5 days ago by MasterChief08 12 comments award share report block Let's rip these people apart. Imagine how many millions of people would start to behave a little bit better\n12 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style CleanUpPhillyTrump24 10 points 5 days ago Shoplifting would disappear. Gangsta Kulcha would vanish as moms started punishing kids who did anything that risked their bennies. Gibs protection would cause broad social enforcement of shutting down anyone trying to commit a crime, if everyone at that address was PERMABANNED from all gov handouts unless a senior, truly disabled, or a vet in need. Lifetime ban all handouts. Easy to cross reference databases of arrests records with SNAP or Vouchers, public housing, etc. permalink award report block reply imnotdeadyet 3 points 5 days ago It won't happen because these people are never charged.  The employees are told \"let them steal\" don't intervene.  They do not call the police either.  They have to start arresting and charging them before they could roll out a plan like this. permalink parent award report block reply MasterChief08 OP 4 points 5 days ago Then red and purple areas of the country will see even less crime and Democrat cities will remain crap. It would also push back urban expansion. Doing nothing because Democrats don't enforce the law in their rat infested hives is retarded. Trump is a moderate. Younger conservatives are thankfully becoming more extreme towards the right. Eventually there will come a day when the Republican base demands actual far right policies like locking up the left. permalink parent award report block reply DickTick PRO 3 points 5 days ago Maybe in your state lol In my state you'll be lucky to not get tackled at the door by employees of most companies. Only the corporations that require them to let them go won't and even then most of them will chase you and get your tag or try to get the police there before you actually get away and you will most definitely get charged and convicted for it here permalink parent award report block reply mikethemarine 1 points 5 days ago you mean they will get taught what it's like to live UNDER government rule, instead of making your own money permalink parent award report block reply Transparency 1 points 5 days ago Shoplifting would disappear. Nah. WHO would enforce it? Nobody. That's all part of WHY this country is circling the drain... and has been. If Trump doesn't get this sorted out- We're Fucked! permalink parent award report block reply Formerlurker92 4 points 5 days ago Watch a judge dismiss camera evidence as organized racism or some shit to get thieves back on permalink award report block reply DickTick PRO 4 points 5 days ago I don't even see how that would be controversial God I would love to hear the Democrats mental gymnastics arguing against that one permalink award report block reply anotherthing 3 points 5 days ago Damn, imagine if we made crimes have consequences. Then no one would break the law. Right? That's not how this works. If your reasoning was that we'd save money, that would make more sense. I'd also add in that if you can't feed your kids, you probably shouldn't be their primary guardian. permalink award report block reply Old_Timer 1 points 5 days ago I’m sold. permalink award report block reply Nomad899 1 points 5 days ago Hawaiian judge mandates doubling it permalink award report block reply starjello 0 points 5 days ago Obama judges overrules in less than 12 hours permalink award report block reply\nCleanUpPhillyTrump24 10 points 5 days ago Shoplifting would disappear. Gangsta Kulcha would vanish as moms started punishing kids who did anything that risked their bennies. Gibs protection would cause broad social enforcement of shutting down anyone trying to commit a crime, if everyone at that address was PERMABANNED from all gov handouts unless a senior, truly disabled, or a vet in need. Lifetime ban all handouts. Easy to cross reference databases of arrests records with SNAP or Vouchers, public housing, etc. permalink award report block reply imnotdeadyet 3 points 5 days ago It won't happen because these people are never charged.  The employees are told \"let them steal\" don't intervene.  They do not call the police either.  They have to start arresting and charging them before they could roll out a plan like this. permalink parent award report block reply MasterChief08 OP 4 points 5 days ago Then red and purple areas of the country will see even less crime and Democrat cities will remain crap. It would also push back urban expansion. Doing nothing because Democrats don't enforce the law in their rat infested hives is retarded. Trump is a moderate. Younger conservatives are thankfully becoming more extreme towards the right. Eventually there will come a day when the Republican base demands actual far right policies like locking up the left. permalink parent award report block reply DickTick PRO 3 points 5 days ago Maybe in your state lol In my state you'll be lucky to not get tackled at the door by employees of most companies. Only the corporations that require them to let them go won't and even then most of them will chase you and get your tag or try to get the police there before you actually get away and you will most definitely get charged and convicted for it here permalink parent award report block reply mikethemarine 1 points 5 days ago you mean they will get taught what it's like to live UNDER government rule, instead of making your own money permalink parent award report block reply Transparency 1 points 5 days ago Shoplifting would disappear. Nah. WHO would enforce it? Nobody. That's all part of WHY this country is circling the drain... and has been. If Trump doesn't get this sorted out- We're Fucked! permalink parent award report block reply\nimnotdeadyet 3 points 5 days ago It won't happen because these people are never charged.  The employees are told \"let them steal\" don't intervene.  They do not call the police either.  They have to start arresting and charging them before they could roll out a plan like this. permalink parent award report block reply MasterChief08 OP 4 points 5 days ago Then red and purple areas of the country will see even less crime and Democrat cities will remain crap. It would also push back urban expansion. Doing nothing because Democrats don't enforce the law in their rat infested hives is retarded. Trump is a moderate. Younger conservatives are thankfully becoming more extreme towards the right. Eventually there will come a day when the Republican base demands actual far right policies like locking up the left. permalink parent award report block reply DickTick PRO 3 points 5 days ago Maybe in your state lol In my state you'll be lucky to not get tackled at the door by employees of most companies. Only the corporations that require them to let them go won't and even then most of them will chase you and get your tag or try to get the police there before you actually get away and you will most definitely get charged and convicted for it here permalink parent award report block reply\nMasterChief08 OP 4 points 5 days ago Then red and purple areas of the country will see even less crime and Democrat cities will remain crap. It would also push back urban expansion. Doing nothing because Democrats don't enforce the law in their rat infested hives is retarded. Trump is a moderate. Younger conservatives are thankfully becoming more extreme towards the right. Eventually there will come a day when the Republican base demands actual far right policies like locking up the left. permalink parent award report block reply\nDickTick PRO 3 points 5 days ago Maybe in your state lol In my state you'll be lucky to not get tackled at the door by employees of most companies. Only the corporations that require them to let them go won't and even then most of them will chase you and get your tag or try to get the police there before you actually get away and you will most definitely get charged and convicted for it here permalink parent award report block reply\nmikethemarine 1 points 5 days ago you mean they will get taught what it's like to live UNDER government rule, instead of making your own money permalink parent award report block reply\nTransparency 1 points 5 days ago Shoplifting would disappear. Nah. WHO would enforce it? Nobody. That's all part of WHY this country is circling the drain... and has been. If Trump doesn't get this sorted out- We're Fucked! permalink parent award report block reply\nFormerlurker92 4 points 5 days ago Watch a judge dismiss camera evidence as organized racism or some shit to get thieves back on permalink award report block reply\nDickTick PRO 4 points 5 days ago I don't even see how that would be controversial God I would love to hear the Democrats mental gymnastics arguing against that one permalink award report block reply\nanotherthing 3 points 5 days ago Damn, imagine if we made crimes have consequences. Then no one would break the law. Right? That's not how this works. If your reasoning was that we'd save money, that would make more sense. I'd also add in that if you can't feed your kids, you probably shouldn't be their primary guardian. permalink award report block reply\nOld_Timer 1 points 5 days ago I’m sold. permalink award report block reply\nNomad899 1 points 5 days ago Hawaiian judge mandates doubling it permalink award report block reply\nstarjello 0 points 5 days ago Obama judges overrules in less than 12 hours permalink award report block reply",
  "fetched_at": "2025-11-12T21:08:13.763765Z"
}