{
  "id": "1ARK53JY94",
  "url": "https://patriots.win/p/1ARK53JY94/chp-we-were-told-from-the-top-no/c",
  "content": "244 CHP: We were told “From the top” not to enforce English Proficiency.\n\nAlso CHP: It’s too dangerous for us to inspect these trucks.\n\nIf it’s too dangerous to inspect the truck, that truck and its driver are too dangerous to be out on the road period. posted 6 days ago by PiratePatriotParrot 7 comments award share report block SuperTrucker 🚛💨→💻🥷 @supertrucker • 20d CHP: We were told “From the top” not to enforce English Proficiency. Also CHP: It’s too dangerous for us to inspect these trucks. If it’s too dangerous to inspect the truck, that truck and its driver are too dangerous to be out on the road period.\n7 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Madnote1984 10 points 6 days ago Level 1 inspection requires the trooper to get out a creeper abd go under the truck to check brakes/slack adjusters. This puts the trooper in a very vulnerable position, and you can only have this in a high trust society. What they mean by too dangerous, is the illegal drivers can't be trusted to not run them over, or get out and kill them while they are focused on checking the equipment, unless they operate in teams and they probably don't have the manpower for that. permalink award report block reply edxzxz 3 points 6 days ago Funny, they had the manpower to enforce face diapers and social distancing bullshit?  I was also told 'just following orders' hasn't been an excuse to engage in dangerous illegal acts since they hung the Nazis at Nuremberg? permalink parent award report block reply Trump454748 2 points 5 days ago Yeah, this is why l don’t have any respect for cops anymore because they just follow orders and they make some serious cash in the CHP. permalink parent award report block reply OpusX 8 points 6 days ago Anyone remember the name George Ryan? All it took was a single fatal crash from an illegal CDL to bring him down and land him in federal prison. It was a national scandal. Now whenever innocent people are killed by illegal CDLs everyone just shrugs their shoulders and carries on business as usual. How far we've fallen. permalink award report block reply Trump454748 3 points 5 days ago No shit, if they could send that scumbag to prison, they could certainly do it to Newsome but at this point, you’ll get in more trouble over a parking ticket than he will of allowing people to outright be killed. permalink parent award report block reply LaptopDied 4 points 6 days ago Trucking is the lifeblood. permalink award report block reply ltbadpuppy 3 points 6 days ago What a fucking joke. If they dont follow instructions you arrest them. Touch the keys during an inspection despite clear warnings should result in an arrest. Instead they let the assholes get their way permalink award report block reply\nMadnote1984 10 points 6 days ago Level 1 inspection requires the trooper to get out a creeper abd go under the truck to check brakes/slack adjusters. This puts the trooper in a very vulnerable position, and you can only have this in a high trust society. What they mean by too dangerous, is the illegal drivers can't be trusted to not run them over, or get out and kill them while they are focused on checking the equipment, unless they operate in teams and they probably don't have the manpower for that. permalink award report block reply edxzxz 3 points 6 days ago Funny, they had the manpower to enforce face diapers and social distancing bullshit?  I was also told 'just following orders' hasn't been an excuse to engage in dangerous illegal acts since they hung the Nazis at Nuremberg? permalink parent award report block reply Trump454748 2 points 5 days ago Yeah, this is why l don’t have any respect for cops anymore because they just follow orders and they make some serious cash in the CHP. permalink parent award report block reply\nedxzxz 3 points 6 days ago Funny, they had the manpower to enforce face diapers and social distancing bullshit?  I was also told 'just following orders' hasn't been an excuse to engage in dangerous illegal acts since they hung the Nazis at Nuremberg? permalink parent award report block reply Trump454748 2 points 5 days ago Yeah, this is why l don’t have any respect for cops anymore because they just follow orders and they make some serious cash in the CHP. permalink parent award report block reply\nTrump454748 2 points 5 days ago Yeah, this is why l don’t have any respect for cops anymore because they just follow orders and they make some serious cash in the CHP. permalink parent award report block reply\nOpusX 8 points 6 days ago Anyone remember the name George Ryan? All it took was a single fatal crash from an illegal CDL to bring him down and land him in federal prison. It was a national scandal. Now whenever innocent people are killed by illegal CDLs everyone just shrugs their shoulders and carries on business as usual. How far we've fallen. permalink award report block reply Trump454748 3 points 5 days ago No shit, if they could send that scumbag to prison, they could certainly do it to Newsome but at this point, you’ll get in more trouble over a parking ticket than he will of allowing people to outright be killed. permalink parent award report block reply\nTrump454748 3 points 5 days ago No shit, if they could send that scumbag to prison, they could certainly do it to Newsome but at this point, you’ll get in more trouble over a parking ticket than he will of allowing people to outright be killed. permalink parent award report block reply\nLaptopDied 4 points 6 days ago Trucking is the lifeblood. permalink award report block reply\nltbadpuppy 3 points 6 days ago What a fucking joke. If they dont follow instructions you arrest them. Touch the keys during an inspection despite clear warnings should result in an arrest. Instead they let the assholes get their way permalink award report block reply",
  "fetched_at": "2025-11-12T21:20:38.327388Z"
}