{
  "id": "8169196",
  "title": "1440🔴PRESIDENT TRUMP: \"Walmart just announced that prices for a Thanksgiving Dinner is now down 25%\"",
  "url": "https://patriots.win/p/1ARK0Ub4vW/president-trump-walmart-just-ann/c",
  "content": "1440 🔴PRESIDENT TRUMP: \"Walmart just announced that prices for a Thanksgiving Dinner is now down 25%\"\n\n\"AFFORDABILITY is a Republican stronghold. Hopefully, Republicans will use this irrefutable fact!\" TRUMP  TRUTH posted 7 days ago by DeusVult1096 225 comments award share download report block\n225 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style LegendFang 70 points 7 days ago Lovely, if true. permalink award report block reply SquiggyMcPepe 67 points 7 days ago Yes its true. But. It's still 50~75% more expensive than it was pre covid. They really fucked us with that one and since it was a global disruption there really isn't much Trump can do to expedite a return to those price levels. Gradual decrease is the best we will see for a while yet possibly a decade. permalink parent award report block reply dr_gonzo 20 points 7 days ago No this is absolutely NOT true. We must do what happened in the 80s and create massive economic growth to make wages outpace what was lost to inflation. So what must be done to accomplish that? Well that's where we have problems because the Republicans no longer stand for liberty-centric economic policy, but if you did these 4 things, you would almost immediately see the 10% growth rates of the 19th century return: End the federal reserve and put us back on the gold standard to restrict future government spending and slam the brakes on inflation ELIMINATE socialist social welfare programs. That would include Medicare, Medicaid, Social Security and especially WELFARE. Congrats, you just saved 4.6 trillion a year in federal spending RE-abolish our progressive income tax. With this one, the 50% of Americans that actually pay income taxes after credits and deductions, just got a very significant raise which is what would encourage the economic growth Eliminate 90% of the fascistic regulatory state that was never supposed to exist in the first place and imposes 80,000 pages of regulations on Americans conducting business. That now consists of 2.5 MILLION bureaucrats. That number should be less than 100k when you're done If you do those 4 things, we return to the economy we THRIVED under for well over a century and produced the largest economic explosion in world history. In just 4 years time our GDP would go from 27 trillion to over 40 trillion. That's a 60k raise for every American, assuming it was distributed equally which admittedly wouldn't happen, but it gives you an idea of how much wealth is being lost to socialist bullshit. And all we need to do is return to our liberty-centric economic roots. permalink parent award report block reply DatTrumpDoh 7 points 7 days ago That second bullet is DOA. Even many conservative voters are against repealing those programs. permalink parent award report block reply ImportantPerson 5 points 7 days ago It's DOA because any moron that suggests getting rid of all social programs entirely is a fucking moron that doesn't understand the impact of why these programs exist in the first place.  Our GDP would not by skyrocketing because of this and ignorantly looking solely at translating the cost into deficit reduction is just bafflingly wrong. permalink parent award report block reply Glory-Unto-God 1 points 7 days ago Would take a dictator to get it done. People will eventually have to come to terms with the choices Benevolent dictator who loves his people. Or daughters raped in the street. That hill is rapidly approaching. permalink parent award report block reply doomerglowie2 2 points 6 days ago How does your 4 economic things help our greatest ally and other foreign powers that own our Government? Asking for a supervisor. permalink parent award report block reply HOSEQ 1 points 6 days ago Well, First you have to (S)Elect a Muslim for Mayor of the Money Capitol of the World, see??? Then you.... permalink parent award report block reply Damadhatter 1 points 6 days ago First bullet point - while it would be really cool in some ways, would destroy the USD and the revolt world wide would be too eliminate the USD as the monetary trade standard. There's too many dollars out there at this point and not enough gold to cover a gold standard and maintain the global currency status. That global standing has been what has insulated the USD since we left the GS and we're too far gone from it at this point to return. permalink parent award report block reply Tmntnyc 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. Never. Boeing CEO just testified last year in Congress and admitted he got a 45% raise last year (38 million). The 500 machinists at Boeing  saw a 1% raise over 8 years. The wealth never trickles down automatically. You have to fight for it with unions or labor regulations or we would be paid in fucking scrips if they could permalink parent award report block reply anotherthing 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. It trickles down to the shareholders. It's the reason your retirement account just keeps on growing. permalink parent award report block reply view 3 more comments... dunkeaters 8 points 7 days ago With an expanding money supply it isn't possible to return to pre covid prices. The goal is to grow the real economy (wages vs. inflation) so that consumer prices return to the same relative proportion of income they used to be. permalink parent award report block reply SquiggyMcPepe 3 points 7 days ago Oh we will never see a complete return of course. But corporate margins are thick and there is plenty of room to narrow them if the proper 'incentives' are applied. One of the main tools will be to abolish the lobby. Completely. The main reason corps have grown out of control is because they bought the people who make the rules and laws and turned them in their favor. permalink parent award report block reply CJ74U2NV 7 points 7 days ago Those prices are inflationary adjustments to the Democrats living wage mantra. Every piece of crap unskilled worker is now making a lot of money. Because of that, the costs are passed along to the consumer. Then the Democrats will cry. We need more livable wage increases which will in turn drive prices up even further. After while, the economy collapses and you going to a depression. But that's what Democrats want. So they can have the government take everything over. It will make FDRs new deal look like mother Gooseland. permalink parent award report block reply flashersenpai 8 points 7 days ago Every piece of crap unskilled worker is now making a lot of money. they aren't, and lovely of you to describe them as pieces of crap. loser country club republican in action permalink parent award report block reply EDDIT_IS_CUCKED 2 points 7 days ago All of the people that work at fast food establishments are hired on making more money than I did out of college with a STEM degree 15 years ago. So yes, they are making a shitload of money, actually. Unless your argument is that these are skilled workers. If that's the case, we have a wildly different opinion of the term. permalink parent award report block reply view 5 more comments... Hanging_Chad 2 points 7 days ago have you seen government workers lately? permalink parent award report block reply Isolated_Patriot 4 points 7 days ago since it was a global disruption It's not the global disruption that is the problem, it's the number of US of A dollars printed in that time. Inflation WILL NOT DISAPPEAR. It's not going to magically revert to the number of dollars that existed pre-covid unless someone starts incinerating them. A strong economy that starts paying wages to supplement the difference is the ONLY solution to counter the inflation that isn't outright magical. Until people understand this, they are going to continue to yell at clouds about how \"Trump hasn't fixed anything yet!!!!\" permalink parent award report block reply bigbadchows2 4 points 7 days ago Been seeing Buter ball for .99 a pound. We actually did Prime Rib last year due to Turkey being over 2 a pound. I had purchased several who 13 bone prime rib for 5 a pound and the boys and I preferred it to Turkey. This year we got a Turkey, I hope day after Ham roasts are cheap my dogs always get a full ham for major holidays. However, I will never see the .49 a pound I paid 2019, I switched to pork loin, they don't really gaf what the get. I do agree, Trump has limited tools on reducing prices, we did however have some price leveling after the zirp o8-12 inflation. Not holding my breath but we are doing well on gas, so maybe in time it will freeze or come down a point or 2. permalink parent award report block reply Granny 4 points 7 days ago Yes I'm getting a butterball for.99¢ a pound. Last year was $1.19/lb. permalink parent award report block reply bigbadchows2 2 points 6 days ago Was almost 2 where I live and in 1 store it was working on 3. 1.19 is 20%, but nothing to get excited about. permalink parent award report block reply SquiggyMcPepe 2 points 7 days ago Meat is still fairly easy to get on the cheap and if you vacuum seal it before freezing you can load up during a particularly deep sale and have meat for months or even years. As a test I took a store bought vacuum sealed pork loin and let it set at the bottom of the freezer for three years. Thawed it and made a roast and it was just as fresh and tender as it would have been had I made it the day I bought it. permalink parent award report block reply CJ74U2NV 2 points 7 days ago Or from a local butcher. You'll get better quality, a cheaper price, and you're supporting local businesses. The meat is definitely not purchased from overseas. permalink parent award report block reply load 7 more comments... BigMikesChef 26 points 7 days ago I have seen no improvement in any bills or expenses at all. permalink parent award report block reply mikejones 19 points 7 days ago Cell phone, Internet, energy, rent, insurance. All goes up. Food eating out goes up. Car repairs, daily items from the store. Not sure what is going down. Maybe some food on sale. permalink parent award report block reply DoYouLikeFishsticks 14 points 7 days ago Everything is going up and never going to go down as far as I’m concerned permalink parent award report block reply geekesmind 4 points 7 days ago yep went to pay rent today got told now 7.99 service charge to pay it. WTF permalink parent award report block reply chickeninoven 2 points 7 days ago hand out with finger pointing into palm permalink parent award report block reply ImportantPerson 1 points 7 days ago I just paid $3.50 for a pound of ground beef.  That's the lowest it's been in a decade.  Eggs are back to being one of the cheapest healthy meal you can buy.  Chicken has been stable even throughout COVID. The only people who aren't seeing any changes are people buying marketing, not products.  The \"grass fed\" beef isn't going to go down in price.  The organic whatever is not going down in price.  These products are targeting the stupid and ignorant. If you aren't seeing any changes, then go to a different grocery store because you are getting screwed where you are going now. permalink parent award report block reply The_Nowhere_Man 1 points 7 days ago All of them in my town and the town next to mine are within a few pennies of each other on meat prices. Lower than it was right after 2020 but far from being brag worthy. Pound of the cheap hamburger is like $6-something. I go to the local butcher instead and get it for $4-something a pound. permalink parent award report block reply NotYourMan 7 points 7 days ago Food inflation is bad right now.  Remember in 2021 democrats printed $5 trillion dollars and the \"fake\" Inflation Reduction Act.  Both of these caused a 20% increase in food cost accumulative.  But the real inflation is over 45% because of energy and housing.  Trump is fixing the energy but the food prices are staying around.  Remember when democrats decided to shutdown \"the supply chain\" for six months to one year.  That also caused a delayed increase in food cost that we are suffering from now.  ITS THE DEMOCRATS FAULT. permalink parent award report block reply Bythrfruitsyknow 3 points 7 days ago Good job the Republicans got back in office and immediately cut the trillion dollar deficits, amirite? permalink parent award report block reply PitfallHarry 3 points 7 days ago It is true. Trump has said that gas and grocery prices are down so they are. End of story. permalink parent award report block reply load 16 more comments... For_All_Mankind 59 points 7 days ago Delusional. Dude hasn’t shopped for food a day in his life. And he can afford any thing he wants. Prices are not down at grocery stores. permalink award report block reply KrakenWakin4JoeBacon 25 points 7 days ago Yeah, not gonna lie… it rubs me the wrong way when he brags about the greatly improved affordability at the grocery store. It’s not about butter being 25 cents less expensive than it was a year ago. No one gives a shit about paying 25 cents more or less for a single item. It’s about the cumulative cost of the 30 items in my grocery cart, and the fact I’ll fill up my cart with 30+ items that I need to purchase not once per month but multiple times per month. So it’s about the reality that grocery shopping costs a shitload. As a whole, it’s too expensive. And if it’s improving, that’s great — but — it is not less expensive to any significant degree. Trump needs to become aware of this & someone in his admin is dropping the fucking ball by not letting him know. He should not be using reduced prices as a positive talking point because people aren’t feeling it. To many I’m sure it’s perceived as gaslighting. permalink parent award report block reply Hattmall -2 points 7 days ago There's very little Trump can do to influence demand based branded products. As long as people pay the inflated prices the price will remain high. The reality is that staple goods and generic items are as cheap or cheaper than pre-pandemic. I buy a lot of groceries and have been closely monitoring these prices for a decade. So no something like Doritos or Digorno frozen pizza isn't going to get cheaper unless demand drops. Which delaying SNAP payments may have a nice impact.  Eggs,Beef and orange juice are still high but price disruptions have always been a thing.  Milk, cheese, oats, flour, fruit, vegetables, canned goods, chicken, turkey, seafood, yogurt, potatoes, other juices, are all down. Coffee and bread are at the upper end of normal pricing. Nuts are variable, remaining somewhat high but within normal bounds. permalink parent award report block reply DrWeeGee 5 points 7 days ago This. permalink parent award report block reply logan34 4 points 7 days ago 25% down? where exactly??? permalink parent award report block reply ImportantPerson -3 points 7 days ago Prices are down.  If you don't see it, then you need to go to different grocery stores.  I don't know what to tell you but you are getting duped if you are still paying outrageous prices for common items. Right now, I can search 4 different grocery stores that are in my area.  All 4 of them have different prices for common items.  A dozen eggs cost $4 at one store and $2 at another store.  Beef is $3.50 at one store and $6 at another. When we were growing up, we would check for coupons and sales and buy those items.  So many people now go to the store and buy the same items regardless of if they are on sale or have any coupons.  A fool and their money... permalink parent award report block reply tribunabessica 30 points 7 days ago Who feeds him these bulshit numbers? permalink award report block reply flashersenpai 11 points 7 days ago i have no proof but i don't like wiles so I'll blame her lol permalink parent award report block reply gottarememberpasswor 8 points 7 days ago I would genuinely love to know permalink parent award report block reply Imnotnorm 2 points 7 days ago Suzy Wiles and Lindsay Graham permalink parent award report block reply bumpman 1 points 7 days ago Prices are actually recently dropping but it’s because ebt didn’t go out this month, plus gov employees are not working, plus I also noticed a lot less illegals st the store lately All of these factors mean higher supply + lower demand, which means cutring prices to move inventory permalink parent award report block reply Obambi 0 points 7 days ago Women permalink parent award report block reply Bldg_2019 27 points 7 days ago For every 12% increase in EBT use from 21-24, there was a 1% increase in the price of food. EBT increased during that period by about 150%. There are other factors, but that’s a BIG one. permalink award report block reply Captainlizard 17 points 7 days ago Finally someone says it. EBT increases grocery prices just as federal government loans increase the price of higher education. It's a huge problem. permalink parent award report block reply Awakened 9 points 7 days ago Are you suggesting that government subsidies lead to higher prices? Shocking I tell you! permalink parent award report block reply SilverStarv5 3 points 7 days ago Same story as college tuition permalink parent award report block reply ADAM_SCHITT 1 points 7 days ago And Healthcare permalink parent award report block reply LibertyStillMatters 4 points 7 days ago That’s interesting.  I’ve never heard that before.  Very important message to get out there if so. permalink parent award report block reply gravenspine 9 points 7 days ago This applies to college. Insurance. Food. Healthcare. Not only do you subsidize them, but you compete on the market with their spending. permalink parent award report block reply Pnw4gotpwd 2 points 7 days ago This comment is succinct and correct permalink parent award report block reply Deplorable_in_PA 1 points 7 days ago Sure.  It's like Section 8 where there is a distorted market.  I could easily see the same for EBT since it's 25% of Wal Mart's income. permalink parent award report block reply gottarememberpasswor 23 points 7 days ago This is verifiable bullshit as I've been keeping track of these prices for the last several years. I thought we had a higher standard than this for bullshitting permalink award report block reply orange_kek_great 19 points 7 days ago Big fucking deal. It's 25% down but still up at record highs. Quit talking to us like we're all fucking stupid. permalink award report block reply Seldom_Seen_Kid 17 points 7 days ago Betting they’ll raise prices on non-related to Thanksgiving items to make up for it. permalink award report block reply UsernameChexOut 14 points 7 days ago Walmart has been jacking up the prices recently on all sorts of things. It's been out of control price hikes over here at Walmart. So I'm pressing F to doubt. Maybe they gamed the Thanksgiving numbers as you said but they certainly skyrocketed prices on everything else recently over here. permalink parent award report block reply Klaus73 4 points 7 days ago If I were to guess - supply chain is making the turkeys regardless - Walmart probably orders LONG in advance and might aswell eat the cost and maybe get ancillary sales or atleast clear out as opposed to not selling anything. permalink parent award report block reply deleted 11 points 7 days ago MasterChief 1 points 7 days ago this permalink parent award report block reply ImportantPerson 0 points 7 days ago The walmart in my area currently has the cheapest beef, chicken, eggs, most \"fresh\" vegetables, bread and dairy.  The only thing that's significantly more expensive at walmart is soda. Not sure where everyone is seeing that they are jacking their prices up on \"everything\".  My guess is that they are full of shit  especially when they say \"everything\". permalink parent award report block reply UsernameChexOut 2 points 7 days ago We've stopped shopping for food at Walmart, it no longer really makes sense. I think Walmart gets by on the convenience of a one stop shop and the fact that they may be the only game in town in more rural areas. Overall though, the prices seem higher and every time we walk by they seem to get more and more crazy. For us, Trader Joe's, Costco and Kroger are in one area and are an easy stop. Between those, not only do you get better quality food, it also ends up being significantly cheaper. The stuff that we end up shopping for at Walmart are non-food items and there have been multiple price hikes recently to the point that we now only go there for stuff that we need immediately. If I need charcoal, butter, corn and I'll pick up some hot wheels for the kids, then it's Walmart. But the overall prices for all these items individually now make sense to buy from other stores when you're there anyways. permalink parent award report block reply ImportantPerson 2 points 6 days ago Walmart does get by on the convenience of the one stop shop but that only works when there are some prices that will bring people to the stop.  If you go to walmart and buy everything, you are going to be paying more because the higher marked up items are marked up a lot more. Like I said, I can buy eggs, beef and dairy from walmart for cheaper than I can anywhere else in the area but if I want other things, often times junk food like soda and chips, walmart is significantly more expensive.  They know their audience.  Their audience buys junkfood. permalink parent award report block reply DingleBalls 16 points 7 days ago But Biden saved us 16c on hotdogs or some shit for 4th of july! permalink award report block reply FUCK_TYLER 2 points 6 days ago yup, read my mind brother permalink parent award report block reply LordKuroTheGreat 14 points 7 days ago I wonder how that compares percentage-wise to the upward creep that's been going on all fall. permalink award report block reply Ligersrule1 14 points 7 days ago Fuck walmart permalink award report block reply Mountaineer 8 points 7 days ago In the ass with a pineapple. Fuck the Waltons too. permalink parent award report block reply ActNow 3 points 7 days ago Tell us how you really feel. Lol. permalink parent award report block reply geekesmind 3 points 7 days ago hums the The Waltons theme song oh wait that's different Waltons  OOPS permalink parent award report block reply thunderpussy 1 points 6 days ago LMAO! permalink parent award report block reply Pnw4gotpwd 13 points 7 days ago The grocery prices right now are FUCKED, and his messaging on this and the job market are not having the desired effect, because people feel he's gas lighting them. And that's just the truth. People who work are hurting right now permalink award report block reply starjello 10 points 7 days ago Yesterdays elections are showing that clearly. permalink parent award report block reply Pnw4gotpwd 6 points 7 days ago Damn right. We know who's fault it is that things are as fucked as they are. But a lot of people are just plain desperate. And that's not good. At all. I like trump and think he's doing a lot of great things policy wise but addressing and correcting the prices for bare necessities, dealing with out of control crime, and restoring faith in open and transparent government (which the East wing demolition and how it was handled did a lot to damage) are far more important than \"owning\" the Dems. We need to own the fuckers on election day. permalink parent award report block reply geekesmind 4 points 7 days ago yeah spending 100+ a week on what looks like NOTHING but people on EBT get to load their carts up FULL with steak, lobster, frozen food, snack cakes, soda and ETC and I am getting things like potatoes, bread, pasta and etc struggling working 50+ hours a week while the freeloaders GET IT ALL! permalink parent award report block reply mikejones 3 points 7 days ago Would rather work 50 hours knowing I'll be okay. Could go the other route but imagine you get cut off one day with no skills. permalink parent award report block reply Pnw4gotpwd 2 points 7 days ago On the plus side I'm getting stronger as I get older... I can lift 100 bucks worth of groceries with one hand! permalink parent award report block reply Pnw4gotpwd 2 points 7 days ago This and the East wing (which could have been handled WAY better than it was from a communications standpoint) are kinda screwing up. And are pulling normies into trusting him far less permalink parent award report block reply Krat 12 points 7 days ago What about the arrests permalink award report block reply ImYourHuckleberry24 7 points 7 days ago Never gonna happen permalink parent award report block reply deleted 5 points 7 days ago Krat -2 points 7 days ago O really?!? Those two are behind bars right now ? We can see their mugshots like Trumps? permalink parent award report block reply deleted 5 points 7 days ago ragnarokrobo 3 points 7 days ago W E E K S permalink parent award report block reply UsernameChexOut 3 points 7 days ago And Epstein list permalink parent award report block reply Tookens 9 points 7 days ago I wish he would stop the gaslighting.  No, Donald, grocery prices are NOT down. permalink award report block reply drmrboy 9 points 7 days ago What if you don't buy groceries at Walmart?  🤔 permalink award report block reply NadlersNads 9 points 7 days ago DO. NOT. GASLIGHT. US. ANYMORE! permalink award report block reply Alldayeveryday 8 points 7 days ago I just went to the grocery store today for normal stuff,it was $250. Prices are not down,stop with this gaslighting bullshit permalink award report block reply PotatusHead -2 points 7 days ago Your \"stuff\" is NOT normal. permalink parent award report block reply Mulletgunning 8 points 7 days ago Wal-Mart is lying. I shop there regularly and they are full of fucking shit. And that's in the poorest state of the union. GEOTUS is being gaslit as usual by those scum advisors around him. All status quo establishment trash. Wal-Mart increased their prices at least 30% after GEOTUS got in ,so that bullshit  don't fly that groceries are cheaper. MAGA AF permalink award report block reply geekesmind 6 points 7 days ago oh but they say its cause of the traffis BULLSHIT! permalink parent award report block reply Mulletgunning 4 points 7 days ago Ex-fucking-actly! permalink parent award report block reply ImportantPerson -2 points 7 days ago Right now, the walmart in my area is cheaper than every other grocery store for most groceries.  I'm paying $2 a dozen of eggs.  Chicken breasts are $2.42 a pound.  Vegetables like Bell Peppers are $0.67 each. The majority of the items where the prices are high are shitty foods.  Walmart has the highest soda prices.  Cereal is 20% higher than other places.  Chips are 20% higher than other places. So I'm really not sure where you are coming up with your numbers but my guess is that you are pulling them out of your ass. permalink parent award report block reply Mulletgunning 3 points 7 days ago Fuck off faggot. I buy no junk fuckstain. Eggs are 5 dollars a dozen. Meat is out fucking rageous,bread is over 3 dollars a loaf for buns or sliced,etc. If you can't figure out where, the always has been, poorest state is then you might need to turn in your basket weaving degree. WTF? I'm not here to shill for Wal-Mart like you homo.Go wave your pom poms for other corporations dickwhipper. MAGA AF permalink parent award report block reply ImportantPerson 0 points 6 days ago HAHAHAHAHA YOU CAN'T LIE AND PRETEND EVERYONE IS GOING TO JUST BLINDLY BELIEVE YOU. Right now post a screenshot of a dozen regular eggs being 5 dollars alongside the store. Either do that or shut the fuck up you lying fucking whore. permalink parent award report block reply Mulletgunning 1 points 6 days ago Suck a dick. You are a loser. I have no reason to lie about the prices. I am not a high tech person. I don't own a phone. I barely hunt and peck on this book someone gave me five years ago. So I suggest you look up prices at Wal-Mart in South Mississippi at Gulfport stores and you can see for yourself. I shop for myself and my mother at Sams and Wal-Mart two to three times a week. I know those prices like the back of my hand fucklip. So you can be grateful your local Wal-Mart sells them cheaper while I and many others can attest to their prices being high. A fucking jar of mayo is 9 dollars ,a tub of butter is 8 dollars ,beef is outrageous and unless you buy leg quarters for 9 dollars for ten pounds chicken is high too. You are an absolute moron to assume others are lying about grocery prices. Their is no incentive to lie about something like that. Try to prove me wrong faggot. Look them up yourself and Ill be waiting for an apology from you . That's if you are a real man that can admit when you are wrong. But ,I highly doubt you are of that character. You will just continue on in your moronic outbursts even when you are wrong. Get a grip. Enjoy your cheerleading for the lies being told by Wal-Mart and the fucking shit Israel First advisors surrounding GEOTUS. MAGA AF permalink parent award report block reply view 11 more comments... DogFart_ 7 points 7 days ago radioactive turkey? permalink award report block reply AVeryNakedMan 7 points 7 days ago Shrinkflation (and skimpflation) says hello. permalink award report block reply johnfist2 7 points 7 days ago Only true if you buy Walmart's brand of slop.  No thanks. permalink award report block reply MemoryHoleyeO 6 points 7 days ago GOP puts in 0 ground game and 0 effort; they've ridden the coat tails of President Trump and think they can go back to the days before him. They are waiting him out. permalink award report block reply Mellifleur 6 points 7 days ago Those prices got to come down by a fuck ton to get back to Trumps first term. permalink award report block reply JoeBidensDementia1 5 points 7 days ago They won't. The RNC is worthless. Trump is going to have to force them to take action. Meanwhile, he's struggling to get the Jews and Mooselems to play nice and has failed at solving the Urine conflict. I'm not blaming Trump for his efforts. I just wish he'd focus on domestic issues from now on. permalink award report block reply mikejones 3 points 7 days ago Probably harder to focus on domestic issues when he's fighting the uniparty that will stall him. permalink parent award report block reply jdemarco2014 5 points 7 days ago If anything my grocery bill has been going up alot more lately permalink award report block reply SavingPrivateGrace 5 points 7 days ago No thanks, and why advertise for Walmart.  I don't like my Turkey injected with salt water by a Chinese packing company. permalink award report block reply sully 5 points 7 days ago Down from when? 2019 prices? Or is it 25% down after a 50% increase? permalink award report block reply CaptainForehead 5 points 7 days ago People on SNAP don’t care about prices and those supporting the left expect to get it free somehow. The more people buying food with their own money, the bigger the impact. permalink award report block reply geekesmind 3 points 7 days ago exactly people on EBT don't give a shit about prices because they don't have to PAY for it! We hardworking Americans who bust our ass every day and have to use OUR OWN MONEY to pay for food! permalink parent award report block reply Awakened 5 points 7 days ago Sure thing, Jan. He use to tell the truth whether it was good for his position or not. Now one lie after another. permalink award report block reply Bythrfruitsyknow 4 points 7 days ago lol this is fucking sadder than Biden's 25 cents off hotdogs July 4th tweet. Thanks President Trump with my savings I'll be sure to get a book of stamps or a liter of cola.  I bet everyone is really feeling that 25% cheaper when they hit the fucking checkout 🤣 permalink award report block reply Losferwords 4 points 7 days ago Prices are skyrocketing and this is what we get from this administration. I'm really having a hard time supporting this shit. Why the corporate welfare? Where are the arrests? permalink award report block reply ProfessorJagoff 4 points 7 days ago I remember a time in the late 2010s when I ate a ribeye every ~4 days, and make a brisket once a month. Then by the Biden years it became once every week or two, just forgot what flank steak was, but brisket was still affordable...for a time. But this year has been rough as the prices kept going up as we keep exporting our prime cuts, and importing crap for hamburger (which I also forgot about). Now on to Turkey, Turkey is always cheapest after Thanksgiving for a few months, then climbs back up, ironically this is the only time of the year I try to avoid having to purchase a turkey, now with that said, as far as I can tell, turkey doesn't change much, its cheaper and then more expensive, but overall it hasn't changed much. Also the cost for whole chickens went up too. I smoke a lot of meat with friends and kind of keep a mental tab as the bill keeps going up. permalink award report block reply RocksCanOnlyWait 3 points 7 days ago Data is likely from this article: https://www.cbsnews.com/news/turkey-price-increase-thanksgiving-2025/ The Farm Bureau data isn't the same items or quantities as store deals, nor does it account for store discounts. That means the 25% number is exaggerated. I found this article from 2024 which said Aldi had a $47 deal for 10 people, and they're offering it at $40 this year. That works out to a 17.5% decrease . permalink award report block reply aqua27 3 points 6 days ago Food prices are still very high and going to the store for a few items is easy 100$ not good for working poor and middle class. My advise to Trump and JD stop worrying about the world and remember the term America first or 2028 is going to be ugly and Trump is finished. permalink award report block reply BillyBillington 3 points 7 days ago But the city where I live just increased my property taxes 20 percent with an unnecessary school bond. I can't win. permalink award report block reply AccelerateAlready 3 points 7 days ago Cool, what about the invasion and rise of Islam? permalink award report block reply KernalMustard 3 points 7 days ago In a choice between my 4 local. Walmart, Winn Dixie, Aldi and Walmart. Its going to be Aldi then walmart permalink award report block reply ActNow 1 points 7 days ago Is one of those Walmarts actually Publix? Those 4 are what we had when we lived in the south. Occasionally Albertson's. Aldi was great. I miss shopping there. permalink parent award report block reply ACActual 3 points 7 days ago When will he realize Republicans aren't on our side? Just got back from picking up 2 jars peanut butter, 5 apples, dozen eggs, bread,  butter, pint of milk and a half gallon ice cream. $42.  Prices are not down permalink award report block reply Totsugeki 3 points 7 days ago I just paid $3.99 for a half-gallon of milk. Eggs are still above $4.00. Down 25%, my foot. permalink award report block reply Imnotnorm 2 points 7 days ago No but ok permalink award report block reply MajJamesMcFarlane 2 points 7 days ago Sure, Jan permalink award report block reply blueeyephoto 2 points 7 days ago Sorry,  Republicans don't know how to win permalink award report block reply POTUS_DonnieJ 2 points 7 days ago But I saved $0.17 on hot dogs under Biden, surely this can’t be better than that. permalink award report block reply StrongIsland 2 points 7 days ago Whoa! Tone is retarded here… yeah I can save on the turkeys deducted from my taxes for corporate gimmigrants and the ones I pay to donate out of pocket. Economy isn’t golden, what intern stooped to Biden games in this post, Fire Them! permalink award report block reply conservativefrank 2 points 7 days ago Where? permalink award report block reply Yignuced 2 points 7 days ago Republicans have no interest in winning if it helps MAGA. permalink award report block reply Wrez77 2 points 7 days ago Sounds great but we have bigger fish to fry? permalink award report block reply Protonboy 2 points 7 days ago Yeah, but, Sleepy Joe had our July 4 dinner down 16 CENTS! his first year in office That's the real test. permalink award report block reply giggitybooped 2 points 7 days ago Respectfully, the vast majority of Republican politicians are swamp shit, Mr. President. permalink award report block reply I_Am_John_Galt 2 points 7 days ago Nice.  I'll pay whatever I need to for the fam on Thanksgiving...don't care.  Tell Pam to arrest deep state criminals and break the wheel or tell her to get the fuck out. permalink award report block reply throttlejohnson 2 points 7 days ago don't be a turkey. permalink award report block reply geekesmind 2 points 7 days ago hey Trump shit is still TOO HIGH!! permalink award report block reply ShekelJa 2 points 7 days ago Also: where I am from, eggs are on sale 11 cents each. permalink award report block reply ActNow 2 points 7 days ago My hens are starting their winter break. Store eggs here are twice what you paid. <sigh> permalink parent award report block reply Hammond 2 points 7 days ago The grocery prices are not down in my area.  Are stores price gouging? Is it 42M on SNAP and we are paying to offset \"free\" food?  Who is telling Trump grocery prices are down? permalink award report block reply geekesmind 2 points 7 days ago I bet 25m of them are freaking illegals! permalink parent award report block reply GravityBounce1976 2 points 7 days ago Not if \"conservatives\" keep spending us into inflation.  I like Trump's policies, but his spending is just as bad as Democrats. permalink award report block reply GravityBounce1976 2 points 7 days ago Maybe someone should send him this thread. permalink award report block reply Porkchop-express 1 points 7 days ago Sorry sir. They too stupid permalink award report block reply Doubleu1992 1 points 7 days ago No communist piece of shit Gives a shit about the prices of groceries when they’re fucking milking the government or their parents pay for their shit. The only way we will ever win elections or anything is voter ID motherfuckers. permalink award report block reply DCYR66 1 points 6 days ago Sorry don’t see my grocery bill decreasing. Paid $60 for 3 paltry little bags recently. Used to cost a third of that before. permalink award report block reply JoePlumber 1 points 6 days ago Just ordered my fresh turkey and the price is $.23/lb more than last year. I realize I am paying for a fresh, free range turkey and not that frozen mass produced Walmart stuff but nevertheless the cost is up, not down. permalink award report block reply Jbliss 1 points 7 days ago Affordability doesn't matter when you are on EBT, SNAP, food stamps or whatever fancy term for government taking care of you. permalink award report block reply Tmntnyc 1 points 6 days ago Trump is saying this knowing it's not true to force Walmart's hands, thinking now that he said it they better make it true or it's a PR disaster (for them). He's done this before. If they do it, it's a win win permalink award report block reply Eddie_LeBec 1 points 7 days ago I feel my grocery prices have come down\nBut yes it hasn't made up the Covid/Biden hike permalink award report block reply ParticleCannon 1 points 7 days ago A real Thanksgiving or a Joe Biden \"mystery meat, no steaks burgers or hotdogs 4th-of-July\" type Thanksgiving? permalink award report block reply geekesmind 1 points 7 days ago spam turkey this year!! permalink parent award report block reply Krat 1 points 7 days ago Did a democrat jidge give permission for these prices ?!? permalink award report block reply ShitAss 1 points 6 days ago My grocery bill is as high as it ever was permalink award report block reply Citizen_Bob 1 points 7 days ago Yeah but Joe Biden had pans of unseasoned ground beef down by $0.16c if you included all the other stuff you might buy. permalink award report block reply explodejoystick 1 points 6 days ago Well, considering the articles the last few years with these figures, it should be easy to verify, right? permalink award report block reply Nibba2 1 points 7 days ago I’m still living off my $0.16. Don’t know what you people are talking about. permalink award report block reply BrionK 1 points 6 days ago Don't care permalink award report block reply QSWO1 1 points 7 days ago Why is Walmart the only game in town? permalink award report block reply bill_in_texas 1 points 6 days ago This just sounds out of touch and cringe worthy.  Touting a promotion by one company as some kind of achievement? permalink award report block reply FUCK_TYLER 1 points 6 days ago this is like Joe biden's ketchup is now $0.16 cheaper for the 4th of July moment 😒😬 permalink award report block reply xanaxagoras 1 points 7 days ago I don’t care, the country is overrun with foreigners. permalink award report block reply Rideordie45 1 points 6 days ago Bullshit, wish it were true permalink award report block reply Another_rando 1 points 7 days ago Sweet 25% down from 50%. Boo permalink award report block reply PotatusHead 1 points 7 days ago Be Thankful! permalink award report block reply DJTXLV 1 points 7 days ago Great. Thank you. NOW DO ELECTION INTEGRITY. permalink award report block reply borntacticool 1 points 7 days ago Wongmart ® Huaweis the lo Yuan, Huaweis permalink award report block reply Iranhasnukes 1 points 7 days ago 4 weeks late permalink award report block reply CommieCrats 1 points 7 days ago exterminate Soros permalink award report block reply bigbadchows2 1 points 7 days ago Hey, I saved 27 cents on my 4th of July BBQ in 2024 according the WH and great grand Joe. We should not discount his success. In all honesty my BBQ was a lot more expensive mostly due to soft drinks of all things. permalink award report block reply covok48 1 points 7 days ago I don’t shop with the blacks and browns using EBT cards at Walmart. He thinks into 2019. It’s not. permalink award report block reply raptormissle 1 points 7 days ago And if you're a SNAP benefits recipient it doesn't matter because it's all completely free. permalink award report block reply thewallhasnobrakes 0 points 7 days ago AMERICA IS BACK permalink award report block reply HankScorpio 0 points 7 days ago President dont control the economy. Central bankers do. How many muslim central bankers have we had? permalink award report block reply Obambi 0 points 7 days ago Who gives a fuck. End taxes. permalink award report block reply CJ74U2NV 0 points 7 days ago The only prices that have really gone up are imported goods because companies are not making products here. Buy American, and keep the money in America, and all prices will come down. permalink award report block reply TPMJB -1 points 7 days ago What are people buying for Thanksgiving that is expensive? Turkey has been 99 cents a pound for as long as I can remember. Potatoes and carrots are cheap. This always confused me. I don't put goyslop on my table though. permalink award report block reply Patriot4TN -4 points 7 days ago Now we need to ask ourselves. How big of a meal is it? Can it feed 4,6, or 8?  You know how they love to downsize food and not the price.  Does the lower price have anything with SNAP being removed? https://corporate.walmart.com/news/2025/10/21/walmarts-annual-thanksgiving-meal-returns-serving-10-people-for-less-than-4-00-per-person or https://www.walmart.com/i/shoppable-lists/Thanksgiving-value-meal/929 permalink award report block reply Patriot4TN -7 points 7 days ago I guess the OP does not like me bringing receipts. permalink parent award report block reply YaharaRiver -10 points 7 days ago get lost, shitstain. permalink parent award report block reply Patriot4TN -6 points 7 days ago Another basement dweller. permalink parent award report block reply DeltaSierra 16 points 7 days ago Comment removed upon the user being banned. permalink award report block reply geekesmind 5 points 7 days ago yep every time you turn around getting some type of notification that something you buy or subscribe to is having PRICE INCREASE! permalink parent award report block reply ImportantPerson -5 points 7 days ago Then buy something different.  You are fucking subscribing to items and you are shocked then they increase their prices?  You are telling them that you are going to keep buying the item so why wouldn't they increase their prices? There's a reason why companies love subscriptions and it's because of lazy people who won't bother to check the prices. We used to clip coupons and look at the ads for sales on different food.  Now, we have lazy people who buy at whatever price and then complain about how expensive groceries are. My grocery bill per week for my full family has gone down $75 since 2023 and it's because I've put more effort into thrifty purchasing.  Beef was on sale so I bought 12 pounds of it, freezing some.  Eggs are back to being one of the cheapest healthy meals you can make.  Chicken has always been cheap and I just found out another way to not only make it cheaper but to get better quality. permalink parent award report block reply the_new_one 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply NebraskanPatriot 1 points 7 days ago Comment removed by community filter, pending further review. permalink award report block reply\nLegendFang 70 points 7 days ago Lovely, if true. permalink award report block reply SquiggyMcPepe 67 points 7 days ago Yes its true. But. It's still 50~75% more expensive than it was pre covid. They really fucked us with that one and since it was a global disruption there really isn't much Trump can do to expedite a return to those price levels. Gradual decrease is the best we will see for a while yet possibly a decade. permalink parent award report block reply dr_gonzo 20 points 7 days ago No this is absolutely NOT true. We must do what happened in the 80s and create massive economic growth to make wages outpace what was lost to inflation. So what must be done to accomplish that? Well that's where we have problems because the Republicans no longer stand for liberty-centric economic policy, but if you did these 4 things, you would almost immediately see the 10% growth rates of the 19th century return: End the federal reserve and put us back on the gold standard to restrict future government spending and slam the brakes on inflation ELIMINATE socialist social welfare programs. That would include Medicare, Medicaid, Social Security and especially WELFARE. Congrats, you just saved 4.6 trillion a year in federal spending RE-abolish our progressive income tax. With this one, the 50% of Americans that actually pay income taxes after credits and deductions, just got a very significant raise which is what would encourage the economic growth Eliminate 90% of the fascistic regulatory state that was never supposed to exist in the first place and imposes 80,000 pages of regulations on Americans conducting business. That now consists of 2.5 MILLION bureaucrats. That number should be less than 100k when you're done If you do those 4 things, we return to the economy we THRIVED under for well over a century and produced the largest economic explosion in world history. In just 4 years time our GDP would go from 27 trillion to over 40 trillion. That's a 60k raise for every American, assuming it was distributed equally which admittedly wouldn't happen, but it gives you an idea of how much wealth is being lost to socialist bullshit. And all we need to do is return to our liberty-centric economic roots. permalink parent award report block reply DatTrumpDoh 7 points 7 days ago That second bullet is DOA. Even many conservative voters are against repealing those programs. permalink parent award report block reply ImportantPerson 5 points 7 days ago It's DOA because any moron that suggests getting rid of all social programs entirely is a fucking moron that doesn't understand the impact of why these programs exist in the first place.  Our GDP would not by skyrocketing because of this and ignorantly looking solely at translating the cost into deficit reduction is just bafflingly wrong. permalink parent award report block reply Glory-Unto-God 1 points 7 days ago Would take a dictator to get it done. People will eventually have to come to terms with the choices Benevolent dictator who loves his people. Or daughters raped in the street. That hill is rapidly approaching. permalink parent award report block reply doomerglowie2 2 points 6 days ago How does your 4 economic things help our greatest ally and other foreign powers that own our Government? Asking for a supervisor. permalink parent award report block reply HOSEQ 1 points 6 days ago Well, First you have to (S)Elect a Muslim for Mayor of the Money Capitol of the World, see??? Then you.... permalink parent award report block reply Damadhatter 1 points 6 days ago First bullet point - while it would be really cool in some ways, would destroy the USD and the revolt world wide would be too eliminate the USD as the monetary trade standard. There's too many dollars out there at this point and not enough gold to cover a gold standard and maintain the global currency status. That global standing has been what has insulated the USD since we left the GS and we're too far gone from it at this point to return. permalink parent award report block reply Tmntnyc 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. Never. Boeing CEO just testified last year in Congress and admitted he got a 45% raise last year (38 million). The 500 machinists at Boeing  saw a 1% raise over 8 years. The wealth never trickles down automatically. You have to fight for it with unions or labor regulations or we would be paid in fucking scrips if they could permalink parent award report block reply anotherthing 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. It trickles down to the shareholders. It's the reason your retirement account just keeps on growing. permalink parent award report block reply view 3 more comments... dunkeaters 8 points 7 days ago With an expanding money supply it isn't possible to return to pre covid prices. The goal is to grow the real economy (wages vs. inflation) so that consumer prices return to the same relative proportion of income they used to be. permalink parent award report block reply SquiggyMcPepe 3 points 7 days ago Oh we will never see a complete return of course. But corporate margins are thick and there is plenty of room to narrow them if the proper 'incentives' are applied. One of the main tools will be to abolish the lobby. Completely. The main reason corps have grown out of control is because they bought the people who make the rules and laws and turned them in their favor. permalink parent award report block reply CJ74U2NV 7 points 7 days ago Those prices are inflationary adjustments to the Democrats living wage mantra. Every piece of crap unskilled worker is now making a lot of money. Because of that, the costs are passed along to the consumer. Then the Democrats will cry. We need more livable wage increases which will in turn drive prices up even further. After while, the economy collapses and you going to a depression. But that's what Democrats want. So they can have the government take everything over. It will make FDRs new deal look like mother Gooseland. permalink parent award report block reply flashersenpai 8 points 7 days ago Every piece of crap unskilled worker is now making a lot of money. they aren't, and lovely of you to describe them as pieces of crap. loser country club republican in action permalink parent award report block reply EDDIT_IS_CUCKED 2 points 7 days ago All of the people that work at fast food establishments are hired on making more money than I did out of college with a STEM degree 15 years ago. So yes, they are making a shitload of money, actually. Unless your argument is that these are skilled workers. If that's the case, we have a wildly different opinion of the term. permalink parent award report block reply view 5 more comments... Hanging_Chad 2 points 7 days ago have you seen government workers lately? permalink parent award report block reply Isolated_Patriot 4 points 7 days ago since it was a global disruption It's not the global disruption that is the problem, it's the number of US of A dollars printed in that time. Inflation WILL NOT DISAPPEAR. It's not going to magically revert to the number of dollars that existed pre-covid unless someone starts incinerating them. A strong economy that starts paying wages to supplement the difference is the ONLY solution to counter the inflation that isn't outright magical. Until people understand this, they are going to continue to yell at clouds about how \"Trump hasn't fixed anything yet!!!!\" permalink parent award report block reply bigbadchows2 4 points 7 days ago Been seeing Buter ball for .99 a pound. We actually did Prime Rib last year due to Turkey being over 2 a pound. I had purchased several who 13 bone prime rib for 5 a pound and the boys and I preferred it to Turkey. This year we got a Turkey, I hope day after Ham roasts are cheap my dogs always get a full ham for major holidays. However, I will never see the .49 a pound I paid 2019, I switched to pork loin, they don't really gaf what the get. I do agree, Trump has limited tools on reducing prices, we did however have some price leveling after the zirp o8-12 inflation. Not holding my breath but we are doing well on gas, so maybe in time it will freeze or come down a point or 2. permalink parent award report block reply Granny 4 points 7 days ago Yes I'm getting a butterball for.99¢ a pound. Last year was $1.19/lb. permalink parent award report block reply bigbadchows2 2 points 6 days ago Was almost 2 where I live and in 1 store it was working on 3. 1.19 is 20%, but nothing to get excited about. permalink parent award report block reply SquiggyMcPepe 2 points 7 days ago Meat is still fairly easy to get on the cheap and if you vacuum seal it before freezing you can load up during a particularly deep sale and have meat for months or even years. As a test I took a store bought vacuum sealed pork loin and let it set at the bottom of the freezer for three years. Thawed it and made a roast and it was just as fresh and tender as it would have been had I made it the day I bought it. permalink parent award report block reply CJ74U2NV 2 points 7 days ago Or from a local butcher. You'll get better quality, a cheaper price, and you're supporting local businesses. The meat is definitely not purchased from overseas. permalink parent award report block reply load 7 more comments... BigMikesChef 26 points 7 days ago I have seen no improvement in any bills or expenses at all. permalink parent award report block reply mikejones 19 points 7 days ago Cell phone, Internet, energy, rent, insurance. All goes up. Food eating out goes up. Car repairs, daily items from the store. Not sure what is going down. Maybe some food on sale. permalink parent award report block reply DoYouLikeFishsticks 14 points 7 days ago Everything is going up and never going to go down as far as I’m concerned permalink parent award report block reply geekesmind 4 points 7 days ago yep went to pay rent today got told now 7.99 service charge to pay it. WTF permalink parent award report block reply chickeninoven 2 points 7 days ago hand out with finger pointing into palm permalink parent award report block reply ImportantPerson 1 points 7 days ago I just paid $3.50 for a pound of ground beef.  That's the lowest it's been in a decade.  Eggs are back to being one of the cheapest healthy meal you can buy.  Chicken has been stable even throughout COVID. The only people who aren't seeing any changes are people buying marketing, not products.  The \"grass fed\" beef isn't going to go down in price.  The organic whatever is not going down in price.  These products are targeting the stupid and ignorant. If you aren't seeing any changes, then go to a different grocery store because you are getting screwed where you are going now. permalink parent award report block reply The_Nowhere_Man 1 points 7 days ago All of them in my town and the town next to mine are within a few pennies of each other on meat prices. Lower than it was right after 2020 but far from being brag worthy. Pound of the cheap hamburger is like $6-something. I go to the local butcher instead and get it for $4-something a pound. permalink parent award report block reply NotYourMan 7 points 7 days ago Food inflation is bad right now.  Remember in 2021 democrats printed $5 trillion dollars and the \"fake\" Inflation Reduction Act.  Both of these caused a 20% increase in food cost accumulative.  But the real inflation is over 45% because of energy and housing.  Trump is fixing the energy but the food prices are staying around.  Remember when democrats decided to shutdown \"the supply chain\" for six months to one year.  That also caused a delayed increase in food cost that we are suffering from now.  ITS THE DEMOCRATS FAULT. permalink parent award report block reply Bythrfruitsyknow 3 points 7 days ago Good job the Republicans got back in office and immediately cut the trillion dollar deficits, amirite? permalink parent award report block reply PitfallHarry 3 points 7 days ago It is true. Trump has said that gas and grocery prices are down so they are. End of story. permalink parent award report block reply load 16 more comments...\nSquiggyMcPepe 67 points 7 days ago Yes its true. But. It's still 50~75% more expensive than it was pre covid. They really fucked us with that one and since it was a global disruption there really isn't much Trump can do to expedite a return to those price levels. Gradual decrease is the best we will see for a while yet possibly a decade. permalink parent award report block reply dr_gonzo 20 points 7 days ago No this is absolutely NOT true. We must do what happened in the 80s and create massive economic growth to make wages outpace what was lost to inflation. So what must be done to accomplish that? Well that's where we have problems because the Republicans no longer stand for liberty-centric economic policy, but if you did these 4 things, you would almost immediately see the 10% growth rates of the 19th century return: End the federal reserve and put us back on the gold standard to restrict future government spending and slam the brakes on inflation ELIMINATE socialist social welfare programs. That would include Medicare, Medicaid, Social Security and especially WELFARE. Congrats, you just saved 4.6 trillion a year in federal spending RE-abolish our progressive income tax. With this one, the 50% of Americans that actually pay income taxes after credits and deductions, just got a very significant raise which is what would encourage the economic growth Eliminate 90% of the fascistic regulatory state that was never supposed to exist in the first place and imposes 80,000 pages of regulations on Americans conducting business. That now consists of 2.5 MILLION bureaucrats. That number should be less than 100k when you're done If you do those 4 things, we return to the economy we THRIVED under for well over a century and produced the largest economic explosion in world history. In just 4 years time our GDP would go from 27 trillion to over 40 trillion. That's a 60k raise for every American, assuming it was distributed equally which admittedly wouldn't happen, but it gives you an idea of how much wealth is being lost to socialist bullshit. And all we need to do is return to our liberty-centric economic roots. permalink parent award report block reply DatTrumpDoh 7 points 7 days ago That second bullet is DOA. Even many conservative voters are against repealing those programs. permalink parent award report block reply ImportantPerson 5 points 7 days ago It's DOA because any moron that suggests getting rid of all social programs entirely is a fucking moron that doesn't understand the impact of why these programs exist in the first place.  Our GDP would not by skyrocketing because of this and ignorantly looking solely at translating the cost into deficit reduction is just bafflingly wrong. permalink parent award report block reply Glory-Unto-God 1 points 7 days ago Would take a dictator to get it done. People will eventually have to come to terms with the choices Benevolent dictator who loves his people. Or daughters raped in the street. That hill is rapidly approaching. permalink parent award report block reply doomerglowie2 2 points 6 days ago How does your 4 economic things help our greatest ally and other foreign powers that own our Government? Asking for a supervisor. permalink parent award report block reply HOSEQ 1 points 6 days ago Well, First you have to (S)Elect a Muslim for Mayor of the Money Capitol of the World, see??? Then you.... permalink parent award report block reply Damadhatter 1 points 6 days ago First bullet point - while it would be really cool in some ways, would destroy the USD and the revolt world wide would be too eliminate the USD as the monetary trade standard. There's too many dollars out there at this point and not enough gold to cover a gold standard and maintain the global currency status. That global standing has been what has insulated the USD since we left the GS and we're too far gone from it at this point to return. permalink parent award report block reply Tmntnyc 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. Never. Boeing CEO just testified last year in Congress and admitted he got a 45% raise last year (38 million). The 500 machinists at Boeing  saw a 1% raise over 8 years. The wealth never trickles down automatically. You have to fight for it with unions or labor regulations or we would be paid in fucking scrips if they could permalink parent award report block reply anotherthing 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. It trickles down to the shareholders. It's the reason your retirement account just keeps on growing. permalink parent award report block reply view 3 more comments... dunkeaters 8 points 7 days ago With an expanding money supply it isn't possible to return to pre covid prices. The goal is to grow the real economy (wages vs. inflation) so that consumer prices return to the same relative proportion of income they used to be. permalink parent award report block reply SquiggyMcPepe 3 points 7 days ago Oh we will never see a complete return of course. But corporate margins are thick and there is plenty of room to narrow them if the proper 'incentives' are applied. One of the main tools will be to abolish the lobby. Completely. The main reason corps have grown out of control is because they bought the people who make the rules and laws and turned them in their favor. permalink parent award report block reply CJ74U2NV 7 points 7 days ago Those prices are inflationary adjustments to the Democrats living wage mantra. Every piece of crap unskilled worker is now making a lot of money. Because of that, the costs are passed along to the consumer. Then the Democrats will cry. We need more livable wage increases which will in turn drive prices up even further. After while, the economy collapses and you going to a depression. But that's what Democrats want. So they can have the government take everything over. It will make FDRs new deal look like mother Gooseland. permalink parent award report block reply flashersenpai 8 points 7 days ago Every piece of crap unskilled worker is now making a lot of money. they aren't, and lovely of you to describe them as pieces of crap. loser country club republican in action permalink parent award report block reply EDDIT_IS_CUCKED 2 points 7 days ago All of the people that work at fast food establishments are hired on making more money than I did out of college with a STEM degree 15 years ago. So yes, they are making a shitload of money, actually. Unless your argument is that these are skilled workers. If that's the case, we have a wildly different opinion of the term. permalink parent award report block reply view 5 more comments... Hanging_Chad 2 points 7 days ago have you seen government workers lately? permalink parent award report block reply Isolated_Patriot 4 points 7 days ago since it was a global disruption It's not the global disruption that is the problem, it's the number of US of A dollars printed in that time. Inflation WILL NOT DISAPPEAR. It's not going to magically revert to the number of dollars that existed pre-covid unless someone starts incinerating them. A strong economy that starts paying wages to supplement the difference is the ONLY solution to counter the inflation that isn't outright magical. Until people understand this, they are going to continue to yell at clouds about how \"Trump hasn't fixed anything yet!!!!\" permalink parent award report block reply bigbadchows2 4 points 7 days ago Been seeing Buter ball for .99 a pound. We actually did Prime Rib last year due to Turkey being over 2 a pound. I had purchased several who 13 bone prime rib for 5 a pound and the boys and I preferred it to Turkey. This year we got a Turkey, I hope day after Ham roasts are cheap my dogs always get a full ham for major holidays. However, I will never see the .49 a pound I paid 2019, I switched to pork loin, they don't really gaf what the get. I do agree, Trump has limited tools on reducing prices, we did however have some price leveling after the zirp o8-12 inflation. Not holding my breath but we are doing well on gas, so maybe in time it will freeze or come down a point or 2. permalink parent award report block reply Granny 4 points 7 days ago Yes I'm getting a butterball for.99¢ a pound. Last year was $1.19/lb. permalink parent award report block reply bigbadchows2 2 points 6 days ago Was almost 2 where I live and in 1 store it was working on 3. 1.19 is 20%, but nothing to get excited about. permalink parent award report block reply SquiggyMcPepe 2 points 7 days ago Meat is still fairly easy to get on the cheap and if you vacuum seal it before freezing you can load up during a particularly deep sale and have meat for months or even years. As a test I took a store bought vacuum sealed pork loin and let it set at the bottom of the freezer for three years. Thawed it and made a roast and it was just as fresh and tender as it would have been had I made it the day I bought it. permalink parent award report block reply CJ74U2NV 2 points 7 days ago Or from a local butcher. You'll get better quality, a cheaper price, and you're supporting local businesses. The meat is definitely not purchased from overseas. permalink parent award report block reply load 7 more comments...\ndr_gonzo 20 points 7 days ago No this is absolutely NOT true. We must do what happened in the 80s and create massive economic growth to make wages outpace what was lost to inflation. So what must be done to accomplish that? Well that's where we have problems because the Republicans no longer stand for liberty-centric economic policy, but if you did these 4 things, you would almost immediately see the 10% growth rates of the 19th century return: End the federal reserve and put us back on the gold standard to restrict future government spending and slam the brakes on inflation ELIMINATE socialist social welfare programs. That would include Medicare, Medicaid, Social Security and especially WELFARE. Congrats, you just saved 4.6 trillion a year in federal spending RE-abolish our progressive income tax. With this one, the 50% of Americans that actually pay income taxes after credits and deductions, just got a very significant raise which is what would encourage the economic growth Eliminate 90% of the fascistic regulatory state that was never supposed to exist in the first place and imposes 80,000 pages of regulations on Americans conducting business. That now consists of 2.5 MILLION bureaucrats. That number should be less than 100k when you're done If you do those 4 things, we return to the economy we THRIVED under for well over a century and produced the largest economic explosion in world history. In just 4 years time our GDP would go from 27 trillion to over 40 trillion. That's a 60k raise for every American, assuming it was distributed equally which admittedly wouldn't happen, but it gives you an idea of how much wealth is being lost to socialist bullshit. And all we need to do is return to our liberty-centric economic roots. permalink parent award report block reply DatTrumpDoh 7 points 7 days ago That second bullet is DOA. Even many conservative voters are against repealing those programs. permalink parent award report block reply ImportantPerson 5 points 7 days ago It's DOA because any moron that suggests getting rid of all social programs entirely is a fucking moron that doesn't understand the impact of why these programs exist in the first place.  Our GDP would not by skyrocketing because of this and ignorantly looking solely at translating the cost into deficit reduction is just bafflingly wrong. permalink parent award report block reply Glory-Unto-God 1 points 7 days ago Would take a dictator to get it done. People will eventually have to come to terms with the choices Benevolent dictator who loves his people. Or daughters raped in the street. That hill is rapidly approaching. permalink parent award report block reply doomerglowie2 2 points 6 days ago How does your 4 economic things help our greatest ally and other foreign powers that own our Government? Asking for a supervisor. permalink parent award report block reply HOSEQ 1 points 6 days ago Well, First you have to (S)Elect a Muslim for Mayor of the Money Capitol of the World, see??? Then you.... permalink parent award report block reply Damadhatter 1 points 6 days ago First bullet point - while it would be really cool in some ways, would destroy the USD and the revolt world wide would be too eliminate the USD as the monetary trade standard. There's too many dollars out there at this point and not enough gold to cover a gold standard and maintain the global currency status. That global standing has been what has insulated the USD since we left the GS and we're too far gone from it at this point to return. permalink parent award report block reply Tmntnyc 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. Never. Boeing CEO just testified last year in Congress and admitted he got a 45% raise last year (38 million). The 500 machinists at Boeing  saw a 1% raise over 8 years. The wealth never trickles down automatically. You have to fight for it with unions or labor regulations or we would be paid in fucking scrips if they could permalink parent award report block reply anotherthing 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. It trickles down to the shareholders. It's the reason your retirement account just keeps on growing. permalink parent award report block reply view 3 more comments...\nDatTrumpDoh 7 points 7 days ago That second bullet is DOA. Even many conservative voters are against repealing those programs. permalink parent award report block reply ImportantPerson 5 points 7 days ago It's DOA because any moron that suggests getting rid of all social programs entirely is a fucking moron that doesn't understand the impact of why these programs exist in the first place.  Our GDP would not by skyrocketing because of this and ignorantly looking solely at translating the cost into deficit reduction is just bafflingly wrong. permalink parent award report block reply Glory-Unto-God 1 points 7 days ago Would take a dictator to get it done. People will eventually have to come to terms with the choices Benevolent dictator who loves his people. Or daughters raped in the street. That hill is rapidly approaching. permalink parent award report block reply\nImportantPerson 5 points 7 days ago It's DOA because any moron that suggests getting rid of all social programs entirely is a fucking moron that doesn't understand the impact of why these programs exist in the first place.  Our GDP would not by skyrocketing because of this and ignorantly looking solely at translating the cost into deficit reduction is just bafflingly wrong. permalink parent award report block reply\nGlory-Unto-God 1 points 7 days ago Would take a dictator to get it done. People will eventually have to come to terms with the choices Benevolent dictator who loves his people. Or daughters raped in the street. That hill is rapidly approaching. permalink parent award report block reply\ndoomerglowie2 2 points 6 days ago How does your 4 economic things help our greatest ally and other foreign powers that own our Government? Asking for a supervisor. permalink parent award report block reply HOSEQ 1 points 6 days ago Well, First you have to (S)Elect a Muslim for Mayor of the Money Capitol of the World, see??? Then you.... permalink parent award report block reply\nHOSEQ 1 points 6 days ago Well, First you have to (S)Elect a Muslim for Mayor of the Money Capitol of the World, see??? Then you.... permalink parent award report block reply\nDamadhatter 1 points 6 days ago First bullet point - while it would be really cool in some ways, would destroy the USD and the revolt world wide would be too eliminate the USD as the monetary trade standard. There's too many dollars out there at this point and not enough gold to cover a gold standard and maintain the global currency status. That global standing has been what has insulated the USD since we left the GS and we're too far gone from it at this point to return. permalink parent award report block reply\nTmntnyc 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. Never. Boeing CEO just testified last year in Congress and admitted he got a 45% raise last year (38 million). The 500 machinists at Boeing  saw a 1% raise over 8 years. The wealth never trickles down automatically. You have to fight for it with unions or labor regulations or we would be paid in fucking scrips if they could permalink parent award report block reply anotherthing 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. It trickles down to the shareholders. It's the reason your retirement account just keeps on growing. permalink parent award report block reply view 3 more comments...\nanotherthing 1 points 6 days ago Corporate profits are through the fucking roof. The wealth never trickles down to wages. It trickles down to the shareholders. It's the reason your retirement account just keeps on growing. permalink parent award report block reply view 3 more comments...\ndunkeaters 8 points 7 days ago With an expanding money supply it isn't possible to return to pre covid prices. The goal is to grow the real economy (wages vs. inflation) so that consumer prices return to the same relative proportion of income they used to be. permalink parent award report block reply SquiggyMcPepe 3 points 7 days ago Oh we will never see a complete return of course. But corporate margins are thick and there is plenty of room to narrow them if the proper 'incentives' are applied. One of the main tools will be to abolish the lobby. Completely. The main reason corps have grown out of control is because they bought the people who make the rules and laws and turned them in their favor. permalink parent award report block reply\nSquiggyMcPepe 3 points 7 days ago Oh we will never see a complete return of course. But corporate margins are thick and there is plenty of room to narrow them if the proper 'incentives' are applied. One of the main tools will be to abolish the lobby. Completely. The main reason corps have grown out of control is because they bought the people who make the rules and laws and turned them in their favor. permalink parent award report block reply\nCJ74U2NV 7 points 7 days ago Those prices are inflationary adjustments to the Democrats living wage mantra. Every piece of crap unskilled worker is now making a lot of money. Because of that, the costs are passed along to the consumer. Then the Democrats will cry. We need more livable wage increases which will in turn drive prices up even further. After while, the economy collapses and you going to a depression. But that's what Democrats want. So they can have the government take everything over. It will make FDRs new deal look like mother Gooseland. permalink parent award report block reply flashersenpai 8 points 7 days ago Every piece of crap unskilled worker is now making a lot of money. they aren't, and lovely of you to describe them as pieces of crap. loser country club republican in action permalink parent award report block reply EDDIT_IS_CUCKED 2 points 7 days ago All of the people that work at fast food establishments are hired on making more money than I did out of college with a STEM degree 15 years ago. So yes, they are making a shitload of money, actually. Unless your argument is that these are skilled workers. If that's the case, we have a wildly different opinion of the term. permalink parent award report block reply view 5 more comments... Hanging_Chad 2 points 7 days ago have you seen government workers lately? permalink parent award report block reply\nflashersenpai 8 points 7 days ago Every piece of crap unskilled worker is now making a lot of money. they aren't, and lovely of you to describe them as pieces of crap. loser country club republican in action permalink parent award report block reply EDDIT_IS_CUCKED 2 points 7 days ago All of the people that work at fast food establishments are hired on making more money than I did out of college with a STEM degree 15 years ago. So yes, they are making a shitload of money, actually. Unless your argument is that these are skilled workers. If that's the case, we have a wildly different opinion of the term. permalink parent award report block reply view 5 more comments... Hanging_Chad 2 points 7 days ago have you seen government workers lately? permalink parent award report block reply\nEDDIT_IS_CUCKED 2 points 7 days ago All of the people that work at fast food establishments are hired on making more money than I did out of college with a STEM degree 15 years ago. So yes, they are making a shitload of money, actually. Unless your argument is that these are skilled workers. If that's the case, we have a wildly different opinion of the term. permalink parent award report block reply view 5 more comments...\nHanging_Chad 2 points 7 days ago have you seen government workers lately? permalink parent award report block reply\nIsolated_Patriot 4 points 7 days ago since it was a global disruption It's not the global disruption that is the problem, it's the number of US of A dollars printed in that time. Inflation WILL NOT DISAPPEAR. It's not going to magically revert to the number of dollars that existed pre-covid unless someone starts incinerating them. A strong economy that starts paying wages to supplement the difference is the ONLY solution to counter the inflation that isn't outright magical. Until people understand this, they are going to continue to yell at clouds about how \"Trump hasn't fixed anything yet!!!!\" permalink parent award report block reply\nbigbadchows2 4 points 7 days ago Been seeing Buter ball for .99 a pound. We actually did Prime Rib last year due to Turkey being over 2 a pound. I had purchased several who 13 bone prime rib for 5 a pound and the boys and I preferred it to Turkey. This year we got a Turkey, I hope day after Ham roasts are cheap my dogs always get a full ham for major holidays. However, I will never see the .49 a pound I paid 2019, I switched to pork loin, they don't really gaf what the get. I do agree, Trump has limited tools on reducing prices, we did however have some price leveling after the zirp o8-12 inflation. Not holding my breath but we are doing well on gas, so maybe in time it will freeze or come down a point or 2. permalink parent award report block reply Granny 4 points 7 days ago Yes I'm getting a butterball for.99¢ a pound. Last year was $1.19/lb. permalink parent award report block reply bigbadchows2 2 points 6 days ago Was almost 2 where I live and in 1 store it was working on 3. 1.19 is 20%, but nothing to get excited about. permalink parent award report block reply SquiggyMcPepe 2 points 7 days ago Meat is still fairly easy to get on the cheap and if you vacuum seal it before freezing you can load up during a particularly deep sale and have meat for months or even years. As a test I took a store bought vacuum sealed pork loin and let it set at the bottom of the freezer for three years. Thawed it and made a roast and it was just as fresh and tender as it would have been had I made it the day I bought it. permalink parent award report block reply CJ74U2NV 2 points 7 days ago Or from a local butcher. You'll get better quality, a cheaper price, and you're supporting local businesses. The meat is definitely not purchased from overseas. permalink parent award report block reply\nGranny 4 points 7 days ago Yes I'm getting a butterball for.99¢ a pound. Last year was $1.19/lb. permalink parent award report block reply bigbadchows2 2 points 6 days ago Was almost 2 where I live and in 1 store it was working on 3. 1.19 is 20%, but nothing to get excited about. permalink parent award report block reply\nbigbadchows2 2 points 6 days ago Was almost 2 where I live and in 1 store it was working on 3. 1.19 is 20%, but nothing to get excited about. permalink parent award report block reply\nSquiggyMcPepe 2 points 7 days ago Meat is still fairly easy to get on the cheap and if you vacuum seal it before freezing you can load up during a particularly deep sale and have meat for months or even years. As a test I took a store bought vacuum sealed pork loin and let it set at the bottom of the freezer for three years. Thawed it and made a roast and it was just as fresh and tender as it would have been had I made it the day I bought it. permalink parent award report block reply CJ74U2NV 2 points 7 days ago Or from a local butcher. You'll get better quality, a cheaper price, and you're supporting local businesses. The meat is definitely not purchased from overseas. permalink parent award report block reply\nCJ74U2NV 2 points 7 days ago Or from a local butcher. You'll get better quality, a cheaper price, and you're supporting local businesses. The meat is definitely not purchased from overseas. permalink parent award report block reply\nBigMikesChef 26 points 7 days ago I have seen no improvement in any bills or expenses at all. permalink parent award report block reply mikejones 19 points 7 days ago Cell phone, Internet, energy, rent, insurance. All goes up. Food eating out goes up. Car repairs, daily items from the store. Not sure what is going down. Maybe some food on sale. permalink parent award report block reply DoYouLikeFishsticks 14 points 7 days ago Everything is going up and never going to go down as far as I’m concerned permalink parent award report block reply geekesmind 4 points 7 days ago yep went to pay rent today got told now 7.99 service charge to pay it. WTF permalink parent award report block reply chickeninoven 2 points 7 days ago hand out with finger pointing into palm permalink parent award report block reply ImportantPerson 1 points 7 days ago I just paid $3.50 for a pound of ground beef.  That's the lowest it's been in a decade.  Eggs are back to being one of the cheapest healthy meal you can buy.  Chicken has been stable even throughout COVID. The only people who aren't seeing any changes are people buying marketing, not products.  The \"grass fed\" beef isn't going to go down in price.  The organic whatever is not going down in price.  These products are targeting the stupid and ignorant. If you aren't seeing any changes, then go to a different grocery store because you are getting screwed where you are going now. permalink parent award report block reply The_Nowhere_Man 1 points 7 days ago All of them in my town and the town next to mine are within a few pennies of each other on meat prices. Lower than it was right after 2020 but far from being brag worthy. Pound of the cheap hamburger is like $6-something. I go to the local butcher instead and get it for $4-something a pound. permalink parent award report block reply\nmikejones 19 points 7 days ago Cell phone, Internet, energy, rent, insurance. All goes up. Food eating out goes up. Car repairs, daily items from the store. Not sure what is going down. Maybe some food on sale. permalink parent award report block reply\nDoYouLikeFishsticks 14 points 7 days ago Everything is going up and never going to go down as far as I’m concerned permalink parent award report block reply geekesmind 4 points 7 days ago yep went to pay rent today got told now 7.99 service charge to pay it. WTF permalink parent award report block reply chickeninoven 2 points 7 days ago hand out with finger pointing into palm permalink parent award report block reply\ngeekesmind 4 points 7 days ago yep went to pay rent today got told now 7.99 service charge to pay it. WTF permalink parent award report block reply chickeninoven 2 points 7 days ago hand out with finger pointing into palm permalink parent award report block reply\nchickeninoven 2 points 7 days ago hand out with finger pointing into palm permalink parent award report block reply\nImportantPerson 1 points 7 days ago I just paid $3.50 for a pound of ground beef.  That's the lowest it's been in a decade.  Eggs are back to being one of the cheapest healthy meal you can buy.  Chicken has been stable even throughout COVID. The only people who aren't seeing any changes are people buying marketing, not products.  The \"grass fed\" beef isn't going to go down in price.  The organic whatever is not going down in price.  These products are targeting the stupid and ignorant. If you aren't seeing any changes, then go to a different grocery store because you are getting screwed where you are going now. permalink parent award report block reply The_Nowhere_Man 1 points 7 days ago All of them in my town and the town next to mine are within a few pennies of each other on meat prices. Lower than it was right after 2020 but far from being brag worthy. Pound of the cheap hamburger is like $6-something. I go to the local butcher instead and get it for $4-something a pound. permalink parent award report block reply\nThe_Nowhere_Man 1 points 7 days ago All of them in my town and the town next to mine are within a few pennies of each other on meat prices. Lower than it was right after 2020 but far from being brag worthy. Pound of the cheap hamburger is like $6-something. I go to the local butcher instead and get it for $4-something a pound. permalink parent award report block reply\nNotYourMan 7 points 7 days ago Food inflation is bad right now.  Remember in 2021 democrats printed $5 trillion dollars and the \"fake\" Inflation Reduction Act.  Both of these caused a 20% increase in food cost accumulative.  But the real inflation is over 45% because of energy and housing.  Trump is fixing the energy but the food prices are staying around.  Remember when democrats decided to shutdown \"the supply chain\" for six months to one year.  That also caused a delayed increase in food cost that we are suffering from now.  ITS THE DEMOCRATS FAULT. permalink parent award report block reply Bythrfruitsyknow 3 points 7 days ago Good job the Republicans got back in office and immediately cut the trillion dollar deficits, amirite? permalink parent award report block reply\nBythrfruitsyknow 3 points 7 days ago Good job the Republicans got back in office and immediately cut the trillion dollar deficits, amirite? permalink parent award report block reply\nPitfallHarry 3 points 7 days ago It is true. Trump has said that gas and grocery prices are down so they are. End of story. permalink parent award report block reply\nFor_All_Mankind 59 points 7 days ago Delusional. Dude hasn’t shopped for food a day in his life. And he can afford any thing he wants. Prices are not down at grocery stores. permalink award report block reply KrakenWakin4JoeBacon 25 points 7 days ago Yeah, not gonna lie… it rubs me the wrong way when he brags about the greatly improved affordability at the grocery store. It’s not about butter being 25 cents less expensive than it was a year ago. No one gives a shit about paying 25 cents more or less for a single item. It’s about the cumulative cost of the 30 items in my grocery cart, and the fact I’ll fill up my cart with 30+ items that I need to purchase not once per month but multiple times per month. So it’s about the reality that grocery shopping costs a shitload. As a whole, it’s too expensive. And if it’s improving, that’s great — but — it is not less expensive to any significant degree. Trump needs to become aware of this & someone in his admin is dropping the fucking ball by not letting him know. He should not be using reduced prices as a positive talking point because people aren’t feeling it. To many I’m sure it’s perceived as gaslighting. permalink parent award report block reply Hattmall -2 points 7 days ago There's very little Trump can do to influence demand based branded products. As long as people pay the inflated prices the price will remain high. The reality is that staple goods and generic items are as cheap or cheaper than pre-pandemic. I buy a lot of groceries and have been closely monitoring these prices for a decade. So no something like Doritos or Digorno frozen pizza isn't going to get cheaper unless demand drops. Which delaying SNAP payments may have a nice impact.  Eggs,Beef and orange juice are still high but price disruptions have always been a thing.  Milk, cheese, oats, flour, fruit, vegetables, canned goods, chicken, turkey, seafood, yogurt, potatoes, other juices, are all down. Coffee and bread are at the upper end of normal pricing. Nuts are variable, remaining somewhat high but within normal bounds. permalink parent award report block reply DrWeeGee 5 points 7 days ago This. permalink parent award report block reply logan34 4 points 7 days ago 25% down? where exactly??? permalink parent award report block reply ImportantPerson -3 points 7 days ago Prices are down.  If you don't see it, then you need to go to different grocery stores.  I don't know what to tell you but you are getting duped if you are still paying outrageous prices for common items. Right now, I can search 4 different grocery stores that are in my area.  All 4 of them have different prices for common items.  A dozen eggs cost $4 at one store and $2 at another store.  Beef is $3.50 at one store and $6 at another. When we were growing up, we would check for coupons and sales and buy those items.  So many people now go to the store and buy the same items regardless of if they are on sale or have any coupons.  A fool and their money... permalink parent award report block reply\nKrakenWakin4JoeBacon 25 points 7 days ago Yeah, not gonna lie… it rubs me the wrong way when he brags about the greatly improved affordability at the grocery store. It’s not about butter being 25 cents less expensive than it was a year ago. No one gives a shit about paying 25 cents more or less for a single item. It’s about the cumulative cost of the 30 items in my grocery cart, and the fact I’ll fill up my cart with 30+ items that I need to purchase not once per month but multiple times per month. So it’s about the reality that grocery shopping costs a shitload. As a whole, it’s too expensive. And if it’s improving, that’s great — but — it is not less expensive to any significant degree. Trump needs to become aware of this & someone in his admin is dropping the fucking ball by not letting him know. He should not be using reduced prices as a positive talking point because people aren’t feeling it. To many I’m sure it’s perceived as gaslighting. permalink parent award report block reply Hattmall -2 points 7 days ago There's very little Trump can do to influence demand based branded products. As long as people pay the inflated prices the price will remain high. The reality is that staple goods and generic items are as cheap or cheaper than pre-pandemic. I buy a lot of groceries and have been closely monitoring these prices for a decade. So no something like Doritos or Digorno frozen pizza isn't going to get cheaper unless demand drops. Which delaying SNAP payments may have a nice impact.  Eggs,Beef and orange juice are still high but price disruptions have always been a thing.  Milk, cheese, oats, flour, fruit, vegetables, canned goods, chicken, turkey, seafood, yogurt, potatoes, other juices, are all down. Coffee and bread are at the upper end of normal pricing. Nuts are variable, remaining somewhat high but within normal bounds. permalink parent award report block reply\nHattmall -2 points 7 days ago There's very little Trump can do to influence demand based branded products. As long as people pay the inflated prices the price will remain high. The reality is that staple goods and generic items are as cheap or cheaper than pre-pandemic. I buy a lot of groceries and have been closely monitoring these prices for a decade. So no something like Doritos or Digorno frozen pizza isn't going to get cheaper unless demand drops. Which delaying SNAP payments may have a nice impact.  Eggs,Beef and orange juice are still high but price disruptions have always been a thing.  Milk, cheese, oats, flour, fruit, vegetables, canned goods, chicken, turkey, seafood, yogurt, potatoes, other juices, are all down. Coffee and bread are at the upper end of normal pricing. Nuts are variable, remaining somewhat high but within normal bounds. permalink parent award report block reply\nDrWeeGee 5 points 7 days ago This. permalink parent award report block reply\nlogan34 4 points 7 days ago 25% down? where exactly??? permalink parent award report block reply\nImportantPerson -3 points 7 days ago Prices are down.  If you don't see it, then you need to go to different grocery stores.  I don't know what to tell you but you are getting duped if you are still paying outrageous prices for common items. Right now, I can search 4 different grocery stores that are in my area.  All 4 of them have different prices for common items.  A dozen eggs cost $4 at one store and $2 at another store.  Beef is $3.50 at one store and $6 at another. When we were growing up, we would check for coupons and sales and buy those items.  So many people now go to the store and buy the same items regardless of if they are on sale or have any coupons.  A fool and their money... permalink parent award report block reply\ntribunabessica 30 points 7 days ago Who feeds him these bulshit numbers? permalink award report block reply flashersenpai 11 points 7 days ago i have no proof but i don't like wiles so I'll blame her lol permalink parent award report block reply gottarememberpasswor 8 points 7 days ago I would genuinely love to know permalink parent award report block reply Imnotnorm 2 points 7 days ago Suzy Wiles and Lindsay Graham permalink parent award report block reply bumpman 1 points 7 days ago Prices are actually recently dropping but it’s because ebt didn’t go out this month, plus gov employees are not working, plus I also noticed a lot less illegals st the store lately All of these factors mean higher supply + lower demand, which means cutring prices to move inventory permalink parent award report block reply Obambi 0 points 7 days ago Women permalink parent award report block reply\nflashersenpai 11 points 7 days ago i have no proof but i don't like wiles so I'll blame her lol permalink parent award report block reply\ngottarememberpasswor 8 points 7 days ago I would genuinely love to know permalink parent award report block reply\nImnotnorm 2 points 7 days ago Suzy Wiles and Lindsay Graham permalink parent award report block reply\nbumpman 1 points 7 days ago Prices are actually recently dropping but it’s because ebt didn’t go out this month, plus gov employees are not working, plus I also noticed a lot less illegals st the store lately All of these factors mean higher supply + lower demand, which means cutring prices to move inventory permalink parent award report block reply\nObambi 0 points 7 days ago Women permalink parent award report block reply\nBldg_2019 27 points 7 days ago For every 12% increase in EBT use from 21-24, there was a 1% increase in the price of food. EBT increased during that period by about 150%. There are other factors, but that’s a BIG one. permalink award report block reply Captainlizard 17 points 7 days ago Finally someone says it. EBT increases grocery prices just as federal government loans increase the price of higher education. It's a huge problem. permalink parent award report block reply Awakened 9 points 7 days ago Are you suggesting that government subsidies lead to higher prices? Shocking I tell you! permalink parent award report block reply SilverStarv5 3 points 7 days ago Same story as college tuition permalink parent award report block reply ADAM_SCHITT 1 points 7 days ago And Healthcare permalink parent award report block reply LibertyStillMatters 4 points 7 days ago That’s interesting.  I’ve never heard that before.  Very important message to get out there if so. permalink parent award report block reply gravenspine 9 points 7 days ago This applies to college. Insurance. Food. Healthcare. Not only do you subsidize them, but you compete on the market with their spending. permalink parent award report block reply Pnw4gotpwd 2 points 7 days ago This comment is succinct and correct permalink parent award report block reply Deplorable_in_PA 1 points 7 days ago Sure.  It's like Section 8 where there is a distorted market.  I could easily see the same for EBT since it's 25% of Wal Mart's income. permalink parent award report block reply\nCaptainlizard 17 points 7 days ago Finally someone says it. EBT increases grocery prices just as federal government loans increase the price of higher education. It's a huge problem. permalink parent award report block reply\nAwakened 9 points 7 days ago Are you suggesting that government subsidies lead to higher prices? Shocking I tell you! permalink parent award report block reply SilverStarv5 3 points 7 days ago Same story as college tuition permalink parent award report block reply ADAM_SCHITT 1 points 7 days ago And Healthcare permalink parent award report block reply\nSilverStarv5 3 points 7 days ago Same story as college tuition permalink parent award report block reply ADAM_SCHITT 1 points 7 days ago And Healthcare permalink parent award report block reply\nADAM_SCHITT 1 points 7 days ago And Healthcare permalink parent award report block reply\nLibertyStillMatters 4 points 7 days ago That’s interesting.  I’ve never heard that before.  Very important message to get out there if so. permalink parent award report block reply gravenspine 9 points 7 days ago This applies to college. Insurance. Food. Healthcare. Not only do you subsidize them, but you compete on the market with their spending. permalink parent award report block reply Pnw4gotpwd 2 points 7 days ago This comment is succinct and correct permalink parent award report block reply\ngravenspine 9 points 7 days ago This applies to college. Insurance. Food. Healthcare. Not only do you subsidize them, but you compete on the market with their spending. permalink parent award report block reply Pnw4gotpwd 2 points 7 days ago This comment is succinct and correct permalink parent award report block reply\nPnw4gotpwd 2 points 7 days ago This comment is succinct and correct permalink parent award report block reply\nDeplorable_in_PA 1 points 7 days ago Sure.  It's like Section 8 where there is a distorted market.  I could easily see the same for EBT since it's 25% of Wal Mart's income. permalink parent award report block reply\ngottarememberpasswor 23 points 7 days ago This is verifiable bullshit as I've been keeping track of these prices for the last several years. I thought we had a higher standard than this for bullshitting permalink award report block reply\norange_kek_great 19 points 7 days ago Big fucking deal. It's 25% down but still up at record highs. Quit talking to us like we're all fucking stupid. permalink award report block reply\nSeldom_Seen_Kid 17 points 7 days ago Betting they’ll raise prices on non-related to Thanksgiving items to make up for it. permalink award report block reply UsernameChexOut 14 points 7 days ago Walmart has been jacking up the prices recently on all sorts of things. It's been out of control price hikes over here at Walmart. So I'm pressing F to doubt. Maybe they gamed the Thanksgiving numbers as you said but they certainly skyrocketed prices on everything else recently over here. permalink parent award report block reply Klaus73 4 points 7 days ago If I were to guess - supply chain is making the turkeys regardless - Walmart probably orders LONG in advance and might aswell eat the cost and maybe get ancillary sales or atleast clear out as opposed to not selling anything. permalink parent award report block reply deleted 11 points 7 days ago MasterChief 1 points 7 days ago this permalink parent award report block reply ImportantPerson 0 points 7 days ago The walmart in my area currently has the cheapest beef, chicken, eggs, most \"fresh\" vegetables, bread and dairy.  The only thing that's significantly more expensive at walmart is soda. Not sure where everyone is seeing that they are jacking their prices up on \"everything\".  My guess is that they are full of shit  especially when they say \"everything\". permalink parent award report block reply UsernameChexOut 2 points 7 days ago We've stopped shopping for food at Walmart, it no longer really makes sense. I think Walmart gets by on the convenience of a one stop shop and the fact that they may be the only game in town in more rural areas. Overall though, the prices seem higher and every time we walk by they seem to get more and more crazy. For us, Trader Joe's, Costco and Kroger are in one area and are an easy stop. Between those, not only do you get better quality food, it also ends up being significantly cheaper. The stuff that we end up shopping for at Walmart are non-food items and there have been multiple price hikes recently to the point that we now only go there for stuff that we need immediately. If I need charcoal, butter, corn and I'll pick up some hot wheels for the kids, then it's Walmart. But the overall prices for all these items individually now make sense to buy from other stores when you're there anyways. permalink parent award report block reply ImportantPerson 2 points 6 days ago Walmart does get by on the convenience of the one stop shop but that only works when there are some prices that will bring people to the stop.  If you go to walmart and buy everything, you are going to be paying more because the higher marked up items are marked up a lot more. Like I said, I can buy eggs, beef and dairy from walmart for cheaper than I can anywhere else in the area but if I want other things, often times junk food like soda and chips, walmart is significantly more expensive.  They know their audience.  Their audience buys junkfood. permalink parent award report block reply\nUsernameChexOut 14 points 7 days ago Walmart has been jacking up the prices recently on all sorts of things. It's been out of control price hikes over here at Walmart. So I'm pressing F to doubt. Maybe they gamed the Thanksgiving numbers as you said but they certainly skyrocketed prices on everything else recently over here. permalink parent award report block reply Klaus73 4 points 7 days ago If I were to guess - supply chain is making the turkeys regardless - Walmart probably orders LONG in advance and might aswell eat the cost and maybe get ancillary sales or atleast clear out as opposed to not selling anything. permalink parent award report block reply deleted 11 points 7 days ago MasterChief 1 points 7 days ago this permalink parent award report block reply ImportantPerson 0 points 7 days ago The walmart in my area currently has the cheapest beef, chicken, eggs, most \"fresh\" vegetables, bread and dairy.  The only thing that's significantly more expensive at walmart is soda. Not sure where everyone is seeing that they are jacking their prices up on \"everything\".  My guess is that they are full of shit  especially when they say \"everything\". permalink parent award report block reply UsernameChexOut 2 points 7 days ago We've stopped shopping for food at Walmart, it no longer really makes sense. I think Walmart gets by on the convenience of a one stop shop and the fact that they may be the only game in town in more rural areas. Overall though, the prices seem higher and every time we walk by they seem to get more and more crazy. For us, Trader Joe's, Costco and Kroger are in one area and are an easy stop. Between those, not only do you get better quality food, it also ends up being significantly cheaper. The stuff that we end up shopping for at Walmart are non-food items and there have been multiple price hikes recently to the point that we now only go there for stuff that we need immediately. If I need charcoal, butter, corn and I'll pick up some hot wheels for the kids, then it's Walmart. But the overall prices for all these items individually now make sense to buy from other stores when you're there anyways. permalink parent award report block reply ImportantPerson 2 points 6 days ago Walmart does get by on the convenience of the one stop shop but that only works when there are some prices that will bring people to the stop.  If you go to walmart and buy everything, you are going to be paying more because the higher marked up items are marked up a lot more. Like I said, I can buy eggs, beef and dairy from walmart for cheaper than I can anywhere else in the area but if I want other things, often times junk food like soda and chips, walmart is significantly more expensive.  They know their audience.  Their audience buys junkfood. permalink parent award report block reply\nKlaus73 4 points 7 days ago If I were to guess - supply chain is making the turkeys regardless - Walmart probably orders LONG in advance and might aswell eat the cost and maybe get ancillary sales or atleast clear out as opposed to not selling anything. permalink parent award report block reply deleted 11 points 7 days ago MasterChief 1 points 7 days ago this permalink parent award report block reply\ndeleted 11 points 7 days ago MasterChief 1 points 7 days ago this permalink parent award report block reply\nMasterChief 1 points 7 days ago this permalink parent award report block reply\nImportantPerson 0 points 7 days ago The walmart in my area currently has the cheapest beef, chicken, eggs, most \"fresh\" vegetables, bread and dairy.  The only thing that's significantly more expensive at walmart is soda. Not sure where everyone is seeing that they are jacking their prices up on \"everything\".  My guess is that they are full of shit  especially when they say \"everything\". permalink parent award report block reply UsernameChexOut 2 points 7 days ago We've stopped shopping for food at Walmart, it no longer really makes sense. I think Walmart gets by on the convenience of a one stop shop and the fact that they may be the only game in town in more rural areas. Overall though, the prices seem higher and every time we walk by they seem to get more and more crazy. For us, Trader Joe's, Costco and Kroger are in one area and are an easy stop. Between those, not only do you get better quality food, it also ends up being significantly cheaper. The stuff that we end up shopping for at Walmart are non-food items and there have been multiple price hikes recently to the point that we now only go there for stuff that we need immediately. If I need charcoal, butter, corn and I'll pick up some hot wheels for the kids, then it's Walmart. But the overall prices for all these items individually now make sense to buy from other stores when you're there anyways. permalink parent award report block reply ImportantPerson 2 points 6 days ago Walmart does get by on the convenience of the one stop shop but that only works when there are some prices that will bring people to the stop.  If you go to walmart and buy everything, you are going to be paying more because the higher marked up items are marked up a lot more. Like I said, I can buy eggs, beef and dairy from walmart for cheaper than I can anywhere else in the area but if I want other things, often times junk food like soda and chips, walmart is significantly more expensive.  They know their audience.  Their audience buys junkfood. permalink parent award report block reply\nUsernameChexOut 2 points 7 days ago We've stopped shopping for food at Walmart, it no longer really makes sense. I think Walmart gets by on the convenience of a one stop shop and the fact that they may be the only game in town in more rural areas. Overall though, the prices seem higher and every time we walk by they seem to get more and more crazy. For us, Trader Joe's, Costco and Kroger are in one area and are an easy stop. Between those, not only do you get better quality food, it also ends up being significantly cheaper. The stuff that we end up shopping for at Walmart are non-food items and there have been multiple price hikes recently to the point that we now only go there for stuff that we need immediately. If I need charcoal, butter, corn and I'll pick up some hot wheels for the kids, then it's Walmart. But the overall prices for all these items individually now make sense to buy from other stores when you're there anyways. permalink parent award report block reply ImportantPerson 2 points 6 days ago Walmart does get by on the convenience of the one stop shop but that only works when there are some prices that will bring people to the stop.  If you go to walmart and buy everything, you are going to be paying more because the higher marked up items are marked up a lot more. Like I said, I can buy eggs, beef and dairy from walmart for cheaper than I can anywhere else in the area but if I want other things, often times junk food like soda and chips, walmart is significantly more expensive.  They know their audience.  Their audience buys junkfood. permalink parent award report block reply\nImportantPerson 2 points 6 days ago Walmart does get by on the convenience of the one stop shop but that only works when there are some prices that will bring people to the stop.  If you go to walmart and buy everything, you are going to be paying more because the higher marked up items are marked up a lot more. Like I said, I can buy eggs, beef and dairy from walmart for cheaper than I can anywhere else in the area but if I want other things, often times junk food like soda and chips, walmart is significantly more expensive.  They know their audience.  Their audience buys junkfood. permalink parent award report block reply\nDingleBalls 16 points 7 days ago But Biden saved us 16c on hotdogs or some shit for 4th of july! permalink award report block reply FUCK_TYLER 2 points 6 days ago yup, read my mind brother permalink parent award report block reply\nFUCK_TYLER 2 points 6 days ago yup, read my mind brother permalink parent award report block reply\nLordKuroTheGreat 14 points 7 days ago I wonder how that compares percentage-wise to the upward creep that's been going on all fall. permalink award report block reply\nLigersrule1 14 points 7 days ago Fuck walmart permalink award report block reply Mountaineer 8 points 7 days ago In the ass with a pineapple. Fuck the Waltons too. permalink parent award report block reply ActNow 3 points 7 days ago Tell us how you really feel. Lol. permalink parent award report block reply geekesmind 3 points 7 days ago hums the The Waltons theme song oh wait that's different Waltons  OOPS permalink parent award report block reply thunderpussy 1 points 6 days ago LMAO! permalink parent award report block reply\nMountaineer 8 points 7 days ago In the ass with a pineapple. Fuck the Waltons too. permalink parent award report block reply ActNow 3 points 7 days ago Tell us how you really feel. Lol. permalink parent award report block reply geekesmind 3 points 7 days ago hums the The Waltons theme song oh wait that's different Waltons  OOPS permalink parent award report block reply thunderpussy 1 points 6 days ago LMAO! permalink parent award report block reply\nActNow 3 points 7 days ago Tell us how you really feel. Lol. permalink parent award report block reply\ngeekesmind 3 points 7 days ago hums the The Waltons theme song oh wait that's different Waltons  OOPS permalink parent award report block reply\nthunderpussy 1 points 6 days ago LMAO! permalink parent award report block reply\nPnw4gotpwd 13 points 7 days ago The grocery prices right now are FUCKED, and his messaging on this and the job market are not having the desired effect, because people feel he's gas lighting them. And that's just the truth. People who work are hurting right now permalink award report block reply starjello 10 points 7 days ago Yesterdays elections are showing that clearly. permalink parent award report block reply Pnw4gotpwd 6 points 7 days ago Damn right. We know who's fault it is that things are as fucked as they are. But a lot of people are just plain desperate. And that's not good. At all. I like trump and think he's doing a lot of great things policy wise but addressing and correcting the prices for bare necessities, dealing with out of control crime, and restoring faith in open and transparent government (which the East wing demolition and how it was handled did a lot to damage) are far more important than \"owning\" the Dems. We need to own the fuckers on election day. permalink parent award report block reply geekesmind 4 points 7 days ago yeah spending 100+ a week on what looks like NOTHING but people on EBT get to load their carts up FULL with steak, lobster, frozen food, snack cakes, soda and ETC and I am getting things like potatoes, bread, pasta and etc struggling working 50+ hours a week while the freeloaders GET IT ALL! permalink parent award report block reply mikejones 3 points 7 days ago Would rather work 50 hours knowing I'll be okay. Could go the other route but imagine you get cut off one day with no skills. permalink parent award report block reply Pnw4gotpwd 2 points 7 days ago On the plus side I'm getting stronger as I get older... I can lift 100 bucks worth of groceries with one hand! permalink parent award report block reply Pnw4gotpwd 2 points 7 days ago This and the East wing (which could have been handled WAY better than it was from a communications standpoint) are kinda screwing up. And are pulling normies into trusting him far less permalink parent award report block reply\nstarjello 10 points 7 days ago Yesterdays elections are showing that clearly. permalink parent award report block reply Pnw4gotpwd 6 points 7 days ago Damn right. We know who's fault it is that things are as fucked as they are. But a lot of people are just plain desperate. And that's not good. At all. I like trump and think he's doing a lot of great things policy wise but addressing and correcting the prices for bare necessities, dealing with out of control crime, and restoring faith in open and transparent government (which the East wing demolition and how it was handled did a lot to damage) are far more important than \"owning\" the Dems. We need to own the fuckers on election day. permalink parent award report block reply\nPnw4gotpwd 6 points 7 days ago Damn right. We know who's fault it is that things are as fucked as they are. But a lot of people are just plain desperate. And that's not good. At all. I like trump and think he's doing a lot of great things policy wise but addressing and correcting the prices for bare necessities, dealing with out of control crime, and restoring faith in open and transparent government (which the East wing demolition and how it was handled did a lot to damage) are far more important than \"owning\" the Dems. We need to own the fuckers on election day. permalink parent award report block reply\ngeekesmind 4 points 7 days ago yeah spending 100+ a week on what looks like NOTHING but people on EBT get to load their carts up FULL with steak, lobster, frozen food, snack cakes, soda and ETC and I am getting things like potatoes, bread, pasta and etc struggling working 50+ hours a week while the freeloaders GET IT ALL! permalink parent award report block reply mikejones 3 points 7 days ago Would rather work 50 hours knowing I'll be okay. Could go the other route but imagine you get cut off one day with no skills. permalink parent award report block reply Pnw4gotpwd 2 points 7 days ago On the plus side I'm getting stronger as I get older... I can lift 100 bucks worth of groceries with one hand! permalink parent award report block reply\nmikejones 3 points 7 days ago Would rather work 50 hours knowing I'll be okay. Could go the other route but imagine you get cut off one day with no skills. permalink parent award report block reply\nPnw4gotpwd 2 points 7 days ago On the plus side I'm getting stronger as I get older... I can lift 100 bucks worth of groceries with one hand! permalink parent award report block reply\nPnw4gotpwd 2 points 7 days ago This and the East wing (which could have been handled WAY better than it was from a communications standpoint) are kinda screwing up. And are pulling normies into trusting him far less permalink parent award report block reply\nKrat 12 points 7 days ago What about the arrests permalink award report block reply ImYourHuckleberry24 7 points 7 days ago Never gonna happen permalink parent award report block reply deleted 5 points 7 days ago Krat -2 points 7 days ago O really?!? Those two are behind bars right now ? We can see their mugshots like Trumps? permalink parent award report block reply deleted 5 points 7 days ago ragnarokrobo 3 points 7 days ago W E E K S permalink parent award report block reply UsernameChexOut 3 points 7 days ago And Epstein list permalink parent award report block reply\nImYourHuckleberry24 7 points 7 days ago Never gonna happen permalink parent award report block reply\ndeleted 5 points 7 days ago Krat -2 points 7 days ago O really?!? Those two are behind bars right now ? We can see their mugshots like Trumps? permalink parent award report block reply deleted 5 points 7 days ago ragnarokrobo 3 points 7 days ago W E E K S permalink parent award report block reply\nKrat -2 points 7 days ago O really?!? Those two are behind bars right now ? We can see their mugshots like Trumps? permalink parent award report block reply deleted 5 points 7 days ago ragnarokrobo 3 points 7 days ago W E E K S permalink parent award report block reply\ndeleted 5 points 7 days ago ragnarokrobo 3 points 7 days ago W E E K S permalink parent award report block reply\nragnarokrobo 3 points 7 days ago W E E K S permalink parent award report block reply\nUsernameChexOut 3 points 7 days ago And Epstein list permalink parent award report block reply\nTookens 9 points 7 days ago I wish he would stop the gaslighting.  No, Donald, grocery prices are NOT down. permalink award report block reply\ndrmrboy 9 points 7 days ago What if you don't buy groceries at Walmart?  🤔 permalink award report block reply\nNadlersNads 9 points 7 days ago DO. NOT. GASLIGHT. US. ANYMORE! permalink award report block reply\nAlldayeveryday 8 points 7 days ago I just went to the grocery store today for normal stuff,it was $250. Prices are not down,stop with this gaslighting bullshit permalink award report block reply PotatusHead -2 points 7 days ago Your \"stuff\" is NOT normal. permalink parent award report block reply\nPotatusHead -2 points 7 days ago Your \"stuff\" is NOT normal. permalink parent award report block reply\nMulletgunning 8 points 7 days ago Wal-Mart is lying. I shop there regularly and they are full of fucking shit. And that's in the poorest state of the union. GEOTUS is being gaslit as usual by those scum advisors around him. All status quo establishment trash. Wal-Mart increased their prices at least 30% after GEOTUS got in ,so that bullshit  don't fly that groceries are cheaper. MAGA AF permalink award report block reply geekesmind 6 points 7 days ago oh but they say its cause of the traffis BULLSHIT! permalink parent award report block reply Mulletgunning 4 points 7 days ago Ex-fucking-actly! permalink parent award report block reply ImportantPerson -2 points 7 days ago Right now, the walmart in my area is cheaper than every other grocery store for most groceries.  I'm paying $2 a dozen of eggs.  Chicken breasts are $2.42 a pound.  Vegetables like Bell Peppers are $0.67 each. The majority of the items where the prices are high are shitty foods.  Walmart has the highest soda prices.  Cereal is 20% higher than other places.  Chips are 20% higher than other places. So I'm really not sure where you are coming up with your numbers but my guess is that you are pulling them out of your ass. permalink parent award report block reply Mulletgunning 3 points 7 days ago Fuck off faggot. I buy no junk fuckstain. Eggs are 5 dollars a dozen. Meat is out fucking rageous,bread is over 3 dollars a loaf for buns or sliced,etc. If you can't figure out where, the always has been, poorest state is then you might need to turn in your basket weaving degree. WTF? I'm not here to shill for Wal-Mart like you homo.Go wave your pom poms for other corporations dickwhipper. MAGA AF permalink parent award report block reply ImportantPerson 0 points 6 days ago HAHAHAHAHA YOU CAN'T LIE AND PRETEND EVERYONE IS GOING TO JUST BLINDLY BELIEVE YOU. Right now post a screenshot of a dozen regular eggs being 5 dollars alongside the store. Either do that or shut the fuck up you lying fucking whore. permalink parent award report block reply Mulletgunning 1 points 6 days ago Suck a dick. You are a loser. I have no reason to lie about the prices. I am not a high tech person. I don't own a phone. I barely hunt and peck on this book someone gave me five years ago. So I suggest you look up prices at Wal-Mart in South Mississippi at Gulfport stores and you can see for yourself. I shop for myself and my mother at Sams and Wal-Mart two to three times a week. I know those prices like the back of my hand fucklip. So you can be grateful your local Wal-Mart sells them cheaper while I and many others can attest to their prices being high. A fucking jar of mayo is 9 dollars ,a tub of butter is 8 dollars ,beef is outrageous and unless you buy leg quarters for 9 dollars for ten pounds chicken is high too. You are an absolute moron to assume others are lying about grocery prices. Their is no incentive to lie about something like that. Try to prove me wrong faggot. Look them up yourself and Ill be waiting for an apology from you . That's if you are a real man that can admit when you are wrong. But ,I highly doubt you are of that character. You will just continue on in your moronic outbursts even when you are wrong. Get a grip. Enjoy your cheerleading for the lies being told by Wal-Mart and the fucking shit Israel First advisors surrounding GEOTUS. MAGA AF permalink parent award report block reply view 11 more comments...\ngeekesmind 6 points 7 days ago oh but they say its cause of the traffis BULLSHIT! permalink parent award report block reply Mulletgunning 4 points 7 days ago Ex-fucking-actly! permalink parent award report block reply\nMulletgunning 4 points 7 days ago Ex-fucking-actly! permalink parent award report block reply\nImportantPerson -2 points 7 days ago Right now, the walmart in my area is cheaper than every other grocery store for most groceries.  I'm paying $2 a dozen of eggs.  Chicken breasts are $2.42 a pound.  Vegetables like Bell Peppers are $0.67 each. The majority of the items where the prices are high are shitty foods.  Walmart has the highest soda prices.  Cereal is 20% higher than other places.  Chips are 20% higher than other places. So I'm really not sure where you are coming up with your numbers but my guess is that you are pulling them out of your ass. permalink parent award report block reply Mulletgunning 3 points 7 days ago Fuck off faggot. I buy no junk fuckstain. Eggs are 5 dollars a dozen. Meat is out fucking rageous,bread is over 3 dollars a loaf for buns or sliced,etc. If you can't figure out where, the always has been, poorest state is then you might need to turn in your basket weaving degree. WTF? I'm not here to shill for Wal-Mart like you homo.Go wave your pom poms for other corporations dickwhipper. MAGA AF permalink parent award report block reply ImportantPerson 0 points 6 days ago HAHAHAHAHA YOU CAN'T LIE AND PRETEND EVERYONE IS GOING TO JUST BLINDLY BELIEVE YOU. Right now post a screenshot of a dozen regular eggs being 5 dollars alongside the store. Either do that or shut the fuck up you lying fucking whore. permalink parent award report block reply Mulletgunning 1 points 6 days ago Suck a dick. You are a loser. I have no reason to lie about the prices. I am not a high tech person. I don't own a phone. I barely hunt and peck on this book someone gave me five years ago. So I suggest you look up prices at Wal-Mart in South Mississippi at Gulfport stores and you can see for yourself. I shop for myself and my mother at Sams and Wal-Mart two to three times a week. I know those prices like the back of my hand fucklip. So you can be grateful your local Wal-Mart sells them cheaper while I and many others can attest to their prices being high. A fucking jar of mayo is 9 dollars ,a tub of butter is 8 dollars ,beef is outrageous and unless you buy leg quarters for 9 dollars for ten pounds chicken is high too. You are an absolute moron to assume others are lying about grocery prices. Their is no incentive to lie about something like that. Try to prove me wrong faggot. Look them up yourself and Ill be waiting for an apology from you . That's if you are a real man that can admit when you are wrong. But ,I highly doubt you are of that character. You will just continue on in your moronic outbursts even when you are wrong. Get a grip. Enjoy your cheerleading for the lies being told by Wal-Mart and the fucking shit Israel First advisors surrounding GEOTUS. MAGA AF permalink parent award report block reply view 11 more comments...\nMulletgunning 3 points 7 days ago Fuck off faggot. I buy no junk fuckstain. Eggs are 5 dollars a dozen. Meat is out fucking rageous,bread is over 3 dollars a loaf for buns or sliced,etc. If you can't figure out where, the always has been, poorest state is then you might need to turn in your basket weaving degree. WTF? I'm not here to shill for Wal-Mart like you homo.Go wave your pom poms for other corporations dickwhipper. MAGA AF permalink parent award report block reply ImportantPerson 0 points 6 days ago HAHAHAHAHA YOU CAN'T LIE AND PRETEND EVERYONE IS GOING TO JUST BLINDLY BELIEVE YOU. Right now post a screenshot of a dozen regular eggs being 5 dollars alongside the store. Either do that or shut the fuck up you lying fucking whore. permalink parent award report block reply Mulletgunning 1 points 6 days ago Suck a dick. You are a loser. I have no reason to lie about the prices. I am not a high tech person. I don't own a phone. I barely hunt and peck on this book someone gave me five years ago. So I suggest you look up prices at Wal-Mart in South Mississippi at Gulfport stores and you can see for yourself. I shop for myself and my mother at Sams and Wal-Mart two to three times a week. I know those prices like the back of my hand fucklip. So you can be grateful your local Wal-Mart sells them cheaper while I and many others can attest to their prices being high. A fucking jar of mayo is 9 dollars ,a tub of butter is 8 dollars ,beef is outrageous and unless you buy leg quarters for 9 dollars for ten pounds chicken is high too. You are an absolute moron to assume others are lying about grocery prices. Their is no incentive to lie about something like that. Try to prove me wrong faggot. Look them up yourself and Ill be waiting for an apology from you . That's if you are a real man that can admit when you are wrong. But ,I highly doubt you are of that character. You will just continue on in your moronic outbursts even when you are wrong. Get a grip. Enjoy your cheerleading for the lies being told by Wal-Mart and the fucking shit Israel First advisors surrounding GEOTUS. MAGA AF permalink parent award report block reply view 11 more comments...\nImportantPerson 0 points 6 days ago HAHAHAHAHA YOU CAN'T LIE AND PRETEND EVERYONE IS GOING TO JUST BLINDLY BELIEVE YOU. Right now post a screenshot of a dozen regular eggs being 5 dollars alongside the store. Either do that or shut the fuck up you lying fucking whore. permalink parent award report block reply Mulletgunning 1 points 6 days ago Suck a dick. You are a loser. I have no reason to lie about the prices. I am not a high tech person. I don't own a phone. I barely hunt and peck on this book someone gave me five years ago. So I suggest you look up prices at Wal-Mart in South Mississippi at Gulfport stores and you can see for yourself. I shop for myself and my mother at Sams and Wal-Mart two to three times a week. I know those prices like the back of my hand fucklip. So you can be grateful your local Wal-Mart sells them cheaper while I and many others can attest to their prices being high. A fucking jar of mayo is 9 dollars ,a tub of butter is 8 dollars ,beef is outrageous and unless you buy leg quarters for 9 dollars for ten pounds chicken is high too. You are an absolute moron to assume others are lying about grocery prices. Their is no incentive to lie about something like that. Try to prove me wrong faggot. Look them up yourself and Ill be waiting for an apology from you . That's if you are a real man that can admit when you are wrong. But ,I highly doubt you are of that character. You will just continue on in your moronic outbursts even when you are wrong. Get a grip. Enjoy your cheerleading for the lies being told by Wal-Mart and the fucking shit Israel First advisors surrounding GEOTUS. MAGA AF permalink parent award report block reply view 11 more comments...\nMulletgunning 1 points 6 days ago Suck a dick. You are a loser. I have no reason to lie about the prices. I am not a high tech person. I don't own a phone. I barely hunt and peck on this book someone gave me five years ago. So I suggest you look up prices at Wal-Mart in South Mississippi at Gulfport stores and you can see for yourself. I shop for myself and my mother at Sams and Wal-Mart two to three times a week. I know those prices like the back of my hand fucklip. So you can be grateful your local Wal-Mart sells them cheaper while I and many others can attest to their prices being high. A fucking jar of mayo is 9 dollars ,a tub of butter is 8 dollars ,beef is outrageous and unless you buy leg quarters for 9 dollars for ten pounds chicken is high too. You are an absolute moron to assume others are lying about grocery prices. Their is no incentive to lie about something like that. Try to prove me wrong faggot. Look them up yourself and Ill be waiting for an apology from you . That's if you are a real man that can admit when you are wrong. But ,I highly doubt you are of that character. You will just continue on in your moronic outbursts even when you are wrong. Get a grip. Enjoy your cheerleading for the lies being told by Wal-Mart and the fucking shit Israel First advisors surrounding GEOTUS. MAGA AF permalink parent award report block reply view 11 more comments...\nDogFart_ 7 points 7 days ago radioactive turkey? permalink award report block reply\nAVeryNakedMan 7 points 7 days ago Shrinkflation (and skimpflation) says hello. permalink award report block reply\njohnfist2 7 points 7 days ago Only true if you buy Walmart's brand of slop.  No thanks. permalink award report block reply\nMemoryHoleyeO 6 points 7 days ago GOP puts in 0 ground game and 0 effort; they've ridden the coat tails of President Trump and think they can go back to the days before him. They are waiting him out. permalink award report block reply\nMellifleur 6 points 7 days ago Those prices got to come down by a fuck ton to get back to Trumps first term. permalink award report block reply\nJoeBidensDementia1 5 points 7 days ago They won't. The RNC is worthless. Trump is going to have to force them to take action. Meanwhile, he's struggling to get the Jews and Mooselems to play nice and has failed at solving the Urine conflict. I'm not blaming Trump for his efforts. I just wish he'd focus on domestic issues from now on. permalink award report block reply mikejones 3 points 7 days ago Probably harder to focus on domestic issues when he's fighting the uniparty that will stall him. permalink parent award report block reply\nmikejones 3 points 7 days ago Probably harder to focus on domestic issues when he's fighting the uniparty that will stall him. permalink parent award report block reply\njdemarco2014 5 points 7 days ago If anything my grocery bill has been going up alot more lately permalink award report block reply\nSavingPrivateGrace 5 points 7 days ago No thanks, and why advertise for Walmart.  I don't like my Turkey injected with salt water by a Chinese packing company. permalink award report block reply\nsully 5 points 7 days ago Down from when? 2019 prices? Or is it 25% down after a 50% increase? permalink award report block reply\nCaptainForehead 5 points 7 days ago People on SNAP don’t care about prices and those supporting the left expect to get it free somehow. The more people buying food with their own money, the bigger the impact. permalink award report block reply geekesmind 3 points 7 days ago exactly people on EBT don't give a shit about prices because they don't have to PAY for it! We hardworking Americans who bust our ass every day and have to use OUR OWN MONEY to pay for food! permalink parent award report block reply\ngeekesmind 3 points 7 days ago exactly people on EBT don't give a shit about prices because they don't have to PAY for it! We hardworking Americans who bust our ass every day and have to use OUR OWN MONEY to pay for food! permalink parent award report block reply\nAwakened 5 points 7 days ago Sure thing, Jan. He use to tell the truth whether it was good for his position or not. Now one lie after another. permalink award report block reply\nBythrfruitsyknow 4 points 7 days ago lol this is fucking sadder than Biden's 25 cents off hotdogs July 4th tweet. Thanks President Trump with my savings I'll be sure to get a book of stamps or a liter of cola.  I bet everyone is really feeling that 25% cheaper when they hit the fucking checkout 🤣 permalink award report block reply\nLosferwords 4 points 7 days ago Prices are skyrocketing and this is what we get from this administration. I'm really having a hard time supporting this shit. Why the corporate welfare? Where are the arrests? permalink award report block reply\nProfessorJagoff 4 points 7 days ago I remember a time in the late 2010s when I ate a ribeye every ~4 days, and make a brisket once a month. Then by the Biden years it became once every week or two, just forgot what flank steak was, but brisket was still affordable...for a time. But this year has been rough as the prices kept going up as we keep exporting our prime cuts, and importing crap for hamburger (which I also forgot about). Now on to Turkey, Turkey is always cheapest after Thanksgiving for a few months, then climbs back up, ironically this is the only time of the year I try to avoid having to purchase a turkey, now with that said, as far as I can tell, turkey doesn't change much, its cheaper and then more expensive, but overall it hasn't changed much. Also the cost for whole chickens went up too. I smoke a lot of meat with friends and kind of keep a mental tab as the bill keeps going up. permalink award report block reply\nRocksCanOnlyWait 3 points 7 days ago Data is likely from this article: https://www.cbsnews.com/news/turkey-price-increase-thanksgiving-2025/ The Farm Bureau data isn't the same items or quantities as store deals, nor does it account for store discounts. That means the 25% number is exaggerated. I found this article from 2024 which said Aldi had a $47 deal for 10 people, and they're offering it at $40 this year. That works out to a 17.5% decrease . permalink award report block reply\naqua27 3 points 6 days ago Food prices are still very high and going to the store for a few items is easy 100$ not good for working poor and middle class. My advise to Trump and JD stop worrying about the world and remember the term America first or 2028 is going to be ugly and Trump is finished. permalink award report block reply\nBillyBillington 3 points 7 days ago But the city where I live just increased my property taxes 20 percent with an unnecessary school bond. I can't win. permalink award report block reply\nAccelerateAlready 3 points 7 days ago Cool, what about the invasion and rise of Islam? permalink award report block reply\nKernalMustard 3 points 7 days ago In a choice between my 4 local. Walmart, Winn Dixie, Aldi and Walmart. Its going to be Aldi then walmart permalink award report block reply ActNow 1 points 7 days ago Is one of those Walmarts actually Publix? Those 4 are what we had when we lived in the south. Occasionally Albertson's. Aldi was great. I miss shopping there. permalink parent award report block reply\nActNow 1 points 7 days ago Is one of those Walmarts actually Publix? Those 4 are what we had when we lived in the south. Occasionally Albertson's. Aldi was great. I miss shopping there. permalink parent award report block reply\nACActual 3 points 7 days ago When will he realize Republicans aren't on our side? Just got back from picking up 2 jars peanut butter, 5 apples, dozen eggs, bread,  butter, pint of milk and a half gallon ice cream. $42.  Prices are not down permalink award report block reply\nTotsugeki 3 points 7 days ago I just paid $3.99 for a half-gallon of milk. Eggs are still above $4.00. Down 25%, my foot. permalink award report block reply\nImnotnorm 2 points 7 days ago No but ok permalink award report block reply\nMajJamesMcFarlane 2 points 7 days ago Sure, Jan permalink award report block reply\nblueeyephoto 2 points 7 days ago Sorry,  Republicans don't know how to win permalink award report block reply\nPOTUS_DonnieJ 2 points 7 days ago But I saved $0.17 on hot dogs under Biden, surely this can’t be better than that. permalink award report block reply\nStrongIsland 2 points 7 days ago Whoa! Tone is retarded here… yeah I can save on the turkeys deducted from my taxes for corporate gimmigrants and the ones I pay to donate out of pocket. Economy isn’t golden, what intern stooped to Biden games in this post, Fire Them! permalink award report block reply\nconservativefrank 2 points 7 days ago Where? permalink award report block reply\nYignuced 2 points 7 days ago Republicans have no interest in winning if it helps MAGA. permalink award report block reply\nWrez77 2 points 7 days ago Sounds great but we have bigger fish to fry? permalink award report block reply\nProtonboy 2 points 7 days ago Yeah, but, Sleepy Joe had our July 4 dinner down 16 CENTS! his first year in office That's the real test. permalink award report block reply\ngiggitybooped 2 points 7 days ago Respectfully, the vast majority of Republican politicians are swamp shit, Mr. President. permalink award report block reply\nI_Am_John_Galt 2 points 7 days ago Nice.  I'll pay whatever I need to for the fam on Thanksgiving...don't care.  Tell Pam to arrest deep state criminals and break the wheel or tell her to get the fuck out. permalink award report block reply\nthrottlejohnson 2 points 7 days ago don't be a turkey. permalink award report block reply\ngeekesmind 2 points 7 days ago hey Trump shit is still TOO HIGH!! permalink award report block reply\nShekelJa 2 points 7 days ago Also: where I am from, eggs are on sale 11 cents each. permalink award report block reply ActNow 2 points 7 days ago My hens are starting their winter break. Store eggs here are twice what you paid. <sigh> permalink parent award report block reply\nActNow 2 points 7 days ago My hens are starting their winter break. Store eggs here are twice what you paid. <sigh> permalink parent award report block reply\nHammond 2 points 7 days ago The grocery prices are not down in my area.  Are stores price gouging? Is it 42M on SNAP and we are paying to offset \"free\" food?  Who is telling Trump grocery prices are down? permalink award report block reply geekesmind 2 points 7 days ago I bet 25m of them are freaking illegals! permalink parent award report block reply\ngeekesmind 2 points 7 days ago I bet 25m of them are freaking illegals! permalink parent award report block reply\nGravityBounce1976 2 points 7 days ago Not if \"conservatives\" keep spending us into inflation.  I like Trump's policies, but his spending is just as bad as Democrats. permalink award report block reply\nGravityBounce1976 2 points 7 days ago Maybe someone should send him this thread. permalink award report block reply\nPorkchop-express 1 points 7 days ago Sorry sir. They too stupid permalink award report block reply\nDoubleu1992 1 points 7 days ago No communist piece of shit Gives a shit about the prices of groceries when they’re fucking milking the government or their parents pay for their shit. The only way we will ever win elections or anything is voter ID motherfuckers. permalink award report block reply\nDCYR66 1 points 6 days ago Sorry don’t see my grocery bill decreasing. Paid $60 for 3 paltry little bags recently. Used to cost a third of that before. permalink award report block reply\nJoePlumber 1 points 6 days ago Just ordered my fresh turkey and the price is $.23/lb more than last year. I realize I am paying for a fresh, free range turkey and not that frozen mass produced Walmart stuff but nevertheless the cost is up, not down. permalink award report block reply\nJbliss 1 points 7 days ago Affordability doesn't matter when you are on EBT, SNAP, food stamps or whatever fancy term for government taking care of you. permalink award report block reply\nTmntnyc 1 points 6 days ago Trump is saying this knowing it's not true to force Walmart's hands, thinking now that he said it they better make it true or it's a PR disaster (for them). He's done this before. If they do it, it's a win win permalink award report block reply\nEddie_LeBec 1 points 7 days ago I feel my grocery prices have come down\nBut yes it hasn't made up the Covid/Biden hike permalink award report block reply\nParticleCannon 1 points 7 days ago A real Thanksgiving or a Joe Biden \"mystery meat, no steaks burgers or hotdogs 4th-of-July\" type Thanksgiving? permalink award report block reply geekesmind 1 points 7 days ago spam turkey this year!! permalink parent award report block reply\ngeekesmind 1 points 7 days ago spam turkey this year!! permalink parent award report block reply\nKrat 1 points 7 days ago Did a democrat jidge give permission for these prices ?!? permalink award report block reply\nShitAss 1 points 6 days ago My grocery bill is as high as it ever was permalink award report block reply\nCitizen_Bob 1 points 7 days ago Yeah but Joe Biden had pans of unseasoned ground beef down by $0.16c if you included all the other stuff you might buy. permalink award report block reply\nexplodejoystick 1 points 6 days ago Well, considering the articles the last few years with these figures, it should be easy to verify, right? permalink award report block reply\nNibba2 1 points 7 days ago I’m still living off my $0.16. Don’t know what you people are talking about. permalink award report block reply\nBrionK 1 points 6 days ago Don't care permalink award report block reply\nQSWO1 1 points 7 days ago Why is Walmart the only game in town? permalink award report block reply\nbill_in_texas 1 points 6 days ago This just sounds out of touch and cringe worthy.  Touting a promotion by one company as some kind of achievement? permalink award report block reply\nFUCK_TYLER 1 points 6 days ago this is like Joe biden's ketchup is now $0.16 cheaper for the 4th of July moment 😒😬 permalink award report block reply\nxanaxagoras 1 points 7 days ago I don’t care, the country is overrun with foreigners. permalink award report block reply\nRideordie45 1 points 6 days ago Bullshit, wish it were true permalink award report block reply\nAnother_rando 1 points 7 days ago Sweet 25% down from 50%. Boo permalink award report block reply\nPotatusHead 1 points 7 days ago Be Thankful! permalink award report block reply\nDJTXLV 1 points 7 days ago Great. Thank you. NOW DO ELECTION INTEGRITY. permalink award report block reply\nborntacticool 1 points 7 days ago Wongmart ® Huaweis the lo Yuan, Huaweis permalink award report block reply\nIranhasnukes 1 points 7 days ago 4 weeks late permalink award report block reply\nCommieCrats 1 points 7 days ago exterminate Soros permalink award report block reply\nbigbadchows2 1 points 7 days ago Hey, I saved 27 cents on my 4th of July BBQ in 2024 according the WH and great grand Joe. We should not discount his success. In all honesty my BBQ was a lot more expensive mostly due to soft drinks of all things. permalink award report block reply\ncovok48 1 points 7 days ago I don’t shop with the blacks and browns using EBT cards at Walmart. He thinks into 2019. It’s not. permalink award report block reply\nraptormissle 1 points 7 days ago And if you're a SNAP benefits recipient it doesn't matter because it's all completely free. permalink award report block reply\nthewallhasnobrakes 0 points 7 days ago AMERICA IS BACK permalink award report block reply\nHankScorpio 0 points 7 days ago President dont control the economy. Central bankers do. How many muslim central bankers have we had? permalink award report block reply\nObambi 0 points 7 days ago Who gives a fuck. End taxes. permalink award report block reply\nCJ74U2NV 0 points 7 days ago The only prices that have really gone up are imported goods because companies are not making products here. Buy American, and keep the money in America, and all prices will come down. permalink award report block reply\nTPMJB -1 points 7 days ago What are people buying for Thanksgiving that is expensive? Turkey has been 99 cents a pound for as long as I can remember. Potatoes and carrots are cheap. This always confused me. I don't put goyslop on my table though. permalink award report block reply\nPatriot4TN -4 points 7 days ago Now we need to ask ourselves. How big of a meal is it? Can it feed 4,6, or 8?  You know how they love to downsize food and not the price.  Does the lower price have anything with SNAP being removed? https://corporate.walmart.com/news/2025/10/21/walmarts-annual-thanksgiving-meal-returns-serving-10-people-for-less-than-4-00-per-person or https://www.walmart.com/i/shoppable-lists/Thanksgiving-value-meal/929 permalink award report block reply Patriot4TN -7 points 7 days ago I guess the OP does not like me bringing receipts. permalink parent award report block reply YaharaRiver -10 points 7 days ago get lost, shitstain. permalink parent award report block reply Patriot4TN -6 points 7 days ago Another basement dweller. permalink parent award report block reply\nPatriot4TN -7 points 7 days ago I guess the OP does not like me bringing receipts. permalink parent award report block reply\nYaharaRiver -10 points 7 days ago get lost, shitstain. permalink parent award report block reply Patriot4TN -6 points 7 days ago Another basement dweller. permalink parent award report block reply\nPatriot4TN -6 points 7 days ago Another basement dweller. permalink parent award report block reply\nDeltaSierra 16 points 7 days ago Comment removed upon the user being banned. permalink award report block reply geekesmind 5 points 7 days ago yep every time you turn around getting some type of notification that something you buy or subscribe to is having PRICE INCREASE! permalink parent award report block reply ImportantPerson -5 points 7 days ago Then buy something different.  You are fucking subscribing to items and you are shocked then they increase their prices?  You are telling them that you are going to keep buying the item so why wouldn't they increase their prices? There's a reason why companies love subscriptions and it's because of lazy people who won't bother to check the prices. We used to clip coupons and look at the ads for sales on different food.  Now, we have lazy people who buy at whatever price and then complain about how expensive groceries are. My grocery bill per week for my full family has gone down $75 since 2023 and it's because I've put more effort into thrifty purchasing.  Beef was on sale so I bought 12 pounds of it, freezing some.  Eggs are back to being one of the cheapest healthy meals you can make.  Chicken has always been cheap and I just found out another way to not only make it cheaper but to get better quality. permalink parent award report block reply\ngeekesmind 5 points 7 days ago yep every time you turn around getting some type of notification that something you buy or subscribe to is having PRICE INCREASE! permalink parent award report block reply ImportantPerson -5 points 7 days ago Then buy something different.  You are fucking subscribing to items and you are shocked then they increase their prices?  You are telling them that you are going to keep buying the item so why wouldn't they increase their prices? There's a reason why companies love subscriptions and it's because of lazy people who won't bother to check the prices. We used to clip coupons and look at the ads for sales on different food.  Now, we have lazy people who buy at whatever price and then complain about how expensive groceries are. My grocery bill per week for my full family has gone down $75 since 2023 and it's because I've put more effort into thrifty purchasing.  Beef was on sale so I bought 12 pounds of it, freezing some.  Eggs are back to being one of the cheapest healthy meals you can make.  Chicken has always been cheap and I just found out another way to not only make it cheaper but to get better quality. permalink parent award report block reply\nImportantPerson -5 points 7 days ago Then buy something different.  You are fucking subscribing to items and you are shocked then they increase their prices?  You are telling them that you are going to keep buying the item so why wouldn't they increase their prices? There's a reason why companies love subscriptions and it's because of lazy people who won't bother to check the prices. We used to clip coupons and look at the ads for sales on different food.  Now, we have lazy people who buy at whatever price and then complain about how expensive groceries are. My grocery bill per week for my full family has gone down $75 since 2023 and it's because I've put more effort into thrifty purchasing.  Beef was on sale so I bought 12 pounds of it, freezing some.  Eggs are back to being one of the cheapest healthy meals you can make.  Chicken has always been cheap and I just found out another way to not only make it cheaper but to get better quality. permalink parent award report block reply\nthe_new_one 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply\nNebraskanPatriot 1 points 7 days ago Comment removed by community filter, pending further review. permalink award report block reply"
}