{
  "id": "1ARK512lAl",
  "url": "https://patriots.win/p/1ARK512lAl/new-please-be-patient-illegal-al/c",
  "content": "992 New \"Please Be Patient, Illegal Alien Driver\" Bumper Stickers Just Dropped posted 6 days ago by O__Q 34 comments award share download report block\n34 comments Sort by Top Top New Worst Old Save FredRedd 19 points 6 days ago \"This vehicle makes frequent stops, and will drive recklessly and dangerously.\" permalink award report block reply O__Q OP 11 points 6 days ago “This vehicle makes illegal U-turns on highways posing serious risk of decapitation to fellow motorists” “This vehicle will smash straight into highway overpasses clearly marked too short for semi trucks” “This vehicle is driven by an illegal alien with less education than your 3rd grader” permalink parent award report block reply Washington_Redskins 5 points 6 days ago If this.meme is yours the basic idea is very good'. A simplified version like the \"baby on board\" signs could go viral. Maybe an \"illegal driver on board\" with the sign depicting a simplified image of a car/semi  weaving all.over the.road? permalink parent award report block reply O__Q OP 2 points 6 days ago Yeah it’s mine- I’ll make another like you’re saying and see what happens :) permalink parent award report block reply HOSEQ 1 points 6 days ago I see you can Advertise, but no Direct link??? permalink parent award report block reply airborne3502 11 points 6 days ago No insurance permalink award report block reply O__Q OP 8 points 6 days ago 👆👆👆 I’m going to have to make this again and add that 🤣 permalink parent award report block reply ElectionMeddler 2 points 6 days ago 100%  that's why I have to add an uninsured driver add on to my insurance.  Twice now that had to be used when the assholes rear ended me permalink parent award report block reply thisaintitchief76 8 points 6 days ago If I had a printer, I'd slap these suckers on every Amazon prime truck id find in the rest areas or truck stops. permalink award report block reply MasterChief 2 points 6 days ago buy a friggen dash cam, NOW. I saw a 18 wheeler pulling some sort of farm trailer yesterday doing 90+ in a 45 in heavy traffic, just to slam on the brakes as they were riding the merge lane. permalink parent award report block reply 24601 4 points 6 days ago What's the problem? That's how they do it in India. permalink parent award report block reply Justlooking250 4 points 6 days ago S A A A R permalink parent award report block reply breathittbill 1 points 6 days ago Maybe for the big highway rigs. My local drivers are all American citizens that I have seen. permalink parent award report block reply General_Grievance 6 points 6 days ago It'd be pretty neat if Republicans got on board with patronage, considering it's 50% of successful politicking. Reward friends, punish enemies. It's the easiest playbook created and they're like \"we'll just punish you slightly less hard\" and taxes go from 30% to 28% like oh gee thanks. Democrats get free food, housing, debt forgiveness, free hellcats and chargers, healthcare, and on and on, and we get to fund all that just a little less. permalink award report block reply B0bE 5 points 6 days ago I like the direction, but that's awful wordy. permalink award report block reply O__Q OP 3 points 6 days ago Yeah…gotta simplify it- I’ll do better on round 2 :) permalink parent award report block reply B0bE 1 points 6 days ago HOW'S MY DRIVING ?\nCALL 1-866-DHS-2-ICE permalink parent award report block reply O__Q OP 5 points 6 days ago Figured if my teenager needs a \"Please Be Patient, Student Driver\" bumper sticker, these criminals do too! permalink award report block reply roadrunner0 2 points 6 days ago So they will be self tagging their vehicles so we know who to force off the highway?? permalink award report block reply Smurfection 2 points 6 days ago I had to wait six hours past my appointment at the DMV to get a Real ID.   I had to bring a load of paperwork. Just to find out, illegal alien invaders are getting Real IDs and not only that, CDL Real IDs and so far almost 100 have had \"no name given\" for their names. The people involved in this fraud need to be charged, possibly hanged, put in jail for life, deported with no chance to enter America again and their families, legal or illegal, tossed out of the country.  By family, I mean the whole clan and in the case of Indian nationals, the entire caste. I am sick of citizens being forced to jump through hoops, pay taxes and file all the right forms and do the right things just so Democrats and criminals can shit all over it and let their pets and flunkies run roughshot over the U.S. and our citizens. permalink award report block reply Keep_on_Trumpin 1 points 6 days ago \"Works for company: California\" permalink award report block reply SuperHonkey 1 points 6 days ago All true, except for the gratitude portion permalink award report block reply Dev404 1 points 6 days ago When your government treats foreign invaders better than the populace, you've already been conquered and don't know it. permalink award report block reply ParadigmShift2070 1 points 6 days ago should be written in Mexican permalink award report block reply 24601 1 points 6 days ago Missing the most important attribute: Indian permalink award report block reply breathittbill 1 points 6 days ago The first step to tearing a country apart is to not require everyone to speak the same language. permalink award report block reply Rudy_DankMemer 1 points 6 days ago Would be even more savage if this were written in CURSIVE. THIS permalink award report block reply KiekhaeferSoldier 1 points 6 days ago \"In This Car, we believe...\" (fill in the blank) permalink award report block reply BillGateCanSuckIt 1 points 6 days ago This is not easy to read. Yellow font is just not good permalink award report block reply O__Q OP 1 points 6 days ago u/-f-b-i- permalink award report block reply ILoveGoatFucking -1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply PearlyGaits57 1 points 6 days ago Makes it easy to spot, then, DEPORT! permalink award report block reply DRKMSTR 0 points 6 days ago This is some boomer meme shit. GTFO. permalink award report block reply ILoveGoatFucking -1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply\nFredRedd 19 points 6 days ago \"This vehicle makes frequent stops, and will drive recklessly and dangerously.\" permalink award report block reply O__Q OP 11 points 6 days ago “This vehicle makes illegal U-turns on highways posing serious risk of decapitation to fellow motorists” “This vehicle will smash straight into highway overpasses clearly marked too short for semi trucks” “This vehicle is driven by an illegal alien with less education than your 3rd grader” permalink parent award report block reply Washington_Redskins 5 points 6 days ago If this.meme is yours the basic idea is very good'. A simplified version like the \"baby on board\" signs could go viral. Maybe an \"illegal driver on board\" with the sign depicting a simplified image of a car/semi  weaving all.over the.road? permalink parent award report block reply O__Q OP 2 points 6 days ago Yeah it’s mine- I’ll make another like you’re saying and see what happens :) permalink parent award report block reply HOSEQ 1 points 6 days ago I see you can Advertise, but no Direct link??? permalink parent award report block reply\nO__Q OP 11 points 6 days ago “This vehicle makes illegal U-turns on highways posing serious risk of decapitation to fellow motorists” “This vehicle will smash straight into highway overpasses clearly marked too short for semi trucks” “This vehicle is driven by an illegal alien with less education than your 3rd grader” permalink parent award report block reply Washington_Redskins 5 points 6 days ago If this.meme is yours the basic idea is very good'. A simplified version like the \"baby on board\" signs could go viral. Maybe an \"illegal driver on board\" with the sign depicting a simplified image of a car/semi  weaving all.over the.road? permalink parent award report block reply O__Q OP 2 points 6 days ago Yeah it’s mine- I’ll make another like you’re saying and see what happens :) permalink parent award report block reply HOSEQ 1 points 6 days ago I see you can Advertise, but no Direct link??? permalink parent award report block reply\nWashington_Redskins 5 points 6 days ago If this.meme is yours the basic idea is very good'. A simplified version like the \"baby on board\" signs could go viral. Maybe an \"illegal driver on board\" with the sign depicting a simplified image of a car/semi  weaving all.over the.road? permalink parent award report block reply O__Q OP 2 points 6 days ago Yeah it’s mine- I’ll make another like you’re saying and see what happens :) permalink parent award report block reply\nO__Q OP 2 points 6 days ago Yeah it’s mine- I’ll make another like you’re saying and see what happens :) permalink parent award report block reply\nHOSEQ 1 points 6 days ago I see you can Advertise, but no Direct link??? permalink parent award report block reply\nairborne3502 11 points 6 days ago No insurance permalink award report block reply O__Q OP 8 points 6 days ago 👆👆👆 I’m going to have to make this again and add that 🤣 permalink parent award report block reply ElectionMeddler 2 points 6 days ago 100%  that's why I have to add an uninsured driver add on to my insurance.  Twice now that had to be used when the assholes rear ended me permalink parent award report block reply\nO__Q OP 8 points 6 days ago 👆👆👆 I’m going to have to make this again and add that 🤣 permalink parent award report block reply\nElectionMeddler 2 points 6 days ago 100%  that's why I have to add an uninsured driver add on to my insurance.  Twice now that had to be used when the assholes rear ended me permalink parent award report block reply\nthisaintitchief76 8 points 6 days ago If I had a printer, I'd slap these suckers on every Amazon prime truck id find in the rest areas or truck stops. permalink award report block reply MasterChief 2 points 6 days ago buy a friggen dash cam, NOW. I saw a 18 wheeler pulling some sort of farm trailer yesterday doing 90+ in a 45 in heavy traffic, just to slam on the brakes as they were riding the merge lane. permalink parent award report block reply 24601 4 points 6 days ago What's the problem? That's how they do it in India. permalink parent award report block reply Justlooking250 4 points 6 days ago S A A A R permalink parent award report block reply breathittbill 1 points 6 days ago Maybe for the big highway rigs. My local drivers are all American citizens that I have seen. permalink parent award report block reply\nMasterChief 2 points 6 days ago buy a friggen dash cam, NOW. I saw a 18 wheeler pulling some sort of farm trailer yesterday doing 90+ in a 45 in heavy traffic, just to slam on the brakes as they were riding the merge lane. permalink parent award report block reply 24601 4 points 6 days ago What's the problem? That's how they do it in India. permalink parent award report block reply Justlooking250 4 points 6 days ago S A A A R permalink parent award report block reply\n24601 4 points 6 days ago What's the problem? That's how they do it in India. permalink parent award report block reply Justlooking250 4 points 6 days ago S A A A R permalink parent award report block reply\nJustlooking250 4 points 6 days ago S A A A R permalink parent award report block reply\nbreathittbill 1 points 6 days ago Maybe for the big highway rigs. My local drivers are all American citizens that I have seen. permalink parent award report block reply\nGeneral_Grievance 6 points 6 days ago It'd be pretty neat if Republicans got on board with patronage, considering it's 50% of successful politicking. Reward friends, punish enemies. It's the easiest playbook created and they're like \"we'll just punish you slightly less hard\" and taxes go from 30% to 28% like oh gee thanks. Democrats get free food, housing, debt forgiveness, free hellcats and chargers, healthcare, and on and on, and we get to fund all that just a little less. permalink award report block reply\nB0bE 5 points 6 days ago I like the direction, but that's awful wordy. permalink award report block reply O__Q OP 3 points 6 days ago Yeah…gotta simplify it- I’ll do better on round 2 :) permalink parent award report block reply B0bE 1 points 6 days ago HOW'S MY DRIVING ?\nCALL 1-866-DHS-2-ICE permalink parent award report block reply\nO__Q OP 3 points 6 days ago Yeah…gotta simplify it- I’ll do better on round 2 :) permalink parent award report block reply B0bE 1 points 6 days ago HOW'S MY DRIVING ?\nCALL 1-866-DHS-2-ICE permalink parent award report block reply\nB0bE 1 points 6 days ago HOW'S MY DRIVING ?\nCALL 1-866-DHS-2-ICE permalink parent award report block reply\nO__Q OP 5 points 6 days ago Figured if my teenager needs a \"Please Be Patient, Student Driver\" bumper sticker, these criminals do too! permalink award report block reply\nroadrunner0 2 points 6 days ago So they will be self tagging their vehicles so we know who to force off the highway?? permalink award report block reply\nSmurfection 2 points 6 days ago I had to wait six hours past my appointment at the DMV to get a Real ID.   I had to bring a load of paperwork. Just to find out, illegal alien invaders are getting Real IDs and not only that, CDL Real IDs and so far almost 100 have had \"no name given\" for their names. The people involved in this fraud need to be charged, possibly hanged, put in jail for life, deported with no chance to enter America again and their families, legal or illegal, tossed out of the country.  By family, I mean the whole clan and in the case of Indian nationals, the entire caste. I am sick of citizens being forced to jump through hoops, pay taxes and file all the right forms and do the right things just so Democrats and criminals can shit all over it and let their pets and flunkies run roughshot over the U.S. and our citizens. permalink award report block reply\nKeep_on_Trumpin 1 points 6 days ago \"Works for company: California\" permalink award report block reply\nSuperHonkey 1 points 6 days ago All true, except for the gratitude portion permalink award report block reply\nDev404 1 points 6 days ago When your government treats foreign invaders better than the populace, you've already been conquered and don't know it. permalink award report block reply\nParadigmShift2070 1 points 6 days ago should be written in Mexican permalink award report block reply\n24601 1 points 6 days ago Missing the most important attribute: Indian permalink award report block reply\nbreathittbill 1 points 6 days ago The first step to tearing a country apart is to not require everyone to speak the same language. permalink award report block reply\nRudy_DankMemer 1 points 6 days ago Would be even more savage if this were written in CURSIVE. THIS permalink award report block reply\nKiekhaeferSoldier 1 points 6 days ago \"In This Car, we believe...\" (fill in the blank) permalink award report block reply\nBillGateCanSuckIt 1 points 6 days ago This is not easy to read. Yellow font is just not good permalink award report block reply\nO__Q OP 1 points 6 days ago u/-f-b-i- permalink award report block reply ILoveGoatFucking -1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nILoveGoatFucking -1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nPearlyGaits57 1 points 6 days ago Makes it easy to spot, then, DEPORT! permalink award report block reply\nDRKMSTR 0 points 6 days ago This is some boomer meme shit. GTFO. permalink award report block reply\nILoveGoatFucking -1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T20:45:14.421412Z"
}