{
  "id": "8184905",
  "title": "1201Because they were deported, you dumb Redditfag.\n\nThat was the point.posted7 hours agobycatsfive1",
  "url": "https://patriots.win/p/1ARK9mHmVR/because-they-were-deported-you-d/c",
  "content": "1202 Because they were deported, you dumb Redditfag.\n\nThat was the point. posted 7 hours ago by catsfive 146 comments award share download report block\n146 comments Sort by Top Top New Worst Old Save Cole_Burns 125 points 7 hours ago Deportation, how does it work? permalink award report block reply -Evspra 69 points 7 hours ago haha, classic. Fucking magnets, how do they work? And I don't wanna talk to a scientist Y'all motherfuckers lying, and getting me pissed permalink parent award report block reply travisestes 18 points 6 hours ago At least magnets are complicated physics permalink parent award report block reply 45fan 12 points 6 hours ago Eh magnets aren't complicated. All electrons are like little planets. They do spin as they sit about an atom. This creates a little tornado in space we call a magnetic field. If all the electrons in a material point their tornado randomly then they cancel each other out. If they point in the same direction they can create a strong wind. That's what allows magnets to reach out and touch things. permalink parent award report block reply MAGALADON9 13 points 5 hours ago Akkkkkkkchuly While the planetary analogy for electrons is pedagogically charming, it fundamentally misrepresents quantum electrodynamics and the origin of magnetism. Electrons are not classical “little planets” executing mechanical orbits with intrinsic spin like macroscopic tops; rather, spin is an intrinsic angular momentum governed by Dirac’s relativistic quantum mechanics, with no classical analogue. The electron’s magnetic dipole moment arises primarily from this spin (g ≈ 2), not orbital motion, as confirmed by the anomalous Zeeman effect and precision QED calculations matching experiment to 12 decimal places (α⁻¹ ≈ 137.035999177). Bulk magnetism emerges from Pauli exclusion and exchange coupling (Heisenberg Hamiltonian: Ĥ = –J Σ Sᵢ·Sⱼ), not mere “tornado alignment.” In ferromagnets, below the Curie temperature, spontaneous symmetry breaking aligns unpaired spins via superexchange or itinerant mechanisms (Stoner criterion), yielding macroscopic fields. Random thermal agitation (kT) competes with this order; cancellation in paramagnets reflects entropy, not geometric nulling of classical dipoles. Thus, the “tornado wind” metaphor collapses under scrutiny: magnetic fields are mediated by virtual photon exchange, not mechanical vortices, and the ability of magnets to “reach out” is the relativistic consequence of Lorentz-invariant field tensors, not planetary meteorology. The simplicity is illusory; the reality is profoundly quantum. I annoyed a doctor once with my equally erudite take on my girlfriends issue he frustratingly asked me where I went to med school - in obvious exasperation- and I said \"I didn't but I did stay at a holiday inn last night\" (it was funnier back then) Im a dropout.  Became a model/actor seemed more fun at the time. Now im.just a smart weirdo. permalink parent award report block reply view 16 more comments... SDsc0rch 3 points 5 hours ago what is the \"wind\" ??? /spooky action at a distance/ permalink parent award report block reply view 3 more comments... Cole_Burns 4 points 7 hours ago Not where I was headed with my reply but anyway... Who's going chicken hunting? We're going chicken hunting! permalink parent award report block reply -Evspra 6 points 7 hours ago my bad, my monkey brain immediately thinks of the magnets lyric whenever i see/hear someone asking how something works lol permalink parent award report block reply bigdickhangsright 5 points 7 hours ago I thought the same thing. \"How does/do...\" followed by a question  so stupid it seems like a joke always makes me think of that epic song. permalink parent award report block reply view 2 more comments... donteatthat 3 points 6 hours ago WHOOP WHOOP permalink parent award report block reply sobriquet 3 points 6 hours ago These dorks don't even know. Now toss me an ice cold Fago. permalink parent award report block reply SwampRangers 1 points 19 minutes ago Who is coordinating all those people trying to spell \"SOS\" but making it look like \"ZOS\", \"SOZ\", \"502\", or \"205\"? Like, oh, yeah, we're going to try to spell \"SOS\" and none of us is going to question the leadership as to why it's formed wrong, and, oh, yeah, the photographer is going to leave it as is and publish the wrong spelling. That's worse than the Gilligan's Island episode where they spelled \"SOL\". permalink parent award report block reply SwampRangers 1 points 18 minutes ago ^ u/catsfive permalink parent award report block reply Tcrlaf1 9 points 6 hours ago Alligators gotta eat…. permalink parent award report block reply LostElf 4 points 6 hours ago What is it good for? Absolutely everything permalink parent award report block reply ReturnOfSmarm 1 points 4 hours ago https://ibb.co/DgHCNBx9 permalink parent award report block reply NZbacon 0 points 4 hours ago They fed them to alligators.  It's right there in the name dummy. permalink parent award report block reply Hambonemcgee 46 points 7 hours ago It should always be full to capacity, even if they ship 2/3rds to their homelands daily. permalink award report block reply TheRedPike 15 points 5 hours ago homelands I was promised they would be sent to some distant african shithole with no money and no ability to speak the local language.  Dont disappoint me like this. permalink parent award report block reply bratt 3 points 5 hours ago sent to some distant African shithole They are sent there when we need to split families. The children go back to their native shitholes and the parents are sent to Africa. It is not necessary to add 'shithole' when using 'Africa', it is implied. permalink parent award report block reply Shitsbrokeyo 1 points 3 hours ago She be triple bunked like our citizen jails permalink parent award report block reply MR__K 1 points 33 minutes ago This guy gets it , fill that bitch back up. I want them all gone permalink parent award report block reply airborne3502 34 points 7 hours ago In other news, some unusually fat alligators have been spotted nearby. permalink award report block reply boredrandomguy 9 points 6 hours ago and they were burping up something that smelled like Taco Bell... permalink parent award report block reply NZbacon 5 points 4 hours ago Alligators with lasers strapped to their heads! permalink parent award report block reply DJT_MFers1 29 points 7 hours ago That 1200 was probably 15k Democrat votes permalink award report block reply July_1776 23 points 6 hours ago ahahahahahaha they're comparing it to Auschwitz aahhaahahahahha these people are retarded. permalink award report block reply SimaYi 12 points 6 hours ago Actually pretty good comparison. Neither of these places killed anyone, but Auschwitz did have more amenities. permalink parent award report block reply ianpatrick1966 12 points 5 hours ago Olympic swimming pool, theatre, and one of the most stocked maternity wards in post ww2 Germany. Sounds like heaven permalink parent award report block reply AgnosticTemplar 5 points 3 hours ago Yeah, but they were made to do menial labor, so it was hell for them. permalink parent award report block reply Glory-Unto-God 2 points 2 hours ago Captures a Rothschild. Forces him to clean a mansion. A living hell for him on par with the worst of torture imaginable. permalink parent award report block reply Redpilled2Depression 2 points 3 hours ago They even had a rabbit breeding program permalink parent award report block reply Moose_Antlers 1 points 54 minutes ago Heaven and Auschwitz should never be correlated. That's just a flat-out lie and anyone who has been to the site knows it. No, it wasn't the \"death camp\" we were taught it was. It was an internment camp for the least desirable among German society. They hired guards who were party zealots who eagerly mistreated the prisoners regularly. When it happened, it was permitted, excused, and covered up. Like every other prison in Occupied Europe at the time, they starved because the Wehrmacht was sending everything to the soldiers, who ate first. The prisoners were last to get rations and got the poorest quality treatment of everything. The prisoners suffered accordingly. That was true whether the prisoners were homosexuals, Roma, Slav, or just Aryans who didn't submit to the ruling party. All of them worked at gunpoint. All starved equally while the guards ate first. So yes, Auschwitz had some amenities, but it wasn't a 5-star hotel. Let's never make the mistake of that narrative. That's horse manure. If we're going to scream at the communists and Semites for lying about the camps, then it's our job not to lie to ourselves either. We have to tell the truth. They were prisons of a totalitarian Marxist state and they were awful. permalink parent award report block reply TheMostUselessFeeder 6 points 5 hours ago its weird how these people's entire realities hinge upon Orange Man being literally Hitler they can't function if they're not constantly screaming nazi references like, THIS IS TRUMPS REICHSTAG MOMENT OMG!!!!! (BUT FOR REAL THIS TIME, NOT LIKE THE OTHER 75 TIMES I SAID IT) permalink parent award report block reply AgnosticTemplar 6 points 3 hours ago I wish Trump were even half the nazi leftist pretend he is. permalink parent award report block reply RentedMule 17 points 7 hours ago Just curious; is there even a perimeter fence around the place?  Seems to me, if a few happen to escape into the Everglades before they're loaded onto the planes, that the problem would just take care of itself. permalink award report block reply KernalMustard 10 points 6 hours ago Gators climb chainlink fences. permalink parent award report block reply bratt 3 points 5 hours ago Gators climb chainlink fences I wish they did not think of that detail when building the cages inside the tents. permalink parent award report block reply Here_we_go 7 points 7 hours ago Yeah fenced in. Otherwise lefties would \"wonder\" in for pics. permalink parent award report block reply HKgoneWild 4 points 6 hours ago Why not send them to the gang prison in a certain now peaceful central American country? Let them get first hand photos from the inside and let them meet the \"human rights victims\" they preach about? permalink parent award report block reply Monsterouspoop 14 points 5 hours ago Theyre trying desperately to make it look some sort of holocaust. Its pathetic. permalink award report block reply MAGALADON9 12 points 7 hours ago I researched what escape might look like - and it's a hell.  It's not even gators, which there is literally millions of, it's the conditions the steamroom humidity (90%+)  but with scorching sun and curtains of a million flying biting stinging things flying in your mouth and nose; the water ripples with snakes there are 23 varieties of snake in that area; the natural environment is hazardous, you can get caught in old traps, or tangles of vegetation; the constant scraping and bug bites will lead to open sores and rapid infection. The mercury and other toxic water is an impossible sludge at the bottom and in spots will be thigh high soft mud that a normal man would be exhausted by in 100ft - but you have to go 39 miles to Miami. Impossible.  Maybe one of the most disturbing things is how the flora is laid out - it's a hellish labyrinth of nearly identical twists and bends, you'd look up from your shity makeshift raft only to be confused with the sun beaming through trees and reflecting off water. Heatstroke from the 110° heat index and dehydration will drain you quickly and a billion diseases and pathogens are all fighting to get inside you. A gator would be mercy. permalink award report block reply KernalMustard 13 points 6 hours ago They could have stayed home and avoided all that. Its a deterrent. Dont come. Dont go to AA. Easy permalink parent award report block reply MAGALADON9 6 points 6 hours ago I read my \"replies\" and scanned ... don't go to AA And was like: \"I know right, I went a few times but too culty I just stopped drinking I don't need AA, some do, that's cool - I just got into \"Darkside philosophy eg. Sith\" and just stopped.\" Then realized you were not talking about that AA. permalink parent award report block reply someguy7738 2 points 6 hours ago The biggest issue is there's basically no fresh water in the everglades. permalink parent award report block reply KernalMustard 5 points 6 hours ago Potable water. Yes you would be right permalink parent award report block reply PatriotSkorzeny 10 points 7 hours ago How many flights have left? That’s 5 or 6 fights. So only 5 or 6 planes have departed the runway airstrip next to AA? permalink award report block reply Here_we_go 9 points 7 hours ago Should be 12,000,000 \"missing\" so far. Fucking bullshit numbers. 1200 Thats how many nyc were getting from texas by buses a day. permalink award report block reply McFatty7 9 points 7 hours ago Do they really think forming a human \"SOS\" is somehow going to save them? lol permalink award report block reply they-see-me-trollin 10 points 6 hours ago except it's not an SOS.  It's more like a 2OS, or a 5o2.  apparently the letter S doesn't translate consistently in \"retarded illegal alien invader\". permalink parent award report block reply LostElf 5 points 6 hours ago No, but maybe SO5 will. permalink parent award report block reply MyNameIsTaxpayer 2 points 5 hours ago Trucking company hires are a no-show permalink parent award report block reply monkadelic 1 points 5 hours ago They know the left are useful idiots they can manipulate.  So why not give it a try.  I'm sure reddit is lapping it up. permalink parent award report block reply Haiper 1 points 1 hour ago It would, if Salvadorian Gilligan didn't keep screwing things up. permalink parent award report block reply LostElf 5 points 6 hours ago Did they think it was a permanent home for illegals? Oh, sorry, I used the word think in reference to redditardia. permalink award report block reply JoeBidensDementia1 4 points 7 hours ago This is a fake photo. They don't know how to spell. permalink award report block reply DefinitelyNotFed 4 points 6 hours ago Them not knowing how to spell makes it realer. permalink parent award report block reply MyNameIsTaxpayer 4 points 5 hours ago 5o2 what kind of engineers are these? permalink award report block reply Mega_MAGA 4 points 6 hours ago Alligators gotta eat permalink award report block reply SDsc0rch 3 points 5 hours ago \"SOS\" but one S is backwards retards permalink award report block reply kjj9 1 points 5 hours ago I read it as 205.  No idea what 205 means. permalink parent award report block reply ianpatrick1966 1 points 5 hours ago Probably an area code gangs tend to use those for their names theee days permalink parent award report block reply daveyistheman 3 points 7 hours ago They fed them to the alligators permalink award report block reply Spinedoc 3 points 6 hours ago South Florida here. I was wondering why all the gators looked fat and happy lately. They were feasting on Mexican food. permalink award report block reply donteatthat 3 points 6 hours ago Ok so this retard was inside the walls taking attendance? Yeah fucking right permalink award report block reply noPTSDforMePlease 2 points 2 hours ago You can't hate the media enough. They're implying that they were killed like in a concentration camp to rally more hatred against Trump. permalink award report block reply SRK_Tiberious 1 points 2 hours ago And just wait 'til you find out... permalink parent award report block reply catsfive OP 2 points 7 hours ago https://x.com/reddit_lies/status/1988412938118393919 permalink award report block reply Frociaggine 2 points 7 hours ago Gators well feed permalink award report block reply Live_free_or_die_55 2 points 7 hours ago Deport them all Now!!! permalink award report block reply R3tro 2 points 6 hours ago Either that, or some fat alligators out there… permalink award report block reply trumpdagoat 2 points 1 hour ago Exactly, OP. And this is a problem why? permalink award report block reply Liberats 2 points 6 hours ago Gators are sleeping it off. permalink award report block reply ElevenMile 2 points 4 hours ago Not sure what \"205\" is supposed to be ;) permalink award report block reply I_Love_45-70_Gov 2 points 5 hours ago 30 million people just appeared in the U.S., faggot. permalink award report block reply JetJocky 2 points 5 hours ago I bet that $1000 and free flight home looks pretty good to the Alligator Alcatraz detainees right about now. Too late, you had your chance. permalink award report block reply magamagashii 2 points 5 hours ago If they are lying about 1200 people being murdered last week, which this number will probably increase to 1 million by the end of Trump's term, then three million years later, then six million years after that....well, if they are lying about that you've got to wonder what else they have lied about. Pretty soon it will probably be illegal to even say they were deported. permalink award report block reply ConsrvspkgNJ 2 points 2 hours ago I guess the alligators got THEIR SNAP benefits........ permalink award report block reply MkultraUSA 2 points 4 hours ago What if we didn't bother to observe it? Kek.... You lose magnetism. permalink award report block reply RobinNet 2 points 4 hours ago All the gators seem well-fed as well... permalink award report block reply taytaytay 1 points 3 hours ago I'm hoping they were fed to gators. I'll settle for deportation. I'm a reasonable man. permalink parent award report block reply RustySheckelford 2 points 5 hours ago Democrats pretending to be retarded is so unbelievably embarrassing.... Can't believe I share a citizenship with these clowns. permalink award report block reply Riehlpissed 2 points 3 hours ago SOS? “Ship Out Soon,”  I guess. permalink award report block reply 2Clutch 2 points 3 hours ago 205? permalink award report block reply My2SonsAreMarines 2 points 3 hours ago Hungry, hungry, alligators! permalink award report block reply jsphere256 2 points 5 hours ago The disappearance mysteriously coincided with the grand opening of a new Chipotle location across the street permalink award report block reply RememberCharlieKirk 1 points 2 hours ago Deportation is the compromise. permalink award report block reply HunterBidensPC 1 points 3 hours ago Shut it down. Much better to just shoot illegals and save on food and travel. Will certainly ramp up self deportations too permalink award report block reply ElevenMile 1 points 4 hours ago 4,600 \"upvotes\" on that, eh? permalink award report block reply QSWO1 1 points 2 hours ago Should be that × ten per day. permalink award report block reply ReturnOfSmarm 1 points 4 hours ago It's a shame .... from the looks of that picture they were just getting the whole marching band thing honed. permalink award report block reply Fury_of_Descent 1 points 5 hours ago Hey Leftards, while Beyond Meat might be on its way out, have you tried Soylento Verde? It's got a kick of spicy goodness and comes in a variety of ethnicities! Try our new flavors: MuHAMmed Madness, Street Shitter Surprise and the Ol' Tyme favorite of Day Laborer Delite! All the aroma and flavor of a blown out Home Depot Toilet!! permalink award report block reply PearlyGaits57 1 points 6 hours ago Gator food. Haachiwowwa! permalink award report block reply Induceddrag 1 points 6 hours ago One of the great things about this facility is it has a runway on the same location . permalink award report block reply TGNX 1 points 6 hours ago Seriously? permalink award report block reply DRK00 1 points 4 hours ago Start replying to those threads with photos of fat alligators permalink award report block reply geekesmind 1 points 6 hours ago Only 1200? Fuck we need bigger numbers permalink award report block reply Eddie_Vanjovi 1 points 5 hours ago \"1500 people just gone and replaced at your nearest hospital. Where do these people disappear to? The dangers of hospital visits at 5.\" The Left are outrageous... Lol permalink award report block reply redditadminssuckit 1 points 5 hours ago SOYLENT BEANer permalink award report block reply Bax101 1 points 4 hours ago Same retards who forgot about those caravans of people coming into the country under Obiden. permalink award report block reply mass55th 1 points 44 minutes ago \"I_May_Have_Weed\" You may have a brain too, but you don't. permalink award report block reply JustTheNews 1 points 7 hours ago Just........ shoot em..... why do we treat invaders any different from the rest of the world and history.  Tell them to go home,  if caught again shoot em. permalink award report block reply SimaYi 4 points 6 hours ago Damn, not even the Nazis did that. permalink parent award report block reply HeavenlyTrumpets 1 points 4 hours ago diSaPpeArEd permalink award report block reply Skabliggum2 1 points 5 hours ago In an unrelated story, the Alligator population is thriving and healthier than ever! permalink award report block reply 0care 1 points 3 hours ago lol it is funnier this way, need to troll with the fat alligator pics permalink award report block reply AfrikaanerBoer 1 points 5 hours ago H1Bs and all those fucken towel head pajeeets who voted for MAMDANI should be next to be rounded up and exterminated 💯 street shitters are the demoKKKrat plantation’s new slaves: more devious and cunning than the negroes (whom they’re tired of for being perennial lazy dumbass leeches the past 160+ years) permalink award report block reply DEPORT50M 1 points 4 hours ago Oh no! So you're saying we can track these people?? permalink award report block reply blue5707 1 points 4 hours ago sos...lmao permalink award report block reply KewMan 1 points 4 hours ago Like I care whether they are deported or fed alligators... No return trips from alligator feeding tho. permalink award report block reply Krat 1 points 3 hours ago What I am seeing is a lot of empty spots and over 150 million opportunities permalink award report block reply BarneyFrank 1 points 7 hours ago They don’t even have enough people left to spell “gay”! permalink award report block reply 19American62Woman 1 points 7 hours ago I don’t care permalink award report block reply DontTreadOnLego 1 points 4 hours ago The alligators were hungry....... for deportation permalink award report block reply Rock9Head 1 points 3 hours ago This time, it wasn’t Dahmer. permalink award report block reply Seruna_Kanus 1 points 5 hours ago Wait, why do they have basketball courts? permalink award report block reply CharlieMike 1 points 7 hours ago Only 2/3?  I’m disappointed. permalink award report block reply LawyersPlayDota 1 points 7 hours ago Communists only understand \"disappearing\" people, that's why. permalink award report block reply MAGALADON9 1 points 5 hours ago The Grammar Nazi in me looks at this picture and slams my fist on the table and says. Nein! Alle kommen in den Ofen!\" permalink award report block reply JBlaze056 1 points 3 hours ago That's the point permalink award report block reply Goozmania 0 points 7 hours ago Didn't it mostly get shut down by a rogue judge? permalink award report block reply USNVET71 -2 points 3 hours ago Yeah gone to where they fucking came from , you dumb faggot permalink award report block reply rapskull 1 points 7 hours ago Comment removed by community moderators. permalink award report block reply cordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nCole_Burns 125 points 7 hours ago Deportation, how does it work? permalink award report block reply -Evspra 69 points 7 hours ago haha, classic. Fucking magnets, how do they work? And I don't wanna talk to a scientist Y'all motherfuckers lying, and getting me pissed permalink parent award report block reply travisestes 18 points 6 hours ago At least magnets are complicated physics permalink parent award report block reply 45fan 12 points 6 hours ago Eh magnets aren't complicated. All electrons are like little planets. They do spin as they sit about an atom. This creates a little tornado in space we call a magnetic field. If all the electrons in a material point their tornado randomly then they cancel each other out. If they point in the same direction they can create a strong wind. That's what allows magnets to reach out and touch things. permalink parent award report block reply MAGALADON9 13 points 5 hours ago Akkkkkkkchuly While the planetary analogy for electrons is pedagogically charming, it fundamentally misrepresents quantum electrodynamics and the origin of magnetism. Electrons are not classical “little planets” executing mechanical orbits with intrinsic spin like macroscopic tops; rather, spin is an intrinsic angular momentum governed by Dirac’s relativistic quantum mechanics, with no classical analogue. The electron’s magnetic dipole moment arises primarily from this spin (g ≈ 2), not orbital motion, as confirmed by the anomalous Zeeman effect and precision QED calculations matching experiment to 12 decimal places (α⁻¹ ≈ 137.035999177). Bulk magnetism emerges from Pauli exclusion and exchange coupling (Heisenberg Hamiltonian: Ĥ = –J Σ Sᵢ·Sⱼ), not mere “tornado alignment.” In ferromagnets, below the Curie temperature, spontaneous symmetry breaking aligns unpaired spins via superexchange or itinerant mechanisms (Stoner criterion), yielding macroscopic fields. Random thermal agitation (kT) competes with this order; cancellation in paramagnets reflects entropy, not geometric nulling of classical dipoles. Thus, the “tornado wind” metaphor collapses under scrutiny: magnetic fields are mediated by virtual photon exchange, not mechanical vortices, and the ability of magnets to “reach out” is the relativistic consequence of Lorentz-invariant field tensors, not planetary meteorology. The simplicity is illusory; the reality is profoundly quantum. I annoyed a doctor once with my equally erudite take on my girlfriends issue he frustratingly asked me where I went to med school - in obvious exasperation- and I said \"I didn't but I did stay at a holiday inn last night\" (it was funnier back then) Im a dropout.  Became a model/actor seemed more fun at the time. Now im.just a smart weirdo. permalink parent award report block reply view 16 more comments... SDsc0rch 3 points 5 hours ago what is the \"wind\" ??? /spooky action at a distance/ permalink parent award report block reply view 3 more comments... Cole_Burns 4 points 7 hours ago Not where I was headed with my reply but anyway... Who's going chicken hunting? We're going chicken hunting! permalink parent award report block reply -Evspra 6 points 7 hours ago my bad, my monkey brain immediately thinks of the magnets lyric whenever i see/hear someone asking how something works lol permalink parent award report block reply bigdickhangsright 5 points 7 hours ago I thought the same thing. \"How does/do...\" followed by a question  so stupid it seems like a joke always makes me think of that epic song. permalink parent award report block reply view 2 more comments... donteatthat 3 points 6 hours ago WHOOP WHOOP permalink parent award report block reply sobriquet 3 points 6 hours ago These dorks don't even know. Now toss me an ice cold Fago. permalink parent award report block reply SwampRangers 1 points 19 minutes ago Who is coordinating all those people trying to spell \"SOS\" but making it look like \"ZOS\", \"SOZ\", \"502\", or \"205\"? Like, oh, yeah, we're going to try to spell \"SOS\" and none of us is going to question the leadership as to why it's formed wrong, and, oh, yeah, the photographer is going to leave it as is and publish the wrong spelling. That's worse than the Gilligan's Island episode where they spelled \"SOL\". permalink parent award report block reply SwampRangers 1 points 18 minutes ago ^ u/catsfive permalink parent award report block reply Tcrlaf1 9 points 6 hours ago Alligators gotta eat…. permalink parent award report block reply LostElf 4 points 6 hours ago What is it good for? Absolutely everything permalink parent award report block reply ReturnOfSmarm 1 points 4 hours ago https://ibb.co/DgHCNBx9 permalink parent award report block reply NZbacon 0 points 4 hours ago They fed them to alligators.  It's right there in the name dummy. permalink parent award report block reply\n-Evspra 69 points 7 hours ago haha, classic. Fucking magnets, how do they work? And I don't wanna talk to a scientist Y'all motherfuckers lying, and getting me pissed permalink parent award report block reply travisestes 18 points 6 hours ago At least magnets are complicated physics permalink parent award report block reply 45fan 12 points 6 hours ago Eh magnets aren't complicated. All electrons are like little planets. They do spin as they sit about an atom. This creates a little tornado in space we call a magnetic field. If all the electrons in a material point their tornado randomly then they cancel each other out. If they point in the same direction they can create a strong wind. That's what allows magnets to reach out and touch things. permalink parent award report block reply MAGALADON9 13 points 5 hours ago Akkkkkkkchuly While the planetary analogy for electrons is pedagogically charming, it fundamentally misrepresents quantum electrodynamics and the origin of magnetism. Electrons are not classical “little planets” executing mechanical orbits with intrinsic spin like macroscopic tops; rather, spin is an intrinsic angular momentum governed by Dirac’s relativistic quantum mechanics, with no classical analogue. The electron’s magnetic dipole moment arises primarily from this spin (g ≈ 2), not orbital motion, as confirmed by the anomalous Zeeman effect and precision QED calculations matching experiment to 12 decimal places (α⁻¹ ≈ 137.035999177). Bulk magnetism emerges from Pauli exclusion and exchange coupling (Heisenberg Hamiltonian: Ĥ = –J Σ Sᵢ·Sⱼ), not mere “tornado alignment.” In ferromagnets, below the Curie temperature, spontaneous symmetry breaking aligns unpaired spins via superexchange or itinerant mechanisms (Stoner criterion), yielding macroscopic fields. Random thermal agitation (kT) competes with this order; cancellation in paramagnets reflects entropy, not geometric nulling of classical dipoles. Thus, the “tornado wind” metaphor collapses under scrutiny: magnetic fields are mediated by virtual photon exchange, not mechanical vortices, and the ability of magnets to “reach out” is the relativistic consequence of Lorentz-invariant field tensors, not planetary meteorology. The simplicity is illusory; the reality is profoundly quantum. I annoyed a doctor once with my equally erudite take on my girlfriends issue he frustratingly asked me where I went to med school - in obvious exasperation- and I said \"I didn't but I did stay at a holiday inn last night\" (it was funnier back then) Im a dropout.  Became a model/actor seemed more fun at the time. Now im.just a smart weirdo. permalink parent award report block reply view 16 more comments... SDsc0rch 3 points 5 hours ago what is the \"wind\" ??? /spooky action at a distance/ permalink parent award report block reply view 3 more comments... Cole_Burns 4 points 7 hours ago Not where I was headed with my reply but anyway... Who's going chicken hunting? We're going chicken hunting! permalink parent award report block reply -Evspra 6 points 7 hours ago my bad, my monkey brain immediately thinks of the magnets lyric whenever i see/hear someone asking how something works lol permalink parent award report block reply bigdickhangsright 5 points 7 hours ago I thought the same thing. \"How does/do...\" followed by a question  so stupid it seems like a joke always makes me think of that epic song. permalink parent award report block reply view 2 more comments... donteatthat 3 points 6 hours ago WHOOP WHOOP permalink parent award report block reply sobriquet 3 points 6 hours ago These dorks don't even know. Now toss me an ice cold Fago. permalink parent award report block reply SwampRangers 1 points 19 minutes ago Who is coordinating all those people trying to spell \"SOS\" but making it look like \"ZOS\", \"SOZ\", \"502\", or \"205\"? Like, oh, yeah, we're going to try to spell \"SOS\" and none of us is going to question the leadership as to why it's formed wrong, and, oh, yeah, the photographer is going to leave it as is and publish the wrong spelling. That's worse than the Gilligan's Island episode where they spelled \"SOL\". permalink parent award report block reply SwampRangers 1 points 18 minutes ago ^ u/catsfive permalink parent award report block reply\ntravisestes 18 points 6 hours ago At least magnets are complicated physics permalink parent award report block reply 45fan 12 points 6 hours ago Eh magnets aren't complicated. All electrons are like little planets. They do spin as they sit about an atom. This creates a little tornado in space we call a magnetic field. If all the electrons in a material point their tornado randomly then they cancel each other out. If they point in the same direction they can create a strong wind. That's what allows magnets to reach out and touch things. permalink parent award report block reply MAGALADON9 13 points 5 hours ago Akkkkkkkchuly While the planetary analogy for electrons is pedagogically charming, it fundamentally misrepresents quantum electrodynamics and the origin of magnetism. Electrons are not classical “little planets” executing mechanical orbits with intrinsic spin like macroscopic tops; rather, spin is an intrinsic angular momentum governed by Dirac’s relativistic quantum mechanics, with no classical analogue. The electron’s magnetic dipole moment arises primarily from this spin (g ≈ 2), not orbital motion, as confirmed by the anomalous Zeeman effect and precision QED calculations matching experiment to 12 decimal places (α⁻¹ ≈ 137.035999177). Bulk magnetism emerges from Pauli exclusion and exchange coupling (Heisenberg Hamiltonian: Ĥ = –J Σ Sᵢ·Sⱼ), not mere “tornado alignment.” In ferromagnets, below the Curie temperature, spontaneous symmetry breaking aligns unpaired spins via superexchange or itinerant mechanisms (Stoner criterion), yielding macroscopic fields. Random thermal agitation (kT) competes with this order; cancellation in paramagnets reflects entropy, not geometric nulling of classical dipoles. Thus, the “tornado wind” metaphor collapses under scrutiny: magnetic fields are mediated by virtual photon exchange, not mechanical vortices, and the ability of magnets to “reach out” is the relativistic consequence of Lorentz-invariant field tensors, not planetary meteorology. The simplicity is illusory; the reality is profoundly quantum. I annoyed a doctor once with my equally erudite take on my girlfriends issue he frustratingly asked me where I went to med school - in obvious exasperation- and I said \"I didn't but I did stay at a holiday inn last night\" (it was funnier back then) Im a dropout.  Became a model/actor seemed more fun at the time. Now im.just a smart weirdo. permalink parent award report block reply view 16 more comments... SDsc0rch 3 points 5 hours ago what is the \"wind\" ??? /spooky action at a distance/ permalink parent award report block reply view 3 more comments...\n45fan 12 points 6 hours ago Eh magnets aren't complicated. All electrons are like little planets. They do spin as they sit about an atom. This creates a little tornado in space we call a magnetic field. If all the electrons in a material point their tornado randomly then they cancel each other out. If they point in the same direction they can create a strong wind. That's what allows magnets to reach out and touch things. permalink parent award report block reply MAGALADON9 13 points 5 hours ago Akkkkkkkchuly While the planetary analogy for electrons is pedagogically charming, it fundamentally misrepresents quantum electrodynamics and the origin of magnetism. Electrons are not classical “little planets” executing mechanical orbits with intrinsic spin like macroscopic tops; rather, spin is an intrinsic angular momentum governed by Dirac’s relativistic quantum mechanics, with no classical analogue. The electron’s magnetic dipole moment arises primarily from this spin (g ≈ 2), not orbital motion, as confirmed by the anomalous Zeeman effect and precision QED calculations matching experiment to 12 decimal places (α⁻¹ ≈ 137.035999177). Bulk magnetism emerges from Pauli exclusion and exchange coupling (Heisenberg Hamiltonian: Ĥ = –J Σ Sᵢ·Sⱼ), not mere “tornado alignment.” In ferromagnets, below the Curie temperature, spontaneous symmetry breaking aligns unpaired spins via superexchange or itinerant mechanisms (Stoner criterion), yielding macroscopic fields. Random thermal agitation (kT) competes with this order; cancellation in paramagnets reflects entropy, not geometric nulling of classical dipoles. Thus, the “tornado wind” metaphor collapses under scrutiny: magnetic fields are mediated by virtual photon exchange, not mechanical vortices, and the ability of magnets to “reach out” is the relativistic consequence of Lorentz-invariant field tensors, not planetary meteorology. The simplicity is illusory; the reality is profoundly quantum. I annoyed a doctor once with my equally erudite take on my girlfriends issue he frustratingly asked me where I went to med school - in obvious exasperation- and I said \"I didn't but I did stay at a holiday inn last night\" (it was funnier back then) Im a dropout.  Became a model/actor seemed more fun at the time. Now im.just a smart weirdo. permalink parent award report block reply view 16 more comments... SDsc0rch 3 points 5 hours ago what is the \"wind\" ??? /spooky action at a distance/ permalink parent award report block reply view 3 more comments...\nMAGALADON9 13 points 5 hours ago Akkkkkkkchuly While the planetary analogy for electrons is pedagogically charming, it fundamentally misrepresents quantum electrodynamics and the origin of magnetism. Electrons are not classical “little planets” executing mechanical orbits with intrinsic spin like macroscopic tops; rather, spin is an intrinsic angular momentum governed by Dirac’s relativistic quantum mechanics, with no classical analogue. The electron’s magnetic dipole moment arises primarily from this spin (g ≈ 2), not orbital motion, as confirmed by the anomalous Zeeman effect and precision QED calculations matching experiment to 12 decimal places (α⁻¹ ≈ 137.035999177). Bulk magnetism emerges from Pauli exclusion and exchange coupling (Heisenberg Hamiltonian: Ĥ = –J Σ Sᵢ·Sⱼ), not mere “tornado alignment.” In ferromagnets, below the Curie temperature, spontaneous symmetry breaking aligns unpaired spins via superexchange or itinerant mechanisms (Stoner criterion), yielding macroscopic fields. Random thermal agitation (kT) competes with this order; cancellation in paramagnets reflects entropy, not geometric nulling of classical dipoles. Thus, the “tornado wind” metaphor collapses under scrutiny: magnetic fields are mediated by virtual photon exchange, not mechanical vortices, and the ability of magnets to “reach out” is the relativistic consequence of Lorentz-invariant field tensors, not planetary meteorology. The simplicity is illusory; the reality is profoundly quantum. I annoyed a doctor once with my equally erudite take on my girlfriends issue he frustratingly asked me where I went to med school - in obvious exasperation- and I said \"I didn't but I did stay at a holiday inn last night\" (it was funnier back then) Im a dropout.  Became a model/actor seemed more fun at the time. Now im.just a smart weirdo. permalink parent award report block reply view 16 more comments...\nSDsc0rch 3 points 5 hours ago what is the \"wind\" ??? /spooky action at a distance/ permalink parent award report block reply view 3 more comments...\nCole_Burns 4 points 7 hours ago Not where I was headed with my reply but anyway... Who's going chicken hunting? We're going chicken hunting! permalink parent award report block reply -Evspra 6 points 7 hours ago my bad, my monkey brain immediately thinks of the magnets lyric whenever i see/hear someone asking how something works lol permalink parent award report block reply bigdickhangsright 5 points 7 hours ago I thought the same thing. \"How does/do...\" followed by a question  so stupid it seems like a joke always makes me think of that epic song. permalink parent award report block reply view 2 more comments... donteatthat 3 points 6 hours ago WHOOP WHOOP permalink parent award report block reply sobriquet 3 points 6 hours ago These dorks don't even know. Now toss me an ice cold Fago. permalink parent award report block reply\n-Evspra 6 points 7 hours ago my bad, my monkey brain immediately thinks of the magnets lyric whenever i see/hear someone asking how something works lol permalink parent award report block reply bigdickhangsright 5 points 7 hours ago I thought the same thing. \"How does/do...\" followed by a question  so stupid it seems like a joke always makes me think of that epic song. permalink parent award report block reply view 2 more comments...\nbigdickhangsright 5 points 7 hours ago I thought the same thing. \"How does/do...\" followed by a question  so stupid it seems like a joke always makes me think of that epic song. permalink parent award report block reply view 2 more comments...\ndonteatthat 3 points 6 hours ago WHOOP WHOOP permalink parent award report block reply sobriquet 3 points 6 hours ago These dorks don't even know. Now toss me an ice cold Fago. permalink parent award report block reply\nsobriquet 3 points 6 hours ago These dorks don't even know. Now toss me an ice cold Fago. permalink parent award report block reply\nSwampRangers 1 points 19 minutes ago Who is coordinating all those people trying to spell \"SOS\" but making it look like \"ZOS\", \"SOZ\", \"502\", or \"205\"? Like, oh, yeah, we're going to try to spell \"SOS\" and none of us is going to question the leadership as to why it's formed wrong, and, oh, yeah, the photographer is going to leave it as is and publish the wrong spelling. That's worse than the Gilligan's Island episode where they spelled \"SOL\". permalink parent award report block reply SwampRangers 1 points 18 minutes ago ^ u/catsfive permalink parent award report block reply\nSwampRangers 1 points 18 minutes ago ^ u/catsfive permalink parent award report block reply\nTcrlaf1 9 points 6 hours ago Alligators gotta eat…. permalink parent award report block reply\nLostElf 4 points 6 hours ago What is it good for? Absolutely everything permalink parent award report block reply\nReturnOfSmarm 1 points 4 hours ago https://ibb.co/DgHCNBx9 permalink parent award report block reply\nNZbacon 0 points 4 hours ago They fed them to alligators.  It's right there in the name dummy. permalink parent award report block reply\nHambonemcgee 46 points 7 hours ago It should always be full to capacity, even if they ship 2/3rds to their homelands daily. permalink award report block reply TheRedPike 15 points 5 hours ago homelands I was promised they would be sent to some distant african shithole with no money and no ability to speak the local language.  Dont disappoint me like this. permalink parent award report block reply bratt 3 points 5 hours ago sent to some distant African shithole They are sent there when we need to split families. The children go back to their native shitholes and the parents are sent to Africa. It is not necessary to add 'shithole' when using 'Africa', it is implied. permalink parent award report block reply Shitsbrokeyo 1 points 3 hours ago She be triple bunked like our citizen jails permalink parent award report block reply MR__K 1 points 33 minutes ago This guy gets it , fill that bitch back up. I want them all gone permalink parent award report block reply\nTheRedPike 15 points 5 hours ago homelands I was promised they would be sent to some distant african shithole with no money and no ability to speak the local language.  Dont disappoint me like this. permalink parent award report block reply bratt 3 points 5 hours ago sent to some distant African shithole They are sent there when we need to split families. The children go back to their native shitholes and the parents are sent to Africa. It is not necessary to add 'shithole' when using 'Africa', it is implied. permalink parent award report block reply\nbratt 3 points 5 hours ago sent to some distant African shithole They are sent there when we need to split families. The children go back to their native shitholes and the parents are sent to Africa. It is not necessary to add 'shithole' when using 'Africa', it is implied. permalink parent award report block reply\nShitsbrokeyo 1 points 3 hours ago She be triple bunked like our citizen jails permalink parent award report block reply\nMR__K 1 points 33 minutes ago This guy gets it , fill that bitch back up. I want them all gone permalink parent award report block reply\nairborne3502 34 points 7 hours ago In other news, some unusually fat alligators have been spotted nearby. permalink award report block reply boredrandomguy 9 points 6 hours ago and they were burping up something that smelled like Taco Bell... permalink parent award report block reply NZbacon 5 points 4 hours ago Alligators with lasers strapped to their heads! permalink parent award report block reply\nboredrandomguy 9 points 6 hours ago and they were burping up something that smelled like Taco Bell... permalink parent award report block reply\nNZbacon 5 points 4 hours ago Alligators with lasers strapped to their heads! permalink parent award report block reply\nDJT_MFers1 29 points 7 hours ago That 1200 was probably 15k Democrat votes permalink award report block reply\nJuly_1776 23 points 6 hours ago ahahahahahaha they're comparing it to Auschwitz aahhaahahahahha these people are retarded. permalink award report block reply SimaYi 12 points 6 hours ago Actually pretty good comparison. Neither of these places killed anyone, but Auschwitz did have more amenities. permalink parent award report block reply ianpatrick1966 12 points 5 hours ago Olympic swimming pool, theatre, and one of the most stocked maternity wards in post ww2 Germany. Sounds like heaven permalink parent award report block reply AgnosticTemplar 5 points 3 hours ago Yeah, but they were made to do menial labor, so it was hell for them. permalink parent award report block reply Glory-Unto-God 2 points 2 hours ago Captures a Rothschild. Forces him to clean a mansion. A living hell for him on par with the worst of torture imaginable. permalink parent award report block reply Redpilled2Depression 2 points 3 hours ago They even had a rabbit breeding program permalink parent award report block reply Moose_Antlers 1 points 54 minutes ago Heaven and Auschwitz should never be correlated. That's just a flat-out lie and anyone who has been to the site knows it. No, it wasn't the \"death camp\" we were taught it was. It was an internment camp for the least desirable among German society. They hired guards who were party zealots who eagerly mistreated the prisoners regularly. When it happened, it was permitted, excused, and covered up. Like every other prison in Occupied Europe at the time, they starved because the Wehrmacht was sending everything to the soldiers, who ate first. The prisoners were last to get rations and got the poorest quality treatment of everything. The prisoners suffered accordingly. That was true whether the prisoners were homosexuals, Roma, Slav, or just Aryans who didn't submit to the ruling party. All of them worked at gunpoint. All starved equally while the guards ate first. So yes, Auschwitz had some amenities, but it wasn't a 5-star hotel. Let's never make the mistake of that narrative. That's horse manure. If we're going to scream at the communists and Semites for lying about the camps, then it's our job not to lie to ourselves either. We have to tell the truth. They were prisons of a totalitarian Marxist state and they were awful. permalink parent award report block reply TheMostUselessFeeder 6 points 5 hours ago its weird how these people's entire realities hinge upon Orange Man being literally Hitler they can't function if they're not constantly screaming nazi references like, THIS IS TRUMPS REICHSTAG MOMENT OMG!!!!! (BUT FOR REAL THIS TIME, NOT LIKE THE OTHER 75 TIMES I SAID IT) permalink parent award report block reply AgnosticTemplar 6 points 3 hours ago I wish Trump were even half the nazi leftist pretend he is. permalink parent award report block reply\nSimaYi 12 points 6 hours ago Actually pretty good comparison. Neither of these places killed anyone, but Auschwitz did have more amenities. permalink parent award report block reply ianpatrick1966 12 points 5 hours ago Olympic swimming pool, theatre, and one of the most stocked maternity wards in post ww2 Germany. Sounds like heaven permalink parent award report block reply AgnosticTemplar 5 points 3 hours ago Yeah, but they were made to do menial labor, so it was hell for them. permalink parent award report block reply Glory-Unto-God 2 points 2 hours ago Captures a Rothschild. Forces him to clean a mansion. A living hell for him on par with the worst of torture imaginable. permalink parent award report block reply Redpilled2Depression 2 points 3 hours ago They even had a rabbit breeding program permalink parent award report block reply Moose_Antlers 1 points 54 minutes ago Heaven and Auschwitz should never be correlated. That's just a flat-out lie and anyone who has been to the site knows it. No, it wasn't the \"death camp\" we were taught it was. It was an internment camp for the least desirable among German society. They hired guards who were party zealots who eagerly mistreated the prisoners regularly. When it happened, it was permitted, excused, and covered up. Like every other prison in Occupied Europe at the time, they starved because the Wehrmacht was sending everything to the soldiers, who ate first. The prisoners were last to get rations and got the poorest quality treatment of everything. The prisoners suffered accordingly. That was true whether the prisoners were homosexuals, Roma, Slav, or just Aryans who didn't submit to the ruling party. All of them worked at gunpoint. All starved equally while the guards ate first. So yes, Auschwitz had some amenities, but it wasn't a 5-star hotel. Let's never make the mistake of that narrative. That's horse manure. If we're going to scream at the communists and Semites for lying about the camps, then it's our job not to lie to ourselves either. We have to tell the truth. They were prisons of a totalitarian Marxist state and they were awful. permalink parent award report block reply\nianpatrick1966 12 points 5 hours ago Olympic swimming pool, theatre, and one of the most stocked maternity wards in post ww2 Germany. Sounds like heaven permalink parent award report block reply AgnosticTemplar 5 points 3 hours ago Yeah, but they were made to do menial labor, so it was hell for them. permalink parent award report block reply Glory-Unto-God 2 points 2 hours ago Captures a Rothschild. Forces him to clean a mansion. A living hell for him on par with the worst of torture imaginable. permalink parent award report block reply Redpilled2Depression 2 points 3 hours ago They even had a rabbit breeding program permalink parent award report block reply Moose_Antlers 1 points 54 minutes ago Heaven and Auschwitz should never be correlated. That's just a flat-out lie and anyone who has been to the site knows it. No, it wasn't the \"death camp\" we were taught it was. It was an internment camp for the least desirable among German society. They hired guards who were party zealots who eagerly mistreated the prisoners regularly. When it happened, it was permitted, excused, and covered up. Like every other prison in Occupied Europe at the time, they starved because the Wehrmacht was sending everything to the soldiers, who ate first. The prisoners were last to get rations and got the poorest quality treatment of everything. The prisoners suffered accordingly. That was true whether the prisoners were homosexuals, Roma, Slav, or just Aryans who didn't submit to the ruling party. All of them worked at gunpoint. All starved equally while the guards ate first. So yes, Auschwitz had some amenities, but it wasn't a 5-star hotel. Let's never make the mistake of that narrative. That's horse manure. If we're going to scream at the communists and Semites for lying about the camps, then it's our job not to lie to ourselves either. We have to tell the truth. They were prisons of a totalitarian Marxist state and they were awful. permalink parent award report block reply\nAgnosticTemplar 5 points 3 hours ago Yeah, but they were made to do menial labor, so it was hell for them. permalink parent award report block reply Glory-Unto-God 2 points 2 hours ago Captures a Rothschild. Forces him to clean a mansion. A living hell for him on par with the worst of torture imaginable. permalink parent award report block reply\nGlory-Unto-God 2 points 2 hours ago Captures a Rothschild. Forces him to clean a mansion. A living hell for him on par with the worst of torture imaginable. permalink parent award report block reply\nRedpilled2Depression 2 points 3 hours ago They even had a rabbit breeding program permalink parent award report block reply\nMoose_Antlers 1 points 54 minutes ago Heaven and Auschwitz should never be correlated. That's just a flat-out lie and anyone who has been to the site knows it. No, it wasn't the \"death camp\" we were taught it was. It was an internment camp for the least desirable among German society. They hired guards who were party zealots who eagerly mistreated the prisoners regularly. When it happened, it was permitted, excused, and covered up. Like every other prison in Occupied Europe at the time, they starved because the Wehrmacht was sending everything to the soldiers, who ate first. The prisoners were last to get rations and got the poorest quality treatment of everything. The prisoners suffered accordingly. That was true whether the prisoners were homosexuals, Roma, Slav, or just Aryans who didn't submit to the ruling party. All of them worked at gunpoint. All starved equally while the guards ate first. So yes, Auschwitz had some amenities, but it wasn't a 5-star hotel. Let's never make the mistake of that narrative. That's horse manure. If we're going to scream at the communists and Semites for lying about the camps, then it's our job not to lie to ourselves either. We have to tell the truth. They were prisons of a totalitarian Marxist state and they were awful. permalink parent award report block reply\nTheMostUselessFeeder 6 points 5 hours ago its weird how these people's entire realities hinge upon Orange Man being literally Hitler they can't function if they're not constantly screaming nazi references like, THIS IS TRUMPS REICHSTAG MOMENT OMG!!!!! (BUT FOR REAL THIS TIME, NOT LIKE THE OTHER 75 TIMES I SAID IT) permalink parent award report block reply AgnosticTemplar 6 points 3 hours ago I wish Trump were even half the nazi leftist pretend he is. permalink parent award report block reply\nAgnosticTemplar 6 points 3 hours ago I wish Trump were even half the nazi leftist pretend he is. permalink parent award report block reply\nRentedMule 17 points 7 hours ago Just curious; is there even a perimeter fence around the place?  Seems to me, if a few happen to escape into the Everglades before they're loaded onto the planes, that the problem would just take care of itself. permalink award report block reply KernalMustard 10 points 6 hours ago Gators climb chainlink fences. permalink parent award report block reply bratt 3 points 5 hours ago Gators climb chainlink fences I wish they did not think of that detail when building the cages inside the tents. permalink parent award report block reply Here_we_go 7 points 7 hours ago Yeah fenced in. Otherwise lefties would \"wonder\" in for pics. permalink parent award report block reply HKgoneWild 4 points 6 hours ago Why not send them to the gang prison in a certain now peaceful central American country? Let them get first hand photos from the inside and let them meet the \"human rights victims\" they preach about? permalink parent award report block reply\nKernalMustard 10 points 6 hours ago Gators climb chainlink fences. permalink parent award report block reply bratt 3 points 5 hours ago Gators climb chainlink fences I wish they did not think of that detail when building the cages inside the tents. permalink parent award report block reply\nbratt 3 points 5 hours ago Gators climb chainlink fences I wish they did not think of that detail when building the cages inside the tents. permalink parent award report block reply\nHere_we_go 7 points 7 hours ago Yeah fenced in. Otherwise lefties would \"wonder\" in for pics. permalink parent award report block reply HKgoneWild 4 points 6 hours ago Why not send them to the gang prison in a certain now peaceful central American country? Let them get first hand photos from the inside and let them meet the \"human rights victims\" they preach about? permalink parent award report block reply\nHKgoneWild 4 points 6 hours ago Why not send them to the gang prison in a certain now peaceful central American country? Let them get first hand photos from the inside and let them meet the \"human rights victims\" they preach about? permalink parent award report block reply\nMonsterouspoop 14 points 5 hours ago Theyre trying desperately to make it look some sort of holocaust. Its pathetic. permalink award report block reply\nMAGALADON9 12 points 7 hours ago I researched what escape might look like - and it's a hell.  It's not even gators, which there is literally millions of, it's the conditions the steamroom humidity (90%+)  but with scorching sun and curtains of a million flying biting stinging things flying in your mouth and nose; the water ripples with snakes there are 23 varieties of snake in that area; the natural environment is hazardous, you can get caught in old traps, or tangles of vegetation; the constant scraping and bug bites will lead to open sores and rapid infection. The mercury and other toxic water is an impossible sludge at the bottom and in spots will be thigh high soft mud that a normal man would be exhausted by in 100ft - but you have to go 39 miles to Miami. Impossible.  Maybe one of the most disturbing things is how the flora is laid out - it's a hellish labyrinth of nearly identical twists and bends, you'd look up from your shity makeshift raft only to be confused with the sun beaming through trees and reflecting off water. Heatstroke from the 110° heat index and dehydration will drain you quickly and a billion diseases and pathogens are all fighting to get inside you. A gator would be mercy. permalink award report block reply KernalMustard 13 points 6 hours ago They could have stayed home and avoided all that. Its a deterrent. Dont come. Dont go to AA. Easy permalink parent award report block reply MAGALADON9 6 points 6 hours ago I read my \"replies\" and scanned ... don't go to AA And was like: \"I know right, I went a few times but too culty I just stopped drinking I don't need AA, some do, that's cool - I just got into \"Darkside philosophy eg. Sith\" and just stopped.\" Then realized you were not talking about that AA. permalink parent award report block reply someguy7738 2 points 6 hours ago The biggest issue is there's basically no fresh water in the everglades. permalink parent award report block reply KernalMustard 5 points 6 hours ago Potable water. Yes you would be right permalink parent award report block reply\nKernalMustard 13 points 6 hours ago They could have stayed home and avoided all that. Its a deterrent. Dont come. Dont go to AA. Easy permalink parent award report block reply MAGALADON9 6 points 6 hours ago I read my \"replies\" and scanned ... don't go to AA And was like: \"I know right, I went a few times but too culty I just stopped drinking I don't need AA, some do, that's cool - I just got into \"Darkside philosophy eg. Sith\" and just stopped.\" Then realized you were not talking about that AA. permalink parent award report block reply\nMAGALADON9 6 points 6 hours ago I read my \"replies\" and scanned ... don't go to AA And was like: \"I know right, I went a few times but too culty I just stopped drinking I don't need AA, some do, that's cool - I just got into \"Darkside philosophy eg. Sith\" and just stopped.\" Then realized you were not talking about that AA. permalink parent award report block reply\nsomeguy7738 2 points 6 hours ago The biggest issue is there's basically no fresh water in the everglades. permalink parent award report block reply KernalMustard 5 points 6 hours ago Potable water. Yes you would be right permalink parent award report block reply\nKernalMustard 5 points 6 hours ago Potable water. Yes you would be right permalink parent award report block reply\nPatriotSkorzeny 10 points 7 hours ago How many flights have left? That’s 5 or 6 fights. So only 5 or 6 planes have departed the runway airstrip next to AA? permalink award report block reply\nHere_we_go 9 points 7 hours ago Should be 12,000,000 \"missing\" so far. Fucking bullshit numbers. 1200 Thats how many nyc were getting from texas by buses a day. permalink award report block reply\nMcFatty7 9 points 7 hours ago Do they really think forming a human \"SOS\" is somehow going to save them? lol permalink award report block reply they-see-me-trollin 10 points 6 hours ago except it's not an SOS.  It's more like a 2OS, or a 5o2.  apparently the letter S doesn't translate consistently in \"retarded illegal alien invader\". permalink parent award report block reply LostElf 5 points 6 hours ago No, but maybe SO5 will. permalink parent award report block reply MyNameIsTaxpayer 2 points 5 hours ago Trucking company hires are a no-show permalink parent award report block reply monkadelic 1 points 5 hours ago They know the left are useful idiots they can manipulate.  So why not give it a try.  I'm sure reddit is lapping it up. permalink parent award report block reply Haiper 1 points 1 hour ago It would, if Salvadorian Gilligan didn't keep screwing things up. permalink parent award report block reply\nthey-see-me-trollin 10 points 6 hours ago except it's not an SOS.  It's more like a 2OS, or a 5o2.  apparently the letter S doesn't translate consistently in \"retarded illegal alien invader\". permalink parent award report block reply\nLostElf 5 points 6 hours ago No, but maybe SO5 will. permalink parent award report block reply MyNameIsTaxpayer 2 points 5 hours ago Trucking company hires are a no-show permalink parent award report block reply\nMyNameIsTaxpayer 2 points 5 hours ago Trucking company hires are a no-show permalink parent award report block reply\nmonkadelic 1 points 5 hours ago They know the left are useful idiots they can manipulate.  So why not give it a try.  I'm sure reddit is lapping it up. permalink parent award report block reply\nHaiper 1 points 1 hour ago It would, if Salvadorian Gilligan didn't keep screwing things up. permalink parent award report block reply\nLostElf 5 points 6 hours ago Did they think it was a permanent home for illegals? Oh, sorry, I used the word think in reference to redditardia. permalink award report block reply\nJoeBidensDementia1 4 points 7 hours ago This is a fake photo. They don't know how to spell. permalink award report block reply DefinitelyNotFed 4 points 6 hours ago Them not knowing how to spell makes it realer. permalink parent award report block reply\nDefinitelyNotFed 4 points 6 hours ago Them not knowing how to spell makes it realer. permalink parent award report block reply\nMyNameIsTaxpayer 4 points 5 hours ago 5o2 what kind of engineers are these? permalink award report block reply\nMega_MAGA 4 points 6 hours ago Alligators gotta eat permalink award report block reply\nSDsc0rch 3 points 5 hours ago \"SOS\" but one S is backwards retards permalink award report block reply kjj9 1 points 5 hours ago I read it as 205.  No idea what 205 means. permalink parent award report block reply ianpatrick1966 1 points 5 hours ago Probably an area code gangs tend to use those for their names theee days permalink parent award report block reply\nkjj9 1 points 5 hours ago I read it as 205.  No idea what 205 means. permalink parent award report block reply ianpatrick1966 1 points 5 hours ago Probably an area code gangs tend to use those for their names theee days permalink parent award report block reply\nianpatrick1966 1 points 5 hours ago Probably an area code gangs tend to use those for their names theee days permalink parent award report block reply\ndaveyistheman 3 points 7 hours ago They fed them to the alligators permalink award report block reply\nSpinedoc 3 points 6 hours ago South Florida here. I was wondering why all the gators looked fat and happy lately. They were feasting on Mexican food. permalink award report block reply\ndonteatthat 3 points 6 hours ago Ok so this retard was inside the walls taking attendance? Yeah fucking right permalink award report block reply\nnoPTSDforMePlease 2 points 2 hours ago You can't hate the media enough. They're implying that they were killed like in a concentration camp to rally more hatred against Trump. permalink award report block reply SRK_Tiberious 1 points 2 hours ago And just wait 'til you find out... permalink parent award report block reply\nSRK_Tiberious 1 points 2 hours ago And just wait 'til you find out... permalink parent award report block reply\ncatsfive OP 2 points 7 hours ago https://x.com/reddit_lies/status/1988412938118393919 permalink award report block reply\nFrociaggine 2 points 7 hours ago Gators well feed permalink award report block reply\nLive_free_or_die_55 2 points 7 hours ago Deport them all Now!!! permalink award report block reply\nR3tro 2 points 6 hours ago Either that, or some fat alligators out there… permalink award report block reply\ntrumpdagoat 2 points 1 hour ago Exactly, OP. And this is a problem why? permalink award report block reply\nLiberats 2 points 6 hours ago Gators are sleeping it off. permalink award report block reply\nElevenMile 2 points 4 hours ago Not sure what \"205\" is supposed to be ;) permalink award report block reply\nI_Love_45-70_Gov 2 points 5 hours ago 30 million people just appeared in the U.S., faggot. permalink award report block reply\nJetJocky 2 points 5 hours ago I bet that $1000 and free flight home looks pretty good to the Alligator Alcatraz detainees right about now. Too late, you had your chance. permalink award report block reply\nmagamagashii 2 points 5 hours ago If they are lying about 1200 people being murdered last week, which this number will probably increase to 1 million by the end of Trump's term, then three million years later, then six million years after that....well, if they are lying about that you've got to wonder what else they have lied about. Pretty soon it will probably be illegal to even say they were deported. permalink award report block reply\nConsrvspkgNJ 2 points 2 hours ago I guess the alligators got THEIR SNAP benefits........ permalink award report block reply\nMkultraUSA 2 points 4 hours ago What if we didn't bother to observe it? Kek.... You lose magnetism. permalink award report block reply\nRobinNet 2 points 4 hours ago All the gators seem well-fed as well... permalink award report block reply taytaytay 1 points 3 hours ago I'm hoping they were fed to gators. I'll settle for deportation. I'm a reasonable man. permalink parent award report block reply\ntaytaytay 1 points 3 hours ago I'm hoping they were fed to gators. I'll settle for deportation. I'm a reasonable man. permalink parent award report block reply\nRustySheckelford 2 points 5 hours ago Democrats pretending to be retarded is so unbelievably embarrassing.... Can't believe I share a citizenship with these clowns. permalink award report block reply\nRiehlpissed 2 points 3 hours ago SOS? “Ship Out Soon,”  I guess. permalink award report block reply\n2Clutch 2 points 3 hours ago 205? permalink award report block reply\nMy2SonsAreMarines 2 points 3 hours ago Hungry, hungry, alligators! permalink award report block reply\njsphere256 2 points 5 hours ago The disappearance mysteriously coincided with the grand opening of a new Chipotle location across the street permalink award report block reply\nRememberCharlieKirk 1 points 2 hours ago Deportation is the compromise. permalink award report block reply\nHunterBidensPC 1 points 3 hours ago Shut it down. Much better to just shoot illegals and save on food and travel. Will certainly ramp up self deportations too permalink award report block reply\nElevenMile 1 points 4 hours ago 4,600 \"upvotes\" on that, eh? permalink award report block reply\nQSWO1 1 points 2 hours ago Should be that × ten per day. permalink award report block reply\nReturnOfSmarm 1 points 4 hours ago It's a shame .... from the looks of that picture they were just getting the whole marching band thing honed. permalink award report block reply\nFury_of_Descent 1 points 5 hours ago Hey Leftards, while Beyond Meat might be on its way out, have you tried Soylento Verde? It's got a kick of spicy goodness and comes in a variety of ethnicities! Try our new flavors: MuHAMmed Madness, Street Shitter Surprise and the Ol' Tyme favorite of Day Laborer Delite! All the aroma and flavor of a blown out Home Depot Toilet!! permalink award report block reply\nPearlyGaits57 1 points 6 hours ago Gator food. Haachiwowwa! permalink award report block reply\nInduceddrag 1 points 6 hours ago One of the great things about this facility is it has a runway on the same location . permalink award report block reply\nTGNX 1 points 6 hours ago Seriously? permalink award report block reply\nDRK00 1 points 4 hours ago Start replying to those threads with photos of fat alligators permalink award report block reply\ngeekesmind 1 points 6 hours ago Only 1200? Fuck we need bigger numbers permalink award report block reply\nEddie_Vanjovi 1 points 5 hours ago \"1500 people just gone and replaced at your nearest hospital. Where do these people disappear to? The dangers of hospital visits at 5.\" The Left are outrageous... Lol permalink award report block reply\nredditadminssuckit 1 points 5 hours ago SOYLENT BEANer permalink award report block reply\nBax101 1 points 4 hours ago Same retards who forgot about those caravans of people coming into the country under Obiden. permalink award report block reply\nmass55th 1 points 44 minutes ago \"I_May_Have_Weed\" You may have a brain too, but you don't. permalink award report block reply\nJustTheNews 1 points 7 hours ago Just........ shoot em..... why do we treat invaders any different from the rest of the world and history.  Tell them to go home,  if caught again shoot em. permalink award report block reply SimaYi 4 points 6 hours ago Damn, not even the Nazis did that. permalink parent award report block reply\nSimaYi 4 points 6 hours ago Damn, not even the Nazis did that. permalink parent award report block reply\nHeavenlyTrumpets 1 points 4 hours ago diSaPpeArEd permalink award report block reply\nSkabliggum2 1 points 5 hours ago In an unrelated story, the Alligator population is thriving and healthier than ever! permalink award report block reply\n0care 1 points 3 hours ago lol it is funnier this way, need to troll with the fat alligator pics permalink award report block reply\nAfrikaanerBoer 1 points 5 hours ago H1Bs and all those fucken towel head pajeeets who voted for MAMDANI should be next to be rounded up and exterminated 💯 street shitters are the demoKKKrat plantation’s new slaves: more devious and cunning than the negroes (whom they’re tired of for being perennial lazy dumbass leeches the past 160+ years) permalink award report block reply\nDEPORT50M 1 points 4 hours ago Oh no! So you're saying we can track these people?? permalink award report block reply\nblue5707 1 points 4 hours ago sos...lmao permalink award report block reply\nKewMan 1 points 4 hours ago Like I care whether they are deported or fed alligators... No return trips from alligator feeding tho. permalink award report block reply\nKrat 1 points 3 hours ago What I am seeing is a lot of empty spots and over 150 million opportunities permalink award report block reply\nBarneyFrank 1 points 7 hours ago They don’t even have enough people left to spell “gay”! permalink award report block reply\n19American62Woman 1 points 7 hours ago I don’t care permalink award report block reply\nDontTreadOnLego 1 points 4 hours ago The alligators were hungry....... for deportation permalink award report block reply\nRock9Head 1 points 3 hours ago This time, it wasn’t Dahmer. permalink award report block reply\nSeruna_Kanus 1 points 5 hours ago Wait, why do they have basketball courts? permalink award report block reply\nCharlieMike 1 points 7 hours ago Only 2/3?  I’m disappointed. permalink award report block reply\nLawyersPlayDota 1 points 7 hours ago Communists only understand \"disappearing\" people, that's why. permalink award report block reply\nMAGALADON9 1 points 5 hours ago The Grammar Nazi in me looks at this picture and slams my fist on the table and says. Nein! Alle kommen in den Ofen!\" permalink award report block reply\nJBlaze056 1 points 3 hours ago That's the point permalink award report block reply\nGoozmania 0 points 7 hours ago Didn't it mostly get shut down by a rogue judge? permalink award report block reply\nUSNVET71 -2 points 3 hours ago Yeah gone to where they fucking came from , you dumb faggot permalink award report block reply\nrapskull 1 points 7 hours ago Comment removed by community moderators. permalink award report block reply\ncordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink award report block reply"
}