{
  "id": "1ARK9hiHPs",
  "url": "https://patriots.win/p/1ARK9hiHPs/obamacare-was-always-a-scam-/c",
  "content": "364 Obamacare was always a scam. posted 2 days ago by rdvs34283 10 comments award share report block One Bad Dude @OneBadDude_ • 3d Obamacare was always a scam. They lied to you so they could steal more of your money and further control you. Seems par for the course.\n10 comments Sort by Top Top New Worst Old Save SBOJ_JOBS 8 points 2 days ago Obamacare was a simple DNC Ponzi scheme for stealing billions from taxpayers to buy votes. Nothing else about it was \"real\". permalink award report block reply NotYourMan 7 points 2 days ago The  goal of ACA was always to steal from the middle class and give to the rich.  Its important to note that the stock price for health insurance companies went up more than 1200% after ACA.  Now some of this is democrat inflation but a lot of it is the reality that ACA is socialism.  What politicians in the house owned the stock for health insurance companies before ACA was signed into law and how much did they make on the stock? permalink award report block reply Counterwhat 7 points 2 days ago Now they are seeing this. Now? We were telling you this back in 2012! permalink award report block reply LiteraIIyHitIer 1 points 2 days ago But it was just a conspiracy theory back  then. The TV told me so. permalink parent award report block reply Stormeyworld13 6 points 2 days ago Obama was always a scam. permalink award report block reply billybaldwin2 5 points 2 days ago I always assumed Obamacare was just to sell insurance and get the referral fees. permalink award report block reply ArnoldF 2 points 2 days ago It was the first step. It was designed to fail and lead to single payer insurance, wherein the Demonic Party controls every aspect of health care including who gets it and who doesn't. permalink award report block reply rebuildingMyself 2 points 2 days ago Feminists and minorities were drooling at Obamacare and they all pushed to have as much gibs shoved into it as possible, especially after the victory of forcing men to subsidize women's more expensive health care via no gender discrimination in premiums. Even abortions were up for debate ffs permalink award report block reply boomerbutnotOKBoomer 1 points 2 days ago This is why I always have paid cash and taken the absolute least medicare plan I can find permalink award report block reply RedPillosopher1776 1 points 2 days ago It was a way to make White people have to pay for yet another gibs program for the nons, the ultimate goal was to destroy our healthcare system and force us into a socialist medical system. permalink award report block reply\nSBOJ_JOBS 8 points 2 days ago Obamacare was a simple DNC Ponzi scheme for stealing billions from taxpayers to buy votes. Nothing else about it was \"real\". permalink award report block reply\nNotYourMan 7 points 2 days ago The  goal of ACA was always to steal from the middle class and give to the rich.  Its important to note that the stock price for health insurance companies went up more than 1200% after ACA.  Now some of this is democrat inflation but a lot of it is the reality that ACA is socialism.  What politicians in the house owned the stock for health insurance companies before ACA was signed into law and how much did they make on the stock? permalink award report block reply\nCounterwhat 7 points 2 days ago Now they are seeing this. Now? We were telling you this back in 2012! permalink award report block reply LiteraIIyHitIer 1 points 2 days ago But it was just a conspiracy theory back  then. The TV told me so. permalink parent award report block reply\nLiteraIIyHitIer 1 points 2 days ago But it was just a conspiracy theory back  then. The TV told me so. permalink parent award report block reply\nStormeyworld13 6 points 2 days ago Obama was always a scam. permalink award report block reply\nbillybaldwin2 5 points 2 days ago I always assumed Obamacare was just to sell insurance and get the referral fees. permalink award report block reply\nArnoldF 2 points 2 days ago It was the first step. It was designed to fail and lead to single payer insurance, wherein the Demonic Party controls every aspect of health care including who gets it and who doesn't. permalink award report block reply\nrebuildingMyself 2 points 2 days ago Feminists and minorities were drooling at Obamacare and they all pushed to have as much gibs shoved into it as possible, especially after the victory of forcing men to subsidize women's more expensive health care via no gender discrimination in premiums. Even abortions were up for debate ffs permalink award report block reply\nboomerbutnotOKBoomer 1 points 2 days ago This is why I always have paid cash and taken the absolute least medicare plan I can find permalink award report block reply\nRedPillosopher1776 1 points 2 days ago It was a way to make White people have to pay for yet another gibs program for the nons, the ultimate goal was to destroy our healthcare system and force us into a socialist medical system. permalink award report block reply",
  "fetched_at": "2025-11-12T23:01:22.036654Z"
}