{
  "id": "8184827",
  "title": "455Poland Set to Become a Superpower in Europe:\n\n\"The 40 million in Poland will unite with 20-30 mil",
  "url": "https://patriots.win/p/1ARK9mHVah/poland-set-to-become-a-superpowe/c",
  "content": "500 Poland Set to Become a Superpower in Europe:\n\"The 40 million in Poland will unite with 20-30 million of what is left of Ukraine.\" posted 13 hours ago by StopCorruptionDC 16 comments award share report block Based Hungary 🇭🇺 @HungaryBased • 1d 🚨BREAKING: Poland Set to Become a Superpower in Europe: \"The 40 million in Poland will unite with 20-30 million of what is left of Ukraine.\" -Prime Minister of Hungary, Orbán Viktor 🇭🇺🇵🇱\n16 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style phibetared 16 points 12 hours ago The poles will unite with the ukrainians? hahhaha. Tell the Poles. Their rents have doubled since the Ukrainian invasion happened. Crime is up, too.  The criminals in Ukraine operate in Poland now. permalink award report block reply papagiorgio-g 5 points 10 hours ago Galicia used to be part of Poland. permalink parent award report block reply RolandDelacroix 5 points 8 hours ago The whole eastern bloc was once part of Poland/Lithuania. permalink parent award report block reply Standingoak 2 points 7 hours ago Well , the Austro/Hungarian Empire.... time to stop fighting ? permalink parent award report block reply Standingoak 1 points 7 hours ago And when did Poland last invade what is now Ukraine but was Russia ? permalink parent award report block reply iamherefortheluls 5 points 8 hours ago That's about as popular there as if Trump just informed US that they are 'uniting' with what's left of Canada after all the most productive provinces like Alberta seceded. Poland uniting with Lvov where the population's entire cultural identity is their seething hatred of Russia, while at the same time becoming Russia's direct neighbor. I am sure that will turn out great for Poland. permalink parent award report block reply DarthVerminates 1 points 4 hours ago Some parts of Ukraine are Polish. They definitely want those parts. I called out a couple rah rah pro war polish people over it (re: you support the war as a means of occupying these parts of Ukraine you want...)... and Polish people being delightful and honest... said yeah; but it's a good thing... and I agreed with them... Ukraine sucks... better off being a Polish protectorate. permalink parent award report block reply SteveRogers42 8 points 10 hours ago That combination was the largest, most powerful empire in Europe for a couple hundred years. permalink award report block reply RolandDelacroix 5 points 8 hours ago Ukranian farmers plus Polish warriors, all having lots of kids with pale big titty slav women, all for God, was a winning combo. permalink parent award report block reply OrangeManBadasss 7 points 12 hours ago Why doesn't Hungary unite with them? permalink award report block reply Greenhills 2 points 10 hours ago Is this for real? permalink award report block reply BejewelledBadger 1 points 7 hours ago Complete nonsense. Ukraine considers Bandera their national hero, while Poland considers him a war criminal. There can be no union. https://en.wikipedia.org/wiki/Massacres_of_Poles_in_Volhynia_and_Eastern_Galicia permalink award report block reply RolandDelacroix 1 points 8 hours ago They're gonna have a tough time defending borders with all their men killed. permalink award report block reply XpatDemocrat 1 points 7 hours ago I guess thats one way to get NATO protection permalink award report block reply ThorsonTT 1 points 6 hours ago Just form an alliance with Lithuania while they're at it.  The return of the Kingdom of Poland and the Grand Duchy of Lithuania! permalink award report block reply Wrez77 1 points 8 hours ago insert dumb Polack joke permalink award report block reply\nphibetared 16 points 12 hours ago The poles will unite with the ukrainians? hahhaha. Tell the Poles. Their rents have doubled since the Ukrainian invasion happened. Crime is up, too.  The criminals in Ukraine operate in Poland now. permalink award report block reply papagiorgio-g 5 points 10 hours ago Galicia used to be part of Poland. permalink parent award report block reply RolandDelacroix 5 points 8 hours ago The whole eastern bloc was once part of Poland/Lithuania. permalink parent award report block reply Standingoak 2 points 7 hours ago Well , the Austro/Hungarian Empire.... time to stop fighting ? permalink parent award report block reply Standingoak 1 points 7 hours ago And when did Poland last invade what is now Ukraine but was Russia ? permalink parent award report block reply iamherefortheluls 5 points 8 hours ago That's about as popular there as if Trump just informed US that they are 'uniting' with what's left of Canada after all the most productive provinces like Alberta seceded. Poland uniting with Lvov where the population's entire cultural identity is their seething hatred of Russia, while at the same time becoming Russia's direct neighbor. I am sure that will turn out great for Poland. permalink parent award report block reply DarthVerminates 1 points 4 hours ago Some parts of Ukraine are Polish. They definitely want those parts. I called out a couple rah rah pro war polish people over it (re: you support the war as a means of occupying these parts of Ukraine you want...)... and Polish people being delightful and honest... said yeah; but it's a good thing... and I agreed with them... Ukraine sucks... better off being a Polish protectorate. permalink parent award report block reply\npapagiorgio-g 5 points 10 hours ago Galicia used to be part of Poland. permalink parent award report block reply RolandDelacroix 5 points 8 hours ago The whole eastern bloc was once part of Poland/Lithuania. permalink parent award report block reply Standingoak 2 points 7 hours ago Well , the Austro/Hungarian Empire.... time to stop fighting ? permalink parent award report block reply Standingoak 1 points 7 hours ago And when did Poland last invade what is now Ukraine but was Russia ? permalink parent award report block reply\nRolandDelacroix 5 points 8 hours ago The whole eastern bloc was once part of Poland/Lithuania. permalink parent award report block reply Standingoak 2 points 7 hours ago Well , the Austro/Hungarian Empire.... time to stop fighting ? permalink parent award report block reply\nStandingoak 2 points 7 hours ago Well , the Austro/Hungarian Empire.... time to stop fighting ? permalink parent award report block reply\nStandingoak 1 points 7 hours ago And when did Poland last invade what is now Ukraine but was Russia ? permalink parent award report block reply\niamherefortheluls 5 points 8 hours ago That's about as popular there as if Trump just informed US that they are 'uniting' with what's left of Canada after all the most productive provinces like Alberta seceded. Poland uniting with Lvov where the population's entire cultural identity is their seething hatred of Russia, while at the same time becoming Russia's direct neighbor. I am sure that will turn out great for Poland. permalink parent award report block reply\nDarthVerminates 1 points 4 hours ago Some parts of Ukraine are Polish. They definitely want those parts. I called out a couple rah rah pro war polish people over it (re: you support the war as a means of occupying these parts of Ukraine you want...)... and Polish people being delightful and honest... said yeah; but it's a good thing... and I agreed with them... Ukraine sucks... better off being a Polish protectorate. permalink parent award report block reply\nSteveRogers42 8 points 10 hours ago That combination was the largest, most powerful empire in Europe for a couple hundred years. permalink award report block reply RolandDelacroix 5 points 8 hours ago Ukranian farmers plus Polish warriors, all having lots of kids with pale big titty slav women, all for God, was a winning combo. permalink parent award report block reply\nRolandDelacroix 5 points 8 hours ago Ukranian farmers plus Polish warriors, all having lots of kids with pale big titty slav women, all for God, was a winning combo. permalink parent award report block reply\nOrangeManBadasss 7 points 12 hours ago Why doesn't Hungary unite with them? permalink award report block reply\nGreenhills 2 points 10 hours ago Is this for real? permalink award report block reply\nBejewelledBadger 1 points 7 hours ago Complete nonsense. Ukraine considers Bandera their national hero, while Poland considers him a war criminal. There can be no union. https://en.wikipedia.org/wiki/Massacres_of_Poles_in_Volhynia_and_Eastern_Galicia permalink award report block reply\nRolandDelacroix 1 points 8 hours ago They're gonna have a tough time defending borders with all their men killed. permalink award report block reply\nXpatDemocrat 1 points 7 hours ago I guess thats one way to get NATO protection permalink award report block reply\nThorsonTT 1 points 6 hours ago Just form an alliance with Lithuania while they're at it.  The return of the Kingdom of Poland and the Grand Duchy of Lithuania! permalink award report block reply\nWrez77 1 points 8 hours ago insert dumb Polack joke permalink award report block reply",
  "fetched_at": "2025-11-12T23:42:58.675914Z"
}