{
  "id": "1ARK9iqxFh",
  "url": "https://patriots.win/p/1ARK9iqxFh/its-always-the-ones-you-least-ex/c",
  "content": "469 It's always the ones you least expect DEPORT posted 2 days ago by Hangemh1gh 37 comments award share download report block\n37 comments Sort by Top Top New Worst Old Save TiggerLovingPooh 23 points 2 days ago Not sure why you'd think that guy is a criminal, what are ya, racist or sumthin'? permalink award report block reply Doomsday545 10 points 2 days ago I think that guy might be my doctor! permalink parent award report block reply FuckU/Spez 8 points 2 days ago I think ICE got him right in the middle of his 6666 Ranch tattoo and now defaming him... poor scholar. permalink parent award report block reply stevethefish76 4 points 2 days ago He looks like such a nice guy. Especially with the 666 tattooed on his face like that. permalink parent award report block reply midgetpornrocks 3 points 2 days ago 666 makes more sense. I thought he represented the better business bureau. :( permalink parent award report block reply CyanScales 3 points 2 days ago You cant seriously say you can tell by his face!\nAre you even listening to yourself? ;-) permalink parent award report block reply Taylor3006 16 points 2 days ago Oh I find that hard to believe. What a sweet looking young man, am sure this is all a mistake....................... God I hate this fucking timeline. permalink award report block reply p8riot91 15 points 2 days ago He literally has 18 for 18th Street Gang tattooed on his fucking face. Along with 666...... permalink award report block reply TrumpAndGodWin 4 points 2 days ago Suspicious location for the eighteen, had to suck that many to get into the gang... permalink parent award report block reply Comntrinchief 3 points 2 days ago What’s your point? /s permalink parent award report block reply AfterGlow 11 points 2 days ago How were they able to pick him out of the lineup? permalink award report block reply impera 8 points 2 days ago Haha, are the leftist media hacks trying to blur out his face while pretending he has no gang affiliations like they did with the MS-13 tats on  the hands of their favorite Maryland man, Kilmar Abrego Garcia? ICE are devastating our communities and friends and families! Needless to say, you need better friends if this cockroach is one of them. permalink award report block reply HumblePepe 7 points 2 days ago How could we have known permalink award report block reply Toddyoungsvagina 4 points 2 days ago I heard he just signed up for community college permalink award report block reply Hangemh1gh OP 4 points 2 days ago https://x.com/DHSgov/status/1987942976220250367?s=20 permalink award report block reply jiujiujiu 3 points 2 days ago I mean it’s written on his stupid face permalink award report block reply Comntrinchief 3 points 2 days ago Best camouflage yet permalink award report block reply HumphreyPlowjogger 3 points 2 days ago A face only his mother could…..uh, not even his mother could love his face. permalink award report block reply tuaris 4 points 2 days ago He probably killed his mother permalink parent award report block reply Gunmolester 3 points 2 days ago General Crime and murder is their CULTURE you BIGOT!!! permalink award report block reply MemoryHoleyeO 3 points 2 days ago They have to tattoo around their mouths to let other gang members know they will suck their dick for free permalink award report block reply Pickinpox 1 points 2 days ago You should see what that puke will do for a honey bun permalink parent award report block reply brewser724 3 points 2 days ago He hasn't done anything super bad here....yet permalink award report block reply ColonelKlink 3 points 2 days ago I wonder what tipped them off. permalink award report block reply 2FBIAgents1Cup 2 points 23 hours ago Has anybody told him yet that he has shit all over his face? permalink award report block reply indigo_truther 2 points 2 days ago Always the ones you least suspect permalink award report block reply SimaYi 2 points 2 days ago Deport them all. They are all criminals, here illegally and they need to GO HOME. Access to White people is not a human right. permalink award report block reply Pickinpox 2 points 2 days ago What a fucking douchebag permalink award report block reply Delroy 2 points 2 days ago The TV news version:  Show some B roll of police cars with their lights on, overlay a baby picture of this guy with a voiceover about how he was not convicted of a crime. Cut to Nanci Pelosi or equivilent calling Trump a fascist, cut to a commercial for ozepic. Its so formulaic. permalink award report block reply worldowedexplanation 2 points 2 days ago Would love to hear one of these dumb liberal cunts explain why they want this guy here…. permalink award report block reply Pickinpox 2 points 2 days ago so someone will fuck them would be my guess permalink parent award report block reply SpellingContable 2 points 2 days ago To fight against face tattoo bigots. Obviously. permalink parent award report block reply 2025WhatIsTrue 2 points 2 days ago He's a nice boy...he's studying to be a astrophysicist. permalink award report block reply tuaris 2 points 2 days ago Looks like a productive member of society. permalink award report block reply Roadpower 1 points 2 days ago I think we should thank him. Even our dim bulb egalitards should be able to see that one coming. permalink award report block reply\nTiggerLovingPooh 23 points 2 days ago Not sure why you'd think that guy is a criminal, what are ya, racist or sumthin'? permalink award report block reply Doomsday545 10 points 2 days ago I think that guy might be my doctor! permalink parent award report block reply FuckU/Spez 8 points 2 days ago I think ICE got him right in the middle of his 6666 Ranch tattoo and now defaming him... poor scholar. permalink parent award report block reply stevethefish76 4 points 2 days ago He looks like such a nice guy. Especially with the 666 tattooed on his face like that. permalink parent award report block reply midgetpornrocks 3 points 2 days ago 666 makes more sense. I thought he represented the better business bureau. :( permalink parent award report block reply CyanScales 3 points 2 days ago You cant seriously say you can tell by his face!\nAre you even listening to yourself? ;-) permalink parent award report block reply\nDoomsday545 10 points 2 days ago I think that guy might be my doctor! permalink parent award report block reply\nFuckU/Spez 8 points 2 days ago I think ICE got him right in the middle of his 6666 Ranch tattoo and now defaming him... poor scholar. permalink parent award report block reply\nstevethefish76 4 points 2 days ago He looks like such a nice guy. Especially with the 666 tattooed on his face like that. permalink parent award report block reply midgetpornrocks 3 points 2 days ago 666 makes more sense. I thought he represented the better business bureau. :( permalink parent award report block reply\nmidgetpornrocks 3 points 2 days ago 666 makes more sense. I thought he represented the better business bureau. :( permalink parent award report block reply\nCyanScales 3 points 2 days ago You cant seriously say you can tell by his face!\nAre you even listening to yourself? ;-) permalink parent award report block reply\nTaylor3006 16 points 2 days ago Oh I find that hard to believe. What a sweet looking young man, am sure this is all a mistake....................... God I hate this fucking timeline. permalink award report block reply\np8riot91 15 points 2 days ago He literally has 18 for 18th Street Gang tattooed on his fucking face. Along with 666...... permalink award report block reply TrumpAndGodWin 4 points 2 days ago Suspicious location for the eighteen, had to suck that many to get into the gang... permalink parent award report block reply Comntrinchief 3 points 2 days ago What’s your point? /s permalink parent award report block reply\nTrumpAndGodWin 4 points 2 days ago Suspicious location for the eighteen, had to suck that many to get into the gang... permalink parent award report block reply\nComntrinchief 3 points 2 days ago What’s your point? /s permalink parent award report block reply\nAfterGlow 11 points 2 days ago How were they able to pick him out of the lineup? permalink award report block reply\nimpera 8 points 2 days ago Haha, are the leftist media hacks trying to blur out his face while pretending he has no gang affiliations like they did with the MS-13 tats on  the hands of their favorite Maryland man, Kilmar Abrego Garcia? ICE are devastating our communities and friends and families! Needless to say, you need better friends if this cockroach is one of them. permalink award report block reply\nHumblePepe 7 points 2 days ago How could we have known permalink award report block reply\nToddyoungsvagina 4 points 2 days ago I heard he just signed up for community college permalink award report block reply\nHangemh1gh OP 4 points 2 days ago https://x.com/DHSgov/status/1987942976220250367?s=20 permalink award report block reply\njiujiujiu 3 points 2 days ago I mean it’s written on his stupid face permalink award report block reply\nComntrinchief 3 points 2 days ago Best camouflage yet permalink award report block reply\nHumphreyPlowjogger 3 points 2 days ago A face only his mother could…..uh, not even his mother could love his face. permalink award report block reply tuaris 4 points 2 days ago He probably killed his mother permalink parent award report block reply\ntuaris 4 points 2 days ago He probably killed his mother permalink parent award report block reply\nGunmolester 3 points 2 days ago General Crime and murder is their CULTURE you BIGOT!!! permalink award report block reply\nMemoryHoleyeO 3 points 2 days ago They have to tattoo around their mouths to let other gang members know they will suck their dick for free permalink award report block reply Pickinpox 1 points 2 days ago You should see what that puke will do for a honey bun permalink parent award report block reply\nPickinpox 1 points 2 days ago You should see what that puke will do for a honey bun permalink parent award report block reply\nbrewser724 3 points 2 days ago He hasn't done anything super bad here....yet permalink award report block reply\nColonelKlink 3 points 2 days ago I wonder what tipped them off. permalink award report block reply\n2FBIAgents1Cup 2 points 23 hours ago Has anybody told him yet that he has shit all over his face? permalink award report block reply\nindigo_truther 2 points 2 days ago Always the ones you least suspect permalink award report block reply\nSimaYi 2 points 2 days ago Deport them all. They are all criminals, here illegally and they need to GO HOME. Access to White people is not a human right. permalink award report block reply\nPickinpox 2 points 2 days ago What a fucking douchebag permalink award report block reply\nDelroy 2 points 2 days ago The TV news version:  Show some B roll of police cars with their lights on, overlay a baby picture of this guy with a voiceover about how he was not convicted of a crime. Cut to Nanci Pelosi or equivilent calling Trump a fascist, cut to a commercial for ozepic. Its so formulaic. permalink award report block reply\nworldowedexplanation 2 points 2 days ago Would love to hear one of these dumb liberal cunts explain why they want this guy here…. permalink award report block reply Pickinpox 2 points 2 days ago so someone will fuck them would be my guess permalink parent award report block reply SpellingContable 2 points 2 days ago To fight against face tattoo bigots. Obviously. permalink parent award report block reply\nPickinpox 2 points 2 days ago so someone will fuck them would be my guess permalink parent award report block reply\nSpellingContable 2 points 2 days ago To fight against face tattoo bigots. Obviously. permalink parent award report block reply\n2025WhatIsTrue 2 points 2 days ago He's a nice boy...he's studying to be a astrophysicist. permalink award report block reply\ntuaris 2 points 2 days ago Looks like a productive member of society. permalink award report block reply\nRoadpower 1 points 2 days ago I think we should thank him. Even our dim bulb egalitards should be able to see that one coming. permalink award report block reply",
  "fetched_at": "2025-11-12T20:41:17.928776Z"
}