{
  "id": "8184849",
  "title": "821It's definitely not organicposted8 hours agobyZennbrown150 commentsawardsharereportblock",
  "url": "https://patriots.win/p/1ARK9mHViz/its-definitely-not-organic-/c",
  "content": "823 It's definitely not organic posted 8 hours ago by Zennbrown 150 comments award share report block Pro America Politics @Pro__Trading • 24h Rich Baris, Robert Barnes, and Mark Mitchell did a complete U-turn at the exact same time, pushing the exact same talking points, using the exact same scripted phrases. I'm sure it's totally organic.\n150 comments Sort by Top Top New Worst Old Save Elon Musk Confirms Sad News Today Read More Ads by Ad.Style ReleasetheList 167 points 7 hours ago They only started criticizing Trump when he started proposing policies that are antithetical to America First. 600k Chinese students? How is that AF? Saying we need more H1B's? How is that AF? 50 year mortages and 15 year car loans? Spending the entire first year of his presidency making peace deals with 3rd world shitholes, while nobel, doesn't really help Americans. They are trying to get him to course correct before it's too late. permalink award report block reply AnonymousFrog 58 points 7 hours ago Some people are trying to turn MAGA into a cult of personality. permalink parent award report block reply Cali_kid 9 points 6 hours ago We need more voters MAGA is not enough to win elections. Trump is trying to pander to Boomers. We needed to vote this last election and we sat at home complaining about Football. permalink parent award report block reply TGNX 19 points 6 hours ago People did vote. In deep blue states with intricate cheating apparati in place. Without the cheating, Mamdani wouldn't have won, the NJ deep blue governor wouldn't have won. Could more have shown up? Sure, but I'm betting whoever is MAGA was standing in line before the polls opened. permalink parent award report block reply HumblePepe 14 points 5 hours ago Man, I wish someone, like a Pam Bondi, could have made headway to stop election fraud before the elections. permalink parent award report block reply view 1 more comments... finnigan 9 points 6 hours ago I think the jihadist had enough student and moslem support to win fair and square but I agree that the NJ shit show was fixed. permalink parent award report block reply view 1 more comments... Repentnow 7 points 4 hours ago Without the cheating, Mamdani wouldn't have won NYC voted overwhelmingly against Trump in the last three elections: 2016 Trump: 17.04% 2020 Trump: 22.70% 2024 Trump: 30.01% 38% of NYC is foreign-born. NYC is deep blue. They didn't need to cheat. permalink parent award report block reply view 2 more comments... KekistaniMemeLord 5 points 3 hours ago of course they cheated but demographic replacement played a big role in both of those losses. They have the benefit of both mechanisms now in places like NY. permalink parent award report block reply breadbaker 3 points 4 hours ago Without the cheating, Mamdani wouldn't have won, Estimate is 1 in 7 voters in NYC is a muslim. He had the backing of AOC and huge swaths of the Bronx, Queens, Brooklyn, Harlem elected leaders. Mamdani was endorsed by Brad Lander the highest elected Jewish official. Cuomo had scandals involving female employees hanging over him and resignation from the governor's seat. He screwed up NY state's covid response and is accused of leading to death of many elderly. Mamdani won fair and square and in part to insane accusations.  The guy looks more legit today than if everybody had just shut-up and told Sliwa to drop out. permalink parent award report block reply view 1 more comments... load 1 more comments... ActNow 1 points 3 hours ago These latest ideas of Trump's stink, but how is this \"pandering to Boomers\"? permalink parent award report block reply Klaus73 2 points 2 hours ago arguably 50 year mortgages allow Boomers to sell their properties at greatly inflated prices while shackling the young into life long debt slavery. permalink parent award report block reply Standingoak 1 points 2 hours ago Nice , you recognized the motivation factor for the important election.  As an aside Trump wants ALL the generations smart enough to recognize the true enemy.  They stopped producing pennies today. permalink parent award report block reply cordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply Klaus73 2 points 2 hours ago Its been there for months...I called it back in March when folks started telling folks to be silent about Epstien. permalink parent award report block reply starjello 2 points 3 hours ago They've been doing that since Trump assumed office back in 2016. It is eerily cult like around here. It's  ironic how things have reversed. Too many here are like the modern day left and can't handle things. You tell them Trump lied and Q retards died would not be far from the truth permalink parent award report block reply EyesSewnShut 2 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply JustHereForTheSalmon 16 points 6 hours ago There's a reason why the deep state stopped trying to kill him and you're seeing the results. permalink parent award report block reply Klaus73 3 points 2 hours ago Still convinced that Pam was a insurance policy to ensure he would never go after anyone of consequence. permalink parent award report block reply Bouldabassed 8 points 6 hours ago Glad this is the top comment. Maybe there is some home for this site. Barnes, Baris, and Mark are consistently pushing in the correct direction. Can anyone honestly say the same about Trump right now? permalink parent award report block reply HumblePepe 8 points 5 hours ago And Trump saying America doesn't have enough talented people. I thought it was Vivek, Dinesh, or some other street shitter that said that. But Trump? permalink parent award report block reply possibletower 1 points 5 hours ago He is right though. Every president since Reagan sent our manufacturing jobs and tech jobs overseas. He is 100% right on how fucked we are on that front. Retards like you like to LARP like we could have done Apollo without the Nazi German scientists. Our homegrown scientists could never have done that without their help. permalink parent award report block reply Magatronic 3 points 3 hours ago Half of the country thinks men can get pregnant… We call them names like libtards and laugh at their inability to reason. Then act like employers should feel lucky to have them. And that doesn’t address that there are morons on the right too.  The all browns are streetshitters. Chinese can’t innovate, Joggers gonna jog folks are fucking dumb.  Same with the Jews must’ve stole it crowd. Too much of MAGA has a giant blind spot around geniuses.  I mean the rare and real thing. Proper geniuses.  They think you can make them with elbow grease and a spanner wrench. Well. You can’t. And if you don’t understand that, you don’t understand how the real world works. There’s what, 4-5,000 proper geniuses (170IQ+) per generation? Out of 30 billion births. These people are who change the world. You have them or you fall WAY behind.  Ever wonder what leverage Israel really has?  They have an unusually high number of these people.  Which means they have innovations we need.  (Think really REALLY advanced weaponry). Salt of the earth farm boys are the backbone of a country, yes, but they’re not the frontal lobes. permalink parent award report block reply RizzlieDoodad 1 points 4 hours ago Congress has passed 3 real bills and have been stalling appointments. We're getting the Temu version permalink parent award report block reply load 15 more comments... hellohellohellohell 81 points 8 hours ago Sundance has a great write-up on this here: https://patriots.win/p/1ARK9mHVag/-sundance-outlines-the-divide-an/c/ Not that GEOTUS can't be wrong from time to time (he can) - we've reined him in before on vaxxes and Epstein, but the insane U-turn from two weeks ago to today on how his administration is going, and Levin and Shapiro starting a GOP civil war days before election day, is clearly all about '26 and '28, and trying to seize control of MAGA and return the power back to the RINOs. Those of us who lived through the influx of DeSantis Alligator Emojis in 2023, or the Ted Cruz dead-enders in '16, with their paid-off influencers, upvote bots and constant consensus cracking and forum sliding, know what's going on. Also, a lot of these influencers and posters stirring up trouble right now (not all, but most) had alligator emojis in their Twitter profiles a couple of years ago. Laura Ingraham and Levin most prominently. permalink award report block reply RuprechtThaMonkeyBoy 13 points 7 hours ago Yes. permalink parent award report block reply hellohellohellohell 11 points 7 hours ago Also, here's a bit of context for the Laura Ingraham situation: https://theconservativetreehouse.com/blog/2025/11/10/president-trump-appears-for-extensive-interview-with-laura-ingraham/ She's had Ron DeSantis on more than anyone else over the past year or so trying to rehab his reputation. She's definitely not MAGA, at least not entirely. permalink parent award report block reply JBlaze056 3 points 2 hours ago No Zionist is an America first person.  Zionism and America first are always against each other just as it was during the first iteration of America First under Charles Lindbergh in the 1930s.  How did they stop that movement?  They labeled him an \"antisemite\".  It is the exact same playbook being used by Shapiro, Levin and Loomer today.  They take our collective American conservative desires an repurposes them toward the Zionist wish list instead.  My hope is that it is not successful this time and instead they are purged from the party. permalink parent award report block reply cordsandfords 0 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply hellohellohellohell 9 points 7 hours ago Another of Laura's greatest hits: https://theconservativetreehouse.com/blog/2020/01/15/laura-ingraham-blocks-devin-nunes-from-discussing-mary-mccord-working-with-adam-schiff/ Laura Ingraham Blocks Devin Nunes from Discussing Mary McCord Working With Adam Schiff… Do Laura Ingraham and Mary McCord have a history together in/around Washington DC schools, law firms, clerks, social circles etc? Because obviously Ingraham doesn’t want Devin Nunes to discuss the revelations about former DOJ-NSD head Mary McCord now working with Adam Schiff on the impeachment agenda.  WATCH [@03:30] . Then again, it could be her typical Hannitus Interruptus style of self-important talking that destroys the opportunity for decent information. :::Sigh::: permalink parent award report block reply hellohellohellohell 7 points 7 hours ago Oh, here's a doozy: https://theconservativetreehouse.com/blog/2023/07/22/ingraham-begs-president-trump-to-stop-crushing-field-and-give-desantis-a-chance/ from 2023: \"Ingraham Begs President Trump to Stop Crushing Field and Give DeSantis a Chance\" *Before getting to the insufferable video, it’s worth remembering that Mrs. Hannity attended the late February donor retreat with “book tour” Ron DeSantis. According to Jacksonville 4 News Governor Ron DeSantis “huddled behind closed doors at a south Florida luxury hotel for a “Freedom Blueprint” retreat with more than 100 donors, elected officials and conservative influencers.”  According to the report from those present, “Laura Ingraham hosted a fireside chat with DeSantis on Sunday.” * Also, it does not escape my recent memory how Mrs. Hannity refused to permit Devin Nunes to discuss deep state Mary McCord and her involvement in the weaponization of the DOJ against President Trump. Mrs. Hannity would not let Mr. Nunes talk about Mrs. McCord [REMINDER]. So, with that in mind, and knowing the fake news advocacy of the insufferable pundit, this advice from Mrs. Hannity to do exactly the wrong thing seems to have a rather desperate Rupert Murdoch stench to it. {Direct Rumble Link} WATCH: And another one: Laura Ingraham Interviews Presidential Candidate After Spending Weekend Retreat With Him, and Never Mentions It… *According to Jacksonville 4 News Governor Ron DeSantis spent last weekend “huddled behind closed doors at a south Florida luxury hotel for a “Freedom Blueprint” retreat with more than 100 donors, elected officials and conservative influencers.”  According to the report from those present, “Laura Ingraham hosted a fireside chat with DeSantis on Sunday.” * You would think this ongoing network and relationship would need a mention, perhaps even a disclaimer, if the Fox News pundit was going to follow up with additional promotion of the same candidate.  Alas, as more people become familiar with the tactics of the professionally Republican, what ends up being highlighted is the transparent effort to manipulate the viewer.  WATCH: https://youtu.be/lsFqpBZ3Y94 Factually, I’m tired of the lies and manipulations.  It is difficult not to loathe these creatures now. Ms Ingraham continues her hypocritical false front as a conservative. {GO DEEP} This weekend the multinational lobbying group Club for Growth, headed by David McIntosh, are assembling a strategy session with big Wall Street donors to organize the multi-candidate roadmap for Ron DeSantis. permalink parent award report block reply hellohellohellohell 6 points 7 hours ago Ingraham has a very long history of this: https://theconservativetreehouse.com/blog/2024/07/29/president-trump-interview-with-laura-ingraham-3/ President Donald Trump sat down for an interview with Fox News host Laura Ingraham to discuss current political events. Ingraham can quickly slip into the mode of telling Donald Trump what the current political events are; however, Mrs Hannity did pause her interruptions long enough to allow President Trump to articulate his side of her arguments. WATCH: It’s a little funny because President Trump doesn’t like Mrs Hannity (you can see it). permalink parent award report block reply load 4 more comments... grad16uc 58 points 7 hours ago Baris, Barnes and Mitchell are on the sides of Tucker, Shroyer and Candace. They've all been sounding alarms. The other side is Shapiro, Levin and your establishment conservatives. permalink award report block reply hellohellohellohell 4 points 7 hours ago It's not that cut-and-dry. Fuck Levin and Shapiro, but the DeSantis and Cruz teams are salivating at the prospect of the MAGA coalition falling apart, and Vance/Rubio being wounded for '28. A lot of these influencers and posters stirring up trouble right now (not all, but most) had alligator emojis in their Twitter profiles a couple of years ago. Laura Ingraham and Levin, most prominently. Many of these anti-Tucker voices are now openly shilling for DeSantis over Vance in '28, because Vance hasn't shown adequate fealty to Israel and will clearly continue MAGA policies on tariffs and immigration. This is obviously a planned op. Neither Cruz nor DeSantis will do jack shit on H1Bs, deportations or expelling Chinese students, and they will shill 100X more for Israel, but they will lie through their teeth in the meantime to exploit MAGA fractures to gain leverage for '28. permalink parent award report block reply grad16uc 21 points 7 hours ago I don't care about the 28 ticket at all and I'd never vote for anyone you mentioned anyway. That's just politics. The coalition falls apart naturally though if you're consistently making mistakes. In just the last 24hrs, Trump sent a pardon letter on Bibi's behalf to Israel. He also strongly defended the H1Bs to Ingraham. So the things you're scared of happening are literally happening now. That's why people are mad. permalink parent award report block reply Mamapedia 10 points 7 hours ago Yes, no one here who doesn't like the flips is being manipulated by anyone in the media - they are reacting to what Trump has said and done.  There are perfectly legitimate complaints, and it is an insult to imply that they do not have the right to hold Trump's feet to the fire he ignited. permalink parent award report block reply covok48 3 points 7 hours ago It is that cut-and-dry and you are a colossal faggot. permalink parent award report block reply hellohellohellohell -2 points 7 hours ago Imagine someone cashing checks from DeSantis '28 calling anyone else a faggot... permalink parent award report block reply TheRedPike 0 points 5 hours ago That queer worships a manlet homosexual spic. permalink parent award report block reply Yggdrasill 2 points 5 hours ago lol MAGA coalition? Wtf does that even mean at this point? Infinite H1Bs? Diwali celebrations in the White House? Antisemitism laws? Pardons for Netanyahu? More wars for Israel? Pushing in Netanyahu’s chair? permalink parent award report block reply starjello 1 points 3 hours ago What the hell are Cruz n DeSantis going to gain when America has fallen there'll be nothing left for them to rule over.. once the deep state has thoroughly defeated Trump and the maga movement the democrats will rule until the end of time in this country. permalink parent award report block reply LUXURY_USERNAME 1 points 5 hours ago Some of these folks entire playbook is sounding alarms… permalink parent award report block reply TheWhitestOfFangs 1 points 5 hours ago There are more than just 2 sides... permalink parent award report block reply Faintlight 0 points 6 hours ago What are you saying? Last I heard of Barnes, he appears to be in the $7000 club against Candace. What has Baris done? permalink parent award report block reply GEOTUS4POTUS 1 points 3 hours ago Barış is a Turkish word meaning \"peace\" and a unisex name. The name is rarely given to females, with an overwhelming majority of people having the name being males. Notable people named Barış include:\nGiven name Barış Akarsu (1979–2007), Turkish rock musician\nBarış Alper Yılmaz (born 2000), Turkish footballer\nBarış Arduç (born 1987), Turkish actor\nBarış Başdaş (born 1990), Turkish football player\nBarış Bektaş (born 1976), Turkish politician\nBarış Çin (born 1975), Turkish carom and artistic billiards player\nBarış Ekincier (born 1999), Azerbaijani footballer\nBarış Ermiş (born 1985), Turkish basketball player\nBarış Esen (born 1986), Turkish chess grandmaster\nBarış Eyriboz (born 1976), Turkish film director\nBarış Hamaz (born 1976), Turkish volleyball player\nBarış Hersek (born 1988), Turkish basketball player\nBarış Kalaycı (born 2005), Turkish footballer\nBarış Manço (1943–1999), Turkish rock musician\nBarış Örücü (born 1992), Turkish-German footballer\nBarış Özbek (born 1986), Turkish-German footballer\nBarış Özcan (born 1974), Turkish YouTuber\nBarış Özcan (born 1980), Turkish basketball player\nBarış Tok (born 1978), Turkish motorcycle racer permalink parent award report block reply TrumpVoter 29 points 7 hours ago The natural feedback loop of rallies used to give Trump that pulse.  That feedback loop is severed so I don’t think we will be able to reign him in like past mistakes permalink award report block reply sgttoporbottoms 24 points 7 hours ago 100%. He use to talk up the vaccine all the time until he got booed at a rally. permalink parent award report block reply NoahGav 7 points 6 hours ago Think about how trivial and easy it is to understand what people want nowadays due to the internet and still being uninformed. permalink parent award report block reply covok48 25 points 7 hours ago These are some of the worst stickies I’ve ever seen this morning. permalink award report block reply YouEssAye 10 points 6 hours ago I'm convinced one of the mods is in a different time zone, overseas somewhere, I won't be specific, but every middle of the night and early morning sticky has a specific narrative. permalink parent award report block reply NeverInterruptEnemy 1 points 35 minutes ago This site is conservative jail meant to keep your scope here and retarded. permalink parent award report block reply GA_Logic 6 points 7 hours ago I wouldn't say the worst but we need more context. permalink parent award report block reply Prof_Smith 20 points 7 hours ago People need to wake up.  You already have the mechanisms moving for 2026 and 2028 to eliminate the work done. And at the same time, you have bad influencers getting the wrong message through.  Trump was elected to fix the domestic economy and deport the illegals.  We need to see more of that in the next 10 months to give a chance to hold the house. permalink award report block reply Aisle-is-closed 5 points 6 hours ago And we aren’t going to do that with foreign peace deals that have zero affect on us, more legal legal immigration through student and h1b visas, or ridiculous loan extensions. Trump has careened off the road. Supporting these terrible policies just because Trump is suicide. permalink parent award report block reply FORMERCHILDSTAR 17 points 7 hours ago We're calling people RINOS when NEOCON is probably the more accurate description. permalink award report block reply ParadigmShift2070 6 points 5 hours ago Judeo-cons permalink parent award report block reply RudeFrog 3 points 6 hours ago At this point what difference does it make anyways! permalink parent award report block reply FORMERCHILDSTAR 1 points 5 hours ago I think the two groups have different motives. There is some overlap, but neocons have a more globalist bent, while rinos protect the status quo while getting rich off government \"service.\" permalink parent award report block reply 2008RonPaul2012 -5 points 7 hours ago Neocon has always been such a retarded term. Conservatism is about preserving traditions, so here we are to do that in brand new, untested ways! We're CONS, but we're also N E O. We ain't your grandpa's cons. permalink parent award report block reply FORMERCHILDSTAR 17 points 7 hours ago It was a term intended to rebrand former liberal (mainly jews) as suddenly conservatives. AKA Imposters who are really globalists at their core. permalink parent award report block reply 2008RonPaul2012 3 points 7 hours ago Yes I know, I'm just saying they could have chosen a less obvious costume. They may as well be wearing Groucho Marx disguises and talking about \"shared j u d e o Christian values\" while they demand we bomb israel's neighbors permalink parent award report block reply FORMERCHILDSTAR 2 points 7 hours ago Yep. permalink parent award report block reply MAGALADON9 14 points 7 hours ago A little context in your title would be nice permalink award report block reply GA_Logic 4 points 7 hours ago I have to agree as well. permalink parent award report block reply sgttoporbottoms 14 points 7 hours ago Yes, of course their u-turn is unnatural. Republicans didn’t just get stomped on in an election or anything. Honestly, this is retarded Rich and Barnes were the only people saying not to do a shutdown in 2020. How did that work out? permalink award report block reply CandyBarr 4 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply sgttoporbottoms 8 points 7 hours ago Literally look at any of the down ballot races. Or look at Pennsylvania or Georgia races. Are those “Blue states”? Just watch the video with Barnes and Baris. Or not, stick your head in the sand and allow Trump to get impeached for a third time when democrats win in 2026. Trump needs to hear from his voters, just like with the vaccine meanwhile you are cheerleading him off a cliff. permalink parent award report block reply AnAmishWithATude 2 points 6 hours ago You're right but in those states and others stopping the fraud machine is more important. Energizing the base can help but if Trump can't take control of that and end the cheating then all this talk about voters is a smokescreen. permalink parent award report block reply CandyBarr 1 points 4 hours ago Give me the race...... I'm waiting permalink parent award report block reply sgttoporbottoms 1 points 2 hours ago It’s so tiresome dealing with people like you. You could easily just investigate and be open to these warnings but you won’t. Just so you don’t claim that I’m avoiding you look at Passaic county in NJ in 2016, 2020, 2024 and 2025 and tell me if you notice something permalink parent award report block reply CandyBarr 1 points 2 hours ago Give me a specific race brohim? So far all I've seen is races we had little chance of winning or screwed up States like how did new jersey start getting so many votes...... permalink parent award report block reply covok48 3 points 7 hours ago We got crushed in red states too. You’re just in denial permalink parent award report block reply CandyBarr 1 points 2 hours ago So, show me the race? It's shouldn't be that hard apparently permalink parent award report block reply CandyBarr 1 points 4 hours ago Give me one race that wasn't unexpected. I'll wait. permalink parent award report block reply NoahGav 14 points 6 hours ago It seems organic to me. It comes from Trump's own actions and that interview he just did. permalink award report block reply militantnationalist6 13 points 6 hours ago Shapiro was against Trump in 2016. This is simple actually. Shapiro and Levin etc have always been controlled opposition. Any Jewish organization is going to be this which is why you don’t allow them to set the tone of what the movement is discussing or advocating for. permalink award report block reply flp999 13 points 7 hours ago People actually care about this stuff? I don't even pay any attention to it. Very bizarre psyop drama. Think for yourself, if you're taking sides in some manufactured bullshit you're definitely fucking up and not paying attention to anything important. permalink award report block reply GA_Logic 3 points 7 hours ago Agreed. Eye on the prize people America first! permalink parent award report block reply YouEssAye 3 points 6 hours ago The whole fight is about putting America first, you guys aren't understanding why this fight is necessary. permalink parent award report block reply GA_Logic 3 points 6 hours ago No I understand it very well.  DeSantis exposed his true agenda when he went against President Trump.  He has been a good governor for us in Florida but he is definitely a neocon 100%. permalink parent award report block reply Goozmania 12 points 7 hours ago They're only pointing out polling trajectories... permalink award report block reply TheRedPike -4 points 5 hours ago We are calling drunk retards with crayons \"trajectories\" now? permalink parent award report block reply BerettaStroker 12 points 7 hours ago Who stickied this dogshit? permalink award report block reply FKH2 8 points 6 hours ago I voted for Donald Trump but got Biden/ Harris 2nd term, I am not pleased permalink award report block reply Antenna 6 points 6 hours ago Sure would be nice to know WTF you are talking about. They did a complete U-Turn on WHAT? They were pushing the same talking points about WHAT? What is it you are sure is totally not organic? permalink award report block reply MissileToad 5 points 7 hours ago I have liked Rich Barris' work... What did he say? Is this another Israel thing? permalink award report block reply BerettaStroker 13 points 6 hours ago He's sending up the signal that after he and his team talked to thousands and thousands of voters around the election that people are losing hope and DONE with the GOP as it currently stands. permalink parent award report block reply Hammond 4 points 6 hours ago Rich Baris and Mark Mitchell have great insights with their polling.  It looks like they are they are trying to sound the alarm on some of Trump's recent announcements vs feedback from Gen Z and Millennials. permalink award report block reply SuperSilly 2 points 1 hour ago Basically what they are saying is Gen Z are NOT conservatives. They voted for Trump because they wanted him to \"fix\" things. Now, they're voting for people like Mamdani because he says \"free stuff!\". I Agree with you, Rich Baris and Mark Mitchell do have great insights, they ARE sounding the alarm saying \"There is a good chance we lose the midterms and they impeach Trump if something isn't done.\" What to do about it, I'm not sure, it's hard to argue about \"free stuff\" when people actually believe that shit. permalink parent award report block reply modded 4 points 6 hours ago 100% organic. Get your head out of the sand. Trump lost a ton of support since Iran. He has very little time to fix this. permalink award report block reply Whatinthehell3 3 points 7 hours ago Amazing sticky, great context ! Totally organic ! permalink award report block reply hansgruber7 2 points 6 hours ago Who even are those people? permalink award report block reply CanadianMeathead 2 points 5 hours ago Haha, Trump tells the truth and you all lose your minds. You had inport smarter people but unfortunately more retards were let in too. All westernized countries do it. permalink award report block reply cordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 5 hours ago confused_gandalf.jpg permalink award report block reply R3tro 1 points 6 hours ago They all pulling a Bill “the galactic flamer” Mitchell…. permalink award report block reply Mulletgunning 1 points 5 hours ago Uh oh,dont say anything bad about Trump or........... Those scary cheerleaders will call you something. Lol Bunch of establishment loving faggots can fuck off and go suck BB off while having cow shit thrown at them. MAGA AF permalink award report block reply clownworld30330 1 points 32 minutes ago Context? permalink award report block reply try4gain PRO 1 points 3 hours ago who? what? permalink award report block reply flopperdog 1 points 2 hours ago Who the fuck is this loser... Rich Baris and Mark Mitchell are both POLLSTERS and the people they talk to are LEAVING MAGA. This \"Pro America Politics\" fucker is a worthless shill permalink award report block reply Psarg 1 points 4 hours ago Who? permalink award report block reply LostElf 0 points 5 hours ago They did the same to the Tea Party. Split the base, then split the spits till it's all just little helpless, um, bundles of sticks. Old school neocons and NeverTrump ascendant with nothing but shattered voices arguing against them: the commie Democrats win, and we all get debanked or imprisoned in the next decade. Are the concerns being aired justified? Of course, because if they weren't. MAGA patriots wouldn't listen. permalink award report block reply Zennbrown OP 1 points 12 minutes ago Gay OP permalink parent award report block reply SuperDuperBasedMD -1 points 8 hours ago \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ permalink award report block reply America1stAndOnly 13 points 8 hours ago STFU. I'm America 1st. You are the modern day nation state of Israel 1st. We are not the same. permalink parent award report block reply SuperDuperBasedMD 9 points 8 hours ago Christ is King!\nnow you say it. permalink parent award report block reply JBlaze056 2 points 1 hour ago Christ is King.  America first.  Zionists need to stop repurposing our America first agenda once again or they will be removed from the party.  The people most loudly trying to split the party right now are Levin, Shapiro, Loomer and their ilk who are calling for the denouncement and ban of people like Tucker, Candace and soon to be Vance.  They are creating the very wedge you are pointing out.  To deny that would be denying reality. permalink parent award report block reply America1stAndOnly 2 points 1 hour ago I'm really not sure what he thought he'd prove with that comment. permalink parent award report block reply America1stAndOnly 1 points 1 hour ago Christ is king. That comment has nothing to do however with the modern day nation state of Israel. permalink parent award report block reply Aisle-is-closed 4 points 6 hours ago Israel is a wedge issue. You are either making policy that benefits Americans or you are considering Israel in policies, that at best share benefit meant for us with them. At worst, Americans get screwed by such policies. You are with us or against us. permalink parent award report block reply GenWashington 3 points 8 hours ago What is sea island? permalink parent award report block reply SuperDuperBasedMD 8 points 8 hours ago A resort in Georgia where Uniparty Republicans met to plot how defeat Trump/MAGA. permalink parent award report block reply GenWashington 2 points 8 hours ago Ah okay never knew that permalink parent award report block reply TruthyBrat 2 points 7 hours ago It's also in the same area as Jekyll Island, where the Federal Reserve was created. See The Creature from Jekyll Island . permalink parent award report block reply prayinpede 1 points 7 hours ago Jekyll Island? permalink parent award report block reply SuperDuperBasedMD 3 points 7 hours ago A resort in South Carolina where the Deep State/Swamp/Uniparty Republicans met to strategize on how to neuter Trump/MAGA. permalink parent award report block reply view 7 more comments... punkalicious 1 points 7 hours ago Very close by. permalink parent award report block reply Treefiddydiddy 3 points 8 hours ago sea island , jekyll island .................funny how 'history' rhymes permalink parent award report block reply CandyBarr 1 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply covok48 -1 points 7 hours ago You’re Israel controlled.con more. permalink parent award report block reply SuperDuperBasedMD 2 points 7 hours ago say it after me, Christ is King. Also read my top post https://patriots.win/p/19BZz0Y4dX/oppose-the-israeli-deep-state-at/c permalink parent award report block reply\nReleasetheList 167 points 7 hours ago They only started criticizing Trump when he started proposing policies that are antithetical to America First. 600k Chinese students? How is that AF? Saying we need more H1B's? How is that AF? 50 year mortages and 15 year car loans? Spending the entire first year of his presidency making peace deals with 3rd world shitholes, while nobel, doesn't really help Americans. They are trying to get him to course correct before it's too late. permalink award report block reply AnonymousFrog 58 points 7 hours ago Some people are trying to turn MAGA into a cult of personality. permalink parent award report block reply Cali_kid 9 points 6 hours ago We need more voters MAGA is not enough to win elections. Trump is trying to pander to Boomers. We needed to vote this last election and we sat at home complaining about Football. permalink parent award report block reply TGNX 19 points 6 hours ago People did vote. In deep blue states with intricate cheating apparati in place. Without the cheating, Mamdani wouldn't have won, the NJ deep blue governor wouldn't have won. Could more have shown up? Sure, but I'm betting whoever is MAGA was standing in line before the polls opened. permalink parent award report block reply HumblePepe 14 points 5 hours ago Man, I wish someone, like a Pam Bondi, could have made headway to stop election fraud before the elections. permalink parent award report block reply view 1 more comments... finnigan 9 points 6 hours ago I think the jihadist had enough student and moslem support to win fair and square but I agree that the NJ shit show was fixed. permalink parent award report block reply view 1 more comments... Repentnow 7 points 4 hours ago Without the cheating, Mamdani wouldn't have won NYC voted overwhelmingly against Trump in the last three elections: 2016 Trump: 17.04% 2020 Trump: 22.70% 2024 Trump: 30.01% 38% of NYC is foreign-born. NYC is deep blue. They didn't need to cheat. permalink parent award report block reply view 2 more comments... KekistaniMemeLord 5 points 3 hours ago of course they cheated but demographic replacement played a big role in both of those losses. They have the benefit of both mechanisms now in places like NY. permalink parent award report block reply breadbaker 3 points 4 hours ago Without the cheating, Mamdani wouldn't have won, Estimate is 1 in 7 voters in NYC is a muslim. He had the backing of AOC and huge swaths of the Bronx, Queens, Brooklyn, Harlem elected leaders. Mamdani was endorsed by Brad Lander the highest elected Jewish official. Cuomo had scandals involving female employees hanging over him and resignation from the governor's seat. He screwed up NY state's covid response and is accused of leading to death of many elderly. Mamdani won fair and square and in part to insane accusations.  The guy looks more legit today than if everybody had just shut-up and told Sliwa to drop out. permalink parent award report block reply view 1 more comments... load 1 more comments... ActNow 1 points 3 hours ago These latest ideas of Trump's stink, but how is this \"pandering to Boomers\"? permalink parent award report block reply Klaus73 2 points 2 hours ago arguably 50 year mortgages allow Boomers to sell their properties at greatly inflated prices while shackling the young into life long debt slavery. permalink parent award report block reply Standingoak 1 points 2 hours ago Nice , you recognized the motivation factor for the important election.  As an aside Trump wants ALL the generations smart enough to recognize the true enemy.  They stopped producing pennies today. permalink parent award report block reply cordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply Klaus73 2 points 2 hours ago Its been there for months...I called it back in March when folks started telling folks to be silent about Epstien. permalink parent award report block reply starjello 2 points 3 hours ago They've been doing that since Trump assumed office back in 2016. It is eerily cult like around here. It's  ironic how things have reversed. Too many here are like the modern day left and can't handle things. You tell them Trump lied and Q retards died would not be far from the truth permalink parent award report block reply EyesSewnShut 2 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply JustHereForTheSalmon 16 points 6 hours ago There's a reason why the deep state stopped trying to kill him and you're seeing the results. permalink parent award report block reply Klaus73 3 points 2 hours ago Still convinced that Pam was a insurance policy to ensure he would never go after anyone of consequence. permalink parent award report block reply Bouldabassed 8 points 6 hours ago Glad this is the top comment. Maybe there is some home for this site. Barnes, Baris, and Mark are consistently pushing in the correct direction. Can anyone honestly say the same about Trump right now? permalink parent award report block reply HumblePepe 8 points 5 hours ago And Trump saying America doesn't have enough talented people. I thought it was Vivek, Dinesh, or some other street shitter that said that. But Trump? permalink parent award report block reply possibletower 1 points 5 hours ago He is right though. Every president since Reagan sent our manufacturing jobs and tech jobs overseas. He is 100% right on how fucked we are on that front. Retards like you like to LARP like we could have done Apollo without the Nazi German scientists. Our homegrown scientists could never have done that without their help. permalink parent award report block reply Magatronic 3 points 3 hours ago Half of the country thinks men can get pregnant… We call them names like libtards and laugh at their inability to reason. Then act like employers should feel lucky to have them. And that doesn’t address that there are morons on the right too.  The all browns are streetshitters. Chinese can’t innovate, Joggers gonna jog folks are fucking dumb.  Same with the Jews must’ve stole it crowd. Too much of MAGA has a giant blind spot around geniuses.  I mean the rare and real thing. Proper geniuses.  They think you can make them with elbow grease and a spanner wrench. Well. You can’t. And if you don’t understand that, you don’t understand how the real world works. There’s what, 4-5,000 proper geniuses (170IQ+) per generation? Out of 30 billion births. These people are who change the world. You have them or you fall WAY behind.  Ever wonder what leverage Israel really has?  They have an unusually high number of these people.  Which means they have innovations we need.  (Think really REALLY advanced weaponry). Salt of the earth farm boys are the backbone of a country, yes, but they’re not the frontal lobes. permalink parent award report block reply RizzlieDoodad 1 points 4 hours ago Congress has passed 3 real bills and have been stalling appointments. We're getting the Temu version permalink parent award report block reply load 15 more comments...\nAnonymousFrog 58 points 7 hours ago Some people are trying to turn MAGA into a cult of personality. permalink parent award report block reply Cali_kid 9 points 6 hours ago We need more voters MAGA is not enough to win elections. Trump is trying to pander to Boomers. We needed to vote this last election and we sat at home complaining about Football. permalink parent award report block reply TGNX 19 points 6 hours ago People did vote. In deep blue states with intricate cheating apparati in place. Without the cheating, Mamdani wouldn't have won, the NJ deep blue governor wouldn't have won. Could more have shown up? Sure, but I'm betting whoever is MAGA was standing in line before the polls opened. permalink parent award report block reply HumblePepe 14 points 5 hours ago Man, I wish someone, like a Pam Bondi, could have made headway to stop election fraud before the elections. permalink parent award report block reply view 1 more comments... finnigan 9 points 6 hours ago I think the jihadist had enough student and moslem support to win fair and square but I agree that the NJ shit show was fixed. permalink parent award report block reply view 1 more comments... Repentnow 7 points 4 hours ago Without the cheating, Mamdani wouldn't have won NYC voted overwhelmingly against Trump in the last three elections: 2016 Trump: 17.04% 2020 Trump: 22.70% 2024 Trump: 30.01% 38% of NYC is foreign-born. NYC is deep blue. They didn't need to cheat. permalink parent award report block reply view 2 more comments... KekistaniMemeLord 5 points 3 hours ago of course they cheated but demographic replacement played a big role in both of those losses. They have the benefit of both mechanisms now in places like NY. permalink parent award report block reply breadbaker 3 points 4 hours ago Without the cheating, Mamdani wouldn't have won, Estimate is 1 in 7 voters in NYC is a muslim. He had the backing of AOC and huge swaths of the Bronx, Queens, Brooklyn, Harlem elected leaders. Mamdani was endorsed by Brad Lander the highest elected Jewish official. Cuomo had scandals involving female employees hanging over him and resignation from the governor's seat. He screwed up NY state's covid response and is accused of leading to death of many elderly. Mamdani won fair and square and in part to insane accusations.  The guy looks more legit today than if everybody had just shut-up and told Sliwa to drop out. permalink parent award report block reply view 1 more comments... load 1 more comments... ActNow 1 points 3 hours ago These latest ideas of Trump's stink, but how is this \"pandering to Boomers\"? permalink parent award report block reply Klaus73 2 points 2 hours ago arguably 50 year mortgages allow Boomers to sell their properties at greatly inflated prices while shackling the young into life long debt slavery. permalink parent award report block reply Standingoak 1 points 2 hours ago Nice , you recognized the motivation factor for the important election.  As an aside Trump wants ALL the generations smart enough to recognize the true enemy.  They stopped producing pennies today. permalink parent award report block reply cordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply Klaus73 2 points 2 hours ago Its been there for months...I called it back in March when folks started telling folks to be silent about Epstien. permalink parent award report block reply starjello 2 points 3 hours ago They've been doing that since Trump assumed office back in 2016. It is eerily cult like around here. It's  ironic how things have reversed. Too many here are like the modern day left and can't handle things. You tell them Trump lied and Q retards died would not be far from the truth permalink parent award report block reply EyesSewnShut 2 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply\nCali_kid 9 points 6 hours ago We need more voters MAGA is not enough to win elections. Trump is trying to pander to Boomers. We needed to vote this last election and we sat at home complaining about Football. permalink parent award report block reply TGNX 19 points 6 hours ago People did vote. In deep blue states with intricate cheating apparati in place. Without the cheating, Mamdani wouldn't have won, the NJ deep blue governor wouldn't have won. Could more have shown up? Sure, but I'm betting whoever is MAGA was standing in line before the polls opened. permalink parent award report block reply HumblePepe 14 points 5 hours ago Man, I wish someone, like a Pam Bondi, could have made headway to stop election fraud before the elections. permalink parent award report block reply view 1 more comments... finnigan 9 points 6 hours ago I think the jihadist had enough student and moslem support to win fair and square but I agree that the NJ shit show was fixed. permalink parent award report block reply view 1 more comments... Repentnow 7 points 4 hours ago Without the cheating, Mamdani wouldn't have won NYC voted overwhelmingly against Trump in the last three elections: 2016 Trump: 17.04% 2020 Trump: 22.70% 2024 Trump: 30.01% 38% of NYC is foreign-born. NYC is deep blue. They didn't need to cheat. permalink parent award report block reply view 2 more comments... KekistaniMemeLord 5 points 3 hours ago of course they cheated but demographic replacement played a big role in both of those losses. They have the benefit of both mechanisms now in places like NY. permalink parent award report block reply breadbaker 3 points 4 hours ago Without the cheating, Mamdani wouldn't have won, Estimate is 1 in 7 voters in NYC is a muslim. He had the backing of AOC and huge swaths of the Bronx, Queens, Brooklyn, Harlem elected leaders. Mamdani was endorsed by Brad Lander the highest elected Jewish official. Cuomo had scandals involving female employees hanging over him and resignation from the governor's seat. He screwed up NY state's covid response and is accused of leading to death of many elderly. Mamdani won fair and square and in part to insane accusations.  The guy looks more legit today than if everybody had just shut-up and told Sliwa to drop out. permalink parent award report block reply view 1 more comments... load 1 more comments... ActNow 1 points 3 hours ago These latest ideas of Trump's stink, but how is this \"pandering to Boomers\"? permalink parent award report block reply Klaus73 2 points 2 hours ago arguably 50 year mortgages allow Boomers to sell their properties at greatly inflated prices while shackling the young into life long debt slavery. permalink parent award report block reply Standingoak 1 points 2 hours ago Nice , you recognized the motivation factor for the important election.  As an aside Trump wants ALL the generations smart enough to recognize the true enemy.  They stopped producing pennies today. permalink parent award report block reply cordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTGNX 19 points 6 hours ago People did vote. In deep blue states with intricate cheating apparati in place. Without the cheating, Mamdani wouldn't have won, the NJ deep blue governor wouldn't have won. Could more have shown up? Sure, but I'm betting whoever is MAGA was standing in line before the polls opened. permalink parent award report block reply HumblePepe 14 points 5 hours ago Man, I wish someone, like a Pam Bondi, could have made headway to stop election fraud before the elections. permalink parent award report block reply view 1 more comments... finnigan 9 points 6 hours ago I think the jihadist had enough student and moslem support to win fair and square but I agree that the NJ shit show was fixed. permalink parent award report block reply view 1 more comments... Repentnow 7 points 4 hours ago Without the cheating, Mamdani wouldn't have won NYC voted overwhelmingly against Trump in the last three elections: 2016 Trump: 17.04% 2020 Trump: 22.70% 2024 Trump: 30.01% 38% of NYC is foreign-born. NYC is deep blue. They didn't need to cheat. permalink parent award report block reply view 2 more comments... KekistaniMemeLord 5 points 3 hours ago of course they cheated but demographic replacement played a big role in both of those losses. They have the benefit of both mechanisms now in places like NY. permalink parent award report block reply breadbaker 3 points 4 hours ago Without the cheating, Mamdani wouldn't have won, Estimate is 1 in 7 voters in NYC is a muslim. He had the backing of AOC and huge swaths of the Bronx, Queens, Brooklyn, Harlem elected leaders. Mamdani was endorsed by Brad Lander the highest elected Jewish official. Cuomo had scandals involving female employees hanging over him and resignation from the governor's seat. He screwed up NY state's covid response and is accused of leading to death of many elderly. Mamdani won fair and square and in part to insane accusations.  The guy looks more legit today than if everybody had just shut-up and told Sliwa to drop out. permalink parent award report block reply view 1 more comments... load 1 more comments...\nHumblePepe 14 points 5 hours ago Man, I wish someone, like a Pam Bondi, could have made headway to stop election fraud before the elections. permalink parent award report block reply view 1 more comments...\nfinnigan 9 points 6 hours ago I think the jihadist had enough student and moslem support to win fair and square but I agree that the NJ shit show was fixed. permalink parent award report block reply view 1 more comments...\nRepentnow 7 points 4 hours ago Without the cheating, Mamdani wouldn't have won NYC voted overwhelmingly against Trump in the last three elections: 2016 Trump: 17.04% 2020 Trump: 22.70% 2024 Trump: 30.01% 38% of NYC is foreign-born. NYC is deep blue. They didn't need to cheat. permalink parent award report block reply view 2 more comments...\nKekistaniMemeLord 5 points 3 hours ago of course they cheated but demographic replacement played a big role in both of those losses. They have the benefit of both mechanisms now in places like NY. permalink parent award report block reply\nbreadbaker 3 points 4 hours ago Without the cheating, Mamdani wouldn't have won, Estimate is 1 in 7 voters in NYC is a muslim. He had the backing of AOC and huge swaths of the Bronx, Queens, Brooklyn, Harlem elected leaders. Mamdani was endorsed by Brad Lander the highest elected Jewish official. Cuomo had scandals involving female employees hanging over him and resignation from the governor's seat. He screwed up NY state's covid response and is accused of leading to death of many elderly. Mamdani won fair and square and in part to insane accusations.  The guy looks more legit today than if everybody had just shut-up and told Sliwa to drop out. permalink parent award report block reply view 1 more comments...\nActNow 1 points 3 hours ago These latest ideas of Trump's stink, but how is this \"pandering to Boomers\"? permalink parent award report block reply Klaus73 2 points 2 hours ago arguably 50 year mortgages allow Boomers to sell their properties at greatly inflated prices while shackling the young into life long debt slavery. permalink parent award report block reply\nKlaus73 2 points 2 hours ago arguably 50 year mortgages allow Boomers to sell their properties at greatly inflated prices while shackling the young into life long debt slavery. permalink parent award report block reply\nStandingoak 1 points 2 hours ago Nice , you recognized the motivation factor for the important election.  As an aside Trump wants ALL the generations smart enough to recognize the true enemy.  They stopped producing pennies today. permalink parent award report block reply\ncordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nKlaus73 2 points 2 hours ago Its been there for months...I called it back in March when folks started telling folks to be silent about Epstien. permalink parent award report block reply\nstarjello 2 points 3 hours ago They've been doing that since Trump assumed office back in 2016. It is eerily cult like around here. It's  ironic how things have reversed. Too many here are like the modern day left and can't handle things. You tell them Trump lied and Q retards died would not be far from the truth permalink parent award report block reply\nEyesSewnShut 2 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply\nJustHereForTheSalmon 16 points 6 hours ago There's a reason why the deep state stopped trying to kill him and you're seeing the results. permalink parent award report block reply Klaus73 3 points 2 hours ago Still convinced that Pam was a insurance policy to ensure he would never go after anyone of consequence. permalink parent award report block reply\nKlaus73 3 points 2 hours ago Still convinced that Pam was a insurance policy to ensure he would never go after anyone of consequence. permalink parent award report block reply\nBouldabassed 8 points 6 hours ago Glad this is the top comment. Maybe there is some home for this site. Barnes, Baris, and Mark are consistently pushing in the correct direction. Can anyone honestly say the same about Trump right now? permalink parent award report block reply\nHumblePepe 8 points 5 hours ago And Trump saying America doesn't have enough talented people. I thought it was Vivek, Dinesh, or some other street shitter that said that. But Trump? permalink parent award report block reply possibletower 1 points 5 hours ago He is right though. Every president since Reagan sent our manufacturing jobs and tech jobs overseas. He is 100% right on how fucked we are on that front. Retards like you like to LARP like we could have done Apollo without the Nazi German scientists. Our homegrown scientists could never have done that without their help. permalink parent award report block reply Magatronic 3 points 3 hours ago Half of the country thinks men can get pregnant… We call them names like libtards and laugh at their inability to reason. Then act like employers should feel lucky to have them. And that doesn’t address that there are morons on the right too.  The all browns are streetshitters. Chinese can’t innovate, Joggers gonna jog folks are fucking dumb.  Same with the Jews must’ve stole it crowd. Too much of MAGA has a giant blind spot around geniuses.  I mean the rare and real thing. Proper geniuses.  They think you can make them with elbow grease and a spanner wrench. Well. You can’t. And if you don’t understand that, you don’t understand how the real world works. There’s what, 4-5,000 proper geniuses (170IQ+) per generation? Out of 30 billion births. These people are who change the world. You have them or you fall WAY behind.  Ever wonder what leverage Israel really has?  They have an unusually high number of these people.  Which means they have innovations we need.  (Think really REALLY advanced weaponry). Salt of the earth farm boys are the backbone of a country, yes, but they’re not the frontal lobes. permalink parent award report block reply\npossibletower 1 points 5 hours ago He is right though. Every president since Reagan sent our manufacturing jobs and tech jobs overseas. He is 100% right on how fucked we are on that front. Retards like you like to LARP like we could have done Apollo without the Nazi German scientists. Our homegrown scientists could never have done that without their help. permalink parent award report block reply Magatronic 3 points 3 hours ago Half of the country thinks men can get pregnant… We call them names like libtards and laugh at their inability to reason. Then act like employers should feel lucky to have them. And that doesn’t address that there are morons on the right too.  The all browns are streetshitters. Chinese can’t innovate, Joggers gonna jog folks are fucking dumb.  Same with the Jews must’ve stole it crowd. Too much of MAGA has a giant blind spot around geniuses.  I mean the rare and real thing. Proper geniuses.  They think you can make them with elbow grease and a spanner wrench. Well. You can’t. And if you don’t understand that, you don’t understand how the real world works. There’s what, 4-5,000 proper geniuses (170IQ+) per generation? Out of 30 billion births. These people are who change the world. You have them or you fall WAY behind.  Ever wonder what leverage Israel really has?  They have an unusually high number of these people.  Which means they have innovations we need.  (Think really REALLY advanced weaponry). Salt of the earth farm boys are the backbone of a country, yes, but they’re not the frontal lobes. permalink parent award report block reply\nMagatronic 3 points 3 hours ago Half of the country thinks men can get pregnant… We call them names like libtards and laugh at their inability to reason. Then act like employers should feel lucky to have them. And that doesn’t address that there are morons on the right too.  The all browns are streetshitters. Chinese can’t innovate, Joggers gonna jog folks are fucking dumb.  Same with the Jews must’ve stole it crowd. Too much of MAGA has a giant blind spot around geniuses.  I mean the rare and real thing. Proper geniuses.  They think you can make them with elbow grease and a spanner wrench. Well. You can’t. And if you don’t understand that, you don’t understand how the real world works. There’s what, 4-5,000 proper geniuses (170IQ+) per generation? Out of 30 billion births. These people are who change the world. You have them or you fall WAY behind.  Ever wonder what leverage Israel really has?  They have an unusually high number of these people.  Which means they have innovations we need.  (Think really REALLY advanced weaponry). Salt of the earth farm boys are the backbone of a country, yes, but they’re not the frontal lobes. permalink parent award report block reply\nRizzlieDoodad 1 points 4 hours ago Congress has passed 3 real bills and have been stalling appointments. We're getting the Temu version permalink parent award report block reply\nhellohellohellohell 81 points 8 hours ago Sundance has a great write-up on this here: https://patriots.win/p/1ARK9mHVag/-sundance-outlines-the-divide-an/c/ Not that GEOTUS can't be wrong from time to time (he can) - we've reined him in before on vaxxes and Epstein, but the insane U-turn from two weeks ago to today on how his administration is going, and Levin and Shapiro starting a GOP civil war days before election day, is clearly all about '26 and '28, and trying to seize control of MAGA and return the power back to the RINOs. Those of us who lived through the influx of DeSantis Alligator Emojis in 2023, or the Ted Cruz dead-enders in '16, with their paid-off influencers, upvote bots and constant consensus cracking and forum sliding, know what's going on. Also, a lot of these influencers and posters stirring up trouble right now (not all, but most) had alligator emojis in their Twitter profiles a couple of years ago. Laura Ingraham and Levin most prominently. permalink award report block reply RuprechtThaMonkeyBoy 13 points 7 hours ago Yes. permalink parent award report block reply hellohellohellohell 11 points 7 hours ago Also, here's a bit of context for the Laura Ingraham situation: https://theconservativetreehouse.com/blog/2025/11/10/president-trump-appears-for-extensive-interview-with-laura-ingraham/ She's had Ron DeSantis on more than anyone else over the past year or so trying to rehab his reputation. She's definitely not MAGA, at least not entirely. permalink parent award report block reply JBlaze056 3 points 2 hours ago No Zionist is an America first person.  Zionism and America first are always against each other just as it was during the first iteration of America First under Charles Lindbergh in the 1930s.  How did they stop that movement?  They labeled him an \"antisemite\".  It is the exact same playbook being used by Shapiro, Levin and Loomer today.  They take our collective American conservative desires an repurposes them toward the Zionist wish list instead.  My hope is that it is not successful this time and instead they are purged from the party. permalink parent award report block reply cordsandfords 0 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply hellohellohellohell 9 points 7 hours ago Another of Laura's greatest hits: https://theconservativetreehouse.com/blog/2020/01/15/laura-ingraham-blocks-devin-nunes-from-discussing-mary-mccord-working-with-adam-schiff/ Laura Ingraham Blocks Devin Nunes from Discussing Mary McCord Working With Adam Schiff… Do Laura Ingraham and Mary McCord have a history together in/around Washington DC schools, law firms, clerks, social circles etc? Because obviously Ingraham doesn’t want Devin Nunes to discuss the revelations about former DOJ-NSD head Mary McCord now working with Adam Schiff on the impeachment agenda.  WATCH [@03:30] . Then again, it could be her typical Hannitus Interruptus style of self-important talking that destroys the opportunity for decent information. :::Sigh::: permalink parent award report block reply hellohellohellohell 7 points 7 hours ago Oh, here's a doozy: https://theconservativetreehouse.com/blog/2023/07/22/ingraham-begs-president-trump-to-stop-crushing-field-and-give-desantis-a-chance/ from 2023: \"Ingraham Begs President Trump to Stop Crushing Field and Give DeSantis a Chance\" *Before getting to the insufferable video, it’s worth remembering that Mrs. Hannity attended the late February donor retreat with “book tour” Ron DeSantis. According to Jacksonville 4 News Governor Ron DeSantis “huddled behind closed doors at a south Florida luxury hotel for a “Freedom Blueprint” retreat with more than 100 donors, elected officials and conservative influencers.”  According to the report from those present, “Laura Ingraham hosted a fireside chat with DeSantis on Sunday.” * Also, it does not escape my recent memory how Mrs. Hannity refused to permit Devin Nunes to discuss deep state Mary McCord and her involvement in the weaponization of the DOJ against President Trump. Mrs. Hannity would not let Mr. Nunes talk about Mrs. McCord [REMINDER]. So, with that in mind, and knowing the fake news advocacy of the insufferable pundit, this advice from Mrs. Hannity to do exactly the wrong thing seems to have a rather desperate Rupert Murdoch stench to it. {Direct Rumble Link} WATCH: And another one: Laura Ingraham Interviews Presidential Candidate After Spending Weekend Retreat With Him, and Never Mentions It… *According to Jacksonville 4 News Governor Ron DeSantis spent last weekend “huddled behind closed doors at a south Florida luxury hotel for a “Freedom Blueprint” retreat with more than 100 donors, elected officials and conservative influencers.”  According to the report from those present, “Laura Ingraham hosted a fireside chat with DeSantis on Sunday.” * You would think this ongoing network and relationship would need a mention, perhaps even a disclaimer, if the Fox News pundit was going to follow up with additional promotion of the same candidate.  Alas, as more people become familiar with the tactics of the professionally Republican, what ends up being highlighted is the transparent effort to manipulate the viewer.  WATCH: https://youtu.be/lsFqpBZ3Y94 Factually, I’m tired of the lies and manipulations.  It is difficult not to loathe these creatures now. Ms Ingraham continues her hypocritical false front as a conservative. {GO DEEP} This weekend the multinational lobbying group Club for Growth, headed by David McIntosh, are assembling a strategy session with big Wall Street donors to organize the multi-candidate roadmap for Ron DeSantis. permalink parent award report block reply hellohellohellohell 6 points 7 hours ago Ingraham has a very long history of this: https://theconservativetreehouse.com/blog/2024/07/29/president-trump-interview-with-laura-ingraham-3/ President Donald Trump sat down for an interview with Fox News host Laura Ingraham to discuss current political events. Ingraham can quickly slip into the mode of telling Donald Trump what the current political events are; however, Mrs Hannity did pause her interruptions long enough to allow President Trump to articulate his side of her arguments. WATCH: It’s a little funny because President Trump doesn’t like Mrs Hannity (you can see it). permalink parent award report block reply load 4 more comments...\nRuprechtThaMonkeyBoy 13 points 7 hours ago Yes. permalink parent award report block reply\nhellohellohellohell 11 points 7 hours ago Also, here's a bit of context for the Laura Ingraham situation: https://theconservativetreehouse.com/blog/2025/11/10/president-trump-appears-for-extensive-interview-with-laura-ingraham/ She's had Ron DeSantis on more than anyone else over the past year or so trying to rehab his reputation. She's definitely not MAGA, at least not entirely. permalink parent award report block reply JBlaze056 3 points 2 hours ago No Zionist is an America first person.  Zionism and America first are always against each other just as it was during the first iteration of America First under Charles Lindbergh in the 1930s.  How did they stop that movement?  They labeled him an \"antisemite\".  It is the exact same playbook being used by Shapiro, Levin and Loomer today.  They take our collective American conservative desires an repurposes them toward the Zionist wish list instead.  My hope is that it is not successful this time and instead they are purged from the party. permalink parent award report block reply cordsandfords 0 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nJBlaze056 3 points 2 hours ago No Zionist is an America first person.  Zionism and America first are always against each other just as it was during the first iteration of America First under Charles Lindbergh in the 1930s.  How did they stop that movement?  They labeled him an \"antisemite\".  It is the exact same playbook being used by Shapiro, Levin and Loomer today.  They take our collective American conservative desires an repurposes them toward the Zionist wish list instead.  My hope is that it is not successful this time and instead they are purged from the party. permalink parent award report block reply\ncordsandfords 0 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nhellohellohellohell 9 points 7 hours ago Another of Laura's greatest hits: https://theconservativetreehouse.com/blog/2020/01/15/laura-ingraham-blocks-devin-nunes-from-discussing-mary-mccord-working-with-adam-schiff/ Laura Ingraham Blocks Devin Nunes from Discussing Mary McCord Working With Adam Schiff… Do Laura Ingraham and Mary McCord have a history together in/around Washington DC schools, law firms, clerks, social circles etc? Because obviously Ingraham doesn’t want Devin Nunes to discuss the revelations about former DOJ-NSD head Mary McCord now working with Adam Schiff on the impeachment agenda.  WATCH [@03:30] . Then again, it could be her typical Hannitus Interruptus style of self-important talking that destroys the opportunity for decent information. :::Sigh::: permalink parent award report block reply\nhellohellohellohell 7 points 7 hours ago Oh, here's a doozy: https://theconservativetreehouse.com/blog/2023/07/22/ingraham-begs-president-trump-to-stop-crushing-field-and-give-desantis-a-chance/ from 2023: \"Ingraham Begs President Trump to Stop Crushing Field and Give DeSantis a Chance\" *Before getting to the insufferable video, it’s worth remembering that Mrs. Hannity attended the late February donor retreat with “book tour” Ron DeSantis. According to Jacksonville 4 News Governor Ron DeSantis “huddled behind closed doors at a south Florida luxury hotel for a “Freedom Blueprint” retreat with more than 100 donors, elected officials and conservative influencers.”  According to the report from those present, “Laura Ingraham hosted a fireside chat with DeSantis on Sunday.” * Also, it does not escape my recent memory how Mrs. Hannity refused to permit Devin Nunes to discuss deep state Mary McCord and her involvement in the weaponization of the DOJ against President Trump. Mrs. Hannity would not let Mr. Nunes talk about Mrs. McCord [REMINDER]. So, with that in mind, and knowing the fake news advocacy of the insufferable pundit, this advice from Mrs. Hannity to do exactly the wrong thing seems to have a rather desperate Rupert Murdoch stench to it. {Direct Rumble Link} WATCH: And another one: Laura Ingraham Interviews Presidential Candidate After Spending Weekend Retreat With Him, and Never Mentions It… *According to Jacksonville 4 News Governor Ron DeSantis spent last weekend “huddled behind closed doors at a south Florida luxury hotel for a “Freedom Blueprint” retreat with more than 100 donors, elected officials and conservative influencers.”  According to the report from those present, “Laura Ingraham hosted a fireside chat with DeSantis on Sunday.” * You would think this ongoing network and relationship would need a mention, perhaps even a disclaimer, if the Fox News pundit was going to follow up with additional promotion of the same candidate.  Alas, as more people become familiar with the tactics of the professionally Republican, what ends up being highlighted is the transparent effort to manipulate the viewer.  WATCH: https://youtu.be/lsFqpBZ3Y94 Factually, I’m tired of the lies and manipulations.  It is difficult not to loathe these creatures now. Ms Ingraham continues her hypocritical false front as a conservative. {GO DEEP} This weekend the multinational lobbying group Club for Growth, headed by David McIntosh, are assembling a strategy session with big Wall Street donors to organize the multi-candidate roadmap for Ron DeSantis. permalink parent award report block reply\nhellohellohellohell 6 points 7 hours ago Ingraham has a very long history of this: https://theconservativetreehouse.com/blog/2024/07/29/president-trump-interview-with-laura-ingraham-3/ President Donald Trump sat down for an interview with Fox News host Laura Ingraham to discuss current political events. Ingraham can quickly slip into the mode of telling Donald Trump what the current political events are; however, Mrs Hannity did pause her interruptions long enough to allow President Trump to articulate his side of her arguments. WATCH: It’s a little funny because President Trump doesn’t like Mrs Hannity (you can see it). permalink parent award report block reply\ngrad16uc 58 points 7 hours ago Baris, Barnes and Mitchell are on the sides of Tucker, Shroyer and Candace. They've all been sounding alarms. The other side is Shapiro, Levin and your establishment conservatives. permalink award report block reply hellohellohellohell 4 points 7 hours ago It's not that cut-and-dry. Fuck Levin and Shapiro, but the DeSantis and Cruz teams are salivating at the prospect of the MAGA coalition falling apart, and Vance/Rubio being wounded for '28. A lot of these influencers and posters stirring up trouble right now (not all, but most) had alligator emojis in their Twitter profiles a couple of years ago. Laura Ingraham and Levin, most prominently. Many of these anti-Tucker voices are now openly shilling for DeSantis over Vance in '28, because Vance hasn't shown adequate fealty to Israel and will clearly continue MAGA policies on tariffs and immigration. This is obviously a planned op. Neither Cruz nor DeSantis will do jack shit on H1Bs, deportations or expelling Chinese students, and they will shill 100X more for Israel, but they will lie through their teeth in the meantime to exploit MAGA fractures to gain leverage for '28. permalink parent award report block reply grad16uc 21 points 7 hours ago I don't care about the 28 ticket at all and I'd never vote for anyone you mentioned anyway. That's just politics. The coalition falls apart naturally though if you're consistently making mistakes. In just the last 24hrs, Trump sent a pardon letter on Bibi's behalf to Israel. He also strongly defended the H1Bs to Ingraham. So the things you're scared of happening are literally happening now. That's why people are mad. permalink parent award report block reply Mamapedia 10 points 7 hours ago Yes, no one here who doesn't like the flips is being manipulated by anyone in the media - they are reacting to what Trump has said and done.  There are perfectly legitimate complaints, and it is an insult to imply that they do not have the right to hold Trump's feet to the fire he ignited. permalink parent award report block reply covok48 3 points 7 hours ago It is that cut-and-dry and you are a colossal faggot. permalink parent award report block reply hellohellohellohell -2 points 7 hours ago Imagine someone cashing checks from DeSantis '28 calling anyone else a faggot... permalink parent award report block reply TheRedPike 0 points 5 hours ago That queer worships a manlet homosexual spic. permalink parent award report block reply Yggdrasill 2 points 5 hours ago lol MAGA coalition? Wtf does that even mean at this point? Infinite H1Bs? Diwali celebrations in the White House? Antisemitism laws? Pardons for Netanyahu? More wars for Israel? Pushing in Netanyahu’s chair? permalink parent award report block reply starjello 1 points 3 hours ago What the hell are Cruz n DeSantis going to gain when America has fallen there'll be nothing left for them to rule over.. once the deep state has thoroughly defeated Trump and the maga movement the democrats will rule until the end of time in this country. permalink parent award report block reply LUXURY_USERNAME 1 points 5 hours ago Some of these folks entire playbook is sounding alarms… permalink parent award report block reply TheWhitestOfFangs 1 points 5 hours ago There are more than just 2 sides... permalink parent award report block reply Faintlight 0 points 6 hours ago What are you saying? Last I heard of Barnes, he appears to be in the $7000 club against Candace. What has Baris done? permalink parent award report block reply GEOTUS4POTUS 1 points 3 hours ago Barış is a Turkish word meaning \"peace\" and a unisex name. The name is rarely given to females, with an overwhelming majority of people having the name being males. Notable people named Barış include:\nGiven name Barış Akarsu (1979–2007), Turkish rock musician\nBarış Alper Yılmaz (born 2000), Turkish footballer\nBarış Arduç (born 1987), Turkish actor\nBarış Başdaş (born 1990), Turkish football player\nBarış Bektaş (born 1976), Turkish politician\nBarış Çin (born 1975), Turkish carom and artistic billiards player\nBarış Ekincier (born 1999), Azerbaijani footballer\nBarış Ermiş (born 1985), Turkish basketball player\nBarış Esen (born 1986), Turkish chess grandmaster\nBarış Eyriboz (born 1976), Turkish film director\nBarış Hamaz (born 1976), Turkish volleyball player\nBarış Hersek (born 1988), Turkish basketball player\nBarış Kalaycı (born 2005), Turkish footballer\nBarış Manço (1943–1999), Turkish rock musician\nBarış Örücü (born 1992), Turkish-German footballer\nBarış Özbek (born 1986), Turkish-German footballer\nBarış Özcan (born 1974), Turkish YouTuber\nBarış Özcan (born 1980), Turkish basketball player\nBarış Tok (born 1978), Turkish motorcycle racer permalink parent award report block reply\nhellohellohellohell 4 points 7 hours ago It's not that cut-and-dry. Fuck Levin and Shapiro, but the DeSantis and Cruz teams are salivating at the prospect of the MAGA coalition falling apart, and Vance/Rubio being wounded for '28. A lot of these influencers and posters stirring up trouble right now (not all, but most) had alligator emojis in their Twitter profiles a couple of years ago. Laura Ingraham and Levin, most prominently. Many of these anti-Tucker voices are now openly shilling for DeSantis over Vance in '28, because Vance hasn't shown adequate fealty to Israel and will clearly continue MAGA policies on tariffs and immigration. This is obviously a planned op. Neither Cruz nor DeSantis will do jack shit on H1Bs, deportations or expelling Chinese students, and they will shill 100X more for Israel, but they will lie through their teeth in the meantime to exploit MAGA fractures to gain leverage for '28. permalink parent award report block reply grad16uc 21 points 7 hours ago I don't care about the 28 ticket at all and I'd never vote for anyone you mentioned anyway. That's just politics. The coalition falls apart naturally though if you're consistently making mistakes. In just the last 24hrs, Trump sent a pardon letter on Bibi's behalf to Israel. He also strongly defended the H1Bs to Ingraham. So the things you're scared of happening are literally happening now. That's why people are mad. permalink parent award report block reply Mamapedia 10 points 7 hours ago Yes, no one here who doesn't like the flips is being manipulated by anyone in the media - they are reacting to what Trump has said and done.  There are perfectly legitimate complaints, and it is an insult to imply that they do not have the right to hold Trump's feet to the fire he ignited. permalink parent award report block reply covok48 3 points 7 hours ago It is that cut-and-dry and you are a colossal faggot. permalink parent award report block reply hellohellohellohell -2 points 7 hours ago Imagine someone cashing checks from DeSantis '28 calling anyone else a faggot... permalink parent award report block reply TheRedPike 0 points 5 hours ago That queer worships a manlet homosexual spic. permalink parent award report block reply Yggdrasill 2 points 5 hours ago lol MAGA coalition? Wtf does that even mean at this point? Infinite H1Bs? Diwali celebrations in the White House? Antisemitism laws? Pardons for Netanyahu? More wars for Israel? Pushing in Netanyahu’s chair? permalink parent award report block reply starjello 1 points 3 hours ago What the hell are Cruz n DeSantis going to gain when America has fallen there'll be nothing left for them to rule over.. once the deep state has thoroughly defeated Trump and the maga movement the democrats will rule until the end of time in this country. permalink parent award report block reply\ngrad16uc 21 points 7 hours ago I don't care about the 28 ticket at all and I'd never vote for anyone you mentioned anyway. That's just politics. The coalition falls apart naturally though if you're consistently making mistakes. In just the last 24hrs, Trump sent a pardon letter on Bibi's behalf to Israel. He also strongly defended the H1Bs to Ingraham. So the things you're scared of happening are literally happening now. That's why people are mad. permalink parent award report block reply Mamapedia 10 points 7 hours ago Yes, no one here who doesn't like the flips is being manipulated by anyone in the media - they are reacting to what Trump has said and done.  There are perfectly legitimate complaints, and it is an insult to imply that they do not have the right to hold Trump's feet to the fire he ignited. permalink parent award report block reply\nMamapedia 10 points 7 hours ago Yes, no one here who doesn't like the flips is being manipulated by anyone in the media - they are reacting to what Trump has said and done.  There are perfectly legitimate complaints, and it is an insult to imply that they do not have the right to hold Trump's feet to the fire he ignited. permalink parent award report block reply\ncovok48 3 points 7 hours ago It is that cut-and-dry and you are a colossal faggot. permalink parent award report block reply hellohellohellohell -2 points 7 hours ago Imagine someone cashing checks from DeSantis '28 calling anyone else a faggot... permalink parent award report block reply TheRedPike 0 points 5 hours ago That queer worships a manlet homosexual spic. permalink parent award report block reply\nhellohellohellohell -2 points 7 hours ago Imagine someone cashing checks from DeSantis '28 calling anyone else a faggot... permalink parent award report block reply TheRedPike 0 points 5 hours ago That queer worships a manlet homosexual spic. permalink parent award report block reply\nTheRedPike 0 points 5 hours ago That queer worships a manlet homosexual spic. permalink parent award report block reply\nYggdrasill 2 points 5 hours ago lol MAGA coalition? Wtf does that even mean at this point? Infinite H1Bs? Diwali celebrations in the White House? Antisemitism laws? Pardons for Netanyahu? More wars for Israel? Pushing in Netanyahu’s chair? permalink parent award report block reply\nstarjello 1 points 3 hours ago What the hell are Cruz n DeSantis going to gain when America has fallen there'll be nothing left for them to rule over.. once the deep state has thoroughly defeated Trump and the maga movement the democrats will rule until the end of time in this country. permalink parent award report block reply\nLUXURY_USERNAME 1 points 5 hours ago Some of these folks entire playbook is sounding alarms… permalink parent award report block reply\nTheWhitestOfFangs 1 points 5 hours ago There are more than just 2 sides... permalink parent award report block reply\nFaintlight 0 points 6 hours ago What are you saying? Last I heard of Barnes, he appears to be in the $7000 club against Candace. What has Baris done? permalink parent award report block reply GEOTUS4POTUS 1 points 3 hours ago Barış is a Turkish word meaning \"peace\" and a unisex name. The name is rarely given to females, with an overwhelming majority of people having the name being males. Notable people named Barış include:\nGiven name Barış Akarsu (1979–2007), Turkish rock musician\nBarış Alper Yılmaz (born 2000), Turkish footballer\nBarış Arduç (born 1987), Turkish actor\nBarış Başdaş (born 1990), Turkish football player\nBarış Bektaş (born 1976), Turkish politician\nBarış Çin (born 1975), Turkish carom and artistic billiards player\nBarış Ekincier (born 1999), Azerbaijani footballer\nBarış Ermiş (born 1985), Turkish basketball player\nBarış Esen (born 1986), Turkish chess grandmaster\nBarış Eyriboz (born 1976), Turkish film director\nBarış Hamaz (born 1976), Turkish volleyball player\nBarış Hersek (born 1988), Turkish basketball player\nBarış Kalaycı (born 2005), Turkish footballer\nBarış Manço (1943–1999), Turkish rock musician\nBarış Örücü (born 1992), Turkish-German footballer\nBarış Özbek (born 1986), Turkish-German footballer\nBarış Özcan (born 1974), Turkish YouTuber\nBarış Özcan (born 1980), Turkish basketball player\nBarış Tok (born 1978), Turkish motorcycle racer permalink parent award report block reply\nGEOTUS4POTUS 1 points 3 hours ago Barış is a Turkish word meaning \"peace\" and a unisex name. The name is rarely given to females, with an overwhelming majority of people having the name being males. Notable people named Barış include:\nGiven name Barış Akarsu (1979–2007), Turkish rock musician\nBarış Alper Yılmaz (born 2000), Turkish footballer\nBarış Arduç (born 1987), Turkish actor\nBarış Başdaş (born 1990), Turkish football player\nBarış Bektaş (born 1976), Turkish politician\nBarış Çin (born 1975), Turkish carom and artistic billiards player\nBarış Ekincier (born 1999), Azerbaijani footballer\nBarış Ermiş (born 1985), Turkish basketball player\nBarış Esen (born 1986), Turkish chess grandmaster\nBarış Eyriboz (born 1976), Turkish film director\nBarış Hamaz (born 1976), Turkish volleyball player\nBarış Hersek (born 1988), Turkish basketball player\nBarış Kalaycı (born 2005), Turkish footballer\nBarış Manço (1943–1999), Turkish rock musician\nBarış Örücü (born 1992), Turkish-German footballer\nBarış Özbek (born 1986), Turkish-German footballer\nBarış Özcan (born 1974), Turkish YouTuber\nBarış Özcan (born 1980), Turkish basketball player\nBarış Tok (born 1978), Turkish motorcycle racer permalink parent award report block reply\nTrumpVoter 29 points 7 hours ago The natural feedback loop of rallies used to give Trump that pulse.  That feedback loop is severed so I don’t think we will be able to reign him in like past mistakes permalink award report block reply sgttoporbottoms 24 points 7 hours ago 100%. He use to talk up the vaccine all the time until he got booed at a rally. permalink parent award report block reply NoahGav 7 points 6 hours ago Think about how trivial and easy it is to understand what people want nowadays due to the internet and still being uninformed. permalink parent award report block reply\nsgttoporbottoms 24 points 7 hours ago 100%. He use to talk up the vaccine all the time until he got booed at a rally. permalink parent award report block reply\nNoahGav 7 points 6 hours ago Think about how trivial and easy it is to understand what people want nowadays due to the internet and still being uninformed. permalink parent award report block reply\ncovok48 25 points 7 hours ago These are some of the worst stickies I’ve ever seen this morning. permalink award report block reply YouEssAye 10 points 6 hours ago I'm convinced one of the mods is in a different time zone, overseas somewhere, I won't be specific, but every middle of the night and early morning sticky has a specific narrative. permalink parent award report block reply NeverInterruptEnemy 1 points 35 minutes ago This site is conservative jail meant to keep your scope here and retarded. permalink parent award report block reply GA_Logic 6 points 7 hours ago I wouldn't say the worst but we need more context. permalink parent award report block reply\nYouEssAye 10 points 6 hours ago I'm convinced one of the mods is in a different time zone, overseas somewhere, I won't be specific, but every middle of the night and early morning sticky has a specific narrative. permalink parent award report block reply NeverInterruptEnemy 1 points 35 minutes ago This site is conservative jail meant to keep your scope here and retarded. permalink parent award report block reply\nNeverInterruptEnemy 1 points 35 minutes ago This site is conservative jail meant to keep your scope here and retarded. permalink parent award report block reply\nGA_Logic 6 points 7 hours ago I wouldn't say the worst but we need more context. permalink parent award report block reply\nProf_Smith 20 points 7 hours ago People need to wake up.  You already have the mechanisms moving for 2026 and 2028 to eliminate the work done. And at the same time, you have bad influencers getting the wrong message through.  Trump was elected to fix the domestic economy and deport the illegals.  We need to see more of that in the next 10 months to give a chance to hold the house. permalink award report block reply Aisle-is-closed 5 points 6 hours ago And we aren’t going to do that with foreign peace deals that have zero affect on us, more legal legal immigration through student and h1b visas, or ridiculous loan extensions. Trump has careened off the road. Supporting these terrible policies just because Trump is suicide. permalink parent award report block reply\nAisle-is-closed 5 points 6 hours ago And we aren’t going to do that with foreign peace deals that have zero affect on us, more legal legal immigration through student and h1b visas, or ridiculous loan extensions. Trump has careened off the road. Supporting these terrible policies just because Trump is suicide. permalink parent award report block reply\nFORMERCHILDSTAR 17 points 7 hours ago We're calling people RINOS when NEOCON is probably the more accurate description. permalink award report block reply ParadigmShift2070 6 points 5 hours ago Judeo-cons permalink parent award report block reply RudeFrog 3 points 6 hours ago At this point what difference does it make anyways! permalink parent award report block reply FORMERCHILDSTAR 1 points 5 hours ago I think the two groups have different motives. There is some overlap, but neocons have a more globalist bent, while rinos protect the status quo while getting rich off government \"service.\" permalink parent award report block reply 2008RonPaul2012 -5 points 7 hours ago Neocon has always been such a retarded term. Conservatism is about preserving traditions, so here we are to do that in brand new, untested ways! We're CONS, but we're also N E O. We ain't your grandpa's cons. permalink parent award report block reply FORMERCHILDSTAR 17 points 7 hours ago It was a term intended to rebrand former liberal (mainly jews) as suddenly conservatives. AKA Imposters who are really globalists at their core. permalink parent award report block reply 2008RonPaul2012 3 points 7 hours ago Yes I know, I'm just saying they could have chosen a less obvious costume. They may as well be wearing Groucho Marx disguises and talking about \"shared j u d e o Christian values\" while they demand we bomb israel's neighbors permalink parent award report block reply FORMERCHILDSTAR 2 points 7 hours ago Yep. permalink parent award report block reply\nParadigmShift2070 6 points 5 hours ago Judeo-cons permalink parent award report block reply\nRudeFrog 3 points 6 hours ago At this point what difference does it make anyways! permalink parent award report block reply FORMERCHILDSTAR 1 points 5 hours ago I think the two groups have different motives. There is some overlap, but neocons have a more globalist bent, while rinos protect the status quo while getting rich off government \"service.\" permalink parent award report block reply\nFORMERCHILDSTAR 1 points 5 hours ago I think the two groups have different motives. There is some overlap, but neocons have a more globalist bent, while rinos protect the status quo while getting rich off government \"service.\" permalink parent award report block reply\n2008RonPaul2012 -5 points 7 hours ago Neocon has always been such a retarded term. Conservatism is about preserving traditions, so here we are to do that in brand new, untested ways! We're CONS, but we're also N E O. We ain't your grandpa's cons. permalink parent award report block reply FORMERCHILDSTAR 17 points 7 hours ago It was a term intended to rebrand former liberal (mainly jews) as suddenly conservatives. AKA Imposters who are really globalists at their core. permalink parent award report block reply 2008RonPaul2012 3 points 7 hours ago Yes I know, I'm just saying they could have chosen a less obvious costume. They may as well be wearing Groucho Marx disguises and talking about \"shared j u d e o Christian values\" while they demand we bomb israel's neighbors permalink parent award report block reply FORMERCHILDSTAR 2 points 7 hours ago Yep. permalink parent award report block reply\nFORMERCHILDSTAR 17 points 7 hours ago It was a term intended to rebrand former liberal (mainly jews) as suddenly conservatives. AKA Imposters who are really globalists at their core. permalink parent award report block reply 2008RonPaul2012 3 points 7 hours ago Yes I know, I'm just saying they could have chosen a less obvious costume. They may as well be wearing Groucho Marx disguises and talking about \"shared j u d e o Christian values\" while they demand we bomb israel's neighbors permalink parent award report block reply FORMERCHILDSTAR 2 points 7 hours ago Yep. permalink parent award report block reply\n2008RonPaul2012 3 points 7 hours ago Yes I know, I'm just saying they could have chosen a less obvious costume. They may as well be wearing Groucho Marx disguises and talking about \"shared j u d e o Christian values\" while they demand we bomb israel's neighbors permalink parent award report block reply FORMERCHILDSTAR 2 points 7 hours ago Yep. permalink parent award report block reply\nFORMERCHILDSTAR 2 points 7 hours ago Yep. permalink parent award report block reply\nMAGALADON9 14 points 7 hours ago A little context in your title would be nice permalink award report block reply GA_Logic 4 points 7 hours ago I have to agree as well. permalink parent award report block reply\nGA_Logic 4 points 7 hours ago I have to agree as well. permalink parent award report block reply\nsgttoporbottoms 14 points 7 hours ago Yes, of course their u-turn is unnatural. Republicans didn’t just get stomped on in an election or anything. Honestly, this is retarded Rich and Barnes were the only people saying not to do a shutdown in 2020. How did that work out? permalink award report block reply CandyBarr 4 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply sgttoporbottoms 8 points 7 hours ago Literally look at any of the down ballot races. Or look at Pennsylvania or Georgia races. Are those “Blue states”? Just watch the video with Barnes and Baris. Or not, stick your head in the sand and allow Trump to get impeached for a third time when democrats win in 2026. Trump needs to hear from his voters, just like with the vaccine meanwhile you are cheerleading him off a cliff. permalink parent award report block reply AnAmishWithATude 2 points 6 hours ago You're right but in those states and others stopping the fraud machine is more important. Energizing the base can help but if Trump can't take control of that and end the cheating then all this talk about voters is a smokescreen. permalink parent award report block reply CandyBarr 1 points 4 hours ago Give me the race...... I'm waiting permalink parent award report block reply sgttoporbottoms 1 points 2 hours ago It’s so tiresome dealing with people like you. You could easily just investigate and be open to these warnings but you won’t. Just so you don’t claim that I’m avoiding you look at Passaic county in NJ in 2016, 2020, 2024 and 2025 and tell me if you notice something permalink parent award report block reply CandyBarr 1 points 2 hours ago Give me a specific race brohim? So far all I've seen is races we had little chance of winning or screwed up States like how did new jersey start getting so many votes...... permalink parent award report block reply covok48 3 points 7 hours ago We got crushed in red states too. You’re just in denial permalink parent award report block reply CandyBarr 1 points 2 hours ago So, show me the race? It's shouldn't be that hard apparently permalink parent award report block reply CandyBarr 1 points 4 hours ago Give me one race that wasn't unexpected. I'll wait. permalink parent award report block reply\nCandyBarr 4 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply sgttoporbottoms 8 points 7 hours ago Literally look at any of the down ballot races. Or look at Pennsylvania or Georgia races. Are those “Blue states”? Just watch the video with Barnes and Baris. Or not, stick your head in the sand and allow Trump to get impeached for a third time when democrats win in 2026. Trump needs to hear from his voters, just like with the vaccine meanwhile you are cheerleading him off a cliff. permalink parent award report block reply AnAmishWithATude 2 points 6 hours ago You're right but in those states and others stopping the fraud machine is more important. Energizing the base can help but if Trump can't take control of that and end the cheating then all this talk about voters is a smokescreen. permalink parent award report block reply CandyBarr 1 points 4 hours ago Give me the race...... I'm waiting permalink parent award report block reply sgttoporbottoms 1 points 2 hours ago It’s so tiresome dealing with people like you. You could easily just investigate and be open to these warnings but you won’t. Just so you don’t claim that I’m avoiding you look at Passaic county in NJ in 2016, 2020, 2024 and 2025 and tell me if you notice something permalink parent award report block reply CandyBarr 1 points 2 hours ago Give me a specific race brohim? So far all I've seen is races we had little chance of winning or screwed up States like how did new jersey start getting so many votes...... permalink parent award report block reply covok48 3 points 7 hours ago We got crushed in red states too. You’re just in denial permalink parent award report block reply CandyBarr 1 points 2 hours ago So, show me the race? It's shouldn't be that hard apparently permalink parent award report block reply CandyBarr 1 points 4 hours ago Give me one race that wasn't unexpected. I'll wait. permalink parent award report block reply\nsgttoporbottoms 8 points 7 hours ago Literally look at any of the down ballot races. Or look at Pennsylvania or Georgia races. Are those “Blue states”? Just watch the video with Barnes and Baris. Or not, stick your head in the sand and allow Trump to get impeached for a third time when democrats win in 2026. Trump needs to hear from his voters, just like with the vaccine meanwhile you are cheerleading him off a cliff. permalink parent award report block reply AnAmishWithATude 2 points 6 hours ago You're right but in those states and others stopping the fraud machine is more important. Energizing the base can help but if Trump can't take control of that and end the cheating then all this talk about voters is a smokescreen. permalink parent award report block reply CandyBarr 1 points 4 hours ago Give me the race...... I'm waiting permalink parent award report block reply sgttoporbottoms 1 points 2 hours ago It’s so tiresome dealing with people like you. You could easily just investigate and be open to these warnings but you won’t. Just so you don’t claim that I’m avoiding you look at Passaic county in NJ in 2016, 2020, 2024 and 2025 and tell me if you notice something permalink parent award report block reply CandyBarr 1 points 2 hours ago Give me a specific race brohim? So far all I've seen is races we had little chance of winning or screwed up States like how did new jersey start getting so many votes...... permalink parent award report block reply\nAnAmishWithATude 2 points 6 hours ago You're right but in those states and others stopping the fraud machine is more important. Energizing the base can help but if Trump can't take control of that and end the cheating then all this talk about voters is a smokescreen. permalink parent award report block reply\nCandyBarr 1 points 4 hours ago Give me the race...... I'm waiting permalink parent award report block reply sgttoporbottoms 1 points 2 hours ago It’s so tiresome dealing with people like you. You could easily just investigate and be open to these warnings but you won’t. Just so you don’t claim that I’m avoiding you look at Passaic county in NJ in 2016, 2020, 2024 and 2025 and tell me if you notice something permalink parent award report block reply\nsgttoporbottoms 1 points 2 hours ago It’s so tiresome dealing with people like you. You could easily just investigate and be open to these warnings but you won’t. Just so you don’t claim that I’m avoiding you look at Passaic county in NJ in 2016, 2020, 2024 and 2025 and tell me if you notice something permalink parent award report block reply\nCandyBarr 1 points 2 hours ago Give me a specific race brohim? So far all I've seen is races we had little chance of winning or screwed up States like how did new jersey start getting so many votes...... permalink parent award report block reply\ncovok48 3 points 7 hours ago We got crushed in red states too. You’re just in denial permalink parent award report block reply CandyBarr 1 points 2 hours ago So, show me the race? It's shouldn't be that hard apparently permalink parent award report block reply CandyBarr 1 points 4 hours ago Give me one race that wasn't unexpected. I'll wait. permalink parent award report block reply\nCandyBarr 1 points 2 hours ago So, show me the race? It's shouldn't be that hard apparently permalink parent award report block reply\nCandyBarr 1 points 4 hours ago Give me one race that wasn't unexpected. I'll wait. permalink parent award report block reply\nNoahGav 14 points 6 hours ago It seems organic to me. It comes from Trump's own actions and that interview he just did. permalink award report block reply\nmilitantnationalist6 13 points 6 hours ago Shapiro was against Trump in 2016. This is simple actually. Shapiro and Levin etc have always been controlled opposition. Any Jewish organization is going to be this which is why you don’t allow them to set the tone of what the movement is discussing or advocating for. permalink award report block reply\nflp999 13 points 7 hours ago People actually care about this stuff? I don't even pay any attention to it. Very bizarre psyop drama. Think for yourself, if you're taking sides in some manufactured bullshit you're definitely fucking up and not paying attention to anything important. permalink award report block reply GA_Logic 3 points 7 hours ago Agreed. Eye on the prize people America first! permalink parent award report block reply YouEssAye 3 points 6 hours ago The whole fight is about putting America first, you guys aren't understanding why this fight is necessary. permalink parent award report block reply GA_Logic 3 points 6 hours ago No I understand it very well.  DeSantis exposed his true agenda when he went against President Trump.  He has been a good governor for us in Florida but he is definitely a neocon 100%. permalink parent award report block reply\nGA_Logic 3 points 7 hours ago Agreed. Eye on the prize people America first! permalink parent award report block reply YouEssAye 3 points 6 hours ago The whole fight is about putting America first, you guys aren't understanding why this fight is necessary. permalink parent award report block reply GA_Logic 3 points 6 hours ago No I understand it very well.  DeSantis exposed his true agenda when he went against President Trump.  He has been a good governor for us in Florida but he is definitely a neocon 100%. permalink parent award report block reply\nYouEssAye 3 points 6 hours ago The whole fight is about putting America first, you guys aren't understanding why this fight is necessary. permalink parent award report block reply GA_Logic 3 points 6 hours ago No I understand it very well.  DeSantis exposed his true agenda when he went against President Trump.  He has been a good governor for us in Florida but he is definitely a neocon 100%. permalink parent award report block reply\nGA_Logic 3 points 6 hours ago No I understand it very well.  DeSantis exposed his true agenda when he went against President Trump.  He has been a good governor for us in Florida but he is definitely a neocon 100%. permalink parent award report block reply\nGoozmania 12 points 7 hours ago They're only pointing out polling trajectories... permalink award report block reply TheRedPike -4 points 5 hours ago We are calling drunk retards with crayons \"trajectories\" now? permalink parent award report block reply\nTheRedPike -4 points 5 hours ago We are calling drunk retards with crayons \"trajectories\" now? permalink parent award report block reply\nBerettaStroker 12 points 7 hours ago Who stickied this dogshit? permalink award report block reply\nFKH2 8 points 6 hours ago I voted for Donald Trump but got Biden/ Harris 2nd term, I am not pleased permalink award report block reply\nAntenna 6 points 6 hours ago Sure would be nice to know WTF you are talking about. They did a complete U-Turn on WHAT? They were pushing the same talking points about WHAT? What is it you are sure is totally not organic? permalink award report block reply\nMissileToad 5 points 7 hours ago I have liked Rich Barris' work... What did he say? Is this another Israel thing? permalink award report block reply BerettaStroker 13 points 6 hours ago He's sending up the signal that after he and his team talked to thousands and thousands of voters around the election that people are losing hope and DONE with the GOP as it currently stands. permalink parent award report block reply\nBerettaStroker 13 points 6 hours ago He's sending up the signal that after he and his team talked to thousands and thousands of voters around the election that people are losing hope and DONE with the GOP as it currently stands. permalink parent award report block reply\nHammond 4 points 6 hours ago Rich Baris and Mark Mitchell have great insights with their polling.  It looks like they are they are trying to sound the alarm on some of Trump's recent announcements vs feedback from Gen Z and Millennials. permalink award report block reply SuperSilly 2 points 1 hour ago Basically what they are saying is Gen Z are NOT conservatives. They voted for Trump because they wanted him to \"fix\" things. Now, they're voting for people like Mamdani because he says \"free stuff!\". I Agree with you, Rich Baris and Mark Mitchell do have great insights, they ARE sounding the alarm saying \"There is a good chance we lose the midterms and they impeach Trump if something isn't done.\" What to do about it, I'm not sure, it's hard to argue about \"free stuff\" when people actually believe that shit. permalink parent award report block reply\nSuperSilly 2 points 1 hour ago Basically what they are saying is Gen Z are NOT conservatives. They voted for Trump because they wanted him to \"fix\" things. Now, they're voting for people like Mamdani because he says \"free stuff!\". I Agree with you, Rich Baris and Mark Mitchell do have great insights, they ARE sounding the alarm saying \"There is a good chance we lose the midterms and they impeach Trump if something isn't done.\" What to do about it, I'm not sure, it's hard to argue about \"free stuff\" when people actually believe that shit. permalink parent award report block reply\nmodded 4 points 6 hours ago 100% organic. Get your head out of the sand. Trump lost a ton of support since Iran. He has very little time to fix this. permalink award report block reply\nWhatinthehell3 3 points 7 hours ago Amazing sticky, great context ! Totally organic ! permalink award report block reply\nhansgruber7 2 points 6 hours ago Who even are those people? permalink award report block reply\nCanadianMeathead 2 points 5 hours ago Haha, Trump tells the truth and you all lose your minds. You had inport smarter people but unfortunately more retards were let in too. All westernized countries do it. permalink award report block reply cordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\ncordsandfords 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nDrVSGGEOTUSPhD 1 points 5 hours ago confused_gandalf.jpg permalink award report block reply\nR3tro 1 points 6 hours ago They all pulling a Bill “the galactic flamer” Mitchell…. permalink award report block reply\nMulletgunning 1 points 5 hours ago Uh oh,dont say anything bad about Trump or........... Those scary cheerleaders will call you something. Lol Bunch of establishment loving faggots can fuck off and go suck BB off while having cow shit thrown at them. MAGA AF permalink award report block reply\nclownworld30330 1 points 32 minutes ago Context? permalink award report block reply\ntry4gain PRO 1 points 3 hours ago who? what? permalink award report block reply\nflopperdog 1 points 2 hours ago Who the fuck is this loser... Rich Baris and Mark Mitchell are both POLLSTERS and the people they talk to are LEAVING MAGA. This \"Pro America Politics\" fucker is a worthless shill permalink award report block reply\nPsarg 1 points 4 hours ago Who? permalink award report block reply\nLostElf 0 points 5 hours ago They did the same to the Tea Party. Split the base, then split the spits till it's all just little helpless, um, bundles of sticks. Old school neocons and NeverTrump ascendant with nothing but shattered voices arguing against them: the commie Democrats win, and we all get debanked or imprisoned in the next decade. Are the concerns being aired justified? Of course, because if they weren't. MAGA patriots wouldn't listen. permalink award report block reply Zennbrown OP 1 points 12 minutes ago Gay OP permalink parent award report block reply\nZennbrown OP 1 points 12 minutes ago Gay OP permalink parent award report block reply\nSuperDuperBasedMD -1 points 8 hours ago \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ permalink award report block reply America1stAndOnly 13 points 8 hours ago STFU. I'm America 1st. You are the modern day nation state of Israel 1st. We are not the same. permalink parent award report block reply SuperDuperBasedMD 9 points 8 hours ago Christ is King!\nnow you say it. permalink parent award report block reply JBlaze056 2 points 1 hour ago Christ is King.  America first.  Zionists need to stop repurposing our America first agenda once again or they will be removed from the party.  The people most loudly trying to split the party right now are Levin, Shapiro, Loomer and their ilk who are calling for the denouncement and ban of people like Tucker, Candace and soon to be Vance.  They are creating the very wedge you are pointing out.  To deny that would be denying reality. permalink parent award report block reply America1stAndOnly 2 points 1 hour ago I'm really not sure what he thought he'd prove with that comment. permalink parent award report block reply America1stAndOnly 1 points 1 hour ago Christ is king. That comment has nothing to do however with the modern day nation state of Israel. permalink parent award report block reply Aisle-is-closed 4 points 6 hours ago Israel is a wedge issue. You are either making policy that benefits Americans or you are considering Israel in policies, that at best share benefit meant for us with them. At worst, Americans get screwed by such policies. You are with us or against us. permalink parent award report block reply GenWashington 3 points 8 hours ago What is sea island? permalink parent award report block reply SuperDuperBasedMD 8 points 8 hours ago A resort in Georgia where Uniparty Republicans met to plot how defeat Trump/MAGA. permalink parent award report block reply GenWashington 2 points 8 hours ago Ah okay never knew that permalink parent award report block reply TruthyBrat 2 points 7 hours ago It's also in the same area as Jekyll Island, where the Federal Reserve was created. See The Creature from Jekyll Island . permalink parent award report block reply prayinpede 1 points 7 hours ago Jekyll Island? permalink parent award report block reply SuperDuperBasedMD 3 points 7 hours ago A resort in South Carolina where the Deep State/Swamp/Uniparty Republicans met to strategize on how to neuter Trump/MAGA. permalink parent award report block reply view 7 more comments... punkalicious 1 points 7 hours ago Very close by. permalink parent award report block reply Treefiddydiddy 3 points 8 hours ago sea island , jekyll island .................funny how 'history' rhymes permalink parent award report block reply CandyBarr 1 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply covok48 -1 points 7 hours ago You’re Israel controlled.con more. permalink parent award report block reply SuperDuperBasedMD 2 points 7 hours ago say it after me, Christ is King. Also read my top post https://patriots.win/p/19BZz0Y4dX/oppose-the-israeli-deep-state-at/c permalink parent award report block reply\nAmerica1stAndOnly 13 points 8 hours ago STFU. I'm America 1st. You are the modern day nation state of Israel 1st. We are not the same. permalink parent award report block reply SuperDuperBasedMD 9 points 8 hours ago Christ is King!\nnow you say it. permalink parent award report block reply JBlaze056 2 points 1 hour ago Christ is King.  America first.  Zionists need to stop repurposing our America first agenda once again or they will be removed from the party.  The people most loudly trying to split the party right now are Levin, Shapiro, Loomer and their ilk who are calling for the denouncement and ban of people like Tucker, Candace and soon to be Vance.  They are creating the very wedge you are pointing out.  To deny that would be denying reality. permalink parent award report block reply America1stAndOnly 2 points 1 hour ago I'm really not sure what he thought he'd prove with that comment. permalink parent award report block reply America1stAndOnly 1 points 1 hour ago Christ is king. That comment has nothing to do however with the modern day nation state of Israel. permalink parent award report block reply\nSuperDuperBasedMD 9 points 8 hours ago Christ is King!\nnow you say it. permalink parent award report block reply JBlaze056 2 points 1 hour ago Christ is King.  America first.  Zionists need to stop repurposing our America first agenda once again or they will be removed from the party.  The people most loudly trying to split the party right now are Levin, Shapiro, Loomer and their ilk who are calling for the denouncement and ban of people like Tucker, Candace and soon to be Vance.  They are creating the very wedge you are pointing out.  To deny that would be denying reality. permalink parent award report block reply America1stAndOnly 2 points 1 hour ago I'm really not sure what he thought he'd prove with that comment. permalink parent award report block reply America1stAndOnly 1 points 1 hour ago Christ is king. That comment has nothing to do however with the modern day nation state of Israel. permalink parent award report block reply\nJBlaze056 2 points 1 hour ago Christ is King.  America first.  Zionists need to stop repurposing our America first agenda once again or they will be removed from the party.  The people most loudly trying to split the party right now are Levin, Shapiro, Loomer and their ilk who are calling for the denouncement and ban of people like Tucker, Candace and soon to be Vance.  They are creating the very wedge you are pointing out.  To deny that would be denying reality. permalink parent award report block reply America1stAndOnly 2 points 1 hour ago I'm really not sure what he thought he'd prove with that comment. permalink parent award report block reply\nAmerica1stAndOnly 2 points 1 hour ago I'm really not sure what he thought he'd prove with that comment. permalink parent award report block reply\nAmerica1stAndOnly 1 points 1 hour ago Christ is king. That comment has nothing to do however with the modern day nation state of Israel. permalink parent award report block reply\nAisle-is-closed 4 points 6 hours ago Israel is a wedge issue. You are either making policy that benefits Americans or you are considering Israel in policies, that at best share benefit meant for us with them. At worst, Americans get screwed by such policies. You are with us or against us. permalink parent award report block reply\nGenWashington 3 points 8 hours ago What is sea island? permalink parent award report block reply SuperDuperBasedMD 8 points 8 hours ago A resort in Georgia where Uniparty Republicans met to plot how defeat Trump/MAGA. permalink parent award report block reply GenWashington 2 points 8 hours ago Ah okay never knew that permalink parent award report block reply TruthyBrat 2 points 7 hours ago It's also in the same area as Jekyll Island, where the Federal Reserve was created. See The Creature from Jekyll Island . permalink parent award report block reply prayinpede 1 points 7 hours ago Jekyll Island? permalink parent award report block reply SuperDuperBasedMD 3 points 7 hours ago A resort in South Carolina where the Deep State/Swamp/Uniparty Republicans met to strategize on how to neuter Trump/MAGA. permalink parent award report block reply view 7 more comments... punkalicious 1 points 7 hours ago Very close by. permalink parent award report block reply Treefiddydiddy 3 points 8 hours ago sea island , jekyll island .................funny how 'history' rhymes permalink parent award report block reply CandyBarr 1 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply\nSuperDuperBasedMD 8 points 8 hours ago A resort in Georgia where Uniparty Republicans met to plot how defeat Trump/MAGA. permalink parent award report block reply GenWashington 2 points 8 hours ago Ah okay never knew that permalink parent award report block reply TruthyBrat 2 points 7 hours ago It's also in the same area as Jekyll Island, where the Federal Reserve was created. See The Creature from Jekyll Island . permalink parent award report block reply prayinpede 1 points 7 hours ago Jekyll Island? permalink parent award report block reply SuperDuperBasedMD 3 points 7 hours ago A resort in South Carolina where the Deep State/Swamp/Uniparty Republicans met to strategize on how to neuter Trump/MAGA. permalink parent award report block reply view 7 more comments... punkalicious 1 points 7 hours ago Very close by. permalink parent award report block reply\nGenWashington 2 points 8 hours ago Ah okay never knew that permalink parent award report block reply TruthyBrat 2 points 7 hours ago It's also in the same area as Jekyll Island, where the Federal Reserve was created. See The Creature from Jekyll Island . permalink parent award report block reply\nTruthyBrat 2 points 7 hours ago It's also in the same area as Jekyll Island, where the Federal Reserve was created. See The Creature from Jekyll Island . permalink parent award report block reply\nprayinpede 1 points 7 hours ago Jekyll Island? permalink parent award report block reply SuperDuperBasedMD 3 points 7 hours ago A resort in South Carolina where the Deep State/Swamp/Uniparty Republicans met to strategize on how to neuter Trump/MAGA. permalink parent award report block reply view 7 more comments... punkalicious 1 points 7 hours ago Very close by. permalink parent award report block reply\nSuperDuperBasedMD 3 points 7 hours ago A resort in South Carolina where the Deep State/Swamp/Uniparty Republicans met to strategize on how to neuter Trump/MAGA. permalink parent award report block reply view 7 more comments...\npunkalicious 1 points 7 hours ago Very close by. permalink parent award report block reply\nTreefiddydiddy 3 points 8 hours ago sea island , jekyll island .................funny how 'history' rhymes permalink parent award report block reply\nCandyBarr 1 points 7 hours ago Comment removed by community moderators. permalink parent award report block reply\ncovok48 -1 points 7 hours ago You’re Israel controlled.con more. permalink parent award report block reply SuperDuperBasedMD 2 points 7 hours ago say it after me, Christ is King. Also read my top post https://patriots.win/p/19BZz0Y4dX/oppose-the-israeli-deep-state-at/c permalink parent award report block reply\nSuperDuperBasedMD 2 points 7 hours ago say it after me, Christ is King. Also read my top post https://patriots.win/p/19BZz0Y4dX/oppose-the-israeli-deep-state-at/c permalink parent award report block reply"
}