{
  "id": "1ARK9jztTE",
  "url": "https://patriots.win/p/1ARK9jztTE/any-day-now/c",
  "content": "630 Any day now... posted 1 day ago by InsectOverlord 20 comments award share download report block\n20 comments Sort by Top Top New Worst Old Save Around the Web Doctor: A Teaspoon Kills All Worms in Your Body! Paratoxil champdog 18 points 1 day ago I'm sure Kash Patel is just making sure his investigation and evidence is air tight before making an arrest. permalink award report block reply YouEssAye 9 points 1 day ago Can't tell if this is sarcasm permalink parent award report block reply BlackJack1776 8 points 1 day ago Doesn't matter to me, either way. Failure is Failure. Time to replace the scam artist with a real Lawman. permalink parent award report block reply YouEssAye 6 points 1 day ago Sorry hun, I've been reliably informed that this FBI is the most effective in history. You can tell Kash is a great American just by looking at him. I've been thinking of getting a big Kash tattoo in honor of the man who saved the Republic. permalink parent award report block reply Wexit-Delecto 1 points 1 day ago The shills will be here soon to tell you there have been arrests (of a few low level drug dealers and traffickers) and you should be satisfied with that. The other day one of them told me “lock her up” wasn’t an election promise and “drain the swamp” only meant a 4-8 year delay in the globalists’ agenda. permalink parent award report block reply Scot 11 points 1 day ago Yet, the FBI hunted down January 6 patriots with a vengeance. permalink award report block reply Bullet3250 6 points 1 day ago Yes... slow... But they are getting some of them... 18th person arrested in connection with Texas ICE detention center shooting. https://www.keranews.org/criminal-justice/2025-10-22/alvarado-texas-immigration-ice-detention-center-shooting-18-arrested permalink award report block reply Tulkas71 5 points 1 day ago Sounds like we'll have them all put away by 2045, oh wait the recruited more and simple replaced them, now there's even more than before we started permalink parent award report block reply Ice_Joker 3 points 1 day ago Where do you hear of Antifa organizing? It's down to fat white girls driving around and screaming. But that will never change. permalink award report block reply HaSumBro 1 points 1 day ago If you throw a party you're the organizer.\nWho ever plans these gatherings are the leaders. permalink parent award report block reply HaSumBro 3 points 1 day ago Did some retard indian make this meme?\nEnglish plz Fix \"anything to happen to antifa\" permalink award report block reply Aut_MAGA_Aut_Nihil 3 points 1 day ago What are you talking about? Operation: Tweetstorm is already in full force. permalink award report block reply NonbinaryPotatohead 3 points 1 day ago Worse...TruthSocial....\nA literal botted echochamber with zero reach permalink parent award report block reply Joseyep 3 points 1 day ago Write it correctly permalink award report block reply DCYR66 2 points 1 day ago Three years left of this term then we go way backwards again. They’re just salivating over Trump being out of the picture. permalink award report block reply Lamal 2 points 1 day ago antifa burns blue cities and redpills the country. don't interrupt your enemy when they are making a mistake. let them escalate then confront them head-on when they have far overstepped. The left's inability to police its own radicals is a huge strategic advantage for our side. permalink award report block reply lifeisahologram 2 points 1 day ago They literally have organized groups, with names, at specific meeting locations. I used to live in Portland and always saw Antifa signs promoting meet ups at specific places at specific times.  Cops need to attend and arrest. permalink award report block reply yarg 1 points 1 day ago They have a hierarchy with various chapters in buildings in all the major cities, a flag, mantra, etc. but you see, ANTIFA doesn't really exist. permalink award report block reply Goozmania 1 points 1 day ago There is no such thing, so keep waiting. They'd have to be labeled a foreign terror organization permalink award report block reply Wexit-Delecto 1 points 1 day ago It’s all happening behind the scenes guys. There are sealed indictments and plans to trust! What a game of 8D chess! permalink award report block reply NonbinaryPotatohead 0 points 1 day ago Are you all starting to see through it all yet? permalink award report block reply\nchampdog 18 points 1 day ago I'm sure Kash Patel is just making sure his investigation and evidence is air tight before making an arrest. permalink award report block reply YouEssAye 9 points 1 day ago Can't tell if this is sarcasm permalink parent award report block reply BlackJack1776 8 points 1 day ago Doesn't matter to me, either way. Failure is Failure. Time to replace the scam artist with a real Lawman. permalink parent award report block reply YouEssAye 6 points 1 day ago Sorry hun, I've been reliably informed that this FBI is the most effective in history. You can tell Kash is a great American just by looking at him. I've been thinking of getting a big Kash tattoo in honor of the man who saved the Republic. permalink parent award report block reply Wexit-Delecto 1 points 1 day ago The shills will be here soon to tell you there have been arrests (of a few low level drug dealers and traffickers) and you should be satisfied with that. The other day one of them told me “lock her up” wasn’t an election promise and “drain the swamp” only meant a 4-8 year delay in the globalists’ agenda. permalink parent award report block reply\nYouEssAye 9 points 1 day ago Can't tell if this is sarcasm permalink parent award report block reply BlackJack1776 8 points 1 day ago Doesn't matter to me, either way. Failure is Failure. Time to replace the scam artist with a real Lawman. permalink parent award report block reply YouEssAye 6 points 1 day ago Sorry hun, I've been reliably informed that this FBI is the most effective in history. You can tell Kash is a great American just by looking at him. I've been thinking of getting a big Kash tattoo in honor of the man who saved the Republic. permalink parent award report block reply\nBlackJack1776 8 points 1 day ago Doesn't matter to me, either way. Failure is Failure. Time to replace the scam artist with a real Lawman. permalink parent award report block reply YouEssAye 6 points 1 day ago Sorry hun, I've been reliably informed that this FBI is the most effective in history. You can tell Kash is a great American just by looking at him. I've been thinking of getting a big Kash tattoo in honor of the man who saved the Republic. permalink parent award report block reply\nYouEssAye 6 points 1 day ago Sorry hun, I've been reliably informed that this FBI is the most effective in history. You can tell Kash is a great American just by looking at him. I've been thinking of getting a big Kash tattoo in honor of the man who saved the Republic. permalink parent award report block reply\nWexit-Delecto 1 points 1 day ago The shills will be here soon to tell you there have been arrests (of a few low level drug dealers and traffickers) and you should be satisfied with that. The other day one of them told me “lock her up” wasn’t an election promise and “drain the swamp” only meant a 4-8 year delay in the globalists’ agenda. permalink parent award report block reply\nScot 11 points 1 day ago Yet, the FBI hunted down January 6 patriots with a vengeance. permalink award report block reply\nBullet3250 6 points 1 day ago Yes... slow... But they are getting some of them... 18th person arrested in connection with Texas ICE detention center shooting. https://www.keranews.org/criminal-justice/2025-10-22/alvarado-texas-immigration-ice-detention-center-shooting-18-arrested permalink award report block reply Tulkas71 5 points 1 day ago Sounds like we'll have them all put away by 2045, oh wait the recruited more and simple replaced them, now there's even more than before we started permalink parent award report block reply\nTulkas71 5 points 1 day ago Sounds like we'll have them all put away by 2045, oh wait the recruited more and simple replaced them, now there's even more than before we started permalink parent award report block reply\nIce_Joker 3 points 1 day ago Where do you hear of Antifa organizing? It's down to fat white girls driving around and screaming. But that will never change. permalink award report block reply HaSumBro 1 points 1 day ago If you throw a party you're the organizer.\nWho ever plans these gatherings are the leaders. permalink parent award report block reply\nHaSumBro 1 points 1 day ago If you throw a party you're the organizer.\nWho ever plans these gatherings are the leaders. permalink parent award report block reply\nHaSumBro 3 points 1 day ago Did some retard indian make this meme?\nEnglish plz Fix \"anything to happen to antifa\" permalink award report block reply\nAut_MAGA_Aut_Nihil 3 points 1 day ago What are you talking about? Operation: Tweetstorm is already in full force. permalink award report block reply NonbinaryPotatohead 3 points 1 day ago Worse...TruthSocial....\nA literal botted echochamber with zero reach permalink parent award report block reply\nNonbinaryPotatohead 3 points 1 day ago Worse...TruthSocial....\nA literal botted echochamber with zero reach permalink parent award report block reply\nJoseyep 3 points 1 day ago Write it correctly permalink award report block reply\nDCYR66 2 points 1 day ago Three years left of this term then we go way backwards again. They’re just salivating over Trump being out of the picture. permalink award report block reply\nLamal 2 points 1 day ago antifa burns blue cities and redpills the country. don't interrupt your enemy when they are making a mistake. let them escalate then confront them head-on when they have far overstepped. The left's inability to police its own radicals is a huge strategic advantage for our side. permalink award report block reply\nlifeisahologram 2 points 1 day ago They literally have organized groups, with names, at specific meeting locations. I used to live in Portland and always saw Antifa signs promoting meet ups at specific places at specific times.  Cops need to attend and arrest. permalink award report block reply\nyarg 1 points 1 day ago They have a hierarchy with various chapters in buildings in all the major cities, a flag, mantra, etc. but you see, ANTIFA doesn't really exist. permalink award report block reply\nGoozmania 1 points 1 day ago There is no such thing, so keep waiting. They'd have to be labeled a foreign terror organization permalink award report block reply\nWexit-Delecto 1 points 1 day ago It’s all happening behind the scenes guys. There are sealed indictments and plans to trust! What a game of 8D chess! permalink award report block reply\nNonbinaryPotatohead 0 points 1 day ago Are you all starting to see through it all yet? permalink award report block reply",
  "fetched_at": "2025-11-12T23:04:26.195647Z"
}