{
  "id": "1ARK57qr6w",
  "url": "https://patriots.win/p/1ARK57qr6w/jan-6-was-an-inside-job-and-no-a/c",
  "content": "347 Jan 6 was an inside Job, and no arrests. ZERO posted 4 days ago by HenkZeilstra 15 comments award share report block Alex Jones @RealAlexJones • 4d BREAKING: Former Capitol Police Officer Shauni Rae Kerkhoff is a forensic match to the long-sought Jan. 6 pipe bomber. This was all a coverup. She now works for the CIA. SHARE THIS EVERYWHERE, and remember Trumps “new FBI” has been helping the Dems cover it up! Great job Ed Alex Jones @RealAlexJones • 5d Global Exclusive: The January 6th Pipe Bomber’s Identity Has Been Discovered, and She is a Female Federal Capitol Police Officer Caught Red-Handed as Part of a Larger Deep State False Flag Operation to Frame President Trump and His Constituents Top FBI whistleblower Kyle\n15 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow Captntrouble 5 points 4 days ago I’d bet she was CIA planted into the police department. Like cockroaches those fuckers are everywhere permalink award report block reply TrumpAndGodWin 1 points 4 days ago They are run by the Carnegie, Ford and Rockefeller Foundations. alexjonesapp dot com permalink parent award report block reply 2FBIAgents1Cup 5 points 4 days ago Fine.... youve got the video. Identified without question..... She is officially a terrorist and an enemy of the state.... Act accordingly..... permalink award report block reply ReleasetheList 5 points 4 days ago By putting her on the shortlist to be the next CIA director. permalink parent award report block reply KennyKetchem 5 points 4 days ago Also future governor of Virginia. permalink parent award report block reply HankScorpio 4 points 4 days ago Best they could do was bomb Iran for Isrl. permalink award report block reply Steve56775 3 points 4 days ago Because Bondi is in on too. permalink award report block reply Comanche_Moon 2 points 4 days ago Bondi is worthless. permalink parent award report block reply USDMaga 3 points 4 days ago Opps, was done by a democrat. Guess now we know that we are done with this forever. permalink award report block reply Krat 2 points 4 days ago Seattle cant even arrest people stabbing people in cold blood and committing 50!)+ felonies in a row permalink award report block reply daty_dato 2 points 4 days ago The Law requires proof. permalink award report block reply SpeekFreely 2 points 4 days ago Congress is barely gonna touch this, the DC Capital Police are their Praetorian Gurad, their freinds. The agency should either be abolished or placed under Executive Control. permalink award report block reply ReleasetheList 1 points 4 days ago Serious question, does anyone actually feel like the deepstate is losing any power or influence over the country? Because to me, it feels like they might be even more powerful now than at any point in the past. permalink award report block reply SanityGumby 1 points 4 days ago Are you fucking retarded? Comey has been arrested. Subpoenas for the grand jury to indict Brennan are happening right now. Bolton who at a minimum was sabotaging Trump is facing the rest of his life in prison permalink award report block reply IPFreely 1 points 4 days ago We can have a massive news event like the Twitter files and no one from mainstream media will cover it and most people will never even know it happened. permalink award report block reply TrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nCaptntrouble 5 points 4 days ago I’d bet she was CIA planted into the police department. Like cockroaches those fuckers are everywhere permalink award report block reply TrumpAndGodWin 1 points 4 days ago They are run by the Carnegie, Ford and Rockefeller Foundations. alexjonesapp dot com permalink parent award report block reply\nTrumpAndGodWin 1 points 4 days ago They are run by the Carnegie, Ford and Rockefeller Foundations. alexjonesapp dot com permalink parent award report block reply\n2FBIAgents1Cup 5 points 4 days ago Fine.... youve got the video. Identified without question..... She is officially a terrorist and an enemy of the state.... Act accordingly..... permalink award report block reply ReleasetheList 5 points 4 days ago By putting her on the shortlist to be the next CIA director. permalink parent award report block reply KennyKetchem 5 points 4 days ago Also future governor of Virginia. permalink parent award report block reply\nReleasetheList 5 points 4 days ago By putting her on the shortlist to be the next CIA director. permalink parent award report block reply KennyKetchem 5 points 4 days ago Also future governor of Virginia. permalink parent award report block reply\nKennyKetchem 5 points 4 days ago Also future governor of Virginia. permalink parent award report block reply\nHankScorpio 4 points 4 days ago Best they could do was bomb Iran for Isrl. permalink award report block reply\nSteve56775 3 points 4 days ago Because Bondi is in on too. permalink award report block reply Comanche_Moon 2 points 4 days ago Bondi is worthless. permalink parent award report block reply\nComanche_Moon 2 points 4 days ago Bondi is worthless. permalink parent award report block reply\nUSDMaga 3 points 4 days ago Opps, was done by a democrat. Guess now we know that we are done with this forever. permalink award report block reply\nKrat 2 points 4 days ago Seattle cant even arrest people stabbing people in cold blood and committing 50!)+ felonies in a row permalink award report block reply\ndaty_dato 2 points 4 days ago The Law requires proof. permalink award report block reply\nSpeekFreely 2 points 4 days ago Congress is barely gonna touch this, the DC Capital Police are their Praetorian Gurad, their freinds. The agency should either be abolished or placed under Executive Control. permalink award report block reply\nReleasetheList 1 points 4 days ago Serious question, does anyone actually feel like the deepstate is losing any power or influence over the country? Because to me, it feels like they might be even more powerful now than at any point in the past. permalink award report block reply\nSanityGumby 1 points 4 days ago Are you fucking retarded? Comey has been arrested. Subpoenas for the grand jury to indict Brennan are happening right now. Bolton who at a minimum was sabotaging Trump is facing the rest of his life in prison permalink award report block reply\nIPFreely 1 points 4 days ago We can have a massive news event like the Twitter files and no one from mainstream media will cover it and most people will never even know it happened. permalink award report block reply\nTrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:03:46.072977Z"
}