{
  "id": "8185262",
  "title": "51'Trump Declares U.S. Doesn’t Have Talented Workers'... so much for the MAGA thing. Zion-Don's mask",
  "url": "https://patriots.win/p/1ARK9nOG5C/trump-declares-us-doesnt-have-ta/c",
  "content": "51 'Trump Declares U.S. Doesn’t Have Talented Workers'... so much for the MAGA thing. Zion-Don's mask off moment. (archive.is) YOU'RE  FIRED! posted 5 hours ago by TiggerLovingPooh 26 comments award share report block archive.is\n26 comments Sort by Top Top New Worst Old Save breadbaker 11 points 5 hours ago Not loving Papa Trump calling my kids stupid when they have to compete for college spots against the world. permalink award report block reply HumblePepe 4 points 4 hours ago And your tax money is being used to replace your own children. permalink parent award report block reply possibletower 1 points 3 hours ago Fuck Gen Z. Ungrateful sacks of shit who vote 80% Democrat and are demanding Trump to do socialist price controls on healthcare, food, and houses. permalink parent award report block reply possibletower 0 points 3 hours ago 🤣 Your shithead kids are socialists btw. You also are a Democrat. permalink parent award report block reply Greenhills 4 points 5 hours ago This what happens when you listen only to heads of companies who have an alterior motive to save the rest of the world and cut costs. What I find unbelievable is trumps brazen oversight of the extent of layoffs in this country despite his argument the country is the best it’s ever been permalink award report block reply LiquidSun 3 points 4 hours ago Ulterior permalink parent award report block reply atomchurch 1 points 4 hours ago Like a thorn in my eye. permalink parent award report block reply LiquidSun 4 points 4 hours ago His mask off moment was the sudden and aggressive 180 on Epstein. permalink award report block reply TiggerLovingPooh OP 3 points 5 hours ago What a fuckin' faggot. permalink award report block reply 0815 2 points 4 hours ago Partially true. If you have not manufactured certain goods and want to produce it yourself, you'll have to bring in people who are currently producing these goods, otherwise you'll never be able to create a marketable product. In automatic production lines of high-tech products, only experience not university knowledge will deliver results.\nAs an example: When the Euro was introduced in the EU states, Italy was about 10 to 15 years back in productivity per manufactured piece. They traditionally compensated by that by having their currency being about 20% lower in value than the German Mark.\nWith the Euro they could no longer do that.\nItaly never caught up. Still the same or worse productivity lag. And we are 25+ years later now.\nAnd US public schools don't produce enough technical people to actually have the manpower to increase manufacturing on a large scale.\nIt's a truth people don't like, but at least he is not lying.... permalink award report block reply BoatingAccident 2 points 3 hours ago You are not wrong. I interviewed about 10 people after going through about 60 applications for a mid career level position at my company. There was one or two I might hire the rest were complete trash and I would probably prefer one of the H1B people Trump is talking about. I’m sorry, but it’s a fact Our country has gone to shit.  And Trump did say it’s only until we can develop the talent here people. Why are people trashing Trump? I don’t get why people are trashing Trump for this. He’s a very reasonable man. permalink parent award report block reply Area82 1 points 3 hours ago I don't get it either unless it is just TDS people stirring up stuff. permalink parent award report block reply TiggerLovingPooh OP 1 points 4 hours ago Make Importing Foreigners to Manufacture Products in the United States Great Again! MIFMPUSGA! permalink parent award report block reply happyfave 2 points 4 hours ago It's not a binary argument, don't be retarded permalink parent award report block reply 0815 1 points 3 hours ago Did I say they should be able to stay forever? No. The problem is, that the entire world competes for these specialists. Do they need to be from India or China? No. The majority of manufacturing machine advancement is produced in Europe. The Europeans are setting up these machines in China, Vietnam, Mexico, because that's where US companies are producing. But they produced there because the US politicians made trade and industrial policy the last 40+ years favoring this business/production model.\nTrump wants to change that. But it is delusional to think this will work without external specialists setting up production lines and bring the workers here up to par with the current production standard. permalink parent award report block reply possibletower 1 points 3 hours ago The Ron DeFaggot brigade is raiding here again. They will have amnesia on this and claim they love Trump more than we do in a few weeks. It is always a cycle with these fags. They have done this everyday since 2015. Expect them to trot out DeFaggot as some \"MAGA patriot\" and claim that Trump is a communist soon. permalink parent award report block reply Tweedlethree 2 points 5 hours ago He is going to regret saying this. Not even a year and the First term Trump has showed up again. permalink award report block reply FlyinHeadlock 1 points 5 hours ago We have talent just not enough because of our education system. China has the opposite problem. Lots of talent but nowhere for these people to go. permalink award report block reply happyfave 1 points 4 hours ago That's not what he said, when did we turn into MSNBC permalink award report block reply NotYourMan 0 points 3 hours ago You either support Trump or not.  We can stop dooming Trump and start to work on this.  H1B-visa workers should have a repeating yearly fee assigned to them by the federal government so that they are 10% more expensive than a US worker in the same job.  This will force companies to hire on merit.  It will remove companies hiring Indians because they are from India. permalink award report block reply TiggerLovingPooh OP 1 points 2 hours ago Thanks for the cultist perspective. There's very few things in life or politics where you agree with people 100% of the time. I disagree with Trump on this and think it was a pretty tone-deaf faggot thing to say. Not every criticism is \"dooming\". You have some valid suggestions... that's NOT what Trump said. permalink parent award report block reply redditadminssuckit -6 points 5 hours ago You fucking people.  So he's making a mistake.  Everyone does.  He's made them before and fixed them. GTFO of here you stupid,  ignorant,  ungrateful,  fuck. permalink award report block reply TiggerLovingPooh OP 11 points 5 hours ago That's weird, sounds like Trump is the ungrateful one. The H-1Bs, Indians and Chinese didn't vote him into office, dipshit. (or maybe they did...?) How about starting training programs for workers, jobs placement for the unemployed, instead of just dismissing them offhand and saying the FUCKING United States of America (the country he's the FUCKING PRESIDENT of) doesn't have 'skilled workers', are you fucking kidding me? permalink parent award report block reply PepeFromPA 8 points 5 hours ago And if you don't call him out on it he will continue to make mistakes. Quick sucking him off and think for yourself fag. permalink parent award report block reply Ostia 7 points 5 hours ago A mistake? Doesn't seem like only one to me lately. permalink parent award report block reply HumblePepe 2 points 4 hours ago This is too late into the game to be making amateur mistakes like this. He's not Elon, Vivek or Dinesh who see the United States as an economic resource to exploit, seeing the native white population to be replaced. permalink parent award report block reply Krat 2 points 4 hours ago Except this mistke is on the verge of ending western civilization permalink parent award report block reply\nbreadbaker 11 points 5 hours ago Not loving Papa Trump calling my kids stupid when they have to compete for college spots against the world. permalink award report block reply HumblePepe 4 points 4 hours ago And your tax money is being used to replace your own children. permalink parent award report block reply possibletower 1 points 3 hours ago Fuck Gen Z. Ungrateful sacks of shit who vote 80% Democrat and are demanding Trump to do socialist price controls on healthcare, food, and houses. permalink parent award report block reply possibletower 0 points 3 hours ago 🤣 Your shithead kids are socialists btw. You also are a Democrat. permalink parent award report block reply\nHumblePepe 4 points 4 hours ago And your tax money is being used to replace your own children. permalink parent award report block reply possibletower 1 points 3 hours ago Fuck Gen Z. Ungrateful sacks of shit who vote 80% Democrat and are demanding Trump to do socialist price controls on healthcare, food, and houses. permalink parent award report block reply\npossibletower 1 points 3 hours ago Fuck Gen Z. Ungrateful sacks of shit who vote 80% Democrat and are demanding Trump to do socialist price controls on healthcare, food, and houses. permalink parent award report block reply\npossibletower 0 points 3 hours ago 🤣 Your shithead kids are socialists btw. You also are a Democrat. permalink parent award report block reply\nGreenhills 4 points 5 hours ago This what happens when you listen only to heads of companies who have an alterior motive to save the rest of the world and cut costs. What I find unbelievable is trumps brazen oversight of the extent of layoffs in this country despite his argument the country is the best it’s ever been permalink award report block reply LiquidSun 3 points 4 hours ago Ulterior permalink parent award report block reply atomchurch 1 points 4 hours ago Like a thorn in my eye. permalink parent award report block reply\nLiquidSun 3 points 4 hours ago Ulterior permalink parent award report block reply atomchurch 1 points 4 hours ago Like a thorn in my eye. permalink parent award report block reply\natomchurch 1 points 4 hours ago Like a thorn in my eye. permalink parent award report block reply\nLiquidSun 4 points 4 hours ago His mask off moment was the sudden and aggressive 180 on Epstein. permalink award report block reply\nTiggerLovingPooh OP 3 points 5 hours ago What a fuckin' faggot. permalink award report block reply\n0815 2 points 4 hours ago Partially true. If you have not manufactured certain goods and want to produce it yourself, you'll have to bring in people who are currently producing these goods, otherwise you'll never be able to create a marketable product. In automatic production lines of high-tech products, only experience not university knowledge will deliver results.\nAs an example: When the Euro was introduced in the EU states, Italy was about 10 to 15 years back in productivity per manufactured piece. They traditionally compensated by that by having their currency being about 20% lower in value than the German Mark.\nWith the Euro they could no longer do that.\nItaly never caught up. Still the same or worse productivity lag. And we are 25+ years later now.\nAnd US public schools don't produce enough technical people to actually have the manpower to increase manufacturing on a large scale.\nIt's a truth people don't like, but at least he is not lying.... permalink award report block reply BoatingAccident 2 points 3 hours ago You are not wrong. I interviewed about 10 people after going through about 60 applications for a mid career level position at my company. There was one or two I might hire the rest were complete trash and I would probably prefer one of the H1B people Trump is talking about. I’m sorry, but it’s a fact Our country has gone to shit.  And Trump did say it’s only until we can develop the talent here people. Why are people trashing Trump? I don’t get why people are trashing Trump for this. He’s a very reasonable man. permalink parent award report block reply Area82 1 points 3 hours ago I don't get it either unless it is just TDS people stirring up stuff. permalink parent award report block reply TiggerLovingPooh OP 1 points 4 hours ago Make Importing Foreigners to Manufacture Products in the United States Great Again! MIFMPUSGA! permalink parent award report block reply happyfave 2 points 4 hours ago It's not a binary argument, don't be retarded permalink parent award report block reply 0815 1 points 3 hours ago Did I say they should be able to stay forever? No. The problem is, that the entire world competes for these specialists. Do they need to be from India or China? No. The majority of manufacturing machine advancement is produced in Europe. The Europeans are setting up these machines in China, Vietnam, Mexico, because that's where US companies are producing. But they produced there because the US politicians made trade and industrial policy the last 40+ years favoring this business/production model.\nTrump wants to change that. But it is delusional to think this will work without external specialists setting up production lines and bring the workers here up to par with the current production standard. permalink parent award report block reply possibletower 1 points 3 hours ago The Ron DeFaggot brigade is raiding here again. They will have amnesia on this and claim they love Trump more than we do in a few weeks. It is always a cycle with these fags. They have done this everyday since 2015. Expect them to trot out DeFaggot as some \"MAGA patriot\" and claim that Trump is a communist soon. permalink parent award report block reply\nBoatingAccident 2 points 3 hours ago You are not wrong. I interviewed about 10 people after going through about 60 applications for a mid career level position at my company. There was one or two I might hire the rest were complete trash and I would probably prefer one of the H1B people Trump is talking about. I’m sorry, but it’s a fact Our country has gone to shit.  And Trump did say it’s only until we can develop the talent here people. Why are people trashing Trump? I don’t get why people are trashing Trump for this. He’s a very reasonable man. permalink parent award report block reply Area82 1 points 3 hours ago I don't get it either unless it is just TDS people stirring up stuff. permalink parent award report block reply\nArea82 1 points 3 hours ago I don't get it either unless it is just TDS people stirring up stuff. permalink parent award report block reply\nTiggerLovingPooh OP 1 points 4 hours ago Make Importing Foreigners to Manufacture Products in the United States Great Again! MIFMPUSGA! permalink parent award report block reply happyfave 2 points 4 hours ago It's not a binary argument, don't be retarded permalink parent award report block reply 0815 1 points 3 hours ago Did I say they should be able to stay forever? No. The problem is, that the entire world competes for these specialists. Do they need to be from India or China? No. The majority of manufacturing machine advancement is produced in Europe. The Europeans are setting up these machines in China, Vietnam, Mexico, because that's where US companies are producing. But they produced there because the US politicians made trade and industrial policy the last 40+ years favoring this business/production model.\nTrump wants to change that. But it is delusional to think this will work without external specialists setting up production lines and bring the workers here up to par with the current production standard. permalink parent award report block reply\nhappyfave 2 points 4 hours ago It's not a binary argument, don't be retarded permalink parent award report block reply\n0815 1 points 3 hours ago Did I say they should be able to stay forever? No. The problem is, that the entire world competes for these specialists. Do they need to be from India or China? No. The majority of manufacturing machine advancement is produced in Europe. The Europeans are setting up these machines in China, Vietnam, Mexico, because that's where US companies are producing. But they produced there because the US politicians made trade and industrial policy the last 40+ years favoring this business/production model.\nTrump wants to change that. But it is delusional to think this will work without external specialists setting up production lines and bring the workers here up to par with the current production standard. permalink parent award report block reply\npossibletower 1 points 3 hours ago The Ron DeFaggot brigade is raiding here again. They will have amnesia on this and claim they love Trump more than we do in a few weeks. It is always a cycle with these fags. They have done this everyday since 2015. Expect them to trot out DeFaggot as some \"MAGA patriot\" and claim that Trump is a communist soon. permalink parent award report block reply\nTweedlethree 2 points 5 hours ago He is going to regret saying this. Not even a year and the First term Trump has showed up again. permalink award report block reply\nFlyinHeadlock 1 points 5 hours ago We have talent just not enough because of our education system. China has the opposite problem. Lots of talent but nowhere for these people to go. permalink award report block reply\nhappyfave 1 points 4 hours ago That's not what he said, when did we turn into MSNBC permalink award report block reply\nNotYourMan 0 points 3 hours ago You either support Trump or not.  We can stop dooming Trump and start to work on this.  H1B-visa workers should have a repeating yearly fee assigned to them by the federal government so that they are 10% more expensive than a US worker in the same job.  This will force companies to hire on merit.  It will remove companies hiring Indians because they are from India. permalink award report block reply TiggerLovingPooh OP 1 points 2 hours ago Thanks for the cultist perspective. There's very few things in life or politics where you agree with people 100% of the time. I disagree with Trump on this and think it was a pretty tone-deaf faggot thing to say. Not every criticism is \"dooming\". You have some valid suggestions... that's NOT what Trump said. permalink parent award report block reply\nTiggerLovingPooh OP 1 points 2 hours ago Thanks for the cultist perspective. There's very few things in life or politics where you agree with people 100% of the time. I disagree with Trump on this and think it was a pretty tone-deaf faggot thing to say. Not every criticism is \"dooming\". You have some valid suggestions... that's NOT what Trump said. permalink parent award report block reply\nredditadminssuckit -6 points 5 hours ago You fucking people.  So he's making a mistake.  Everyone does.  He's made them before and fixed them. GTFO of here you stupid,  ignorant,  ungrateful,  fuck. permalink award report block reply TiggerLovingPooh OP 11 points 5 hours ago That's weird, sounds like Trump is the ungrateful one. The H-1Bs, Indians and Chinese didn't vote him into office, dipshit. (or maybe they did...?) How about starting training programs for workers, jobs placement for the unemployed, instead of just dismissing them offhand and saying the FUCKING United States of America (the country he's the FUCKING PRESIDENT of) doesn't have 'skilled workers', are you fucking kidding me? permalink parent award report block reply PepeFromPA 8 points 5 hours ago And if you don't call him out on it he will continue to make mistakes. Quick sucking him off and think for yourself fag. permalink parent award report block reply Ostia 7 points 5 hours ago A mistake? Doesn't seem like only one to me lately. permalink parent award report block reply HumblePepe 2 points 4 hours ago This is too late into the game to be making amateur mistakes like this. He's not Elon, Vivek or Dinesh who see the United States as an economic resource to exploit, seeing the native white population to be replaced. permalink parent award report block reply Krat 2 points 4 hours ago Except this mistke is on the verge of ending western civilization permalink parent award report block reply\nTiggerLovingPooh OP 11 points 5 hours ago That's weird, sounds like Trump is the ungrateful one. The H-1Bs, Indians and Chinese didn't vote him into office, dipshit. (or maybe they did...?) How about starting training programs for workers, jobs placement for the unemployed, instead of just dismissing them offhand and saying the FUCKING United States of America (the country he's the FUCKING PRESIDENT of) doesn't have 'skilled workers', are you fucking kidding me? permalink parent award report block reply\nPepeFromPA 8 points 5 hours ago And if you don't call him out on it he will continue to make mistakes. Quick sucking him off and think for yourself fag. permalink parent award report block reply\nOstia 7 points 5 hours ago A mistake? Doesn't seem like only one to me lately. permalink parent award report block reply\nHumblePepe 2 points 4 hours ago This is too late into the game to be making amateur mistakes like this. He's not Elon, Vivek or Dinesh who see the United States as an economic resource to exploit, seeing the native white population to be replaced. permalink parent award report block reply\nKrat 2 points 4 hours ago Except this mistke is on the verge of ending western civilization permalink parent award report block reply",
  "fetched_at": "2025-11-12T19:54:13.360568Z"
}