{
  "id": "1ARK52B9pG",
  "url": "https://patriots.win/p/1ARK52B9pG/was-reliably-told-this-is-imposs/c",
  "content": "956 Was reliably told this is impossible posted 6 days ago by OrangeCatBad 20 comments award share report block Scott Jennings @ScottJenningsKY • 6d Was reliably told this is impossible. Right Angle News Network @Rightanglenews • 6d BREAKING - The mayor of Coldwater, Kansas, Jose Ceballos, has been revealed to be a foreign national who not only got elected while not being a citizen, but has also been voting in federal and state elections since at least 2022.\n20 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget JBlaze056 36 points 6 days ago They say \"impossible\" when they mean \"shut up and quit noticing\". permalink award report block reply snoopy3210 4 points 6 days ago This news seems like a plot to install digital ID. NBC news wants it desperately permalink parent award report block reply proud_semi_fascist 23 points 6 days ago Next do the 500K illegals that voted in NJ on Tuesday permalink award report block reply UltraMagaWA 21 points 6 days ago Deport and confiscate all money and assests permalink award report block reply YT45 7 points 6 days ago Shoot first, then deport. permalink parent award report block reply PenguinOfDoom 13 points 6 days ago I'll bet he was \"given\" a drivers license and registered to vote at the same time. permalink award report block reply TD_Covfefe_Crusader 3 points 6 days ago That's exactly what they do in Democrat states. permalink parent award report block reply QSWO1 3 points 6 days ago All you need in Texas to register to vote, and get a license is a drivers license from another state. Sup Abbott? permalink parent award report block reply MidnightDriver 8 points 6 days ago Anecdotal, ANECDOTAL!   Soursshhhh???? permalink award report block reply Smurfection 7 points 6 days ago Deport him.  Arrest and deport him.  Sorry but no, you can't elect an illegal immigrant invader to office and then pretend it is the \"will of the people\".   No.  Knock this shit off.  Arrest and deport him. permalink award report block reply BlueKentuckyGirl 5 points 6 days ago Our Congress better act and soon. Why do they act like we didn’t overwhelmingly vote to stop this insanity. permalink award report block reply Krat 5 points 6 days ago So hes in jail right now right permalink award report block reply PsychoDodo 4 points 6 days ago Go get him thn Mr Homan permalink award report block reply FusionBlack 4 points 6 days ago He is just one of many. permalink award report block reply PiratePatriot 4 points 6 days ago https://www.ag.ks.gov/Home/Components/News/News/231/1292 \"State law generally requires that candidates for elected city office must be a qualified elector, or eligible to vote, and be a resident of the city. However, cities have home rule power. It will be up to the city attorney to decide whether Ceballos is eligible to continue in his role as mayor.\" hell no.\nthis needs a constitutional check and amendment to force this issue to be cleaned up across USA. non citizens should not only be ineligible for any office (federal / state /  county) but also excluded from any form of employment direct or indirect via contractors. ie: all public expenditure must only go to contractors who can PROVE all their employees are citizens. permalink award report block reply Ligersrule1 2 points 6 days ago The thing that \"never\" happens, keeps happening permalink award report block reply 2025WhatIsTrue 2 points 6 days ago ARREST...DEPORT!!!! Enough pandering to these \"wandering\" criminals. permalink award report block reply Jimmyprawns 2 points 6 days ago If only I could go to Switzerland and pull that shit. permalink award report block reply PosterIsDead 1 points 6 days ago “Not significant enough to sway an election…” permalink award report block reply\nJBlaze056 36 points 6 days ago They say \"impossible\" when they mean \"shut up and quit noticing\". permalink award report block reply snoopy3210 4 points 6 days ago This news seems like a plot to install digital ID. NBC news wants it desperately permalink parent award report block reply\nsnoopy3210 4 points 6 days ago This news seems like a plot to install digital ID. NBC news wants it desperately permalink parent award report block reply\nproud_semi_fascist 23 points 6 days ago Next do the 500K illegals that voted in NJ on Tuesday permalink award report block reply\nUltraMagaWA 21 points 6 days ago Deport and confiscate all money and assests permalink award report block reply YT45 7 points 6 days ago Shoot first, then deport. permalink parent award report block reply\nYT45 7 points 6 days ago Shoot first, then deport. permalink parent award report block reply\nPenguinOfDoom 13 points 6 days ago I'll bet he was \"given\" a drivers license and registered to vote at the same time. permalink award report block reply TD_Covfefe_Crusader 3 points 6 days ago That's exactly what they do in Democrat states. permalink parent award report block reply QSWO1 3 points 6 days ago All you need in Texas to register to vote, and get a license is a drivers license from another state. Sup Abbott? permalink parent award report block reply\nTD_Covfefe_Crusader 3 points 6 days ago That's exactly what they do in Democrat states. permalink parent award report block reply QSWO1 3 points 6 days ago All you need in Texas to register to vote, and get a license is a drivers license from another state. Sup Abbott? permalink parent award report block reply\nQSWO1 3 points 6 days ago All you need in Texas to register to vote, and get a license is a drivers license from another state. Sup Abbott? permalink parent award report block reply\nMidnightDriver 8 points 6 days ago Anecdotal, ANECDOTAL!   Soursshhhh???? permalink award report block reply\nSmurfection 7 points 6 days ago Deport him.  Arrest and deport him.  Sorry but no, you can't elect an illegal immigrant invader to office and then pretend it is the \"will of the people\".   No.  Knock this shit off.  Arrest and deport him. permalink award report block reply\nBlueKentuckyGirl 5 points 6 days ago Our Congress better act and soon. Why do they act like we didn’t overwhelmingly vote to stop this insanity. permalink award report block reply\nKrat 5 points 6 days ago So hes in jail right now right permalink award report block reply\nPsychoDodo 4 points 6 days ago Go get him thn Mr Homan permalink award report block reply\nFusionBlack 4 points 6 days ago He is just one of many. permalink award report block reply\nPiratePatriot 4 points 6 days ago https://www.ag.ks.gov/Home/Components/News/News/231/1292 \"State law generally requires that candidates for elected city office must be a qualified elector, or eligible to vote, and be a resident of the city. However, cities have home rule power. It will be up to the city attorney to decide whether Ceballos is eligible to continue in his role as mayor.\" hell no.\nthis needs a constitutional check and amendment to force this issue to be cleaned up across USA. non citizens should not only be ineligible for any office (federal / state /  county) but also excluded from any form of employment direct or indirect via contractors. ie: all public expenditure must only go to contractors who can PROVE all their employees are citizens. permalink award report block reply\nLigersrule1 2 points 6 days ago The thing that \"never\" happens, keeps happening permalink award report block reply\n2025WhatIsTrue 2 points 6 days ago ARREST...DEPORT!!!! Enough pandering to these \"wandering\" criminals. permalink award report block reply\nJimmyprawns 2 points 6 days ago If only I could go to Switzerland and pull that shit. permalink award report block reply\nPosterIsDead 1 points 6 days ago “Not significant enough to sway an election…” permalink award report block reply",
  "fetched_at": "2025-11-12T23:16:27.508099Z"
}