{
  "id": "1ARK56kemd",
  "url": "https://patriots.win/p/1ARK56kemd/from-zerohedge-new-mexico-is-the/c",
  "content": "900 From Zerohedge: New Mexico Is The State Most Dependent On Food Stamps (www.zerohedge.com) posted 4 days ago by MrCuriousGuy513 83 comments award share report block New Mexico Is The State Most Dependent On Food Stamps ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero www.zerohedge.com\n83 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno QSWO1 60 points 4 days ago It's in the name. permalink award report block reply XxxRDTPRNxxX 21 points 4 days ago I've got nothing against Mexico.... Just MEXICANS! permalink parent award report block reply ModernKnight 24 points 4 days ago May as well be called \"Mexi-can'ts.\" permalink parent award report block reply QSWO1 7 points 4 days ago Same as long as they are in Mexico permalink parent award report block reply MixedBlacknWhite 5 points 4 days ago Illegal ones. The ones I know who live near me are business owners, good people, Catholics, family first and absolutely not woke. permalink parent award report block reply 3-10 3 points 4 days ago My two dearest friends are that way, except one is reformed and the other is non-denominational. That said, my brother’s entire family by marriage except is wife are lazy welfare leeching whores  most have kids and aren’t married because they get more than way. The guy just lives with them. The problem is they tell them when they come to check the house over like a week. The guys moves out for a week till it is done and then moves back in. One of them was a landscaper and her welfare meant they were making more than me as an E-5. permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Why aren't they in Mexico then? permalink parent award report block reply 3-10 9 points 4 days ago And the Indians too. Huge Indian population permalink parent award report block reply semsem 2 points 4 days ago Came here looking for a \"rez life\" mention. That's a big part of why Oklahoma is so damn high, too. Wait for OK to get brought up as a 'red state' that still uses so much SNAP. Bet all those tribal beneficiaries of social services and federal funding will be neglected in the summaries. permalink parent award report block reply HIGH___ENERGY 1 points 4 days ago kek permalink parent award report block reply HeatherSwanson 39 points 4 days ago By sheer number, not percentage, pure numbers, it's California by far. Cartel families need to eat permalink award report block reply MySidesGoUp 15 points 4 days ago The cartels in Cali are in Congress. They’re well fed. permalink parent award report block reply NomadicKrow2 5 points 4 days ago While whites might be the largest demographic, it's weird how all these percentages line up with the minority populations in several of these states. permalink parent award report block reply lucifer_fit_deus 23 points 4 days ago I’m assuming that’s American Indian population. I see Oklahoma is up there too. permalink award report block reply corporateshizer 15 points 4 days ago American Indians are really American Mexicans, not to be confused with Mexican Americans (who don't really exist). permalink parent award report block reply MastaJoda 10 points 4 days ago I was coming in here to say this. Lol Im an Okie. permalink parent award report block reply Sodak 4 points 4 days ago In SD 3 of the rez counties are like 50% probably close to like 70% of all the Indians. https://southdakotasearchlight.com/2025/11/06/three-nations-most-snap-dependent-counties-south-dakota-tribal-land-todd-oglala-lakota-ziebach/ permalink parent award report block reply JanOctSept 3 points 4 days ago Why do they need food stamps? Can’t they just commune with nature and hunt like their ancestorys? permalink parent award report block reply Yawnz13 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply Mamapedia 4 points 4 days ago I would like to see the racial breakdown for all states. permalink parent award report block reply ForceMultiplier 3 points 4 days ago Census data is public.  Also, this is one of the things wokepedia can probably be trusted on. I'm sure they're sourcing it from the census data. permalink parent award report block reply KilroyJCNJ 20 points 4 days ago I am shocked Jersey isn’t higher… permalink award report block reply MrCuriousGuy513 OP 13 points 4 days ago This is not based on the standard of living cost but based on how many people get that subsidy.\nIf we get information on standard of living cost, I can see that changing a lot.\nOverall, subsidies need to be stricter or end for most people.\nSide thought, State Congress and Governors need to be heavily scrutinized over this. permalink parent award report block reply QSWO1 7 points 4 days ago Abbott has praised Mexicans  for the texas economy. permalink parent award report block reply MrCuriousGuy513 OP 6 points 4 days ago I don’t know enough about Abbott but he’s always seem questionable to me, especially since 2020. permalink parent award report block reply QSWO1 8 points 4 days ago He could have backed the border wall with Trump in 2016, but he didn't. He missed reality in 2020, and he is still using wetbacks to bolster the economy in Texas. He's a POS. permalink parent award report block reply view 9 more comments... CmonGubMintGibMe 9 points 4 days ago Was thinking that as well. permalink parent award report block reply KarlHungus53 7 points 4 days ago We have a much different welfare program.\nGovernment employment. permalink parent award report block reply TrueTemper2 13 points 4 days ago California 5.5 million, probably illegals permalink award report block reply bigdickhangsright 9 points 4 days ago California 5.5 million, probably illegals permalink parent award report block reply Givesgunstogrannies 12 points 4 days ago I can hear Sam Kinison yelling \"MOVE TO WHERE THERE'S FOOD! YOU CANT EAT SAND!\" permalink award report block reply SPEDMan64 3 points 4 days ago And now they're all coming here. permalink parent award report block reply Iliterallylovejv 11 points 4 days ago I went to college with a girl from New Mexico. We worked together. We had the same pay. She was on food stamps. She used her money from work to go to the bars and order fast food. I was always so pissed about that. She’s now an immigration attorney and fights for the rights of illegals. I have a lot of poor thoughts that I think should happen to people like her. Mostly being kicked out of America. That shit shouldn’t belong here. permalink award report block reply RuleoVicus 2 points 4 days ago Damn. permalink parent award report block reply Desktop 8 points 4 days ago One of the highest crackhead and methhead populations per capita in the country… sadly. permalink award report block reply BusterHyman99 8 points 4 days ago All those Indian reservations. It's funny they can police themselves but can't feed themselves permalink award report block reply MayorMcSixaplix 3 points 4 days ago And “run” casinos. permalink parent award report block reply AlwaysTrumper2020 8 points 4 days ago NEW Mexico, just as shitty as OLD Mexico..... permalink award report block reply Caine 4 points 4 days ago In Old Mexico they get up and go to work. permalink parent award report block reply GoneViking 7 points 4 days ago Wyoming lowest, New Mexico highest. It's just Cowboys vs Indians. permalink award report block reply AwShitHereWeGoAgain 2 points 4 days ago Always has been. permalink parent award report block reply RuleoVicus 2 points 4 days ago 😅🤣 permalink parent award report block reply pickleball_jones 7 points 4 days ago Who would have guessed. That state is a shithole. I always fuel up in TX enough to get straight through without stopping. permalink award report block reply AmarilloArmadillo 7 points 4 days ago Yep, I avoid giving tax dollars to shitty states as much as I can permalink parent award report block reply FlyCatcher94 6 points 4 days ago It used to be ok in the 80’s but the dems got ahold of it and fucked it in the ass. permalink parent award report block reply Caine 6 points 4 days ago It's tragic because the scenery is beautiful, especially in the northern area. permalink parent award report block reply RejectRedditization 5 points 4 days ago Useless savages permalink award report block reply DJT_MFers1 5 points 4 days ago Not anymore! Hahhahahaha permalink award report block reply FrankDuncan 5 points 4 days ago B b b but muh blue states provide MORRRRE than red states... Ohhhhh... permalink award report block reply AR_MAGA 4 points 4 days ago Brown is the new Black. permalink award report block reply SeamusOtardy 4 points 4 days ago Look at NH…ME and VT double. MA TRIPLE!! Geez…I wonder why!? permalink award report block reply American-Patriot 4 points 4 days ago The fact that any state is above 5% is already an epic failure permalink award report block reply MrCuriousGuy513 OP 2 points 4 days ago Bingo. permalink parent award report block reply Givesgunstogrannies 3 points 4 days ago Shocked at how low MN is.  Good for Indiana permalink award report block reply rebuildingMyself 3 points 4 days ago New York is going to surge as the commie mayor promotes all the gibs other people are paying for permalink award report block reply Icepck 3 points 4 days ago Do another chat like this showing demographics/immigrants. I bet at least one of them overlaps quite well. permalink award report block reply CleanUpPhillyTrump24 3 points 4 days ago Guess what happens when the gibs is cut off in NM? It turns electorally into Oklahoma or Arkansas. permalink award report block reply cornpop_1988 3 points 4 days ago I know DC isn't a state, but what's their food stamp percentage? permalink award report block reply MrCuriousGuy513 OP 4 points 4 days ago That I don’t know but I asked ChatGPT this question:\nWhat’s the % of residents in Washington DC that receive Snap benefits and the total monthly amount? So with a grain of salt, ChatGPT answer: About 19.6% of DC’s population (~ 137,500 people) received SNAP benefits monthly in FY 2024. Site it link to: https://usafacts.org/answers/how-many-people-receive-snap-benefits-in-the-us-every-month/state/washington-dc/ permalink parent award report block reply cornpop_1988 4 points 4 days ago So technically DC is second in highest of food stamps in the nation. The swamp most likely gives it out to illegals. permalink parent award report block reply MrCuriousGuy513 OP 4 points 4 days ago Most likely, I would dare to say their future protest army.\nBut that’s just a dare. permalink parent award report block reply YodaBannon 3 points 4 days ago people mooch off the system, they look at their country as something to use permalink award report block reply Daveyclimber 3 points 4 days ago It's a sad state of affairs in NM permalink award report block reply Steve56775 2 points 4 days ago Also the number of illegals from south of the border. permalink award report block reply HockeyMom4Trump 2 points 4 days ago I live in the blue Minnesota. I am shocked my state is so low. For all you people looking to relocate, Minnesota truly is a hidden gem. Stay out of some areas of Minneapolis, but much of the state is fantastic. Parks. Recreation. Hiking. Hockey. Clean water. I had never heard of a boil order. Never had any issues with water. Lakes. Rivers. Stand up paddle boarding. Kayaking. I am never bored. And houses are cheap. And your neighbors leave you alone. permalink award report block reply DeplorableNeandertal 2 points 4 days ago Makes sense if you’ve ever been there. Crows are more numerous than pigeons there and they feast on trash so deduce from that what you will. permalink award report block reply Gunmolester 2 points 4 days ago LOTS of Indians there permalink award report block reply BruddahIz 2 points 4 days ago Turn the reservations into mini Hong Kong's - lets see what happens. permalink award report block reply JoinTheDiscussion 2 points 4 days ago Illegals!!! permalink award report block reply watersjeff026 2 points 4 days ago I live in NM and can confirm. Most people here are broke but somehow drive new cars and have like 10 kids permalink award report block reply Hikedelics 2 points 4 days ago I’m shocked MS isn’t much higher. Start whittling down the welfare state by setting a cap on the percentage of recipients, then throttle that back more and more every year. permalink award report block reply Rey_ 2 points 4 days ago Yeah it's sucks here, in my neighborhood it's definitely over 50% permalink award report block reply Wally1 2 points 4 days ago Those payments are another reason so many homeless are moving to Hawaii. They get more than double the average. permalink award report block reply 08G8GTsupercharged 2 points 4 days ago I see my state is the lowest percentage. Lol I'm somewhat surprised at that to be honest. permalink award report block reply 2016TrumpMAGA 1 points 4 days ago That's because of the huge indian (feather) population. permalink award report block reply TheGoyimWhisperer 5 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nQSWO1 60 points 4 days ago It's in the name. permalink award report block reply XxxRDTPRNxxX 21 points 4 days ago I've got nothing against Mexico.... Just MEXICANS! permalink parent award report block reply ModernKnight 24 points 4 days ago May as well be called \"Mexi-can'ts.\" permalink parent award report block reply QSWO1 7 points 4 days ago Same as long as they are in Mexico permalink parent award report block reply MixedBlacknWhite 5 points 4 days ago Illegal ones. The ones I know who live near me are business owners, good people, Catholics, family first and absolutely not woke. permalink parent award report block reply 3-10 3 points 4 days ago My two dearest friends are that way, except one is reformed and the other is non-denominational. That said, my brother’s entire family by marriage except is wife are lazy welfare leeching whores  most have kids and aren’t married because they get more than way. The guy just lives with them. The problem is they tell them when they come to check the house over like a week. The guys moves out for a week till it is done and then moves back in. One of them was a landscaper and her welfare meant they were making more than me as an E-5. permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Why aren't they in Mexico then? permalink parent award report block reply 3-10 9 points 4 days ago And the Indians too. Huge Indian population permalink parent award report block reply semsem 2 points 4 days ago Came here looking for a \"rez life\" mention. That's a big part of why Oklahoma is so damn high, too. Wait for OK to get brought up as a 'red state' that still uses so much SNAP. Bet all those tribal beneficiaries of social services and federal funding will be neglected in the summaries. permalink parent award report block reply HIGH___ENERGY 1 points 4 days ago kek permalink parent award report block reply\nXxxRDTPRNxxX 21 points 4 days ago I've got nothing against Mexico.... Just MEXICANS! permalink parent award report block reply ModernKnight 24 points 4 days ago May as well be called \"Mexi-can'ts.\" permalink parent award report block reply QSWO1 7 points 4 days ago Same as long as they are in Mexico permalink parent award report block reply MixedBlacknWhite 5 points 4 days ago Illegal ones. The ones I know who live near me are business owners, good people, Catholics, family first and absolutely not woke. permalink parent award report block reply 3-10 3 points 4 days ago My two dearest friends are that way, except one is reformed and the other is non-denominational. That said, my brother’s entire family by marriage except is wife are lazy welfare leeching whores  most have kids and aren’t married because they get more than way. The guy just lives with them. The problem is they tell them when they come to check the house over like a week. The guys moves out for a week till it is done and then moves back in. One of them was a landscaper and her welfare meant they were making more than me as an E-5. permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Why aren't they in Mexico then? permalink parent award report block reply\nModernKnight 24 points 4 days ago May as well be called \"Mexi-can'ts.\" permalink parent award report block reply\nQSWO1 7 points 4 days ago Same as long as they are in Mexico permalink parent award report block reply\nMixedBlacknWhite 5 points 4 days ago Illegal ones. The ones I know who live near me are business owners, good people, Catholics, family first and absolutely not woke. permalink parent award report block reply 3-10 3 points 4 days ago My two dearest friends are that way, except one is reformed and the other is non-denominational. That said, my brother’s entire family by marriage except is wife are lazy welfare leeching whores  most have kids and aren’t married because they get more than way. The guy just lives with them. The problem is they tell them when they come to check the house over like a week. The guys moves out for a week till it is done and then moves back in. One of them was a landscaper and her welfare meant they were making more than me as an E-5. permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Why aren't they in Mexico then? permalink parent award report block reply\n3-10 3 points 4 days ago My two dearest friends are that way, except one is reformed and the other is non-denominational. That said, my brother’s entire family by marriage except is wife are lazy welfare leeching whores  most have kids and aren’t married because they get more than way. The guy just lives with them. The problem is they tell them when they come to check the house over like a week. The guys moves out for a week till it is done and then moves back in. One of them was a landscaper and her welfare meant they were making more than me as an E-5. permalink parent award report block reply\nXxxRDTPRNxxX 1 points 4 days ago Why aren't they in Mexico then? permalink parent award report block reply\n3-10 9 points 4 days ago And the Indians too. Huge Indian population permalink parent award report block reply semsem 2 points 4 days ago Came here looking for a \"rez life\" mention. That's a big part of why Oklahoma is so damn high, too. Wait for OK to get brought up as a 'red state' that still uses so much SNAP. Bet all those tribal beneficiaries of social services and federal funding will be neglected in the summaries. permalink parent award report block reply\nsemsem 2 points 4 days ago Came here looking for a \"rez life\" mention. That's a big part of why Oklahoma is so damn high, too. Wait for OK to get brought up as a 'red state' that still uses so much SNAP. Bet all those tribal beneficiaries of social services and federal funding will be neglected in the summaries. permalink parent award report block reply\nHIGH___ENERGY 1 points 4 days ago kek permalink parent award report block reply\nHeatherSwanson 39 points 4 days ago By sheer number, not percentage, pure numbers, it's California by far. Cartel families need to eat permalink award report block reply MySidesGoUp 15 points 4 days ago The cartels in Cali are in Congress. They’re well fed. permalink parent award report block reply NomadicKrow2 5 points 4 days ago While whites might be the largest demographic, it's weird how all these percentages line up with the minority populations in several of these states. permalink parent award report block reply\nMySidesGoUp 15 points 4 days ago The cartels in Cali are in Congress. They’re well fed. permalink parent award report block reply\nNomadicKrow2 5 points 4 days ago While whites might be the largest demographic, it's weird how all these percentages line up with the minority populations in several of these states. permalink parent award report block reply\nlucifer_fit_deus 23 points 4 days ago I’m assuming that’s American Indian population. I see Oklahoma is up there too. permalink award report block reply corporateshizer 15 points 4 days ago American Indians are really American Mexicans, not to be confused with Mexican Americans (who don't really exist). permalink parent award report block reply MastaJoda 10 points 4 days ago I was coming in here to say this. Lol Im an Okie. permalink parent award report block reply Sodak 4 points 4 days ago In SD 3 of the rez counties are like 50% probably close to like 70% of all the Indians. https://southdakotasearchlight.com/2025/11/06/three-nations-most-snap-dependent-counties-south-dakota-tribal-land-todd-oglala-lakota-ziebach/ permalink parent award report block reply JanOctSept 3 points 4 days ago Why do they need food stamps? Can’t they just commune with nature and hunt like their ancestorys? permalink parent award report block reply Yawnz13 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply Mamapedia 4 points 4 days ago I would like to see the racial breakdown for all states. permalink parent award report block reply ForceMultiplier 3 points 4 days ago Census data is public.  Also, this is one of the things wokepedia can probably be trusted on. I'm sure they're sourcing it from the census data. permalink parent award report block reply\ncorporateshizer 15 points 4 days ago American Indians are really American Mexicans, not to be confused with Mexican Americans (who don't really exist). permalink parent award report block reply\nMastaJoda 10 points 4 days ago I was coming in here to say this. Lol Im an Okie. permalink parent award report block reply\nSodak 4 points 4 days ago In SD 3 of the rez counties are like 50% probably close to like 70% of all the Indians. https://southdakotasearchlight.com/2025/11/06/three-nations-most-snap-dependent-counties-south-dakota-tribal-land-todd-oglala-lakota-ziebach/ permalink parent award report block reply JanOctSept 3 points 4 days ago Why do they need food stamps? Can’t they just commune with nature and hunt like their ancestorys? permalink parent award report block reply Yawnz13 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nJanOctSept 3 points 4 days ago Why do they need food stamps? Can’t they just commune with nature and hunt like their ancestorys? permalink parent award report block reply Yawnz13 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nYawnz13 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nMamapedia 4 points 4 days ago I would like to see the racial breakdown for all states. permalink parent award report block reply ForceMultiplier 3 points 4 days ago Census data is public.  Also, this is one of the things wokepedia can probably be trusted on. I'm sure they're sourcing it from the census data. permalink parent award report block reply\nForceMultiplier 3 points 4 days ago Census data is public.  Also, this is one of the things wokepedia can probably be trusted on. I'm sure they're sourcing it from the census data. permalink parent award report block reply\nKilroyJCNJ 20 points 4 days ago I am shocked Jersey isn’t higher… permalink award report block reply MrCuriousGuy513 OP 13 points 4 days ago This is not based on the standard of living cost but based on how many people get that subsidy.\nIf we get information on standard of living cost, I can see that changing a lot.\nOverall, subsidies need to be stricter or end for most people.\nSide thought, State Congress and Governors need to be heavily scrutinized over this. permalink parent award report block reply QSWO1 7 points 4 days ago Abbott has praised Mexicans  for the texas economy. permalink parent award report block reply MrCuriousGuy513 OP 6 points 4 days ago I don’t know enough about Abbott but he’s always seem questionable to me, especially since 2020. permalink parent award report block reply QSWO1 8 points 4 days ago He could have backed the border wall with Trump in 2016, but he didn't. He missed reality in 2020, and he is still using wetbacks to bolster the economy in Texas. He's a POS. permalink parent award report block reply view 9 more comments... CmonGubMintGibMe 9 points 4 days ago Was thinking that as well. permalink parent award report block reply KarlHungus53 7 points 4 days ago We have a much different welfare program.\nGovernment employment. permalink parent award report block reply\nMrCuriousGuy513 OP 13 points 4 days ago This is not based on the standard of living cost but based on how many people get that subsidy.\nIf we get information on standard of living cost, I can see that changing a lot.\nOverall, subsidies need to be stricter or end for most people.\nSide thought, State Congress and Governors need to be heavily scrutinized over this. permalink parent award report block reply QSWO1 7 points 4 days ago Abbott has praised Mexicans  for the texas economy. permalink parent award report block reply MrCuriousGuy513 OP 6 points 4 days ago I don’t know enough about Abbott but he’s always seem questionable to me, especially since 2020. permalink parent award report block reply QSWO1 8 points 4 days ago He could have backed the border wall with Trump in 2016, but he didn't. He missed reality in 2020, and he is still using wetbacks to bolster the economy in Texas. He's a POS. permalink parent award report block reply view 9 more comments...\nQSWO1 7 points 4 days ago Abbott has praised Mexicans  for the texas economy. permalink parent award report block reply MrCuriousGuy513 OP 6 points 4 days ago I don’t know enough about Abbott but he’s always seem questionable to me, especially since 2020. permalink parent award report block reply QSWO1 8 points 4 days ago He could have backed the border wall with Trump in 2016, but he didn't. He missed reality in 2020, and he is still using wetbacks to bolster the economy in Texas. He's a POS. permalink parent award report block reply view 9 more comments...\nMrCuriousGuy513 OP 6 points 4 days ago I don’t know enough about Abbott but he’s always seem questionable to me, especially since 2020. permalink parent award report block reply QSWO1 8 points 4 days ago He could have backed the border wall with Trump in 2016, but he didn't. He missed reality in 2020, and he is still using wetbacks to bolster the economy in Texas. He's a POS. permalink parent award report block reply view 9 more comments...\nQSWO1 8 points 4 days ago He could have backed the border wall with Trump in 2016, but he didn't. He missed reality in 2020, and he is still using wetbacks to bolster the economy in Texas. He's a POS. permalink parent award report block reply view 9 more comments...\nCmonGubMintGibMe 9 points 4 days ago Was thinking that as well. permalink parent award report block reply\nKarlHungus53 7 points 4 days ago We have a much different welfare program.\nGovernment employment. permalink parent award report block reply\nTrueTemper2 13 points 4 days ago California 5.5 million, probably illegals permalink award report block reply bigdickhangsright 9 points 4 days ago California 5.5 million, probably illegals permalink parent award report block reply\nbigdickhangsright 9 points 4 days ago California 5.5 million, probably illegals permalink parent award report block reply\nGivesgunstogrannies 12 points 4 days ago I can hear Sam Kinison yelling \"MOVE TO WHERE THERE'S FOOD! YOU CANT EAT SAND!\" permalink award report block reply SPEDMan64 3 points 4 days ago And now they're all coming here. permalink parent award report block reply\nSPEDMan64 3 points 4 days ago And now they're all coming here. permalink parent award report block reply\nIliterallylovejv 11 points 4 days ago I went to college with a girl from New Mexico. We worked together. We had the same pay. She was on food stamps. She used her money from work to go to the bars and order fast food. I was always so pissed about that. She’s now an immigration attorney and fights for the rights of illegals. I have a lot of poor thoughts that I think should happen to people like her. Mostly being kicked out of America. That shit shouldn’t belong here. permalink award report block reply RuleoVicus 2 points 4 days ago Damn. permalink parent award report block reply\nRuleoVicus 2 points 4 days ago Damn. permalink parent award report block reply\nDesktop 8 points 4 days ago One of the highest crackhead and methhead populations per capita in the country… sadly. permalink award report block reply\nBusterHyman99 8 points 4 days ago All those Indian reservations. It's funny they can police themselves but can't feed themselves permalink award report block reply MayorMcSixaplix 3 points 4 days ago And “run” casinos. permalink parent award report block reply\nMayorMcSixaplix 3 points 4 days ago And “run” casinos. permalink parent award report block reply\nAlwaysTrumper2020 8 points 4 days ago NEW Mexico, just as shitty as OLD Mexico..... permalink award report block reply Caine 4 points 4 days ago In Old Mexico they get up and go to work. permalink parent award report block reply\nCaine 4 points 4 days ago In Old Mexico they get up and go to work. permalink parent award report block reply\nGoneViking 7 points 4 days ago Wyoming lowest, New Mexico highest. It's just Cowboys vs Indians. permalink award report block reply AwShitHereWeGoAgain 2 points 4 days ago Always has been. permalink parent award report block reply RuleoVicus 2 points 4 days ago 😅🤣 permalink parent award report block reply\nAwShitHereWeGoAgain 2 points 4 days ago Always has been. permalink parent award report block reply\nRuleoVicus 2 points 4 days ago 😅🤣 permalink parent award report block reply\npickleball_jones 7 points 4 days ago Who would have guessed. That state is a shithole. I always fuel up in TX enough to get straight through without stopping. permalink award report block reply AmarilloArmadillo 7 points 4 days ago Yep, I avoid giving tax dollars to shitty states as much as I can permalink parent award report block reply FlyCatcher94 6 points 4 days ago It used to be ok in the 80’s but the dems got ahold of it and fucked it in the ass. permalink parent award report block reply Caine 6 points 4 days ago It's tragic because the scenery is beautiful, especially in the northern area. permalink parent award report block reply\nAmarilloArmadillo 7 points 4 days ago Yep, I avoid giving tax dollars to shitty states as much as I can permalink parent award report block reply\nFlyCatcher94 6 points 4 days ago It used to be ok in the 80’s but the dems got ahold of it and fucked it in the ass. permalink parent award report block reply\nCaine 6 points 4 days ago It's tragic because the scenery is beautiful, especially in the northern area. permalink parent award report block reply\nRejectRedditization 5 points 4 days ago Useless savages permalink award report block reply\nDJT_MFers1 5 points 4 days ago Not anymore! Hahhahahaha permalink award report block reply\nFrankDuncan 5 points 4 days ago B b b but muh blue states provide MORRRRE than red states... Ohhhhh... permalink award report block reply\nAR_MAGA 4 points 4 days ago Brown is the new Black. permalink award report block reply\nSeamusOtardy 4 points 4 days ago Look at NH…ME and VT double. MA TRIPLE!! Geez…I wonder why!? permalink award report block reply\nAmerican-Patriot 4 points 4 days ago The fact that any state is above 5% is already an epic failure permalink award report block reply MrCuriousGuy513 OP 2 points 4 days ago Bingo. permalink parent award report block reply\nMrCuriousGuy513 OP 2 points 4 days ago Bingo. permalink parent award report block reply\nGivesgunstogrannies 3 points 4 days ago Shocked at how low MN is.  Good for Indiana permalink award report block reply\nrebuildingMyself 3 points 4 days ago New York is going to surge as the commie mayor promotes all the gibs other people are paying for permalink award report block reply\nIcepck 3 points 4 days ago Do another chat like this showing demographics/immigrants. I bet at least one of them overlaps quite well. permalink award report block reply\nCleanUpPhillyTrump24 3 points 4 days ago Guess what happens when the gibs is cut off in NM? It turns electorally into Oklahoma or Arkansas. permalink award report block reply\ncornpop_1988 3 points 4 days ago I know DC isn't a state, but what's their food stamp percentage? permalink award report block reply MrCuriousGuy513 OP 4 points 4 days ago That I don’t know but I asked ChatGPT this question:\nWhat’s the % of residents in Washington DC that receive Snap benefits and the total monthly amount? So with a grain of salt, ChatGPT answer: About 19.6% of DC’s population (~ 137,500 people) received SNAP benefits monthly in FY 2024. Site it link to: https://usafacts.org/answers/how-many-people-receive-snap-benefits-in-the-us-every-month/state/washington-dc/ permalink parent award report block reply cornpop_1988 4 points 4 days ago So technically DC is second in highest of food stamps in the nation. The swamp most likely gives it out to illegals. permalink parent award report block reply MrCuriousGuy513 OP 4 points 4 days ago Most likely, I would dare to say their future protest army.\nBut that’s just a dare. permalink parent award report block reply\nMrCuriousGuy513 OP 4 points 4 days ago That I don’t know but I asked ChatGPT this question:\nWhat’s the % of residents in Washington DC that receive Snap benefits and the total monthly amount? So with a grain of salt, ChatGPT answer: About 19.6% of DC’s population (~ 137,500 people) received SNAP benefits monthly in FY 2024. Site it link to: https://usafacts.org/answers/how-many-people-receive-snap-benefits-in-the-us-every-month/state/washington-dc/ permalink parent award report block reply cornpop_1988 4 points 4 days ago So technically DC is second in highest of food stamps in the nation. The swamp most likely gives it out to illegals. permalink parent award report block reply MrCuriousGuy513 OP 4 points 4 days ago Most likely, I would dare to say their future protest army.\nBut that’s just a dare. permalink parent award report block reply\ncornpop_1988 4 points 4 days ago So technically DC is second in highest of food stamps in the nation. The swamp most likely gives it out to illegals. permalink parent award report block reply MrCuriousGuy513 OP 4 points 4 days ago Most likely, I would dare to say their future protest army.\nBut that’s just a dare. permalink parent award report block reply\nMrCuriousGuy513 OP 4 points 4 days ago Most likely, I would dare to say their future protest army.\nBut that’s just a dare. permalink parent award report block reply\nYodaBannon 3 points 4 days ago people mooch off the system, they look at their country as something to use permalink award report block reply\nDaveyclimber 3 points 4 days ago It's a sad state of affairs in NM permalink award report block reply\nSteve56775 2 points 4 days ago Also the number of illegals from south of the border. permalink award report block reply\nHockeyMom4Trump 2 points 4 days ago I live in the blue Minnesota. I am shocked my state is so low. For all you people looking to relocate, Minnesota truly is a hidden gem. Stay out of some areas of Minneapolis, but much of the state is fantastic. Parks. Recreation. Hiking. Hockey. Clean water. I had never heard of a boil order. Never had any issues with water. Lakes. Rivers. Stand up paddle boarding. Kayaking. I am never bored. And houses are cheap. And your neighbors leave you alone. permalink award report block reply\nDeplorableNeandertal 2 points 4 days ago Makes sense if you’ve ever been there. Crows are more numerous than pigeons there and they feast on trash so deduce from that what you will. permalink award report block reply\nGunmolester 2 points 4 days ago LOTS of Indians there permalink award report block reply\nBruddahIz 2 points 4 days ago Turn the reservations into mini Hong Kong's - lets see what happens. permalink award report block reply\nJoinTheDiscussion 2 points 4 days ago Illegals!!! permalink award report block reply\nwatersjeff026 2 points 4 days ago I live in NM and can confirm. Most people here are broke but somehow drive new cars and have like 10 kids permalink award report block reply\nHikedelics 2 points 4 days ago I’m shocked MS isn’t much higher. Start whittling down the welfare state by setting a cap on the percentage of recipients, then throttle that back more and more every year. permalink award report block reply\nRey_ 2 points 4 days ago Yeah it's sucks here, in my neighborhood it's definitely over 50% permalink award report block reply\nWally1 2 points 4 days ago Those payments are another reason so many homeless are moving to Hawaii. They get more than double the average. permalink award report block reply\n08G8GTsupercharged 2 points 4 days ago I see my state is the lowest percentage. Lol I'm somewhat surprised at that to be honest. permalink award report block reply\n2016TrumpMAGA 1 points 4 days ago That's because of the huge indian (feather) population. permalink award report block reply\nTheGoyimWhisperer 5 points 4 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:19.877813Z"
}