{
  "id": "1ARK9nPMPd",
  "url": "https://patriots.win/p/1ARK9nPMPd/every-single-day-we-get-inundate/c",
  "content": "52 Every single day we get inundated with far left propaganda but the left absolutely freaks out when they have to hear MAGA posted 5 hours ago by MasterChief08 5 comments award share report block I used to remain quiet about my politics in situations where it used to be deemed inappropriate but I'm done doing that. The left doesn't. So now I bring up my politics whenever I want. I encourage others to do the same. Record when leftist colleagues bring up politics and then do the same. I've purposely recorded colleagues when they said some rather discriminatory things about white men and Christians just so I can weaponize it against these demons. I have screenshots of 2 people mocking Kirk being murdered and next week before the holidays I'm going to share them with Hr and complain that I don't feel safe. I really want to get these 2 fired right before Thanksgiving and the holidays. I'm done having to put up listening to far left propaganda every single day. I won't be specific, but for my job we get extra pay during these 2 months. I've purposely held onto these conversations so that I could drop them when being fired would do the most damage.\n5 comments Sort by Top Top New Worst Old Save TiggerLovingPooh 4 points 5 hours ago That's right. The culture war just went hot. permalink award report block reply CleanUpPhillyTrump24 1 points 2 hours ago I entirely endorse this course of action. Like an addict, a Democrat has to hit rock bottom. Rock bottom is lower than anything anyone MAGA or otherwise remotely normal can imagine. Rock bottom is when the dysfunctional thinker finally allows themselves a verboten thought, such as, \"Hey, this concept I live by is not really working as advertised. Maybe there are some things I don't know that I need to learn.\" Then they start to accept that their TV/TikTok opinions are shit-level retard-tier, and that most of America if not the world are Christian nationalist patriots who want and have families. The demonization of MAGA is only cured with accountability for the Demmocrats' hypocrisy and crimes/criminal endorsements. permalink award report block reply Crucible -2 points 5 hours ago Your binary brain has you trapped in a left / right tribal paradigm. You're getting fucked by both sides. permalink award report block reply CleanUpPhillyTrump24 1 points 2 hours ago RINOs are uniparty enemies, not MAGA. Don't get it twisted, sister. permalink parent award report block reply TiggerLovingPooh 1 points 5 hours ago Don't really see how that applies to this post. permalink parent award report block reply\nTiggerLovingPooh 4 points 5 hours ago That's right. The culture war just went hot. permalink award report block reply\nCleanUpPhillyTrump24 1 points 2 hours ago I entirely endorse this course of action. Like an addict, a Democrat has to hit rock bottom. Rock bottom is lower than anything anyone MAGA or otherwise remotely normal can imagine. Rock bottom is when the dysfunctional thinker finally allows themselves a verboten thought, such as, \"Hey, this concept I live by is not really working as advertised. Maybe there are some things I don't know that I need to learn.\" Then they start to accept that their TV/TikTok opinions are shit-level retard-tier, and that most of America if not the world are Christian nationalist patriots who want and have families. The demonization of MAGA is only cured with accountability for the Demmocrats' hypocrisy and crimes/criminal endorsements. permalink award report block reply\nCrucible -2 points 5 hours ago Your binary brain has you trapped in a left / right tribal paradigm. You're getting fucked by both sides. permalink award report block reply CleanUpPhillyTrump24 1 points 2 hours ago RINOs are uniparty enemies, not MAGA. Don't get it twisted, sister. permalink parent award report block reply TiggerLovingPooh 1 points 5 hours ago Don't really see how that applies to this post. permalink parent award report block reply\nCleanUpPhillyTrump24 1 points 2 hours ago RINOs are uniparty enemies, not MAGA. Don't get it twisted, sister. permalink parent award report block reply\nTiggerLovingPooh 1 points 5 hours ago Don't really see how that applies to this post. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:15:21.582072Z"
}