{
  "id": "1ARK52B9xX",
  "url": "https://patriots.win/p/1ARK52B9xX/this-fucking-stud-is-the-greates/c",
  "content": "248 This fucking stud is the greatest President of my lifetime. No amount of shilling or astroturfing will make me not like him. Faggots can go to Hell. GEOTUS posted 6 days ago by Girthquakes 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style RaginJake379 16 points 6 days ago A fight is not a pleasant event. You get punched, you bleed, you get exhausted. But the only reason we're still in the fight is because of TRUMP permalink award report block reply AR_MAGA 7 points 6 days ago You get shot too, like it happened to him. And a lot of turbo faggots here forgot about it. permalink parent award report block reply OnlyTrump20 9 points 6 days ago I'm old enough to remember when people kept saying that a successful businessman is the perfect choice for president.  And Trump was very popular as a celebrity businessman.  Democrats are just liars all the fucking time.   Now it turns out they are all communists as well and are following a very old and outdated communist handbook that says to call all your opponents nazis and fascists.   And they keep following that like a bunch of retards, naturally, because only retards vote Dem these days. permalink award report block reply sixfingerdildo 3 points 6 days ago democraps are squishy fucks that lie whenever it suits them. that's why islam works for them, liars both. democrap voters are a special breed of stupid. as a young adult, you should at worst be an independent, unaffiliated voter open to boths of the argument. the young and stupid should just not be allowed to vote. permalink parent award report block reply oldmagadude 5 points 6 days ago This is true, can attest. permalink award report block reply MAGANatsFan 5 points 6 days ago 100% permalink award report block reply Wozzing 2 points 6 days ago Here here permalink award report block reply LostElf 2 points 6 days ago Amen. permalink award report block reply TheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nRaginJake379 16 points 6 days ago A fight is not a pleasant event. You get punched, you bleed, you get exhausted. But the only reason we're still in the fight is because of TRUMP permalink award report block reply AR_MAGA 7 points 6 days ago You get shot too, like it happened to him. And a lot of turbo faggots here forgot about it. permalink parent award report block reply\nAR_MAGA 7 points 6 days ago You get shot too, like it happened to him. And a lot of turbo faggots here forgot about it. permalink parent award report block reply\nOnlyTrump20 9 points 6 days ago I'm old enough to remember when people kept saying that a successful businessman is the perfect choice for president.  And Trump was very popular as a celebrity businessman.  Democrats are just liars all the fucking time.   Now it turns out they are all communists as well and are following a very old and outdated communist handbook that says to call all your opponents nazis and fascists.   And they keep following that like a bunch of retards, naturally, because only retards vote Dem these days. permalink award report block reply sixfingerdildo 3 points 6 days ago democraps are squishy fucks that lie whenever it suits them. that's why islam works for them, liars both. democrap voters are a special breed of stupid. as a young adult, you should at worst be an independent, unaffiliated voter open to boths of the argument. the young and stupid should just not be allowed to vote. permalink parent award report block reply\nsixfingerdildo 3 points 6 days ago democraps are squishy fucks that lie whenever it suits them. that's why islam works for them, liars both. democrap voters are a special breed of stupid. as a young adult, you should at worst be an independent, unaffiliated voter open to boths of the argument. the young and stupid should just not be allowed to vote. permalink parent award report block reply\noldmagadude 5 points 6 days ago This is true, can attest. permalink award report block reply\nMAGANatsFan 5 points 6 days ago 100% permalink award report block reply\nWozzing 2 points 6 days ago Here here permalink award report block reply\nLostElf 2 points 6 days ago Amen. permalink award report block reply\nTheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:04:37.962748Z"
}