{
  "id": "1ARK5A7v0A",
  "url": "https://patriots.win/p/1ARK5A7v0A/they-dont-get-it-at-all/c",
  "content": "792 They don't get it at all. posted 3 days ago by CyanScales 108 comments award share report block Reddit Lies @reddit_lies • 3d They don't get it at all.\n108 comments Sort by Top Top New Worst Old Save CyanScales OP 125 points 3 days ago Heatmaps indicating highest moral allocation by ideology, Moral circle rings, from inner to outer, are described as follows: (1) all of your immediate family, (2) all of your extended family, (3) all of your closest friends, (4) all of your friends (including distant ones), (5) all of your acquaintances, (6) all people you have ever met, (7) all people in your country, (8) all people on your continent, (9) all people on all continents, (10) all mammals, (11) all amphibians, reptiles, mammals, fish, and birds, (12) all animals on earth including paramecia and amoebae, (13) all animals in the universe, including alien lifeforms, (14) all living things in the universe including plants and trees, (15) all natural things in the universe including inert entities such as rocks, (16) all things in existence https://www.researchgate.net/figure/Heatmaps-indicating-highest-moral-allocation-by-ideology-Study-3a-Source-data-are_fig6_336076674 Given this pattern, it is possible conservatives may identify more with aspects of their life that they believe contribute to a more localized community and therefore seek out political behaviors with more localized impact. permalink award report block reply slimcoat 60 points 3 days ago Thank you for the explanation! It really does come down to values. Conservatives tend to value family and localities, whereas liberals value whatever brings them the most pleasure in that moment... permalink parent award report block reply ubit 11 points 3 days ago The studies were surveys. Conservatives thought about it and answered honestly. Libs just picked the bigger collection as more important. permalink parent award report block reply glasses2020 2 points 3 days ago This was the prompt: In this section, we would like to think about your capacity to help, to give, to be charitable, to show empathy, and to be generous—in other words, your capacity to behave morally. We can think about people having different amounts of moral units—like currency—that they can spend on others and can allocate to different moral circles. Some people devote all of their moral units to one circle whereas others try to divide up their moral units amongst multiple circles. Again, by moral circle, we mean the circle of people or other entities in which you are concerned about right and wrong done toward them. permalink parent award report block reply Standingoak 9 points 3 days ago ...whereas liberals value whatever brings them the most... respect that they haven't earned for themselves ... in that moment... and cash permalink parent award report block reply TwoArizonaPedes 6 points 3 days ago Bingo. permalink parent award report block reply BloodElfSupporter 4 points 3 days ago A pattern I’ve noticed is that a lot of liberals (not all) have pretty broken families. Many resent their parents or siblings or just cut ties with them. Many also resent that they were raised in “conservative, religious” families and they had become the opposite of what they were raised on as a form of rebellion. This is my personal observation. By no means does it serve as a metric. permalink parent award report block reply 2020Gop 4 points 3 days ago Liberals love killing babies permalink parent award report block reply AppalachianTactical 3 points 3 days ago Well alot of it is performative, bur they have likely manipulated their own beliefs to the point where they get to suffer the consequences whether they have real outgroup pref or just performative. Performative still puts them in dangerous places and situations more often. permalink parent award report block reply RuprechtThaMonkeyBoy 38 points 3 days ago (15) all natural things in the universe including inert entities such as rocks. This confirms why the vast majority of lefties are as dumb as rocks. permalink parent award report block reply CyanScales OP 15 points 3 days ago It just circles back to (1) immediate family, permalink parent award report block reply megalomania 8 points 3 days ago We must protect the rocks from Trump's fascism! Trillions of grains of sand are deported from US shores every day by Trump's ICE gestapo! Donate to the Democrat party to study this important science. What effort has Trump made to represent LGBTQAP trans rocks representation? Stop Trump's persecution of undocumented and unhoused trans youth rocks now! permalink parent award report block reply Kraken_V_Algorithm 1 points 3 days ago That might actually put them in the first ring, immediate family.  Or self if there is a ring zero. permalink parent award report block reply okboomer59 7 points 3 days ago Oikophobia, the displacement of normal, healthy love of family and community with hatred of one's own culture, society and race, and a perverse passion for their destruction permalink parent award report block reply Decepticons-superior 4 points 3 days ago I don’t see where my love of dogs falls on this chart.  They aren’t just “mammals.” And immediate family doesn’t really count either because I love dogs beyond the two I have. permalink parent award report block reply current_horror 10 points 3 days ago You are one of the people that this meme is targeting lol permalink parent award report block reply Decepticons-superior 8 points 3 days ago Maybe. But as Mark Twain once said, heaven goes by favor. If it went by merit, you would stay out and your dog would go in. permalink parent award report block reply HOSEQ 1 points 3 days ago I could exist happily, knowing my Dogs and Horses made it into heaven, even if I didn't.... I am not bothered by that thought, as long as I'm not in Hell, I don't need to go to Heaven, I know God and Jesus Exist, and am all the better for it.... permalink parent award report block reply CyanScales OP 1 points 3 days ago I get it, blood of the covenant is thicker than water of the womb. Those you choose over those you were born with. But all of that comes before random plants and animals. permalink parent award report block reply Norwegianskier 3 points 3 days ago Dogs dude... They are special. There are dogs that I believe are more valuable than humans. permalink parent award report block reply TwoArizonaPedes 7 points 3 days ago Dogs are family. permalink parent award report block reply Rope_Tree_Journalist 4 points 3 days ago Thanks! So now I understand the heat map part which I would never have guessed, but I live under a rock apparently, and I don't know what the fuck the rest of the meme is. I'm told that's Sydney \"great jeans\" Sweeney in the bottom half but I don't watch TV so I'm taking that on faith. permalink parent award report block reply CyanScales OP 7 points 3 days ago The interviewer in a round about way asked Sydney to disavow Trump's positive tweet to her, and Sydney ignored the premise. permalink parent award report block reply load 11 more comments... HillarysFUPA 38 points 3 days ago Dumbass here... I don't get it either... I have some guesses that are probably all wrong. permalink award report block reply kestral 46 points 3 days ago The heatmaps are from a real 2012 study on \"moral circles\" by psychologists Peter Singer and others. The graph is a polar-area plot where the circles represent \"rings of relational distance\" from the self (inner rings = immediate family/close friends; outer rings = distant strangers, all humans, animals, or even the environment). Participants rated how much they care if harm happens to people/groups at each distance. Heat intensity (red/yellow = high concern; blue/green = low) shows where empathy peaks. Key findings were: on average, Conservatives' concern drops off sharply after close kin/nation (inner 4-5 rings), focusing empathy narrowly (e.g., \"my family first\"). Liberals' primary concern extends farther out (to ring 10+ like \"all people\" or global issues). permalink parent award report block reply SickOfNeoPolitics 38 points 3 days ago The reach of the areas is not the concern so much as where the focus is. Liberals literally care more about rocks and trees than their own families. Fundamentally mindbroken people. permalink parent award report block reply bigdickhangsright 16 points 3 days ago I'd posit that they don't care about anything other than controlling what others think. And they're a bunch of lazy asses so if you combine these you will see why they become actors, professors, teachers, etc. permalink parent award report block reply kestral 4 points 3 days ago Nothing matters to them except what they think they're supposed to say matters permalink parent award report block reply HillarysFUPA 2 points 3 days ago That's why they abandon people who don't think like them and only try to associate with like-minded people .. the like-minded are already under control, so they can try to focus on others they don't have control of yet. permalink parent award report block reply DatabaseCentrals 6 points 3 days ago The thing is they would always be chasing something they'll never see. If they became close to the people far off then they would stop caring about them due to the pattern. It means they care about nothing other than themselves and want the worst for those directly around them. permalink parent award report block reply SickOfNeoPolitics 2 points 3 days ago The outer rings do not represent people. Hell, anything past ring 9 isn't even mammals. permalink parent award report block reply learntocode 2 points 3 days ago This is EXACTLY what happens. They can often be disabused by travelling and living as a local with all their precious foreigners. permalink parent award report block reply HillarysFUPA 7 points 3 days ago À+ response. I didn't even know what to look for to find out what this was about. permalink parent award report block reply MAGABOND 2 points 3 days ago I truly give zero fucks about some goatfucker’s kid in any Muslim area. I would rather die than have my kid seriously hurt. Not a hard concept. permalink parent award report block reply glasses2020 2 points 3 days ago An important note is that they only had 100 \"moral units\" to allocate to the circles. permalink parent award report block reply Piglips 0 points 3 days ago Pseudo-science. Now do phrenology, engrams, palm-reading, corprlite-reading, astrology, chicken feet and engrams. permalink parent award report block reply Moose_Antlers 2 points 3 days ago It's normal to care about those closest to you first. Liberals tend to have wildly dysfunctional relationships with those people so they align themselves with larger and wider groups. If you've heard the expression in-group preference or out-group preference, the normal human has an in-group preference. We're biologically hardwired, it is instinctual, for us to prefer and maintain high loyalty to those who are most like us: family, extended family, local community, etc. That's in-group preference. Liberals reject all of those things and prefer the other. They specifically prefer people and objects that are different or abnormal or unfamiliar. Its why liberal white women fetishize black and brown people and hate white men. Out-group preference. This heatmap should look like a dart board or a bullseye in a normal person, focused around the center. Sweeney's does. That's normal. The Leftist's looks like a comet, wildly off-center and facing away from the center. That's this out-group preference visualized. permalink parent award report block reply Viewer01 28 points 3 days ago You got a shit ton of con inc boomers falling into the top category. Historians are going to debate forever on a generation so wealthy but seemingly hated their children. permalink award report block reply TNfootDoc 13 points 3 days ago Probs 50/50. Conservative boomers I think are more likely to help their family than liberal boomers. At least in my experience. permalink parent award report block reply lul_cheto 2 points 3 days ago , I guess his family sucks like mine does, who are greedy and poor. But my wife's family works hard, has tons of money, and helps everyone, even putting a down payment for a newlyweds house they knew from church. permalink parent award report block reply heavyD 6 points 3 days ago Not all children, just children like you that blamed them for your fck ups. permalink parent award report block reply Iremembermypassword 9 points 3 days ago Our society used to have Elders, now we only have the Elderly. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago And spinsters. Spinsters used to have a functional, constructive role in families and society, now they're just written off as wine-box-cat-ladies. permalink parent award report block reply TNfootDoc 6 points 3 days ago Nah. A lot of boomers in general are greedy and hoarding well to blow it on a nursing home. Allowed mortgages and tuition to become insanely expensive while they watch their children get fucked. permalink parent award report block reply newestofnew 5 points 3 days ago they don't care, they've already recessed to childish insults, best thing is let it collapse around them denying them any peace when they need it most in their twilight permalink parent award report block reply nmipede 3 points 3 days ago Aww. Did Grandpa call you a retard the last time you had an idea? permalink parent award report block reply view 7 more comments... learntocode 1 points 3 days ago Mom? Is that you? permalink parent award report block reply daty_dato 5 points 3 days ago yeah they should die out early so their kids get the money. Right? permalink parent award report block reply newestofnew 2 points 3 days ago nah no one wants their money they should spend it all on Chinese crap they care about so much or 300k on some medicine to give them 6 more weeks alive in a hospital what we want is for them to sell some of the millions of second or third homes they hold off market and out of use permalink parent award report block reply view 1 more comments... learntocode -1 points 3 days ago Money is their God. permalink parent award report block reply view 1 more comments... ianpatrick1966 2 points 3 days ago Exactly. permalink parent award report block reply Viewer01 1 points 3 days ago lol. Case in point. Irrational dickhead that takes zero accountability for the last 35 years of politics. My family was extremely gracious in my younger years and this has helped me get into the top 5-10% of incomes and net worths by age. I do however look at others my age who could have gotten this help but did not. These are the odious sort I refer to and they are deserving of the freshest h1b Indian drs and Jamal at the nursing homes. permalink parent award report block reply heavyD 1 points 3 days ago So you are saying you wouldn't have shit if they hadn't have given you some of what They earned? Case in point LOL Irrational little richard cranium that never had enough balls to stand on it's own 2 feet and would have failed without mommy and daddy's extended basement. permalink parent award report block reply Bldg_2019 4 points 3 days ago Still screaming at your grandparents, eh? Zillennials are pathetic. There’s a reason nobody left you shit. It isn’t random. You put on your big girl pants yet and get your own cell phone plan or nah? permalink parent award report block reply Viewer01 0 points 3 days ago I hope you get a h1b dr and your kids never come to visit. permalink parent award report block reply Bldg_2019 4 points 3 days ago So still on your parents’ cell phone plan. Got it. They charging you rent? The big secret you and people like you miss is that being a big fat zero in life is about YOU, not “them”. They gave you everything you have. Loser. permalink parent award report block reply Viewer01 0 points 3 days ago I own five houses lmao. That’s why I’m saying this. My folks were gracious and relatively I’m thriving. Whereas I look at my cohorts and see them being told to bootstrap in an unfair system by malicious boomers. It’s funny watching the boomers melt down because they know they were shitty parents. permalink parent award report block reply view 3 more comments... heavyD 1 points 3 days ago Your parents would probably enjoy the indians more than you. permalink parent award report block reply Moose_Antlers 2 points 3 days ago That generation didn't hate their children. They hated their parents and resolved to be radically different from them when they themselves became parents. They rejected the values their parents had instead of passing them on. Instead, they were hyper-permissive and indulgent of their children, failed to lay down moral boundaries and normal discipline, taught \"tolerance\" and \"acceptance\" that they'd learned in their 60s-era rights protests. They taught their kids communist values and rejected traditional morality. That's where a lot of the issues post-boomer comes from. Obviously, it's not all boomers. It's heavily driven by the hippie types. But that's the origin. This generation hated their WW2-era parents who had literally lived through hell (Great Depression + world war) and tried to pass on those lessons during a time of absolute economic plenitude. The kids couldn't understand, and were often downrage of repressed anger/rage/PTSD. The kids (boomers) hated their parents, not their children. permalink parent award report block reply drattastic1 2 points 3 days ago How crybabies turn this into a gen-war is beyond me. This is about MAGA vs the commies at any age. The amount of whining is pathetic. permalink parent award report block reply Viewer01 0 points 3 days ago I wish many dr pajeet and Jamal’s in the nursing home. permalink parent award report block reply current_horror -1 points 3 days ago Boomers are the worst generation in history. Stay mad, pass soon. :) permalink parent award report block reply 1DontTreadOnMe1 13 points 3 days ago Suicidal empathy vs ingroup preference, of course they don't get it. permalink award report block reply DoMagnum 10 points 3 days ago Since no one was cringeing, the lib-whore interviewer needed to demonstrate it for the rest of the class. Fail. permalink award report block reply Filo76 4 points 3 days ago I’ve never seen a more condescending looking interviewer. She’s a perfect fit for lord farquad from Shrek. permalink parent award report block reply DoMagnum 2 points 3 days ago The essence of progressive feminists. Superior, Mocking, Scornful. permalink parent award report block reply The_Emperor 1 points 3 days ago Wtf interview Is this?!  Gandalf meme. Ok,I had to go to KYM and look up..and eventually found Sidney Sweeney GQ interview.  Thanks internet! permalink parent award report block reply rocco_saint 7 points 3 days ago Ok I'll admit.  I thought it was an erection joke. permalink award report block reply YaharaRiver 5 points 3 days ago It’s even funnier now that you said that 😂👍 permalink parent award report block reply _4TheRepublic 6 points 3 days ago It looks like a picture from my FLIR thermal camera… of a turd or something permalink award report block reply LostElf 4 points 3 days ago Nice!! Raging leftards and their tearful love of space rocks will never cease to amaze me. permalink award report block reply 67Vert 3 points 3 days ago No one gets it. Thats why OP posted a lengthy explanation. permalink award report block reply billybaldwin2 3 points 3 days ago Someone who felt retarded for asking the question and another person that felt bad for her having to ask the question? You can tell with how the asker lowers her head, awkward facial expression. shoulders up like \"IDK what I'm asking here.\" permalink award report block reply Iremembermypassword 4 points 3 days ago The Reporter did not feel retarded. She enjoyed talking down to Sidney. permalink parent award report block reply Daffy 2 points 3 days ago I thought it was sperm swimming away from, and toward the egg lol. permalink award report block reply 8bit_mixtape 1 points 3 days ago goddamn smarmy expression the host got permalink award report block reply TrumpAndGodWin 1 points 3 days ago A more evil gollum. permalink parent award report block reply VaultdwelIer 1 points 3 days ago why is this a thing? permalink award report block reply AppalachianTactical 1 points 3 days ago Liberals have more empathy and moral allocation of outgroups and people and things least related to them. Conservatives have more empathy and moral allocation for friends, family and community. You couldnt get it without the study so not fair to say someone doesnt get it without having seen the source. Study just supports what we have known for a long time and backs up the concept of suicidal empathy and white liberal women being the only people ever to have outgroup preference. This is also why they are more common victims of crime. permalink award report block reply NADSAQ 1 points 3 days ago i thought this was a map of eye-tracking movement, as in the host was so repulsive that people looked away permalink award report block reply ExileOnClownStreet 0 points 3 days ago If only they had left out 6, 7, 8 and 9, I'd be down with the whole list. Who am I to condemn an alien life form I've never met except on Star Trek? permalink award report block reply OSmash 1 points 3 days ago 6🫲🫱7? permalink parent award report block reply ExileOnClownStreet 1 points 3 days ago I also would have modified \"all mammals\" by adding the limitation \"except homo sapiens\". permalink parent award report block reply\nCyanScales OP 125 points 3 days ago Heatmaps indicating highest moral allocation by ideology, Moral circle rings, from inner to outer, are described as follows: (1) all of your immediate family, (2) all of your extended family, (3) all of your closest friends, (4) all of your friends (including distant ones), (5) all of your acquaintances, (6) all people you have ever met, (7) all people in your country, (8) all people on your continent, (9) all people on all continents, (10) all mammals, (11) all amphibians, reptiles, mammals, fish, and birds, (12) all animals on earth including paramecia and amoebae, (13) all animals in the universe, including alien lifeforms, (14) all living things in the universe including plants and trees, (15) all natural things in the universe including inert entities such as rocks, (16) all things in existence https://www.researchgate.net/figure/Heatmaps-indicating-highest-moral-allocation-by-ideology-Study-3a-Source-data-are_fig6_336076674 Given this pattern, it is possible conservatives may identify more with aspects of their life that they believe contribute to a more localized community and therefore seek out political behaviors with more localized impact. permalink award report block reply slimcoat 60 points 3 days ago Thank you for the explanation! It really does come down to values. Conservatives tend to value family and localities, whereas liberals value whatever brings them the most pleasure in that moment... permalink parent award report block reply ubit 11 points 3 days ago The studies were surveys. Conservatives thought about it and answered honestly. Libs just picked the bigger collection as more important. permalink parent award report block reply glasses2020 2 points 3 days ago This was the prompt: In this section, we would like to think about your capacity to help, to give, to be charitable, to show empathy, and to be generous—in other words, your capacity to behave morally. We can think about people having different amounts of moral units—like currency—that they can spend on others and can allocate to different moral circles. Some people devote all of their moral units to one circle whereas others try to divide up their moral units amongst multiple circles. Again, by moral circle, we mean the circle of people or other entities in which you are concerned about right and wrong done toward them. permalink parent award report block reply Standingoak 9 points 3 days ago ...whereas liberals value whatever brings them the most... respect that they haven't earned for themselves ... in that moment... and cash permalink parent award report block reply TwoArizonaPedes 6 points 3 days ago Bingo. permalink parent award report block reply BloodElfSupporter 4 points 3 days ago A pattern I’ve noticed is that a lot of liberals (not all) have pretty broken families. Many resent their parents or siblings or just cut ties with them. Many also resent that they were raised in “conservative, religious” families and they had become the opposite of what they were raised on as a form of rebellion. This is my personal observation. By no means does it serve as a metric. permalink parent award report block reply 2020Gop 4 points 3 days ago Liberals love killing babies permalink parent award report block reply AppalachianTactical 3 points 3 days ago Well alot of it is performative, bur they have likely manipulated their own beliefs to the point where they get to suffer the consequences whether they have real outgroup pref or just performative. Performative still puts them in dangerous places and situations more often. permalink parent award report block reply RuprechtThaMonkeyBoy 38 points 3 days ago (15) all natural things in the universe including inert entities such as rocks. This confirms why the vast majority of lefties are as dumb as rocks. permalink parent award report block reply CyanScales OP 15 points 3 days ago It just circles back to (1) immediate family, permalink parent award report block reply megalomania 8 points 3 days ago We must protect the rocks from Trump's fascism! Trillions of grains of sand are deported from US shores every day by Trump's ICE gestapo! Donate to the Democrat party to study this important science. What effort has Trump made to represent LGBTQAP trans rocks representation? Stop Trump's persecution of undocumented and unhoused trans youth rocks now! permalink parent award report block reply Kraken_V_Algorithm 1 points 3 days ago That might actually put them in the first ring, immediate family.  Or self if there is a ring zero. permalink parent award report block reply okboomer59 7 points 3 days ago Oikophobia, the displacement of normal, healthy love of family and community with hatred of one's own culture, society and race, and a perverse passion for their destruction permalink parent award report block reply Decepticons-superior 4 points 3 days ago I don’t see where my love of dogs falls on this chart.  They aren’t just “mammals.” And immediate family doesn’t really count either because I love dogs beyond the two I have. permalink parent award report block reply current_horror 10 points 3 days ago You are one of the people that this meme is targeting lol permalink parent award report block reply Decepticons-superior 8 points 3 days ago Maybe. But as Mark Twain once said, heaven goes by favor. If it went by merit, you would stay out and your dog would go in. permalink parent award report block reply HOSEQ 1 points 3 days ago I could exist happily, knowing my Dogs and Horses made it into heaven, even if I didn't.... I am not bothered by that thought, as long as I'm not in Hell, I don't need to go to Heaven, I know God and Jesus Exist, and am all the better for it.... permalink parent award report block reply CyanScales OP 1 points 3 days ago I get it, blood of the covenant is thicker than water of the womb. Those you choose over those you were born with. But all of that comes before random plants and animals. permalink parent award report block reply Norwegianskier 3 points 3 days ago Dogs dude... They are special. There are dogs that I believe are more valuable than humans. permalink parent award report block reply TwoArizonaPedes 7 points 3 days ago Dogs are family. permalink parent award report block reply Rope_Tree_Journalist 4 points 3 days ago Thanks! So now I understand the heat map part which I would never have guessed, but I live under a rock apparently, and I don't know what the fuck the rest of the meme is. I'm told that's Sydney \"great jeans\" Sweeney in the bottom half but I don't watch TV so I'm taking that on faith. permalink parent award report block reply CyanScales OP 7 points 3 days ago The interviewer in a round about way asked Sydney to disavow Trump's positive tweet to her, and Sydney ignored the premise. permalink parent award report block reply load 11 more comments...\nslimcoat 60 points 3 days ago Thank you for the explanation! It really does come down to values. Conservatives tend to value family and localities, whereas liberals value whatever brings them the most pleasure in that moment... permalink parent award report block reply ubit 11 points 3 days ago The studies were surveys. Conservatives thought about it and answered honestly. Libs just picked the bigger collection as more important. permalink parent award report block reply glasses2020 2 points 3 days ago This was the prompt: In this section, we would like to think about your capacity to help, to give, to be charitable, to show empathy, and to be generous—in other words, your capacity to behave morally. We can think about people having different amounts of moral units—like currency—that they can spend on others and can allocate to different moral circles. Some people devote all of their moral units to one circle whereas others try to divide up their moral units amongst multiple circles. Again, by moral circle, we mean the circle of people or other entities in which you are concerned about right and wrong done toward them. permalink parent award report block reply Standingoak 9 points 3 days ago ...whereas liberals value whatever brings them the most... respect that they haven't earned for themselves ... in that moment... and cash permalink parent award report block reply TwoArizonaPedes 6 points 3 days ago Bingo. permalink parent award report block reply BloodElfSupporter 4 points 3 days ago A pattern I’ve noticed is that a lot of liberals (not all) have pretty broken families. Many resent their parents or siblings or just cut ties with them. Many also resent that they were raised in “conservative, religious” families and they had become the opposite of what they were raised on as a form of rebellion. This is my personal observation. By no means does it serve as a metric. permalink parent award report block reply 2020Gop 4 points 3 days ago Liberals love killing babies permalink parent award report block reply AppalachianTactical 3 points 3 days ago Well alot of it is performative, bur they have likely manipulated their own beliefs to the point where they get to suffer the consequences whether they have real outgroup pref or just performative. Performative still puts them in dangerous places and situations more often. permalink parent award report block reply\nubit 11 points 3 days ago The studies were surveys. Conservatives thought about it and answered honestly. Libs just picked the bigger collection as more important. permalink parent award report block reply glasses2020 2 points 3 days ago This was the prompt: In this section, we would like to think about your capacity to help, to give, to be charitable, to show empathy, and to be generous—in other words, your capacity to behave morally. We can think about people having different amounts of moral units—like currency—that they can spend on others and can allocate to different moral circles. Some people devote all of their moral units to one circle whereas others try to divide up their moral units amongst multiple circles. Again, by moral circle, we mean the circle of people or other entities in which you are concerned about right and wrong done toward them. permalink parent award report block reply\nglasses2020 2 points 3 days ago This was the prompt: In this section, we would like to think about your capacity to help, to give, to be charitable, to show empathy, and to be generous—in other words, your capacity to behave morally. We can think about people having different amounts of moral units—like currency—that they can spend on others and can allocate to different moral circles. Some people devote all of their moral units to one circle whereas others try to divide up their moral units amongst multiple circles. Again, by moral circle, we mean the circle of people or other entities in which you are concerned about right and wrong done toward them. permalink parent award report block reply\nStandingoak 9 points 3 days ago ...whereas liberals value whatever brings them the most... respect that they haven't earned for themselves ... in that moment... and cash permalink parent award report block reply TwoArizonaPedes 6 points 3 days ago Bingo. permalink parent award report block reply\nTwoArizonaPedes 6 points 3 days ago Bingo. permalink parent award report block reply\nBloodElfSupporter 4 points 3 days ago A pattern I’ve noticed is that a lot of liberals (not all) have pretty broken families. Many resent their parents or siblings or just cut ties with them. Many also resent that they were raised in “conservative, religious” families and they had become the opposite of what they were raised on as a form of rebellion. This is my personal observation. By no means does it serve as a metric. permalink parent award report block reply\n2020Gop 4 points 3 days ago Liberals love killing babies permalink parent award report block reply\nAppalachianTactical 3 points 3 days ago Well alot of it is performative, bur they have likely manipulated their own beliefs to the point where they get to suffer the consequences whether they have real outgroup pref or just performative. Performative still puts them in dangerous places and situations more often. permalink parent award report block reply\nRuprechtThaMonkeyBoy 38 points 3 days ago (15) all natural things in the universe including inert entities such as rocks. This confirms why the vast majority of lefties are as dumb as rocks. permalink parent award report block reply CyanScales OP 15 points 3 days ago It just circles back to (1) immediate family, permalink parent award report block reply megalomania 8 points 3 days ago We must protect the rocks from Trump's fascism! Trillions of grains of sand are deported from US shores every day by Trump's ICE gestapo! Donate to the Democrat party to study this important science. What effort has Trump made to represent LGBTQAP trans rocks representation? Stop Trump's persecution of undocumented and unhoused trans youth rocks now! permalink parent award report block reply Kraken_V_Algorithm 1 points 3 days ago That might actually put them in the first ring, immediate family.  Or self if there is a ring zero. permalink parent award report block reply\nCyanScales OP 15 points 3 days ago It just circles back to (1) immediate family, permalink parent award report block reply\nmegalomania 8 points 3 days ago We must protect the rocks from Trump's fascism! Trillions of grains of sand are deported from US shores every day by Trump's ICE gestapo! Donate to the Democrat party to study this important science. What effort has Trump made to represent LGBTQAP trans rocks representation? Stop Trump's persecution of undocumented and unhoused trans youth rocks now! permalink parent award report block reply\nKraken_V_Algorithm 1 points 3 days ago That might actually put them in the first ring, immediate family.  Or self if there is a ring zero. permalink parent award report block reply\nokboomer59 7 points 3 days ago Oikophobia, the displacement of normal, healthy love of family and community with hatred of one's own culture, society and race, and a perverse passion for their destruction permalink parent award report block reply\nDecepticons-superior 4 points 3 days ago I don’t see where my love of dogs falls on this chart.  They aren’t just “mammals.” And immediate family doesn’t really count either because I love dogs beyond the two I have. permalink parent award report block reply current_horror 10 points 3 days ago You are one of the people that this meme is targeting lol permalink parent award report block reply Decepticons-superior 8 points 3 days ago Maybe. But as Mark Twain once said, heaven goes by favor. If it went by merit, you would stay out and your dog would go in. permalink parent award report block reply HOSEQ 1 points 3 days ago I could exist happily, knowing my Dogs and Horses made it into heaven, even if I didn't.... I am not bothered by that thought, as long as I'm not in Hell, I don't need to go to Heaven, I know God and Jesus Exist, and am all the better for it.... permalink parent award report block reply CyanScales OP 1 points 3 days ago I get it, blood of the covenant is thicker than water of the womb. Those you choose over those you were born with. But all of that comes before random plants and animals. permalink parent award report block reply Norwegianskier 3 points 3 days ago Dogs dude... They are special. There are dogs that I believe are more valuable than humans. permalink parent award report block reply TwoArizonaPedes 7 points 3 days ago Dogs are family. permalink parent award report block reply\ncurrent_horror 10 points 3 days ago You are one of the people that this meme is targeting lol permalink parent award report block reply Decepticons-superior 8 points 3 days ago Maybe. But as Mark Twain once said, heaven goes by favor. If it went by merit, you would stay out and your dog would go in. permalink parent award report block reply HOSEQ 1 points 3 days ago I could exist happily, knowing my Dogs and Horses made it into heaven, even if I didn't.... I am not bothered by that thought, as long as I'm not in Hell, I don't need to go to Heaven, I know God and Jesus Exist, and am all the better for it.... permalink parent award report block reply CyanScales OP 1 points 3 days ago I get it, blood of the covenant is thicker than water of the womb. Those you choose over those you were born with. But all of that comes before random plants and animals. permalink parent award report block reply Norwegianskier 3 points 3 days ago Dogs dude... They are special. There are dogs that I believe are more valuable than humans. permalink parent award report block reply\nDecepticons-superior 8 points 3 days ago Maybe. But as Mark Twain once said, heaven goes by favor. If it went by merit, you would stay out and your dog would go in. permalink parent award report block reply HOSEQ 1 points 3 days ago I could exist happily, knowing my Dogs and Horses made it into heaven, even if I didn't.... I am not bothered by that thought, as long as I'm not in Hell, I don't need to go to Heaven, I know God and Jesus Exist, and am all the better for it.... permalink parent award report block reply\nHOSEQ 1 points 3 days ago I could exist happily, knowing my Dogs and Horses made it into heaven, even if I didn't.... I am not bothered by that thought, as long as I'm not in Hell, I don't need to go to Heaven, I know God and Jesus Exist, and am all the better for it.... permalink parent award report block reply\nCyanScales OP 1 points 3 days ago I get it, blood of the covenant is thicker than water of the womb. Those you choose over those you were born with. But all of that comes before random plants and animals. permalink parent award report block reply Norwegianskier 3 points 3 days ago Dogs dude... They are special. There are dogs that I believe are more valuable than humans. permalink parent award report block reply\nNorwegianskier 3 points 3 days ago Dogs dude... They are special. There are dogs that I believe are more valuable than humans. permalink parent award report block reply\nTwoArizonaPedes 7 points 3 days ago Dogs are family. permalink parent award report block reply\nRope_Tree_Journalist 4 points 3 days ago Thanks! So now I understand the heat map part which I would never have guessed, but I live under a rock apparently, and I don't know what the fuck the rest of the meme is. I'm told that's Sydney \"great jeans\" Sweeney in the bottom half but I don't watch TV so I'm taking that on faith. permalink parent award report block reply CyanScales OP 7 points 3 days ago The interviewer in a round about way asked Sydney to disavow Trump's positive tweet to her, and Sydney ignored the premise. permalink parent award report block reply\nCyanScales OP 7 points 3 days ago The interviewer in a round about way asked Sydney to disavow Trump's positive tweet to her, and Sydney ignored the premise. permalink parent award report block reply\nHillarysFUPA 38 points 3 days ago Dumbass here... I don't get it either... I have some guesses that are probably all wrong. permalink award report block reply kestral 46 points 3 days ago The heatmaps are from a real 2012 study on \"moral circles\" by psychologists Peter Singer and others. The graph is a polar-area plot where the circles represent \"rings of relational distance\" from the self (inner rings = immediate family/close friends; outer rings = distant strangers, all humans, animals, or even the environment). Participants rated how much they care if harm happens to people/groups at each distance. Heat intensity (red/yellow = high concern; blue/green = low) shows where empathy peaks. Key findings were: on average, Conservatives' concern drops off sharply after close kin/nation (inner 4-5 rings), focusing empathy narrowly (e.g., \"my family first\"). Liberals' primary concern extends farther out (to ring 10+ like \"all people\" or global issues). permalink parent award report block reply SickOfNeoPolitics 38 points 3 days ago The reach of the areas is not the concern so much as where the focus is. Liberals literally care more about rocks and trees than their own families. Fundamentally mindbroken people. permalink parent award report block reply bigdickhangsright 16 points 3 days ago I'd posit that they don't care about anything other than controlling what others think. And they're a bunch of lazy asses so if you combine these you will see why they become actors, professors, teachers, etc. permalink parent award report block reply kestral 4 points 3 days ago Nothing matters to them except what they think they're supposed to say matters permalink parent award report block reply HillarysFUPA 2 points 3 days ago That's why they abandon people who don't think like them and only try to associate with like-minded people .. the like-minded are already under control, so they can try to focus on others they don't have control of yet. permalink parent award report block reply DatabaseCentrals 6 points 3 days ago The thing is they would always be chasing something they'll never see. If they became close to the people far off then they would stop caring about them due to the pattern. It means they care about nothing other than themselves and want the worst for those directly around them. permalink parent award report block reply SickOfNeoPolitics 2 points 3 days ago The outer rings do not represent people. Hell, anything past ring 9 isn't even mammals. permalink parent award report block reply learntocode 2 points 3 days ago This is EXACTLY what happens. They can often be disabused by travelling and living as a local with all their precious foreigners. permalink parent award report block reply HillarysFUPA 7 points 3 days ago À+ response. I didn't even know what to look for to find out what this was about. permalink parent award report block reply MAGABOND 2 points 3 days ago I truly give zero fucks about some goatfucker’s kid in any Muslim area. I would rather die than have my kid seriously hurt. Not a hard concept. permalink parent award report block reply glasses2020 2 points 3 days ago An important note is that they only had 100 \"moral units\" to allocate to the circles. permalink parent award report block reply Piglips 0 points 3 days ago Pseudo-science. Now do phrenology, engrams, palm-reading, corprlite-reading, astrology, chicken feet and engrams. permalink parent award report block reply Moose_Antlers 2 points 3 days ago It's normal to care about those closest to you first. Liberals tend to have wildly dysfunctional relationships with those people so they align themselves with larger and wider groups. If you've heard the expression in-group preference or out-group preference, the normal human has an in-group preference. We're biologically hardwired, it is instinctual, for us to prefer and maintain high loyalty to those who are most like us: family, extended family, local community, etc. That's in-group preference. Liberals reject all of those things and prefer the other. They specifically prefer people and objects that are different or abnormal or unfamiliar. Its why liberal white women fetishize black and brown people and hate white men. Out-group preference. This heatmap should look like a dart board or a bullseye in a normal person, focused around the center. Sweeney's does. That's normal. The Leftist's looks like a comet, wildly off-center and facing away from the center. That's this out-group preference visualized. permalink parent award report block reply\nkestral 46 points 3 days ago The heatmaps are from a real 2012 study on \"moral circles\" by psychologists Peter Singer and others. The graph is a polar-area plot where the circles represent \"rings of relational distance\" from the self (inner rings = immediate family/close friends; outer rings = distant strangers, all humans, animals, or even the environment). Participants rated how much they care if harm happens to people/groups at each distance. Heat intensity (red/yellow = high concern; blue/green = low) shows where empathy peaks. Key findings were: on average, Conservatives' concern drops off sharply after close kin/nation (inner 4-5 rings), focusing empathy narrowly (e.g., \"my family first\"). Liberals' primary concern extends farther out (to ring 10+ like \"all people\" or global issues). permalink parent award report block reply SickOfNeoPolitics 38 points 3 days ago The reach of the areas is not the concern so much as where the focus is. Liberals literally care more about rocks and trees than their own families. Fundamentally mindbroken people. permalink parent award report block reply bigdickhangsright 16 points 3 days ago I'd posit that they don't care about anything other than controlling what others think. And they're a bunch of lazy asses so if you combine these you will see why they become actors, professors, teachers, etc. permalink parent award report block reply kestral 4 points 3 days ago Nothing matters to them except what they think they're supposed to say matters permalink parent award report block reply HillarysFUPA 2 points 3 days ago That's why they abandon people who don't think like them and only try to associate with like-minded people .. the like-minded are already under control, so they can try to focus on others they don't have control of yet. permalink parent award report block reply DatabaseCentrals 6 points 3 days ago The thing is they would always be chasing something they'll never see. If they became close to the people far off then they would stop caring about them due to the pattern. It means they care about nothing other than themselves and want the worst for those directly around them. permalink parent award report block reply SickOfNeoPolitics 2 points 3 days ago The outer rings do not represent people. Hell, anything past ring 9 isn't even mammals. permalink parent award report block reply learntocode 2 points 3 days ago This is EXACTLY what happens. They can often be disabused by travelling and living as a local with all their precious foreigners. permalink parent award report block reply HillarysFUPA 7 points 3 days ago À+ response. I didn't even know what to look for to find out what this was about. permalink parent award report block reply MAGABOND 2 points 3 days ago I truly give zero fucks about some goatfucker’s kid in any Muslim area. I would rather die than have my kid seriously hurt. Not a hard concept. permalink parent award report block reply glasses2020 2 points 3 days ago An important note is that they only had 100 \"moral units\" to allocate to the circles. permalink parent award report block reply Piglips 0 points 3 days ago Pseudo-science. Now do phrenology, engrams, palm-reading, corprlite-reading, astrology, chicken feet and engrams. permalink parent award report block reply\nSickOfNeoPolitics 38 points 3 days ago The reach of the areas is not the concern so much as where the focus is. Liberals literally care more about rocks and trees than their own families. Fundamentally mindbroken people. permalink parent award report block reply bigdickhangsright 16 points 3 days ago I'd posit that they don't care about anything other than controlling what others think. And they're a bunch of lazy asses so if you combine these you will see why they become actors, professors, teachers, etc. permalink parent award report block reply kestral 4 points 3 days ago Nothing matters to them except what they think they're supposed to say matters permalink parent award report block reply HillarysFUPA 2 points 3 days ago That's why they abandon people who don't think like them and only try to associate with like-minded people .. the like-minded are already under control, so they can try to focus on others they don't have control of yet. permalink parent award report block reply DatabaseCentrals 6 points 3 days ago The thing is they would always be chasing something they'll never see. If they became close to the people far off then they would stop caring about them due to the pattern. It means they care about nothing other than themselves and want the worst for those directly around them. permalink parent award report block reply SickOfNeoPolitics 2 points 3 days ago The outer rings do not represent people. Hell, anything past ring 9 isn't even mammals. permalink parent award report block reply learntocode 2 points 3 days ago This is EXACTLY what happens. They can often be disabused by travelling and living as a local with all their precious foreigners. permalink parent award report block reply\nbigdickhangsright 16 points 3 days ago I'd posit that they don't care about anything other than controlling what others think. And they're a bunch of lazy asses so if you combine these you will see why they become actors, professors, teachers, etc. permalink parent award report block reply kestral 4 points 3 days ago Nothing matters to them except what they think they're supposed to say matters permalink parent award report block reply HillarysFUPA 2 points 3 days ago That's why they abandon people who don't think like them and only try to associate with like-minded people .. the like-minded are already under control, so they can try to focus on others they don't have control of yet. permalink parent award report block reply\nkestral 4 points 3 days ago Nothing matters to them except what they think they're supposed to say matters permalink parent award report block reply\nHillarysFUPA 2 points 3 days ago That's why they abandon people who don't think like them and only try to associate with like-minded people .. the like-minded are already under control, so they can try to focus on others they don't have control of yet. permalink parent award report block reply\nDatabaseCentrals 6 points 3 days ago The thing is they would always be chasing something they'll never see. If they became close to the people far off then they would stop caring about them due to the pattern. It means they care about nothing other than themselves and want the worst for those directly around them. permalink parent award report block reply SickOfNeoPolitics 2 points 3 days ago The outer rings do not represent people. Hell, anything past ring 9 isn't even mammals. permalink parent award report block reply learntocode 2 points 3 days ago This is EXACTLY what happens. They can often be disabused by travelling and living as a local with all their precious foreigners. permalink parent award report block reply\nSickOfNeoPolitics 2 points 3 days ago The outer rings do not represent people. Hell, anything past ring 9 isn't even mammals. permalink parent award report block reply\nlearntocode 2 points 3 days ago This is EXACTLY what happens. They can often be disabused by travelling and living as a local with all their precious foreigners. permalink parent award report block reply\nHillarysFUPA 7 points 3 days ago À+ response. I didn't even know what to look for to find out what this was about. permalink parent award report block reply\nMAGABOND 2 points 3 days ago I truly give zero fucks about some goatfucker’s kid in any Muslim area. I would rather die than have my kid seriously hurt. Not a hard concept. permalink parent award report block reply\nglasses2020 2 points 3 days ago An important note is that they only had 100 \"moral units\" to allocate to the circles. permalink parent award report block reply\nPiglips 0 points 3 days ago Pseudo-science. Now do phrenology, engrams, palm-reading, corprlite-reading, astrology, chicken feet and engrams. permalink parent award report block reply\nMoose_Antlers 2 points 3 days ago It's normal to care about those closest to you first. Liberals tend to have wildly dysfunctional relationships with those people so they align themselves with larger and wider groups. If you've heard the expression in-group preference or out-group preference, the normal human has an in-group preference. We're biologically hardwired, it is instinctual, for us to prefer and maintain high loyalty to those who are most like us: family, extended family, local community, etc. That's in-group preference. Liberals reject all of those things and prefer the other. They specifically prefer people and objects that are different or abnormal or unfamiliar. Its why liberal white women fetishize black and brown people and hate white men. Out-group preference. This heatmap should look like a dart board or a bullseye in a normal person, focused around the center. Sweeney's does. That's normal. The Leftist's looks like a comet, wildly off-center and facing away from the center. That's this out-group preference visualized. permalink parent award report block reply\nViewer01 28 points 3 days ago You got a shit ton of con inc boomers falling into the top category. Historians are going to debate forever on a generation so wealthy but seemingly hated their children. permalink award report block reply TNfootDoc 13 points 3 days ago Probs 50/50. Conservative boomers I think are more likely to help their family than liberal boomers. At least in my experience. permalink parent award report block reply lul_cheto 2 points 3 days ago , I guess his family sucks like mine does, who are greedy and poor. But my wife's family works hard, has tons of money, and helps everyone, even putting a down payment for a newlyweds house they knew from church. permalink parent award report block reply heavyD 6 points 3 days ago Not all children, just children like you that blamed them for your fck ups. permalink parent award report block reply Iremembermypassword 9 points 3 days ago Our society used to have Elders, now we only have the Elderly. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago And spinsters. Spinsters used to have a functional, constructive role in families and society, now they're just written off as wine-box-cat-ladies. permalink parent award report block reply TNfootDoc 6 points 3 days ago Nah. A lot of boomers in general are greedy and hoarding well to blow it on a nursing home. Allowed mortgages and tuition to become insanely expensive while they watch their children get fucked. permalink parent award report block reply newestofnew 5 points 3 days ago they don't care, they've already recessed to childish insults, best thing is let it collapse around them denying them any peace when they need it most in their twilight permalink parent award report block reply nmipede 3 points 3 days ago Aww. Did Grandpa call you a retard the last time you had an idea? permalink parent award report block reply view 7 more comments... learntocode 1 points 3 days ago Mom? Is that you? permalink parent award report block reply daty_dato 5 points 3 days ago yeah they should die out early so their kids get the money. Right? permalink parent award report block reply newestofnew 2 points 3 days ago nah no one wants their money they should spend it all on Chinese crap they care about so much or 300k on some medicine to give them 6 more weeks alive in a hospital what we want is for them to sell some of the millions of second or third homes they hold off market and out of use permalink parent award report block reply view 1 more comments... learntocode -1 points 3 days ago Money is their God. permalink parent award report block reply view 1 more comments... ianpatrick1966 2 points 3 days ago Exactly. permalink parent award report block reply Viewer01 1 points 3 days ago lol. Case in point. Irrational dickhead that takes zero accountability for the last 35 years of politics. My family was extremely gracious in my younger years and this has helped me get into the top 5-10% of incomes and net worths by age. I do however look at others my age who could have gotten this help but did not. These are the odious sort I refer to and they are deserving of the freshest h1b Indian drs and Jamal at the nursing homes. permalink parent award report block reply heavyD 1 points 3 days ago So you are saying you wouldn't have shit if they hadn't have given you some of what They earned? Case in point LOL Irrational little richard cranium that never had enough balls to stand on it's own 2 feet and would have failed without mommy and daddy's extended basement. permalink parent award report block reply Bldg_2019 4 points 3 days ago Still screaming at your grandparents, eh? Zillennials are pathetic. There’s a reason nobody left you shit. It isn’t random. You put on your big girl pants yet and get your own cell phone plan or nah? permalink parent award report block reply Viewer01 0 points 3 days ago I hope you get a h1b dr and your kids never come to visit. permalink parent award report block reply Bldg_2019 4 points 3 days ago So still on your parents’ cell phone plan. Got it. They charging you rent? The big secret you and people like you miss is that being a big fat zero in life is about YOU, not “them”. They gave you everything you have. Loser. permalink parent award report block reply Viewer01 0 points 3 days ago I own five houses lmao. That’s why I’m saying this. My folks were gracious and relatively I’m thriving. Whereas I look at my cohorts and see them being told to bootstrap in an unfair system by malicious boomers. It’s funny watching the boomers melt down because they know they were shitty parents. permalink parent award report block reply view 3 more comments... heavyD 1 points 3 days ago Your parents would probably enjoy the indians more than you. permalink parent award report block reply Moose_Antlers 2 points 3 days ago That generation didn't hate their children. They hated their parents and resolved to be radically different from them when they themselves became parents. They rejected the values their parents had instead of passing them on. Instead, they were hyper-permissive and indulgent of their children, failed to lay down moral boundaries and normal discipline, taught \"tolerance\" and \"acceptance\" that they'd learned in their 60s-era rights protests. They taught their kids communist values and rejected traditional morality. That's where a lot of the issues post-boomer comes from. Obviously, it's not all boomers. It's heavily driven by the hippie types. But that's the origin. This generation hated their WW2-era parents who had literally lived through hell (Great Depression + world war) and tried to pass on those lessons during a time of absolute economic plenitude. The kids couldn't understand, and were often downrage of repressed anger/rage/PTSD. The kids (boomers) hated their parents, not their children. permalink parent award report block reply drattastic1 2 points 3 days ago How crybabies turn this into a gen-war is beyond me. This is about MAGA vs the commies at any age. The amount of whining is pathetic. permalink parent award report block reply Viewer01 0 points 3 days ago I wish many dr pajeet and Jamal’s in the nursing home. permalink parent award report block reply current_horror -1 points 3 days ago Boomers are the worst generation in history. Stay mad, pass soon. :) permalink parent award report block reply\nTNfootDoc 13 points 3 days ago Probs 50/50. Conservative boomers I think are more likely to help their family than liberal boomers. At least in my experience. permalink parent award report block reply lul_cheto 2 points 3 days ago , I guess his family sucks like mine does, who are greedy and poor. But my wife's family works hard, has tons of money, and helps everyone, even putting a down payment for a newlyweds house they knew from church. permalink parent award report block reply\nlul_cheto 2 points 3 days ago , I guess his family sucks like mine does, who are greedy and poor. But my wife's family works hard, has tons of money, and helps everyone, even putting a down payment for a newlyweds house they knew from church. permalink parent award report block reply\nheavyD 6 points 3 days ago Not all children, just children like you that blamed them for your fck ups. permalink parent award report block reply Iremembermypassword 9 points 3 days ago Our society used to have Elders, now we only have the Elderly. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago And spinsters. Spinsters used to have a functional, constructive role in families and society, now they're just written off as wine-box-cat-ladies. permalink parent award report block reply TNfootDoc 6 points 3 days ago Nah. A lot of boomers in general are greedy and hoarding well to blow it on a nursing home. Allowed mortgages and tuition to become insanely expensive while they watch their children get fucked. permalink parent award report block reply newestofnew 5 points 3 days ago they don't care, they've already recessed to childish insults, best thing is let it collapse around them denying them any peace when they need it most in their twilight permalink parent award report block reply nmipede 3 points 3 days ago Aww. Did Grandpa call you a retard the last time you had an idea? permalink parent award report block reply view 7 more comments... learntocode 1 points 3 days ago Mom? Is that you? permalink parent award report block reply daty_dato 5 points 3 days ago yeah they should die out early so their kids get the money. Right? permalink parent award report block reply newestofnew 2 points 3 days ago nah no one wants their money they should spend it all on Chinese crap they care about so much or 300k on some medicine to give them 6 more weeks alive in a hospital what we want is for them to sell some of the millions of second or third homes they hold off market and out of use permalink parent award report block reply view 1 more comments... learntocode -1 points 3 days ago Money is their God. permalink parent award report block reply view 1 more comments... ianpatrick1966 2 points 3 days ago Exactly. permalink parent award report block reply Viewer01 1 points 3 days ago lol. Case in point. Irrational dickhead that takes zero accountability for the last 35 years of politics. My family was extremely gracious in my younger years and this has helped me get into the top 5-10% of incomes and net worths by age. I do however look at others my age who could have gotten this help but did not. These are the odious sort I refer to and they are deserving of the freshest h1b Indian drs and Jamal at the nursing homes. permalink parent award report block reply heavyD 1 points 3 days ago So you are saying you wouldn't have shit if they hadn't have given you some of what They earned? Case in point LOL Irrational little richard cranium that never had enough balls to stand on it's own 2 feet and would have failed without mommy and daddy's extended basement. permalink parent award report block reply\nIremembermypassword 9 points 3 days ago Our society used to have Elders, now we only have the Elderly. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago And spinsters. Spinsters used to have a functional, constructive role in families and society, now they're just written off as wine-box-cat-ladies. permalink parent award report block reply\nTwoArizonaPedes 5 points 3 days ago And spinsters. Spinsters used to have a functional, constructive role in families and society, now they're just written off as wine-box-cat-ladies. permalink parent award report block reply\nTNfootDoc 6 points 3 days ago Nah. A lot of boomers in general are greedy and hoarding well to blow it on a nursing home. Allowed mortgages and tuition to become insanely expensive while they watch their children get fucked. permalink parent award report block reply newestofnew 5 points 3 days ago they don't care, they've already recessed to childish insults, best thing is let it collapse around them denying them any peace when they need it most in their twilight permalink parent award report block reply nmipede 3 points 3 days ago Aww. Did Grandpa call you a retard the last time you had an idea? permalink parent award report block reply view 7 more comments... learntocode 1 points 3 days ago Mom? Is that you? permalink parent award report block reply daty_dato 5 points 3 days ago yeah they should die out early so their kids get the money. Right? permalink parent award report block reply newestofnew 2 points 3 days ago nah no one wants their money they should spend it all on Chinese crap they care about so much or 300k on some medicine to give them 6 more weeks alive in a hospital what we want is for them to sell some of the millions of second or third homes they hold off market and out of use permalink parent award report block reply view 1 more comments... learntocode -1 points 3 days ago Money is their God. permalink parent award report block reply view 1 more comments...\nnewestofnew 5 points 3 days ago they don't care, they've already recessed to childish insults, best thing is let it collapse around them denying them any peace when they need it most in their twilight permalink parent award report block reply nmipede 3 points 3 days ago Aww. Did Grandpa call you a retard the last time you had an idea? permalink parent award report block reply view 7 more comments... learntocode 1 points 3 days ago Mom? Is that you? permalink parent award report block reply\nnmipede 3 points 3 days ago Aww. Did Grandpa call you a retard the last time you had an idea? permalink parent award report block reply view 7 more comments...\nlearntocode 1 points 3 days ago Mom? Is that you? permalink parent award report block reply\ndaty_dato 5 points 3 days ago yeah they should die out early so their kids get the money. Right? permalink parent award report block reply newestofnew 2 points 3 days ago nah no one wants their money they should spend it all on Chinese crap they care about so much or 300k on some medicine to give them 6 more weeks alive in a hospital what we want is for them to sell some of the millions of second or third homes they hold off market and out of use permalink parent award report block reply view 1 more comments... learntocode -1 points 3 days ago Money is their God. permalink parent award report block reply view 1 more comments...\nnewestofnew 2 points 3 days ago nah no one wants their money they should spend it all on Chinese crap they care about so much or 300k on some medicine to give them 6 more weeks alive in a hospital what we want is for them to sell some of the millions of second or third homes they hold off market and out of use permalink parent award report block reply view 1 more comments...\nlearntocode -1 points 3 days ago Money is their God. permalink parent award report block reply view 1 more comments...\nianpatrick1966 2 points 3 days ago Exactly. permalink parent award report block reply\nViewer01 1 points 3 days ago lol. Case in point. Irrational dickhead that takes zero accountability for the last 35 years of politics. My family was extremely gracious in my younger years and this has helped me get into the top 5-10% of incomes and net worths by age. I do however look at others my age who could have gotten this help but did not. These are the odious sort I refer to and they are deserving of the freshest h1b Indian drs and Jamal at the nursing homes. permalink parent award report block reply heavyD 1 points 3 days ago So you are saying you wouldn't have shit if they hadn't have given you some of what They earned? Case in point LOL Irrational little richard cranium that never had enough balls to stand on it's own 2 feet and would have failed without mommy and daddy's extended basement. permalink parent award report block reply\nheavyD 1 points 3 days ago So you are saying you wouldn't have shit if they hadn't have given you some of what They earned? Case in point LOL Irrational little richard cranium that never had enough balls to stand on it's own 2 feet and would have failed without mommy and daddy's extended basement. permalink parent award report block reply\nBldg_2019 4 points 3 days ago Still screaming at your grandparents, eh? Zillennials are pathetic. There’s a reason nobody left you shit. It isn’t random. You put on your big girl pants yet and get your own cell phone plan or nah? permalink parent award report block reply Viewer01 0 points 3 days ago I hope you get a h1b dr and your kids never come to visit. permalink parent award report block reply Bldg_2019 4 points 3 days ago So still on your parents’ cell phone plan. Got it. They charging you rent? The big secret you and people like you miss is that being a big fat zero in life is about YOU, not “them”. They gave you everything you have. Loser. permalink parent award report block reply Viewer01 0 points 3 days ago I own five houses lmao. That’s why I’m saying this. My folks were gracious and relatively I’m thriving. Whereas I look at my cohorts and see them being told to bootstrap in an unfair system by malicious boomers. It’s funny watching the boomers melt down because they know they were shitty parents. permalink parent award report block reply view 3 more comments... heavyD 1 points 3 days ago Your parents would probably enjoy the indians more than you. permalink parent award report block reply\nViewer01 0 points 3 days ago I hope you get a h1b dr and your kids never come to visit. permalink parent award report block reply Bldg_2019 4 points 3 days ago So still on your parents’ cell phone plan. Got it. They charging you rent? The big secret you and people like you miss is that being a big fat zero in life is about YOU, not “them”. They gave you everything you have. Loser. permalink parent award report block reply Viewer01 0 points 3 days ago I own five houses lmao. That’s why I’m saying this. My folks were gracious and relatively I’m thriving. Whereas I look at my cohorts and see them being told to bootstrap in an unfair system by malicious boomers. It’s funny watching the boomers melt down because they know they were shitty parents. permalink parent award report block reply view 3 more comments... heavyD 1 points 3 days ago Your parents would probably enjoy the indians more than you. permalink parent award report block reply\nBldg_2019 4 points 3 days ago So still on your parents’ cell phone plan. Got it. They charging you rent? The big secret you and people like you miss is that being a big fat zero in life is about YOU, not “them”. They gave you everything you have. Loser. permalink parent award report block reply Viewer01 0 points 3 days ago I own five houses lmao. That’s why I’m saying this. My folks were gracious and relatively I’m thriving. Whereas I look at my cohorts and see them being told to bootstrap in an unfair system by malicious boomers. It’s funny watching the boomers melt down because they know they were shitty parents. permalink parent award report block reply view 3 more comments...\nViewer01 0 points 3 days ago I own five houses lmao. That’s why I’m saying this. My folks were gracious and relatively I’m thriving. Whereas I look at my cohorts and see them being told to bootstrap in an unfair system by malicious boomers. It’s funny watching the boomers melt down because they know they were shitty parents. permalink parent award report block reply view 3 more comments...\nheavyD 1 points 3 days ago Your parents would probably enjoy the indians more than you. permalink parent award report block reply\nMoose_Antlers 2 points 3 days ago That generation didn't hate their children. They hated their parents and resolved to be radically different from them when they themselves became parents. They rejected the values their parents had instead of passing them on. Instead, they were hyper-permissive and indulgent of their children, failed to lay down moral boundaries and normal discipline, taught \"tolerance\" and \"acceptance\" that they'd learned in their 60s-era rights protests. They taught their kids communist values and rejected traditional morality. That's where a lot of the issues post-boomer comes from. Obviously, it's not all boomers. It's heavily driven by the hippie types. But that's the origin. This generation hated their WW2-era parents who had literally lived through hell (Great Depression + world war) and tried to pass on those lessons during a time of absolute economic plenitude. The kids couldn't understand, and were often downrage of repressed anger/rage/PTSD. The kids (boomers) hated their parents, not their children. permalink parent award report block reply\ndrattastic1 2 points 3 days ago How crybabies turn this into a gen-war is beyond me. This is about MAGA vs the commies at any age. The amount of whining is pathetic. permalink parent award report block reply Viewer01 0 points 3 days ago I wish many dr pajeet and Jamal’s in the nursing home. permalink parent award report block reply current_horror -1 points 3 days ago Boomers are the worst generation in history. Stay mad, pass soon. :) permalink parent award report block reply\nViewer01 0 points 3 days ago I wish many dr pajeet and Jamal’s in the nursing home. permalink parent award report block reply\ncurrent_horror -1 points 3 days ago Boomers are the worst generation in history. Stay mad, pass soon. :) permalink parent award report block reply\n1DontTreadOnMe1 13 points 3 days ago Suicidal empathy vs ingroup preference, of course they don't get it. permalink award report block reply\nDoMagnum 10 points 3 days ago Since no one was cringeing, the lib-whore interviewer needed to demonstrate it for the rest of the class. Fail. permalink award report block reply Filo76 4 points 3 days ago I’ve never seen a more condescending looking interviewer. She’s a perfect fit for lord farquad from Shrek. permalink parent award report block reply DoMagnum 2 points 3 days ago The essence of progressive feminists. Superior, Mocking, Scornful. permalink parent award report block reply The_Emperor 1 points 3 days ago Wtf interview Is this?!  Gandalf meme. Ok,I had to go to KYM and look up..and eventually found Sidney Sweeney GQ interview.  Thanks internet! permalink parent award report block reply\nFilo76 4 points 3 days ago I’ve never seen a more condescending looking interviewer. She’s a perfect fit for lord farquad from Shrek. permalink parent award report block reply DoMagnum 2 points 3 days ago The essence of progressive feminists. Superior, Mocking, Scornful. permalink parent award report block reply The_Emperor 1 points 3 days ago Wtf interview Is this?!  Gandalf meme. Ok,I had to go to KYM and look up..and eventually found Sidney Sweeney GQ interview.  Thanks internet! permalink parent award report block reply\nDoMagnum 2 points 3 days ago The essence of progressive feminists. Superior, Mocking, Scornful. permalink parent award report block reply\nThe_Emperor 1 points 3 days ago Wtf interview Is this?!  Gandalf meme. Ok,I had to go to KYM and look up..and eventually found Sidney Sweeney GQ interview.  Thanks internet! permalink parent award report block reply\nrocco_saint 7 points 3 days ago Ok I'll admit.  I thought it was an erection joke. permalink award report block reply YaharaRiver 5 points 3 days ago It’s even funnier now that you said that 😂👍 permalink parent award report block reply\nYaharaRiver 5 points 3 days ago It’s even funnier now that you said that 😂👍 permalink parent award report block reply\n_4TheRepublic 6 points 3 days ago It looks like a picture from my FLIR thermal camera… of a turd or something permalink award report block reply\nLostElf 4 points 3 days ago Nice!! Raging leftards and their tearful love of space rocks will never cease to amaze me. permalink award report block reply\n67Vert 3 points 3 days ago No one gets it. Thats why OP posted a lengthy explanation. permalink award report block reply\nbillybaldwin2 3 points 3 days ago Someone who felt retarded for asking the question and another person that felt bad for her having to ask the question? You can tell with how the asker lowers her head, awkward facial expression. shoulders up like \"IDK what I'm asking here.\" permalink award report block reply Iremembermypassword 4 points 3 days ago The Reporter did not feel retarded. She enjoyed talking down to Sidney. permalink parent award report block reply\nIremembermypassword 4 points 3 days ago The Reporter did not feel retarded. She enjoyed talking down to Sidney. permalink parent award report block reply\nDaffy 2 points 3 days ago I thought it was sperm swimming away from, and toward the egg lol. permalink award report block reply\n8bit_mixtape 1 points 3 days ago goddamn smarmy expression the host got permalink award report block reply TrumpAndGodWin 1 points 3 days ago A more evil gollum. permalink parent award report block reply\nTrumpAndGodWin 1 points 3 days ago A more evil gollum. permalink parent award report block reply\nVaultdwelIer 1 points 3 days ago why is this a thing? permalink award report block reply\nAppalachianTactical 1 points 3 days ago Liberals have more empathy and moral allocation of outgroups and people and things least related to them. Conservatives have more empathy and moral allocation for friends, family and community. You couldnt get it without the study so not fair to say someone doesnt get it without having seen the source. Study just supports what we have known for a long time and backs up the concept of suicidal empathy and white liberal women being the only people ever to have outgroup preference. This is also why they are more common victims of crime. permalink award report block reply\nNADSAQ 1 points 3 days ago i thought this was a map of eye-tracking movement, as in the host was so repulsive that people looked away permalink award report block reply\nExileOnClownStreet 0 points 3 days ago If only they had left out 6, 7, 8 and 9, I'd be down with the whole list. Who am I to condemn an alien life form I've never met except on Star Trek? permalink award report block reply OSmash 1 points 3 days ago 6🫲🫱7? permalink parent award report block reply ExileOnClownStreet 1 points 3 days ago I also would have modified \"all mammals\" by adding the limitation \"except homo sapiens\". permalink parent award report block reply\nOSmash 1 points 3 days ago 6🫲🫱7? permalink parent award report block reply ExileOnClownStreet 1 points 3 days ago I also would have modified \"all mammals\" by adding the limitation \"except homo sapiens\". permalink parent award report block reply\nExileOnClownStreet 1 points 3 days ago I also would have modified \"all mammals\" by adding the limitation \"except homo sapiens\". permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:57:06.887909Z"
}