{
  "id": "1ARK9iqP1F",
  "url": "https://patriots.win/p/1ARK9iqP1F/spotter-alerts-illegals-about-ic/c",
  "content": "1294 Spotter Alerts Illegals About ICE Operations posted 2 days ago by rdvs34283 180 comments award share report block Derrick Evans @DerrickEvans4WV • 2d This woman is reportedly a \"spotter\" who alerts illegals about ICE operations. She instantly regrets her actions as soon as she gets confronted by federal agents: “Please. Please. Please. I’m just a mom.”\n180 comments Sort by Top Top New Worst Old Save Ronaldus 220 points 2 days ago Fail. Should have arrested her. permalink award report block reply Taqiyya_Mockingbird 139 points 2 days ago They would never show us the same mercy. permalink parent award report block reply Formerlurker92 62 points 2 days ago They've had power, we know what they'd do. At best you're going to jail without trial. If they get total control we all end up in ditches permalink parent award report block reply The_Return_of_User_x 8 points 2 days ago If she was anywhere within distance of the Whitehouse fence she would have been riddled. And not by questions. permalink parent award report block reply RedCapNation 4 points 2 days ago Or lampshades permalink parent award report block reply TD_Covfefe_Crusader 29 points 2 days ago The red light ticket alone would be a few hundred bucks. permalink parent award report block reply L-Train 1 points 2 days ago Not one bit! permalink parent award report block reply Formerlurker92 59 points 2 days ago This person is putting them in danger. There is an active bounty from the cartels on ice agents. This sort of behavior should be smacked down with prejudice permalink parent award report block reply Spicy_cat 35 points 2 days ago If she's helping the cartel she can get charged as a cartel member. permalink parent award report block reply goldkeyboardwarrior 14 points 2 days ago It’s probably more likely she’s doing it at the urging of Reddit and Bluesky posters and isn’t explicitly organizing it with cartel members. But the cartels still appreciate her suicidal empathy. permalink parent award report block reply Spicy_cat 6 points 2 days ago An accessory is an accessory permalink parent award report block reply view 3 more comments... Im_RickSteves_bitch 7 points 2 days ago She's \"just a mom!\" permalink parent award report block reply Tcrlaf1 6 points 2 days ago “Just a Mom!” who fell for the astroturfed bullshit on Reddit. permalink parent award report block reply GoldwaterVoter 4 points 2 days ago Sorta like \"Maryland dad\". permalink parent award report block reply NURSE187 7 points 2 days ago She is likely helping the cartels, unwittingly but, an assist is an assist. permalink parent award report block reply Im_RickSteves_bitch 7 points 2 days ago Why do we assume it's unwittingly? permalink parent award report block reply Im_RickSteves_bitch 4 points 2 days ago Why do you think she's doing it? permalink parent award report block reply Klown_Kutz 2 points 2 days ago Because she's a woman. permalink parent award report block reply Patriots4TN 21 points 2 days ago Make an example for the kids. permalink parent award report block reply RuprechtThaMonkeyBoy 9 points 2 days ago Seize the car and deport it to Mexico so the illegal immigrants will have something to drive. As a good liberal she should be fine with that. Something, something…..Each according to their needs.. permalink parent award report block reply Ronaldus 4 points 2 days ago Fixed it for you. 😆 Seize the car, fill it like a clown car full of illegals, and deport it to Mexico so the illegal immigrants will have something to drive. permalink parent award report block reply TrumpYouMagaFrenner 4 points 2 days ago Fill it full of illegals drive into the ocean permalink parent award report block reply WarCry 3 points 2 days ago I hear Elon Musk likes to launch cars into space permalink parent award report block reply Ronaldus 2 points 2 days ago We have a plan upgrade! permalink parent award report block reply SDsc0rch 5 points 2 days ago at some point we should just deport these ppl too lets see how long their little movement holds up after we start deporting them too permalink parent award report block reply load 10 more comments... OutlawPurpleHairDye 68 points 2 days ago You usually have to pay people to do this type of retarded shit.  Thankfully, leftist wine-moms with TDS will do this for free. permalink award report block reply _Sully_ 26 points 2 days ago Yeah, she's driving the EV mustang. That's the official car of the well off SAHM AWFL. permalink parent award report block reply midgetpornrocks 23 points 2 days ago Ugly af. So is the car. permalink parent award report block reply DarthEP 2 points 2 days ago I Call It The \"Mock-E-Reee\" Ever Since Ford Announced That BS - Just SMH. permalink parent award report block reply diverscale 2 points 2 days ago There are a lot of this ugly turd here in the streets, I love shouting at them \"mustang for fags!\" When they have their windows rolled down kek permalink parent award report block reply Taqiyya_Mockingbird 3 points 2 days ago It’s a crime against humanity what they have to the Mustang permalink parent award report block reply FusionBlack 2 points 2 days ago Worse than a Subaru. permalink parent award report block reply RedWizard 2 points 1 day ago What have the Japanese ever done to you... other than Pearl Harbor? permalink parent award report block reply Formerlurker92 7 points 2 days ago If we start arresting them the cost will rise pretty quickly permalink parent award report block reply Hamadryad 51 points 2 days ago Let her go?  What BS is this? permalink award report block reply YaharaRiver 11 points 2 days ago Don’t worry, some brand new rookie will be assigned to digging up her life history and logging it all into the database. She’s marked. There were reporters in the car, it’s best to show their cooperative  spirit and be focused on criminal targets, not like emotional sandboys who gonna show sum bitch who’s boss around here. permalink parent award report block reply IAmDisappoint 36 points 2 days ago Should have arrested that bitch. Not so brave now huh? Fucking piece of shit. permalink award report block reply Belgian_Rofl 7 points 2 days ago Deport to South Sudan, let her enjoy the \"diversity\" she clearly desires. permalink parent award report block reply Rumpleshitskin 3 points 2 days ago This is the answer! permalink parent award report block reply notatallimsure 33 points 2 days ago A mom doing illegal shit and impeding law enforcement. permalink award report block reply ColonelKlink 12 points 2 days ago She should be arrested. Anyone stopping deportations of illegal aliens needs serious jail time. permalink parent award report block reply DarthEP 4 points 2 days ago She's Raising The Next Generation Of Marxist Monsters. permalink parent award report block reply nolefthandshakes 4 points 2 days ago true privilege it seems. above the law even when committing felonies ON VIDEO. fuck this country. this isn’t America at all permalink parent award report block reply hey_spike 24 points 2 days ago They should have delayed her much longer. Make her reconsider her life choices.  Make her miss appointments,  ruin her day. permalink award report block reply ModernKnight 9 points 2 days ago Indeed.  They can hold someone 24 hours without charges, at least hold her for 12.  Just put her in a cell by herself, tell her nothing, then let her out 12 hours later.  She would have absolutely no legal leg to stand on to go after anyone, and there's no chance of some Soros faggot interfering. permalink parent award report block reply edxzxz 10 points 2 days ago Arrest her on a Friday and she'll sit in holding until a Judge can hear her crying bullshit some time on Monday.  I only have the Sheriff serve warrants of execution (against goods and chattels, not actual 'execution') on Fridays for this reason.  Make the fuckers sit all weekend. permalink parent award report block reply anotherrandomname 3 points 2 days ago Plus her car will be sitting in the impound lot racking up fees over the weekend. permalink parent award report block reply Deplorable_in_PA 4 points 2 days ago ICE agents probably had bigger turds to flush and didn't want to bother with some dumbshit TDS boxed wine aunt.  They needed to grab the target, then scoot. permalink parent award report block reply The_Emperor 1 points 2 days ago At least he got her name and plates permalink parent award report block reply Rumpleshitskin 1 points 2 days ago Indeed. Where is the consideration for my kids, who will have to live amongst hers? permalink parent award report block reply Snek_Plissken 22 points 2 days ago This clip doesn't even show all the crazy shit she was doing. She was driving around like she is some sort of entitled crazy person. Swerving around traffic and she nearly hit a school bus. Then they busted her and told her she is going to be federally charged. Now she is just a normal person? permalink award report block reply Nibba2 4 points 2 days ago She didn’t just nearly hit a school bus, she was circling it, so illegal U-turns along with almost hitting the bus. Certainly putting children in bodily danger is enough to get the other cops to pay her a visit but it won’t be. permalink parent award report block reply Michalusmichalus 3 points 2 days ago School bus drivers are some of the best drivers. If school bus drivers wanted to fuck with assholes using them as cover, they absolutely could. permalink parent award report block reply Wrexxis780 17 points 2 days ago PLZ IM A MOM And shes not with her kids doing crimes. TOO FUCKING BAD BITCH permalink award report block reply sordfysh PRO 8 points 2 days ago I doubt she's a mom. These people are liars and cheats. But this was a televised moment, so they want to look like they are being nice. permalink parent award report block reply airborne3502 14 points 2 days ago I'm for using spotters on a illegal aliens just not in the way she's doing it. permalink award report block reply TiggerLovingPooh 14 points 2 days ago This is the exact problem with the country. ARREST PEOPLE WHO BREAK THE FUCKING LAW. The real downfall of a republic is the failure to enforce the law as written. Why go through all the trouble of voting, legislating, judicial oversight, if the fucking law isn't applied in the first place? permalink award report block reply Formerlurker92 12 points 2 days ago Why is everyone so nice to these cunts permalink award report block reply TiggerLovingPooh 13 points 2 days ago It's the exact reason they are emboldened to be cunts to begin with. permalink parent award report block reply tradcathbugman 11 points 2 days ago Just arrest her and move on if she's causing a problem, she's scared now but in 20 minutes she'll remember that she got away with it, she'll be back pulling this shit, and any of her allies who see this will be emboldened. This officer really seems to me like he's enjoying scaring her too much.  The only time I've seen cops act like this on body cam is when somebody is being a dick to them and there's nothing they can actually do about it. permalink award report block reply BattleOfSaratoga 11 points 2 days ago Look how she sped off.  100% Laughing and thinking to herself, haha stupid fucking pigs my little poor im just a Mom stunt WORKED.  Deputy Field Office Director, DO BETTER. permalink award report block reply RentFree2020 8 points 2 days ago Why aren't they fined or arrested? Cops will yell ticket us if we flash or warn of a friggin speed trap. It could eventually cause harm or death if doing so. How's this acceptable to run around recklessly chasing cops and preventing the deportations of potential criminals and potential future murders, drug overdoses, and rapes? I though we weren't going to fuck around this time? permalink award report block reply magaspif 1 points 2 days ago Feds probably don't have holding facilities and that area is filled with faggot cops. permalink parent award report block reply edxzxz 8 points 2 days ago They should have dragged her out of her car and beaten her mercilessly on the side of the road just for driving a Ford Mustang SUV.  What kind of retard drives a Mustang SUV? permalink award report block reply Tardigrade 5 points 2 days ago OK I laughed. permalink parent award report block reply DarthEP 2 points 2 days ago The Mock-E-Reee!!!! permalink parent award report block reply Bob_sacamanao 7 points 2 days ago What about the ticket for running g a red light? You NEED TO prosecute these liberal deranged democrats! permalink award report block reply lifeisahologram 3 points 2 days ago I don’t think they can issue tickets for that, that’s probably a city or state only enforcement. I think their only leverage is arresting for impediment, obstruction, etc of federal officers. permalink parent award report block reply mygovisacommie 7 points 2 days ago “I’m just a mom.” They why the fuck are you doing this shit? Honestly. If you are just some innocent mother who didn’t mean to hurt anyone, then why were you doing it? You knew what you were doing. Should have arrested her. permalink award report block reply lifeisahologram 7 points 2 days ago I find it ironic that a guy who looks and sounds of Hispanic heritage is trying to enforce immigration laws and this White woman with no noticeable foreign sounding accent is trying to help others break them. permalink award report block reply DarthEP 4 points 2 days ago You Noticed. permalink parent award report block reply lifeisahologram 4 points 2 days ago “I’m something of a noticer myself” permalink parent award report block reply Kavantar 6 points 2 days ago \"I'm just a mom\"... Uses her children as shields. permalink award report block reply Scatter-Shot 6 points 2 days ago And your kids will be better off with you in prison. permalink award report block reply StCharlie 6 points 2 days ago Get the state, city, and name of this person.  I.C.E may have let her go but we should not. permalink award report block reply CaptainWinston 4 points 2 days ago That fucking Karen should have gone to jail. It would be great for her kids to come visit her on family day, that's how the kids don't turn out like Mom. permalink award report block reply sadierose 4 points 2 days ago at least a ticket for blowing red lights. should have popped her tires permalink award report block reply booblitchutz 4 points 2 days ago The true \"spotters\" are in local PD and ICE. Plenty of people are leaking the exact locations of planned raids so the \"protesters\" can show up before hand, along with the food tables and whistle deliveries, etc. It couldn't be more obvious. The \"protesters\" know a day or more before the raids. permalink award report block reply fuckjbidenok 4 points 2 days ago Zero consequences just emboldens them. This is how we got here in the first place. permalink award report block reply redneckrevival 4 points 2 days ago Should have busted her fucking idiot ass hard!!!! permalink award report block reply MAGAFrogInfinity 4 points 2 days ago How did we get to this point as a society where a \"mom\" is out in public, openly obstructing law enforcement from protecting the mom, her family, and the rest of us? When did good become evil, and evil good? permalink award report block reply worldowedexplanation 1 points 2 days ago Dumb liberal cunts in Chicago are all doing this. Pathetic virtue signaling. permalink parent award report block reply Prandogolio 4 points 2 days ago I'm just a mom! Oh, thirty seconds ago she was an antifascist guerilla freedom fighter, but as soon as there's a possibility of consequences, she wants to pull out the Pussy Pass. Women are insufferable. permalink award report block reply PresidentialPepe 4 points 2 days ago Tone changed real quick. Enjoy prison permalink award report block reply Gletkin 11 points 2 days ago She didn’t even get a ticket. permalink parent award report block reply Transparency 2 points 2 days ago Watch the video- He let her go! permalink parent award report block reply PresidentialPepe 3 points 2 days ago That's a shame. Heard him say he's referring her for criminal enforcement twice and kept scrolling. permalink parent award report block reply Transparency 2 points 2 days ago You're correct. I missed that yesterday and today. 😂👍👍 permalink parent award report block reply Icepck 4 points 2 days ago Bullshit! Make an example out of her, find out who she works with and go after anybody organizing the crime of impedance. permalink award report block reply Mindcrym 4 points 2 days ago If all liberal women were euthanized,  the Republic would flourish like never before. permalink award report block reply Fangerang 4 points 2 days ago So not only is she attempting to impede ICE operations, but they have her on camera running a red light in pursuit of the ICE vehicles. And they just fucking let her go??? Pathetic. permalink award report block reply Prandogolio 3 points 2 days ago There's no consequences for commies. permalink parent award report block reply Tookens 3 points 2 days ago She is a poster-child for prosecution.  They HAVE to go after people like this. permalink parent award report block reply MissileToad 3 points 2 days ago Wait, what? Why are they just letting her go home?? permalink award report block reply Prandogolio 3 points 2 days ago Of course.   The right is scared of leftists so we let them do whatever they want. permalink parent award report block reply worldowedexplanation 1 points 2 days ago She needs to be doxxed at least permalink parent award report block reply Trump-16-20-24-28-32 3 points 2 days ago She's not \"just a mom.\"  She's also impeding in federal business. permalink award report block reply Badfinz_FL 3 points 2 days ago The spotter will be e arrested permalink award report block reply IdahoMAGAmom 3 points 2 days ago why was her stupid ass not arrested????   keep treating them like toddlers, they'll keep acting like toddlers.  i'm so disgusted. permalink award report block reply hillaryforprison 3 points 2 days ago Oregon. Figures. She will do this again though, she should have been arrested. Never fall for the fake sorry act, she flipped you off not even a minute before. permalink award report block reply Pats5x 3 points 2 days ago 2, 3 years Dagestan and forget permalink award report block reply thelastlast 3 points 2 days ago they always say please.  makes them a thousand times worse. permalink award report block reply h203h 3 points 2 days ago should pulled her dumbass out and arrested her for being fucking retarded permalink award report block reply throttlejohnson 3 points 2 days ago did he say she ran a red light? was obviously speeding..wtf? oregon plates also, so no surprise there. was also wondering what kind of person buys a mustang suv... permalink award report block reply CommietownUSA 3 points 2 days ago Oh look liberal white woman permalink award report block reply SavingPrivateGrace 2 points 2 days ago She's just a mom and she probably has experience with stalking her ex.  wrf would lead someone to even enjoy doing this. permalink award report block reply gaijin_ronin 2 points 2 days ago If you know who she is and where she is make her ass disappear.  Problem solved. permalink award report block reply Thereiwas001 2 points 2 days ago A mom putting her children at risk.\nLock her up,  save a child. permalink award report block reply Original_Dankster 2 points 2 days ago Started off well but the ending fucking sucked. 3/10 permalink award report block reply HenkZeilstra 2 points 2 days ago Liberal women should be flagged as terrorists and traitors permalink award report block reply Michalusmichalus 2 points 2 days ago Everything she said, and did is what the viral shit told them to say. permalink parent award report block reply Live_free_or_die_55 2 points 2 days ago Arrest the bitch!! permalink award report block reply Tiberius1 2 points 2 days ago Ha ha. This is why we are in a civil war. They would arrest us and charge us with 30 federal crimes.  Raid our homes, shoot out dogs, intimidate our family.  Conservatives need to start acting like we are in a state of war. Because we are. permalink award report block reply Spacemonkey 2 points 2 days ago Should have pulled her out of her car and cuffed her ass and taken her to jail.  The only thing the left understands is power and by not arresting her showed that the right refuses to wield the power they have. Democrats understand this that's why they do shit like arresting Trump's lawyers and raiding his wife's panty drawer. Absolutely infuriating how spineless the GOP fucking is. permalink award report block reply conservativefrank 2 points 2 days ago On a Houston conservative radio show, the host called the hotline about the spotting. The prompts were all in Spanish. Host: \"That's interesting given their claim that illegals aren't all from Mexico, are a diverse group of people from all over the world.\" The co-host pointed out that most of the people who call are white women, so that makes it even odder that it's all in Spanish. The instructions these women get for using their whistles to alert about ICE activity are short bursts if ICE is just in the area, \"Twee...tweee...tweee...tweee.\", but a long whistle if ICE is actively \"abducting\" people, \"Tweeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee!\". Sounds a lot like \"Reeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee\" to me. permalink award report block reply y_do_i_need_to_hide 2 points 2 days ago No, sister, you are an accessory to a felony. permalink award report block reply Eddie_Vanjovi 2 points 2 days ago Such godless people. permalink award report block reply TexasBrowncoat 2 points 2 days ago It's always the white liberal women.... They're all \"Fuck you\" until it's \"I'm just a mom\". No lessons learned here. permalink award report block reply MoldyLocksNesMonste 2 points 2 days ago Fail. Bitch should have been arrested. permalink award report block reply SarsourCuntReturns 2 points 2 days ago I don't know if it's just me, but she looked very unruly in her exchange. I vote she receives that good old Edison medicine. permalink award report block reply For_All_Mankind 2 points 2 days ago Get a hobby, Karen permalink award report block reply MinneMAGA 2 points 2 days ago No, you're just a traitor permalink award report block reply jonnyuno 2 points 2 days ago Dumb enough to buy a Mach E Mustang. That's dumb. It's like a trans homo Mustang. Good job Ford. permalink award report block reply paramour 2 points 2 days ago Wish they woulda cuffed-n-stuffed her ass to jail. smdh permalink award report block reply 65RIVI 2 points 2 days ago feral suburban wine mom permalink award report block reply ScoobyDum 2 points 2 days ago “I’m just a mom” Then you can see your kids in jail when they visit permalink award report block reply BillyMahoney 2 points 2 days ago They use our values against us. The left fabricates lies and fully prosecutes their enemies (us) without an ethical consideration. Our team allows them to repeat their actions. permalink award report block reply AwShitHereWeGoAgain 2 points 2 days ago Hang her!!!!!! permalink award report block reply barwhack 2 points 2 days ago Just-a-mom should go to jail. Just like a crack head. Or a traitor. Here brood of trannies doesn't need her anyway. permalink award report block reply Shaffro 2 points 2 days ago If you don't arrest these liberal bitches they won't stop. permalink award report block reply DITTOPatriot 1 points 2 days ago As it is her right. Never give up your rights for what you perceive as a win for your side. And don't play the officer safety card. If I want to blink my light or stand with a sign 30 yards ahead warning my fellow citizens that a trap is up ahead, yeah, that's my right. permalink award report block reply dres3 1 points 2 days ago Oddball idea.  Make Primary objective be the 'spotters/alerters' and secondary objective being the illegals temporarily within the same operation.  Need the spotters/alerters to be removed as a multiplicative effect. permalink award report block reply MakeAmericaGreat9 1 points 2 days ago Repost from last week. permalink award report block reply Damaged_Dirk 1 points 2 days ago This is not alerting people of a speed trap or a DUI check point. There needs to be a consequence. permalink award report block reply TDAF 1 points 2 days ago She drove away feeling she was victorious in this situation. permalink award report block reply GuidedDisinfo 1 points 2 days ago That agent violated her civil rights because he didn’t treat her the same as he would have treated a man.  He needs to be reprimanded for his blatant bias and directed to arrest even women, regardless of their tears. permalink award report block reply MasterVader2U 1 points 1 day ago Fucking larper gets to tell everyone how she got away. permalink award report block reply PronounParty 1 points 2 days ago Mostly peaceful mother permalink award report block reply Hydris 1 points 2 days ago Pussy, Should have arrested her. Even ignoring everything else. Im tired of the pussy pass innocent victim shit they pull. \"i'm a just a mom\" Who cares, should have thought of that before hand. permalink award report block reply asiatrails 1 points 2 days ago Too soft permalink award report block reply Beat_to_Quarters 1 points 2 days ago Regret what? He let her go with a warning. Zero accountability. permalink award report block reply CrankyCrab 1 points 2 days ago Bitch should have been arrested and her vehicle impounded. That would have sent a message. Stop being pussies! permalink award report block reply Michalusmichalus 1 points 2 days ago The fall foliage in that video is so pretty. permalink award report block reply Oodles 1 points 2 days ago Women are unstable and governed by their emotions. We need to start throwing some of these criminals in prison so they can tell their friends that prison isn't the day spa they think it is permalink award report block reply Than0sIII 1 points 2 days ago Hold them accountable and only the truly insane will keep doing this shit.  And it'll be much easier to deal with them. permalink award report block reply PatriotDawg 1 points 2 days ago A good, hard thrashing with a buggy whip would remove her from any future involvement. Give her more time to be a mom. permalink award report block reply ravonaf 1 points 2 days ago Wow, they let her go. She is just going to do it again. These were the same people chanting \"No one is above the law!\" just a couple of years ago. I guarantee this woman has no regrets. permalink award report block reply worldowedexplanation 1 points 2 days ago Idiots in Chicago are doing this, they hand out whistles so they can warn about ICE. permalink award report block reply bratt 1 points 2 days ago Whistles are also used by antifa in protests. This woman though had a green WNBA dildo hanging from her neck. permalink parent award report block reply AgnesDomini 1 points 2 days ago FFS, ARREST THEM! permalink award report block reply Eurpoean 1 points 2 days ago This is why we lose. Arrest the cunt, federally charge her, strip her voting rights, and teach her a real lesson. permalink award report block reply HunterBidensPC 1 points 2 days ago She’s not a fucking mom and even if she was it doesn’t change what she did. And she tried to get away and caused him to hit her car. Resisting and causing damage to a federal vehicle my tax dollars pay for? How about we hold people accountable? She’s going to flick you off and go right back to doing it again permalink award report block reply BahamaDon 1 points 2 days ago Such disappointment.  Where was the bloody skull? permalink award report block reply Lynnforthetruth 1 points 2 days ago Arrest her ass permalink award report block reply DoMe22 1 points 2 days ago Should have put her away. For a long, long time. And thrown away the key. permalink award report block reply HunterBidensPC 1 points 2 days ago Someone find out who this is. They were gonna arrest her until they ran her license permalink award report block reply Koikatrose 1 points 2 days ago Home to change her panties....\nShould have arrested her liberal butt. permalink award report block reply worldowedexplanation 1 points 2 days ago DOX HER. She’s a fucking terrorist now, she’s not “just a mom.” Sick of this shit. Her plate is visible. Someone knows her. permalink award report block reply Psalm-118_24 1 points 1 day ago WTH???!!! why is this azzhat talking to her, she should have been pulled out of her car, her car towed to impoundment and she should be sitting in jail awaiting trial. permalink award report block reply aqua27 1 points 2 days ago Arrest her so she spreads the word that you will be arrested if you do that shit. permalink award report block reply patrioticwinning3 1 points 2 days ago Deport! permalink award report block reply RightIsMight 1 points 2 days ago Fucking coward mexacant agent. No wonder we are so fucked. What do you, OP, even care anymore for? This fucking faggot fed doesn't care. Why should you? permalink award report block reply Gfloydvotestrump 1 points 2 days ago Openly says she runs a red light and doesn't even do anything about it, the IRL equivalent of a \"sternly worded letter\". Pathetic excuse for an agent. This is why nothing ever gets fucking done. I think old man river is about at that mandatory retirement age. permalink award report block reply PiratePatriotAu 0 points 2 days ago Most likely she was paid. A sane person isnt that dumb. permalink award report block reply MinnieWhittaker 0 points 2 days ago Everyone's a gangster until suddenly actions have consequences. permalink award report block reply USNVET71 -2 points 2 days ago No, you're just a moron. permalink award report block reply new_guy2 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nRonaldus 220 points 2 days ago Fail. Should have arrested her. permalink award report block reply Taqiyya_Mockingbird 139 points 2 days ago They would never show us the same mercy. permalink parent award report block reply Formerlurker92 62 points 2 days ago They've had power, we know what they'd do. At best you're going to jail without trial. If they get total control we all end up in ditches permalink parent award report block reply The_Return_of_User_x 8 points 2 days ago If she was anywhere within distance of the Whitehouse fence she would have been riddled. And not by questions. permalink parent award report block reply RedCapNation 4 points 2 days ago Or lampshades permalink parent award report block reply TD_Covfefe_Crusader 29 points 2 days ago The red light ticket alone would be a few hundred bucks. permalink parent award report block reply L-Train 1 points 2 days ago Not one bit! permalink parent award report block reply Formerlurker92 59 points 2 days ago This person is putting them in danger. There is an active bounty from the cartels on ice agents. This sort of behavior should be smacked down with prejudice permalink parent award report block reply Spicy_cat 35 points 2 days ago If she's helping the cartel she can get charged as a cartel member. permalink parent award report block reply goldkeyboardwarrior 14 points 2 days ago It’s probably more likely she’s doing it at the urging of Reddit and Bluesky posters and isn’t explicitly organizing it with cartel members. But the cartels still appreciate her suicidal empathy. permalink parent award report block reply Spicy_cat 6 points 2 days ago An accessory is an accessory permalink parent award report block reply view 3 more comments... Im_RickSteves_bitch 7 points 2 days ago She's \"just a mom!\" permalink parent award report block reply Tcrlaf1 6 points 2 days ago “Just a Mom!” who fell for the astroturfed bullshit on Reddit. permalink parent award report block reply GoldwaterVoter 4 points 2 days ago Sorta like \"Maryland dad\". permalink parent award report block reply NURSE187 7 points 2 days ago She is likely helping the cartels, unwittingly but, an assist is an assist. permalink parent award report block reply Im_RickSteves_bitch 7 points 2 days ago Why do we assume it's unwittingly? permalink parent award report block reply Im_RickSteves_bitch 4 points 2 days ago Why do you think she's doing it? permalink parent award report block reply Klown_Kutz 2 points 2 days ago Because she's a woman. permalink parent award report block reply Patriots4TN 21 points 2 days ago Make an example for the kids. permalink parent award report block reply RuprechtThaMonkeyBoy 9 points 2 days ago Seize the car and deport it to Mexico so the illegal immigrants will have something to drive. As a good liberal she should be fine with that. Something, something…..Each according to their needs.. permalink parent award report block reply Ronaldus 4 points 2 days ago Fixed it for you. 😆 Seize the car, fill it like a clown car full of illegals, and deport it to Mexico so the illegal immigrants will have something to drive. permalink parent award report block reply TrumpYouMagaFrenner 4 points 2 days ago Fill it full of illegals drive into the ocean permalink parent award report block reply WarCry 3 points 2 days ago I hear Elon Musk likes to launch cars into space permalink parent award report block reply Ronaldus 2 points 2 days ago We have a plan upgrade! permalink parent award report block reply SDsc0rch 5 points 2 days ago at some point we should just deport these ppl too lets see how long their little movement holds up after we start deporting them too permalink parent award report block reply load 10 more comments...\nTaqiyya_Mockingbird 139 points 2 days ago They would never show us the same mercy. permalink parent award report block reply Formerlurker92 62 points 2 days ago They've had power, we know what they'd do. At best you're going to jail without trial. If they get total control we all end up in ditches permalink parent award report block reply The_Return_of_User_x 8 points 2 days ago If she was anywhere within distance of the Whitehouse fence she would have been riddled. And not by questions. permalink parent award report block reply RedCapNation 4 points 2 days ago Or lampshades permalink parent award report block reply TD_Covfefe_Crusader 29 points 2 days ago The red light ticket alone would be a few hundred bucks. permalink parent award report block reply L-Train 1 points 2 days ago Not one bit! permalink parent award report block reply\nFormerlurker92 62 points 2 days ago They've had power, we know what they'd do. At best you're going to jail without trial. If they get total control we all end up in ditches permalink parent award report block reply The_Return_of_User_x 8 points 2 days ago If she was anywhere within distance of the Whitehouse fence she would have been riddled. And not by questions. permalink parent award report block reply RedCapNation 4 points 2 days ago Or lampshades permalink parent award report block reply\nThe_Return_of_User_x 8 points 2 days ago If she was anywhere within distance of the Whitehouse fence she would have been riddled. And not by questions. permalink parent award report block reply\nRedCapNation 4 points 2 days ago Or lampshades permalink parent award report block reply\nTD_Covfefe_Crusader 29 points 2 days ago The red light ticket alone would be a few hundred bucks. permalink parent award report block reply\nL-Train 1 points 2 days ago Not one bit! permalink parent award report block reply\nFormerlurker92 59 points 2 days ago This person is putting them in danger. There is an active bounty from the cartels on ice agents. This sort of behavior should be smacked down with prejudice permalink parent award report block reply Spicy_cat 35 points 2 days ago If she's helping the cartel she can get charged as a cartel member. permalink parent award report block reply goldkeyboardwarrior 14 points 2 days ago It’s probably more likely she’s doing it at the urging of Reddit and Bluesky posters and isn’t explicitly organizing it with cartel members. But the cartels still appreciate her suicidal empathy. permalink parent award report block reply Spicy_cat 6 points 2 days ago An accessory is an accessory permalink parent award report block reply view 3 more comments... Im_RickSteves_bitch 7 points 2 days ago She's \"just a mom!\" permalink parent award report block reply Tcrlaf1 6 points 2 days ago “Just a Mom!” who fell for the astroturfed bullshit on Reddit. permalink parent award report block reply GoldwaterVoter 4 points 2 days ago Sorta like \"Maryland dad\". permalink parent award report block reply NURSE187 7 points 2 days ago She is likely helping the cartels, unwittingly but, an assist is an assist. permalink parent award report block reply Im_RickSteves_bitch 7 points 2 days ago Why do we assume it's unwittingly? permalink parent award report block reply Im_RickSteves_bitch 4 points 2 days ago Why do you think she's doing it? permalink parent award report block reply Klown_Kutz 2 points 2 days ago Because she's a woman. permalink parent award report block reply\nSpicy_cat 35 points 2 days ago If she's helping the cartel she can get charged as a cartel member. permalink parent award report block reply goldkeyboardwarrior 14 points 2 days ago It’s probably more likely she’s doing it at the urging of Reddit and Bluesky posters and isn’t explicitly organizing it with cartel members. But the cartels still appreciate her suicidal empathy. permalink parent award report block reply Spicy_cat 6 points 2 days ago An accessory is an accessory permalink parent award report block reply view 3 more comments... Im_RickSteves_bitch 7 points 2 days ago She's \"just a mom!\" permalink parent award report block reply Tcrlaf1 6 points 2 days ago “Just a Mom!” who fell for the astroturfed bullshit on Reddit. permalink parent award report block reply GoldwaterVoter 4 points 2 days ago Sorta like \"Maryland dad\". permalink parent award report block reply NURSE187 7 points 2 days ago She is likely helping the cartels, unwittingly but, an assist is an assist. permalink parent award report block reply Im_RickSteves_bitch 7 points 2 days ago Why do we assume it's unwittingly? permalink parent award report block reply\ngoldkeyboardwarrior 14 points 2 days ago It’s probably more likely she’s doing it at the urging of Reddit and Bluesky posters and isn’t explicitly organizing it with cartel members. But the cartels still appreciate her suicidal empathy. permalink parent award report block reply Spicy_cat 6 points 2 days ago An accessory is an accessory permalink parent award report block reply view 3 more comments...\nSpicy_cat 6 points 2 days ago An accessory is an accessory permalink parent award report block reply view 3 more comments...\nIm_RickSteves_bitch 7 points 2 days ago She's \"just a mom!\" permalink parent award report block reply Tcrlaf1 6 points 2 days ago “Just a Mom!” who fell for the astroturfed bullshit on Reddit. permalink parent award report block reply GoldwaterVoter 4 points 2 days ago Sorta like \"Maryland dad\". permalink parent award report block reply\nTcrlaf1 6 points 2 days ago “Just a Mom!” who fell for the astroturfed bullshit on Reddit. permalink parent award report block reply\nGoldwaterVoter 4 points 2 days ago Sorta like \"Maryland dad\". permalink parent award report block reply\nNURSE187 7 points 2 days ago She is likely helping the cartels, unwittingly but, an assist is an assist. permalink parent award report block reply Im_RickSteves_bitch 7 points 2 days ago Why do we assume it's unwittingly? permalink parent award report block reply\nIm_RickSteves_bitch 7 points 2 days ago Why do we assume it's unwittingly? permalink parent award report block reply\nIm_RickSteves_bitch 4 points 2 days ago Why do you think she's doing it? permalink parent award report block reply Klown_Kutz 2 points 2 days ago Because she's a woman. permalink parent award report block reply\nKlown_Kutz 2 points 2 days ago Because she's a woman. permalink parent award report block reply\nPatriots4TN 21 points 2 days ago Make an example for the kids. permalink parent award report block reply\nRuprechtThaMonkeyBoy 9 points 2 days ago Seize the car and deport it to Mexico so the illegal immigrants will have something to drive. As a good liberal she should be fine with that. Something, something…..Each according to their needs.. permalink parent award report block reply Ronaldus 4 points 2 days ago Fixed it for you. 😆 Seize the car, fill it like a clown car full of illegals, and deport it to Mexico so the illegal immigrants will have something to drive. permalink parent award report block reply TrumpYouMagaFrenner 4 points 2 days ago Fill it full of illegals drive into the ocean permalink parent award report block reply WarCry 3 points 2 days ago I hear Elon Musk likes to launch cars into space permalink parent award report block reply Ronaldus 2 points 2 days ago We have a plan upgrade! permalink parent award report block reply\nRonaldus 4 points 2 days ago Fixed it for you. 😆 Seize the car, fill it like a clown car full of illegals, and deport it to Mexico so the illegal immigrants will have something to drive. permalink parent award report block reply TrumpYouMagaFrenner 4 points 2 days ago Fill it full of illegals drive into the ocean permalink parent award report block reply WarCry 3 points 2 days ago I hear Elon Musk likes to launch cars into space permalink parent award report block reply Ronaldus 2 points 2 days ago We have a plan upgrade! permalink parent award report block reply\nTrumpYouMagaFrenner 4 points 2 days ago Fill it full of illegals drive into the ocean permalink parent award report block reply WarCry 3 points 2 days ago I hear Elon Musk likes to launch cars into space permalink parent award report block reply Ronaldus 2 points 2 days ago We have a plan upgrade! permalink parent award report block reply\nWarCry 3 points 2 days ago I hear Elon Musk likes to launch cars into space permalink parent award report block reply\nRonaldus 2 points 2 days ago We have a plan upgrade! permalink parent award report block reply\nSDsc0rch 5 points 2 days ago at some point we should just deport these ppl too lets see how long their little movement holds up after we start deporting them too permalink parent award report block reply\nOutlawPurpleHairDye 68 points 2 days ago You usually have to pay people to do this type of retarded shit.  Thankfully, leftist wine-moms with TDS will do this for free. permalink award report block reply _Sully_ 26 points 2 days ago Yeah, she's driving the EV mustang. That's the official car of the well off SAHM AWFL. permalink parent award report block reply midgetpornrocks 23 points 2 days ago Ugly af. So is the car. permalink parent award report block reply DarthEP 2 points 2 days ago I Call It The \"Mock-E-Reee\" Ever Since Ford Announced That BS - Just SMH. permalink parent award report block reply diverscale 2 points 2 days ago There are a lot of this ugly turd here in the streets, I love shouting at them \"mustang for fags!\" When they have their windows rolled down kek permalink parent award report block reply Taqiyya_Mockingbird 3 points 2 days ago It’s a crime against humanity what they have to the Mustang permalink parent award report block reply FusionBlack 2 points 2 days ago Worse than a Subaru. permalink parent award report block reply RedWizard 2 points 1 day ago What have the Japanese ever done to you... other than Pearl Harbor? permalink parent award report block reply Formerlurker92 7 points 2 days ago If we start arresting them the cost will rise pretty quickly permalink parent award report block reply\n_Sully_ 26 points 2 days ago Yeah, she's driving the EV mustang. That's the official car of the well off SAHM AWFL. permalink parent award report block reply midgetpornrocks 23 points 2 days ago Ugly af. So is the car. permalink parent award report block reply DarthEP 2 points 2 days ago I Call It The \"Mock-E-Reee\" Ever Since Ford Announced That BS - Just SMH. permalink parent award report block reply diverscale 2 points 2 days ago There are a lot of this ugly turd here in the streets, I love shouting at them \"mustang for fags!\" When they have their windows rolled down kek permalink parent award report block reply Taqiyya_Mockingbird 3 points 2 days ago It’s a crime against humanity what they have to the Mustang permalink parent award report block reply FusionBlack 2 points 2 days ago Worse than a Subaru. permalink parent award report block reply RedWizard 2 points 1 day ago What have the Japanese ever done to you... other than Pearl Harbor? permalink parent award report block reply\nmidgetpornrocks 23 points 2 days ago Ugly af. So is the car. permalink parent award report block reply DarthEP 2 points 2 days ago I Call It The \"Mock-E-Reee\" Ever Since Ford Announced That BS - Just SMH. permalink parent award report block reply diverscale 2 points 2 days ago There are a lot of this ugly turd here in the streets, I love shouting at them \"mustang for fags!\" When they have their windows rolled down kek permalink parent award report block reply\nDarthEP 2 points 2 days ago I Call It The \"Mock-E-Reee\" Ever Since Ford Announced That BS - Just SMH. permalink parent award report block reply diverscale 2 points 2 days ago There are a lot of this ugly turd here in the streets, I love shouting at them \"mustang for fags!\" When they have their windows rolled down kek permalink parent award report block reply\ndiverscale 2 points 2 days ago There are a lot of this ugly turd here in the streets, I love shouting at them \"mustang for fags!\" When they have their windows rolled down kek permalink parent award report block reply\nTaqiyya_Mockingbird 3 points 2 days ago It’s a crime against humanity what they have to the Mustang permalink parent award report block reply\nFusionBlack 2 points 2 days ago Worse than a Subaru. permalink parent award report block reply RedWizard 2 points 1 day ago What have the Japanese ever done to you... other than Pearl Harbor? permalink parent award report block reply\nRedWizard 2 points 1 day ago What have the Japanese ever done to you... other than Pearl Harbor? permalink parent award report block reply\nFormerlurker92 7 points 2 days ago If we start arresting them the cost will rise pretty quickly permalink parent award report block reply\nHamadryad 51 points 2 days ago Let her go?  What BS is this? permalink award report block reply YaharaRiver 11 points 2 days ago Don’t worry, some brand new rookie will be assigned to digging up her life history and logging it all into the database. She’s marked. There were reporters in the car, it’s best to show their cooperative  spirit and be focused on criminal targets, not like emotional sandboys who gonna show sum bitch who’s boss around here. permalink parent award report block reply\nYaharaRiver 11 points 2 days ago Don’t worry, some brand new rookie will be assigned to digging up her life history and logging it all into the database. She’s marked. There were reporters in the car, it’s best to show their cooperative  spirit and be focused on criminal targets, not like emotional sandboys who gonna show sum bitch who’s boss around here. permalink parent award report block reply\nIAmDisappoint 36 points 2 days ago Should have arrested that bitch. Not so brave now huh? Fucking piece of shit. permalink award report block reply Belgian_Rofl 7 points 2 days ago Deport to South Sudan, let her enjoy the \"diversity\" she clearly desires. permalink parent award report block reply Rumpleshitskin 3 points 2 days ago This is the answer! permalink parent award report block reply\nBelgian_Rofl 7 points 2 days ago Deport to South Sudan, let her enjoy the \"diversity\" she clearly desires. permalink parent award report block reply Rumpleshitskin 3 points 2 days ago This is the answer! permalink parent award report block reply\nRumpleshitskin 3 points 2 days ago This is the answer! permalink parent award report block reply\nnotatallimsure 33 points 2 days ago A mom doing illegal shit and impeding law enforcement. permalink award report block reply ColonelKlink 12 points 2 days ago She should be arrested. Anyone stopping deportations of illegal aliens needs serious jail time. permalink parent award report block reply DarthEP 4 points 2 days ago She's Raising The Next Generation Of Marxist Monsters. permalink parent award report block reply nolefthandshakes 4 points 2 days ago true privilege it seems. above the law even when committing felonies ON VIDEO. fuck this country. this isn’t America at all permalink parent award report block reply\nColonelKlink 12 points 2 days ago She should be arrested. Anyone stopping deportations of illegal aliens needs serious jail time. permalink parent award report block reply DarthEP 4 points 2 days ago She's Raising The Next Generation Of Marxist Monsters. permalink parent award report block reply\nDarthEP 4 points 2 days ago She's Raising The Next Generation Of Marxist Monsters. permalink parent award report block reply\nnolefthandshakes 4 points 2 days ago true privilege it seems. above the law even when committing felonies ON VIDEO. fuck this country. this isn’t America at all permalink parent award report block reply\nhey_spike 24 points 2 days ago They should have delayed her much longer. Make her reconsider her life choices.  Make her miss appointments,  ruin her day. permalink award report block reply ModernKnight 9 points 2 days ago Indeed.  They can hold someone 24 hours without charges, at least hold her for 12.  Just put her in a cell by herself, tell her nothing, then let her out 12 hours later.  She would have absolutely no legal leg to stand on to go after anyone, and there's no chance of some Soros faggot interfering. permalink parent award report block reply edxzxz 10 points 2 days ago Arrest her on a Friday and she'll sit in holding until a Judge can hear her crying bullshit some time on Monday.  I only have the Sheriff serve warrants of execution (against goods and chattels, not actual 'execution') on Fridays for this reason.  Make the fuckers sit all weekend. permalink parent award report block reply anotherrandomname 3 points 2 days ago Plus her car will be sitting in the impound lot racking up fees over the weekend. permalink parent award report block reply Deplorable_in_PA 4 points 2 days ago ICE agents probably had bigger turds to flush and didn't want to bother with some dumbshit TDS boxed wine aunt.  They needed to grab the target, then scoot. permalink parent award report block reply The_Emperor 1 points 2 days ago At least he got her name and plates permalink parent award report block reply Rumpleshitskin 1 points 2 days ago Indeed. Where is the consideration for my kids, who will have to live amongst hers? permalink parent award report block reply\nModernKnight 9 points 2 days ago Indeed.  They can hold someone 24 hours without charges, at least hold her for 12.  Just put her in a cell by herself, tell her nothing, then let her out 12 hours later.  She would have absolutely no legal leg to stand on to go after anyone, and there's no chance of some Soros faggot interfering. permalink parent award report block reply edxzxz 10 points 2 days ago Arrest her on a Friday and she'll sit in holding until a Judge can hear her crying bullshit some time on Monday.  I only have the Sheriff serve warrants of execution (against goods and chattels, not actual 'execution') on Fridays for this reason.  Make the fuckers sit all weekend. permalink parent award report block reply anotherrandomname 3 points 2 days ago Plus her car will be sitting in the impound lot racking up fees over the weekend. permalink parent award report block reply\nedxzxz 10 points 2 days ago Arrest her on a Friday and she'll sit in holding until a Judge can hear her crying bullshit some time on Monday.  I only have the Sheriff serve warrants of execution (against goods and chattels, not actual 'execution') on Fridays for this reason.  Make the fuckers sit all weekend. permalink parent award report block reply anotherrandomname 3 points 2 days ago Plus her car will be sitting in the impound lot racking up fees over the weekend. permalink parent award report block reply\nanotherrandomname 3 points 2 days ago Plus her car will be sitting in the impound lot racking up fees over the weekend. permalink parent award report block reply\nDeplorable_in_PA 4 points 2 days ago ICE agents probably had bigger turds to flush and didn't want to bother with some dumbshit TDS boxed wine aunt.  They needed to grab the target, then scoot. permalink parent award report block reply\nThe_Emperor 1 points 2 days ago At least he got her name and plates permalink parent award report block reply\nRumpleshitskin 1 points 2 days ago Indeed. Where is the consideration for my kids, who will have to live amongst hers? permalink parent award report block reply\nSnek_Plissken 22 points 2 days ago This clip doesn't even show all the crazy shit she was doing. She was driving around like she is some sort of entitled crazy person. Swerving around traffic and she nearly hit a school bus. Then they busted her and told her she is going to be federally charged. Now she is just a normal person? permalink award report block reply Nibba2 4 points 2 days ago She didn’t just nearly hit a school bus, she was circling it, so illegal U-turns along with almost hitting the bus. Certainly putting children in bodily danger is enough to get the other cops to pay her a visit but it won’t be. permalink parent award report block reply Michalusmichalus 3 points 2 days ago School bus drivers are some of the best drivers. If school bus drivers wanted to fuck with assholes using them as cover, they absolutely could. permalink parent award report block reply\nNibba2 4 points 2 days ago She didn’t just nearly hit a school bus, she was circling it, so illegal U-turns along with almost hitting the bus. Certainly putting children in bodily danger is enough to get the other cops to pay her a visit but it won’t be. permalink parent award report block reply Michalusmichalus 3 points 2 days ago School bus drivers are some of the best drivers. If school bus drivers wanted to fuck with assholes using them as cover, they absolutely could. permalink parent award report block reply\nMichalusmichalus 3 points 2 days ago School bus drivers are some of the best drivers. If school bus drivers wanted to fuck with assholes using them as cover, they absolutely could. permalink parent award report block reply\nWrexxis780 17 points 2 days ago PLZ IM A MOM And shes not with her kids doing crimes. TOO FUCKING BAD BITCH permalink award report block reply sordfysh PRO 8 points 2 days ago I doubt she's a mom. These people are liars and cheats. But this was a televised moment, so they want to look like they are being nice. permalink parent award report block reply\nsordfysh PRO 8 points 2 days ago I doubt she's a mom. These people are liars and cheats. But this was a televised moment, so they want to look like they are being nice. permalink parent award report block reply\nairborne3502 14 points 2 days ago I'm for using spotters on a illegal aliens just not in the way she's doing it. permalink award report block reply\nTiggerLovingPooh 14 points 2 days ago This is the exact problem with the country. ARREST PEOPLE WHO BREAK THE FUCKING LAW. The real downfall of a republic is the failure to enforce the law as written. Why go through all the trouble of voting, legislating, judicial oversight, if the fucking law isn't applied in the first place? permalink award report block reply\nFormerlurker92 12 points 2 days ago Why is everyone so nice to these cunts permalink award report block reply TiggerLovingPooh 13 points 2 days ago It's the exact reason they are emboldened to be cunts to begin with. permalink parent award report block reply\nTiggerLovingPooh 13 points 2 days ago It's the exact reason they are emboldened to be cunts to begin with. permalink parent award report block reply\ntradcathbugman 11 points 2 days ago Just arrest her and move on if she's causing a problem, she's scared now but in 20 minutes she'll remember that she got away with it, she'll be back pulling this shit, and any of her allies who see this will be emboldened. This officer really seems to me like he's enjoying scaring her too much.  The only time I've seen cops act like this on body cam is when somebody is being a dick to them and there's nothing they can actually do about it. permalink award report block reply\nBattleOfSaratoga 11 points 2 days ago Look how she sped off.  100% Laughing and thinking to herself, haha stupid fucking pigs my little poor im just a Mom stunt WORKED.  Deputy Field Office Director, DO BETTER. permalink award report block reply\nRentFree2020 8 points 2 days ago Why aren't they fined or arrested? Cops will yell ticket us if we flash or warn of a friggin speed trap. It could eventually cause harm or death if doing so. How's this acceptable to run around recklessly chasing cops and preventing the deportations of potential criminals and potential future murders, drug overdoses, and rapes? I though we weren't going to fuck around this time? permalink award report block reply magaspif 1 points 2 days ago Feds probably don't have holding facilities and that area is filled with faggot cops. permalink parent award report block reply\nmagaspif 1 points 2 days ago Feds probably don't have holding facilities and that area is filled with faggot cops. permalink parent award report block reply\nedxzxz 8 points 2 days ago They should have dragged her out of her car and beaten her mercilessly on the side of the road just for driving a Ford Mustang SUV.  What kind of retard drives a Mustang SUV? permalink award report block reply Tardigrade 5 points 2 days ago OK I laughed. permalink parent award report block reply DarthEP 2 points 2 days ago The Mock-E-Reee!!!! permalink parent award report block reply\nTardigrade 5 points 2 days ago OK I laughed. permalink parent award report block reply\nDarthEP 2 points 2 days ago The Mock-E-Reee!!!! permalink parent award report block reply\nBob_sacamanao 7 points 2 days ago What about the ticket for running g a red light? You NEED TO prosecute these liberal deranged democrats! permalink award report block reply lifeisahologram 3 points 2 days ago I don’t think they can issue tickets for that, that’s probably a city or state only enforcement. I think their only leverage is arresting for impediment, obstruction, etc of federal officers. permalink parent award report block reply\nlifeisahologram 3 points 2 days ago I don’t think they can issue tickets for that, that’s probably a city or state only enforcement. I think their only leverage is arresting for impediment, obstruction, etc of federal officers. permalink parent award report block reply\nmygovisacommie 7 points 2 days ago “I’m just a mom.” They why the fuck are you doing this shit? Honestly. If you are just some innocent mother who didn’t mean to hurt anyone, then why were you doing it? You knew what you were doing. Should have arrested her. permalink award report block reply\nlifeisahologram 7 points 2 days ago I find it ironic that a guy who looks and sounds of Hispanic heritage is trying to enforce immigration laws and this White woman with no noticeable foreign sounding accent is trying to help others break them. permalink award report block reply DarthEP 4 points 2 days ago You Noticed. permalink parent award report block reply lifeisahologram 4 points 2 days ago “I’m something of a noticer myself” permalink parent award report block reply\nDarthEP 4 points 2 days ago You Noticed. permalink parent award report block reply lifeisahologram 4 points 2 days ago “I’m something of a noticer myself” permalink parent award report block reply\nlifeisahologram 4 points 2 days ago “I’m something of a noticer myself” permalink parent award report block reply\nKavantar 6 points 2 days ago \"I'm just a mom\"... Uses her children as shields. permalink award report block reply\nScatter-Shot 6 points 2 days ago And your kids will be better off with you in prison. permalink award report block reply\nStCharlie 6 points 2 days ago Get the state, city, and name of this person.  I.C.E may have let her go but we should not. permalink award report block reply\nCaptainWinston 4 points 2 days ago That fucking Karen should have gone to jail. It would be great for her kids to come visit her on family day, that's how the kids don't turn out like Mom. permalink award report block reply\nsadierose 4 points 2 days ago at least a ticket for blowing red lights. should have popped her tires permalink award report block reply\nbooblitchutz 4 points 2 days ago The true \"spotters\" are in local PD and ICE. Plenty of people are leaking the exact locations of planned raids so the \"protesters\" can show up before hand, along with the food tables and whistle deliveries, etc. It couldn't be more obvious. The \"protesters\" know a day or more before the raids. permalink award report block reply\nfuckjbidenok 4 points 2 days ago Zero consequences just emboldens them. This is how we got here in the first place. permalink award report block reply\nredneckrevival 4 points 2 days ago Should have busted her fucking idiot ass hard!!!! permalink award report block reply\nMAGAFrogInfinity 4 points 2 days ago How did we get to this point as a society where a \"mom\" is out in public, openly obstructing law enforcement from protecting the mom, her family, and the rest of us? When did good become evil, and evil good? permalink award report block reply worldowedexplanation 1 points 2 days ago Dumb liberal cunts in Chicago are all doing this. Pathetic virtue signaling. permalink parent award report block reply\nworldowedexplanation 1 points 2 days ago Dumb liberal cunts in Chicago are all doing this. Pathetic virtue signaling. permalink parent award report block reply\nPrandogolio 4 points 2 days ago I'm just a mom! Oh, thirty seconds ago she was an antifascist guerilla freedom fighter, but as soon as there's a possibility of consequences, she wants to pull out the Pussy Pass. Women are insufferable. permalink award report block reply\nPresidentialPepe 4 points 2 days ago Tone changed real quick. Enjoy prison permalink award report block reply Gletkin 11 points 2 days ago She didn’t even get a ticket. permalink parent award report block reply Transparency 2 points 2 days ago Watch the video- He let her go! permalink parent award report block reply PresidentialPepe 3 points 2 days ago That's a shame. Heard him say he's referring her for criminal enforcement twice and kept scrolling. permalink parent award report block reply Transparency 2 points 2 days ago You're correct. I missed that yesterday and today. 😂👍👍 permalink parent award report block reply\nGletkin 11 points 2 days ago She didn’t even get a ticket. permalink parent award report block reply\nTransparency 2 points 2 days ago Watch the video- He let her go! permalink parent award report block reply PresidentialPepe 3 points 2 days ago That's a shame. Heard him say he's referring her for criminal enforcement twice and kept scrolling. permalink parent award report block reply Transparency 2 points 2 days ago You're correct. I missed that yesterday and today. 😂👍👍 permalink parent award report block reply\nPresidentialPepe 3 points 2 days ago That's a shame. Heard him say he's referring her for criminal enforcement twice and kept scrolling. permalink parent award report block reply Transparency 2 points 2 days ago You're correct. I missed that yesterday and today. 😂👍👍 permalink parent award report block reply\nTransparency 2 points 2 days ago You're correct. I missed that yesterday and today. 😂👍👍 permalink parent award report block reply\nIcepck 4 points 2 days ago Bullshit! Make an example out of her, find out who she works with and go after anybody organizing the crime of impedance. permalink award report block reply\nMindcrym 4 points 2 days ago If all liberal women were euthanized,  the Republic would flourish like never before. permalink award report block reply\nFangerang 4 points 2 days ago So not only is she attempting to impede ICE operations, but they have her on camera running a red light in pursuit of the ICE vehicles. And they just fucking let her go??? Pathetic. permalink award report block reply Prandogolio 3 points 2 days ago There's no consequences for commies. permalink parent award report block reply Tookens 3 points 2 days ago She is a poster-child for prosecution.  They HAVE to go after people like this. permalink parent award report block reply\nPrandogolio 3 points 2 days ago There's no consequences for commies. permalink parent award report block reply\nTookens 3 points 2 days ago She is a poster-child for prosecution.  They HAVE to go after people like this. permalink parent award report block reply\nMissileToad 3 points 2 days ago Wait, what? Why are they just letting her go home?? permalink award report block reply Prandogolio 3 points 2 days ago Of course.   The right is scared of leftists so we let them do whatever they want. permalink parent award report block reply worldowedexplanation 1 points 2 days ago She needs to be doxxed at least permalink parent award report block reply\nPrandogolio 3 points 2 days ago Of course.   The right is scared of leftists so we let them do whatever they want. permalink parent award report block reply\nworldowedexplanation 1 points 2 days ago She needs to be doxxed at least permalink parent award report block reply\nTrump-16-20-24-28-32 3 points 2 days ago She's not \"just a mom.\"  She's also impeding in federal business. permalink award report block reply\nBadfinz_FL 3 points 2 days ago The spotter will be e arrested permalink award report block reply\nIdahoMAGAmom 3 points 2 days ago why was her stupid ass not arrested????   keep treating them like toddlers, they'll keep acting like toddlers.  i'm so disgusted. permalink award report block reply\nhillaryforprison 3 points 2 days ago Oregon. Figures. She will do this again though, she should have been arrested. Never fall for the fake sorry act, she flipped you off not even a minute before. permalink award report block reply\nPats5x 3 points 2 days ago 2, 3 years Dagestan and forget permalink award report block reply\nthelastlast 3 points 2 days ago they always say please.  makes them a thousand times worse. permalink award report block reply\nh203h 3 points 2 days ago should pulled her dumbass out and arrested her for being fucking retarded permalink award report block reply\nthrottlejohnson 3 points 2 days ago did he say she ran a red light? was obviously speeding..wtf? oregon plates also, so no surprise there. was also wondering what kind of person buys a mustang suv... permalink award report block reply\nCommietownUSA 3 points 2 days ago Oh look liberal white woman permalink award report block reply\nSavingPrivateGrace 2 points 2 days ago She's just a mom and she probably has experience with stalking her ex.  wrf would lead someone to even enjoy doing this. permalink award report block reply\ngaijin_ronin 2 points 2 days ago If you know who she is and where she is make her ass disappear.  Problem solved. permalink award report block reply\nThereiwas001 2 points 2 days ago A mom putting her children at risk.\nLock her up,  save a child. permalink award report block reply\nOriginal_Dankster 2 points 2 days ago Started off well but the ending fucking sucked. 3/10 permalink award report block reply\nHenkZeilstra 2 points 2 days ago Liberal women should be flagged as terrorists and traitors permalink award report block reply Michalusmichalus 2 points 2 days ago Everything she said, and did is what the viral shit told them to say. permalink parent award report block reply\nMichalusmichalus 2 points 2 days ago Everything she said, and did is what the viral shit told them to say. permalink parent award report block reply\nLive_free_or_die_55 2 points 2 days ago Arrest the bitch!! permalink award report block reply\nTiberius1 2 points 2 days ago Ha ha. This is why we are in a civil war. They would arrest us and charge us with 30 federal crimes.  Raid our homes, shoot out dogs, intimidate our family.  Conservatives need to start acting like we are in a state of war. Because we are. permalink award report block reply\nSpacemonkey 2 points 2 days ago Should have pulled her out of her car and cuffed her ass and taken her to jail.  The only thing the left understands is power and by not arresting her showed that the right refuses to wield the power they have. Democrats understand this that's why they do shit like arresting Trump's lawyers and raiding his wife's panty drawer. Absolutely infuriating how spineless the GOP fucking is. permalink award report block reply\nconservativefrank 2 points 2 days ago On a Houston conservative radio show, the host called the hotline about the spotting. The prompts were all in Spanish. Host: \"That's interesting given their claim that illegals aren't all from Mexico, are a diverse group of people from all over the world.\" The co-host pointed out that most of the people who call are white women, so that makes it even odder that it's all in Spanish. The instructions these women get for using their whistles to alert about ICE activity are short bursts if ICE is just in the area, \"Twee...tweee...tweee...tweee.\", but a long whistle if ICE is actively \"abducting\" people, \"Tweeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee!\". Sounds a lot like \"Reeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee\" to me. permalink award report block reply\ny_do_i_need_to_hide 2 points 2 days ago No, sister, you are an accessory to a felony. permalink award report block reply\nEddie_Vanjovi 2 points 2 days ago Such godless people. permalink award report block reply\nTexasBrowncoat 2 points 2 days ago It's always the white liberal women.... They're all \"Fuck you\" until it's \"I'm just a mom\". No lessons learned here. permalink award report block reply\nMoldyLocksNesMonste 2 points 2 days ago Fail. Bitch should have been arrested. permalink award report block reply\nSarsourCuntReturns 2 points 2 days ago I don't know if it's just me, but she looked very unruly in her exchange. I vote she receives that good old Edison medicine. permalink award report block reply\nFor_All_Mankind 2 points 2 days ago Get a hobby, Karen permalink award report block reply\nMinneMAGA 2 points 2 days ago No, you're just a traitor permalink award report block reply\njonnyuno 2 points 2 days ago Dumb enough to buy a Mach E Mustang. That's dumb. It's like a trans homo Mustang. Good job Ford. permalink award report block reply\nparamour 2 points 2 days ago Wish they woulda cuffed-n-stuffed her ass to jail. smdh permalink award report block reply\n65RIVI 2 points 2 days ago feral suburban wine mom permalink award report block reply\nScoobyDum 2 points 2 days ago “I’m just a mom” Then you can see your kids in jail when they visit permalink award report block reply\nBillyMahoney 2 points 2 days ago They use our values against us. The left fabricates lies and fully prosecutes their enemies (us) without an ethical consideration. Our team allows them to repeat their actions. permalink award report block reply\nAwShitHereWeGoAgain 2 points 2 days ago Hang her!!!!!! permalink award report block reply\nbarwhack 2 points 2 days ago Just-a-mom should go to jail. Just like a crack head. Or a traitor. Here brood of trannies doesn't need her anyway. permalink award report block reply\nShaffro 2 points 2 days ago If you don't arrest these liberal bitches they won't stop. permalink award report block reply\nDITTOPatriot 1 points 2 days ago As it is her right. Never give up your rights for what you perceive as a win for your side. And don't play the officer safety card. If I want to blink my light or stand with a sign 30 yards ahead warning my fellow citizens that a trap is up ahead, yeah, that's my right. permalink award report block reply\ndres3 1 points 2 days ago Oddball idea.  Make Primary objective be the 'spotters/alerters' and secondary objective being the illegals temporarily within the same operation.  Need the spotters/alerters to be removed as a multiplicative effect. permalink award report block reply\nMakeAmericaGreat9 1 points 2 days ago Repost from last week. permalink award report block reply\nDamaged_Dirk 1 points 2 days ago This is not alerting people of a speed trap or a DUI check point. There needs to be a consequence. permalink award report block reply\nTDAF 1 points 2 days ago She drove away feeling she was victorious in this situation. permalink award report block reply\nGuidedDisinfo 1 points 2 days ago That agent violated her civil rights because he didn’t treat her the same as he would have treated a man.  He needs to be reprimanded for his blatant bias and directed to arrest even women, regardless of their tears. permalink award report block reply\nMasterVader2U 1 points 1 day ago Fucking larper gets to tell everyone how she got away. permalink award report block reply\nPronounParty 1 points 2 days ago Mostly peaceful mother permalink award report block reply\nHydris 1 points 2 days ago Pussy, Should have arrested her. Even ignoring everything else. Im tired of the pussy pass innocent victim shit they pull. \"i'm a just a mom\" Who cares, should have thought of that before hand. permalink award report block reply\nasiatrails 1 points 2 days ago Too soft permalink award report block reply\nBeat_to_Quarters 1 points 2 days ago Regret what? He let her go with a warning. Zero accountability. permalink award report block reply\nCrankyCrab 1 points 2 days ago Bitch should have been arrested and her vehicle impounded. That would have sent a message. Stop being pussies! permalink award report block reply\nMichalusmichalus 1 points 2 days ago The fall foliage in that video is so pretty. permalink award report block reply\nOodles 1 points 2 days ago Women are unstable and governed by their emotions. We need to start throwing some of these criminals in prison so they can tell their friends that prison isn't the day spa they think it is permalink award report block reply\nThan0sIII 1 points 2 days ago Hold them accountable and only the truly insane will keep doing this shit.  And it'll be much easier to deal with them. permalink award report block reply\nPatriotDawg 1 points 2 days ago A good, hard thrashing with a buggy whip would remove her from any future involvement. Give her more time to be a mom. permalink award report block reply\nravonaf 1 points 2 days ago Wow, they let her go. She is just going to do it again. These were the same people chanting \"No one is above the law!\" just a couple of years ago. I guarantee this woman has no regrets. permalink award report block reply\nworldowedexplanation 1 points 2 days ago Idiots in Chicago are doing this, they hand out whistles so they can warn about ICE. permalink award report block reply bratt 1 points 2 days ago Whistles are also used by antifa in protests. This woman though had a green WNBA dildo hanging from her neck. permalink parent award report block reply\nbratt 1 points 2 days ago Whistles are also used by antifa in protests. This woman though had a green WNBA dildo hanging from her neck. permalink parent award report block reply\nAgnesDomini 1 points 2 days ago FFS, ARREST THEM! permalink award report block reply\nEurpoean 1 points 2 days ago This is why we lose. Arrest the cunt, federally charge her, strip her voting rights, and teach her a real lesson. permalink award report block reply\nHunterBidensPC 1 points 2 days ago She’s not a fucking mom and even if she was it doesn’t change what she did. And she tried to get away and caused him to hit her car. Resisting and causing damage to a federal vehicle my tax dollars pay for? How about we hold people accountable? She’s going to flick you off and go right back to doing it again permalink award report block reply\nBahamaDon 1 points 2 days ago Such disappointment.  Where was the bloody skull? permalink award report block reply\nLynnforthetruth 1 points 2 days ago Arrest her ass permalink award report block reply\nDoMe22 1 points 2 days ago Should have put her away. For a long, long time. And thrown away the key. permalink award report block reply\nHunterBidensPC 1 points 2 days ago Someone find out who this is. They were gonna arrest her until they ran her license permalink award report block reply\nKoikatrose 1 points 2 days ago Home to change her panties....\nShould have arrested her liberal butt. permalink award report block reply\nworldowedexplanation 1 points 2 days ago DOX HER. She’s a fucking terrorist now, she’s not “just a mom.” Sick of this shit. Her plate is visible. Someone knows her. permalink award report block reply\nPsalm-118_24 1 points 1 day ago WTH???!!! why is this azzhat talking to her, she should have been pulled out of her car, her car towed to impoundment and she should be sitting in jail awaiting trial. permalink award report block reply\naqua27 1 points 2 days ago Arrest her so she spreads the word that you will be arrested if you do that shit. permalink award report block reply\npatrioticwinning3 1 points 2 days ago Deport! permalink award report block reply\nRightIsMight 1 points 2 days ago Fucking coward mexacant agent. No wonder we are so fucked. What do you, OP, even care anymore for? This fucking faggot fed doesn't care. Why should you? permalink award report block reply\nGfloydvotestrump 1 points 2 days ago Openly says she runs a red light and doesn't even do anything about it, the IRL equivalent of a \"sternly worded letter\". Pathetic excuse for an agent. This is why nothing ever gets fucking done. I think old man river is about at that mandatory retirement age. permalink award report block reply\nPiratePatriotAu 0 points 2 days ago Most likely she was paid. A sane person isnt that dumb. permalink award report block reply\nMinnieWhittaker 0 points 2 days ago Everyone's a gangster until suddenly actions have consequences. permalink award report block reply\nUSNVET71 -2 points 2 days ago No, you're just a moron. permalink award report block reply\nnew_guy2 1 points 2 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:46:55.454673Z"
}