{
  "id": "1ARK55cGGP",
  "url": "https://patriots.win/p/1ARK55cGGP/while-cattle-prices-have-dropped/c",
  "content": "720 While Cattle Prices have dropped substantially, the price of Boxed Beef has gone up — Therefore, you know that something is “fishy.” We will get to the bottom of it very quickly. If there is criminality, those people responsible will pay a steep price! TRUMP  TRUTH posted 5 days ago by I-am-Orlando PRO 46 comments award share download report block\n46 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Stanwyk74 31 points 5 days ago Thought that said White Castle for a sec permalink award report block reply YugeGamer 15 points 5 days ago Dude same permalink parent award report block reply throttlejohnson 6 points 5 days ago dammit...now I'm hungry permalink parent award report block reply booblitchutz 5 points 5 days ago Ugh. Reminds me of hangovers… permalink parent award report block reply DTOM1776 1 points 4 days ago Yup.  Was like WTF did White Castle do??   Kek permalink parent award report block reply Begr4ven 1 points 5 days ago ....Then I saw the word \"beef\" and knew I had to reread it.. permalink parent award report block reply bidensmissingbrain 27 points 5 days ago Cattle prices are down yes but processing costs have skyrocketed. I'll give you one guess as to why. permalink award report block reply _Sully_ 19 points 5 days ago I don’t know. Why? permalink parent award report block reply SanityGumby 23 points 5 days ago Because the companies are corrupt and many are owned by countries not particularly friendly to us. permalink parent award report block reply WooseTheMoose 17 points 5 days ago So Trump is right in saying there is something fishy going on? permalink parent award report block reply SanityGumby 7 points 5 days ago Of course but it's not just the packers. permalink parent award report block reply view 2 more comments... FuckU/Spez 19 points 5 days ago A lot were hiring illegals.  Tyson chicken for one permalink parent award report block reply Awakened 13 points 5 days ago Over regulation. There will only be one processing place available within an hour or more drive and everyone HAS to use it. Sometimes the work is done by prisoners. The cost is ridiculous because it has no competition.  Just evil. You don't get to pick who does it. Needs to end. permalink parent award report block reply abstain 1 points 4 days ago That's it. permalink parent award report block reply America_No_1 9 points 5 days ago Cause they are/were packed with illegals...aka the criminality permalink parent award report block reply Standingoak 5 points 5 days ago JBS, Tyson Foods, Cargill, and National Beef—control approximately 85% of the U.S. beef market permalink parent award report block reply load 3 more comments... Standingoak 4 points 5 days ago JBS, Tyson Foods, Cargill, and National Beef—control approximately 85% of the U.S. beef market permalink parent award report block reply GodDamnedEngineer 1 points 5 days ago labor rates. permalink parent award report block reply birddogz 18 points 5 days ago The price of decent ribeyes have gotten outrages. permalink award report block reply Overtaxed 18 points 5 days ago Yep, gotta have an EBT card to buy those. permalink parent award report block reply MondayCoupleIsDead 5 points 5 days ago Welfare Queens with 9 kids, maybe. Regular EBT people couldn't dream to buy that. permalink parent award report block reply Beachbum2023 5 points 5 days ago Publix sells Ribeye Roasts for 7.99/lb before Christmas. I buy a couple hundred dollars worth and cut them up and freeze. permalink parent award report block reply abstain 1 points 4 days ago What do you cut them with. We've resorted to power tools. permalink parent award report block reply qwhyamihere 3 points 4 days ago Thaw in fridge 1 to 2 days until its slightly thawed but still frozen. Then cut them and re freeze or vaccum seal. permalink parent award report block reply patrioticwinning3 17 points 5 days ago I will save you the trouble Mr. President.  There are 3-4 slaughtering/packing companies in the US, if ANYONE else tries to enter the market and compete with them, the deep state in the FDA shuts them down so fast it makes their heads spin! permalink award report block reply FuckU/Spez 16 points 5 days ago $150 for a large brisket is robbery! permalink award report block reply booblitchutz 6 points 5 days ago $150 and you have to cook it for a day to make it edible. permalink parent award report block reply MondayCoupleIsDead 5 points 5 days ago I eat walmart brisket like steak. Fuck that all day cooking shit. permalink parent award report block reply Sugz_Da_Feefth 12 points 5 days ago Glad he’s looking into this. Our ranchers need help. permalink award report block reply MemoryHoleyeO 12 points 5 days ago Sending our meats to other countries and importing others is the some of the most retarded shit that happens permalink award report block reply I-am-Orlando OP PRO 6 points 5 days ago Link https://truthsocial.com/@realDonaldTrump/115510396474764395 permalink award report block reply ak83 5 points 5 days ago The fuck they have.  $5500 for a bull last week at auction.  Govt paid people to kill their herds during COVID.  Royally fucked up the beef market. permalink award report block reply RoosterRaiser 2 points 5 days ago 140 pound bottle bull calf sold for $1100 yesterday local to me. Insane to pay that. permalink parent award report block reply ak83 1 points 4 days ago Yea, no kidding.   Fucking govt paid out people by us to drop cattle.  So they paid them higher per lb for them to stop.  Fucking criminal.  Should be flat out illegal for the govt to do this to any part of the food supply.  They use to rob people who grew raisins at one point.  Demanded you give X% to some bullshit national raisin reserve. permalink parent award report block reply SanityGumby 4 points 5 days ago They dropped because ranchers aren’t buying them in order to maximize per pound profits instead of meeting demand permalink award report block reply mcoulton 3 points 5 days ago They will say that it is because Trump deported the skilled illegal alien meat packers. They would rather shut down production than hire citizens to do it because it would destroy their claims that it is a job that no american would do permalink award report block reply PoleWatcher 2 points 5 days ago Watch any cattle channel price fixing has been a things for years permalink award report block reply raptormissle 2 points 5 days ago Good ol collusion. permalink award report block reply Brundlefly78 2 points 5 days ago A handful of companies have a monopoly on the market. The cost of feed and environmental penalties ,not to mention the culling of herds during the covid madness. permalink award report block reply Coprolite 1 points 4 days ago Enforce the stockyards act. Bill Clinton abandoned enforcement permalink award report block reply Shih_Tabed 1 points 5 days ago No more free/low cost labor. permalink award report block reply WI-Patriot 1 points 4 days ago Our corporate whore politicians need to start enforcing anti monopoly laws.  And deregulation of the meat processing and inspection industry permalink award report block reply hoodar 1 points 4 days ago They are paying their employees $60/hr to afford the rent/mortgage/taxes now. permalink award report block reply\nStanwyk74 31 points 5 days ago Thought that said White Castle for a sec permalink award report block reply YugeGamer 15 points 5 days ago Dude same permalink parent award report block reply throttlejohnson 6 points 5 days ago dammit...now I'm hungry permalink parent award report block reply booblitchutz 5 points 5 days ago Ugh. Reminds me of hangovers… permalink parent award report block reply DTOM1776 1 points 4 days ago Yup.  Was like WTF did White Castle do??   Kek permalink parent award report block reply Begr4ven 1 points 5 days ago ....Then I saw the word \"beef\" and knew I had to reread it.. permalink parent award report block reply\nYugeGamer 15 points 5 days ago Dude same permalink parent award report block reply\nthrottlejohnson 6 points 5 days ago dammit...now I'm hungry permalink parent award report block reply\nbooblitchutz 5 points 5 days ago Ugh. Reminds me of hangovers… permalink parent award report block reply\nDTOM1776 1 points 4 days ago Yup.  Was like WTF did White Castle do??   Kek permalink parent award report block reply\nBegr4ven 1 points 5 days ago ....Then I saw the word \"beef\" and knew I had to reread it.. permalink parent award report block reply\nbidensmissingbrain 27 points 5 days ago Cattle prices are down yes but processing costs have skyrocketed. I'll give you one guess as to why. permalink award report block reply _Sully_ 19 points 5 days ago I don’t know. Why? permalink parent award report block reply SanityGumby 23 points 5 days ago Because the companies are corrupt and many are owned by countries not particularly friendly to us. permalink parent award report block reply WooseTheMoose 17 points 5 days ago So Trump is right in saying there is something fishy going on? permalink parent award report block reply SanityGumby 7 points 5 days ago Of course but it's not just the packers. permalink parent award report block reply view 2 more comments... FuckU/Spez 19 points 5 days ago A lot were hiring illegals.  Tyson chicken for one permalink parent award report block reply Awakened 13 points 5 days ago Over regulation. There will only be one processing place available within an hour or more drive and everyone HAS to use it. Sometimes the work is done by prisoners. The cost is ridiculous because it has no competition.  Just evil. You don't get to pick who does it. Needs to end. permalink parent award report block reply abstain 1 points 4 days ago That's it. permalink parent award report block reply America_No_1 9 points 5 days ago Cause they are/were packed with illegals...aka the criminality permalink parent award report block reply Standingoak 5 points 5 days ago JBS, Tyson Foods, Cargill, and National Beef—control approximately 85% of the U.S. beef market permalink parent award report block reply load 3 more comments... Standingoak 4 points 5 days ago JBS, Tyson Foods, Cargill, and National Beef—control approximately 85% of the U.S. beef market permalink parent award report block reply GodDamnedEngineer 1 points 5 days ago labor rates. permalink parent award report block reply\n_Sully_ 19 points 5 days ago I don’t know. Why? permalink parent award report block reply SanityGumby 23 points 5 days ago Because the companies are corrupt and many are owned by countries not particularly friendly to us. permalink parent award report block reply WooseTheMoose 17 points 5 days ago So Trump is right in saying there is something fishy going on? permalink parent award report block reply SanityGumby 7 points 5 days ago Of course but it's not just the packers. permalink parent award report block reply view 2 more comments... FuckU/Spez 19 points 5 days ago A lot were hiring illegals.  Tyson chicken for one permalink parent award report block reply Awakened 13 points 5 days ago Over regulation. There will only be one processing place available within an hour or more drive and everyone HAS to use it. Sometimes the work is done by prisoners. The cost is ridiculous because it has no competition.  Just evil. You don't get to pick who does it. Needs to end. permalink parent award report block reply abstain 1 points 4 days ago That's it. permalink parent award report block reply America_No_1 9 points 5 days ago Cause they are/were packed with illegals...aka the criminality permalink parent award report block reply Standingoak 5 points 5 days ago JBS, Tyson Foods, Cargill, and National Beef—control approximately 85% of the U.S. beef market permalink parent award report block reply load 3 more comments...\nSanityGumby 23 points 5 days ago Because the companies are corrupt and many are owned by countries not particularly friendly to us. permalink parent award report block reply WooseTheMoose 17 points 5 days ago So Trump is right in saying there is something fishy going on? permalink parent award report block reply SanityGumby 7 points 5 days ago Of course but it's not just the packers. permalink parent award report block reply view 2 more comments...\nWooseTheMoose 17 points 5 days ago So Trump is right in saying there is something fishy going on? permalink parent award report block reply SanityGumby 7 points 5 days ago Of course but it's not just the packers. permalink parent award report block reply view 2 more comments...\nSanityGumby 7 points 5 days ago Of course but it's not just the packers. permalink parent award report block reply view 2 more comments...\nFuckU/Spez 19 points 5 days ago A lot were hiring illegals.  Tyson chicken for one permalink parent award report block reply\nAwakened 13 points 5 days ago Over regulation. There will only be one processing place available within an hour or more drive and everyone HAS to use it. Sometimes the work is done by prisoners. The cost is ridiculous because it has no competition.  Just evil. You don't get to pick who does it. Needs to end. permalink parent award report block reply abstain 1 points 4 days ago That's it. permalink parent award report block reply\nabstain 1 points 4 days ago That's it. permalink parent award report block reply\nAmerica_No_1 9 points 5 days ago Cause they are/were packed with illegals...aka the criminality permalink parent award report block reply\nStandingoak 5 points 5 days ago JBS, Tyson Foods, Cargill, and National Beef—control approximately 85% of the U.S. beef market permalink parent award report block reply\nStandingoak 4 points 5 days ago JBS, Tyson Foods, Cargill, and National Beef—control approximately 85% of the U.S. beef market permalink parent award report block reply\nGodDamnedEngineer 1 points 5 days ago labor rates. permalink parent award report block reply\nbirddogz 18 points 5 days ago The price of decent ribeyes have gotten outrages. permalink award report block reply Overtaxed 18 points 5 days ago Yep, gotta have an EBT card to buy those. permalink parent award report block reply MondayCoupleIsDead 5 points 5 days ago Welfare Queens with 9 kids, maybe. Regular EBT people couldn't dream to buy that. permalink parent award report block reply Beachbum2023 5 points 5 days ago Publix sells Ribeye Roasts for 7.99/lb before Christmas. I buy a couple hundred dollars worth and cut them up and freeze. permalink parent award report block reply abstain 1 points 4 days ago What do you cut them with. We've resorted to power tools. permalink parent award report block reply qwhyamihere 3 points 4 days ago Thaw in fridge 1 to 2 days until its slightly thawed but still frozen. Then cut them and re freeze or vaccum seal. permalink parent award report block reply\nOvertaxed 18 points 5 days ago Yep, gotta have an EBT card to buy those. permalink parent award report block reply MondayCoupleIsDead 5 points 5 days ago Welfare Queens with 9 kids, maybe. Regular EBT people couldn't dream to buy that. permalink parent award report block reply\nMondayCoupleIsDead 5 points 5 days ago Welfare Queens with 9 kids, maybe. Regular EBT people couldn't dream to buy that. permalink parent award report block reply\nBeachbum2023 5 points 5 days ago Publix sells Ribeye Roasts for 7.99/lb before Christmas. I buy a couple hundred dollars worth and cut them up and freeze. permalink parent award report block reply abstain 1 points 4 days ago What do you cut them with. We've resorted to power tools. permalink parent award report block reply qwhyamihere 3 points 4 days ago Thaw in fridge 1 to 2 days until its slightly thawed but still frozen. Then cut them and re freeze or vaccum seal. permalink parent award report block reply\nabstain 1 points 4 days ago What do you cut them with. We've resorted to power tools. permalink parent award report block reply qwhyamihere 3 points 4 days ago Thaw in fridge 1 to 2 days until its slightly thawed but still frozen. Then cut them and re freeze or vaccum seal. permalink parent award report block reply\nqwhyamihere 3 points 4 days ago Thaw in fridge 1 to 2 days until its slightly thawed but still frozen. Then cut them and re freeze or vaccum seal. permalink parent award report block reply\npatrioticwinning3 17 points 5 days ago I will save you the trouble Mr. President.  There are 3-4 slaughtering/packing companies in the US, if ANYONE else tries to enter the market and compete with them, the deep state in the FDA shuts them down so fast it makes their heads spin! permalink award report block reply\nFuckU/Spez 16 points 5 days ago $150 for a large brisket is robbery! permalink award report block reply booblitchutz 6 points 5 days ago $150 and you have to cook it for a day to make it edible. permalink parent award report block reply MondayCoupleIsDead 5 points 5 days ago I eat walmart brisket like steak. Fuck that all day cooking shit. permalink parent award report block reply\nbooblitchutz 6 points 5 days ago $150 and you have to cook it for a day to make it edible. permalink parent award report block reply MondayCoupleIsDead 5 points 5 days ago I eat walmart brisket like steak. Fuck that all day cooking shit. permalink parent award report block reply\nMondayCoupleIsDead 5 points 5 days ago I eat walmart brisket like steak. Fuck that all day cooking shit. permalink parent award report block reply\nSugz_Da_Feefth 12 points 5 days ago Glad he’s looking into this. Our ranchers need help. permalink award report block reply\nMemoryHoleyeO 12 points 5 days ago Sending our meats to other countries and importing others is the some of the most retarded shit that happens permalink award report block reply\nI-am-Orlando OP PRO 6 points 5 days ago Link https://truthsocial.com/@realDonaldTrump/115510396474764395 permalink award report block reply\nak83 5 points 5 days ago The fuck they have.  $5500 for a bull last week at auction.  Govt paid people to kill their herds during COVID.  Royally fucked up the beef market. permalink award report block reply RoosterRaiser 2 points 5 days ago 140 pound bottle bull calf sold for $1100 yesterday local to me. Insane to pay that. permalink parent award report block reply ak83 1 points 4 days ago Yea, no kidding.   Fucking govt paid out people by us to drop cattle.  So they paid them higher per lb for them to stop.  Fucking criminal.  Should be flat out illegal for the govt to do this to any part of the food supply.  They use to rob people who grew raisins at one point.  Demanded you give X% to some bullshit national raisin reserve. permalink parent award report block reply\nRoosterRaiser 2 points 5 days ago 140 pound bottle bull calf sold for $1100 yesterday local to me. Insane to pay that. permalink parent award report block reply ak83 1 points 4 days ago Yea, no kidding.   Fucking govt paid out people by us to drop cattle.  So they paid them higher per lb for them to stop.  Fucking criminal.  Should be flat out illegal for the govt to do this to any part of the food supply.  They use to rob people who grew raisins at one point.  Demanded you give X% to some bullshit national raisin reserve. permalink parent award report block reply\nak83 1 points 4 days ago Yea, no kidding.   Fucking govt paid out people by us to drop cattle.  So they paid them higher per lb for them to stop.  Fucking criminal.  Should be flat out illegal for the govt to do this to any part of the food supply.  They use to rob people who grew raisins at one point.  Demanded you give X% to some bullshit national raisin reserve. permalink parent award report block reply\nSanityGumby 4 points 5 days ago They dropped because ranchers aren’t buying them in order to maximize per pound profits instead of meeting demand permalink award report block reply\nmcoulton 3 points 5 days ago They will say that it is because Trump deported the skilled illegal alien meat packers. They would rather shut down production than hire citizens to do it because it would destroy their claims that it is a job that no american would do permalink award report block reply\nPoleWatcher 2 points 5 days ago Watch any cattle channel price fixing has been a things for years permalink award report block reply\nraptormissle 2 points 5 days ago Good ol collusion. permalink award report block reply\nBrundlefly78 2 points 5 days ago A handful of companies have a monopoly on the market. The cost of feed and environmental penalties ,not to mention the culling of herds during the covid madness. permalink award report block reply\nCoprolite 1 points 4 days ago Enforce the stockyards act. Bill Clinton abandoned enforcement permalink award report block reply\nShih_Tabed 1 points 5 days ago No more free/low cost labor. permalink award report block reply\nWI-Patriot 1 points 4 days ago Our corporate whore politicians need to start enforcing anti monopoly laws.  And deregulation of the meat processing and inspection industry permalink award report block reply\nhoodar 1 points 4 days ago They are paying their employees $60/hr to afford the rent/mortgage/taxes now. permalink award report block reply",
  "fetched_at": "2025-11-12T23:12:34.199651Z"
}