{
  "id": "1ARK9mFrdB",
  "url": "https://patriots.win/p/1ARK9mFrdB/does-anyone-know-anyone-in-maga-/c",
  "content": "398 Does anyone know anyone in MAGA that ever wanted 600,000 Chinese students?  I have never heard one posted 19 hours ago by FartOnLibtards 40 comments award share download report block\n40 comments Sort by Top Top New Worst Old Save TheJakeFroggy 37 points 18 hours ago If a college needs so many foreign students to survive, then it deserves to collapse. Period. permalink award report block reply Comanche_Moon 2 points 6 hours ago I hope most of them do collapse.  Bring back the trade schools and throw out the faggot/commie universities.  No more foreign spies disguised as students. permalink parent award report block reply newestofnew 22 points 19 hours ago it was part of the sale of tiktok. so essentially the United States has to harbor potential spies who take opportunities from our own children to facilitate the sale of a social media network to prevent people saying mean things about certain people on the internet permalink award report block reply FartOnLibtards OP 15 points 18 hours ago nobody wanted TikTok, but we have to keep it?  Why.  Nobody wanted AI or the illegals either... but we have to keep them. This country is toast permalink parent award report block reply YouEssAye 5 points 17 hours ago Our greatest ally had an issue with TikTok refusing to censor criticism of the the chosen people. Luckily Ellison has solved that issue. America first and stuff permalink parent award report block reply ianpatrick1966 2 points 9 hours ago Ironically Facebook is now open season on the tribe permalink parent award report block reply SimaYi 1 points 8 hours ago The juden wanted tiktok controlled becuase it's the only social media they don't control and it showed. permalink parent award report block reply Jack_NC 8 points 18 hours ago and/or part of the \"rare earth minerals\" deal Trump worked out. They get 600,000 educated spies per year. We get minerals. And screwed. permalink parent award report block reply FartOnLibtards OP 4 points 18 hours ago I say just nuke China and the world will be a much better place permalink parent award report block reply truthtoday2022 11 points 18 hours ago make america great again...... with Chinese spy students...? permalink award report block reply champdog 4 points 9 hours ago Hell of a deal for China. permalink parent award report block reply Neonentity 9 points 16 hours ago Chinese students are expected to gather data for the CCP that sent them. permalink award report block reply Winter_Is_Coming2020 8 points 18 hours ago Fuck any and all US universities, let them rot permalink award report block reply FartOnLibtards OP 4 points 18 hours ago amen... the best thing that could happen to the USA is for the colleges to completely collapse permalink parent award report block reply Deplorable556 5 points 18 hours ago college is for fags and hippys. permalink award report block reply Suckitreddit 4 points 17 hours ago This is another thing he can’t say outright while negotiating w the Chinese who are trying to destroy us with rare earth embargoes and slow walking components to our military… permalink award report block reply ReleasetheList 3 points 11 hours ago He knows what his donors want. Fuck everyone else. permalink award report block reply NormalCitizen 2 points 17 hours ago Buggsbunnyno.png. permalink award report block reply Creepy_Joe 2 points 14 hours ago I'm so sick of this piece of shit. Let this fucking country burn to the ground already. What a fucking double cross this scumbag turned out to be. permalink award report block reply rebuildingMyself 1 points 10 hours ago It has to be part of a deal with China (rare earths, etc). I refuse to believe he's doing this otherwise permalink award report block reply Hikedelics 1 points 17 hours ago Hold on, hold up guys… Has anyone asked which universities yet? It fucking matters. So many of the are schools now are complete jokes to the point that I honestly don’t care if some foreigners waste their time or money. I’d much prefer the shit-ass school collapse instead, but as long as the decent schools still have room for American students, I don’t care if Southern University or Howard, or fucking Berkeley are all Chinese. permalink award report block reply It_takes_10_years 1 points 8 hours ago Yeah Trump said Historical black colleges would fail if we don't allow foreigners. permalink parent award report block reply Givesgunstogrannies 1 points 8 hours ago When I worked at Rice University, over 10% of the student body were Chinese citizens... permalink award report block reply SimaYi 1 points 8 hours ago Fuck this guy. permalink award report block reply SanityGumby 1 points 15 hours ago I see you have a niggardly iq. They were hear before Trump was elected. He didn’t add them. permalink award report block reply FusionBlack 1 points 17 hours ago Who is whispering in his ear? Elon left and maybe he had a reason. permalink award report block reply SimaYi 0 points 8 hours ago He explicitly stated his reason. He got frustrated because he found out some shit about Trump, even though Elon was investing massive amounts of time and effort into fixing the government. permalink parent award report block reply NoticesBugleOWO 1 points 15 hours ago They're paying top dollar to take up seats in our retard bins, so I don't see why it matters. They're syphoning money into our economy and getting very little out of it. We are basically dominating their higher education, which is a good thing because if they were ever forced to develop shit on their own, they might pose a real threat. permalink award report block reply Melodicgrog 1 points 6 hours ago 600000 students in Tienanen square maybe permalink award report block reply GoldenSpirals -1 points 18 hours ago He's playing UNO reverse, lets put the Chinese kids in the Universities so they are the ones turned into gender confused retards, then send them back to China. permalink award report block reply happybirthdaydude 6 points 18 hours ago Been decades for that to happen and didn't. permalink parent award report block reply BruddahIz 3 points 17 hours ago Family hostages back home - and by being here they get elevated in the party. - No Incentive to buck thier overloads in China. permalink parent award report block reply BusterHyman99 -2 points 17 hours ago This is the 600k already going to school here. This was part of the trade deal. I'm so sick of bitches whining about what Trump is doing. He's got a plan to fix this country and unfortunately it's going to take longer than 10 months. How about bitching to all the politicians who put us in this predicament to begin with. Trump is at least trying to fix it permalink award report block reply SimaYi 1 points 8 hours ago His plan sucks. Fuck him. permalink parent award report block reply BusterHyman99 1 points 4 hours ago Fuck you. What's your plan genius permalink parent award report block reply lizardo221 0 points 10 hours ago People also have no concept on how fucked the economy is right now and how difficult it is to reverse it. Like if you just delete 600,000 full paying students from colleges over night, you will murder countless numbers of towns in this country. Many local economies will die, creating all kinds of other issues. And there are not 600,000 FULL PAYING Americans who will just swoop in and fill all those seats. I often use the analogy of the country being very fat, and Trump wants it to get thin again. However, you can't just saw off the country's legs and claim that is a solution to obesity. That is what you will be doing if you suddenly turn off all foreign investment. You have to have the country diet and exercise, slowly working all the fat off in a healthy manner. permalink parent award report block reply Harsh_Truth2 3 points 10 hours ago This country needs Lipo, not a diet plan. permalink parent award report block reply couranto -4 points 17 hours ago Fake Trump never ever said that. INGRAHAM: “A lot of MAGA folks are not thrilled about this idea of hundreds of thousands of foreign students in the United States. We have about 350,000 Chinese. At one point during COVID, you were gonna push, uh, get them out, but that was pulled back. You’ve said as many as 600,000 Chinese students could come to the United States. Why, sir, is that a pro-MAGA position when so many American kids wanna go to school, and there are places not for them, and these universities are getting rich off Chinese money?” TRUMP: “Uh, never said about China, but I, we do have a lot of people coming in from China - we always have - China and other countries...” Then, he continued referring to students from “foreign countries” and “all over the world.” permalink award report block reply It_takes_10_years 1 points 9 hours ago Its not foreigners from one country its actually foreigners from MANY countries. SO HA checkmate............. WTF permalink parent award report block reply It_takes_10_years 1 points 9 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nTheJakeFroggy 37 points 18 hours ago If a college needs so many foreign students to survive, then it deserves to collapse. Period. permalink award report block reply Comanche_Moon 2 points 6 hours ago I hope most of them do collapse.  Bring back the trade schools and throw out the faggot/commie universities.  No more foreign spies disguised as students. permalink parent award report block reply\nComanche_Moon 2 points 6 hours ago I hope most of them do collapse.  Bring back the trade schools and throw out the faggot/commie universities.  No more foreign spies disguised as students. permalink parent award report block reply\nnewestofnew 22 points 19 hours ago it was part of the sale of tiktok. so essentially the United States has to harbor potential spies who take opportunities from our own children to facilitate the sale of a social media network to prevent people saying mean things about certain people on the internet permalink award report block reply FartOnLibtards OP 15 points 18 hours ago nobody wanted TikTok, but we have to keep it?  Why.  Nobody wanted AI or the illegals either... but we have to keep them. This country is toast permalink parent award report block reply YouEssAye 5 points 17 hours ago Our greatest ally had an issue with TikTok refusing to censor criticism of the the chosen people. Luckily Ellison has solved that issue. America first and stuff permalink parent award report block reply ianpatrick1966 2 points 9 hours ago Ironically Facebook is now open season on the tribe permalink parent award report block reply SimaYi 1 points 8 hours ago The juden wanted tiktok controlled becuase it's the only social media they don't control and it showed. permalink parent award report block reply Jack_NC 8 points 18 hours ago and/or part of the \"rare earth minerals\" deal Trump worked out. They get 600,000 educated spies per year. We get minerals. And screwed. permalink parent award report block reply FartOnLibtards OP 4 points 18 hours ago I say just nuke China and the world will be a much better place permalink parent award report block reply\nFartOnLibtards OP 15 points 18 hours ago nobody wanted TikTok, but we have to keep it?  Why.  Nobody wanted AI or the illegals either... but we have to keep them. This country is toast permalink parent award report block reply YouEssAye 5 points 17 hours ago Our greatest ally had an issue with TikTok refusing to censor criticism of the the chosen people. Luckily Ellison has solved that issue. America first and stuff permalink parent award report block reply ianpatrick1966 2 points 9 hours ago Ironically Facebook is now open season on the tribe permalink parent award report block reply SimaYi 1 points 8 hours ago The juden wanted tiktok controlled becuase it's the only social media they don't control and it showed. permalink parent award report block reply\nYouEssAye 5 points 17 hours ago Our greatest ally had an issue with TikTok refusing to censor criticism of the the chosen people. Luckily Ellison has solved that issue. America first and stuff permalink parent award report block reply ianpatrick1966 2 points 9 hours ago Ironically Facebook is now open season on the tribe permalink parent award report block reply\nianpatrick1966 2 points 9 hours ago Ironically Facebook is now open season on the tribe permalink parent award report block reply\nSimaYi 1 points 8 hours ago The juden wanted tiktok controlled becuase it's the only social media they don't control and it showed. permalink parent award report block reply\nJack_NC 8 points 18 hours ago and/or part of the \"rare earth minerals\" deal Trump worked out. They get 600,000 educated spies per year. We get minerals. And screwed. permalink parent award report block reply FartOnLibtards OP 4 points 18 hours ago I say just nuke China and the world will be a much better place permalink parent award report block reply\nFartOnLibtards OP 4 points 18 hours ago I say just nuke China and the world will be a much better place permalink parent award report block reply\ntruthtoday2022 11 points 18 hours ago make america great again...... with Chinese spy students...? permalink award report block reply champdog 4 points 9 hours ago Hell of a deal for China. permalink parent award report block reply\nchampdog 4 points 9 hours ago Hell of a deal for China. permalink parent award report block reply\nNeonentity 9 points 16 hours ago Chinese students are expected to gather data for the CCP that sent them. permalink award report block reply\nWinter_Is_Coming2020 8 points 18 hours ago Fuck any and all US universities, let them rot permalink award report block reply FartOnLibtards OP 4 points 18 hours ago amen... the best thing that could happen to the USA is for the colleges to completely collapse permalink parent award report block reply\nFartOnLibtards OP 4 points 18 hours ago amen... the best thing that could happen to the USA is for the colleges to completely collapse permalink parent award report block reply\nDeplorable556 5 points 18 hours ago college is for fags and hippys. permalink award report block reply\nSuckitreddit 4 points 17 hours ago This is another thing he can’t say outright while negotiating w the Chinese who are trying to destroy us with rare earth embargoes and slow walking components to our military… permalink award report block reply\nReleasetheList 3 points 11 hours ago He knows what his donors want. Fuck everyone else. permalink award report block reply\nNormalCitizen 2 points 17 hours ago Buggsbunnyno.png. permalink award report block reply\nCreepy_Joe 2 points 14 hours ago I'm so sick of this piece of shit. Let this fucking country burn to the ground already. What a fucking double cross this scumbag turned out to be. permalink award report block reply\nrebuildingMyself 1 points 10 hours ago It has to be part of a deal with China (rare earths, etc). I refuse to believe he's doing this otherwise permalink award report block reply\nHikedelics 1 points 17 hours ago Hold on, hold up guys… Has anyone asked which universities yet? It fucking matters. So many of the are schools now are complete jokes to the point that I honestly don’t care if some foreigners waste their time or money. I’d much prefer the shit-ass school collapse instead, but as long as the decent schools still have room for American students, I don’t care if Southern University or Howard, or fucking Berkeley are all Chinese. permalink award report block reply It_takes_10_years 1 points 8 hours ago Yeah Trump said Historical black colleges would fail if we don't allow foreigners. permalink parent award report block reply\nIt_takes_10_years 1 points 8 hours ago Yeah Trump said Historical black colleges would fail if we don't allow foreigners. permalink parent award report block reply\nGivesgunstogrannies 1 points 8 hours ago When I worked at Rice University, over 10% of the student body were Chinese citizens... permalink award report block reply\nSimaYi 1 points 8 hours ago Fuck this guy. permalink award report block reply\nSanityGumby 1 points 15 hours ago I see you have a niggardly iq. They were hear before Trump was elected. He didn’t add them. permalink award report block reply\nFusionBlack 1 points 17 hours ago Who is whispering in his ear? Elon left and maybe he had a reason. permalink award report block reply SimaYi 0 points 8 hours ago He explicitly stated his reason. He got frustrated because he found out some shit about Trump, even though Elon was investing massive amounts of time and effort into fixing the government. permalink parent award report block reply\nSimaYi 0 points 8 hours ago He explicitly stated his reason. He got frustrated because he found out some shit about Trump, even though Elon was investing massive amounts of time and effort into fixing the government. permalink parent award report block reply\nNoticesBugleOWO 1 points 15 hours ago They're paying top dollar to take up seats in our retard bins, so I don't see why it matters. They're syphoning money into our economy and getting very little out of it. We are basically dominating their higher education, which is a good thing because if they were ever forced to develop shit on their own, they might pose a real threat. permalink award report block reply\nMelodicgrog 1 points 6 hours ago 600000 students in Tienanen square maybe permalink award report block reply\nGoldenSpirals -1 points 18 hours ago He's playing UNO reverse, lets put the Chinese kids in the Universities so they are the ones turned into gender confused retards, then send them back to China. permalink award report block reply happybirthdaydude 6 points 18 hours ago Been decades for that to happen and didn't. permalink parent award report block reply BruddahIz 3 points 17 hours ago Family hostages back home - and by being here they get elevated in the party. - No Incentive to buck thier overloads in China. permalink parent award report block reply\nhappybirthdaydude 6 points 18 hours ago Been decades for that to happen and didn't. permalink parent award report block reply BruddahIz 3 points 17 hours ago Family hostages back home - and by being here they get elevated in the party. - No Incentive to buck thier overloads in China. permalink parent award report block reply\nBruddahIz 3 points 17 hours ago Family hostages back home - and by being here they get elevated in the party. - No Incentive to buck thier overloads in China. permalink parent award report block reply\nBusterHyman99 -2 points 17 hours ago This is the 600k already going to school here. This was part of the trade deal. I'm so sick of bitches whining about what Trump is doing. He's got a plan to fix this country and unfortunately it's going to take longer than 10 months. How about bitching to all the politicians who put us in this predicament to begin with. Trump is at least trying to fix it permalink award report block reply SimaYi 1 points 8 hours ago His plan sucks. Fuck him. permalink parent award report block reply BusterHyman99 1 points 4 hours ago Fuck you. What's your plan genius permalink parent award report block reply lizardo221 0 points 10 hours ago People also have no concept on how fucked the economy is right now and how difficult it is to reverse it. Like if you just delete 600,000 full paying students from colleges over night, you will murder countless numbers of towns in this country. Many local economies will die, creating all kinds of other issues. And there are not 600,000 FULL PAYING Americans who will just swoop in and fill all those seats. I often use the analogy of the country being very fat, and Trump wants it to get thin again. However, you can't just saw off the country's legs and claim that is a solution to obesity. That is what you will be doing if you suddenly turn off all foreign investment. You have to have the country diet and exercise, slowly working all the fat off in a healthy manner. permalink parent award report block reply Harsh_Truth2 3 points 10 hours ago This country needs Lipo, not a diet plan. permalink parent award report block reply\nSimaYi 1 points 8 hours ago His plan sucks. Fuck him. permalink parent award report block reply BusterHyman99 1 points 4 hours ago Fuck you. What's your plan genius permalink parent award report block reply\nBusterHyman99 1 points 4 hours ago Fuck you. What's your plan genius permalink parent award report block reply\nlizardo221 0 points 10 hours ago People also have no concept on how fucked the economy is right now and how difficult it is to reverse it. Like if you just delete 600,000 full paying students from colleges over night, you will murder countless numbers of towns in this country. Many local economies will die, creating all kinds of other issues. And there are not 600,000 FULL PAYING Americans who will just swoop in and fill all those seats. I often use the analogy of the country being very fat, and Trump wants it to get thin again. However, you can't just saw off the country's legs and claim that is a solution to obesity. That is what you will be doing if you suddenly turn off all foreign investment. You have to have the country diet and exercise, slowly working all the fat off in a healthy manner. permalink parent award report block reply Harsh_Truth2 3 points 10 hours ago This country needs Lipo, not a diet plan. permalink parent award report block reply\nHarsh_Truth2 3 points 10 hours ago This country needs Lipo, not a diet plan. permalink parent award report block reply\ncouranto -4 points 17 hours ago Fake Trump never ever said that. INGRAHAM: “A lot of MAGA folks are not thrilled about this idea of hundreds of thousands of foreign students in the United States. We have about 350,000 Chinese. At one point during COVID, you were gonna push, uh, get them out, but that was pulled back. You’ve said as many as 600,000 Chinese students could come to the United States. Why, sir, is that a pro-MAGA position when so many American kids wanna go to school, and there are places not for them, and these universities are getting rich off Chinese money?” TRUMP: “Uh, never said about China, but I, we do have a lot of people coming in from China - we always have - China and other countries...” Then, he continued referring to students from “foreign countries” and “all over the world.” permalink award report block reply It_takes_10_years 1 points 9 hours ago Its not foreigners from one country its actually foreigners from MANY countries. SO HA checkmate............. WTF permalink parent award report block reply\nIt_takes_10_years 1 points 9 hours ago Its not foreigners from one country its actually foreigners from MANY countries. SO HA checkmate............. WTF permalink parent award report block reply\nIt_takes_10_years 1 points 9 hours ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T21:17:45.384290Z"
}