{
  "id": "1ARK513rIm",
  "url": "https://patriots.win/p/1ARK513rIm/whats-good-for-the-goose-is-good/c",
  "content": "477 What's good for the goose is good for the gander posted 6 days ago by wst4 26 comments award share report block John Kennedy @SenJohnKennedy • 7d What’s good for the goose is good for the gander. I’m introducing two bills tomorrow to stop Congress from getting a paycheck during the shutdown.\n26 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno OrangeManNotBad 31 points 6 days ago He knows it won't happen.  Just a gesture. permalink award report block reply Foreign_Aid_is_Theft 23 points 6 days ago It doesn't even matter. Most of them are multi millionaires and get a free lunch and dinner from their favorite lobbyists on the daily. All theater. permalink parent award report block reply BurtMcGirt 3 points 6 days ago What if they cut off their bribes and insider trading during shutdowns? permalink parent award report block reply Foreign_Aid_is_Theft 2 points 6 days ago Don't hold your breath. permalink parent award report block reply rebuildingMyself 2 points 6 days ago And they'll still vote it down because more grift is better than less permalink parent award report block reply njb425 8 points 6 days ago also cut off all aipac donations to congress permalink award report block reply FromNC 7 points 6 days ago Yea I’m sure Pelosi will go without a meal if you keep her pay check away from her. This guy is all talk, he puts on a show and really revealed him self back in August speaking in regard to RFK Jr. permalink award report block reply Aggrieved03 4 points 6 days ago Their paychecks don’t account for 1/20th of their income. permalink award report block reply BenjaminLWillard 4 points 6 days ago This is laughable nonsense. There is no one in congress that relies on a paycheck. Every member of congress is bought and paid for by many many many interest groups. The last thing any member of congress cares about is a paycheck from the govt. permalink award report block reply Filo76 4 points 6 days ago True. But they would also not vote for this because they are corrupt and greedy. permalink parent award report block reply Smurfection 1 points 6 days ago Not really.  Most of their wealth if from insider trading. permalink parent award report block reply RobertCron16 3 points 6 days ago Like they need that check, feck off. permalink award report block reply bratt 2 points 6 days ago Yeah, like they will vote and pass that. permalink award report block reply Spellmonger 2 points 6 days ago Introduce a bill to secure our election !!!! And then come back and brag about it. permalink award report block reply ReleasetheList 2 points 6 days ago Less than 1% of congress' wealth comes from their salary. They become multimillionaires through corruption and graft. And we all know this is a empty gesture that has no shot at passing. permalink award report block reply Greenhills 1 points 6 days ago It’s time for corporations, who the government has not only been incredibly generous to but most legislators acquiesce to, to do their part. Cut all of these federal workers a break and give them 0% interest rates for the life of the loans they had to take out. permalink award report block reply Shitsbrokeyo 1 points 6 days ago It only makes sense. If there is no budget to allocate spending on anything, how do you allocate funds to pay the legislature? permalink award report block reply Steve56775 1 points 6 days ago They don’t need the government paycheck, it’s peanuts. Now cut of the lobbiests, the special interest money, and the corporate kickbacks and we will see some movement. permalink award report block reply Smurfection 1 points 6 days ago I'm just going to point out, it takes less money to pay the entire military than it does to give benefits to SNAP and EBT recipients.   There is something massively wrong in a country that pays it's service members as little as possible but allows it's poor people to buy whatever the heck they want to feed their fat faces and do nothing. permalink award report block reply trumpORbust 1 points 6 days ago Like they care about their paycheck, that's just booze and whore money -- they real pay comes from 'other tasks & services' permalink award report block reply Quidnunc 1 points 6 days ago It won't get passed but all the democrats who are now scrounging for nickels and dimes are going to see their \"representatives\" voting against this. They will see the \"let them eat cake\" moment. unfortunately they will still vote for those assholes but a few might see the light. permalink award report block reply givethismanacoat 1 points 6 days ago It's all for optics. I don't know how long it's going to take but it's going to come to a head. permalink award report block reply Karpus 1 points 6 days ago I don’t hate Kennedy but I’m tired of this “Southern yokel hurr durr with a mildly acerbic wit” gimmick.  We need Thomas Jefferson, not Mark Twain permalink award report block reply Wildwind 1 points 6 days ago Great idea. Never going to happen. permalink award report block reply AdmrlNelson 0 points 6 days ago I know it won't happen, but would all of you doomers rather he not even submit the bill? I know it's theater, he knows it's theater, but if you don't even submit the bill to get it turned down, you aren't even putting in the bare minimum effort to fix things. We should praise people when they do good, and chastise them when they do bad. Otherwise there's even less incentive to fix anything at all. permalink award report block reply FatigueIsReal 0 points 6 days ago John Kennedy should be who we are looking at as the ideal MAGA congressman. He consistently stays out of bullshit drama and focuses on policy and what's best for Americans. permalink award report block reply\nOrangeManNotBad 31 points 6 days ago He knows it won't happen.  Just a gesture. permalink award report block reply Foreign_Aid_is_Theft 23 points 6 days ago It doesn't even matter. Most of them are multi millionaires and get a free lunch and dinner from their favorite lobbyists on the daily. All theater. permalink parent award report block reply BurtMcGirt 3 points 6 days ago What if they cut off their bribes and insider trading during shutdowns? permalink parent award report block reply Foreign_Aid_is_Theft 2 points 6 days ago Don't hold your breath. permalink parent award report block reply rebuildingMyself 2 points 6 days ago And they'll still vote it down because more grift is better than less permalink parent award report block reply\nForeign_Aid_is_Theft 23 points 6 days ago It doesn't even matter. Most of them are multi millionaires and get a free lunch and dinner from their favorite lobbyists on the daily. All theater. permalink parent award report block reply BurtMcGirt 3 points 6 days ago What if they cut off their bribes and insider trading during shutdowns? permalink parent award report block reply Foreign_Aid_is_Theft 2 points 6 days ago Don't hold your breath. permalink parent award report block reply rebuildingMyself 2 points 6 days ago And they'll still vote it down because more grift is better than less permalink parent award report block reply\nBurtMcGirt 3 points 6 days ago What if they cut off their bribes and insider trading during shutdowns? permalink parent award report block reply Foreign_Aid_is_Theft 2 points 6 days ago Don't hold your breath. permalink parent award report block reply\nForeign_Aid_is_Theft 2 points 6 days ago Don't hold your breath. permalink parent award report block reply\nrebuildingMyself 2 points 6 days ago And they'll still vote it down because more grift is better than less permalink parent award report block reply\nnjb425 8 points 6 days ago also cut off all aipac donations to congress permalink award report block reply\nFromNC 7 points 6 days ago Yea I’m sure Pelosi will go without a meal if you keep her pay check away from her. This guy is all talk, he puts on a show and really revealed him self back in August speaking in regard to RFK Jr. permalink award report block reply\nAggrieved03 4 points 6 days ago Their paychecks don’t account for 1/20th of their income. permalink award report block reply\nBenjaminLWillard 4 points 6 days ago This is laughable nonsense. There is no one in congress that relies on a paycheck. Every member of congress is bought and paid for by many many many interest groups. The last thing any member of congress cares about is a paycheck from the govt. permalink award report block reply Filo76 4 points 6 days ago True. But they would also not vote for this because they are corrupt and greedy. permalink parent award report block reply Smurfection 1 points 6 days ago Not really.  Most of their wealth if from insider trading. permalink parent award report block reply\nFilo76 4 points 6 days ago True. But they would also not vote for this because they are corrupt and greedy. permalink parent award report block reply\nSmurfection 1 points 6 days ago Not really.  Most of their wealth if from insider trading. permalink parent award report block reply\nRobertCron16 3 points 6 days ago Like they need that check, feck off. permalink award report block reply\nbratt 2 points 6 days ago Yeah, like they will vote and pass that. permalink award report block reply\nSpellmonger 2 points 6 days ago Introduce a bill to secure our election !!!! And then come back and brag about it. permalink award report block reply\nReleasetheList 2 points 6 days ago Less than 1% of congress' wealth comes from their salary. They become multimillionaires through corruption and graft. And we all know this is a empty gesture that has no shot at passing. permalink award report block reply\nGreenhills 1 points 6 days ago It’s time for corporations, who the government has not only been incredibly generous to but most legislators acquiesce to, to do their part. Cut all of these federal workers a break and give them 0% interest rates for the life of the loans they had to take out. permalink award report block reply\nShitsbrokeyo 1 points 6 days ago It only makes sense. If there is no budget to allocate spending on anything, how do you allocate funds to pay the legislature? permalink award report block reply\nSteve56775 1 points 6 days ago They don’t need the government paycheck, it’s peanuts. Now cut of the lobbiests, the special interest money, and the corporate kickbacks and we will see some movement. permalink award report block reply\nSmurfection 1 points 6 days ago I'm just going to point out, it takes less money to pay the entire military than it does to give benefits to SNAP and EBT recipients.   There is something massively wrong in a country that pays it's service members as little as possible but allows it's poor people to buy whatever the heck they want to feed their fat faces and do nothing. permalink award report block reply\ntrumpORbust 1 points 6 days ago Like they care about their paycheck, that's just booze and whore money -- they real pay comes from 'other tasks & services' permalink award report block reply\nQuidnunc 1 points 6 days ago It won't get passed but all the democrats who are now scrounging for nickels and dimes are going to see their \"representatives\" voting against this. They will see the \"let them eat cake\" moment. unfortunately they will still vote for those assholes but a few might see the light. permalink award report block reply\ngivethismanacoat 1 points 6 days ago It's all for optics. I don't know how long it's going to take but it's going to come to a head. permalink award report block reply\nKarpus 1 points 6 days ago I don’t hate Kennedy but I’m tired of this “Southern yokel hurr durr with a mildly acerbic wit” gimmick.  We need Thomas Jefferson, not Mark Twain permalink award report block reply\nWildwind 1 points 6 days ago Great idea. Never going to happen. permalink award report block reply\nAdmrlNelson 0 points 6 days ago I know it won't happen, but would all of you doomers rather he not even submit the bill? I know it's theater, he knows it's theater, but if you don't even submit the bill to get it turned down, you aren't even putting in the bare minimum effort to fix things. We should praise people when they do good, and chastise them when they do bad. Otherwise there's even less incentive to fix anything at all. permalink award report block reply\nFatigueIsReal 0 points 6 days ago John Kennedy should be who we are looking at as the ideal MAGA congressman. He consistently stays out of bullshit drama and focuses on policy and what's best for Americans. permalink award report block reply",
  "fetched_at": "2025-11-12T21:15:03.359238Z"
}