{
  "id": "1ARK5BH9Gc",
  "url": "https://patriots.win/p/1ARK5BH9Gc/shopping-carts/c",
  "content": "478 Shopping Carts 💩   SHITPOST   💩 posted 3 days ago by PiratePatriotParrot 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow TheAftermath 17 points 3 days ago Perfect meme. Well done. permalink award report block reply Ch3f4554551n 12 points 3 days ago The Jewish fellow in the fourth photo could use a haircut. permalink award report block reply Lib_Women_Have_HSV 7 points 3 days ago I pulled 3 carts out in a row that had the bad wheel today permalink award report block reply Payasyougo 7 points 3 days ago I never touch the loose carts near the storage because I assume someone already grabbed it got pissed at the wheels and left it there. permalink award report block reply Chickenbaconpoutine 5 points 3 days ago Honestly that girl in the bottom right is pretty cute, said nobody ever. permalink award report block reply raptormissle 4 points 3 days ago Which of these things is not like the other. permalink award report block reply bratt 4 points 3 days ago More like three of the woman in green and one Rosie O'Donnell sometimes as bad as Kathy Griffin. permalink award report block reply stormdraintrooper 1 points 2 days ago IRL, more like three of the bottom right, one bottom right.\nIn both instances. permalink award report block reply\nTheAftermath 17 points 3 days ago Perfect meme. Well done. permalink award report block reply\nCh3f4554551n 12 points 3 days ago The Jewish fellow in the fourth photo could use a haircut. permalink award report block reply\nLib_Women_Have_HSV 7 points 3 days ago I pulled 3 carts out in a row that had the bad wheel today permalink award report block reply\nPayasyougo 7 points 3 days ago I never touch the loose carts near the storage because I assume someone already grabbed it got pissed at the wheels and left it there. permalink award report block reply\nChickenbaconpoutine 5 points 3 days ago Honestly that girl in the bottom right is pretty cute, said nobody ever. permalink award report block reply\nraptormissle 4 points 3 days ago Which of these things is not like the other. permalink award report block reply\nbratt 4 points 3 days ago More like three of the woman in green and one Rosie O'Donnell sometimes as bad as Kathy Griffin. permalink award report block reply\nstormdraintrooper 1 points 2 days ago IRL, more like three of the bottom right, one bottom right.\nIn both instances. permalink award report block reply",
  "fetched_at": "2025-11-12T21:15:32.947339Z"
}