{
  "id": "1ARK55a48Y",
  "url": "https://patriots.win/p/1ARK55a48Y/they-sure-did/c",
  "content": "273 They sure did. posted 5 days ago by Spacemonkey 8 comments award share download report block\n8 comments Sort by Top Top New Worst Old Save Trump4Infinity 6 points 5 days ago Remember during Weimar the commies for all intents and purpose had control over Berlin and other cities. permalink award report block reply Standingoak 2 points 5 days ago To use their tactics  :  Are those who elected the communist really PEOPLE ? permalink parent award report block reply Spacemonkey OP 2 points 5 days ago No because communists aren't people: a polish sniper permalink parent award report block reply Standingoak 2 points 5 days ago “[When asked how it felt to take human life] \"I wouldn't know, I've only killed communists.”\n― Rafał Gan-Ganowicz permalink parent award report block reply TD_Covfefe_Crusader 2 points 5 days ago To the useful idiot mind, fascism is bad and communism is good. Never mind the fact that they are both totalitarian ideologies that are nearly indistinguishable from each other. permalink award report block reply ADAM_SCHITT 2 points 5 days ago Communism is worse than fascism. permalink parent award report block reply TD_Covfefe_Crusader 2 points 5 days ago It definitely has a much higher body count. permalink parent award report block reply SkullE 1 points 5 days ago I'm buying stock in popcorn. Watching NY fall apart is going to be the show of the decade. permalink award report block reply\nTrump4Infinity 6 points 5 days ago Remember during Weimar the commies for all intents and purpose had control over Berlin and other cities. permalink award report block reply Standingoak 2 points 5 days ago To use their tactics  :  Are those who elected the communist really PEOPLE ? permalink parent award report block reply Spacemonkey OP 2 points 5 days ago No because communists aren't people: a polish sniper permalink parent award report block reply Standingoak 2 points 5 days ago “[When asked how it felt to take human life] \"I wouldn't know, I've only killed communists.”\n― Rafał Gan-Ganowicz permalink parent award report block reply\nStandingoak 2 points 5 days ago To use their tactics  :  Are those who elected the communist really PEOPLE ? permalink parent award report block reply Spacemonkey OP 2 points 5 days ago No because communists aren't people: a polish sniper permalink parent award report block reply Standingoak 2 points 5 days ago “[When asked how it felt to take human life] \"I wouldn't know, I've only killed communists.”\n― Rafał Gan-Ganowicz permalink parent award report block reply\nSpacemonkey OP 2 points 5 days ago No because communists aren't people: a polish sniper permalink parent award report block reply Standingoak 2 points 5 days ago “[When asked how it felt to take human life] \"I wouldn't know, I've only killed communists.”\n― Rafał Gan-Ganowicz permalink parent award report block reply\nStandingoak 2 points 5 days ago “[When asked how it felt to take human life] \"I wouldn't know, I've only killed communists.”\n― Rafał Gan-Ganowicz permalink parent award report block reply\nTD_Covfefe_Crusader 2 points 5 days ago To the useful idiot mind, fascism is bad and communism is good. Never mind the fact that they are both totalitarian ideologies that are nearly indistinguishable from each other. permalink award report block reply ADAM_SCHITT 2 points 5 days ago Communism is worse than fascism. permalink parent award report block reply TD_Covfefe_Crusader 2 points 5 days ago It definitely has a much higher body count. permalink parent award report block reply\nADAM_SCHITT 2 points 5 days ago Communism is worse than fascism. permalink parent award report block reply TD_Covfefe_Crusader 2 points 5 days ago It definitely has a much higher body count. permalink parent award report block reply\nTD_Covfefe_Crusader 2 points 5 days ago It definitely has a much higher body count. permalink parent award report block reply\nSkullE 1 points 5 days ago I'm buying stock in popcorn. Watching NY fall apart is going to be the show of the decade. permalink award report block reply",
  "fetched_at": "2025-11-12T22:58:54.915027Z"
}