{
  "id": "1ARK5A8CBP",
  "url": "https://patriots.win/p/1ARK5A8CBP/gaetz-mark-levin-is-a-coward-who/c",
  "content": "349 GAETZ: Mark Levin is a coward who can’t defend his positions. posted 3 days ago by Sunnybats2 33 comments award share report block Matt Gaetz @mattgaetz • 4d Mark Levin is a coward who can’t defend his positions. Chris Menahan 🇺🇸 @infolibnews • 4d Mark Levin shares private texts Tucker Carlson sent him Friday revealing that TPUSA has invited Levin to debate Carlson at their upcoming event in Scottsdale, AZ, in Dec. Carlson said he wanted to debate, but Levin responded by chickening out and calling him a \"Nazi promoter.\"\n33 comments Sort by Top Top New Worst Old Save KuzoKevin 41 points 3 days ago Levin can fuck off. permalink award report block reply cyberrigger 5 points 3 days ago Levin is cringe permalink parent award report block reply cyberrigger 3 points 3 days ago as his bullshit gets deeper ---- his volume get louder permalink parent award report block reply FusionBlack 33 points 3 days ago Tucker is more popular than ever. Levin's time is over except in the eyes of the old guard.  He would never debate Tucker as he is a self severing shill. permalink award report block reply imnotdeadyet 22 points 3 days ago I'm old and stopped listening to Levin years ago.  His shilling for Israel got unbearable.  Hannity is the same.  Hell, everyone from Fox News shills for Israel. permalink parent award report block reply AppalachianTactical 2 points 3 days ago Dont forget Shapiro.\nHe is one of the worst and most egregious examples of a traitor to the country he was born in and tries to speak for. permalink parent award report block reply imnotdeadyet 1 points 3 days ago Yep, his is one little Faggot Weasel! permalink parent award report block reply Patrick_Bateman 10 points 3 days ago Man talk about living in a bubble. Like dude, Fox could probably play reruns of Tucker Carlson Tonight in your timeslot and get better ratings. No one needs your \"platform\". permalink parent award report block reply ChyNahAzzWhole1 23 points 3 days ago ML seems to be MIGA and not MAGA... oh, well. Fuck off America second cunt. permalink award report block reply barwhack 1 points 3 days ago This . permalink parent award report block reply Ronaldus 21 points 3 days ago Remember, Hannity calls Levin \"The Great One.\" My question is, \"The great what?\" permalink award report block reply Brock_Shithouse 1 points 3 days ago https://youtu.be/Vdd4rBlsj2o permalink parent award report block reply barwhack 1 points 3 days ago Hag-devil, evidently... הגדול (hgdvl) permalink parent award report block reply My2SonsAreMarines 1 points 3 days ago It was Rush Limbaugh who gave \"F Lee\" Levin the moniker \"The Great One.\"  (\"F Lee\" harkens to F Lee Bailey who was a trial lawyer in the OJ Simpson murder case in 1994 - where coincidentally Greta van Susteren happened to have obtained her first notoriety as well.). Of course, if Rush were still alive today it would be interesting to see where he'd come out on all this controversy.  Rush was his own man and he was not a slave to the Zionist Murdoch's.  Hannity has just become the controlled opposition shell of himself since he caved on so much principal after the 2020 election.  I ceased listening to and watching him from that point forward after having been a loyal listener where he followed Rush since he began with Fox in 1996. permalink parent award report block reply I_Am_John_Galt 18 points 3 days ago I cracked up watching Levin, Shapiro and others try to take ownership of MAGA and say Tuvker isn't MAGA and hes an antisemitr and they are MAGA and get to decide who is in and who isn't.  It's like they haven't paid attention over the last 10 years that name calling, finger pointing, premade signs, etc does nothing but make us laugh at them. permalink award report block reply bobbacringo 4 points 3 days ago There's more jews than those ones trying to make themselves the face of MAGA. That ugly harpy Laura Loomer is one. permalink parent award report block reply AppalachianTactical 6 points 3 days ago Yep. We honestly might have to face up to most of our leadership being MIGA. Ill vote for Gaetz over Vance any day of the week. Eric Trump was caught out being MIGA the other day. permalink parent award report block reply Crappydatum 13 points 3 days ago Faux News is Still butt hurt about Carlson. They fired him and had a golden parachute no compete clause that Tucker ignored. They literally didn't see that coming permalink award report block reply RizzlieDoodad 13 points 3 days ago Israel is the Republicans version of the trans issue permalink award report block reply AppalachianTactical 5 points 3 days ago Brought to you by... the exact same people. permalink parent award report block reply twentytwentyfourr 10 points 3 days ago blooood libelllll!! permalink award report block reply schnazzmizzle 9 points 3 days ago Levin has been irrelevant since Bush II. permalink award report block reply AppalachianTactical 5 points 3 days ago Ive said before and I reiterate. Id vote for Gaetz over Vance. permalink award report block reply Sunnybats2 OP 3 points 3 days ago Duh permalink parent award report block reply barwhack 3 points 3 days ago \"Nazi\" has no valuable meaning now that it applies to anything any leftist doesn't like. But dual loyalty has meaning ... permalink award report block reply AppalachianTactical 1 points 3 days ago Dual loyalty implues they have dual loyalty and arent just lying avout loyalty to rhe US. Ben Shapiro and Levin and Loomer and the like have loyalty only to Israel. Shapiro has said as much thar his loyalty to the US is because of what it mwans to israel aka no loyalty. permalink parent award report block reply Spellmonger 3 points 3 days ago I wish President Trump would fire Pam Bondi and put Matt in charge of the DOJ as interum AG. permalink award report block reply ythehorses 2 points 3 days ago Everything that Levin says here, can be applied directly to himself. No one listens to him, or cares what he says or thinks. He is anti-freedom of speech, and that ends him. He is totally irrelevant. Also, anyone that shares private texts to \"get back\" at someone they don't like is a piece of trash, as well as a high school girlie child. permalink award report block reply patrioticwinning3 2 points 3 days ago MAGA Matt for AG! permalink award report block reply Grindelwald 2 points 3 days ago Levin knows where his money comes from.  He hated Trump from 2016.  While he quotes the constitution all the time, if it went against Israel’s interest he would choose Israel. permalink award report block reply corntortilla -1 points 3 days ago Says the guy lobbing ad hom personal attacks rather than making an actual argument. That’s some first rate projection from the grifting coward that gave us mike Johnson and then cut and ran. permalink award report block reply Sunnybats2 OP 4 points 3 days ago Ok joo permalink parent award report block reply corntortilla -1 points 3 days ago So in your feeble mind, anyone that notes gaetz bullshit is a “joo”? Ok dumb ass. You’ve now demonstrated that you’re retarded. Do you wish to continue advertising the fact? permalink parent award report block reply Sunnybats2 OP 0 points 2 days ago Ok joo permalink parent award report block reply\nKuzoKevin 41 points 3 days ago Levin can fuck off. permalink award report block reply cyberrigger 5 points 3 days ago Levin is cringe permalink parent award report block reply cyberrigger 3 points 3 days ago as his bullshit gets deeper ---- his volume get louder permalink parent award report block reply\ncyberrigger 5 points 3 days ago Levin is cringe permalink parent award report block reply\ncyberrigger 3 points 3 days ago as his bullshit gets deeper ---- his volume get louder permalink parent award report block reply\nFusionBlack 33 points 3 days ago Tucker is more popular than ever. Levin's time is over except in the eyes of the old guard.  He would never debate Tucker as he is a self severing shill. permalink award report block reply imnotdeadyet 22 points 3 days ago I'm old and stopped listening to Levin years ago.  His shilling for Israel got unbearable.  Hannity is the same.  Hell, everyone from Fox News shills for Israel. permalink parent award report block reply AppalachianTactical 2 points 3 days ago Dont forget Shapiro.\nHe is one of the worst and most egregious examples of a traitor to the country he was born in and tries to speak for. permalink parent award report block reply imnotdeadyet 1 points 3 days ago Yep, his is one little Faggot Weasel! permalink parent award report block reply Patrick_Bateman 10 points 3 days ago Man talk about living in a bubble. Like dude, Fox could probably play reruns of Tucker Carlson Tonight in your timeslot and get better ratings. No one needs your \"platform\". permalink parent award report block reply\nimnotdeadyet 22 points 3 days ago I'm old and stopped listening to Levin years ago.  His shilling for Israel got unbearable.  Hannity is the same.  Hell, everyone from Fox News shills for Israel. permalink parent award report block reply AppalachianTactical 2 points 3 days ago Dont forget Shapiro.\nHe is one of the worst and most egregious examples of a traitor to the country he was born in and tries to speak for. permalink parent award report block reply imnotdeadyet 1 points 3 days ago Yep, his is one little Faggot Weasel! permalink parent award report block reply\nAppalachianTactical 2 points 3 days ago Dont forget Shapiro.\nHe is one of the worst and most egregious examples of a traitor to the country he was born in and tries to speak for. permalink parent award report block reply imnotdeadyet 1 points 3 days ago Yep, his is one little Faggot Weasel! permalink parent award report block reply\nimnotdeadyet 1 points 3 days ago Yep, his is one little Faggot Weasel! permalink parent award report block reply\nPatrick_Bateman 10 points 3 days ago Man talk about living in a bubble. Like dude, Fox could probably play reruns of Tucker Carlson Tonight in your timeslot and get better ratings. No one needs your \"platform\". permalink parent award report block reply\nChyNahAzzWhole1 23 points 3 days ago ML seems to be MIGA and not MAGA... oh, well. Fuck off America second cunt. permalink award report block reply barwhack 1 points 3 days ago This . permalink parent award report block reply\nbarwhack 1 points 3 days ago This . permalink parent award report block reply\nRonaldus 21 points 3 days ago Remember, Hannity calls Levin \"The Great One.\" My question is, \"The great what?\" permalink award report block reply Brock_Shithouse 1 points 3 days ago https://youtu.be/Vdd4rBlsj2o permalink parent award report block reply barwhack 1 points 3 days ago Hag-devil, evidently... הגדול (hgdvl) permalink parent award report block reply My2SonsAreMarines 1 points 3 days ago It was Rush Limbaugh who gave \"F Lee\" Levin the moniker \"The Great One.\"  (\"F Lee\" harkens to F Lee Bailey who was a trial lawyer in the OJ Simpson murder case in 1994 - where coincidentally Greta van Susteren happened to have obtained her first notoriety as well.). Of course, if Rush were still alive today it would be interesting to see where he'd come out on all this controversy.  Rush was his own man and he was not a slave to the Zionist Murdoch's.  Hannity has just become the controlled opposition shell of himself since he caved on so much principal after the 2020 election.  I ceased listening to and watching him from that point forward after having been a loyal listener where he followed Rush since he began with Fox in 1996. permalink parent award report block reply\nBrock_Shithouse 1 points 3 days ago https://youtu.be/Vdd4rBlsj2o permalink parent award report block reply\nbarwhack 1 points 3 days ago Hag-devil, evidently... הגדול (hgdvl) permalink parent award report block reply\nMy2SonsAreMarines 1 points 3 days ago It was Rush Limbaugh who gave \"F Lee\" Levin the moniker \"The Great One.\"  (\"F Lee\" harkens to F Lee Bailey who was a trial lawyer in the OJ Simpson murder case in 1994 - where coincidentally Greta van Susteren happened to have obtained her first notoriety as well.). Of course, if Rush were still alive today it would be interesting to see where he'd come out on all this controversy.  Rush was his own man and he was not a slave to the Zionist Murdoch's.  Hannity has just become the controlled opposition shell of himself since he caved on so much principal after the 2020 election.  I ceased listening to and watching him from that point forward after having been a loyal listener where he followed Rush since he began with Fox in 1996. permalink parent award report block reply\nI_Am_John_Galt 18 points 3 days ago I cracked up watching Levin, Shapiro and others try to take ownership of MAGA and say Tuvker isn't MAGA and hes an antisemitr and they are MAGA and get to decide who is in and who isn't.  It's like they haven't paid attention over the last 10 years that name calling, finger pointing, premade signs, etc does nothing but make us laugh at them. permalink award report block reply bobbacringo 4 points 3 days ago There's more jews than those ones trying to make themselves the face of MAGA. That ugly harpy Laura Loomer is one. permalink parent award report block reply AppalachianTactical 6 points 3 days ago Yep. We honestly might have to face up to most of our leadership being MIGA. Ill vote for Gaetz over Vance any day of the week. Eric Trump was caught out being MIGA the other day. permalink parent award report block reply\nbobbacringo 4 points 3 days ago There's more jews than those ones trying to make themselves the face of MAGA. That ugly harpy Laura Loomer is one. permalink parent award report block reply AppalachianTactical 6 points 3 days ago Yep. We honestly might have to face up to most of our leadership being MIGA. Ill vote for Gaetz over Vance any day of the week. Eric Trump was caught out being MIGA the other day. permalink parent award report block reply\nAppalachianTactical 6 points 3 days ago Yep. We honestly might have to face up to most of our leadership being MIGA. Ill vote for Gaetz over Vance any day of the week. Eric Trump was caught out being MIGA the other day. permalink parent award report block reply\nCrappydatum 13 points 3 days ago Faux News is Still butt hurt about Carlson. They fired him and had a golden parachute no compete clause that Tucker ignored. They literally didn't see that coming permalink award report block reply\nRizzlieDoodad 13 points 3 days ago Israel is the Republicans version of the trans issue permalink award report block reply AppalachianTactical 5 points 3 days ago Brought to you by... the exact same people. permalink parent award report block reply\nAppalachianTactical 5 points 3 days ago Brought to you by... the exact same people. permalink parent award report block reply\ntwentytwentyfourr 10 points 3 days ago blooood libelllll!! permalink award report block reply\nschnazzmizzle 9 points 3 days ago Levin has been irrelevant since Bush II. permalink award report block reply\nAppalachianTactical 5 points 3 days ago Ive said before and I reiterate. Id vote for Gaetz over Vance. permalink award report block reply Sunnybats2 OP 3 points 3 days ago Duh permalink parent award report block reply\nSunnybats2 OP 3 points 3 days ago Duh permalink parent award report block reply\nbarwhack 3 points 3 days ago \"Nazi\" has no valuable meaning now that it applies to anything any leftist doesn't like. But dual loyalty has meaning ... permalink award report block reply AppalachianTactical 1 points 3 days ago Dual loyalty implues they have dual loyalty and arent just lying avout loyalty to rhe US. Ben Shapiro and Levin and Loomer and the like have loyalty only to Israel. Shapiro has said as much thar his loyalty to the US is because of what it mwans to israel aka no loyalty. permalink parent award report block reply\nAppalachianTactical 1 points 3 days ago Dual loyalty implues they have dual loyalty and arent just lying avout loyalty to rhe US. Ben Shapiro and Levin and Loomer and the like have loyalty only to Israel. Shapiro has said as much thar his loyalty to the US is because of what it mwans to israel aka no loyalty. permalink parent award report block reply\nSpellmonger 3 points 3 days ago I wish President Trump would fire Pam Bondi and put Matt in charge of the DOJ as interum AG. permalink award report block reply\nythehorses 2 points 3 days ago Everything that Levin says here, can be applied directly to himself. No one listens to him, or cares what he says or thinks. He is anti-freedom of speech, and that ends him. He is totally irrelevant. Also, anyone that shares private texts to \"get back\" at someone they don't like is a piece of trash, as well as a high school girlie child. permalink award report block reply\npatrioticwinning3 2 points 3 days ago MAGA Matt for AG! permalink award report block reply\nGrindelwald 2 points 3 days ago Levin knows where his money comes from.  He hated Trump from 2016.  While he quotes the constitution all the time, if it went against Israel’s interest he would choose Israel. permalink award report block reply\ncorntortilla -1 points 3 days ago Says the guy lobbing ad hom personal attacks rather than making an actual argument. That’s some first rate projection from the grifting coward that gave us mike Johnson and then cut and ran. permalink award report block reply Sunnybats2 OP 4 points 3 days ago Ok joo permalink parent award report block reply corntortilla -1 points 3 days ago So in your feeble mind, anyone that notes gaetz bullshit is a “joo”? Ok dumb ass. You’ve now demonstrated that you’re retarded. Do you wish to continue advertising the fact? permalink parent award report block reply Sunnybats2 OP 0 points 2 days ago Ok joo permalink parent award report block reply\nSunnybats2 OP 4 points 3 days ago Ok joo permalink parent award report block reply corntortilla -1 points 3 days ago So in your feeble mind, anyone that notes gaetz bullshit is a “joo”? Ok dumb ass. You’ve now demonstrated that you’re retarded. Do you wish to continue advertising the fact? permalink parent award report block reply Sunnybats2 OP 0 points 2 days ago Ok joo permalink parent award report block reply\ncorntortilla -1 points 3 days ago So in your feeble mind, anyone that notes gaetz bullshit is a “joo”? Ok dumb ass. You’ve now demonstrated that you’re retarded. Do you wish to continue advertising the fact? permalink parent award report block reply Sunnybats2 OP 0 points 2 days ago Ok joo permalink parent award report block reply\nSunnybats2 OP 0 points 2 days ago Ok joo permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:51:50.457857Z"
}