{
  "id": "1ARK56iSeq",
  "url": "https://patriots.win/p/1ARK56iSeq/radical-leftist-judges-have-crea/c",
  "content": "431 Radical leftist judges have created a fourth branch of government, the federal bureaucracy, which wields the power of the state but is elected by no one and accountable to no one. posted 5 days ago by Capoditutticapi1 17 comments award share report block Stephen Miller @StephenM • 5d Radical leftist judges have created a fourth branch of government, the federal bureaucracy, which wields the power of the state but is elected by no one and accountable to no one. Kyle Cheney @kyledcheney • 5d JUST IN: A federal judge has barred the Trump administration from using furloughed employees’ email accounts to broadcast partisan messages about the shutdown. https://t.co/zUnhs6UYO8\n17 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget henri_derelicte 11 points 5 days ago What are we going to do about the judges and the bureaucracy? They are working in lockstep to obstruct the administration and need to be forced to submit permalink award report block reply Capoditutticapi1 OP 5 points 5 days ago On November 4, 2025, Rep. Brandon Gill (R-TX) introduced H.Res. 858, articles of impeachment accusing Boasberg of \"high crimes and misdemeanors\" for \"weaponizing the judiciary\" through the Arctic Frost orders. Co-sponsors include Reps. Chip Roy (R-TX), Byron Donalds (R-FL), Lauren Boebert (R-CO), and others. Not likely this will go anywhere other than tarnish the judges reputation and piss him off even more, however, it may or may not throw cold water on other judges flexing their robes out of bounds..., but probably not. There isn't much that can be done other than replacing them at some point in the future. Yeah, that doesn't help the situation of preventing judicial over reach at the moment... permalink parent award report block reply Damadhatter 2 points 4 days ago I think rather than cold water so to speak, other judges will just get encouraged by it. The more visibility a Dem gets, the closer they are to the nucleus of evil that is their party. Boasberg is on the Dem fast track for being rewarded by appointments and million dollar book deals. Others see it and will try to become even more nefarious in order to get their time in the sun. Just look at Bragg and Willis and James. All three of them were just clawing for notoriety to climb their political ladders. permalink parent award report block reply Mungo 4 points 5 days ago Time to ignore it. permalink award report block reply 9999999999 3 points 5 days ago Seems like he could get around the order by just adding a sentence the email saying it was written and comes from the Trump Administration, not the employee. If the message makes clear it isn't the speech of the furloughed employee there is no first amendment basis to challenge it. The first amendment doesn't give fed employees a right to control their email inbox. permalink parent award report block reply ltbadpuppy 3 points 5 days ago Wait ? what did they claim Trump was doing? using someone's email handle? permalink award report block reply Retardloserimsogay 3 points 5 days ago I found this pretty hilarious. Using furloughed email accounts. Love it. permalink parent award report block reply ltbadpuppy 3 points 5 days ago I mean wtf is it? some shit like this? Dear Donna,\nIt's your boss. Democrats aren't paying you this week either.\nV/R\nYour boss, (written by Trump's admin) I didn't get no Trump email. permalink parent award report block reply RagnarD 1 points 5 days ago No, their out of office messages were all set to something like the shutdown is the Democrat's fault. permalink parent award report block reply Retardloserimsogay 2 points 5 days ago Lmao! It gets even more hilarious. It's pretty retarded some faggot judge would attempt to block this. Should hang for wasting time alone. permalink parent award report block reply Greenhills 3 points 5 days ago I think the term is deep state. permalink award report block reply Monzie 2 points 5 days ago So fire everyone. permalink award report block reply SaxonRealm 2 points 5 days ago Arrest the judges. Make a list of all left wing judges and then in “Operation Uncuck” you arrest them all at once thus uncucking the country. permalink award report block reply Txiribiton 2 points 4 days ago Once again they tell you about a problem and not how they are going to fix it, and this time they are part of the problem because they don't ignore those courts. 10 months suffering this bullshit, it's time to get more black pills. permalink award report block reply patrioticwinning3 2 points 5 days ago Steven Miller for AG! permalink award report block reply DJT4MoreYears 2 points 4 days ago This judge is a hack. The 1st Amendment doesn't say shit about not having an email be used by the very branch these \"employees\" belong to. Their 1st Amendment rights allows them to hold fucking picket signs and walk up and down the fucking street. It does not afford them the right to an email from the govt. That's a fucking privilege. permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nhenri_derelicte 11 points 5 days ago What are we going to do about the judges and the bureaucracy? They are working in lockstep to obstruct the administration and need to be forced to submit permalink award report block reply Capoditutticapi1 OP 5 points 5 days ago On November 4, 2025, Rep. Brandon Gill (R-TX) introduced H.Res. 858, articles of impeachment accusing Boasberg of \"high crimes and misdemeanors\" for \"weaponizing the judiciary\" through the Arctic Frost orders. Co-sponsors include Reps. Chip Roy (R-TX), Byron Donalds (R-FL), Lauren Boebert (R-CO), and others. Not likely this will go anywhere other than tarnish the judges reputation and piss him off even more, however, it may or may not throw cold water on other judges flexing their robes out of bounds..., but probably not. There isn't much that can be done other than replacing them at some point in the future. Yeah, that doesn't help the situation of preventing judicial over reach at the moment... permalink parent award report block reply Damadhatter 2 points 4 days ago I think rather than cold water so to speak, other judges will just get encouraged by it. The more visibility a Dem gets, the closer they are to the nucleus of evil that is their party. Boasberg is on the Dem fast track for being rewarded by appointments and million dollar book deals. Others see it and will try to become even more nefarious in order to get their time in the sun. Just look at Bragg and Willis and James. All three of them were just clawing for notoriety to climb their political ladders. permalink parent award report block reply\nCapoditutticapi1 OP 5 points 5 days ago On November 4, 2025, Rep. Brandon Gill (R-TX) introduced H.Res. 858, articles of impeachment accusing Boasberg of \"high crimes and misdemeanors\" for \"weaponizing the judiciary\" through the Arctic Frost orders. Co-sponsors include Reps. Chip Roy (R-TX), Byron Donalds (R-FL), Lauren Boebert (R-CO), and others. Not likely this will go anywhere other than tarnish the judges reputation and piss him off even more, however, it may or may not throw cold water on other judges flexing their robes out of bounds..., but probably not. There isn't much that can be done other than replacing them at some point in the future. Yeah, that doesn't help the situation of preventing judicial over reach at the moment... permalink parent award report block reply Damadhatter 2 points 4 days ago I think rather than cold water so to speak, other judges will just get encouraged by it. The more visibility a Dem gets, the closer they are to the nucleus of evil that is their party. Boasberg is on the Dem fast track for being rewarded by appointments and million dollar book deals. Others see it and will try to become even more nefarious in order to get their time in the sun. Just look at Bragg and Willis and James. All three of them were just clawing for notoriety to climb their political ladders. permalink parent award report block reply\nDamadhatter 2 points 4 days ago I think rather than cold water so to speak, other judges will just get encouraged by it. The more visibility a Dem gets, the closer they are to the nucleus of evil that is their party. Boasberg is on the Dem fast track for being rewarded by appointments and million dollar book deals. Others see it and will try to become even more nefarious in order to get their time in the sun. Just look at Bragg and Willis and James. All three of them were just clawing for notoriety to climb their political ladders. permalink parent award report block reply\nMungo 4 points 5 days ago Time to ignore it. permalink award report block reply 9999999999 3 points 5 days ago Seems like he could get around the order by just adding a sentence the email saying it was written and comes from the Trump Administration, not the employee. If the message makes clear it isn't the speech of the furloughed employee there is no first amendment basis to challenge it. The first amendment doesn't give fed employees a right to control their email inbox. permalink parent award report block reply\n9999999999 3 points 5 days ago Seems like he could get around the order by just adding a sentence the email saying it was written and comes from the Trump Administration, not the employee. If the message makes clear it isn't the speech of the furloughed employee there is no first amendment basis to challenge it. The first amendment doesn't give fed employees a right to control their email inbox. permalink parent award report block reply\nltbadpuppy 3 points 5 days ago Wait ? what did they claim Trump was doing? using someone's email handle? permalink award report block reply Retardloserimsogay 3 points 5 days ago I found this pretty hilarious. Using furloughed email accounts. Love it. permalink parent award report block reply ltbadpuppy 3 points 5 days ago I mean wtf is it? some shit like this? Dear Donna,\nIt's your boss. Democrats aren't paying you this week either.\nV/R\nYour boss, (written by Trump's admin) I didn't get no Trump email. permalink parent award report block reply RagnarD 1 points 5 days ago No, their out of office messages were all set to something like the shutdown is the Democrat's fault. permalink parent award report block reply Retardloserimsogay 2 points 5 days ago Lmao! It gets even more hilarious. It's pretty retarded some faggot judge would attempt to block this. Should hang for wasting time alone. permalink parent award report block reply\nRetardloserimsogay 3 points 5 days ago I found this pretty hilarious. Using furloughed email accounts. Love it. permalink parent award report block reply ltbadpuppy 3 points 5 days ago I mean wtf is it? some shit like this? Dear Donna,\nIt's your boss. Democrats aren't paying you this week either.\nV/R\nYour boss, (written by Trump's admin) I didn't get no Trump email. permalink parent award report block reply RagnarD 1 points 5 days ago No, their out of office messages were all set to something like the shutdown is the Democrat's fault. permalink parent award report block reply Retardloserimsogay 2 points 5 days ago Lmao! It gets even more hilarious. It's pretty retarded some faggot judge would attempt to block this. Should hang for wasting time alone. permalink parent award report block reply\nltbadpuppy 3 points 5 days ago I mean wtf is it? some shit like this? Dear Donna,\nIt's your boss. Democrats aren't paying you this week either.\nV/R\nYour boss, (written by Trump's admin) I didn't get no Trump email. permalink parent award report block reply RagnarD 1 points 5 days ago No, their out of office messages were all set to something like the shutdown is the Democrat's fault. permalink parent award report block reply Retardloserimsogay 2 points 5 days ago Lmao! It gets even more hilarious. It's pretty retarded some faggot judge would attempt to block this. Should hang for wasting time alone. permalink parent award report block reply\nRagnarD 1 points 5 days ago No, their out of office messages were all set to something like the shutdown is the Democrat's fault. permalink parent award report block reply Retardloserimsogay 2 points 5 days ago Lmao! It gets even more hilarious. It's pretty retarded some faggot judge would attempt to block this. Should hang for wasting time alone. permalink parent award report block reply\nRetardloserimsogay 2 points 5 days ago Lmao! It gets even more hilarious. It's pretty retarded some faggot judge would attempt to block this. Should hang for wasting time alone. permalink parent award report block reply\nGreenhills 3 points 5 days ago I think the term is deep state. permalink award report block reply\nMonzie 2 points 5 days ago So fire everyone. permalink award report block reply\nSaxonRealm 2 points 5 days ago Arrest the judges. Make a list of all left wing judges and then in “Operation Uncuck” you arrest them all at once thus uncucking the country. permalink award report block reply\nTxiribiton 2 points 4 days ago Once again they tell you about a problem and not how they are going to fix it, and this time they are part of the problem because they don't ignore those courts. 10 months suffering this bullshit, it's time to get more black pills. permalink award report block reply\npatrioticwinning3 2 points 5 days ago Steven Miller for AG! permalink award report block reply\nDJT4MoreYears 2 points 4 days ago This judge is a hack. The 1st Amendment doesn't say shit about not having an email be used by the very branch these \"employees\" belong to. Their 1st Amendment rights allows them to hold fucking picket signs and walk up and down the fucking street. It does not afford them the right to an email from the govt. That's a fucking privilege. permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:12:53.681789Z"
}