{
  "id": "1ARK55cGSj",
  "url": "https://patriots.win/p/1ARK55cGSj/federal-grand-jury-has-subpoenae/c",
  "content": "327 Federal grand jury has subpoenaed former CIA Director John Brennan and former FBI officials Peter Strzok and Lisa Page as part of the U.S. Justice Department’s investigation into the origins of Russiagate. 🚨  LOCK THEM UP  🚨 posted 5 days ago by I-am-Orlando PRO 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Ch3f4554551n 9 points 5 days ago Brennan got away with 9/11. permalink award report block reply Counterwhat 6 points 5 days ago It's about time! permalink award report block reply Mungo 6 points 5 days ago Hang them all very publicly. permalink award report block reply I-am-Orlando OP PRO 4 points 5 days ago Link https://x.com/ImMeme0/status/1986950383932219677?s=20 permalink award report block reply Mtnlion667 3 points 5 days ago Get the rope permalink award report block reply billybaldwin2 2 points 5 days ago Grand jury in DC? That says something. permalink award report block reply Scumbag-reddit 2 points 5 days ago Or just...I dunno, indict them permalink award report block reply AwShitHereWeGoAgain 1 points 5 days ago Hang them!!!!!!!!!!!! permalink award report block reply onesummerdream 1 points 4 days ago And they all take the 5th. Then what? permalink award report block reply\nCh3f4554551n 9 points 5 days ago Brennan got away with 9/11. permalink award report block reply\nCounterwhat 6 points 5 days ago It's about time! permalink award report block reply\nMungo 6 points 5 days ago Hang them all very publicly. permalink award report block reply\nI-am-Orlando OP PRO 4 points 5 days ago Link https://x.com/ImMeme0/status/1986950383932219677?s=20 permalink award report block reply\nMtnlion667 3 points 5 days ago Get the rope permalink award report block reply\nbillybaldwin2 2 points 5 days ago Grand jury in DC? That says something. permalink award report block reply\nScumbag-reddit 2 points 5 days ago Or just...I dunno, indict them permalink award report block reply\nAwShitHereWeGoAgain 1 points 5 days ago Hang them!!!!!!!!!!!! permalink award report block reply\nonesummerdream 1 points 4 days ago And they all take the 5th. Then what? permalink award report block reply",
  "fetched_at": "2025-11-12T23:06:33.162251Z"
}