{
  "id": "1ARK5AA7Wd",
  "url": "https://patriots.win/p/1ARK5AA7Wd/president-trump-they-ripped-the-/c",
  "content": "1507 President Trump: They ripped the hell out of the Rainforest of Brazil to build a four lane highway for Environmentalists to travel. It’s become a big scandal! 100,000 Amazon trees cut for highway leading to U.N. climate summit. posted 3 days ago by Mr_Rightside 76 comments award share download report block\n76 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow Exsultate 91 points 3 days ago Climate summits are just another way for the ultra rich to feel good about themselves.  They’re basically jacking themselves off. permalink award report block reply BeauHD 36 points 3 days ago And molesting teenagers and young children on VHS tape permalink parent award report block reply Exsultate 18 points 3 days ago Remember, the uber rich use Betamax. permalink parent award report block reply DT170x 6 points 3 days ago The 0.000001% uses Laserdisks. permalink parent award report block reply Deportthemall23 3 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments... leakmouth 7 points 3 days ago and destroying the environment permalink parent award report block reply Hanging_Chad 7 points 3 days ago Climate Change Circlejerk permalink parent award report block reply HeCantDoIt 2 points 3 days ago Nah, it's an investment for politicians. Spend millions to bribe whore scientists, get the \"scientific\" results you want, and then rake in trillions through carbon taxes. Plus they get to use the excuse \"global climate change can only be fixed with global government\", which makes globo-homos happy when they try to consolidate power and de-industrialize the West. permalink parent award report block reply NotYourMan 1 points 3 days ago Its retarded. permalink parent award report block reply one_cool 1 points 3 days ago They do it for money. they own all the carbon credit, carbon offset, solar, wind energy, electric car companies.  They want to force people to pay them through climate laws.  The need to have a summit to manufacture the problem. permalink parent award report block reply load 1 more comments... MakingArrowsOrange 26 points 3 days ago Environmentalists don't give a shit about the environment, just like PETA doesn't give a shit about animals. More at 11. permalink award report block reply deleted 7 points 3 days ago fazaman 1 points 2 days ago Right. The grift is simple: Find a cause that sounds good and you can raise large amounts of money off of. Do so and spend a tiny fraction of that money on said cause. Pay yourself and your friends a huge salary. Pay kickbacks to politicians that send you taxpayer money. Rinse. Repeat. permalink parent award report block reply Fren20 -1 points 3 days ago Yes we do permalink parent award report block reply Executarian2 13 points 3 days ago I love posts like this from Trump. What does he mean? Is he pro or anti-environment here? permalink award report block reply PosterIsDead 49 points 3 days ago He means \"look at these hypocrites on their way to a massive circle jerk\". permalink parent award report block reply halcyondream 16 points 3 days ago And as an aside I think we all should be pro-environment where it makes sense. Man-made climate change is a scam, there's a reason they changed it from global warming to that, climate change always happens and is natural. permalink parent award report block reply staroframphansbhole 6 points 3 days ago Littering should be a capital offense, carbon taxes are bullshit permalink parent award report block reply Rusty_Shackleford 2 points 2 days ago Clean air, clean water, and healthy soil!  The economy is important, but we don’t want to live in a permanent cloud of smog like Beijing. permalink parent award report block reply Fren20 0 points 3 days ago Yeah walk across a  black top parking lot permalink parent award report block reply Executarian2 2 points 3 days ago Makes sense. Thanks! permalink parent award report block reply AngryWriter 22 points 3 days ago In this case it truly doesn't matter. If you are pro-environment, you should be enraged that the environment is being destroyed just for some conference. If you think environmentalism is a waste of time and money, this is an exceedingly big example to prove the point. Trump wins either way. permalink parent award report block reply Executarian2 5 points 3 days ago Fair point! permalink parent award report block reply LWGII 7 points 3 days ago He's anti-stupid. permalink parent award report block reply BreakingCNN 6 points 3 days ago Trump is 100% Pro environment and 10,000% pro recycling just like I am!\nI've been recycling dinosaurs at 8 to 13 MPG for 50 years! permalink parent award report block reply Sparks1017 4 points 3 days ago Not anti-environment, he's anti these hysterical climate alarmists permalink parent award report block reply Executarian2 3 points 3 days ago That part makes sense, it's just odd that he wouldn't add any of his own commentary -- like he's just pointing out that it's an event that people have opinions on without stating his own. permalink parent award report block reply Sparks1017 1 points 3 days ago Yes, true, but I believe he makes his point. Especially the last sentence. \"100,000 trees cut for a highway leading to a UN summit\", I think sums up his feelings, we know what he thinks of the UN permalink parent award report block reply Executarian2 1 points 3 days ago I generally get it, and it's not that serious at all. I just think it's funny for him not to take this time to rip into Lula or the UN, lol. permalink parent award report block reply load 3 more comments... pedewithweed 9 points 3 days ago Thats a lot of lost oxygen permalink award report block reply Lady_MaGa 6 points 3 days ago That's also a lot of money lost from \"global citizens\" to pay for said road. permalink parent award report block reply BreakingCNN 3 points 3 days ago That's a lot of lumber! A lot of jobs! Buy some XOM! permalink parent award report block reply Nibba2 2 points 3 days ago Honest question though, here in America we are pro farming and drilling. Brazil doesn’t get paid for keeping trees. Why can’t they do what they need or want. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago It seems like big pharma would be blocking the destruction so they could find natural cures and then sell dangerous synthetic forms of them so they could create more business. Maybe their covid mRNA experiment on the public advanced their research so much that they can manufacture cures for the elite with AI designed mRNA now. permalink parent award report block reply Nibba2 1 points 3 days ago It’s not like they took down the entire forest. permalink parent award report block reply Electrocutioner 1 points 3 days ago That old meme of the rainforest being responsible for producing a large amount of oxygen is fake and gay. permalink parent award report block reply Viewer01 6 points 3 days ago You can’t hate these people enough. permalink award report block reply SuperHonkey 6 points 3 days ago Who else clicked on the play button more than once 😅 permalink award report block reply BreakingCNN 8 points 3 days ago I'm still clicking on it permalink parent award report block reply lovemylibs 7 points 3 days ago It worked for me. permalink parent award report block reply Mr_Rightside OP 6 points 3 days ago https://truthsocial.com/@realDonaldTrump/posts/115520633257497938 permalink award report block reply Antenna 5 points 3 days ago Believe me. This was not built for the \"climate conference\". The globalists now have the road they need to get into the Amazon to buy, sell, exploit, mine and destroy it. permalink award report block reply readonly-polarbear 1 points 3 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Aambrick 4 points 3 days ago Oh, the fact that just flying there puts what 75k tons of carbon in the air for all the flights. Meanwhile, cutting 100k trees is about putting 6k tons of carbon or more in the air per day. so essentially in a 1 month period flying is 75k or more tons of carbon, but cutting down all those trees is about at least 180k or more tones in the same amount of time. Then figuring out they literally put roads that were not needed so we extend this time towards say 3-4 years. 180 x 12 is 1.96 Million tons of carbon in a year, and say 3-4 years that reaches 5.7 Million- 8.2 Million tons of Carbon. Oh, it gets better when they will still use flights with rarely using that road. They did it because they could, and they have an attitude similar to those ... Dragon Nobles? ... from that pirate cartoon from Japan. The weird bubble dome people. Edit: World Nobles my bad. permalink award report block reply TooBright 3 points 3 days ago Aww you mean that overpriced Gorillaburger I bought at Rainforest Cafe in the early 2000s didn't prevent that? permalink award report block reply Tophat9000 3 points 3 days ago But that's how they operate... That's how the left operates Socialism for them is just lining their own pockets permalink award report block reply GA_Logic 3 points 3 days ago The best way to combat Co2 concentrations being elevated is to sequester it via with more trees as they will convert into O2. So President Trump is calling out their agenda because if they were serious about the climate change phobia they would not cut down trees. The best way to sequester carbon dioxide is with more vegetation.  The earth has a system in place to address this with increasing temps leading to more rain which means more green earth.  That balance is why the earth is self regulating when it comes to the hydrologic cycle and greenhouse gases. permalink award report block reply TheAttackTitan 3 points 3 days ago I always felt environmental conservation should be a tenant of any Republican’s platform. We can’t exactly call ourselves conservative if we don’t conserve our natural resources, environment, and act as good stewards of the wildlife that we’ve been gifted by God. Teddy Roosevelt was the flagship conservationist and OG progressive who shifted public consciousness about our beautiful natural lands. Say what you will about the national parks service but it’s really one of the few federal departments worth a damn. The fact the environmentalists aren’t livid about clearing large swaths of jungle to make a highway for a climate summit just shows how sanctimonious the modern left is when it comes to environmental protection issues. permalink award report block reply MajorClark 2 points 3 days ago Climate scam permalink award report block reply Say_what_again 2 points 3 days ago There was literally no other suitable place anywhere on the entire planet that could be used for a business meeting, bigot. permalink award report block reply brewser724 2 points 3 days ago Get us the fuck out of the UN already. permalink award report block reply Plsdontfireme 2 points 3 days ago WHO CARES WHAT THEY DO IN BRAZIL?! GAS IS STILL $4.79/GAL\nVOTER ID IS BANNED IN MY STATE\nMY CITY IS RUN BY COMMUNISTS LIBERATE CALIFORNIA permalink award report block reply knnbccb 1 points 3 days ago Nothing to do with protecting the environment, these Planeteer-wannabes just want to grab more cash and seize more power during the process of virtue signalling as protectors of the planet. It's just one manifestation of godless hubris. permalink award report block reply mcoulton 1 points 3 days ago Lot of valuable rainforest trees that are illegal to harvest have been cut down, looks like alot of money to be made permalink award report block reply ShlomoJoe 1 points 3 days ago Climate change is a scam! permalink award report block reply Gravyofshallot 1 points 3 days ago The cartels wanted that road for easier smuggling and human trafficking permalink award report block reply stillbringingitback 1 points 3 days ago I liken these climate conferences to outlaw biker “charity” runs.  They’re an open air disguise for all kinds of trafficking and illegal activity.  A deception so obvious and  so brazen, they can get away with it. permalink award report block reply roadrunner0 1 points 3 days ago It has always been about power over us and not the environment.. permalink award report block reply ColonelKlink 1 points 3 days ago And they used our money to do it. permalink award report block reply behemoth887 1 points 3 days ago muh heckin earth lungs! permalink award report block reply popcycle 1 points 3 days ago they are ripping hell out of rainforest to grow soy beans too and if anybody but chyyyyyyynah was the customer, the hand wringing would be loud and daily. permalink award report block reply SPEDMan64 1 points 3 days ago 'member when Bill Gates said we should cut down a bunch of trees and bury them to fight climate change? And now he doesn't believe in climate change but trees got cut down anyway? I 'member permalink award report block reply FBIsurveillance 1 points 3 days ago great green scam permalink award report block reply Goatboy66 1 points 2 days ago Pull out of the U.N. permalink award report block reply Fren20 1 points 3 days ago This is fucked up shit permalink award report block reply Fresnor 1 points 3 days ago Climate change proclaimers are the largest source of man-made climate change. permalink award report block reply Hikedelics 1 points 2 days ago Idgaf what Brazil does with their rainforests or why. How about a housing market correction or increased wages here at home instead? permalink award report block reply The_Emperor -3 points 3 days ago Roads are good.  Who cares about a couple trees.  Sheesh permalink award report block reply BreakingCNN 2 points 3 days ago Well it's a highway for libtards so... https://youtu.be/l482T0yNkeo permalink parent award report block reply Criss_P_Bacon 1 points 3 days ago Found the retard. permalink parent award report block reply\nExsultate 91 points 3 days ago Climate summits are just another way for the ultra rich to feel good about themselves.  They’re basically jacking themselves off. permalink award report block reply BeauHD 36 points 3 days ago And molesting teenagers and young children on VHS tape permalink parent award report block reply Exsultate 18 points 3 days ago Remember, the uber rich use Betamax. permalink parent award report block reply DT170x 6 points 3 days ago The 0.000001% uses Laserdisks. permalink parent award report block reply Deportthemall23 3 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments... leakmouth 7 points 3 days ago and destroying the environment permalink parent award report block reply Hanging_Chad 7 points 3 days ago Climate Change Circlejerk permalink parent award report block reply HeCantDoIt 2 points 3 days ago Nah, it's an investment for politicians. Spend millions to bribe whore scientists, get the \"scientific\" results you want, and then rake in trillions through carbon taxes. Plus they get to use the excuse \"global climate change can only be fixed with global government\", which makes globo-homos happy when they try to consolidate power and de-industrialize the West. permalink parent award report block reply NotYourMan 1 points 3 days ago Its retarded. permalink parent award report block reply one_cool 1 points 3 days ago They do it for money. they own all the carbon credit, carbon offset, solar, wind energy, electric car companies.  They want to force people to pay them through climate laws.  The need to have a summit to manufacture the problem. permalink parent award report block reply load 1 more comments...\nBeauHD 36 points 3 days ago And molesting teenagers and young children on VHS tape permalink parent award report block reply Exsultate 18 points 3 days ago Remember, the uber rich use Betamax. permalink parent award report block reply DT170x 6 points 3 days ago The 0.000001% uses Laserdisks. permalink parent award report block reply Deportthemall23 3 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments... leakmouth 7 points 3 days ago and destroying the environment permalink parent award report block reply\nExsultate 18 points 3 days ago Remember, the uber rich use Betamax. permalink parent award report block reply DT170x 6 points 3 days ago The 0.000001% uses Laserdisks. permalink parent award report block reply Deportthemall23 3 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments...\nDT170x 6 points 3 days ago The 0.000001% uses Laserdisks. permalink parent award report block reply Deportthemall23 3 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments...\nDeportthemall23 3 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments...\nleakmouth 7 points 3 days ago and destroying the environment permalink parent award report block reply\nHanging_Chad 7 points 3 days ago Climate Change Circlejerk permalink parent award report block reply\nHeCantDoIt 2 points 3 days ago Nah, it's an investment for politicians. Spend millions to bribe whore scientists, get the \"scientific\" results you want, and then rake in trillions through carbon taxes. Plus they get to use the excuse \"global climate change can only be fixed with global government\", which makes globo-homos happy when they try to consolidate power and de-industrialize the West. permalink parent award report block reply\nNotYourMan 1 points 3 days ago Its retarded. permalink parent award report block reply\none_cool 1 points 3 days ago They do it for money. they own all the carbon credit, carbon offset, solar, wind energy, electric car companies.  They want to force people to pay them through climate laws.  The need to have a summit to manufacture the problem. permalink parent award report block reply\nMakingArrowsOrange 26 points 3 days ago Environmentalists don't give a shit about the environment, just like PETA doesn't give a shit about animals. More at 11. permalink award report block reply deleted 7 points 3 days ago fazaman 1 points 2 days ago Right. The grift is simple: Find a cause that sounds good and you can raise large amounts of money off of. Do so and spend a tiny fraction of that money on said cause. Pay yourself and your friends a huge salary. Pay kickbacks to politicians that send you taxpayer money. Rinse. Repeat. permalink parent award report block reply Fren20 -1 points 3 days ago Yes we do permalink parent award report block reply\ndeleted 7 points 3 days ago fazaman 1 points 2 days ago Right. The grift is simple: Find a cause that sounds good and you can raise large amounts of money off of. Do so and spend a tiny fraction of that money on said cause. Pay yourself and your friends a huge salary. Pay kickbacks to politicians that send you taxpayer money. Rinse. Repeat. permalink parent award report block reply\nfazaman 1 points 2 days ago Right. The grift is simple: Find a cause that sounds good and you can raise large amounts of money off of. Do so and spend a tiny fraction of that money on said cause. Pay yourself and your friends a huge salary. Pay kickbacks to politicians that send you taxpayer money. Rinse. Repeat. permalink parent award report block reply\nFren20 -1 points 3 days ago Yes we do permalink parent award report block reply\nExecutarian2 13 points 3 days ago I love posts like this from Trump. What does he mean? Is he pro or anti-environment here? permalink award report block reply PosterIsDead 49 points 3 days ago He means \"look at these hypocrites on their way to a massive circle jerk\". permalink parent award report block reply halcyondream 16 points 3 days ago And as an aside I think we all should be pro-environment where it makes sense. Man-made climate change is a scam, there's a reason they changed it from global warming to that, climate change always happens and is natural. permalink parent award report block reply staroframphansbhole 6 points 3 days ago Littering should be a capital offense, carbon taxes are bullshit permalink parent award report block reply Rusty_Shackleford 2 points 2 days ago Clean air, clean water, and healthy soil!  The economy is important, but we don’t want to live in a permanent cloud of smog like Beijing. permalink parent award report block reply Fren20 0 points 3 days ago Yeah walk across a  black top parking lot permalink parent award report block reply Executarian2 2 points 3 days ago Makes sense. Thanks! permalink parent award report block reply AngryWriter 22 points 3 days ago In this case it truly doesn't matter. If you are pro-environment, you should be enraged that the environment is being destroyed just for some conference. If you think environmentalism is a waste of time and money, this is an exceedingly big example to prove the point. Trump wins either way. permalink parent award report block reply Executarian2 5 points 3 days ago Fair point! permalink parent award report block reply LWGII 7 points 3 days ago He's anti-stupid. permalink parent award report block reply BreakingCNN 6 points 3 days ago Trump is 100% Pro environment and 10,000% pro recycling just like I am!\nI've been recycling dinosaurs at 8 to 13 MPG for 50 years! permalink parent award report block reply Sparks1017 4 points 3 days ago Not anti-environment, he's anti these hysterical climate alarmists permalink parent award report block reply Executarian2 3 points 3 days ago That part makes sense, it's just odd that he wouldn't add any of his own commentary -- like he's just pointing out that it's an event that people have opinions on without stating his own. permalink parent award report block reply Sparks1017 1 points 3 days ago Yes, true, but I believe he makes his point. Especially the last sentence. \"100,000 trees cut for a highway leading to a UN summit\", I think sums up his feelings, we know what he thinks of the UN permalink parent award report block reply Executarian2 1 points 3 days ago I generally get it, and it's not that serious at all. I just think it's funny for him not to take this time to rip into Lula or the UN, lol. permalink parent award report block reply load 3 more comments...\nPosterIsDead 49 points 3 days ago He means \"look at these hypocrites on their way to a massive circle jerk\". permalink parent award report block reply halcyondream 16 points 3 days ago And as an aside I think we all should be pro-environment where it makes sense. Man-made climate change is a scam, there's a reason they changed it from global warming to that, climate change always happens and is natural. permalink parent award report block reply staroframphansbhole 6 points 3 days ago Littering should be a capital offense, carbon taxes are bullshit permalink parent award report block reply Rusty_Shackleford 2 points 2 days ago Clean air, clean water, and healthy soil!  The economy is important, but we don’t want to live in a permanent cloud of smog like Beijing. permalink parent award report block reply Fren20 0 points 3 days ago Yeah walk across a  black top parking lot permalink parent award report block reply Executarian2 2 points 3 days ago Makes sense. Thanks! permalink parent award report block reply\nhalcyondream 16 points 3 days ago And as an aside I think we all should be pro-environment where it makes sense. Man-made climate change is a scam, there's a reason they changed it from global warming to that, climate change always happens and is natural. permalink parent award report block reply staroframphansbhole 6 points 3 days ago Littering should be a capital offense, carbon taxes are bullshit permalink parent award report block reply Rusty_Shackleford 2 points 2 days ago Clean air, clean water, and healthy soil!  The economy is important, but we don’t want to live in a permanent cloud of smog like Beijing. permalink parent award report block reply Fren20 0 points 3 days ago Yeah walk across a  black top parking lot permalink parent award report block reply\nstaroframphansbhole 6 points 3 days ago Littering should be a capital offense, carbon taxes are bullshit permalink parent award report block reply\nRusty_Shackleford 2 points 2 days ago Clean air, clean water, and healthy soil!  The economy is important, but we don’t want to live in a permanent cloud of smog like Beijing. permalink parent award report block reply\nFren20 0 points 3 days ago Yeah walk across a  black top parking lot permalink parent award report block reply\nExecutarian2 2 points 3 days ago Makes sense. Thanks! permalink parent award report block reply\nAngryWriter 22 points 3 days ago In this case it truly doesn't matter. If you are pro-environment, you should be enraged that the environment is being destroyed just for some conference. If you think environmentalism is a waste of time and money, this is an exceedingly big example to prove the point. Trump wins either way. permalink parent award report block reply Executarian2 5 points 3 days ago Fair point! permalink parent award report block reply\nExecutarian2 5 points 3 days ago Fair point! permalink parent award report block reply\nLWGII 7 points 3 days ago He's anti-stupid. permalink parent award report block reply\nBreakingCNN 6 points 3 days ago Trump is 100% Pro environment and 10,000% pro recycling just like I am!\nI've been recycling dinosaurs at 8 to 13 MPG for 50 years! permalink parent award report block reply\nSparks1017 4 points 3 days ago Not anti-environment, he's anti these hysterical climate alarmists permalink parent award report block reply Executarian2 3 points 3 days ago That part makes sense, it's just odd that he wouldn't add any of his own commentary -- like he's just pointing out that it's an event that people have opinions on without stating his own. permalink parent award report block reply Sparks1017 1 points 3 days ago Yes, true, but I believe he makes his point. Especially the last sentence. \"100,000 trees cut for a highway leading to a UN summit\", I think sums up his feelings, we know what he thinks of the UN permalink parent award report block reply Executarian2 1 points 3 days ago I generally get it, and it's not that serious at all. I just think it's funny for him not to take this time to rip into Lula or the UN, lol. permalink parent award report block reply\nExecutarian2 3 points 3 days ago That part makes sense, it's just odd that he wouldn't add any of his own commentary -- like he's just pointing out that it's an event that people have opinions on without stating his own. permalink parent award report block reply Sparks1017 1 points 3 days ago Yes, true, but I believe he makes his point. Especially the last sentence. \"100,000 trees cut for a highway leading to a UN summit\", I think sums up his feelings, we know what he thinks of the UN permalink parent award report block reply Executarian2 1 points 3 days ago I generally get it, and it's not that serious at all. I just think it's funny for him not to take this time to rip into Lula or the UN, lol. permalink parent award report block reply\nSparks1017 1 points 3 days ago Yes, true, but I believe he makes his point. Especially the last sentence. \"100,000 trees cut for a highway leading to a UN summit\", I think sums up his feelings, we know what he thinks of the UN permalink parent award report block reply Executarian2 1 points 3 days ago I generally get it, and it's not that serious at all. I just think it's funny for him not to take this time to rip into Lula or the UN, lol. permalink parent award report block reply\nExecutarian2 1 points 3 days ago I generally get it, and it's not that serious at all. I just think it's funny for him not to take this time to rip into Lula or the UN, lol. permalink parent award report block reply\npedewithweed 9 points 3 days ago Thats a lot of lost oxygen permalink award report block reply Lady_MaGa 6 points 3 days ago That's also a lot of money lost from \"global citizens\" to pay for said road. permalink parent award report block reply BreakingCNN 3 points 3 days ago That's a lot of lumber! A lot of jobs! Buy some XOM! permalink parent award report block reply Nibba2 2 points 3 days ago Honest question though, here in America we are pro farming and drilling. Brazil doesn’t get paid for keeping trees. Why can’t they do what they need or want. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago It seems like big pharma would be blocking the destruction so they could find natural cures and then sell dangerous synthetic forms of them so they could create more business. Maybe their covid mRNA experiment on the public advanced their research so much that they can manufacture cures for the elite with AI designed mRNA now. permalink parent award report block reply Nibba2 1 points 3 days ago It’s not like they took down the entire forest. permalink parent award report block reply Electrocutioner 1 points 3 days ago That old meme of the rainforest being responsible for producing a large amount of oxygen is fake and gay. permalink parent award report block reply\nLady_MaGa 6 points 3 days ago That's also a lot of money lost from \"global citizens\" to pay for said road. permalink parent award report block reply BreakingCNN 3 points 3 days ago That's a lot of lumber! A lot of jobs! Buy some XOM! permalink parent award report block reply\nBreakingCNN 3 points 3 days ago That's a lot of lumber! A lot of jobs! Buy some XOM! permalink parent award report block reply\nNibba2 2 points 3 days ago Honest question though, here in America we are pro farming and drilling. Brazil doesn’t get paid for keeping trees. Why can’t they do what they need or want. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago It seems like big pharma would be blocking the destruction so they could find natural cures and then sell dangerous synthetic forms of them so they could create more business. Maybe their covid mRNA experiment on the public advanced their research so much that they can manufacture cures for the elite with AI designed mRNA now. permalink parent award report block reply Nibba2 1 points 3 days ago It’s not like they took down the entire forest. permalink parent award report block reply\nTrumpAndGodWin 1 points 3 days ago It seems like big pharma would be blocking the destruction so they could find natural cures and then sell dangerous synthetic forms of them so they could create more business. Maybe their covid mRNA experiment on the public advanced their research so much that they can manufacture cures for the elite with AI designed mRNA now. permalink parent award report block reply Nibba2 1 points 3 days ago It’s not like they took down the entire forest. permalink parent award report block reply\nNibba2 1 points 3 days ago It’s not like they took down the entire forest. permalink parent award report block reply\nElectrocutioner 1 points 3 days ago That old meme of the rainforest being responsible for producing a large amount of oxygen is fake and gay. permalink parent award report block reply\nViewer01 6 points 3 days ago You can’t hate these people enough. permalink award report block reply\nSuperHonkey 6 points 3 days ago Who else clicked on the play button more than once 😅 permalink award report block reply BreakingCNN 8 points 3 days ago I'm still clicking on it permalink parent award report block reply lovemylibs 7 points 3 days ago It worked for me. permalink parent award report block reply\nBreakingCNN 8 points 3 days ago I'm still clicking on it permalink parent award report block reply\nlovemylibs 7 points 3 days ago It worked for me. permalink parent award report block reply\nMr_Rightside OP 6 points 3 days ago https://truthsocial.com/@realDonaldTrump/posts/115520633257497938 permalink award report block reply\nAntenna 5 points 3 days ago Believe me. This was not built for the \"climate conference\". The globalists now have the road they need to get into the Amazon to buy, sell, exploit, mine and destroy it. permalink award report block reply readonly-polarbear 1 points 3 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nreadonly-polarbear 1 points 3 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nAambrick 4 points 3 days ago Oh, the fact that just flying there puts what 75k tons of carbon in the air for all the flights. Meanwhile, cutting 100k trees is about putting 6k tons of carbon or more in the air per day. so essentially in a 1 month period flying is 75k or more tons of carbon, but cutting down all those trees is about at least 180k or more tones in the same amount of time. Then figuring out they literally put roads that were not needed so we extend this time towards say 3-4 years. 180 x 12 is 1.96 Million tons of carbon in a year, and say 3-4 years that reaches 5.7 Million- 8.2 Million tons of Carbon. Oh, it gets better when they will still use flights with rarely using that road. They did it because they could, and they have an attitude similar to those ... Dragon Nobles? ... from that pirate cartoon from Japan. The weird bubble dome people. Edit: World Nobles my bad. permalink award report block reply\nTooBright 3 points 3 days ago Aww you mean that overpriced Gorillaburger I bought at Rainforest Cafe in the early 2000s didn't prevent that? permalink award report block reply\nTophat9000 3 points 3 days ago But that's how they operate... That's how the left operates Socialism for them is just lining their own pockets permalink award report block reply\nGA_Logic 3 points 3 days ago The best way to combat Co2 concentrations being elevated is to sequester it via with more trees as they will convert into O2. So President Trump is calling out their agenda because if they were serious about the climate change phobia they would not cut down trees. The best way to sequester carbon dioxide is with more vegetation.  The earth has a system in place to address this with increasing temps leading to more rain which means more green earth.  That balance is why the earth is self regulating when it comes to the hydrologic cycle and greenhouse gases. permalink award report block reply\nTheAttackTitan 3 points 3 days ago I always felt environmental conservation should be a tenant of any Republican’s platform. We can’t exactly call ourselves conservative if we don’t conserve our natural resources, environment, and act as good stewards of the wildlife that we’ve been gifted by God. Teddy Roosevelt was the flagship conservationist and OG progressive who shifted public consciousness about our beautiful natural lands. Say what you will about the national parks service but it’s really one of the few federal departments worth a damn. The fact the environmentalists aren’t livid about clearing large swaths of jungle to make a highway for a climate summit just shows how sanctimonious the modern left is when it comes to environmental protection issues. permalink award report block reply\nMajorClark 2 points 3 days ago Climate scam permalink award report block reply\nSay_what_again 2 points 3 days ago There was literally no other suitable place anywhere on the entire planet that could be used for a business meeting, bigot. permalink award report block reply\nbrewser724 2 points 3 days ago Get us the fuck out of the UN already. permalink award report block reply\nPlsdontfireme 2 points 3 days ago WHO CARES WHAT THEY DO IN BRAZIL?! GAS IS STILL $4.79/GAL\nVOTER ID IS BANNED IN MY STATE\nMY CITY IS RUN BY COMMUNISTS LIBERATE CALIFORNIA permalink award report block reply\nknnbccb 1 points 3 days ago Nothing to do with protecting the environment, these Planeteer-wannabes just want to grab more cash and seize more power during the process of virtue signalling as protectors of the planet. It's just one manifestation of godless hubris. permalink award report block reply\nmcoulton 1 points 3 days ago Lot of valuable rainforest trees that are illegal to harvest have been cut down, looks like alot of money to be made permalink award report block reply\nShlomoJoe 1 points 3 days ago Climate change is a scam! permalink award report block reply\nGravyofshallot 1 points 3 days ago The cartels wanted that road for easier smuggling and human trafficking permalink award report block reply\nstillbringingitback 1 points 3 days ago I liken these climate conferences to outlaw biker “charity” runs.  They’re an open air disguise for all kinds of trafficking and illegal activity.  A deception so obvious and  so brazen, they can get away with it. permalink award report block reply\nroadrunner0 1 points 3 days ago It has always been about power over us and not the environment.. permalink award report block reply\nColonelKlink 1 points 3 days ago And they used our money to do it. permalink award report block reply\nbehemoth887 1 points 3 days ago muh heckin earth lungs! permalink award report block reply\npopcycle 1 points 3 days ago they are ripping hell out of rainforest to grow soy beans too and if anybody but chyyyyyyynah was the customer, the hand wringing would be loud and daily. permalink award report block reply\nSPEDMan64 1 points 3 days ago 'member when Bill Gates said we should cut down a bunch of trees and bury them to fight climate change? And now he doesn't believe in climate change but trees got cut down anyway? I 'member permalink award report block reply\nFBIsurveillance 1 points 3 days ago great green scam permalink award report block reply\nGoatboy66 1 points 2 days ago Pull out of the U.N. permalink award report block reply\nFren20 1 points 3 days ago This is fucked up shit permalink award report block reply\nFresnor 1 points 3 days ago Climate change proclaimers are the largest source of man-made climate change. permalink award report block reply\nHikedelics 1 points 2 days ago Idgaf what Brazil does with their rainforests or why. How about a housing market correction or increased wages here at home instead? permalink award report block reply\nThe_Emperor -3 points 3 days ago Roads are good.  Who cares about a couple trees.  Sheesh permalink award report block reply BreakingCNN 2 points 3 days ago Well it's a highway for libtards so... https://youtu.be/l482T0yNkeo permalink parent award report block reply Criss_P_Bacon 1 points 3 days ago Found the retard. permalink parent award report block reply\nBreakingCNN 2 points 3 days ago Well it's a highway for libtards so... https://youtu.be/l482T0yNkeo permalink parent award report block reply\nCriss_P_Bacon 1 points 3 days ago Found the retard. permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:53:34.919877Z"
}