{
  "id": "8185204",
  "title": "1068Orbán - \"Brussels has issued the order. They are activating the Migration Pact. I want to make i",
  "url": "https://patriots.win/p/1ARK9nOFgS/orbn--brussels-has-issued-the-or/c",
  "content": "1360 Orbán - \"Brussels has issued the order. They are activating the Migration Pact. I want to make it clear once and for all: as long as Hungary has a patriotic government, we will not implement the Migration Pact. Ceterum censeo: we will not accept migrants and we will not spend a single dime on them!\" posted 9 hours ago by Royall 67 comments award share download report block\n67 comments Sort by Top Top New Worst Old Save Jbliss 115 points 9 hours ago Dear God, I see what Hungary has and I want it for myself and my family. Amen. permalink award report block reply Wtf_socialismreally 37 points 9 hours ago Envy may be sinful but in this thing I struggle. permalink parent award report block reply MrCuriousGuy513 8 points 7 hours ago Just say you desire it\nEnvy is a sin because it seeks to ruin or poison everything it wants, thus ensuring no one gets to have it.\nIt is known as “The Daughter of Pride.”\nSurely, you don’t mean to poison that government. permalink parent award report block reply Chickapede 7 points 6 hours ago Someone once said Envy is the only deadly sin we get no enjoyment from. permalink parent award report block reply MrCuriousGuy513 2 points 4 hours ago They would be right. permalink parent award report block reply bill_in_texas 21 points 9 hours ago I want it for my country. permalink parent award report block reply Liberals_R_Idiots 12 points 8 hours ago I was there last year. It’s a beautiful country with a beautiful capital city that isn’t infected with pisslam permalink parent award report block reply FusionBlack 7 points 8 hours ago I am asking myself \"what is thier immigration process\"? permalink parent award report block reply BeauHD 2 points 7 hours ago They are too based to have one IMO. GET OUT AND STAY OUT. permalink parent award report block reply EvJohn 3 points 9 hours ago Boogedey,boogedy,bogged.\nAnd amen!! permalink parent award report block reply load 2 more comments... PenguinOfDoom 59 points 9 hours ago Hungary and Poland may save Europe. permalink award report block reply rebuildingMyself 32 points 9 hours ago Denmark is trying as well permalink parent award report block reply Wtf_socialismreally 20 points 9 hours ago It amazes me how many times through history England and its precursor kingdoms have floundered. Islam may very well be their failure again. permalink parent award report block reply FusionBlack 6 points 8 hours ago Inbreeding on both counts tend to develop this outcome. permalink parent award report block reply snoopy3210 5 points 6 hours ago King Charles is a failure permalink parent award report block reply TwoArizonaPedes 3 points 3 hours ago I'm surprised he's survived this long. QEII was desperately trying to outlive him. William had better be an improvement. permalink parent award report block reply SicSemperTyrannis2 -1 points 4 hours ago He tries very hard for exactly what he's accomplishing, that's not failure in any sense of the word. permalink parent award report block reply Pederella 7 points 7 hours ago Poland is in danger. New government is reversing policies and bringing in orcs and muzzies. permalink parent award report block reply Elencher 2 points 6 hours ago Thought they got rid of Tusk and the new guy was back to deporting the muslims? permalink parent award report block reply yodayoda 1 points 8 hours ago Not Poland permalink parent award report block reply MastaJoda 31 points 9 hours ago God bless him and protect him from the evils in this world. permalink award report block reply rivetjoint2 30 points 9 hours ago The EU is hell bent on self destruction.  The corruption must be off the charts, because no sane person would be for this. permalink award report block reply Karpus 15 points 7 hours ago No, the globalists in charge are hellbent on destroying Europe to implement their techno-feudalism hellscape wet dream permalink parent award report block reply someguy7738 7 points 6 hours ago This. Already effectively owning and controlling everything apparently isn't enough for them, the people have to suffer too. It's obscene and outright evil. permalink parent award report block reply ActNow 8 points 7 hours ago The EU government* permalink parent award report block reply FuckU/Spez 16 points 8 hours ago I was in Budapest, fuking felt safe the entire time knowing there was not a jobber in sight!  Did see many Ukrainians, all left Ukraine because Zelenski was corrupt as heck, they left because they didn't want to war for that criminal. Lots of uber drivers.  Even a guy from Uzbekistan, he didn't speak a lick of english, but said Biden was a total clown. Trump... (he made bicep curl signal) permalink award report block reply Stolen 9 points 9 hours ago Hungary stopped the Mongol invasion and Ottomans Muslims from the East. Now they have to stopped the Muslim invasion fro the Brussels. permalink award report block reply Ale_and_Mead 7 points 8 hours ago For those who don't know Latin, \"ceterum censeo\" would translate (in this context) to something to the effect of \"but yet I decree.\" In other contexts, it can mean a bunch of other things. Such is Latin. Edit - here's a perfect example of context mattering. I didn't catch the \"we will not implement the Migration Pact.\" Since that was explicitly stated, it changes the context of ceterum, so the translation would be \"furthermore I decree.* Ceterum means, among a few other things, \"but yet\" and \"furthermore.\" permalink award report block reply Italianshamrock 2 points 8 hours ago However I think according to google translate. permalink parent award report block reply Ale_and_Mead 4 points 8 hours ago That's actually a possible translation, surprisingly. Google translate is absolutely horrendous at Latin. permalink parent award report block reply Italianshamrock 2 points 6 hours ago And sometimes other languages 🙄 permalink parent award report block reply DarthVerminates 1 points 4 hours ago Hungarians are not that into Rome btw. Speaking Latin is a weird vibe from them. Like a American slipping into German or Japanese specifically to dredge up their WWII behavior and menace... I was hearing Brussels must be destroyed as the next unspoken part. permalink parent award report block reply SicSemperTyrannis2 0 points 4 hours ago You've never watched Hogan's Heroes? permalink parent award report block reply Wexit-Delecto 6 points 8 hours ago End the EU! permalink award report block reply Uffda 6 points 8 hours ago Make Hungary our 51st State! permalink award report block reply MoldyLocksNesMonste 4 points 7 hours ago Why? So they have to take H1Bs, refugees, and migration from the US? permalink parent award report block reply Tyscribz 5 points 8 hours ago Based and Nationalist-pilled permalink award report block reply Hangmhigh 5 points 8 hours ago Its time to declare war with Brussels, they have already attacked! permalink award report block reply ShaolinMaster 5 points 8 hours ago Time to send Hungary some missiles to stop Brussels. permalink award report block reply Beer-_-Belly 5 points 8 hours ago Imagine voting for the invasion of your own country. permalink award report block reply NY2KCMO1776 4 points 7 hours ago You don't have to imagine, you live in America. Let's not pretend that we are a homogeneous nation that hasn't imported 10s of millions of illegals while white women gleeful and tearfully support and celebrate the invasion permalink parent award report block reply Executarian2 4 points 8 hours ago GOOD! The US should follow suit. permalink award report block reply Pats5x 6 points 8 hours ago LOL thats a good one.  The international banking cartel would never allow it permalink parent award report block reply cornpop_1988 3 points 7 hours ago The whole Slavic nations of Europe need to form a pact and end this shit. permalink award report block reply Crappydatum 2 points 6 hours ago They should name it Union of Slavic States Reunited permalink parent award report block reply POTUS_DonnieJ 3 points 7 hours ago I don’t know if Hungary is paying the 1 million euro per day fine being levied on them by the EU, but if they are, they should stop that too. Fuck the EU, force them to show their hand. permalink award report block reply sorrytodisagree 3 points 8 hours ago Link: https://x.com/PM_ViktorOrban/status/1988597450710397171 permalink award report block reply Memebot 3 points 7 hours ago So happy to have Hungarian descent permalink award report block reply Aquamine-Amarine 3 points 7 hours ago Same. permalink parent award report block reply MAGALADON9 2 points 7 hours ago Ok show offs we get it, I'm proud of ya too. 😀 permalink parent award report block reply SBOJ_JOBS 3 points 8 hours ago Ceterum censeso that I like Orban more and more each day. permalink award report block reply Shaffro 2 points 4 hours ago I wish that was us. permalink award report block reply thisisatestof2 2 points 7 hours ago This is the way! permalink award report block reply Roadpower 1 points 2 hours ago Sane versus insane societies. This is what we need from OUR congress and Trump. If we don't get it then they are obviously not our congress and Trump really isn't here to help us as he should be pounding congress every single day to put up the goods. permalink award report block reply greatpumpkin 1 points 6 hours ago When are they leaving the EU? Hexit now! permalink award report block reply Michalusmichalus 1 points 5 hours ago The EU has deemed every election trying to leave them a fraudulent election. permalink parent award report block reply alucard13mmfmj 1 points 32 minutes ago Then leave the EU.. doesnt matter if you dont let in rapefugees. Retards in france and germany will let them in, make them citizens and now those rapefugees can enter your country to rape and pillage. permalink award report block reply MoldyLocksNesMonste 1 points 7 hours ago How soon until we discover terrorist cells in Hungary that require US made freedom bombs? permalink award report block reply Tongs_Ya_Bass 1 points 7 hours ago Leave the E.U. Referendum for Hungary. permalink award report block reply MeMargie 1 points 7 hours ago Insanity to destroy your own country. permalink award report block reply knnbccb 1 points 6 hours ago Brussels needs to be nuked. permalink award report block reply PatriotSkorzeny 1 points 7 hours ago We also ask you don’t send them. If you do, you’re a faggot. permalink award report block reply Crappydatum 1 points 6 hours ago Ah yes, brings me back to high school Latin reading Cato Ceterum censeo Carthaginem esse delendam permalink award report block reply MAGALADON9 1 points 7 hours ago WE STAND WITH YOU VICTOR!!!!\nTHERE YOU WILL STAND AGAINST THE HORDES! MAY YOUR GLORY LIVE FOREVER! HAA OOO! HAA OOO! HAA OOO! permalink award report block reply Trumpy_Bear 1 points 2 hours ago Well, they shouldn't have joined the EU in the first place permalink award report block reply RandyQuaidsBeard 1 points 6 hours ago The eu will make war on them? If not, fuck off. If so, double fuck off. permalink award report block reply SavingPrivateGrace 1 points 8 hours ago Comment removed by community filter. permalink award report block reply\nJbliss 115 points 9 hours ago Dear God, I see what Hungary has and I want it for myself and my family. Amen. permalink award report block reply Wtf_socialismreally 37 points 9 hours ago Envy may be sinful but in this thing I struggle. permalink parent award report block reply MrCuriousGuy513 8 points 7 hours ago Just say you desire it\nAnd amen!! permalink parent award report block reply load 2 more comments...\nWtf_socialismreally 37 points 9 hours ago Envy may be sinful but in this thing I struggle. permalink parent award report block reply MrCuriousGuy513 8 points 7 hours ago Just say you desire it\nSurely, you don’t mean to poison that government. permalink parent award report block reply Chickapede 7 points 6 hours ago Someone once said Envy is the only deadly sin we get no enjoyment from. permalink parent award report block reply MrCuriousGuy513 2 points 4 hours ago They would be right. permalink parent award report block reply\nMrCuriousGuy513 8 points 7 hours ago Just say you desire it\nChickapede 7 points 6 hours ago Someone once said Envy is the only deadly sin we get no enjoyment from. permalink parent award report block reply MrCuriousGuy513 2 points 4 hours ago They would be right. permalink parent award report block reply\nMrCuriousGuy513 2 points 4 hours ago They would be right. permalink parent award report block reply\nbill_in_texas 21 points 9 hours ago I want it for my country. permalink parent award report block reply\nLiberals_R_Idiots 12 points 8 hours ago I was there last year. It’s a beautiful country with a beautiful capital city that isn’t infected with pisslam permalink parent award report block reply\nFusionBlack 7 points 8 hours ago I am asking myself \"what is thier immigration process\"? permalink parent award report block reply BeauHD 2 points 7 hours ago They are too based to have one IMO. GET OUT AND STAY OUT. permalink parent award report block reply\nBeauHD 2 points 7 hours ago They are too based to have one IMO. GET OUT AND STAY OUT. permalink parent award report block reply\nEvJohn 3 points 9 hours ago Boogedey,boogedy,bogged.\nAnd amen!! permalink parent award report block reply\nPenguinOfDoom 59 points 9 hours ago Hungary and Poland may save Europe. permalink award report block reply rebuildingMyself 32 points 9 hours ago Denmark is trying as well permalink parent award report block reply Wtf_socialismreally 20 points 9 hours ago It amazes me how many times through history England and its precursor kingdoms have floundered. Islam may very well be their failure again. permalink parent award report block reply FusionBlack 6 points 8 hours ago Inbreeding on both counts tend to develop this outcome. permalink parent award report block reply snoopy3210 5 points 6 hours ago King Charles is a failure permalink parent award report block reply TwoArizonaPedes 3 points 3 hours ago I'm surprised he's survived this long. QEII was desperately trying to outlive him. William had better be an improvement. permalink parent award report block reply SicSemperTyrannis2 -1 points 4 hours ago He tries very hard for exactly what he's accomplishing, that's not failure in any sense of the word. permalink parent award report block reply Pederella 7 points 7 hours ago Poland is in danger. New government is reversing policies and bringing in orcs and muzzies. permalink parent award report block reply Elencher 2 points 6 hours ago Thought they got rid of Tusk and the new guy was back to deporting the muslims? permalink parent award report block reply yodayoda 1 points 8 hours ago Not Poland permalink parent award report block reply\nrebuildingMyself 32 points 9 hours ago Denmark is trying as well permalink parent award report block reply Wtf_socialismreally 20 points 9 hours ago It amazes me how many times through history England and its precursor kingdoms have floundered. Islam may very well be their failure again. permalink parent award report block reply FusionBlack 6 points 8 hours ago Inbreeding on both counts tend to develop this outcome. permalink parent award report block reply snoopy3210 5 points 6 hours ago King Charles is a failure permalink parent award report block reply TwoArizonaPedes 3 points 3 hours ago I'm surprised he's survived this long. QEII was desperately trying to outlive him. William had better be an improvement. permalink parent award report block reply SicSemperTyrannis2 -1 points 4 hours ago He tries very hard for exactly what he's accomplishing, that's not failure in any sense of the word. permalink parent award report block reply\nWtf_socialismreally 20 points 9 hours ago It amazes me how many times through history England and its precursor kingdoms have floundered. Islam may very well be their failure again. permalink parent award report block reply FusionBlack 6 points 8 hours ago Inbreeding on both counts tend to develop this outcome. permalink parent award report block reply snoopy3210 5 points 6 hours ago King Charles is a failure permalink parent award report block reply TwoArizonaPedes 3 points 3 hours ago I'm surprised he's survived this long. QEII was desperately trying to outlive him. William had better be an improvement. permalink parent award report block reply SicSemperTyrannis2 -1 points 4 hours ago He tries very hard for exactly what he's accomplishing, that's not failure in any sense of the word. permalink parent award report block reply\nFusionBlack 6 points 8 hours ago Inbreeding on both counts tend to develop this outcome. permalink parent award report block reply\nsnoopy3210 5 points 6 hours ago King Charles is a failure permalink parent award report block reply TwoArizonaPedes 3 points 3 hours ago I'm surprised he's survived this long. QEII was desperately trying to outlive him. William had better be an improvement. permalink parent award report block reply SicSemperTyrannis2 -1 points 4 hours ago He tries very hard for exactly what he's accomplishing, that's not failure in any sense of the word. permalink parent award report block reply\nTwoArizonaPedes 3 points 3 hours ago I'm surprised he's survived this long. QEII was desperately trying to outlive him. William had better be an improvement. permalink parent award report block reply\nSicSemperTyrannis2 -1 points 4 hours ago He tries very hard for exactly what he's accomplishing, that's not failure in any sense of the word. permalink parent award report block reply\nPederella 7 points 7 hours ago Poland is in danger. New government is reversing policies and bringing in orcs and muzzies. permalink parent award report block reply Elencher 2 points 6 hours ago Thought they got rid of Tusk and the new guy was back to deporting the muslims? permalink parent award report block reply\nElencher 2 points 6 hours ago Thought they got rid of Tusk and the new guy was back to deporting the muslims? permalink parent award report block reply\nyodayoda 1 points 8 hours ago Not Poland permalink parent award report block reply\nMastaJoda 31 points 9 hours ago God bless him and protect him from the evils in this world. permalink award report block reply\nrivetjoint2 30 points 9 hours ago The EU is hell bent on self destruction.  The corruption must be off the charts, because no sane person would be for this. permalink award report block reply Karpus 15 points 7 hours ago No, the globalists in charge are hellbent on destroying Europe to implement their techno-feudalism hellscape wet dream permalink parent award report block reply someguy7738 7 points 6 hours ago This. Already effectively owning and controlling everything apparently isn't enough for them, the people have to suffer too. It's obscene and outright evil. permalink parent award report block reply ActNow 8 points 7 hours ago The EU government* permalink parent award report block reply\nKarpus 15 points 7 hours ago No, the globalists in charge are hellbent on destroying Europe to implement their techno-feudalism hellscape wet dream permalink parent award report block reply someguy7738 7 points 6 hours ago This. Already effectively owning and controlling everything apparently isn't enough for them, the people have to suffer too. It's obscene and outright evil. permalink parent award report block reply\nsomeguy7738 7 points 6 hours ago This. Already effectively owning and controlling everything apparently isn't enough for them, the people have to suffer too. It's obscene and outright evil. permalink parent award report block reply\nActNow 8 points 7 hours ago The EU government* permalink parent award report block reply\nFuckU/Spez 16 points 8 hours ago I was in Budapest, fuking felt safe the entire time knowing there was not a jobber in sight!  Did see many Ukrainians, all left Ukraine because Zelenski was corrupt as heck, they left because they didn't want to war for that criminal. Lots of uber drivers.  Even a guy from Uzbekistan, he didn't speak a lick of english, but said Biden was a total clown. Trump... (he made bicep curl signal) permalink award report block reply\nStolen 9 points 9 hours ago Hungary stopped the Mongol invasion and Ottomans Muslims from the East. Now they have to stopped the Muslim invasion fro the Brussels. permalink award report block reply\nAle_and_Mead 7 points 8 hours ago For those who don't know Latin, \"ceterum censeo\" would translate (in this context) to something to the effect of \"but yet I decree.\" In other contexts, it can mean a bunch of other things. Such is Latin. Edit - here's a perfect example of context mattering. I didn't catch the \"we will not implement the Migration Pact.\" Since that was explicitly stated, it changes the context of ceterum, so the translation would be \"furthermore I decree.* Ceterum means, among a few other things, \"but yet\" and \"furthermore.\" permalink award report block reply Italianshamrock 2 points 8 hours ago However I think according to google translate. permalink parent award report block reply Ale_and_Mead 4 points 8 hours ago That's actually a possible translation, surprisingly. Google translate is absolutely horrendous at Latin. permalink parent award report block reply Italianshamrock 2 points 6 hours ago And sometimes other languages 🙄 permalink parent award report block reply DarthVerminates 1 points 4 hours ago Hungarians are not that into Rome btw. Speaking Latin is a weird vibe from them. Like a American slipping into German or Japanese specifically to dredge up their WWII behavior and menace... I was hearing Brussels must be destroyed as the next unspoken part. permalink parent award report block reply SicSemperTyrannis2 0 points 4 hours ago You've never watched Hogan's Heroes? permalink parent award report block reply\nItalianshamrock 2 points 8 hours ago However I think according to google translate. permalink parent award report block reply Ale_and_Mead 4 points 8 hours ago That's actually a possible translation, surprisingly. Google translate is absolutely horrendous at Latin. permalink parent award report block reply Italianshamrock 2 points 6 hours ago And sometimes other languages 🙄 permalink parent award report block reply\nAle_and_Mead 4 points 8 hours ago That's actually a possible translation, surprisingly. Google translate is absolutely horrendous at Latin. permalink parent award report block reply Italianshamrock 2 points 6 hours ago And sometimes other languages 🙄 permalink parent award report block reply\nItalianshamrock 2 points 6 hours ago And sometimes other languages 🙄 permalink parent award report block reply\nDarthVerminates 1 points 4 hours ago Hungarians are not that into Rome btw. Speaking Latin is a weird vibe from them. Like a American slipping into German or Japanese specifically to dredge up their WWII behavior and menace... I was hearing Brussels must be destroyed as the next unspoken part. permalink parent award report block reply SicSemperTyrannis2 0 points 4 hours ago You've never watched Hogan's Heroes? permalink parent award report block reply\nSicSemperTyrannis2 0 points 4 hours ago You've never watched Hogan's Heroes? permalink parent award report block reply\nWexit-Delecto 6 points 8 hours ago End the EU! permalink award report block reply\nUffda 6 points 8 hours ago Make Hungary our 51st State! permalink award report block reply MoldyLocksNesMonste 4 points 7 hours ago Why? So they have to take H1Bs, refugees, and migration from the US? permalink parent award report block reply\nMoldyLocksNesMonste 4 points 7 hours ago Why? So they have to take H1Bs, refugees, and migration from the US? permalink parent award report block reply\nTyscribz 5 points 8 hours ago Based and Nationalist-pilled permalink award report block reply\nHangmhigh 5 points 8 hours ago Its time to declare war with Brussels, they have already attacked! permalink award report block reply\nShaolinMaster 5 points 8 hours ago Time to send Hungary some missiles to stop Brussels. permalink award report block reply\nBeer-_-Belly 5 points 8 hours ago Imagine voting for the invasion of your own country. permalink award report block reply NY2KCMO1776 4 points 7 hours ago You don't have to imagine, you live in America. Let's not pretend that we are a homogeneous nation that hasn't imported 10s of millions of illegals while white women gleeful and tearfully support and celebrate the invasion permalink parent award report block reply\nNY2KCMO1776 4 points 7 hours ago You don't have to imagine, you live in America. Let's not pretend that we are a homogeneous nation that hasn't imported 10s of millions of illegals while white women gleeful and tearfully support and celebrate the invasion permalink parent award report block reply\nExecutarian2 4 points 8 hours ago GOOD! The US should follow suit. permalink award report block reply Pats5x 6 points 8 hours ago LOL thats a good one.  The international banking cartel would never allow it permalink parent award report block reply\nPats5x 6 points 8 hours ago LOL thats a good one.  The international banking cartel would never allow it permalink parent award report block reply\ncornpop_1988 3 points 7 hours ago The whole Slavic nations of Europe need to form a pact and end this shit. permalink award report block reply Crappydatum 2 points 6 hours ago They should name it Union of Slavic States Reunited permalink parent award report block reply\nCrappydatum 2 points 6 hours ago They should name it Union of Slavic States Reunited permalink parent award report block reply\nPOTUS_DonnieJ 3 points 7 hours ago I don’t know if Hungary is paying the 1 million euro per day fine being levied on them by the EU, but if they are, they should stop that too. Fuck the EU, force them to show their hand. permalink award report block reply\nsorrytodisagree 3 points 8 hours ago Link: https://x.com/PM_ViktorOrban/status/1988597450710397171 permalink award report block reply\nMemebot 3 points 7 hours ago So happy to have Hungarian descent permalink award report block reply Aquamine-Amarine 3 points 7 hours ago Same. permalink parent award report block reply MAGALADON9 2 points 7 hours ago Ok show offs we get it, I'm proud of ya too. 😀 permalink parent award report block reply\nAquamine-Amarine 3 points 7 hours ago Same. permalink parent award report block reply MAGALADON9 2 points 7 hours ago Ok show offs we get it, I'm proud of ya too. 😀 permalink parent award report block reply\nMAGALADON9 2 points 7 hours ago Ok show offs we get it, I'm proud of ya too. 😀 permalink parent award report block reply\nSBOJ_JOBS 3 points 8 hours ago Ceterum censeso that I like Orban more and more each day. permalink award report block reply\nShaffro 2 points 4 hours ago I wish that was us. permalink award report block reply\nthisisatestof2 2 points 7 hours ago This is the way! permalink award report block reply\nRoadpower 1 points 2 hours ago Sane versus insane societies. This is what we need from OUR congress and Trump. If we don't get it then they are obviously not our congress and Trump really isn't here to help us as he should be pounding congress every single day to put up the goods. permalink award report block reply\ngreatpumpkin 1 points 6 hours ago When are they leaving the EU? Hexit now! permalink award report block reply Michalusmichalus 1 points 5 hours ago The EU has deemed every election trying to leave them a fraudulent election. permalink parent award report block reply\nMichalusmichalus 1 points 5 hours ago The EU has deemed every election trying to leave them a fraudulent election. permalink parent award report block reply\nalucard13mmfmj 1 points 32 minutes ago Then leave the EU.. doesnt matter if you dont let in rapefugees. Retards in france and germany will let them in, make them citizens and now those rapefugees can enter your country to rape and pillage. permalink award report block reply\nMoldyLocksNesMonste 1 points 7 hours ago How soon until we discover terrorist cells in Hungary that require US made freedom bombs? permalink award report block reply\nTongs_Ya_Bass 1 points 7 hours ago Leave the E.U. Referendum for Hungary. permalink award report block reply\nMeMargie 1 points 7 hours ago Insanity to destroy your own country. permalink award report block reply\nknnbccb 1 points 6 hours ago Brussels needs to be nuked. permalink award report block reply\nPatriotSkorzeny 1 points 7 hours ago We also ask you don’t send them. If you do, you’re a faggot. permalink award report block reply\nCrappydatum 1 points 6 hours ago Ah yes, brings me back to high school Latin reading Cato Ceterum censeo Carthaginem esse delendam permalink award report block reply\nMAGALADON9 1 points 7 hours ago WE STAND WITH YOU VICTOR!!!!\nTHERE YOU WILL STAND AGAINST THE HORDES! MAY YOUR GLORY LIVE FOREVER! HAA OOO! HAA OOO! HAA OOO! permalink award report block reply\nTrumpy_Bear 1 points 2 hours ago Well, they shouldn't have joined the EU in the first place permalink award report block reply\nRandyQuaidsBeard 1 points 6 hours ago The eu will make war on them? If not, fuck off. If so, double fuck off. permalink award report block reply\nSavingPrivateGrace 1 points 8 hours ago Comment removed by community filter. permalink award report block reply",
  "fetched_at": "2025-11-12T23:36:33.060095Z"
}