{
  "id": "1ARK5148Lg",
  "url": "https://patriots.win/p/1ARK5148Lg/nothing-to-see-here/c",
  "content": "596 Nothing to see here posted 6 days ago by Trick 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save Retardloserimsogay 11 points 6 days ago On a side note I remember when Hunter got on X, had something like 1 million followers in under 24 hours, Twitter elitist right there. permalink award report block reply Nick-Kerr 6 points 6 days ago 2 hours? How about -2 minutes before polls closed? https://media.scored.co/scale/yGT7HAOzV0ZuSy2L.jpeg Notice the red check box next to the YES, this was at 7:58pm The next one with the banner at the bottom is from 8:01 permalink award report block reply rebuildingMyself 3 points 6 days ago And any and all future elections in CA will take two hours since it's pre-rigged from the start permalink award report block reply IronWolve 2 points 6 days ago https://x.com/Hunter_Eagleman/status/1986116500718027175 permalink award report block reply Counterwhat 2 points 6 days ago It's like magic. It didn't take months to announce the winner. permalink award report block reply heightnoise 2 points 6 days ago It's okay y'all, I'm sure the DOJ will open up an investigation any day now and get to the bottom of this... permalink award report block reply 2025WhatIsTrue 1 points 6 days ago So much obvious corruption and criminality...so little time. permalink award report block reply\nRetardloserimsogay 11 points 6 days ago On a side note I remember when Hunter got on X, had something like 1 million followers in under 24 hours, Twitter elitist right there. permalink award report block reply\nNick-Kerr 6 points 6 days ago 2 hours? How about -2 minutes before polls closed? https://media.scored.co/scale/yGT7HAOzV0ZuSy2L.jpeg Notice the red check box next to the YES, this was at 7:58pm The next one with the banner at the bottom is from 8:01 permalink award report block reply\nrebuildingMyself 3 points 6 days ago And any and all future elections in CA will take two hours since it's pre-rigged from the start permalink award report block reply\nIronWolve 2 points 6 days ago https://x.com/Hunter_Eagleman/status/1986116500718027175 permalink award report block reply\nCounterwhat 2 points 6 days ago It's like magic. It didn't take months to announce the winner. permalink award report block reply\nheightnoise 2 points 6 days ago It's okay y'all, I'm sure the DOJ will open up an investigation any day now and get to the bottom of this... permalink award report block reply\n2025WhatIsTrue 1 points 6 days ago So much obvious corruption and criminality...so little time. permalink award report block reply",
  "fetched_at": "2025-11-12T20:51:34.521122Z"
}