{
  "id": "8185087",
  "title": "69Another woman stabbed at Chicago train station just months after Irina died in an eerily similar a",
  "url": "https://patriots.win/p/1ARK9nNi7T/another-woman-stabbed-at-chicago/c",
  "content": "69 Another woman stabbed at Chicago train station just months after Irina died in an eerily similar attack. The unidentified suspect approached a woman sitting on a bench at the UIC-Halstead CTA Blue Line stop in the city's Near West Side at 11.14pm on Saturday, took out a knife, and stabbed her chest. (www.dailymail.co.uk) POSSIBLY  WHITE posted 6 hours ago by BlackCrimesMatter 11 comments award share report block Chicago train station horror as woman stabbed in chest Chicago police are searching for a man they say stabbed a woman at a train station over the weekend, months after a Ukrainian refugee was killed in an eerily similar attack. www.dailymail.co.uk\n11 comments Sort by Top Top New Worst Old Save VoiceInTheLight 8 points 6 hours ago He's going to be known to the police, he is going to have a lengthy rap sheet, and he is going to have been let out of jail repeatedly because rasicm an shiiiit. permalink award report block reply Abovethefray 4 points 4 hours ago Yep. And will be released again this time.  It is a democrat world. permalink parent award report block reply DefenderDad 6 points 6 hours ago Oh look, its them again. permalink award report block reply reversethefraud 4 points 5 hours ago Well at least there was a camera to take pictures of her getting stabbed, so her family can have peace knowing who killed her. permalink award report block reply Whoopies_tds 4 points 6 hours ago I have a dream....something something content of character permalink award report block reply Krat 2 points 5 hours ago The results of 0 arrests permalink award report block reply Maganifice7 2 points 5 hours ago America needs vigilantes to go after and remove these people. They also need to go after and remove the people letting this scum back on the street. permalink award report block reply abstr4ct 1 points 5 hours ago let me guess, it was a swedish national? permalink award report block reply TrumpPatriot84 1 points 4 hours ago Getting what she voted for? permalink award report block reply Abovethefray 1 points 4 hours ago He is out kind of early.  The democrat pets usually get up and out around 3 in the afternoon. permalink award report block reply\nVoiceInTheLight 8 points 6 hours ago He's going to be known to the police, he is going to have a lengthy rap sheet, and he is going to have been let out of jail repeatedly because rasicm an shiiiit. permalink award report block reply Abovethefray 4 points 4 hours ago Yep. And will be released again this time.  It is a democrat world. permalink parent award report block reply\nAbovethefray 4 points 4 hours ago Yep. And will be released again this time.  It is a democrat world. permalink parent award report block reply\nDefenderDad 6 points 6 hours ago Oh look, its them again. permalink award report block reply\nreversethefraud 4 points 5 hours ago Well at least there was a camera to take pictures of her getting stabbed, so her family can have peace knowing who killed her. permalink award report block reply\nWhoopies_tds 4 points 6 hours ago I have a dream....something something content of character permalink award report block reply\nKrat 2 points 5 hours ago The results of 0 arrests permalink award report block reply\nMaganifice7 2 points 5 hours ago America needs vigilantes to go after and remove these people. They also need to go after and remove the people letting this scum back on the street. permalink award report block reply\nabstr4ct 1 points 5 hours ago let me guess, it was a swedish national? permalink award report block reply\nTrumpPatriot84 1 points 4 hours ago Getting what she voted for? permalink award report block reply\nAbovethefray 1 points 4 hours ago He is out kind of early.  The democrat pets usually get up and out around 3 in the afternoon. permalink award report block reply"
}