{
  "id": "1ARK5A7v4C",
  "url": "https://patriots.win/p/1ARK5A7v4C/has-anyone-ever-pointed-out-that/c",
  "content": "641 Has anyone ever pointed out that the J6 pipebomb  looks almost identical to the ones the FBI uses in training? posted 3 days ago by CyanScales 47 comments award share report block Mostly Peaceful Memes @MostlyPeacefull • 3d Jack Posobiec @JackPosobiec • 2y Has anyone ever pointed out that the J6 pipebomb  looks almost identical to the ones the FBI uses in training? Look at the end cap and timer Sent in to Human Events from a source\n47 comments Sort by Top Top New Worst Old Save Around the Web Natural Way to Regrow Hair on a Bald Head HaloGrow YakBak 29 points 3 days ago Dan Bongino pointed this out years ??? ago. permalink award report block reply TrancePhreak 18 points 3 days ago Was gonna say permalink parent award report block reply imnotdeadyet 5 points 3 days ago Yep, I heard Dan talk about that many times! permalink parent award report block reply LatitudeofMind 1 points 3 days ago And he’s in a position to do something about it permalink parent award report block reply Whoopies_tds 1 points 3 days ago This 👆 permalink parent award report block reply TheSwampThang 13 points 3 days ago If only he were in a position to do something. permalink parent award report block reply lolpaladins 6 points 3 days ago Meanwhile, Kash Patel on X: have you guys been distracted by enough sportsball? permalink parent award report block reply Threaper666 2 points 3 days ago It was an inside job.  The Fedsurrection! permalink parent award report block reply Moebius 13 points 3 days ago Cesar Sayoc's 'letter bombs' looked exactly like the one's in the USPS Warning Posters... permalink award report block reply BidenBuhtSecks 8 points 3 days ago How different does one egg timer look than another? I'm not a plumber, but doesn't pretty much all cast iron pipe and end caps look similar? If someone was going to look up how to make a pipe bomb and then went to a local hardware store, I imagine it would probably look about the same. permalink award report block reply Zskills 4 points 3 days ago They're both metal cylinders though!  You can't just explain that away with pipe topography permalink parent award report block reply WhatsFappening 2 points 3 days ago Compared to the PVC type with the purple glue on the ends?  🤣 permalink parent award report block reply SirPokeSmottington 1 points 3 days ago If someone was going to look up how to make a pipe bomb and then went to a local hardware store, I imagine it would probably look about the same. Yes, there are no other types of pipe, or ends, or timers. They all look the same, if you're going for cheapest, easiest, everywhere available. This is a fucking ridiculous post. This place is MORE RETARDED than most places on the internet now. Don't come here for facts. Only come here to get gaslit with bullshit and agitprop. permalink parent award report block reply I_Love_45-70_Gov 5 points 3 days ago Stranger yet: they all look like Kyle Reese's pipe bombs from the Terminator. 😱😱 permalink award report block reply Zskills 4 points 3 days ago Yes, they have pointed it out.  Many times. permalink award report block reply KilroyJCNJ 3 points 3 days ago has anyone ever pointed out that an assemblage of a length of pipe with caps on each end looks like any other assemblage of a length of pipe with caps on each end?? permalink award report block reply ForceMultiplier 2 points 3 days ago I don't understand what the pipe coupling in the middle is for. permalink parent award report block reply KilroyJCNJ 2 points 3 days ago For when you have two short pieces of pipe instead of one long one. permalink parent award report block reply ForceMultiplier 2 points 3 days ago just walk into Home Despot and buy 18 end caps 9 pre-threaded foot-long galvanized steel pipe lengths 9 pipe couplings 9 six inch pre-threaded steel pipe lengths some drill bits and a center punch a/k/a Things that make you go Hmmm... permalink parent award report block reply Husky 2 points 3 days ago I have no reason to know, but I would think an actual design would be for an opening for a centrally located charge. permalink parent award report block reply nautilus 2 points 3 days ago That is where the wires go into the bomb. It is reinforced since they are drilling a hole. It also may provide a base for the stupid mechanical timer... although in this case she just used the plastic timer dial, and not the actual mechanical timer. Probably so if another capitol police saw it they would know it was fake, while the public wouldn't. permalink parent award report block reply ForceMultiplier 1 points 3 days ago I would have just drilled a hole in the the end cap. I assumed they crammed the batteries in the top section or something, but they still could have done without two piping sections. I understand why they need to make it look like a bomb, even if the timing delay is incomplete. permalink parent award report block reply elstegosaur 1 points 3 days ago Plumbing practice? permalink parent award report block reply Choppermagic 2 points 3 days ago we all knew this.  Im surprised it doesn't have an FBI sticker onit permalink award report block reply schnazzmizzle 2 points 3 days ago Yeah. It's an obvious training device. permalink award report block reply Hanging_Chad 2 points 3 days ago yes but also, those cap fittings look different permalink award report block reply Psarg 2 points 3 days ago The bombing suspect trained capitol police officers.  She may have had access to these materials. permalink award report block reply HoganT 2 points 3 days ago All pipe bombs look the same, dumbass. It’s a pipe, with caps on the end. permalink award report block reply deleted 1 points 3 days ago ForceMultiplier 2 points 3 days ago The Boston marathon bombs were made with powder from crushed sparklers (fireworks) and put inside off-the-shelf pressure cookers My Elmer worked for a company that made a wide-band cellphone jammer with a discone antenna you would mount on a Stryker for use against cellphone detonators. The Casio F-91W used to have a 24 hour countdown timer mode, but they removed it from recently made watches.  If you want the count-down-time, you can spend a few more dollars, then open up the watch and add solder bridge to the circuit board. permalink parent award report block reply deleted 2 points 3 days ago ForceMultiplier 2 points 3 days ago a 555 would work, but I'd want to test it well, especially if I cobbled it together by myself from junk. You would want to know a 1 hour 555 timer wasn't triggered and has been slowly draining the capacitor for the last 50 minutes. Here, the kitchen timer can be the better choice. An esties rocket igniter works for low explosives. but I rolled my own rocket igniters (for model rocketry) out of thru-hole resistors back in the day. Too bad ping-pong are no longer made of nitrocelulose. You would need a detonator for high explosives (ammonium nitrate, etc) nitric acid is cheaper to buy, but seems easy to make. I've never done it, but heck the atmosphere is mostly nitrogen.. permalink parent award report block reply view 3 more comments... BlackLabsMatter 1 points 3 days ago Thank you! permalink parent award report block reply AccelerateAlready 2 points 3 days ago There are only so many timer dials lol.  Every timed IED in existence uses these as they are simple and effective as a \"mechanical\" switch. permalink award report block reply rumplestiltzkin2 1 points 3 days ago so when they get caught they can say it was an exercise permalink award report block reply Sunnybats2 1 points 3 days ago Yes several t8mes permalink award report block reply VelmaFoundAClue 5 points 3 days ago Why not several t9mes though? permalink parent award report block reply MasterChief -2 points 3 days ago 6-7 permalink parent award report block reply grenades_and_ham 1 points 3 days ago Surprised it doesn’t say “Inert” labeled on the side. permalink award report block reply BlackLabsMatter 1 points 3 days ago Any kitchen \"egg timer\" looks about like that, and are easily available at any store that sells kitchen stuff.  \"Black pipe\" is available at any plumbing, home improvement, and some furniture stores.  Wire is wire, and is available anywhere.  The stuff that goes inside is where the differences might, or might not, be. Also, that's where theitems thatare lessreadily available would be on this type (electrical initiation rather than chemical). It would be difficult to make something like this look meaningfully different.  Also, most of society has watched enough crime shows and police interviews to know that \"each device has a signature\".  Making it as plain and boring as possible would make it less identifiable, not more. This take is hot garbage. permalink award report block reply Gnometard 1 points 3 days ago Yep. But social media addiction prevents us from remembering anything. We forget that the dems wanted rid of the filibuster and we were against it. I've lost track of all the things we've forgotten and rediscover. But the boycotting of woke sports never went away.... but people keep forgetting and running back to them Social media is fentanyl in digital form. It kills your ability to remember, think, or control your impulses. Delayed gratification is now impossible, if you're logging into Facebook, reddit, tiktok, shorts, reels, IG at all. People will defend their use of it, claiming it's not a problem for them, just like the physical heroin addicts do with their addiction. permalink award report block reply SnowSnake 1 points 3 days ago If you're planning to make one of these, at least use a cannon fuse, or even a fancy model rocket motor igniter and a 9v battery. But the egg timer??? Poor craftsmanship. permalink award report block reply Spacemonkey 1 points 3 days ago Your not suppose to notice things. Stop noticing things! permalink award report block reply Rope_Tree_Journalist -1 points 3 days ago Having built trendy pipe furniture type stuff, I can tell you that there's like one kind of end cap for pipes and they all look the same. Same kitchen timer pretty weird though. Not that I know about pipe bombs, but wouldn't a fuse work better? They always have fuses in video games. permalink award report block reply AmarilloArmadillo 2 points 3 days ago Timer gives you a more (easy) accurately timed ignition. Homemade fuses can be unpredictable, and even fireworks fuses can be troublesome. Timer is just twist and wall away, fuse you have to light, maybe slower deployment permalink parent award report block reply Newhawk237 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nYakBak 29 points 3 days ago Dan Bongino pointed this out years ??? ago. permalink award report block reply TrancePhreak 18 points 3 days ago Was gonna say permalink parent award report block reply imnotdeadyet 5 points 3 days ago Yep, I heard Dan talk about that many times! permalink parent award report block reply LatitudeofMind 1 points 3 days ago And he’s in a position to do something about it permalink parent award report block reply Whoopies_tds 1 points 3 days ago This 👆 permalink parent award report block reply TheSwampThang 13 points 3 days ago If only he were in a position to do something. permalink parent award report block reply lolpaladins 6 points 3 days ago Meanwhile, Kash Patel on X: have you guys been distracted by enough sportsball? permalink parent award report block reply Threaper666 2 points 3 days ago It was an inside job.  The Fedsurrection! permalink parent award report block reply\nTrancePhreak 18 points 3 days ago Was gonna say permalink parent award report block reply imnotdeadyet 5 points 3 days ago Yep, I heard Dan talk about that many times! permalink parent award report block reply LatitudeofMind 1 points 3 days ago And he’s in a position to do something about it permalink parent award report block reply Whoopies_tds 1 points 3 days ago This 👆 permalink parent award report block reply\nimnotdeadyet 5 points 3 days ago Yep, I heard Dan talk about that many times! permalink parent award report block reply LatitudeofMind 1 points 3 days ago And he’s in a position to do something about it permalink parent award report block reply Whoopies_tds 1 points 3 days ago This 👆 permalink parent award report block reply\nLatitudeofMind 1 points 3 days ago And he’s in a position to do something about it permalink parent award report block reply\nWhoopies_tds 1 points 3 days ago This 👆 permalink parent award report block reply\nTheSwampThang 13 points 3 days ago If only he were in a position to do something. permalink parent award report block reply lolpaladins 6 points 3 days ago Meanwhile, Kash Patel on X: have you guys been distracted by enough sportsball? permalink parent award report block reply\nlolpaladins 6 points 3 days ago Meanwhile, Kash Patel on X: have you guys been distracted by enough sportsball? permalink parent award report block reply\nThreaper666 2 points 3 days ago It was an inside job.  The Fedsurrection! permalink parent award report block reply\nMoebius 13 points 3 days ago Cesar Sayoc's 'letter bombs' looked exactly like the one's in the USPS Warning Posters... permalink award report block reply\nBidenBuhtSecks 8 points 3 days ago How different does one egg timer look than another? I'm not a plumber, but doesn't pretty much all cast iron pipe and end caps look similar? If someone was going to look up how to make a pipe bomb and then went to a local hardware store, I imagine it would probably look about the same. permalink award report block reply Zskills 4 points 3 days ago They're both metal cylinders though!  You can't just explain that away with pipe topography permalink parent award report block reply WhatsFappening 2 points 3 days ago Compared to the PVC type with the purple glue on the ends?  🤣 permalink parent award report block reply SirPokeSmottington 1 points 3 days ago If someone was going to look up how to make a pipe bomb and then went to a local hardware store, I imagine it would probably look about the same. Yes, there are no other types of pipe, or ends, or timers. They all look the same, if you're going for cheapest, easiest, everywhere available. This is a fucking ridiculous post. This place is MORE RETARDED than most places on the internet now. Don't come here for facts. Only come here to get gaslit with bullshit and agitprop. permalink parent award report block reply\nZskills 4 points 3 days ago They're both metal cylinders though!  You can't just explain that away with pipe topography permalink parent award report block reply\nWhatsFappening 2 points 3 days ago Compared to the PVC type with the purple glue on the ends?  🤣 permalink parent award report block reply\nSirPokeSmottington 1 points 3 days ago If someone was going to look up how to make a pipe bomb and then went to a local hardware store, I imagine it would probably look about the same. Yes, there are no other types of pipe, or ends, or timers. They all look the same, if you're going for cheapest, easiest, everywhere available. This is a fucking ridiculous post. This place is MORE RETARDED than most places on the internet now. Don't come here for facts. Only come here to get gaslit with bullshit and agitprop. permalink parent award report block reply\nI_Love_45-70_Gov 5 points 3 days ago Stranger yet: they all look like Kyle Reese's pipe bombs from the Terminator. 😱😱 permalink award report block reply\nZskills 4 points 3 days ago Yes, they have pointed it out.  Many times. permalink award report block reply\nKilroyJCNJ 3 points 3 days ago has anyone ever pointed out that an assemblage of a length of pipe with caps on each end looks like any other assemblage of a length of pipe with caps on each end?? permalink award report block reply ForceMultiplier 2 points 3 days ago I don't understand what the pipe coupling in the middle is for. permalink parent award report block reply KilroyJCNJ 2 points 3 days ago For when you have two short pieces of pipe instead of one long one. permalink parent award report block reply ForceMultiplier 2 points 3 days ago just walk into Home Despot and buy 18 end caps 9 pre-threaded foot-long galvanized steel pipe lengths 9 pipe couplings 9 six inch pre-threaded steel pipe lengths some drill bits and a center punch a/k/a Things that make you go Hmmm... permalink parent award report block reply Husky 2 points 3 days ago I have no reason to know, but I would think an actual design would be for an opening for a centrally located charge. permalink parent award report block reply nautilus 2 points 3 days ago That is where the wires go into the bomb. It is reinforced since they are drilling a hole. It also may provide a base for the stupid mechanical timer... although in this case she just used the plastic timer dial, and not the actual mechanical timer. Probably so if another capitol police saw it they would know it was fake, while the public wouldn't. permalink parent award report block reply ForceMultiplier 1 points 3 days ago I would have just drilled a hole in the the end cap. I assumed they crammed the batteries in the top section or something, but they still could have done without two piping sections. I understand why they need to make it look like a bomb, even if the timing delay is incomplete. permalink parent award report block reply elstegosaur 1 points 3 days ago Plumbing practice? permalink parent award report block reply\nForceMultiplier 2 points 3 days ago I don't understand what the pipe coupling in the middle is for. permalink parent award report block reply KilroyJCNJ 2 points 3 days ago For when you have two short pieces of pipe instead of one long one. permalink parent award report block reply ForceMultiplier 2 points 3 days ago just walk into Home Despot and buy 18 end caps 9 pre-threaded foot-long galvanized steel pipe lengths 9 pipe couplings 9 six inch pre-threaded steel pipe lengths some drill bits and a center punch a/k/a Things that make you go Hmmm... permalink parent award report block reply Husky 2 points 3 days ago I have no reason to know, but I would think an actual design would be for an opening for a centrally located charge. permalink parent award report block reply nautilus 2 points 3 days ago That is where the wires go into the bomb. It is reinforced since they are drilling a hole. It also may provide a base for the stupid mechanical timer... although in this case she just used the plastic timer dial, and not the actual mechanical timer. Probably so if another capitol police saw it they would know it was fake, while the public wouldn't. permalink parent award report block reply ForceMultiplier 1 points 3 days ago I would have just drilled a hole in the the end cap. I assumed they crammed the batteries in the top section or something, but they still could have done without two piping sections. I understand why they need to make it look like a bomb, even if the timing delay is incomplete. permalink parent award report block reply elstegosaur 1 points 3 days ago Plumbing practice? permalink parent award report block reply\nKilroyJCNJ 2 points 3 days ago For when you have two short pieces of pipe instead of one long one. permalink parent award report block reply ForceMultiplier 2 points 3 days ago just walk into Home Despot and buy 18 end caps 9 pre-threaded foot-long galvanized steel pipe lengths 9 pipe couplings 9 six inch pre-threaded steel pipe lengths some drill bits and a center punch a/k/a Things that make you go Hmmm... permalink parent award report block reply\nForceMultiplier 2 points 3 days ago just walk into Home Despot and buy 18 end caps 9 pre-threaded foot-long galvanized steel pipe lengths 9 pipe couplings 9 six inch pre-threaded steel pipe lengths some drill bits and a center punch a/k/a Things that make you go Hmmm... permalink parent award report block reply\nHusky 2 points 3 days ago I have no reason to know, but I would think an actual design would be for an opening for a centrally located charge. permalink parent award report block reply\nnautilus 2 points 3 days ago That is where the wires go into the bomb. It is reinforced since they are drilling a hole. It also may provide a base for the stupid mechanical timer... although in this case she just used the plastic timer dial, and not the actual mechanical timer. Probably so if another capitol police saw it they would know it was fake, while the public wouldn't. permalink parent award report block reply ForceMultiplier 1 points 3 days ago I would have just drilled a hole in the the end cap. I assumed they crammed the batteries in the top section or something, but they still could have done without two piping sections. I understand why they need to make it look like a bomb, even if the timing delay is incomplete. permalink parent award report block reply\nForceMultiplier 1 points 3 days ago I would have just drilled a hole in the the end cap. I assumed they crammed the batteries in the top section or something, but they still could have done without two piping sections. I understand why they need to make it look like a bomb, even if the timing delay is incomplete. permalink parent award report block reply\nelstegosaur 1 points 3 days ago Plumbing practice? permalink parent award report block reply\nChoppermagic 2 points 3 days ago we all knew this.  Im surprised it doesn't have an FBI sticker onit permalink award report block reply\nschnazzmizzle 2 points 3 days ago Yeah. It's an obvious training device. permalink award report block reply\nHanging_Chad 2 points 3 days ago yes but also, those cap fittings look different permalink award report block reply\nPsarg 2 points 3 days ago The bombing suspect trained capitol police officers.  She may have had access to these materials. permalink award report block reply\nHoganT 2 points 3 days ago All pipe bombs look the same, dumbass. It’s a pipe, with caps on the end. permalink award report block reply deleted 1 points 3 days ago ForceMultiplier 2 points 3 days ago The Boston marathon bombs were made with powder from crushed sparklers (fireworks) and put inside off-the-shelf pressure cookers My Elmer worked for a company that made a wide-band cellphone jammer with a discone antenna you would mount on a Stryker for use against cellphone detonators. The Casio F-91W used to have a 24 hour countdown timer mode, but they removed it from recently made watches.  If you want the count-down-time, you can spend a few more dollars, then open up the watch and add solder bridge to the circuit board. permalink parent award report block reply deleted 2 points 3 days ago ForceMultiplier 2 points 3 days ago a 555 would work, but I'd want to test it well, especially if I cobbled it together by myself from junk. You would want to know a 1 hour 555 timer wasn't triggered and has been slowly draining the capacitor for the last 50 minutes. Here, the kitchen timer can be the better choice. An esties rocket igniter works for low explosives. but I rolled my own rocket igniters (for model rocketry) out of thru-hole resistors back in the day. Too bad ping-pong are no longer made of nitrocelulose. You would need a detonator for high explosives (ammonium nitrate, etc) nitric acid is cheaper to buy, but seems easy to make. I've never done it, but heck the atmosphere is mostly nitrogen.. permalink parent award report block reply view 3 more comments... BlackLabsMatter 1 points 3 days ago Thank you! permalink parent award report block reply\ndeleted 1 points 3 days ago ForceMultiplier 2 points 3 days ago The Boston marathon bombs were made with powder from crushed sparklers (fireworks) and put inside off-the-shelf pressure cookers My Elmer worked for a company that made a wide-band cellphone jammer with a discone antenna you would mount on a Stryker for use against cellphone detonators. The Casio F-91W used to have a 24 hour countdown timer mode, but they removed it from recently made watches.  If you want the count-down-time, you can spend a few more dollars, then open up the watch and add solder bridge to the circuit board. permalink parent award report block reply deleted 2 points 3 days ago ForceMultiplier 2 points 3 days ago a 555 would work, but I'd want to test it well, especially if I cobbled it together by myself from junk. You would want to know a 1 hour 555 timer wasn't triggered and has been slowly draining the capacitor for the last 50 minutes. Here, the kitchen timer can be the better choice. An esties rocket igniter works for low explosives. but I rolled my own rocket igniters (for model rocketry) out of thru-hole resistors back in the day. Too bad ping-pong are no longer made of nitrocelulose. You would need a detonator for high explosives (ammonium nitrate, etc) nitric acid is cheaper to buy, but seems easy to make. I've never done it, but heck the atmosphere is mostly nitrogen.. permalink parent award report block reply view 3 more comments...\nForceMultiplier 2 points 3 days ago The Boston marathon bombs were made with powder from crushed sparklers (fireworks) and put inside off-the-shelf pressure cookers My Elmer worked for a company that made a wide-band cellphone jammer with a discone antenna you would mount on a Stryker for use against cellphone detonators. The Casio F-91W used to have a 24 hour countdown timer mode, but they removed it from recently made watches.  If you want the count-down-time, you can spend a few more dollars, then open up the watch and add solder bridge to the circuit board. permalink parent award report block reply deleted 2 points 3 days ago ForceMultiplier 2 points 3 days ago a 555 would work, but I'd want to test it well, especially if I cobbled it together by myself from junk. You would want to know a 1 hour 555 timer wasn't triggered and has been slowly draining the capacitor for the last 50 minutes. Here, the kitchen timer can be the better choice. An esties rocket igniter works for low explosives. but I rolled my own rocket igniters (for model rocketry) out of thru-hole resistors back in the day. Too bad ping-pong are no longer made of nitrocelulose. You would need a detonator for high explosives (ammonium nitrate, etc) nitric acid is cheaper to buy, but seems easy to make. I've never done it, but heck the atmosphere is mostly nitrogen.. permalink parent award report block reply view 3 more comments...\ndeleted 2 points 3 days ago ForceMultiplier 2 points 3 days ago a 555 would work, but I'd want to test it well, especially if I cobbled it together by myself from junk. You would want to know a 1 hour 555 timer wasn't triggered and has been slowly draining the capacitor for the last 50 minutes. Here, the kitchen timer can be the better choice. An esties rocket igniter works for low explosives. but I rolled my own rocket igniters (for model rocketry) out of thru-hole resistors back in the day. Too bad ping-pong are no longer made of nitrocelulose. You would need a detonator for high explosives (ammonium nitrate, etc) nitric acid is cheaper to buy, but seems easy to make. I've never done it, but heck the atmosphere is mostly nitrogen.. permalink parent award report block reply view 3 more comments...\nForceMultiplier 2 points 3 days ago a 555 would work, but I'd want to test it well, especially if I cobbled it together by myself from junk. You would want to know a 1 hour 555 timer wasn't triggered and has been slowly draining the capacitor for the last 50 minutes. Here, the kitchen timer can be the better choice. An esties rocket igniter works for low explosives. but I rolled my own rocket igniters (for model rocketry) out of thru-hole resistors back in the day. Too bad ping-pong are no longer made of nitrocelulose. You would need a detonator for high explosives (ammonium nitrate, etc) nitric acid is cheaper to buy, but seems easy to make. I've never done it, but heck the atmosphere is mostly nitrogen.. permalink parent award report block reply view 3 more comments...\nBlackLabsMatter 1 points 3 days ago Thank you! permalink parent award report block reply\nAccelerateAlready 2 points 3 days ago There are only so many timer dials lol.  Every timed IED in existence uses these as they are simple and effective as a \"mechanical\" switch. permalink award report block reply\nrumplestiltzkin2 1 points 3 days ago so when they get caught they can say it was an exercise permalink award report block reply\nSunnybats2 1 points 3 days ago Yes several t8mes permalink award report block reply VelmaFoundAClue 5 points 3 days ago Why not several t9mes though? permalink parent award report block reply MasterChief -2 points 3 days ago 6-7 permalink parent award report block reply\nVelmaFoundAClue 5 points 3 days ago Why not several t9mes though? permalink parent award report block reply MasterChief -2 points 3 days ago 6-7 permalink parent award report block reply\nMasterChief -2 points 3 days ago 6-7 permalink parent award report block reply\ngrenades_and_ham 1 points 3 days ago Surprised it doesn’t say “Inert” labeled on the side. permalink award report block reply\nBlackLabsMatter 1 points 3 days ago Any kitchen \"egg timer\" looks about like that, and are easily available at any store that sells kitchen stuff.  \"Black pipe\" is available at any plumbing, home improvement, and some furniture stores.  Wire is wire, and is available anywhere.  The stuff that goes inside is where the differences might, or might not, be. Also, that's where theitems thatare lessreadily available would be on this type (electrical initiation rather than chemical). It would be difficult to make something like this look meaningfully different.  Also, most of society has watched enough crime shows and police interviews to know that \"each device has a signature\".  Making it as plain and boring as possible would make it less identifiable, not more. This take is hot garbage. permalink award report block reply\nGnometard 1 points 3 days ago Yep. But social media addiction prevents us from remembering anything. We forget that the dems wanted rid of the filibuster and we were against it. I've lost track of all the things we've forgotten and rediscover. But the boycotting of woke sports never went away.... but people keep forgetting and running back to them Social media is fentanyl in digital form. It kills your ability to remember, think, or control your impulses. Delayed gratification is now impossible, if you're logging into Facebook, reddit, tiktok, shorts, reels, IG at all. People will defend their use of it, claiming it's not a problem for them, just like the physical heroin addicts do with their addiction. permalink award report block reply\nSnowSnake 1 points 3 days ago If you're planning to make one of these, at least use a cannon fuse, or even a fancy model rocket motor igniter and a 9v battery. But the egg timer??? Poor craftsmanship. permalink award report block reply\nSpacemonkey 1 points 3 days ago Your not suppose to notice things. Stop noticing things! permalink award report block reply\nRope_Tree_Journalist -1 points 3 days ago Having built trendy pipe furniture type stuff, I can tell you that there's like one kind of end cap for pipes and they all look the same. Same kitchen timer pretty weird though. Not that I know about pipe bombs, but wouldn't a fuse work better? They always have fuses in video games. permalink award report block reply AmarilloArmadillo 2 points 3 days ago Timer gives you a more (easy) accurately timed ignition. Homemade fuses can be unpredictable, and even fireworks fuses can be troublesome. Timer is just twist and wall away, fuse you have to light, maybe slower deployment permalink parent award report block reply Newhawk237 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nAmarilloArmadillo 2 points 3 days ago Timer gives you a more (easy) accurately timed ignition. Homemade fuses can be unpredictable, and even fireworks fuses can be troublesome. Timer is just twist and wall away, fuse you have to light, maybe slower deployment permalink parent award report block reply\nNewhawk237 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:00:24.078861Z"
}