{
  "id": "1ARK591RtG",
  "url": "https://patriots.win/p/1ARK591RtG/1-easy-nobrainer-thing-the-fbi-c/c",
  "content": "893 #1 easy no-brainer thing the FBI could do right now to help the J6 pipe bomb investigation: publish the 39,000 video files the FBI told ABC News it had collected on the case. posted 4 days ago by Capoditutticapi1 22 comments award share report block Mike Benz @MikeBenzCyber • 4d #1 easy no-brainer thing the FBI could do right now to help the J6 pipe bomb investigation: publish the 39,000 video files the FBI told ABC News it had collected on the case.\n22 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Apersonofinterest 17 points 4 days ago Ha! He said Kamala Harris was squatting over the pipe bomb over at the DNC. permalink award report block reply Patriot5TN 15 points 4 days ago There is no way a pipe bomb could consent to THAT. permalink parent award report block reply Spunas1 3 points 4 days ago Never thought I'd ever feel sorry for a pipebomb! permalink parent award report block reply UH69MAGA 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Kingoftheroad 4 points 4 days ago Who has been more of a disappointment then Kash 7-11 Patel and Dan do-nothing Bongino? Everyone rags on Blondi for good reason but them participating in the coverups is more deflating because if the big game they talked beforehand. Now the 7-11 guy is saying we should accept him being s complete hypocrite with the private jet and saging its not our right to transparency from the government and fuck us, again. permalink parent award report block reply TheTelltaleFly 6 points 3 days ago Remember when Bongino had a podcast and he used to always say “justice be done may the heavens fall” ? Good times. I just advise everyone to prepare yourselves for prison and enslavement. Since the fbi remains the corrupt secret police of the admin in power, it’s going to get a whole lot worse when Dems take over permalink parent award report block reply duckduck 8 points 4 days ago It was recently implied that the couple of cops that committed suicide in the days following the event did so because they were ashamed of going along with framing innocent Americans at the capital. Just wait for those cops to mysteriously disappear from any leftist mention of the fake riot, when before they wouldn't stop bringing it up, as if a cop committing suicide was a murder that could be tied to the protest to make it seem scarier. permalink award report block reply Cacciali_Via 5 points 3 days ago Recently implied? You mean everyone said it 5 years ago. permalink parent award report block reply thevagabond 7 points 4 days ago 2 more weeks? idk it's all so tiresome. permalink award report block reply keeman 4 points 4 days ago This would assume the purpose is to find the perpetrator.  I would claim they already know who the perp is. permalink award report block reply Spunas1 2 points 3 days ago and if/when the perp is about to be named, they will mysteriously have an accident! Hillarized. Whoever they are, needs to disappear post-haste! Pitch a tent on Tuckers ranch! permalink parent award report block reply JoinTheDiscussion 2 points 4 days ago They've known who it was.. A dem operative permalink parent award report block reply Spunas1 2 points 4 days ago Being deleted as we speak! (inner-malcontentious conspiracy theorist voice) permalink award report block reply Goatboy66 2 points 3 days ago Every body Knows it was the FBI and pelosi permalink award report block reply Washington_Redskins 2 points 4 days ago Trump should just allow them to be published and I'm sure Elon Musk will make sure they are hosted where everyone can see them permalink award report block reply Sunnybats2 2 points 3 days ago No #1 is ARREST THE CUNT IMMEDIATELY permalink award report block reply billybaldwin2 1 points 4 days ago They released that slick video package 2 weeks ago. I hear law enforcement always wants to keep some data out of the public so they can confirm anything that the real criminals will give them. It helps prevent people from falsely claiming they did a crime. permalink award report block reply lul_cheto 1 points 3 days ago Patel is complicit permalink award report block reply Logbas34 0 points 4 days ago Another disappointing example. Mike Benz gives such detailed info for all these nefarious propoganda ops, and thus his work is so valuable. At the same time, he does not talk about one particular intelligence service. When asked about it on Scott Horton’s show, he majorly deflects. Unfortunately, Benz is taking the 7K. permalink award report block reply guywholikesDjtof2024 1 points 4 days ago What created the world? permalink parent award report block reply ERIC_CIARAMELLA -1 points 4 days ago There was never a fucking pipebomb. permalink award report block reply NewGoldenAge 0 points 4 days ago Comment removed by community moderators. permalink award report block reply\nApersonofinterest 17 points 4 days ago Ha! He said Kamala Harris was squatting over the pipe bomb over at the DNC. permalink award report block reply Patriot5TN 15 points 4 days ago There is no way a pipe bomb could consent to THAT. permalink parent award report block reply Spunas1 3 points 4 days ago Never thought I'd ever feel sorry for a pipebomb! permalink parent award report block reply UH69MAGA 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Kingoftheroad 4 points 4 days ago Who has been more of a disappointment then Kash 7-11 Patel and Dan do-nothing Bongino? Everyone rags on Blondi for good reason but them participating in the coverups is more deflating because if the big game they talked beforehand. Now the 7-11 guy is saying we should accept him being s complete hypocrite with the private jet and saging its not our right to transparency from the government and fuck us, again. permalink parent award report block reply TheTelltaleFly 6 points 3 days ago Remember when Bongino had a podcast and he used to always say “justice be done may the heavens fall” ? Good times. I just advise everyone to prepare yourselves for prison and enslavement. Since the fbi remains the corrupt secret police of the admin in power, it’s going to get a whole lot worse when Dems take over permalink parent award report block reply\nPatriot5TN 15 points 4 days ago There is no way a pipe bomb could consent to THAT. permalink parent award report block reply Spunas1 3 points 4 days ago Never thought I'd ever feel sorry for a pipebomb! permalink parent award report block reply UH69MAGA 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nSpunas1 3 points 4 days ago Never thought I'd ever feel sorry for a pipebomb! permalink parent award report block reply\nUH69MAGA 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nKingoftheroad 4 points 4 days ago Who has been more of a disappointment then Kash 7-11 Patel and Dan do-nothing Bongino? Everyone rags on Blondi for good reason but them participating in the coverups is more deflating because if the big game they talked beforehand. Now the 7-11 guy is saying we should accept him being s complete hypocrite with the private jet and saging its not our right to transparency from the government and fuck us, again. permalink parent award report block reply TheTelltaleFly 6 points 3 days ago Remember when Bongino had a podcast and he used to always say “justice be done may the heavens fall” ? Good times. I just advise everyone to prepare yourselves for prison and enslavement. Since the fbi remains the corrupt secret police of the admin in power, it’s going to get a whole lot worse when Dems take over permalink parent award report block reply\nTheTelltaleFly 6 points 3 days ago Remember when Bongino had a podcast and he used to always say “justice be done may the heavens fall” ? Good times. I just advise everyone to prepare yourselves for prison and enslavement. Since the fbi remains the corrupt secret police of the admin in power, it’s going to get a whole lot worse when Dems take over permalink parent award report block reply\nduckduck 8 points 4 days ago It was recently implied that the couple of cops that committed suicide in the days following the event did so because they were ashamed of going along with framing innocent Americans at the capital. Just wait for those cops to mysteriously disappear from any leftist mention of the fake riot, when before they wouldn't stop bringing it up, as if a cop committing suicide was a murder that could be tied to the protest to make it seem scarier. permalink award report block reply Cacciali_Via 5 points 3 days ago Recently implied? You mean everyone said it 5 years ago. permalink parent award report block reply\nCacciali_Via 5 points 3 days ago Recently implied? You mean everyone said it 5 years ago. permalink parent award report block reply\nthevagabond 7 points 4 days ago 2 more weeks? idk it's all so tiresome. permalink award report block reply\nkeeman 4 points 4 days ago This would assume the purpose is to find the perpetrator.  I would claim they already know who the perp is. permalink award report block reply Spunas1 2 points 3 days ago and if/when the perp is about to be named, they will mysteriously have an accident! Hillarized. Whoever they are, needs to disappear post-haste! Pitch a tent on Tuckers ranch! permalink parent award report block reply JoinTheDiscussion 2 points 4 days ago They've known who it was.. A dem operative permalink parent award report block reply\nSpunas1 2 points 3 days ago and if/when the perp is about to be named, they will mysteriously have an accident! Hillarized. Whoever they are, needs to disappear post-haste! Pitch a tent on Tuckers ranch! permalink parent award report block reply\nJoinTheDiscussion 2 points 4 days ago They've known who it was.. A dem operative permalink parent award report block reply\nSpunas1 2 points 4 days ago Being deleted as we speak! (inner-malcontentious conspiracy theorist voice) permalink award report block reply\nGoatboy66 2 points 3 days ago Every body Knows it was the FBI and pelosi permalink award report block reply\nWashington_Redskins 2 points 4 days ago Trump should just allow them to be published and I'm sure Elon Musk will make sure they are hosted where everyone can see them permalink award report block reply\nSunnybats2 2 points 3 days ago No #1 is ARREST THE CUNT IMMEDIATELY permalink award report block reply\nbillybaldwin2 1 points 4 days ago They released that slick video package 2 weeks ago. I hear law enforcement always wants to keep some data out of the public so they can confirm anything that the real criminals will give them. It helps prevent people from falsely claiming they did a crime. permalink award report block reply\nlul_cheto 1 points 3 days ago Patel is complicit permalink award report block reply\nLogbas34 0 points 4 days ago Another disappointing example. Mike Benz gives such detailed info for all these nefarious propoganda ops, and thus his work is so valuable. At the same time, he does not talk about one particular intelligence service. When asked about it on Scott Horton’s show, he majorly deflects. Unfortunately, Benz is taking the 7K. permalink award report block reply guywholikesDjtof2024 1 points 4 days ago What created the world? permalink parent award report block reply\nguywholikesDjtof2024 1 points 4 days ago What created the world? permalink parent award report block reply\nERIC_CIARAMELLA -1 points 4 days ago There was never a fucking pipebomb. permalink award report block reply\nNewGoldenAge 0 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:46.034544Z"
}