{
  "id": "1ARK53JGpb",
  "url": "https://patriots.win/p/1ARK53JGpb/she-has-nerve-no-doubt-/c",
  "content": "861 SHE HAS NERVE.. NO DOUBT.. posted 6 days ago by blvntbr 47 comments award share download report block\n47 comments Sort by Top Top New Worst Old Save Goozmania 18 points 6 days ago There was a meme in 2021 about Nicki Minaj here that almost made me piss myself. I wish I could find it. People were happy about her anti-fauccine position. The meme was stick figures, but one had Nicki Minaj's face. She was welcomed as an unlikely MAGA supporter, and the MAGA hat wearing stick figure tepidly said \"So... ____ ballots were found in the trash\" or something like that. Like bringing her into our entire fold lol. permalink award report block reply Crappydatum 16 points 6 days ago She supposedly left the music business November 1. About the time she sent out that tweet.. This might all be a big FU to the music industry and her handlers permalink award report block reply glevert 15 points 6 days ago I'm disappointed in people in this forum who disregard the bravery it takes for someone to take an stand unpopular with their peers. If you keep rebuffing those who speak for Trump, who is going to be left to support him? A handful of purists? No one will ever be pure enough for some of you, and that's a sure way to lose the political war. If this is a forum to support Trump, then stop trashing those who do. permalink award report block reply Cacciali_Via 6 points 5 days ago To claim she is a Trump supporter is a giant reach. I approve of Ilhan Omar stance on aid to Israel. That does not make me an Omar supporter by a long shot. permalink parent award report block reply Nephrum 3 points 5 days ago The quality of person involved is a problem for me. This piece of shit is not someone I want on my side. permalink parent award report block reply Michalusmichalus 9 points 6 days ago She fought the people that were pro faccine too. permalink award report block reply womp-womp-twice 3 points 6 days ago *fagcine permalink parent award report block reply Lelleck 5 points 5 days ago fake-cine permalink parent award report block reply DudeNoOne 8 points 6 days ago This was not on my bingo card. permalink award report block reply Cacciali_Via -4 points 5 days ago Go back to reddit. permalink parent award report block reply DudeNoOne 2 points 5 days ago Faggot permalink parent award report block reply Natives4Trump 6 points 6 days ago Wow Nicki Minaj had one good take. Can we not? Lmao. Omg, Nicki thank you so much, you're my hero!! Pathetic. permalink award report block reply Mortal_Wombat 1 points 5 days ago Didn't she used to drug and rob tricks she was turning as a prostitute? I believe that people can change and embrace them making a better life...but praise is a little overboard. permalink parent award report block reply Bigperm 8 points 5 days ago No,, that was Cardi B,, not Niki permalink parent award report block reply Millie1234 0 points 5 days ago If she's smartened up then praise is due. permalink parent award report block reply DingleberryMutt 3 points 6 days ago Just found out that she is an illegal alien brought here when she was like five years old by her illegal alien mother permalink award report block reply FromGodNotMonkey 1 points 5 days ago She can afford the gold card and stay permalink parent award report block reply brewser724 3 points 6 days ago Respect, Nicki. permalink award report block reply Unboosted 1 points 5 days ago Thats mean about 25k more people are democrats that follow her cuz 69% of democrats are biggoted and think that any opposing view is malicious. 69%!!!  -Cata institute study permalink award report block reply barwhack 1 points 6 days ago She's not bleft anymore? permalink award report block reply Ch3f4554551n 1 points 5 days ago Retarded, Evil Whore says thing. permalink award report block reply Brock_Shithouse 1 points 6 days ago I've never seen her without her clown makeup before. She looks a lot younger. permalink award report block reply bidensmissingbrain 1 points 6 days ago Still a hoe... permalink award report block reply TequilaWizard 1 points 5 days ago Followers are just AI bot accounts anyway. permalink award report block reply PatrioticPhantasma 0 points 6 days ago They were mostly bots.  Who cares. permalink award report block reply Gunmolester 0 points 6 days ago oh noooo...Ive been down this road before...I will thank her and then she will apologize permalink award report block reply Easzq8 0 points 6 days ago You don’t want the admiration of communists. permalink award report block reply LaptopDied -1 points 6 days ago Get her into politics. permalink award report block reply reversethefraud 2 points 6 days ago So she can tell us about her wet ass pussy? permalink parent award report block reply LaptopDied 2 points 6 days ago Oh that was her thing? Didn't know. Ok no. permalink parent award report block reply zooty 12 points 6 days ago It was not. That was Cardi B. Not that I'm a fan of Minaj's music. The one song I kinda like with her in it, she brings the whole thing down (IMO) - https://www.youtube.com/watch?v=0HDdjwpPM3Y permalink parent award report block reply AndanteAndante -4 points 6 days ago You sho know your blackies! Question: who’s the one with a small blond Afro that spoke at the GOP convention ? permalink parent award report block reply view 2 more comments... Crappydatum 2 points 6 days ago Can't tell them apart? permalink parent award report block reply Sythen -4 points 6 days ago Isn't she the one who admitted to drugging and robbing men she'd meet at bars? permalink award report block reply Spiritof2015 31 points 6 days ago I think that's Cardi B. permalink parent award report block reply Sythen 8 points 6 days ago Ah yea, they all kind of blend together for me. permalink parent award report block reply AndanteAndante -1 points 6 days ago You sho know your blackies! permalink parent award report block reply Spiritof2015 7 points 6 days ago You sure sound retarded. permalink parent award report block reply Smurfection 17 points 6 days ago NO, that's Cardi B. Nicki Minaj is a pure blood too.  She rejected the jab and she told a couple of stories about how the jab caused \"vaccine\" injuries. permalink parent award report block reply FBIsurveillance 3 points 6 days ago no just the one with the gargantuan buns hun permalink parent award report block reply BunnyPicnic -1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply Covidrrhea -4 points 6 days ago Thanks but go away, Nicki.  She's a psycho. permalink award report block reply AlmostFullyDilated 1 points 6 days ago Comment removed by community filter. permalink award report block reply Pongpagongbatibot 1 points 5 days ago Comment removed by community filter. permalink award report block reply\nGoozmania 18 points 6 days ago There was a meme in 2021 about Nicki Minaj here that almost made me piss myself. I wish I could find it. People were happy about her anti-fauccine position. The meme was stick figures, but one had Nicki Minaj's face. She was welcomed as an unlikely MAGA supporter, and the MAGA hat wearing stick figure tepidly said \"So... ____ ballots were found in the trash\" or something like that. Like bringing her into our entire fold lol. permalink award report block reply\nCrappydatum 16 points 6 days ago She supposedly left the music business November 1. About the time she sent out that tweet.. This might all be a big FU to the music industry and her handlers permalink award report block reply\nglevert 15 points 6 days ago I'm disappointed in people in this forum who disregard the bravery it takes for someone to take an stand unpopular with their peers. If you keep rebuffing those who speak for Trump, who is going to be left to support him? A handful of purists? No one will ever be pure enough for some of you, and that's a sure way to lose the political war. If this is a forum to support Trump, then stop trashing those who do. permalink award report block reply Cacciali_Via 6 points 5 days ago To claim she is a Trump supporter is a giant reach. I approve of Ilhan Omar stance on aid to Israel. That does not make me an Omar supporter by a long shot. permalink parent award report block reply Nephrum 3 points 5 days ago The quality of person involved is a problem for me. This piece of shit is not someone I want on my side. permalink parent award report block reply\nCacciali_Via 6 points 5 days ago To claim she is a Trump supporter is a giant reach. I approve of Ilhan Omar stance on aid to Israel. That does not make me an Omar supporter by a long shot. permalink parent award report block reply\nNephrum 3 points 5 days ago The quality of person involved is a problem for me. This piece of shit is not someone I want on my side. permalink parent award report block reply\nMichalusmichalus 9 points 6 days ago She fought the people that were pro faccine too. permalink award report block reply womp-womp-twice 3 points 6 days ago *fagcine permalink parent award report block reply Lelleck 5 points 5 days ago fake-cine permalink parent award report block reply\nwomp-womp-twice 3 points 6 days ago *fagcine permalink parent award report block reply Lelleck 5 points 5 days ago fake-cine permalink parent award report block reply\nLelleck 5 points 5 days ago fake-cine permalink parent award report block reply\nDudeNoOne 8 points 6 days ago This was not on my bingo card. permalink award report block reply Cacciali_Via -4 points 5 days ago Go back to reddit. permalink parent award report block reply DudeNoOne 2 points 5 days ago Faggot permalink parent award report block reply\nCacciali_Via -4 points 5 days ago Go back to reddit. permalink parent award report block reply DudeNoOne 2 points 5 days ago Faggot permalink parent award report block reply\nDudeNoOne 2 points 5 days ago Faggot permalink parent award report block reply\nNatives4Trump 6 points 6 days ago Wow Nicki Minaj had one good take. Can we not? Lmao. Omg, Nicki thank you so much, you're my hero!! Pathetic. permalink award report block reply Mortal_Wombat 1 points 5 days ago Didn't she used to drug and rob tricks she was turning as a prostitute? I believe that people can change and embrace them making a better life...but praise is a little overboard. permalink parent award report block reply Bigperm 8 points 5 days ago No,, that was Cardi B,, not Niki permalink parent award report block reply Millie1234 0 points 5 days ago If she's smartened up then praise is due. permalink parent award report block reply\nMortal_Wombat 1 points 5 days ago Didn't she used to drug and rob tricks she was turning as a prostitute? I believe that people can change and embrace them making a better life...but praise is a little overboard. permalink parent award report block reply Bigperm 8 points 5 days ago No,, that was Cardi B,, not Niki permalink parent award report block reply Millie1234 0 points 5 days ago If she's smartened up then praise is due. permalink parent award report block reply\nBigperm 8 points 5 days ago No,, that was Cardi B,, not Niki permalink parent award report block reply\nMillie1234 0 points 5 days ago If she's smartened up then praise is due. permalink parent award report block reply\nDingleberryMutt 3 points 6 days ago Just found out that she is an illegal alien brought here when she was like five years old by her illegal alien mother permalink award report block reply FromGodNotMonkey 1 points 5 days ago She can afford the gold card and stay permalink parent award report block reply\nFromGodNotMonkey 1 points 5 days ago She can afford the gold card and stay permalink parent award report block reply\nbrewser724 3 points 6 days ago Respect, Nicki. permalink award report block reply\nUnboosted 1 points 5 days ago Thats mean about 25k more people are democrats that follow her cuz 69% of democrats are biggoted and think that any opposing view is malicious. 69%!!!  -Cata institute study permalink award report block reply\nbarwhack 1 points 6 days ago She's not bleft anymore? permalink award report block reply\nCh3f4554551n 1 points 5 days ago Retarded, Evil Whore says thing. permalink award report block reply\nBrock_Shithouse 1 points 6 days ago I've never seen her without her clown makeup before. She looks a lot younger. permalink award report block reply\nbidensmissingbrain 1 points 6 days ago Still a hoe... permalink award report block reply\nTequilaWizard 1 points 5 days ago Followers are just AI bot accounts anyway. permalink award report block reply\nPatrioticPhantasma 0 points 6 days ago They were mostly bots.  Who cares. permalink award report block reply\nGunmolester 0 points 6 days ago oh noooo...Ive been down this road before...I will thank her and then she will apologize permalink award report block reply\nEaszq8 0 points 6 days ago You don’t want the admiration of communists. permalink award report block reply\nLaptopDied -1 points 6 days ago Get her into politics. permalink award report block reply reversethefraud 2 points 6 days ago So she can tell us about her wet ass pussy? permalink parent award report block reply LaptopDied 2 points 6 days ago Oh that was her thing? Didn't know. Ok no. permalink parent award report block reply zooty 12 points 6 days ago It was not. That was Cardi B. Not that I'm a fan of Minaj's music. The one song I kinda like with her in it, she brings the whole thing down (IMO) - https://www.youtube.com/watch?v=0HDdjwpPM3Y permalink parent award report block reply AndanteAndante -4 points 6 days ago You sho know your blackies! Question: who’s the one with a small blond Afro that spoke at the GOP convention ? permalink parent award report block reply view 2 more comments... Crappydatum 2 points 6 days ago Can't tell them apart? permalink parent award report block reply\nreversethefraud 2 points 6 days ago So she can tell us about her wet ass pussy? permalink parent award report block reply LaptopDied 2 points 6 days ago Oh that was her thing? Didn't know. Ok no. permalink parent award report block reply zooty 12 points 6 days ago It was not. That was Cardi B. Not that I'm a fan of Minaj's music. The one song I kinda like with her in it, she brings the whole thing down (IMO) - https://www.youtube.com/watch?v=0HDdjwpPM3Y permalink parent award report block reply AndanteAndante -4 points 6 days ago You sho know your blackies! Question: who’s the one with a small blond Afro that spoke at the GOP convention ? permalink parent award report block reply view 2 more comments... Crappydatum 2 points 6 days ago Can't tell them apart? permalink parent award report block reply\nLaptopDied 2 points 6 days ago Oh that was her thing? Didn't know. Ok no. permalink parent award report block reply zooty 12 points 6 days ago It was not. That was Cardi B. Not that I'm a fan of Minaj's music. The one song I kinda like with her in it, she brings the whole thing down (IMO) - https://www.youtube.com/watch?v=0HDdjwpPM3Y permalink parent award report block reply AndanteAndante -4 points 6 days ago You sho know your blackies! Question: who’s the one with a small blond Afro that spoke at the GOP convention ? permalink parent award report block reply view 2 more comments...\nzooty 12 points 6 days ago It was not. That was Cardi B. Not that I'm a fan of Minaj's music. The one song I kinda like with her in it, she brings the whole thing down (IMO) - https://www.youtube.com/watch?v=0HDdjwpPM3Y permalink parent award report block reply AndanteAndante -4 points 6 days ago You sho know your blackies! Question: who’s the one with a small blond Afro that spoke at the GOP convention ? permalink parent award report block reply view 2 more comments...\nAndanteAndante -4 points 6 days ago You sho know your blackies! Question: who’s the one with a small blond Afro that spoke at the GOP convention ? permalink parent award report block reply view 2 more comments...\nCrappydatum 2 points 6 days ago Can't tell them apart? permalink parent award report block reply\nSythen -4 points 6 days ago Isn't she the one who admitted to drugging and robbing men she'd meet at bars? permalink award report block reply Spiritof2015 31 points 6 days ago I think that's Cardi B. permalink parent award report block reply Sythen 8 points 6 days ago Ah yea, they all kind of blend together for me. permalink parent award report block reply AndanteAndante -1 points 6 days ago You sho know your blackies! permalink parent award report block reply Spiritof2015 7 points 6 days ago You sure sound retarded. permalink parent award report block reply Smurfection 17 points 6 days ago NO, that's Cardi B. Nicki Minaj is a pure blood too.  She rejected the jab and she told a couple of stories about how the jab caused \"vaccine\" injuries. permalink parent award report block reply FBIsurveillance 3 points 6 days ago no just the one with the gargantuan buns hun permalink parent award report block reply BunnyPicnic -1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nSpiritof2015 31 points 6 days ago I think that's Cardi B. permalink parent award report block reply Sythen 8 points 6 days ago Ah yea, they all kind of blend together for me. permalink parent award report block reply AndanteAndante -1 points 6 days ago You sho know your blackies! permalink parent award report block reply Spiritof2015 7 points 6 days ago You sure sound retarded. permalink parent award report block reply\nSythen 8 points 6 days ago Ah yea, they all kind of blend together for me. permalink parent award report block reply\nAndanteAndante -1 points 6 days ago You sho know your blackies! permalink parent award report block reply Spiritof2015 7 points 6 days ago You sure sound retarded. permalink parent award report block reply\nSpiritof2015 7 points 6 days ago You sure sound retarded. permalink parent award report block reply\nSmurfection 17 points 6 days ago NO, that's Cardi B. Nicki Minaj is a pure blood too.  She rejected the jab and she told a couple of stories about how the jab caused \"vaccine\" injuries. permalink parent award report block reply\nFBIsurveillance 3 points 6 days ago no just the one with the gargantuan buns hun permalink parent award report block reply\nBunnyPicnic -1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nCovidrrhea -4 points 6 days ago Thanks but go away, Nicki.  She's a psycho. permalink award report block reply\nAlmostFullyDilated 1 points 6 days ago Comment removed by community filter. permalink award report block reply\nPongpagongbatibot 1 points 5 days ago Comment removed by community filter. permalink award report block reply",
  "fetched_at": "2025-11-12T21:18:42.408126Z"
}