{
  "id": "1ARK9jzcDm",
  "url": "https://patriots.win/p/1ARK9jzcDm/exclusive-should-never-happen-an/c",
  "content": "955 Exclusive— ‘Should Never Happen Anywhere in This Country’: Zeldin Reflects on 2 Months Since Kirk’s Assassination, Slams Radical Dems (www.breitbart.com) posted 2 days ago by Trump2024Train 31 comments award share report block Exclusive— Zeldin Reflects on 2 Months Since Kirk’s Assassination, Slams Radical Democrats Two months after the public assassination of TPUSA founder Charlie Kirk, EPA Administrator Lee Zeldin spoke of the grim anniversary. www.breitbart.com\n31 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil MySidesGoUp 21 points 2 days ago Charlie was sacrificed for noticing. With all the issues with global govt distrust, compromised food, unfettered immigration….but they continue to role out new antisemitism policies. Really makes you think-  if you have half a brain… permalink award report block reply redredwine 10 points 1 day ago Candace Owns is now the #1 podcast in the world. Noticing has become normalized. The Great Noticing is upon us. permalink parent award report block reply Gayguy420 3 points 1 day ago Is she really? That is sad how many people are eating up her bs permalink parent award report block reply Mitch_WerBell_III 1 points 1 day ago Pretty much.  Israel is a Pomeranian.  We own it, it barks, it will stop barking if we smack it on the nose. permalink parent award report block reply hansgruber7 1 points 1 day ago She has obviously gone crazy. permalink parent award report block reply YT45 2 points 1 day ago She really has, unfortunately.  Her takes on Charlie’s assassination have been off-the-wall batshit. However (and I say this as a guy who doesn’t jump on the “It’s the JOOOOOZ!!!!” bandwagon), Candace seemed pretty legit and levelheaded before she went to Daily Wire and had the resulting spat.  Since then, she’s been increasingly off the deep end.  It makes me wonder just what the hell Shapiro and Boreing did to her while she was there. permalink parent award report block reply view 3 more comments... hansgruber7 1 points 1 day ago Candace has gone nuts.  That's the great noticing.  Her mental illness. permalink parent award report block reply NoticesBugleOWO 0 points 1 day ago She's a fucking retard. And so are you if you like her. permalink parent award report block reply EdgyUsernamexX69Xx 8 points 1 day ago Candice, Tucker, Fuentes have basically captured the entire conservative think space permalink parent award report block reply NomadicKrow2 3 points 1 day ago Fuentes is a psyop, ignore him. permalink parent award report block reply NoticesBugleOWO 2 points 1 day ago No they haven't. The leftists desperately want us to believe that because they are all toxic and retarded. That's why they killed Charlie, because he was keeping attention on CORRECT conservatism and away from retarded \"conservatism\", which is not conservative at all but just conspiracy slop. permalink parent award report block reply hansgruber7 1 points 24 hours ago Not really.  Just online which does not represent reality.  Most conservatives don't even know who Fuentes is and don't really follow Candace or Tucker off the deep end. permalink parent award report block reply Mitch_WerBell_III -1 points 1 day ago Tucker clearly misses his Fox News paycheck; not surprised he’s touting the same lines as the rest of the Goypers. permalink parent award report block reply hansgruber7 2 points 1 day ago Da Jooz are the reason all the shirts in your closet are a size too small. permalink parent award report block reply NoticesBugleOWO 2 points 1 day ago No, I think his sacrifice showed us unequivocally what the left is. We cannot afford to let them gain power ever again. If our representatives in government won't go all out to prevent it, then it's incumbent on us. Prepare for that inevitability. We have 1-3 years depending on how this shakes out. And don't think for a second that the left won't get even more violent if they lose in the mid-terms, because they will. permalink parent award report block reply MySidesGoUp -2 points 1 day ago Well we’re fucked then. We’re already using the military because our police are useless.  And trump didnt purge out all Biden era combatants either.   So when the next faggot democratic gets into power, they’ll use the same socialist measures that we’ve taken this term. Just call it what it is-  we’re owned by Israel. permalink parent award report block reply NoticesBugleOWO 2 points 1 day ago Why the fuck would Israel want the muslims and leftists to take over their greatest ally?? Fucking retard. permalink parent award report block reply MySidesGoUp -1 points 1 day ago Lmao. Hey bro, did you hear your staff sarge try that one on?? The Kalergi plan is a thing and we’ve watched Europe become erased from it. Look who occupies our legal and finance markets spec immigration.  It’s not the fucking Portuguese… permalink parent award report block reply view 1 more comments... hansgruber7 1 points 24 hours ago Israel has nothing to do with any of this.  Israelis support Trump more than Americans do. permalink parent award report block reply MySidesGoUp 1 points 23 hours ago lol. Israel has so much to do with it, that is the psyop.  It is splitting maga. Do you think 50 year mortgages and gibbs with soaring inflation will help us in the midterms? That’s looking that far… The ice heavy press is nice but we’re still proudly letting vast swarms of Chinese “students” into our country.  To pay for the colleges our we don’t even want our kids to go to. Just one example of kabuki theatre. Our society is swinging harder into judeo feminism. Creating competition even amongst our homes. More laws, more court. We all know who loves court. permalink parent award report block reply snoopy3210 -1 points 1 day ago He didn’t sacrifice. You murdered him (US military) to takeover his organization permalink parent award report block reply load 1 more comments... warlord30 4 points 1 day ago Democrats wsited 10 nanoseconds after slotting Charlie Kirk before continuing to call us Nazis and “a threat to democracy.” permalink award report block reply rebuildingMyself 2 points 1 day ago And during those 10 seconds they were dancing on his grave, most of which were such NPCs they had no idea who he was before he got shot. permalink parent award report block reply LaptopDied 2 points 1 day ago Lee  Zeldin is a good man. permalink award report block reply Prandogolio 2 points 1 day ago Oh thank goodness he SLAMS!  It's about time somebody SLAMS. permalink award report block reply deleted 1 points 2 days ago guywholikesDjtof2024 0 points 1 day ago huh? permalink parent award report block reply\nMySidesGoUp 21 points 2 days ago Charlie was sacrificed for noticing. With all the issues with global govt distrust, compromised food, unfettered immigration….but they continue to role out new antisemitism policies. Really makes you think-  if you have half a brain… permalink award report block reply redredwine 10 points 1 day ago Candace Owns is now the #1 podcast in the world. Noticing has become normalized. The Great Noticing is upon us. permalink parent award report block reply Gayguy420 3 points 1 day ago Is she really? That is sad how many people are eating up her bs permalink parent award report block reply Mitch_WerBell_III 1 points 1 day ago Pretty much.  Israel is a Pomeranian.  We own it, it barks, it will stop barking if we smack it on the nose. permalink parent award report block reply hansgruber7 1 points 1 day ago She has obviously gone crazy. permalink parent award report block reply YT45 2 points 1 day ago She really has, unfortunately.  Her takes on Charlie’s assassination have been off-the-wall batshit. However (and I say this as a guy who doesn’t jump on the “It’s the JOOOOOZ!!!!” bandwagon), Candace seemed pretty legit and levelheaded before she went to Daily Wire and had the resulting spat.  Since then, she’s been increasingly off the deep end.  It makes me wonder just what the hell Shapiro and Boreing did to her while she was there. permalink parent award report block reply view 3 more comments... hansgruber7 1 points 1 day ago Candace has gone nuts.  That's the great noticing.  Her mental illness. permalink parent award report block reply NoticesBugleOWO 0 points 1 day ago She's a fucking retard. And so are you if you like her. permalink parent award report block reply EdgyUsernamexX69Xx 8 points 1 day ago Candice, Tucker, Fuentes have basically captured the entire conservative think space permalink parent award report block reply NomadicKrow2 3 points 1 day ago Fuentes is a psyop, ignore him. permalink parent award report block reply NoticesBugleOWO 2 points 1 day ago No they haven't. The leftists desperately want us to believe that because they are all toxic and retarded. That's why they killed Charlie, because he was keeping attention on CORRECT conservatism and away from retarded \"conservatism\", which is not conservative at all but just conspiracy slop. permalink parent award report block reply hansgruber7 1 points 24 hours ago Not really.  Just online which does not represent reality.  Most conservatives don't even know who Fuentes is and don't really follow Candace or Tucker off the deep end. permalink parent award report block reply Mitch_WerBell_III -1 points 1 day ago Tucker clearly misses his Fox News paycheck; not surprised he’s touting the same lines as the rest of the Goypers. permalink parent award report block reply hansgruber7 2 points 1 day ago Da Jooz are the reason all the shirts in your closet are a size too small. permalink parent award report block reply NoticesBugleOWO 2 points 1 day ago No, I think his sacrifice showed us unequivocally what the left is. We cannot afford to let them gain power ever again. If our representatives in government won't go all out to prevent it, then it's incumbent on us. Prepare for that inevitability. We have 1-3 years depending on how this shakes out. And don't think for a second that the left won't get even more violent if they lose in the mid-terms, because they will. permalink parent award report block reply MySidesGoUp -2 points 1 day ago Well we’re fucked then. We’re already using the military because our police are useless.  And trump didnt purge out all Biden era combatants either.   So when the next faggot democratic gets into power, they’ll use the same socialist measures that we’ve taken this term. Just call it what it is-  we’re owned by Israel. permalink parent award report block reply NoticesBugleOWO 2 points 1 day ago Why the fuck would Israel want the muslims and leftists to take over their greatest ally?? Fucking retard. permalink parent award report block reply MySidesGoUp -1 points 1 day ago Lmao. Hey bro, did you hear your staff sarge try that one on?? The Kalergi plan is a thing and we’ve watched Europe become erased from it. Look who occupies our legal and finance markets spec immigration.  It’s not the fucking Portuguese… permalink parent award report block reply view 1 more comments... hansgruber7 1 points 24 hours ago Israel has nothing to do with any of this.  Israelis support Trump more than Americans do. permalink parent award report block reply MySidesGoUp 1 points 23 hours ago lol. Israel has so much to do with it, that is the psyop.  It is splitting maga. Do you think 50 year mortgages and gibbs with soaring inflation will help us in the midterms? That’s looking that far… The ice heavy press is nice but we’re still proudly letting vast swarms of Chinese “students” into our country.  To pay for the colleges our we don’t even want our kids to go to. Just one example of kabuki theatre. Our society is swinging harder into judeo feminism. Creating competition even amongst our homes. More laws, more court. We all know who loves court. permalink parent award report block reply snoopy3210 -1 points 1 day ago He didn’t sacrifice. You murdered him (US military) to takeover his organization permalink parent award report block reply load 1 more comments...\nredredwine 10 points 1 day ago Candace Owns is now the #1 podcast in the world. Noticing has become normalized. The Great Noticing is upon us. permalink parent award report block reply Gayguy420 3 points 1 day ago Is she really? That is sad how many people are eating up her bs permalink parent award report block reply Mitch_WerBell_III 1 points 1 day ago Pretty much.  Israel is a Pomeranian.  We own it, it barks, it will stop barking if we smack it on the nose. permalink parent award report block reply hansgruber7 1 points 1 day ago She has obviously gone crazy. permalink parent award report block reply YT45 2 points 1 day ago She really has, unfortunately.  Her takes on Charlie’s assassination have been off-the-wall batshit. However (and I say this as a guy who doesn’t jump on the “It’s the JOOOOOZ!!!!” bandwagon), Candace seemed pretty legit and levelheaded before she went to Daily Wire and had the resulting spat.  Since then, she’s been increasingly off the deep end.  It makes me wonder just what the hell Shapiro and Boreing did to her while she was there. permalink parent award report block reply view 3 more comments... hansgruber7 1 points 1 day ago Candace has gone nuts.  That's the great noticing.  Her mental illness. permalink parent award report block reply NoticesBugleOWO 0 points 1 day ago She's a fucking retard. And so are you if you like her. permalink parent award report block reply\nGayguy420 3 points 1 day ago Is she really? That is sad how many people are eating up her bs permalink parent award report block reply Mitch_WerBell_III 1 points 1 day ago Pretty much.  Israel is a Pomeranian.  We own it, it barks, it will stop barking if we smack it on the nose. permalink parent award report block reply hansgruber7 1 points 1 day ago She has obviously gone crazy. permalink parent award report block reply YT45 2 points 1 day ago She really has, unfortunately.  Her takes on Charlie’s assassination have been off-the-wall batshit. However (and I say this as a guy who doesn’t jump on the “It’s the JOOOOOZ!!!!” bandwagon), Candace seemed pretty legit and levelheaded before she went to Daily Wire and had the resulting spat.  Since then, she’s been increasingly off the deep end.  It makes me wonder just what the hell Shapiro and Boreing did to her while she was there. permalink parent award report block reply view 3 more comments...\nMitch_WerBell_III 1 points 1 day ago Pretty much.  Israel is a Pomeranian.  We own it, it barks, it will stop barking if we smack it on the nose. permalink parent award report block reply\nhansgruber7 1 points 1 day ago She has obviously gone crazy. permalink parent award report block reply YT45 2 points 1 day ago She really has, unfortunately.  Her takes on Charlie’s assassination have been off-the-wall batshit. However (and I say this as a guy who doesn’t jump on the “It’s the JOOOOOZ!!!!” bandwagon), Candace seemed pretty legit and levelheaded before she went to Daily Wire and had the resulting spat.  Since then, she’s been increasingly off the deep end.  It makes me wonder just what the hell Shapiro and Boreing did to her while she was there. permalink parent award report block reply view 3 more comments...\nYT45 2 points 1 day ago She really has, unfortunately.  Her takes on Charlie’s assassination have been off-the-wall batshit. However (and I say this as a guy who doesn’t jump on the “It’s the JOOOOOZ!!!!” bandwagon), Candace seemed pretty legit and levelheaded before she went to Daily Wire and had the resulting spat.  Since then, she’s been increasingly off the deep end.  It makes me wonder just what the hell Shapiro and Boreing did to her while she was there. permalink parent award report block reply view 3 more comments...\nhansgruber7 1 points 1 day ago Candace has gone nuts.  That's the great noticing.  Her mental illness. permalink parent award report block reply\nNoticesBugleOWO 0 points 1 day ago She's a fucking retard. And so are you if you like her. permalink parent award report block reply\nEdgyUsernamexX69Xx 8 points 1 day ago Candice, Tucker, Fuentes have basically captured the entire conservative think space permalink parent award report block reply NomadicKrow2 3 points 1 day ago Fuentes is a psyop, ignore him. permalink parent award report block reply NoticesBugleOWO 2 points 1 day ago No they haven't. The leftists desperately want us to believe that because they are all toxic and retarded. That's why they killed Charlie, because he was keeping attention on CORRECT conservatism and away from retarded \"conservatism\", which is not conservative at all but just conspiracy slop. permalink parent award report block reply hansgruber7 1 points 24 hours ago Not really.  Just online which does not represent reality.  Most conservatives don't even know who Fuentes is and don't really follow Candace or Tucker off the deep end. permalink parent award report block reply Mitch_WerBell_III -1 points 1 day ago Tucker clearly misses his Fox News paycheck; not surprised he’s touting the same lines as the rest of the Goypers. permalink parent award report block reply\nNomadicKrow2 3 points 1 day ago Fuentes is a psyop, ignore him. permalink parent award report block reply\nNoticesBugleOWO 2 points 1 day ago No they haven't. The leftists desperately want us to believe that because they are all toxic and retarded. That's why they killed Charlie, because he was keeping attention on CORRECT conservatism and away from retarded \"conservatism\", which is not conservative at all but just conspiracy slop. permalink parent award report block reply\nhansgruber7 1 points 24 hours ago Not really.  Just online which does not represent reality.  Most conservatives don't even know who Fuentes is and don't really follow Candace or Tucker off the deep end. permalink parent award report block reply\nMitch_WerBell_III -1 points 1 day ago Tucker clearly misses his Fox News paycheck; not surprised he’s touting the same lines as the rest of the Goypers. permalink parent award report block reply\nhansgruber7 2 points 1 day ago Da Jooz are the reason all the shirts in your closet are a size too small. permalink parent award report block reply\nNoticesBugleOWO 2 points 1 day ago No, I think his sacrifice showed us unequivocally what the left is. We cannot afford to let them gain power ever again. If our representatives in government won't go all out to prevent it, then it's incumbent on us. Prepare for that inevitability. We have 1-3 years depending on how this shakes out. And don't think for a second that the left won't get even more violent if they lose in the mid-terms, because they will. permalink parent award report block reply MySidesGoUp -2 points 1 day ago Well we’re fucked then. We’re already using the military because our police are useless.  And trump didnt purge out all Biden era combatants either.   So when the next faggot democratic gets into power, they’ll use the same socialist measures that we’ve taken this term. Just call it what it is-  we’re owned by Israel. permalink parent award report block reply NoticesBugleOWO 2 points 1 day ago Why the fuck would Israel want the muslims and leftists to take over their greatest ally?? Fucking retard. permalink parent award report block reply MySidesGoUp -1 points 1 day ago Lmao. Hey bro, did you hear your staff sarge try that one on?? The Kalergi plan is a thing and we’ve watched Europe become erased from it. Look who occupies our legal and finance markets spec immigration.  It’s not the fucking Portuguese… permalink parent award report block reply view 1 more comments... hansgruber7 1 points 24 hours ago Israel has nothing to do with any of this.  Israelis support Trump more than Americans do. permalink parent award report block reply MySidesGoUp 1 points 23 hours ago lol. Israel has so much to do with it, that is the psyop.  It is splitting maga. Do you think 50 year mortgages and gibbs with soaring inflation will help us in the midterms? That’s looking that far… The ice heavy press is nice but we’re still proudly letting vast swarms of Chinese “students” into our country.  To pay for the colleges our we don’t even want our kids to go to. Just one example of kabuki theatre. Our society is swinging harder into judeo feminism. Creating competition even amongst our homes. More laws, more court. We all know who loves court. permalink parent award report block reply\nMySidesGoUp -2 points 1 day ago Well we’re fucked then. We’re already using the military because our police are useless.  And trump didnt purge out all Biden era combatants either.   So when the next faggot democratic gets into power, they’ll use the same socialist measures that we’ve taken this term. Just call it what it is-  we’re owned by Israel. permalink parent award report block reply NoticesBugleOWO 2 points 1 day ago Why the fuck would Israel want the muslims and leftists to take over their greatest ally?? Fucking retard. permalink parent award report block reply MySidesGoUp -1 points 1 day ago Lmao. Hey bro, did you hear your staff sarge try that one on?? The Kalergi plan is a thing and we’ve watched Europe become erased from it. Look who occupies our legal and finance markets spec immigration.  It’s not the fucking Portuguese… permalink parent award report block reply view 1 more comments... hansgruber7 1 points 24 hours ago Israel has nothing to do with any of this.  Israelis support Trump more than Americans do. permalink parent award report block reply MySidesGoUp 1 points 23 hours ago lol. Israel has so much to do with it, that is the psyop.  It is splitting maga. Do you think 50 year mortgages and gibbs with soaring inflation will help us in the midterms? That’s looking that far… The ice heavy press is nice but we’re still proudly letting vast swarms of Chinese “students” into our country.  To pay for the colleges our we don’t even want our kids to go to. Just one example of kabuki theatre. Our society is swinging harder into judeo feminism. Creating competition even amongst our homes. More laws, more court. We all know who loves court. permalink parent award report block reply\nNoticesBugleOWO 2 points 1 day ago Why the fuck would Israel want the muslims and leftists to take over their greatest ally?? Fucking retard. permalink parent award report block reply MySidesGoUp -1 points 1 day ago Lmao. Hey bro, did you hear your staff sarge try that one on?? The Kalergi plan is a thing and we’ve watched Europe become erased from it. Look who occupies our legal and finance markets spec immigration.  It’s not the fucking Portuguese… permalink parent award report block reply view 1 more comments...\nMySidesGoUp -1 points 1 day ago Lmao. Hey bro, did you hear your staff sarge try that one on?? The Kalergi plan is a thing and we’ve watched Europe become erased from it. Look who occupies our legal and finance markets spec immigration.  It’s not the fucking Portuguese… permalink parent award report block reply view 1 more comments...\nhansgruber7 1 points 24 hours ago Israel has nothing to do with any of this.  Israelis support Trump more than Americans do. permalink parent award report block reply MySidesGoUp 1 points 23 hours ago lol. Israel has so much to do with it, that is the psyop.  It is splitting maga. Do you think 50 year mortgages and gibbs with soaring inflation will help us in the midterms? That’s looking that far… The ice heavy press is nice but we’re still proudly letting vast swarms of Chinese “students” into our country.  To pay for the colleges our we don’t even want our kids to go to. Just one example of kabuki theatre. Our society is swinging harder into judeo feminism. Creating competition even amongst our homes. More laws, more court. We all know who loves court. permalink parent award report block reply\nMySidesGoUp 1 points 23 hours ago lol. Israel has so much to do with it, that is the psyop.  It is splitting maga. Do you think 50 year mortgages and gibbs with soaring inflation will help us in the midterms? That’s looking that far… The ice heavy press is nice but we’re still proudly letting vast swarms of Chinese “students” into our country.  To pay for the colleges our we don’t even want our kids to go to. Just one example of kabuki theatre. Our society is swinging harder into judeo feminism. Creating competition even amongst our homes. More laws, more court. We all know who loves court. permalink parent award report block reply\nsnoopy3210 -1 points 1 day ago He didn’t sacrifice. You murdered him (US military) to takeover his organization permalink parent award report block reply\nwarlord30 4 points 1 day ago Democrats wsited 10 nanoseconds after slotting Charlie Kirk before continuing to call us Nazis and “a threat to democracy.” permalink award report block reply rebuildingMyself 2 points 1 day ago And during those 10 seconds they were dancing on his grave, most of which were such NPCs they had no idea who he was before he got shot. permalink parent award report block reply\nrebuildingMyself 2 points 1 day ago And during those 10 seconds they were dancing on his grave, most of which were such NPCs they had no idea who he was before he got shot. permalink parent award report block reply\nLaptopDied 2 points 1 day ago Lee  Zeldin is a good man. permalink award report block reply\nPrandogolio 2 points 1 day ago Oh thank goodness he SLAMS!  It's about time somebody SLAMS. permalink award report block reply\ndeleted 1 points 2 days ago guywholikesDjtof2024 0 points 1 day ago huh? permalink parent award report block reply\nguywholikesDjtof2024 0 points 1 day ago huh? permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:55:52.125879Z"
}