{
  "id": "1ARK53KN9t",
  "url": "https://patriots.win/p/1ARK53KN9t/gateway-pundit-retweet-a-credibl/c",
  "content": "408 GATEWAY PUNDIT RETWEET: A credible source just told me the January 6th pipe bomber was a female Capitol Police officer.\nI have no more information except to say that I trust this source 100%.\nThe source has spoken to others. They know her identity.\nI have no choice to put this out to protect myse posted 6 days ago by Sunnybats2 39 comments award share download report block\n39 comments Sort by Top Top New Worst Old Save Around the Web The Killer of Baldness Has Been Found! (Try This at Home) HaloGrow Shitsbrokeyo 26 points 6 days ago Add black to that. She wore high top air Jordan's. That will narrow it down by 5%. permalink award report block reply Taqiyya_Mockingbird 9 points 6 days ago It was Kamala permalink parent award report block reply impera 3 points 6 days ago No audio and therefore we couldn't hear the cackle. But also no unsteadiness for being in a state of end-stage alcoholism. She was diligently sheltering in place at the congressional bar. permalink parent award report block reply Plutossextape1 2 points 6 days ago She may not have been unburdened by what will be yet permalink parent award report block reply SwampRangers 1 points 5 days ago Google SHAUNI KERKHOFF permalink parent award report block reply NADSAQ 3 points 6 days ago pull all the store receipts in the local area! permalink parent award report block reply FightTheSWAMP 7 points 6 days ago They don't need to. She was on the phone at the time and could easily be narrowed down with geo location. Her shoes are extremely rare and would without a doubt be the only person in DC with those shoes. permalink parent award report block reply Shitsbrokeyo 3 points 5 days ago A collector. Its a thing. permalink parent award report block reply FightTheSWAMP 2 points 5 days ago Of course it's a thing... But that doesn't change the fact that the shoes she was wearing are rare AND the time stamped surveillance video shows when and where she was on the phone. They have more than enough evidence to get a warrant for Geolocation, which will narrow down the people in that location at that time. They can narrow down further based on gender. The shoes aren't really necessary but would be icing on the cake if she still has them or if they have evidence of them being sold after. Legit collectors actually keep track of purchasing history and receipts. permalink parent award report block reply SwampRangers 1 points 5 days ago The bomber had all three phones' data spoofed by AT&T so had some connection to pull. The bomber had an Outback Wilderness just like Capitol Police officer Shauni Kerkhoff. There is an emoji floating around of a hoodie wearer that looks like Shauni Kerkhoff. The bomber had the rough height and build of Shauni Kerkhoff. The bomber on J5 caused a distraction that caused Shauni Kerkhoff's police force to be dwindled on J6. intense popcorn-munching sounds permalink parent award report block reply barefootozark 21 points 6 days ago Interesting.  Capitol Police may be the J6 bomber... and the speaker of the house Pelosi announces she's not running for office all on the same day. permalink award report block reply CleanUpPhillyTrump24 2 points 5 days ago BINGO. Nan on the run. permalink parent award report block reply YodaBannon 16 points 6 days ago yuge if bigly permalink award report block reply Deplorable_Pede 13 points 6 days ago Certainly looked by build and movement to be a woman permalink award report block reply racer513 9 points 6 days ago And height permalink parent award report block reply kompromatdotwin 3 points 6 days ago and gate permalink parent award report block reply TrumpyOldMan 5 points 5 days ago Gait* permalink parent award report block reply kompromatdotwin 1 points 5 days ago Thank you. permalink parent award report block reply racer513 2 points 6 days ago And a woman's ability to build anything especially a bomb. That thing was never a real bomb permalink parent award report block reply KiekhaeferSoldier 2 points 5 days ago It was a trans bomb.  It was REAL to the bomber. permalink parent award report block reply FightTheSWAMP 12 points 6 days ago She should get a fast tack death penalty case so the Dems can't just pardon her if they ever get power.   But let's be real.... The sad truth is that under no circumstances will a DC jury convict this terrorist. The only shot is a change in venue, but it will be the same outcome in a Democrat city. permalink award report block reply CleanUpPhillyTrump24 1 points 5 days ago It is treason so the way to make sure the Dems don't turn her loose is that ALL Dems who touched this go to GITMO. Death penalty. Capitol Police = treason = capital offense = death penalty/low to no appeals. This is stuff that needs a military tribunal. It qualifies. There was a declared national emergency, the legal pretext besides declared war, to use the military judicial system for a domestic enemy. For this reason I understand Bondi not moving on this - it will not be, it isn't being, prosecuted in civilian courts. permalink parent award report block reply TS-SCI_thong 8 points 6 days ago Def walked like a girl .... Bent like a girl permalink award report block reply Aggrieved03 7 points 6 days ago I’m sure Cara could find someone here to watch over her while she sleeps. permalink award report block reply reasonablydisturbed 3 points 5 days ago If true, the FBI should put out a simple statement: We know who you are. You have 24 hrs to turn yourself in and name your co-conspirators for a possible plea deal. After that 24hrs has expired, expect us in your Ring camera. permalink award report block reply Sunnybats2 OP 1 points 5 days ago Fuk dat SWAT IMMEDIATELY permalink parent award report block reply grassshrimp 3 points 6 days ago I do not doubt it for one second. permalink award report block reply Trump2020or4eva 1 points 5 days ago Just 2 more weeks until the arrests start. Trust 🤡🤡🤡🤡🤡🤡🤡🤡🤡 permalink award report block reply Schiffblower -11 points 6 days ago Yup. Surely I believe this. Fucking grifting faggots. This doesn’t do anything for the people that can’t get a job or the ones that have jobs that cannot pay their bills. Fuck this bullshit Edit: I’m being downvoted but we just got fucking shellacked on Tuesday and I’m not talking about VA, NYC, and NJ. The Democrat voters are mobilized and we’re sitting at home jerking off to arrests that will never ever happen and even if they do, will not result in convictions due to polluted jury pools and will then never translate to voters turning out to vote in more Republican bullshit Edit 2: 62 absolute faggots (so far) upvoted OP’s faggot post permalink award report block reply grassshrimp 8 points 6 days ago You just tried to derail a thread about finding the J6 bomber. You really suck at being a shill.  I hope you don't get paid because you don't deserve a nickel for your lame attempts. permalink parent award report block reply FightTheSWAMP 4 points 6 days ago You should watch Tropic Thunder and take notes. Most important life lesson - \"You never go full retard\". permalink parent award report block reply BlockWorks 3 points 6 days ago Vote herder. Or fake a capitol bombing. Or... IDK... not many options left. If anybody even remotely on the Right did something of significance everybody would lose their minds. permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Go make a thread.  Get out of this one. permalink parent award report block reply Burisma 2 points 6 days ago Boo permalink parent award report block reply load 5 more comments...\nShitsbrokeyo 26 points 6 days ago Add black to that. She wore high top air Jordan's. That will narrow it down by 5%. permalink award report block reply Taqiyya_Mockingbird 9 points 6 days ago It was Kamala permalink parent award report block reply impera 3 points 6 days ago No audio and therefore we couldn't hear the cackle. But also no unsteadiness for being in a state of end-stage alcoholism. She was diligently sheltering in place at the congressional bar. permalink parent award report block reply Plutossextape1 2 points 6 days ago She may not have been unburdened by what will be yet permalink parent award report block reply SwampRangers 1 points 5 days ago Google SHAUNI KERKHOFF permalink parent award report block reply NADSAQ 3 points 6 days ago pull all the store receipts in the local area! permalink parent award report block reply FightTheSWAMP 7 points 6 days ago They don't need to. She was on the phone at the time and could easily be narrowed down with geo location. Her shoes are extremely rare and would without a doubt be the only person in DC with those shoes. permalink parent award report block reply Shitsbrokeyo 3 points 5 days ago A collector. Its a thing. permalink parent award report block reply FightTheSWAMP 2 points 5 days ago Of course it's a thing... But that doesn't change the fact that the shoes she was wearing are rare AND the time stamped surveillance video shows when and where she was on the phone. They have more than enough evidence to get a warrant for Geolocation, which will narrow down the people in that location at that time. They can narrow down further based on gender. The shoes aren't really necessary but would be icing on the cake if she still has them or if they have evidence of them being sold after. Legit collectors actually keep track of purchasing history and receipts. permalink parent award report block reply SwampRangers 1 points 5 days ago The bomber had all three phones' data spoofed by AT&T so had some connection to pull. The bomber had an Outback Wilderness just like Capitol Police officer Shauni Kerkhoff. There is an emoji floating around of a hoodie wearer that looks like Shauni Kerkhoff. The bomber had the rough height and build of Shauni Kerkhoff. The bomber on J5 caused a distraction that caused Shauni Kerkhoff's police force to be dwindled on J6. intense popcorn-munching sounds permalink parent award report block reply\nTaqiyya_Mockingbird 9 points 6 days ago It was Kamala permalink parent award report block reply impera 3 points 6 days ago No audio and therefore we couldn't hear the cackle. But also no unsteadiness for being in a state of end-stage alcoholism. She was diligently sheltering in place at the congressional bar. permalink parent award report block reply Plutossextape1 2 points 6 days ago She may not have been unburdened by what will be yet permalink parent award report block reply SwampRangers 1 points 5 days ago Google SHAUNI KERKHOFF permalink parent award report block reply\nimpera 3 points 6 days ago No audio and therefore we couldn't hear the cackle. But also no unsteadiness for being in a state of end-stage alcoholism. She was diligently sheltering in place at the congressional bar. permalink parent award report block reply Plutossextape1 2 points 6 days ago She may not have been unburdened by what will be yet permalink parent award report block reply SwampRangers 1 points 5 days ago Google SHAUNI KERKHOFF permalink parent award report block reply\nPlutossextape1 2 points 6 days ago She may not have been unburdened by what will be yet permalink parent award report block reply SwampRangers 1 points 5 days ago Google SHAUNI KERKHOFF permalink parent award report block reply\nSwampRangers 1 points 5 days ago Google SHAUNI KERKHOFF permalink parent award report block reply\nNADSAQ 3 points 6 days ago pull all the store receipts in the local area! permalink parent award report block reply FightTheSWAMP 7 points 6 days ago They don't need to. She was on the phone at the time and could easily be narrowed down with geo location. Her shoes are extremely rare and would without a doubt be the only person in DC with those shoes. permalink parent award report block reply Shitsbrokeyo 3 points 5 days ago A collector. Its a thing. permalink parent award report block reply FightTheSWAMP 2 points 5 days ago Of course it's a thing... But that doesn't change the fact that the shoes she was wearing are rare AND the time stamped surveillance video shows when and where she was on the phone. They have more than enough evidence to get a warrant for Geolocation, which will narrow down the people in that location at that time. They can narrow down further based on gender. The shoes aren't really necessary but would be icing on the cake if she still has them or if they have evidence of them being sold after. Legit collectors actually keep track of purchasing history and receipts. permalink parent award report block reply SwampRangers 1 points 5 days ago The bomber had all three phones' data spoofed by AT&T so had some connection to pull. The bomber had an Outback Wilderness just like Capitol Police officer Shauni Kerkhoff. There is an emoji floating around of a hoodie wearer that looks like Shauni Kerkhoff. The bomber had the rough height and build of Shauni Kerkhoff. The bomber on J5 caused a distraction that caused Shauni Kerkhoff's police force to be dwindled on J6. intense popcorn-munching sounds permalink parent award report block reply\nFightTheSWAMP 7 points 6 days ago They don't need to. She was on the phone at the time and could easily be narrowed down with geo location. Her shoes are extremely rare and would without a doubt be the only person in DC with those shoes. permalink parent award report block reply Shitsbrokeyo 3 points 5 days ago A collector. Its a thing. permalink parent award report block reply FightTheSWAMP 2 points 5 days ago Of course it's a thing... But that doesn't change the fact that the shoes she was wearing are rare AND the time stamped surveillance video shows when and where she was on the phone. They have more than enough evidence to get a warrant for Geolocation, which will narrow down the people in that location at that time. They can narrow down further based on gender. The shoes aren't really necessary but would be icing on the cake if she still has them or if they have evidence of them being sold after. Legit collectors actually keep track of purchasing history and receipts. permalink parent award report block reply SwampRangers 1 points 5 days ago The bomber had all three phones' data spoofed by AT&T so had some connection to pull. The bomber had an Outback Wilderness just like Capitol Police officer Shauni Kerkhoff. There is an emoji floating around of a hoodie wearer that looks like Shauni Kerkhoff. The bomber had the rough height and build of Shauni Kerkhoff. The bomber on J5 caused a distraction that caused Shauni Kerkhoff's police force to be dwindled on J6. intense popcorn-munching sounds permalink parent award report block reply\nShitsbrokeyo 3 points 5 days ago A collector. Its a thing. permalink parent award report block reply FightTheSWAMP 2 points 5 days ago Of course it's a thing... But that doesn't change the fact that the shoes she was wearing are rare AND the time stamped surveillance video shows when and where she was on the phone. They have more than enough evidence to get a warrant for Geolocation, which will narrow down the people in that location at that time. They can narrow down further based on gender. The shoes aren't really necessary but would be icing on the cake if she still has them or if they have evidence of them being sold after. Legit collectors actually keep track of purchasing history and receipts. permalink parent award report block reply\nFightTheSWAMP 2 points 5 days ago Of course it's a thing... But that doesn't change the fact that the shoes she was wearing are rare AND the time stamped surveillance video shows when and where she was on the phone. They have more than enough evidence to get a warrant for Geolocation, which will narrow down the people in that location at that time. They can narrow down further based on gender. The shoes aren't really necessary but would be icing on the cake if she still has them or if they have evidence of them being sold after. Legit collectors actually keep track of purchasing history and receipts. permalink parent award report block reply\nSwampRangers 1 points 5 days ago The bomber had all three phones' data spoofed by AT&T so had some connection to pull. The bomber had an Outback Wilderness just like Capitol Police officer Shauni Kerkhoff. There is an emoji floating around of a hoodie wearer that looks like Shauni Kerkhoff. The bomber had the rough height and build of Shauni Kerkhoff. The bomber on J5 caused a distraction that caused Shauni Kerkhoff's police force to be dwindled on J6. intense popcorn-munching sounds permalink parent award report block reply\nbarefootozark 21 points 6 days ago Interesting.  Capitol Police may be the J6 bomber... and the speaker of the house Pelosi announces she's not running for office all on the same day. permalink award report block reply CleanUpPhillyTrump24 2 points 5 days ago BINGO. Nan on the run. permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 5 days ago BINGO. Nan on the run. permalink parent award report block reply\nYodaBannon 16 points 6 days ago yuge if bigly permalink award report block reply\nDeplorable_Pede 13 points 6 days ago Certainly looked by build and movement to be a woman permalink award report block reply racer513 9 points 6 days ago And height permalink parent award report block reply kompromatdotwin 3 points 6 days ago and gate permalink parent award report block reply TrumpyOldMan 5 points 5 days ago Gait* permalink parent award report block reply kompromatdotwin 1 points 5 days ago Thank you. permalink parent award report block reply racer513 2 points 6 days ago And a woman's ability to build anything especially a bomb. That thing was never a real bomb permalink parent award report block reply KiekhaeferSoldier 2 points 5 days ago It was a trans bomb.  It was REAL to the bomber. permalink parent award report block reply\nracer513 9 points 6 days ago And height permalink parent award report block reply kompromatdotwin 3 points 6 days ago and gate permalink parent award report block reply TrumpyOldMan 5 points 5 days ago Gait* permalink parent award report block reply kompromatdotwin 1 points 5 days ago Thank you. permalink parent award report block reply racer513 2 points 6 days ago And a woman's ability to build anything especially a bomb. That thing was never a real bomb permalink parent award report block reply KiekhaeferSoldier 2 points 5 days ago It was a trans bomb.  It was REAL to the bomber. permalink parent award report block reply\nkompromatdotwin 3 points 6 days ago and gate permalink parent award report block reply TrumpyOldMan 5 points 5 days ago Gait* permalink parent award report block reply kompromatdotwin 1 points 5 days ago Thank you. permalink parent award report block reply racer513 2 points 6 days ago And a woman's ability to build anything especially a bomb. That thing was never a real bomb permalink parent award report block reply KiekhaeferSoldier 2 points 5 days ago It was a trans bomb.  It was REAL to the bomber. permalink parent award report block reply\nTrumpyOldMan 5 points 5 days ago Gait* permalink parent award report block reply kompromatdotwin 1 points 5 days ago Thank you. permalink parent award report block reply\nkompromatdotwin 1 points 5 days ago Thank you. permalink parent award report block reply\nracer513 2 points 6 days ago And a woman's ability to build anything especially a bomb. That thing was never a real bomb permalink parent award report block reply KiekhaeferSoldier 2 points 5 days ago It was a trans bomb.  It was REAL to the bomber. permalink parent award report block reply\nKiekhaeferSoldier 2 points 5 days ago It was a trans bomb.  It was REAL to the bomber. permalink parent award report block reply\nFightTheSWAMP 12 points 6 days ago She should get a fast tack death penalty case so the Dems can't just pardon her if they ever get power.   But let's be real.... The sad truth is that under no circumstances will a DC jury convict this terrorist. The only shot is a change in venue, but it will be the same outcome in a Democrat city. permalink award report block reply CleanUpPhillyTrump24 1 points 5 days ago It is treason so the way to make sure the Dems don't turn her loose is that ALL Dems who touched this go to GITMO. Death penalty. Capitol Police = treason = capital offense = death penalty/low to no appeals. This is stuff that needs a military tribunal. It qualifies. There was a declared national emergency, the legal pretext besides declared war, to use the military judicial system for a domestic enemy. For this reason I understand Bondi not moving on this - it will not be, it isn't being, prosecuted in civilian courts. permalink parent award report block reply\nCleanUpPhillyTrump24 1 points 5 days ago It is treason so the way to make sure the Dems don't turn her loose is that ALL Dems who touched this go to GITMO. Death penalty. Capitol Police = treason = capital offense = death penalty/low to no appeals. This is stuff that needs a military tribunal. It qualifies. There was a declared national emergency, the legal pretext besides declared war, to use the military judicial system for a domestic enemy. For this reason I understand Bondi not moving on this - it will not be, it isn't being, prosecuted in civilian courts. permalink parent award report block reply\nTS-SCI_thong 8 points 6 days ago Def walked like a girl .... Bent like a girl permalink award report block reply\nAggrieved03 7 points 6 days ago I’m sure Cara could find someone here to watch over her while she sleeps. permalink award report block reply\nreasonablydisturbed 3 points 5 days ago If true, the FBI should put out a simple statement: We know who you are. You have 24 hrs to turn yourself in and name your co-conspirators for a possible plea deal. After that 24hrs has expired, expect us in your Ring camera. permalink award report block reply Sunnybats2 OP 1 points 5 days ago Fuk dat SWAT IMMEDIATELY permalink parent award report block reply\nSunnybats2 OP 1 points 5 days ago Fuk dat SWAT IMMEDIATELY permalink parent award report block reply\ngrassshrimp 3 points 6 days ago I do not doubt it for one second. permalink award report block reply\nTrump2020or4eva 1 points 5 days ago Just 2 more weeks until the arrests start. Trust 🤡🤡🤡🤡🤡🤡🤡🤡🤡 permalink award report block reply\nSchiffblower -11 points 6 days ago Yup. Surely I believe this. Fucking grifting faggots. This doesn’t do anything for the people that can’t get a job or the ones that have jobs that cannot pay their bills. Fuck this bullshit Edit: I’m being downvoted but we just got fucking shellacked on Tuesday and I’m not talking about VA, NYC, and NJ. The Democrat voters are mobilized and we’re sitting at home jerking off to arrests that will never ever happen and even if they do, will not result in convictions due to polluted jury pools and will then never translate to voters turning out to vote in more Republican bullshit Edit 2: 62 absolute faggots (so far) upvoted OP’s faggot post permalink award report block reply grassshrimp 8 points 6 days ago You just tried to derail a thread about finding the J6 bomber. You really suck at being a shill.  I hope you don't get paid because you don't deserve a nickel for your lame attempts. permalink parent award report block reply FightTheSWAMP 4 points 6 days ago You should watch Tropic Thunder and take notes. Most important life lesson - \"You never go full retard\". permalink parent award report block reply BlockWorks 3 points 6 days ago Vote herder. Or fake a capitol bombing. Or... IDK... not many options left. If anybody even remotely on the Right did something of significance everybody would lose their minds. permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Go make a thread.  Get out of this one. permalink parent award report block reply Burisma 2 points 6 days ago Boo permalink parent award report block reply load 5 more comments...\ngrassshrimp 8 points 6 days ago You just tried to derail a thread about finding the J6 bomber. You really suck at being a shill.  I hope you don't get paid because you don't deserve a nickel for your lame attempts. permalink parent award report block reply\nFightTheSWAMP 4 points 6 days ago You should watch Tropic Thunder and take notes. Most important life lesson - \"You never go full retard\". permalink parent award report block reply\nBlockWorks 3 points 6 days ago Vote herder. Or fake a capitol bombing. Or... IDK... not many options left. If anybody even remotely on the Right did something of significance everybody would lose their minds. permalink parent award report block reply\nShitsbrokeyo 2 points 5 days ago Go make a thread.  Get out of this one. permalink parent award report block reply\nBurisma 2 points 6 days ago Boo permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:01:19.540542Z"
}