{
  "id": "1ARK9k0isq",
  "url": "https://patriots.win/p/1ARK9k0isq/shut-the-fuck-up-dinesh-dsouza-u/c",
  "content": "370 \"Shut the fuck up Dinesh [D'Souza]. Unprovoked, your response to my family and I being doxxed, threatened, and harassed by Indian nationalists infuriated by my documentation of a poop-throwing festival was NOT sympathy as a fellow American. Is America simply an economic exploitation zone?\" posted 1 day ago by bleeje 31 comments award share report block Tyler Oliveira @tyleraloevera • 2d Shut the fuck up Dinesh. Unprovoked, your response to my family and I being doxxed, threatened, and harassed by Indian nationalists infuriated by my documentation of a poop-throwing festival was NOT sympathy as a fellow American. NOPE. You posted a screenshot of median Dinesh D'Souza @DineshDSouza • 3d I don’t think these losers understand how I react to this abuse. I react in the way the Duke of Kent would react to the caterwauling of a street heckler. I don’t seek a duel; I’m simply entertained by the stupidity. My wife tells me I enjoy these plebeian tantrums way too much.\n31 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno newestofnew 47 points 1 day ago somehow the messaging of \"our families sacrificed nothing for this country but have defrauded the system to commandeer its bounty for ourselves... and that makes us better Americans than you\" isn't going to work out for these people the way they think it will permalink award report block reply bleeje OP 29 points 1 day ago What do you think of their 'we work harder than lazy Americans!!!!' propaganda? permalink parent award report block reply 0Sum 28 points 1 day ago Many of them work harder because they're living under the threat of work or we won't renew your H1B. This mentality encourages long hours of low quality results. I work in the tech industry and I can tell you from firsthand experience, many of the Indians are very hard to work with. They're stubborn, overconfident, and very often incorrect. They seem to look down on their peers and won't ask for help when needed for fear of being judged or found out. permalink parent award report block reply xBigCoffinHunter 14 points 1 day ago Exact same experience.  Friendly as hell, until they aren’t. usually right around the time someone figures out they’re full of shit.  It becomes clear that is an effort to keep you off their back. permalink parent award report block reply 0Sum 4 points 1 day ago I can't wait for AI to replace them all. Most engineering work comes down to analyzing data to determine what part to replace. They rarely have their hands on the actual equipment. They seem to rely on a spreadsheet and broken logic. permalink parent award report block reply TD_Covfefe_Crusader 7 points 1 day ago That was my experience working with them as well. I retired from a career in software development and I had to manage a few Indian teams and also work with Indian managers. Even my last boss was Indian, as they had pretty much taken over the field right around the time I retired. permalink parent award report block reply Standingoak 2 points 17 hours ago Perfect description of a Caste system.  Or sons and daughters of wealth in America. permalink parent award report block reply newestofnew 24 points 1 day ago everyone is an individual and work ethic is deeply personal characteristic. that said, in general, if that were true the whole world would be trying to get into India rather than out of it. permalink parent award report block reply patrioticwinning3 8 points 1 day ago Propaganda pushed by globohomo at the top! permalink parent award report block reply snoopy3210 -1 points 1 day ago Fuck Tyler is all I can say. Dinesh did more than most to expose the obama corruption and fraud and that Tyler sounds like the low IQ trolls claiming everybody else has a low IQ permalink parent award report block reply BlackJack1776 29 points 1 day ago Mask. Off. permalink award report block reply Porkbut -11 points 1 day ago The constant division posting op does? Sure is. permalink parent award report block reply Jack_NC 29 points 1 day ago Indians always choose ethnic loyalty, first. As do every other ethnic group, it seems, except whites. permalink award report block reply Bullet_Tooth_Tony 8 points 1 day ago Whites too busy subverting their own people. Sure blacks kill each other in urban cities daily, but at least they own up to it 🤷‍♂️ permalink parent award report block reply Glory-Unto-God 6 points 1 day ago \"\"\"Whites\"\"\" permalink parent award report block reply ConfusedAngryArmed 2 points 1 day ago Lol, it's not Whites. They just take advantage of \"looking White\". permalink parent award report block reply DrVSGGEOTUSPhD 20 points 1 day ago Sad to see him and vivek expose themselves as clannish ethnonats permalink award report block reply TD_Covfefe_Crusader 6 points 1 day ago Sad, but also predictable. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 1 day ago They had me convinced they were 🇺🇲🦅AMERICA FIRST🦅 🇺🇲 permalink parent award report block reply SickOfNeoPolitics 18 points 1 day ago And now we are \"plebeians\" to this filthy streetshitter. REPEAL THE HART CELLER ACT. permalink award report block reply CommietownUSA 12 points 1 day ago Pajeets think they’re the greatest thing since sliced bread but lack basic civic and hygienic sense. It’s comical. permalink award report block reply TheTelltaleFly 9 points 1 day ago It might be comical if they weren’t constantly killing people on our highways and stealing all our jobs. permalink parent award report block reply patrioticwinning3 11 points 1 day ago D'Doucebag is pro-H1B! permalink award report block reply LORDFALCONE 10 points 1 day ago Lmfao get fucked pajeet permalink award report block reply FusionBlack 9 points 1 day ago Street shitter by any other name. Dinesh always seemed a bit off. permalink award report block reply sleepinggiant 8 points 1 day ago Thats exactly what america is to foreigners permalink award report block reply reversethefraud 5 points 1 day ago Thanks to this tweet battle, I found this gem of a music video about the jeets. Barry and the Jeets: https://xcancel.com/foundring1/status/1872015840406811000#m enjoy permalink award report block reply MatterThatMetals 5 points 1 day ago Indians. I can't like 'em. permalink award report block reply barwhack 4 points 1 day ago The Diwali-ending poop throwing is real... permalink award report block reply FreshMemes 3 points 1 day ago I’m skeptical how he produced such a hot daughter. permalink award report block reply ConfusedAngryArmed 3 points 1 day ago I'm slowly extending my belief that Mudslimes should be impaled and left to rot in the sun to also include street shitters. permalink award report block reply NoticesBugleOWO 3 points 1 day ago You can take the tribal out of the tribe, but you can't take the tribe out of the tribal. permalink award report block reply\nnewestofnew 47 points 1 day ago somehow the messaging of \"our families sacrificed nothing for this country but have defrauded the system to commandeer its bounty for ourselves... and that makes us better Americans than you\" isn't going to work out for these people the way they think it will permalink award report block reply bleeje OP 29 points 1 day ago What do you think of their 'we work harder than lazy Americans!!!!' propaganda? permalink parent award report block reply 0Sum 28 points 1 day ago Many of them work harder because they're living under the threat of work or we won't renew your H1B. This mentality encourages long hours of low quality results. I work in the tech industry and I can tell you from firsthand experience, many of the Indians are very hard to work with. They're stubborn, overconfident, and very often incorrect. They seem to look down on their peers and won't ask for help when needed for fear of being judged or found out. permalink parent award report block reply xBigCoffinHunter 14 points 1 day ago Exact same experience.  Friendly as hell, until they aren’t. usually right around the time someone figures out they’re full of shit.  It becomes clear that is an effort to keep you off their back. permalink parent award report block reply 0Sum 4 points 1 day ago I can't wait for AI to replace them all. Most engineering work comes down to analyzing data to determine what part to replace. They rarely have their hands on the actual equipment. They seem to rely on a spreadsheet and broken logic. permalink parent award report block reply TD_Covfefe_Crusader 7 points 1 day ago That was my experience working with them as well. I retired from a career in software development and I had to manage a few Indian teams and also work with Indian managers. Even my last boss was Indian, as they had pretty much taken over the field right around the time I retired. permalink parent award report block reply Standingoak 2 points 17 hours ago Perfect description of a Caste system.  Or sons and daughters of wealth in America. permalink parent award report block reply newestofnew 24 points 1 day ago everyone is an individual and work ethic is deeply personal characteristic. that said, in general, if that were true the whole world would be trying to get into India rather than out of it. permalink parent award report block reply patrioticwinning3 8 points 1 day ago Propaganda pushed by globohomo at the top! permalink parent award report block reply snoopy3210 -1 points 1 day ago Fuck Tyler is all I can say. Dinesh did more than most to expose the obama corruption and fraud and that Tyler sounds like the low IQ trolls claiming everybody else has a low IQ permalink parent award report block reply\nbleeje OP 29 points 1 day ago What do you think of their 'we work harder than lazy Americans!!!!' propaganda? permalink parent award report block reply 0Sum 28 points 1 day ago Many of them work harder because they're living under the threat of work or we won't renew your H1B. This mentality encourages long hours of low quality results. I work in the tech industry and I can tell you from firsthand experience, many of the Indians are very hard to work with. They're stubborn, overconfident, and very often incorrect. They seem to look down on their peers and won't ask for help when needed for fear of being judged or found out. permalink parent award report block reply xBigCoffinHunter 14 points 1 day ago Exact same experience.  Friendly as hell, until they aren’t. usually right around the time someone figures out they’re full of shit.  It becomes clear that is an effort to keep you off their back. permalink parent award report block reply 0Sum 4 points 1 day ago I can't wait for AI to replace them all. Most engineering work comes down to analyzing data to determine what part to replace. They rarely have their hands on the actual equipment. They seem to rely on a spreadsheet and broken logic. permalink parent award report block reply TD_Covfefe_Crusader 7 points 1 day ago That was my experience working with them as well. I retired from a career in software development and I had to manage a few Indian teams and also work with Indian managers. Even my last boss was Indian, as they had pretty much taken over the field right around the time I retired. permalink parent award report block reply Standingoak 2 points 17 hours ago Perfect description of a Caste system.  Or sons and daughters of wealth in America. permalink parent award report block reply newestofnew 24 points 1 day ago everyone is an individual and work ethic is deeply personal characteristic. that said, in general, if that were true the whole world would be trying to get into India rather than out of it. permalink parent award report block reply patrioticwinning3 8 points 1 day ago Propaganda pushed by globohomo at the top! permalink parent award report block reply snoopy3210 -1 points 1 day ago Fuck Tyler is all I can say. Dinesh did more than most to expose the obama corruption and fraud and that Tyler sounds like the low IQ trolls claiming everybody else has a low IQ permalink parent award report block reply\n0Sum 28 points 1 day ago Many of them work harder because they're living under the threat of work or we won't renew your H1B. This mentality encourages long hours of low quality results. I work in the tech industry and I can tell you from firsthand experience, many of the Indians are very hard to work with. They're stubborn, overconfident, and very often incorrect. They seem to look down on their peers and won't ask for help when needed for fear of being judged or found out. permalink parent award report block reply xBigCoffinHunter 14 points 1 day ago Exact same experience.  Friendly as hell, until they aren’t. usually right around the time someone figures out they’re full of shit.  It becomes clear that is an effort to keep you off their back. permalink parent award report block reply 0Sum 4 points 1 day ago I can't wait for AI to replace them all. Most engineering work comes down to analyzing data to determine what part to replace. They rarely have their hands on the actual equipment. They seem to rely on a spreadsheet and broken logic. permalink parent award report block reply TD_Covfefe_Crusader 7 points 1 day ago That was my experience working with them as well. I retired from a career in software development and I had to manage a few Indian teams and also work with Indian managers. Even my last boss was Indian, as they had pretty much taken over the field right around the time I retired. permalink parent award report block reply Standingoak 2 points 17 hours ago Perfect description of a Caste system.  Or sons and daughters of wealth in America. permalink parent award report block reply\nxBigCoffinHunter 14 points 1 day ago Exact same experience.  Friendly as hell, until they aren’t. usually right around the time someone figures out they’re full of shit.  It becomes clear that is an effort to keep you off their back. permalink parent award report block reply 0Sum 4 points 1 day ago I can't wait for AI to replace them all. Most engineering work comes down to analyzing data to determine what part to replace. They rarely have their hands on the actual equipment. They seem to rely on a spreadsheet and broken logic. permalink parent award report block reply\n0Sum 4 points 1 day ago I can't wait for AI to replace them all. Most engineering work comes down to analyzing data to determine what part to replace. They rarely have their hands on the actual equipment. They seem to rely on a spreadsheet and broken logic. permalink parent award report block reply\nTD_Covfefe_Crusader 7 points 1 day ago That was my experience working with them as well. I retired from a career in software development and I had to manage a few Indian teams and also work with Indian managers. Even my last boss was Indian, as they had pretty much taken over the field right around the time I retired. permalink parent award report block reply\nStandingoak 2 points 17 hours ago Perfect description of a Caste system.  Or sons and daughters of wealth in America. permalink parent award report block reply\nnewestofnew 24 points 1 day ago everyone is an individual and work ethic is deeply personal characteristic. that said, in general, if that were true the whole world would be trying to get into India rather than out of it. permalink parent award report block reply\npatrioticwinning3 8 points 1 day ago Propaganda pushed by globohomo at the top! permalink parent award report block reply\nsnoopy3210 -1 points 1 day ago Fuck Tyler is all I can say. Dinesh did more than most to expose the obama corruption and fraud and that Tyler sounds like the low IQ trolls claiming everybody else has a low IQ permalink parent award report block reply\nBlackJack1776 29 points 1 day ago Mask. Off. permalink award report block reply Porkbut -11 points 1 day ago The constant division posting op does? Sure is. permalink parent award report block reply\nPorkbut -11 points 1 day ago The constant division posting op does? Sure is. permalink parent award report block reply\nJack_NC 29 points 1 day ago Indians always choose ethnic loyalty, first. As do every other ethnic group, it seems, except whites. permalink award report block reply Bullet_Tooth_Tony 8 points 1 day ago Whites too busy subverting their own people. Sure blacks kill each other in urban cities daily, but at least they own up to it 🤷‍♂️ permalink parent award report block reply Glory-Unto-God 6 points 1 day ago \"\"\"Whites\"\"\" permalink parent award report block reply ConfusedAngryArmed 2 points 1 day ago Lol, it's not Whites. They just take advantage of \"looking White\". permalink parent award report block reply\nBullet_Tooth_Tony 8 points 1 day ago Whites too busy subverting their own people. Sure blacks kill each other in urban cities daily, but at least they own up to it 🤷‍♂️ permalink parent award report block reply Glory-Unto-God 6 points 1 day ago \"\"\"Whites\"\"\" permalink parent award report block reply ConfusedAngryArmed 2 points 1 day ago Lol, it's not Whites. They just take advantage of \"looking White\". permalink parent award report block reply\nGlory-Unto-God 6 points 1 day ago \"\"\"Whites\"\"\" permalink parent award report block reply\nConfusedAngryArmed 2 points 1 day ago Lol, it's not Whites. They just take advantage of \"looking White\". permalink parent award report block reply\nDrVSGGEOTUSPhD 20 points 1 day ago Sad to see him and vivek expose themselves as clannish ethnonats permalink award report block reply TD_Covfefe_Crusader 6 points 1 day ago Sad, but also predictable. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 1 day ago They had me convinced they were 🇺🇲🦅AMERICA FIRST🦅 🇺🇲 permalink parent award report block reply\nTD_Covfefe_Crusader 6 points 1 day ago Sad, but also predictable. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 1 day ago They had me convinced they were 🇺🇲🦅AMERICA FIRST🦅 🇺🇲 permalink parent award report block reply\nDrVSGGEOTUSPhD 1 points 1 day ago They had me convinced they were 🇺🇲🦅AMERICA FIRST🦅 🇺🇲 permalink parent award report block reply\nSickOfNeoPolitics 18 points 1 day ago And now we are \"plebeians\" to this filthy streetshitter. REPEAL THE HART CELLER ACT. permalink award report block reply\nCommietownUSA 12 points 1 day ago Pajeets think they’re the greatest thing since sliced bread but lack basic civic and hygienic sense. It’s comical. permalink award report block reply TheTelltaleFly 9 points 1 day ago It might be comical if they weren’t constantly killing people on our highways and stealing all our jobs. permalink parent award report block reply\nTheTelltaleFly 9 points 1 day ago It might be comical if they weren’t constantly killing people on our highways and stealing all our jobs. permalink parent award report block reply\npatrioticwinning3 11 points 1 day ago D'Doucebag is pro-H1B! permalink award report block reply\nLORDFALCONE 10 points 1 day ago Lmfao get fucked pajeet permalink award report block reply\nFusionBlack 9 points 1 day ago Street shitter by any other name. Dinesh always seemed a bit off. permalink award report block reply\nsleepinggiant 8 points 1 day ago Thats exactly what america is to foreigners permalink award report block reply\nreversethefraud 5 points 1 day ago Thanks to this tweet battle, I found this gem of a music video about the jeets. Barry and the Jeets: https://xcancel.com/foundring1/status/1872015840406811000#m enjoy permalink award report block reply\nMatterThatMetals 5 points 1 day ago Indians. I can't like 'em. permalink award report block reply\nbarwhack 4 points 1 day ago The Diwali-ending poop throwing is real... permalink award report block reply\nFreshMemes 3 points 1 day ago I’m skeptical how he produced such a hot daughter. permalink award report block reply\nConfusedAngryArmed 3 points 1 day ago I'm slowly extending my belief that Mudslimes should be impaled and left to rot in the sun to also include street shitters. permalink award report block reply\nNoticesBugleOWO 3 points 1 day ago You can take the tribal out of the tribe, but you can't take the tribe out of the tribal. permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:08.016448Z"
}