{
  "id": "1ARK54Rfog",
  "url": "https://patriots.win/p/1ARK54Rfog/wont-be-long/c",
  "content": "462 Won't be long.. posted 5 days ago by wst4 25 comments award share download report block\n25 comments Sort by Top Top New Worst Old Save CaJuN-Polak 10 points 5 days ago I wanna play!! permalink award report block reply sordfysh PRO 6 points 5 days ago Like in Afghanistan? permalink award report block reply Tombstone2W 6 points 5 days ago This time it becomes the Geneva checklist and we play the same way they did. And they'll learn why the European was a master of war. permalink parent award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply deleted 4 points 5 days ago sordfysh PRO 1 points 5 days ago Like in Somalia? permalink parent award report block reply TwoArizonaPedes 4 points 5 days ago We're already fighting. Join us! permalink award report block reply Reefay 3 points 5 days ago I mean, Indians are still involved. 🔴 ! 🪶 permalink award report block reply Brownwaterboys 2 points 5 days ago Feather over dots everytime. permalink parent award report block reply Idontevenknow 3 points 5 days ago SARRR. PUT down weapon. YOUCANNOT SHOOT ME! permalink award report block reply the-new-style 2 points 5 days ago Except it will be Rednecks and Indians permalink award report block reply Reefay 1 points 5 days ago 🔴 ! 🪶 permalink parent award report block reply TGNX 2 points 5 days ago And the leftoids in the cities think \"redneck\" is a slur. permalink award report block reply concealedaces 1 points 5 days ago Alongside redhats and tinyhats permalink award report block reply PhantomShield72 1 points 5 days ago The only thing we have to remember is - the people who have been let into this country come from war and are not concerned about surviving an engagement. The entire purpose in many cases is to die while killing as many \"infidels\" as possible. I fully believe they will be defeated - but the cost will be horrendous. This was all avoidable - those who facilitated this treason, all while convincing us we were supposed to \"fight them over there so we don't have to here\" should be lined up and shot. permalink award report block reply heavyD 4 points 5 days ago You don't really understand the Honorable name Redneck, we could first of all give 2 sheets about their concerns, they will certainly met their maker. We've been hiding in the woods picking off targets since the south was settled and from very long distances. We will at least pray for your soul right before we add lead to your diet though. Can I get an Amen. permalink parent award report block reply PhantomShield72 1 points 5 days ago Amen permalink parent award report block reply TheGoyimWhisperer -6 points 5 days ago Comment removed upon the user being banned. permalink award report block reply Formerlurker92 4 points 5 days ago Ah yes, a hoard of starving metrosexuals without guns vs people with 300 million of them. Somehow I think we'll be OK. permalink parent award report block reply Pawsed 4 points 5 days ago Pretty sure they'll only go as far as the bus stops take em. permalink parent award report block reply PhantomShield72 2 points 5 days ago You think threatening people who can live off the land with the \"scourge of starving city dwellers in skinny jeans\" is some sort of dunk? FOH retard... permalink parent award report block reply heavyD 1 points 5 days ago You can't learn this kind of stupid growing up, you have to be born this dumb. Dropped on the head and dribbled. permalink parent award report block reply\nCaJuN-Polak 10 points 5 days ago I wanna play!! permalink award report block reply\nsordfysh PRO 6 points 5 days ago Like in Afghanistan? permalink award report block reply Tombstone2W 6 points 5 days ago This time it becomes the Geneva checklist and we play the same way they did. And they'll learn why the European was a master of war. permalink parent award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply deleted 4 points 5 days ago sordfysh PRO 1 points 5 days ago Like in Somalia? permalink parent award report block reply\nTombstone2W 6 points 5 days ago This time it becomes the Geneva checklist and we play the same way they did. And they'll learn why the European was a master of war. permalink parent award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\ndeleted 4 points 5 days ago sordfysh PRO 1 points 5 days ago Like in Somalia? permalink parent award report block reply\nsordfysh PRO 1 points 5 days ago Like in Somalia? permalink parent award report block reply\nTwoArizonaPedes 4 points 5 days ago We're already fighting. Join us! permalink award report block reply\nReefay 3 points 5 days ago I mean, Indians are still involved. 🔴 ! 🪶 permalink award report block reply Brownwaterboys 2 points 5 days ago Feather over dots everytime. permalink parent award report block reply\nBrownwaterboys 2 points 5 days ago Feather over dots everytime. permalink parent award report block reply\nIdontevenknow 3 points 5 days ago SARRR. PUT down weapon. YOUCANNOT SHOOT ME! permalink award report block reply\nthe-new-style 2 points 5 days ago Except it will be Rednecks and Indians permalink award report block reply Reefay 1 points 5 days ago 🔴 ! 🪶 permalink parent award report block reply\nReefay 1 points 5 days ago 🔴 ! 🪶 permalink parent award report block reply\nTGNX 2 points 5 days ago And the leftoids in the cities think \"redneck\" is a slur. permalink award report block reply\nconcealedaces 1 points 5 days ago Alongside redhats and tinyhats permalink award report block reply\nPhantomShield72 1 points 5 days ago The only thing we have to remember is - the people who have been let into this country come from war and are not concerned about surviving an engagement. The entire purpose in many cases is to die while killing as many \"infidels\" as possible. I fully believe they will be defeated - but the cost will be horrendous. This was all avoidable - those who facilitated this treason, all while convincing us we were supposed to \"fight them over there so we don't have to here\" should be lined up and shot. permalink award report block reply heavyD 4 points 5 days ago You don't really understand the Honorable name Redneck, we could first of all give 2 sheets about their concerns, they will certainly met their maker. We've been hiding in the woods picking off targets since the south was settled and from very long distances. We will at least pray for your soul right before we add lead to your diet though. Can I get an Amen. permalink parent award report block reply PhantomShield72 1 points 5 days ago Amen permalink parent award report block reply\nheavyD 4 points 5 days ago You don't really understand the Honorable name Redneck, we could first of all give 2 sheets about their concerns, they will certainly met their maker. We've been hiding in the woods picking off targets since the south was settled and from very long distances. We will at least pray for your soul right before we add lead to your diet though. Can I get an Amen. permalink parent award report block reply PhantomShield72 1 points 5 days ago Amen permalink parent award report block reply\nPhantomShield72 1 points 5 days ago Amen permalink parent award report block reply\nTheGoyimWhisperer -6 points 5 days ago Comment removed upon the user being banned. permalink award report block reply Formerlurker92 4 points 5 days ago Ah yes, a hoard of starving metrosexuals without guns vs people with 300 million of them. Somehow I think we'll be OK. permalink parent award report block reply Pawsed 4 points 5 days ago Pretty sure they'll only go as far as the bus stops take em. permalink parent award report block reply PhantomShield72 2 points 5 days ago You think threatening people who can live off the land with the \"scourge of starving city dwellers in skinny jeans\" is some sort of dunk? FOH retard... permalink parent award report block reply heavyD 1 points 5 days ago You can't learn this kind of stupid growing up, you have to be born this dumb. Dropped on the head and dribbled. permalink parent award report block reply\nFormerlurker92 4 points 5 days ago Ah yes, a hoard of starving metrosexuals without guns vs people with 300 million of them. Somehow I think we'll be OK. permalink parent award report block reply Pawsed 4 points 5 days ago Pretty sure they'll only go as far as the bus stops take em. permalink parent award report block reply\nPawsed 4 points 5 days ago Pretty sure they'll only go as far as the bus stops take em. permalink parent award report block reply\nPhantomShield72 2 points 5 days ago You think threatening people who can live off the land with the \"scourge of starving city dwellers in skinny jeans\" is some sort of dunk? FOH retard... permalink parent award report block reply\nheavyD 1 points 5 days ago You can't learn this kind of stupid growing up, you have to be born this dumb. Dropped on the head and dribbled. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:52:11.061172Z"
}