{
  "id": "1ARK9mGxtL",
  "url": "https://patriots.win/p/1ARK9mGxtL/steven-crowder\n\ntrump-on-h1bs-as/c",
  "content": "656 Steven Crowder\n:\nTrump on H1-Bs… as bad as it gets. \nWas hoping he learned from Elon’s blunder on this one but it’s not looking like it. posted 13 hours ago by PiratePatriotParrot 84 comments award share report block Steven Crowder @scrowder • 15h Trump on H1-Bs… as bad as it gets. Was hoping he learned from Elon’s blunder on this one but it’s not looking like it.\n84 comments Sort by Top Top New Worst Old Save What Made Him Walk Away? The Shocking Truth Is Out Read More Ads by Ad.Style friarfox 75 points 13 hours ago I don't see how this fits into America first policy at all and it's going to cost him from voters watching their jobs handed to foreigners. permalink award report block reply PiratePatriotParrot OP 63 points 13 hours ago I literally watched my job go to foreign H1-bs haha permalink parent award report block reply Tellmeboutit2 33 points 12 hours ago Who the fuck down votes this permalink parent award report block reply mty_green_go 29 points 12 hours ago Jevvs & Eloids permalink parent award report block reply votedforthe45th -1 points 7 hours ago groyper slaves permalink parent award report block reply view 1 more comments... GEOTUS4POTUS -7 points 5 hours ago why'd you let your job get taken like a fuckin cuck? spez: all the downvotes, but nobody can answer like a man. permalink parent award report block reply TD_Covfefe_Crusader 2 points 1 hour ago I watched my entire career field (software development) go to H1-B. permalink parent award report block reply ValhallaBaboon -22 points 12 hours ago learn to code? permalink parent award report block reply dr_gonzo 14 points 7 hours ago No point in doing that now. I'm a senior developer with 20 years experience. I'm employed thankfully, but for the first time in my career I'm not being bombarded with recruiter emails. It's been about a month since I got one. I used to get 5-10 a day, along with 2-3 phone calls. No joke. It was like that for 18 or 19 years. So there's little point in trying to break into this field now. You'll only be competing against people with much more experience, not to mention AI. permalink parent award report block reply HocusLocus 7 points 6 hours ago I got problems too.  I was around for the expansion of Internet and started a Freenet then an ISP.  Was making $50k in 2000. Then got involved in other things and my IT resume is 25 years old, but I've been keeping up generally.  Now it's all acronyms and \"Experience with this? Experience with that?\" and it's not even languages but library shit.  No IT jobs for early adopters who can hit the ground running in an afternoon and be up to speed in a week anymore. It'll have to get much worse. permalink parent award report block reply view 1 more comments... TD_Covfefe_Crusader 1 points 1 hour ago My last job as a hiring manager for software development and QA, the only resumes I ever received from recruiters were Indians. permalink parent award report block reply justinkayz 33 points 11 hours ago No deep state prosecutions, jobs going to foreigners & 600,000 Chinese spies. This is the plan to lose the midterms. permalink parent award report block reply mohel 13 points 8 hours ago Trump had too big of a lead to keep the 50/50 divide. He needed to fuck something up to maintain a healthy democracy. permalink parent award report block reply Hoshi 4 points 5 hours ago Republicans love to fuck themselves up when things go too well permalink parent award report block reply TrumpPl4yedU 1 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply SupFrens 45 points 12 hours ago I knew it. Trump is being dog-walked by India. They're not deporting any jeets. Trump filled the oval office with jeets a couple weeks ago. It sickens me. permalink award report block reply PiratePatriotParrot OP 33 points 11 hours ago not deporting any islam either permalink parent award report block reply rebuildingMyself 17 points 9 hours ago At best he'll deport them if they criticize the Chosen Ones. If they stick to hating and violence against Whitey they'll be fine permalink parent award report block reply mohel 9 points 8 hours ago whitey bad permalink parent award report block reply Diversity_Fire 29 points 10 hours ago The US military trains people for highly specialized roles in a few weeks to months.  We are talking about the most advanced fighter jets in the world. Large corporations hiring these H1B's are ALWAYS taking a job from an American.  Every single time.  There is NEVER a case where an American isn't smart enough to do a job within a short training period.  These companies COULD train their workers but prefer to pay foreigners less. permalink award report block reply DeportThemAllForever 11 points 7 hours ago Look at people around Trump who have his ear.  It’s a lot of guys who benefit from illegals or H#Bs. No one wants to hire Americans, they do want your money though.  Society without God, consumes itself in greed. permalink parent award report block reply Train_w_no_brakes 6 points 7 hours ago It’s also indentured servitude. The attrition is next to nothing for H1-Bs because they get deported if they don’t work. permalink parent award report block reply 45fan 4 points 6 hours ago Bingo. Employers want to have their cake and eat it to. They would train, but then you could move to another position at a competitor if your employer treats you poorly. Not so with H1B. It's effectively modern indentured servitude where the worker is wedded to the business. permalink parent award report block reply someguy7738 1 points 3 hours ago A good chunk of the time the Americans being replaced are forced to train their replacements. This whole thing is bullshit. permalink parent award report block reply MAG-n-KAG 24 points 8 hours ago Trump brokered the peace deal between India and Pakistan.  Then the next week announced we're taking in hundreds of thousands of H1B street shitters.  Coincidence? Thats the thing about all these peace deals he's brokering.  Peace is nice and all, but how's he getting all these countries to agree?  What is he offering?  Nothing comes free.  It seems like he's offering pieces of our ass to get all these deals done.  We the people, our country, our way of life, are the cards in his hands, and he's playing them, whether we consent or not. permalink award report block reply sun_wolf -6 points 7 hours ago I think there is more going on here and that it’s stupid the way people always want to jump to “Trump betrayed us” and “Trump hates America”. It’s like every time he’s proven himself, it’s never enough. For example, if foreign nations like China or India are sending spies into these programs, could the military or CIA have some way of flipping them into double agents? If anything like that was going on, it would defeat the purpose for a President to explain it publicly. permalink parent award report block reply BarrensChat 5 points 6 hours ago 2 more weeks, patriots are in control! permalink parent award report block reply TheDevilMonkey 1 points 3 hours ago You are a fucking mongoloid. permalink parent award report block reply TrumpPl4yedU 2 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply PatriotSkorzeny 21 points 7 hours ago I guess the midterms are written off. No third term. Dem 2028. It’s a shame. permalink award report block reply current_horror 13 points 6 hours ago It’s a cycle. Populist conservatives rise up, maybe win an election, and then the establishment neocons take the party back and run it into the ground. Then a leftist wins, the country sinks further into gay race communism, and the great replacement accelerates. We fall for the same shit every time. permalink parent award report block reply DeportThemAllForever 3 points 6 hours ago Somehow throughout all that crap, corporations and stock markets grow, because all these destructive policies are made to benefit them. permalink parent award report block reply Tellmeboutit2 17 points 12 hours ago 70% of postdocs aren't American. permalink award report block reply sleepinggiant 11 points 6 hours ago Dont forget this is his second attempt at this shit. He tried this bait and switch right after the election. permalink award report block reply dems_be_crazy 10 points 6 hours ago Easy way to kill H1B program without limitations or fines. For every H1B position a company hires, there must be an American citizen hired and trained for that position. Call their bluff. If the issue is that America doesn't have people qualified for the position, force them to use the \"qualified\" H1B labor to train them. Everybody gets what they want. Nobody can complain they don't have access to the labor they need. If it is truly a unique position that they cannot find local labor for, then give them the quick option and force them to bring that knowledge home. permalink award report block reply Nibba2 1 points 26 minutes ago The government allegedly already has this. My company doesn’t hire H1-B for my field. Not because they wouldn’t in a heartbeat, but because the government will not allow them to sponsor people from out of country. permalink parent award report block reply dems_be_crazy 1 points 8 minutes ago They do not have that. There's various reasons why a company cannot sponsor H-1B: job doesn't qualify, not a valid \"H-1B employer\", labor compliance issues and there is a cap. For those that can hire H-1B, there's no requirement to train. There is a requirement to show they can't fill the position with citizens. For this, they simply post the job to obscure websites with vague terms so nobody can find the position. permalink parent award report block reply Wexit-Delecto 5 points 5 hours ago Replacement immigration is NON NEGOTIABLE. You can't vote on this issue. permalink award report block reply Train_w_no_brakes 4 points 7 hours ago No one seems to give a shit about very good paying jobs getting stolen by foreigners under this programs. Everyone cry’s about illegal aliens stealing low paying jobs from Americans who, in many cases, are net negative tax payers even if the had said job. These foreigners are stealing low to high 6 figure jobs from Americans and Brokies, blinded by envy, don’t give a shit because they make half that. Sorry to break it to you, middle class pays the taxes, not you brokie dipshits. permalink award report block reply Nibba2 1 points 23 minutes ago You must not be a strong reader if you actually think this about H1-B. permalink parent award report block reply GoBigly 4 points 8 hours ago Trump has been corrupted since January 6th 2021. They found enough on him to own him and his family. Hence why his family have been awfully quiet this administration. Their plan is to split the base enough for the Dems to regain the house and senate next year. Leading to a dead 2 years and a for sure dem victory in 2028 permalink award report block reply sun_wolf -1 points 7 hours ago So then why did they try to assassinate him? permalink parent award report block reply TrumpPl4yedU 2 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply Gadsden -5 points 6 hours ago Bro, stfu. Dumbest take I've seen. Buncha low energy queers around here, lately. permalink parent award report block reply Trajano 3 points 5 hours ago Steven is right on this one. permalink award report block reply KeepMarxInTheGround 2 points 2 hours ago I'm kind of done. I'm praying JD Vance is screaming at the top of his lungs behind the scenes.\nThis is so disheartening. Gee, I can't understand why more people are aligning themselves with Nick Fuentes... (Sarcasm) permalink award report block reply Frix 2 points 4 hours ago Looking forward to the marxist take over in 2028. No chance they're going to \"get out the vote\" with so much f'n nonsense. permalink award report block reply TheMustacheBandit -8 points 13 hours ago Im looking forward to Vance. permalink award report block reply RealWildRanter 27 points 13 hours ago You mean the guy who got a H1B marriage? permalink parent award report block reply justinkayz 11 points 11 hours ago You mean the guy Peter Thiel created? permalink parent award report block reply booblitchutz 4 points 9 hours ago Trump has an H1B marriage, too. permalink parent award report block reply SteveRogers42 -1 points 7 hours ago Ultra hot European super models get a pass. permalink parent award report block reply Zhongda 6 points 13 hours ago Dingalingy dingalingy dinga da dinga dinga dingalingy Dingalingy dingalingy dinga da dinga dinga dingalingy Dingalingy dingalingy dinga da dinga dinga dingalingy permalink parent award report block reply PiratePatriotParrot OP 6 points 13 hours ago India is his 50% haha permalink parent award report block reply SteveRogers42 3 points 7 hours ago I’m looking forward to Julius Caesar. permalink parent award report block reply ReleasetheList 1 points 11 hours ago I'm starting to think I won't be voting for anyone associated with this Amrerica last, traitor administration. permalink parent award report block reply SimplyRedPills -12 points 9 hours ago Steven crowder is a grifter faggot permalink award report block reply gottarememberpasswor 10 points 7 hours ago True, but his interview is plain as day permalink parent award report block reply sun_wolf 3 points 7 hours ago He was an old school Never Trumper who wanted Cruz. permalink parent award report block reply maverick202 -1 points 6 hours ago This. The never Trumpers are going back to never Trumping. Nothing new here. There are a boatload of them started doing this within last week. Almost like they were ordered to. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago Because, after all, MAGA has always been pro-legal-replacement-immigration. permalink parent award report block reply dunkeaters -24 points 12 hours ago Terrible take from Crowder and the lemmings here. The total ignorance and lack of perspective displayed is why most politicians don't care what you think, and why should they since you can be manipulated in a single news cycle. Trump put a $100,000 fee for new H1B applications after Sept 21, 2025. No other politician would have done that, but go ahead and be ungrateful and ignorant. permalink award report block reply FaustyArchaeus 16 points 12 hours ago So a bad policy that might be better than the alternative. Fuck that permalink parent award report block reply dunkeaters 1 points 11 hours ago How is a $100,000 fee for the application a bad policy? permalink parent award report block reply SmallestShil 11 points 9 hours ago It means something wholly unwanted is now legal for a price. How much is America worth to you ? Would you sell it to India if they paid you enough? permalink parent award report block reply dunkeaters 1 points 10 minutes ago That's just naive. It's not \"selling America\", it's making hiring foreigners expensive so that companies don't do it just to undercut American wages. permalink parent award report block reply It_takes_10_years 5 points 7 hours ago Because that's a 1 time fee. Not recurring. So If I hire an Indian for 3 years at 86k instead of paying an American 120k it pays for itself. permalink parent award report block reply dunkeaters 1 points 10 minutes ago Ok, so it's a good policy, but you want more of it. permalink parent award report block reply view 1 more comments... CocaineNewsome 3 points 5 hours ago The fee is temporary and only starts in the next cycle. I think it also expires. permalink parent award report block reply possibletower -11 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink parent award report block reply SmallestShil 6 points 9 hours ago Fuck you retard. What generation are you from? The sellouts or the traitors?Theres Price controls everywhere. In what smoothbrain world is not getting assraped by corporations equal to socialism? permalink parent award report block reply dunkeaters 1 points 9 minutes ago You know this forum is a lost cause when comments praising price controls are getting upvoted. permalink parent award report block reply UncleSlayton 3 points 9 hours ago Anaconda is a faggot. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago They are the most libshit generation in history Which generation voted harder for Trump? You (a rabid pro Israel-poster, just a cohencidence I'm sure) are mad that Gen Z doesn't want to be replaced with second and third worlders. permalink parent award report block reply Diversity_Fire 8 points 10 hours ago What Trump should have done was made H1B's short term ....WHILE THEY TRAIN AMERICANS to do the work. permalink parent award report block reply jcd_007 7 points 12 hours ago I’m a big fan of the $100K fee. I think it’s something that Trump needs to take more credit for; right now there are disaffected young people who feel that they are being passed over for jobs in favor of foreigners, and that’s causing them to do insane things like voting for communists. Team Trump needs to stomp on the leftist lies these people are being fed with the truth of what is being done to put Americans first. permalink parent award report block reply dunkeaters 3 points 11 hours ago Same. It completely removes the incentive for companies to undercut American workers, and is only viable when the person is talented enough to justify the expense. Meanwhile we've had over 2 million jobs added for American born workers this year. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago It would completely remove the incentive if it were payable on every visa renewal. As a one-time fee, it can be paid for by hiring a jeet for $33k/year less than an American (which is fine, since undercutting American  workers is the whole entire point of the program). permalink parent award report block reply jcd_007 2 points 4 hours ago Yes, it absolutely needs to apply to renewals. permalink parent award report block reply dunkeaters 1 points 7 minutes ago Then acknowledge the progress and lobby for more. Instead we get braindead takes that Trump's \"as bad as it gets\" on H1B visas. The point of the program is that it makes American companies more competitive to be able to hire anyone. Tech companies are not like manufacturing, you can't tariff their imports and we would lose jobs if we forced companies to limit their workforce. It's a balance between staying attractive as the tech leader of the world and protecting American workers. Look at Canada's inability to hold onto their tech companies if you don't believe me. permalink parent award report block reply possibletower -11 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z. Retards like you are blaming Trump for Gen Z fags voting commie like they always do? 🤣🤣🤣 permalink parent award report block reply jcd_007 2 points 4 hours ago Stats say Gen Z men are becoming more conservative. I think the only retard here is you. permalink parent award report block reply current_horror 6 points 6 hours ago “You can destroy our nation, but you have to pay for the privilege.” You’re literally a traitor to America. permalink parent award report block reply\nfriarfox 75 points 13 hours ago I don't see how this fits into America first policy at all and it's going to cost him from voters watching their jobs handed to foreigners. permalink award report block reply PiratePatriotParrot OP 63 points 13 hours ago I literally watched my job go to foreign H1-bs haha permalink parent award report block reply Tellmeboutit2 33 points 12 hours ago Who the fuck down votes this permalink parent award report block reply mty_green_go 29 points 12 hours ago Jevvs & Eloids permalink parent award report block reply votedforthe45th -1 points 7 hours ago groyper slaves permalink parent award report block reply view 1 more comments... GEOTUS4POTUS -7 points 5 hours ago why'd you let your job get taken like a fuckin cuck? spez: all the downvotes, but nobody can answer like a man. permalink parent award report block reply TD_Covfefe_Crusader 2 points 1 hour ago I watched my entire career field (software development) go to H1-B. permalink parent award report block reply ValhallaBaboon -22 points 12 hours ago learn to code? permalink parent award report block reply dr_gonzo 14 points 7 hours ago No point in doing that now. I'm a senior developer with 20 years experience. I'm employed thankfully, but for the first time in my career I'm not being bombarded with recruiter emails. It's been about a month since I got one. I used to get 5-10 a day, along with 2-3 phone calls. No joke. It was like that for 18 or 19 years. So there's little point in trying to break into this field now. You'll only be competing against people with much more experience, not to mention AI. permalink parent award report block reply HocusLocus 7 points 6 hours ago I got problems too.  I was around for the expansion of Internet and started a Freenet then an ISP.  Was making $50k in 2000. Then got involved in other things and my IT resume is 25 years old, but I've been keeping up generally.  Now it's all acronyms and \"Experience with this? Experience with that?\" and it's not even languages but library shit.  No IT jobs for early adopters who can hit the ground running in an afternoon and be up to speed in a week anymore. It'll have to get much worse. permalink parent award report block reply view 1 more comments... TD_Covfefe_Crusader 1 points 1 hour ago My last job as a hiring manager for software development and QA, the only resumes I ever received from recruiters were Indians. permalink parent award report block reply justinkayz 33 points 11 hours ago No deep state prosecutions, jobs going to foreigners & 600,000 Chinese spies. This is the plan to lose the midterms. permalink parent award report block reply mohel 13 points 8 hours ago Trump had too big of a lead to keep the 50/50 divide. He needed to fuck something up to maintain a healthy democracy. permalink parent award report block reply Hoshi 4 points 5 hours ago Republicans love to fuck themselves up when things go too well permalink parent award report block reply TrumpPl4yedU 1 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nPiratePatriotParrot OP 63 points 13 hours ago I literally watched my job go to foreign H1-bs haha permalink parent award report block reply Tellmeboutit2 33 points 12 hours ago Who the fuck down votes this permalink parent award report block reply mty_green_go 29 points 12 hours ago Jevvs & Eloids permalink parent award report block reply votedforthe45th -1 points 7 hours ago groyper slaves permalink parent award report block reply view 1 more comments... GEOTUS4POTUS -7 points 5 hours ago why'd you let your job get taken like a fuckin cuck? spez: all the downvotes, but nobody can answer like a man. permalink parent award report block reply TD_Covfefe_Crusader 2 points 1 hour ago I watched my entire career field (software development) go to H1-B. permalink parent award report block reply ValhallaBaboon -22 points 12 hours ago learn to code? permalink parent award report block reply dr_gonzo 14 points 7 hours ago No point in doing that now. I'm a senior developer with 20 years experience. I'm employed thankfully, but for the first time in my career I'm not being bombarded with recruiter emails. It's been about a month since I got one. I used to get 5-10 a day, along with 2-3 phone calls. No joke. It was like that for 18 or 19 years. So there's little point in trying to break into this field now. You'll only be competing against people with much more experience, not to mention AI. permalink parent award report block reply HocusLocus 7 points 6 hours ago I got problems too.  I was around for the expansion of Internet and started a Freenet then an ISP.  Was making $50k in 2000. Then got involved in other things and my IT resume is 25 years old, but I've been keeping up generally.  Now it's all acronyms and \"Experience with this? Experience with that?\" and it's not even languages but library shit.  No IT jobs for early adopters who can hit the ground running in an afternoon and be up to speed in a week anymore. It'll have to get much worse. permalink parent award report block reply view 1 more comments... TD_Covfefe_Crusader 1 points 1 hour ago My last job as a hiring manager for software development and QA, the only resumes I ever received from recruiters were Indians. permalink parent award report block reply\nTellmeboutit2 33 points 12 hours ago Who the fuck down votes this permalink parent award report block reply mty_green_go 29 points 12 hours ago Jevvs & Eloids permalink parent award report block reply votedforthe45th -1 points 7 hours ago groyper slaves permalink parent award report block reply view 1 more comments... GEOTUS4POTUS -7 points 5 hours ago why'd you let your job get taken like a fuckin cuck? spez: all the downvotes, but nobody can answer like a man. permalink parent award report block reply\nmty_green_go 29 points 12 hours ago Jevvs & Eloids permalink parent award report block reply votedforthe45th -1 points 7 hours ago groyper slaves permalink parent award report block reply view 1 more comments...\nvotedforthe45th -1 points 7 hours ago groyper slaves permalink parent award report block reply view 1 more comments...\nGEOTUS4POTUS -7 points 5 hours ago why'd you let your job get taken like a fuckin cuck? spez: all the downvotes, but nobody can answer like a man. permalink parent award report block reply\nTD_Covfefe_Crusader 2 points 1 hour ago I watched my entire career field (software development) go to H1-B. permalink parent award report block reply\nValhallaBaboon -22 points 12 hours ago learn to code? permalink parent award report block reply dr_gonzo 14 points 7 hours ago No point in doing that now. I'm a senior developer with 20 years experience. I'm employed thankfully, but for the first time in my career I'm not being bombarded with recruiter emails. It's been about a month since I got one. I used to get 5-10 a day, along with 2-3 phone calls. No joke. It was like that for 18 or 19 years. So there's little point in trying to break into this field now. You'll only be competing against people with much more experience, not to mention AI. permalink parent award report block reply HocusLocus 7 points 6 hours ago I got problems too.  I was around for the expansion of Internet and started a Freenet then an ISP.  Was making $50k in 2000. Then got involved in other things and my IT resume is 25 years old, but I've been keeping up generally.  Now it's all acronyms and \"Experience with this? Experience with that?\" and it's not even languages but library shit.  No IT jobs for early adopters who can hit the ground running in an afternoon and be up to speed in a week anymore. It'll have to get much worse. permalink parent award report block reply view 1 more comments... TD_Covfefe_Crusader 1 points 1 hour ago My last job as a hiring manager for software development and QA, the only resumes I ever received from recruiters were Indians. permalink parent award report block reply\ndr_gonzo 14 points 7 hours ago No point in doing that now. I'm a senior developer with 20 years experience. I'm employed thankfully, but for the first time in my career I'm not being bombarded with recruiter emails. It's been about a month since I got one. I used to get 5-10 a day, along with 2-3 phone calls. No joke. It was like that for 18 or 19 years. So there's little point in trying to break into this field now. You'll only be competing against people with much more experience, not to mention AI. permalink parent award report block reply HocusLocus 7 points 6 hours ago I got problems too.  I was around for the expansion of Internet and started a Freenet then an ISP.  Was making $50k in 2000. Then got involved in other things and my IT resume is 25 years old, but I've been keeping up generally.  Now it's all acronyms and \"Experience with this? Experience with that?\" and it's not even languages but library shit.  No IT jobs for early adopters who can hit the ground running in an afternoon and be up to speed in a week anymore. It'll have to get much worse. permalink parent award report block reply view 1 more comments... TD_Covfefe_Crusader 1 points 1 hour ago My last job as a hiring manager for software development and QA, the only resumes I ever received from recruiters were Indians. permalink parent award report block reply\nHocusLocus 7 points 6 hours ago I got problems too.  I was around for the expansion of Internet and started a Freenet then an ISP.  Was making $50k in 2000. Then got involved in other things and my IT resume is 25 years old, but I've been keeping up generally.  Now it's all acronyms and \"Experience with this? Experience with that?\" and it's not even languages but library shit.  No IT jobs for early adopters who can hit the ground running in an afternoon and be up to speed in a week anymore. It'll have to get much worse. permalink parent award report block reply view 1 more comments...\nTD_Covfefe_Crusader 1 points 1 hour ago My last job as a hiring manager for software development and QA, the only resumes I ever received from recruiters were Indians. permalink parent award report block reply\njustinkayz 33 points 11 hours ago No deep state prosecutions, jobs going to foreigners & 600,000 Chinese spies. This is the plan to lose the midterms. permalink parent award report block reply mohel 13 points 8 hours ago Trump had too big of a lead to keep the 50/50 divide. He needed to fuck something up to maintain a healthy democracy. permalink parent award report block reply Hoshi 4 points 5 hours ago Republicans love to fuck themselves up when things go too well permalink parent award report block reply\nmohel 13 points 8 hours ago Trump had too big of a lead to keep the 50/50 divide. He needed to fuck something up to maintain a healthy democracy. permalink parent award report block reply Hoshi 4 points 5 hours ago Republicans love to fuck themselves up when things go too well permalink parent award report block reply\nHoshi 4 points 5 hours ago Republicans love to fuck themselves up when things go too well permalink parent award report block reply\nTrumpPl4yedU 1 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nSupFrens 45 points 12 hours ago I knew it. Trump is being dog-walked by India. They're not deporting any jeets. Trump filled the oval office with jeets a couple weeks ago. It sickens me. permalink award report block reply PiratePatriotParrot OP 33 points 11 hours ago not deporting any islam either permalink parent award report block reply rebuildingMyself 17 points 9 hours ago At best he'll deport them if they criticize the Chosen Ones. If they stick to hating and violence against Whitey they'll be fine permalink parent award report block reply mohel 9 points 8 hours ago whitey bad permalink parent award report block reply\nPiratePatriotParrot OP 33 points 11 hours ago not deporting any islam either permalink parent award report block reply rebuildingMyself 17 points 9 hours ago At best he'll deport them if they criticize the Chosen Ones. If they stick to hating and violence against Whitey they'll be fine permalink parent award report block reply mohel 9 points 8 hours ago whitey bad permalink parent award report block reply\nrebuildingMyself 17 points 9 hours ago At best he'll deport them if they criticize the Chosen Ones. If they stick to hating and violence against Whitey they'll be fine permalink parent award report block reply mohel 9 points 8 hours ago whitey bad permalink parent award report block reply\nmohel 9 points 8 hours ago whitey bad permalink parent award report block reply\nDiversity_Fire 29 points 10 hours ago The US military trains people for highly specialized roles in a few weeks to months.  We are talking about the most advanced fighter jets in the world. Large corporations hiring these H1B's are ALWAYS taking a job from an American.  Every single time.  There is NEVER a case where an American isn't smart enough to do a job within a short training period.  These companies COULD train their workers but prefer to pay foreigners less. permalink award report block reply DeportThemAllForever 11 points 7 hours ago Look at people around Trump who have his ear.  It’s a lot of guys who benefit from illegals or H#Bs. No one wants to hire Americans, they do want your money though.  Society without God, consumes itself in greed. permalink parent award report block reply Train_w_no_brakes 6 points 7 hours ago It’s also indentured servitude. The attrition is next to nothing for H1-Bs because they get deported if they don’t work. permalink parent award report block reply 45fan 4 points 6 hours ago Bingo. Employers want to have their cake and eat it to. They would train, but then you could move to another position at a competitor if your employer treats you poorly. Not so with H1B. It's effectively modern indentured servitude where the worker is wedded to the business. permalink parent award report block reply someguy7738 1 points 3 hours ago A good chunk of the time the Americans being replaced are forced to train their replacements. This whole thing is bullshit. permalink parent award report block reply\nDeportThemAllForever 11 points 7 hours ago Look at people around Trump who have his ear.  It’s a lot of guys who benefit from illegals or H#Bs. No one wants to hire Americans, they do want your money though.  Society without God, consumes itself in greed. permalink parent award report block reply\nTrain_w_no_brakes 6 points 7 hours ago It’s also indentured servitude. The attrition is next to nothing for H1-Bs because they get deported if they don’t work. permalink parent award report block reply 45fan 4 points 6 hours ago Bingo. Employers want to have their cake and eat it to. They would train, but then you could move to another position at a competitor if your employer treats you poorly. Not so with H1B. It's effectively modern indentured servitude where the worker is wedded to the business. permalink parent award report block reply\n45fan 4 points 6 hours ago Bingo. Employers want to have their cake and eat it to. They would train, but then you could move to another position at a competitor if your employer treats you poorly. Not so with H1B. It's effectively modern indentured servitude where the worker is wedded to the business. permalink parent award report block reply\nsomeguy7738 1 points 3 hours ago A good chunk of the time the Americans being replaced are forced to train their replacements. This whole thing is bullshit. permalink parent award report block reply\nMAG-n-KAG 24 points 8 hours ago Trump brokered the peace deal between India and Pakistan.  Then the next week announced we're taking in hundreds of thousands of H1B street shitters.  Coincidence? Thats the thing about all these peace deals he's brokering.  Peace is nice and all, but how's he getting all these countries to agree?  What is he offering?  Nothing comes free.  It seems like he's offering pieces of our ass to get all these deals done.  We the people, our country, our way of life, are the cards in his hands, and he's playing them, whether we consent or not. permalink award report block reply sun_wolf -6 points 7 hours ago I think there is more going on here and that it’s stupid the way people always want to jump to “Trump betrayed us” and “Trump hates America”. It’s like every time he’s proven himself, it’s never enough. For example, if foreign nations like China or India are sending spies into these programs, could the military or CIA have some way of flipping them into double agents? If anything like that was going on, it would defeat the purpose for a President to explain it publicly. permalink parent award report block reply BarrensChat 5 points 6 hours ago 2 more weeks, patriots are in control! permalink parent award report block reply TheDevilMonkey 1 points 3 hours ago You are a fucking mongoloid. permalink parent award report block reply TrumpPl4yedU 2 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nsun_wolf -6 points 7 hours ago I think there is more going on here and that it’s stupid the way people always want to jump to “Trump betrayed us” and “Trump hates America”. It’s like every time he’s proven himself, it’s never enough. For example, if foreign nations like China or India are sending spies into these programs, could the military or CIA have some way of flipping them into double agents? If anything like that was going on, it would defeat the purpose for a President to explain it publicly. permalink parent award report block reply BarrensChat 5 points 6 hours ago 2 more weeks, patriots are in control! permalink parent award report block reply TheDevilMonkey 1 points 3 hours ago You are a fucking mongoloid. permalink parent award report block reply TrumpPl4yedU 2 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nBarrensChat 5 points 6 hours ago 2 more weeks, patriots are in control! permalink parent award report block reply\nTheDevilMonkey 1 points 3 hours ago You are a fucking mongoloid. permalink parent award report block reply\nTrumpPl4yedU 2 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nPatriotSkorzeny 21 points 7 hours ago I guess the midterms are written off. No third term. Dem 2028. It’s a shame. permalink award report block reply current_horror 13 points 6 hours ago It’s a cycle. Populist conservatives rise up, maybe win an election, and then the establishment neocons take the party back and run it into the ground. Then a leftist wins, the country sinks further into gay race communism, and the great replacement accelerates. We fall for the same shit every time. permalink parent award report block reply DeportThemAllForever 3 points 6 hours ago Somehow throughout all that crap, corporations and stock markets grow, because all these destructive policies are made to benefit them. permalink parent award report block reply\ncurrent_horror 13 points 6 hours ago It’s a cycle. Populist conservatives rise up, maybe win an election, and then the establishment neocons take the party back and run it into the ground. Then a leftist wins, the country sinks further into gay race communism, and the great replacement accelerates. We fall for the same shit every time. permalink parent award report block reply DeportThemAllForever 3 points 6 hours ago Somehow throughout all that crap, corporations and stock markets grow, because all these destructive policies are made to benefit them. permalink parent award report block reply\nDeportThemAllForever 3 points 6 hours ago Somehow throughout all that crap, corporations and stock markets grow, because all these destructive policies are made to benefit them. permalink parent award report block reply\nTellmeboutit2 17 points 12 hours ago 70% of postdocs aren't American. permalink award report block reply\nsleepinggiant 11 points 6 hours ago Dont forget this is his second attempt at this shit. He tried this bait and switch right after the election. permalink award report block reply\ndems_be_crazy 10 points 6 hours ago Easy way to kill H1B program without limitations or fines. For every H1B position a company hires, there must be an American citizen hired and trained for that position. Call their bluff. If the issue is that America doesn't have people qualified for the position, force them to use the \"qualified\" H1B labor to train them. Everybody gets what they want. Nobody can complain they don't have access to the labor they need. If it is truly a unique position that they cannot find local labor for, then give them the quick option and force them to bring that knowledge home. permalink award report block reply Nibba2 1 points 26 minutes ago The government allegedly already has this. My company doesn’t hire H1-B for my field. Not because they wouldn’t in a heartbeat, but because the government will not allow them to sponsor people from out of country. permalink parent award report block reply dems_be_crazy 1 points 8 minutes ago They do not have that. There's various reasons why a company cannot sponsor H-1B: job doesn't qualify, not a valid \"H-1B employer\", labor compliance issues and there is a cap. For those that can hire H-1B, there's no requirement to train. There is a requirement to show they can't fill the position with citizens. For this, they simply post the job to obscure websites with vague terms so nobody can find the position. permalink parent award report block reply\nNibba2 1 points 26 minutes ago The government allegedly already has this. My company doesn’t hire H1-B for my field. Not because they wouldn’t in a heartbeat, but because the government will not allow them to sponsor people from out of country. permalink parent award report block reply dems_be_crazy 1 points 8 minutes ago They do not have that. There's various reasons why a company cannot sponsor H-1B: job doesn't qualify, not a valid \"H-1B employer\", labor compliance issues and there is a cap. For those that can hire H-1B, there's no requirement to train. There is a requirement to show they can't fill the position with citizens. For this, they simply post the job to obscure websites with vague terms so nobody can find the position. permalink parent award report block reply\ndems_be_crazy 1 points 8 minutes ago They do not have that. There's various reasons why a company cannot sponsor H-1B: job doesn't qualify, not a valid \"H-1B employer\", labor compliance issues and there is a cap. For those that can hire H-1B, there's no requirement to train. There is a requirement to show they can't fill the position with citizens. For this, they simply post the job to obscure websites with vague terms so nobody can find the position. permalink parent award report block reply\nWexit-Delecto 5 points 5 hours ago Replacement immigration is NON NEGOTIABLE. You can't vote on this issue. permalink award report block reply\nTrain_w_no_brakes 4 points 7 hours ago No one seems to give a shit about very good paying jobs getting stolen by foreigners under this programs. Everyone cry’s about illegal aliens stealing low paying jobs from Americans who, in many cases, are net negative tax payers even if the had said job. These foreigners are stealing low to high 6 figure jobs from Americans and Brokies, blinded by envy, don’t give a shit because they make half that. Sorry to break it to you, middle class pays the taxes, not you brokie dipshits. permalink award report block reply Nibba2 1 points 23 minutes ago You must not be a strong reader if you actually think this about H1-B. permalink parent award report block reply\nNibba2 1 points 23 minutes ago You must not be a strong reader if you actually think this about H1-B. permalink parent award report block reply\nGoBigly 4 points 8 hours ago Trump has been corrupted since January 6th 2021. They found enough on him to own him and his family. Hence why his family have been awfully quiet this administration. Their plan is to split the base enough for the Dems to regain the house and senate next year. Leading to a dead 2 years and a for sure dem victory in 2028 permalink award report block reply sun_wolf -1 points 7 hours ago So then why did they try to assassinate him? permalink parent award report block reply TrumpPl4yedU 2 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply Gadsden -5 points 6 hours ago Bro, stfu. Dumbest take I've seen. Buncha low energy queers around here, lately. permalink parent award report block reply\nsun_wolf -1 points 7 hours ago So then why did they try to assassinate him? permalink parent award report block reply TrumpPl4yedU 2 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpPl4yedU 2 points 7 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nGadsden -5 points 6 hours ago Bro, stfu. Dumbest take I've seen. Buncha low energy queers around here, lately. permalink parent award report block reply\nTrajano 3 points 5 hours ago Steven is right on this one. permalink award report block reply\nKeepMarxInTheGround 2 points 2 hours ago I'm kind of done. I'm praying JD Vance is screaming at the top of his lungs behind the scenes.\nThis is so disheartening. Gee, I can't understand why more people are aligning themselves with Nick Fuentes... (Sarcasm) permalink award report block reply\nFrix 2 points 4 hours ago Looking forward to the marxist take over in 2028. No chance they're going to \"get out the vote\" with so much f'n nonsense. permalink award report block reply\nTheMustacheBandit -8 points 13 hours ago Im looking forward to Vance. permalink award report block reply RealWildRanter 27 points 13 hours ago You mean the guy who got a H1B marriage? permalink parent award report block reply justinkayz 11 points 11 hours ago You mean the guy Peter Thiel created? permalink parent award report block reply booblitchutz 4 points 9 hours ago Trump has an H1B marriage, too. permalink parent award report block reply SteveRogers42 -1 points 7 hours ago Ultra hot European super models get a pass. permalink parent award report block reply Zhongda 6 points 13 hours ago Dingalingy dingalingy dinga da dinga dinga dingalingy Dingalingy dingalingy dinga da dinga dinga dingalingy Dingalingy dingalingy dinga da dinga dinga dingalingy permalink parent award report block reply PiratePatriotParrot OP 6 points 13 hours ago India is his 50% haha permalink parent award report block reply SteveRogers42 3 points 7 hours ago I’m looking forward to Julius Caesar. permalink parent award report block reply ReleasetheList 1 points 11 hours ago I'm starting to think I won't be voting for anyone associated with this Amrerica last, traitor administration. permalink parent award report block reply\nRealWildRanter 27 points 13 hours ago You mean the guy who got a H1B marriage? permalink parent award report block reply justinkayz 11 points 11 hours ago You mean the guy Peter Thiel created? permalink parent award report block reply booblitchutz 4 points 9 hours ago Trump has an H1B marriage, too. permalink parent award report block reply SteveRogers42 -1 points 7 hours ago Ultra hot European super models get a pass. permalink parent award report block reply\njustinkayz 11 points 11 hours ago You mean the guy Peter Thiel created? permalink parent award report block reply\nbooblitchutz 4 points 9 hours ago Trump has an H1B marriage, too. permalink parent award report block reply SteveRogers42 -1 points 7 hours ago Ultra hot European super models get a pass. permalink parent award report block reply\nSteveRogers42 -1 points 7 hours ago Ultra hot European super models get a pass. permalink parent award report block reply\nZhongda 6 points 13 hours ago Dingalingy dingalingy dinga da dinga dinga dingalingy Dingalingy dingalingy dinga da dinga dinga dingalingy Dingalingy dingalingy dinga da dinga dinga dingalingy permalink parent award report block reply\nPiratePatriotParrot OP 6 points 13 hours ago India is his 50% haha permalink parent award report block reply\nSteveRogers42 3 points 7 hours ago I’m looking forward to Julius Caesar. permalink parent award report block reply\nReleasetheList 1 points 11 hours ago I'm starting to think I won't be voting for anyone associated with this Amrerica last, traitor administration. permalink parent award report block reply\nSimplyRedPills -12 points 9 hours ago Steven crowder is a grifter faggot permalink award report block reply gottarememberpasswor 10 points 7 hours ago True, but his interview is plain as day permalink parent award report block reply sun_wolf 3 points 7 hours ago He was an old school Never Trumper who wanted Cruz. permalink parent award report block reply maverick202 -1 points 6 hours ago This. The never Trumpers are going back to never Trumping. Nothing new here. There are a boatload of them started doing this within last week. Almost like they were ordered to. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago Because, after all, MAGA has always been pro-legal-replacement-immigration. permalink parent award report block reply\ngottarememberpasswor 10 points 7 hours ago True, but his interview is plain as day permalink parent award report block reply\nsun_wolf 3 points 7 hours ago He was an old school Never Trumper who wanted Cruz. permalink parent award report block reply maverick202 -1 points 6 hours ago This. The never Trumpers are going back to never Trumping. Nothing new here. There are a boatload of them started doing this within last week. Almost like they were ordered to. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago Because, after all, MAGA has always been pro-legal-replacement-immigration. permalink parent award report block reply\nmaverick202 -1 points 6 hours ago This. The never Trumpers are going back to never Trumping. Nothing new here. There are a boatload of them started doing this within last week. Almost like they were ordered to. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago Because, after all, MAGA has always been pro-legal-replacement-immigration. permalink parent award report block reply\nWexit-Delecto 2 points 5 hours ago Because, after all, MAGA has always been pro-legal-replacement-immigration. permalink parent award report block reply\ndunkeaters -24 points 12 hours ago Terrible take from Crowder and the lemmings here. The total ignorance and lack of perspective displayed is why most politicians don't care what you think, and why should they since you can be manipulated in a single news cycle. Trump put a $100,000 fee for new H1B applications after Sept 21, 2025. No other politician would have done that, but go ahead and be ungrateful and ignorant. permalink award report block reply FaustyArchaeus 16 points 12 hours ago So a bad policy that might be better than the alternative. Fuck that permalink parent award report block reply dunkeaters 1 points 11 hours ago How is a $100,000 fee for the application a bad policy? permalink parent award report block reply SmallestShil 11 points 9 hours ago It means something wholly unwanted is now legal for a price. How much is America worth to you ? Would you sell it to India if they paid you enough? permalink parent award report block reply dunkeaters 1 points 10 minutes ago That's just naive. It's not \"selling America\", it's making hiring foreigners expensive so that companies don't do it just to undercut American wages. permalink parent award report block reply It_takes_10_years 5 points 7 hours ago Because that's a 1 time fee. Not recurring. So If I hire an Indian for 3 years at 86k instead of paying an American 120k it pays for itself. permalink parent award report block reply dunkeaters 1 points 10 minutes ago Ok, so it's a good policy, but you want more of it. permalink parent award report block reply view 1 more comments... CocaineNewsome 3 points 5 hours ago The fee is temporary and only starts in the next cycle. I think it also expires. permalink parent award report block reply possibletower -11 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink parent award report block reply SmallestShil 6 points 9 hours ago Fuck you retard. What generation are you from? The sellouts or the traitors?Theres Price controls everywhere. In what smoothbrain world is not getting assraped by corporations equal to socialism? permalink parent award report block reply dunkeaters 1 points 9 minutes ago You know this forum is a lost cause when comments praising price controls are getting upvoted. permalink parent award report block reply UncleSlayton 3 points 9 hours ago Anaconda is a faggot. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago They are the most libshit generation in history Which generation voted harder for Trump? You (a rabid pro Israel-poster, just a cohencidence I'm sure) are mad that Gen Z doesn't want to be replaced with second and third worlders. permalink parent award report block reply Diversity_Fire 8 points 10 hours ago What Trump should have done was made H1B's short term ....WHILE THEY TRAIN AMERICANS to do the work. permalink parent award report block reply jcd_007 7 points 12 hours ago I’m a big fan of the $100K fee. I think it’s something that Trump needs to take more credit for; right now there are disaffected young people who feel that they are being passed over for jobs in favor of foreigners, and that’s causing them to do insane things like voting for communists. Team Trump needs to stomp on the leftist lies these people are being fed with the truth of what is being done to put Americans first. permalink parent award report block reply dunkeaters 3 points 11 hours ago Same. It completely removes the incentive for companies to undercut American workers, and is only viable when the person is talented enough to justify the expense. Meanwhile we've had over 2 million jobs added for American born workers this year. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago It would completely remove the incentive if it were payable on every visa renewal. As a one-time fee, it can be paid for by hiring a jeet for $33k/year less than an American (which is fine, since undercutting American  workers is the whole entire point of the program). permalink parent award report block reply jcd_007 2 points 4 hours ago Yes, it absolutely needs to apply to renewals. permalink parent award report block reply dunkeaters 1 points 7 minutes ago Then acknowledge the progress and lobby for more. Instead we get braindead takes that Trump's \"as bad as it gets\" on H1B visas. The point of the program is that it makes American companies more competitive to be able to hire anyone. Tech companies are not like manufacturing, you can't tariff their imports and we would lose jobs if we forced companies to limit their workforce. It's a balance between staying attractive as the tech leader of the world and protecting American workers. Look at Canada's inability to hold onto their tech companies if you don't believe me. permalink parent award report block reply possibletower -11 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z. Retards like you are blaming Trump for Gen Z fags voting commie like they always do? 🤣🤣🤣 permalink parent award report block reply jcd_007 2 points 4 hours ago Stats say Gen Z men are becoming more conservative. I think the only retard here is you. permalink parent award report block reply current_horror 6 points 6 hours ago “You can destroy our nation, but you have to pay for the privilege.” You’re literally a traitor to America. permalink parent award report block reply\nFaustyArchaeus 16 points 12 hours ago So a bad policy that might be better than the alternative. Fuck that permalink parent award report block reply dunkeaters 1 points 11 hours ago How is a $100,000 fee for the application a bad policy? permalink parent award report block reply SmallestShil 11 points 9 hours ago It means something wholly unwanted is now legal for a price. How much is America worth to you ? Would you sell it to India if they paid you enough? permalink parent award report block reply dunkeaters 1 points 10 minutes ago That's just naive. It's not \"selling America\", it's making hiring foreigners expensive so that companies don't do it just to undercut American wages. permalink parent award report block reply It_takes_10_years 5 points 7 hours ago Because that's a 1 time fee. Not recurring. So If I hire an Indian for 3 years at 86k instead of paying an American 120k it pays for itself. permalink parent award report block reply dunkeaters 1 points 10 minutes ago Ok, so it's a good policy, but you want more of it. permalink parent award report block reply view 1 more comments... CocaineNewsome 3 points 5 hours ago The fee is temporary and only starts in the next cycle. I think it also expires. permalink parent award report block reply possibletower -11 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink parent award report block reply SmallestShil 6 points 9 hours ago Fuck you retard. What generation are you from? The sellouts or the traitors?Theres Price controls everywhere. In what smoothbrain world is not getting assraped by corporations equal to socialism? permalink parent award report block reply dunkeaters 1 points 9 minutes ago You know this forum is a lost cause when comments praising price controls are getting upvoted. permalink parent award report block reply UncleSlayton 3 points 9 hours ago Anaconda is a faggot. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago They are the most libshit generation in history Which generation voted harder for Trump? You (a rabid pro Israel-poster, just a cohencidence I'm sure) are mad that Gen Z doesn't want to be replaced with second and third worlders. permalink parent award report block reply\ndunkeaters 1 points 11 hours ago How is a $100,000 fee for the application a bad policy? permalink parent award report block reply SmallestShil 11 points 9 hours ago It means something wholly unwanted is now legal for a price. How much is America worth to you ? Would you sell it to India if they paid you enough? permalink parent award report block reply dunkeaters 1 points 10 minutes ago That's just naive. It's not \"selling America\", it's making hiring foreigners expensive so that companies don't do it just to undercut American wages. permalink parent award report block reply It_takes_10_years 5 points 7 hours ago Because that's a 1 time fee. Not recurring. So If I hire an Indian for 3 years at 86k instead of paying an American 120k it pays for itself. permalink parent award report block reply dunkeaters 1 points 10 minutes ago Ok, so it's a good policy, but you want more of it. permalink parent award report block reply view 1 more comments... CocaineNewsome 3 points 5 hours ago The fee is temporary and only starts in the next cycle. I think it also expires. permalink parent award report block reply\nSmallestShil 11 points 9 hours ago It means something wholly unwanted is now legal for a price. How much is America worth to you ? Would you sell it to India if they paid you enough? permalink parent award report block reply dunkeaters 1 points 10 minutes ago That's just naive. It's not \"selling America\", it's making hiring foreigners expensive so that companies don't do it just to undercut American wages. permalink parent award report block reply\ndunkeaters 1 points 10 minutes ago That's just naive. It's not \"selling America\", it's making hiring foreigners expensive so that companies don't do it just to undercut American wages. permalink parent award report block reply\nIt_takes_10_years 5 points 7 hours ago Because that's a 1 time fee. Not recurring. So If I hire an Indian for 3 years at 86k instead of paying an American 120k it pays for itself. permalink parent award report block reply dunkeaters 1 points 10 minutes ago Ok, so it's a good policy, but you want more of it. permalink parent award report block reply view 1 more comments...\ndunkeaters 1 points 10 minutes ago Ok, so it's a good policy, but you want more of it. permalink parent award report block reply view 1 more comments...\nCocaineNewsome 3 points 5 hours ago The fee is temporary and only starts in the next cycle. I think it also expires. permalink parent award report block reply\npossibletower -11 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink parent award report block reply SmallestShil 6 points 9 hours ago Fuck you retard. What generation are you from? The sellouts or the traitors?Theres Price controls everywhere. In what smoothbrain world is not getting assraped by corporations equal to socialism? permalink parent award report block reply dunkeaters 1 points 9 minutes ago You know this forum is a lost cause when comments praising price controls are getting upvoted. permalink parent award report block reply UncleSlayton 3 points 9 hours ago Anaconda is a faggot. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago They are the most libshit generation in history Which generation voted harder for Trump? You (a rabid pro Israel-poster, just a cohencidence I'm sure) are mad that Gen Z doesn't want to be replaced with second and third worlders. permalink parent award report block reply\nSmallestShil 6 points 9 hours ago Fuck you retard. What generation are you from? The sellouts or the traitors?Theres Price controls everywhere. In what smoothbrain world is not getting assraped by corporations equal to socialism? permalink parent award report block reply dunkeaters 1 points 9 minutes ago You know this forum is a lost cause when comments praising price controls are getting upvoted. permalink parent award report block reply\ndunkeaters 1 points 9 minutes ago You know this forum is a lost cause when comments praising price controls are getting upvoted. permalink parent award report block reply\nUncleSlayton 3 points 9 hours ago Anaconda is a faggot. permalink parent award report block reply\nWexit-Delecto 2 points 5 hours ago They are the most libshit generation in history Which generation voted harder for Trump? You (a rabid pro Israel-poster, just a cohencidence I'm sure) are mad that Gen Z doesn't want to be replaced with second and third worlders. permalink parent award report block reply\nDiversity_Fire 8 points 10 hours ago What Trump should have done was made H1B's short term ....WHILE THEY TRAIN AMERICANS to do the work. permalink parent award report block reply\njcd_007 7 points 12 hours ago I’m a big fan of the $100K fee. I think it’s something that Trump needs to take more credit for; right now there are disaffected young people who feel that they are being passed over for jobs in favor of foreigners, and that’s causing them to do insane things like voting for communists. Team Trump needs to stomp on the leftist lies these people are being fed with the truth of what is being done to put Americans first. permalink parent award report block reply dunkeaters 3 points 11 hours ago Same. It completely removes the incentive for companies to undercut American workers, and is only viable when the person is talented enough to justify the expense. Meanwhile we've had over 2 million jobs added for American born workers this year. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago It would completely remove the incentive if it were payable on every visa renewal. As a one-time fee, it can be paid for by hiring a jeet for $33k/year less than an American (which is fine, since undercutting American  workers is the whole entire point of the program). permalink parent award report block reply jcd_007 2 points 4 hours ago Yes, it absolutely needs to apply to renewals. permalink parent award report block reply dunkeaters 1 points 7 minutes ago Then acknowledge the progress and lobby for more. Instead we get braindead takes that Trump's \"as bad as it gets\" on H1B visas. The point of the program is that it makes American companies more competitive to be able to hire anyone. Tech companies are not like manufacturing, you can't tariff their imports and we would lose jobs if we forced companies to limit their workforce. It's a balance between staying attractive as the tech leader of the world and protecting American workers. Look at Canada's inability to hold onto their tech companies if you don't believe me. permalink parent award report block reply possibletower -11 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z. Retards like you are blaming Trump for Gen Z fags voting commie like they always do? 🤣🤣🤣 permalink parent award report block reply jcd_007 2 points 4 hours ago Stats say Gen Z men are becoming more conservative. I think the only retard here is you. permalink parent award report block reply\ndunkeaters 3 points 11 hours ago Same. It completely removes the incentive for companies to undercut American workers, and is only viable when the person is talented enough to justify the expense. Meanwhile we've had over 2 million jobs added for American born workers this year. permalink parent award report block reply Wexit-Delecto 2 points 5 hours ago It would completely remove the incentive if it were payable on every visa renewal. As a one-time fee, it can be paid for by hiring a jeet for $33k/year less than an American (which is fine, since undercutting American  workers is the whole entire point of the program). permalink parent award report block reply jcd_007 2 points 4 hours ago Yes, it absolutely needs to apply to renewals. permalink parent award report block reply dunkeaters 1 points 7 minutes ago Then acknowledge the progress and lobby for more. Instead we get braindead takes that Trump's \"as bad as it gets\" on H1B visas. The point of the program is that it makes American companies more competitive to be able to hire anyone. Tech companies are not like manufacturing, you can't tariff their imports and we would lose jobs if we forced companies to limit their workforce. It's a balance between staying attractive as the tech leader of the world and protecting American workers. Look at Canada's inability to hold onto their tech companies if you don't believe me. permalink parent award report block reply\nWexit-Delecto 2 points 5 hours ago It would completely remove the incentive if it were payable on every visa renewal. As a one-time fee, it can be paid for by hiring a jeet for $33k/year less than an American (which is fine, since undercutting American  workers is the whole entire point of the program). permalink parent award report block reply jcd_007 2 points 4 hours ago Yes, it absolutely needs to apply to renewals. permalink parent award report block reply dunkeaters 1 points 7 minutes ago Then acknowledge the progress and lobby for more. Instead we get braindead takes that Trump's \"as bad as it gets\" on H1B visas. The point of the program is that it makes American companies more competitive to be able to hire anyone. Tech companies are not like manufacturing, you can't tariff their imports and we would lose jobs if we forced companies to limit their workforce. It's a balance between staying attractive as the tech leader of the world and protecting American workers. Look at Canada's inability to hold onto their tech companies if you don't believe me. permalink parent award report block reply\njcd_007 2 points 4 hours ago Yes, it absolutely needs to apply to renewals. permalink parent award report block reply\ndunkeaters 1 points 7 minutes ago Then acknowledge the progress and lobby for more. Instead we get braindead takes that Trump's \"as bad as it gets\" on H1B visas. The point of the program is that it makes American companies more competitive to be able to hire anyone. Tech companies are not like manufacturing, you can't tariff their imports and we would lose jobs if we forced companies to limit their workforce. It's a balance between staying attractive as the tech leader of the world and protecting American workers. Look at Canada's inability to hold onto their tech companies if you don't believe me. permalink parent award report block reply\npossibletower -11 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z. Retards like you are blaming Trump for Gen Z fags voting commie like they always do? 🤣🤣🤣 permalink parent award report block reply jcd_007 2 points 4 hours ago Stats say Gen Z men are becoming more conservative. I think the only retard here is you. permalink parent award report block reply\njcd_007 2 points 4 hours ago Stats say Gen Z men are becoming more conservative. I think the only retard here is you. permalink parent award report block reply\ncurrent_horror 6 points 6 hours ago “You can destroy our nation, but you have to pay for the privilege.” You’re literally a traitor to America. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:53:19.439931Z"
}