{
  "id": "1ARK9mHEPO",
  "url": "https://patriots.win/p/1ARK9mHEPO/one-of-the-craziest-things-happe/c",
  "content": "38 One of the craziest things happening right now is how there's been report after report after report showing that Epstein really was an Israeli intelligence operative, based on publicly available documents, and yet it's had no measurable impact on mainstream media or politics. posted 15 hours ago by IlhansBrother 4 comments award share report block Caitlin Johnstone @caitoz • 1d One of the craziest things happening right now is how there's been report after report after report showing that Epstein really was an Israeli intelligence operative, based on publicly available documents, and yet it's had no measurable impact on mainstream media or politics.\n4 comments Sort by Top Top New Worst Old Save Around the Web justinkayz 4 points 14 hours ago Bondi has a Fox Snooze appearance, Ka$h has a date in Nashville & Boingo is nowhere to be found. The coverup continues. permalink award report block reply Mortal_Wombat 4 points 13 hours ago It's absolutely fucking disgraceful. We have no representation. We've been scammed. permalink parent award report block reply Friendly_B 4 points 15 hours ago What I find really interesting is how we know he was connected to MI6, CIA, and KGB intelligence (seriously, just look up Ghislaine's dad's history) yet so many people are fully ignoring that. All that does is run cover for pedophiles. permalink award report block reply CrowRezNeck 2 points 13 hours ago Frens there is nothing to see here. FBI be telling us dey truth. And.....  STOP NOTICING!\n😏😎 permalink award report block reply\njustinkayz 4 points 14 hours ago Bondi has a Fox Snooze appearance, Ka$h has a date in Nashville & Boingo is nowhere to be found. The coverup continues. permalink award report block reply Mortal_Wombat 4 points 13 hours ago It's absolutely fucking disgraceful. We have no representation. We've been scammed. permalink parent award report block reply\nMortal_Wombat 4 points 13 hours ago It's absolutely fucking disgraceful. We have no representation. We've been scammed. permalink parent award report block reply\nFriendly_B 4 points 15 hours ago What I find really interesting is how we know he was connected to MI6, CIA, and KGB intelligence (seriously, just look up Ghislaine's dad's history) yet so many people are fully ignoring that. All that does is run cover for pedophiles. permalink award report block reply\nCrowRezNeck 2 points 13 hours ago Frens there is nothing to see here. FBI be telling us dey truth. And.....  STOP NOTICING!\n😏😎 permalink award report block reply",
  "fetched_at": "2025-11-12T23:24:52.786153Z"
}