{
  "id": "1ARK9oW6Ap",
  "url": "https://patriots.win/p/1ARK9oW6Ap/how-dare-people-want-to-keep-the/c",
  "content": "11 How dare people want to keep the land they paid for, and use! /s Reminder this power is for Virginia NOT Maryland. (foxbaltimore.com) posted 3 hours ago by Michalusmichalus 4 comments award share report block As transmission fight heats up, developers place blame for delays on Maryland residents As the transmission saga continues and the developers and landowners continue to go back and forth in court, new filings show Public Service Enterprise Group (P foxbaltimore.com\n4 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style empiretc 3 points 2 hours ago STOP TAXING us for the land/home we purchased.  how about that? permalink award report block reply Michalusmichalus OP 2 points 2 hours ago I agree. If you can lose your home for being unable to pay taxes, it was never yours. permalink parent award report block reply empiretc 3 points 2 hours ago exactly.  it is flat-out theft. permalink parent award report block reply Michalusmichalus OP 2 points 3 hours ago Governor Moore has a new nickname in the comments of this article. It's Moore Ron. That's a good one! permalink award report block reply\nempiretc 3 points 2 hours ago STOP TAXING us for the land/home we purchased.  how about that? permalink award report block reply Michalusmichalus OP 2 points 2 hours ago I agree. If you can lose your home for being unable to pay taxes, it was never yours. permalink parent award report block reply empiretc 3 points 2 hours ago exactly.  it is flat-out theft. permalink parent award report block reply\nMichalusmichalus OP 2 points 2 hours ago I agree. If you can lose your home for being unable to pay taxes, it was never yours. permalink parent award report block reply empiretc 3 points 2 hours ago exactly.  it is flat-out theft. permalink parent award report block reply\nempiretc 3 points 2 hours ago exactly.  it is flat-out theft. permalink parent award report block reply\nMichalusmichalus OP 2 points 3 hours ago Governor Moore has a new nickname in the comments of this article. It's Moore Ron. That's a good one! permalink award report block reply",
  "fetched_at": "2025-11-12T23:02:01.353832Z"
}