{
  "id": "1ARK9nP5Qf",
  "url": "https://patriots.win/p/1ARK9nP5Qf/man-of-integrity-nah-try-shitbag/c",
  "content": "20 \"Man of integrity\"? Nah, try SHITBAG 🔥🗑️ ️ GARBAGE PEOPLE  🗑️🔥 posted 6 hours ago by DingleBalls 4 comments award share report block John Harwood @JohnJHarwood • 21h Trump, Vance and Hegseth cannot fathom this sort of integrity, much less live by it it's why they aren't fit to shine Mark Milley's shoes Not Your Average Liberal @NotAvgLiberal • 1d “We don’t take an oath to a country” “We don’t take an oath to a King” “We don’t take an oath to a wannabe dictator” “We don’t take an oath to an individual”…. “We take an oath to the Constitution” “We take an oath to the idea that is America, and we’re willing to die to\n4 comments Sort by Top Top New Worst Old Save Grindelwald 3 points 6 hours ago Mark Miley, the CCP’s best friend permalink award report block reply Jack_NC 3 points 6 hours ago Integrity - vowing to ignore a commanding officer and alert the enemy? That is spelled T-R-E-A-S-O-N. permalink award report block reply Apersonofinterest 2 points 5 hours ago Court Martial. Military Tribunal. Guantanamo. permalink award report block reply FrensInLowPlaces 1 points 2 hours ago A very humiliating way. In the back alley outside of a gay club. Miami permalink parent award report block reply\nGrindelwald 3 points 6 hours ago Mark Miley, the CCP’s best friend permalink award report block reply\nJack_NC 3 points 6 hours ago Integrity - vowing to ignore a commanding officer and alert the enemy? That is spelled T-R-E-A-S-O-N. permalink award report block reply\nApersonofinterest 2 points 5 hours ago Court Martial. Military Tribunal. Guantanamo. permalink award report block reply FrensInLowPlaces 1 points 2 hours ago A very humiliating way. In the back alley outside of a gay club. Miami permalink parent award report block reply\nFrensInLowPlaces 1 points 2 hours ago A very humiliating way. In the back alley outside of a gay club. Miami permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:27:41.834585Z"
}