{
  "id": "1ARK9nPMHN",
  "url": "https://patriots.win/p/1ARK9nPMHN/fuentes-responds-to-trumps-h1b-c/c",
  "content": "17 Fuentes responds to Trump's h1b comments posted 6 hours ago by negative_entropy 6 comments award share report block 𝔼𝕥𝕙𝕖𝕣-𝕎𝕒𝕧𝕖 @etherXwave • 18h Trump has turned his back on the American people. Nick reacts to Trump's H1B comments 🔥 “Of course Americans will do the jobs. You gotta train them. It costs money and it takes time, but of course they'll do those jobs.”\n6 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style negative_entropy OP 6 points 5 hours ago I dont agree with Fuentes on everything, but he understands what young Americans are going through permalink award report block reply GatoradeJeb 0 points 5 hours ago I regret voting trump. I shouldve stayed home on election night. Kamala is anti White, Trump is anti White. Id plug nose and put Fuentes into the White house as he is pro White permalink award report block reply GdotLee 4 points 5 hours ago oh STFU permalink parent award report block reply GatoradeJeb -2 points 5 hours ago Gtfo to india you pajeet apologist vermin permalink parent award report block reply GdotLee 4 points 4 hours ago GFY BOOMER permalink parent award report block reply happyfave 2 points 4 hours ago Deport. permalink parent award report block reply\nnegative_entropy OP 6 points 5 hours ago I dont agree with Fuentes on everything, but he understands what young Americans are going through permalink award report block reply\nGatoradeJeb 0 points 5 hours ago I regret voting trump. I shouldve stayed home on election night. Kamala is anti White, Trump is anti White. Id plug nose and put Fuentes into the White house as he is pro White permalink award report block reply GdotLee 4 points 5 hours ago oh STFU permalink parent award report block reply GatoradeJeb -2 points 5 hours ago Gtfo to india you pajeet apologist vermin permalink parent award report block reply GdotLee 4 points 4 hours ago GFY BOOMER permalink parent award report block reply happyfave 2 points 4 hours ago Deport. permalink parent award report block reply\nGdotLee 4 points 5 hours ago oh STFU permalink parent award report block reply GatoradeJeb -2 points 5 hours ago Gtfo to india you pajeet apologist vermin permalink parent award report block reply GdotLee 4 points 4 hours ago GFY BOOMER permalink parent award report block reply\nGatoradeJeb -2 points 5 hours ago Gtfo to india you pajeet apologist vermin permalink parent award report block reply GdotLee 4 points 4 hours ago GFY BOOMER permalink parent award report block reply\nGdotLee 4 points 4 hours ago GFY BOOMER permalink parent award report block reply\nhappyfave 2 points 4 hours ago Deport. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:29:51.324483Z"
}