{
  "id": "8169559",
  "title": "1517BREAKING: Leftist student just FLIPPED OVER a TPUSA table at University of Iowa. \n@uiowa\n must c",
  "url": "https://patriots.win/p/1ARK0UcArB/breaking-leftist-student-just-fl/c",
  "content": "1517 BREAKING: Leftist student just FLIPPED OVER a TPUSA table at University of Iowa. \n@uiowa\n must charge and expel her\n\nMAKE HER FAMOUS posted 7 days ago by grannylovestrump 208 comments award share report block Libs of TikTok @libsoftiktok • 7d BREAKING: Leftist student just FLIPPED OVER a TPUSA table at University of Iowa. @uiowa must charge and expel her MAKE HER FAMOUS\n208 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Yamel13 158 points 7 days ago When are people going to start punching these clowns in the face? permalink award report block reply Dev404 154 points 7 days ago When the laws no longer apply to us like it doesn't apply to them. permalink parent award report block reply USDMaga 91 points 7 days ago And this here is the problem summarized perfectly. permalink parent award report block reply MocksFordComma 21 points 7 days ago This is exactly why the violence will start. When there is not equal protection, there are NO laws at all. permalink parent award report block reply Sgt_Hulka 3 points 6 days ago Well, there IS no equal protection.  So where is the violence? permalink parent award report block reply view 1 more comments... Mooksayshigh 7 points 7 days ago Cowards scared of laws written by men who want us exatinct. permalink parent award report block reply Brinakitis 15 points 7 days ago Everyone talks like this until it is their turn permalink parent award report block reply view 4 more comments... Another_ID 1 points 7 days ago Who want us what? permalink parent award report block reply view 5 more comments... IAmNotAnAutist -1 points 7 days ago You are a pussy. permalink parent award report block reply realPhantomFuck 27 points 7 days ago “A Communist system can be recognized by the fact that it spares the criminals and criminalizes the political opponent.” permalink parent award report block reply Hanging_Chad -1 points 7 days ago are antisemitic Free Palestiners our political opponents? permalink parent award report block reply IAmNotAnAutist 3 points 7 days ago No they're o ur enemies. permalink parent award report block reply ILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply glow-operator-2-0 14 points 7 days ago Laws are tools for a civilized society. When tools do not function, they are repaired ... or replaced. permalink parent award report block reply 1776er 7 points 7 days ago Yeah great sentiment but they will put you in a cage in the meantime permalink parent award report block reply HeavyMetalPatriot 2 points 7 days ago And that's why we must rise TOGETHER. permalink parent award report block reply IAmNotAnAutist 1 points 7 days ago Shut up pussy.  This happened in Iowa, not in NYC. permalink parent award report block reply view 2 more comments... deleted 11 points 7 days ago HeavyMetalPatriot 5 points 7 days ago Kek permalink parent award report block reply IAmNotAnAutist -4 points 7 days ago Suck a dick, goatfucker. permalink parent award report block reply deleted 7 points 6 days ago view 1 more comments... lynxxyarly 2 points 6 days ago imagine making a dick sucking joke in defense of the tiny hats, who literally suck the dicks of little boys as part of their tradition. wild timeline. permalink parent award report block reply booblitchutz 1 points 6 days ago It's nowhere near that incidental. It's a deliberate plan to incite us to violence to justify permanently disarming Americans. permalink parent award report block reply load 8 more comments... IncredibleMrE1 52 points 7 days ago Satanists erected a Baphomet statue in the Iowa State Capitol, and the patriot who beheaded it was charged with a hate crime and ultimately found guilty on a misdemeanor. Kim Reynolds refused to pardon him. permalink parent award report block reply KernalMustard -37 points 7 days ago Imagine getting angry over fake nonsense. permalink parent award report block reply IncredibleMrE1 30 points 7 days ago Story of an atheist's life. permalink parent award report block reply KernalMustard -17 points 7 days ago \"You dont believe what I believe, thats makes you my enemy.\" In reality no one in this day and age believes in Baal, Moloch or Baphamet. They do this to get you outraged. Like clockwork you do. Its no different than Muslims getting murderous over pictures over Mohammad. It shouldnt even m9ve a needle. You let anger control you I never had a problem christians following what ever life path that is written in the Bible. My problem is believing whats in it is 100% real. You can be shown all the evidence its not you  will still believe. About my fairh I saw enough evidence with my friend and found her faith misplaced. She suffered for that faith. While I hope her soul is in a better place. I saw the death of someone I loved and that I cant unsee that and say theres a God that loves us. permalink parent award report block reply view 6 more comments... Testamernt 9 points 7 days ago Imagine starting sentences with the word imagine like a reddit cuck. permalink parent award report block reply guywholikesDjtof2024 4 points 6 days ago So what'll you do if someone destroyed a Darwin statue? permalink parent award report block reply Fistfullofgreyhair 3 points 7 days ago Imagine not being a complete piece of shit. permalink parent award report block reply FakeNametag 14 points 7 days ago Exactly this.  Libs of TikTok wants the university to do something.  Why are we relying on \"them\" (aka someone else)  to handle our problems?  This makes us just as stupid as the gibs me dat democrat voters. permalink parent award report block reply XlDEN 9 points 7 days ago Because the university has controlling power over her. But it could go beyond that. She is probably here on a student Visa. Maybe that could be canceled. I went to the University of Iowa in the 80s. They had a lot of Chinese students even back then. They would come over here to study then go back to China. And they never got political. They kind of kept to their own. permalink parent award report block reply maleitch 3 points 7 days ago Every male on this planet has controlling power over her.  Jesus the man children on our side are so pathetic. permalink parent award report block reply IncredibleMrE1 4 points 7 days ago Hop to it permalink parent award report block reply bill_in_texas 2 points 6 days ago So the students go after her physically, throw her down, restrain her, and call the campus cops.  Exactly how do you see that going for the students who detain her? Guess who gets expelled and probably arrested?  Hint:  Not the table flipping floozy. permalink parent award report block reply bill_in_texas 1 points 6 days ago Because no one can touch her.  She can't be forcibly detained, thrown to the ground, and have cash, jewelry, or other valuables taken to pay for the damage she intentionally caused.  She can't be touched, thus, it's incumbent on the university or the police to do something about it. permalink parent award report block reply worldowedexplanation 1 points 6 days ago Yes she can, they just do it at night off camera. permalink parent award report block reply Mhmm2MoreWeeks 3 points 7 days ago Never. Which is why we got here in the first place. permalink parent award report block reply EgregiousPhilbin 3 points 7 days ago best we can do is condemn our own group chats permalink parent award report block reply load 27 more comments... TheRedPilledArtist 71 points 7 days ago They are toddlers throwing a tantrum because people disagree with their communism. permalink award report block reply HumphreyPlowjogger 10 points 7 days ago https://xcancel.com/FrontlinesTPUSA/status/1986254014447833265 permalink parent award report block reply TheRedPilledArtist 11 points 7 days ago Oh look, Sanpaku (psycho) eyes... permalink parent award report block reply thisaintitchief76 3 points 6 days ago Not enough punishment to matter. permalink parent award report block reply Quiznos585 68 points 7 days ago Update: ARRESTED & TRANS https://x.com/FrontlinesTPUSA/status/1986256303178870982 permalink award report block reply grannylovestrump OP 15 points 7 days ago thanks Quiznos permalink parent award report block reply Testamernt 8 points 7 days ago I guess I got to give him a little credit.  He fooled everyone until the mugshot came out. permalink parent award report block reply WildernessBro 2 points 6 days ago Nah man. Didn't you hear that fag's voice? permalink parent award report block reply ElectionMeddler 5 points 6 days ago Nice update Quiznos! Great news that the sheriff took it serious.  Now is the school going to do anything? Or is the DA going to quietly dismiss the charges? permalink parent award report block reply jamesbcrazy 2 points 7 days ago Predictable. permalink parent award report block reply Trump454748 40 points 7 days ago Send her back to China. permalink award report block reply Testamernt 18 points 7 days ago Turns out it's name is justin.... and not female. permalink parent award report block reply Bendadick_Arnold 3 points 7 days ago Who is shocked?? permalink parent award report block reply Trump-16-20-24-28-32 1 points 6 days ago John Lithgow is shocked... shocked I tell you! permalink parent award report block reply dontdrinksoy 2 points 6 days ago Turns out it's name is justin.... and not female. OMG. What a soycuck. permalink parent award report block reply Covidrrhea 10 points 7 days ago Return to sender permalink parent award report block reply psychoticpartial 1 points 6 days ago Send him back to hell. permalink parent award report block reply dangermousebuu 25 points 7 days ago Trans Man named Justin.\nWas arrested for disorderly conduct at 550pm today. permalink award report block reply N0rds 1 points 6 days ago Of COURSE it's an unhinged trannyfæggot permalink parent award report block reply Hangemh1gh 20 points 7 days ago Nothing a bitch slap wouldn't fix. 🤷🏻‍♂️ permalink award report block reply DelendaEstMarxismo 4 points 7 days ago Then make her clean it up or she gets another one. permalink parent award report block reply redpillthenormies -3 points 7 days ago It sounds like you'd like her to slap you. permalink parent award report block reply SavingPrivateGrace 16 points 7 days ago Walks like a Tranny tucking it's junk. permalink award report block reply I_Am_John_Galt 13 points 7 days ago She wanted a reaction and they didn't give it to her.  The autists will, however. permalink award report block reply Trump-16-20-24-28-32 1 points 6 days ago The people working the table, essentially, were laughing. permalink parent award report block reply RiffFantastic 10 points 7 days ago They publicly executed the founder. Now they’re spiking the ball in our faces. permalink award report block reply thisisatestof2 10 points 7 days ago It amazes me how many adult children are walking around today.  I don’t think they were ever disciplined by their parents, told no, etc. permalink award report block reply ThatsGold 8 points 7 days ago THAT'S A MAN; BABY! permalink award report block reply mlp67 8 points 7 days ago Make HIM famous.  It's a shim permalink award report block reply Hanging_Chad 8 points 7 days ago I highly doubt that will get her expelled. disciplinary suspension is more likely permalink award report block reply hellohellohellohell 13 points 7 days ago \"Deported\" is the operative word here... permalink parent award report block reply ragnarokrobo 3 points 7 days ago But someone on Twitter tagged them and demanded they do something.. permalink parent award report block reply redpillthenormies 0 points 7 days ago I've never seen anyone get expelled for slowly turning over a table. People here are just being snowflakes. permalink parent award report block reply 24601 8 points 7 days ago Violence is how they solve reality they don't like. permalink award report block reply knnbccb 7 points 7 days ago These creatures, you beat them up until they are wheelchair-bound, and those who do that get a pre-emptive pardon and an award. That's how you deal with their kind. Not go through the courtroom circus, where some of their comrades wear a judge's robe. permalink award report block reply behemoth887 6 points 7 days ago pretty tame for a subhuman lib. they didn't even bring a weapon or attempt to take any lives. permalink award report block reply briansoprano 5 points 7 days ago Nothing that a Super Soaker water gun filled with stale piss couldn't cure... permalink award report block reply here2red 5 points 7 days ago Should start attaching electrodes to the bottom rim of the table permalink award report block reply Bldg_2019 5 points 7 days ago I miss the old days of college in the 90s. Went to a pretty liberal school and we used to do things like fill a big fish bowl with cigarettes to hand out at the student union during earth day demonstrations back then. Libfags would just laugh and take a few. Then we’d all drink later that night at a bar or party. No violence. Zillennials suck. permalink award report block reply Trump-16-20-24-28-32 1 points 6 days ago I went to Kent State, very liberal.  We had 'Brother Chuck' who used to preach on the grounds of the student center at lunch and rile up all the liberal snowflakes.  I loved it. permalink parent award report block reply mlp67 4 points 7 days ago It's a tranny!!!! Not a she. It's a HE. https://xcancel.com/FrontlinesTPUSA/status/1986254014447833265 permalink award report block reply CommanderOfCheese 4 points 7 days ago #ViolentLeft permalink award report block reply Dogpile1 4 points 6 days ago Violence seems to be the only thing they want. Give it to them. permalink award report block reply ianpatrick1966 4 points 7 days ago Iowa pede here, checking in, 10 minutes from campus.  Tell me what is needed to be done. permalink award report block reply Prandogolio 3 points 7 days ago You know what needs to be done permalink parent award report block reply AwShitHereWeGoAgain 4 points 7 days ago Hang her!!!!! permalink award report block reply throttlejohnson 4 points 7 days ago do they not have any security? guess we havn't learned a fucking thing. permalink award report block reply IAmDisappoint 4 points 7 days ago Punch her lights out, that should teach her. permalink award report block reply BoomShtick 3 points 7 days ago Looked like a chink permalink award report block reply KungPaoMcChicken 3 points 7 days ago 5 seconds later, table is back up... permalink award report block reply Oodles 3 points 7 days ago An asian tranny should not be tough to track down in Iowa permalink award report block reply Bendadick_Arnold 3 points 7 days ago The demographics leave a possibility of … one permalink parent award report block reply MedicallyReddit 3 points 7 days ago The party of peace permalink award report block reply MeMargie 3 points 7 days ago An Armed society is a polite society. permalink award report block reply Seruna_Kanus 3 points 6 days ago Cultists tend to react violently to anything that challenges the brainwashing. permalink award report block reply Retardloserimsogay 2 points 7 days ago Why are our people just letting this happen? I mean I know Charlie wouldn't want escalation, but people get in fights, it happens and that's ok. Edit: now that I've thought about it, TPUSA is usually a guest on campus and it wouldn't do any good to get kicked off for fighting. permalink award report block reply Lynnforthetruth 2 points 7 days ago Looks Chinese permalink award report block reply buildthatwall45 2 points 7 days ago They got him. No surprise, another troon permalink award report block reply Saltish 2 points 7 days ago That's a man, baby. permalink award report block reply 5DchessWatch 2 points 6 days ago TPUSA needs private security When someone does this, TPUSA kids hit a button. Suddenly 5 antifa-ninjas jump out, in all blackblock with their faces covered and everything.  They take giant pre-zipped at the top ziptie and put it over them, and ziptie their arms and trunk, and then their feet together so they cannot run, and take them down. They snatch the student up and take them away to a van,  citizens arresting them for vandalism, assault and battery (because they violently attacked the TPUSA people with a Table). The security people take them off campus to the REAL police because campus police are fake and gay and don't do anything. Otherwise this wouldn't continue happening They drop them off in front of the police station with a list of their charges, and a sousveillance video of their actions, and the TPUSA video of them doing it, and then the charges on paper literally stapled to their chest.   They blow a loud whisle, or set off a starting gun and drive off Official story is that TPUSA doesn't know anythign about the good samaritan security team permalink award report block reply AllisterTwo 2 points 7 days ago https://ww1.johnsoncountyiowa.gov/Sheriff/jailroster/details/136876 permalink award report block reply Protonboy 2 points 7 days ago Whatever happens: DO NOT CALL CAMPUS SECURITY; or police. permalink award report block reply newuser8 2 points 7 days ago he sounded like a man from the first few seconds permalink award report block reply grannylovestrump OP 2 points 7 days ago https://x.com/libsoftiktok/status/1986168911927058707 permalink award report block reply BobDolesBanana 2 points 7 days ago The nutter is an asian tranny. Did the same last week near the same location to a YAF table. Nobody is gonna do squat in this town about (Iowa City). What do you expect would happen? permalink award report block reply Probably_tryna_sleep 2 points 7 days ago They should really tapcon the tables down so we can watch the retards try and fail at flipping the tables over… Come to think of it, you could probably put some ankle weights on the table legs for the same effect lol permalink award report block reply RedWave26 2 points 6 days ago Oh the outrage! More X posts!!! permalink award report block reply JackOfAllTirades 2 points 6 days ago The milquetoast, measured response pisses me off. Until we start beating these commie bastard's faces into the pavement, nothing will change. permalink award report block reply Chickensaurus 2 points 7 days ago Apparently the majority of American supports this hate. permalink award report block reply redinmn 2 points 7 days ago It would be so sad if the edge of the table was razor sharp or had some metal burs on it. permalink award report block reply ACActual 2 points 7 days ago We need to make stupidity painful permalink award report block reply Live_free_or_die_55 2 points 6 days ago Deport this bitch!!! permalink award report block reply jlange94 2 points 7 days ago Just continue doing nothing. Don't even push them. Just let them continue wrecking our property and kill us. Fucking spineless. permalink award report block reply grannylovestrump OP 1 points 7 days ago In the art of war you never interrupt your enemy when they are kicking their own ass permalink parent award report block reply jlange94 1 points 7 days ago All we've been seeing is them kicking our asses and killing us. And now we're losing public support. Tell me again how Sun Tzu is just going to roll over and let his enemy kill him. permalink parent award report block reply WildernessBro 2 points 6 days ago Honestly annoyed. Why are all the conservatives that do these things the most limp-wristed types, and why do they not have some guys that are a little more muscle bound with them if they're going to do it? At least make it so the leftists don't just go into these situations thinking they're some billy badass and can actually catch repercussions. So many videos of people's signs being stolen, tables being flipped, people being assaulted, having their hats snatched. Ask for volunteers for security and plenty will offer up to do it even if it means some repercussions. This shit about just being morally superior and \"turning the other cheek\" and saying \"wow can you imagine if the roles were switched?\" is so fucking cucked. It's not a virtue. permalink award report block reply UltraMagaWA 1 points 6 days ago Looks like Chinese operative that was placed in that school, go back to china permalink award report block reply Nomad899 1 points 7 days ago https://www.mace.com/collections/triple-action Just give a dose or two permalink award report block reply HunterBidensPC 1 points 6 days ago Start bringing pepper spray. It would make these videos ten times better permalink award report block reply BrionK 1 points 6 days ago Don't care, you in college you get what you deserve permalink award report block reply Goozmania 1 points 7 days ago Why not just beat the shit out of her, instead of crying about it? permalink award report block reply corntortilla 1 points 7 days ago Holy fuck! Breaking news, leftist idiot turns over table. Omg! End of te world, what will we do? permalink award report block reply Cleverlynamed 1 points 6 days ago Remember the guy that electrified Trump yard signs?  Something like that would be fun to watch. permalink award report block reply peekov4 1 points 6 days ago BREAKING BREAKING BREAKING! permalink award report block reply Smeg 1 points 6 days ago So why didn't they flip him over? permalink award report block reply Oldman1234 1 points 6 days ago People think that what this trans person did was a criminal act but what really happened is called a \"resume enhancement\".  Getting arrested doing this kind of stuff (and eventually having all charges dropped by the local Dem Prosecutor and Dem Activist Judge) demonstrates to future employers their unwavering loyalty to the far left woke progressive Dem Party.  Let the job offers pour in! permalink award report block reply conservativefrank 1 points 7 days ago They just stand there doing nothing. permalink award report block reply RedEnsign4Trump 1 points 7 days ago Some autistic chink too permalink award report block reply FORMERCHILDSTAR 1 points 7 days ago She's a good little nazi. permalink award report block reply YesImWhite 1 points 7 days ago violence against women! lol permalink award report block reply JDVance4President28 1 points 7 days ago Lol I'm sure do nothing pam will get right on it. permalink award report block reply Hagatha 1 points 7 days ago Justin Calhoon, the trans nut, FAFOed. permalink award report block reply Ryker 1 points 6 days ago Can someone explain to me why this keeps happening? Are you sure it’s not because you’re a bunch of pussies that wont stand up for themselves? Are you sure this pacifism brings you closer to Christ? Or are you more  like that ‘friend’ no-one can count on when the going gets though? permalink award report block reply mateus 1 points 7 days ago How about posting when they're finally arrested, or someone has the balls to STOP them? 😉 As I've said here on multiple occasions, they need some ALPHA males at those tables, not betas who stand watch them knock things over then giggle about it. Same crap, different day, and it shouldn't be stickied. permalink award report block reply grannylovestrump OP 1 points 7 days ago they were arrested. someone posted link here in the one of the comments permalink parent award report block reply tlorsung 1 points 7 days ago They are only going to continue their bad behavior!   Only Evil doesn't want you to teach Lessons to haters, but GOD does!  You are not spreading Charlie's Messages if you don't!  Help that table topper! permalink award report block reply Yheymos 1 points 6 days ago HER? wtf... HER? No. This is yet nothing man. That voice? Come on! permalink award report block reply suckmycorona 1 points 7 days ago They didn’t follow her? permalink award report block reply HockeyMom4Trump 1 points 7 days ago The lefties are so violent and destructive. If she does not like their booth she could just keep on walking. permalink award report block reply IAmNotAnAutist 1 points 7 days ago Fukking weak bitches.  Our side is so full of pussies. permalink award report block reply OZJRant 1 points 6 days ago No it would be easier and to make an example of this POS by physically slapping her!\nMy father once said the difference between me and your mum is this red right hand? That’s why republicans lose because they always bring a knife to a gunfight metaphorically speaking of course permalink award report block reply Edge9876 1 points 6 days ago Next time just keep a bottle of bear mace right there. Dust that bitch. permalink award report block reply MocksFordComma 1 points 7 days ago It's amazing to me that they have no clue how shitty they are as people. permalink award report block reply josiborg 1 points 7 days ago Iowa is cucked permalink award report block reply midwestdeplorable 2 points 7 days ago No, IA is not cucked. This is Johnson County we are talking about. One of three counties in this state where you have a ton of TDS infected people. This is not representative of our state.\nI'm actually here for a few days and it's like I stepped into the twilight zone compared to back home. permalink parent award report block reply josiborg 0 points 7 days ago Polk Co is super cucked and Dallas is way more cucked than you're gonna give it credit for. It just had an illegal with a mile long rap sheet making $300k because the board was full of thirsty ugly bitches seething for black cock and a girl raped by an illegal with a corn cob who's parents took in another to show the world they're not racist. The National Muslim Association moved to Des Moines from DC for more political pull and the mosque to church ratio is closer and closer to 1:1 everyday. Jeff Link was a big factor in getting Obama elected/reelected. Ames was the first tranny library session with children to get national attention. Holy shit the Branstadt Family and that's all I need to say. What's her name dipshit curly hair retard that just recently died from taking 28 or something COVID jab boosters. King Maker Bob Vanderplatts repping Ted Cruz in 2016. Do I need to continue? Go jack someone else off with your butt cheeks and leave people alone that know what the fuck they're talking about. Iowa is cucked. permalink parent award report block reply Corse46 1 points 6 days ago The D party just learned that assasinating republicans gets them election landslides. They have no reason to stop permalink award report block reply USNVET71 0 points 7 days ago Face full of bear spray should do the trick permalink award report block reply USNVET71 -1 points 7 days ago Some people are just not mentally stable, and shouldn't be allowed to walk the streets permalink award report block reply Snek_Plissken -3 points 7 days ago another CCP national. permalink award report block reply ILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply ILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply Prandogolio 1 points 7 days ago Comment removed by community moderators. permalink award report block reply\nYamel13 158 points 7 days ago When are people going to start punching these clowns in the face? permalink award report block reply Dev404 154 points 7 days ago When the laws no longer apply to us like it doesn't apply to them. permalink parent award report block reply USDMaga 91 points 7 days ago And this here is the problem summarized perfectly. permalink parent award report block reply MocksFordComma 21 points 7 days ago This is exactly why the violence will start. When there is not equal protection, there are NO laws at all. permalink parent award report block reply Sgt_Hulka 3 points 6 days ago Well, there IS no equal protection.  So where is the violence? permalink parent award report block reply view 1 more comments... Mooksayshigh 7 points 7 days ago Cowards scared of laws written by men who want us exatinct. permalink parent award report block reply Brinakitis 15 points 7 days ago Everyone talks like this until it is their turn permalink parent award report block reply view 4 more comments... Another_ID 1 points 7 days ago Who want us what? permalink parent award report block reply view 5 more comments... IAmNotAnAutist -1 points 7 days ago You are a pussy. permalink parent award report block reply realPhantomFuck 27 points 7 days ago “A Communist system can be recognized by the fact that it spares the criminals and criminalizes the political opponent.” permalink parent award report block reply Hanging_Chad -1 points 7 days ago are antisemitic Free Palestiners our political opponents? permalink parent award report block reply IAmNotAnAutist 3 points 7 days ago No they're o ur enemies. permalink parent award report block reply ILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply glow-operator-2-0 14 points 7 days ago Laws are tools for a civilized society. When tools do not function, they are repaired ... or replaced. permalink parent award report block reply 1776er 7 points 7 days ago Yeah great sentiment but they will put you in a cage in the meantime permalink parent award report block reply HeavyMetalPatriot 2 points 7 days ago And that's why we must rise TOGETHER. permalink parent award report block reply IAmNotAnAutist 1 points 7 days ago Shut up pussy.  This happened in Iowa, not in NYC. permalink parent award report block reply view 2 more comments... deleted 11 points 7 days ago HeavyMetalPatriot 5 points 7 days ago Kek permalink parent award report block reply IAmNotAnAutist -4 points 7 days ago Suck a dick, goatfucker. permalink parent award report block reply deleted 7 points 6 days ago view 1 more comments... lynxxyarly 2 points 6 days ago imagine making a dick sucking joke in defense of the tiny hats, who literally suck the dicks of little boys as part of their tradition. wild timeline. permalink parent award report block reply booblitchutz 1 points 6 days ago It's nowhere near that incidental. It's a deliberate plan to incite us to violence to justify permanently disarming Americans. permalink parent award report block reply load 8 more comments... IncredibleMrE1 52 points 7 days ago Satanists erected a Baphomet statue in the Iowa State Capitol, and the patriot who beheaded it was charged with a hate crime and ultimately found guilty on a misdemeanor. Kim Reynolds refused to pardon him. permalink parent award report block reply KernalMustard -37 points 7 days ago Imagine getting angry over fake nonsense. permalink parent award report block reply IncredibleMrE1 30 points 7 days ago Story of an atheist's life. permalink parent award report block reply KernalMustard -17 points 7 days ago \"You dont believe what I believe, thats makes you my enemy.\" In reality no one in this day and age believes in Baal, Moloch or Baphamet. They do this to get you outraged. Like clockwork you do. Its no different than Muslims getting murderous over pictures over Mohammad. It shouldnt even m9ve a needle. You let anger control you I never had a problem christians following what ever life path that is written in the Bible. My problem is believing whats in it is 100% real. You can be shown all the evidence its not you  will still believe. About my fairh I saw enough evidence with my friend and found her faith misplaced. She suffered for that faith. While I hope her soul is in a better place. I saw the death of someone I loved and that I cant unsee that and say theres a God that loves us. permalink parent award report block reply view 6 more comments... Testamernt 9 points 7 days ago Imagine starting sentences with the word imagine like a reddit cuck. permalink parent award report block reply guywholikesDjtof2024 4 points 6 days ago So what'll you do if someone destroyed a Darwin statue? permalink parent award report block reply Fistfullofgreyhair 3 points 7 days ago Imagine not being a complete piece of shit. permalink parent award report block reply FakeNametag 14 points 7 days ago Exactly this.  Libs of TikTok wants the university to do something.  Why are we relying on \"them\" (aka someone else)  to handle our problems?  This makes us just as stupid as the gibs me dat democrat voters. permalink parent award report block reply XlDEN 9 points 7 days ago Because the university has controlling power over her. But it could go beyond that. She is probably here on a student Visa. Maybe that could be canceled. I went to the University of Iowa in the 80s. They had a lot of Chinese students even back then. They would come over here to study then go back to China. And they never got political. They kind of kept to their own. permalink parent award report block reply maleitch 3 points 7 days ago Every male on this planet has controlling power over her.  Jesus the man children on our side are so pathetic. permalink parent award report block reply IncredibleMrE1 4 points 7 days ago Hop to it permalink parent award report block reply bill_in_texas 2 points 6 days ago So the students go after her physically, throw her down, restrain her, and call the campus cops.  Exactly how do you see that going for the students who detain her? Guess who gets expelled and probably arrested?  Hint:  Not the table flipping floozy. permalink parent award report block reply bill_in_texas 1 points 6 days ago Because no one can touch her.  She can't be forcibly detained, thrown to the ground, and have cash, jewelry, or other valuables taken to pay for the damage she intentionally caused.  She can't be touched, thus, it's incumbent on the university or the police to do something about it. permalink parent award report block reply worldowedexplanation 1 points 6 days ago Yes she can, they just do it at night off camera. permalink parent award report block reply Mhmm2MoreWeeks 3 points 7 days ago Never. Which is why we got here in the first place. permalink parent award report block reply EgregiousPhilbin 3 points 7 days ago best we can do is condemn our own group chats permalink parent award report block reply load 27 more comments...\nDev404 154 points 7 days ago When the laws no longer apply to us like it doesn't apply to them. permalink parent award report block reply USDMaga 91 points 7 days ago And this here is the problem summarized perfectly. permalink parent award report block reply MocksFordComma 21 points 7 days ago This is exactly why the violence will start. When there is not equal protection, there are NO laws at all. permalink parent award report block reply Sgt_Hulka 3 points 6 days ago Well, there IS no equal protection.  So where is the violence? permalink parent award report block reply view 1 more comments... Mooksayshigh 7 points 7 days ago Cowards scared of laws written by men who want us exatinct. permalink parent award report block reply Brinakitis 15 points 7 days ago Everyone talks like this until it is their turn permalink parent award report block reply view 4 more comments... Another_ID 1 points 7 days ago Who want us what? permalink parent award report block reply view 5 more comments... IAmNotAnAutist -1 points 7 days ago You are a pussy. permalink parent award report block reply realPhantomFuck 27 points 7 days ago “A Communist system can be recognized by the fact that it spares the criminals and criminalizes the political opponent.” permalink parent award report block reply Hanging_Chad -1 points 7 days ago are antisemitic Free Palestiners our political opponents? permalink parent award report block reply IAmNotAnAutist 3 points 7 days ago No they're o ur enemies. permalink parent award report block reply ILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply glow-operator-2-0 14 points 7 days ago Laws are tools for a civilized society. When tools do not function, they are repaired ... or replaced. permalink parent award report block reply 1776er 7 points 7 days ago Yeah great sentiment but they will put you in a cage in the meantime permalink parent award report block reply HeavyMetalPatriot 2 points 7 days ago And that's why we must rise TOGETHER. permalink parent award report block reply IAmNotAnAutist 1 points 7 days ago Shut up pussy.  This happened in Iowa, not in NYC. permalink parent award report block reply view 2 more comments... deleted 11 points 7 days ago HeavyMetalPatriot 5 points 7 days ago Kek permalink parent award report block reply IAmNotAnAutist -4 points 7 days ago Suck a dick, goatfucker. permalink parent award report block reply deleted 7 points 6 days ago view 1 more comments... lynxxyarly 2 points 6 days ago imagine making a dick sucking joke in defense of the tiny hats, who literally suck the dicks of little boys as part of their tradition. wild timeline. permalink parent award report block reply booblitchutz 1 points 6 days ago It's nowhere near that incidental. It's a deliberate plan to incite us to violence to justify permanently disarming Americans. permalink parent award report block reply load 8 more comments...\nUSDMaga 91 points 7 days ago And this here is the problem summarized perfectly. permalink parent award report block reply MocksFordComma 21 points 7 days ago This is exactly why the violence will start. When there is not equal protection, there are NO laws at all. permalink parent award report block reply Sgt_Hulka 3 points 6 days ago Well, there IS no equal protection.  So where is the violence? permalink parent award report block reply view 1 more comments... Mooksayshigh 7 points 7 days ago Cowards scared of laws written by men who want us exatinct. permalink parent award report block reply Brinakitis 15 points 7 days ago Everyone talks like this until it is their turn permalink parent award report block reply view 4 more comments... Another_ID 1 points 7 days ago Who want us what? permalink parent award report block reply view 5 more comments... IAmNotAnAutist -1 points 7 days ago You are a pussy. permalink parent award report block reply\nMocksFordComma 21 points 7 days ago This is exactly why the violence will start. When there is not equal protection, there are NO laws at all. permalink parent award report block reply Sgt_Hulka 3 points 6 days ago Well, there IS no equal protection.  So where is the violence? permalink parent award report block reply view 1 more comments...\nSgt_Hulka 3 points 6 days ago Well, there IS no equal protection.  So where is the violence? permalink parent award report block reply view 1 more comments...\nMooksayshigh 7 points 7 days ago Cowards scared of laws written by men who want us exatinct. permalink parent award report block reply Brinakitis 15 points 7 days ago Everyone talks like this until it is their turn permalink parent award report block reply view 4 more comments... Another_ID 1 points 7 days ago Who want us what? permalink parent award report block reply view 5 more comments...\nBrinakitis 15 points 7 days ago Everyone talks like this until it is their turn permalink parent award report block reply view 4 more comments...\nAnother_ID 1 points 7 days ago Who want us what? permalink parent award report block reply view 5 more comments...\nIAmNotAnAutist -1 points 7 days ago You are a pussy. permalink parent award report block reply\nrealPhantomFuck 27 points 7 days ago “A Communist system can be recognized by the fact that it spares the criminals and criminalizes the political opponent.” permalink parent award report block reply Hanging_Chad -1 points 7 days ago are antisemitic Free Palestiners our political opponents? permalink parent award report block reply IAmNotAnAutist 3 points 7 days ago No they're o ur enemies. permalink parent award report block reply ILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nHanging_Chad -1 points 7 days ago are antisemitic Free Palestiners our political opponents? permalink parent award report block reply IAmNotAnAutist 3 points 7 days ago No they're o ur enemies. permalink parent award report block reply ILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nIAmNotAnAutist 3 points 7 days ago No they're o ur enemies. permalink parent award report block reply\nILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nglow-operator-2-0 14 points 7 days ago Laws are tools for a civilized society. When tools do not function, they are repaired ... or replaced. permalink parent award report block reply 1776er 7 points 7 days ago Yeah great sentiment but they will put you in a cage in the meantime permalink parent award report block reply HeavyMetalPatriot 2 points 7 days ago And that's why we must rise TOGETHER. permalink parent award report block reply IAmNotAnAutist 1 points 7 days ago Shut up pussy.  This happened in Iowa, not in NYC. permalink parent award report block reply view 2 more comments...\n1776er 7 points 7 days ago Yeah great sentiment but they will put you in a cage in the meantime permalink parent award report block reply HeavyMetalPatriot 2 points 7 days ago And that's why we must rise TOGETHER. permalink parent award report block reply IAmNotAnAutist 1 points 7 days ago Shut up pussy.  This happened in Iowa, not in NYC. permalink parent award report block reply view 2 more comments...\nHeavyMetalPatriot 2 points 7 days ago And that's why we must rise TOGETHER. permalink parent award report block reply\nIAmNotAnAutist 1 points 7 days ago Shut up pussy.  This happened in Iowa, not in NYC. permalink parent award report block reply view 2 more comments...\ndeleted 11 points 7 days ago HeavyMetalPatriot 5 points 7 days ago Kek permalink parent award report block reply IAmNotAnAutist -4 points 7 days ago Suck a dick, goatfucker. permalink parent award report block reply deleted 7 points 6 days ago view 1 more comments... lynxxyarly 2 points 6 days ago imagine making a dick sucking joke in defense of the tiny hats, who literally suck the dicks of little boys as part of their tradition. wild timeline. permalink parent award report block reply\nHeavyMetalPatriot 5 points 7 days ago Kek permalink parent award report block reply\nIAmNotAnAutist -4 points 7 days ago Suck a dick, goatfucker. permalink parent award report block reply deleted 7 points 6 days ago view 1 more comments... lynxxyarly 2 points 6 days ago imagine making a dick sucking joke in defense of the tiny hats, who literally suck the dicks of little boys as part of their tradition. wild timeline. permalink parent award report block reply\ndeleted 7 points 6 days ago view 1 more comments...\nlynxxyarly 2 points 6 days ago imagine making a dick sucking joke in defense of the tiny hats, who literally suck the dicks of little boys as part of their tradition. wild timeline. permalink parent award report block reply\nbooblitchutz 1 points 6 days ago It's nowhere near that incidental. It's a deliberate plan to incite us to violence to justify permanently disarming Americans. permalink parent award report block reply\nIncredibleMrE1 52 points 7 days ago Satanists erected a Baphomet statue in the Iowa State Capitol, and the patriot who beheaded it was charged with a hate crime and ultimately found guilty on a misdemeanor. Kim Reynolds refused to pardon him. permalink parent award report block reply KernalMustard -37 points 7 days ago Imagine getting angry over fake nonsense. permalink parent award report block reply IncredibleMrE1 30 points 7 days ago Story of an atheist's life. permalink parent award report block reply KernalMustard -17 points 7 days ago \"You dont believe what I believe, thats makes you my enemy.\" In reality no one in this day and age believes in Baal, Moloch or Baphamet. They do this to get you outraged. Like clockwork you do. Its no different than Muslims getting murderous over pictures over Mohammad. It shouldnt even m9ve a needle. You let anger control you I never had a problem christians following what ever life path that is written in the Bible. My problem is believing whats in it is 100% real. You can be shown all the evidence its not you  will still believe. About my fairh I saw enough evidence with my friend and found her faith misplaced. She suffered for that faith. While I hope her soul is in a better place. I saw the death of someone I loved and that I cant unsee that and say theres a God that loves us. permalink parent award report block reply view 6 more comments... Testamernt 9 points 7 days ago Imagine starting sentences with the word imagine like a reddit cuck. permalink parent award report block reply guywholikesDjtof2024 4 points 6 days ago So what'll you do if someone destroyed a Darwin statue? permalink parent award report block reply Fistfullofgreyhair 3 points 7 days ago Imagine not being a complete piece of shit. permalink parent award report block reply\nKernalMustard -37 points 7 days ago Imagine getting angry over fake nonsense. permalink parent award report block reply IncredibleMrE1 30 points 7 days ago Story of an atheist's life. permalink parent award report block reply KernalMustard -17 points 7 days ago \"You dont believe what I believe, thats makes you my enemy.\" In reality no one in this day and age believes in Baal, Moloch or Baphamet. They do this to get you outraged. Like clockwork you do. Its no different than Muslims getting murderous over pictures over Mohammad. It shouldnt even m9ve a needle. You let anger control you I never had a problem christians following what ever life path that is written in the Bible. My problem is believing whats in it is 100% real. You can be shown all the evidence its not you  will still believe. About my fairh I saw enough evidence with my friend and found her faith misplaced. She suffered for that faith. While I hope her soul is in a better place. I saw the death of someone I loved and that I cant unsee that and say theres a God that loves us. permalink parent award report block reply view 6 more comments... Testamernt 9 points 7 days ago Imagine starting sentences with the word imagine like a reddit cuck. permalink parent award report block reply guywholikesDjtof2024 4 points 6 days ago So what'll you do if someone destroyed a Darwin statue? permalink parent award report block reply Fistfullofgreyhair 3 points 7 days ago Imagine not being a complete piece of shit. permalink parent award report block reply\nIncredibleMrE1 30 points 7 days ago Story of an atheist's life. permalink parent award report block reply KernalMustard -17 points 7 days ago \"You dont believe what I believe, thats makes you my enemy.\" In reality no one in this day and age believes in Baal, Moloch or Baphamet. They do this to get you outraged. Like clockwork you do. Its no different than Muslims getting murderous over pictures over Mohammad. It shouldnt even m9ve a needle. You let anger control you I never had a problem christians following what ever life path that is written in the Bible. My problem is believing whats in it is 100% real. You can be shown all the evidence its not you  will still believe. About my fairh I saw enough evidence with my friend and found her faith misplaced. She suffered for that faith. While I hope her soul is in a better place. I saw the death of someone I loved and that I cant unsee that and say theres a God that loves us. permalink parent award report block reply view 6 more comments...\nKernalMustard -17 points 7 days ago \"You dont believe what I believe, thats makes you my enemy.\" In reality no one in this day and age believes in Baal, Moloch or Baphamet. They do this to get you outraged. Like clockwork you do. Its no different than Muslims getting murderous over pictures over Mohammad. It shouldnt even m9ve a needle. You let anger control you I never had a problem christians following what ever life path that is written in the Bible. My problem is believing whats in it is 100% real. You can be shown all the evidence its not you  will still believe. About my fairh I saw enough evidence with my friend and found her faith misplaced. She suffered for that faith. While I hope her soul is in a better place. I saw the death of someone I loved and that I cant unsee that and say theres a God that loves us. permalink parent award report block reply view 6 more comments...\nTestamernt 9 points 7 days ago Imagine starting sentences with the word imagine like a reddit cuck. permalink parent award report block reply\nguywholikesDjtof2024 4 points 6 days ago So what'll you do if someone destroyed a Darwin statue? permalink parent award report block reply\nFistfullofgreyhair 3 points 7 days ago Imagine not being a complete piece of shit. permalink parent award report block reply\nFakeNametag 14 points 7 days ago Exactly this.  Libs of TikTok wants the university to do something.  Why are we relying on \"them\" (aka someone else)  to handle our problems?  This makes us just as stupid as the gibs me dat democrat voters. permalink parent award report block reply XlDEN 9 points 7 days ago Because the university has controlling power over her. But it could go beyond that. She is probably here on a student Visa. Maybe that could be canceled. I went to the University of Iowa in the 80s. They had a lot of Chinese students even back then. They would come over here to study then go back to China. And they never got political. They kind of kept to their own. permalink parent award report block reply maleitch 3 points 7 days ago Every male on this planet has controlling power over her.  Jesus the man children on our side are so pathetic. permalink parent award report block reply IncredibleMrE1 4 points 7 days ago Hop to it permalink parent award report block reply bill_in_texas 2 points 6 days ago So the students go after her physically, throw her down, restrain her, and call the campus cops.  Exactly how do you see that going for the students who detain her? Guess who gets expelled and probably arrested?  Hint:  Not the table flipping floozy. permalink parent award report block reply bill_in_texas 1 points 6 days ago Because no one can touch her.  She can't be forcibly detained, thrown to the ground, and have cash, jewelry, or other valuables taken to pay for the damage she intentionally caused.  She can't be touched, thus, it's incumbent on the university or the police to do something about it. permalink parent award report block reply worldowedexplanation 1 points 6 days ago Yes she can, they just do it at night off camera. permalink parent award report block reply\nXlDEN 9 points 7 days ago Because the university has controlling power over her. But it could go beyond that. She is probably here on a student Visa. Maybe that could be canceled. I went to the University of Iowa in the 80s. They had a lot of Chinese students even back then. They would come over here to study then go back to China. And they never got political. They kind of kept to their own. permalink parent award report block reply maleitch 3 points 7 days ago Every male on this planet has controlling power over her.  Jesus the man children on our side are so pathetic. permalink parent award report block reply IncredibleMrE1 4 points 7 days ago Hop to it permalink parent award report block reply bill_in_texas 2 points 6 days ago So the students go after her physically, throw her down, restrain her, and call the campus cops.  Exactly how do you see that going for the students who detain her? Guess who gets expelled and probably arrested?  Hint:  Not the table flipping floozy. permalink parent award report block reply\nmaleitch 3 points 7 days ago Every male on this planet has controlling power over her.  Jesus the man children on our side are so pathetic. permalink parent award report block reply IncredibleMrE1 4 points 7 days ago Hop to it permalink parent award report block reply bill_in_texas 2 points 6 days ago So the students go after her physically, throw her down, restrain her, and call the campus cops.  Exactly how do you see that going for the students who detain her? Guess who gets expelled and probably arrested?  Hint:  Not the table flipping floozy. permalink parent award report block reply\nIncredibleMrE1 4 points 7 days ago Hop to it permalink parent award report block reply\nbill_in_texas 2 points 6 days ago So the students go after her physically, throw her down, restrain her, and call the campus cops.  Exactly how do you see that going for the students who detain her? Guess who gets expelled and probably arrested?  Hint:  Not the table flipping floozy. permalink parent award report block reply\nbill_in_texas 1 points 6 days ago Because no one can touch her.  She can't be forcibly detained, thrown to the ground, and have cash, jewelry, or other valuables taken to pay for the damage she intentionally caused.  She can't be touched, thus, it's incumbent on the university or the police to do something about it. permalink parent award report block reply worldowedexplanation 1 points 6 days ago Yes she can, they just do it at night off camera. permalink parent award report block reply\nworldowedexplanation 1 points 6 days ago Yes she can, they just do it at night off camera. permalink parent award report block reply\nMhmm2MoreWeeks 3 points 7 days ago Never. Which is why we got here in the first place. permalink parent award report block reply\nEgregiousPhilbin 3 points 7 days ago best we can do is condemn our own group chats permalink parent award report block reply\nTheRedPilledArtist 71 points 7 days ago They are toddlers throwing a tantrum because people disagree with their communism. permalink award report block reply HumphreyPlowjogger 10 points 7 days ago https://xcancel.com/FrontlinesTPUSA/status/1986254014447833265 permalink parent award report block reply TheRedPilledArtist 11 points 7 days ago Oh look, Sanpaku (psycho) eyes... permalink parent award report block reply thisaintitchief76 3 points 6 days ago Not enough punishment to matter. permalink parent award report block reply\nHumphreyPlowjogger 10 points 7 days ago https://xcancel.com/FrontlinesTPUSA/status/1986254014447833265 permalink parent award report block reply TheRedPilledArtist 11 points 7 days ago Oh look, Sanpaku (psycho) eyes... permalink parent award report block reply thisaintitchief76 3 points 6 days ago Not enough punishment to matter. permalink parent award report block reply\nTheRedPilledArtist 11 points 7 days ago Oh look, Sanpaku (psycho) eyes... permalink parent award report block reply\nthisaintitchief76 3 points 6 days ago Not enough punishment to matter. permalink parent award report block reply\nQuiznos585 68 points 7 days ago Update: ARRESTED & TRANS https://x.com/FrontlinesTPUSA/status/1986256303178870982 permalink award report block reply grannylovestrump OP 15 points 7 days ago thanks Quiznos permalink parent award report block reply Testamernt 8 points 7 days ago I guess I got to give him a little credit.  He fooled everyone until the mugshot came out. permalink parent award report block reply WildernessBro 2 points 6 days ago Nah man. Didn't you hear that fag's voice? permalink parent award report block reply ElectionMeddler 5 points 6 days ago Nice update Quiznos! Great news that the sheriff took it serious.  Now is the school going to do anything? Or is the DA going to quietly dismiss the charges? permalink parent award report block reply jamesbcrazy 2 points 7 days ago Predictable. permalink parent award report block reply\ngrannylovestrump OP 15 points 7 days ago thanks Quiznos permalink parent award report block reply\nTestamernt 8 points 7 days ago I guess I got to give him a little credit.  He fooled everyone until the mugshot came out. permalink parent award report block reply WildernessBro 2 points 6 days ago Nah man. Didn't you hear that fag's voice? permalink parent award report block reply\nWildernessBro 2 points 6 days ago Nah man. Didn't you hear that fag's voice? permalink parent award report block reply\nElectionMeddler 5 points 6 days ago Nice update Quiznos! Great news that the sheriff took it serious.  Now is the school going to do anything? Or is the DA going to quietly dismiss the charges? permalink parent award report block reply\njamesbcrazy 2 points 7 days ago Predictable. permalink parent award report block reply\nTrump454748 40 points 7 days ago Send her back to China. permalink award report block reply Testamernt 18 points 7 days ago Turns out it's name is justin.... and not female. permalink parent award report block reply Bendadick_Arnold 3 points 7 days ago Who is shocked?? permalink parent award report block reply Trump-16-20-24-28-32 1 points 6 days ago John Lithgow is shocked... shocked I tell you! permalink parent award report block reply dontdrinksoy 2 points 6 days ago Turns out it's name is justin.... and not female. OMG. What a soycuck. permalink parent award report block reply Covidrrhea 10 points 7 days ago Return to sender permalink parent award report block reply psychoticpartial 1 points 6 days ago Send him back to hell. permalink parent award report block reply\nTestamernt 18 points 7 days ago Turns out it's name is justin.... and not female. permalink parent award report block reply Bendadick_Arnold 3 points 7 days ago Who is shocked?? permalink parent award report block reply Trump-16-20-24-28-32 1 points 6 days ago John Lithgow is shocked... shocked I tell you! permalink parent award report block reply dontdrinksoy 2 points 6 days ago Turns out it's name is justin.... and not female. OMG. What a soycuck. permalink parent award report block reply\nBendadick_Arnold 3 points 7 days ago Who is shocked?? permalink parent award report block reply Trump-16-20-24-28-32 1 points 6 days ago John Lithgow is shocked... shocked I tell you! permalink parent award report block reply\nTrump-16-20-24-28-32 1 points 6 days ago John Lithgow is shocked... shocked I tell you! permalink parent award report block reply\ndontdrinksoy 2 points 6 days ago Turns out it's name is justin.... and not female. OMG. What a soycuck. permalink parent award report block reply\nCovidrrhea 10 points 7 days ago Return to sender permalink parent award report block reply\npsychoticpartial 1 points 6 days ago Send him back to hell. permalink parent award report block reply\ndangermousebuu 25 points 7 days ago Trans Man named Justin.\nWas arrested for disorderly conduct at 550pm today. permalink award report block reply N0rds 1 points 6 days ago Of COURSE it's an unhinged trannyfæggot permalink parent award report block reply\nN0rds 1 points 6 days ago Of COURSE it's an unhinged trannyfæggot permalink parent award report block reply\nHangemh1gh 20 points 7 days ago Nothing a bitch slap wouldn't fix. 🤷🏻‍♂️ permalink award report block reply DelendaEstMarxismo 4 points 7 days ago Then make her clean it up or she gets another one. permalink parent award report block reply redpillthenormies -3 points 7 days ago It sounds like you'd like her to slap you. permalink parent award report block reply\nDelendaEstMarxismo 4 points 7 days ago Then make her clean it up or she gets another one. permalink parent award report block reply redpillthenormies -3 points 7 days ago It sounds like you'd like her to slap you. permalink parent award report block reply\nredpillthenormies -3 points 7 days ago It sounds like you'd like her to slap you. permalink parent award report block reply\nSavingPrivateGrace 16 points 7 days ago Walks like a Tranny tucking it's junk. permalink award report block reply\nI_Am_John_Galt 13 points 7 days ago She wanted a reaction and they didn't give it to her.  The autists will, however. permalink award report block reply Trump-16-20-24-28-32 1 points 6 days ago The people working the table, essentially, were laughing. permalink parent award report block reply\nTrump-16-20-24-28-32 1 points 6 days ago The people working the table, essentially, were laughing. permalink parent award report block reply\nRiffFantastic 10 points 7 days ago They publicly executed the founder. Now they’re spiking the ball in our faces. permalink award report block reply\nthisisatestof2 10 points 7 days ago It amazes me how many adult children are walking around today.  I don’t think they were ever disciplined by their parents, told no, etc. permalink award report block reply\nThatsGold 8 points 7 days ago THAT'S A MAN; BABY! permalink award report block reply\nmlp67 8 points 7 days ago Make HIM famous.  It's a shim permalink award report block reply\nHanging_Chad 8 points 7 days ago I highly doubt that will get her expelled. disciplinary suspension is more likely permalink award report block reply hellohellohellohell 13 points 7 days ago \"Deported\" is the operative word here... permalink parent award report block reply ragnarokrobo 3 points 7 days ago But someone on Twitter tagged them and demanded they do something.. permalink parent award report block reply redpillthenormies 0 points 7 days ago I've never seen anyone get expelled for slowly turning over a table. People here are just being snowflakes. permalink parent award report block reply\nhellohellohellohell 13 points 7 days ago \"Deported\" is the operative word here... permalink parent award report block reply\nragnarokrobo 3 points 7 days ago But someone on Twitter tagged them and demanded they do something.. permalink parent award report block reply\nredpillthenormies 0 points 7 days ago I've never seen anyone get expelled for slowly turning over a table. People here are just being snowflakes. permalink parent award report block reply\n24601 8 points 7 days ago Violence is how they solve reality they don't like. permalink award report block reply\nknnbccb 7 points 7 days ago These creatures, you beat them up until they are wheelchair-bound, and those who do that get a pre-emptive pardon and an award. That's how you deal with their kind. Not go through the courtroom circus, where some of their comrades wear a judge's robe. permalink award report block reply\nbehemoth887 6 points 7 days ago pretty tame for a subhuman lib. they didn't even bring a weapon or attempt to take any lives. permalink award report block reply\nbriansoprano 5 points 7 days ago Nothing that a Super Soaker water gun filled with stale piss couldn't cure... permalink award report block reply\nhere2red 5 points 7 days ago Should start attaching electrodes to the bottom rim of the table permalink award report block reply\nBldg_2019 5 points 7 days ago I miss the old days of college in the 90s. Went to a pretty liberal school and we used to do things like fill a big fish bowl with cigarettes to hand out at the student union during earth day demonstrations back then. Libfags would just laugh and take a few. Then we’d all drink later that night at a bar or party. No violence. Zillennials suck. permalink award report block reply Trump-16-20-24-28-32 1 points 6 days ago I went to Kent State, very liberal.  We had 'Brother Chuck' who used to preach on the grounds of the student center at lunch and rile up all the liberal snowflakes.  I loved it. permalink parent award report block reply\nTrump-16-20-24-28-32 1 points 6 days ago I went to Kent State, very liberal.  We had 'Brother Chuck' who used to preach on the grounds of the student center at lunch and rile up all the liberal snowflakes.  I loved it. permalink parent award report block reply\nmlp67 4 points 7 days ago It's a tranny!!!! Not a she. It's a HE. https://xcancel.com/FrontlinesTPUSA/status/1986254014447833265 permalink award report block reply\nCommanderOfCheese 4 points 7 days ago #ViolentLeft permalink award report block reply\nDogpile1 4 points 6 days ago Violence seems to be the only thing they want. Give it to them. permalink award report block reply\nianpatrick1966 4 points 7 days ago Iowa pede here, checking in, 10 minutes from campus.  Tell me what is needed to be done. permalink award report block reply Prandogolio 3 points 7 days ago You know what needs to be done permalink parent award report block reply\nPrandogolio 3 points 7 days ago You know what needs to be done permalink parent award report block reply\nAwShitHereWeGoAgain 4 points 7 days ago Hang her!!!!! permalink award report block reply\nthrottlejohnson 4 points 7 days ago do they not have any security? guess we havn't learned a fucking thing. permalink award report block reply\nIAmDisappoint 4 points 7 days ago Punch her lights out, that should teach her. permalink award report block reply\nBoomShtick 3 points 7 days ago Looked like a chink permalink award report block reply\nKungPaoMcChicken 3 points 7 days ago 5 seconds later, table is back up... permalink award report block reply\nOodles 3 points 7 days ago An asian tranny should not be tough to track down in Iowa permalink award report block reply Bendadick_Arnold 3 points 7 days ago The demographics leave a possibility of … one permalink parent award report block reply\nBendadick_Arnold 3 points 7 days ago The demographics leave a possibility of … one permalink parent award report block reply\nMedicallyReddit 3 points 7 days ago The party of peace permalink award report block reply\nMeMargie 3 points 7 days ago An Armed society is a polite society. permalink award report block reply\nSeruna_Kanus 3 points 6 days ago Cultists tend to react violently to anything that challenges the brainwashing. permalink award report block reply\nRetardloserimsogay 2 points 7 days ago Why are our people just letting this happen? I mean I know Charlie wouldn't want escalation, but people get in fights, it happens and that's ok. Edit: now that I've thought about it, TPUSA is usually a guest on campus and it wouldn't do any good to get kicked off for fighting. permalink award report block reply\nLynnforthetruth 2 points 7 days ago Looks Chinese permalink award report block reply\nbuildthatwall45 2 points 7 days ago They got him. No surprise, another troon permalink award report block reply\nSaltish 2 points 7 days ago That's a man, baby. permalink award report block reply\n5DchessWatch 2 points 6 days ago TPUSA needs private security When someone does this, TPUSA kids hit a button. Suddenly 5 antifa-ninjas jump out, in all blackblock with their faces covered and everything.  They take giant pre-zipped at the top ziptie and put it over them, and ziptie their arms and trunk, and then their feet together so they cannot run, and take them down. They snatch the student up and take them away to a van,  citizens arresting them for vandalism, assault and battery (because they violently attacked the TPUSA people with a Table). The security people take them off campus to the REAL police because campus police are fake and gay and don't do anything. Otherwise this wouldn't continue happening They drop them off in front of the police station with a list of their charges, and a sousveillance video of their actions, and the TPUSA video of them doing it, and then the charges on paper literally stapled to their chest.   They blow a loud whisle, or set off a starting gun and drive off Official story is that TPUSA doesn't know anythign about the good samaritan security team permalink award report block reply\nAllisterTwo 2 points 7 days ago https://ww1.johnsoncountyiowa.gov/Sheriff/jailroster/details/136876 permalink award report block reply\nProtonboy 2 points 7 days ago Whatever happens: DO NOT CALL CAMPUS SECURITY; or police. permalink award report block reply\nnewuser8 2 points 7 days ago he sounded like a man from the first few seconds permalink award report block reply\ngrannylovestrump OP 2 points 7 days ago https://x.com/libsoftiktok/status/1986168911927058707 permalink award report block reply\nBobDolesBanana 2 points 7 days ago The nutter is an asian tranny. Did the same last week near the same location to a YAF table. Nobody is gonna do squat in this town about (Iowa City). What do you expect would happen? permalink award report block reply\nProbably_tryna_sleep 2 points 7 days ago They should really tapcon the tables down so we can watch the retards try and fail at flipping the tables over… Come to think of it, you could probably put some ankle weights on the table legs for the same effect lol permalink award report block reply\nRedWave26 2 points 6 days ago Oh the outrage! More X posts!!! permalink award report block reply\nJackOfAllTirades 2 points 6 days ago The milquetoast, measured response pisses me off. Until we start beating these commie bastard's faces into the pavement, nothing will change. permalink award report block reply\nChickensaurus 2 points 7 days ago Apparently the majority of American supports this hate. permalink award report block reply\nredinmn 2 points 7 days ago It would be so sad if the edge of the table was razor sharp or had some metal burs on it. permalink award report block reply\nACActual 2 points 7 days ago We need to make stupidity painful permalink award report block reply\nLive_free_or_die_55 2 points 6 days ago Deport this bitch!!! permalink award report block reply\njlange94 2 points 7 days ago Just continue doing nothing. Don't even push them. Just let them continue wrecking our property and kill us. Fucking spineless. permalink award report block reply grannylovestrump OP 1 points 7 days ago In the art of war you never interrupt your enemy when they are kicking their own ass permalink parent award report block reply jlange94 1 points 7 days ago All we've been seeing is them kicking our asses and killing us. And now we're losing public support. Tell me again how Sun Tzu is just going to roll over and let his enemy kill him. permalink parent award report block reply\ngrannylovestrump OP 1 points 7 days ago In the art of war you never interrupt your enemy when they are kicking their own ass permalink parent award report block reply jlange94 1 points 7 days ago All we've been seeing is them kicking our asses and killing us. And now we're losing public support. Tell me again how Sun Tzu is just going to roll over and let his enemy kill him. permalink parent award report block reply\njlange94 1 points 7 days ago All we've been seeing is them kicking our asses and killing us. And now we're losing public support. Tell me again how Sun Tzu is just going to roll over and let his enemy kill him. permalink parent award report block reply\nWildernessBro 2 points 6 days ago Honestly annoyed. Why are all the conservatives that do these things the most limp-wristed types, and why do they not have some guys that are a little more muscle bound with them if they're going to do it? At least make it so the leftists don't just go into these situations thinking they're some billy badass and can actually catch repercussions. So many videos of people's signs being stolen, tables being flipped, people being assaulted, having their hats snatched. Ask for volunteers for security and plenty will offer up to do it even if it means some repercussions. This shit about just being morally superior and \"turning the other cheek\" and saying \"wow can you imagine if the roles were switched?\" is so fucking cucked. It's not a virtue. permalink award report block reply\nUltraMagaWA 1 points 6 days ago Looks like Chinese operative that was placed in that school, go back to china permalink award report block reply\nNomad899 1 points 7 days ago https://www.mace.com/collections/triple-action Just give a dose or two permalink award report block reply\nHunterBidensPC 1 points 6 days ago Start bringing pepper spray. It would make these videos ten times better permalink award report block reply\nBrionK 1 points 6 days ago Don't care, you in college you get what you deserve permalink award report block reply\nGoozmania 1 points 7 days ago Why not just beat the shit out of her, instead of crying about it? permalink award report block reply\ncorntortilla 1 points 7 days ago Holy fuck! Breaking news, leftist idiot turns over table. Omg! End of te world, what will we do? permalink award report block reply\nCleverlynamed 1 points 6 days ago Remember the guy that electrified Trump yard signs?  Something like that would be fun to watch. permalink award report block reply\npeekov4 1 points 6 days ago BREAKING BREAKING BREAKING! permalink award report block reply\nSmeg 1 points 6 days ago So why didn't they flip him over? permalink award report block reply\nOldman1234 1 points 6 days ago People think that what this trans person did was a criminal act but what really happened is called a \"resume enhancement\".  Getting arrested doing this kind of stuff (and eventually having all charges dropped by the local Dem Prosecutor and Dem Activist Judge) demonstrates to future employers their unwavering loyalty to the far left woke progressive Dem Party.  Let the job offers pour in! permalink award report block reply\nconservativefrank 1 points 7 days ago They just stand there doing nothing. permalink award report block reply\nRedEnsign4Trump 1 points 7 days ago Some autistic chink too permalink award report block reply\nFORMERCHILDSTAR 1 points 7 days ago She's a good little nazi. permalink award report block reply\nYesImWhite 1 points 7 days ago violence against women! lol permalink award report block reply\nJDVance4President28 1 points 7 days ago Lol I'm sure do nothing pam will get right on it. permalink award report block reply\nHagatha 1 points 7 days ago Justin Calhoon, the trans nut, FAFOed. permalink award report block reply\nRyker 1 points 6 days ago Can someone explain to me why this keeps happening? Are you sure it’s not because you’re a bunch of pussies that wont stand up for themselves? Are you sure this pacifism brings you closer to Christ? Or are you more  like that ‘friend’ no-one can count on when the going gets though? permalink award report block reply\nmateus 1 points 7 days ago How about posting when they're finally arrested, or someone has the balls to STOP them? 😉 As I've said here on multiple occasions, they need some ALPHA males at those tables, not betas who stand watch them knock things over then giggle about it. Same crap, different day, and it shouldn't be stickied. permalink award report block reply grannylovestrump OP 1 points 7 days ago they were arrested. someone posted link here in the one of the comments permalink parent award report block reply\ngrannylovestrump OP 1 points 7 days ago they were arrested. someone posted link here in the one of the comments permalink parent award report block reply\ntlorsung 1 points 7 days ago They are only going to continue their bad behavior!   Only Evil doesn't want you to teach Lessons to haters, but GOD does!  You are not spreading Charlie's Messages if you don't!  Help that table topper! permalink award report block reply\nYheymos 1 points 6 days ago HER? wtf... HER? No. This is yet nothing man. That voice? Come on! permalink award report block reply\nsuckmycorona 1 points 7 days ago They didn’t follow her? permalink award report block reply\nHockeyMom4Trump 1 points 7 days ago The lefties are so violent and destructive. If she does not like their booth she could just keep on walking. permalink award report block reply\nIAmNotAnAutist 1 points 7 days ago Fukking weak bitches.  Our side is so full of pussies. permalink award report block reply\nOZJRant 1 points 6 days ago No it would be easier and to make an example of this POS by physically slapping her!\nMy father once said the difference between me and your mum is this red right hand? That’s why republicans lose because they always bring a knife to a gunfight metaphorically speaking of course permalink award report block reply\nEdge9876 1 points 6 days ago Next time just keep a bottle of bear mace right there. Dust that bitch. permalink award report block reply\nMocksFordComma 1 points 7 days ago It's amazing to me that they have no clue how shitty they are as people. permalink award report block reply\njosiborg 1 points 7 days ago Iowa is cucked permalink award report block reply midwestdeplorable 2 points 7 days ago No, IA is not cucked. This is Johnson County we are talking about. One of three counties in this state where you have a ton of TDS infected people. This is not representative of our state.\nI'm actually here for a few days and it's like I stepped into the twilight zone compared to back home. permalink parent award report block reply josiborg 0 points 7 days ago Polk Co is super cucked and Dallas is way more cucked than you're gonna give it credit for. It just had an illegal with a mile long rap sheet making $300k because the board was full of thirsty ugly bitches seething for black cock and a girl raped by an illegal with a corn cob who's parents took in another to show the world they're not racist. The National Muslim Association moved to Des Moines from DC for more political pull and the mosque to church ratio is closer and closer to 1:1 everyday. Jeff Link was a big factor in getting Obama elected/reelected. Ames was the first tranny library session with children to get national attention. Holy shit the Branstadt Family and that's all I need to say. What's her name dipshit curly hair retard that just recently died from taking 28 or something COVID jab boosters. King Maker Bob Vanderplatts repping Ted Cruz in 2016. Do I need to continue? Go jack someone else off with your butt cheeks and leave people alone that know what the fuck they're talking about. Iowa is cucked. permalink parent award report block reply\nmidwestdeplorable 2 points 7 days ago No, IA is not cucked. This is Johnson County we are talking about. One of three counties in this state where you have a ton of TDS infected people. This is not representative of our state.\nI'm actually here for a few days and it's like I stepped into the twilight zone compared to back home. permalink parent award report block reply josiborg 0 points 7 days ago Polk Co is super cucked and Dallas is way more cucked than you're gonna give it credit for. It just had an illegal with a mile long rap sheet making $300k because the board was full of thirsty ugly bitches seething for black cock and a girl raped by an illegal with a corn cob who's parents took in another to show the world they're not racist. The National Muslim Association moved to Des Moines from DC for more political pull and the mosque to church ratio is closer and closer to 1:1 everyday. Jeff Link was a big factor in getting Obama elected/reelected. Ames was the first tranny library session with children to get national attention. Holy shit the Branstadt Family and that's all I need to say. What's her name dipshit curly hair retard that just recently died from taking 28 or something COVID jab boosters. King Maker Bob Vanderplatts repping Ted Cruz in 2016. Do I need to continue? Go jack someone else off with your butt cheeks and leave people alone that know what the fuck they're talking about. Iowa is cucked. permalink parent award report block reply\njosiborg 0 points 7 days ago Polk Co is super cucked and Dallas is way more cucked than you're gonna give it credit for. It just had an illegal with a mile long rap sheet making $300k because the board was full of thirsty ugly bitches seething for black cock and a girl raped by an illegal with a corn cob who's parents took in another to show the world they're not racist. The National Muslim Association moved to Des Moines from DC for more political pull and the mosque to church ratio is closer and closer to 1:1 everyday. Jeff Link was a big factor in getting Obama elected/reelected. Ames was the first tranny library session with children to get national attention. Holy shit the Branstadt Family and that's all I need to say. What's her name dipshit curly hair retard that just recently died from taking 28 or something COVID jab boosters. King Maker Bob Vanderplatts repping Ted Cruz in 2016. Do I need to continue? Go jack someone else off with your butt cheeks and leave people alone that know what the fuck they're talking about. Iowa is cucked. permalink parent award report block reply\nCorse46 1 points 6 days ago The D party just learned that assasinating republicans gets them election landslides. They have no reason to stop permalink award report block reply\nUSNVET71 0 points 7 days ago Face full of bear spray should do the trick permalink award report block reply\nUSNVET71 -1 points 7 days ago Some people are just not mentally stable, and shouldn't be allowed to walk the streets permalink award report block reply\nSnek_Plissken -3 points 7 days ago another CCP national. permalink award report block reply\nILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply\nILoveGoatFucking 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nPrandogolio 1 points 7 days ago Comment removed by community moderators. permalink award report block reply"
}