{
  "id": "1ARK514PX2",
  "url": "https://patriots.win/p/1ARK514PX2/djt-thanksgiving-dinner-is-25-lo/c",
  "content": "1338 DJT: Thanksgiving dinner is 25% lower than 2024 Thanksgiving dinner posted 6 days ago by negative_entropy 381 comments award share download report block\n381 comments Sort by Top Top New Worst Old Save RiffFantastic 154 points 6 days ago Affordability issue is not dead. It’s disingenuous coming from democrats, but affordability is a high priority issue for Americans. We’ve been through the wringer with Biden. The employment market is also bad right now so Americans aren’t feeling the savings yet. permalink award report block reply LiterallyKaiser 128 points 6 days ago Beef is $8-10 a pound Milk is $2.50-4 a gallon. Cereal is $5 a box, I don’t even buy that anymore. I skip breakfast instead. Spaghetti is $1.25-2 a box. A can of beans is $1-1.40. A can of corn is $1-1.25. Bread is $2.25-5 a loaf. I don’t even bother looking at how much apples or fruit cost. I try going for canned fruit when I can but it’s still damn near $1.50-2 for a can of oranges. You can forget “snacks”. $5 for a bag of chips, and it’s half as much as it was in 2020. Only thing that’s still moderately cheap is frozen veggies. Which I eat a lot of now as a result. Gas is $3 a gallon. These prices ARE NOT CHEAP. They’re all up 20-40% from what they were in 2020. I remember the days when you could get a huge box of Aldi spaghetti for 99 cents. A load of bread at Aldi was 85 cents for the cheapest crap. Now you go in, not only are the options more limited, but they’re also smaller and cost way more. $1.25 for spaghetti and $1.50 for bread. Meanwhile I’ve gotten maybe a cumulative 10% raise over that span of time. I’m tired of hearing about subsidies for AI. I’m tired of corporate tax cuts. I’m tired of billions going to Argentina and Israel and nothing being done for me. permalink parent award report block reply deleted 53 points 6 days ago Spindle-spin -14 points 6 days ago We need to cut taxes and lower the corporate tax rate. There's no way companies can achieve profits and lower prices if they're being taxed. The only way companies lower prices is if they feel gains. President Trump has given us one of the best, strongest economies in decades, but Democrats clogged up the pipeline so that we're not directly feeling it because everyone is paying taxes. permalink parent award report block reply Freeth3usa 26 points 6 days ago You’re completely wrong because people in general give zero shits about corporate profits when less then 20% of the country feel any gain from the stock market , and less then 1% of the country gets a a significant raise, cash, or stock bonus from them. Republicans and unfortunately it includes maga have become beholding to corporate riches that 85%+ of the country would rather see replaced with small business. Buisnesss where individuals/owners who make decisions for that small business are held accountable for good or bad. Instead of CEO’s who indirectly kill, harm, destroy workers, consumers, etc and get off being richer with zero recourse most of the time. permalink parent award report block reply AerialRush 5 points 6 days ago Muh GDP doesn't matter. Japan has had a stagnant GDP since 1990 and its leagues ahead of what America used to be in 1990. permalink parent award report block reply YouEssAye 5 points 6 days ago President Trump has given us one of the best, strongest economies in decades Jesus Christ dude, what in the fuck are you talking about? permalink parent award report block reply view 2 more comments... LawyersPlayDota 3 points 6 days ago The only way companies lower prices is if they feel gains Or if they're presented with a greater threat than lower profitability. Which we need to start making. permalink parent award report block reply view 1 more comments... Emodius 0 points 6 days ago Absolutely. People don't understand how bad things were under Biden, nor do they understand how corporate taxes affect them. It also takes some pain to right the ship because this shit was in a nose dive, by design when Biden was done. People are still feeling the pinch and are tired of it, I get that but we literally may have been bankrupt by now of kamala had won. The fact that people aren't feeling how much better shit is shows how much pain we were all in permalink parent award report block reply ToxicAvengerOhio 35 points 6 days ago Lots of people have revisionist history for Reagan around here and shit on him constantly but Trump will be given the same treatment 10, 15 years from now unless he finds his sack and stops the cucking. permalink parent award report block reply UsernameChexOut 11 points 6 days ago Some are already there, just saying permalink parent award report block reply flashersenpai 6 points 6 days ago I sincerely wonder if this is the Trump we would have gotten 1st term if he wasn't targetted with a fed op. At which point they should have just let him be and he might not have gotten elected again over Rubio/Cruz/DeSantis/etc There was all this big noise about the revenge tour 2024 and instead we have Bondi and Patel. permalink parent award report block reply Emodius -6 points 6 days ago Fuck them. They don't see how good they have it. They are our answer to Zohran Mamdani voters. They expect instant success. The shit takes time. permalink parent award report block reply view 2 more comments... snoopy3210 4 points 6 days ago It’s a bad look to mix lowering the increase in prices and lowering prices.  Trump should know better permalink parent award report block reply TPMJB 3 points 6 days ago Reagan fucked us over with Iran-Contra and granting 6 million illegals in California amnesty, in exchange for a border wall that never materialized. All the Republicans who praise the ground he walked on are cucks. permalink parent award report block reply ToxicAvengerOhio 1 points 6 days ago The biggest painting in Trumps oval office is of Reagan 🤷‍♂️ permalink parent award report block reply view 1 more comments... DCYR66 31 points 6 days ago Yeah still waiting for affordability here in Florida. Sorry Mr President but not seeing it yet! permalink parent award report block reply Aggrieved03 19 points 6 days ago No one is permalink parent award report block reply Appeal2Heaven98 23 points 6 days ago I think that's why people are finding socialism more favorable. Yes, it doesn't help that universities are basically socialist education camps. But when an entire generation enters the job market and has seen nothing but inflation and an increase in costs of expenses without significant pay raises to give any relief, no wonder \"free shit\" appeals to them. permalink parent award report block reply Klaus73 1 points 6 days ago I mean....do you take a chance on the guy that offers to give you food...or the guy that claims your not starving? permalink parent award report block reply killedmytv 1 points 6 days ago Everybody loves Santa Claus, especially overgrown children permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply tt777 19 points 6 days ago Prices are never coming down noticeably after the rampant inflation. permalink parent award report block reply Tacotuesday867 8 points 6 days ago Stolen elections have consequences permalink parent award report block reply PhilipeNegro 5 points 6 days ago The day people realize we can’t share a society with them is the day everything changes permalink parent award report block reply load 47 more comments... Krat 48 points 6 days ago Affordability is the result of being looted and invaded ... itll eventually be to a point where theres nothing left permalink parent award report block reply DeportThemAllForever 26 points 6 days ago Inflation, they created during covid years where Biden was dropping piles of cash at corporations really fucked us.  All prices are higher, especially food and housing.  And that PPP was a giant scam, free money for scammers. We still have inflation out here.  Housing tripled in price. Food doubled.  Half of our city would starve if there weren’t discount grocery stores.  It’s sad and humbling when you hear that peoples goal is to make enough money to be able to walk into grocery store and be able to afford more than just generics. permalink parent award report block reply Simple_Doot 19 points 6 days ago Printing money causes inflation.  Trump prints and spends like the worst of them.  DOGE cuts are a joke compared to the increased spending.  Nothing has changed with spending in decades and if you point it out youre attacked. permalink parent award report block reply deleted 2 points 6 days ago view 1 more comments... CommonSenseAmerican -1 points 6 days ago Gross generalization, no cuts are a joke, Trump got tax on tips removed as well as tax on social security retirement. Trump is doing what must be done as far as spending goes to refinish rebuilding a broken military system and many other things too long to post. It's global inflation also not just the USA. permalink parent award report block reply view 1 more comments... HoganP 19 points 6 days ago I've made this point before and I'll reiterate yours, again.  They completely fucked us with the inflation because it's the economic equivalent of getting pee out of a swimming pool.  It's not something that just turns on and off with policy.  The effects, that is. permalink parent award report block reply flashersenpai 2 points 6 days ago hold on one of the reasons Massie is on Trump's shit list is that he held up all the Covid money for spending reasons and lack of individual payments Trump is part of this inflation permalink parent award report block reply Returningtogod 1 points 6 days ago They stole an election, looted the treasury, then pardoned themselves on the way out. permalink parent award report block reply Hanging_Chad 32 points 6 days ago less food stamps ➜ lower food prices 📉 permalink parent award report block reply BidensBodyDouble 3 points 6 days ago Cut food stamps for the millions abusing it. Deport the illegals. Crush the demand and we'll see prices come down to move product. permalink parent award report block reply DT170x -10 points 6 days ago You how you can tell A thread is being shilled/astroterf to hell. Low Thread Upvote to unusually high comments and/or Very High activity on non busy hours. permalink parent award report block reply Dontbeafraid 10 points 6 days ago Im a retarded faggot, did your algorithm account for that? permalink parent award report block reply DT170x -2 points 6 days ago You are a Retarded faggot,but Retarded Faggots need love too. permalink parent award report block reply mikejones 2 points 6 days ago This was also posted yesterday too. permalink parent award report block reply deleted 23 points 6 days ago yuge_covfefe 2 points 6 days ago I guess this issue is polarizing which I hope is good news (at least some people feel it's improving?). For my part I make a very decent income by historical standards, and while I'm not drowning or anything, I'm still well outside of my comfort zone. Forget about saving money, I'm just happy to be keeping my house atm. So this remains a top issue for me and most people I know. I don't think it's Trump's fault that prices have been stubbornly high. But I do think it's premature of him to be claiming victory, and a move that could cost him some of his support. It's categorically untrue to say that things are suddenly affordable to most people. I suspect he's realized how fucked it all is. Prices aren't going to deflate - they will, at best, inflate more slowly - and our best hope is probably to look for wage increases. Not that I've seen one of those keep pace with inflation over the past several years, either. In terms of raw buying power I'm down something like 30-40% since 2020, still today. Losing faith I'll ever get back to where I was, relatively speaking. Again, not super uncomfortable though, and thankful for that. permalink parent award report block reply MastaJoda 6 points 6 days ago ''Let them eat cake.'' Trump permalink parent award report block reply ToxicAvengerOhio 6 points 6 days ago \"From Walmart. Mmmmm\" permalink parent award report block reply load 12 more comments... lurkwellmyfriends 96 points 6 days ago Not great messaging. This is like the Potato regime's july 4th hot dogs are 16 cents cheaper while your life is falling apart messaging. Most of us understand that recovery and course correction takes a long time. You can't tell struggling people that they're not struggling, though. \"No, no, prices are way down\". They're just going to reject you as someone out of touch that only cares about what's best for DC. The messaging needs to be that the course corrections have been made and help is on the way. And the all Israel, all the time neocon bullshit has to go and never be mentioned again. permalink award report block reply HockeyMom4Trump 38 points 6 days ago Prices are down, but the ballroom is up…not great messaging when people KNOW prices still suck and they will never ever set foot in the ballroom cause they are too busy working to feed their families and have to compete for food with SNAP benefits and illegals. permalink parent award report block reply MastaJoda 25 points 6 days ago ☝ Trumps messaging is basically ''Let them eat cake.'' permalink parent award report block reply UCantStumpTheTrump -4 points 6 days ago Lmfao. Maybe you should be looking at his actions then. https://www.dhs.gov/news/2025/11/05/dhs-delivers-historic-start-border-crossings-fy-2026 Trump is delivering on as many of his promises as he can, and people like you are shitting on him because you’re not getting EXACTLY what you wanted permalink parent award report block reply yuge_covfefe 7 points 6 days ago Yeah I watched the ballroom drama bs play out like ok, whatever. But I don't get why Trump pushed for it in the first place. People are hurting domestically; they need him to cut spending, not spend even more. I get that it's a drop in the ocean and meaningful cuts are mostly out of his control. But it's such bad messaging. permalink parent award report block reply NeoDragoon 8 points 6 days ago It was privately funded, no tax money went into the ballroom, the disinformation is why it's a big deal. permalink parent award report block reply maverick202 4 points 6 days ago Nobody is going to fund it privately unless they get something out of it. Disinformation is coming from both sides. permalink parent award report block reply yuge_covfefe 1 points 6 days ago That is nice to hear. Hopefully more people realize this. permalink parent award report block reply NukeTheTroons 3 points 6 days ago Exactly! He’s out of touch! permalink parent award report block reply UCantStumpTheTrump -4 points 6 days ago LOL as if President Kamala Harris would have been more in-touch with the American voting public? Get fucked you shill faggot permalink parent award report block reply NukeTheTroons 4 points 6 days ago I never said that. You sound like a fucking tween. We can ctritize our when we feel like he’s messing up and still support him. permalink parent award report block reply view 1 more comments... TrumpYouMagaFrenner 20 points 6 days ago Hey pal thats a bunch of malarkey dog faced pony soldier. permalink parent award report block reply KekistanPM 15 points 6 days ago A good friend of mine was in dire financial straits until he got a good job. He has a positive cash flow now; and despite living austere for months, he still asks me for help sometimes because of his mountain of credit card debt. Even if millions of Americans saw their wages overtake inflation overnight, I bet many are still struggling with that kind of debt. permalink parent award report block reply ImWhiteAndThatsOK 9 points 6 days ago I used to be against bankruptcy being a staunch believer of accountability. However, these banks allow people to over-leverage themselves, and then charge usurious interest that traps them into lifelong debt. Fuck the banks. File bankruptcy. permalink parent award report block reply DontTreadOnSnek 3 points 6 days ago You just described usury, which under Bibical law was illegal. They also had debt jubilee where every 7 years your outstanding debts were forgiven. permalink parent award report block reply NukeTheTroons 5 points 6 days ago Trump has been rubbing me the wrong way lately, bragging about the stock market while we can’t afford a basic truck anymore yet alone a house permalink parent award report block reply NonbinaryPotatohead 4 points 6 days ago Came here to say the same thing. permalink parent award report block reply load 4 more comments... JoeMcCarthyWasRight 86 points 6 days ago Not for me and my family. permalink award report block reply memeYourDreams 3 points 6 days ago Yea, survivability issue is what's dead, cause they died. permalink parent award report block reply tribunabessica 3 points 6 days ago No kidding. Too bad we don't only live during Thanksgiving dinner. Who feeds him these bullshit numbers? permalink parent award report block reply Based-SW-Engineer -2 points 6 days ago I'm gonna go ahead and say that you just don't remember last year. Sure prices are still way higher than they were 4-5 years ago. But compared to last year it's still way less, and 25% feels about right across the board. Groceries aren't going to drop by 4x in just 9 short months. permalink parent award report block reply pollsarefake -57 points 6 days ago That’s because you are a broke beta cuck and not an alpha like Trump No one will give you a handout you commie faggot permalink parent award report block reply Bythrfruitsyknow 34 points 6 days ago not an alpha like Trump simping ain't easy homo. permalink parent award report block reply HockeyMom4Trump 15 points 6 days ago You sound like you need to get back to math class before the teacher notices your empty seat. permalink parent award report block reply BigMikesSwingingCock 5 points 6 days ago It's just Anaconda being a faggot sperg. permalink parent award report block reply Aquamine-Amarine 13 points 6 days ago You're fucking stupid. Everyone's financial situation is different. permalink parent award report block reply pollsarefake -5 points 6 days ago If you want communism, gtfo This is America We respect strength and wealth permalink parent award report block reply PhilipeNegro 3 points 6 days ago You are such an immense faggot. It truly is amazing to witness. permalink parent award report block reply covok48 4 points 6 days ago How have you not been deported yet? You’ve been here a year and managed to be an asshole in every thread. Edit: Anaconda. Ah, yes. permalink parent award report block reply TitsOutForIsrael 2 points 6 days ago what an odd thing to say permalink parent award report block reply TrumpYouMagaFrenner -57 points 6 days ago Must be on snap permalink parent award report block reply Deplorable_Yankee 33 points 6 days ago Another asshole insult. Glad you are doing well. What the fuck is wrong with you people?  Trump speaks and nobody can refute the claims.  Bullshit. permalink parent award report block reply bleeje 16 points 6 days ago Bec. they're paid shills dude. Everyone should be very concerned that we're back to 2019-early 2020 levels of pure nonsense and bullshit. But they're not. They don't care. Lies matter more to them than honesty. And someone is ALREADY paying these shills to lie. Imagine how bad the polling must be if less than a year into this term, they're already shills getting paid by somebody to lie. permalink parent award report block reply LiterallyKaiser 4 points 6 days ago Asking for your government to enact policy that helps your family’s financial situation? That sounds like socialism bro I don’t know. How about some corporate tax cuts and foreign aid to Argentina instead? permalink parent award report block reply JoeMcCarthyWasRight 8 points 6 days ago Taxing the fuck out of me to fund Israel’s wars and to fund NGOs to destroy my homeland from the inside out through mass illegal immigration and propaganda is called what now? permalink parent award report block reply view 1 more comments... covok48 1 points 6 days ago That’s the whole point of government, to improve the lives of its citizens. I don’t know what third world shithole you live in, but that’s the expectation in the West. permalink parent award report block reply view 1 more comments... TrumpYouMagaFrenner -9 points 6 days ago Im joking calm yourself permalink parent award report block reply JoeMcCarthyWasRight 6 points 6 days ago Work my ass off, faggot. permalink parent award report block reply covok48 6 points 6 days ago Dude, you don’t even have a job. Fuck off. permalink parent award report block reply TrumpWonByALandslide 50 points 6 days ago He should really stop downplaying this. Affordability is a real issue whether or not prices of certain items have gone down. Tariffs have caused price increases on many goods (I agree with the tariffs for the good of the country and less reliance on foreign countries but still an important point). People are losing their jobs due to H1Bs, outsourcing, and AI. Home ownership is dead. PEOPLE CAN'T AFFORD SHIT!!! permalink award report block reply ToxicAvengerOhio 14 points 6 days ago He's even more ego driven than Ofagma. I didn't think that was possible. So when he see a claim that Walmart just made, he HAS to jump on it. \"See what I did!!!\" permalink parent award report block reply DontTreadOnSnek 8 points 6 days ago Yes and he didn't realize that this year's meal is less items and none are name brand. permalink parent award report block reply akai_ferret 9 points 6 days ago It's a big error on Trump's team and the democrat \"fact checkers\" have pounced. This \"walmart thanksgiving dinner\" is only cheaper because the items included changed to be cheaper. It's such a big fuckup I wonder if its sabotage from a rat in the WH who knew Trump would just tweet it. permalink parent award report block reply Solo_Dad 2 points 6 days ago The President generally isn't creating the tweets.  Most are things he approves from staff like Wiles or Miller.  Watched it first hand during the campaign.  Was present when \"Tampon Tim\" was blurted out by sr campaign staff and it was tweeted in minutes, I liked Timpax personally but I digress.  This probably wasn't him but he probably approved it.  Its tone deaf as hell. permalink parent award report block reply flashersenpai 2 points 6 days ago Wiles boo! boo this woman! permalink parent award report block reply Solo_Dad 2 points 6 days ago One time she pointed out to a motorcade driver that he was really close to construction cones on the passenger side.. the driver was avoiding hitting 3-4 LEOs who all almost hit each other then the motorcade.  Never figured out why some staff thought she was such a genius.  I felt like she was totally out of touch with the base... much like this tweet. permalink parent award report block reply MemeLawd 4 points 6 days ago The only reason prices lowered is because they were inflated last year due to bird flu permalink parent award report block reply pollsarefake -16 points 6 days ago Tariffs have led to prices going down not up The other countries are paying us money which is making us rich leading to lower prices permalink parent award report block reply Deplorable_Yankee 18 points 6 days ago Show me where prices went down. I’m not seeing that and the dozens of people bitching at work about how expensive living is now certainly aren’t saying that. permalink parent award report block reply HockeyMom4Trump -7 points 6 days ago I can objectively say eggs. They are now around $1.89 a dozen near me. Before, it was much more. permalink parent award report block reply MastaJoda 12 points 6 days ago eggs was a simple fix since it only takes a few months to go from egg to producing chicken...once you stop slaughtering them over bird coof. permalink parent award report block reply BigBadMagaMan 10 points 6 days ago Eggs are cheaper. That also has nothing to do with tariffs. permalink parent award report block reply yuge_covfefe 1 points 6 days ago Money's being paid to the federal government so you're half right. But that same money increases the prices for the consumers, because somebody's got to pay it. Until the feds lower tax rates or issue tax credits (fat chance on either) to reimburse us for those raised costs, the prices at the end of the day are absolutely higher to the people paying them - us. If and when domestic production ramps up, those price increases ought to disappear, or else wages will rise to compensate. So it's a long game, and one that I personally support. But let's be honest about what's really going on. permalink parent award report block reply drmrboy 0 points 6 days ago 🤫 permalink parent award report block reply Porkbut 3 points 6 days ago Why are you gay? permalink parent award report block reply NewGovModOnDutyBans 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply drmrboy 47 points 6 days ago So fucking what. Lol. Get Israel out of our government.  That'll be a better Thanksgiving present to your voter base.  Also ... lower our grocery prices ... all of them, not just Walmart turkey.  🤓 permalink award report block reply DT170x -32 points 6 days ago Name me Store chains in America in the top of your head. I bet you are NOT from America and only here to cause division. Then again you hate MAGA and you just put on a MAGA face. permalink parent award report block reply Glory-Unto-God 10 points 6 days ago Just store chains or you want other stuff that sorta fits as a store for those of us that use our hands as well while i piss all over the golden calf. Hobby lobby, Lowes, walmart, technically aldi(german but its here), home depot, Hoffman, Johnstone, lennox (garbage i hate them), Publix, etc etc. Kick out the yids, kick out the jeets, kick out the blacks roaming the streets, kick out the Muslims. Kick them all out. We have a country's soul to worry about. permalink parent award report block reply MegoThor 2 points 6 days ago Kick out the yids, kick out the jeets, kick out the blacks roaming the streets ”It’s like poetry, they rhyme.” -George Lucas permalink parent award report block reply getup 1 points 6 days ago Cope harder you dumb faggot. permalink parent award report block reply drmrboy -3 points 6 days ago 🤫 permalink parent award report block reply DT170x 1 points 6 days ago I don't block people. I tend to call out obvious BS and that currently is you. permalink parent award report block reply HockeyMom4Trump 5 points 6 days ago He could not name one grocery store, apparently. permalink parent award report block reply view 1 more comments... assblast 43 points 6 days ago Outright lie. \"America First\" has been \"every other country's wars and issues first\" and I'm getting sick and tired of it. Why does he not have people's heads on a platter for not ending the filibuster? Why does he just yell into the void all the time? permalink award report block reply DontTreadOnSnek 1 points 6 days ago Trump is the physical embodiment of the \"old man yells at clouds\" meme. permalink parent award report block reply UCantStumpTheTrump -1 points 6 days ago Yeah because everything would be so much better if Kamala had “won.” Liberal retard land is that way 👉🏻 permalink parent award report block reply UCantStumpTheTrump -1 points 6 days ago Fuck off doomer shill. Trump is delivering on tons of promises, you’re just here to try to “divide the base.” You are not MAGA permalink parent award report block reply necrosexy -2 points 6 days ago Ending the filibuster? Are you retarded? permalink parent award report block reply YouEssAye 2 points 6 days ago We have control of the house, Senate, and presidency yet what the fuck has actually been accomplished? ~400k deportations, out of 40 million? He has 1 more year to accomplish anything before the left retakes Congress. If he were serious about fixing the country, he would've forced congress to end the filibuster 6 months ago and rammed through everything we voted for, the left couldn't stop a thing. permalink parent award report block reply NewGovModOnDutyBans -1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago right, I’m sure Kamala Harris would be doing a much better job. Fuck off back to liberal retard land you faggot permalink parent award report block reply killedmytv 34 points 6 days ago In related news, a head of lettuce has decreased from 99 cents to $2.39 in just a few years. permalink award report block reply bearhugprolapse 30 points 6 days ago how tone deaf can you be? permalink award report block reply cyberwar 28 points 6 days ago bullshit, this is a Biden Level lie permalink award report block reply Deplorable_Yankee 27 points 6 days ago Hey Don. I don’t have millions of dollars at my disposal. Affordability is still a HUGE issue. permalink award report block reply TrumpYouMagaFrenner 26 points 6 days ago Dont see it permalink award report block reply akai_ferret 8 points 6 days ago It's a big error on Trump's team and the democrat \"fact checkers\" have pounced. This \"walmart thanksgiving dinner\" is only cheaper because the items included changed to be cheaper. It's such a big fuckup I wonder if its sabotage from a rat in the WH who knew Trump would just tweet it. permalink parent award report block reply pollsarefake -31 points 6 days ago That’s because you are a welfare queen looking for a handout permalink parent award report block reply TrumpYouMagaFrenner 18 points 6 days ago Nah probably because $100 doesnt afford a week's groceries. Maybe because I live in illinois. permalink parent award report block reply MAG-n-KAG 10 points 6 days ago I live by myself in deep red country.  I go to the grocery store once a week, and I ONLY buy things I will eat that week.  It costs about $80 bucks.  Thats just for one person, for one week.  I cant imagine how much itd be for a family with 2-3 kids. permalink parent award report block reply flashersenpai 6 points 6 days ago damn permalink parent award report block reply NonbinaryPotatohead 6 points 6 days ago I have kids and it's crazy how much I spend. We eat meat, fruits and veggies. We just had to cut out milk. These prices + insurance + taxes are out of fucking control and all I see is more and more money going abroad. permalink parent award report block reply HockeyMom4Trump 2 points 6 days ago Depends on the family. If they get SNAP benefits, the total is hundreds. If they work and use their own money and clip coupons and shop sales, then it is less money. permalink parent award report block reply view 1 more comments... Aquamine-Amarine 7 points 6 days ago Fuck off. Most people here do not use EBT, and we don't want a handout. permalink parent award report block reply HankScorpio 22 points 6 days ago Trump fully supporting Israel which is one of the most Uni party issues that exists the handling of the Epstein files The deep state not being arrested for Russia Russia Russia Trump siding with Ukraine If these 4 issues arent fixed, the America first based that got Trump elected is going to feel demoralized and stay home and Democrats will continue to win. permalink award report block reply TrumpWonByALandslide 7 points 6 days ago These aren't the main issues. People are staying home because nobody can afford anything and the GOP congress doesn't give a shit. permalink parent award report block reply Brock_Shithouse 3 points 6 days ago Don't forget \"mass\" deportations turned into minimal deportations. permalink parent award report block reply NewGovModOnDutyBans 3 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Krat 3 points 6 days ago We are officially a partial communist country now permalink parent award report block reply UCantStumpTheTrump 0 points 6 days ago The lefties are all over this thread trying to demoralize the base. Look at how many comments are shitting on Trump and giving him ZERO credit. These are not MAGA folks commenting permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply RudeFrog 19 points 6 days ago Is it though? Or are those just words? permalink award report block reply Bouldabassed 19 points 6 days ago Going the Biden route of gaslighting people on costs and the economy is not a winning strategy. permalink award report block reply mailinvoter -10 points 6 days ago Inflation is down from >9% to 3%, so the dollar has more value.  Gaslighting people to think Trump's economy isn't doing good is what redditards do and not very productive. Edit: Oh Noes!!! The anti-Trump fags are out in force!!!  Whatever shall I do with all those downdoots?!?!?!  Oh, I know.  I'll tell you to go fuck yourselves.  Trump is your president and Kumala sucks dick to get \"a head\", haha faggots. permalink parent award report block reply armyofpedes4usa 12 points 6 days ago 9-3% just means the rate of which the dollar is being devalued is going down.  You would need a negative inflation rate to really up it's value. permalink parent award report block reply mailinvoter -8 points 6 days ago Wow, just wow. 🤦 permalink parent award report block reply NewGovModOnDutyBans 4 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply CovfefeVideo 18 points 6 days ago We'll lose that savings if we turn on the lights. permalink award report block reply ceva 18 points 6 days ago They're also 25% smaller and almost 100% less actual food. The 2025 meal has no fresh veggies (except potatoes) and is full of ultra processed crap. The 2024 meal is significantly larger and has plenty of fresh veggies included. Also, the 2025 meal has turkey listed at \"$0.97/lb. — lowest price since 2019,\" but the 2024 meal has turkey listed at $0.88/lb.? Make it make sense EDIT: I love that shills are downvoting me for sharing actual facts lol permalink award report block reply armyofpedes4usa 11 points 6 days ago Thanks for the links, so it's more gaslighting. permalink parent award report block reply ceva 9 points 6 days ago No problem! Always follow the procedure of verifying what the powers that be tell you. There's often another story that's going untold. On the surface: lower prices! Great! Looking deeper: the portions are smaller, the food is worse, the prices are actually higher in some respects (per lb price of turkey) permalink parent award report block reply mil5781 2 points 6 days ago What plenty of fresh veggies?  2024 had celery and onions.  2025 has carrots and cranberries.  There's no other veggies there beyond canned, in both years.  There's also plenty of Great Value in both. permalink parent award report block reply ceva 3 points 6 days ago It's still very misleading that 2025 is at all better. The turkey is more expensive (despite the list saying it's cheaper, so it's a lie), the ingredients are fewer, there's overall less available. It's a bad bad bad comparison. permalink parent award report block reply mil5781 0 points 6 days ago I disagree.  It's 13.5 lb Turkey this year, while it was 10 - 16 lb last year.  Since it's a set price, those who got 10 lb Turkeys didn't get it at the 88 cent price point.  It's an $8.88 - $14.08 Turkey last year, and it's a consistent $13 per Turkey this year.  There's no corn meal for muffins, and there's no pecan pie, only pumpkin.  Otherwise, it's basically exactly the same, just swapping out 1 veg for a different one.  22 items in this year compared to 29 last year, but if you take out those extras, it's nearly identical, just some things swapped out for others. It even has close to 3 lbs of fresh vegs this year.  Last year was a celery stalk and onions.  There were no real fresh veg at all.  It also was around 55 for 8 people, and now it's less than 40 for 10 people.  You can spend that extra 15 bucks to get well more than what was left out. Only shill here is you bud. permalink parent award report block reply empiretc 15 points 6 days ago Well, we are going to spend ~$150 this year for 8 people. that is a little less than last year, but not 25%. permalink award report block reply friarfox 14 points 6 days ago He forgot to mention that it's 15 items instead of 21 and uses more generic Best Value products. But hey it's politics. permalink award report block reply UltraFrogMan 14 points 6 days ago Gas is down. That's about it permalink award report block reply HockeyMom4Trump 14 points 6 days ago It is still $3.19 near me. That is same as Biden year ago gas. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply BurtMcGirt 13 points 6 days ago Imagine how affordable things would be if the 50 million people who shouldn't be here weren't here. permalink award report block reply mailinvoter 10 points 6 days ago And if we weren't subsidizing able bodied scabs to get \"free\" food to inflate costs. permalink parent award report block reply Bearing51 5 points 6 days ago And if we were subsidizing 90% of the countries on this fucking planet with our tax dollars. permalink parent award report block reply BurtMcGirt 1 points 6 days ago Yep permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago Well that’s why they’re deporting them: https://www.dhs.gov/news/2025/11/05/dhs-delivers-historic-start-border-crossings-fy-2026 permalink parent award report block reply BurtMcGirt 1 points 6 days ago Great that they got the inflow mostly stopped, but we aren't even on pace to deport even just the number Biden's handlers let in, before the end of President Trump's term. It's going to take around 80 years, at this pace, if no more get in and none reproduce. permalink parent award report block reply UCantStumpTheTrump -1 points 6 days ago First you complain about the illegals here, then you complain Trump isn’t doing enough, fast enough for you. You realize he’s getting obstructed from all angles right? Try giving POTUS some credit where it’s due. You wouldn’t like what would be happening if Kamala “won” permalink parent award report block reply BurtMcGirt 1 points 6 days ago I did give President Trump credit for shutting down the flow of illegals. The amount being deported, though, is statistically insignificant. We have a very limited amount of time (probably until mid terms) to get things done. President Trump has probably done all he can do while being obstructed by BOTH wings of the Uniparty. It's a shame there aren't more America First people in Congress to try to advance President Trump's agenda. He cannot do it all on his own. permalink parent award report block reply Executarian2 12 points 6 days ago Impossible. 25% cheaper?! In what world?? No, the affordability issue is not dead, what the fuck? Horrible messaging. He should be embracing the affordability issue. permalink award report block reply josiborg 12 points 6 days ago He better start going hard because we only have a short time left. No more saving Israel jet setting around the globe. Kick all these people out, save our elections, put laws back in place for propaganda through media and make it tighter (name it Kirk Law), divert the money going to that to American taxpayers, and Lock HER UP! Start interviewing Americans that cannot get jobs from H1B or otherwise stupid visas and put us weaponized Autists to work Making America America Again. Just cut the bullshit and let's go get it. permalink award report block reply NineteenEightyFour 10 points 6 days ago Tired of this out of touch asshole gaslighting us. permalink award report block reply UCantStumpTheTrump -5 points 6 days ago Tired of you doomer shills infesting this site. Trump isn’t perfect, we know that. Liberal retard land is that way 👉🏻 permalink parent award report block reply RockFlagAndEagle2020 10 points 6 days ago Yeah this is a straight up lie. permalink award report block reply birddogz 10 points 6 days ago Trump is so out of touch on this issue.  Nothing is cheaper permalink award report block reply UCantStumpTheTrump -3 points 6 days ago The Trump admin is actively working to make things cheaper while the Biden regime actively worked to make them more expensive. How do you fail to understand this? permalink parent award report block reply Maganifice7 4 points 6 days ago Cope all you want, but things are not cheaper, except maybe eggs. permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago Things WILL get cheaper because we’re actually opening up drilling, oil/gas projects, and deporting illegals. The previous admin was doing the opposite of that permalink parent award report block reply BannedAccount 10 points 6 days ago Yeah canceling ebt will do that as prices tend to drop when there's less demand. permalink award report block reply pollsarefake -17 points 6 days ago All the welfare queens have come to the comment section to whine permalink parent award report block reply BannedAccount 7 points 6 days ago Idk what you're implying but im not on ebt I spend $300/week just to feed my family of 4 granted almost $70 of that is just infant formula but non of it is what you'd consider a \"luxury\" item its mostly just meat, butter, milk, and eggs... permalink parent award report block reply Visceroth -2 points 6 days ago you found an infant formula that isn't full of vegetable oils, soy, and chemicals? permalink parent award report block reply BannedAccount 4 points 6 days ago Yes actually its Kendamil its still not perfect but its alot healthier than the main brands. The other day I noticed its a European import so it might have something to do with their laws against completely toxic food. The best part is its also cheaper than shit like similac or infamil. permalink parent award report block reply Glory-Unto-God 3 points 6 days ago 0 welfare here and shits expensive even making 85k a year. Single income family taking care of 3 coming on 4 kids my wife and my widowed mother. For someone of less means this shit would be close to impossible. People like you remind me that there's a reason benevolent rulers often had princes that despised the plebians. Utterly myopic and self absorbed rats really spoil the bunch permalink parent award report block reply BigBadMagaMan 1 points 6 days ago That comment was actually in support of ending EBT but you’re such a disingenuous cunt, you can’t even read. permalink parent award report block reply pollsarefake -2 points 6 days ago No I support that comment I’m saying the rest of the comment section is rife with welfare queens You’re the one that can’t read which is probably why you need welfare permalink parent award report block reply ExorcistCandy 9 points 6 days ago Fuck off with this shit. No one is believing this anymore permalink award report block reply 13MMshooter 7 points 6 days ago Eat a dick motherfucker. No relief for anyone but Jews. MIGA. Start working for us. permalink award report block reply hoaxproof 7 points 6 days ago My groceries cost more now than they did under Biden and I'm not going to pretend otherwise. I'm also not going to pretend everything is just going to be magically fixed in a few months like a child... but I don't appreciate being gaslit. permalink award report block reply SaltyTitties4 6 points 6 days ago I’m sorry Mr. President, but they are (as usual) giving you bad data.  I live in the Heartland, and my groceries are not lower than last year.  And they are absolutely NOT lower!  They are higher. Mr. President, since you have not learned and you continue to listen to liars in your administration, we now have to consider that you are part of the Swamp. permalink award report block reply HellNoKameltoe 6 points 6 days ago All Biden did was drop the cost of hot dogs on the 4th of July 16c permalink award report block reply NonbinaryPotatohead 6 points 6 days ago This is like the Biden Admin's cheaper July 4th cookout tweet. permalink award report block reply UCantStumpTheTrump 0 points 6 days ago Except the Biden Admin was doing nothing to try to lower prices; they were actively driving them up. The Trump admin is reopening drilling, oil/gas projects which will lower energy and food costs; and of course deporting illegals and securing the border. The effects take time to manifest, because Biden screwed shit up so badly permalink parent award report block reply DontTreadOnSnek 6 points 6 days ago This was apparently \"fact checked\" by community notes and they said it's cheaper only because it's less items and no name brands. Sadly, Trump is wrong. Food is not less expensive than Biden.  Great Value canned chili (with beans) went from 0.67 to 1.92 and just recently went up to 2.14 permalink award report block reply starjello 4 points 6 days ago Don't forget shrinkage. Many products are a lot smaller now for the same money they were when they were more product permalink parent award report block reply armyofpedes4usa 3 points 6 days ago Shrinkflation strikes again. permalink parent award report block reply flashersenpai 2 points 6 days ago i still remember when the frozen pizzas got smaller but the pizza boxes stayed the same size permalink parent award report block reply Sivispacem 6 points 6 days ago I just paid well over double for the same goods I was buying pre-2019. Bragging about the affordability of intentionally marked-down goods for a holiday is almost offensively tone deaf. permalink award report block reply getup 5 points 6 days ago Liar. permalink award report block reply mailinvoter 3 points 6 days ago Where did Trump lie?  He is repeating what Walmart said, so they would be the liars if not true.  I'm sure you have all the receipts. permalink parent award report block reply unotrumpcard 5 points 6 days ago Trump works for Walmart now? permalink parent award report block reply mailinvoter 1 points 6 days ago How did you come up with that one? permalink parent award report block reply unotrumpcard 1 points 6 days ago It is what you implied. permalink parent award report block reply view 7 more comments... flashersenpai 0 points 6 days ago wtf he quit McDonalds??? permalink parent award report block reply nomoreprinkles 5 points 6 days ago Yeah I don't fucking buy it buddy. I can't. I'm unemployed. Go to a kroger and look through the cars in the parking lot. Half of them are full of homeless. permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply laxslash 5 points 6 days ago Meanwhile 2 undershirts and a button down cost me $55 the other day at fucking Wal-Mart. permalink award report block reply CentipedeDoge 5 points 6 days ago One thing I do hate about Trump is he tries to say everything is the best right now. It’s not, it’s quite shit actually. He’d be better off acknowledging that. permalink award report block reply IllKissYourBoobies 5 points 6 days ago Eh... permalink award report block reply SavingPrivateGrace 5 points 6 days ago What's been disclosed with the shut down is EBT gives a family of 4 about $300 for a Thanksgiving meal when it costs $150, 25% lower than last year, for working families to purchase.  We know what's up and we want a reform of SNAP.  It should be an honor to work, provide food for your family and celebrate Thanksgiving together, stress free and happy. permalink award report block reply HockeyMom4Trump 4 points 6 days ago SNAP needs to have an expiration date and be very temporary. And very basic food only. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply RealTXPatriot 5 points 6 days ago And no one can fly to visit family anyway permalink award report block reply BillyBillington 5 points 6 days ago I'm not really seeing the price drops. Maybe eggs. Everything else is still expensive. Gas never really went down. permalink award report block reply Maganifice7 1 points 6 days ago Gas went down a bit, electricity went up. They didn't increase the price per kwh, they increased the delivery fee per kwh. When they do it this way, they can screw people with solar panels on the buyback rate. permalink parent award report block reply CovfefeKaren 5 points 6 days ago I don't care if this is accurate or not.  All I care about is the fact that when I go to my local grocery store, which is often cheaper than Walmart, ground beef is $7/lb for the cheap stuff.  That's RIDICULOUS!  I haven't cooked a ribeye in months.  I'm not paying $20/lb for Select.  USDA Prime used to be that price!  And eggs still haven't gone down.  Thank God I have chickens.  But feed is the highest it's ever been.  My feed cost per dozen for 2025 is $1.90.  That's just feed, not my time.  Makes it hard to continue providing my family, friends, and coworkers with eggs for $3/doz.  I'm going to have to go to 4, maybe even 5 if this keeps up.  So I really don't want to hear my favorite President tell me how things are less.  I know they're not.  I shop for the family.  I know what shit costs.  God love him but damn. permalink award report block reply Trump-16-20-24-28-32 5 points 6 days ago Yeah, but are hot dogs down 16 cents? permalink award report block reply TrumpYouMagaFrenner 6 points 6 days ago Yeah thats the thanksgiving meal he was speaking of. Hot dogs and ramen. permalink parent award report block reply ceva 4 points 6 days ago You might think you're joking but you're right. THe 2025 meal that Walmart put out is all processed crap https://corporate.walmart.com/news/2025/10/21/walmarts-annual-thanksgiving-meal-returns-serving-10-people-for-less-than-4-00-per-person permalink parent award report block reply Trump-16-20-24-28-32 3 points 6 days ago Remember when during 2021, the Biden Administration was bragging about how they are bringing the price of groceries down and that July 4th was 16 cents cheaper than the year before? https://x.com/WhiteHouse46/status/1410709115333234691 Turns out... to bring groceries down, all that had to be done was getting rid of SNAP benefits.  Who knew? permalink parent award report block reply Brock_Shithouse 2 points 6 days ago Maybe for millionaires. Regular people have to choose one or the other. permalink parent award report block reply Southboundanddown 5 points 6 days ago We can't just print infinity money and suffer zero consequences.  The costs will continue until monetary policy improves. permalink award report block reply RedDon 5 points 6 days ago This is nice and all, but if you really want to help American families afford life, get rid of the H1Bs. They can’t afford anything without jobs. permalink award report block reply gottarememberpasswor 5 points 6 days ago I shop around still end up hosed by the prices. Absolute bullshit. And shouldnt he be smarter than  say dumb shit like this? permalink award report block reply MemeLawd 4 points 6 days ago Okay where are the shekelstein files? permalink award report block reply flashersenpai 1 points 6 days ago oy permalink parent award report block reply ImYourHuckleberry24 4 points 6 days ago Clearly, he's not shopping in my area. permalink award report block reply pillainp 4 points 6 days ago But Biden's Thanksgiving cost 14c less than the previous year! Sukondat, Drumpfhthhhh!!!!!! permalink award report block reply Returningtogod 4 points 6 days ago Not here it’s not. permalink award report block reply MegoThor 4 points 6 days ago Where is anything 25% lower than last year? permalink award report block reply stayfckingcalm 2 points 6 days ago Thanksgiving dinner from Walmart permalink parent award report block reply Trajano 2 points 6 days ago Eggs permalink parent award report block reply Bythrfruitsyknow 4 points 6 days ago oh look resurrected yesterdays rage bait, thanks OP. permalink award report block reply BOLTS4U 4 points 6 days ago Wow this guy has lost his mind. Sorry, im out permalink award report block reply GodKingHarambe 4 points 6 days ago Sorry, cuh Mr 81M saved me .08 on July 4th baked beans permalink award report block reply Rudy_DankMemer 4 points 6 days ago I don't shop at Walmart or Hoity Toity Grocery Stores either... and the only shitty things that we buy are ice cream, high quality choc chips for baking and maybe some sourdough pretzels or kettle fried chips (never more than 2 bags). The rest is meat, dairy, pasta, rice, fruit & veggies.... and our bill is NOT any lower than last year. My half-polish wife is cancer survivor AND a trainer.... I tell her all the time that she is worse than the no soup nazi. THIS. permalink award report block reply NewWorldOnions 3 points 6 days ago Maybe Trump should stop lying first: https://x.com/i/birdwatch/n/1986259468342939695 permalink award report block reply TheFozz 3 points 6 days ago I don't know about ya'll, but prices sure as fuck aren't cheaper where I live. Gas is also the same price it was back in January. I love Trump but he needs to wake the fuck up and realize that things are still tough. permalink award report block reply ingrowntoenail 3 points 6 days ago Gas was $2.55 a few days ago when I got gas last.  It was back up to $2.89 yesterday. permalink award report block reply Keep_on_winning_kag 1 points 6 days ago My gas went down to 2.59 twice last month, then magically went back to 2.99 over night twice. Currently going down again slowly so I'll fill up the day it hits 260 or so. permalink parent award report block reply WeinerLapTop 3 points 6 days ago Trump is an open liar now.  Fun.  Did not see this coming in 2016.  Jarring permalink award report block reply For_All_Mankind 3 points 6 days ago It’s still unaffordable permalink award report block reply Seruna_Kanus 3 points 6 days ago Can we get back to 2019 levels? permalink award report block reply ShotgunParade69x 3 points 6 days ago It’s free if your spending it alone permalink award report block reply DeplorableNeandertal 3 points 6 days ago No one cares. Ban islam NOW. permalink award report block reply Awakened 3 points 6 days ago This is how you lose the midterms. Just another politician at this point. Just Bush 3.0. permalink award report block reply JesusTheOnlyWay 3 points 6 days ago This is a serious question (I don't have much time to read on politics) What happened to the Epstein stuff? permalink award report block reply magaMC117 1 points 6 days ago they fucked up the release, then trump was duped into thinking it was beyond end of world to release the file permalink parent award report block reply stayfckingcalm 0 points 6 days ago Turned out there is no Epstein stuff permalink parent award report block reply JesusTheOnlyWay 2 points 6 days ago Does anyone believe that? permalink parent award report block reply Chickensaurus 3 points 6 days ago Nobody cares. We voted to have Epstein clients jailed, and traitors hanged. permalink award report block reply SCP0073 3 points 6 days ago Zzzzz permalink award report block reply papa_newguineapig 3 points 6 days ago He needs to shut the fuck up. Seriously. Nothing is cheaper. permalink award report block reply MemphisMontoya71 3 points 6 days ago My gas is still over 4 bucks a gallon and so are half of America's gas, unless you live near refineries and still no where near under 2 bucks a gallon.  My groceries are still 3x what I paid in 2018. Everything fucking is smaller and more expensive.  This is not destroying my life because I work hard and have a decent job and paycheck,  but to MOST Americans they are not feeling the celebration Mr. President.  This economy still sucks ass, and the next generation will NEVER afford a home to start a family...no wonder socialism appeals to them. permalink award report block reply TheDevilMonkey 2 points 6 days ago Fake and gay. permalink award report block reply Texas_81 2 points 6 days ago Again just like the Epstein files “ they’re a hoax” now saying that prices are better. As a whole no. I’m in Texas ground beef a pound is $8. Steak is at least $13 a pound! Who the fuck is telling him this. permalink award report block reply armyofpedes4usa 2 points 6 days ago Is the 25% down an apples to apples comparison (same food items and quantity)? permalink award report block reply masterdrake 2 points 6 days ago it feels like things are actually a bit cheaper, but they are still massively up from just a few years ago, people are still struggling permalink award report block reply EyesSewnShut 2 points 6 days ago Bruh. permalink award report block reply Lawless 2 points 6 days ago I don't see prices coming down much regardless of what happens, but this administration has stopped the price increases we were seeing for the last four years. Everything doubled in price after 2020 permalink award report block reply swarleybing 2 points 6 days ago Much cheaper still when your liberal relatives refuse to attend! permalink award report block reply texas4ever 2 points 6 days ago Groceries are still very expensive. We can cherry pick here and there, but most groceries are still very high. Of course the Dems will only make it more expensive, but bragging about the stock market etc. looks out of touch to the average normie. permalink award report block reply Those_Who_Wander 2 points 6 days ago When I'm paying $1.29/gal on gas like in 2018, I'll believe that. Otherwise, I still can't afford life. permalink award report block reply fit2btied 2 points 6 days ago Remember when the Biden administration bragged that your 4th of July cookout was going to be 16 cents cheaper? That was awesome. permalink award report block reply DicksareforChicks 2 points 6 days ago Even cheaper for looters and SNAP recipients 😑 permalink award report block reply RocksCanOnlyWait 2 points 6 days ago No it's not. STOP LYING!!! This was posted yesterday. My analysis . In short, whoever is giving him numbers is conflating last year's Farm Bureau report with Walmart's deal price, without even checking if the items and quantities are the same. permalink award report block reply Logan051361 1 points 6 days ago I was Just at Meijer. a large Turkey was 6 Dollars. Bread 1.46. Chicken broth 1.59.  Green beans 1.18 for Delmonte.  etc etc etc. Seems cheap to me. Its bacon and Steak That are expensive permalink parent award report block reply Krat 2 points 6 days ago Thats because we arent competing with invaders who are stealing your money and food to overthrow you. Once the gib payments resume for the invasion, itll immediately rise back permalink award report block reply Bullet3250 2 points 6 days ago Still need to get that 10 year Bond to 3.0%..... permalink award report block reply Captainlizard 1 points 6 days ago Trump has sycophant advisors who bring this stupid shit to him and tell him everything is fixed. They did it with gas, had him saying it was under 2 dollars a gallon for months, now he at least says its \"coming down\" and is around 2.50. They do it with groceries, telling him they are all down. If he gets gas down to actually below 2 dollars it might help the price, but other than that there isn't much he can do. He just needs to STOP telling people that the groceries are \"all down\" because it pisses people off. permalink award report block reply BasedMillennial 1 points 6 days ago Inflation shot up 21% under Biden, that year I received a 3% raise. I'm behind 7 years not including ongoing inflation. permalink award report block reply Maganifice7 1 points 6 days ago Bullshit. permalink award report block reply Freefertilizer 1 points 6 days ago Im sure Trump didn't read the original and new meals and just the headline but this isn't a 1:1 this is just Wal Mart curating a meal year to year. I dont think really anything went down in price just didn't go crazy up in price the last year. Still good we stopped inflation going crazy imo but not 25% permalink award report block reply AtheistTrumper 1 points 6 days ago I got pretty much everything I need on sale at Aldi for $40, including the turkey. I think they are trying to capitalize on the no-EBT by advertising low prices. They are selling out quickly but restock every morning and you can just order it for pickup. permalink award report block reply GhostOfTheRepublic 1 points 6 days ago Don’t care arrest the fking crooks!!  Deport the muslims and communists!!! permalink award report block reply RogueLeaderX 1 points 6 days ago Thankful for Trump. permalink award report block reply Tookens 1 points 6 days ago \"And if you believed that one, I have ANOTHER one to tell you!\" permalink award report block reply Grond999 1 points 6 days ago Both parties and the Fed (and big Pharma propaganda) set off inflation. It takes time to work through the system. Just as both parties are driving America into insane debt. permalink award report block reply PoleWatcher 1 points 6 days ago Not sure if agree with that. Your getting less for same price so also need to buy more permalink award report block reply FullyDilated 1 points 6 days ago I'm calling bullshit! permalink award report block reply SocraticMethod1 1 points 6 days ago It's a double edged sword as some of this is increasing supply at home and others It's consumer confidence. You can't make things better if people think things will ONLY get worse, so you need more positivity. Deporting more illegals to reduce demand might help, worth a shot.. permalink award report block reply uniformist 1 points 5 days ago Biden got it down 1 cent one year permalink award report block reply hoodar 1 points 6 days ago tHe eGg pRiCeS gUyZ...wait they're down.... nevermind, let's forget about them. permalink award report block reply Handshake_Shmanshake 1 points 6 days ago This is basically saying, \"I saved you 15 Cents on hotdogs, Jack.\" Gas is almost $5 a gallon where I'm at. Bought a 12 pack of soda for $11 the other day, thank god that lasts me all month, but still. permalink award report block reply DeathBattleFan123 0 points 6 days ago PDW comment sections are totally filled with anti Trump black pilled doomers these days permalink award report block reply Captainlizard 1 points 6 days ago It's not anti trump to call out bullshit. I don't even think Trump did it knowing it was wrong, I think he gets this stupid shit brought to him by advisors and just repeats it. The guy isn't grocery shopping and has no clue. If someone actually gets good info to him he always acts to fix it. He just needs someone giving him the truth. permalink parent award report block reply flashersenpai 0 points 6 days ago how can Trump do better if no one complains about anything? permalink parent award report block reply DeathBattleFan123 1 points 6 days ago Halting Biden era runaway inflation is a big win by itself. Reducing the price of key staples like food and gas by 25% from what they were last year is a massive accomplishment. Complaining that it's not lower than it was 5 years ago in a total of 10 months on the job is unreasonable. We are finally headed in the right direction, and rather than celebrating, people like you are dooming. permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply AntiCommieAktion 0 points 6 days ago Paid 16 dollars for about 5-6 items from the grocery store the other day. Seemed unusually low. Calling this a Trump W. at least where I'm from. permalink award report block reply Creepy_Joe 0 points 6 days ago That’s a complete load of horse shit. I can’t even fill a SMALL BASKET at the grocery store for less than $100 when I used to be able to overflow a big shopping cart for that much. permalink award report block reply PepePinochet 0 points 6 days ago X permalink award report block reply flashersenpai 1 points 6 days ago X permalink parent award report block reply YodaBannon -3 points 6 days ago FATA permalink award report block reply bleeje 2 points 6 days ago what is that? permalink parent award report block reply YodaBannon -3 points 6 days ago fatter, no hard R, getting fatta MAHA permalink parent award report block reply bleeje -6 points 6 days ago Wow. Okay. Thoughts and prayers for all the ICE Agents who forget to mask up. If you're one, save up all you can, make plans to leave the country and get out in 2027. If you know one closely, convert your basement into a bedroom and stock up supplies in case he can't leave. Good luck. permalink award report block reply couranto 1 points 6 days ago Is that a threat punk? permalink parent award report block reply bleeje 1 points 6 days ago What? permalink parent award report block reply pollsarefake -14 points 6 days ago Trump is exactly right Broke commies want everything free Hardworking Americans are able to afford things under Trump Thanks to tariffs, prices are down bigly Affordability is a fake issue, a demonrat hoax just like Russia Russia Russia and Epstein. permalink award report block reply BannedAccount 11 points 6 days ago You're retarded, hardworking Americans can't afford shit i should know im one of them. I receive absolutely no government assistance of any kind. permalink parent award report block reply bleeje 2 points 6 days ago He is a paid shill, dude. Should terrify the rest of us that they're ALREADY hiring shills when 2025 is not even finished yet. But nope! The old guys here that are 95% of this site will continue on their merry, oblivious way. permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply getup 2 points 6 days ago Lmao permalink parent award report block reply TheDevilMonkey 1 points 6 days ago You are fake and gay. permalink parent award report block reply the_new_one 15 points 6 days ago Comment removed upon the user being banned. permalink award report block reply HockeyMom4Trump 14 points 6 days ago 2026 will be a bad year for republicans at the voting booth permalink parent award report block reply unotrumpcard 6 points 6 days ago Trump is playing his part. permalink parent award report block reply takebackyourfreedom 1 points 6 days ago Comment removed by community moderators. permalink award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply 2Clutch 1 points 6 days ago Comment removed by community filter. permalink award report block reply TheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nRiffFantastic 154 points 6 days ago Affordability issue is not dead. It’s disingenuous coming from democrats, but affordability is a high priority issue for Americans. We’ve been through the wringer with Biden. The employment market is also bad right now so Americans aren’t feeling the savings yet. permalink award report block reply LiterallyKaiser 128 points 6 days ago Beef is $8-10 a pound Milk is $2.50-4 a gallon. Cereal is $5 a box, I don’t even buy that anymore. I skip breakfast instead. Spaghetti is $1.25-2 a box. A can of beans is $1-1.40. A can of corn is $1-1.25. Bread is $2.25-5 a loaf. I don’t even bother looking at how much apples or fruit cost. I try going for canned fruit when I can but it’s still damn near $1.50-2 for a can of oranges. You can forget “snacks”. $5 for a bag of chips, and it’s half as much as it was in 2020. Only thing that’s still moderately cheap is frozen veggies. Which I eat a lot of now as a result. Gas is $3 a gallon. These prices ARE NOT CHEAP. They’re all up 20-40% from what they were in 2020. I remember the days when you could get a huge box of Aldi spaghetti for 99 cents. A load of bread at Aldi was 85 cents for the cheapest crap. Now you go in, not only are the options more limited, but they’re also smaller and cost way more. $1.25 for spaghetti and $1.50 for bread. Meanwhile I’ve gotten maybe a cumulative 10% raise over that span of time. I’m tired of hearing about subsidies for AI. I’m tired of corporate tax cuts. I’m tired of billions going to Argentina and Israel and nothing being done for me. permalink parent award report block reply deleted 53 points 6 days ago Spindle-spin -14 points 6 days ago We need to cut taxes and lower the corporate tax rate. There's no way companies can achieve profits and lower prices if they're being taxed. The only way companies lower prices is if they feel gains. President Trump has given us one of the best, strongest economies in decades, but Democrats clogged up the pipeline so that we're not directly feeling it because everyone is paying taxes. permalink parent award report block reply Freeth3usa 26 points 6 days ago You’re completely wrong because people in general give zero shits about corporate profits when less then 20% of the country feel any gain from the stock market , and less then 1% of the country gets a a significant raise, cash, or stock bonus from them. Republicans and unfortunately it includes maga have become beholding to corporate riches that 85%+ of the country would rather see replaced with small business. Buisnesss where individuals/owners who make decisions for that small business are held accountable for good or bad. Instead of CEO’s who indirectly kill, harm, destroy workers, consumers, etc and get off being richer with zero recourse most of the time. permalink parent award report block reply AerialRush 5 points 6 days ago Muh GDP doesn't matter. Japan has had a stagnant GDP since 1990 and its leagues ahead of what America used to be in 1990. permalink parent award report block reply YouEssAye 5 points 6 days ago President Trump has given us one of the best, strongest economies in decades Jesus Christ dude, what in the fuck are you talking about? permalink parent award report block reply view 2 more comments... LawyersPlayDota 3 points 6 days ago The only way companies lower prices is if they feel gains Or if they're presented with a greater threat than lower profitability. Which we need to start making. permalink parent award report block reply view 1 more comments... Emodius 0 points 6 days ago Absolutely. People don't understand how bad things were under Biden, nor do they understand how corporate taxes affect them. It also takes some pain to right the ship because this shit was in a nose dive, by design when Biden was done. People are still feeling the pinch and are tired of it, I get that but we literally may have been bankrupt by now of kamala had won. The fact that people aren't feeling how much better shit is shows how much pain we were all in permalink parent award report block reply ToxicAvengerOhio 35 points 6 days ago Lots of people have revisionist history for Reagan around here and shit on him constantly but Trump will be given the same treatment 10, 15 years from now unless he finds his sack and stops the cucking. permalink parent award report block reply UsernameChexOut 11 points 6 days ago Some are already there, just saying permalink parent award report block reply flashersenpai 6 points 6 days ago I sincerely wonder if this is the Trump we would have gotten 1st term if he wasn't targetted with a fed op. At which point they should have just let him be and he might not have gotten elected again over Rubio/Cruz/DeSantis/etc There was all this big noise about the revenge tour 2024 and instead we have Bondi and Patel. permalink parent award report block reply Emodius -6 points 6 days ago Fuck them. They don't see how good they have it. They are our answer to Zohran Mamdani voters. They expect instant success. The shit takes time. permalink parent award report block reply view 2 more comments... snoopy3210 4 points 6 days ago It’s a bad look to mix lowering the increase in prices and lowering prices.  Trump should know better permalink parent award report block reply TPMJB 3 points 6 days ago Reagan fucked us over with Iran-Contra and granting 6 million illegals in California amnesty, in exchange for a border wall that never materialized. All the Republicans who praise the ground he walked on are cucks. permalink parent award report block reply ToxicAvengerOhio 1 points 6 days ago The biggest painting in Trumps oval office is of Reagan 🤷‍♂️ permalink parent award report block reply view 1 more comments... DCYR66 31 points 6 days ago Yeah still waiting for affordability here in Florida. Sorry Mr President but not seeing it yet! permalink parent award report block reply Aggrieved03 19 points 6 days ago No one is permalink parent award report block reply Appeal2Heaven98 23 points 6 days ago I think that's why people are finding socialism more favorable. Yes, it doesn't help that universities are basically socialist education camps. But when an entire generation enters the job market and has seen nothing but inflation and an increase in costs of expenses without significant pay raises to give any relief, no wonder \"free shit\" appeals to them. permalink parent award report block reply Klaus73 1 points 6 days ago I mean....do you take a chance on the guy that offers to give you food...or the guy that claims your not starving? permalink parent award report block reply killedmytv 1 points 6 days ago Everybody loves Santa Claus, especially overgrown children permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply tt777 19 points 6 days ago Prices are never coming down noticeably after the rampant inflation. permalink parent award report block reply Tacotuesday867 8 points 6 days ago Stolen elections have consequences permalink parent award report block reply PhilipeNegro 5 points 6 days ago The day people realize we can’t share a society with them is the day everything changes permalink parent award report block reply load 47 more comments... Krat 48 points 6 days ago Affordability is the result of being looted and invaded ... itll eventually be to a point where theres nothing left permalink parent award report block reply DeportThemAllForever 26 points 6 days ago Inflation, they created during covid years where Biden was dropping piles of cash at corporations really fucked us.  All prices are higher, especially food and housing.  And that PPP was a giant scam, free money for scammers. We still have inflation out here.  Housing tripled in price. Food doubled.  Half of our city would starve if there weren’t discount grocery stores.  It’s sad and humbling when you hear that peoples goal is to make enough money to be able to walk into grocery store and be able to afford more than just generics. permalink parent award report block reply Simple_Doot 19 points 6 days ago Printing money causes inflation.  Trump prints and spends like the worst of them.  DOGE cuts are a joke compared to the increased spending.  Nothing has changed with spending in decades and if you point it out youre attacked. permalink parent award report block reply deleted 2 points 6 days ago view 1 more comments... CommonSenseAmerican -1 points 6 days ago Gross generalization, no cuts are a joke, Trump got tax on tips removed as well as tax on social security retirement. Trump is doing what must be done as far as spending goes to refinish rebuilding a broken military system and many other things too long to post. It's global inflation also not just the USA. permalink parent award report block reply view 1 more comments... HoganP 19 points 6 days ago I've made this point before and I'll reiterate yours, again.  They completely fucked us with the inflation because it's the economic equivalent of getting pee out of a swimming pool.  It's not something that just turns on and off with policy.  The effects, that is. permalink parent award report block reply flashersenpai 2 points 6 days ago hold on one of the reasons Massie is on Trump's shit list is that he held up all the Covid money for spending reasons and lack of individual payments Trump is part of this inflation permalink parent award report block reply Returningtogod 1 points 6 days ago They stole an election, looted the treasury, then pardoned themselves on the way out. permalink parent award report block reply Hanging_Chad 32 points 6 days ago less food stamps ➜ lower food prices 📉 permalink parent award report block reply BidensBodyDouble 3 points 6 days ago Cut food stamps for the millions abusing it. Deport the illegals. Crush the demand and we'll see prices come down to move product. permalink parent award report block reply DT170x -10 points 6 days ago You how you can tell A thread is being shilled/astroterf to hell. Low Thread Upvote to unusually high comments and/or Very High activity on non busy hours. permalink parent award report block reply Dontbeafraid 10 points 6 days ago Im a retarded faggot, did your algorithm account for that? permalink parent award report block reply DT170x -2 points 6 days ago You are a Retarded faggot,but Retarded Faggots need love too. permalink parent award report block reply mikejones 2 points 6 days ago This was also posted yesterday too. permalink parent award report block reply deleted 23 points 6 days ago yuge_covfefe 2 points 6 days ago I guess this issue is polarizing which I hope is good news (at least some people feel it's improving?). For my part I make a very decent income by historical standards, and while I'm not drowning or anything, I'm still well outside of my comfort zone. Forget about saving money, I'm just happy to be keeping my house atm. So this remains a top issue for me and most people I know. I don't think it's Trump's fault that prices have been stubbornly high. But I do think it's premature of him to be claiming victory, and a move that could cost him some of his support. It's categorically untrue to say that things are suddenly affordable to most people. I suspect he's realized how fucked it all is. Prices aren't going to deflate - they will, at best, inflate more slowly - and our best hope is probably to look for wage increases. Not that I've seen one of those keep pace with inflation over the past several years, either. In terms of raw buying power I'm down something like 30-40% since 2020, still today. Losing faith I'll ever get back to where I was, relatively speaking. Again, not super uncomfortable though, and thankful for that. permalink parent award report block reply MastaJoda 6 points 6 days ago ''Let them eat cake.'' Trump permalink parent award report block reply ToxicAvengerOhio 6 points 6 days ago \"From Walmart. Mmmmm\" permalink parent award report block reply load 12 more comments...\nLiterallyKaiser 128 points 6 days ago Beef is $8-10 a pound Milk is $2.50-4 a gallon. Cereal is $5 a box, I don’t even buy that anymore. I skip breakfast instead. Spaghetti is $1.25-2 a box. A can of beans is $1-1.40. A can of corn is $1-1.25. Bread is $2.25-5 a loaf. I don’t even bother looking at how much apples or fruit cost. I try going for canned fruit when I can but it’s still damn near $1.50-2 for a can of oranges. You can forget “snacks”. $5 for a bag of chips, and it’s half as much as it was in 2020. Only thing that’s still moderately cheap is frozen veggies. Which I eat a lot of now as a result. Gas is $3 a gallon. These prices ARE NOT CHEAP. They’re all up 20-40% from what they were in 2020. I remember the days when you could get a huge box of Aldi spaghetti for 99 cents. A load of bread at Aldi was 85 cents for the cheapest crap. Now you go in, not only are the options more limited, but they’re also smaller and cost way more. $1.25 for spaghetti and $1.50 for bread. Meanwhile I’ve gotten maybe a cumulative 10% raise over that span of time. I’m tired of hearing about subsidies for AI. I’m tired of corporate tax cuts. I’m tired of billions going to Argentina and Israel and nothing being done for me. permalink parent award report block reply deleted 53 points 6 days ago Spindle-spin -14 points 6 days ago We need to cut taxes and lower the corporate tax rate. There's no way companies can achieve profits and lower prices if they're being taxed. The only way companies lower prices is if they feel gains. President Trump has given us one of the best, strongest economies in decades, but Democrats clogged up the pipeline so that we're not directly feeling it because everyone is paying taxes. permalink parent award report block reply Freeth3usa 26 points 6 days ago You’re completely wrong because people in general give zero shits about corporate profits when less then 20% of the country feel any gain from the stock market , and less then 1% of the country gets a a significant raise, cash, or stock bonus from them. Republicans and unfortunately it includes maga have become beholding to corporate riches that 85%+ of the country would rather see replaced with small business. Buisnesss where individuals/owners who make decisions for that small business are held accountable for good or bad. Instead of CEO’s who indirectly kill, harm, destroy workers, consumers, etc and get off being richer with zero recourse most of the time. permalink parent award report block reply AerialRush 5 points 6 days ago Muh GDP doesn't matter. Japan has had a stagnant GDP since 1990 and its leagues ahead of what America used to be in 1990. permalink parent award report block reply YouEssAye 5 points 6 days ago President Trump has given us one of the best, strongest economies in decades Jesus Christ dude, what in the fuck are you talking about? permalink parent award report block reply view 2 more comments... LawyersPlayDota 3 points 6 days ago The only way companies lower prices is if they feel gains Or if they're presented with a greater threat than lower profitability. Which we need to start making. permalink parent award report block reply view 1 more comments... Emodius 0 points 6 days ago Absolutely. People don't understand how bad things were under Biden, nor do they understand how corporate taxes affect them. It also takes some pain to right the ship because this shit was in a nose dive, by design when Biden was done. People are still feeling the pinch and are tired of it, I get that but we literally may have been bankrupt by now of kamala had won. The fact that people aren't feeling how much better shit is shows how much pain we were all in permalink parent award report block reply ToxicAvengerOhio 35 points 6 days ago Lots of people have revisionist history for Reagan around here and shit on him constantly but Trump will be given the same treatment 10, 15 years from now unless he finds his sack and stops the cucking. permalink parent award report block reply UsernameChexOut 11 points 6 days ago Some are already there, just saying permalink parent award report block reply flashersenpai 6 points 6 days ago I sincerely wonder if this is the Trump we would have gotten 1st term if he wasn't targetted with a fed op. At which point they should have just let him be and he might not have gotten elected again over Rubio/Cruz/DeSantis/etc There was all this big noise about the revenge tour 2024 and instead we have Bondi and Patel. permalink parent award report block reply Emodius -6 points 6 days ago Fuck them. They don't see how good they have it. They are our answer to Zohran Mamdani voters. They expect instant success. The shit takes time. permalink parent award report block reply view 2 more comments... snoopy3210 4 points 6 days ago It’s a bad look to mix lowering the increase in prices and lowering prices.  Trump should know better permalink parent award report block reply TPMJB 3 points 6 days ago Reagan fucked us over with Iran-Contra and granting 6 million illegals in California amnesty, in exchange for a border wall that never materialized. All the Republicans who praise the ground he walked on are cucks. permalink parent award report block reply ToxicAvengerOhio 1 points 6 days ago The biggest painting in Trumps oval office is of Reagan 🤷‍♂️ permalink parent award report block reply view 1 more comments... DCYR66 31 points 6 days ago Yeah still waiting for affordability here in Florida. Sorry Mr President but not seeing it yet! permalink parent award report block reply Aggrieved03 19 points 6 days ago No one is permalink parent award report block reply Appeal2Heaven98 23 points 6 days ago I think that's why people are finding socialism more favorable. Yes, it doesn't help that universities are basically socialist education camps. But when an entire generation enters the job market and has seen nothing but inflation and an increase in costs of expenses without significant pay raises to give any relief, no wonder \"free shit\" appeals to them. permalink parent award report block reply Klaus73 1 points 6 days ago I mean....do you take a chance on the guy that offers to give you food...or the guy that claims your not starving? permalink parent award report block reply killedmytv 1 points 6 days ago Everybody loves Santa Claus, especially overgrown children permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply tt777 19 points 6 days ago Prices are never coming down noticeably after the rampant inflation. permalink parent award report block reply Tacotuesday867 8 points 6 days ago Stolen elections have consequences permalink parent award report block reply PhilipeNegro 5 points 6 days ago The day people realize we can’t share a society with them is the day everything changes permalink parent award report block reply load 47 more comments...\ndeleted 53 points 6 days ago Spindle-spin -14 points 6 days ago We need to cut taxes and lower the corporate tax rate. There's no way companies can achieve profits and lower prices if they're being taxed. The only way companies lower prices is if they feel gains. President Trump has given us one of the best, strongest economies in decades, but Democrats clogged up the pipeline so that we're not directly feeling it because everyone is paying taxes. permalink parent award report block reply Freeth3usa 26 points 6 days ago You’re completely wrong because people in general give zero shits about corporate profits when less then 20% of the country feel any gain from the stock market , and less then 1% of the country gets a a significant raise, cash, or stock bonus from them. Republicans and unfortunately it includes maga have become beholding to corporate riches that 85%+ of the country would rather see replaced with small business. Buisnesss where individuals/owners who make decisions for that small business are held accountable for good or bad. Instead of CEO’s who indirectly kill, harm, destroy workers, consumers, etc and get off being richer with zero recourse most of the time. permalink parent award report block reply AerialRush 5 points 6 days ago Muh GDP doesn't matter. Japan has had a stagnant GDP since 1990 and its leagues ahead of what America used to be in 1990. permalink parent award report block reply YouEssAye 5 points 6 days ago President Trump has given us one of the best, strongest economies in decades Jesus Christ dude, what in the fuck are you talking about? permalink parent award report block reply view 2 more comments... LawyersPlayDota 3 points 6 days ago The only way companies lower prices is if they feel gains Or if they're presented with a greater threat than lower profitability. Which we need to start making. permalink parent award report block reply view 1 more comments... Emodius 0 points 6 days ago Absolutely. People don't understand how bad things were under Biden, nor do they understand how corporate taxes affect them. It also takes some pain to right the ship because this shit was in a nose dive, by design when Biden was done. People are still feeling the pinch and are tired of it, I get that but we literally may have been bankrupt by now of kamala had won. The fact that people aren't feeling how much better shit is shows how much pain we were all in permalink parent award report block reply\nSpindle-spin -14 points 6 days ago We need to cut taxes and lower the corporate tax rate. There's no way companies can achieve profits and lower prices if they're being taxed. The only way companies lower prices is if they feel gains. President Trump has given us one of the best, strongest economies in decades, but Democrats clogged up the pipeline so that we're not directly feeling it because everyone is paying taxes. permalink parent award report block reply Freeth3usa 26 points 6 days ago You’re completely wrong because people in general give zero shits about corporate profits when less then 20% of the country feel any gain from the stock market , and less then 1% of the country gets a a significant raise, cash, or stock bonus from them. Republicans and unfortunately it includes maga have become beholding to corporate riches that 85%+ of the country would rather see replaced with small business. Buisnesss where individuals/owners who make decisions for that small business are held accountable for good or bad. Instead of CEO’s who indirectly kill, harm, destroy workers, consumers, etc and get off being richer with zero recourse most of the time. permalink parent award report block reply AerialRush 5 points 6 days ago Muh GDP doesn't matter. Japan has had a stagnant GDP since 1990 and its leagues ahead of what America used to be in 1990. permalink parent award report block reply YouEssAye 5 points 6 days ago President Trump has given us one of the best, strongest economies in decades Jesus Christ dude, what in the fuck are you talking about? permalink parent award report block reply view 2 more comments... LawyersPlayDota 3 points 6 days ago The only way companies lower prices is if they feel gains Or if they're presented with a greater threat than lower profitability. Which we need to start making. permalink parent award report block reply view 1 more comments... Emodius 0 points 6 days ago Absolutely. People don't understand how bad things were under Biden, nor do they understand how corporate taxes affect them. It also takes some pain to right the ship because this shit was in a nose dive, by design when Biden was done. People are still feeling the pinch and are tired of it, I get that but we literally may have been bankrupt by now of kamala had won. The fact that people aren't feeling how much better shit is shows how much pain we were all in permalink parent award report block reply\nFreeth3usa 26 points 6 days ago You’re completely wrong because people in general give zero shits about corporate profits when less then 20% of the country feel any gain from the stock market , and less then 1% of the country gets a a significant raise, cash, or stock bonus from them. Republicans and unfortunately it includes maga have become beholding to corporate riches that 85%+ of the country would rather see replaced with small business. Buisnesss where individuals/owners who make decisions for that small business are held accountable for good or bad. Instead of CEO’s who indirectly kill, harm, destroy workers, consumers, etc and get off being richer with zero recourse most of the time. permalink parent award report block reply\nAerialRush 5 points 6 days ago Muh GDP doesn't matter. Japan has had a stagnant GDP since 1990 and its leagues ahead of what America used to be in 1990. permalink parent award report block reply\nYouEssAye 5 points 6 days ago President Trump has given us one of the best, strongest economies in decades Jesus Christ dude, what in the fuck are you talking about? permalink parent award report block reply view 2 more comments...\nLawyersPlayDota 3 points 6 days ago The only way companies lower prices is if they feel gains Or if they're presented with a greater threat than lower profitability. Which we need to start making. permalink parent award report block reply view 1 more comments...\nEmodius 0 points 6 days ago Absolutely. People don't understand how bad things were under Biden, nor do they understand how corporate taxes affect them. It also takes some pain to right the ship because this shit was in a nose dive, by design when Biden was done. People are still feeling the pinch and are tired of it, I get that but we literally may have been bankrupt by now of kamala had won. The fact that people aren't feeling how much better shit is shows how much pain we were all in permalink parent award report block reply\nToxicAvengerOhio 35 points 6 days ago Lots of people have revisionist history for Reagan around here and shit on him constantly but Trump will be given the same treatment 10, 15 years from now unless he finds his sack and stops the cucking. permalink parent award report block reply UsernameChexOut 11 points 6 days ago Some are already there, just saying permalink parent award report block reply flashersenpai 6 points 6 days ago I sincerely wonder if this is the Trump we would have gotten 1st term if he wasn't targetted with a fed op. At which point they should have just let him be and he might not have gotten elected again over Rubio/Cruz/DeSantis/etc There was all this big noise about the revenge tour 2024 and instead we have Bondi and Patel. permalink parent award report block reply Emodius -6 points 6 days ago Fuck them. They don't see how good they have it. They are our answer to Zohran Mamdani voters. They expect instant success. The shit takes time. permalink parent award report block reply view 2 more comments... snoopy3210 4 points 6 days ago It’s a bad look to mix lowering the increase in prices and lowering prices.  Trump should know better permalink parent award report block reply TPMJB 3 points 6 days ago Reagan fucked us over with Iran-Contra and granting 6 million illegals in California amnesty, in exchange for a border wall that never materialized. All the Republicans who praise the ground he walked on are cucks. permalink parent award report block reply ToxicAvengerOhio 1 points 6 days ago The biggest painting in Trumps oval office is of Reagan 🤷‍♂️ permalink parent award report block reply view 1 more comments...\nUsernameChexOut 11 points 6 days ago Some are already there, just saying permalink parent award report block reply flashersenpai 6 points 6 days ago I sincerely wonder if this is the Trump we would have gotten 1st term if he wasn't targetted with a fed op. At which point they should have just let him be and he might not have gotten elected again over Rubio/Cruz/DeSantis/etc There was all this big noise about the revenge tour 2024 and instead we have Bondi and Patel. permalink parent award report block reply Emodius -6 points 6 days ago Fuck them. They don't see how good they have it. They are our answer to Zohran Mamdani voters. They expect instant success. The shit takes time. permalink parent award report block reply view 2 more comments...\nflashersenpai 6 points 6 days ago I sincerely wonder if this is the Trump we would have gotten 1st term if he wasn't targetted with a fed op. At which point they should have just let him be and he might not have gotten elected again over Rubio/Cruz/DeSantis/etc There was all this big noise about the revenge tour 2024 and instead we have Bondi and Patel. permalink parent award report block reply\nEmodius -6 points 6 days ago Fuck them. They don't see how good they have it. They are our answer to Zohran Mamdani voters. They expect instant success. The shit takes time. permalink parent award report block reply view 2 more comments...\nsnoopy3210 4 points 6 days ago It’s a bad look to mix lowering the increase in prices and lowering prices.  Trump should know better permalink parent award report block reply\nTPMJB 3 points 6 days ago Reagan fucked us over with Iran-Contra and granting 6 million illegals in California amnesty, in exchange for a border wall that never materialized. All the Republicans who praise the ground he walked on are cucks. permalink parent award report block reply ToxicAvengerOhio 1 points 6 days ago The biggest painting in Trumps oval office is of Reagan 🤷‍♂️ permalink parent award report block reply view 1 more comments...\nToxicAvengerOhio 1 points 6 days ago The biggest painting in Trumps oval office is of Reagan 🤷‍♂️ permalink parent award report block reply view 1 more comments...\nDCYR66 31 points 6 days ago Yeah still waiting for affordability here in Florida. Sorry Mr President but not seeing it yet! permalink parent award report block reply Aggrieved03 19 points 6 days ago No one is permalink parent award report block reply\nAggrieved03 19 points 6 days ago No one is permalink parent award report block reply\nAppeal2Heaven98 23 points 6 days ago I think that's why people are finding socialism more favorable. Yes, it doesn't help that universities are basically socialist education camps. But when an entire generation enters the job market and has seen nothing but inflation and an increase in costs of expenses without significant pay raises to give any relief, no wonder \"free shit\" appeals to them. permalink parent award report block reply Klaus73 1 points 6 days ago I mean....do you take a chance on the guy that offers to give you food...or the guy that claims your not starving? permalink parent award report block reply killedmytv 1 points 6 days ago Everybody loves Santa Claus, especially overgrown children permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nKlaus73 1 points 6 days ago I mean....do you take a chance on the guy that offers to give you food...or the guy that claims your not starving? permalink parent award report block reply\nkilledmytv 1 points 6 days ago Everybody loves Santa Claus, especially overgrown children permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\ntt777 19 points 6 days ago Prices are never coming down noticeably after the rampant inflation. permalink parent award report block reply Tacotuesday867 8 points 6 days ago Stolen elections have consequences permalink parent award report block reply PhilipeNegro 5 points 6 days ago The day people realize we can’t share a society with them is the day everything changes permalink parent award report block reply\nTacotuesday867 8 points 6 days ago Stolen elections have consequences permalink parent award report block reply PhilipeNegro 5 points 6 days ago The day people realize we can’t share a society with them is the day everything changes permalink parent award report block reply\nPhilipeNegro 5 points 6 days ago The day people realize we can’t share a society with them is the day everything changes permalink parent award report block reply\nKrat 48 points 6 days ago Affordability is the result of being looted and invaded ... itll eventually be to a point where theres nothing left permalink parent award report block reply DeportThemAllForever 26 points 6 days ago Inflation, they created during covid years where Biden was dropping piles of cash at corporations really fucked us.  All prices are higher, especially food and housing.  And that PPP was a giant scam, free money for scammers. We still have inflation out here.  Housing tripled in price. Food doubled.  Half of our city would starve if there weren’t discount grocery stores.  It’s sad and humbling when you hear that peoples goal is to make enough money to be able to walk into grocery store and be able to afford more than just generics. permalink parent award report block reply Simple_Doot 19 points 6 days ago Printing money causes inflation.  Trump prints and spends like the worst of them.  DOGE cuts are a joke compared to the increased spending.  Nothing has changed with spending in decades and if you point it out youre attacked. permalink parent award report block reply deleted 2 points 6 days ago view 1 more comments... CommonSenseAmerican -1 points 6 days ago Gross generalization, no cuts are a joke, Trump got tax on tips removed as well as tax on social security retirement. Trump is doing what must be done as far as spending goes to refinish rebuilding a broken military system and many other things too long to post. It's global inflation also not just the USA. permalink parent award report block reply view 1 more comments... HoganP 19 points 6 days ago I've made this point before and I'll reiterate yours, again.  They completely fucked us with the inflation because it's the economic equivalent of getting pee out of a swimming pool.  It's not something that just turns on and off with policy.  The effects, that is. permalink parent award report block reply flashersenpai 2 points 6 days ago hold on one of the reasons Massie is on Trump's shit list is that he held up all the Covid money for spending reasons and lack of individual payments Trump is part of this inflation permalink parent award report block reply Returningtogod 1 points 6 days ago They stole an election, looted the treasury, then pardoned themselves on the way out. permalink parent award report block reply\nDeportThemAllForever 26 points 6 days ago Inflation, they created during covid years where Biden was dropping piles of cash at corporations really fucked us.  All prices are higher, especially food and housing.  And that PPP was a giant scam, free money for scammers. We still have inflation out here.  Housing tripled in price. Food doubled.  Half of our city would starve if there weren’t discount grocery stores.  It’s sad and humbling when you hear that peoples goal is to make enough money to be able to walk into grocery store and be able to afford more than just generics. permalink parent award report block reply Simple_Doot 19 points 6 days ago Printing money causes inflation.  Trump prints and spends like the worst of them.  DOGE cuts are a joke compared to the increased spending.  Nothing has changed with spending in decades and if you point it out youre attacked. permalink parent award report block reply deleted 2 points 6 days ago view 1 more comments... CommonSenseAmerican -1 points 6 days ago Gross generalization, no cuts are a joke, Trump got tax on tips removed as well as tax on social security retirement. Trump is doing what must be done as far as spending goes to refinish rebuilding a broken military system and many other things too long to post. It's global inflation also not just the USA. permalink parent award report block reply view 1 more comments... HoganP 19 points 6 days ago I've made this point before and I'll reiterate yours, again.  They completely fucked us with the inflation because it's the economic equivalent of getting pee out of a swimming pool.  It's not something that just turns on and off with policy.  The effects, that is. permalink parent award report block reply flashersenpai 2 points 6 days ago hold on one of the reasons Massie is on Trump's shit list is that he held up all the Covid money for spending reasons and lack of individual payments Trump is part of this inflation permalink parent award report block reply\nSimple_Doot 19 points 6 days ago Printing money causes inflation.  Trump prints and spends like the worst of them.  DOGE cuts are a joke compared to the increased spending.  Nothing has changed with spending in decades and if you point it out youre attacked. permalink parent award report block reply deleted 2 points 6 days ago view 1 more comments... CommonSenseAmerican -1 points 6 days ago Gross generalization, no cuts are a joke, Trump got tax on tips removed as well as tax on social security retirement. Trump is doing what must be done as far as spending goes to refinish rebuilding a broken military system and many other things too long to post. It's global inflation also not just the USA. permalink parent award report block reply view 1 more comments...\ndeleted 2 points 6 days ago view 1 more comments...\nCommonSenseAmerican -1 points 6 days ago Gross generalization, no cuts are a joke, Trump got tax on tips removed as well as tax on social security retirement. Trump is doing what must be done as far as spending goes to refinish rebuilding a broken military system and many other things too long to post. It's global inflation also not just the USA. permalink parent award report block reply view 1 more comments...\nHoganP 19 points 6 days ago I've made this point before and I'll reiterate yours, again.  They completely fucked us with the inflation because it's the economic equivalent of getting pee out of a swimming pool.  It's not something that just turns on and off with policy.  The effects, that is. permalink parent award report block reply\nflashersenpai 2 points 6 days ago hold on one of the reasons Massie is on Trump's shit list is that he held up all the Covid money for spending reasons and lack of individual payments Trump is part of this inflation permalink parent award report block reply\nReturningtogod 1 points 6 days ago They stole an election, looted the treasury, then pardoned themselves on the way out. permalink parent award report block reply\nHanging_Chad 32 points 6 days ago less food stamps ➜ lower food prices 📉 permalink parent award report block reply BidensBodyDouble 3 points 6 days ago Cut food stamps for the millions abusing it. Deport the illegals. Crush the demand and we'll see prices come down to move product. permalink parent award report block reply DT170x -10 points 6 days ago You how you can tell A thread is being shilled/astroterf to hell. Low Thread Upvote to unusually high comments and/or Very High activity on non busy hours. permalink parent award report block reply Dontbeafraid 10 points 6 days ago Im a retarded faggot, did your algorithm account for that? permalink parent award report block reply DT170x -2 points 6 days ago You are a Retarded faggot,but Retarded Faggots need love too. permalink parent award report block reply mikejones 2 points 6 days ago This was also posted yesterday too. permalink parent award report block reply\nBidensBodyDouble 3 points 6 days ago Cut food stamps for the millions abusing it. Deport the illegals. Crush the demand and we'll see prices come down to move product. permalink parent award report block reply\nDT170x -10 points 6 days ago You how you can tell A thread is being shilled/astroterf to hell. Low Thread Upvote to unusually high comments and/or Very High activity on non busy hours. permalink parent award report block reply Dontbeafraid 10 points 6 days ago Im a retarded faggot, did your algorithm account for that? permalink parent award report block reply DT170x -2 points 6 days ago You are a Retarded faggot,but Retarded Faggots need love too. permalink parent award report block reply mikejones 2 points 6 days ago This was also posted yesterday too. permalink parent award report block reply\nDontbeafraid 10 points 6 days ago Im a retarded faggot, did your algorithm account for that? permalink parent award report block reply DT170x -2 points 6 days ago You are a Retarded faggot,but Retarded Faggots need love too. permalink parent award report block reply\nDT170x -2 points 6 days ago You are a Retarded faggot,but Retarded Faggots need love too. permalink parent award report block reply\nmikejones 2 points 6 days ago This was also posted yesterday too. permalink parent award report block reply\ndeleted 23 points 6 days ago yuge_covfefe 2 points 6 days ago I guess this issue is polarizing which I hope is good news (at least some people feel it's improving?). For my part I make a very decent income by historical standards, and while I'm not drowning or anything, I'm still well outside of my comfort zone. Forget about saving money, I'm just happy to be keeping my house atm. So this remains a top issue for me and most people I know. I don't think it's Trump's fault that prices have been stubbornly high. But I do think it's premature of him to be claiming victory, and a move that could cost him some of his support. It's categorically untrue to say that things are suddenly affordable to most people. I suspect he's realized how fucked it all is. Prices aren't going to deflate - they will, at best, inflate more slowly - and our best hope is probably to look for wage increases. Not that I've seen one of those keep pace with inflation over the past several years, either. In terms of raw buying power I'm down something like 30-40% since 2020, still today. Losing faith I'll ever get back to where I was, relatively speaking. Again, not super uncomfortable though, and thankful for that. permalink parent award report block reply\nyuge_covfefe 2 points 6 days ago I guess this issue is polarizing which I hope is good news (at least some people feel it's improving?). For my part I make a very decent income by historical standards, and while I'm not drowning or anything, I'm still well outside of my comfort zone. Forget about saving money, I'm just happy to be keeping my house atm. So this remains a top issue for me and most people I know. I don't think it's Trump's fault that prices have been stubbornly high. But I do think it's premature of him to be claiming victory, and a move that could cost him some of his support. It's categorically untrue to say that things are suddenly affordable to most people. I suspect he's realized how fucked it all is. Prices aren't going to deflate - they will, at best, inflate more slowly - and our best hope is probably to look for wage increases. Not that I've seen one of those keep pace with inflation over the past several years, either. In terms of raw buying power I'm down something like 30-40% since 2020, still today. Losing faith I'll ever get back to where I was, relatively speaking. Again, not super uncomfortable though, and thankful for that. permalink parent award report block reply\nMastaJoda 6 points 6 days ago ''Let them eat cake.'' Trump permalink parent award report block reply ToxicAvengerOhio 6 points 6 days ago \"From Walmart. Mmmmm\" permalink parent award report block reply\nToxicAvengerOhio 6 points 6 days ago \"From Walmart. Mmmmm\" permalink parent award report block reply\nlurkwellmyfriends 96 points 6 days ago Not great messaging. This is like the Potato regime's july 4th hot dogs are 16 cents cheaper while your life is falling apart messaging. Most of us understand that recovery and course correction takes a long time. You can't tell struggling people that they're not struggling, though. \"No, no, prices are way down\". They're just going to reject you as someone out of touch that only cares about what's best for DC. The messaging needs to be that the course corrections have been made and help is on the way. And the all Israel, all the time neocon bullshit has to go and never be mentioned again. permalink award report block reply HockeyMom4Trump 38 points 6 days ago Prices are down, but the ballroom is up…not great messaging when people KNOW prices still suck and they will never ever set foot in the ballroom cause they are too busy working to feed their families and have to compete for food with SNAP benefits and illegals. permalink parent award report block reply MastaJoda 25 points 6 days ago ☝ Trumps messaging is basically ''Let them eat cake.'' permalink parent award report block reply UCantStumpTheTrump -4 points 6 days ago Lmfao. Maybe you should be looking at his actions then. https://www.dhs.gov/news/2025/11/05/dhs-delivers-historic-start-border-crossings-fy-2026 Trump is delivering on as many of his promises as he can, and people like you are shitting on him because you’re not getting EXACTLY what you wanted permalink parent award report block reply yuge_covfefe 7 points 6 days ago Yeah I watched the ballroom drama bs play out like ok, whatever. But I don't get why Trump pushed for it in the first place. People are hurting domestically; they need him to cut spending, not spend even more. I get that it's a drop in the ocean and meaningful cuts are mostly out of his control. But it's such bad messaging. permalink parent award report block reply NeoDragoon 8 points 6 days ago It was privately funded, no tax money went into the ballroom, the disinformation is why it's a big deal. permalink parent award report block reply maverick202 4 points 6 days ago Nobody is going to fund it privately unless they get something out of it. Disinformation is coming from both sides. permalink parent award report block reply yuge_covfefe 1 points 6 days ago That is nice to hear. Hopefully more people realize this. permalink parent award report block reply NukeTheTroons 3 points 6 days ago Exactly! He’s out of touch! permalink parent award report block reply UCantStumpTheTrump -4 points 6 days ago LOL as if President Kamala Harris would have been more in-touch with the American voting public? Get fucked you shill faggot permalink parent award report block reply NukeTheTroons 4 points 6 days ago I never said that. You sound like a fucking tween. We can ctritize our when we feel like he’s messing up and still support him. permalink parent award report block reply view 1 more comments... TrumpYouMagaFrenner 20 points 6 days ago Hey pal thats a bunch of malarkey dog faced pony soldier. permalink parent award report block reply KekistanPM 15 points 6 days ago A good friend of mine was in dire financial straits until he got a good job. He has a positive cash flow now; and despite living austere for months, he still asks me for help sometimes because of his mountain of credit card debt. Even if millions of Americans saw their wages overtake inflation overnight, I bet many are still struggling with that kind of debt. permalink parent award report block reply ImWhiteAndThatsOK 9 points 6 days ago I used to be against bankruptcy being a staunch believer of accountability. However, these banks allow people to over-leverage themselves, and then charge usurious interest that traps them into lifelong debt. Fuck the banks. File bankruptcy. permalink parent award report block reply DontTreadOnSnek 3 points 6 days ago You just described usury, which under Bibical law was illegal. They also had debt jubilee where every 7 years your outstanding debts were forgiven. permalink parent award report block reply NukeTheTroons 5 points 6 days ago Trump has been rubbing me the wrong way lately, bragging about the stock market while we can’t afford a basic truck anymore yet alone a house permalink parent award report block reply NonbinaryPotatohead 4 points 6 days ago Came here to say the same thing. permalink parent award report block reply load 4 more comments...\nHockeyMom4Trump 38 points 6 days ago Prices are down, but the ballroom is up…not great messaging when people KNOW prices still suck and they will never ever set foot in the ballroom cause they are too busy working to feed their families and have to compete for food with SNAP benefits and illegals. permalink parent award report block reply MastaJoda 25 points 6 days ago ☝ Trumps messaging is basically ''Let them eat cake.'' permalink parent award report block reply UCantStumpTheTrump -4 points 6 days ago Lmfao. Maybe you should be looking at his actions then. https://www.dhs.gov/news/2025/11/05/dhs-delivers-historic-start-border-crossings-fy-2026 Trump is delivering on as many of his promises as he can, and people like you are shitting on him because you’re not getting EXACTLY what you wanted permalink parent award report block reply yuge_covfefe 7 points 6 days ago Yeah I watched the ballroom drama bs play out like ok, whatever. But I don't get why Trump pushed for it in the first place. People are hurting domestically; they need him to cut spending, not spend even more. I get that it's a drop in the ocean and meaningful cuts are mostly out of his control. But it's such bad messaging. permalink parent award report block reply NeoDragoon 8 points 6 days ago It was privately funded, no tax money went into the ballroom, the disinformation is why it's a big deal. permalink parent award report block reply maverick202 4 points 6 days ago Nobody is going to fund it privately unless they get something out of it. Disinformation is coming from both sides. permalink parent award report block reply yuge_covfefe 1 points 6 days ago That is nice to hear. Hopefully more people realize this. permalink parent award report block reply NukeTheTroons 3 points 6 days ago Exactly! He’s out of touch! permalink parent award report block reply UCantStumpTheTrump -4 points 6 days ago LOL as if President Kamala Harris would have been more in-touch with the American voting public? Get fucked you shill faggot permalink parent award report block reply NukeTheTroons 4 points 6 days ago I never said that. You sound like a fucking tween. We can ctritize our when we feel like he’s messing up and still support him. permalink parent award report block reply view 1 more comments...\nMastaJoda 25 points 6 days ago ☝ Trumps messaging is basically ''Let them eat cake.'' permalink parent award report block reply UCantStumpTheTrump -4 points 6 days ago Lmfao. Maybe you should be looking at his actions then. https://www.dhs.gov/news/2025/11/05/dhs-delivers-historic-start-border-crossings-fy-2026 Trump is delivering on as many of his promises as he can, and people like you are shitting on him because you’re not getting EXACTLY what you wanted permalink parent award report block reply\nUCantStumpTheTrump -4 points 6 days ago Lmfao. Maybe you should be looking at his actions then. https://www.dhs.gov/news/2025/11/05/dhs-delivers-historic-start-border-crossings-fy-2026 Trump is delivering on as many of his promises as he can, and people like you are shitting on him because you’re not getting EXACTLY what you wanted permalink parent award report block reply\nyuge_covfefe 7 points 6 days ago Yeah I watched the ballroom drama bs play out like ok, whatever. But I don't get why Trump pushed for it in the first place. People are hurting domestically; they need him to cut spending, not spend even more. I get that it's a drop in the ocean and meaningful cuts are mostly out of his control. But it's such bad messaging. permalink parent award report block reply NeoDragoon 8 points 6 days ago It was privately funded, no tax money went into the ballroom, the disinformation is why it's a big deal. permalink parent award report block reply maverick202 4 points 6 days ago Nobody is going to fund it privately unless they get something out of it. Disinformation is coming from both sides. permalink parent award report block reply yuge_covfefe 1 points 6 days ago That is nice to hear. Hopefully more people realize this. permalink parent award report block reply\nNeoDragoon 8 points 6 days ago It was privately funded, no tax money went into the ballroom, the disinformation is why it's a big deal. permalink parent award report block reply maverick202 4 points 6 days ago Nobody is going to fund it privately unless they get something out of it. Disinformation is coming from both sides. permalink parent award report block reply yuge_covfefe 1 points 6 days ago That is nice to hear. Hopefully more people realize this. permalink parent award report block reply\nmaverick202 4 points 6 days ago Nobody is going to fund it privately unless they get something out of it. Disinformation is coming from both sides. permalink parent award report block reply\nyuge_covfefe 1 points 6 days ago That is nice to hear. Hopefully more people realize this. permalink parent award report block reply\nNukeTheTroons 3 points 6 days ago Exactly! He’s out of touch! permalink parent award report block reply UCantStumpTheTrump -4 points 6 days ago LOL as if President Kamala Harris would have been more in-touch with the American voting public? Get fucked you shill faggot permalink parent award report block reply NukeTheTroons 4 points 6 days ago I never said that. You sound like a fucking tween. We can ctritize our when we feel like he’s messing up and still support him. permalink parent award report block reply view 1 more comments...\nUCantStumpTheTrump -4 points 6 days ago LOL as if President Kamala Harris would have been more in-touch with the American voting public? Get fucked you shill faggot permalink parent award report block reply NukeTheTroons 4 points 6 days ago I never said that. You sound like a fucking tween. We can ctritize our when we feel like he’s messing up and still support him. permalink parent award report block reply view 1 more comments...\nNukeTheTroons 4 points 6 days ago I never said that. You sound like a fucking tween. We can ctritize our when we feel like he’s messing up and still support him. permalink parent award report block reply view 1 more comments...\nTrumpYouMagaFrenner 20 points 6 days ago Hey pal thats a bunch of malarkey dog faced pony soldier. permalink parent award report block reply\nKekistanPM 15 points 6 days ago A good friend of mine was in dire financial straits until he got a good job. He has a positive cash flow now; and despite living austere for months, he still asks me for help sometimes because of his mountain of credit card debt. Even if millions of Americans saw their wages overtake inflation overnight, I bet many are still struggling with that kind of debt. permalink parent award report block reply ImWhiteAndThatsOK 9 points 6 days ago I used to be against bankruptcy being a staunch believer of accountability. However, these banks allow people to over-leverage themselves, and then charge usurious interest that traps them into lifelong debt. Fuck the banks. File bankruptcy. permalink parent award report block reply DontTreadOnSnek 3 points 6 days ago You just described usury, which under Bibical law was illegal. They also had debt jubilee where every 7 years your outstanding debts were forgiven. permalink parent award report block reply\nImWhiteAndThatsOK 9 points 6 days ago I used to be against bankruptcy being a staunch believer of accountability. However, these banks allow people to over-leverage themselves, and then charge usurious interest that traps them into lifelong debt. Fuck the banks. File bankruptcy. permalink parent award report block reply DontTreadOnSnek 3 points 6 days ago You just described usury, which under Bibical law was illegal. They also had debt jubilee where every 7 years your outstanding debts were forgiven. permalink parent award report block reply\nDontTreadOnSnek 3 points 6 days ago You just described usury, which under Bibical law was illegal. They also had debt jubilee where every 7 years your outstanding debts were forgiven. permalink parent award report block reply\nNukeTheTroons 5 points 6 days ago Trump has been rubbing me the wrong way lately, bragging about the stock market while we can’t afford a basic truck anymore yet alone a house permalink parent award report block reply\nNonbinaryPotatohead 4 points 6 days ago Came here to say the same thing. permalink parent award report block reply\nJoeMcCarthyWasRight 86 points 6 days ago Not for me and my family. permalink award report block reply memeYourDreams 3 points 6 days ago Yea, survivability issue is what's dead, cause they died. permalink parent award report block reply tribunabessica 3 points 6 days ago No kidding. Too bad we don't only live during Thanksgiving dinner. Who feeds him these bullshit numbers? permalink parent award report block reply Based-SW-Engineer -2 points 6 days ago I'm gonna go ahead and say that you just don't remember last year. Sure prices are still way higher than they were 4-5 years ago. But compared to last year it's still way less, and 25% feels about right across the board. Groceries aren't going to drop by 4x in just 9 short months. permalink parent award report block reply pollsarefake -57 points 6 days ago That’s because you are a broke beta cuck and not an alpha like Trump No one will give you a handout you commie faggot permalink parent award report block reply Bythrfruitsyknow 34 points 6 days ago not an alpha like Trump simping ain't easy homo. permalink parent award report block reply HockeyMom4Trump 15 points 6 days ago You sound like you need to get back to math class before the teacher notices your empty seat. permalink parent award report block reply BigMikesSwingingCock 5 points 6 days ago It's just Anaconda being a faggot sperg. permalink parent award report block reply Aquamine-Amarine 13 points 6 days ago You're fucking stupid. Everyone's financial situation is different. permalink parent award report block reply pollsarefake -5 points 6 days ago If you want communism, gtfo This is America We respect strength and wealth permalink parent award report block reply PhilipeNegro 3 points 6 days ago You are such an immense faggot. It truly is amazing to witness. permalink parent award report block reply covok48 4 points 6 days ago How have you not been deported yet? You’ve been here a year and managed to be an asshole in every thread. Edit: Anaconda. Ah, yes. permalink parent award report block reply TitsOutForIsrael 2 points 6 days ago what an odd thing to say permalink parent award report block reply TrumpYouMagaFrenner -57 points 6 days ago Must be on snap permalink parent award report block reply Deplorable_Yankee 33 points 6 days ago Another asshole insult. Glad you are doing well. What the fuck is wrong with you people?  Trump speaks and nobody can refute the claims.  Bullshit. permalink parent award report block reply bleeje 16 points 6 days ago Bec. they're paid shills dude. Everyone should be very concerned that we're back to 2019-early 2020 levels of pure nonsense and bullshit. But they're not. They don't care. Lies matter more to them than honesty. And someone is ALREADY paying these shills to lie. Imagine how bad the polling must be if less than a year into this term, they're already shills getting paid by somebody to lie. permalink parent award report block reply LiterallyKaiser 4 points 6 days ago Asking for your government to enact policy that helps your family’s financial situation? That sounds like socialism bro I don’t know. How about some corporate tax cuts and foreign aid to Argentina instead? permalink parent award report block reply JoeMcCarthyWasRight 8 points 6 days ago Taxing the fuck out of me to fund Israel’s wars and to fund NGOs to destroy my homeland from the inside out through mass illegal immigration and propaganda is called what now? permalink parent award report block reply view 1 more comments... covok48 1 points 6 days ago That’s the whole point of government, to improve the lives of its citizens. I don’t know what third world shithole you live in, but that’s the expectation in the West. permalink parent award report block reply view 1 more comments... TrumpYouMagaFrenner -9 points 6 days ago Im joking calm yourself permalink parent award report block reply JoeMcCarthyWasRight 6 points 6 days ago Work my ass off, faggot. permalink parent award report block reply covok48 6 points 6 days ago Dude, you don’t even have a job. Fuck off. permalink parent award report block reply\nmemeYourDreams 3 points 6 days ago Yea, survivability issue is what's dead, cause they died. permalink parent award report block reply\ntribunabessica 3 points 6 days ago No kidding. Too bad we don't only live during Thanksgiving dinner. Who feeds him these bullshit numbers? permalink parent award report block reply\nBased-SW-Engineer -2 points 6 days ago I'm gonna go ahead and say that you just don't remember last year. Sure prices are still way higher than they were 4-5 years ago. But compared to last year it's still way less, and 25% feels about right across the board. Groceries aren't going to drop by 4x in just 9 short months. permalink parent award report block reply\npollsarefake -57 points 6 days ago That’s because you are a broke beta cuck and not an alpha like Trump No one will give you a handout you commie faggot permalink parent award report block reply Bythrfruitsyknow 34 points 6 days ago not an alpha like Trump simping ain't easy homo. permalink parent award report block reply HockeyMom4Trump 15 points 6 days ago You sound like you need to get back to math class before the teacher notices your empty seat. permalink parent award report block reply BigMikesSwingingCock 5 points 6 days ago It's just Anaconda being a faggot sperg. permalink parent award report block reply Aquamine-Amarine 13 points 6 days ago You're fucking stupid. Everyone's financial situation is different. permalink parent award report block reply pollsarefake -5 points 6 days ago If you want communism, gtfo This is America We respect strength and wealth permalink parent award report block reply PhilipeNegro 3 points 6 days ago You are such an immense faggot. It truly is amazing to witness. permalink parent award report block reply covok48 4 points 6 days ago How have you not been deported yet? You’ve been here a year and managed to be an asshole in every thread. Edit: Anaconda. Ah, yes. permalink parent award report block reply TitsOutForIsrael 2 points 6 days ago what an odd thing to say permalink parent award report block reply\nBythrfruitsyknow 34 points 6 days ago not an alpha like Trump simping ain't easy homo. permalink parent award report block reply\nHockeyMom4Trump 15 points 6 days ago You sound like you need to get back to math class before the teacher notices your empty seat. permalink parent award report block reply BigMikesSwingingCock 5 points 6 days ago It's just Anaconda being a faggot sperg. permalink parent award report block reply\nBigMikesSwingingCock 5 points 6 days ago It's just Anaconda being a faggot sperg. permalink parent award report block reply\nAquamine-Amarine 13 points 6 days ago You're fucking stupid. Everyone's financial situation is different. permalink parent award report block reply pollsarefake -5 points 6 days ago If you want communism, gtfo This is America We respect strength and wealth permalink parent award report block reply PhilipeNegro 3 points 6 days ago You are such an immense faggot. It truly is amazing to witness. permalink parent award report block reply\npollsarefake -5 points 6 days ago If you want communism, gtfo This is America We respect strength and wealth permalink parent award report block reply PhilipeNegro 3 points 6 days ago You are such an immense faggot. It truly is amazing to witness. permalink parent award report block reply\nPhilipeNegro 3 points 6 days ago You are such an immense faggot. It truly is amazing to witness. permalink parent award report block reply\ncovok48 4 points 6 days ago How have you not been deported yet? You’ve been here a year and managed to be an asshole in every thread. Edit: Anaconda. Ah, yes. permalink parent award report block reply\nTitsOutForIsrael 2 points 6 days ago what an odd thing to say permalink parent award report block reply\nTrumpYouMagaFrenner -57 points 6 days ago Must be on snap permalink parent award report block reply Deplorable_Yankee 33 points 6 days ago Another asshole insult. Glad you are doing well. What the fuck is wrong with you people?  Trump speaks and nobody can refute the claims.  Bullshit. permalink parent award report block reply bleeje 16 points 6 days ago Bec. they're paid shills dude. Everyone should be very concerned that we're back to 2019-early 2020 levels of pure nonsense and bullshit. But they're not. They don't care. Lies matter more to them than honesty. And someone is ALREADY paying these shills to lie. Imagine how bad the polling must be if less than a year into this term, they're already shills getting paid by somebody to lie. permalink parent award report block reply LiterallyKaiser 4 points 6 days ago Asking for your government to enact policy that helps your family’s financial situation? That sounds like socialism bro I don’t know. How about some corporate tax cuts and foreign aid to Argentina instead? permalink parent award report block reply JoeMcCarthyWasRight 8 points 6 days ago Taxing the fuck out of me to fund Israel’s wars and to fund NGOs to destroy my homeland from the inside out through mass illegal immigration and propaganda is called what now? permalink parent award report block reply view 1 more comments... covok48 1 points 6 days ago That’s the whole point of government, to improve the lives of its citizens. I don’t know what third world shithole you live in, but that’s the expectation in the West. permalink parent award report block reply view 1 more comments... TrumpYouMagaFrenner -9 points 6 days ago Im joking calm yourself permalink parent award report block reply JoeMcCarthyWasRight 6 points 6 days ago Work my ass off, faggot. permalink parent award report block reply covok48 6 points 6 days ago Dude, you don’t even have a job. Fuck off. permalink parent award report block reply\nDeplorable_Yankee 33 points 6 days ago Another asshole insult. Glad you are doing well. What the fuck is wrong with you people?  Trump speaks and nobody can refute the claims.  Bullshit. permalink parent award report block reply bleeje 16 points 6 days ago Bec. they're paid shills dude. Everyone should be very concerned that we're back to 2019-early 2020 levels of pure nonsense and bullshit. But they're not. They don't care. Lies matter more to them than honesty. And someone is ALREADY paying these shills to lie. Imagine how bad the polling must be if less than a year into this term, they're already shills getting paid by somebody to lie. permalink parent award report block reply LiterallyKaiser 4 points 6 days ago Asking for your government to enact policy that helps your family’s financial situation? That sounds like socialism bro I don’t know. How about some corporate tax cuts and foreign aid to Argentina instead? permalink parent award report block reply JoeMcCarthyWasRight 8 points 6 days ago Taxing the fuck out of me to fund Israel’s wars and to fund NGOs to destroy my homeland from the inside out through mass illegal immigration and propaganda is called what now? permalink parent award report block reply view 1 more comments... covok48 1 points 6 days ago That’s the whole point of government, to improve the lives of its citizens. I don’t know what third world shithole you live in, but that’s the expectation in the West. permalink parent award report block reply view 1 more comments... TrumpYouMagaFrenner -9 points 6 days ago Im joking calm yourself permalink parent award report block reply\nbleeje 16 points 6 days ago Bec. they're paid shills dude. Everyone should be very concerned that we're back to 2019-early 2020 levels of pure nonsense and bullshit. But they're not. They don't care. Lies matter more to them than honesty. And someone is ALREADY paying these shills to lie. Imagine how bad the polling must be if less than a year into this term, they're already shills getting paid by somebody to lie. permalink parent award report block reply\nLiterallyKaiser 4 points 6 days ago Asking for your government to enact policy that helps your family’s financial situation? That sounds like socialism bro I don’t know. How about some corporate tax cuts and foreign aid to Argentina instead? permalink parent award report block reply JoeMcCarthyWasRight 8 points 6 days ago Taxing the fuck out of me to fund Israel’s wars and to fund NGOs to destroy my homeland from the inside out through mass illegal immigration and propaganda is called what now? permalink parent award report block reply view 1 more comments... covok48 1 points 6 days ago That’s the whole point of government, to improve the lives of its citizens. I don’t know what third world shithole you live in, but that’s the expectation in the West. permalink parent award report block reply view 1 more comments...\nJoeMcCarthyWasRight 8 points 6 days ago Taxing the fuck out of me to fund Israel’s wars and to fund NGOs to destroy my homeland from the inside out through mass illegal immigration and propaganda is called what now? permalink parent award report block reply view 1 more comments...\ncovok48 1 points 6 days ago That’s the whole point of government, to improve the lives of its citizens. I don’t know what third world shithole you live in, but that’s the expectation in the West. permalink parent award report block reply view 1 more comments...\nTrumpYouMagaFrenner -9 points 6 days ago Im joking calm yourself permalink parent award report block reply\nJoeMcCarthyWasRight 6 points 6 days ago Work my ass off, faggot. permalink parent award report block reply\ncovok48 6 points 6 days ago Dude, you don’t even have a job. Fuck off. permalink parent award report block reply\nTrumpWonByALandslide 50 points 6 days ago He should really stop downplaying this. Affordability is a real issue whether or not prices of certain items have gone down. Tariffs have caused price increases on many goods (I agree with the tariffs for the good of the country and less reliance on foreign countries but still an important point). People are losing their jobs due to H1Bs, outsourcing, and AI. Home ownership is dead. PEOPLE CAN'T AFFORD SHIT!!! permalink award report block reply ToxicAvengerOhio 14 points 6 days ago He's even more ego driven than Ofagma. I didn't think that was possible. So when he see a claim that Walmart just made, he HAS to jump on it. \"See what I did!!!\" permalink parent award report block reply DontTreadOnSnek 8 points 6 days ago Yes and he didn't realize that this year's meal is less items and none are name brand. permalink parent award report block reply akai_ferret 9 points 6 days ago It's a big error on Trump's team and the democrat \"fact checkers\" have pounced. This \"walmart thanksgiving dinner\" is only cheaper because the items included changed to be cheaper. It's such a big fuckup I wonder if its sabotage from a rat in the WH who knew Trump would just tweet it. permalink parent award report block reply Solo_Dad 2 points 6 days ago The President generally isn't creating the tweets.  Most are things he approves from staff like Wiles or Miller.  Watched it first hand during the campaign.  Was present when \"Tampon Tim\" was blurted out by sr campaign staff and it was tweeted in minutes, I liked Timpax personally but I digress.  This probably wasn't him but he probably approved it.  Its tone deaf as hell. permalink parent award report block reply flashersenpai 2 points 6 days ago Wiles boo! boo this woman! permalink parent award report block reply Solo_Dad 2 points 6 days ago One time she pointed out to a motorcade driver that he was really close to construction cones on the passenger side.. the driver was avoiding hitting 3-4 LEOs who all almost hit each other then the motorcade.  Never figured out why some staff thought she was such a genius.  I felt like she was totally out of touch with the base... much like this tweet. permalink parent award report block reply MemeLawd 4 points 6 days ago The only reason prices lowered is because they were inflated last year due to bird flu permalink parent award report block reply pollsarefake -16 points 6 days ago Tariffs have led to prices going down not up The other countries are paying us money which is making us rich leading to lower prices permalink parent award report block reply Deplorable_Yankee 18 points 6 days ago Show me where prices went down. I’m not seeing that and the dozens of people bitching at work about how expensive living is now certainly aren’t saying that. permalink parent award report block reply HockeyMom4Trump -7 points 6 days ago I can objectively say eggs. They are now around $1.89 a dozen near me. Before, it was much more. permalink parent award report block reply MastaJoda 12 points 6 days ago eggs was a simple fix since it only takes a few months to go from egg to producing chicken...once you stop slaughtering them over bird coof. permalink parent award report block reply BigBadMagaMan 10 points 6 days ago Eggs are cheaper. That also has nothing to do with tariffs. permalink parent award report block reply yuge_covfefe 1 points 6 days ago Money's being paid to the federal government so you're half right. But that same money increases the prices for the consumers, because somebody's got to pay it. Until the feds lower tax rates or issue tax credits (fat chance on either) to reimburse us for those raised costs, the prices at the end of the day are absolutely higher to the people paying them - us. If and when domestic production ramps up, those price increases ought to disappear, or else wages will rise to compensate. So it's a long game, and one that I personally support. But let's be honest about what's really going on. permalink parent award report block reply drmrboy 0 points 6 days ago 🤫 permalink parent award report block reply Porkbut 3 points 6 days ago Why are you gay? permalink parent award report block reply NewGovModOnDutyBans 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nToxicAvengerOhio 14 points 6 days ago He's even more ego driven than Ofagma. I didn't think that was possible. So when he see a claim that Walmart just made, he HAS to jump on it. \"See what I did!!!\" permalink parent award report block reply DontTreadOnSnek 8 points 6 days ago Yes and he didn't realize that this year's meal is less items and none are name brand. permalink parent award report block reply\nDontTreadOnSnek 8 points 6 days ago Yes and he didn't realize that this year's meal is less items and none are name brand. permalink parent award report block reply\nakai_ferret 9 points 6 days ago It's a big error on Trump's team and the democrat \"fact checkers\" have pounced. This \"walmart thanksgiving dinner\" is only cheaper because the items included changed to be cheaper. It's such a big fuckup I wonder if its sabotage from a rat in the WH who knew Trump would just tweet it. permalink parent award report block reply Solo_Dad 2 points 6 days ago The President generally isn't creating the tweets.  Most are things he approves from staff like Wiles or Miller.  Watched it first hand during the campaign.  Was present when \"Tampon Tim\" was blurted out by sr campaign staff and it was tweeted in minutes, I liked Timpax personally but I digress.  This probably wasn't him but he probably approved it.  Its tone deaf as hell. permalink parent award report block reply flashersenpai 2 points 6 days ago Wiles boo! boo this woman! permalink parent award report block reply Solo_Dad 2 points 6 days ago One time she pointed out to a motorcade driver that he was really close to construction cones on the passenger side.. the driver was avoiding hitting 3-4 LEOs who all almost hit each other then the motorcade.  Never figured out why some staff thought she was such a genius.  I felt like she was totally out of touch with the base... much like this tweet. permalink parent award report block reply\nSolo_Dad 2 points 6 days ago The President generally isn't creating the tweets.  Most are things he approves from staff like Wiles or Miller.  Watched it first hand during the campaign.  Was present when \"Tampon Tim\" was blurted out by sr campaign staff and it was tweeted in minutes, I liked Timpax personally but I digress.  This probably wasn't him but he probably approved it.  Its tone deaf as hell. permalink parent award report block reply flashersenpai 2 points 6 days ago Wiles boo! boo this woman! permalink parent award report block reply Solo_Dad 2 points 6 days ago One time she pointed out to a motorcade driver that he was really close to construction cones on the passenger side.. the driver was avoiding hitting 3-4 LEOs who all almost hit each other then the motorcade.  Never figured out why some staff thought she was such a genius.  I felt like she was totally out of touch with the base... much like this tweet. permalink parent award report block reply\nflashersenpai 2 points 6 days ago Wiles boo! boo this woman! permalink parent award report block reply Solo_Dad 2 points 6 days ago One time she pointed out to a motorcade driver that he was really close to construction cones on the passenger side.. the driver was avoiding hitting 3-4 LEOs who all almost hit each other then the motorcade.  Never figured out why some staff thought she was such a genius.  I felt like she was totally out of touch with the base... much like this tweet. permalink parent award report block reply\nSolo_Dad 2 points 6 days ago One time she pointed out to a motorcade driver that he was really close to construction cones on the passenger side.. the driver was avoiding hitting 3-4 LEOs who all almost hit each other then the motorcade.  Never figured out why some staff thought she was such a genius.  I felt like she was totally out of touch with the base... much like this tweet. permalink parent award report block reply\nMemeLawd 4 points 6 days ago The only reason prices lowered is because they were inflated last year due to bird flu permalink parent award report block reply\npollsarefake -16 points 6 days ago Tariffs have led to prices going down not up The other countries are paying us money which is making us rich leading to lower prices permalink parent award report block reply Deplorable_Yankee 18 points 6 days ago Show me where prices went down. I’m not seeing that and the dozens of people bitching at work about how expensive living is now certainly aren’t saying that. permalink parent award report block reply HockeyMom4Trump -7 points 6 days ago I can objectively say eggs. They are now around $1.89 a dozen near me. Before, it was much more. permalink parent award report block reply MastaJoda 12 points 6 days ago eggs was a simple fix since it only takes a few months to go from egg to producing chicken...once you stop slaughtering them over bird coof. permalink parent award report block reply BigBadMagaMan 10 points 6 days ago Eggs are cheaper. That also has nothing to do with tariffs. permalink parent award report block reply yuge_covfefe 1 points 6 days ago Money's being paid to the federal government so you're half right. But that same money increases the prices for the consumers, because somebody's got to pay it. Until the feds lower tax rates or issue tax credits (fat chance on either) to reimburse us for those raised costs, the prices at the end of the day are absolutely higher to the people paying them - us. If and when domestic production ramps up, those price increases ought to disappear, or else wages will rise to compensate. So it's a long game, and one that I personally support. But let's be honest about what's really going on. permalink parent award report block reply drmrboy 0 points 6 days ago 🤫 permalink parent award report block reply Porkbut 3 points 6 days ago Why are you gay? permalink parent award report block reply NewGovModOnDutyBans 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nDeplorable_Yankee 18 points 6 days ago Show me where prices went down. I’m not seeing that and the dozens of people bitching at work about how expensive living is now certainly aren’t saying that. permalink parent award report block reply HockeyMom4Trump -7 points 6 days ago I can objectively say eggs. They are now around $1.89 a dozen near me. Before, it was much more. permalink parent award report block reply MastaJoda 12 points 6 days ago eggs was a simple fix since it only takes a few months to go from egg to producing chicken...once you stop slaughtering them over bird coof. permalink parent award report block reply BigBadMagaMan 10 points 6 days ago Eggs are cheaper. That also has nothing to do with tariffs. permalink parent award report block reply\nHockeyMom4Trump -7 points 6 days ago I can objectively say eggs. They are now around $1.89 a dozen near me. Before, it was much more. permalink parent award report block reply MastaJoda 12 points 6 days ago eggs was a simple fix since it only takes a few months to go from egg to producing chicken...once you stop slaughtering them over bird coof. permalink parent award report block reply BigBadMagaMan 10 points 6 days ago Eggs are cheaper. That also has nothing to do with tariffs. permalink parent award report block reply\nMastaJoda 12 points 6 days ago eggs was a simple fix since it only takes a few months to go from egg to producing chicken...once you stop slaughtering them over bird coof. permalink parent award report block reply\nBigBadMagaMan 10 points 6 days ago Eggs are cheaper. That also has nothing to do with tariffs. permalink parent award report block reply\nyuge_covfefe 1 points 6 days ago Money's being paid to the federal government so you're half right. But that same money increases the prices for the consumers, because somebody's got to pay it. Until the feds lower tax rates or issue tax credits (fat chance on either) to reimburse us for those raised costs, the prices at the end of the day are absolutely higher to the people paying them - us. If and when domestic production ramps up, those price increases ought to disappear, or else wages will rise to compensate. So it's a long game, and one that I personally support. But let's be honest about what's really going on. permalink parent award report block reply\ndrmrboy 0 points 6 days ago 🤫 permalink parent award report block reply Porkbut 3 points 6 days ago Why are you gay? permalink parent award report block reply\nPorkbut 3 points 6 days ago Why are you gay? permalink parent award report block reply\nNewGovModOnDutyBans 0 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\ndrmrboy 47 points 6 days ago So fucking what. Lol. Get Israel out of our government.  That'll be a better Thanksgiving present to your voter base.  Also ... lower our grocery prices ... all of them, not just Walmart turkey.  🤓 permalink award report block reply DT170x -32 points 6 days ago Name me Store chains in America in the top of your head. I bet you are NOT from America and only here to cause division. Then again you hate MAGA and you just put on a MAGA face. permalink parent award report block reply Glory-Unto-God 10 points 6 days ago Just store chains or you want other stuff that sorta fits as a store for those of us that use our hands as well while i piss all over the golden calf. Hobby lobby, Lowes, walmart, technically aldi(german but its here), home depot, Hoffman, Johnstone, lennox (garbage i hate them), Publix, etc etc. Kick out the yids, kick out the jeets, kick out the blacks roaming the streets, kick out the Muslims. Kick them all out. We have a country's soul to worry about. permalink parent award report block reply MegoThor 2 points 6 days ago Kick out the yids, kick out the jeets, kick out the blacks roaming the streets ”It’s like poetry, they rhyme.” -George Lucas permalink parent award report block reply getup 1 points 6 days ago Cope harder you dumb faggot. permalink parent award report block reply drmrboy -3 points 6 days ago 🤫 permalink parent award report block reply DT170x 1 points 6 days ago I don't block people. I tend to call out obvious BS and that currently is you. permalink parent award report block reply HockeyMom4Trump 5 points 6 days ago He could not name one grocery store, apparently. permalink parent award report block reply view 1 more comments...\nDT170x -32 points 6 days ago Name me Store chains in America in the top of your head. I bet you are NOT from America and only here to cause division. Then again you hate MAGA and you just put on a MAGA face. permalink parent award report block reply Glory-Unto-God 10 points 6 days ago Just store chains or you want other stuff that sorta fits as a store for those of us that use our hands as well while i piss all over the golden calf. Hobby lobby, Lowes, walmart, technically aldi(german but its here), home depot, Hoffman, Johnstone, lennox (garbage i hate them), Publix, etc etc. Kick out the yids, kick out the jeets, kick out the blacks roaming the streets, kick out the Muslims. Kick them all out. We have a country's soul to worry about. permalink parent award report block reply MegoThor 2 points 6 days ago Kick out the yids, kick out the jeets, kick out the blacks roaming the streets ”It’s like poetry, they rhyme.” -George Lucas permalink parent award report block reply getup 1 points 6 days ago Cope harder you dumb faggot. permalink parent award report block reply drmrboy -3 points 6 days ago 🤫 permalink parent award report block reply DT170x 1 points 6 days ago I don't block people. I tend to call out obvious BS and that currently is you. permalink parent award report block reply HockeyMom4Trump 5 points 6 days ago He could not name one grocery store, apparently. permalink parent award report block reply view 1 more comments...\nGlory-Unto-God 10 points 6 days ago Just store chains or you want other stuff that sorta fits as a store for those of us that use our hands as well while i piss all over the golden calf. Hobby lobby, Lowes, walmart, technically aldi(german but its here), home depot, Hoffman, Johnstone, lennox (garbage i hate them), Publix, etc etc. Kick out the yids, kick out the jeets, kick out the blacks roaming the streets, kick out the Muslims. Kick them all out. We have a country's soul to worry about. permalink parent award report block reply MegoThor 2 points 6 days ago Kick out the yids, kick out the jeets, kick out the blacks roaming the streets ”It’s like poetry, they rhyme.” -George Lucas permalink parent award report block reply\nMegoThor 2 points 6 days ago Kick out the yids, kick out the jeets, kick out the blacks roaming the streets ”It’s like poetry, they rhyme.” -George Lucas permalink parent award report block reply\ngetup 1 points 6 days ago Cope harder you dumb faggot. permalink parent award report block reply\ndrmrboy -3 points 6 days ago 🤫 permalink parent award report block reply DT170x 1 points 6 days ago I don't block people. I tend to call out obvious BS and that currently is you. permalink parent award report block reply HockeyMom4Trump 5 points 6 days ago He could not name one grocery store, apparently. permalink parent award report block reply view 1 more comments...\nDT170x 1 points 6 days ago I don't block people. I tend to call out obvious BS and that currently is you. permalink parent award report block reply HockeyMom4Trump 5 points 6 days ago He could not name one grocery store, apparently. permalink parent award report block reply view 1 more comments...\nHockeyMom4Trump 5 points 6 days ago He could not name one grocery store, apparently. permalink parent award report block reply view 1 more comments...\nassblast 43 points 6 days ago Outright lie. \"America First\" has been \"every other country's wars and issues first\" and I'm getting sick and tired of it. Why does he not have people's heads on a platter for not ending the filibuster? Why does he just yell into the void all the time? permalink award report block reply DontTreadOnSnek 1 points 6 days ago Trump is the physical embodiment of the \"old man yells at clouds\" meme. permalink parent award report block reply UCantStumpTheTrump -1 points 6 days ago Yeah because everything would be so much better if Kamala had “won.” Liberal retard land is that way 👉🏻 permalink parent award report block reply UCantStumpTheTrump -1 points 6 days ago Fuck off doomer shill. Trump is delivering on tons of promises, you’re just here to try to “divide the base.” You are not MAGA permalink parent award report block reply necrosexy -2 points 6 days ago Ending the filibuster? Are you retarded? permalink parent award report block reply YouEssAye 2 points 6 days ago We have control of the house, Senate, and presidency yet what the fuck has actually been accomplished? ~400k deportations, out of 40 million? He has 1 more year to accomplish anything before the left retakes Congress. If he were serious about fixing the country, he would've forced congress to end the filibuster 6 months ago and rammed through everything we voted for, the left couldn't stop a thing. permalink parent award report block reply NewGovModOnDutyBans -1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago right, I’m sure Kamala Harris would be doing a much better job. Fuck off back to liberal retard land you faggot permalink parent award report block reply\nDontTreadOnSnek 1 points 6 days ago Trump is the physical embodiment of the \"old man yells at clouds\" meme. permalink parent award report block reply UCantStumpTheTrump -1 points 6 days ago Yeah because everything would be so much better if Kamala had “won.” Liberal retard land is that way 👉🏻 permalink parent award report block reply\nUCantStumpTheTrump -1 points 6 days ago Yeah because everything would be so much better if Kamala had “won.” Liberal retard land is that way 👉🏻 permalink parent award report block reply\nUCantStumpTheTrump -1 points 6 days ago Fuck off doomer shill. Trump is delivering on tons of promises, you’re just here to try to “divide the base.” You are not MAGA permalink parent award report block reply\nnecrosexy -2 points 6 days ago Ending the filibuster? Are you retarded? permalink parent award report block reply YouEssAye 2 points 6 days ago We have control of the house, Senate, and presidency yet what the fuck has actually been accomplished? ~400k deportations, out of 40 million? He has 1 more year to accomplish anything before the left retakes Congress. If he were serious about fixing the country, he would've forced congress to end the filibuster 6 months ago and rammed through everything we voted for, the left couldn't stop a thing. permalink parent award report block reply\nYouEssAye 2 points 6 days ago We have control of the house, Senate, and presidency yet what the fuck has actually been accomplished? ~400k deportations, out of 40 million? He has 1 more year to accomplish anything before the left retakes Congress. If he were serious about fixing the country, he would've forced congress to end the filibuster 6 months ago and rammed through everything we voted for, the left couldn't stop a thing. permalink parent award report block reply\nNewGovModOnDutyBans -1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago right, I’m sure Kamala Harris would be doing a much better job. Fuck off back to liberal retard land you faggot permalink parent award report block reply\nUCantStumpTheTrump 1 points 6 days ago right, I’m sure Kamala Harris would be doing a much better job. Fuck off back to liberal retard land you faggot permalink parent award report block reply\nkilledmytv 34 points 6 days ago In related news, a head of lettuce has decreased from 99 cents to $2.39 in just a few years. permalink award report block reply\nbearhugprolapse 30 points 6 days ago how tone deaf can you be? permalink award report block reply\ncyberwar 28 points 6 days ago bullshit, this is a Biden Level lie permalink award report block reply\nDeplorable_Yankee 27 points 6 days ago Hey Don. I don’t have millions of dollars at my disposal. Affordability is still a HUGE issue. permalink award report block reply\nTrumpYouMagaFrenner 26 points 6 days ago Dont see it permalink award report block reply akai_ferret 8 points 6 days ago It's a big error on Trump's team and the democrat \"fact checkers\" have pounced. This \"walmart thanksgiving dinner\" is only cheaper because the items included changed to be cheaper. It's such a big fuckup I wonder if its sabotage from a rat in the WH who knew Trump would just tweet it. permalink parent award report block reply pollsarefake -31 points 6 days ago That’s because you are a welfare queen looking for a handout permalink parent award report block reply TrumpYouMagaFrenner 18 points 6 days ago Nah probably because $100 doesnt afford a week's groceries. Maybe because I live in illinois. permalink parent award report block reply MAG-n-KAG 10 points 6 days ago I live by myself in deep red country.  I go to the grocery store once a week, and I ONLY buy things I will eat that week.  It costs about $80 bucks.  Thats just for one person, for one week.  I cant imagine how much itd be for a family with 2-3 kids. permalink parent award report block reply flashersenpai 6 points 6 days ago damn permalink parent award report block reply NonbinaryPotatohead 6 points 6 days ago I have kids and it's crazy how much I spend. We eat meat, fruits and veggies. We just had to cut out milk. These prices + insurance + taxes are out of fucking control and all I see is more and more money going abroad. permalink parent award report block reply HockeyMom4Trump 2 points 6 days ago Depends on the family. If they get SNAP benefits, the total is hundreds. If they work and use their own money and clip coupons and shop sales, then it is less money. permalink parent award report block reply view 1 more comments... Aquamine-Amarine 7 points 6 days ago Fuck off. Most people here do not use EBT, and we don't want a handout. permalink parent award report block reply\nakai_ferret 8 points 6 days ago It's a big error on Trump's team and the democrat \"fact checkers\" have pounced. This \"walmart thanksgiving dinner\" is only cheaper because the items included changed to be cheaper. It's such a big fuckup I wonder if its sabotage from a rat in the WH who knew Trump would just tweet it. permalink parent award report block reply\npollsarefake -31 points 6 days ago That’s because you are a welfare queen looking for a handout permalink parent award report block reply TrumpYouMagaFrenner 18 points 6 days ago Nah probably because $100 doesnt afford a week's groceries. Maybe because I live in illinois. permalink parent award report block reply MAG-n-KAG 10 points 6 days ago I live by myself in deep red country.  I go to the grocery store once a week, and I ONLY buy things I will eat that week.  It costs about $80 bucks.  Thats just for one person, for one week.  I cant imagine how much itd be for a family with 2-3 kids. permalink parent award report block reply flashersenpai 6 points 6 days ago damn permalink parent award report block reply NonbinaryPotatohead 6 points 6 days ago I have kids and it's crazy how much I spend. We eat meat, fruits and veggies. We just had to cut out milk. These prices + insurance + taxes are out of fucking control and all I see is more and more money going abroad. permalink parent award report block reply HockeyMom4Trump 2 points 6 days ago Depends on the family. If they get SNAP benefits, the total is hundreds. If they work and use their own money and clip coupons and shop sales, then it is less money. permalink parent award report block reply view 1 more comments... Aquamine-Amarine 7 points 6 days ago Fuck off. Most people here do not use EBT, and we don't want a handout. permalink parent award report block reply\nTrumpYouMagaFrenner 18 points 6 days ago Nah probably because $100 doesnt afford a week's groceries. Maybe because I live in illinois. permalink parent award report block reply MAG-n-KAG 10 points 6 days ago I live by myself in deep red country.  I go to the grocery store once a week, and I ONLY buy things I will eat that week.  It costs about $80 bucks.  Thats just for one person, for one week.  I cant imagine how much itd be for a family with 2-3 kids. permalink parent award report block reply flashersenpai 6 points 6 days ago damn permalink parent award report block reply NonbinaryPotatohead 6 points 6 days ago I have kids and it's crazy how much I spend. We eat meat, fruits and veggies. We just had to cut out milk. These prices + insurance + taxes are out of fucking control and all I see is more and more money going abroad. permalink parent award report block reply HockeyMom4Trump 2 points 6 days ago Depends on the family. If they get SNAP benefits, the total is hundreds. If they work and use their own money and clip coupons and shop sales, then it is less money. permalink parent award report block reply view 1 more comments...\nMAG-n-KAG 10 points 6 days ago I live by myself in deep red country.  I go to the grocery store once a week, and I ONLY buy things I will eat that week.  It costs about $80 bucks.  Thats just for one person, for one week.  I cant imagine how much itd be for a family with 2-3 kids. permalink parent award report block reply flashersenpai 6 points 6 days ago damn permalink parent award report block reply NonbinaryPotatohead 6 points 6 days ago I have kids and it's crazy how much I spend. We eat meat, fruits and veggies. We just had to cut out milk. These prices + insurance + taxes are out of fucking control and all I see is more and more money going abroad. permalink parent award report block reply HockeyMom4Trump 2 points 6 days ago Depends on the family. If they get SNAP benefits, the total is hundreds. If they work and use their own money and clip coupons and shop sales, then it is less money. permalink parent award report block reply view 1 more comments...\nflashersenpai 6 points 6 days ago damn permalink parent award report block reply\nNonbinaryPotatohead 6 points 6 days ago I have kids and it's crazy how much I spend. We eat meat, fruits and veggies. We just had to cut out milk. These prices + insurance + taxes are out of fucking control and all I see is more and more money going abroad. permalink parent award report block reply\nHockeyMom4Trump 2 points 6 days ago Depends on the family. If they get SNAP benefits, the total is hundreds. If they work and use their own money and clip coupons and shop sales, then it is less money. permalink parent award report block reply view 1 more comments...\nAquamine-Amarine 7 points 6 days ago Fuck off. Most people here do not use EBT, and we don't want a handout. permalink parent award report block reply\nHankScorpio 22 points 6 days ago Trump fully supporting Israel which is one of the most Uni party issues that exists the handling of the Epstein files The deep state not being arrested for Russia Russia Russia Trump siding with Ukraine If these 4 issues arent fixed, the America first based that got Trump elected is going to feel demoralized and stay home and Democrats will continue to win. permalink award report block reply TrumpWonByALandslide 7 points 6 days ago These aren't the main issues. People are staying home because nobody can afford anything and the GOP congress doesn't give a shit. permalink parent award report block reply Brock_Shithouse 3 points 6 days ago Don't forget \"mass\" deportations turned into minimal deportations. permalink parent award report block reply NewGovModOnDutyBans 3 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Krat 3 points 6 days ago We are officially a partial communist country now permalink parent award report block reply UCantStumpTheTrump 0 points 6 days ago The lefties are all over this thread trying to demoralize the base. Look at how many comments are shitting on Trump and giving him ZERO credit. These are not MAGA folks commenting permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpWonByALandslide 7 points 6 days ago These aren't the main issues. People are staying home because nobody can afford anything and the GOP congress doesn't give a shit. permalink parent award report block reply\nBrock_Shithouse 3 points 6 days ago Don't forget \"mass\" deportations turned into minimal deportations. permalink parent award report block reply NewGovModOnDutyBans 3 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNewGovModOnDutyBans 3 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nKrat 3 points 6 days ago We are officially a partial communist country now permalink parent award report block reply\nUCantStumpTheTrump 0 points 6 days ago The lefties are all over this thread trying to demoralize the base. Look at how many comments are shitting on Trump and giving him ZERO credit. These are not MAGA folks commenting permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nRudeFrog 19 points 6 days ago Is it though? Or are those just words? permalink award report block reply\nBouldabassed 19 points 6 days ago Going the Biden route of gaslighting people on costs and the economy is not a winning strategy. permalink award report block reply mailinvoter -10 points 6 days ago Inflation is down from >9% to 3%, so the dollar has more value.  Gaslighting people to think Trump's economy isn't doing good is what redditards do and not very productive. Edit: Oh Noes!!! The anti-Trump fags are out in force!!!  Whatever shall I do with all those downdoots?!?!?!  Oh, I know.  I'll tell you to go fuck yourselves.  Trump is your president and Kumala sucks dick to get \"a head\", haha faggots. permalink parent award report block reply armyofpedes4usa 12 points 6 days ago 9-3% just means the rate of which the dollar is being devalued is going down.  You would need a negative inflation rate to really up it's value. permalink parent award report block reply mailinvoter -8 points 6 days ago Wow, just wow. 🤦 permalink parent award report block reply NewGovModOnDutyBans 4 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nmailinvoter -10 points 6 days ago Inflation is down from >9% to 3%, so the dollar has more value.  Gaslighting people to think Trump's economy isn't doing good is what redditards do and not very productive. Edit: Oh Noes!!! The anti-Trump fags are out in force!!!  Whatever shall I do with all those downdoots?!?!?!  Oh, I know.  I'll tell you to go fuck yourselves.  Trump is your president and Kumala sucks dick to get \"a head\", haha faggots. permalink parent award report block reply armyofpedes4usa 12 points 6 days ago 9-3% just means the rate of which the dollar is being devalued is going down.  You would need a negative inflation rate to really up it's value. permalink parent award report block reply mailinvoter -8 points 6 days ago Wow, just wow. 🤦 permalink parent award report block reply NewGovModOnDutyBans 4 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\narmyofpedes4usa 12 points 6 days ago 9-3% just means the rate of which the dollar is being devalued is going down.  You would need a negative inflation rate to really up it's value. permalink parent award report block reply mailinvoter -8 points 6 days ago Wow, just wow. 🤦 permalink parent award report block reply\nmailinvoter -8 points 6 days ago Wow, just wow. 🤦 permalink parent award report block reply\nNewGovModOnDutyBans 4 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nCovfefeVideo 18 points 6 days ago We'll lose that savings if we turn on the lights. permalink award report block reply\nceva 18 points 6 days ago They're also 25% smaller and almost 100% less actual food. The 2025 meal has no fresh veggies (except potatoes) and is full of ultra processed crap. The 2024 meal is significantly larger and has plenty of fresh veggies included. Also, the 2025 meal has turkey listed at \"$0.97/lb. — lowest price since 2019,\" but the 2024 meal has turkey listed at $0.88/lb.? Make it make sense EDIT: I love that shills are downvoting me for sharing actual facts lol permalink award report block reply armyofpedes4usa 11 points 6 days ago Thanks for the links, so it's more gaslighting. permalink parent award report block reply ceva 9 points 6 days ago No problem! Always follow the procedure of verifying what the powers that be tell you. There's often another story that's going untold. On the surface: lower prices! Great! Looking deeper: the portions are smaller, the food is worse, the prices are actually higher in some respects (per lb price of turkey) permalink parent award report block reply mil5781 2 points 6 days ago What plenty of fresh veggies?  2024 had celery and onions.  2025 has carrots and cranberries.  There's no other veggies there beyond canned, in both years.  There's also plenty of Great Value in both. permalink parent award report block reply ceva 3 points 6 days ago It's still very misleading that 2025 is at all better. The turkey is more expensive (despite the list saying it's cheaper, so it's a lie), the ingredients are fewer, there's overall less available. It's a bad bad bad comparison. permalink parent award report block reply mil5781 0 points 6 days ago I disagree.  It's 13.5 lb Turkey this year, while it was 10 - 16 lb last year.  Since it's a set price, those who got 10 lb Turkeys didn't get it at the 88 cent price point.  It's an $8.88 - $14.08 Turkey last year, and it's a consistent $13 per Turkey this year.  There's no corn meal for muffins, and there's no pecan pie, only pumpkin.  Otherwise, it's basically exactly the same, just swapping out 1 veg for a different one.  22 items in this year compared to 29 last year, but if you take out those extras, it's nearly identical, just some things swapped out for others. It even has close to 3 lbs of fresh vegs this year.  Last year was a celery stalk and onions.  There were no real fresh veg at all.  It also was around 55 for 8 people, and now it's less than 40 for 10 people.  You can spend that extra 15 bucks to get well more than what was left out. Only shill here is you bud. permalink parent award report block reply\narmyofpedes4usa 11 points 6 days ago Thanks for the links, so it's more gaslighting. permalink parent award report block reply ceva 9 points 6 days ago No problem! Always follow the procedure of verifying what the powers that be tell you. There's often another story that's going untold. On the surface: lower prices! Great! Looking deeper: the portions are smaller, the food is worse, the prices are actually higher in some respects (per lb price of turkey) permalink parent award report block reply\nceva 9 points 6 days ago No problem! Always follow the procedure of verifying what the powers that be tell you. There's often another story that's going untold. On the surface: lower prices! Great! Looking deeper: the portions are smaller, the food is worse, the prices are actually higher in some respects (per lb price of turkey) permalink parent award report block reply\nmil5781 2 points 6 days ago What plenty of fresh veggies?  2024 had celery and onions.  2025 has carrots and cranberries.  There's no other veggies there beyond canned, in both years.  There's also plenty of Great Value in both. permalink parent award report block reply ceva 3 points 6 days ago It's still very misleading that 2025 is at all better. The turkey is more expensive (despite the list saying it's cheaper, so it's a lie), the ingredients are fewer, there's overall less available. It's a bad bad bad comparison. permalink parent award report block reply mil5781 0 points 6 days ago I disagree.  It's 13.5 lb Turkey this year, while it was 10 - 16 lb last year.  Since it's a set price, those who got 10 lb Turkeys didn't get it at the 88 cent price point.  It's an $8.88 - $14.08 Turkey last year, and it's a consistent $13 per Turkey this year.  There's no corn meal for muffins, and there's no pecan pie, only pumpkin.  Otherwise, it's basically exactly the same, just swapping out 1 veg for a different one.  22 items in this year compared to 29 last year, but if you take out those extras, it's nearly identical, just some things swapped out for others. It even has close to 3 lbs of fresh vegs this year.  Last year was a celery stalk and onions.  There were no real fresh veg at all.  It also was around 55 for 8 people, and now it's less than 40 for 10 people.  You can spend that extra 15 bucks to get well more than what was left out. Only shill here is you bud. permalink parent award report block reply\nceva 3 points 6 days ago It's still very misleading that 2025 is at all better. The turkey is more expensive (despite the list saying it's cheaper, so it's a lie), the ingredients are fewer, there's overall less available. It's a bad bad bad comparison. permalink parent award report block reply mil5781 0 points 6 days ago I disagree.  It's 13.5 lb Turkey this year, while it was 10 - 16 lb last year.  Since it's a set price, those who got 10 lb Turkeys didn't get it at the 88 cent price point.  It's an $8.88 - $14.08 Turkey last year, and it's a consistent $13 per Turkey this year.  There's no corn meal for muffins, and there's no pecan pie, only pumpkin.  Otherwise, it's basically exactly the same, just swapping out 1 veg for a different one.  22 items in this year compared to 29 last year, but if you take out those extras, it's nearly identical, just some things swapped out for others. It even has close to 3 lbs of fresh vegs this year.  Last year was a celery stalk and onions.  There were no real fresh veg at all.  It also was around 55 for 8 people, and now it's less than 40 for 10 people.  You can spend that extra 15 bucks to get well more than what was left out. Only shill here is you bud. permalink parent award report block reply\nmil5781 0 points 6 days ago I disagree.  It's 13.5 lb Turkey this year, while it was 10 - 16 lb last year.  Since it's a set price, those who got 10 lb Turkeys didn't get it at the 88 cent price point.  It's an $8.88 - $14.08 Turkey last year, and it's a consistent $13 per Turkey this year.  There's no corn meal for muffins, and there's no pecan pie, only pumpkin.  Otherwise, it's basically exactly the same, just swapping out 1 veg for a different one.  22 items in this year compared to 29 last year, but if you take out those extras, it's nearly identical, just some things swapped out for others. It even has close to 3 lbs of fresh vegs this year.  Last year was a celery stalk and onions.  There were no real fresh veg at all.  It also was around 55 for 8 people, and now it's less than 40 for 10 people.  You can spend that extra 15 bucks to get well more than what was left out. Only shill here is you bud. permalink parent award report block reply\nempiretc 15 points 6 days ago Well, we are going to spend ~$150 this year for 8 people. that is a little less than last year, but not 25%. permalink award report block reply\nfriarfox 14 points 6 days ago He forgot to mention that it's 15 items instead of 21 and uses more generic Best Value products. But hey it's politics. permalink award report block reply\nUltraFrogMan 14 points 6 days ago Gas is down. That's about it permalink award report block reply HockeyMom4Trump 14 points 6 days ago It is still $3.19 near me. That is same as Biden year ago gas. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nHockeyMom4Trump 14 points 6 days ago It is still $3.19 near me. That is same as Biden year ago gas. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBurtMcGirt 13 points 6 days ago Imagine how affordable things would be if the 50 million people who shouldn't be here weren't here. permalink award report block reply mailinvoter 10 points 6 days ago And if we weren't subsidizing able bodied scabs to get \"free\" food to inflate costs. permalink parent award report block reply Bearing51 5 points 6 days ago And if we were subsidizing 90% of the countries on this fucking planet with our tax dollars. permalink parent award report block reply BurtMcGirt 1 points 6 days ago Yep permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago Well that’s why they’re deporting them: https://www.dhs.gov/news/2025/11/05/dhs-delivers-historic-start-border-crossings-fy-2026 permalink parent award report block reply BurtMcGirt 1 points 6 days ago Great that they got the inflow mostly stopped, but we aren't even on pace to deport even just the number Biden's handlers let in, before the end of President Trump's term. It's going to take around 80 years, at this pace, if no more get in and none reproduce. permalink parent award report block reply UCantStumpTheTrump -1 points 6 days ago First you complain about the illegals here, then you complain Trump isn’t doing enough, fast enough for you. You realize he’s getting obstructed from all angles right? Try giving POTUS some credit where it’s due. You wouldn’t like what would be happening if Kamala “won” permalink parent award report block reply BurtMcGirt 1 points 6 days ago I did give President Trump credit for shutting down the flow of illegals. The amount being deported, though, is statistically insignificant. We have a very limited amount of time (probably until mid terms) to get things done. President Trump has probably done all he can do while being obstructed by BOTH wings of the Uniparty. It's a shame there aren't more America First people in Congress to try to advance President Trump's agenda. He cannot do it all on his own. permalink parent award report block reply\nmailinvoter 10 points 6 days ago And if we weren't subsidizing able bodied scabs to get \"free\" food to inflate costs. permalink parent award report block reply Bearing51 5 points 6 days ago And if we were subsidizing 90% of the countries on this fucking planet with our tax dollars. permalink parent award report block reply BurtMcGirt 1 points 6 days ago Yep permalink parent award report block reply\nBearing51 5 points 6 days ago And if we were subsidizing 90% of the countries on this fucking planet with our tax dollars. permalink parent award report block reply\nBurtMcGirt 1 points 6 days ago Yep permalink parent award report block reply\nUCantStumpTheTrump 1 points 6 days ago Well that’s why they’re deporting them: https://www.dhs.gov/news/2025/11/05/dhs-delivers-historic-start-border-crossings-fy-2026 permalink parent award report block reply BurtMcGirt 1 points 6 days ago Great that they got the inflow mostly stopped, but we aren't even on pace to deport even just the number Biden's handlers let in, before the end of President Trump's term. It's going to take around 80 years, at this pace, if no more get in and none reproduce. permalink parent award report block reply UCantStumpTheTrump -1 points 6 days ago First you complain about the illegals here, then you complain Trump isn’t doing enough, fast enough for you. You realize he’s getting obstructed from all angles right? Try giving POTUS some credit where it’s due. You wouldn’t like what would be happening if Kamala “won” permalink parent award report block reply BurtMcGirt 1 points 6 days ago I did give President Trump credit for shutting down the flow of illegals. The amount being deported, though, is statistically insignificant. We have a very limited amount of time (probably until mid terms) to get things done. President Trump has probably done all he can do while being obstructed by BOTH wings of the Uniparty. It's a shame there aren't more America First people in Congress to try to advance President Trump's agenda. He cannot do it all on his own. permalink parent award report block reply\nBurtMcGirt 1 points 6 days ago Great that they got the inflow mostly stopped, but we aren't even on pace to deport even just the number Biden's handlers let in, before the end of President Trump's term. It's going to take around 80 years, at this pace, if no more get in and none reproduce. permalink parent award report block reply UCantStumpTheTrump -1 points 6 days ago First you complain about the illegals here, then you complain Trump isn’t doing enough, fast enough for you. You realize he’s getting obstructed from all angles right? Try giving POTUS some credit where it’s due. You wouldn’t like what would be happening if Kamala “won” permalink parent award report block reply BurtMcGirt 1 points 6 days ago I did give President Trump credit for shutting down the flow of illegals. The amount being deported, though, is statistically insignificant. We have a very limited amount of time (probably until mid terms) to get things done. President Trump has probably done all he can do while being obstructed by BOTH wings of the Uniparty. It's a shame there aren't more America First people in Congress to try to advance President Trump's agenda. He cannot do it all on his own. permalink parent award report block reply\nUCantStumpTheTrump -1 points 6 days ago First you complain about the illegals here, then you complain Trump isn’t doing enough, fast enough for you. You realize he’s getting obstructed from all angles right? Try giving POTUS some credit where it’s due. You wouldn’t like what would be happening if Kamala “won” permalink parent award report block reply BurtMcGirt 1 points 6 days ago I did give President Trump credit for shutting down the flow of illegals. The amount being deported, though, is statistically insignificant. We have a very limited amount of time (probably until mid terms) to get things done. President Trump has probably done all he can do while being obstructed by BOTH wings of the Uniparty. It's a shame there aren't more America First people in Congress to try to advance President Trump's agenda. He cannot do it all on his own. permalink parent award report block reply\nBurtMcGirt 1 points 6 days ago I did give President Trump credit for shutting down the flow of illegals. The amount being deported, though, is statistically insignificant. We have a very limited amount of time (probably until mid terms) to get things done. President Trump has probably done all he can do while being obstructed by BOTH wings of the Uniparty. It's a shame there aren't more America First people in Congress to try to advance President Trump's agenda. He cannot do it all on his own. permalink parent award report block reply\nExecutarian2 12 points 6 days ago Impossible. 25% cheaper?! In what world?? No, the affordability issue is not dead, what the fuck? Horrible messaging. He should be embracing the affordability issue. permalink award report block reply\njosiborg 12 points 6 days ago He better start going hard because we only have a short time left. No more saving Israel jet setting around the globe. Kick all these people out, save our elections, put laws back in place for propaganda through media and make it tighter (name it Kirk Law), divert the money going to that to American taxpayers, and Lock HER UP! Start interviewing Americans that cannot get jobs from H1B or otherwise stupid visas and put us weaponized Autists to work Making America America Again. Just cut the bullshit and let's go get it. permalink award report block reply\nNineteenEightyFour 10 points 6 days ago Tired of this out of touch asshole gaslighting us. permalink award report block reply UCantStumpTheTrump -5 points 6 days ago Tired of you doomer shills infesting this site. Trump isn’t perfect, we know that. Liberal retard land is that way 👉🏻 permalink parent award report block reply\nUCantStumpTheTrump -5 points 6 days ago Tired of you doomer shills infesting this site. Trump isn’t perfect, we know that. Liberal retard land is that way 👉🏻 permalink parent award report block reply\nRockFlagAndEagle2020 10 points 6 days ago Yeah this is a straight up lie. permalink award report block reply\nbirddogz 10 points 6 days ago Trump is so out of touch on this issue.  Nothing is cheaper permalink award report block reply UCantStumpTheTrump -3 points 6 days ago The Trump admin is actively working to make things cheaper while the Biden regime actively worked to make them more expensive. How do you fail to understand this? permalink parent award report block reply Maganifice7 4 points 6 days ago Cope all you want, but things are not cheaper, except maybe eggs. permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago Things WILL get cheaper because we’re actually opening up drilling, oil/gas projects, and deporting illegals. The previous admin was doing the opposite of that permalink parent award report block reply\nUCantStumpTheTrump -3 points 6 days ago The Trump admin is actively working to make things cheaper while the Biden regime actively worked to make them more expensive. How do you fail to understand this? permalink parent award report block reply Maganifice7 4 points 6 days ago Cope all you want, but things are not cheaper, except maybe eggs. permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago Things WILL get cheaper because we’re actually opening up drilling, oil/gas projects, and deporting illegals. The previous admin was doing the opposite of that permalink parent award report block reply\nMaganifice7 4 points 6 days ago Cope all you want, but things are not cheaper, except maybe eggs. permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago Things WILL get cheaper because we’re actually opening up drilling, oil/gas projects, and deporting illegals. The previous admin was doing the opposite of that permalink parent award report block reply\nUCantStumpTheTrump 1 points 6 days ago Things WILL get cheaper because we’re actually opening up drilling, oil/gas projects, and deporting illegals. The previous admin was doing the opposite of that permalink parent award report block reply\nBannedAccount 10 points 6 days ago Yeah canceling ebt will do that as prices tend to drop when there's less demand. permalink award report block reply pollsarefake -17 points 6 days ago All the welfare queens have come to the comment section to whine permalink parent award report block reply BannedAccount 7 points 6 days ago Idk what you're implying but im not on ebt I spend $300/week just to feed my family of 4 granted almost $70 of that is just infant formula but non of it is what you'd consider a \"luxury\" item its mostly just meat, butter, milk, and eggs... permalink parent award report block reply Visceroth -2 points 6 days ago you found an infant formula that isn't full of vegetable oils, soy, and chemicals? permalink parent award report block reply BannedAccount 4 points 6 days ago Yes actually its Kendamil its still not perfect but its alot healthier than the main brands. The other day I noticed its a European import so it might have something to do with their laws against completely toxic food. The best part is its also cheaper than shit like similac or infamil. permalink parent award report block reply Glory-Unto-God 3 points 6 days ago 0 welfare here and shits expensive even making 85k a year. Single income family taking care of 3 coming on 4 kids my wife and my widowed mother. For someone of less means this shit would be close to impossible. People like you remind me that there's a reason benevolent rulers often had princes that despised the plebians. Utterly myopic and self absorbed rats really spoil the bunch permalink parent award report block reply BigBadMagaMan 1 points 6 days ago That comment was actually in support of ending EBT but you’re such a disingenuous cunt, you can’t even read. permalink parent award report block reply pollsarefake -2 points 6 days ago No I support that comment I’m saying the rest of the comment section is rife with welfare queens You’re the one that can’t read which is probably why you need welfare permalink parent award report block reply\npollsarefake -17 points 6 days ago All the welfare queens have come to the comment section to whine permalink parent award report block reply BannedAccount 7 points 6 days ago Idk what you're implying but im not on ebt I spend $300/week just to feed my family of 4 granted almost $70 of that is just infant formula but non of it is what you'd consider a \"luxury\" item its mostly just meat, butter, milk, and eggs... permalink parent award report block reply Visceroth -2 points 6 days ago you found an infant formula that isn't full of vegetable oils, soy, and chemicals? permalink parent award report block reply BannedAccount 4 points 6 days ago Yes actually its Kendamil its still not perfect but its alot healthier than the main brands. The other day I noticed its a European import so it might have something to do with their laws against completely toxic food. The best part is its also cheaper than shit like similac or infamil. permalink parent award report block reply Glory-Unto-God 3 points 6 days ago 0 welfare here and shits expensive even making 85k a year. Single income family taking care of 3 coming on 4 kids my wife and my widowed mother. For someone of less means this shit would be close to impossible. People like you remind me that there's a reason benevolent rulers often had princes that despised the plebians. Utterly myopic and self absorbed rats really spoil the bunch permalink parent award report block reply BigBadMagaMan 1 points 6 days ago That comment was actually in support of ending EBT but you’re such a disingenuous cunt, you can’t even read. permalink parent award report block reply pollsarefake -2 points 6 days ago No I support that comment I’m saying the rest of the comment section is rife with welfare queens You’re the one that can’t read which is probably why you need welfare permalink parent award report block reply\nBannedAccount 7 points 6 days ago Idk what you're implying but im not on ebt I spend $300/week just to feed my family of 4 granted almost $70 of that is just infant formula but non of it is what you'd consider a \"luxury\" item its mostly just meat, butter, milk, and eggs... permalink parent award report block reply Visceroth -2 points 6 days ago you found an infant formula that isn't full of vegetable oils, soy, and chemicals? permalink parent award report block reply BannedAccount 4 points 6 days ago Yes actually its Kendamil its still not perfect but its alot healthier than the main brands. The other day I noticed its a European import so it might have something to do with their laws against completely toxic food. The best part is its also cheaper than shit like similac or infamil. permalink parent award report block reply\nVisceroth -2 points 6 days ago you found an infant formula that isn't full of vegetable oils, soy, and chemicals? permalink parent award report block reply BannedAccount 4 points 6 days ago Yes actually its Kendamil its still not perfect but its alot healthier than the main brands. The other day I noticed its a European import so it might have something to do with their laws against completely toxic food. The best part is its also cheaper than shit like similac or infamil. permalink parent award report block reply\nBannedAccount 4 points 6 days ago Yes actually its Kendamil its still not perfect but its alot healthier than the main brands. The other day I noticed its a European import so it might have something to do with their laws against completely toxic food. The best part is its also cheaper than shit like similac or infamil. permalink parent award report block reply\nGlory-Unto-God 3 points 6 days ago 0 welfare here and shits expensive even making 85k a year. Single income family taking care of 3 coming on 4 kids my wife and my widowed mother. For someone of less means this shit would be close to impossible. People like you remind me that there's a reason benevolent rulers often had princes that despised the plebians. Utterly myopic and self absorbed rats really spoil the bunch permalink parent award report block reply\nBigBadMagaMan 1 points 6 days ago That comment was actually in support of ending EBT but you’re such a disingenuous cunt, you can’t even read. permalink parent award report block reply pollsarefake -2 points 6 days ago No I support that comment I’m saying the rest of the comment section is rife with welfare queens You’re the one that can’t read which is probably why you need welfare permalink parent award report block reply\npollsarefake -2 points 6 days ago No I support that comment I’m saying the rest of the comment section is rife with welfare queens You’re the one that can’t read which is probably why you need welfare permalink parent award report block reply\nExorcistCandy 9 points 6 days ago Fuck off with this shit. No one is believing this anymore permalink award report block reply\n13MMshooter 7 points 6 days ago Eat a dick motherfucker. No relief for anyone but Jews. MIGA. Start working for us. permalink award report block reply\nhoaxproof 7 points 6 days ago My groceries cost more now than they did under Biden and I'm not going to pretend otherwise. I'm also not going to pretend everything is just going to be magically fixed in a few months like a child... but I don't appreciate being gaslit. permalink award report block reply\nSaltyTitties4 6 points 6 days ago I’m sorry Mr. President, but they are (as usual) giving you bad data.  I live in the Heartland, and my groceries are not lower than last year.  And they are absolutely NOT lower!  They are higher. Mr. President, since you have not learned and you continue to listen to liars in your administration, we now have to consider that you are part of the Swamp. permalink award report block reply\nHellNoKameltoe 6 points 6 days ago All Biden did was drop the cost of hot dogs on the 4th of July 16c permalink award report block reply\nNonbinaryPotatohead 6 points 6 days ago This is like the Biden Admin's cheaper July 4th cookout tweet. permalink award report block reply UCantStumpTheTrump 0 points 6 days ago Except the Biden Admin was doing nothing to try to lower prices; they were actively driving them up. The Trump admin is reopening drilling, oil/gas projects which will lower energy and food costs; and of course deporting illegals and securing the border. The effects take time to manifest, because Biden screwed shit up so badly permalink parent award report block reply\nUCantStumpTheTrump 0 points 6 days ago Except the Biden Admin was doing nothing to try to lower prices; they were actively driving them up. The Trump admin is reopening drilling, oil/gas projects which will lower energy and food costs; and of course deporting illegals and securing the border. The effects take time to manifest, because Biden screwed shit up so badly permalink parent award report block reply\nDontTreadOnSnek 6 points 6 days ago This was apparently \"fact checked\" by community notes and they said it's cheaper only because it's less items and no name brands. Sadly, Trump is wrong. Food is not less expensive than Biden.  Great Value canned chili (with beans) went from 0.67 to 1.92 and just recently went up to 2.14 permalink award report block reply starjello 4 points 6 days ago Don't forget shrinkage. Many products are a lot smaller now for the same money they were when they were more product permalink parent award report block reply armyofpedes4usa 3 points 6 days ago Shrinkflation strikes again. permalink parent award report block reply flashersenpai 2 points 6 days ago i still remember when the frozen pizzas got smaller but the pizza boxes stayed the same size permalink parent award report block reply\nstarjello 4 points 6 days ago Don't forget shrinkage. Many products are a lot smaller now for the same money they were when they were more product permalink parent award report block reply armyofpedes4usa 3 points 6 days ago Shrinkflation strikes again. permalink parent award report block reply flashersenpai 2 points 6 days ago i still remember when the frozen pizzas got smaller but the pizza boxes stayed the same size permalink parent award report block reply\narmyofpedes4usa 3 points 6 days ago Shrinkflation strikes again. permalink parent award report block reply\nflashersenpai 2 points 6 days ago i still remember when the frozen pizzas got smaller but the pizza boxes stayed the same size permalink parent award report block reply\nSivispacem 6 points 6 days ago I just paid well over double for the same goods I was buying pre-2019. Bragging about the affordability of intentionally marked-down goods for a holiday is almost offensively tone deaf. permalink award report block reply\ngetup 5 points 6 days ago Liar. permalink award report block reply mailinvoter 3 points 6 days ago Where did Trump lie?  He is repeating what Walmart said, so they would be the liars if not true.  I'm sure you have all the receipts. permalink parent award report block reply unotrumpcard 5 points 6 days ago Trump works for Walmart now? permalink parent award report block reply mailinvoter 1 points 6 days ago How did you come up with that one? permalink parent award report block reply unotrumpcard 1 points 6 days ago It is what you implied. permalink parent award report block reply view 7 more comments... flashersenpai 0 points 6 days ago wtf he quit McDonalds??? permalink parent award report block reply\nmailinvoter 3 points 6 days ago Where did Trump lie?  He is repeating what Walmart said, so they would be the liars if not true.  I'm sure you have all the receipts. permalink parent award report block reply unotrumpcard 5 points 6 days ago Trump works for Walmart now? permalink parent award report block reply mailinvoter 1 points 6 days ago How did you come up with that one? permalink parent award report block reply unotrumpcard 1 points 6 days ago It is what you implied. permalink parent award report block reply view 7 more comments... flashersenpai 0 points 6 days ago wtf he quit McDonalds??? permalink parent award report block reply\nunotrumpcard 5 points 6 days ago Trump works for Walmart now? permalink parent award report block reply mailinvoter 1 points 6 days ago How did you come up with that one? permalink parent award report block reply unotrumpcard 1 points 6 days ago It is what you implied. permalink parent award report block reply view 7 more comments... flashersenpai 0 points 6 days ago wtf he quit McDonalds??? permalink parent award report block reply\nmailinvoter 1 points 6 days ago How did you come up with that one? permalink parent award report block reply unotrumpcard 1 points 6 days ago It is what you implied. permalink parent award report block reply view 7 more comments...\nunotrumpcard 1 points 6 days ago It is what you implied. permalink parent award report block reply view 7 more comments...\nflashersenpai 0 points 6 days ago wtf he quit McDonalds??? permalink parent award report block reply\nnomoreprinkles 5 points 6 days ago Yeah I don't fucking buy it buddy. I can't. I'm unemployed. Go to a kroger and look through the cars in the parking lot. Half of them are full of homeless. permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nlaxslash 5 points 6 days ago Meanwhile 2 undershirts and a button down cost me $55 the other day at fucking Wal-Mart. permalink award report block reply\nCentipedeDoge 5 points 6 days ago One thing I do hate about Trump is he tries to say everything is the best right now. It’s not, it’s quite shit actually. He’d be better off acknowledging that. permalink award report block reply\nIllKissYourBoobies 5 points 6 days ago Eh... permalink award report block reply\nSavingPrivateGrace 5 points 6 days ago What's been disclosed with the shut down is EBT gives a family of 4 about $300 for a Thanksgiving meal when it costs $150, 25% lower than last year, for working families to purchase.  We know what's up and we want a reform of SNAP.  It should be an honor to work, provide food for your family and celebrate Thanksgiving together, stress free and happy. permalink award report block reply HockeyMom4Trump 4 points 6 days ago SNAP needs to have an expiration date and be very temporary. And very basic food only. permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nHockeyMom4Trump 4 points 6 days ago SNAP needs to have an expiration date and be very temporary. And very basic food only. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nRealTXPatriot 5 points 6 days ago And no one can fly to visit family anyway permalink award report block reply\nBillyBillington 5 points 6 days ago I'm not really seeing the price drops. Maybe eggs. Everything else is still expensive. Gas never really went down. permalink award report block reply Maganifice7 1 points 6 days ago Gas went down a bit, electricity went up. They didn't increase the price per kwh, they increased the delivery fee per kwh. When they do it this way, they can screw people with solar panels on the buyback rate. permalink parent award report block reply\nMaganifice7 1 points 6 days ago Gas went down a bit, electricity went up. They didn't increase the price per kwh, they increased the delivery fee per kwh. When they do it this way, they can screw people with solar panels on the buyback rate. permalink parent award report block reply\nCovfefeKaren 5 points 6 days ago I don't care if this is accurate or not.  All I care about is the fact that when I go to my local grocery store, which is often cheaper than Walmart, ground beef is $7/lb for the cheap stuff.  That's RIDICULOUS!  I haven't cooked a ribeye in months.  I'm not paying $20/lb for Select.  USDA Prime used to be that price!  And eggs still haven't gone down.  Thank God I have chickens.  But feed is the highest it's ever been.  My feed cost per dozen for 2025 is $1.90.  That's just feed, not my time.  Makes it hard to continue providing my family, friends, and coworkers with eggs for $3/doz.  I'm going to have to go to 4, maybe even 5 if this keeps up.  So I really don't want to hear my favorite President tell me how things are less.  I know they're not.  I shop for the family.  I know what shit costs.  God love him but damn. permalink award report block reply\nTrump-16-20-24-28-32 5 points 6 days ago Yeah, but are hot dogs down 16 cents? permalink award report block reply TrumpYouMagaFrenner 6 points 6 days ago Yeah thats the thanksgiving meal he was speaking of. Hot dogs and ramen. permalink parent award report block reply ceva 4 points 6 days ago You might think you're joking but you're right. THe 2025 meal that Walmart put out is all processed crap https://corporate.walmart.com/news/2025/10/21/walmarts-annual-thanksgiving-meal-returns-serving-10-people-for-less-than-4-00-per-person permalink parent award report block reply Trump-16-20-24-28-32 3 points 6 days ago Remember when during 2021, the Biden Administration was bragging about how they are bringing the price of groceries down and that July 4th was 16 cents cheaper than the year before? https://x.com/WhiteHouse46/status/1410709115333234691 Turns out... to bring groceries down, all that had to be done was getting rid of SNAP benefits.  Who knew? permalink parent award report block reply Brock_Shithouse 2 points 6 days ago Maybe for millionaires. Regular people have to choose one or the other. permalink parent award report block reply\nTrumpYouMagaFrenner 6 points 6 days ago Yeah thats the thanksgiving meal he was speaking of. Hot dogs and ramen. permalink parent award report block reply ceva 4 points 6 days ago You might think you're joking but you're right. THe 2025 meal that Walmart put out is all processed crap https://corporate.walmart.com/news/2025/10/21/walmarts-annual-thanksgiving-meal-returns-serving-10-people-for-less-than-4-00-per-person permalink parent award report block reply Trump-16-20-24-28-32 3 points 6 days ago Remember when during 2021, the Biden Administration was bragging about how they are bringing the price of groceries down and that July 4th was 16 cents cheaper than the year before? https://x.com/WhiteHouse46/status/1410709115333234691 Turns out... to bring groceries down, all that had to be done was getting rid of SNAP benefits.  Who knew? permalink parent award report block reply Brock_Shithouse 2 points 6 days ago Maybe for millionaires. Regular people have to choose one or the other. permalink parent award report block reply\nceva 4 points 6 days ago You might think you're joking but you're right. THe 2025 meal that Walmart put out is all processed crap https://corporate.walmart.com/news/2025/10/21/walmarts-annual-thanksgiving-meal-returns-serving-10-people-for-less-than-4-00-per-person permalink parent award report block reply\nTrump-16-20-24-28-32 3 points 6 days ago Remember when during 2021, the Biden Administration was bragging about how they are bringing the price of groceries down and that July 4th was 16 cents cheaper than the year before? https://x.com/WhiteHouse46/status/1410709115333234691 Turns out... to bring groceries down, all that had to be done was getting rid of SNAP benefits.  Who knew? permalink parent award report block reply\nBrock_Shithouse 2 points 6 days ago Maybe for millionaires. Regular people have to choose one or the other. permalink parent award report block reply\nSouthboundanddown 5 points 6 days ago We can't just print infinity money and suffer zero consequences.  The costs will continue until monetary policy improves. permalink award report block reply\nRedDon 5 points 6 days ago This is nice and all, but if you really want to help American families afford life, get rid of the H1Bs. They can’t afford anything without jobs. permalink award report block reply\ngottarememberpasswor 5 points 6 days ago I shop around still end up hosed by the prices. Absolute bullshit. And shouldnt he be smarter than  say dumb shit like this? permalink award report block reply\nMemeLawd 4 points 6 days ago Okay where are the shekelstein files? permalink award report block reply flashersenpai 1 points 6 days ago oy permalink parent award report block reply\nflashersenpai 1 points 6 days ago oy permalink parent award report block reply\nImYourHuckleberry24 4 points 6 days ago Clearly, he's not shopping in my area. permalink award report block reply\npillainp 4 points 6 days ago But Biden's Thanksgiving cost 14c less than the previous year! Sukondat, Drumpfhthhhh!!!!!! permalink award report block reply\nReturningtogod 4 points 6 days ago Not here it’s not. permalink award report block reply\nMegoThor 4 points 6 days ago Where is anything 25% lower than last year? permalink award report block reply stayfckingcalm 2 points 6 days ago Thanksgiving dinner from Walmart permalink parent award report block reply Trajano 2 points 6 days ago Eggs permalink parent award report block reply\nstayfckingcalm 2 points 6 days ago Thanksgiving dinner from Walmart permalink parent award report block reply\nTrajano 2 points 6 days ago Eggs permalink parent award report block reply\nBythrfruitsyknow 4 points 6 days ago oh look resurrected yesterdays rage bait, thanks OP. permalink award report block reply\nBOLTS4U 4 points 6 days ago Wow this guy has lost his mind. Sorry, im out permalink award report block reply\nGodKingHarambe 4 points 6 days ago Sorry, cuh Mr 81M saved me .08 on July 4th baked beans permalink award report block reply\nRudy_DankMemer 4 points 6 days ago I don't shop at Walmart or Hoity Toity Grocery Stores either... and the only shitty things that we buy are ice cream, high quality choc chips for baking and maybe some sourdough pretzels or kettle fried chips (never more than 2 bags). The rest is meat, dairy, pasta, rice, fruit & veggies.... and our bill is NOT any lower than last year. My half-polish wife is cancer survivor AND a trainer.... I tell her all the time that she is worse than the no soup nazi. THIS. permalink award report block reply\nNewWorldOnions 3 points 6 days ago Maybe Trump should stop lying first: https://x.com/i/birdwatch/n/1986259468342939695 permalink award report block reply\nTheFozz 3 points 6 days ago I don't know about ya'll, but prices sure as fuck aren't cheaper where I live. Gas is also the same price it was back in January. I love Trump but he needs to wake the fuck up and realize that things are still tough. permalink award report block reply\ningrowntoenail 3 points 6 days ago Gas was $2.55 a few days ago when I got gas last.  It was back up to $2.89 yesterday. permalink award report block reply Keep_on_winning_kag 1 points 6 days ago My gas went down to 2.59 twice last month, then magically went back to 2.99 over night twice. Currently going down again slowly so I'll fill up the day it hits 260 or so. permalink parent award report block reply\nKeep_on_winning_kag 1 points 6 days ago My gas went down to 2.59 twice last month, then magically went back to 2.99 over night twice. Currently going down again slowly so I'll fill up the day it hits 260 or so. permalink parent award report block reply\nWeinerLapTop 3 points 6 days ago Trump is an open liar now.  Fun.  Did not see this coming in 2016.  Jarring permalink award report block reply\nFor_All_Mankind 3 points 6 days ago It’s still unaffordable permalink award report block reply\nSeruna_Kanus 3 points 6 days ago Can we get back to 2019 levels? permalink award report block reply\nShotgunParade69x 3 points 6 days ago It’s free if your spending it alone permalink award report block reply\nDeplorableNeandertal 3 points 6 days ago No one cares. Ban islam NOW. permalink award report block reply\nAwakened 3 points 6 days ago This is how you lose the midterms. Just another politician at this point. Just Bush 3.0. permalink award report block reply\nJesusTheOnlyWay 3 points 6 days ago This is a serious question (I don't have much time to read on politics) What happened to the Epstein stuff? permalink award report block reply magaMC117 1 points 6 days ago they fucked up the release, then trump was duped into thinking it was beyond end of world to release the file permalink parent award report block reply stayfckingcalm 0 points 6 days ago Turned out there is no Epstein stuff permalink parent award report block reply JesusTheOnlyWay 2 points 6 days ago Does anyone believe that? permalink parent award report block reply\nmagaMC117 1 points 6 days ago they fucked up the release, then trump was duped into thinking it was beyond end of world to release the file permalink parent award report block reply\nstayfckingcalm 0 points 6 days ago Turned out there is no Epstein stuff permalink parent award report block reply JesusTheOnlyWay 2 points 6 days ago Does anyone believe that? permalink parent award report block reply\nJesusTheOnlyWay 2 points 6 days ago Does anyone believe that? permalink parent award report block reply\nChickensaurus 3 points 6 days ago Nobody cares. We voted to have Epstein clients jailed, and traitors hanged. permalink award report block reply\nSCP0073 3 points 6 days ago Zzzzz permalink award report block reply\npapa_newguineapig 3 points 6 days ago He needs to shut the fuck up. Seriously. Nothing is cheaper. permalink award report block reply\nMemphisMontoya71 3 points 6 days ago My gas is still over 4 bucks a gallon and so are half of America's gas, unless you live near refineries and still no where near under 2 bucks a gallon.  My groceries are still 3x what I paid in 2018. Everything fucking is smaller and more expensive.  This is not destroying my life because I work hard and have a decent job and paycheck,  but to MOST Americans they are not feeling the celebration Mr. President.  This economy still sucks ass, and the next generation will NEVER afford a home to start a family...no wonder socialism appeals to them. permalink award report block reply\nTheDevilMonkey 2 points 6 days ago Fake and gay. permalink award report block reply\nTexas_81 2 points 6 days ago Again just like the Epstein files “ they’re a hoax” now saying that prices are better. As a whole no. I’m in Texas ground beef a pound is $8. Steak is at least $13 a pound! Who the fuck is telling him this. permalink award report block reply\narmyofpedes4usa 2 points 6 days ago Is the 25% down an apples to apples comparison (same food items and quantity)? permalink award report block reply\nmasterdrake 2 points 6 days ago it feels like things are actually a bit cheaper, but they are still massively up from just a few years ago, people are still struggling permalink award report block reply\nEyesSewnShut 2 points 6 days ago Bruh. permalink award report block reply\nLawless 2 points 6 days ago I don't see prices coming down much regardless of what happens, but this administration has stopped the price increases we were seeing for the last four years. Everything doubled in price after 2020 permalink award report block reply\nswarleybing 2 points 6 days ago Much cheaper still when your liberal relatives refuse to attend! permalink award report block reply\ntexas4ever 2 points 6 days ago Groceries are still very expensive. We can cherry pick here and there, but most groceries are still very high. Of course the Dems will only make it more expensive, but bragging about the stock market etc. looks out of touch to the average normie. permalink award report block reply\nThose_Who_Wander 2 points 6 days ago When I'm paying $1.29/gal on gas like in 2018, I'll believe that. Otherwise, I still can't afford life. permalink award report block reply\nfit2btied 2 points 6 days ago Remember when the Biden administration bragged that your 4th of July cookout was going to be 16 cents cheaper? That was awesome. permalink award report block reply\nDicksareforChicks 2 points 6 days ago Even cheaper for looters and SNAP recipients 😑 permalink award report block reply\nRocksCanOnlyWait 2 points 6 days ago No it's not. STOP LYING!!! This was posted yesterday. My analysis . In short, whoever is giving him numbers is conflating last year's Farm Bureau report with Walmart's deal price, without even checking if the items and quantities are the same. permalink award report block reply Logan051361 1 points 6 days ago I was Just at Meijer. a large Turkey was 6 Dollars. Bread 1.46. Chicken broth 1.59.  Green beans 1.18 for Delmonte.  etc etc etc. Seems cheap to me. Its bacon and Steak That are expensive permalink parent award report block reply\nLogan051361 1 points 6 days ago I was Just at Meijer. a large Turkey was 6 Dollars. Bread 1.46. Chicken broth 1.59.  Green beans 1.18 for Delmonte.  etc etc etc. Seems cheap to me. Its bacon and Steak That are expensive permalink parent award report block reply\nKrat 2 points 6 days ago Thats because we arent competing with invaders who are stealing your money and food to overthrow you. Once the gib payments resume for the invasion, itll immediately rise back permalink award report block reply\nBullet3250 2 points 6 days ago Still need to get that 10 year Bond to 3.0%..... permalink award report block reply\nCaptainlizard 1 points 6 days ago Trump has sycophant advisors who bring this stupid shit to him and tell him everything is fixed. They did it with gas, had him saying it was under 2 dollars a gallon for months, now he at least says its \"coming down\" and is around 2.50. They do it with groceries, telling him they are all down. If he gets gas down to actually below 2 dollars it might help the price, but other than that there isn't much he can do. He just needs to STOP telling people that the groceries are \"all down\" because it pisses people off. permalink award report block reply\nBasedMillennial 1 points 6 days ago Inflation shot up 21% under Biden, that year I received a 3% raise. I'm behind 7 years not including ongoing inflation. permalink award report block reply\nMaganifice7 1 points 6 days ago Bullshit. permalink award report block reply\nFreefertilizer 1 points 6 days ago Im sure Trump didn't read the original and new meals and just the headline but this isn't a 1:1 this is just Wal Mart curating a meal year to year. I dont think really anything went down in price just didn't go crazy up in price the last year. Still good we stopped inflation going crazy imo but not 25% permalink award report block reply\nAtheistTrumper 1 points 6 days ago I got pretty much everything I need on sale at Aldi for $40, including the turkey. I think they are trying to capitalize on the no-EBT by advertising low prices. They are selling out quickly but restock every morning and you can just order it for pickup. permalink award report block reply\nGhostOfTheRepublic 1 points 6 days ago Don’t care arrest the fking crooks!!  Deport the muslims and communists!!! permalink award report block reply\nRogueLeaderX 1 points 6 days ago Thankful for Trump. permalink award report block reply\nTookens 1 points 6 days ago \"And if you believed that one, I have ANOTHER one to tell you!\" permalink award report block reply\nGrond999 1 points 6 days ago Both parties and the Fed (and big Pharma propaganda) set off inflation. It takes time to work through the system. Just as both parties are driving America into insane debt. permalink award report block reply\nPoleWatcher 1 points 6 days ago Not sure if agree with that. Your getting less for same price so also need to buy more permalink award report block reply\nFullyDilated 1 points 6 days ago I'm calling bullshit! permalink award report block reply\nSocraticMethod1 1 points 6 days ago It's a double edged sword as some of this is increasing supply at home and others It's consumer confidence. You can't make things better if people think things will ONLY get worse, so you need more positivity. Deporting more illegals to reduce demand might help, worth a shot.. permalink award report block reply\nuniformist 1 points 5 days ago Biden got it down 1 cent one year permalink award report block reply\nhoodar 1 points 6 days ago tHe eGg pRiCeS gUyZ...wait they're down.... nevermind, let's forget about them. permalink award report block reply\nHandshake_Shmanshake 1 points 6 days ago This is basically saying, \"I saved you 15 Cents on hotdogs, Jack.\" Gas is almost $5 a gallon where I'm at. Bought a 12 pack of soda for $11 the other day, thank god that lasts me all month, but still. permalink award report block reply\nDeathBattleFan123 0 points 6 days ago PDW comment sections are totally filled with anti Trump black pilled doomers these days permalink award report block reply Captainlizard 1 points 6 days ago It's not anti trump to call out bullshit. I don't even think Trump did it knowing it was wrong, I think he gets this stupid shit brought to him by advisors and just repeats it. The guy isn't grocery shopping and has no clue. If someone actually gets good info to him he always acts to fix it. He just needs someone giving him the truth. permalink parent award report block reply flashersenpai 0 points 6 days ago how can Trump do better if no one complains about anything? permalink parent award report block reply DeathBattleFan123 1 points 6 days ago Halting Biden era runaway inflation is a big win by itself. Reducing the price of key staples like food and gas by 25% from what they were last year is a massive accomplishment. Complaining that it's not lower than it was 5 years ago in a total of 10 months on the job is unreasonable. We are finally headed in the right direction, and rather than celebrating, people like you are dooming. permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nCaptainlizard 1 points 6 days ago It's not anti trump to call out bullshit. I don't even think Trump did it knowing it was wrong, I think he gets this stupid shit brought to him by advisors and just repeats it. The guy isn't grocery shopping and has no clue. If someone actually gets good info to him he always acts to fix it. He just needs someone giving him the truth. permalink parent award report block reply\nflashersenpai 0 points 6 days ago how can Trump do better if no one complains about anything? permalink parent award report block reply DeathBattleFan123 1 points 6 days ago Halting Biden era runaway inflation is a big win by itself. Reducing the price of key staples like food and gas by 25% from what they were last year is a massive accomplishment. Complaining that it's not lower than it was 5 years ago in a total of 10 months on the job is unreasonable. We are finally headed in the right direction, and rather than celebrating, people like you are dooming. permalink parent award report block reply\nDeathBattleFan123 1 points 6 days ago Halting Biden era runaway inflation is a big win by itself. Reducing the price of key staples like food and gas by 25% from what they were last year is a massive accomplishment. Complaining that it's not lower than it was 5 years ago in a total of 10 months on the job is unreasonable. We are finally headed in the right direction, and rather than celebrating, people like you are dooming. permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nAntiCommieAktion 0 points 6 days ago Paid 16 dollars for about 5-6 items from the grocery store the other day. Seemed unusually low. Calling this a Trump W. at least where I'm from. permalink award report block reply\nCreepy_Joe 0 points 6 days ago That’s a complete load of horse shit. I can’t even fill a SMALL BASKET at the grocery store for less than $100 when I used to be able to overflow a big shopping cart for that much. permalink award report block reply\nPepePinochet 0 points 6 days ago X permalink award report block reply flashersenpai 1 points 6 days ago X permalink parent award report block reply\nflashersenpai 1 points 6 days ago X permalink parent award report block reply\nYodaBannon -3 points 6 days ago FATA permalink award report block reply bleeje 2 points 6 days ago what is that? permalink parent award report block reply YodaBannon -3 points 6 days ago fatter, no hard R, getting fatta MAHA permalink parent award report block reply\nbleeje 2 points 6 days ago what is that? permalink parent award report block reply YodaBannon -3 points 6 days ago fatter, no hard R, getting fatta MAHA permalink parent award report block reply\nYodaBannon -3 points 6 days ago fatter, no hard R, getting fatta MAHA permalink parent award report block reply\nbleeje -6 points 6 days ago Wow. Okay. Thoughts and prayers for all the ICE Agents who forget to mask up. If you're one, save up all you can, make plans to leave the country and get out in 2027. If you know one closely, convert your basement into a bedroom and stock up supplies in case he can't leave. Good luck. permalink award report block reply couranto 1 points 6 days ago Is that a threat punk? permalink parent award report block reply bleeje 1 points 6 days ago What? permalink parent award report block reply\ncouranto 1 points 6 days ago Is that a threat punk? permalink parent award report block reply bleeje 1 points 6 days ago What? permalink parent award report block reply\nbleeje 1 points 6 days ago What? permalink parent award report block reply\npollsarefake -14 points 6 days ago Trump is exactly right Broke commies want everything free Hardworking Americans are able to afford things under Trump Thanks to tariffs, prices are down bigly Affordability is a fake issue, a demonrat hoax just like Russia Russia Russia and Epstein. permalink award report block reply BannedAccount 11 points 6 days ago You're retarded, hardworking Americans can't afford shit i should know im one of them. I receive absolutely no government assistance of any kind. permalink parent award report block reply bleeje 2 points 6 days ago He is a paid shill, dude. Should terrify the rest of us that they're ALREADY hiring shills when 2025 is not even finished yet. But nope! The old guys here that are 95% of this site will continue on their merry, oblivious way. permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply getup 2 points 6 days ago Lmao permalink parent award report block reply TheDevilMonkey 1 points 6 days ago You are fake and gay. permalink parent award report block reply\nBannedAccount 11 points 6 days ago You're retarded, hardworking Americans can't afford shit i should know im one of them. I receive absolutely no government assistance of any kind. permalink parent award report block reply bleeje 2 points 6 days ago He is a paid shill, dude. Should terrify the rest of us that they're ALREADY hiring shills when 2025 is not even finished yet. But nope! The old guys here that are 95% of this site will continue on their merry, oblivious way. permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nbleeje 2 points 6 days ago He is a paid shill, dude. Should terrify the rest of us that they're ALREADY hiring shills when 2025 is not even finished yet. But nope! The old guys here that are 95% of this site will continue on their merry, oblivious way. permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\ngetup 2 points 6 days ago Lmao permalink parent award report block reply\nTheDevilMonkey 1 points 6 days ago You are fake and gay. permalink parent award report block reply\nthe_new_one 15 points 6 days ago Comment removed upon the user being banned. permalink award report block reply HockeyMom4Trump 14 points 6 days ago 2026 will be a bad year for republicans at the voting booth permalink parent award report block reply unotrumpcard 6 points 6 days ago Trump is playing his part. permalink parent award report block reply\nHockeyMom4Trump 14 points 6 days ago 2026 will be a bad year for republicans at the voting booth permalink parent award report block reply unotrumpcard 6 points 6 days ago Trump is playing his part. permalink parent award report block reply\nunotrumpcard 6 points 6 days ago Trump is playing his part. permalink parent award report block reply\ntakebackyourfreedom 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\n2Clutch 1 points 6 days ago Comment removed by community filter. permalink award report block reply\nTheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:03:25.191471Z"
}