{
  "id": "1ARK9oW6Es",
  "url": "https://patriots.win/p/1ARK9oW6Es/maga-and-america-first-and-now-n/c",
  "content": "2 posted 3 hours ago by breadbaker 5 comments award share report block Post removed by community moderators.\n5 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno Live_free_or_die_55 3 points 3 hours ago You are on the wrong platform comrade!!! permalink award report block reply breadbaker OP 0 points 3 hours ago Nah, dude yours moved a few doors to the right into the looney bin. NTTA permalink parent award report block reply SnowSnake 2 points 2 hours ago Then fucking show yourself out, faggot. 🖕🖕 permalink award report block reply SHILL_DETECTOR 1 points 3 hours ago maybe theres just nothing that can be done to fix this country if somehow democrats would realize that the golden goose is almost dead then perhaps there could be a chance permalink award report block reply SCHULTZ 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply\nLive_free_or_die_55 3 points 3 hours ago You are on the wrong platform comrade!!! permalink award report block reply breadbaker OP 0 points 3 hours ago Nah, dude yours moved a few doors to the right into the looney bin. NTTA permalink parent award report block reply\nbreadbaker OP 0 points 3 hours ago Nah, dude yours moved a few doors to the right into the looney bin. NTTA permalink parent award report block reply\nSnowSnake 2 points 2 hours ago Then fucking show yourself out, faggot. 🖕🖕 permalink award report block reply\nSHILL_DETECTOR 1 points 3 hours ago maybe theres just nothing that can be done to fix this country if somehow democrats would realize that the golden goose is almost dead then perhaps there could be a chance permalink award report block reply\nSCHULTZ 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:08:45.606973Z"
}