{
  "id": "1ARK0TUsnS",
  "url": "https://patriots.win/p/1ARK0TUsnS/shits-about-to-get-real-ny--you-/c",
  "content": "368 Shit's about to get real, NY.  You get what you vote for. posted 7 days ago by KuzoKevin 35 comments award share report block MAGA Voice @MAGAVoice • 7d BREAKING: A massive walkout of New York Police Department… It’s Happening\n35 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style UntakenUsername 38 points 7 days ago They should all join ICE. They have the experience and a great reason to do so now. permalink award report block reply edxzxz 3 points 7 days ago That sounds like when useless retarded obese libtard women screech about moving to other countries when they don't get their way - as if those countries would ever let them in!  Fatso gaylord NYPD are all too fat and gay for ICE  to let them in.  Maybe some of them can put on some lipstick and model brazziers for the Lane Bryant catalog? permalink parent award report block reply deleted 1 points 7 days ago Abovethefray 1 points 6 days ago Don't they have cars? permalink parent award report block reply edxzxz 1 points 7 days ago I bet you half the NYPD couldn't do it. permalink parent award report block reply BonginosRac1stCowboy 2 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply GhostOfTheRepublic 23 points 7 days ago That’s fine. Ma’amdani will put muslims in their positions and then govern by might of the law. permalink award report block reply Tonz 6 points 7 days ago Exactly, all part of the plan. We walk away, they keep taking. We stay, we lose. Not many options left. permalink parent award report block reply Aggrieved03 6 points 7 days ago That’s the plan. permalink parent award report block reply Covfefebrulee 2 points 7 days ago Yep. permalink parent award report block reply RomeIsFalling 7 points 7 days ago Who knew NYC would be the first city to burn during civil war 2. permalink parent award report block reply Covfefebrulee 3 points 7 days ago Well, it was pretty active territory in the Revolutionary War, so perhaps the ghosts of our Ancestors with intercede. permalink parent award report block reply SERP-SERP 4 points 7 days ago Sauce? permalink award report block reply edxzxz 3 points 7 days ago Oh no, now who will arrest little girls who aren't wearing face masks in Panera Bread?  Who will write tickets for cars that aren't moved on street cleaning days, even though they never clean the streets anyway?  These tax sucking parasites will be back sucking off the taxpayer's teets the instant their paid time off runs out, if not sooner. Useless cowardly faggots should all be fired. permalink award report block reply ChyNahAzzWhole1 3 points 7 days ago Why are the noticed allying themselves with CommieDahmie? permalink award report block reply ThePatriotGames2016 3 points 7 days ago destroy NYC permalink award report block reply Eaglemeagle 3 points 7 days ago Grok says this isnt true \"No, this claim is false. It's a viral hoax that exploded on X today (November 5, 2025) after Zohran Mamdani won the NYC mayoral election yesterday.What actually happened:Zero evidence of any walkout — NYPD spokespeople told fact-checkers directly: \"There is no walkout.\" leadstories.com Police unions, the department, and every major NYC news outlet (NYT, NY Post, NY1, etc.) have zero reports of mass resignations or officers abandoning posts.\nViral videos/photos showing officers lined up? Those are old retirement ceremonies — an NYPD tradition where cops salute one retiring colleague. One clip is from June 2025, another from 2022. hindustantimes.com +1 Who started it:Rep. Elise Stefanik (@EliseStefanik\n): “MASSIVE walkout out of NYPD officers” — 3.9 K likes, 1 K reposts, zero proof. @EliseStefanik TX congressional candidate Sholdon Daniels (@SholdonDaniels\n): “Massive walkout at NYPD ” — 38 K likes, 3 K reposts, zero sources. @SholdonDaniels Reality check:One person did resign: Fire Commissioner Robert Tucker (FDNY, not NYPD). He cited “personal reasons.”\nNYPD Commissioner Jessica Tisch says she’ll stay and work with the new mayor.\nCops can’t just “walk out” — pensions, contracts, and the Taylor Law make mass quits impossible overnight. permalink award report block reply Alpha_Lemming 2 points 7 days ago Twitter:\n\"Site doesn't exist\" permalink award report block reply ciaramella_is_gay 2 points 7 days ago LoL bunch of pussies will be back at work because they are faggots who'd rather keep their pensions than honor their oath. Everything is fucking theater. permalink award report block reply spinometer2 1 points 7 days ago deleted permalink award report block reply budgsxr 1 points 6 days ago He will just hire mudslimes to replace them. I can’t believe this is America … we’ve allowed this shit to happen. I blame myself as much as anyone else for this shit. We aren’t voting our way out of this one. permalink award report block reply CySailor 1 points 7 days ago Come to Texas permalink award report block reply MAGALADON9 2 points 7 days ago Stay the fuck out of Texas unless you have MAGA NECK TATS we don't trust you permalink parent award report block reply MAGALADON9 1 points 7 days ago Literally watched Escape from New York (1981) with a lib family member. I said \"see it's gonna be like that\". They just rolled their eyes. We will see. permalink award report block reply TrumpYouMagaFrenner 0 points 7 days ago Just like the 2020 trucker strikes that never happened permalink award report block reply BonginosRac1stCowboy 12 points 7 days ago Comment removed upon the user being banned. permalink award report block reply permissible_missile 4 points 7 days ago \"It's all the Jews' fault\", now officially responsible for the Mudslime takeover? permalink parent award report block reply BonginosRac1stCowboy 3 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply TrumpYouMagaFrenner 4 points 7 days ago Weak men.. permalink parent award report block reply GhostOfTheRepublic 3 points 7 days ago Which Jews?  It’s not about religion it is about Communism.  So, it is about religion but the religion of the State. permalink parent award report block reply Madnote1984 6 points 7 days ago You might want to study the origins of communism... O.o permalink parent award report block reply GhostOfTheRepublic 5 points 7 days ago You mean like that jews in other parts of Europe pushed and finance the communist uprisings in Russia?  That it was jewish communists that were destabilizing Germany in the 1930’s?  That jewish communists over through England through the Labor party? It makes sense really, that secular jews, that have no relationship with GOD, are trying to continue, what they believe is their manifest destiny, to bring Heaven on Earth. permalink parent award report block reply Madnote1984 2 points 7 days ago Yeah actually. Lol permalink parent award report block reply MAGALADON9 1 points 7 days ago So  neo-bolshevik jews then. permalink parent award report block reply Shih_Tabed 1 points 7 days ago Comment removed by community filter, pending further review. permalink award report block reply\nUntakenUsername 38 points 7 days ago They should all join ICE. They have the experience and a great reason to do so now. permalink award report block reply edxzxz 3 points 7 days ago That sounds like when useless retarded obese libtard women screech about moving to other countries when they don't get their way - as if those countries would ever let them in!  Fatso gaylord NYPD are all too fat and gay for ICE  to let them in.  Maybe some of them can put on some lipstick and model brazziers for the Lane Bryant catalog? permalink parent award report block reply deleted 1 points 7 days ago Abovethefray 1 points 6 days ago Don't they have cars? permalink parent award report block reply edxzxz 1 points 7 days ago I bet you half the NYPD couldn't do it. permalink parent award report block reply BonginosRac1stCowboy 2 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nedxzxz 3 points 7 days ago That sounds like when useless retarded obese libtard women screech about moving to other countries when they don't get their way - as if those countries would ever let them in!  Fatso gaylord NYPD are all too fat and gay for ICE  to let them in.  Maybe some of them can put on some lipstick and model brazziers for the Lane Bryant catalog? permalink parent award report block reply deleted 1 points 7 days ago Abovethefray 1 points 6 days ago Don't they have cars? permalink parent award report block reply edxzxz 1 points 7 days ago I bet you half the NYPD couldn't do it. permalink parent award report block reply\ndeleted 1 points 7 days ago Abovethefray 1 points 6 days ago Don't they have cars? permalink parent award report block reply edxzxz 1 points 7 days ago I bet you half the NYPD couldn't do it. permalink parent award report block reply\nAbovethefray 1 points 6 days ago Don't they have cars? permalink parent award report block reply\nedxzxz 1 points 7 days ago I bet you half the NYPD couldn't do it. permalink parent award report block reply\nBonginosRac1stCowboy 2 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nGhostOfTheRepublic 23 points 7 days ago That’s fine. Ma’amdani will put muslims in their positions and then govern by might of the law. permalink award report block reply Tonz 6 points 7 days ago Exactly, all part of the plan. We walk away, they keep taking. We stay, we lose. Not many options left. permalink parent award report block reply Aggrieved03 6 points 7 days ago That’s the plan. permalink parent award report block reply Covfefebrulee 2 points 7 days ago Yep. permalink parent award report block reply RomeIsFalling 7 points 7 days ago Who knew NYC would be the first city to burn during civil war 2. permalink parent award report block reply Covfefebrulee 3 points 7 days ago Well, it was pretty active territory in the Revolutionary War, so perhaps the ghosts of our Ancestors with intercede. permalink parent award report block reply\nTonz 6 points 7 days ago Exactly, all part of the plan. We walk away, they keep taking. We stay, we lose. Not many options left. permalink parent award report block reply\nAggrieved03 6 points 7 days ago That’s the plan. permalink parent award report block reply\nCovfefebrulee 2 points 7 days ago Yep. permalink parent award report block reply RomeIsFalling 7 points 7 days ago Who knew NYC would be the first city to burn during civil war 2. permalink parent award report block reply Covfefebrulee 3 points 7 days ago Well, it was pretty active territory in the Revolutionary War, so perhaps the ghosts of our Ancestors with intercede. permalink parent award report block reply\nRomeIsFalling 7 points 7 days ago Who knew NYC would be the first city to burn during civil war 2. permalink parent award report block reply Covfefebrulee 3 points 7 days ago Well, it was pretty active territory in the Revolutionary War, so perhaps the ghosts of our Ancestors with intercede. permalink parent award report block reply\nCovfefebrulee 3 points 7 days ago Well, it was pretty active territory in the Revolutionary War, so perhaps the ghosts of our Ancestors with intercede. permalink parent award report block reply\nSERP-SERP 4 points 7 days ago Sauce? permalink award report block reply\nedxzxz 3 points 7 days ago Oh no, now who will arrest little girls who aren't wearing face masks in Panera Bread?  Who will write tickets for cars that aren't moved on street cleaning days, even though they never clean the streets anyway?  These tax sucking parasites will be back sucking off the taxpayer's teets the instant their paid time off runs out, if not sooner. Useless cowardly faggots should all be fired. permalink award report block reply\nChyNahAzzWhole1 3 points 7 days ago Why are the noticed allying themselves with CommieDahmie? permalink award report block reply\nThePatriotGames2016 3 points 7 days ago destroy NYC permalink award report block reply\nEaglemeagle 3 points 7 days ago Grok says this isnt true \"No, this claim is false. It's a viral hoax that exploded on X today (November 5, 2025) after Zohran Mamdani won the NYC mayoral election yesterday.What actually happened:Zero evidence of any walkout — NYPD spokespeople told fact-checkers directly: \"There is no walkout.\" leadstories.com Police unions, the department, and every major NYC news outlet (NYT, NY Post, NY1, etc.) have zero reports of mass resignations or officers abandoning posts.\nViral videos/photos showing officers lined up? Those are old retirement ceremonies — an NYPD tradition where cops salute one retiring colleague. One clip is from June 2025, another from 2022. hindustantimes.com +1 Who started it:Rep. Elise Stefanik (@EliseStefanik\n): “MASSIVE walkout out of NYPD officers” — 3.9 K likes, 1 K reposts, zero proof. @EliseStefanik TX congressional candidate Sholdon Daniels (@SholdonDaniels\n): “Massive walkout at NYPD ” — 38 K likes, 3 K reposts, zero sources. @SholdonDaniels Reality check:One person did resign: Fire Commissioner Robert Tucker (FDNY, not NYPD). He cited “personal reasons.”\nNYPD Commissioner Jessica Tisch says she’ll stay and work with the new mayor.\nCops can’t just “walk out” — pensions, contracts, and the Taylor Law make mass quits impossible overnight. permalink award report block reply\nAlpha_Lemming 2 points 7 days ago Twitter:\n\"Site doesn't exist\" permalink award report block reply\nciaramella_is_gay 2 points 7 days ago LoL bunch of pussies will be back at work because they are faggots who'd rather keep their pensions than honor their oath. Everything is fucking theater. permalink award report block reply\nspinometer2 1 points 7 days ago deleted permalink award report block reply\nbudgsxr 1 points 6 days ago He will just hire mudslimes to replace them. I can’t believe this is America … we’ve allowed this shit to happen. I blame myself as much as anyone else for this shit. We aren’t voting our way out of this one. permalink award report block reply\nCySailor 1 points 7 days ago Come to Texas permalink award report block reply MAGALADON9 2 points 7 days ago Stay the fuck out of Texas unless you have MAGA NECK TATS we don't trust you permalink parent award report block reply\nMAGALADON9 2 points 7 days ago Stay the fuck out of Texas unless you have MAGA NECK TATS we don't trust you permalink parent award report block reply\nMAGALADON9 1 points 7 days ago Literally watched Escape from New York (1981) with a lib family member. I said \"see it's gonna be like that\". They just rolled their eyes. We will see. permalink award report block reply\nTrumpYouMagaFrenner 0 points 7 days ago Just like the 2020 trucker strikes that never happened permalink award report block reply\nBonginosRac1stCowboy 12 points 7 days ago Comment removed upon the user being banned. permalink award report block reply permissible_missile 4 points 7 days ago \"It's all the Jews' fault\", now officially responsible for the Mudslime takeover? permalink parent award report block reply BonginosRac1stCowboy 3 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply TrumpYouMagaFrenner 4 points 7 days ago Weak men.. permalink parent award report block reply GhostOfTheRepublic 3 points 7 days ago Which Jews?  It’s not about religion it is about Communism.  So, it is about religion but the religion of the State. permalink parent award report block reply Madnote1984 6 points 7 days ago You might want to study the origins of communism... O.o permalink parent award report block reply GhostOfTheRepublic 5 points 7 days ago You mean like that jews in other parts of Europe pushed and finance the communist uprisings in Russia?  That it was jewish communists that were destabilizing Germany in the 1930’s?  That jewish communists over through England through the Labor party? It makes sense really, that secular jews, that have no relationship with GOD, are trying to continue, what they believe is their manifest destiny, to bring Heaven on Earth. permalink parent award report block reply Madnote1984 2 points 7 days ago Yeah actually. Lol permalink parent award report block reply MAGALADON9 1 points 7 days ago So  neo-bolshevik jews then. permalink parent award report block reply\npermissible_missile 4 points 7 days ago \"It's all the Jews' fault\", now officially responsible for the Mudslime takeover? permalink parent award report block reply BonginosRac1stCowboy 3 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBonginosRac1stCowboy 3 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpYouMagaFrenner 4 points 7 days ago Weak men.. permalink parent award report block reply\nGhostOfTheRepublic 3 points 7 days ago Which Jews?  It’s not about religion it is about Communism.  So, it is about religion but the religion of the State. permalink parent award report block reply Madnote1984 6 points 7 days ago You might want to study the origins of communism... O.o permalink parent award report block reply GhostOfTheRepublic 5 points 7 days ago You mean like that jews in other parts of Europe pushed and finance the communist uprisings in Russia?  That it was jewish communists that were destabilizing Germany in the 1930’s?  That jewish communists over through England through the Labor party? It makes sense really, that secular jews, that have no relationship with GOD, are trying to continue, what they believe is their manifest destiny, to bring Heaven on Earth. permalink parent award report block reply Madnote1984 2 points 7 days ago Yeah actually. Lol permalink parent award report block reply MAGALADON9 1 points 7 days ago So  neo-bolshevik jews then. permalink parent award report block reply\nMadnote1984 6 points 7 days ago You might want to study the origins of communism... O.o permalink parent award report block reply GhostOfTheRepublic 5 points 7 days ago You mean like that jews in other parts of Europe pushed and finance the communist uprisings in Russia?  That it was jewish communists that were destabilizing Germany in the 1930’s?  That jewish communists over through England through the Labor party? It makes sense really, that secular jews, that have no relationship with GOD, are trying to continue, what they believe is their manifest destiny, to bring Heaven on Earth. permalink parent award report block reply Madnote1984 2 points 7 days ago Yeah actually. Lol permalink parent award report block reply\nGhostOfTheRepublic 5 points 7 days ago You mean like that jews in other parts of Europe pushed and finance the communist uprisings in Russia?  That it was jewish communists that were destabilizing Germany in the 1930’s?  That jewish communists over through England through the Labor party? It makes sense really, that secular jews, that have no relationship with GOD, are trying to continue, what they believe is their manifest destiny, to bring Heaven on Earth. permalink parent award report block reply Madnote1984 2 points 7 days ago Yeah actually. Lol permalink parent award report block reply\nMadnote1984 2 points 7 days ago Yeah actually. Lol permalink parent award report block reply\nMAGALADON9 1 points 7 days ago So  neo-bolshevik jews then. permalink parent award report block reply\nShih_Tabed 1 points 7 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T20:53:06.825056Z"
}