{
  "id": "1ARK9oW66e",
  "url": "https://patriots.win/p/1ARK9oW66e/no-more/c",
  "content": "162 No more! posted 3 hours ago by MacGordon 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save SupFrens 7 points 2 hours ago Trump has betrayed the American people by siding with India. permalink award report block reply DrCowboyPresident 4 points 2 hours ago If this is all about leveraging India against Russia by bribing them with H1B I am going to be righteously pissed. permalink parent award report block reply Formerlurker92 6 points 3 hours ago We all know the degrees are fake, so \"best and brightest\" is a lie permalink award report block reply MacGordon OP 5 points 2 hours ago It's not the best and brightest. It's the cheapest. permalink parent award report block reply EvJohn 3 points 1 hour ago I did NOT vote for this. No \"consent of the governed\" here. permalink award report block reply PapaPepe 2 points 1 hour ago H1b is the white collar illegal permalink award report block reply\nSupFrens 7 points 2 hours ago Trump has betrayed the American people by siding with India. permalink award report block reply DrCowboyPresident 4 points 2 hours ago If this is all about leveraging India against Russia by bribing them with H1B I am going to be righteously pissed. permalink parent award report block reply\nDrCowboyPresident 4 points 2 hours ago If this is all about leveraging India against Russia by bribing them with H1B I am going to be righteously pissed. permalink parent award report block reply\nFormerlurker92 6 points 3 hours ago We all know the degrees are fake, so \"best and brightest\" is a lie permalink award report block reply MacGordon OP 5 points 2 hours ago It's not the best and brightest. It's the cheapest. permalink parent award report block reply\nMacGordon OP 5 points 2 hours ago It's not the best and brightest. It's the cheapest. permalink parent award report block reply\nEvJohn 3 points 1 hour ago I did NOT vote for this. No \"consent of the governed\" here. permalink award report block reply\nPapaPepe 2 points 1 hour ago H1b is the white collar illegal permalink award report block reply",
  "fetched_at": "2025-11-12T23:06:41.934590Z"
}