{
  "id": "1ARK53JYTm",
  "url": "https://patriots.win/p/1ARK53JYTm/we-passed-one-big-beautiful-bill/c",
  "content": "524 “We passed one big, beautiful bill — then nothing. The president's right to be frustrated. We’ve been sitting on our ice-cold, lazy butts instead of passing his agenda.” posted 6 days ago by sorrytodisagree 13 comments award share report block Laura Ingraham @IngrahamAngle • 6d 🚨Kennedy unloads on do-nothing Senate.🚨 “We passed one big, beautiful bill — then nothing. Zero. Zilch. Nada. The president’s right to be frustrated. We’ve been sitting on our ice-cold, lazy butts instead of passing his agenda.” — @SenJohnKennedy\n13 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil Awakened 20 points 6 days ago He's as guilty as the rest, but he is funny. permalink award report block reply JoeBidensDementia1 13 points 6 days ago The RNC stands for Retarded NeoCons. permalink award report block reply Counterwhat 9 points 6 days ago The Republicans are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on. permalink award report block reply MemoryHoleyeO 8 points 6 days ago Do something then; thanks for repeating what we've said Everytime we get any form of control permalink award report block reply thunderpussy 1 points 6 days ago Really. Nice wit, but it doesn't change the fact that they have been less than useless, and apparently no end to that in sight, as usual. permalink parent award report block reply Karpus 4 points 6 days ago Fucking Andy Griffith motherfucker permalink award report block reply Captainlizard 2 points 6 days ago Most of the republicans literally want to lose. They enjoy being in the minority so they can complain and do nothing, while raking in more cash. It's well known. permalink award report block reply thunderpussy 2 points 6 days ago Correct. As long as the Uniparty throws them a few corporate tax cuts and a few earmarks and other graft every now and again, most are quite content to lose and just keep riding the train until they retire. permalink parent award report block reply Tacitus1963 2 points 6 days ago The RINOs are purposely doing this.\nThey don't want PDJT in office. It cuts into their grift along with their Demtard buddies' grift.\nThey have done jack schitt in the first 10 months of Trump's admin. They are slow walking it to the midterms where they plan on letting the Demtards win. Then we will be back to impeachments Stage a Gazillion.\nNow, if any of the red state governors were somewhat competitive, they would be redistricting to ensure GOP victories and a majority in Congress.\nHowever, we have had nothing but bloviating.\nI'm sick and tired of the RINOs and almost detest them as much as the Demtards. permalink award report block reply Aggrieved03 2 points 6 days ago All part of the plan. Stall til midterms then complain and fundraise, rinse and repeat. permalink award report block reply T471 2 points 6 days ago ok, whats next then? permalink award report block reply Brock_Shithouse 1 points 6 days ago Seems like sharia law permalink parent award report block reply CaptainWinston 2 points 5 days ago There is no left and right,  they are all the same permalink award report block reply reasonablydisturbed 1 points 5 days ago We haven't done shit because of this one obstacle. Ok, remove that obstacle. No, we are just gonna keep it in place and hope things change. $176K a year, not to mention millions gained from insider tradng that they all engage in, to be completely worthless other than a couple funny soundbites. There is no incentive for these goons to act. Oh well they can be voted out...in 6 years after they clear just over a million in base salary. permalink award report block reply DITTOPatriot 1 points 6 days ago This is Trump's fault as much as, or more than, the Senate's. A definable plan must be articulated, and then you must use your bully pulpit to push the agenda forward. I see nothing but a ship loose upon the ocean, rudderless, bumping into landmines, screaming out with a foghorn the revolving rage of the day. permalink award report block reply\nAwakened 20 points 6 days ago He's as guilty as the rest, but he is funny. permalink award report block reply\nJoeBidensDementia1 13 points 6 days ago The RNC stands for Retarded NeoCons. permalink award report block reply\nCounterwhat 9 points 6 days ago The Republicans are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on. permalink award report block reply\nMemoryHoleyeO 8 points 6 days ago Do something then; thanks for repeating what we've said Everytime we get any form of control permalink award report block reply thunderpussy 1 points 6 days ago Really. Nice wit, but it doesn't change the fact that they have been less than useless, and apparently no end to that in sight, as usual. permalink parent award report block reply\nthunderpussy 1 points 6 days ago Really. Nice wit, but it doesn't change the fact that they have been less than useless, and apparently no end to that in sight, as usual. permalink parent award report block reply\nKarpus 4 points 6 days ago Fucking Andy Griffith motherfucker permalink award report block reply\nCaptainlizard 2 points 6 days ago Most of the republicans literally want to lose. They enjoy being in the minority so they can complain and do nothing, while raking in more cash. It's well known. permalink award report block reply thunderpussy 2 points 6 days ago Correct. As long as the Uniparty throws them a few corporate tax cuts and a few earmarks and other graft every now and again, most are quite content to lose and just keep riding the train until they retire. permalink parent award report block reply\nthunderpussy 2 points 6 days ago Correct. As long as the Uniparty throws them a few corporate tax cuts and a few earmarks and other graft every now and again, most are quite content to lose and just keep riding the train until they retire. permalink parent award report block reply\nTacitus1963 2 points 6 days ago The RINOs are purposely doing this.\nThey don't want PDJT in office. It cuts into their grift along with their Demtard buddies' grift.\nThey have done jack schitt in the first 10 months of Trump's admin. They are slow walking it to the midterms where they plan on letting the Demtards win. Then we will be back to impeachments Stage a Gazillion.\nNow, if any of the red state governors were somewhat competitive, they would be redistricting to ensure GOP victories and a majority in Congress.\nHowever, we have had nothing but bloviating.\nI'm sick and tired of the RINOs and almost detest them as much as the Demtards. permalink award report block reply\nAggrieved03 2 points 6 days ago All part of the plan. Stall til midterms then complain and fundraise, rinse and repeat. permalink award report block reply\nT471 2 points 6 days ago ok, whats next then? permalink award report block reply Brock_Shithouse 1 points 6 days ago Seems like sharia law permalink parent award report block reply\nBrock_Shithouse 1 points 6 days ago Seems like sharia law permalink parent award report block reply\nCaptainWinston 2 points 5 days ago There is no left and right,  they are all the same permalink award report block reply\nreasonablydisturbed 1 points 5 days ago We haven't done shit because of this one obstacle. Ok, remove that obstacle. No, we are just gonna keep it in place and hope things change. $176K a year, not to mention millions gained from insider tradng that they all engage in, to be completely worthless other than a couple funny soundbites. There is no incentive for these goons to act. Oh well they can be voted out...in 6 years after they clear just over a million in base salary. permalink award report block reply\nDITTOPatriot 1 points 6 days ago This is Trump's fault as much as, or more than, the Senate's. A definable plan must be articulated, and then you must use your bully pulpit to push the agenda forward. I see nothing but a ship loose upon the ocean, rudderless, bumping into landmines, screaming out with a foghorn the revolving rage of the day. permalink award report block reply",
  "fetched_at": "2025-11-12T23:04:31.301952Z"
}