{
  "id": "1ARK57qqyj",
  "url": "https://patriots.win/p/1ARK57qqyj/i-am-recommending-to-senate-repu/c",
  "content": "541 I am recommending to Senate Republicans that the Hundreds of Billions of Dollars currently being sent to money sucking Insurance Companies in order to save the bad Healthcare provided by ObamaCare, BE SENT DIRECTLY TO THE PEOPLE SO THAT THEY CAN PURCHASE THEIR OWN, MUCH BETTER, HEALTHCARE... posted 4 days ago by spinometer2 52 comments award share download report block\n52 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style henri_derelicte 19 points 4 days ago Get rid of the subsidies, period. It’s not fair to tell some taxpayers that they get nothing while others get subsidized thousands. permalink award report block reply Krat 7 points 4 days ago Your definition of some needs reworking.... they are taking from the doers to fund their gibs invasion.... permalink parent award report block reply bill_in_texas 1 points 4 days ago How many are actually NET federal taxpayers in the first place? permalink parent award report block reply spinometer2 OP 1 points 4 days ago subsidized Healthcare is not going away if a kid from a poor family breaks his arm or is born with a horrible disease, are we really not going to fix it? ideally their church community would pick it up, but we laren't that advanced yet permalink parent award report block reply QSWO1 5 points 4 days ago So a few hundred thousand citizens is cheaper than millions of illegals. permalink parent award report block reply lash 3 points 4 days ago The Law and Charity You say: \"There are persons who have no money,\" and you turn to the law. But the law is not a breast that fills itself with milk. Nor are the lacteal veins of the law supplied with milk from a source outside the society. Nothing can enter the public treasury for the benefit of one citizen or one class unless other citizens and other classes have been forced to send it in. If every person draws from the treasury the amount that he has put in it, it is true that the law then plunders nobody. But this procedure does nothing for the persons who have no money. It does not promote equality of income. The law can be an instrument of equalization only as it takes from some persons and gives to other persons. When the law does this, it is an instrument of plunder. With this in mind, examine the protective tariffs, subsidies, guaranteed profits, guaranteed jobs, relief and welfare schemes, public education, progressive taxation, free credit, and public works. You will find that they are always based on legal plunder, organized injustice. permalink parent award report block reply spinometer2 OP 0 points 4 days ago tax could be voluntary if you could also specify its permitted use and the spending on those uses was made transparent... e.g. you know which family your money helped yes, that's church charity, but government could also do it that way permalink parent award report block reply lash 2 points 4 days ago Law is force. permalink parent award report block reply lash 2 points 4 days ago The Choice Before Us\nThis question of legal plunder must be settled once and for all, and there are only three ways to settle it: 1: The few plunder the many.\n2: Everybody plunders everybody.\n3:Nobody plunders anybody. We must make our choice among limited plunder, universal plunder, and no plunder. The law can follow only one of these three. Limited legal plunder: This system prevailed when the right to vote was restricted. One would turn back to this system to prevent the invasion of socialism. Universal legal plunder: We have been threatened with this system since the franchise was made universal. The newly enfranchised majority has decided to formulate law on the same principle of legal plunder that was used by their predecessors when the vote was limited. No legal plunder: This is the principle of justice, peace, order, stability, harmony, and logic. Until the day of my death, I shall proclaim this principle with all the force of my lungs (which alas! is all too inadequate). permalink parent award report block reply schiff_for_brains 1 points 4 days ago They aren't even taking from the big bad insurance companies.  They're just no longer giving them direct subsidies from our great grandkids, as they're the ones that have to pay it back. permalink parent award report block reply spinometer2 OP 14 points 4 days ago HUGE!! THIS MUST HAPPEN!!! permalink award report block reply DrWeeGee 8 points 4 days ago (it won't) permalink parent award report block reply d003 7 points 4 days ago ((( it won't ))) permalink parent award report block reply DeportThemAllForever 2 points 4 days ago MUST make HSA standard replacing all other.  It makes spending responsible as there’s deductible but money stays and is controlled by individual. All else are shit that causes price spikes. permalink parent award report block reply spinometer2 OP 2 points 4 days ago I love my hsa. got some great tax advice from a tax lawyer: never spend your hsa money until you need it in retirement. invest it all and keep all medical receipts so that in retirement you can take it out tax free. permalink parent award report block reply DeportThemAllForever 1 points 4 days ago Exactly right advice.  It’s like healthcare 401k lets you save for old age and rewards responsible use. All other models are crap that robs people or forces spending. permalink parent award report block reply Surfsup 8 points 4 days ago Hundreds of billions to hundreds of millions of citizens is $1000 per citizen. Family of four gets $4000 for the mathematically challenged. Why are citizens paying anything when bigdoc is already getting this much per person per year? permalink award report block reply suckmycorona 8 points 4 days ago Now do social security permalink award report block reply freedom-thinker 7 points 4 days ago health care vouchers, brilliant. permalink award report block reply booblitchutz 6 points 4 days ago The answer to the healthcare problem is obvious, but will never happen. Take insurance companies out of the equation completely. Honest cash pricing for all services. Every provider pays for an army of employees to process paperwork for insurance companies. The cost of a service is never the cost the insurance company actually pays. It’s a shell game of discounts (kickbacks) and service rationing for people who have already paid 10x over for coverage what the honest cash price would have been. But insurance is a trillion dollar industry and would never allow this. permalink award report block reply Danofdestiny 5 points 4 days ago Or just stop taking it out of my paycheck every payday and let me spend my money as I wish. permalink award report block reply DITTOPatriot 5 points 4 days ago LOL, you send that money to those who take from the makers, and we all know it’s not going to be spent responsibly. But hey, who needs accountability when you can throw money around? The amount of people taking this subsidy is astronomical. They will never fess up, but a simple calculation is all that’s needed to identify your neighbors on the dole. permalink award report block reply The_RedWolf 1 points 4 days ago This is a negotiation tactic and nothing more, and to be honest it's a poor one because the threat isnt real and even if it was, is short sighted for that immediate dopamine hit. The only exception would be is if the start date is pushed back to 2027, because it would take far too long to implement and the gap of coverage would be massive with only ~50 days until the next coverage year, you're not getting any cash subsidy out in time, nor will insurance companies drop prices that fast. You can argue all day about \"I shouldn't have to pay for others\" all you want, and philosophically I agree with you despite using the ACA myself since I'm a 1099, but if people who use the ACA suddenly lose coverage because of a Trump/Republican Senate policy, they're all voting Democrat, and they'll retake congress in 2026. Leading to the democrats using the \"no filibuster\" against us immediately, and probably implementing something far more destructive than the current ACA. Despite Republicans distaste of it (64% unfavorable opinion of the ACA), the overall is at 64% favorable due to 94% Democrat and 67% Independent favor ability, and the uncomfortable part.... ACA usage is 45% Republican, 35% Democrat, 20% Independent Simply put, it wont happen because it would be only net negatives for the Republican Party once the feel good moment ends. I agree something needs to change, but Trump is just blowing smoke here. permalink award report block reply HankScorpio -1 points 4 days ago Yawn. I went EVERYTHING cut. But when you are cutting healthcare while increasing the militarys budget and giving Isrl billions thats just disastrous politically. And if you terminate the filibuster, what do you do when they get in power and theres no filibuster? Dumb. permalink award report block reply spinometer2 OP 4 points 4 days ago If they don't terminate the filibuster they will terminate it after winning the midterms in 2026, win 2028, and then we are all dead (not you of course, because you're one of them) permalink parent award report block reply henri_derelicte 2 points 4 days ago Whoever said you let the Dems regain power when that time comes? Why not use the military to block them? permalink parent award report block reply Agent_86 -3 points 4 days ago Guys im only paying 167.00 a month for hc. Geez. permalink award report block reply booblitchutz 6 points 4 days ago No you’re not. You’re probably paying 167 per paycheck and then have a $3k+ deductible, which means before the insurance pays a penny you have to fork over $3k if you need anything. permalink parent award report block reply onemanshow 6 points 4 days ago Try 5k for single and 7500 for couple deductible. Basically we never use the insurance at all except for annual checkup. The direct deposit from govt to insurance companies every month guaranteed is the most brazen theft. Shameful. That’s why Dems are digging in. This is a BIG cash cow for their buddies. Nothing to do with actual healthcare permalink parent award report block reply booblitchutz 2 points 4 days ago All kinds of insurance are too big to be reformed. They basically run our government. permalink parent award report block reply Agent_86 1 points 4 days ago Nope 167.00 per month. Yes I said month. permalink parent award report block reply booblitchutz 1 points 4 days ago How big is your deductible? permalink parent award report block reply Agent_86 1 points 3 days ago My Insurance broker is looking into it. I think its zero but he should let me know by today or tomorrow. permalink parent award report block reply Agent_86 1 points 3 days ago Ok it is actually zero. Yep the paper work says so. Have a good day. permalink parent award report block reply view 8 more comments... JerryNadlerBeltFund 6 points 4 days ago Are you very young and healthy, employed and only covering yourself with your company-sponsored plan, or do you have a shitty plan?  That's very low!! permalink parent award report block reply Agent_86 1 points 4 days ago I'm retired. Left the work force after my wife died in june of 24. 2 turbo cancers. permalink parent award report block reply spinometer2 OP 3 points 4 days ago what's your dedictible? permalink parent award report block reply Agent_86 1 points 4 days ago 0 permalink parent award report block reply spinometer2 OP 1 points 4 days ago what's the company? I will switch permalink parent award report block reply Agent_86 1 points 4 days ago United Health Care permalink parent award report block reply view 2 more comments... Agent_86 1 points 3 days ago I think its zero I may have been wrong. My insurance broker is looking into it. permalink parent award report block reply\nhenri_derelicte 19 points 4 days ago Get rid of the subsidies, period. It’s not fair to tell some taxpayers that they get nothing while others get subsidized thousands. permalink award report block reply Krat 7 points 4 days ago Your definition of some needs reworking.... they are taking from the doers to fund their gibs invasion.... permalink parent award report block reply bill_in_texas 1 points 4 days ago How many are actually NET federal taxpayers in the first place? permalink parent award report block reply spinometer2 OP 1 points 4 days ago subsidized Healthcare is not going away if a kid from a poor family breaks his arm or is born with a horrible disease, are we really not going to fix it? ideally their church community would pick it up, but we laren't that advanced yet permalink parent award report block reply QSWO1 5 points 4 days ago So a few hundred thousand citizens is cheaper than millions of illegals. permalink parent award report block reply lash 3 points 4 days ago The Law and Charity You say: \"There are persons who have no money,\" and you turn to the law. But the law is not a breast that fills itself with milk. Nor are the lacteal veins of the law supplied with milk from a source outside the society. Nothing can enter the public treasury for the benefit of one citizen or one class unless other citizens and other classes have been forced to send it in. If every person draws from the treasury the amount that he has put in it, it is true that the law then plunders nobody. But this procedure does nothing for the persons who have no money. It does not promote equality of income. The law can be an instrument of equalization only as it takes from some persons and gives to other persons. When the law does this, it is an instrument of plunder. With this in mind, examine the protective tariffs, subsidies, guaranteed profits, guaranteed jobs, relief and welfare schemes, public education, progressive taxation, free credit, and public works. You will find that they are always based on legal plunder, organized injustice. permalink parent award report block reply spinometer2 OP 0 points 4 days ago tax could be voluntary if you could also specify its permitted use and the spending on those uses was made transparent... e.g. you know which family your money helped yes, that's church charity, but government could also do it that way permalink parent award report block reply lash 2 points 4 days ago Law is force. permalink parent award report block reply lash 2 points 4 days ago The Choice Before Us\nThis question of legal plunder must be settled once and for all, and there are only three ways to settle it: 1: The few plunder the many.\n2: Everybody plunders everybody.\n3:Nobody plunders anybody. We must make our choice among limited plunder, universal plunder, and no plunder. The law can follow only one of these three. Limited legal plunder: This system prevailed when the right to vote was restricted. One would turn back to this system to prevent the invasion of socialism. Universal legal plunder: We have been threatened with this system since the franchise was made universal. The newly enfranchised majority has decided to formulate law on the same principle of legal plunder that was used by their predecessors when the vote was limited. No legal plunder: This is the principle of justice, peace, order, stability, harmony, and logic. Until the day of my death, I shall proclaim this principle with all the force of my lungs (which alas! is all too inadequate). permalink parent award report block reply schiff_for_brains 1 points 4 days ago They aren't even taking from the big bad insurance companies.  They're just no longer giving them direct subsidies from our great grandkids, as they're the ones that have to pay it back. permalink parent award report block reply\nKrat 7 points 4 days ago Your definition of some needs reworking.... they are taking from the doers to fund their gibs invasion.... permalink parent award report block reply\nbill_in_texas 1 points 4 days ago How many are actually NET federal taxpayers in the first place? permalink parent award report block reply\nspinometer2 OP 1 points 4 days ago subsidized Healthcare is not going away if a kid from a poor family breaks his arm or is born with a horrible disease, are we really not going to fix it? ideally their church community would pick it up, but we laren't that advanced yet permalink parent award report block reply QSWO1 5 points 4 days ago So a few hundred thousand citizens is cheaper than millions of illegals. permalink parent award report block reply lash 3 points 4 days ago The Law and Charity You say: \"There are persons who have no money,\" and you turn to the law. But the law is not a breast that fills itself with milk. Nor are the lacteal veins of the law supplied with milk from a source outside the society. Nothing can enter the public treasury for the benefit of one citizen or one class unless other citizens and other classes have been forced to send it in. If every person draws from the treasury the amount that he has put in it, it is true that the law then plunders nobody. But this procedure does nothing for the persons who have no money. It does not promote equality of income. The law can be an instrument of equalization only as it takes from some persons and gives to other persons. When the law does this, it is an instrument of plunder. With this in mind, examine the protective tariffs, subsidies, guaranteed profits, guaranteed jobs, relief and welfare schemes, public education, progressive taxation, free credit, and public works. You will find that they are always based on legal plunder, organized injustice. permalink parent award report block reply spinometer2 OP 0 points 4 days ago tax could be voluntary if you could also specify its permitted use and the spending on those uses was made transparent... e.g. you know which family your money helped yes, that's church charity, but government could also do it that way permalink parent award report block reply lash 2 points 4 days ago Law is force. permalink parent award report block reply lash 2 points 4 days ago The Choice Before Us\nThis question of legal plunder must be settled once and for all, and there are only three ways to settle it: 1: The few plunder the many.\n2: Everybody plunders everybody.\n3:Nobody plunders anybody. We must make our choice among limited plunder, universal plunder, and no plunder. The law can follow only one of these three. Limited legal plunder: This system prevailed when the right to vote was restricted. One would turn back to this system to prevent the invasion of socialism. Universal legal plunder: We have been threatened with this system since the franchise was made universal. The newly enfranchised majority has decided to formulate law on the same principle of legal plunder that was used by their predecessors when the vote was limited. No legal plunder: This is the principle of justice, peace, order, stability, harmony, and logic. Until the day of my death, I shall proclaim this principle with all the force of my lungs (which alas! is all too inadequate). permalink parent award report block reply\nQSWO1 5 points 4 days ago So a few hundred thousand citizens is cheaper than millions of illegals. permalink parent award report block reply\nlash 3 points 4 days ago The Law and Charity You say: \"There are persons who have no money,\" and you turn to the law. But the law is not a breast that fills itself with milk. Nor are the lacteal veins of the law supplied with milk from a source outside the society. Nothing can enter the public treasury for the benefit of one citizen or one class unless other citizens and other classes have been forced to send it in. If every person draws from the treasury the amount that he has put in it, it is true that the law then plunders nobody. But this procedure does nothing for the persons who have no money. It does not promote equality of income. The law can be an instrument of equalization only as it takes from some persons and gives to other persons. When the law does this, it is an instrument of plunder. With this in mind, examine the protective tariffs, subsidies, guaranteed profits, guaranteed jobs, relief and welfare schemes, public education, progressive taxation, free credit, and public works. You will find that they are always based on legal plunder, organized injustice. permalink parent award report block reply spinometer2 OP 0 points 4 days ago tax could be voluntary if you could also specify its permitted use and the spending on those uses was made transparent... e.g. you know which family your money helped yes, that's church charity, but government could also do it that way permalink parent award report block reply lash 2 points 4 days ago Law is force. permalink parent award report block reply\nspinometer2 OP 0 points 4 days ago tax could be voluntary if you could also specify its permitted use and the spending on those uses was made transparent... e.g. you know which family your money helped yes, that's church charity, but government could also do it that way permalink parent award report block reply lash 2 points 4 days ago Law is force. permalink parent award report block reply\nlash 2 points 4 days ago Law is force. permalink parent award report block reply\nlash 2 points 4 days ago The Choice Before Us\nThis question of legal plunder must be settled once and for all, and there are only three ways to settle it: 1: The few plunder the many.\n2: Everybody plunders everybody.\n3:Nobody plunders anybody. We must make our choice among limited plunder, universal plunder, and no plunder. The law can follow only one of these three. Limited legal plunder: This system prevailed when the right to vote was restricted. One would turn back to this system to prevent the invasion of socialism. Universal legal plunder: We have been threatened with this system since the franchise was made universal. The newly enfranchised majority has decided to formulate law on the same principle of legal plunder that was used by their predecessors when the vote was limited. No legal plunder: This is the principle of justice, peace, order, stability, harmony, and logic. Until the day of my death, I shall proclaim this principle with all the force of my lungs (which alas! is all too inadequate). permalink parent award report block reply\nschiff_for_brains 1 points 4 days ago They aren't even taking from the big bad insurance companies.  They're just no longer giving them direct subsidies from our great grandkids, as they're the ones that have to pay it back. permalink parent award report block reply\nspinometer2 OP 14 points 4 days ago HUGE!! THIS MUST HAPPEN!!! permalink award report block reply DrWeeGee 8 points 4 days ago (it won't) permalink parent award report block reply d003 7 points 4 days ago ((( it won't ))) permalink parent award report block reply DeportThemAllForever 2 points 4 days ago MUST make HSA standard replacing all other.  It makes spending responsible as there’s deductible but money stays and is controlled by individual. All else are shit that causes price spikes. permalink parent award report block reply spinometer2 OP 2 points 4 days ago I love my hsa. got some great tax advice from a tax lawyer: never spend your hsa money until you need it in retirement. invest it all and keep all medical receipts so that in retirement you can take it out tax free. permalink parent award report block reply DeportThemAllForever 1 points 4 days ago Exactly right advice.  It’s like healthcare 401k lets you save for old age and rewards responsible use. All other models are crap that robs people or forces spending. permalink parent award report block reply\nDrWeeGee 8 points 4 days ago (it won't) permalink parent award report block reply d003 7 points 4 days ago ((( it won't ))) permalink parent award report block reply\nd003 7 points 4 days ago ((( it won't ))) permalink parent award report block reply\nDeportThemAllForever 2 points 4 days ago MUST make HSA standard replacing all other.  It makes spending responsible as there’s deductible but money stays and is controlled by individual. All else are shit that causes price spikes. permalink parent award report block reply spinometer2 OP 2 points 4 days ago I love my hsa. got some great tax advice from a tax lawyer: never spend your hsa money until you need it in retirement. invest it all and keep all medical receipts so that in retirement you can take it out tax free. permalink parent award report block reply DeportThemAllForever 1 points 4 days ago Exactly right advice.  It’s like healthcare 401k lets you save for old age and rewards responsible use. All other models are crap that robs people or forces spending. permalink parent award report block reply\nspinometer2 OP 2 points 4 days ago I love my hsa. got some great tax advice from a tax lawyer: never spend your hsa money until you need it in retirement. invest it all and keep all medical receipts so that in retirement you can take it out tax free. permalink parent award report block reply DeportThemAllForever 1 points 4 days ago Exactly right advice.  It’s like healthcare 401k lets you save for old age and rewards responsible use. All other models are crap that robs people or forces spending. permalink parent award report block reply\nDeportThemAllForever 1 points 4 days ago Exactly right advice.  It’s like healthcare 401k lets you save for old age and rewards responsible use. All other models are crap that robs people or forces spending. permalink parent award report block reply\nSurfsup 8 points 4 days ago Hundreds of billions to hundreds of millions of citizens is $1000 per citizen. Family of four gets $4000 for the mathematically challenged. Why are citizens paying anything when bigdoc is already getting this much per person per year? permalink award report block reply\nsuckmycorona 8 points 4 days ago Now do social security permalink award report block reply\nfreedom-thinker 7 points 4 days ago health care vouchers, brilliant. permalink award report block reply\nbooblitchutz 6 points 4 days ago The answer to the healthcare problem is obvious, but will never happen. Take insurance companies out of the equation completely. Honest cash pricing for all services. Every provider pays for an army of employees to process paperwork for insurance companies. The cost of a service is never the cost the insurance company actually pays. It’s a shell game of discounts (kickbacks) and service rationing for people who have already paid 10x over for coverage what the honest cash price would have been. But insurance is a trillion dollar industry and would never allow this. permalink award report block reply\nDanofdestiny 5 points 4 days ago Or just stop taking it out of my paycheck every payday and let me spend my money as I wish. permalink award report block reply\nDITTOPatriot 5 points 4 days ago LOL, you send that money to those who take from the makers, and we all know it’s not going to be spent responsibly. But hey, who needs accountability when you can throw money around? The amount of people taking this subsidy is astronomical. They will never fess up, but a simple calculation is all that’s needed to identify your neighbors on the dole. permalink award report block reply\nThe_RedWolf 1 points 4 days ago This is a negotiation tactic and nothing more, and to be honest it's a poor one because the threat isnt real and even if it was, is short sighted for that immediate dopamine hit. The only exception would be is if the start date is pushed back to 2027, because it would take far too long to implement and the gap of coverage would be massive with only ~50 days until the next coverage year, you're not getting any cash subsidy out in time, nor will insurance companies drop prices that fast. You can argue all day about \"I shouldn't have to pay for others\" all you want, and philosophically I agree with you despite using the ACA myself since I'm a 1099, but if people who use the ACA suddenly lose coverage because of a Trump/Republican Senate policy, they're all voting Democrat, and they'll retake congress in 2026. Leading to the democrats using the \"no filibuster\" against us immediately, and probably implementing something far more destructive than the current ACA. Despite Republicans distaste of it (64% unfavorable opinion of the ACA), the overall is at 64% favorable due to 94% Democrat and 67% Independent favor ability, and the uncomfortable part.... ACA usage is 45% Republican, 35% Democrat, 20% Independent Simply put, it wont happen because it would be only net negatives for the Republican Party once the feel good moment ends. I agree something needs to change, but Trump is just blowing smoke here. permalink award report block reply\nHankScorpio -1 points 4 days ago Yawn. I went EVERYTHING cut. But when you are cutting healthcare while increasing the militarys budget and giving Isrl billions thats just disastrous politically. And if you terminate the filibuster, what do you do when they get in power and theres no filibuster? Dumb. permalink award report block reply spinometer2 OP 4 points 4 days ago If they don't terminate the filibuster they will terminate it after winning the midterms in 2026, win 2028, and then we are all dead (not you of course, because you're one of them) permalink parent award report block reply henri_derelicte 2 points 4 days ago Whoever said you let the Dems regain power when that time comes? Why not use the military to block them? permalink parent award report block reply\nspinometer2 OP 4 points 4 days ago If they don't terminate the filibuster they will terminate it after winning the midterms in 2026, win 2028, and then we are all dead (not you of course, because you're one of them) permalink parent award report block reply\nhenri_derelicte 2 points 4 days ago Whoever said you let the Dems regain power when that time comes? Why not use the military to block them? permalink parent award report block reply\nAgent_86 -3 points 4 days ago Guys im only paying 167.00 a month for hc. Geez. permalink award report block reply booblitchutz 6 points 4 days ago No you’re not. You’re probably paying 167 per paycheck and then have a $3k+ deductible, which means before the insurance pays a penny you have to fork over $3k if you need anything. permalink parent award report block reply onemanshow 6 points 4 days ago Try 5k for single and 7500 for couple deductible. Basically we never use the insurance at all except for annual checkup. The direct deposit from govt to insurance companies every month guaranteed is the most brazen theft. Shameful. That’s why Dems are digging in. This is a BIG cash cow for their buddies. Nothing to do with actual healthcare permalink parent award report block reply booblitchutz 2 points 4 days ago All kinds of insurance are too big to be reformed. They basically run our government. permalink parent award report block reply Agent_86 1 points 4 days ago Nope 167.00 per month. Yes I said month. permalink parent award report block reply booblitchutz 1 points 4 days ago How big is your deductible? permalink parent award report block reply Agent_86 1 points 3 days ago My Insurance broker is looking into it. I think its zero but he should let me know by today or tomorrow. permalink parent award report block reply Agent_86 1 points 3 days ago Ok it is actually zero. Yep the paper work says so. Have a good day. permalink parent award report block reply view 8 more comments... JerryNadlerBeltFund 6 points 4 days ago Are you very young and healthy, employed and only covering yourself with your company-sponsored plan, or do you have a shitty plan?  That's very low!! permalink parent award report block reply Agent_86 1 points 4 days ago I'm retired. Left the work force after my wife died in june of 24. 2 turbo cancers. permalink parent award report block reply spinometer2 OP 3 points 4 days ago what's your dedictible? permalink parent award report block reply Agent_86 1 points 4 days ago 0 permalink parent award report block reply spinometer2 OP 1 points 4 days ago what's the company? I will switch permalink parent award report block reply Agent_86 1 points 4 days ago United Health Care permalink parent award report block reply view 2 more comments... Agent_86 1 points 3 days ago I think its zero I may have been wrong. My insurance broker is looking into it. permalink parent award report block reply\nbooblitchutz 6 points 4 days ago No you’re not. You’re probably paying 167 per paycheck and then have a $3k+ deductible, which means before the insurance pays a penny you have to fork over $3k if you need anything. permalink parent award report block reply onemanshow 6 points 4 days ago Try 5k for single and 7500 for couple deductible. Basically we never use the insurance at all except for annual checkup. The direct deposit from govt to insurance companies every month guaranteed is the most brazen theft. Shameful. That’s why Dems are digging in. This is a BIG cash cow for their buddies. Nothing to do with actual healthcare permalink parent award report block reply booblitchutz 2 points 4 days ago All kinds of insurance are too big to be reformed. They basically run our government. permalink parent award report block reply Agent_86 1 points 4 days ago Nope 167.00 per month. Yes I said month. permalink parent award report block reply booblitchutz 1 points 4 days ago How big is your deductible? permalink parent award report block reply Agent_86 1 points 3 days ago My Insurance broker is looking into it. I think its zero but he should let me know by today or tomorrow. permalink parent award report block reply Agent_86 1 points 3 days ago Ok it is actually zero. Yep the paper work says so. Have a good day. permalink parent award report block reply view 8 more comments...\nonemanshow 6 points 4 days ago Try 5k for single and 7500 for couple deductible. Basically we never use the insurance at all except for annual checkup. The direct deposit from govt to insurance companies every month guaranteed is the most brazen theft. Shameful. That’s why Dems are digging in. This is a BIG cash cow for their buddies. Nothing to do with actual healthcare permalink parent award report block reply booblitchutz 2 points 4 days ago All kinds of insurance are too big to be reformed. They basically run our government. permalink parent award report block reply\nbooblitchutz 2 points 4 days ago All kinds of insurance are too big to be reformed. They basically run our government. permalink parent award report block reply\nAgent_86 1 points 4 days ago Nope 167.00 per month. Yes I said month. permalink parent award report block reply booblitchutz 1 points 4 days ago How big is your deductible? permalink parent award report block reply Agent_86 1 points 3 days ago My Insurance broker is looking into it. I think its zero but he should let me know by today or tomorrow. permalink parent award report block reply Agent_86 1 points 3 days ago Ok it is actually zero. Yep the paper work says so. Have a good day. permalink parent award report block reply view 8 more comments...\nbooblitchutz 1 points 4 days ago How big is your deductible? permalink parent award report block reply Agent_86 1 points 3 days ago My Insurance broker is looking into it. I think its zero but he should let me know by today or tomorrow. permalink parent award report block reply Agent_86 1 points 3 days ago Ok it is actually zero. Yep the paper work says so. Have a good day. permalink parent award report block reply view 8 more comments...\nAgent_86 1 points 3 days ago My Insurance broker is looking into it. I think its zero but he should let me know by today or tomorrow. permalink parent award report block reply\nAgent_86 1 points 3 days ago Ok it is actually zero. Yep the paper work says so. Have a good day. permalink parent award report block reply view 8 more comments...\nJerryNadlerBeltFund 6 points 4 days ago Are you very young and healthy, employed and only covering yourself with your company-sponsored plan, or do you have a shitty plan?  That's very low!! permalink parent award report block reply Agent_86 1 points 4 days ago I'm retired. Left the work force after my wife died in june of 24. 2 turbo cancers. permalink parent award report block reply\nAgent_86 1 points 4 days ago I'm retired. Left the work force after my wife died in june of 24. 2 turbo cancers. permalink parent award report block reply\nspinometer2 OP 3 points 4 days ago what's your dedictible? permalink parent award report block reply Agent_86 1 points 4 days ago 0 permalink parent award report block reply spinometer2 OP 1 points 4 days ago what's the company? I will switch permalink parent award report block reply Agent_86 1 points 4 days ago United Health Care permalink parent award report block reply view 2 more comments... Agent_86 1 points 3 days ago I think its zero I may have been wrong. My insurance broker is looking into it. permalink parent award report block reply\nAgent_86 1 points 4 days ago 0 permalink parent award report block reply spinometer2 OP 1 points 4 days ago what's the company? I will switch permalink parent award report block reply Agent_86 1 points 4 days ago United Health Care permalink parent award report block reply view 2 more comments... Agent_86 1 points 3 days ago I think its zero I may have been wrong. My insurance broker is looking into it. permalink parent award report block reply\nspinometer2 OP 1 points 4 days ago what's the company? I will switch permalink parent award report block reply Agent_86 1 points 4 days ago United Health Care permalink parent award report block reply view 2 more comments... Agent_86 1 points 3 days ago I think its zero I may have been wrong. My insurance broker is looking into it. permalink parent award report block reply\nAgent_86 1 points 4 days ago United Health Care permalink parent award report block reply view 2 more comments...\nAgent_86 1 points 3 days ago I think its zero I may have been wrong. My insurance broker is looking into it. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:43:06.657428Z"
}