{
  "id": "1ARK9l9OaL",
  "url": "https://patriots.win/p/1ARK9l9OaL/most-boomers-think-the-universit/c",
  "content": "267 \"Most Boomers think the universities are just kooky like the 60s, with a bunch of anti-war potheads who will grow out of it. \n\nThey just can’t be made to understand what’s really happened on campus.\" posted 20 hours ago by bleeje 23 comments award share report block Oilfield Rando @Oilfield_Rando • 1d Most Boomers think the universities are just kooky like the 60s, with a bunch of anti-war potheads who will grow out of it. They just can’t be made to understand what’s really happened on campus.\n23 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Rango 5 points 19 hours ago Some boomers are the Profs at Uni's. permalink award report block reply SicSemperTyrannis2 1 points 13 hours ago Mostly retired now. The Profs in 1921 - 1965 were the bigger problem. permalink parent award report block reply Tacitus1963 2 points 12 hours ago I work in that cesspool now.\nIt's still really bad. permalink parent award report block reply SicSemperTyrannis2 0 points 13 hours ago Mostly retired now. The Profs in 1921 - 1965 were the bigger problem. permalink parent award report block reply neveser 5 points 18 hours ago Agreed. Worked in one for  10 years. We hosted one of the debates between trump and hillary.\nThis is where they communize your children. permalink award report block reply patrioticwinning3 2 points 20 hours ago Boomers can't be made to understand a lot of things, like they are responsible for this shitty economy! permalink award report block reply Shih_Tabed 5 points 15 hours ago Why were home mortgage rates at 2 and 3 percent in 2019 if the boomers destroyed the economy?  You want to be a bit more honest with what happened in 2020 and everything the youngest voters voted for like minimum wage increases?  The economy was hotter than mexican shit in 2019, then the democrats released the virus from Wuhan just in time for the election and I am sure you have at least basic knowledge of the history that transpired after that point? permalink parent award report block reply 27Sandino 3 points 18 hours ago people born between 46 and 64 are the sole cause of my problems Fuck you morons for making me defend boomers, this is the lowest iq argument on the internet,  it's not the banking cartel, offshoring, globalists, Muslim hordes, immigration,  it's Archie bunker It's 60 years later and you're still blaming boomers like a bunch of joggers whining about slavery, this generation is bitch made permalink parent award report block reply SicSemperTyrannis2 1 points 13 hours ago Fun fact: Archie Bunker was over the top satire, and did more to remove racism than MLK permalink parent award report block reply Standingoak 0 points 15 hours ago Be kind , \"Every generation ,blames the one before\" https://www.youtube.com/watch?v=5hr64MxYpgk&list=RD5hr64MxYpgk&start_radio=1 permalink parent award report block reply Standingoak 3 points 15 hours ago Was the Boomers Grand Parents who were around for the 1913 Revolution that started and caused it all. It's just that some Fourth Turnings happen within larger cycles. Congratulations . permalink parent award report block reply South_Florida_Guy 1 points 19 hours ago Or how to turn on a computer permalink parent award report block reply South_Florida_Guy 1 points 19 hours ago They're just communist indoctrination centers permalink award report block reply Floppybutthole 1 points 19 hours ago My father was just remarking that we need the 60's and 70's style cultural revolution.  I told him it could happen until a conservative generation took over first. You know so the hippies could cannibalize everything they built. permalink award report block reply UNfreeNewZealand 1 points 11 hours ago That’s a big generalisation.\nMany parents of Boomers grew up in war against Socialism/Communism. They understood how indoctrination worked and taught their children well. permalink award report block reply BigDuke6 1 points 20 hours ago What's this got to do with Trump or MAGA? permalink award report block reply Logan051361 4 points 20 hours ago I know right? this is the Dumbest post I have ever seen. permalink parent award report block reply realPixelDust -4 points 19 hours ago Found a couple fucking boomers. permalink parent award report block reply Logan051361 1 points 9 hours ago found a Moron who posts stupid shit that has nothing to do with anything permalink parent award report block reply realPixelDust 1 points 19 hours ago That is SPECIFICALLY because putting the FORMER in their minds was done ON PURPOSE so that 20 years later, that would be all they see it as & they have been blind for decades since. permalink award report block reply abstr4ct -2 points 19 hours ago no disrespect, but boomers are so out of touch they cannot understand the state of the world they live in. permalink award report block reply Jimmyprawns -1 points 14 hours ago They were exempted from the bullshit imposed on subsequent generations.  Its how their consent was secured.  They understand the state of the world they live in.  What they don't understand is the state of the world everyone else lives in and that it's not the same world they live in. permalink parent award report block reply SicSemperTyrannis2 0 points 13 hours ago Yup, everyone born between 1946 and 1964 got in a big room, held a secret meeting, and agreed to exactly that. permalink parent award report block reply\nRango 5 points 19 hours ago Some boomers are the Profs at Uni's. permalink award report block reply SicSemperTyrannis2 1 points 13 hours ago Mostly retired now. The Profs in 1921 - 1965 were the bigger problem. permalink parent award report block reply Tacitus1963 2 points 12 hours ago I work in that cesspool now.\nIt's still really bad. permalink parent award report block reply SicSemperTyrannis2 0 points 13 hours ago Mostly retired now. The Profs in 1921 - 1965 were the bigger problem. permalink parent award report block reply\nSicSemperTyrannis2 1 points 13 hours ago Mostly retired now. The Profs in 1921 - 1965 were the bigger problem. permalink parent award report block reply Tacitus1963 2 points 12 hours ago I work in that cesspool now.\nIt's still really bad. permalink parent award report block reply\nTacitus1963 2 points 12 hours ago I work in that cesspool now.\nIt's still really bad. permalink parent award report block reply\nSicSemperTyrannis2 0 points 13 hours ago Mostly retired now. The Profs in 1921 - 1965 were the bigger problem. permalink parent award report block reply\nneveser 5 points 18 hours ago Agreed. Worked in one for  10 years. We hosted one of the debates between trump and hillary.\nThis is where they communize your children. permalink award report block reply\npatrioticwinning3 2 points 20 hours ago Boomers can't be made to understand a lot of things, like they are responsible for this shitty economy! permalink award report block reply Shih_Tabed 5 points 15 hours ago Why were home mortgage rates at 2 and 3 percent in 2019 if the boomers destroyed the economy?  You want to be a bit more honest with what happened in 2020 and everything the youngest voters voted for like minimum wage increases?  The economy was hotter than mexican shit in 2019, then the democrats released the virus from Wuhan just in time for the election and I am sure you have at least basic knowledge of the history that transpired after that point? permalink parent award report block reply 27Sandino 3 points 18 hours ago people born between 46 and 64 are the sole cause of my problems Fuck you morons for making me defend boomers, this is the lowest iq argument on the internet,  it's not the banking cartel, offshoring, globalists, Muslim hordes, immigration,  it's Archie bunker It's 60 years later and you're still blaming boomers like a bunch of joggers whining about slavery, this generation is bitch made permalink parent award report block reply SicSemperTyrannis2 1 points 13 hours ago Fun fact: Archie Bunker was over the top satire, and did more to remove racism than MLK permalink parent award report block reply Standingoak 0 points 15 hours ago Be kind , \"Every generation ,blames the one before\" https://www.youtube.com/watch?v=5hr64MxYpgk&list=RD5hr64MxYpgk&start_radio=1 permalink parent award report block reply Standingoak 3 points 15 hours ago Was the Boomers Grand Parents who were around for the 1913 Revolution that started and caused it all. It's just that some Fourth Turnings happen within larger cycles. Congratulations . permalink parent award report block reply South_Florida_Guy 1 points 19 hours ago Or how to turn on a computer permalink parent award report block reply\nShih_Tabed 5 points 15 hours ago Why were home mortgage rates at 2 and 3 percent in 2019 if the boomers destroyed the economy?  You want to be a bit more honest with what happened in 2020 and everything the youngest voters voted for like minimum wage increases?  The economy was hotter than mexican shit in 2019, then the democrats released the virus from Wuhan just in time for the election and I am sure you have at least basic knowledge of the history that transpired after that point? permalink parent award report block reply\n27Sandino 3 points 18 hours ago people born between 46 and 64 are the sole cause of my problems Fuck you morons for making me defend boomers, this is the lowest iq argument on the internet,  it's not the banking cartel, offshoring, globalists, Muslim hordes, immigration,  it's Archie bunker It's 60 years later and you're still blaming boomers like a bunch of joggers whining about slavery, this generation is bitch made permalink parent award report block reply SicSemperTyrannis2 1 points 13 hours ago Fun fact: Archie Bunker was over the top satire, and did more to remove racism than MLK permalink parent award report block reply Standingoak 0 points 15 hours ago Be kind , \"Every generation ,blames the one before\" https://www.youtube.com/watch?v=5hr64MxYpgk&list=RD5hr64MxYpgk&start_radio=1 permalink parent award report block reply\nSicSemperTyrannis2 1 points 13 hours ago Fun fact: Archie Bunker was over the top satire, and did more to remove racism than MLK permalink parent award report block reply\nStandingoak 0 points 15 hours ago Be kind , \"Every generation ,blames the one before\" https://www.youtube.com/watch?v=5hr64MxYpgk&list=RD5hr64MxYpgk&start_radio=1 permalink parent award report block reply\nStandingoak 3 points 15 hours ago Was the Boomers Grand Parents who were around for the 1913 Revolution that started and caused it all. It's just that some Fourth Turnings happen within larger cycles. Congratulations . permalink parent award report block reply\nSouth_Florida_Guy 1 points 19 hours ago Or how to turn on a computer permalink parent award report block reply\nSouth_Florida_Guy 1 points 19 hours ago They're just communist indoctrination centers permalink award report block reply\nFloppybutthole 1 points 19 hours ago My father was just remarking that we need the 60's and 70's style cultural revolution.  I told him it could happen until a conservative generation took over first. You know so the hippies could cannibalize everything they built. permalink award report block reply\nUNfreeNewZealand 1 points 11 hours ago That’s a big generalisation.\nMany parents of Boomers grew up in war against Socialism/Communism. They understood how indoctrination worked and taught their children well. permalink award report block reply\nBigDuke6 1 points 20 hours ago What's this got to do with Trump or MAGA? permalink award report block reply Logan051361 4 points 20 hours ago I know right? this is the Dumbest post I have ever seen. permalink parent award report block reply realPixelDust -4 points 19 hours ago Found a couple fucking boomers. permalink parent award report block reply Logan051361 1 points 9 hours ago found a Moron who posts stupid shit that has nothing to do with anything permalink parent award report block reply\nLogan051361 4 points 20 hours ago I know right? this is the Dumbest post I have ever seen. permalink parent award report block reply realPixelDust -4 points 19 hours ago Found a couple fucking boomers. permalink parent award report block reply Logan051361 1 points 9 hours ago found a Moron who posts stupid shit that has nothing to do with anything permalink parent award report block reply\nrealPixelDust -4 points 19 hours ago Found a couple fucking boomers. permalink parent award report block reply Logan051361 1 points 9 hours ago found a Moron who posts stupid shit that has nothing to do with anything permalink parent award report block reply\nLogan051361 1 points 9 hours ago found a Moron who posts stupid shit that has nothing to do with anything permalink parent award report block reply\nrealPixelDust 1 points 19 hours ago That is SPECIFICALLY because putting the FORMER in their minds was done ON PURPOSE so that 20 years later, that would be all they see it as & they have been blind for decades since. permalink award report block reply\nabstr4ct -2 points 19 hours ago no disrespect, but boomers are so out of touch they cannot understand the state of the world they live in. permalink award report block reply Jimmyprawns -1 points 14 hours ago They were exempted from the bullshit imposed on subsequent generations.  Its how their consent was secured.  They understand the state of the world they live in.  What they don't understand is the state of the world everyone else lives in and that it's not the same world they live in. permalink parent award report block reply SicSemperTyrannis2 0 points 13 hours ago Yup, everyone born between 1946 and 1964 got in a big room, held a secret meeting, and agreed to exactly that. permalink parent award report block reply\nJimmyprawns -1 points 14 hours ago They were exempted from the bullshit imposed on subsequent generations.  Its how their consent was secured.  They understand the state of the world they live in.  What they don't understand is the state of the world everyone else lives in and that it's not the same world they live in. permalink parent award report block reply SicSemperTyrannis2 0 points 13 hours ago Yup, everyone born between 1946 and 1964 got in a big room, held a secret meeting, and agreed to exactly that. permalink parent award report block reply\nSicSemperTyrannis2 0 points 13 hours ago Yup, everyone born between 1946 and 1964 got in a big room, held a secret meeting, and agreed to exactly that. permalink parent award report block reply",
  "fetched_at": "2025-11-12T21:05:24.336938Z"
}