{
  "id": "1ARK5A7e5K",
  "url": "https://patriots.win/p/1ARK5A7e5K/pine-gate-renewables-files-for-b/c",
  "content": "823 Pine Gate Renewables files for bankruptcy, selling solar business and project portfolio.  LOL, lose subsidies and go broke. (www.solarpowerworldonline.com) posted 3 days ago by OrangeManNotBad 70 comments award share report block Pine Gate Renewables files for bankruptcy, selling solar business and project portfolio National solar developer Pine Gate Renewables is filing for Chapter 11 bankruptcy and selling its solar and energy storage project portfolio and www.solarpowerworldonline.com\n70 comments Sort by Top Top New Worst Old Save War_Hamster 44 points 3 days ago I wish there was a way to claw back all of the green scam money. Some of us called this out 20 years ago. permalink award report block reply Burneraccountno4 19 points 3 days ago Not only is there no way to claw it back but you are expected to pay more to fix and rebuild the legacy infrastructure that was neglected. I might add ongoing maintenance of that infrastructure was already included in your energy bills so the fact they never spent the money on that infrastructure means it was stolen and wasted by corrupt politicians. permalink parent award report block reply War_Hamster 9 points 3 days ago Accurate. Thanks for ruining my Sunday morning. permalink parent award report block reply DeportThemAllForever 1 points 3 days ago Got to admit, sadly, Democrats outdid Republicans there on cronyisms.  Government = organized mass looting. permalink parent award report block reply MaxineWaters4Prez 8 points 3 days ago It's been going on for the better part of 60 years. permalink parent award report block reply War_Hamster 7 points 3 days ago Since 1971. permalink parent award report block reply 46DindoNuffin 5 points 3 days ago They were worried about Global Cooling then. permalink parent award report block reply War_Hamster 4 points 3 days ago What do you know about Maurice Strong? Go look up this Rockefeller stooge. This is the real story. permalink parent award report block reply BoughtByBloomberg2 4 points 3 days ago There's fields of solar panels bro. You, me, a van. We out of there with 20-30 of em. permalink parent award report block reply Josemarti 2 points 3 days ago I didn't think you were that old. permalink parent award report block reply Parhelion12 6 points 3 days ago He /she could have been an infant. A toddler has a better understanding of economics and energy than any solar or wind scammer. permalink parent award report block reply War_Hamster 5 points 3 days ago I am on the wrong side of 50, but still in my prime. permalink parent award report block reply Josemarti 3 points 3 days ago I thought you were so much younger for some reason. Young heart I suppose permalink parent award report block reply War_Hamster 2 points 3 days ago I will take that as a compliment. permalink parent award report block reply view 4 more comments... bratt 1 points 3 days ago Hamsters in general have a very short lifespan, the whole predator - prey thing. permalink parent award report block reply Choppermagic 1 points 3 days ago i would be happy with arrests.  DOGE uncovered billions of dollars being stolen and not a single arrest. permalink parent award report block reply Smurfection 20 points 3 days ago boondoggles.  The entire \"green energy\" renewable economy is nothing but a giant taxpayer fleecing boondoggles.  Most of it was never serious but just a way to build liberal cred for owners and investors and a lot of that was kick backs for donations and favors.   The only way forward is nuclear. permalink award report block reply rivetjoint2 5 points 3 days ago Boondoggle 2.0, the super fund clean up of former 'green' energy solar farms. permalink parent award report block reply bratt 2 points 3 days ago Boondoggle 10.0+ the AI boom. permalink parent award report block reply Smurfection 3 points 3 days ago The AI Boom is going to bust and those who are preaching about how AI is going to revolutionize everything, don't really understand AI.   AI may do the job of ten people sitting in a chair, but five people are going to need to check the results and five more people are going to be needed to keep AI running. IN any case, it's not just AI.  We're going to need nuclear.   It's the only reliable energy that is going to be fueling the next phase of our space age, computer economy. permalink parent award report block reply bratt 1 points 3 days ago I wanted nuclear to keep growing since the environmentalists started protesting it. I think the US went over 30 years from the last plant opening until they completed 3 in this century. I am not a supporter of wind and solar in big industrial capacity, but it is great for small or isolated purposes. Nuclear is almost as clean as both of those in production and probably way better in acquiring materials needed to produce power. Nuclear is also safer in this century with the latest technologies and computerize monitoring. permalink parent award report block reply view 2 more comments... NerdRage 2 points 3 days ago I knew it was a scam because the one time I drove from Texas to California (visiting relatives), I drove past hundreds of thousands of square miles of solar panels and wind turbines. It fucking stretched as far as the eye can see, right down to the horizon. All that, and California still runs out of power and has to rely on coal and oil. How fucking embarrassing. permalink parent award report block reply Smurfection 2 points 3 days ago I knew it was a boondoggle because the left has been trying since decades before I was born to end the energy sector. Here's what it comes down to......The Left hates Capitalism.  America is the Greatest Capitalist nation and America is the defender of capitalism. The want communism.  Let me say it again, the left wants communism and all the horrors that come with communism,  which they call socialism to play a mind game with semantics.   They want the horrors of communism because every single one of them thinks in their delusional pride they will be honored as the vanguard, the heroes, the liberators and take total control.  They think they'll be benevolent.  Think is the operative word.  Look at what they're willing to do when they have every basic need met and more - spike trees in forests that kills loggers, throw bricks and stones at cops, praise publicly murderers terrorists and yes, even Satanists.   Abort post birth babies.   Yes, they want this and more because anyone who is willing to excuse and praise shoplifting, rape, murder, fraud and theft now, would be willing to wage a genocide in an actual revolution and this you have to understand, is what they want because they think they'll be good guys doing genocide.  They already defend it and have been for over a century. The way to end Capitalism in their opinion is to destroy  America.  They destroy America by taking away the real fuel of our economy, our Capitalist system - that is, oil, ,gas and coal.  They've literally been trying to do this since the beginning of the 20th century.   They've been trying to do this since the first cars came out and the first stupid ass environmentalist ended up  in a ditch because he was too drunk to stay awake and unlike a horse, the car didn't know to turn to avoid the ditch.   They've wanted this since the buggy whip maker couldn't whip a car to turn on a road and avoid a ditch.   They hate Capitalism because they're numbskulls without talent who can't make a car or a buggwhip.  It's mostly women who don't want to be useful other than for sex.  By Sex here, I don't mean as a wife or a mother, I mean the actual carnal meaningless for profit sex. It says in the Bible when an authoritarian king rules, he sends the sons to die in battle, turns the daughters into whores and the parents die without children in poverty.  Obviously a paraphrase, but I think the meaning is there. permalink parent award report block reply Chickensaurus 17 points 3 days ago Learn to drill.... permalink award report block reply flp999 12 points 3 days ago Now gather up the tens of thousands of miles of very expensive GARBAGE they installed all over this country and dump it in a giant pit. People need jobs? New government program. Train and send thousands of workers out to tear down and dispose of all this shit. permalink award report block reply YT45 10 points 3 days ago Never mind all the acres of forest they bulldozed for their “environmentally-friendly” scam. permalink parent award report block reply thisisatestof2 4 points 3 days ago Exactly. A couple towns away from me, a lot of companies seem to want to dump as much solar in any open field or forest they can find. Today, they have probably bought those a couple hundred acres of what used to be forest or fields that wildlife used to love to pull up solar farms.  You know if it was say, a Walmart that wanted to knock down a forest, the lips will be up in arms. permalink parent award report block reply MaxineWaters4Prez 9 points 3 days ago I'm sure the C-suite was paid handsomely with the gubmint subsidies. Golden parachutes on the taxpayer dole. permalink award report block reply XlDEN 6 points 3 days ago Cool! Now do ethanol. permalink award report block reply rivetjoint2 7 points 3 days ago Ethanol.  The perfect case study for everything is wrong with government incentives.  Now, even the dumb ass greens admit it was a super bad idea and terrible for the environment.  And now an unstoppible Iowa farm lobby. permalink parent award report block reply Mc_TheDonald_OG 2 points 3 days ago Keep going permalink parent award report block reply DingleBalls 5 points 3 days ago So called \"renewable\" energy is not sustainable permalink award report block reply Kolob64 5 points 3 days ago Notice how much damage those \"solar farms\" do to the land.  No sane environmentalist could support this. permalink award report block reply Maganifice7 3 points 3 days ago There are no sane environmentalists. permalink parent award report block reply Kolob64 1 points 3 days ago Bjorn Lomborg gets close permalink parent award report block reply Mungo 2 points 3 days ago Agreed. The panels last an average of just 10 years and cannot be recycled. permalink parent award report block reply Kolob64 1 points 3 days ago Next, what we do with old wind turbines. permalink parent award report block reply Mungo 1 points 3 days ago Good point. Also non recyclable. permalink parent award report block reply Kolob64 2 points 3 days ago And made out of petroleum.  You can't fix stupid. permalink parent award report block reply Johnkimble111 -1 points 3 days ago That’s bullshit, they’re exceeding their projected 25-30 year lifespan, and the panel’s themselves are incredibly reluable. Even when they’re coming towards the end of their lives they’re still generating free power. You’re confusing them with wind turbines. permalink parent award report block reply bratt 4 points 3 days ago Hopefully a demo and restore to farmland clause was built into the permits to originally build these eyesores, but of course they didn't so that will be up to whoever wants the land, making it unsalable and worthless, especially wind farms with footings that are hundreds of yards of concrete. EACH permalink award report block reply Maganifice7 4 points 3 days ago Look up how many solar companies go out of business every year. Solar is a losing strategy. permalink award report block reply kishkan 3 points 3 days ago Just think of all the solar panels and equipment you're going to buy at auction for pennies on the dollar. permalink award report block reply Johnkimble111 1 points 3 days ago Very doubtful. A big cost for a project is installing the supporting brackets, wiring things in place and connecting it to the grid. The cos/value of  installing the stuff is as much as the actual equipment basically. So if you dismantle it you’ve list more than half your investment permalink parent award report block reply kishkan 1 points 3 days ago What are you going on about? I'm talking about solar distributors and manufacturers going bankrupt or selling off their inventory at auction. It happens all of the time. I've seen countless auctions where people are able to make great deals. It happens every few months. https://www.westauction.com/allitems/keyword_solar permalink parent award report block reply Johnkimble111 1 points 3 days ago Sorry, I thought you meant dismantling existing installations permalink parent award report block reply rivetjoint2 3 points 3 days ago Wait what?  Does this mean that even after fully deployed you can't run a solar farm profitably? permalink award report block reply Johnkimble111 2 points 3 days ago Solar is amazing . Unlike wind it’s more predictable, there’s almost no maintenance and no moving parts. If you mess up a solar farm you’re just an idiot who paid too much for the land. In fact the whole concept of a solar farm is completely retarded. Why waste land when you can simply put the panels on a roof? You could literally take a parking lot in any southern state and put a solar roof on top, ketos people’s cars cooler too. I guess a solar farm might make sense in some desert scrubland with poor quality soil, but that’s about it. permalink parent award report block reply Kolob64 5 points 3 days ago That desert scrubland is very much alive.  A Mesquite tree, for example, can have roots going down 200 feet.  Look at the desert after rain and you will see it come alive.  A new solar farm near where I live in the desert, has disturbed the ecology which now kicks up huge amounts of sand into the wind and lowers quality of life.  If you care about carbon, that scrubland sequesters huge amounts.  The land is covered in critters which only come out at night.  Go on a walk with a backlight and you will see all the life. permalink parent award report block reply Johnkimble111 3 points 3 days ago Agreed, but it’s still less valuable overall than richly fertile soil that could either grow vast amounts of food or support enormous amounts of wildlife, trees etc. In many places they’re putting solar panels on such fertile , they’re literally going to starve us with their insanity. permalink parent award report block reply Kolob64 2 points 3 days ago We are putting houses all over much of our best soil and growing lawns on them.  I am growing food all over my yard.  Why waste water in the desert when I can grow food with that water?  Our desert town used to be agricultural, but grows retirees now.  As for that no agricultural land, destroying the soil prevents what water does land from percolating into the aquifers. If they really cared, the solar would be elevated and crops or livestock would be shaded underneath.  Grazing is essential to rolling back desertification.  I wish environmentalists knew more about the environment as so much of their policies destroy it. permalink parent award report block reply rivetjoint2 3 points 3 days ago I like your parking lot idea. permalink parent award report block reply CommanderOfCheese 3 points 3 days ago Yep. The pavement is just going to get hot and the insides of the cars are going to be scorching and have to use more gas to cool them off anyway. Slap a bunch of panels over the parking lots and you not only collect the energy coming in, you also don't have to spend as much energy getting the heat out. permalink parent award report block reply Mungo 3 points 3 days ago And yet there is an 800 acre new solar farm going in just north of Madison, Wi as I type this…..WTF? permalink award report block reply billybaldwin2 3 points 3 days ago At some point, Panda Energy was the largest clean / green energy company. They closed 8 years ago. They saw the writing on the walls. A lot of the solar farms are just converging a neighboring state's cheap natural gas into \"solar energy.\" When others popped up and undercut their prices, they failed and closed. permalink award report block reply 1amS3lly 2 points 3 days ago Slimy people tell us renewables are now cheaper than natural gas and coal, and yet as soon as the government terminates the renewable handouts, they fold faster than a Chinese laundromat. permalink award report block reply FKH2 2 points 3 days ago Environmental disaster permalink award report block reply BoughtByBloomberg2 2 points 3 days ago How the fuck do you go broke with electric prices skyrocketing? permalink award report block reply MehNahMehNah 1 points 3 days ago ROI didn't work out. permalink parent award report block reply MehNahMehNah 2 points 3 days ago Guess who's investors are getting screwed? permalink award report block reply booblitchutz 2 points 3 days ago The ENTITE THING has been a scam from day 1. That includes “recycling”. Almost all of it goes into the landfill. The small amount of glass, paper and plastic that does actually get recycled requires more resources than it saves, but it did double your trash bill (not that most people even know there was a time when it cost half of what you’re paying now anyway) and the muni government gets a nice chunk of tax money to subsidize it, a sizable chunk of which goes to the recycling program’s administrative overhead, etc. In the end the Earth is worse off AND our pocketbooks are lighter and democrats get our money. permalink award report block reply Mega_MAGA 2 points 3 days ago The subsidies were the whole point. Did anyone learn from Solyndra? permalink award report block reply CommanderOfCheese 3 points 3 days ago Solyndra tech was so retarded from the get-go. Solar cylinders to be deployed in places that are mostly cloud cover, using tech that admittedly does collect diffuse light better than the standard tech for collecting direct light does under diffuse light, but more expensive to deploy, in places that will yield less energy. It was a modern business equivalent to watering fields with Brawndo. permalink parent award report block reply Mega_MAGA 1 points 3 days ago It wasn't supposed to work. permalink parent award report block reply modded 1 points 3 days ago Solar panels are awesome. Put them on your roof and youll get power for 30 years. permalink award report block reply CommanderOfCheese 4 points 3 days ago Don't know why you're getting down voted. Solar can be a great investment if you have the weather for it. Bunch of reactionary retards. permalink parent award report block reply\nWar_Hamster 44 points 3 days ago I wish there was a way to claw back all of the green scam money. Some of us called this out 20 years ago. permalink award report block reply Burneraccountno4 19 points 3 days ago Not only is there no way to claw it back but you are expected to pay more to fix and rebuild the legacy infrastructure that was neglected. I might add ongoing maintenance of that infrastructure was already included in your energy bills so the fact they never spent the money on that infrastructure means it was stolen and wasted by corrupt politicians. permalink parent award report block reply War_Hamster 9 points 3 days ago Accurate. Thanks for ruining my Sunday morning. permalink parent award report block reply DeportThemAllForever 1 points 3 days ago Got to admit, sadly, Democrats outdid Republicans there on cronyisms.  Government = organized mass looting. permalink parent award report block reply MaxineWaters4Prez 8 points 3 days ago It's been going on for the better part of 60 years. permalink parent award report block reply War_Hamster 7 points 3 days ago Since 1971. permalink parent award report block reply 46DindoNuffin 5 points 3 days ago They were worried about Global Cooling then. permalink parent award report block reply War_Hamster 4 points 3 days ago What do you know about Maurice Strong? Go look up this Rockefeller stooge. This is the real story. permalink parent award report block reply BoughtByBloomberg2 4 points 3 days ago There's fields of solar panels bro. You, me, a van. We out of there with 20-30 of em. permalink parent award report block reply Josemarti 2 points 3 days ago I didn't think you were that old. permalink parent award report block reply Parhelion12 6 points 3 days ago He /she could have been an infant. A toddler has a better understanding of economics and energy than any solar or wind scammer. permalink parent award report block reply War_Hamster 5 points 3 days ago I am on the wrong side of 50, but still in my prime. permalink parent award report block reply Josemarti 3 points 3 days ago I thought you were so much younger for some reason. Young heart I suppose permalink parent award report block reply War_Hamster 2 points 3 days ago I will take that as a compliment. permalink parent award report block reply view 4 more comments... bratt 1 points 3 days ago Hamsters in general have a very short lifespan, the whole predator - prey thing. permalink parent award report block reply Choppermagic 1 points 3 days ago i would be happy with arrests.  DOGE uncovered billions of dollars being stolen and not a single arrest. permalink parent award report block reply\nBurneraccountno4 19 points 3 days ago Not only is there no way to claw it back but you are expected to pay more to fix and rebuild the legacy infrastructure that was neglected. I might add ongoing maintenance of that infrastructure was already included in your energy bills so the fact they never spent the money on that infrastructure means it was stolen and wasted by corrupt politicians. permalink parent award report block reply War_Hamster 9 points 3 days ago Accurate. Thanks for ruining my Sunday morning. permalink parent award report block reply DeportThemAllForever 1 points 3 days ago Got to admit, sadly, Democrats outdid Republicans there on cronyisms.  Government = organized mass looting. permalink parent award report block reply\nWar_Hamster 9 points 3 days ago Accurate. Thanks for ruining my Sunday morning. permalink parent award report block reply\nDeportThemAllForever 1 points 3 days ago Got to admit, sadly, Democrats outdid Republicans there on cronyisms.  Government = organized mass looting. permalink parent award report block reply\nMaxineWaters4Prez 8 points 3 days ago It's been going on for the better part of 60 years. permalink parent award report block reply War_Hamster 7 points 3 days ago Since 1971. permalink parent award report block reply 46DindoNuffin 5 points 3 days ago They were worried about Global Cooling then. permalink parent award report block reply War_Hamster 4 points 3 days ago What do you know about Maurice Strong? Go look up this Rockefeller stooge. This is the real story. permalink parent award report block reply\nWar_Hamster 7 points 3 days ago Since 1971. permalink parent award report block reply 46DindoNuffin 5 points 3 days ago They were worried about Global Cooling then. permalink parent award report block reply War_Hamster 4 points 3 days ago What do you know about Maurice Strong? Go look up this Rockefeller stooge. This is the real story. permalink parent award report block reply\n46DindoNuffin 5 points 3 days ago They were worried about Global Cooling then. permalink parent award report block reply War_Hamster 4 points 3 days ago What do you know about Maurice Strong? Go look up this Rockefeller stooge. This is the real story. permalink parent award report block reply\nWar_Hamster 4 points 3 days ago What do you know about Maurice Strong? Go look up this Rockefeller stooge. This is the real story. permalink parent award report block reply\nBoughtByBloomberg2 4 points 3 days ago There's fields of solar panels bro. You, me, a van. We out of there with 20-30 of em. permalink parent award report block reply\nJosemarti 2 points 3 days ago I didn't think you were that old. permalink parent award report block reply Parhelion12 6 points 3 days ago He /she could have been an infant. A toddler has a better understanding of economics and energy than any solar or wind scammer. permalink parent award report block reply War_Hamster 5 points 3 days ago I am on the wrong side of 50, but still in my prime. permalink parent award report block reply Josemarti 3 points 3 days ago I thought you were so much younger for some reason. Young heart I suppose permalink parent award report block reply War_Hamster 2 points 3 days ago I will take that as a compliment. permalink parent award report block reply view 4 more comments... bratt 1 points 3 days ago Hamsters in general have a very short lifespan, the whole predator - prey thing. permalink parent award report block reply\nParhelion12 6 points 3 days ago He /she could have been an infant. A toddler has a better understanding of economics and energy than any solar or wind scammer. permalink parent award report block reply\nWar_Hamster 5 points 3 days ago I am on the wrong side of 50, but still in my prime. permalink parent award report block reply Josemarti 3 points 3 days ago I thought you were so much younger for some reason. Young heart I suppose permalink parent award report block reply War_Hamster 2 points 3 days ago I will take that as a compliment. permalink parent award report block reply view 4 more comments... bratt 1 points 3 days ago Hamsters in general have a very short lifespan, the whole predator - prey thing. permalink parent award report block reply\nJosemarti 3 points 3 days ago I thought you were so much younger for some reason. Young heart I suppose permalink parent award report block reply War_Hamster 2 points 3 days ago I will take that as a compliment. permalink parent award report block reply view 4 more comments... bratt 1 points 3 days ago Hamsters in general have a very short lifespan, the whole predator - prey thing. permalink parent award report block reply\nWar_Hamster 2 points 3 days ago I will take that as a compliment. permalink parent award report block reply view 4 more comments...\nbratt 1 points 3 days ago Hamsters in general have a very short lifespan, the whole predator - prey thing. permalink parent award report block reply\nChoppermagic 1 points 3 days ago i would be happy with arrests.  DOGE uncovered billions of dollars being stolen and not a single arrest. permalink parent award report block reply\nSmurfection 20 points 3 days ago boondoggles.  The entire \"green energy\" renewable economy is nothing but a giant taxpayer fleecing boondoggles.  Most of it was never serious but just a way to build liberal cred for owners and investors and a lot of that was kick backs for donations and favors.   The only way forward is nuclear. permalink award report block reply rivetjoint2 5 points 3 days ago Boondoggle 2.0, the super fund clean up of former 'green' energy solar farms. permalink parent award report block reply bratt 2 points 3 days ago Boondoggle 10.0+ the AI boom. permalink parent award report block reply Smurfection 3 points 3 days ago The AI Boom is going to bust and those who are preaching about how AI is going to revolutionize everything, don't really understand AI.   AI may do the job of ten people sitting in a chair, but five people are going to need to check the results and five more people are going to be needed to keep AI running. IN any case, it's not just AI.  We're going to need nuclear.   It's the only reliable energy that is going to be fueling the next phase of our space age, computer economy. permalink parent award report block reply bratt 1 points 3 days ago I wanted nuclear to keep growing since the environmentalists started protesting it. I think the US went over 30 years from the last plant opening until they completed 3 in this century. I am not a supporter of wind and solar in big industrial capacity, but it is great for small or isolated purposes. Nuclear is almost as clean as both of those in production and probably way better in acquiring materials needed to produce power. Nuclear is also safer in this century with the latest technologies and computerize monitoring. permalink parent award report block reply view 2 more comments... NerdRage 2 points 3 days ago I knew it was a scam because the one time I drove from Texas to California (visiting relatives), I drove past hundreds of thousands of square miles of solar panels and wind turbines. It fucking stretched as far as the eye can see, right down to the horizon. All that, and California still runs out of power and has to rely on coal and oil. How fucking embarrassing. permalink parent award report block reply Smurfection 2 points 3 days ago I knew it was a boondoggle because the left has been trying since decades before I was born to end the energy sector. Here's what it comes down to......The Left hates Capitalism.  America is the Greatest Capitalist nation and America is the defender of capitalism. The want communism.  Let me say it again, the left wants communism and all the horrors that come with communism,  which they call socialism to play a mind game with semantics.   They want the horrors of communism because every single one of them thinks in their delusional pride they will be honored as the vanguard, the heroes, the liberators and take total control.  They think they'll be benevolent.  Think is the operative word.  Look at what they're willing to do when they have every basic need met and more - spike trees in forests that kills loggers, throw bricks and stones at cops, praise publicly murderers terrorists and yes, even Satanists.   Abort post birth babies.   Yes, they want this and more because anyone who is willing to excuse and praise shoplifting, rape, murder, fraud and theft now, would be willing to wage a genocide in an actual revolution and this you have to understand, is what they want because they think they'll be good guys doing genocide.  They already defend it and have been for over a century. The way to end Capitalism in their opinion is to destroy  America.  They destroy America by taking away the real fuel of our economy, our Capitalist system - that is, oil, ,gas and coal.  They've literally been trying to do this since the beginning of the 20th century.   They've been trying to do this since the first cars came out and the first stupid ass environmentalist ended up  in a ditch because he was too drunk to stay awake and unlike a horse, the car didn't know to turn to avoid the ditch.   They've wanted this since the buggy whip maker couldn't whip a car to turn on a road and avoid a ditch.   They hate Capitalism because they're numbskulls without talent who can't make a car or a buggwhip.  It's mostly women who don't want to be useful other than for sex.  By Sex here, I don't mean as a wife or a mother, I mean the actual carnal meaningless for profit sex. It says in the Bible when an authoritarian king rules, he sends the sons to die in battle, turns the daughters into whores and the parents die without children in poverty.  Obviously a paraphrase, but I think the meaning is there. permalink parent award report block reply\nrivetjoint2 5 points 3 days ago Boondoggle 2.0, the super fund clean up of former 'green' energy solar farms. permalink parent award report block reply bratt 2 points 3 days ago Boondoggle 10.0+ the AI boom. permalink parent award report block reply Smurfection 3 points 3 days ago The AI Boom is going to bust and those who are preaching about how AI is going to revolutionize everything, don't really understand AI.   AI may do the job of ten people sitting in a chair, but five people are going to need to check the results and five more people are going to be needed to keep AI running. IN any case, it's not just AI.  We're going to need nuclear.   It's the only reliable energy that is going to be fueling the next phase of our space age, computer economy. permalink parent award report block reply bratt 1 points 3 days ago I wanted nuclear to keep growing since the environmentalists started protesting it. I think the US went over 30 years from the last plant opening until they completed 3 in this century. I am not a supporter of wind and solar in big industrial capacity, but it is great for small or isolated purposes. Nuclear is almost as clean as both of those in production and probably way better in acquiring materials needed to produce power. Nuclear is also safer in this century with the latest technologies and computerize monitoring. permalink parent award report block reply view 2 more comments...\nbratt 2 points 3 days ago Boondoggle 10.0+ the AI boom. permalink parent award report block reply Smurfection 3 points 3 days ago The AI Boom is going to bust and those who are preaching about how AI is going to revolutionize everything, don't really understand AI.   AI may do the job of ten people sitting in a chair, but five people are going to need to check the results and five more people are going to be needed to keep AI running. IN any case, it's not just AI.  We're going to need nuclear.   It's the only reliable energy that is going to be fueling the next phase of our space age, computer economy. permalink parent award report block reply bratt 1 points 3 days ago I wanted nuclear to keep growing since the environmentalists started protesting it. I think the US went over 30 years from the last plant opening until they completed 3 in this century. I am not a supporter of wind and solar in big industrial capacity, but it is great for small or isolated purposes. Nuclear is almost as clean as both of those in production and probably way better in acquiring materials needed to produce power. Nuclear is also safer in this century with the latest technologies and computerize monitoring. permalink parent award report block reply view 2 more comments...\nSmurfection 3 points 3 days ago The AI Boom is going to bust and those who are preaching about how AI is going to revolutionize everything, don't really understand AI.   AI may do the job of ten people sitting in a chair, but five people are going to need to check the results and five more people are going to be needed to keep AI running. IN any case, it's not just AI.  We're going to need nuclear.   It's the only reliable energy that is going to be fueling the next phase of our space age, computer economy. permalink parent award report block reply bratt 1 points 3 days ago I wanted nuclear to keep growing since the environmentalists started protesting it. I think the US went over 30 years from the last plant opening until they completed 3 in this century. I am not a supporter of wind and solar in big industrial capacity, but it is great for small or isolated purposes. Nuclear is almost as clean as both of those in production and probably way better in acquiring materials needed to produce power. Nuclear is also safer in this century with the latest technologies and computerize monitoring. permalink parent award report block reply view 2 more comments...\nbratt 1 points 3 days ago I wanted nuclear to keep growing since the environmentalists started protesting it. I think the US went over 30 years from the last plant opening until they completed 3 in this century. I am not a supporter of wind and solar in big industrial capacity, but it is great for small or isolated purposes. Nuclear is almost as clean as both of those in production and probably way better in acquiring materials needed to produce power. Nuclear is also safer in this century with the latest technologies and computerize monitoring. permalink parent award report block reply view 2 more comments...\nNerdRage 2 points 3 days ago I knew it was a scam because the one time I drove from Texas to California (visiting relatives), I drove past hundreds of thousands of square miles of solar panels and wind turbines. It fucking stretched as far as the eye can see, right down to the horizon. All that, and California still runs out of power and has to rely on coal and oil. How fucking embarrassing. permalink parent award report block reply Smurfection 2 points 3 days ago I knew it was a boondoggle because the left has been trying since decades before I was born to end the energy sector. Here's what it comes down to......The Left hates Capitalism.  America is the Greatest Capitalist nation and America is the defender of capitalism. The want communism.  Let me say it again, the left wants communism and all the horrors that come with communism,  which they call socialism to play a mind game with semantics.   They want the horrors of communism because every single one of them thinks in their delusional pride they will be honored as the vanguard, the heroes, the liberators and take total control.  They think they'll be benevolent.  Think is the operative word.  Look at what they're willing to do when they have every basic need met and more - spike trees in forests that kills loggers, throw bricks and stones at cops, praise publicly murderers terrorists and yes, even Satanists.   Abort post birth babies.   Yes, they want this and more because anyone who is willing to excuse and praise shoplifting, rape, murder, fraud and theft now, would be willing to wage a genocide in an actual revolution and this you have to understand, is what they want because they think they'll be good guys doing genocide.  They already defend it and have been for over a century. The way to end Capitalism in their opinion is to destroy  America.  They destroy America by taking away the real fuel of our economy, our Capitalist system - that is, oil, ,gas and coal.  They've literally been trying to do this since the beginning of the 20th century.   They've been trying to do this since the first cars came out and the first stupid ass environmentalist ended up  in a ditch because he was too drunk to stay awake and unlike a horse, the car didn't know to turn to avoid the ditch.   They've wanted this since the buggy whip maker couldn't whip a car to turn on a road and avoid a ditch.   They hate Capitalism because they're numbskulls without talent who can't make a car or a buggwhip.  It's mostly women who don't want to be useful other than for sex.  By Sex here, I don't mean as a wife or a mother, I mean the actual carnal meaningless for profit sex. It says in the Bible when an authoritarian king rules, he sends the sons to die in battle, turns the daughters into whores and the parents die without children in poverty.  Obviously a paraphrase, but I think the meaning is there. permalink parent award report block reply\nSmurfection 2 points 3 days ago I knew it was a boondoggle because the left has been trying since decades before I was born to end the energy sector. Here's what it comes down to......The Left hates Capitalism.  America is the Greatest Capitalist nation and America is the defender of capitalism. The want communism.  Let me say it again, the left wants communism and all the horrors that come with communism,  which they call socialism to play a mind game with semantics.   They want the horrors of communism because every single one of them thinks in their delusional pride they will be honored as the vanguard, the heroes, the liberators and take total control.  They think they'll be benevolent.  Think is the operative word.  Look at what they're willing to do when they have every basic need met and more - spike trees in forests that kills loggers, throw bricks and stones at cops, praise publicly murderers terrorists and yes, even Satanists.   Abort post birth babies.   Yes, they want this and more because anyone who is willing to excuse and praise shoplifting, rape, murder, fraud and theft now, would be willing to wage a genocide in an actual revolution and this you have to understand, is what they want because they think they'll be good guys doing genocide.  They already defend it and have been for over a century. The way to end Capitalism in their opinion is to destroy  America.  They destroy America by taking away the real fuel of our economy, our Capitalist system - that is, oil, ,gas and coal.  They've literally been trying to do this since the beginning of the 20th century.   They've been trying to do this since the first cars came out and the first stupid ass environmentalist ended up  in a ditch because he was too drunk to stay awake and unlike a horse, the car didn't know to turn to avoid the ditch.   They've wanted this since the buggy whip maker couldn't whip a car to turn on a road and avoid a ditch.   They hate Capitalism because they're numbskulls without talent who can't make a car or a buggwhip.  It's mostly women who don't want to be useful other than for sex.  By Sex here, I don't mean as a wife or a mother, I mean the actual carnal meaningless for profit sex. It says in the Bible when an authoritarian king rules, he sends the sons to die in battle, turns the daughters into whores and the parents die without children in poverty.  Obviously a paraphrase, but I think the meaning is there. permalink parent award report block reply\nChickensaurus 17 points 3 days ago Learn to drill.... permalink award report block reply\nflp999 12 points 3 days ago Now gather up the tens of thousands of miles of very expensive GARBAGE they installed all over this country and dump it in a giant pit. People need jobs? New government program. Train and send thousands of workers out to tear down and dispose of all this shit. permalink award report block reply YT45 10 points 3 days ago Never mind all the acres of forest they bulldozed for their “environmentally-friendly” scam. permalink parent award report block reply thisisatestof2 4 points 3 days ago Exactly. A couple towns away from me, a lot of companies seem to want to dump as much solar in any open field or forest they can find. Today, they have probably bought those a couple hundred acres of what used to be forest or fields that wildlife used to love to pull up solar farms.  You know if it was say, a Walmart that wanted to knock down a forest, the lips will be up in arms. permalink parent award report block reply\nYT45 10 points 3 days ago Never mind all the acres of forest they bulldozed for their “environmentally-friendly” scam. permalink parent award report block reply thisisatestof2 4 points 3 days ago Exactly. A couple towns away from me, a lot of companies seem to want to dump as much solar in any open field or forest they can find. Today, they have probably bought those a couple hundred acres of what used to be forest or fields that wildlife used to love to pull up solar farms.  You know if it was say, a Walmart that wanted to knock down a forest, the lips will be up in arms. permalink parent award report block reply\nthisisatestof2 4 points 3 days ago Exactly. A couple towns away from me, a lot of companies seem to want to dump as much solar in any open field or forest they can find. Today, they have probably bought those a couple hundred acres of what used to be forest or fields that wildlife used to love to pull up solar farms.  You know if it was say, a Walmart that wanted to knock down a forest, the lips will be up in arms. permalink parent award report block reply\nMaxineWaters4Prez 9 points 3 days ago I'm sure the C-suite was paid handsomely with the gubmint subsidies. Golden parachutes on the taxpayer dole. permalink award report block reply\nXlDEN 6 points 3 days ago Cool! Now do ethanol. permalink award report block reply rivetjoint2 7 points 3 days ago Ethanol.  The perfect case study for everything is wrong with government incentives.  Now, even the dumb ass greens admit it was a super bad idea and terrible for the environment.  And now an unstoppible Iowa farm lobby. permalink parent award report block reply Mc_TheDonald_OG 2 points 3 days ago Keep going permalink parent award report block reply\nrivetjoint2 7 points 3 days ago Ethanol.  The perfect case study for everything is wrong with government incentives.  Now, even the dumb ass greens admit it was a super bad idea and terrible for the environment.  And now an unstoppible Iowa farm lobby. permalink parent award report block reply Mc_TheDonald_OG 2 points 3 days ago Keep going permalink parent award report block reply\nMc_TheDonald_OG 2 points 3 days ago Keep going permalink parent award report block reply\nDingleBalls 5 points 3 days ago So called \"renewable\" energy is not sustainable permalink award report block reply\nKolob64 5 points 3 days ago Notice how much damage those \"solar farms\" do to the land.  No sane environmentalist could support this. permalink award report block reply Maganifice7 3 points 3 days ago There are no sane environmentalists. permalink parent award report block reply Kolob64 1 points 3 days ago Bjorn Lomborg gets close permalink parent award report block reply Mungo 2 points 3 days ago Agreed. The panels last an average of just 10 years and cannot be recycled. permalink parent award report block reply Kolob64 1 points 3 days ago Next, what we do with old wind turbines. permalink parent award report block reply Mungo 1 points 3 days ago Good point. Also non recyclable. permalink parent award report block reply Kolob64 2 points 3 days ago And made out of petroleum.  You can't fix stupid. permalink parent award report block reply Johnkimble111 -1 points 3 days ago That’s bullshit, they’re exceeding their projected 25-30 year lifespan, and the panel’s themselves are incredibly reluable. Even when they’re coming towards the end of their lives they’re still generating free power. You’re confusing them with wind turbines. permalink parent award report block reply\nMaganifice7 3 points 3 days ago There are no sane environmentalists. permalink parent award report block reply Kolob64 1 points 3 days ago Bjorn Lomborg gets close permalink parent award report block reply\nKolob64 1 points 3 days ago Bjorn Lomborg gets close permalink parent award report block reply\nMungo 2 points 3 days ago Agreed. The panels last an average of just 10 years and cannot be recycled. permalink parent award report block reply Kolob64 1 points 3 days ago Next, what we do with old wind turbines. permalink parent award report block reply Mungo 1 points 3 days ago Good point. Also non recyclable. permalink parent award report block reply Kolob64 2 points 3 days ago And made out of petroleum.  You can't fix stupid. permalink parent award report block reply Johnkimble111 -1 points 3 days ago That’s bullshit, they’re exceeding their projected 25-30 year lifespan, and the panel’s themselves are incredibly reluable. Even when they’re coming towards the end of their lives they’re still generating free power. You’re confusing them with wind turbines. permalink parent award report block reply\nKolob64 1 points 3 days ago Next, what we do with old wind turbines. permalink parent award report block reply Mungo 1 points 3 days ago Good point. Also non recyclable. permalink parent award report block reply Kolob64 2 points 3 days ago And made out of petroleum.  You can't fix stupid. permalink parent award report block reply\nMungo 1 points 3 days ago Good point. Also non recyclable. permalink parent award report block reply Kolob64 2 points 3 days ago And made out of petroleum.  You can't fix stupid. permalink parent award report block reply\nKolob64 2 points 3 days ago And made out of petroleum.  You can't fix stupid. permalink parent award report block reply\nJohnkimble111 -1 points 3 days ago That’s bullshit, they’re exceeding their projected 25-30 year lifespan, and the panel’s themselves are incredibly reluable. Even when they’re coming towards the end of their lives they’re still generating free power. You’re confusing them with wind turbines. permalink parent award report block reply\nbratt 4 points 3 days ago Hopefully a demo and restore to farmland clause was built into the permits to originally build these eyesores, but of course they didn't so that will be up to whoever wants the land, making it unsalable and worthless, especially wind farms with footings that are hundreds of yards of concrete. EACH permalink award report block reply\nMaganifice7 4 points 3 days ago Look up how many solar companies go out of business every year. Solar is a losing strategy. permalink award report block reply\nkishkan 3 points 3 days ago Just think of all the solar panels and equipment you're going to buy at auction for pennies on the dollar. permalink award report block reply Johnkimble111 1 points 3 days ago Very doubtful. A big cost for a project is installing the supporting brackets, wiring things in place and connecting it to the grid. The cos/value of  installing the stuff is as much as the actual equipment basically. So if you dismantle it you’ve list more than half your investment permalink parent award report block reply kishkan 1 points 3 days ago What are you going on about? I'm talking about solar distributors and manufacturers going bankrupt or selling off their inventory at auction. It happens all of the time. I've seen countless auctions where people are able to make great deals. It happens every few months. https://www.westauction.com/allitems/keyword_solar permalink parent award report block reply Johnkimble111 1 points 3 days ago Sorry, I thought you meant dismantling existing installations permalink parent award report block reply\nJohnkimble111 1 points 3 days ago Very doubtful. A big cost for a project is installing the supporting brackets, wiring things in place and connecting it to the grid. The cos/value of  installing the stuff is as much as the actual equipment basically. So if you dismantle it you’ve list more than half your investment permalink parent award report block reply kishkan 1 points 3 days ago What are you going on about? I'm talking about solar distributors and manufacturers going bankrupt or selling off their inventory at auction. It happens all of the time. I've seen countless auctions where people are able to make great deals. It happens every few months. https://www.westauction.com/allitems/keyword_solar permalink parent award report block reply Johnkimble111 1 points 3 days ago Sorry, I thought you meant dismantling existing installations permalink parent award report block reply\nkishkan 1 points 3 days ago What are you going on about? I'm talking about solar distributors and manufacturers going bankrupt or selling off their inventory at auction. It happens all of the time. I've seen countless auctions where people are able to make great deals. It happens every few months. https://www.westauction.com/allitems/keyword_solar permalink parent award report block reply Johnkimble111 1 points 3 days ago Sorry, I thought you meant dismantling existing installations permalink parent award report block reply\nJohnkimble111 1 points 3 days ago Sorry, I thought you meant dismantling existing installations permalink parent award report block reply\nrivetjoint2 3 points 3 days ago Wait what?  Does this mean that even after fully deployed you can't run a solar farm profitably? permalink award report block reply Johnkimble111 2 points 3 days ago Solar is amazing . Unlike wind it’s more predictable, there’s almost no maintenance and no moving parts. If you mess up a solar farm you’re just an idiot who paid too much for the land. In fact the whole concept of a solar farm is completely retarded. Why waste land when you can simply put the panels on a roof? You could literally take a parking lot in any southern state and put a solar roof on top, ketos people’s cars cooler too. I guess a solar farm might make sense in some desert scrubland with poor quality soil, but that’s about it. permalink parent award report block reply Kolob64 5 points 3 days ago That desert scrubland is very much alive.  A Mesquite tree, for example, can have roots going down 200 feet.  Look at the desert after rain and you will see it come alive.  A new solar farm near where I live in the desert, has disturbed the ecology which now kicks up huge amounts of sand into the wind and lowers quality of life.  If you care about carbon, that scrubland sequesters huge amounts.  The land is covered in critters which only come out at night.  Go on a walk with a backlight and you will see all the life. permalink parent award report block reply Johnkimble111 3 points 3 days ago Agreed, but it’s still less valuable overall than richly fertile soil that could either grow vast amounts of food or support enormous amounts of wildlife, trees etc. In many places they’re putting solar panels on such fertile , they’re literally going to starve us with their insanity. permalink parent award report block reply Kolob64 2 points 3 days ago We are putting houses all over much of our best soil and growing lawns on them.  I am growing food all over my yard.  Why waste water in the desert when I can grow food with that water?  Our desert town used to be agricultural, but grows retirees now.  As for that no agricultural land, destroying the soil prevents what water does land from percolating into the aquifers. If they really cared, the solar would be elevated and crops or livestock would be shaded underneath.  Grazing is essential to rolling back desertification.  I wish environmentalists knew more about the environment as so much of their policies destroy it. permalink parent award report block reply rivetjoint2 3 points 3 days ago I like your parking lot idea. permalink parent award report block reply CommanderOfCheese 3 points 3 days ago Yep. The pavement is just going to get hot and the insides of the cars are going to be scorching and have to use more gas to cool them off anyway. Slap a bunch of panels over the parking lots and you not only collect the energy coming in, you also don't have to spend as much energy getting the heat out. permalink parent award report block reply\nJohnkimble111 2 points 3 days ago Solar is amazing . Unlike wind it’s more predictable, there’s almost no maintenance and no moving parts. If you mess up a solar farm you’re just an idiot who paid too much for the land. In fact the whole concept of a solar farm is completely retarded. Why waste land when you can simply put the panels on a roof? You could literally take a parking lot in any southern state and put a solar roof on top, ketos people’s cars cooler too. I guess a solar farm might make sense in some desert scrubland with poor quality soil, but that’s about it. permalink parent award report block reply Kolob64 5 points 3 days ago That desert scrubland is very much alive.  A Mesquite tree, for example, can have roots going down 200 feet.  Look at the desert after rain and you will see it come alive.  A new solar farm near where I live in the desert, has disturbed the ecology which now kicks up huge amounts of sand into the wind and lowers quality of life.  If you care about carbon, that scrubland sequesters huge amounts.  The land is covered in critters which only come out at night.  Go on a walk with a backlight and you will see all the life. permalink parent award report block reply Johnkimble111 3 points 3 days ago Agreed, but it’s still less valuable overall than richly fertile soil that could either grow vast amounts of food or support enormous amounts of wildlife, trees etc. In many places they’re putting solar panels on such fertile , they’re literally going to starve us with their insanity. permalink parent award report block reply Kolob64 2 points 3 days ago We are putting houses all over much of our best soil and growing lawns on them.  I am growing food all over my yard.  Why waste water in the desert when I can grow food with that water?  Our desert town used to be agricultural, but grows retirees now.  As for that no agricultural land, destroying the soil prevents what water does land from percolating into the aquifers. If they really cared, the solar would be elevated and crops or livestock would be shaded underneath.  Grazing is essential to rolling back desertification.  I wish environmentalists knew more about the environment as so much of their policies destroy it. permalink parent award report block reply rivetjoint2 3 points 3 days ago I like your parking lot idea. permalink parent award report block reply CommanderOfCheese 3 points 3 days ago Yep. The pavement is just going to get hot and the insides of the cars are going to be scorching and have to use more gas to cool them off anyway. Slap a bunch of panels over the parking lots and you not only collect the energy coming in, you also don't have to spend as much energy getting the heat out. permalink parent award report block reply\nKolob64 5 points 3 days ago That desert scrubland is very much alive.  A Mesquite tree, for example, can have roots going down 200 feet.  Look at the desert after rain and you will see it come alive.  A new solar farm near where I live in the desert, has disturbed the ecology which now kicks up huge amounts of sand into the wind and lowers quality of life.  If you care about carbon, that scrubland sequesters huge amounts.  The land is covered in critters which only come out at night.  Go on a walk with a backlight and you will see all the life. permalink parent award report block reply Johnkimble111 3 points 3 days ago Agreed, but it’s still less valuable overall than richly fertile soil that could either grow vast amounts of food or support enormous amounts of wildlife, trees etc. In many places they’re putting solar panels on such fertile , they’re literally going to starve us with their insanity. permalink parent award report block reply Kolob64 2 points 3 days ago We are putting houses all over much of our best soil and growing lawns on them.  I am growing food all over my yard.  Why waste water in the desert when I can grow food with that water?  Our desert town used to be agricultural, but grows retirees now.  As for that no agricultural land, destroying the soil prevents what water does land from percolating into the aquifers. If they really cared, the solar would be elevated and crops or livestock would be shaded underneath.  Grazing is essential to rolling back desertification.  I wish environmentalists knew more about the environment as so much of their policies destroy it. permalink parent award report block reply\nJohnkimble111 3 points 3 days ago Agreed, but it’s still less valuable overall than richly fertile soil that could either grow vast amounts of food or support enormous amounts of wildlife, trees etc. In many places they’re putting solar panels on such fertile , they’re literally going to starve us with their insanity. permalink parent award report block reply Kolob64 2 points 3 days ago We are putting houses all over much of our best soil and growing lawns on them.  I am growing food all over my yard.  Why waste water in the desert when I can grow food with that water?  Our desert town used to be agricultural, but grows retirees now.  As for that no agricultural land, destroying the soil prevents what water does land from percolating into the aquifers. If they really cared, the solar would be elevated and crops or livestock would be shaded underneath.  Grazing is essential to rolling back desertification.  I wish environmentalists knew more about the environment as so much of their policies destroy it. permalink parent award report block reply\nKolob64 2 points 3 days ago We are putting houses all over much of our best soil and growing lawns on them.  I am growing food all over my yard.  Why waste water in the desert when I can grow food with that water?  Our desert town used to be agricultural, but grows retirees now.  As for that no agricultural land, destroying the soil prevents what water does land from percolating into the aquifers. If they really cared, the solar would be elevated and crops or livestock would be shaded underneath.  Grazing is essential to rolling back desertification.  I wish environmentalists knew more about the environment as so much of their policies destroy it. permalink parent award report block reply\nrivetjoint2 3 points 3 days ago I like your parking lot idea. permalink parent award report block reply CommanderOfCheese 3 points 3 days ago Yep. The pavement is just going to get hot and the insides of the cars are going to be scorching and have to use more gas to cool them off anyway. Slap a bunch of panels over the parking lots and you not only collect the energy coming in, you also don't have to spend as much energy getting the heat out. permalink parent award report block reply\nCommanderOfCheese 3 points 3 days ago Yep. The pavement is just going to get hot and the insides of the cars are going to be scorching and have to use more gas to cool them off anyway. Slap a bunch of panels over the parking lots and you not only collect the energy coming in, you also don't have to spend as much energy getting the heat out. permalink parent award report block reply\nMungo 3 points 3 days ago And yet there is an 800 acre new solar farm going in just north of Madison, Wi as I type this…..WTF? permalink award report block reply\nbillybaldwin2 3 points 3 days ago At some point, Panda Energy was the largest clean / green energy company. They closed 8 years ago. They saw the writing on the walls. A lot of the solar farms are just converging a neighboring state's cheap natural gas into \"solar energy.\" When others popped up and undercut their prices, they failed and closed. permalink award report block reply\n1amS3lly 2 points 3 days ago Slimy people tell us renewables are now cheaper than natural gas and coal, and yet as soon as the government terminates the renewable handouts, they fold faster than a Chinese laundromat. permalink award report block reply\nFKH2 2 points 3 days ago Environmental disaster permalink award report block reply\nBoughtByBloomberg2 2 points 3 days ago How the fuck do you go broke with electric prices skyrocketing? permalink award report block reply MehNahMehNah 1 points 3 days ago ROI didn't work out. permalink parent award report block reply\nMehNahMehNah 1 points 3 days ago ROI didn't work out. permalink parent award report block reply\nMehNahMehNah 2 points 3 days ago Guess who's investors are getting screwed? permalink award report block reply\nbooblitchutz 2 points 3 days ago The ENTITE THING has been a scam from day 1. That includes “recycling”. Almost all of it goes into the landfill. The small amount of glass, paper and plastic that does actually get recycled requires more resources than it saves, but it did double your trash bill (not that most people even know there was a time when it cost half of what you’re paying now anyway) and the muni government gets a nice chunk of tax money to subsidize it, a sizable chunk of which goes to the recycling program’s administrative overhead, etc. In the end the Earth is worse off AND our pocketbooks are lighter and democrats get our money. permalink award report block reply\nMega_MAGA 2 points 3 days ago The subsidies were the whole point. Did anyone learn from Solyndra? permalink award report block reply CommanderOfCheese 3 points 3 days ago Solyndra tech was so retarded from the get-go. Solar cylinders to be deployed in places that are mostly cloud cover, using tech that admittedly does collect diffuse light better than the standard tech for collecting direct light does under diffuse light, but more expensive to deploy, in places that will yield less energy. It was a modern business equivalent to watering fields with Brawndo. permalink parent award report block reply Mega_MAGA 1 points 3 days ago It wasn't supposed to work. permalink parent award report block reply\nCommanderOfCheese 3 points 3 days ago Solyndra tech was so retarded from the get-go. Solar cylinders to be deployed in places that are mostly cloud cover, using tech that admittedly does collect diffuse light better than the standard tech for collecting direct light does under diffuse light, but more expensive to deploy, in places that will yield less energy. It was a modern business equivalent to watering fields with Brawndo. permalink parent award report block reply Mega_MAGA 1 points 3 days ago It wasn't supposed to work. permalink parent award report block reply\nMega_MAGA 1 points 3 days ago It wasn't supposed to work. permalink parent award report block reply\nmodded 1 points 3 days ago Solar panels are awesome. Put them on your roof and youll get power for 30 years. permalink award report block reply CommanderOfCheese 4 points 3 days ago Don't know why you're getting down voted. Solar can be a great investment if you have the weather for it. Bunch of reactionary retards. permalink parent award report block reply\nCommanderOfCheese 4 points 3 days ago Don't know why you're getting down voted. Solar can be a great investment if you have the weather for it. Bunch of reactionary retards. permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:48:25.535881Z"
}