{
  "id": "8176332",
  "title": "1482The insidious plot of people having childrenposted4 days agobyZskills362 commentsawardsharedownl",
  "url": "https://patriots.win/p/1ARK57rgG2/the-insidious-plot-of-people-hav/c",
  "content": "1482 The insidious plot of people having children posted 4 days ago by Zskills 362 comments award share download report block\n362 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Iremembermypassword 261 points 4 days ago What is insidious about creating a Whiter America? I can only see upsides. permalink award report block reply Zskills OP 118 points 4 days ago They go on and on about wanting more tax revenue to give to minorities and immigrants.    Well, whites and SE asians are the only net tax paying demographics.  So I don't understand their objection.  They should be happy about increasing numbers of tax cattle. permalink parent award report block reply Awan-CIA-Car-Lot 86 points 4 days ago They also have no problem with brown people having 8 kids. permalink parent award report block reply MySidesGoUp 49 points 4 days ago Kalergi plan taking flight permalink parent award report block reply vongregormench 14 points 4 days ago What's the ultimate goal with this plan? Extinction? Poverty for all? permalink parent award report block reply view 17 more comments... BidenShowerDrool 9 points 4 days ago Dearborn has men that are Islamically married to 4 wives and each of them have 8-10 kids.  Not one of those including the breeding rats will ever work a tax witholding job in their lifetimes. permalink parent award report block reply GatoradeJeb 6 points 4 days ago Its because they want White man replaced and firther humiliated as White woman are brainwashed to racemix with browns permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Yep permalink parent award report block reply Washington_Redskins 7 points 4 days ago To be fair, that's that's only one or two kids per relative in Minnesomalia' permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Lol 😅 permalink parent award report block reply schiff_for_brains 3 points 4 days ago Here.  Have some more food stamps.  Oh wait... permalink parent award report block reply LizardKingx002 3 points 4 days ago In fact, they celebrate it permalink parent award report block reply load 1 more comments... scruffyshoulders 37 points 4 days ago Correction, male whites and asians are the only net tax paying demographics. Females take out more than they put in, they are a net negative the men have to make up for. Basically male whites and asians are the only ones supporting the entire tax system. permalink parent award report block reply Moose_Antlers 3 points 4 days ago I so need a citation for that just to make it into a meme to slap on every entitled AWFL who starts yapping about this! Graphs needed! permalink parent award report block reply scruffyshoulders 9 points 4 days ago Beyond this being common sense, here ya go. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2375926 Easily looked up with a single search. permalink parent award report block reply view 3 more comments... SimaYi 1 points 4 days ago I so need a citation No you don't, Neo. permalink parent award report block reply zooty 2 points 4 days ago Women make babies though so the math is reasonably different. Let's not do the 'working in a gas station is more noble than being a mother' bullshit permalink parent award report block reply GatoradeJeb 5 points 4 days ago Racemixing is abominable. A mudshark/race traitor White woman is worthless scum permalink parent award report block reply view 2 more comments... Hoshi 2 points 4 days ago Why not both? permalink parent award report block reply view 1 more comments... IlhanOmarsFagBrother 1 points 4 days ago Correction, only true if you are white or Asian in the top 50% of earners. If you're in the bottom 50% you are not contributing at all to running this country, even if white or Asian because the bottom 50% contributes nearly 0% of all federal income tax revenue permalink parent award report block reply Retardloserimsogay 10 points 4 days ago They don't want the tax cattle, that was a way of demoralizing us to not have children because in reality they want us dead and this country burned to ash with the ground salted because of what Hitler did or something. permalink parent award report block reply loosemoose 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply xBigCoffinHunter 5 points 4 days ago No shit.  Who pays taxes after we’re gone.  I swear It’s like trying to teach Africans to farm. permalink parent award report block reply Bigdeal 5 points 4 days ago The Whiter it is the less pricious criminals they would have to fawn over. No libtard would be happy without getting mugged and raped. permalink parent award report block reply load 5 more comments... Than0sIII 15 points 4 days ago Because they want America to collapse and be forced to turn into a globohomo blob. permalink parent award report block reply TwoArizonaPedes 8 points 4 days ago Globohomoblob. I think you coined a new word. permalink parent award report block reply Than0sIII 7 points 4 days ago It's a sentiment that's been thrown around.  The whole intent of everything going on in the West right now is to erase national/societal cultures and turn the world into a homogenous gray mass of multicultural \"diversity\" (because ultimately there is no diversity when being forced to serve the machine). permalink parent award report block reply TwoArizonaPedes 6 points 4 days ago I know the concept, I was applauding your addition of \"blob,\" which is perfect as they want everyone to be lacking form, substance, and identity. permalink parent award report block reply Deport_O_Matic 3 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply Deport_O_Matic 2 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply view 1 more comments... Gotmygoose 10 points 4 days ago Well, then, let the insidiousness begin. permalink parent award report block reply TwoArizonaPedes 9 points 4 days ago When I was born the country was something like 85% White. Seemed to be working pretty well. permalink parent award report block reply RizzlieDoodad 4 points 4 days ago It goes against their greatest strength of diversity permalink parent award report block reply load 12 more comments... x79q3pb 105 points 4 days ago some critics Who are these critics and why are they named Berg Witz Mann and Stein? permalink award report block reply MocksFordComma 41 points 4 days ago They’re never named. Polieve (w/e) is a complete Canadian cuck, but he got one thing right: standing there chomping an apple and relentlessly asking: “Who?” permalink parent award report block reply jdemarco2014 32 points 4 days ago Because the Jews aren’t our friends and need to all be loaded up on a plane and shipped directly to Israel permalink parent award report block reply Tiredofstupidpeople -2 points 4 days ago The globalist aligned far left faction driving this kind of thing couldn't give a shit about Israel anymore because they mostly lost control of it starting way back in the 80s. They fund the protests there now trying to collapse the current government, same as they do in the US. Try to keep up with the times. permalink parent award report block reply Easzq8 -3 points 4 days ago And black people, and Arabs, and Indians, and Latinos, and Gypsies, and gays, and trans, and Asians, and long haired Indians, and people who’s name is Sebastian, and people who don’t keep their tires at exactly 36psi, and folks with too many freckles, and Mormons, and folks who can’t remember pi past the tenth digit, and the Yugh and Kerek, and folks who say “pop” instead of “soda,” and and and permalink parent award report block reply solo25 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply TDAF 9 points 4 days ago Experts say permalink parent award report block reply vongregormench 7 points 4 days ago The critics are themselves writing the article, so just read the author's name. permalink parent award report block reply Stolen 4 points 4 days ago MAPS permalink parent award report block reply load 3 more comments... Lady_MaGa 64 points 4 days ago We need to use their own tactic against them.  15 years ago the lefties were screaming about how whites don't like the \"browning of America\" and we were called all sorts of names.  Let's give it back and tell them that they don't like the \"whitening of America\" and call them the same names they called us first.  Then play back their own words if they start to \"reeee\". permalink award report block reply kjj9 72 points 4 days ago Appeal to Decency only works when your opponent is decent.  For example, Ghandi's peaceful revolution in India only could have worked on the British. In the same way, the accusation of \"racism\" only works when the left uses it on the right.  We are decent folks, don't want to think of ourselves as unfair. When we call the left racist, it doesn't work.  They want us dead, our sons mutilated, our wives and daughters raped - because we deserve it .  Why would they care what we think? permalink parent award report block reply 1_Badcop 27 points 4 days ago This is the unfortunate truth. I like u/Lady_MaGa 's sentiment, but  nobody on the left would care. permalink parent award report block reply Lady_MaGa 4 points 4 days ago If a small group found a single one, I think that one would cave with 4 against 1. permalink parent award report block reply makersmarx -3 points 4 days ago Are you literally a retarded person? permalink parent award report block reply view 2 more comments... Dangerous 11 points 4 days ago Even Ghandi understood this, and had said they use nonviolent resistance because that is what they had. And if they had missiles, they would use missiles permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago u/maverick202 is a self-admitted troll (read his post history) who calls people in this community \"incels\" and \"white trash,\" he also believes Joe Biden won the most votes of any President in history lmfao permalink parent award report block reply RachetQueen2020 2 points 4 days ago Sounds like a complete fag probably posting from certain locations. Hopefully, he chokes on a diseased dick and expires. permalink parent award report block reply maverick202 0 points 4 days ago Don't act like you're expert in history if you don't know jack shit. If it was for Ghandi, India would've never been free. There was plenty of violence and blood shed by Indian freedom fighters which made this happen. permalink parent award report block reply RachetQueen2020 1 points 4 days ago So, now they are free to be street shitters, scammers, and rapists. Glass pajeets now. permalink parent award report block reply view 1 more comments... Bigdeal 6 points 4 days ago Racism is just noticing patterns. Racism just keeps ypu safe and there is nothing wrong with it. permalink parent award report block reply SanityGumby 3 points 4 days ago It doesn’t have to work on them. It’s designed to create a backlash to wake normies up to what they are doing permalink parent award report block reply gustodog 2 points 4 days ago We'd be pointing out their hypocrisy and genocidal motivation to the audience, not trying to change the minds of those who want us dead. permalink parent award report block reply load 4 more comments... Dangerous 17 points 4 days ago Disregarding and openly ridiculing them en mass is the correct call. However, the specific turn about accusations won't do much because terms like \"racism\" don't actually apply in reverse: the entire birth of these associated terms and the way of thinking using them was coined by anti white Soviet Communists. When modern college freaks push the \"power + privilege\" line they are closer to the original definition of the terms than normie understanding is. As further proof of this, for the longest time any racism by non-whites towards whites in the US was referred to as \"reverse racism\" by conservative Republicans and literally denied as impossible in the first place by near everyone else. If \"racism\" simply meant \"discrimination based on race\" that way of thinking would not have existed permalink parent award report block reply Megaboom2025 7 points 4 days ago Ridicule is the only way out of this mess. Righteous anger and open hostility will silence the anti-white movement permalink parent award report block reply Viewer01 5 points 4 days ago Neocons have tried for 20 years. They don’t care. These people only respond to two things. Power and the business end of a gun barrel. I’ve said it many times but getting your country back is down a river of blood and a lot of dead minorities. permalink parent award report block reply Tyrone_biggums 3 points 4 days ago Because that always works… the left sets the standards and utterly controls the enforcement of charges of racism, etc. you should realize that by now permalink parent award report block reply Lightning 1 points 4 days ago Yea, but the difference is the leftists will say, ”Damn right I don’t like the whitening of America!” They are very open about their absolute hatred of white people. permalink parent award report block reply load 3 more comments... jsphere256 46 points 4 days ago It's not insidious to want to pass on your own culture and family lineage to the next generation permalink award report block reply Dangerous 30 points 4 days ago For them, it is insidious only if you are white. Reread the headline. Also it would be great if more people would come to recognize the entire point of defeating Germany in WWII was to push notions like this onto western countries in perpetuity, as Germany/Italy/Spain were the only white nations with civil leadership opposed to these ideas at the time permalink parent award report block reply anishr -18 points 4 days ago That’s not insidious yes. What’s insidious is - whites routinely meddle with other countries while being condescending towards other cultures. 750+ military bases worldwide is insidious. permalink parent award report block reply PensivePatriot 11 points 4 days ago Kill yourself. permalink parent award report block reply anishr -6 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Americansupremacist0 5 points 4 days ago “European shitholes…. Muzzie masters” interesting how you admit Europe is a shithole thanks to muzzies. So you are in complete agreement with all those mean whiteys. What’s the matter kid, you wanna be adopted by whites so your life isn’t so pathetic and miserable? permalink parent award report block reply view 3 more comments... mlp67 2 points 4 days ago You've just been creeping on this site for 5 years waiting to spew anti-White nonsense.  You sound jealous. permalink parent award report block reply view 3 more comments... covok48 4 points 4 days ago Poojeet permalink parent award report block reply DudeNoOne 42 points 4 days ago I’m doing my part permalink award report block reply CommanderOfCheese 27 points 4 days ago 6 so far! permalink parent award report block reply DudeNoOne 18 points 4 days ago 4 under 4 so im good for a bit permalink parent award report block reply CommanderOfCheese 7 points 4 days ago Yeah I spread mine out 2 years apart. permalink parent award report block reply mlp67 1 points 4 days ago You live in crazy town! Good for you! I wished I'd had more. God Bless permalink parent award report block reply DudeNoOne 2 points 4 days ago Send prayers. This house needs them regularly. permalink parent award report block reply view 2 more comments... AliceCooperBiden 10 points 4 days ago We have 5 at 30. We’ll make more but we need a minute lol permalink parent award report block reply Get_Off_Big_Tech 3 points 4 days ago Winning. permalink parent award report block reply AliceCooperBiden 2 points 3 days ago I wouldn’t trade it for anything. permalink parent award report block reply Awan-CIA-Car-Lot 8 points 4 days ago 👍 permalink parent award report block reply Get_Off_Big_Tech 2 points 4 days ago Hero. permalink parent award report block reply CommanderOfCheese 4 points 4 days ago Not as big as my parents or my older sister. permalink parent award report block reply MasterChief 10 points 4 days ago good job permalink parent award report block reply vongregormench 4 points 4 days ago I sadly failed, but I at least have one child and who knows how many kids she will have. permalink parent award report block reply Area82 33 points 4 days ago We had a whiter, more Christian America before.  It was demonstrably better.  What’s wrong with going back to that? permalink award report block reply ninabobby 11 points 4 days ago No no, don't you know that America never achieved anything until it was flooded with all the H1B geniuses. permalink parent award report block reply Dangerous 8 points 4 days ago Even if it somehow wasn't \"better\" everything we have and worked to create that these people value so much was made in that era too permalink parent award report block reply GatoradeJeb 2 points 4 days ago Because thry want White man dead and White woman mudsharking permalink parent award report block reply JanOctSept 27 points 4 days ago Is this an actual joke? Is this real? I guarantee who ever wrote this used to be a mod on the antinatalism subreddit permalink award report block reply monkadelic 11 points 4 days ago This is the first I'm hearing this word casually used like its just a thing.  Its so stupid, its almost hard believe its anything but rage bait. permalink parent award report block reply Zskills OP 10 points 4 days ago Yes, it is real.  I searched the article before posting. permalink parent award report block reply Megaboom2025 9 points 4 days ago (((Check the early life))) permalink parent award report block reply Dangerous 5 points 4 days ago Why would they need to be a mod on some backwater corner of the internet? Anti Natalism is just a natural part of leftism and has been since the French Revolution over 200 years ago permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago The Fabian socialists are still going strong, and apparently Madami is connected to them. permalink parent award report block reply OrangeApple 3 points 4 days ago The Econmist X post was edited to word it differently now due to the backlash. permalink parent award report block reply load 2 more comments... USPatriot45 24 points 4 days ago the insidious plot of WHITE PEOPLE having children, SPECIFICALLY. permalink award report block reply TrumpAndGodWin 6 points 4 days ago Whites are a world minority at only seven percent of the population. Whites are also the most capable of defeating the evil globalists which is why we're being attacked so much. permalink parent award report block reply Female 23 points 4 days ago I see The Economist hired the impossible1 permalink award report block reply Dangerous 11 points 4 days ago Kek permalink parent award report block reply GodSaveTheWest 3 points 4 days ago I think hes against women existing in general, not just white ones. permalink parent award report block reply GatoradeJeb 2 points 4 days ago Nah imp is retarded but not this retarded permalink parent award report block reply covok48 1 points 4 days ago Damn, LOL. And the editor was Antisimp. permalink parent award report block reply SanityGumby 17 points 4 days ago What is insidious about white people. We literally invented everything in the world permalink award report block reply ninabobby 9 points 4 days ago They don't want inventors, they want slaves. permalink parent award report block reply GatoradeJeb 3 points 4 days ago The left hates White man permalink parent award report block reply bearhugprolapse 16 points 4 days ago as a former white baby, this sounds to me like the economist is all eat up with the colic. permalink award report block reply Hikedelics 16 points 4 days ago They fucking hate you and the fact that you and your kind have the audacity to still exist in the country your forefathers created. We cannot coexist with these people. One way or another one side is going to go away, and it would be about the gayest thing to ever happen in the history of the world if we were to let them win. permalink award report block reply n3IVI0 15 points 4 days ago But we DO want a whiter America. permalink award report block reply Psarg 15 points 4 days ago You not going extinct is evil. permalink award report block reply SHILL_DETECTOR 15 points 4 days ago was it an insidious project to flood the country with shitskins? permalink award report block reply Hanging_Chad 5 points 4 days ago yeah permalink parent award report block reply HellNoKameltoe 14 points 4 days ago The first thing America needs is to become Whiter. permalink award report block reply riceball99 14 points 4 days ago This is possibly the most evil, satanic headline I’ve ever seen. permalink award report block reply altYPNeT 13 points 4 days ago Jewish hands wrote that headline. permalink award report block reply MakeAmericaRichAgain 12 points 4 days ago It's only insidious when white people have their own children. This is evidenced by the tens of millions of non-white children who are subsidized by taxpayers every year. Can't afford your own kids, but you have to pay for everyone else's. Sounds fair. permalink award report block reply stingyarthropods 12 points 4 days ago i want a white only america at this point permalink award report block reply covok48 4 points 4 days ago Me too bro, me too. permalink parent award report block reply slimcoat 10 points 4 days ago They're becoming more and more open about their hatred of white people. permalink award report block reply Trumpwon306 9 points 4 days ago Written by a jew. permalink award report block reply Americansupremacist0 6 points 4 days ago Every. Single. Fucking. Time. permalink parent award report block reply onesummerdream 9 points 4 days ago My daughter & sil were just talking last night on what the best timing would be to go for their third. Currently at 2yo & 5mo. permalink award report block reply MAGAnic316 1 points 4 days ago We have 2 girls and a boy, all roughly 2 years apart from each other. It seems to be a good way to spread it. It was more or less the same with me and my siblings growing up. My wife is 11 years younger than her sister, so she was basically an only child for most of her childhood permalink parent award report block reply booblitchutz 1 points 4 days ago How can your daughter and sister-in-law have a baby? permalink parent award report block reply Aquamine-Amarine 2 points 4 days ago Son-in-law. permalink parent award report block reply onesummerdream 1 points 4 days ago 👍✌️ permalink parent award report block reply onesummerdream 1 points 4 days ago Science? permalink parent award report block reply vongregormench 9 points 4 days ago The fact that it's even acceptable to say that making America whiter is \"insidious\" shows how far racism against whites has come. Yeah I want America whiter. Fuck you. permalink award report block reply GatoradeJeb 4 points 4 days ago Its genocide. White man are demonized and attacked while White woman are brainwashed to mudshark permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago Stage eight on the ten stages of genocide. permalink parent award report block reply Dirk_Diggler 8 points 4 days ago \"Pro-natalist\"?  What a crazy term for a default position of any species.  The term also presupposes an \"anti-natalism\" position, which there is nothing natural at all about and sound like a pretty evil position to occupy. These people are fucking nuts. permalink award report block reply TrumpAndGodWin 4 points 4 days ago Evil wants to destroy and whites stand in their way. permalink parent award report block reply covok48 2 points 4 days ago They aren’t nuts. They hate you. permalink parent award report block reply Datamancer 7 points 4 days ago I actually enjoyed reading The Economist .... 25 years ago.  Fucking fuck. permalink award report block reply covok48 3 points 4 days ago It was trash then, you just weren’t as conservative. permalink parent award report block reply VienneseSunrise 2 points 4 days ago So many boomers will never be able to grasp the total monopoly they held on media. It was a case of not being able to see the forest for the trees. They basically exist in the Matrix. permalink parent award report block reply Ch3f4554551n 7 points 4 days ago Pro-natalist? This is a hair away from \"pro-existence.\" permalink award report block reply Bigdeal 7 points 4 days ago Yes, White please. This country is better the Whiter it is. Diversity truly is a weakness when it comes to human civilization. permalink award report block reply TrancePhreak 6 points 4 days ago Have 3+ kids or you're just at replacement levels. Don't hit it and quit it, keep it in if you want to win! permalink award report block reply Zskills OP 5 points 4 days ago Marry, be fruitful, and multiply permalink parent award report block reply AngeredKabar 6 points 4 days ago There's an insidious plot alright. But it's not this. permalink award report block reply Roadpower 6 points 4 days ago Wow, talk about taking off the mask. permalink award report block reply Mintap 5 points 4 days ago Call them procreationists if you have to. They are the people who have created every Civilization. Don't be retarded and use some slur like pro-natalist. The anti-natalists (pro-sterilists) are the only people who have destroyed Civilizations. They are faggots and retards, and literally retard all of humanity. permalink award report block reply mailinvoter 5 points 4 days ago No minority should be shamed into self deletion. Damn, the media is racist. For those that only follow the herd, Whites are the minority of the world. permalink award report block reply SurferOnTheRhye 5 points 4 days ago It's in the complement of that headline that the truth is hiding in plain sight. If pro-natalism creates a whiter america, it logically follows that the anti-natalism they've been pushing for half a century creates a ... permalink award report block reply Zskills OP 1 points 4 days ago Chilling insight permalink parent award report block reply Gfloydvotestrump 5 points 4 days ago I have never met another person IRL who is \"proud\" to be child-free that wasn't a complete fucking loser in just about all aspects of their life. permalink award report block reply zooty 2 points 4 days ago I'm my 50s and watching my permanently childless friends start to wonder. Great vacation pics though. permalink parent award report block reply TwoWords 5 points 4 days ago Rothschild slop permalink award report block reply JohnMiller2020 5 points 4 days ago Pro natalists.... You mean normal fucking human beings?? The 95% of all people?? permalink award report block reply DeepStateParasite 5 points 4 days ago (((God forbid white Americans have children. How insidious!))) permalink award report block reply Ice_Joker 5 points 4 days ago Have more babies. This is your sign. permalink award report block reply terribletwos 5 points 4 days ago They build these articles backwards. They start with their goal, in this case is to make a less white America, and then they frame the articles to get to their goaled premise. So that's why these stories are always nonsensical if you read them forward, but if assume that they're not real articles but just shitty propaganda instead. The logical flow snaps right into place. permalink award report block reply 1DontTreadOnMe1 5 points 4 days ago The more white people there are the better the world gets. The opposite is also true. permalink award report block reply GodSaveTheWest 5 points 4 days ago Basically outright saying they want white people replaced by migrants. permalink award report block reply RockyBalboa 5 points 4 days ago Anytime I see a movie that romanticizes any period in American culture, it is usually in the 1950's (+ or - ten years) and populated with white society and white culture. Seems like the whiter American society is, the more likely it will be depicted as the ideal time and ideal place to be in tv, movies, and novels. Am I wrong? permalink award report block reply TrumpAndGodWin 6 points 4 days ago In the 1950s middle class Americans had over fifty percent of the world's wealth (at only four percent of the world's population). permalink parent award report block reply Backslash2099 4 points 4 days ago The left: \"The birthrate is to low, we need to import people\" White people: \"ok we'll increase the birthrate by having more babies\" The left: \"no not more white people having babies!!!111\" permalink award report block reply utfanx2 4 points 4 days ago Boom baby boom! permalink award report block reply call-it-like-i-sees 4 points 4 days ago It's a plot to create a more American America. permalink award report block reply Hikedelics 4 points 4 days ago sets down coffee “I should make another kid..” permalink award report block reply freedom2520 4 points 4 days ago You don't hate the media enough permalink award report block reply Tacticalsmoke420 4 points 4 days ago My wife is pregnant and we are having a baby! permalink award report block reply ingrowntoenail 4 points 4 days ago About 7 years ago when my daughter got pregnant again I told her thanks for increasing the white population.  She already had 4 with a set of twins from the second pregnancy.  She didn't like that comment and I knew she wouldn't because she's the type that hangs a black lives matter sign.  I heard her husband laugh in the background.  He's from Australia and hates the blacks and aborigines there. permalink award report block reply current_horror 3 points 4 days ago A based Australian son-in-law sounds like hitting the jackpot. permalink parent award report block reply Klown_Kutz 4 points 4 days ago Bet I nose who wrote this! permalink award report block reply JoeBidensDementia1 4 points 4 days ago 1 Muslim will have 4 or 5 wives with 20 kids. These \"journalists\" don't have a problem with Muslim nations remaining such while overpopulating all others. permalink award report block reply PensivePatriot 4 points 4 days ago Imagine calling the biological imperative “pro natalism”. This is literally a death cult. permalink award report block reply TwoArizonaPedes 4 points 4 days ago HAHAHA those little MAGA hats! permalink award report block reply Desktop 4 points 4 days ago MAWA! permalink award report block reply Nanteen 3 points 4 days ago 4 kids here. I'm doing my part https://share.google/images/wJZrSD0wrj0dBl1fy permalink award report block reply Moose_Antlers 3 points 4 days ago I wish these racists would get called out when they dog whistle like that. Just say it, creeps. You hate white people and prefer literally anyone else. permalink award report block reply Smurfection 3 points 4 days ago White Man Bad.   - TheNews™ permalink award report block reply 4886Battery 3 points 4 days ago This is very true.  I know that when my wife and I first started to consider having a child one of our biggest pros involved making America more White.  It worked so well with the first child that we decided to make America more White five more times!  6x more Whitess than we were pre-kids! permalink award report block reply thelastlast 3 points 4 days ago i know this is ragebait but i still must know the authors early life permalink award report block reply DiamondDroid 3 points 4 days ago Damn straight! We have too many non- contributors already. Eat bacon or leave. permalink award report block reply SavingPrivateGrace 3 points 4 days ago Whatever pro abortion journalists write it's twisted.  Don't even link the article, please. permalink award report block reply Keiichi81 3 points 4 days ago White people breeding?! HOW INSIDIOUS! permalink award report block reply hoodar 3 points 4 days ago White people, start boning other white people. Trust the plan. permalink award report block reply RyanKeyOh 3 points 4 days ago Creating a darker America = Progress Creating a whiter america = Nazism permalink award report block reply delnaga 3 points 4 days ago Do it! Let’s get the baby train going. We need to all be having 10 kids. permalink award report block reply GuerillaYourDreams 3 points 4 days ago Insidious Whiteness sounds like a good name for a thrash metal band! permalink award report block reply Bidensmellslikepiss 3 points 4 days ago Tacit admission that brownifying America is their goal. permalink award report block reply Kamalaharrisisacunt 3 points 4 days ago I am all for a Whiter America. Convservative White Americans. Commies of every color can take a long walk off a short pier. permalink award report block reply journalist 3 points 4 days ago The whiter the better. permalink award report block reply JohnyBlaze99 2 points 4 days ago We did our part lol permalink award report block reply ParticleCannon 2 points 4 days ago White Natalism strikes again! permalink award report block reply FromTheTopRope 2 points 4 days ago Pronatalism includes welfare queens. I accept your downvotes. permalink award report block reply Female 9 points 4 days ago 3 Lo, children are an heritage of the LORD: and the fruit of the womb is his reward. 4 As arrows are in the hand of a mighty man; so are children of the youth. 5 Happy is the man that hath his quiver full of them: they shall not be ashamed, but they shall speak with the enemies in the gate. Psalms 127 KJV permalink parent award report block reply CommanderOfCheese 8 points 4 days ago You'd be shocked at how much the Bible ties \"blessedness\" with fertility. permalink parent award report block reply Dangerous 3 points 4 days ago All normal humans do. I'm sure even the baby killing Aztecs did permalink parent award report block reply CommanderOfCheese 4 points 4 days ago Interesting to see how it impacts society when they don't value fertility. Apparently some time in early history there was a plant that worked as birth control. When humans discovered it (this was prior to the development of agriculture) they used it to the plant's extinction. According to the Book of Jasher (take it how you will) before the Flood the culture was such that the women would drink a draught that would render them infertile so they wouldn't lose their beauty, and Enoch and his followers were among the last still having children. Altogether the picture is so horrible that no wonder wiping out literally everyone was deemed the only solution by God. I'm not against birth control as a whole, but I emphasize that it should be birth control and not permanent birth prevention. permalink parent award report block reply view 2 more comments... current_horror 1 points 4 days ago The welfare queens exist regardless of whether or not we encourage child birth lol permalink parent award report block reply RememberCharlieKirk 2 points 4 days ago Link: https://xcancel.com/TheEconomist/status/1986831038576841202 permalink award report block reply JesusTheOnlyWay 2 points 4 days ago They hate whites because their father (the Devil) told them to hate whites. They are fools being used to accomplish Satan's plans permalink award report block reply Easzq8 2 points 4 days ago “White people are the Original Sin of Peoplekind ™️. Once they have all been purged we shall know intersectional heaven on Earth.” permalink award report block reply hey_spike 2 points 4 days ago The label \"Pro-natalism\" makes making babies seem like a political act. permalink award report block reply hey_spike 2 points 4 days ago Single white male seeks pro-natalist white female who can cook. permalink award report block reply SickOfNeoPolitics 2 points 3 days ago Yeah sure people carrying on and reproducing as normal is an \"insidious project\" fine. But then what pray tell is the UN replacement migration plan? permalink award report block reply AwareandNonCompliant 2 points 4 days ago Please tell me this is the Bee 🙄 permalink award report block reply FretNoise14 2 points 4 days ago Makes me want to reverse my vasectomy permalink award report block reply blue5707 2 points 4 days ago Do it more... permalink award report block reply monkadelic 2 points 4 days ago If the author of this article is white, they should help the \"problem\" by jumping off a cliff.  Its reverse-natal-ism.  I coined it first, but you guys can use it. permalink award report block reply elpoePehTeW 2 points 4 days ago My wife and I are doing our part! Child #6 was born this year! permalink award report block reply Nellie_the_Beaut 2 points 4 days ago Excellent job! Congratulations on your fruitful household! permalink parent award report block reply Greenblatts_4skin 2 points 4 days ago they hate white people. permalink award report block reply Stolen 2 points 4 days ago The shit that faux intellectuals come up with . Always racism, misogyny, pronatalism,  and xenophobia.  JD only has half whiter kids. The Economist can blow it out of their ass on this one. permalink award report block reply Dereliction 2 points 4 days ago Insidious! permalink award report block reply Zippythekid 2 points 4 days ago Yes that is exactly why permalink award report block reply Nipplebuddy 2 points 4 days ago Be fruitful and multiply permalink award report block reply spezisacuckold 2 points 4 days ago That's exactly the goal only a racist would be against that permalink award report block reply GreyKnight 2 points 4 days ago So…well…how am I to infer anything other than an internationalist, pro-immigration, anti-white bias from this title…? permalink award report block reply CANATIVE 2 points 4 days ago Make America 1950 again permalink award report block reply griff 2 points 4 days ago In response to the insidious LONG RUNNING ACTIONS to create a non-white America. They can fuck right off. permalink award report block reply ApplyingForce 2 points 4 days ago Pure. Evil. permalink award report block reply Mike_Hoxbigg 2 points 4 days ago \"A Whiter America\" -- ideally! permalink award report block reply Markosis17 2 points 4 days ago The whiter the better. I guess that makes me a white supremacist. And I don’t give a fuck anymore. permalink award report block reply bh506407 2 points 4 days ago Oh no a nation founded by white people are having babies in their own country, how insidious indeed. Fuck off, “some critics.” permalink award report block reply Desensitized 2 points 4 days ago If our punishment for being white is not having children, why is not having children celebrated among their elite? permalink award report block reply TheAttackTitan 2 points 4 days ago Mask off permalink award report block reply I_Love_45-70_Gov 2 points 4 days ago Yes. permalink award report block reply wmmiv2016v2 2 points 4 days ago Gay, NAtional ZIonist propaganda. permalink award report block reply newuser8 2 points 4 days ago Holy shit do they hate us. permalink award report block reply ConfusedAngryArmed 2 points 4 days ago (((Some critics))) permalink award report block reply 5DchessWatch 2 points 4 days ago CLAP CLAP CLAP Very well done, deepstate you've made the very act of white people having children, racist permalink award report block reply BrewSwillis 1 points 4 days ago \"Breeding your way into power is only ok when black and brown people do it, you guys!!¡!\" permalink award report block reply semsem 1 points 4 days ago With Obama and Biden in power, many pro-immigrationists believe this is the moment to jump-start anchor-baby-making. But some critics see pro-immigrationism as a part of an insidious project to create a browner America permalink award report block reply Stallionstyle 1 points 4 days ago Cards revealed. Blame others of what you are guilty of. Alinsky playbook confirmed. The insidious plot is the Great Replacement. permalink award report block reply The_Morrow_Outlander 1 points 4 days ago And why would a BLACKER, YELLOWER or BROWNER America be better? Let competent, willing people who can afford it have kids. If you  have a problem with the fact that most of those people are white, devote YOUR OWN life and resources to not only lifting, but teaching non-whites how to STAY up on their own. NOT to trying to stop people who are happy and fit to become parents from starting families. permalink award report block reply conservatarian 1 points 4 days ago Checks \"Early Life\" permalink award report block reply Brownwaterboys 1 points 4 days ago What's wrong with a whiter America? permalink award report block reply JackLemon 1 points 4 days ago Written by Barclay Bram, hmmm https://x.com/NwrdScissrhands/status/1986914060651405421 permalink award report block reply SimaYi 1 points 4 days ago They hate you, want you dead and your children raped, and they think it's funny. White supremacist yet? permalink award report block reply Lulzokbro 1 points 4 days ago Whites are too expensive and too hard to control, they have to go permalink award report block reply Forty_Five 1 points 4 days ago There is no chance for reconciliation at the point. permalink award report block reply EvensoAmen 1 points 4 days ago MAWA? permalink award report block reply billybaldwin2 1 points 4 days ago Just saw some news piece about how 6 flight nurses on the same floor of a hospital are all 8 months pregnant. Wow crazy. What was so good all 6 would just get pregnant? https://www.msn.com/en-us/health/other/6-university-of-chicago-flight-nurses-become-pregnant-at-same-time/ar-AA1Q0eyo permalink award report block reply JackOfAllTirades 1 points 4 days ago Guilty as charged. permalink award report block reply Paralax 1 points 4 days ago Any less White and we are a failed state… permalink award report block reply billybaldwin2 1 points 4 days ago You can't stop my brother Alec from being white with his Latina bride and having 8 kids. Take that! permalink award report block reply Grindelwald 1 points 4 days ago And what is wrong with that? The left has their abortion rights, their single mother rights, their cat lady rights, their lesbian rights, etc.  none of which promotes children, families and actual procreation.  So someone has to do it. permalink award report block reply SmokeyAF 1 points 4 days ago Joyous news, planning our first grandpede !\n🇺🇸🫡💪🙏. permalink award report block reply Gnometard 1 points 4 days ago White women vote for democrats, you'd have to be a retard to support white because white. Hell, Biden is white! permalink award report block reply phro 1 points 4 days ago If the Kalergi plan is a racist conspiracy theory than so is the inverse-Kalergi plan. permalink award report block reply Trajano 1 points 4 days ago They really want to exterminate humanity. Who, besides a deranged lunatic, would use the term \"pro-natalism\"? permalink award report block reply BooKoo 1 points 4 days ago I think couples should be able to afford groceries for themselves before bringing a baby into the equation permalink award report block reply monkadelic 7 points 4 days ago Babies are cheap.  If you wait to afford kids you'll never have them.  While I agree with the sentiment, certain demographics don't give a shit, so white people shouldn't either. permalink parent award report block reply BooKoo -1 points 4 days ago \"Babies are cheap\" bro get the fuck outta here, I'm not even going to dignify that statement 😂 It's irresponsible to bring children into a life when you can't even afford to cover your own needs.  Fix the economy and I guarantee people will start pushing those puppies out by the dozens again. permalink parent award report block reply current_horror 9 points 4 days ago No. Blaming the economy is a bullshit excuse for selfish hedonists who prioritize themselves over their culture, their people, and their nation. 99% of humans were born into poverty we can’t even imagine. The poorest people in the world today have the most children. It’s not about “the economy”. Collapsing birth rates are almost entirely correlated with women spending 75% of their fertility window in school, at work, or “finding themselves”. Feminism is the most destructive ideology in history. permalink parent award report block reply BooKoo 0 points 4 days ago \"99% of humans were born into poverty we can’t even imagine.\" yeah dipshit.  that's not a good thing.  And it's not fair to the child you claim to care so much about.  People aren't cattle who are put here on this Earth just to breed. Society has progressed despite your weird Christian Nationalist beliefs. you want to have 12 kids and live in a trailer park then have at it hoss.  It's a free country.  Just remember, don't blame everyone else when your poor decisions come back to bite you AND your poor ass kids in the ass. permalink parent award report block reply view 1 more comments... newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply benjovikenobi 1 points 4 days ago What an odd way to say that white people are the only demographic not having as many babies as possible. permalink award report block reply least_counties_ever 1 points 4 days ago The word \"insidious\" in this context reveals the author to be pure evil. permalink award report block reply FrankWisner 1 points 4 days ago No Link = You eat cocks after 5pm: every day. You need some link skills, retard. permalink award report block reply Zskills OP 1 points 4 days ago https://www.economist.com/1843/2025/11/06/make-america-procreate-again-among-the-maga-fertility-fanatics You have about as good of manners as my toddler. permalink parent award report block reply FrankWisner 2 points 4 days ago Raise us well, Sir. permalink parent award report block reply Spermythecat 1 points 4 days ago Is this a bee article? permalink award report block reply Zskills OP 1 points 4 days ago https://www.economist.com/1843/2025/11/06/make-america-procreate-again-among-the-maga-fertility-fanatics permalink parent award report block reply InfinitesimalOrange 1 points 4 days ago Whoever wrote this is so racist if they got beaten to death in front of me I'd laugh in their face as they died. permalink award report block reply HeavyMetalPatriot 1 points 4 days ago The natalists need to figure out WHAT their White children are going to do in life in the age of AI and automation. If you haven't heard about Agentic AI, I highly recommend looking it up. It's the power to nuke 70% of jobs and nobody in power is talking about what to do with these 100M unemployed people. permalink award report block reply donteatthat 1 points 4 days ago I WANT A WHITER AMERICA permalink award report block reply sir_rockness 1 points 4 days ago I wish I could pump some young nubile hotties and make a whiter America but I'm older and married.   Seems fun though permalink award report block reply redditadminssuckit 1 points 4 days ago Yes.  Whiter is righter permalink award report block reply brewser724 1 points 4 days ago Yes, so? permalink award report block reply lolpaladins 1 points 4 days ago Those crazy \"pro-natalist\" policies like... affordable housing? living wage? fuck the anti-human death cult. permalink award report block reply Formerlurker92 1 points 4 days ago If Ilook at this person's early life section, what am I gonna find? permalink award report block reply RoosterRaiser 1 points 4 days ago I just can't with these people. SMH permalink award report block reply Tacitus1963 1 points 4 days ago The whole point of flooding traditionally white and Christian countries with 3rd worlders like the Muslims, Indians, etc. is that over time through miscegenation, the white population will be bred out. As it stands, whites are only 8% of the world's population.\nIn Denmark, there are now advertisements that whites mating with whites is inbreeding that they should be mating with the new \"diversity.\"\nThis was always part of the Kalergi Plan which has been applied on steroids to the US, Canada, Australia, New Zealand and Europe. The only countries not experiencing  this are Poland and Hungary which don't allow the filth in.\nCheck what Barbara Lerner Spectre has to say about Europe.\nThese are the same people behind the invasion of all the above countries. permalink award report block reply RyanKeyOh 1 points 4 days ago Anyone have that original image? It’s excellent permalink award report block reply dillster 1 points 4 days ago dumbasses.  whites are only 7-8 percent of the global population so stop the grade school bullying.   economist is racist. permalink award report block reply SuperHonkey 1 points 4 days ago You damn rite! permalink award report block reply barwhack 1 points 4 days ago Demographics rule. If you want a West, that is formed - historically - by the minority White population. If you want a Middle East, that is formed - historically - by a brown population among many brown populations, together comprising the majority. If you want an East, that is formed - historically - by a large yellow population, who are really just light brown. If you want gay faggotry, you mix all that up and take the worst of each, and call it rainbow. 👨🏿‍❤️‍👨🏿 Multiculturalism is subtractive color mixing; pun intended . And depriving Whites of nationhood, of homeland, and of family ... is evil. MO for leftism, though. permalink award report block reply Seeker_17 1 points 4 days ago Whiter = better permalink award report block reply pattrn 1 points 4 days ago Implication here is that MAGA is a white movement. It’s not. It’s a pro-America movement. permalink award report block reply gustodog 1 points 4 days ago Further confirmation of The Great Replacement. permalink award report block reply lul_cheto 1 points 4 days ago they on to us boys. permalink award report block reply lul_cheto 1 points 4 days ago They on to us.. Fuentes has it wrong.. well never get them all out, best we can do is dilute and breed out.. Do your part.. drop a white baby in an invader 🫡 permalink award report block reply Americansupremacist0 1 points 4 days ago Faggot. permalink parent award report block reply lul_cheto 1 points 4 days ago Great plan, tell me more permalink parent award report block reply Americansupremacist0 2 points 4 days ago Make more white babies, pretty simple stuff. permalink parent award report block reply DangerousAmerican76 1 points 4 days ago Fuck yes make more white babies! permalink award report block reply GhostOfTheRepublic 1 points 4 days ago A whiter America.  Sounds good permalink award report block reply Redeemable 1 points 4 days ago Why shouldn't America rreturn to it's 95% White status. permalink award report block reply homertone 1 points 4 days ago The headline is not wrong it just isn't headline worthy. permalink award report block reply Dem_slayer 1 points 4 days ago And? permalink award report block reply Seeker_17 1 points 4 days ago FUN FACT: The percentage of Whites increased since Trump started to deport. At the current rate, we will be back up to 75% by the time he's done. Add to that higher White fertility rates, mostly from conservatives. The Amish and other anabaptist groups will help too. permalink award report block reply WeaponizedSmirk 1 points 3 days ago Not surprised when I found out a gay Jewish man wrote this. Are you fucking noticing yet? permalink award report block reply Liberats 1 points 4 days ago It is. It should be. permalink award report block reply goatnuts 0 points 4 days ago My pro natalist wife is only half white. We are making america better, more decent, more educated, one baby at a time, but also I'm introducing admixture of an also noble people. You can strengthen america with a little of that, all noble peoples had a little, you just have to be selective of which people you allow into your nation. And usually you want them to be women that marry in. Obese dregs washing up on the shore of the Rio grande ain't it. Self respecting people who's goal is to become american in every conceivable way are the only kind of immigrants I like, and also in manageable numbers. permalink award report block reply snorkle 0 points 4 days ago They behave permalink award report block reply DagneyTaggart -7 points 4 days ago The Economist transitioned to a leftist rag in the mid ‘oughts. About the same time WSJ sold itself out to Murdoch. permalink award report block reply MAGABOND 6 points 4 days ago Comment removed by community moderators. permalink award report block reply TheGoyimWhisperer 2 points 4 days ago Comment removed upon the user being banned. permalink award report block reply 1_Badcop -1 points 4 days ago Updooted for the username permalink parent award report block reply loosemoose 1 points 4 days ago Comment removed by community filter, pending further review. permalink award report block reply\nIremembermypassword 261 points 4 days ago What is insidious about creating a Whiter America? I can only see upsides. permalink award report block reply Zskills OP 118 points 4 days ago They go on and on about wanting more tax revenue to give to minorities and immigrants.    Well, whites and SE asians are the only net tax paying demographics.  So I don't understand their objection.  They should be happy about increasing numbers of tax cattle. permalink parent award report block reply Awan-CIA-Car-Lot 86 points 4 days ago They also have no problem with brown people having 8 kids. permalink parent award report block reply MySidesGoUp 49 points 4 days ago Kalergi plan taking flight permalink parent award report block reply vongregormench 14 points 4 days ago What's the ultimate goal with this plan? Extinction? Poverty for all? permalink parent award report block reply view 17 more comments... BidenShowerDrool 9 points 4 days ago Dearborn has men that are Islamically married to 4 wives and each of them have 8-10 kids.  Not one of those including the breeding rats will ever work a tax witholding job in their lifetimes. permalink parent award report block reply GatoradeJeb 6 points 4 days ago Its because they want White man replaced and firther humiliated as White woman are brainwashed to racemix with browns permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Yep permalink parent award report block reply Washington_Redskins 7 points 4 days ago To be fair, that's that's only one or two kids per relative in Minnesomalia' permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Lol 😅 permalink parent award report block reply schiff_for_brains 3 points 4 days ago Here.  Have some more food stamps.  Oh wait... permalink parent award report block reply LizardKingx002 3 points 4 days ago In fact, they celebrate it permalink parent award report block reply load 1 more comments... scruffyshoulders 37 points 4 days ago Correction, male whites and asians are the only net tax paying demographics. Females take out more than they put in, they are a net negative the men have to make up for. Basically male whites and asians are the only ones supporting the entire tax system. permalink parent award report block reply Moose_Antlers 3 points 4 days ago I so need a citation for that just to make it into a meme to slap on every entitled AWFL who starts yapping about this! Graphs needed! permalink parent award report block reply scruffyshoulders 9 points 4 days ago Beyond this being common sense, here ya go. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2375926 Easily looked up with a single search. permalink parent award report block reply view 3 more comments... SimaYi 1 points 4 days ago I so need a citation No you don't, Neo. permalink parent award report block reply zooty 2 points 4 days ago Women make babies though so the math is reasonably different. Let's not do the 'working in a gas station is more noble than being a mother' bullshit permalink parent award report block reply GatoradeJeb 5 points 4 days ago Racemixing is abominable. A mudshark/race traitor White woman is worthless scum permalink parent award report block reply view 2 more comments... Hoshi 2 points 4 days ago Why not both? permalink parent award report block reply view 1 more comments... IlhanOmarsFagBrother 1 points 4 days ago Correction, only true if you are white or Asian in the top 50% of earners. If you're in the bottom 50% you are not contributing at all to running this country, even if white or Asian because the bottom 50% contributes nearly 0% of all federal income tax revenue permalink parent award report block reply Retardloserimsogay 10 points 4 days ago They don't want the tax cattle, that was a way of demoralizing us to not have children because in reality they want us dead and this country burned to ash with the ground salted because of what Hitler did or something. permalink parent award report block reply loosemoose 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply xBigCoffinHunter 5 points 4 days ago No shit.  Who pays taxes after we’re gone.  I swear It’s like trying to teach Africans to farm. permalink parent award report block reply Bigdeal 5 points 4 days ago The Whiter it is the less pricious criminals they would have to fawn over. No libtard would be happy without getting mugged and raped. permalink parent award report block reply load 5 more comments... Than0sIII 15 points 4 days ago Because they want America to collapse and be forced to turn into a globohomo blob. permalink parent award report block reply TwoArizonaPedes 8 points 4 days ago Globohomoblob. I think you coined a new word. permalink parent award report block reply Than0sIII 7 points 4 days ago It's a sentiment that's been thrown around.  The whole intent of everything going on in the West right now is to erase national/societal cultures and turn the world into a homogenous gray mass of multicultural \"diversity\" (because ultimately there is no diversity when being forced to serve the machine). permalink parent award report block reply TwoArizonaPedes 6 points 4 days ago I know the concept, I was applauding your addition of \"blob,\" which is perfect as they want everyone to be lacking form, substance, and identity. permalink parent award report block reply Deport_O_Matic 3 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply Deport_O_Matic 2 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply view 1 more comments... Gotmygoose 10 points 4 days ago Well, then, let the insidiousness begin. permalink parent award report block reply TwoArizonaPedes 9 points 4 days ago When I was born the country was something like 85% White. Seemed to be working pretty well. permalink parent award report block reply RizzlieDoodad 4 points 4 days ago It goes against their greatest strength of diversity permalink parent award report block reply load 12 more comments...\nZskills OP 118 points 4 days ago They go on and on about wanting more tax revenue to give to minorities and immigrants.    Well, whites and SE asians are the only net tax paying demographics.  So I don't understand their objection.  They should be happy about increasing numbers of tax cattle. permalink parent award report block reply Awan-CIA-Car-Lot 86 points 4 days ago They also have no problem with brown people having 8 kids. permalink parent award report block reply MySidesGoUp 49 points 4 days ago Kalergi plan taking flight permalink parent award report block reply vongregormench 14 points 4 days ago What's the ultimate goal with this plan? Extinction? Poverty for all? permalink parent award report block reply view 17 more comments... BidenShowerDrool 9 points 4 days ago Dearborn has men that are Islamically married to 4 wives and each of them have 8-10 kids.  Not one of those including the breeding rats will ever work a tax witholding job in their lifetimes. permalink parent award report block reply GatoradeJeb 6 points 4 days ago Its because they want White man replaced and firther humiliated as White woman are brainwashed to racemix with browns permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Yep permalink parent award report block reply Washington_Redskins 7 points 4 days ago To be fair, that's that's only one or two kids per relative in Minnesomalia' permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Lol 😅 permalink parent award report block reply schiff_for_brains 3 points 4 days ago Here.  Have some more food stamps.  Oh wait... permalink parent award report block reply LizardKingx002 3 points 4 days ago In fact, they celebrate it permalink parent award report block reply load 1 more comments... scruffyshoulders 37 points 4 days ago Correction, male whites and asians are the only net tax paying demographics. Females take out more than they put in, they are a net negative the men have to make up for. Basically male whites and asians are the only ones supporting the entire tax system. permalink parent award report block reply Moose_Antlers 3 points 4 days ago I so need a citation for that just to make it into a meme to slap on every entitled AWFL who starts yapping about this! Graphs needed! permalink parent award report block reply scruffyshoulders 9 points 4 days ago Beyond this being common sense, here ya go. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2375926 Easily looked up with a single search. permalink parent award report block reply view 3 more comments... SimaYi 1 points 4 days ago I so need a citation No you don't, Neo. permalink parent award report block reply zooty 2 points 4 days ago Women make babies though so the math is reasonably different. Let's not do the 'working in a gas station is more noble than being a mother' bullshit permalink parent award report block reply GatoradeJeb 5 points 4 days ago Racemixing is abominable. A mudshark/race traitor White woman is worthless scum permalink parent award report block reply view 2 more comments... Hoshi 2 points 4 days ago Why not both? permalink parent award report block reply view 1 more comments... IlhanOmarsFagBrother 1 points 4 days ago Correction, only true if you are white or Asian in the top 50% of earners. If you're in the bottom 50% you are not contributing at all to running this country, even if white or Asian because the bottom 50% contributes nearly 0% of all federal income tax revenue permalink parent award report block reply Retardloserimsogay 10 points 4 days ago They don't want the tax cattle, that was a way of demoralizing us to not have children because in reality they want us dead and this country burned to ash with the ground salted because of what Hitler did or something. permalink parent award report block reply loosemoose 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply xBigCoffinHunter 5 points 4 days ago No shit.  Who pays taxes after we’re gone.  I swear It’s like trying to teach Africans to farm. permalink parent award report block reply Bigdeal 5 points 4 days ago The Whiter it is the less pricious criminals they would have to fawn over. No libtard would be happy without getting mugged and raped. permalink parent award report block reply load 5 more comments...\nAwan-CIA-Car-Lot 86 points 4 days ago They also have no problem with brown people having 8 kids. permalink parent award report block reply MySidesGoUp 49 points 4 days ago Kalergi plan taking flight permalink parent award report block reply vongregormench 14 points 4 days ago What's the ultimate goal with this plan? Extinction? Poverty for all? permalink parent award report block reply view 17 more comments... BidenShowerDrool 9 points 4 days ago Dearborn has men that are Islamically married to 4 wives and each of them have 8-10 kids.  Not one of those including the breeding rats will ever work a tax witholding job in their lifetimes. permalink parent award report block reply GatoradeJeb 6 points 4 days ago Its because they want White man replaced and firther humiliated as White woman are brainwashed to racemix with browns permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Yep permalink parent award report block reply Washington_Redskins 7 points 4 days ago To be fair, that's that's only one or two kids per relative in Minnesomalia' permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Lol 😅 permalink parent award report block reply schiff_for_brains 3 points 4 days ago Here.  Have some more food stamps.  Oh wait... permalink parent award report block reply LizardKingx002 3 points 4 days ago In fact, they celebrate it permalink parent award report block reply load 1 more comments...\nMySidesGoUp 49 points 4 days ago Kalergi plan taking flight permalink parent award report block reply vongregormench 14 points 4 days ago What's the ultimate goal with this plan? Extinction? Poverty for all? permalink parent award report block reply view 17 more comments...\nvongregormench 14 points 4 days ago What's the ultimate goal with this plan? Extinction? Poverty for all? permalink parent award report block reply view 17 more comments...\nBidenShowerDrool 9 points 4 days ago Dearborn has men that are Islamically married to 4 wives and each of them have 8-10 kids.  Not one of those including the breeding rats will ever work a tax witholding job in their lifetimes. permalink parent award report block reply GatoradeJeb 6 points 4 days ago Its because they want White man replaced and firther humiliated as White woman are brainwashed to racemix with browns permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Yep permalink parent award report block reply\nGatoradeJeb 6 points 4 days ago Its because they want White man replaced and firther humiliated as White woman are brainwashed to racemix with browns permalink parent award report block reply\nAwan-CIA-Car-Lot 5 points 4 days ago Yep permalink parent award report block reply\nWashington_Redskins 7 points 4 days ago To be fair, that's that's only one or two kids per relative in Minnesomalia' permalink parent award report block reply Awan-CIA-Car-Lot 5 points 4 days ago Lol 😅 permalink parent award report block reply\nAwan-CIA-Car-Lot 5 points 4 days ago Lol 😅 permalink parent award report block reply\nschiff_for_brains 3 points 4 days ago Here.  Have some more food stamps.  Oh wait... permalink parent award report block reply\nLizardKingx002 3 points 4 days ago In fact, they celebrate it permalink parent award report block reply\nscruffyshoulders 37 points 4 days ago Correction, male whites and asians are the only net tax paying demographics. Females take out more than they put in, they are a net negative the men have to make up for. Basically male whites and asians are the only ones supporting the entire tax system. permalink parent award report block reply Moose_Antlers 3 points 4 days ago I so need a citation for that just to make it into a meme to slap on every entitled AWFL who starts yapping about this! Graphs needed! permalink parent award report block reply scruffyshoulders 9 points 4 days ago Beyond this being common sense, here ya go. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2375926 Easily looked up with a single search. permalink parent award report block reply view 3 more comments... SimaYi 1 points 4 days ago I so need a citation No you don't, Neo. permalink parent award report block reply zooty 2 points 4 days ago Women make babies though so the math is reasonably different. Let's not do the 'working in a gas station is more noble than being a mother' bullshit permalink parent award report block reply GatoradeJeb 5 points 4 days ago Racemixing is abominable. A mudshark/race traitor White woman is worthless scum permalink parent award report block reply view 2 more comments... Hoshi 2 points 4 days ago Why not both? permalink parent award report block reply view 1 more comments... IlhanOmarsFagBrother 1 points 4 days ago Correction, only true if you are white or Asian in the top 50% of earners. If you're in the bottom 50% you are not contributing at all to running this country, even if white or Asian because the bottom 50% contributes nearly 0% of all federal income tax revenue permalink parent award report block reply\nMoose_Antlers 3 points 4 days ago I so need a citation for that just to make it into a meme to slap on every entitled AWFL who starts yapping about this! Graphs needed! permalink parent award report block reply scruffyshoulders 9 points 4 days ago Beyond this being common sense, here ya go. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2375926 Easily looked up with a single search. permalink parent award report block reply view 3 more comments... SimaYi 1 points 4 days ago I so need a citation No you don't, Neo. permalink parent award report block reply\nscruffyshoulders 9 points 4 days ago Beyond this being common sense, here ya go. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2375926 Easily looked up with a single search. permalink parent award report block reply view 3 more comments...\nSimaYi 1 points 4 days ago I so need a citation No you don't, Neo. permalink parent award report block reply\nzooty 2 points 4 days ago Women make babies though so the math is reasonably different. Let's not do the 'working in a gas station is more noble than being a mother' bullshit permalink parent award report block reply GatoradeJeb 5 points 4 days ago Racemixing is abominable. A mudshark/race traitor White woman is worthless scum permalink parent award report block reply view 2 more comments... Hoshi 2 points 4 days ago Why not both? permalink parent award report block reply view 1 more comments...\nGatoradeJeb 5 points 4 days ago Racemixing is abominable. A mudshark/race traitor White woman is worthless scum permalink parent award report block reply view 2 more comments...\nHoshi 2 points 4 days ago Why not both? permalink parent award report block reply view 1 more comments...\nIlhanOmarsFagBrother 1 points 4 days ago Correction, only true if you are white or Asian in the top 50% of earners. If you're in the bottom 50% you are not contributing at all to running this country, even if white or Asian because the bottom 50% contributes nearly 0% of all federal income tax revenue permalink parent award report block reply\nRetardloserimsogay 10 points 4 days ago They don't want the tax cattle, that was a way of demoralizing us to not have children because in reality they want us dead and this country burned to ash with the ground salted because of what Hitler did or something. permalink parent award report block reply loosemoose 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nloosemoose 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nxBigCoffinHunter 5 points 4 days ago No shit.  Who pays taxes after we’re gone.  I swear It’s like trying to teach Africans to farm. permalink parent award report block reply\nBigdeal 5 points 4 days ago The Whiter it is the less pricious criminals they would have to fawn over. No libtard would be happy without getting mugged and raped. permalink parent award report block reply\nThan0sIII 15 points 4 days ago Because they want America to collapse and be forced to turn into a globohomo blob. permalink parent award report block reply TwoArizonaPedes 8 points 4 days ago Globohomoblob. I think you coined a new word. permalink parent award report block reply Than0sIII 7 points 4 days ago It's a sentiment that's been thrown around.  The whole intent of everything going on in the West right now is to erase national/societal cultures and turn the world into a homogenous gray mass of multicultural \"diversity\" (because ultimately there is no diversity when being forced to serve the machine). permalink parent award report block reply TwoArizonaPedes 6 points 4 days ago I know the concept, I was applauding your addition of \"blob,\" which is perfect as they want everyone to be lacking form, substance, and identity. permalink parent award report block reply Deport_O_Matic 3 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply Deport_O_Matic 2 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 8 points 4 days ago Globohomoblob. I think you coined a new word. permalink parent award report block reply Than0sIII 7 points 4 days ago It's a sentiment that's been thrown around.  The whole intent of everything going on in the West right now is to erase national/societal cultures and turn the world into a homogenous gray mass of multicultural \"diversity\" (because ultimately there is no diversity when being forced to serve the machine). permalink parent award report block reply TwoArizonaPedes 6 points 4 days ago I know the concept, I was applauding your addition of \"blob,\" which is perfect as they want everyone to be lacking form, substance, and identity. permalink parent award report block reply Deport_O_Matic 3 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply Deport_O_Matic 2 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply view 1 more comments...\nThan0sIII 7 points 4 days ago It's a sentiment that's been thrown around.  The whole intent of everything going on in the West right now is to erase national/societal cultures and turn the world into a homogenous gray mass of multicultural \"diversity\" (because ultimately there is no diversity when being forced to serve the machine). permalink parent award report block reply TwoArizonaPedes 6 points 4 days ago I know the concept, I was applauding your addition of \"blob,\" which is perfect as they want everyone to be lacking form, substance, and identity. permalink parent award report block reply Deport_O_Matic 3 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply Deport_O_Matic 2 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 6 points 4 days ago I know the concept, I was applauding your addition of \"blob,\" which is perfect as they want everyone to be lacking form, substance, and identity. permalink parent award report block reply\nDeport_O_Matic 3 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply\nDeport_O_Matic 2 points 4 days ago This \"diversity\" is actually destroying real diversity. permalink parent award report block reply view 1 more comments...\nGotmygoose 10 points 4 days ago Well, then, let the insidiousness begin. permalink parent award report block reply\nTwoArizonaPedes 9 points 4 days ago When I was born the country was something like 85% White. Seemed to be working pretty well. permalink parent award report block reply\nRizzlieDoodad 4 points 4 days ago It goes against their greatest strength of diversity permalink parent award report block reply\nx79q3pb 105 points 4 days ago some critics Who are these critics and why are they named Berg Witz Mann and Stein? permalink award report block reply MocksFordComma 41 points 4 days ago They’re never named. Polieve (w/e) is a complete Canadian cuck, but he got one thing right: standing there chomping an apple and relentlessly asking: “Who?” permalink parent award report block reply jdemarco2014 32 points 4 days ago Because the Jews aren’t our friends and need to all be loaded up on a plane and shipped directly to Israel permalink parent award report block reply Tiredofstupidpeople -2 points 4 days ago The globalist aligned far left faction driving this kind of thing couldn't give a shit about Israel anymore because they mostly lost control of it starting way back in the 80s. They fund the protests there now trying to collapse the current government, same as they do in the US. Try to keep up with the times. permalink parent award report block reply Easzq8 -3 points 4 days ago And black people, and Arabs, and Indians, and Latinos, and Gypsies, and gays, and trans, and Asians, and long haired Indians, and people who’s name is Sebastian, and people who don’t keep their tires at exactly 36psi, and folks with too many freckles, and Mormons, and folks who can’t remember pi past the tenth digit, and the Yugh and Kerek, and folks who say “pop” instead of “soda,” and and and permalink parent award report block reply solo25 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply TDAF 9 points 4 days ago Experts say permalink parent award report block reply vongregormench 7 points 4 days ago The critics are themselves writing the article, so just read the author's name. permalink parent award report block reply Stolen 4 points 4 days ago MAPS permalink parent award report block reply load 3 more comments...\nMocksFordComma 41 points 4 days ago They’re never named. Polieve (w/e) is a complete Canadian cuck, but he got one thing right: standing there chomping an apple and relentlessly asking: “Who?” permalink parent award report block reply\njdemarco2014 32 points 4 days ago Because the Jews aren’t our friends and need to all be loaded up on a plane and shipped directly to Israel permalink parent award report block reply Tiredofstupidpeople -2 points 4 days ago The globalist aligned far left faction driving this kind of thing couldn't give a shit about Israel anymore because they mostly lost control of it starting way back in the 80s. They fund the protests there now trying to collapse the current government, same as they do in the US. Try to keep up with the times. permalink parent award report block reply Easzq8 -3 points 4 days ago And black people, and Arabs, and Indians, and Latinos, and Gypsies, and gays, and trans, and Asians, and long haired Indians, and people who’s name is Sebastian, and people who don’t keep their tires at exactly 36psi, and folks with too many freckles, and Mormons, and folks who can’t remember pi past the tenth digit, and the Yugh and Kerek, and folks who say “pop” instead of “soda,” and and and permalink parent award report block reply solo25 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTiredofstupidpeople -2 points 4 days ago The globalist aligned far left faction driving this kind of thing couldn't give a shit about Israel anymore because they mostly lost control of it starting way back in the 80s. They fund the protests there now trying to collapse the current government, same as they do in the US. Try to keep up with the times. permalink parent award report block reply\nEaszq8 -3 points 4 days ago And black people, and Arabs, and Indians, and Latinos, and Gypsies, and gays, and trans, and Asians, and long haired Indians, and people who’s name is Sebastian, and people who don’t keep their tires at exactly 36psi, and folks with too many freckles, and Mormons, and folks who can’t remember pi past the tenth digit, and the Yugh and Kerek, and folks who say “pop” instead of “soda,” and and and permalink parent award report block reply\nsolo25 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTDAF 9 points 4 days ago Experts say permalink parent award report block reply\nvongregormench 7 points 4 days ago The critics are themselves writing the article, so just read the author's name. permalink parent award report block reply\nStolen 4 points 4 days ago MAPS permalink parent award report block reply\nLady_MaGa 64 points 4 days ago We need to use their own tactic against them.  15 years ago the lefties were screaming about how whites don't like the \"browning of America\" and we were called all sorts of names.  Let's give it back and tell them that they don't like the \"whitening of America\" and call them the same names they called us first.  Then play back their own words if they start to \"reeee\". permalink award report block reply kjj9 72 points 4 days ago Appeal to Decency only works when your opponent is decent.  For example, Ghandi's peaceful revolution in India only could have worked on the British. In the same way, the accusation of \"racism\" only works when the left uses it on the right.  We are decent folks, don't want to think of ourselves as unfair. When we call the left racist, it doesn't work.  They want us dead, our sons mutilated, our wives and daughters raped - because we deserve it .  Why would they care what we think? permalink parent award report block reply 1_Badcop 27 points 4 days ago This is the unfortunate truth. I like u/Lady_MaGa 's sentiment, but  nobody on the left would care. permalink parent award report block reply Lady_MaGa 4 points 4 days ago If a small group found a single one, I think that one would cave with 4 against 1. permalink parent award report block reply makersmarx -3 points 4 days ago Are you literally a retarded person? permalink parent award report block reply view 2 more comments... Dangerous 11 points 4 days ago Even Ghandi understood this, and had said they use nonviolent resistance because that is what they had. And if they had missiles, they would use missiles permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago u/maverick202 is a self-admitted troll (read his post history) who calls people in this community \"incels\" and \"white trash,\" he also believes Joe Biden won the most votes of any President in history lmfao permalink parent award report block reply RachetQueen2020 2 points 4 days ago Sounds like a complete fag probably posting from certain locations. Hopefully, he chokes on a diseased dick and expires. permalink parent award report block reply maverick202 0 points 4 days ago Don't act like you're expert in history if you don't know jack shit. If it was for Ghandi, India would've never been free. There was plenty of violence and blood shed by Indian freedom fighters which made this happen. permalink parent award report block reply RachetQueen2020 1 points 4 days ago So, now they are free to be street shitters, scammers, and rapists. Glass pajeets now. permalink parent award report block reply view 1 more comments... Bigdeal 6 points 4 days ago Racism is just noticing patterns. Racism just keeps ypu safe and there is nothing wrong with it. permalink parent award report block reply SanityGumby 3 points 4 days ago It doesn’t have to work on them. It’s designed to create a backlash to wake normies up to what they are doing permalink parent award report block reply gustodog 2 points 4 days ago We'd be pointing out their hypocrisy and genocidal motivation to the audience, not trying to change the minds of those who want us dead. permalink parent award report block reply load 4 more comments... Dangerous 17 points 4 days ago Disregarding and openly ridiculing them en mass is the correct call. However, the specific turn about accusations won't do much because terms like \"racism\" don't actually apply in reverse: the entire birth of these associated terms and the way of thinking using them was coined by anti white Soviet Communists. When modern college freaks push the \"power + privilege\" line they are closer to the original definition of the terms than normie understanding is. As further proof of this, for the longest time any racism by non-whites towards whites in the US was referred to as \"reverse racism\" by conservative Republicans and literally denied as impossible in the first place by near everyone else. If \"racism\" simply meant \"discrimination based on race\" that way of thinking would not have existed permalink parent award report block reply Megaboom2025 7 points 4 days ago Ridicule is the only way out of this mess. Righteous anger and open hostility will silence the anti-white movement permalink parent award report block reply Viewer01 5 points 4 days ago Neocons have tried for 20 years. They don’t care. These people only respond to two things. Power and the business end of a gun barrel. I’ve said it many times but getting your country back is down a river of blood and a lot of dead minorities. permalink parent award report block reply Tyrone_biggums 3 points 4 days ago Because that always works… the left sets the standards and utterly controls the enforcement of charges of racism, etc. you should realize that by now permalink parent award report block reply Lightning 1 points 4 days ago Yea, but the difference is the leftists will say, ”Damn right I don’t like the whitening of America!” They are very open about their absolute hatred of white people. permalink parent award report block reply load 3 more comments...\nkjj9 72 points 4 days ago Appeal to Decency only works when your opponent is decent.  For example, Ghandi's peaceful revolution in India only could have worked on the British. In the same way, the accusation of \"racism\" only works when the left uses it on the right.  We are decent folks, don't want to think of ourselves as unfair. When we call the left racist, it doesn't work.  They want us dead, our sons mutilated, our wives and daughters raped - because we deserve it .  Why would they care what we think? permalink parent award report block reply 1_Badcop 27 points 4 days ago This is the unfortunate truth. I like u/Lady_MaGa 's sentiment, but  nobody on the left would care. permalink parent award report block reply Lady_MaGa 4 points 4 days ago If a small group found a single one, I think that one would cave with 4 against 1. permalink parent award report block reply makersmarx -3 points 4 days ago Are you literally a retarded person? permalink parent award report block reply view 2 more comments... Dangerous 11 points 4 days ago Even Ghandi understood this, and had said they use nonviolent resistance because that is what they had. And if they had missiles, they would use missiles permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago u/maverick202 is a self-admitted troll (read his post history) who calls people in this community \"incels\" and \"white trash,\" he also believes Joe Biden won the most votes of any President in history lmfao permalink parent award report block reply RachetQueen2020 2 points 4 days ago Sounds like a complete fag probably posting from certain locations. Hopefully, he chokes on a diseased dick and expires. permalink parent award report block reply maverick202 0 points 4 days ago Don't act like you're expert in history if you don't know jack shit. If it was for Ghandi, India would've never been free. There was plenty of violence and blood shed by Indian freedom fighters which made this happen. permalink parent award report block reply RachetQueen2020 1 points 4 days ago So, now they are free to be street shitters, scammers, and rapists. Glass pajeets now. permalink parent award report block reply view 1 more comments... Bigdeal 6 points 4 days ago Racism is just noticing patterns. Racism just keeps ypu safe and there is nothing wrong with it. permalink parent award report block reply SanityGumby 3 points 4 days ago It doesn’t have to work on them. It’s designed to create a backlash to wake normies up to what they are doing permalink parent award report block reply gustodog 2 points 4 days ago We'd be pointing out their hypocrisy and genocidal motivation to the audience, not trying to change the minds of those who want us dead. permalink parent award report block reply load 4 more comments...\n1_Badcop 27 points 4 days ago This is the unfortunate truth. I like u/Lady_MaGa 's sentiment, but  nobody on the left would care. permalink parent award report block reply Lady_MaGa 4 points 4 days ago If a small group found a single one, I think that one would cave with 4 against 1. permalink parent award report block reply makersmarx -3 points 4 days ago Are you literally a retarded person? permalink parent award report block reply view 2 more comments...\nLady_MaGa 4 points 4 days ago If a small group found a single one, I think that one would cave with 4 against 1. permalink parent award report block reply makersmarx -3 points 4 days ago Are you literally a retarded person? permalink parent award report block reply view 2 more comments...\nmakersmarx -3 points 4 days ago Are you literally a retarded person? permalink parent award report block reply view 2 more comments...\nDangerous 11 points 4 days ago Even Ghandi understood this, and had said they use nonviolent resistance because that is what they had. And if they had missiles, they would use missiles permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago u/maverick202 is a self-admitted troll (read his post history) who calls people in this community \"incels\" and \"white trash,\" he also believes Joe Biden won the most votes of any President in history lmfao permalink parent award report block reply RachetQueen2020 2 points 4 days ago Sounds like a complete fag probably posting from certain locations. Hopefully, he chokes on a diseased dick and expires. permalink parent award report block reply maverick202 0 points 4 days ago Don't act like you're expert in history if you don't know jack shit. If it was for Ghandi, India would've never been free. There was plenty of violence and blood shed by Indian freedom fighters which made this happen. permalink parent award report block reply RachetQueen2020 1 points 4 days ago So, now they are free to be street shitters, scammers, and rapists. Glass pajeets now. permalink parent award report block reply view 1 more comments...\nUCantStumpTheTrump 2 points 4 days ago u/maverick202 is a self-admitted troll (read his post history) who calls people in this community \"incels\" and \"white trash,\" he also believes Joe Biden won the most votes of any President in history lmfao permalink parent award report block reply RachetQueen2020 2 points 4 days ago Sounds like a complete fag probably posting from certain locations. Hopefully, he chokes on a diseased dick and expires. permalink parent award report block reply\nRachetQueen2020 2 points 4 days ago Sounds like a complete fag probably posting from certain locations. Hopefully, he chokes on a diseased dick and expires. permalink parent award report block reply\nmaverick202 0 points 4 days ago Don't act like you're expert in history if you don't know jack shit. If it was for Ghandi, India would've never been free. There was plenty of violence and blood shed by Indian freedom fighters which made this happen. permalink parent award report block reply RachetQueen2020 1 points 4 days ago So, now they are free to be street shitters, scammers, and rapists. Glass pajeets now. permalink parent award report block reply view 1 more comments...\nRachetQueen2020 1 points 4 days ago So, now they are free to be street shitters, scammers, and rapists. Glass pajeets now. permalink parent award report block reply view 1 more comments...\nBigdeal 6 points 4 days ago Racism is just noticing patterns. Racism just keeps ypu safe and there is nothing wrong with it. permalink parent award report block reply\nSanityGumby 3 points 4 days ago It doesn’t have to work on them. It’s designed to create a backlash to wake normies up to what they are doing permalink parent award report block reply\ngustodog 2 points 4 days ago We'd be pointing out their hypocrisy and genocidal motivation to the audience, not trying to change the minds of those who want us dead. permalink parent award report block reply\nDangerous 17 points 4 days ago Disregarding and openly ridiculing them en mass is the correct call. However, the specific turn about accusations won't do much because terms like \"racism\" don't actually apply in reverse: the entire birth of these associated terms and the way of thinking using them was coined by anti white Soviet Communists. When modern college freaks push the \"power + privilege\" line they are closer to the original definition of the terms than normie understanding is. As further proof of this, for the longest time any racism by non-whites towards whites in the US was referred to as \"reverse racism\" by conservative Republicans and literally denied as impossible in the first place by near everyone else. If \"racism\" simply meant \"discrimination based on race\" that way of thinking would not have existed permalink parent award report block reply Megaboom2025 7 points 4 days ago Ridicule is the only way out of this mess. Righteous anger and open hostility will silence the anti-white movement permalink parent award report block reply\nMegaboom2025 7 points 4 days ago Ridicule is the only way out of this mess. Righteous anger and open hostility will silence the anti-white movement permalink parent award report block reply\nViewer01 5 points 4 days ago Neocons have tried for 20 years. They don’t care. These people only respond to two things. Power and the business end of a gun barrel. I’ve said it many times but getting your country back is down a river of blood and a lot of dead minorities. permalink parent award report block reply\nTyrone_biggums 3 points 4 days ago Because that always works… the left sets the standards and utterly controls the enforcement of charges of racism, etc. you should realize that by now permalink parent award report block reply\nLightning 1 points 4 days ago Yea, but the difference is the leftists will say, ”Damn right I don’t like the whitening of America!” They are very open about their absolute hatred of white people. permalink parent award report block reply\njsphere256 46 points 4 days ago It's not insidious to want to pass on your own culture and family lineage to the next generation permalink award report block reply Dangerous 30 points 4 days ago For them, it is insidious only if you are white. Reread the headline. Also it would be great if more people would come to recognize the entire point of defeating Germany in WWII was to push notions like this onto western countries in perpetuity, as Germany/Italy/Spain were the only white nations with civil leadership opposed to these ideas at the time permalink parent award report block reply anishr -18 points 4 days ago That’s not insidious yes. What’s insidious is - whites routinely meddle with other countries while being condescending towards other cultures. 750+ military bases worldwide is insidious. permalink parent award report block reply PensivePatriot 11 points 4 days ago Kill yourself. permalink parent award report block reply anishr -6 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Americansupremacist0 5 points 4 days ago “European shitholes…. Muzzie masters” interesting how you admit Europe is a shithole thanks to muzzies. So you are in complete agreement with all those mean whiteys. What’s the matter kid, you wanna be adopted by whites so your life isn’t so pathetic and miserable? permalink parent award report block reply view 3 more comments... mlp67 2 points 4 days ago You've just been creeping on this site for 5 years waiting to spew anti-White nonsense.  You sound jealous. permalink parent award report block reply view 3 more comments... covok48 4 points 4 days ago Poojeet permalink parent award report block reply\nDangerous 30 points 4 days ago For them, it is insidious only if you are white. Reread the headline. Also it would be great if more people would come to recognize the entire point of defeating Germany in WWII was to push notions like this onto western countries in perpetuity, as Germany/Italy/Spain were the only white nations with civil leadership opposed to these ideas at the time permalink parent award report block reply\nanishr -18 points 4 days ago That’s not insidious yes. What’s insidious is - whites routinely meddle with other countries while being condescending towards other cultures. 750+ military bases worldwide is insidious. permalink parent award report block reply PensivePatriot 11 points 4 days ago Kill yourself. permalink parent award report block reply anishr -6 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Americansupremacist0 5 points 4 days ago “European shitholes…. Muzzie masters” interesting how you admit Europe is a shithole thanks to muzzies. So you are in complete agreement with all those mean whiteys. What’s the matter kid, you wanna be adopted by whites so your life isn’t so pathetic and miserable? permalink parent award report block reply view 3 more comments... mlp67 2 points 4 days ago You've just been creeping on this site for 5 years waiting to spew anti-White nonsense.  You sound jealous. permalink parent award report block reply view 3 more comments... covok48 4 points 4 days ago Poojeet permalink parent award report block reply\nPensivePatriot 11 points 4 days ago Kill yourself. permalink parent award report block reply anishr -6 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Americansupremacist0 5 points 4 days ago “European shitholes…. Muzzie masters” interesting how you admit Europe is a shithole thanks to muzzies. So you are in complete agreement with all those mean whiteys. What’s the matter kid, you wanna be adopted by whites so your life isn’t so pathetic and miserable? permalink parent award report block reply view 3 more comments... mlp67 2 points 4 days ago You've just been creeping on this site for 5 years waiting to spew anti-White nonsense.  You sound jealous. permalink parent award report block reply view 3 more comments...\nanishr -6 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Americansupremacist0 5 points 4 days ago “European shitholes…. Muzzie masters” interesting how you admit Europe is a shithole thanks to muzzies. So you are in complete agreement with all those mean whiteys. What’s the matter kid, you wanna be adopted by whites so your life isn’t so pathetic and miserable? permalink parent award report block reply view 3 more comments... mlp67 2 points 4 days ago You've just been creeping on this site for 5 years waiting to spew anti-White nonsense.  You sound jealous. permalink parent award report block reply view 3 more comments...\nAmericansupremacist0 5 points 4 days ago “European shitholes…. Muzzie masters” interesting how you admit Europe is a shithole thanks to muzzies. So you are in complete agreement with all those mean whiteys. What’s the matter kid, you wanna be adopted by whites so your life isn’t so pathetic and miserable? permalink parent award report block reply view 3 more comments...\nmlp67 2 points 4 days ago You've just been creeping on this site for 5 years waiting to spew anti-White nonsense.  You sound jealous. permalink parent award report block reply view 3 more comments...\ncovok48 4 points 4 days ago Poojeet permalink parent award report block reply\nDudeNoOne 42 points 4 days ago I’m doing my part permalink award report block reply CommanderOfCheese 27 points 4 days ago 6 so far! permalink parent award report block reply DudeNoOne 18 points 4 days ago 4 under 4 so im good for a bit permalink parent award report block reply CommanderOfCheese 7 points 4 days ago Yeah I spread mine out 2 years apart. permalink parent award report block reply mlp67 1 points 4 days ago You live in crazy town! Good for you! I wished I'd had more. God Bless permalink parent award report block reply DudeNoOne 2 points 4 days ago Send prayers. This house needs them regularly. permalink parent award report block reply view 2 more comments... AliceCooperBiden 10 points 4 days ago We have 5 at 30. We’ll make more but we need a minute lol permalink parent award report block reply Get_Off_Big_Tech 3 points 4 days ago Winning. permalink parent award report block reply AliceCooperBiden 2 points 3 days ago I wouldn’t trade it for anything. permalink parent award report block reply Awan-CIA-Car-Lot 8 points 4 days ago 👍 permalink parent award report block reply Get_Off_Big_Tech 2 points 4 days ago Hero. permalink parent award report block reply CommanderOfCheese 4 points 4 days ago Not as big as my parents or my older sister. permalink parent award report block reply MasterChief 10 points 4 days ago good job permalink parent award report block reply vongregormench 4 points 4 days ago I sadly failed, but I at least have one child and who knows how many kids she will have. permalink parent award report block reply\nCommanderOfCheese 27 points 4 days ago 6 so far! permalink parent award report block reply DudeNoOne 18 points 4 days ago 4 under 4 so im good for a bit permalink parent award report block reply CommanderOfCheese 7 points 4 days ago Yeah I spread mine out 2 years apart. permalink parent award report block reply mlp67 1 points 4 days ago You live in crazy town! Good for you! I wished I'd had more. God Bless permalink parent award report block reply DudeNoOne 2 points 4 days ago Send prayers. This house needs them regularly. permalink parent award report block reply view 2 more comments... AliceCooperBiden 10 points 4 days ago We have 5 at 30. We’ll make more but we need a minute lol permalink parent award report block reply Get_Off_Big_Tech 3 points 4 days ago Winning. permalink parent award report block reply AliceCooperBiden 2 points 3 days ago I wouldn’t trade it for anything. permalink parent award report block reply Awan-CIA-Car-Lot 8 points 4 days ago 👍 permalink parent award report block reply Get_Off_Big_Tech 2 points 4 days ago Hero. permalink parent award report block reply CommanderOfCheese 4 points 4 days ago Not as big as my parents or my older sister. permalink parent award report block reply\nDudeNoOne 18 points 4 days ago 4 under 4 so im good for a bit permalink parent award report block reply CommanderOfCheese 7 points 4 days ago Yeah I spread mine out 2 years apart. permalink parent award report block reply mlp67 1 points 4 days ago You live in crazy town! Good for you! I wished I'd had more. God Bless permalink parent award report block reply DudeNoOne 2 points 4 days ago Send prayers. This house needs them regularly. permalink parent award report block reply view 2 more comments...\nCommanderOfCheese 7 points 4 days ago Yeah I spread mine out 2 years apart. permalink parent award report block reply\nmlp67 1 points 4 days ago You live in crazy town! Good for you! I wished I'd had more. God Bless permalink parent award report block reply DudeNoOne 2 points 4 days ago Send prayers. This house needs them regularly. permalink parent award report block reply view 2 more comments...\nDudeNoOne 2 points 4 days ago Send prayers. This house needs them regularly. permalink parent award report block reply view 2 more comments...\nAliceCooperBiden 10 points 4 days ago We have 5 at 30. We’ll make more but we need a minute lol permalink parent award report block reply Get_Off_Big_Tech 3 points 4 days ago Winning. permalink parent award report block reply AliceCooperBiden 2 points 3 days ago I wouldn’t trade it for anything. permalink parent award report block reply\nGet_Off_Big_Tech 3 points 4 days ago Winning. permalink parent award report block reply AliceCooperBiden 2 points 3 days ago I wouldn’t trade it for anything. permalink parent award report block reply\nAliceCooperBiden 2 points 3 days ago I wouldn’t trade it for anything. permalink parent award report block reply\nAwan-CIA-Car-Lot 8 points 4 days ago 👍 permalink parent award report block reply\nGet_Off_Big_Tech 2 points 4 days ago Hero. permalink parent award report block reply CommanderOfCheese 4 points 4 days ago Not as big as my parents or my older sister. permalink parent award report block reply\nCommanderOfCheese 4 points 4 days ago Not as big as my parents or my older sister. permalink parent award report block reply\nMasterChief 10 points 4 days ago good job permalink parent award report block reply\nvongregormench 4 points 4 days ago I sadly failed, but I at least have one child and who knows how many kids she will have. permalink parent award report block reply\nArea82 33 points 4 days ago We had a whiter, more Christian America before.  It was demonstrably better.  What’s wrong with going back to that? permalink award report block reply ninabobby 11 points 4 days ago No no, don't you know that America never achieved anything until it was flooded with all the H1B geniuses. permalink parent award report block reply Dangerous 8 points 4 days ago Even if it somehow wasn't \"better\" everything we have and worked to create that these people value so much was made in that era too permalink parent award report block reply GatoradeJeb 2 points 4 days ago Because thry want White man dead and White woman mudsharking permalink parent award report block reply\nninabobby 11 points 4 days ago No no, don't you know that America never achieved anything until it was flooded with all the H1B geniuses. permalink parent award report block reply\nDangerous 8 points 4 days ago Even if it somehow wasn't \"better\" everything we have and worked to create that these people value so much was made in that era too permalink parent award report block reply\nGatoradeJeb 2 points 4 days ago Because thry want White man dead and White woman mudsharking permalink parent award report block reply\nJanOctSept 27 points 4 days ago Is this an actual joke? Is this real? I guarantee who ever wrote this used to be a mod on the antinatalism subreddit permalink award report block reply monkadelic 11 points 4 days ago This is the first I'm hearing this word casually used like its just a thing.  Its so stupid, its almost hard believe its anything but rage bait. permalink parent award report block reply Zskills OP 10 points 4 days ago Yes, it is real.  I searched the article before posting. permalink parent award report block reply Megaboom2025 9 points 4 days ago (((Check the early life))) permalink parent award report block reply Dangerous 5 points 4 days ago Why would they need to be a mod on some backwater corner of the internet? Anti Natalism is just a natural part of leftism and has been since the French Revolution over 200 years ago permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago The Fabian socialists are still going strong, and apparently Madami is connected to them. permalink parent award report block reply OrangeApple 3 points 4 days ago The Econmist X post was edited to word it differently now due to the backlash. permalink parent award report block reply load 2 more comments...\nmonkadelic 11 points 4 days ago This is the first I'm hearing this word casually used like its just a thing.  Its so stupid, its almost hard believe its anything but rage bait. permalink parent award report block reply\nZskills OP 10 points 4 days ago Yes, it is real.  I searched the article before posting. permalink parent award report block reply\nMegaboom2025 9 points 4 days ago (((Check the early life))) permalink parent award report block reply\nDangerous 5 points 4 days ago Why would they need to be a mod on some backwater corner of the internet? Anti Natalism is just a natural part of leftism and has been since the French Revolution over 200 years ago permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago The Fabian socialists are still going strong, and apparently Madami is connected to them. permalink parent award report block reply\nTrumpAndGodWin 1 points 4 days ago The Fabian socialists are still going strong, and apparently Madami is connected to them. permalink parent award report block reply\nOrangeApple 3 points 4 days ago The Econmist X post was edited to word it differently now due to the backlash. permalink parent award report block reply\nUSPatriot45 24 points 4 days ago the insidious plot of WHITE PEOPLE having children, SPECIFICALLY. permalink award report block reply TrumpAndGodWin 6 points 4 days ago Whites are a world minority at only seven percent of the population. Whites are also the most capable of defeating the evil globalists which is why we're being attacked so much. permalink parent award report block reply\nTrumpAndGodWin 6 points 4 days ago Whites are a world minority at only seven percent of the population. Whites are also the most capable of defeating the evil globalists which is why we're being attacked so much. permalink parent award report block reply\nFemale 23 points 4 days ago I see The Economist hired the impossible1 permalink award report block reply Dangerous 11 points 4 days ago Kek permalink parent award report block reply GodSaveTheWest 3 points 4 days ago I think hes against women existing in general, not just white ones. permalink parent award report block reply GatoradeJeb 2 points 4 days ago Nah imp is retarded but not this retarded permalink parent award report block reply covok48 1 points 4 days ago Damn, LOL. And the editor was Antisimp. permalink parent award report block reply\nDangerous 11 points 4 days ago Kek permalink parent award report block reply\nGodSaveTheWest 3 points 4 days ago I think hes against women existing in general, not just white ones. permalink parent award report block reply\nGatoradeJeb 2 points 4 days ago Nah imp is retarded but not this retarded permalink parent award report block reply\ncovok48 1 points 4 days ago Damn, LOL. And the editor was Antisimp. permalink parent award report block reply\nSanityGumby 17 points 4 days ago What is insidious about white people. We literally invented everything in the world permalink award report block reply ninabobby 9 points 4 days ago They don't want inventors, they want slaves. permalink parent award report block reply GatoradeJeb 3 points 4 days ago The left hates White man permalink parent award report block reply\nninabobby 9 points 4 days ago They don't want inventors, they want slaves. permalink parent award report block reply\nGatoradeJeb 3 points 4 days ago The left hates White man permalink parent award report block reply\nbearhugprolapse 16 points 4 days ago as a former white baby, this sounds to me like the economist is all eat up with the colic. permalink award report block reply\nHikedelics 16 points 4 days ago They fucking hate you and the fact that you and your kind have the audacity to still exist in the country your forefathers created. We cannot coexist with these people. One way or another one side is going to go away, and it would be about the gayest thing to ever happen in the history of the world if we were to let them win. permalink award report block reply\nn3IVI0 15 points 4 days ago But we DO want a whiter America. permalink award report block reply\nPsarg 15 points 4 days ago You not going extinct is evil. permalink award report block reply\nSHILL_DETECTOR 15 points 4 days ago was it an insidious project to flood the country with shitskins? permalink award report block reply Hanging_Chad 5 points 4 days ago yeah permalink parent award report block reply\nHanging_Chad 5 points 4 days ago yeah permalink parent award report block reply\nHellNoKameltoe 14 points 4 days ago The first thing America needs is to become Whiter. permalink award report block reply\nriceball99 14 points 4 days ago This is possibly the most evil, satanic headline I’ve ever seen. permalink award report block reply\naltYPNeT 13 points 4 days ago Jewish hands wrote that headline. permalink award report block reply\nMakeAmericaRichAgain 12 points 4 days ago It's only insidious when white people have their own children. This is evidenced by the tens of millions of non-white children who are subsidized by taxpayers every year. Can't afford your own kids, but you have to pay for everyone else's. Sounds fair. permalink award report block reply\nstingyarthropods 12 points 4 days ago i want a white only america at this point permalink award report block reply covok48 4 points 4 days ago Me too bro, me too. permalink parent award report block reply\ncovok48 4 points 4 days ago Me too bro, me too. permalink parent award report block reply\nslimcoat 10 points 4 days ago They're becoming more and more open about their hatred of white people. permalink award report block reply\nTrumpwon306 9 points 4 days ago Written by a jew. permalink award report block reply Americansupremacist0 6 points 4 days ago Every. Single. Fucking. Time. permalink parent award report block reply\nAmericansupremacist0 6 points 4 days ago Every. Single. Fucking. Time. permalink parent award report block reply\nonesummerdream 9 points 4 days ago My daughter & sil were just talking last night on what the best timing would be to go for their third. Currently at 2yo & 5mo. permalink award report block reply MAGAnic316 1 points 4 days ago We have 2 girls and a boy, all roughly 2 years apart from each other. It seems to be a good way to spread it. It was more or less the same with me and my siblings growing up. My wife is 11 years younger than her sister, so she was basically an only child for most of her childhood permalink parent award report block reply booblitchutz 1 points 4 days ago How can your daughter and sister-in-law have a baby? permalink parent award report block reply Aquamine-Amarine 2 points 4 days ago Son-in-law. permalink parent award report block reply onesummerdream 1 points 4 days ago 👍✌️ permalink parent award report block reply onesummerdream 1 points 4 days ago Science? permalink parent award report block reply\nMAGAnic316 1 points 4 days ago We have 2 girls and a boy, all roughly 2 years apart from each other. It seems to be a good way to spread it. It was more or less the same with me and my siblings growing up. My wife is 11 years younger than her sister, so she was basically an only child for most of her childhood permalink parent award report block reply\nbooblitchutz 1 points 4 days ago How can your daughter and sister-in-law have a baby? permalink parent award report block reply Aquamine-Amarine 2 points 4 days ago Son-in-law. permalink parent award report block reply onesummerdream 1 points 4 days ago 👍✌️ permalink parent award report block reply onesummerdream 1 points 4 days ago Science? permalink parent award report block reply\nAquamine-Amarine 2 points 4 days ago Son-in-law. permalink parent award report block reply onesummerdream 1 points 4 days ago 👍✌️ permalink parent award report block reply\nonesummerdream 1 points 4 days ago 👍✌️ permalink parent award report block reply\nonesummerdream 1 points 4 days ago Science? permalink parent award report block reply\nvongregormench 9 points 4 days ago The fact that it's even acceptable to say that making America whiter is \"insidious\" shows how far racism against whites has come. Yeah I want America whiter. Fuck you. permalink award report block reply GatoradeJeb 4 points 4 days ago Its genocide. White man are demonized and attacked while White woman are brainwashed to mudshark permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago Stage eight on the ten stages of genocide. permalink parent award report block reply\nGatoradeJeb 4 points 4 days ago Its genocide. White man are demonized and attacked while White woman are brainwashed to mudshark permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago Stage eight on the ten stages of genocide. permalink parent award report block reply\nDirk_Diggler 8 points 4 days ago \"Pro-natalist\"?  What a crazy term for a default position of any species.  The term also presupposes an \"anti-natalism\" position, which there is nothing natural at all about and sound like a pretty evil position to occupy. These people are fucking nuts. permalink award report block reply TrumpAndGodWin 4 points 4 days ago Evil wants to destroy and whites stand in their way. permalink parent award report block reply covok48 2 points 4 days ago They aren’t nuts. They hate you. permalink parent award report block reply\nTrumpAndGodWin 4 points 4 days ago Evil wants to destroy and whites stand in their way. permalink parent award report block reply\ncovok48 2 points 4 days ago They aren’t nuts. They hate you. permalink parent award report block reply\nDatamancer 7 points 4 days ago I actually enjoyed reading The Economist .... 25 years ago.  Fucking fuck. permalink award report block reply covok48 3 points 4 days ago It was trash then, you just weren’t as conservative. permalink parent award report block reply VienneseSunrise 2 points 4 days ago So many boomers will never be able to grasp the total monopoly they held on media. It was a case of not being able to see the forest for the trees. They basically exist in the Matrix. permalink parent award report block reply\ncovok48 3 points 4 days ago It was trash then, you just weren’t as conservative. permalink parent award report block reply VienneseSunrise 2 points 4 days ago So many boomers will never be able to grasp the total monopoly they held on media. It was a case of not being able to see the forest for the trees. They basically exist in the Matrix. permalink parent award report block reply\nVienneseSunrise 2 points 4 days ago So many boomers will never be able to grasp the total monopoly they held on media. It was a case of not being able to see the forest for the trees. They basically exist in the Matrix. permalink parent award report block reply\nCh3f4554551n 7 points 4 days ago Pro-natalist? This is a hair away from \"pro-existence.\" permalink award report block reply\nBigdeal 7 points 4 days ago Yes, White please. This country is better the Whiter it is. Diversity truly is a weakness when it comes to human civilization. permalink award report block reply\nTrancePhreak 6 points 4 days ago Have 3+ kids or you're just at replacement levels. Don't hit it and quit it, keep it in if you want to win! permalink award report block reply Zskills OP 5 points 4 days ago Marry, be fruitful, and multiply permalink parent award report block reply\nZskills OP 5 points 4 days ago Marry, be fruitful, and multiply permalink parent award report block reply\nAngeredKabar 6 points 4 days ago There's an insidious plot alright. But it's not this. permalink award report block reply\nRoadpower 6 points 4 days ago Wow, talk about taking off the mask. permalink award report block reply\nMintap 5 points 4 days ago Call them procreationists if you have to. They are the people who have created every Civilization. Don't be retarded and use some slur like pro-natalist. The anti-natalists (pro-sterilists) are the only people who have destroyed Civilizations. They are faggots and retards, and literally retard all of humanity. permalink award report block reply\nmailinvoter 5 points 4 days ago No minority should be shamed into self deletion. Damn, the media is racist. For those that only follow the herd, Whites are the minority of the world. permalink award report block reply\nSurferOnTheRhye 5 points 4 days ago It's in the complement of that headline that the truth is hiding in plain sight. If pro-natalism creates a whiter america, it logically follows that the anti-natalism they've been pushing for half a century creates a ... permalink award report block reply Zskills OP 1 points 4 days ago Chilling insight permalink parent award report block reply\nZskills OP 1 points 4 days ago Chilling insight permalink parent award report block reply\nGfloydvotestrump 5 points 4 days ago I have never met another person IRL who is \"proud\" to be child-free that wasn't a complete fucking loser in just about all aspects of their life. permalink award report block reply zooty 2 points 4 days ago I'm my 50s and watching my permanently childless friends start to wonder. Great vacation pics though. permalink parent award report block reply\nzooty 2 points 4 days ago I'm my 50s and watching my permanently childless friends start to wonder. Great vacation pics though. permalink parent award report block reply\nTwoWords 5 points 4 days ago Rothschild slop permalink award report block reply\nJohnMiller2020 5 points 4 days ago Pro natalists.... You mean normal fucking human beings?? The 95% of all people?? permalink award report block reply\nDeepStateParasite 5 points 4 days ago (((God forbid white Americans have children. How insidious!))) permalink award report block reply\nIce_Joker 5 points 4 days ago Have more babies. This is your sign. permalink award report block reply\nterribletwos 5 points 4 days ago They build these articles backwards. They start with their goal, in this case is to make a less white America, and then they frame the articles to get to their goaled premise. So that's why these stories are always nonsensical if you read them forward, but if assume that they're not real articles but just shitty propaganda instead. The logical flow snaps right into place. permalink award report block reply\n1DontTreadOnMe1 5 points 4 days ago The more white people there are the better the world gets. The opposite is also true. permalink award report block reply\nGodSaveTheWest 5 points 4 days ago Basically outright saying they want white people replaced by migrants. permalink award report block reply\nRockyBalboa 5 points 4 days ago Anytime I see a movie that romanticizes any period in American culture, it is usually in the 1950's (+ or - ten years) and populated with white society and white culture. Seems like the whiter American society is, the more likely it will be depicted as the ideal time and ideal place to be in tv, movies, and novels. Am I wrong? permalink award report block reply TrumpAndGodWin 6 points 4 days ago In the 1950s middle class Americans had over fifty percent of the world's wealth (at only four percent of the world's population). permalink parent award report block reply\nTrumpAndGodWin 6 points 4 days ago In the 1950s middle class Americans had over fifty percent of the world's wealth (at only four percent of the world's population). permalink parent award report block reply\nBackslash2099 4 points 4 days ago The left: \"The birthrate is to low, we need to import people\" White people: \"ok we'll increase the birthrate by having more babies\" The left: \"no not more white people having babies!!!111\" permalink award report block reply\nutfanx2 4 points 4 days ago Boom baby boom! permalink award report block reply\ncall-it-like-i-sees 4 points 4 days ago It's a plot to create a more American America. permalink award report block reply\nHikedelics 4 points 4 days ago sets down coffee “I should make another kid..” permalink award report block reply\nfreedom2520 4 points 4 days ago You don't hate the media enough permalink award report block reply\nTacticalsmoke420 4 points 4 days ago My wife is pregnant and we are having a baby! permalink award report block reply\ningrowntoenail 4 points 4 days ago About 7 years ago when my daughter got pregnant again I told her thanks for increasing the white population.  She already had 4 with a set of twins from the second pregnancy.  She didn't like that comment and I knew she wouldn't because she's the type that hangs a black lives matter sign.  I heard her husband laugh in the background.  He's from Australia and hates the blacks and aborigines there. permalink award report block reply current_horror 3 points 4 days ago A based Australian son-in-law sounds like hitting the jackpot. permalink parent award report block reply\ncurrent_horror 3 points 4 days ago A based Australian son-in-law sounds like hitting the jackpot. permalink parent award report block reply\nKlown_Kutz 4 points 4 days ago Bet I nose who wrote this! permalink award report block reply\nJoeBidensDementia1 4 points 4 days ago 1 Muslim will have 4 or 5 wives with 20 kids. These \"journalists\" don't have a problem with Muslim nations remaining such while overpopulating all others. permalink award report block reply\nPensivePatriot 4 points 4 days ago Imagine calling the biological imperative “pro natalism”. This is literally a death cult. permalink award report block reply\nTwoArizonaPedes 4 points 4 days ago HAHAHA those little MAGA hats! permalink award report block reply\nDesktop 4 points 4 days ago MAWA! permalink award report block reply\nNanteen 3 points 4 days ago 4 kids here. I'm doing my part https://share.google/images/wJZrSD0wrj0dBl1fy permalink award report block reply\nMoose_Antlers 3 points 4 days ago I wish these racists would get called out when they dog whistle like that. Just say it, creeps. You hate white people and prefer literally anyone else. permalink award report block reply\nSmurfection 3 points 4 days ago White Man Bad.   - TheNews™ permalink award report block reply\n4886Battery 3 points 4 days ago This is very true.  I know that when my wife and I first started to consider having a child one of our biggest pros involved making America more White.  It worked so well with the first child that we decided to make America more White five more times!  6x more Whitess than we were pre-kids! permalink award report block reply\nthelastlast 3 points 4 days ago i know this is ragebait but i still must know the authors early life permalink award report block reply\nDiamondDroid 3 points 4 days ago Damn straight! We have too many non- contributors already. Eat bacon or leave. permalink award report block reply\nSavingPrivateGrace 3 points 4 days ago Whatever pro abortion journalists write it's twisted.  Don't even link the article, please. permalink award report block reply\nKeiichi81 3 points 4 days ago White people breeding?! HOW INSIDIOUS! permalink award report block reply\nhoodar 3 points 4 days ago White people, start boning other white people. Trust the plan. permalink award report block reply\nRyanKeyOh 3 points 4 days ago Creating a darker America = Progress Creating a whiter america = Nazism permalink award report block reply\ndelnaga 3 points 4 days ago Do it! Let’s get the baby train going. We need to all be having 10 kids. permalink award report block reply\nGuerillaYourDreams 3 points 4 days ago Insidious Whiteness sounds like a good name for a thrash metal band! permalink award report block reply\nBidensmellslikepiss 3 points 4 days ago Tacit admission that brownifying America is their goal. permalink award report block reply\nKamalaharrisisacunt 3 points 4 days ago I am all for a Whiter America. Convservative White Americans. Commies of every color can take a long walk off a short pier. permalink award report block reply\njournalist 3 points 4 days ago The whiter the better. permalink award report block reply\nJohnyBlaze99 2 points 4 days ago We did our part lol permalink award report block reply\nParticleCannon 2 points 4 days ago White Natalism strikes again! permalink award report block reply\nFromTheTopRope 2 points 4 days ago Pronatalism includes welfare queens. I accept your downvotes. permalink award report block reply Female 9 points 4 days ago 3 Lo, children are an heritage of the LORD: and the fruit of the womb is his reward. 4 As arrows are in the hand of a mighty man; so are children of the youth. 5 Happy is the man that hath his quiver full of them: they shall not be ashamed, but they shall speak with the enemies in the gate. Psalms 127 KJV permalink parent award report block reply CommanderOfCheese 8 points 4 days ago You'd be shocked at how much the Bible ties \"blessedness\" with fertility. permalink parent award report block reply Dangerous 3 points 4 days ago All normal humans do. I'm sure even the baby killing Aztecs did permalink parent award report block reply CommanderOfCheese 4 points 4 days ago Interesting to see how it impacts society when they don't value fertility. Apparently some time in early history there was a plant that worked as birth control. When humans discovered it (this was prior to the development of agriculture) they used it to the plant's extinction. According to the Book of Jasher (take it how you will) before the Flood the culture was such that the women would drink a draught that would render them infertile so they wouldn't lose their beauty, and Enoch and his followers were among the last still having children. Altogether the picture is so horrible that no wonder wiping out literally everyone was deemed the only solution by God. I'm not against birth control as a whole, but I emphasize that it should be birth control and not permanent birth prevention. permalink parent award report block reply view 2 more comments... current_horror 1 points 4 days ago The welfare queens exist regardless of whether or not we encourage child birth lol permalink parent award report block reply\nFemale 9 points 4 days ago 3 Lo, children are an heritage of the LORD: and the fruit of the womb is his reward. 4 As arrows are in the hand of a mighty man; so are children of the youth. 5 Happy is the man that hath his quiver full of them: they shall not be ashamed, but they shall speak with the enemies in the gate. Psalms 127 KJV permalink parent award report block reply CommanderOfCheese 8 points 4 days ago You'd be shocked at how much the Bible ties \"blessedness\" with fertility. permalink parent award report block reply Dangerous 3 points 4 days ago All normal humans do. I'm sure even the baby killing Aztecs did permalink parent award report block reply CommanderOfCheese 4 points 4 days ago Interesting to see how it impacts society when they don't value fertility. Apparently some time in early history there was a plant that worked as birth control. When humans discovered it (this was prior to the development of agriculture) they used it to the plant's extinction. According to the Book of Jasher (take it how you will) before the Flood the culture was such that the women would drink a draught that would render them infertile so they wouldn't lose their beauty, and Enoch and his followers were among the last still having children. Altogether the picture is so horrible that no wonder wiping out literally everyone was deemed the only solution by God. I'm not against birth control as a whole, but I emphasize that it should be birth control and not permanent birth prevention. permalink parent award report block reply view 2 more comments...\nCommanderOfCheese 8 points 4 days ago You'd be shocked at how much the Bible ties \"blessedness\" with fertility. permalink parent award report block reply Dangerous 3 points 4 days ago All normal humans do. I'm sure even the baby killing Aztecs did permalink parent award report block reply CommanderOfCheese 4 points 4 days ago Interesting to see how it impacts society when they don't value fertility. Apparently some time in early history there was a plant that worked as birth control. When humans discovered it (this was prior to the development of agriculture) they used it to the plant's extinction. According to the Book of Jasher (take it how you will) before the Flood the culture was such that the women would drink a draught that would render them infertile so they wouldn't lose their beauty, and Enoch and his followers were among the last still having children. Altogether the picture is so horrible that no wonder wiping out literally everyone was deemed the only solution by God. I'm not against birth control as a whole, but I emphasize that it should be birth control and not permanent birth prevention. permalink parent award report block reply view 2 more comments...\nDangerous 3 points 4 days ago All normal humans do. I'm sure even the baby killing Aztecs did permalink parent award report block reply CommanderOfCheese 4 points 4 days ago Interesting to see how it impacts society when they don't value fertility. Apparently some time in early history there was a plant that worked as birth control. When humans discovered it (this was prior to the development of agriculture) they used it to the plant's extinction. According to the Book of Jasher (take it how you will) before the Flood the culture was such that the women would drink a draught that would render them infertile so they wouldn't lose their beauty, and Enoch and his followers were among the last still having children. Altogether the picture is so horrible that no wonder wiping out literally everyone was deemed the only solution by God. I'm not against birth control as a whole, but I emphasize that it should be birth control and not permanent birth prevention. permalink parent award report block reply view 2 more comments...\nCommanderOfCheese 4 points 4 days ago Interesting to see how it impacts society when they don't value fertility. Apparently some time in early history there was a plant that worked as birth control. When humans discovered it (this was prior to the development of agriculture) they used it to the plant's extinction. According to the Book of Jasher (take it how you will) before the Flood the culture was such that the women would drink a draught that would render them infertile so they wouldn't lose their beauty, and Enoch and his followers were among the last still having children. Altogether the picture is so horrible that no wonder wiping out literally everyone was deemed the only solution by God. I'm not against birth control as a whole, but I emphasize that it should be birth control and not permanent birth prevention. permalink parent award report block reply view 2 more comments...\ncurrent_horror 1 points 4 days ago The welfare queens exist regardless of whether or not we encourage child birth lol permalink parent award report block reply\nRememberCharlieKirk 2 points 4 days ago Link: https://xcancel.com/TheEconomist/status/1986831038576841202 permalink award report block reply\nJesusTheOnlyWay 2 points 4 days ago They hate whites because their father (the Devil) told them to hate whites. They are fools being used to accomplish Satan's plans permalink award report block reply\nEaszq8 2 points 4 days ago “White people are the Original Sin of Peoplekind ™️. Once they have all been purged we shall know intersectional heaven on Earth.” permalink award report block reply\nhey_spike 2 points 4 days ago The label \"Pro-natalism\" makes making babies seem like a political act. permalink award report block reply\nhey_spike 2 points 4 days ago Single white male seeks pro-natalist white female who can cook. permalink award report block reply\nSickOfNeoPolitics 2 points 3 days ago Yeah sure people carrying on and reproducing as normal is an \"insidious project\" fine. But then what pray tell is the UN replacement migration plan? permalink award report block reply\nAwareandNonCompliant 2 points 4 days ago Please tell me this is the Bee 🙄 permalink award report block reply\nFretNoise14 2 points 4 days ago Makes me want to reverse my vasectomy permalink award report block reply\nblue5707 2 points 4 days ago Do it more... permalink award report block reply\nmonkadelic 2 points 4 days ago If the author of this article is white, they should help the \"problem\" by jumping off a cliff.  Its reverse-natal-ism.  I coined it first, but you guys can use it. permalink award report block reply\nelpoePehTeW 2 points 4 days ago My wife and I are doing our part! Child #6 was born this year! permalink award report block reply Nellie_the_Beaut 2 points 4 days ago Excellent job! Congratulations on your fruitful household! permalink parent award report block reply\nNellie_the_Beaut 2 points 4 days ago Excellent job! Congratulations on your fruitful household! permalink parent award report block reply\nGreenblatts_4skin 2 points 4 days ago they hate white people. permalink award report block reply\nStolen 2 points 4 days ago The shit that faux intellectuals come up with . Always racism, misogyny, pronatalism,  and xenophobia.  JD only has half whiter kids. The Economist can blow it out of their ass on this one. permalink award report block reply\nDereliction 2 points 4 days ago Insidious! permalink award report block reply\nZippythekid 2 points 4 days ago Yes that is exactly why permalink award report block reply\nNipplebuddy 2 points 4 days ago Be fruitful and multiply permalink award report block reply\nspezisacuckold 2 points 4 days ago That's exactly the goal only a racist would be against that permalink award report block reply\nGreyKnight 2 points 4 days ago So…well…how am I to infer anything other than an internationalist, pro-immigration, anti-white bias from this title…? permalink award report block reply\nCANATIVE 2 points 4 days ago Make America 1950 again permalink award report block reply\ngriff 2 points 4 days ago In response to the insidious LONG RUNNING ACTIONS to create a non-white America. They can fuck right off. permalink award report block reply\nApplyingForce 2 points 4 days ago Pure. Evil. permalink award report block reply\nMike_Hoxbigg 2 points 4 days ago \"A Whiter America\" -- ideally! permalink award report block reply\nMarkosis17 2 points 4 days ago The whiter the better. I guess that makes me a white supremacist. And I don’t give a fuck anymore. permalink award report block reply\nbh506407 2 points 4 days ago Oh no a nation founded by white people are having babies in their own country, how insidious indeed. Fuck off, “some critics.” permalink award report block reply\nDesensitized 2 points 4 days ago If our punishment for being white is not having children, why is not having children celebrated among their elite? permalink award report block reply\nTheAttackTitan 2 points 4 days ago Mask off permalink award report block reply\nI_Love_45-70_Gov 2 points 4 days ago Yes. permalink award report block reply\nwmmiv2016v2 2 points 4 days ago Gay, NAtional ZIonist propaganda. permalink award report block reply\nnewuser8 2 points 4 days ago Holy shit do they hate us. permalink award report block reply\nConfusedAngryArmed 2 points 4 days ago (((Some critics))) permalink award report block reply\n5DchessWatch 2 points 4 days ago CLAP CLAP CLAP Very well done, deepstate you've made the very act of white people having children, racist permalink award report block reply\nBrewSwillis 1 points 4 days ago \"Breeding your way into power is only ok when black and brown people do it, you guys!!¡!\" permalink award report block reply\nsemsem 1 points 4 days ago With Obama and Biden in power, many pro-immigrationists believe this is the moment to jump-start anchor-baby-making. But some critics see pro-immigrationism as a part of an insidious project to create a browner America permalink award report block reply\nStallionstyle 1 points 4 days ago Cards revealed. Blame others of what you are guilty of. Alinsky playbook confirmed. The insidious plot is the Great Replacement. permalink award report block reply\nThe_Morrow_Outlander 1 points 4 days ago And why would a BLACKER, YELLOWER or BROWNER America be better? Let competent, willing people who can afford it have kids. If you  have a problem with the fact that most of those people are white, devote YOUR OWN life and resources to not only lifting, but teaching non-whites how to STAY up on their own. NOT to trying to stop people who are happy and fit to become parents from starting families. permalink award report block reply\nconservatarian 1 points 4 days ago Checks \"Early Life\" permalink award report block reply\nBrownwaterboys 1 points 4 days ago What's wrong with a whiter America? permalink award report block reply\nJackLemon 1 points 4 days ago Written by Barclay Bram, hmmm https://x.com/NwrdScissrhands/status/1986914060651405421 permalink award report block reply\nSimaYi 1 points 4 days ago They hate you, want you dead and your children raped, and they think it's funny. White supremacist yet? permalink award report block reply\nLulzokbro 1 points 4 days ago Whites are too expensive and too hard to control, they have to go permalink award report block reply\nForty_Five 1 points 4 days ago There is no chance for reconciliation at the point. permalink award report block reply\nEvensoAmen 1 points 4 days ago MAWA? permalink award report block reply\nbillybaldwin2 1 points 4 days ago Just saw some news piece about how 6 flight nurses on the same floor of a hospital are all 8 months pregnant. Wow crazy. What was so good all 6 would just get pregnant? https://www.msn.com/en-us/health/other/6-university-of-chicago-flight-nurses-become-pregnant-at-same-time/ar-AA1Q0eyo permalink award report block reply\nJackOfAllTirades 1 points 4 days ago Guilty as charged. permalink award report block reply\nParalax 1 points 4 days ago Any less White and we are a failed state… permalink award report block reply\nbillybaldwin2 1 points 4 days ago You can't stop my brother Alec from being white with his Latina bride and having 8 kids. Take that! permalink award report block reply\nGrindelwald 1 points 4 days ago And what is wrong with that? The left has their abortion rights, their single mother rights, their cat lady rights, their lesbian rights, etc.  none of which promotes children, families and actual procreation.  So someone has to do it. permalink award report block reply\nSmokeyAF 1 points 4 days ago Joyous news, planning our first grandpede !\n🇺🇸🫡💪🙏. permalink award report block reply\nGnometard 1 points 4 days ago White women vote for democrats, you'd have to be a retard to support white because white. Hell, Biden is white! permalink award report block reply\nphro 1 points 4 days ago If the Kalergi plan is a racist conspiracy theory than so is the inverse-Kalergi plan. permalink award report block reply\nTrajano 1 points 4 days ago They really want to exterminate humanity. Who, besides a deranged lunatic, would use the term \"pro-natalism\"? permalink award report block reply\nBooKoo 1 points 4 days ago I think couples should be able to afford groceries for themselves before bringing a baby into the equation permalink award report block reply monkadelic 7 points 4 days ago Babies are cheap.  If you wait to afford kids you'll never have them.  While I agree with the sentiment, certain demographics don't give a shit, so white people shouldn't either. permalink parent award report block reply BooKoo -1 points 4 days ago \"Babies are cheap\" bro get the fuck outta here, I'm not even going to dignify that statement 😂 It's irresponsible to bring children into a life when you can't even afford to cover your own needs.  Fix the economy and I guarantee people will start pushing those puppies out by the dozens again. permalink parent award report block reply current_horror 9 points 4 days ago No. Blaming the economy is a bullshit excuse for selfish hedonists who prioritize themselves over their culture, their people, and their nation. 99% of humans were born into poverty we can’t even imagine. The poorest people in the world today have the most children. It’s not about “the economy”. Collapsing birth rates are almost entirely correlated with women spending 75% of their fertility window in school, at work, or “finding themselves”. Feminism is the most destructive ideology in history. permalink parent award report block reply BooKoo 0 points 4 days ago \"99% of humans were born into poverty we can’t even imagine.\" yeah dipshit.  that's not a good thing.  And it's not fair to the child you claim to care so much about.  People aren't cattle who are put here on this Earth just to breed. Society has progressed despite your weird Christian Nationalist beliefs. you want to have 12 kids and live in a trailer park then have at it hoss.  It's a free country.  Just remember, don't blame everyone else when your poor decisions come back to bite you AND your poor ass kids in the ass. permalink parent award report block reply view 1 more comments... newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nmonkadelic 7 points 4 days ago Babies are cheap.  If you wait to afford kids you'll never have them.  While I agree with the sentiment, certain demographics don't give a shit, so white people shouldn't either. permalink parent award report block reply BooKoo -1 points 4 days ago \"Babies are cheap\" bro get the fuck outta here, I'm not even going to dignify that statement 😂 It's irresponsible to bring children into a life when you can't even afford to cover your own needs.  Fix the economy and I guarantee people will start pushing those puppies out by the dozens again. permalink parent award report block reply current_horror 9 points 4 days ago No. Blaming the economy is a bullshit excuse for selfish hedonists who prioritize themselves over their culture, their people, and their nation. 99% of humans were born into poverty we can’t even imagine. The poorest people in the world today have the most children. It’s not about “the economy”. Collapsing birth rates are almost entirely correlated with women spending 75% of their fertility window in school, at work, or “finding themselves”. Feminism is the most destructive ideology in history. permalink parent award report block reply BooKoo 0 points 4 days ago \"99% of humans were born into poverty we can’t even imagine.\" yeah dipshit.  that's not a good thing.  And it's not fair to the child you claim to care so much about.  People aren't cattle who are put here on this Earth just to breed. Society has progressed despite your weird Christian Nationalist beliefs. you want to have 12 kids and live in a trailer park then have at it hoss.  It's a free country.  Just remember, don't blame everyone else when your poor decisions come back to bite you AND your poor ass kids in the ass. permalink parent award report block reply view 1 more comments... newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBooKoo -1 points 4 days ago \"Babies are cheap\" bro get the fuck outta here, I'm not even going to dignify that statement 😂 It's irresponsible to bring children into a life when you can't even afford to cover your own needs.  Fix the economy and I guarantee people will start pushing those puppies out by the dozens again. permalink parent award report block reply current_horror 9 points 4 days ago No. Blaming the economy is a bullshit excuse for selfish hedonists who prioritize themselves over their culture, their people, and their nation. 99% of humans were born into poverty we can’t even imagine. The poorest people in the world today have the most children. It’s not about “the economy”. Collapsing birth rates are almost entirely correlated with women spending 75% of their fertility window in school, at work, or “finding themselves”. Feminism is the most destructive ideology in history. permalink parent award report block reply BooKoo 0 points 4 days ago \"99% of humans were born into poverty we can’t even imagine.\" yeah dipshit.  that's not a good thing.  And it's not fair to the child you claim to care so much about.  People aren't cattle who are put here on this Earth just to breed. Society has progressed despite your weird Christian Nationalist beliefs. you want to have 12 kids and live in a trailer park then have at it hoss.  It's a free country.  Just remember, don't blame everyone else when your poor decisions come back to bite you AND your poor ass kids in the ass. permalink parent award report block reply view 1 more comments... newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\ncurrent_horror 9 points 4 days ago No. Blaming the economy is a bullshit excuse for selfish hedonists who prioritize themselves over their culture, their people, and their nation. 99% of humans were born into poverty we can’t even imagine. The poorest people in the world today have the most children. It’s not about “the economy”. Collapsing birth rates are almost entirely correlated with women spending 75% of their fertility window in school, at work, or “finding themselves”. Feminism is the most destructive ideology in history. permalink parent award report block reply BooKoo 0 points 4 days ago \"99% of humans were born into poverty we can’t even imagine.\" yeah dipshit.  that's not a good thing.  And it's not fair to the child you claim to care so much about.  People aren't cattle who are put here on this Earth just to breed. Society has progressed despite your weird Christian Nationalist beliefs. you want to have 12 kids and live in a trailer park then have at it hoss.  It's a free country.  Just remember, don't blame everyone else when your poor decisions come back to bite you AND your poor ass kids in the ass. permalink parent award report block reply view 1 more comments... newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBooKoo 0 points 4 days ago \"99% of humans were born into poverty we can’t even imagine.\" yeah dipshit.  that's not a good thing.  And it's not fair to the child you claim to care so much about.  People aren't cattle who are put here on this Earth just to breed. Society has progressed despite your weird Christian Nationalist beliefs. you want to have 12 kids and live in a trailer park then have at it hoss.  It's a free country.  Just remember, don't blame everyone else when your poor decisions come back to bite you AND your poor ass kids in the ass. permalink parent award report block reply view 1 more comments...\nnewdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nbenjovikenobi 1 points 4 days ago What an odd way to say that white people are the only demographic not having as many babies as possible. permalink award report block reply\nleast_counties_ever 1 points 4 days ago The word \"insidious\" in this context reveals the author to be pure evil. permalink award report block reply\nFrankWisner 1 points 4 days ago No Link = You eat cocks after 5pm: every day. You need some link skills, retard. permalink award report block reply Zskills OP 1 points 4 days ago https://www.economist.com/1843/2025/11/06/make-america-procreate-again-among-the-maga-fertility-fanatics You have about as good of manners as my toddler. permalink parent award report block reply FrankWisner 2 points 4 days ago Raise us well, Sir. permalink parent award report block reply\nZskills OP 1 points 4 days ago https://www.economist.com/1843/2025/11/06/make-america-procreate-again-among-the-maga-fertility-fanatics You have about as good of manners as my toddler. permalink parent award report block reply FrankWisner 2 points 4 days ago Raise us well, Sir. permalink parent award report block reply\nFrankWisner 2 points 4 days ago Raise us well, Sir. permalink parent award report block reply\nSpermythecat 1 points 4 days ago Is this a bee article? permalink award report block reply Zskills OP 1 points 4 days ago https://www.economist.com/1843/2025/11/06/make-america-procreate-again-among-the-maga-fertility-fanatics permalink parent award report block reply\nZskills OP 1 points 4 days ago https://www.economist.com/1843/2025/11/06/make-america-procreate-again-among-the-maga-fertility-fanatics permalink parent award report block reply\nInfinitesimalOrange 1 points 4 days ago Whoever wrote this is so racist if they got beaten to death in front of me I'd laugh in their face as they died. permalink award report block reply\nHeavyMetalPatriot 1 points 4 days ago The natalists need to figure out WHAT their White children are going to do in life in the age of AI and automation. If you haven't heard about Agentic AI, I highly recommend looking it up. It's the power to nuke 70% of jobs and nobody in power is talking about what to do with these 100M unemployed people. permalink award report block reply\ndonteatthat 1 points 4 days ago I WANT A WHITER AMERICA permalink award report block reply\nsir_rockness 1 points 4 days ago I wish I could pump some young nubile hotties and make a whiter America but I'm older and married.   Seems fun though permalink award report block reply\nredditadminssuckit 1 points 4 days ago Yes.  Whiter is righter permalink award report block reply\nbrewser724 1 points 4 days ago Yes, so? permalink award report block reply\nlolpaladins 1 points 4 days ago Those crazy \"pro-natalist\" policies like... affordable housing? living wage? fuck the anti-human death cult. permalink award report block reply\nFormerlurker92 1 points 4 days ago If Ilook at this person's early life section, what am I gonna find? permalink award report block reply\nRoosterRaiser 1 points 4 days ago I just can't with these people. SMH permalink award report block reply\nTacitus1963 1 points 4 days ago The whole point of flooding traditionally white and Christian countries with 3rd worlders like the Muslims, Indians, etc. is that over time through miscegenation, the white population will be bred out. As it stands, whites are only 8% of the world's population.\nIn Denmark, there are now advertisements that whites mating with whites is inbreeding that they should be mating with the new \"diversity.\"\nThis was always part of the Kalergi Plan which has been applied on steroids to the US, Canada, Australia, New Zealand and Europe. The only countries not experiencing  this are Poland and Hungary which don't allow the filth in.\nCheck what Barbara Lerner Spectre has to say about Europe.\nThese are the same people behind the invasion of all the above countries. permalink award report block reply\nRyanKeyOh 1 points 4 days ago Anyone have that original image? It’s excellent permalink award report block reply\ndillster 1 points 4 days ago dumbasses.  whites are only 7-8 percent of the global population so stop the grade school bullying.   economist is racist. permalink award report block reply\nSuperHonkey 1 points 4 days ago You damn rite! permalink award report block reply\nbarwhack 1 points 4 days ago Demographics rule. If you want a West, that is formed - historically - by the minority White population. If you want a Middle East, that is formed - historically - by a brown population among many brown populations, together comprising the majority. If you want an East, that is formed - historically - by a large yellow population, who are really just light brown. If you want gay faggotry, you mix all that up and take the worst of each, and call it rainbow. 👨🏿‍❤️‍👨🏿 Multiculturalism is subtractive color mixing; pun intended . And depriving Whites of nationhood, of homeland, and of family ... is evil. MO for leftism, though. permalink award report block reply\nSeeker_17 1 points 4 days ago Whiter = better permalink award report block reply\npattrn 1 points 4 days ago Implication here is that MAGA is a white movement. It’s not. It’s a pro-America movement. permalink award report block reply\ngustodog 1 points 4 days ago Further confirmation of The Great Replacement. permalink award report block reply\nlul_cheto 1 points 4 days ago they on to us boys. permalink award report block reply\nlul_cheto 1 points 4 days ago They on to us.. Fuentes has it wrong.. well never get them all out, best we can do is dilute and breed out.. Do your part.. drop a white baby in an invader 🫡 permalink award report block reply Americansupremacist0 1 points 4 days ago Faggot. permalink parent award report block reply lul_cheto 1 points 4 days ago Great plan, tell me more permalink parent award report block reply Americansupremacist0 2 points 4 days ago Make more white babies, pretty simple stuff. permalink parent award report block reply\nAmericansupremacist0 1 points 4 days ago Faggot. permalink parent award report block reply lul_cheto 1 points 4 days ago Great plan, tell me more permalink parent award report block reply Americansupremacist0 2 points 4 days ago Make more white babies, pretty simple stuff. permalink parent award report block reply\nlul_cheto 1 points 4 days ago Great plan, tell me more permalink parent award report block reply Americansupremacist0 2 points 4 days ago Make more white babies, pretty simple stuff. permalink parent award report block reply\nAmericansupremacist0 2 points 4 days ago Make more white babies, pretty simple stuff. permalink parent award report block reply\nDangerousAmerican76 1 points 4 days ago Fuck yes make more white babies! permalink award report block reply\nGhostOfTheRepublic 1 points 4 days ago A whiter America.  Sounds good permalink award report block reply\nRedeemable 1 points 4 days ago Why shouldn't America rreturn to it's 95% White status. permalink award report block reply\nhomertone 1 points 4 days ago The headline is not wrong it just isn't headline worthy. permalink award report block reply\nDem_slayer 1 points 4 days ago And? permalink award report block reply\nSeeker_17 1 points 4 days ago FUN FACT: The percentage of Whites increased since Trump started to deport. At the current rate, we will be back up to 75% by the time he's done. Add to that higher White fertility rates, mostly from conservatives. The Amish and other anabaptist groups will help too. permalink award report block reply\nWeaponizedSmirk 1 points 3 days ago Not surprised when I found out a gay Jewish man wrote this. Are you fucking noticing yet? permalink award report block reply\nLiberats 1 points 4 days ago It is. It should be. permalink award report block reply\ngoatnuts 0 points 4 days ago My pro natalist wife is only half white. We are making america better, more decent, more educated, one baby at a time, but also I'm introducing admixture of an also noble people. You can strengthen america with a little of that, all noble peoples had a little, you just have to be selective of which people you allow into your nation. And usually you want them to be women that marry in. Obese dregs washing up on the shore of the Rio grande ain't it. Self respecting people who's goal is to become american in every conceivable way are the only kind of immigrants I like, and also in manageable numbers. permalink award report block reply\nsnorkle 0 points 4 days ago They behave permalink award report block reply\nDagneyTaggart -7 points 4 days ago The Economist transitioned to a leftist rag in the mid ‘oughts. About the same time WSJ sold itself out to Murdoch. permalink award report block reply\nMAGABOND 6 points 4 days ago Comment removed by community moderators. permalink award report block reply\nTheGoyimWhisperer 2 points 4 days ago Comment removed upon the user being banned. permalink award report block reply 1_Badcop -1 points 4 days ago Updooted for the username permalink parent award report block reply\n1_Badcop -1 points 4 days ago Updooted for the username permalink parent award report block reply\nloosemoose 1 points 4 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T20:02:49.883566Z"
}