{
  "id": "1ARK512UFw",
  "url": "https://patriots.win/p/1ARK512UFw/not-only-do-we-need-mass-deporta/c",
  "content": "279 Not only do we need mass deportations, we also need a 99% reduction in legal immigration.\n\nThe only people who should be able to get a work visa should be superstars. \n\nThe H-1B program is a scam for driving down wages. posted 7 days ago by PiratePatriotParrot 8 comments award share report block Wall Street Mav @WallStreetMav • 7d Not only do we need mass deportations, we also need a 99% reduction in legal immigration. The only people who should be able to get a work visa should be superstars. The H-1B program is a scam for driving down wages.\n8 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Trooph-Hurts 10 points 7 days ago There are 125 million foreigners here….. 50 million on visas, 25 million visa overstay, and 50 million illegal…. All must go permalink award report block reply SubmarineGuy 7 points 7 days ago I wouldn't mind importing the white Europeans fleeing from the growing Islamic tyranny. And the White Farmers being murdered in South Africa. permalink award report block reply HeavyMetalPatriot 5 points 7 days ago The only immigration allowed should be Whites, proven geniuses and hot chicks. permalink parent award report block reply Filo76 2 points 7 days ago /subscribe permalink parent award report block reply Formerlurker92 1 points 6 days ago But they don't get voting rights. Im sorry, of you vote your way into refugee status, you don't have the mental acuity to participate in the political process anymore permalink parent award report block reply mymymyTuckerface 3 points 6 days ago Always has been, but now that our major companies have allowed Indians At c suite levels they have hired managers that are Indian and have taken over HR. Major reform is the only way to resolve this for America! permalink award report block reply Mhmm2MoreWeeks 1 points 6 days ago There is some number that existed before the Open Border. The composition of that group should be of people with something to contribute to America. It does not matter if its 10 thousand a year or 500 thousand so long as they are genuienly here to be Americans, and follow both rule of law and cultural norms. I am against open borders.\nI am against to many immigrants. The number and composition CAN and SHOULD be beneficial to America. That is my only requirement. I would actually trade Christian Nationalists and White Nationalists for Good Immigrants so long as they were genuine and sincere about being Americans, and skilled enough to be net contributors to the economy. Which is more then I can say about the average Groyper. permalink award report block reply Brownwaterboys 1 points 6 days ago I dont care who they are - kick anyone out if you came here after 2000 permalink award report block reply\nTrooph-Hurts 10 points 7 days ago There are 125 million foreigners here….. 50 million on visas, 25 million visa overstay, and 50 million illegal…. All must go permalink award report block reply\nSubmarineGuy 7 points 7 days ago I wouldn't mind importing the white Europeans fleeing from the growing Islamic tyranny. And the White Farmers being murdered in South Africa. permalink award report block reply HeavyMetalPatriot 5 points 7 days ago The only immigration allowed should be Whites, proven geniuses and hot chicks. permalink parent award report block reply Filo76 2 points 7 days ago /subscribe permalink parent award report block reply Formerlurker92 1 points 6 days ago But they don't get voting rights. Im sorry, of you vote your way into refugee status, you don't have the mental acuity to participate in the political process anymore permalink parent award report block reply\nHeavyMetalPatriot 5 points 7 days ago The only immigration allowed should be Whites, proven geniuses and hot chicks. permalink parent award report block reply Filo76 2 points 7 days ago /subscribe permalink parent award report block reply\nFilo76 2 points 7 days ago /subscribe permalink parent award report block reply\nFormerlurker92 1 points 6 days ago But they don't get voting rights. Im sorry, of you vote your way into refugee status, you don't have the mental acuity to participate in the political process anymore permalink parent award report block reply\nmymymyTuckerface 3 points 6 days ago Always has been, but now that our major companies have allowed Indians At c suite levels they have hired managers that are Indian and have taken over HR. Major reform is the only way to resolve this for America! permalink award report block reply\nMhmm2MoreWeeks 1 points 6 days ago There is some number that existed before the Open Border. The composition of that group should be of people with something to contribute to America. It does not matter if its 10 thousand a year or 500 thousand so long as they are genuienly here to be Americans, and follow both rule of law and cultural norms. I am against open borders.\nI am against to many immigrants. The number and composition CAN and SHOULD be beneficial to America. That is my only requirement. I would actually trade Christian Nationalists and White Nationalists for Good Immigrants so long as they were genuine and sincere about being Americans, and skilled enough to be net contributors to the economy. Which is more then I can say about the average Groyper. permalink award report block reply\nBrownwaterboys 1 points 6 days ago I dont care who they are - kick anyone out if you came here after 2000 permalink award report block reply",
  "fetched_at": "2025-11-12T20:57:10.597517Z"
}