{
  "id": "1ARK9iq7lr",
  "url": "https://patriots.win/p/1ARK9iq7lr/florida-ag-uthmeier-launches-inv/c",
  "content": "305 Florida AG Uthmeier launches investigation into JP Morgan Chase over collusion with Biden admin in Arctic Frost probe (thepostmillennial.com) posted 2 days ago by Sea_Still 11 comments award share report block Florida AG Uthmeier launches investigation into JP Morgan Chase over collusion with Biden admin in Arctic Frost probe The Biden DOJ “subpoenaed JPMC for ‘any and all records of TMTG.’” thepostmillennial.com\n11 comments Sort by Top Top New Worst Old Save Grindelwald 2 points 2 days ago JP Morgan funded Epstein as well. permalink award report block reply Choppermagic 2 points 2 days ago all the banks openly discriminated against Conservatives.  They need to be hurt badly as punishment. permalink award report block reply josiborg 1 points 2 days ago There's a specific train ride that needs officially investigated also permalink award report block reply facesmelt 0 points 2 days ago Uth meier Hmm interesting nobody is calling this guy some secret crypto-Jew or pointing out the size of his nose! permalink award report block reply YouEssAye 0 points 2 days ago Uh, I think you're retarded, and I think your reluctance to accept the truth regarding the JQ is a reflection of that retardation. Germanic surname =/= jewish Big nose =/= jewish permalink parent award report block reply facesmelt 0 points 2 days ago I agree… but whenever even someone who is ostensibly Christian has either a big nose or a Germanic surname, but does something people here disagree with, then dozens of demons crawl out of the woodwork and start accusing him of being a crypto Jew for those reasons alone. That’s literally the point I’m making. permalink parent award report block reply YouEssAye 0 points 2 days ago It's a dumb point because nobody here is calling this guy a cryptojew. Congrats, you sure owned that strawman. permalink parent award report block reply facesmelt 0 points 2 days ago Yeah… because they agree with what he is doing. You’re almost starting to understand the very obvious and clear point right in front of your face! Good job, buddy. permalink parent award report block reply view 3 more comments...\nGrindelwald 2 points 2 days ago JP Morgan funded Epstein as well. permalink award report block reply\nChoppermagic 2 points 2 days ago all the banks openly discriminated against Conservatives.  They need to be hurt badly as punishment. permalink award report block reply\njosiborg 1 points 2 days ago There's a specific train ride that needs officially investigated also permalink award report block reply\nfacesmelt 0 points 2 days ago Uth meier Hmm interesting nobody is calling this guy some secret crypto-Jew or pointing out the size of his nose! permalink award report block reply YouEssAye 0 points 2 days ago Uh, I think you're retarded, and I think your reluctance to accept the truth regarding the JQ is a reflection of that retardation. Germanic surname =/= jewish Big nose =/= jewish permalink parent award report block reply facesmelt 0 points 2 days ago I agree… but whenever even someone who is ostensibly Christian has either a big nose or a Germanic surname, but does something people here disagree with, then dozens of demons crawl out of the woodwork and start accusing him of being a crypto Jew for those reasons alone. That’s literally the point I’m making. permalink parent award report block reply YouEssAye 0 points 2 days ago It's a dumb point because nobody here is calling this guy a cryptojew. Congrats, you sure owned that strawman. permalink parent award report block reply facesmelt 0 points 2 days ago Yeah… because they agree with what he is doing. You’re almost starting to understand the very obvious and clear point right in front of your face! Good job, buddy. permalink parent award report block reply view 3 more comments...\nYouEssAye 0 points 2 days ago Uh, I think you're retarded, and I think your reluctance to accept the truth regarding the JQ is a reflection of that retardation. Germanic surname =/= jewish Big nose =/= jewish permalink parent award report block reply facesmelt 0 points 2 days ago I agree… but whenever even someone who is ostensibly Christian has either a big nose or a Germanic surname, but does something people here disagree with, then dozens of demons crawl out of the woodwork and start accusing him of being a crypto Jew for those reasons alone. That’s literally the point I’m making. permalink parent award report block reply YouEssAye 0 points 2 days ago It's a dumb point because nobody here is calling this guy a cryptojew. Congrats, you sure owned that strawman. permalink parent award report block reply facesmelt 0 points 2 days ago Yeah… because they agree with what he is doing. You’re almost starting to understand the very obvious and clear point right in front of your face! Good job, buddy. permalink parent award report block reply view 3 more comments...\nfacesmelt 0 points 2 days ago I agree… but whenever even someone who is ostensibly Christian has either a big nose or a Germanic surname, but does something people here disagree with, then dozens of demons crawl out of the woodwork and start accusing him of being a crypto Jew for those reasons alone. That’s literally the point I’m making. permalink parent award report block reply YouEssAye 0 points 2 days ago It's a dumb point because nobody here is calling this guy a cryptojew. Congrats, you sure owned that strawman. permalink parent award report block reply facesmelt 0 points 2 days ago Yeah… because they agree with what he is doing. You’re almost starting to understand the very obvious and clear point right in front of your face! Good job, buddy. permalink parent award report block reply view 3 more comments...\nYouEssAye 0 points 2 days ago It's a dumb point because nobody here is calling this guy a cryptojew. Congrats, you sure owned that strawman. permalink parent award report block reply facesmelt 0 points 2 days ago Yeah… because they agree with what he is doing. You’re almost starting to understand the very obvious and clear point right in front of your face! Good job, buddy. permalink parent award report block reply view 3 more comments...\nfacesmelt 0 points 2 days ago Yeah… because they agree with what he is doing. You’re almost starting to understand the very obvious and clear point right in front of your face! Good job, buddy. permalink parent award report block reply view 3 more comments...",
  "fetched_at": "2025-11-12T20:55:45.662127Z"
}