{
  "id": "1ARK9oW6ht",
  "url": "https://patriots.win/p/1ARK9oW6ht/youre-gd-right-/c",
  "content": "643 You're GD right posted 2 hours ago by magaMC117 52 comments award share download report block\n52 comments Sort by Top Top New Worst Old Save Get_Off_Big_Tech 36 points 2 hours ago They have nuclear families and strong communities. They don't need government for that. permalink award report block reply guywholikesDjtof2024 18 points 2 hours ago Nuclear power is great and good. Nuclear famililes are great and good. Nuclear is Always Best. permalink parent award report block reply SutopSutolf 12 points 1 hour ago The Amish don't need AI generated images either. permalink parent award report block reply midgetpornrocks 4 points 25 minutes ago Still amazing when you prompt AI to draw a hot chick holding a sign, the chick it draws is white. I wonder when that will change. permalink parent award report block reply Spindle-spin 0 points 1 hour ago Best we can do is more AI slop memes. All the memesmiths have gone out to pasture apparently. Remember 2016? There was video editing and decent Photoshop like it was a theatrical movie. Now we get none of that permalink parent award report block reply Get_Off_Big_Tech 5 points 2 hours ago Nuclear for clean energy and clean communities. permalink parent award report block reply Spindle-spin 2 points 1 hour ago Nothing wrong with gas and coal though. Coal can be cleaned. Families are clean. permalink parent award report block reply SavingPrivateGrace 2 points 2 hours ago Strong families, but there is a fear that controls that.  They get jobs at 14 when they complete school at the end of 8th grade.  Right after Rumspringa, 16, they contribute to being productive members of the community or they've left it and are shun forever.  Although shunning contributes to a strong family bond, it also breaks them. permalink parent award report block reply cyberrigger 1 points 51 minutes ago The Amish do a fish-ion permalink parent award report block reply dr_gonzo 12 points 2 hours ago There's a direct correlation between how much citizens of a country donate to charity and social welfare programs. So the more \"free shit\" a government hands out, the LESS its citizens donate to charity. And that's extremely unfortunate because the government is the worst possible entity to be handling charity.  It has no incentive whatsoever to restrict it. In fact, politicians are incentivized to get more and more people on the public dole so they can use that to get their votes. So what inevitably happens? Rampant abuse, just like we see today. That doesn't happen when charity is private and voluntary, because nobody in their right mind will just keep throwing money at someone that refuses to help themselves. Subjective judgments can be made, and they absolutely should be in the case of charity. Not to mention when it's private, the person paying the bills actually receives gratitude and they damn well deserve it. They're donating the product of their labor for your benefit instead of the benefit of their own friends and family. That fucking deserves a thank you. But when government does it, people feel entitled to the money. Christ, we even call them entitlement programs. How that term doesn't piss everyone off astounds me. permalink parent award report block reply squash1324 3 points 55 minutes ago Studies have been done, and the most generous people are Christians. permalink parent award report block reply dukeofdoorcounty 1 points 9 minutes ago When I knew my money was going to US citizens, I didn't mind donating to the local food bank.  Then they went woke and seem to only care about illegals.  Not a dime since. permalink parent award report block reply NotYourMan 2 points 2 hours ago This is the way of humans.  We have perverted it so that a few politicians can get rich. permalink parent award report block reply patrioticwinning3 1 points 1 hour ago And they are almost all farmers... permalink parent award report block reply LegendFang 15 points 2 hours ago And most of those kids know who their fathers are. permalink award report block reply MedicallyReddit 9 points 2 hours ago And they also don’t stab random people for no reason in broad daylight permalink parent award report block reply AcquittedZombieSlay -5 points 2 hours ago no just drown the husband and send the kids in the car in to the bottom of the lake to send them to god. Funny how yall like to throw around the amish but leave out the cult and communism part. permalink parent award report block reply Repentnow 1 points 15 minutes ago The Amish don't build walls to keep their people in. permalink parent award report block reply SupFrens 12 points 2 hours ago Because the Amish are all white. THAT IS WHY. White communities when left alone thrive. permalink award report block reply guywholikesDjtof2024 3 points 2 hours ago bbbbbbut muh rayyyycissmsmsmsmsmssmssmsms permalink parent award report block reply SupFrens 6 points 2 hours ago YES. permalink parent award report block reply guywholikesDjtof2024 0 points 2 hours ago Every ethnic group prioritizes their own. Where the \"bad\" thing is, is when claims that some don't come from Adam and Eve. We need a better definition of the term. permalink parent award report block reply TheSwampThang 10 points 2 hours ago They pass down property to their children.   They don't sell out to contractors. permalink award report block reply Klaus73 2 points 1 hour ago But what about the stock market and memes? permalink parent award report block reply Say_what_again 1 points 1 hour ago Best I can do is 50yr mortgages, AI, and H1Bs permalink parent award report block reply friedchicken 6 points 1 hour ago I mean; not everything about amish culture is chocolate covered puppies and roses. The irony of this \"picture\" being AI generated is palpable. permalink award report block reply ScrewReddit 0 points 49 minutes ago I just upvoted for the Monkey D. Luffy cosplay. permalink parent award report block reply LiquidSun 5 points 51 minutes ago Meh, false equivalence. They have land to tend and don't live in tenement buildings. permalink award report block reply Klaus73 4 points 1 hour ago I welcome the vast majority of folk on here to attempt to live a Amish life... ...go ahead..I'll wait. permalink award report block reply Lurkmoore 3 points 1 hour ago Yep. This obsession with praising the Amish lifestyle is silly. They have simply traded one set of problems for another. They are not nearly as independent as people like to pretend, either. permalink parent award report block reply Klaus73 1 points 29 minutes ago I mean...imagine trying to fight a war... permalink parent award report block reply mathteach314159 3 points 2 hours ago Yes and they are not consumers and they are fine with a simpler way of life. We should all take note. permalink award report block reply Mhmm2MoreWeeks 3 points 2 hours ago Their Woman do not hate their Civilization. Yours do. Keep sending your kids to public school. Then wonder why you have no grandkids. permalink award report block reply SanityGumby 1 points 1 hour ago Some do but if they do they don’t get to stay permalink parent award report block reply guywholikesDjtof2024 2 points 2 hours ago what is a GD? Globalist Donkeys? permalink award report block reply lothrop_evola 6 points 2 hours ago It's a Good Daughter. Those Amish raise their girls with good, wholesome values. permalink parent award report block reply LandscaperJuan 5 points 2 hours ago Gosh Darn! permalink parent award report block reply Aquamine-Amarine 2 points 2 hours ago God Damn. permalink parent award report block reply guywholikesDjtof2024 1 points 2 hours ago taking God's Name in vian, then sad permalink parent award report block reply CommanderOfCheese 2 points 52 minutes ago That's a misunderstanding of the commandment. To take the name of the Lord is to represent Him. To present his name as a token of trust. To claim to represent him. To take his name in vain, then, is to claim to represent him in order to gain trust when that trust is not warranted. permalink parent award report block reply EuphoricTrillby 1 points 2 hours ago Gosh, is this what working full time does to someone? permalink award report block reply Repentnow 1 points 21 minutes ago Lol. And they don't look like her! permalink award report block reply PatriotSam 1 points 1 hour ago Farming is a very underrated skill permalink award report block reply SanityGumby 1 points 1 hour ago They also have an average iq of 100 and work ethic brought on from God permalink award report block reply bemac 1 points 1 hour ago Bot image shit permalink award report block reply Cletusjames 1 points 1 hour ago And their kids don't play Hockey. permalink award report block reply Bohemyth_2 1 points 2 hours ago The Amish are big on fatherhood, family, and mothers who know that motherhood is what the definition of a woman is. permalink award report block reply BillyBobJimmyJoe 0 points 2 hours ago But do they have teeth to chew it? Checkmate. permalink award report block reply Ostia -3 points 2 hours ago They also share resources and labor in communal living communities. What’s that remind you of? Not the best example. permalink award report block reply Deplorable_in_PA 5 points 2 hours ago Disagree.  Co-ops have existed forever.  The difference is co-op is voluntary, Marxism is forced.  Many of the Nordic countries have done fine with a more socialized economic system.  But they were small, racially homogeneous, cohesive culture, shared vales, and everyone contributes. permalink parent award report block reply guywholikesDjtof2024 4 points 2 hours ago Volutarily? Or at gunpoint? permalink parent award report block reply Ostia 1 points 1 hour ago You think you’re not excommunicated if you don’t want to take part? permalink parent award report block reply\nGet_Off_Big_Tech 36 points 2 hours ago They have nuclear families and strong communities. They don't need government for that. permalink award report block reply guywholikesDjtof2024 18 points 2 hours ago Nuclear power is great and good. Nuclear famililes are great and good. Nuclear is Always Best. permalink parent award report block reply SutopSutolf 12 points 1 hour ago The Amish don't need AI generated images either. permalink parent award report block reply midgetpornrocks 4 points 25 minutes ago Still amazing when you prompt AI to draw a hot chick holding a sign, the chick it draws is white. I wonder when that will change. permalink parent award report block reply Spindle-spin 0 points 1 hour ago Best we can do is more AI slop memes. All the memesmiths have gone out to pasture apparently. Remember 2016? There was video editing and decent Photoshop like it was a theatrical movie. Now we get none of that permalink parent award report block reply Get_Off_Big_Tech 5 points 2 hours ago Nuclear for clean energy and clean communities. permalink parent award report block reply Spindle-spin 2 points 1 hour ago Nothing wrong with gas and coal though. Coal can be cleaned. Families are clean. permalink parent award report block reply SavingPrivateGrace 2 points 2 hours ago Strong families, but there is a fear that controls that.  They get jobs at 14 when they complete school at the end of 8th grade.  Right after Rumspringa, 16, they contribute to being productive members of the community or they've left it and are shun forever.  Although shunning contributes to a strong family bond, it also breaks them. permalink parent award report block reply cyberrigger 1 points 51 minutes ago The Amish do a fish-ion permalink parent award report block reply dr_gonzo 12 points 2 hours ago There's a direct correlation between how much citizens of a country donate to charity and social welfare programs. So the more \"free shit\" a government hands out, the LESS its citizens donate to charity. And that's extremely unfortunate because the government is the worst possible entity to be handling charity.  It has no incentive whatsoever to restrict it. In fact, politicians are incentivized to get more and more people on the public dole so they can use that to get their votes. So what inevitably happens? Rampant abuse, just like we see today. That doesn't happen when charity is private and voluntary, because nobody in their right mind will just keep throwing money at someone that refuses to help themselves. Subjective judgments can be made, and they absolutely should be in the case of charity. Not to mention when it's private, the person paying the bills actually receives gratitude and they damn well deserve it. They're donating the product of their labor for your benefit instead of the benefit of their own friends and family. That fucking deserves a thank you. But when government does it, people feel entitled to the money. Christ, we even call them entitlement programs. How that term doesn't piss everyone off astounds me. permalink parent award report block reply squash1324 3 points 55 minutes ago Studies have been done, and the most generous people are Christians. permalink parent award report block reply dukeofdoorcounty 1 points 9 minutes ago When I knew my money was going to US citizens, I didn't mind donating to the local food bank.  Then they went woke and seem to only care about illegals.  Not a dime since. permalink parent award report block reply NotYourMan 2 points 2 hours ago This is the way of humans.  We have perverted it so that a few politicians can get rich. permalink parent award report block reply patrioticwinning3 1 points 1 hour ago And they are almost all farmers... permalink parent award report block reply\nguywholikesDjtof2024 18 points 2 hours ago Nuclear power is great and good. Nuclear famililes are great and good. Nuclear is Always Best. permalink parent award report block reply SutopSutolf 12 points 1 hour ago The Amish don't need AI generated images either. permalink parent award report block reply midgetpornrocks 4 points 25 minutes ago Still amazing when you prompt AI to draw a hot chick holding a sign, the chick it draws is white. I wonder when that will change. permalink parent award report block reply Spindle-spin 0 points 1 hour ago Best we can do is more AI slop memes. All the memesmiths have gone out to pasture apparently. Remember 2016? There was video editing and decent Photoshop like it was a theatrical movie. Now we get none of that permalink parent award report block reply Get_Off_Big_Tech 5 points 2 hours ago Nuclear for clean energy and clean communities. permalink parent award report block reply Spindle-spin 2 points 1 hour ago Nothing wrong with gas and coal though. Coal can be cleaned. Families are clean. permalink parent award report block reply SavingPrivateGrace 2 points 2 hours ago Strong families, but there is a fear that controls that.  They get jobs at 14 when they complete school at the end of 8th grade.  Right after Rumspringa, 16, they contribute to being productive members of the community or they've left it and are shun forever.  Although shunning contributes to a strong family bond, it also breaks them. permalink parent award report block reply cyberrigger 1 points 51 minutes ago The Amish do a fish-ion permalink parent award report block reply\nSutopSutolf 12 points 1 hour ago The Amish don't need AI generated images either. permalink parent award report block reply midgetpornrocks 4 points 25 minutes ago Still amazing when you prompt AI to draw a hot chick holding a sign, the chick it draws is white. I wonder when that will change. permalink parent award report block reply Spindle-spin 0 points 1 hour ago Best we can do is more AI slop memes. All the memesmiths have gone out to pasture apparently. Remember 2016? There was video editing and decent Photoshop like it was a theatrical movie. Now we get none of that permalink parent award report block reply\nmidgetpornrocks 4 points 25 minutes ago Still amazing when you prompt AI to draw a hot chick holding a sign, the chick it draws is white. I wonder when that will change. permalink parent award report block reply\nSpindle-spin 0 points 1 hour ago Best we can do is more AI slop memes. All the memesmiths have gone out to pasture apparently. Remember 2016? There was video editing and decent Photoshop like it was a theatrical movie. Now we get none of that permalink parent award report block reply\nGet_Off_Big_Tech 5 points 2 hours ago Nuclear for clean energy and clean communities. permalink parent award report block reply Spindle-spin 2 points 1 hour ago Nothing wrong with gas and coal though. Coal can be cleaned. Families are clean. permalink parent award report block reply\nSpindle-spin 2 points 1 hour ago Nothing wrong with gas and coal though. Coal can be cleaned. Families are clean. permalink parent award report block reply\nSavingPrivateGrace 2 points 2 hours ago Strong families, but there is a fear that controls that.  They get jobs at 14 when they complete school at the end of 8th grade.  Right after Rumspringa, 16, they contribute to being productive members of the community or they've left it and are shun forever.  Although shunning contributes to a strong family bond, it also breaks them. permalink parent award report block reply\ncyberrigger 1 points 51 minutes ago The Amish do a fish-ion permalink parent award report block reply\ndr_gonzo 12 points 2 hours ago There's a direct correlation between how much citizens of a country donate to charity and social welfare programs. So the more \"free shit\" a government hands out, the LESS its citizens donate to charity. And that's extremely unfortunate because the government is the worst possible entity to be handling charity.  It has no incentive whatsoever to restrict it. In fact, politicians are incentivized to get more and more people on the public dole so they can use that to get their votes. So what inevitably happens? Rampant abuse, just like we see today. That doesn't happen when charity is private and voluntary, because nobody in their right mind will just keep throwing money at someone that refuses to help themselves. Subjective judgments can be made, and they absolutely should be in the case of charity. Not to mention when it's private, the person paying the bills actually receives gratitude and they damn well deserve it. They're donating the product of their labor for your benefit instead of the benefit of their own friends and family. That fucking deserves a thank you. But when government does it, people feel entitled to the money. Christ, we even call them entitlement programs. How that term doesn't piss everyone off astounds me. permalink parent award report block reply squash1324 3 points 55 minutes ago Studies have been done, and the most generous people are Christians. permalink parent award report block reply dukeofdoorcounty 1 points 9 minutes ago When I knew my money was going to US citizens, I didn't mind donating to the local food bank.  Then they went woke and seem to only care about illegals.  Not a dime since. permalink parent award report block reply\nsquash1324 3 points 55 minutes ago Studies have been done, and the most generous people are Christians. permalink parent award report block reply\ndukeofdoorcounty 1 points 9 minutes ago When I knew my money was going to US citizens, I didn't mind donating to the local food bank.  Then they went woke and seem to only care about illegals.  Not a dime since. permalink parent award report block reply\nNotYourMan 2 points 2 hours ago This is the way of humans.  We have perverted it so that a few politicians can get rich. permalink parent award report block reply\npatrioticwinning3 1 points 1 hour ago And they are almost all farmers... permalink parent award report block reply\nLegendFang 15 points 2 hours ago And most of those kids know who their fathers are. permalink award report block reply MedicallyReddit 9 points 2 hours ago And they also don’t stab random people for no reason in broad daylight permalink parent award report block reply AcquittedZombieSlay -5 points 2 hours ago no just drown the husband and send the kids in the car in to the bottom of the lake to send them to god. Funny how yall like to throw around the amish but leave out the cult and communism part. permalink parent award report block reply Repentnow 1 points 15 minutes ago The Amish don't build walls to keep their people in. permalink parent award report block reply\nMedicallyReddit 9 points 2 hours ago And they also don’t stab random people for no reason in broad daylight permalink parent award report block reply AcquittedZombieSlay -5 points 2 hours ago no just drown the husband and send the kids in the car in to the bottom of the lake to send them to god. Funny how yall like to throw around the amish but leave out the cult and communism part. permalink parent award report block reply Repentnow 1 points 15 minutes ago The Amish don't build walls to keep their people in. permalink parent award report block reply\nAcquittedZombieSlay -5 points 2 hours ago no just drown the husband and send the kids in the car in to the bottom of the lake to send them to god. Funny how yall like to throw around the amish but leave out the cult and communism part. permalink parent award report block reply Repentnow 1 points 15 minutes ago The Amish don't build walls to keep their people in. permalink parent award report block reply\nRepentnow 1 points 15 minutes ago The Amish don't build walls to keep their people in. permalink parent award report block reply\nSupFrens 12 points 2 hours ago Because the Amish are all white. THAT IS WHY. White communities when left alone thrive. permalink award report block reply guywholikesDjtof2024 3 points 2 hours ago bbbbbbut muh rayyyycissmsmsmsmsmssmssmsms permalink parent award report block reply SupFrens 6 points 2 hours ago YES. permalink parent award report block reply guywholikesDjtof2024 0 points 2 hours ago Every ethnic group prioritizes their own. Where the \"bad\" thing is, is when claims that some don't come from Adam and Eve. We need a better definition of the term. permalink parent award report block reply\nguywholikesDjtof2024 3 points 2 hours ago bbbbbbut muh rayyyycissmsmsmsmsmssmssmsms permalink parent award report block reply SupFrens 6 points 2 hours ago YES. permalink parent award report block reply guywholikesDjtof2024 0 points 2 hours ago Every ethnic group prioritizes their own. Where the \"bad\" thing is, is when claims that some don't come from Adam and Eve. We need a better definition of the term. permalink parent award report block reply\nSupFrens 6 points 2 hours ago YES. permalink parent award report block reply guywholikesDjtof2024 0 points 2 hours ago Every ethnic group prioritizes their own. Where the \"bad\" thing is, is when claims that some don't come from Adam and Eve. We need a better definition of the term. permalink parent award report block reply\nguywholikesDjtof2024 0 points 2 hours ago Every ethnic group prioritizes their own. Where the \"bad\" thing is, is when claims that some don't come from Adam and Eve. We need a better definition of the term. permalink parent award report block reply\nTheSwampThang 10 points 2 hours ago They pass down property to their children.   They don't sell out to contractors. permalink award report block reply Klaus73 2 points 1 hour ago But what about the stock market and memes? permalink parent award report block reply Say_what_again 1 points 1 hour ago Best I can do is 50yr mortgages, AI, and H1Bs permalink parent award report block reply\nKlaus73 2 points 1 hour ago But what about the stock market and memes? permalink parent award report block reply Say_what_again 1 points 1 hour ago Best I can do is 50yr mortgages, AI, and H1Bs permalink parent award report block reply\nSay_what_again 1 points 1 hour ago Best I can do is 50yr mortgages, AI, and H1Bs permalink parent award report block reply\nfriedchicken 6 points 1 hour ago I mean; not everything about amish culture is chocolate covered puppies and roses. The irony of this \"picture\" being AI generated is palpable. permalink award report block reply ScrewReddit 0 points 49 minutes ago I just upvoted for the Monkey D. Luffy cosplay. permalink parent award report block reply\nScrewReddit 0 points 49 minutes ago I just upvoted for the Monkey D. Luffy cosplay. permalink parent award report block reply\nLiquidSun 5 points 51 minutes ago Meh, false equivalence. They have land to tend and don't live in tenement buildings. permalink award report block reply\nKlaus73 4 points 1 hour ago I welcome the vast majority of folk on here to attempt to live a Amish life... ...go ahead..I'll wait. permalink award report block reply Lurkmoore 3 points 1 hour ago Yep. This obsession with praising the Amish lifestyle is silly. They have simply traded one set of problems for another. They are not nearly as independent as people like to pretend, either. permalink parent award report block reply Klaus73 1 points 29 minutes ago I mean...imagine trying to fight a war... permalink parent award report block reply\nLurkmoore 3 points 1 hour ago Yep. This obsession with praising the Amish lifestyle is silly. They have simply traded one set of problems for another. They are not nearly as independent as people like to pretend, either. permalink parent award report block reply Klaus73 1 points 29 minutes ago I mean...imagine trying to fight a war... permalink parent award report block reply\nKlaus73 1 points 29 minutes ago I mean...imagine trying to fight a war... permalink parent award report block reply\nmathteach314159 3 points 2 hours ago Yes and they are not consumers and they are fine with a simpler way of life. We should all take note. permalink award report block reply\nMhmm2MoreWeeks 3 points 2 hours ago Their Woman do not hate their Civilization. Yours do. Keep sending your kids to public school. Then wonder why you have no grandkids. permalink award report block reply SanityGumby 1 points 1 hour ago Some do but if they do they don’t get to stay permalink parent award report block reply\nSanityGumby 1 points 1 hour ago Some do but if they do they don’t get to stay permalink parent award report block reply\nguywholikesDjtof2024 2 points 2 hours ago what is a GD? Globalist Donkeys? permalink award report block reply lothrop_evola 6 points 2 hours ago It's a Good Daughter. Those Amish raise their girls with good, wholesome values. permalink parent award report block reply LandscaperJuan 5 points 2 hours ago Gosh Darn! permalink parent award report block reply Aquamine-Amarine 2 points 2 hours ago God Damn. permalink parent award report block reply guywholikesDjtof2024 1 points 2 hours ago taking God's Name in vian, then sad permalink parent award report block reply CommanderOfCheese 2 points 52 minutes ago That's a misunderstanding of the commandment. To take the name of the Lord is to represent Him. To present his name as a token of trust. To claim to represent him. To take his name in vain, then, is to claim to represent him in order to gain trust when that trust is not warranted. permalink parent award report block reply\nlothrop_evola 6 points 2 hours ago It's a Good Daughter. Those Amish raise their girls with good, wholesome values. permalink parent award report block reply\nLandscaperJuan 5 points 2 hours ago Gosh Darn! permalink parent award report block reply\nAquamine-Amarine 2 points 2 hours ago God Damn. permalink parent award report block reply guywholikesDjtof2024 1 points 2 hours ago taking God's Name in vian, then sad permalink parent award report block reply CommanderOfCheese 2 points 52 minutes ago That's a misunderstanding of the commandment. To take the name of the Lord is to represent Him. To present his name as a token of trust. To claim to represent him. To take his name in vain, then, is to claim to represent him in order to gain trust when that trust is not warranted. permalink parent award report block reply\nguywholikesDjtof2024 1 points 2 hours ago taking God's Name in vian, then sad permalink parent award report block reply CommanderOfCheese 2 points 52 minutes ago That's a misunderstanding of the commandment. To take the name of the Lord is to represent Him. To present his name as a token of trust. To claim to represent him. To take his name in vain, then, is to claim to represent him in order to gain trust when that trust is not warranted. permalink parent award report block reply\nCommanderOfCheese 2 points 52 minutes ago That's a misunderstanding of the commandment. To take the name of the Lord is to represent Him. To present his name as a token of trust. To claim to represent him. To take his name in vain, then, is to claim to represent him in order to gain trust when that trust is not warranted. permalink parent award report block reply\nEuphoricTrillby 1 points 2 hours ago Gosh, is this what working full time does to someone? permalink award report block reply\nRepentnow 1 points 21 minutes ago Lol. And they don't look like her! permalink award report block reply\nPatriotSam 1 points 1 hour ago Farming is a very underrated skill permalink award report block reply\nSanityGumby 1 points 1 hour ago They also have an average iq of 100 and work ethic brought on from God permalink award report block reply\nbemac 1 points 1 hour ago Bot image shit permalink award report block reply\nCletusjames 1 points 1 hour ago And their kids don't play Hockey. permalink award report block reply\nBohemyth_2 1 points 2 hours ago The Amish are big on fatherhood, family, and mothers who know that motherhood is what the definition of a woman is. permalink award report block reply\nBillyBobJimmyJoe 0 points 2 hours ago But do they have teeth to chew it? Checkmate. permalink award report block reply\nOstia -3 points 2 hours ago They also share resources and labor in communal living communities. What’s that remind you of? Not the best example. permalink award report block reply Deplorable_in_PA 5 points 2 hours ago Disagree.  Co-ops have existed forever.  The difference is co-op is voluntary, Marxism is forced.  Many of the Nordic countries have done fine with a more socialized economic system.  But they were small, racially homogeneous, cohesive culture, shared vales, and everyone contributes. permalink parent award report block reply guywholikesDjtof2024 4 points 2 hours ago Volutarily? Or at gunpoint? permalink parent award report block reply Ostia 1 points 1 hour ago You think you’re not excommunicated if you don’t want to take part? permalink parent award report block reply\nDeplorable_in_PA 5 points 2 hours ago Disagree.  Co-ops have existed forever.  The difference is co-op is voluntary, Marxism is forced.  Many of the Nordic countries have done fine with a more socialized economic system.  But they were small, racially homogeneous, cohesive culture, shared vales, and everyone contributes. permalink parent award report block reply\nguywholikesDjtof2024 4 points 2 hours ago Volutarily? Or at gunpoint? permalink parent award report block reply Ostia 1 points 1 hour ago You think you’re not excommunicated if you don’t want to take part? permalink parent award report block reply\nOstia 1 points 1 hour ago You think you’re not excommunicated if you don’t want to take part? permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:26:20.892900Z"
}