{
  "id": "1ARK57t3tz",
  "url": "https://patriots.win/p/1ARK57t3tz/a-woman-who-testified-in-court-a/c",
  "content": "554 A woman who testified in court about J6, who worked for the Congressional praetorian guard, who somehow passed a CIA polygraph despite having left pipe bombs around Washington DC on Jan 5 has been able to elude an $11B investigative agency which offered a $500k reward for 5 years... posted 4 days ago by Capoditutticapi1 41 comments award share report block Kyle Seraphin @KyleSeraphin • 4d A woman who testified in court about J6, who worked for the Congressional praetorian guard, who somehow passed a CIA polygraph despite having left pipe bombs around Washington DC on Jan 5 has been able to elude an $11B investigative agency which offered a $500k reward for 5 years Steve Baker @SteveBakerUSA • 5d This might just be the biggest scandal and conspiracy in American history. Many heroes were involved in bringing this to light. Some we can name in coming days. Some who want no recognition. And there’s much more to this yet to be told.\n41 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style SubmarineGuy 36 points 4 days ago The pipe bomb was an alternative emergency in case the planned riot didn't work. Nanzi needed an emergency to make the fake election succeed. https://theconservativetreehouse.com/blog/2023/03/12/the-parliamentary-motive-behind-the-j6-fedsurrection/ permalink award report block reply Whatyougotson 5 points 4 days ago They will probably say it was a ill-timed training exercise if it ever comes down to it. permalink parent award report block reply NomadicKrow2 1 points 4 days ago Oh, that's a good one. I bet they use that. permalink parent award report block reply Taylor3006 24 points 4 days ago She didn't elude anyone. They were purposefully not looking for her. permalink award report block reply Taqiyya_Mockingbird 15 points 4 days ago They tracked and jailed every J6 patriot they wanted to, used the shape of their ear in some cases to identify them and arrest them, some even a year or more later. No a matter of can’t, but rather won’t. permalink parent award report block reply Trump2024 3 points 4 days ago backing away whistling permalink parent award report block reply 4886Battery 9 points 4 days ago If she was in fact the bomber, then I have zero doubt that the Feds learned early on who she was and worked to obfuscate anyone else from learning her identity, and that's assuming she wasn't given this detail as an inside job, a large assumption that seems even more likely than this midget woman having taken it on herself. permalink parent award report block reply Capoditutticapi1 OP 4 points 4 days ago Exactly! permalink parent award report block reply NomadicKrow2 3 points 4 days ago Her reward was a year later, cozy posting in the CIA, more money, and \"vacation\" jobs working security for bullshit people. permalink parent award report block reply Megaboom2025 3 points 4 days ago protecting* permalink parent award report block reply TEXinLA 18 points 4 days ago Lock Her Up and Squeeze. Increase Pressure As Necessary Rinse and Reeeepeat permalink award report block reply patrioticwinning3 9 points 4 days ago That is why polygraphs are not admissible in court.  WAY TOO FUCKING EASY TO CHEAT, also way to fucking easy to get a rise out of someone and get a false negative. permalink award report block reply 4886Battery 17 points 4 days ago Do you really believe the CIA actually gave her a polygraph and are being honest about any of this?  Hell, they might've scheduled one just to make it look good and hooked it up to the someone else to get the results on file, but I don't trust that CIA as much as I trust the corner junkie with my wallet. permalink parent award report block reply 27Sandino 3 points 4 days ago Innocent people are generally nervous at the baseline questions,  but less nervous at the incriminating questions Guilty people are generally less nervous during the baseline but more at the incriminating stuff They don't even have to fake it,  they could just teach her, and record the one that \"passes\" permalink parent award report block reply Nomad899 3 points 4 days ago A sharp object under big toe and push on it at each question with same monotone response permalink parent award report block reply 27Sandino 2 points 4 days ago There's this movie Harsh Times with Christian bale with a scene about that Jim, knock it off What, sir? Son, I've been doing polygraph examinations since you were swimming in your daddy's balls. So I know all the tricks. You've either got a tack in your shoe or you're clinching your butt I've got spikes all over this thing. If you do it again, I'm going to void this test and report that you were uncooperative. Do you understand? Yes, sir permalink parent award report block reply bluebahloo 1 points 4 days ago This is not true. permalink parent award report block reply Megaboom2025 1 points 4 days ago CIA did jfk and 9/11 they are the ENEMY permalink parent award report block reply Build_Back_Bankrupt 11 points 4 days ago Kyle is assuming that she went into the CIA after her alleged actions, it's not outside the realm of possibility that she was CIA prior to joining Capitol Police. Either way, I doubt she acted alone... permalink parent award report block reply imnotdeadyet 12 points 4 days ago No shit, someone was giving the orders. permalink parent award report block reply sixfingerdildo 3 points 4 days ago did they ask her if she was the j6 bomber on the polygraph? permalink parent award report block reply Nomad899 5 points 4 days ago Did they care when they briefed her on the plan permalink parent award report block reply Alexius_von_Meinong 4 points 4 days ago It gets complicated when you have to investigate yourself, but in the end you're guaranteed exoneration. permalink parent award report block reply patrioticwinning3 2 points 3 days ago \"Good news, Honey!  I investigated who ate the last of the ice cream, and found out I am totally innocent!\" :p permalink parent award report block reply patrioticwinning3 1 points 3 days ago It is SOP for certain government agencies, going back to when polygraphs first came out, before it was widely known how unreliable they were. permalink parent award report block reply BurtMcGirt 7 points 4 days ago She was \"just following orders\" permalink award report block reply Constantin2024 5 points 4 days ago Lie detector tests are useless against sociopaths because the technology depends on the body's reflexive response to speaking lies. Sociopaths can lie with impunity because they lack the natural response of cognitive dissonance when one's words contradict reality. She likely passed the lie detector test because in HER mind, she was doing the right thing and therefore her conscience is clean. permalink award report block reply TrumpAndGodWin 2 points 4 days ago Also they could use word games to let you appear to be truthful. E.g. \"did you place the pipe bomb?\" No would be the truth because it wasn't a pipe bomb, it was an inert training device. Or just rig it like a PCR test. permalink parent award report block reply Sp3nce321 5 points 4 days ago The pipe bomb was her job interview for the CIA permalink award report block reply Megaboom2025 5 points 4 days ago Elude an 11b agency? No she’s being protected by an 11b agency permalink award report block reply Nomad899 4 points 4 days ago “Elude” permalink award report block reply RachetQueen2020 4 points 4 days ago I knew it would be an ugly faggot. permalink award report block reply PatriotSkorzeny 4 points 4 days ago Qualified immunity is strong apparently. permalink award report block reply merf 4 points 4 days ago A treasonous disposition is considered an asset at certain US agencies. permalink award report block reply Trump2024 4 points 4 days ago So, where's her mugshot? permalink award report block reply AgnesDomini 4 points 4 days ago Imagine that. It is almost as if she has been protected by Deep State agents... permalink award report block reply SurveilThis 3 points 4 days ago Bitch got a new cushy grounds security job at CIA for her efforts. permalink award report block reply Light_HIV_Effect 3 points 4 days ago Everything is the \"biggest scandal\" because nothing ever happens to the people that perpetrate them. No one is going to go down for Russiagate, Crossfire Hurricane, Arctic Frost, J6, pipebombings permalink award report block reply Smurfection 1 points 4 days ago I don't know.  Julie Kelly is casting shade on this. permalink award report block reply Capoditutticapi1 OP 3 points 4 days ago I see that... I respect her... She's been reporting on J6 since day one, including the pipe bombs. Clearly there's a battle for the truth over the identity of the PB'r and all (Seraphin/Baker-Blaze) seem to make good cases... Revolver also has been all over the PB'r story since the beginning but went quiet after Beattie joined the administration at DOS... Fever pitch now, feels like it'll break wide open, and we need a win, a hard truth win! permalink parent award report block reply Smurfection 1 points 3 days ago I hope you're right. permalink parent award report block reply\nSubmarineGuy 36 points 4 days ago The pipe bomb was an alternative emergency in case the planned riot didn't work. Nanzi needed an emergency to make the fake election succeed. https://theconservativetreehouse.com/blog/2023/03/12/the-parliamentary-motive-behind-the-j6-fedsurrection/ permalink award report block reply Whatyougotson 5 points 4 days ago They will probably say it was a ill-timed training exercise if it ever comes down to it. permalink parent award report block reply NomadicKrow2 1 points 4 days ago Oh, that's a good one. I bet they use that. permalink parent award report block reply\nWhatyougotson 5 points 4 days ago They will probably say it was a ill-timed training exercise if it ever comes down to it. permalink parent award report block reply NomadicKrow2 1 points 4 days ago Oh, that's a good one. I bet they use that. permalink parent award report block reply\nNomadicKrow2 1 points 4 days ago Oh, that's a good one. I bet they use that. permalink parent award report block reply\nTaylor3006 24 points 4 days ago She didn't elude anyone. They were purposefully not looking for her. permalink award report block reply Taqiyya_Mockingbird 15 points 4 days ago They tracked and jailed every J6 patriot they wanted to, used the shape of their ear in some cases to identify them and arrest them, some even a year or more later. No a matter of can’t, but rather won’t. permalink parent award report block reply Trump2024 3 points 4 days ago backing away whistling permalink parent award report block reply 4886Battery 9 points 4 days ago If she was in fact the bomber, then I have zero doubt that the Feds learned early on who she was and worked to obfuscate anyone else from learning her identity, and that's assuming she wasn't given this detail as an inside job, a large assumption that seems even more likely than this midget woman having taken it on herself. permalink parent award report block reply Capoditutticapi1 OP 4 points 4 days ago Exactly! permalink parent award report block reply NomadicKrow2 3 points 4 days ago Her reward was a year later, cozy posting in the CIA, more money, and \"vacation\" jobs working security for bullshit people. permalink parent award report block reply Megaboom2025 3 points 4 days ago protecting* permalink parent award report block reply\nTaqiyya_Mockingbird 15 points 4 days ago They tracked and jailed every J6 patriot they wanted to, used the shape of their ear in some cases to identify them and arrest them, some even a year or more later. No a matter of can’t, but rather won’t. permalink parent award report block reply Trump2024 3 points 4 days ago backing away whistling permalink parent award report block reply\nTrump2024 3 points 4 days ago backing away whistling permalink parent award report block reply\n4886Battery 9 points 4 days ago If she was in fact the bomber, then I have zero doubt that the Feds learned early on who she was and worked to obfuscate anyone else from learning her identity, and that's assuming she wasn't given this detail as an inside job, a large assumption that seems even more likely than this midget woman having taken it on herself. permalink parent award report block reply\nCapoditutticapi1 OP 4 points 4 days ago Exactly! permalink parent award report block reply\nNomadicKrow2 3 points 4 days ago Her reward was a year later, cozy posting in the CIA, more money, and \"vacation\" jobs working security for bullshit people. permalink parent award report block reply\nMegaboom2025 3 points 4 days ago protecting* permalink parent award report block reply\nTEXinLA 18 points 4 days ago Lock Her Up and Squeeze. Increase Pressure As Necessary Rinse and Reeeepeat permalink award report block reply\npatrioticwinning3 9 points 4 days ago That is why polygraphs are not admissible in court.  WAY TOO FUCKING EASY TO CHEAT, also way to fucking easy to get a rise out of someone and get a false negative. permalink award report block reply 4886Battery 17 points 4 days ago Do you really believe the CIA actually gave her a polygraph and are being honest about any of this?  Hell, they might've scheduled one just to make it look good and hooked it up to the someone else to get the results on file, but I don't trust that CIA as much as I trust the corner junkie with my wallet. permalink parent award report block reply 27Sandino 3 points 4 days ago Innocent people are generally nervous at the baseline questions,  but less nervous at the incriminating questions Guilty people are generally less nervous during the baseline but more at the incriminating stuff They don't even have to fake it,  they could just teach her, and record the one that \"passes\" permalink parent award report block reply Nomad899 3 points 4 days ago A sharp object under big toe and push on it at each question with same monotone response permalink parent award report block reply 27Sandino 2 points 4 days ago There's this movie Harsh Times with Christian bale with a scene about that Jim, knock it off What, sir? Son, I've been doing polygraph examinations since you were swimming in your daddy's balls. So I know all the tricks. You've either got a tack in your shoe or you're clinching your butt I've got spikes all over this thing. If you do it again, I'm going to void this test and report that you were uncooperative. Do you understand? Yes, sir permalink parent award report block reply bluebahloo 1 points 4 days ago This is not true. permalink parent award report block reply Megaboom2025 1 points 4 days ago CIA did jfk and 9/11 they are the ENEMY permalink parent award report block reply Build_Back_Bankrupt 11 points 4 days ago Kyle is assuming that she went into the CIA after her alleged actions, it's not outside the realm of possibility that she was CIA prior to joining Capitol Police. Either way, I doubt she acted alone... permalink parent award report block reply imnotdeadyet 12 points 4 days ago No shit, someone was giving the orders. permalink parent award report block reply sixfingerdildo 3 points 4 days ago did they ask her if she was the j6 bomber on the polygraph? permalink parent award report block reply Nomad899 5 points 4 days ago Did they care when they briefed her on the plan permalink parent award report block reply Alexius_von_Meinong 4 points 4 days ago It gets complicated when you have to investigate yourself, but in the end you're guaranteed exoneration. permalink parent award report block reply patrioticwinning3 2 points 3 days ago \"Good news, Honey!  I investigated who ate the last of the ice cream, and found out I am totally innocent!\" :p permalink parent award report block reply patrioticwinning3 1 points 3 days ago It is SOP for certain government agencies, going back to when polygraphs first came out, before it was widely known how unreliable they were. permalink parent award report block reply\n4886Battery 17 points 4 days ago Do you really believe the CIA actually gave her a polygraph and are being honest about any of this?  Hell, they might've scheduled one just to make it look good and hooked it up to the someone else to get the results on file, but I don't trust that CIA as much as I trust the corner junkie with my wallet. permalink parent award report block reply 27Sandino 3 points 4 days ago Innocent people are generally nervous at the baseline questions,  but less nervous at the incriminating questions Guilty people are generally less nervous during the baseline but more at the incriminating stuff They don't even have to fake it,  they could just teach her, and record the one that \"passes\" permalink parent award report block reply Nomad899 3 points 4 days ago A sharp object under big toe and push on it at each question with same monotone response permalink parent award report block reply 27Sandino 2 points 4 days ago There's this movie Harsh Times with Christian bale with a scene about that Jim, knock it off What, sir? Son, I've been doing polygraph examinations since you were swimming in your daddy's balls. So I know all the tricks. You've either got a tack in your shoe or you're clinching your butt I've got spikes all over this thing. If you do it again, I'm going to void this test and report that you were uncooperative. Do you understand? Yes, sir permalink parent award report block reply bluebahloo 1 points 4 days ago This is not true. permalink parent award report block reply Megaboom2025 1 points 4 days ago CIA did jfk and 9/11 they are the ENEMY permalink parent award report block reply\n27Sandino 3 points 4 days ago Innocent people are generally nervous at the baseline questions,  but less nervous at the incriminating questions Guilty people are generally less nervous during the baseline but more at the incriminating stuff They don't even have to fake it,  they could just teach her, and record the one that \"passes\" permalink parent award report block reply Nomad899 3 points 4 days ago A sharp object under big toe and push on it at each question with same monotone response permalink parent award report block reply 27Sandino 2 points 4 days ago There's this movie Harsh Times with Christian bale with a scene about that Jim, knock it off What, sir? Son, I've been doing polygraph examinations since you were swimming in your daddy's balls. So I know all the tricks. You've either got a tack in your shoe or you're clinching your butt I've got spikes all over this thing. If you do it again, I'm going to void this test and report that you were uncooperative. Do you understand? Yes, sir permalink parent award report block reply bluebahloo 1 points 4 days ago This is not true. permalink parent award report block reply\nNomad899 3 points 4 days ago A sharp object under big toe and push on it at each question with same monotone response permalink parent award report block reply 27Sandino 2 points 4 days ago There's this movie Harsh Times with Christian bale with a scene about that Jim, knock it off What, sir? Son, I've been doing polygraph examinations since you were swimming in your daddy's balls. So I know all the tricks. You've either got a tack in your shoe or you're clinching your butt I've got spikes all over this thing. If you do it again, I'm going to void this test and report that you were uncooperative. Do you understand? Yes, sir permalink parent award report block reply\n27Sandino 2 points 4 days ago There's this movie Harsh Times with Christian bale with a scene about that Jim, knock it off What, sir? Son, I've been doing polygraph examinations since you were swimming in your daddy's balls. So I know all the tricks. You've either got a tack in your shoe or you're clinching your butt I've got spikes all over this thing. If you do it again, I'm going to void this test and report that you were uncooperative. Do you understand? Yes, sir permalink parent award report block reply\nbluebahloo 1 points 4 days ago This is not true. permalink parent award report block reply\nMegaboom2025 1 points 4 days ago CIA did jfk and 9/11 they are the ENEMY permalink parent award report block reply\nBuild_Back_Bankrupt 11 points 4 days ago Kyle is assuming that she went into the CIA after her alleged actions, it's not outside the realm of possibility that she was CIA prior to joining Capitol Police. Either way, I doubt she acted alone... permalink parent award report block reply imnotdeadyet 12 points 4 days ago No shit, someone was giving the orders. permalink parent award report block reply\nimnotdeadyet 12 points 4 days ago No shit, someone was giving the orders. permalink parent award report block reply\nsixfingerdildo 3 points 4 days ago did they ask her if she was the j6 bomber on the polygraph? permalink parent award report block reply Nomad899 5 points 4 days ago Did they care when they briefed her on the plan permalink parent award report block reply Alexius_von_Meinong 4 points 4 days ago It gets complicated when you have to investigate yourself, but in the end you're guaranteed exoneration. permalink parent award report block reply patrioticwinning3 2 points 3 days ago \"Good news, Honey!  I investigated who ate the last of the ice cream, and found out I am totally innocent!\" :p permalink parent award report block reply patrioticwinning3 1 points 3 days ago It is SOP for certain government agencies, going back to when polygraphs first came out, before it was widely known how unreliable they were. permalink parent award report block reply\nNomad899 5 points 4 days ago Did they care when they briefed her on the plan permalink parent award report block reply Alexius_von_Meinong 4 points 4 days ago It gets complicated when you have to investigate yourself, but in the end you're guaranteed exoneration. permalink parent award report block reply patrioticwinning3 2 points 3 days ago \"Good news, Honey!  I investigated who ate the last of the ice cream, and found out I am totally innocent!\" :p permalink parent award report block reply\nAlexius_von_Meinong 4 points 4 days ago It gets complicated when you have to investigate yourself, but in the end you're guaranteed exoneration. permalink parent award report block reply patrioticwinning3 2 points 3 days ago \"Good news, Honey!  I investigated who ate the last of the ice cream, and found out I am totally innocent!\" :p permalink parent award report block reply\npatrioticwinning3 2 points 3 days ago \"Good news, Honey!  I investigated who ate the last of the ice cream, and found out I am totally innocent!\" :p permalink parent award report block reply\npatrioticwinning3 1 points 3 days ago It is SOP for certain government agencies, going back to when polygraphs first came out, before it was widely known how unreliable they were. permalink parent award report block reply\nBurtMcGirt 7 points 4 days ago She was \"just following orders\" permalink award report block reply\nConstantin2024 5 points 4 days ago Lie detector tests are useless against sociopaths because the technology depends on the body's reflexive response to speaking lies. Sociopaths can lie with impunity because they lack the natural response of cognitive dissonance when one's words contradict reality. She likely passed the lie detector test because in HER mind, she was doing the right thing and therefore her conscience is clean. permalink award report block reply TrumpAndGodWin 2 points 4 days ago Also they could use word games to let you appear to be truthful. E.g. \"did you place the pipe bomb?\" No would be the truth because it wasn't a pipe bomb, it was an inert training device. Or just rig it like a PCR test. permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago Also they could use word games to let you appear to be truthful. E.g. \"did you place the pipe bomb?\" No would be the truth because it wasn't a pipe bomb, it was an inert training device. Or just rig it like a PCR test. permalink parent award report block reply\nSp3nce321 5 points 4 days ago The pipe bomb was her job interview for the CIA permalink award report block reply\nMegaboom2025 5 points 4 days ago Elude an 11b agency? No she’s being protected by an 11b agency permalink award report block reply\nNomad899 4 points 4 days ago “Elude” permalink award report block reply\nRachetQueen2020 4 points 4 days ago I knew it would be an ugly faggot. permalink award report block reply\nPatriotSkorzeny 4 points 4 days ago Qualified immunity is strong apparently. permalink award report block reply\nmerf 4 points 4 days ago A treasonous disposition is considered an asset at certain US agencies. permalink award report block reply\nTrump2024 4 points 4 days ago So, where's her mugshot? permalink award report block reply\nAgnesDomini 4 points 4 days ago Imagine that. It is almost as if she has been protected by Deep State agents... permalink award report block reply\nSurveilThis 3 points 4 days ago Bitch got a new cushy grounds security job at CIA for her efforts. permalink award report block reply\nLight_HIV_Effect 3 points 4 days ago Everything is the \"biggest scandal\" because nothing ever happens to the people that perpetrate them. No one is going to go down for Russiagate, Crossfire Hurricane, Arctic Frost, J6, pipebombings permalink award report block reply\nSmurfection 1 points 4 days ago I don't know.  Julie Kelly is casting shade on this. permalink award report block reply Capoditutticapi1 OP 3 points 4 days ago I see that... I respect her... She's been reporting on J6 since day one, including the pipe bombs. Clearly there's a battle for the truth over the identity of the PB'r and all (Seraphin/Baker-Blaze) seem to make good cases... Revolver also has been all over the PB'r story since the beginning but went quiet after Beattie joined the administration at DOS... Fever pitch now, feels like it'll break wide open, and we need a win, a hard truth win! permalink parent award report block reply Smurfection 1 points 3 days ago I hope you're right. permalink parent award report block reply\nCapoditutticapi1 OP 3 points 4 days ago I see that... I respect her... She's been reporting on J6 since day one, including the pipe bombs. Clearly there's a battle for the truth over the identity of the PB'r and all (Seraphin/Baker-Blaze) seem to make good cases... Revolver also has been all over the PB'r story since the beginning but went quiet after Beattie joined the administration at DOS... Fever pitch now, feels like it'll break wide open, and we need a win, a hard truth win! permalink parent award report block reply Smurfection 1 points 3 days ago I hope you're right. permalink parent award report block reply\nSmurfection 1 points 3 days ago I hope you're right. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:53:01.865127Z"
}