{
  "id": "1ARK5BIFGO",
  "url": "https://patriots.win/p/1ARK5BIFGO/cnn-just-said-the-quiet-part-out/c",
  "content": "337 CNN just said the quiet part out loud, admitting the DEMOCRATS were responsible for the shutdown. “The democratic filibuster has been broken.” They’ve been lying to Americans for 40 DAYS! And now they’ve admitted Democrats are at fault. posted 3 days ago by Mr_Rightside 5 comments award share report block Nick Sortor @nicksortor • 3d 🚨 WOW! CNN just said the quiet part out loud, admitting the DEMOCRATS were responsible for the shutdown “The democratic filibuster has been broken.” They’ve been lying to Americans for 40 DAYS! And now they’ve admitted Democrats are at fault.\n5 comments Sort by Top Top New Worst Old Save Prandogolio 4 points 3 days ago OMG QUIET PART OUT LOUD WOW 🚨🚨🚨🚨 Why do all our guys have to talk so gay? permalink award report block reply YodaBannon 3 points 3 days ago 😂 😂 permalink parent award report block reply TheCheeseMaker 1 points 3 days ago “Say it louder for the people in the back!” 🙄 I agree permalink parent award report block reply rebuildingMyself 2 points 2 days ago Jake Tapper has been blaming it on the Democrats for weeks now, tbf permalink award report block reply punkalicious 1 points 2 days ago More like 40 years. It's all so tiring. permalink award report block reply\nPrandogolio 4 points 3 days ago OMG QUIET PART OUT LOUD WOW 🚨🚨🚨🚨 Why do all our guys have to talk so gay? permalink award report block reply YodaBannon 3 points 3 days ago 😂 😂 permalink parent award report block reply TheCheeseMaker 1 points 3 days ago “Say it louder for the people in the back!” 🙄 I agree permalink parent award report block reply\nYodaBannon 3 points 3 days ago 😂 😂 permalink parent award report block reply\nTheCheeseMaker 1 points 3 days ago “Say it louder for the people in the back!” 🙄 I agree permalink parent award report block reply\nrebuildingMyself 2 points 2 days ago Jake Tapper has been blaming it on the Democrats for weeks now, tbf permalink award report block reply\npunkalicious 1 points 2 days ago More like 40 years. It's all so tiring. permalink award report block reply",
  "fetched_at": "2025-11-12T20:49:05.763841Z"
}