{
  "id": "8183134",
  "title": "1810Attorney General Ken Paxton: I'm suing Harris County for unlawfully directing over $1.3 million ",
  "url": "https://patriots.win/p/1ARK9l7BnI/attorney-general-ken-paxton-im-s/c",
  "content": "1810 Attorney General Ken Paxton: I'm suing Harris County for unlawfully directing over $1.3 million in taxpayer money to defend illegal aliens from deportation. We must stop the left-wing radicals who are robbing Texans to prevent illegals from being deported by the Trump Administration. posted 1 day ago by Mr_Rightside 67 comments award share download report block\n67 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow BlackJack1776 48 points 1 day ago Lawsuits are great and all, but..... Arrests? permalink award report block reply TrumpYouMagaFrenner 34 points 1 day ago Hangings permalink parent award report block reply BlackJack1776 11 points 1 day ago I like the cut of your jib. (No Homo). permalink parent award report block reply TPMJB 5 points 1 day ago That just means the shape of his nose. Are homos doing nose shit now? permalink parent award report block reply lash 7 points 1 day ago Anti-semetic hate-speech permalink parent award report block reply view 1 more comments... 0111000001100101 3 points 1 day ago Ships are feminine you're good. permalink parent award report block reply lash 4 points 1 day ago How dare you...! permalink parent award report block reply cherbui 3 points 1 day ago if any of those illegal aliens are and associated w/ any terrorist organization .. slap in terrorist charges as well ... no need to talk to these democrat traitors in houston permalink parent award report block reply starjello 5 points 1 day ago Problem with lawsuits is taxpayers on hook. Arrest the corrupt politicians. They need to have skin in the game. permalink parent award report block reply 0111000001100101 2 points 1 day ago Paxton misspelled arresting for treason.  We used to be able to shoot horse thieves and invaders.  Must be corrupt judges? What's the lynch-pin upholding the corruption? permalink parent award report block reply Run_over_Antifa 1 points 22 hours ago County gets state and Fed money for a variety of things, Stop giving them money. No lets instead use even more tax payer money to sue them in which they will use tax payer money to pay for the lawsuit. permalink parent award report block reply rebuildingMyself 21 points 1 day ago Only reason I dont want this man in higher offices is because we'll lose him as AG permalink award report block reply Wtf_socialismreally 21 points 1 day ago Man, though. Imagine what could get done if he were in Bondi's position. permalink parent award report block reply 0111000001100101 10 points 1 day ago Why is Texas not already its own country?  Multi-generational Texan fumble. permalink parent award report block reply SaltyTitties4 2 points 23 hours ago LOl. permalink parent award report block reply MastaJoda 0 points 1 day ago unfortunately he'll just get lost in a sea of RINOs in Congress. Even if he wants good change he'll be overridden by RINO votes and AIPAC cultist smear campaigns if he steps out of line. permalink parent award report block reply MastaJoda 1 points 21 hours ago lol No argument whatsoever. Because you know I'm correct. permalink parent award report block reply SaltyTitties4 5 points 23 hours ago List three things he has caused to actually CHANGE to what the people of TX want.  Not three things he has said he will do- but 3 things he has actuallly done that has made changes that Texans want. Please? permalink parent award report block reply lkelm 2 points 20 hours ago He filed this lawsuit which is closer to what Texans want than anything Cornyn has done. permalink parent award report block reply xXCrusadyrXx 4 points 19 hours ago You'll take the scraps your masters feed you and ENJOY IT, pleb. permalink parent award report block reply brainphreeze 4 points 22 hours ago Do any of his lawsuits actually go anywhere permalink parent award report block reply thisguy883 5 points 22 hours ago Not really, no. permalink parent award report block reply ianpatrick1966 4 points 22 hours ago They don’t permalink parent award report block reply McFatty7 13 points 1 day ago President Trump needs to follow up with the Commerce Department back when he ordered the Census Bureau not to count illegals in the 2030 Census. The Democrats are clearly pushing through with counting illegals to benefit Blue States and Blue Cities. permalink award report block reply roadrunner0 10 points 1 day ago He needs to order a Census correction today to show the number of illegals and remove their Congressional representation.. permalink parent award report block reply Eatinglue 7 points 1 day ago Representation without taxation. permalink parent award report block reply Mr_Rightside OP 11 points 1 day ago https://x.com/KenPaxtonTX/status/1988274620148183111 permalink award report block reply I-am-Orlando PRO 4 points 1 day ago Thank you permalink parent award report block reply Goatboy66 8 points 1 day ago Lina Hidalgo, and the Commissioners Of Harris Country should be Personally.....Financially and Criminally responsible for the Theft of Taxpayers Dollars for Aiding and Abetting/ Harboring Illegal Aliens...Prosecuted to the Fullest Extent of the Law!!! permalink award report block reply cherbui 7 points 1 day ago Start arresting those involved... make it a big deal... make it official... none of these letters back and forth... if the money already spent... put them in prison. There is no need to  ask or beg it back or sue... don't negotiate with terrorist democrats permalink award report block reply Orlando_Doom 6 points 23 hours ago Need to gun terrorists down. I see no reason to treat these terrorist animals as human. Helping murderers and rapists enter the country is treason. Kill every single one. permalink parent award report block reply fluffykitten 7 points 1 day ago brought to you by Harris County and the HCAD BS yearly property tax increase permalink award report block reply DaninElkhart 2 points 1 day ago Leftist radicals are getting govt funding for this shit in every county in TX and every state of the Union. Absolute bullshit. (And btw, Leftist attorneys are getting wealthy doing it.) permalink parent award report block reply MixedBlacknWhite 6 points 20 hours ago So they broke a law.. and they get sued? So I can rob a bank, or try to at least, and then if I get away, I would get sued? What if I won the lawsuit? Maybe this - People break law They are arrested and sent to prison, immediately Their faces, crimes and the story are plastered everywhere Still images from the worst days of their lives are also posted VOTE ME permalink award report block reply perma-maga 6 points 1 day ago sue ARREST ARREST ARREST permalink award report block reply Trooph-Hurts 5 points 1 day ago Sedition permalink award report block reply SaltyTitties4 5 points 23 hours ago Fuck off, Paxton.  We all know your little schemes.  You are an actor and pretend to do things. You’re impotent and we all know it. permalink award report block reply roadrunner0 4 points 1 day ago This is in the trenches fighting for the Republic and the Constitution loving citizens that want the invaders out.. If the Left wants to defend foreign freeloaders and criminals they can do it directly out of their own pockets.. permalink award report block reply Orlando_Doom 1 points 23 hours ago I'd rather they do it from the mass graves we toss their teaitorous corpses in to. permalink parent award report block reply Pats5x 4 points 1 day ago Watch the establishment GOP fight this permalink award report block reply HKFan 3 points 24 hours ago Paxton would be doing much better than Blondi permalink award report block reply CovfefeVideo 3 points 22 hours ago Somehow we went from \"Don't mess with Texas\" to \"We're asking you to please consider slowing your messing with Texas.\" permalink award report block reply TPMJB 3 points 1 day ago Oh ho ho, I bet they won't even know what to do after this finger wagging! They'll be quivering in their boots! permalink award report block reply SavingPrivateGrace 3 points 1 day ago So the Harris country got around USAID shut off money by the 'dark ways' Jasmine Crocket concocted.  Turns out it's still your tax dollars paying for it.  The AG of Texas needs to connect the dots to her and investigate those NGOs. permalink award report block reply Justjayce 2 points 22 hours ago That's our future senator permalink award report block reply mohel 2 points 1 day ago More effort from Brad Parscale Influenceable? permalink award report block reply Smurfection 2 points 1 day ago Why should illegals have a right to a lawyer?  Their presence is proof of the crime. permalink award report block reply Obambi 2 points 1 day ago Ken over Bondi. Always hire a man. Women are all emotional and easily distracted by shoes and balloons. permalink award report block reply Orlando_Doom 2 points 23 hours ago Women are some of the most extreme and violent adherents to ideology. Your mistake was thinking Scam Blondi was on our side. permalink parent award report block reply Obambi 0 points 14 hours ago Love women that are at home raising kids and loyal to their husbands but in business or anything of importance they’re idiots that rule with emotions and estrogen. permalink parent award report block reply Pederella 2 points 1 day ago Harris County, TX (Houston) is broke and has much broken. Where the hell are they getting that money? permalink award report block reply Shitnooo 2 points 16 hours ago How about defending your state from these Muslim cities? permalink award report block reply LogicalReasoning 2 points 1 day ago Simple. Make it illegal for any organization to receive tax-payer funds for the purpose of aiding non-citizens, make it criminal if funds are used in cases where the organization is attempting to or aiding in the violation of established laws and regulations.... You'd think this would already be the case, but based on what we've seen thus far apparently not strict enough. permalink award report block reply MOLON-LABE 2 points 23 hours ago Sue them? Grow a pair and arrest them. permalink award report block reply xXCrusadyrXx 2 points 19 hours ago SUING??? SUING??? Has this little prick tried CHARGING them???? permalink award report block reply Michalusmichalus 1 points 23 hours ago According the the crying about losing jobs on Reddit, TX had a fuckton of NGO's getting USAID helping illegals. permalink award report block reply Lawless 1 points 1 day ago The left can't do shyt without other people's money permalink award report block reply twoscoops4america 1 points 21 hours ago Someone wants to be the next U.S. AG or higher.  Ken gets it done. permalink award report block reply JoinTheDiscussion 1 points 14 hours ago Getting it done would be arresting some mother fuckers!! permalink parent award report block reply TheWoodsman 1 points 21 hours ago He needs to sue to call the Space Force Spacemen and not guardians. permalink award report block reply Orlando_Doom 1 points 23 hours ago Stop calling them leftwing radicals. Call them the terrorist democrat part. And don't sue them, kill them. We are at civil war, you win war bu killing the enemy. Trump needs to wake the fuck up and stop being a pussy. We can't be in a war with a pussy leading us. permalink award report block reply QSWO1 1 points 22 hours ago So Harris County is spending less than a buck on each illegal? permalink award report block reply steini1904 1 points 18 hours ago I suggest being really careful about creating situations that cause people to have insufficient legal representation. That's how you multiply whatever amount you save today by obscenely large numbers and pay it later in compensation, sometimes even taking down your entire case with the process, no matter the merit. Ensure that the process is efficient and can be trusted and then commit to that. Screwing with it is one of the major reasons that caused the trouble in the first place. permalink award report block reply JoinTheDiscussion 1 points 14 hours ago Wake me when there are arrests... permalink award report block reply MasterChief08 0 points 1 day ago This is why I treat Democrats as pure evil. This isn't about humanitarianism. This is using demographics as a weapon and that is a human rights violation. It rises to the level of genocide. If one third to a quarter of the country is trying to replace me, I don't care about elections anymore. Life and death means I win at all costs even if it requires cheating. I will fully support any non leftist cheating to take power away from my enemies. If a conservative cheats in an election, every sane voter should vote to acquit. permalink award report block reply CommanderComadant 1 points 1 day ago Comment removed by community filter, pending further review. permalink award report block reply\nBlackJack1776 48 points 1 day ago Lawsuits are great and all, but..... Arrests? permalink award report block reply TrumpYouMagaFrenner 34 points 1 day ago Hangings permalink parent award report block reply BlackJack1776 11 points 1 day ago I like the cut of your jib. (No Homo). permalink parent award report block reply TPMJB 5 points 1 day ago That just means the shape of his nose. Are homos doing nose shit now? permalink parent award report block reply lash 7 points 1 day ago Anti-semetic hate-speech permalink parent award report block reply view 1 more comments... 0111000001100101 3 points 1 day ago Ships are feminine you're good. permalink parent award report block reply lash 4 points 1 day ago How dare you...! permalink parent award report block reply cherbui 3 points 1 day ago if any of those illegal aliens are and associated w/ any terrorist organization .. slap in terrorist charges as well ... no need to talk to these democrat traitors in houston permalink parent award report block reply starjello 5 points 1 day ago Problem with lawsuits is taxpayers on hook. Arrest the corrupt politicians. They need to have skin in the game. permalink parent award report block reply 0111000001100101 2 points 1 day ago Paxton misspelled arresting for treason.  We used to be able to shoot horse thieves and invaders.  Must be corrupt judges? What's the lynch-pin upholding the corruption? permalink parent award report block reply Run_over_Antifa 1 points 22 hours ago County gets state and Fed money for a variety of things, Stop giving them money. No lets instead use even more tax payer money to sue them in which they will use tax payer money to pay for the lawsuit. permalink parent award report block reply\nTrumpYouMagaFrenner 34 points 1 day ago Hangings permalink parent award report block reply BlackJack1776 11 points 1 day ago I like the cut of your jib. (No Homo). permalink parent award report block reply TPMJB 5 points 1 day ago That just means the shape of his nose. Are homos doing nose shit now? permalink parent award report block reply lash 7 points 1 day ago Anti-semetic hate-speech permalink parent award report block reply view 1 more comments... 0111000001100101 3 points 1 day ago Ships are feminine you're good. permalink parent award report block reply lash 4 points 1 day ago How dare you...! permalink parent award report block reply cherbui 3 points 1 day ago if any of those illegal aliens are and associated w/ any terrorist organization .. slap in terrorist charges as well ... no need to talk to these democrat traitors in houston permalink parent award report block reply\nBlackJack1776 11 points 1 day ago I like the cut of your jib. (No Homo). permalink parent award report block reply TPMJB 5 points 1 day ago That just means the shape of his nose. Are homos doing nose shit now? permalink parent award report block reply lash 7 points 1 day ago Anti-semetic hate-speech permalink parent award report block reply view 1 more comments... 0111000001100101 3 points 1 day ago Ships are feminine you're good. permalink parent award report block reply\nTPMJB 5 points 1 day ago That just means the shape of his nose. Are homos doing nose shit now? permalink parent award report block reply lash 7 points 1 day ago Anti-semetic hate-speech permalink parent award report block reply view 1 more comments...\nlash 7 points 1 day ago Anti-semetic hate-speech permalink parent award report block reply view 1 more comments...\n0111000001100101 3 points 1 day ago Ships are feminine you're good. permalink parent award report block reply\nlash 4 points 1 day ago How dare you...! permalink parent award report block reply\ncherbui 3 points 1 day ago if any of those illegal aliens are and associated w/ any terrorist organization .. slap in terrorist charges as well ... no need to talk to these democrat traitors in houston permalink parent award report block reply\nstarjello 5 points 1 day ago Problem with lawsuits is taxpayers on hook. Arrest the corrupt politicians. They need to have skin in the game. permalink parent award report block reply\n0111000001100101 2 points 1 day ago Paxton misspelled arresting for treason.  We used to be able to shoot horse thieves and invaders.  Must be corrupt judges? What's the lynch-pin upholding the corruption? permalink parent award report block reply\nRun_over_Antifa 1 points 22 hours ago County gets state and Fed money for a variety of things, Stop giving them money. No lets instead use even more tax payer money to sue them in which they will use tax payer money to pay for the lawsuit. permalink parent award report block reply\nrebuildingMyself 21 points 1 day ago Only reason I dont want this man in higher offices is because we'll lose him as AG permalink award report block reply Wtf_socialismreally 21 points 1 day ago Man, though. Imagine what could get done if he were in Bondi's position. permalink parent award report block reply 0111000001100101 10 points 1 day ago Why is Texas not already its own country?  Multi-generational Texan fumble. permalink parent award report block reply SaltyTitties4 2 points 23 hours ago LOl. permalink parent award report block reply MastaJoda 0 points 1 day ago unfortunately he'll just get lost in a sea of RINOs in Congress. Even if he wants good change he'll be overridden by RINO votes and AIPAC cultist smear campaigns if he steps out of line. permalink parent award report block reply MastaJoda 1 points 21 hours ago lol No argument whatsoever. Because you know I'm correct. permalink parent award report block reply SaltyTitties4 5 points 23 hours ago List three things he has caused to actually CHANGE to what the people of TX want.  Not three things he has said he will do- but 3 things he has actuallly done that has made changes that Texans want. Please? permalink parent award report block reply lkelm 2 points 20 hours ago He filed this lawsuit which is closer to what Texans want than anything Cornyn has done. permalink parent award report block reply xXCrusadyrXx 4 points 19 hours ago You'll take the scraps your masters feed you and ENJOY IT, pleb. permalink parent award report block reply brainphreeze 4 points 22 hours ago Do any of his lawsuits actually go anywhere permalink parent award report block reply thisguy883 5 points 22 hours ago Not really, no. permalink parent award report block reply ianpatrick1966 4 points 22 hours ago They don’t permalink parent award report block reply\nWtf_socialismreally 21 points 1 day ago Man, though. Imagine what could get done if he were in Bondi's position. permalink parent award report block reply 0111000001100101 10 points 1 day ago Why is Texas not already its own country?  Multi-generational Texan fumble. permalink parent award report block reply SaltyTitties4 2 points 23 hours ago LOl. permalink parent award report block reply MastaJoda 0 points 1 day ago unfortunately he'll just get lost in a sea of RINOs in Congress. Even if he wants good change he'll be overridden by RINO votes and AIPAC cultist smear campaigns if he steps out of line. permalink parent award report block reply MastaJoda 1 points 21 hours ago lol No argument whatsoever. Because you know I'm correct. permalink parent award report block reply\n0111000001100101 10 points 1 day ago Why is Texas not already its own country?  Multi-generational Texan fumble. permalink parent award report block reply\nSaltyTitties4 2 points 23 hours ago LOl. permalink parent award report block reply\nMastaJoda 0 points 1 day ago unfortunately he'll just get lost in a sea of RINOs in Congress. Even if he wants good change he'll be overridden by RINO votes and AIPAC cultist smear campaigns if he steps out of line. permalink parent award report block reply MastaJoda 1 points 21 hours ago lol No argument whatsoever. Because you know I'm correct. permalink parent award report block reply\nMastaJoda 1 points 21 hours ago lol No argument whatsoever. Because you know I'm correct. permalink parent award report block reply\nSaltyTitties4 5 points 23 hours ago List three things he has caused to actually CHANGE to what the people of TX want.  Not three things he has said he will do- but 3 things he has actuallly done that has made changes that Texans want. Please? permalink parent award report block reply lkelm 2 points 20 hours ago He filed this lawsuit which is closer to what Texans want than anything Cornyn has done. permalink parent award report block reply xXCrusadyrXx 4 points 19 hours ago You'll take the scraps your masters feed you and ENJOY IT, pleb. permalink parent award report block reply\nlkelm 2 points 20 hours ago He filed this lawsuit which is closer to what Texans want than anything Cornyn has done. permalink parent award report block reply xXCrusadyrXx 4 points 19 hours ago You'll take the scraps your masters feed you and ENJOY IT, pleb. permalink parent award report block reply\nxXCrusadyrXx 4 points 19 hours ago You'll take the scraps your masters feed you and ENJOY IT, pleb. permalink parent award report block reply\nbrainphreeze 4 points 22 hours ago Do any of his lawsuits actually go anywhere permalink parent award report block reply thisguy883 5 points 22 hours ago Not really, no. permalink parent award report block reply ianpatrick1966 4 points 22 hours ago They don’t permalink parent award report block reply\nthisguy883 5 points 22 hours ago Not really, no. permalink parent award report block reply\nianpatrick1966 4 points 22 hours ago They don’t permalink parent award report block reply\nMcFatty7 13 points 1 day ago President Trump needs to follow up with the Commerce Department back when he ordered the Census Bureau not to count illegals in the 2030 Census. The Democrats are clearly pushing through with counting illegals to benefit Blue States and Blue Cities. permalink award report block reply roadrunner0 10 points 1 day ago He needs to order a Census correction today to show the number of illegals and remove their Congressional representation.. permalink parent award report block reply Eatinglue 7 points 1 day ago Representation without taxation. permalink parent award report block reply\nroadrunner0 10 points 1 day ago He needs to order a Census correction today to show the number of illegals and remove their Congressional representation.. permalink parent award report block reply Eatinglue 7 points 1 day ago Representation without taxation. permalink parent award report block reply\nEatinglue 7 points 1 day ago Representation without taxation. permalink parent award report block reply\nMr_Rightside OP 11 points 1 day ago https://x.com/KenPaxtonTX/status/1988274620148183111 permalink award report block reply I-am-Orlando PRO 4 points 1 day ago Thank you permalink parent award report block reply\nI-am-Orlando PRO 4 points 1 day ago Thank you permalink parent award report block reply\nGoatboy66 8 points 1 day ago Lina Hidalgo, and the Commissioners Of Harris Country should be Personally.....Financially and Criminally responsible for the Theft of Taxpayers Dollars for Aiding and Abetting/ Harboring Illegal Aliens...Prosecuted to the Fullest Extent of the Law!!! permalink award report block reply\ncherbui 7 points 1 day ago Start arresting those involved... make it a big deal... make it official... none of these letters back and forth... if the money already spent... put them in prison. There is no need to  ask or beg it back or sue... don't negotiate with terrorist democrats permalink award report block reply Orlando_Doom 6 points 23 hours ago Need to gun terrorists down. I see no reason to treat these terrorist animals as human. Helping murderers and rapists enter the country is treason. Kill every single one. permalink parent award report block reply\nOrlando_Doom 6 points 23 hours ago Need to gun terrorists down. I see no reason to treat these terrorist animals as human. Helping murderers and rapists enter the country is treason. Kill every single one. permalink parent award report block reply\nfluffykitten 7 points 1 day ago brought to you by Harris County and the HCAD BS yearly property tax increase permalink award report block reply DaninElkhart 2 points 1 day ago Leftist radicals are getting govt funding for this shit in every county in TX and every state of the Union. Absolute bullshit. (And btw, Leftist attorneys are getting wealthy doing it.) permalink parent award report block reply\nDaninElkhart 2 points 1 day ago Leftist radicals are getting govt funding for this shit in every county in TX and every state of the Union. Absolute bullshit. (And btw, Leftist attorneys are getting wealthy doing it.) permalink parent award report block reply\nMixedBlacknWhite 6 points 20 hours ago So they broke a law.. and they get sued? So I can rob a bank, or try to at least, and then if I get away, I would get sued? What if I won the lawsuit? Maybe this - People break law They are arrested and sent to prison, immediately Their faces, crimes and the story are plastered everywhere Still images from the worst days of their lives are also posted VOTE ME permalink award report block reply\nperma-maga 6 points 1 day ago sue ARREST ARREST ARREST permalink award report block reply\nTrooph-Hurts 5 points 1 day ago Sedition permalink award report block reply\nSaltyTitties4 5 points 23 hours ago Fuck off, Paxton.  We all know your little schemes.  You are an actor and pretend to do things. You’re impotent and we all know it. permalink award report block reply\nroadrunner0 4 points 1 day ago This is in the trenches fighting for the Republic and the Constitution loving citizens that want the invaders out.. If the Left wants to defend foreign freeloaders and criminals they can do it directly out of their own pockets.. permalink award report block reply Orlando_Doom 1 points 23 hours ago I'd rather they do it from the mass graves we toss their teaitorous corpses in to. permalink parent award report block reply\nOrlando_Doom 1 points 23 hours ago I'd rather they do it from the mass graves we toss their teaitorous corpses in to. permalink parent award report block reply\nPats5x 4 points 1 day ago Watch the establishment GOP fight this permalink award report block reply\nHKFan 3 points 24 hours ago Paxton would be doing much better than Blondi permalink award report block reply\nCovfefeVideo 3 points 22 hours ago Somehow we went from \"Don't mess with Texas\" to \"We're asking you to please consider slowing your messing with Texas.\" permalink award report block reply\nTPMJB 3 points 1 day ago Oh ho ho, I bet they won't even know what to do after this finger wagging! They'll be quivering in their boots! permalink award report block reply\nSavingPrivateGrace 3 points 1 day ago So the Harris country got around USAID shut off money by the 'dark ways' Jasmine Crocket concocted.  Turns out it's still your tax dollars paying for it.  The AG of Texas needs to connect the dots to her and investigate those NGOs. permalink award report block reply\nJustjayce 2 points 22 hours ago That's our future senator permalink award report block reply\nmohel 2 points 1 day ago More effort from Brad Parscale Influenceable? permalink award report block reply\nSmurfection 2 points 1 day ago Why should illegals have a right to a lawyer?  Their presence is proof of the crime. permalink award report block reply\nObambi 2 points 1 day ago Ken over Bondi. Always hire a man. Women are all emotional and easily distracted by shoes and balloons. permalink award report block reply Orlando_Doom 2 points 23 hours ago Women are some of the most extreme and violent adherents to ideology. Your mistake was thinking Scam Blondi was on our side. permalink parent award report block reply Obambi 0 points 14 hours ago Love women that are at home raising kids and loyal to their husbands but in business or anything of importance they’re idiots that rule with emotions and estrogen. permalink parent award report block reply\nOrlando_Doom 2 points 23 hours ago Women are some of the most extreme and violent adherents to ideology. Your mistake was thinking Scam Blondi was on our side. permalink parent award report block reply Obambi 0 points 14 hours ago Love women that are at home raising kids and loyal to their husbands but in business or anything of importance they’re idiots that rule with emotions and estrogen. permalink parent award report block reply\nObambi 0 points 14 hours ago Love women that are at home raising kids and loyal to their husbands but in business or anything of importance they’re idiots that rule with emotions and estrogen. permalink parent award report block reply\nPederella 2 points 1 day ago Harris County, TX (Houston) is broke and has much broken. Where the hell are they getting that money? permalink award report block reply\nShitnooo 2 points 16 hours ago How about defending your state from these Muslim cities? permalink award report block reply\nLogicalReasoning 2 points 1 day ago Simple. Make it illegal for any organization to receive tax-payer funds for the purpose of aiding non-citizens, make it criminal if funds are used in cases where the organization is attempting to or aiding in the violation of established laws and regulations.... You'd think this would already be the case, but based on what we've seen thus far apparently not strict enough. permalink award report block reply\nMOLON-LABE 2 points 23 hours ago Sue them? Grow a pair and arrest them. permalink award report block reply\nxXCrusadyrXx 2 points 19 hours ago SUING??? SUING??? Has this little prick tried CHARGING them???? permalink award report block reply\nMichalusmichalus 1 points 23 hours ago According the the crying about losing jobs on Reddit, TX had a fuckton of NGO's getting USAID helping illegals. permalink award report block reply\nLawless 1 points 1 day ago The left can't do shyt without other people's money permalink award report block reply\ntwoscoops4america 1 points 21 hours ago Someone wants to be the next U.S. AG or higher.  Ken gets it done. permalink award report block reply JoinTheDiscussion 1 points 14 hours ago Getting it done would be arresting some mother fuckers!! permalink parent award report block reply\nJoinTheDiscussion 1 points 14 hours ago Getting it done would be arresting some mother fuckers!! permalink parent award report block reply\nTheWoodsman 1 points 21 hours ago He needs to sue to call the Space Force Spacemen and not guardians. permalink award report block reply\nOrlando_Doom 1 points 23 hours ago Stop calling them leftwing radicals. Call them the terrorist democrat part. And don't sue them, kill them. We are at civil war, you win war bu killing the enemy. Trump needs to wake the fuck up and stop being a pussy. We can't be in a war with a pussy leading us. permalink award report block reply\nQSWO1 1 points 22 hours ago So Harris County is spending less than a buck on each illegal? permalink award report block reply\nsteini1904 1 points 18 hours ago I suggest being really careful about creating situations that cause people to have insufficient legal representation. That's how you multiply whatever amount you save today by obscenely large numbers and pay it later in compensation, sometimes even taking down your entire case with the process, no matter the merit. Ensure that the process is efficient and can be trusted and then commit to that. Screwing with it is one of the major reasons that caused the trouble in the first place. permalink award report block reply\nJoinTheDiscussion 1 points 14 hours ago Wake me when there are arrests... permalink award report block reply\nMasterChief08 0 points 1 day ago This is why I treat Democrats as pure evil. This isn't about humanitarianism. This is using demographics as a weapon and that is a human rights violation. It rises to the level of genocide. If one third to a quarter of the country is trying to replace me, I don't care about elections anymore. Life and death means I win at all costs even if it requires cheating. I will fully support any non leftist cheating to take power away from my enemies. If a conservative cheats in an election, every sane voter should vote to acquit. permalink award report block reply\nCommanderComadant 1 points 1 day ago Comment removed by community filter, pending further review. permalink award report block reply"
}