{
  "id": "1ARK9k0RMt",
  "url": "https://patriots.win/p/1ARK9k0RMt/charlie-was-just-murdered-under-/c",
  "content": "439 \"Charlie was just murdered under 9 weeks ago and his organization is currently under attack by a group Trump designated a terrorist organization. \n\nIf you think the malaise among his base is bad now, it'll be heightened and solidified if @realDonaldTrump does nothing.\" posted 1 day ago by bleeje 64 comments award share report block Rich Baris The People's Pundit @Peoples_Pundit • 2d Charlie was just murdered under 9 weeks ago and his organization is currently under attack by a group Trump designated a terrorist organization. If you think the malaise among his base is bad now, it'll be heightened and solidified if @realDonaldTrump does nothing.\n64 comments Sort by Top Top New Worst Old Save Scot 11 points 1 day ago The problem is: President Trump is the only one doing anything. permalink award report block reply Bidensmellslikepiss 6 points 1 day ago Imagine fighting in court, getting shot at, being slandered by the media, and compromising your fortune to save America and inspire a movement... only to see everyone whine that you aren't doing enough. Trump is great. He's human. He's flawed. We all are. Trump isn't going to MAGA alone and if he died tomorrow, not much would change - at least that's what I would say if I had faith in my fellow countrymen to get their hands dirty. Why am I qualified to say this? I ran for mayor of my city. I lost. I started doing independent journalism. I exposed the protestors as indivisible losers that were taking money from Soros. I fought alongside my union (can of worms. I know.) to protect my employment from a barrage of outright lies they fed my company in an effort to have me fired. My experience fighting this scourge of societal corruption could just be one of thousands (maybe millions!) if only people would sacrifice even a fraction of their status quo. I'm tired. People treated me like a savior and a solution to all of the town's problems when I ran for mayor. In reality, I'm just a dude who has paying attention - just like you. I'll quit being obnoxious and get off my gay little soap box now, but go do just one courageous act today. \"Be the change.\" Anyway... thanks for listening to my TED Talk. I'm done pooping on my boss's dime now and my feet are asleep. Time to get back to it. permalink parent award report block reply 2016TrumpMAGA 3 points 24 hours ago I feel you. I was in an elected position for 6 years before quitting halfway through my second term. People treated me like (they expected me to be) a savior and a solution to all of the town's problems Meanwhile, none of the loudest complainers were willing to lift a finger to help themselves, chickening out every time they had an opportunity to remove a specific corrupt bureaucrat. I did some good things, but in the end, you cannot help people who will not help themselves. MAGA needs all of us to succeed, and it is not going to be easy. permalink parent award report block reply HoodooOperator 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply Magma_Biscuit 10 points 1 day ago The government and the thin blue line hasn’t helped so far so why do you expect that to change? Knock a few heads and Antifa will back off. permalink award report block reply MAGABOND 5 points 1 day ago The thin blue line is the government. permalink parent award report block reply MAGABOND 5 points 1 day ago Bring down the fucking gauntlet. permalink award report block reply Unboosted 5 points 1 day ago Smash antifa permalink award report block reply DCYR66 4 points 1 day ago I guess the fire that was lit by his murder is now smoldering. permalink award report block reply starjello 2 points 1 day ago It was all talk as it always is under conservatives that are way too comfortable to rise up. permalink parent award report block reply _Sully_ 3 points 1 day ago Take it in your own hands, buddy. Daddy ain't gonna be there all the time. permalink award report block reply mojorisen -2 points 1 day ago Really not a whole lot the government can do here.  The whole thing about designating American citizens as terrorist raises many legal questions and is probably not possible.  Second, the government would have to prove that these people are Antifa before arrest.  That would be almost impossible without stomping on people's civil rights.  Unless the protestors are wearing clothing, or have tattoos designating them as Antifa it would be a mess. So basically this incident is a local problem.  The government has no ability or legal right to enforcement in this case and we all know that the local government isn't going to do anything about it. permalink award report block reply Madnote1984 13 points 1 day ago Excuse me...have you heard of Jan 6th? You think it mattered to the left what was constitutional? Were it not for Trump, every J6 defendant would be behind bars today. Arrest the capos and the funders for incitement to riot and rico charges. Let them spend 3 years in prison hoping for a pardon. This is fucking war. One side gets it, and the other side doesn't. permalink parent award report block reply mojorisen 0 points 1 day ago Do you believe that anything that is not strictly confined in a constitution framework would be allowed by the Marxists DC judges?  The reason the dems did it and got away with it is because the judges are on their side.  Trump doesn't have that luxury.  His DOJ had better make sure that every i is dotted and t crossed.  Even with perfect indictments the odds that these people ever getting convicted is slim to none. permalink parent award report block reply SteveRogers42 5 points 1 day ago The Constitution is not a suicide pact. permalink parent award report block reply OrangeElvis 3 points 1 day ago Just treat them like mobsters or any other gang.  Follow the $ and get some folks inside and/or get some insiders to flip and do what we have always done with these loose-affiliation organizations.  It isn't like this model hasn't been used for hundreds of years.  In fact, it should be easier since the funding is all top-down. permalink parent award report block reply FudgyFudgeBots -2 points 1 day ago What exactly should he do? permalink award report block reply flopperdog 13 points 1 day ago Arrest and prosecute ANTIFA when they attack TPUSA.  (Like in Berkeley) permalink parent award report block reply FudgyFudgeBots -3 points 1 day ago The U.S. President does not have the direct authority to personally arrest individuals, including protesters like those affiliated with Antifa, even if they commit an assault. Arrest powers are vested in law enforcement officers (local, state, or federal) under statutory authority, not the executive branch head. 9 people were arrested by law enforcement during the Berkley attack. permalink parent award report block reply flopperdog 11 points 1 day ago Trump designated ANTIFA as a terrorist group. *The FBI is supposed to be investigating/prosecuting terrorist groups (like ANTIFA), but Kash Patel is a USELESS LOSER. Trump needs to FIRE Kash Patel, and appoint someone who will investigate and prosecute ANTIFA.  (Instead of flying around to his girlfriend's concerts) permalink parent award report block reply Madnote1984 6 points 1 day ago This is correct. They should be rolling these people up in 3am raids night after night. permalink parent award report block reply FudgyFudgeBots 0 points 1 day ago Agree that the bug eyed midget is useless. The problem with Antifa is that its decentralized (by design) so the group as a whole cant be rounded up and prosecuted. individuals can and are being arrested.   9 so far have been arrested from the Berkley assault. Once the federal govt gets involved with policing events (which is local law enforcement and private security's job) it comes dangerously close to crossing the line to actual facism. permalink parent award report block reply view 1 more comments... Beat_to_Quarters 4 points 1 day ago So declaring antifa a domestic terrorist organization is toothless? The FBI, DHS, etc can't be directed to prioritize arrests? We're blowing up little Venezuelan boats out of the water but the people rioting and attacking TPUSA on domestic soil and immigration agents are more emboldened than ever. permalink parent award report block reply TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply MAG-n-KAG 2 points 1 day ago stop praising Pam, and fire her useless ass. permalink parent award report block reply RINOssuck -7 points 1 day ago Constant anti-Trump propaganda from this loser. permalink award report block reply flopperdog 6 points 1 day ago MAGA doesn't need retarded SIMPS like you... *Trump's spent the majority of his term on foreign policy bullshit like bombing Iran for Israel, tariffing India for Ukraine, giving Argentinean farmers 40 billion dollars. **Trump has not focused on making life better for Americans when the job market is TERRIBLE and cost of living is still high. ***The elections last Tuesday were a DISASTER, and Republicans will lose the House and the Senate if this continues. So keep clapping like a retarded seal, because it \"feels good\" permalink parent award report block reply TakingCoatsWIN 2 points 1 day ago Trump has done the most important thing of all, the thing he's been voted in to do since 2016, STOP THE INVASION!!! Trump has done so great on his number 1 reason he is in the White House that cucks like you don't even mention immigration/border.  And that is the one thing all lifelong politicians love is votes unfettered immigration, dems love them as voters and RINOS/Libertarians love them as labor. permalink parent award report block reply flopperdog 0 points 1 day ago Yes, stopping the invasion was the most important issue.  Trump kept his promise on it. *However, Trump isn't delivering on the other critical issues: Economy/Jobs, Cost of living, staying out of stupid wars, fighting the deep state. Overall, Trump's been a good president, but he's paying too much attention to Israel/Ukraine, while the job market sucks, and the cost of living still sucks. As a result, key constituencies are abandoning Trump.  It's critical that Trump makes a course-correction before the Republicans lose the Midterms (and Trump becomes a lame-duck) permalink parent award report block reply TakingCoatsWIN 1 points 1 day ago What are you talking about what stupid war are we in? Had trump not been president we would have gone to war with Iran and probably have boots on the ground in Ukraine... what are you on? Trump stopped the bleeding when it comes to the economy reversed the jobs from going to immigrants to going to American citizens for the first time in decades and his policies haven't even had time to bake, nah it's just doomerism by design because they are trying to fracture MAGA. permalink parent award report block reply view 6 more comments... 2016TrumpMAGA 1 points 24 hours ago Here's the simple fact: It is way more difficult to unfuck something than it is to fuck it up.  Trump is unfucking what Bush1, Clinton, Bush 2, Obama, and Biden fucked up over almost 40 years.  What Trump has accomplished so far is amazing. Imagine buying a house that has been neglected and vandalized for forty years and expecting to be able to repair it in 10 months. permalink parent award report block reply view 1 more comments... RINOssuck -1 points 1 day ago Trump is the greatest president this country has ever had, by far.  If you can't see that you know nothing whatever about history and only what your whiny little ass wants from him. permalink parent award report block reply flopperdog 5 points 1 day ago Wake the fuck up, this isn't about \"liking\" or \"disliking\" Trump. *Trump is making MASSIVE MISTAKES which WILL result in Republicans losing the House and the Senate. **This will result in Trump getting impeached, and an END to Trump's agenda. The only way to prevent this catastrophe is for MAGA to collectively call out Trump's mistakes, and get Trump to correct them before the midterms. ***So stop clapping like a fucking idiot permalink parent award report block reply TakingCoatsWIN 2 points 1 day ago Nah, you just want to shit on Trump. Trump is killing it on all fronts. Imagine blaming Trump for a democrat, Cuomo losing to a Socialist in one of the bluest cities in America and acting like this is a defeat for trump, lmao. permalink parent award report block reply view 6 more comments... RINOssuck -2 points 1 day ago Fuck off, whiner. permalink parent award report block reply view 11 more comments... TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply SCHULTZ 1 points 1 day ago Comment removed by community moderators. permalink award report block reply TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink award report block reply\nScot 11 points 1 day ago The problem is: President Trump is the only one doing anything. permalink award report block reply Bidensmellslikepiss 6 points 1 day ago Imagine fighting in court, getting shot at, being slandered by the media, and compromising your fortune to save America and inspire a movement... only to see everyone whine that you aren't doing enough. Trump is great. He's human. He's flawed. We all are. Trump isn't going to MAGA alone and if he died tomorrow, not much would change - at least that's what I would say if I had faith in my fellow countrymen to get their hands dirty. Why am I qualified to say this? I ran for mayor of my city. I lost. I started doing independent journalism. I exposed the protestors as indivisible losers that were taking money from Soros. I fought alongside my union (can of worms. I know.) to protect my employment from a barrage of outright lies they fed my company in an effort to have me fired. My experience fighting this scourge of societal corruption could just be one of thousands (maybe millions!) if only people would sacrifice even a fraction of their status quo. I'm tired. People treated me like a savior and a solution to all of the town's problems when I ran for mayor. In reality, I'm just a dude who has paying attention - just like you. I'll quit being obnoxious and get off my gay little soap box now, but go do just one courageous act today. \"Be the change.\" Anyway... thanks for listening to my TED Talk. I'm done pooping on my boss's dime now and my feet are asleep. Time to get back to it. permalink parent award report block reply 2016TrumpMAGA 3 points 24 hours ago I feel you. I was in an elected position for 6 years before quitting halfway through my second term. People treated me like (they expected me to be) a savior and a solution to all of the town's problems Meanwhile, none of the loudest complainers were willing to lift a finger to help themselves, chickening out every time they had an opportunity to remove a specific corrupt bureaucrat. I did some good things, but in the end, you cannot help people who will not help themselves. MAGA needs all of us to succeed, and it is not going to be easy. permalink parent award report block reply HoodooOperator 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nBidensmellslikepiss 6 points 1 day ago Imagine fighting in court, getting shot at, being slandered by the media, and compromising your fortune to save America and inspire a movement... only to see everyone whine that you aren't doing enough. Trump is great. He's human. He's flawed. We all are. Trump isn't going to MAGA alone and if he died tomorrow, not much would change - at least that's what I would say if I had faith in my fellow countrymen to get their hands dirty. Why am I qualified to say this? I ran for mayor of my city. I lost. I started doing independent journalism. I exposed the protestors as indivisible losers that were taking money from Soros. I fought alongside my union (can of worms. I know.) to protect my employment from a barrage of outright lies they fed my company in an effort to have me fired. My experience fighting this scourge of societal corruption could just be one of thousands (maybe millions!) if only people would sacrifice even a fraction of their status quo. I'm tired. People treated me like a savior and a solution to all of the town's problems when I ran for mayor. In reality, I'm just a dude who has paying attention - just like you. I'll quit being obnoxious and get off my gay little soap box now, but go do just one courageous act today. \"Be the change.\" Anyway... thanks for listening to my TED Talk. I'm done pooping on my boss's dime now and my feet are asleep. Time to get back to it. permalink parent award report block reply 2016TrumpMAGA 3 points 24 hours ago I feel you. I was in an elected position for 6 years before quitting halfway through my second term. People treated me like (they expected me to be) a savior and a solution to all of the town's problems Meanwhile, none of the loudest complainers were willing to lift a finger to help themselves, chickening out every time they had an opportunity to remove a specific corrupt bureaucrat. I did some good things, but in the end, you cannot help people who will not help themselves. MAGA needs all of us to succeed, and it is not going to be easy. permalink parent award report block reply HoodooOperator 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\n2016TrumpMAGA 3 points 24 hours ago I feel you. I was in an elected position for 6 years before quitting halfway through my second term. People treated me like (they expected me to be) a savior and a solution to all of the town's problems Meanwhile, none of the loudest complainers were willing to lift a finger to help themselves, chickening out every time they had an opportunity to remove a specific corrupt bureaucrat. I did some good things, but in the end, you cannot help people who will not help themselves. MAGA needs all of us to succeed, and it is not going to be easy. permalink parent award report block reply\nHoodooOperator 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nMagma_Biscuit 10 points 1 day ago The government and the thin blue line hasn’t helped so far so why do you expect that to change? Knock a few heads and Antifa will back off. permalink award report block reply MAGABOND 5 points 1 day ago The thin blue line is the government. permalink parent award report block reply\nMAGABOND 5 points 1 day ago The thin blue line is the government. permalink parent award report block reply\nMAGABOND 5 points 1 day ago Bring down the fucking gauntlet. permalink award report block reply\nUnboosted 5 points 1 day ago Smash antifa permalink award report block reply\nDCYR66 4 points 1 day ago I guess the fire that was lit by his murder is now smoldering. permalink award report block reply starjello 2 points 1 day ago It was all talk as it always is under conservatives that are way too comfortable to rise up. permalink parent award report block reply\nstarjello 2 points 1 day ago It was all talk as it always is under conservatives that are way too comfortable to rise up. permalink parent award report block reply\n_Sully_ 3 points 1 day ago Take it in your own hands, buddy. Daddy ain't gonna be there all the time. permalink award report block reply\nmojorisen -2 points 1 day ago Really not a whole lot the government can do here.  The whole thing about designating American citizens as terrorist raises many legal questions and is probably not possible.  Second, the government would have to prove that these people are Antifa before arrest.  That would be almost impossible without stomping on people's civil rights.  Unless the protestors are wearing clothing, or have tattoos designating them as Antifa it would be a mess. So basically this incident is a local problem.  The government has no ability or legal right to enforcement in this case and we all know that the local government isn't going to do anything about it. permalink award report block reply Madnote1984 13 points 1 day ago Excuse me...have you heard of Jan 6th? You think it mattered to the left what was constitutional? Were it not for Trump, every J6 defendant would be behind bars today. Arrest the capos and the funders for incitement to riot and rico charges. Let them spend 3 years in prison hoping for a pardon. This is fucking war. One side gets it, and the other side doesn't. permalink parent award report block reply mojorisen 0 points 1 day ago Do you believe that anything that is not strictly confined in a constitution framework would be allowed by the Marxists DC judges?  The reason the dems did it and got away with it is because the judges are on their side.  Trump doesn't have that luxury.  His DOJ had better make sure that every i is dotted and t crossed.  Even with perfect indictments the odds that these people ever getting convicted is slim to none. permalink parent award report block reply SteveRogers42 5 points 1 day ago The Constitution is not a suicide pact. permalink parent award report block reply OrangeElvis 3 points 1 day ago Just treat them like mobsters or any other gang.  Follow the $ and get some folks inside and/or get some insiders to flip and do what we have always done with these loose-affiliation organizations.  It isn't like this model hasn't been used for hundreds of years.  In fact, it should be easier since the funding is all top-down. permalink parent award report block reply\nMadnote1984 13 points 1 day ago Excuse me...have you heard of Jan 6th? You think it mattered to the left what was constitutional? Were it not for Trump, every J6 defendant would be behind bars today. Arrest the capos and the funders for incitement to riot and rico charges. Let them spend 3 years in prison hoping for a pardon. This is fucking war. One side gets it, and the other side doesn't. permalink parent award report block reply mojorisen 0 points 1 day ago Do you believe that anything that is not strictly confined in a constitution framework would be allowed by the Marxists DC judges?  The reason the dems did it and got away with it is because the judges are on their side.  Trump doesn't have that luxury.  His DOJ had better make sure that every i is dotted and t crossed.  Even with perfect indictments the odds that these people ever getting convicted is slim to none. permalink parent award report block reply\nmojorisen 0 points 1 day ago Do you believe that anything that is not strictly confined in a constitution framework would be allowed by the Marxists DC judges?  The reason the dems did it and got away with it is because the judges are on their side.  Trump doesn't have that luxury.  His DOJ had better make sure that every i is dotted and t crossed.  Even with perfect indictments the odds that these people ever getting convicted is slim to none. permalink parent award report block reply\nSteveRogers42 5 points 1 day ago The Constitution is not a suicide pact. permalink parent award report block reply\nOrangeElvis 3 points 1 day ago Just treat them like mobsters or any other gang.  Follow the $ and get some folks inside and/or get some insiders to flip and do what we have always done with these loose-affiliation organizations.  It isn't like this model hasn't been used for hundreds of years.  In fact, it should be easier since the funding is all top-down. permalink parent award report block reply\nFudgyFudgeBots -2 points 1 day ago What exactly should he do? permalink award report block reply flopperdog 13 points 1 day ago Arrest and prosecute ANTIFA when they attack TPUSA.  (Like in Berkeley) permalink parent award report block reply FudgyFudgeBots -3 points 1 day ago The U.S. President does not have the direct authority to personally arrest individuals, including protesters like those affiliated with Antifa, even if they commit an assault. Arrest powers are vested in law enforcement officers (local, state, or federal) under statutory authority, not the executive branch head. 9 people were arrested by law enforcement during the Berkley attack. permalink parent award report block reply flopperdog 11 points 1 day ago Trump designated ANTIFA as a terrorist group. *The FBI is supposed to be investigating/prosecuting terrorist groups (like ANTIFA), but Kash Patel is a USELESS LOSER. Trump needs to FIRE Kash Patel, and appoint someone who will investigate and prosecute ANTIFA.  (Instead of flying around to his girlfriend's concerts) permalink parent award report block reply Madnote1984 6 points 1 day ago This is correct. They should be rolling these people up in 3am raids night after night. permalink parent award report block reply FudgyFudgeBots 0 points 1 day ago Agree that the bug eyed midget is useless. The problem with Antifa is that its decentralized (by design) so the group as a whole cant be rounded up and prosecuted. individuals can and are being arrested.   9 so far have been arrested from the Berkley assault. Once the federal govt gets involved with policing events (which is local law enforcement and private security's job) it comes dangerously close to crossing the line to actual facism. permalink parent award report block reply view 1 more comments... Beat_to_Quarters 4 points 1 day ago So declaring antifa a domestic terrorist organization is toothless? The FBI, DHS, etc can't be directed to prioritize arrests? We're blowing up little Venezuelan boats out of the water but the people rioting and attacking TPUSA on domestic soil and immigration agents are more emboldened than ever. permalink parent award report block reply TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply MAG-n-KAG 2 points 1 day ago stop praising Pam, and fire her useless ass. permalink parent award report block reply\nflopperdog 13 points 1 day ago Arrest and prosecute ANTIFA when they attack TPUSA.  (Like in Berkeley) permalink parent award report block reply FudgyFudgeBots -3 points 1 day ago The U.S. President does not have the direct authority to personally arrest individuals, including protesters like those affiliated with Antifa, even if they commit an assault. Arrest powers are vested in law enforcement officers (local, state, or federal) under statutory authority, not the executive branch head. 9 people were arrested by law enforcement during the Berkley attack. permalink parent award report block reply flopperdog 11 points 1 day ago Trump designated ANTIFA as a terrorist group. *The FBI is supposed to be investigating/prosecuting terrorist groups (like ANTIFA), but Kash Patel is a USELESS LOSER. Trump needs to FIRE Kash Patel, and appoint someone who will investigate and prosecute ANTIFA.  (Instead of flying around to his girlfriend's concerts) permalink parent award report block reply Madnote1984 6 points 1 day ago This is correct. They should be rolling these people up in 3am raids night after night. permalink parent award report block reply FudgyFudgeBots 0 points 1 day ago Agree that the bug eyed midget is useless. The problem with Antifa is that its decentralized (by design) so the group as a whole cant be rounded up and prosecuted. individuals can and are being arrested.   9 so far have been arrested from the Berkley assault. Once the federal govt gets involved with policing events (which is local law enforcement and private security's job) it comes dangerously close to crossing the line to actual facism. permalink parent award report block reply view 1 more comments... Beat_to_Quarters 4 points 1 day ago So declaring antifa a domestic terrorist organization is toothless? The FBI, DHS, etc can't be directed to prioritize arrests? We're blowing up little Venezuelan boats out of the water but the people rioting and attacking TPUSA on domestic soil and immigration agents are more emboldened than ever. permalink parent award report block reply TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nFudgyFudgeBots -3 points 1 day ago The U.S. President does not have the direct authority to personally arrest individuals, including protesters like those affiliated with Antifa, even if they commit an assault. Arrest powers are vested in law enforcement officers (local, state, or federal) under statutory authority, not the executive branch head. 9 people were arrested by law enforcement during the Berkley attack. permalink parent award report block reply flopperdog 11 points 1 day ago Trump designated ANTIFA as a terrorist group. *The FBI is supposed to be investigating/prosecuting terrorist groups (like ANTIFA), but Kash Patel is a USELESS LOSER. Trump needs to FIRE Kash Patel, and appoint someone who will investigate and prosecute ANTIFA.  (Instead of flying around to his girlfriend's concerts) permalink parent award report block reply Madnote1984 6 points 1 day ago This is correct. They should be rolling these people up in 3am raids night after night. permalink parent award report block reply FudgyFudgeBots 0 points 1 day ago Agree that the bug eyed midget is useless. The problem with Antifa is that its decentralized (by design) so the group as a whole cant be rounded up and prosecuted. individuals can and are being arrested.   9 so far have been arrested from the Berkley assault. Once the federal govt gets involved with policing events (which is local law enforcement and private security's job) it comes dangerously close to crossing the line to actual facism. permalink parent award report block reply view 1 more comments... Beat_to_Quarters 4 points 1 day ago So declaring antifa a domestic terrorist organization is toothless? The FBI, DHS, etc can't be directed to prioritize arrests? We're blowing up little Venezuelan boats out of the water but the people rioting and attacking TPUSA on domestic soil and immigration agents are more emboldened than ever. permalink parent award report block reply TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nflopperdog 11 points 1 day ago Trump designated ANTIFA as a terrorist group. *The FBI is supposed to be investigating/prosecuting terrorist groups (like ANTIFA), but Kash Patel is a USELESS LOSER. Trump needs to FIRE Kash Patel, and appoint someone who will investigate and prosecute ANTIFA.  (Instead of flying around to his girlfriend's concerts) permalink parent award report block reply Madnote1984 6 points 1 day ago This is correct. They should be rolling these people up in 3am raids night after night. permalink parent award report block reply FudgyFudgeBots 0 points 1 day ago Agree that the bug eyed midget is useless. The problem with Antifa is that its decentralized (by design) so the group as a whole cant be rounded up and prosecuted. individuals can and are being arrested.   9 so far have been arrested from the Berkley assault. Once the federal govt gets involved with policing events (which is local law enforcement and private security's job) it comes dangerously close to crossing the line to actual facism. permalink parent award report block reply view 1 more comments...\nMadnote1984 6 points 1 day ago This is correct. They should be rolling these people up in 3am raids night after night. permalink parent award report block reply\nFudgyFudgeBots 0 points 1 day ago Agree that the bug eyed midget is useless. The problem with Antifa is that its decentralized (by design) so the group as a whole cant be rounded up and prosecuted. individuals can and are being arrested.   9 so far have been arrested from the Berkley assault. Once the federal govt gets involved with policing events (which is local law enforcement and private security's job) it comes dangerously close to crossing the line to actual facism. permalink parent award report block reply view 1 more comments...\nBeat_to_Quarters 4 points 1 day ago So declaring antifa a domestic terrorist organization is toothless? The FBI, DHS, etc can't be directed to prioritize arrests? We're blowing up little Venezuelan boats out of the water but the people rioting and attacking TPUSA on domestic soil and immigration agents are more emboldened than ever. permalink parent award report block reply TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nMAG-n-KAG 2 points 1 day ago stop praising Pam, and fire her useless ass. permalink parent award report block reply\nRINOssuck -7 points 1 day ago Constant anti-Trump propaganda from this loser. permalink award report block reply flopperdog 6 points 1 day ago MAGA doesn't need retarded SIMPS like you... *Trump's spent the majority of his term on foreign policy bullshit like bombing Iran for Israel, tariffing India for Ukraine, giving Argentinean farmers 40 billion dollars. **Trump has not focused on making life better for Americans when the job market is TERRIBLE and cost of living is still high. ***The elections last Tuesday were a DISASTER, and Republicans will lose the House and the Senate if this continues. So keep clapping like a retarded seal, because it \"feels good\" permalink parent award report block reply TakingCoatsWIN 2 points 1 day ago Trump has done the most important thing of all, the thing he's been voted in to do since 2016, STOP THE INVASION!!! Trump has done so great on his number 1 reason he is in the White House that cucks like you don't even mention immigration/border.  And that is the one thing all lifelong politicians love is votes unfettered immigration, dems love them as voters and RINOS/Libertarians love them as labor. permalink parent award report block reply flopperdog 0 points 1 day ago Yes, stopping the invasion was the most important issue.  Trump kept his promise on it. *However, Trump isn't delivering on the other critical issues: Economy/Jobs, Cost of living, staying out of stupid wars, fighting the deep state. Overall, Trump's been a good president, but he's paying too much attention to Israel/Ukraine, while the job market sucks, and the cost of living still sucks. As a result, key constituencies are abandoning Trump.  It's critical that Trump makes a course-correction before the Republicans lose the Midterms (and Trump becomes a lame-duck) permalink parent award report block reply TakingCoatsWIN 1 points 1 day ago What are you talking about what stupid war are we in? Had trump not been president we would have gone to war with Iran and probably have boots on the ground in Ukraine... what are you on? Trump stopped the bleeding when it comes to the economy reversed the jobs from going to immigrants to going to American citizens for the first time in decades and his policies haven't even had time to bake, nah it's just doomerism by design because they are trying to fracture MAGA. permalink parent award report block reply view 6 more comments... 2016TrumpMAGA 1 points 24 hours ago Here's the simple fact: It is way more difficult to unfuck something than it is to fuck it up.  Trump is unfucking what Bush1, Clinton, Bush 2, Obama, and Biden fucked up over almost 40 years.  What Trump has accomplished so far is amazing. Imagine buying a house that has been neglected and vandalized for forty years and expecting to be able to repair it in 10 months. permalink parent award report block reply view 1 more comments... RINOssuck -1 points 1 day ago Trump is the greatest president this country has ever had, by far.  If you can't see that you know nothing whatever about history and only what your whiny little ass wants from him. permalink parent award report block reply flopperdog 5 points 1 day ago Wake the fuck up, this isn't about \"liking\" or \"disliking\" Trump. *Trump is making MASSIVE MISTAKES which WILL result in Republicans losing the House and the Senate. **This will result in Trump getting impeached, and an END to Trump's agenda. The only way to prevent this catastrophe is for MAGA to collectively call out Trump's mistakes, and get Trump to correct them before the midterms. ***So stop clapping like a fucking idiot permalink parent award report block reply TakingCoatsWIN 2 points 1 day ago Nah, you just want to shit on Trump. Trump is killing it on all fronts. Imagine blaming Trump for a democrat, Cuomo losing to a Socialist in one of the bluest cities in America and acting like this is a defeat for trump, lmao. permalink parent award report block reply view 6 more comments... RINOssuck -2 points 1 day ago Fuck off, whiner. permalink parent award report block reply view 11 more comments... TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nflopperdog 6 points 1 day ago MAGA doesn't need retarded SIMPS like you... *Trump's spent the majority of his term on foreign policy bullshit like bombing Iran for Israel, tariffing India for Ukraine, giving Argentinean farmers 40 billion dollars. **Trump has not focused on making life better for Americans when the job market is TERRIBLE and cost of living is still high. ***The elections last Tuesday were a DISASTER, and Republicans will lose the House and the Senate if this continues. So keep clapping like a retarded seal, because it \"feels good\" permalink parent award report block reply TakingCoatsWIN 2 points 1 day ago Trump has done the most important thing of all, the thing he's been voted in to do since 2016, STOP THE INVASION!!! Trump has done so great on his number 1 reason he is in the White House that cucks like you don't even mention immigration/border.  And that is the one thing all lifelong politicians love is votes unfettered immigration, dems love them as voters and RINOS/Libertarians love them as labor. permalink parent award report block reply flopperdog 0 points 1 day ago Yes, stopping the invasion was the most important issue.  Trump kept his promise on it. *However, Trump isn't delivering on the other critical issues: Economy/Jobs, Cost of living, staying out of stupid wars, fighting the deep state. Overall, Trump's been a good president, but he's paying too much attention to Israel/Ukraine, while the job market sucks, and the cost of living still sucks. As a result, key constituencies are abandoning Trump.  It's critical that Trump makes a course-correction before the Republicans lose the Midterms (and Trump becomes a lame-duck) permalink parent award report block reply TakingCoatsWIN 1 points 1 day ago What are you talking about what stupid war are we in? Had trump not been president we would have gone to war with Iran and probably have boots on the ground in Ukraine... what are you on? Trump stopped the bleeding when it comes to the economy reversed the jobs from going to immigrants to going to American citizens for the first time in decades and his policies haven't even had time to bake, nah it's just doomerism by design because they are trying to fracture MAGA. permalink parent award report block reply view 6 more comments... 2016TrumpMAGA 1 points 24 hours ago Here's the simple fact: It is way more difficult to unfuck something than it is to fuck it up.  Trump is unfucking what Bush1, Clinton, Bush 2, Obama, and Biden fucked up over almost 40 years.  What Trump has accomplished so far is amazing. Imagine buying a house that has been neglected and vandalized for forty years and expecting to be able to repair it in 10 months. permalink parent award report block reply view 1 more comments... RINOssuck -1 points 1 day ago Trump is the greatest president this country has ever had, by far.  If you can't see that you know nothing whatever about history and only what your whiny little ass wants from him. permalink parent award report block reply flopperdog 5 points 1 day ago Wake the fuck up, this isn't about \"liking\" or \"disliking\" Trump. *Trump is making MASSIVE MISTAKES which WILL result in Republicans losing the House and the Senate. **This will result in Trump getting impeached, and an END to Trump's agenda. The only way to prevent this catastrophe is for MAGA to collectively call out Trump's mistakes, and get Trump to correct them before the midterms. ***So stop clapping like a fucking idiot permalink parent award report block reply TakingCoatsWIN 2 points 1 day ago Nah, you just want to shit on Trump. Trump is killing it on all fronts. Imagine blaming Trump for a democrat, Cuomo losing to a Socialist in one of the bluest cities in America and acting like this is a defeat for trump, lmao. permalink parent award report block reply view 6 more comments... RINOssuck -2 points 1 day ago Fuck off, whiner. permalink parent award report block reply view 11 more comments... TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nTakingCoatsWIN 2 points 1 day ago Trump has done the most important thing of all, the thing he's been voted in to do since 2016, STOP THE INVASION!!! Trump has done so great on his number 1 reason he is in the White House that cucks like you don't even mention immigration/border.  And that is the one thing all lifelong politicians love is votes unfettered immigration, dems love them as voters and RINOS/Libertarians love them as labor. permalink parent award report block reply flopperdog 0 points 1 day ago Yes, stopping the invasion was the most important issue.  Trump kept his promise on it. *However, Trump isn't delivering on the other critical issues: Economy/Jobs, Cost of living, staying out of stupid wars, fighting the deep state. Overall, Trump's been a good president, but he's paying too much attention to Israel/Ukraine, while the job market sucks, and the cost of living still sucks. As a result, key constituencies are abandoning Trump.  It's critical that Trump makes a course-correction before the Republicans lose the Midterms (and Trump becomes a lame-duck) permalink parent award report block reply TakingCoatsWIN 1 points 1 day ago What are you talking about what stupid war are we in? Had trump not been president we would have gone to war with Iran and probably have boots on the ground in Ukraine... what are you on? Trump stopped the bleeding when it comes to the economy reversed the jobs from going to immigrants to going to American citizens for the first time in decades and his policies haven't even had time to bake, nah it's just doomerism by design because they are trying to fracture MAGA. permalink parent award report block reply view 6 more comments... 2016TrumpMAGA 1 points 24 hours ago Here's the simple fact: It is way more difficult to unfuck something than it is to fuck it up.  Trump is unfucking what Bush1, Clinton, Bush 2, Obama, and Biden fucked up over almost 40 years.  What Trump has accomplished so far is amazing. Imagine buying a house that has been neglected and vandalized for forty years and expecting to be able to repair it in 10 months. permalink parent award report block reply view 1 more comments...\nflopperdog 0 points 1 day ago Yes, stopping the invasion was the most important issue.  Trump kept his promise on it. *However, Trump isn't delivering on the other critical issues: Economy/Jobs, Cost of living, staying out of stupid wars, fighting the deep state. Overall, Trump's been a good president, but he's paying too much attention to Israel/Ukraine, while the job market sucks, and the cost of living still sucks. As a result, key constituencies are abandoning Trump.  It's critical that Trump makes a course-correction before the Republicans lose the Midterms (and Trump becomes a lame-duck) permalink parent award report block reply TakingCoatsWIN 1 points 1 day ago What are you talking about what stupid war are we in? Had trump not been president we would have gone to war with Iran and probably have boots on the ground in Ukraine... what are you on? Trump stopped the bleeding when it comes to the economy reversed the jobs from going to immigrants to going to American citizens for the first time in decades and his policies haven't even had time to bake, nah it's just doomerism by design because they are trying to fracture MAGA. permalink parent award report block reply view 6 more comments... 2016TrumpMAGA 1 points 24 hours ago Here's the simple fact: It is way more difficult to unfuck something than it is to fuck it up.  Trump is unfucking what Bush1, Clinton, Bush 2, Obama, and Biden fucked up over almost 40 years.  What Trump has accomplished so far is amazing. Imagine buying a house that has been neglected and vandalized for forty years and expecting to be able to repair it in 10 months. permalink parent award report block reply view 1 more comments...\nTakingCoatsWIN 1 points 1 day ago What are you talking about what stupid war are we in? Had trump not been president we would have gone to war with Iran and probably have boots on the ground in Ukraine... what are you on? Trump stopped the bleeding when it comes to the economy reversed the jobs from going to immigrants to going to American citizens for the first time in decades and his policies haven't even had time to bake, nah it's just doomerism by design because they are trying to fracture MAGA. permalink parent award report block reply view 6 more comments...\n2016TrumpMAGA 1 points 24 hours ago Here's the simple fact: It is way more difficult to unfuck something than it is to fuck it up.  Trump is unfucking what Bush1, Clinton, Bush 2, Obama, and Biden fucked up over almost 40 years.  What Trump has accomplished so far is amazing. Imagine buying a house that has been neglected and vandalized for forty years and expecting to be able to repair it in 10 months. permalink parent award report block reply view 1 more comments...\nRINOssuck -1 points 1 day ago Trump is the greatest president this country has ever had, by far.  If you can't see that you know nothing whatever about history and only what your whiny little ass wants from him. permalink parent award report block reply flopperdog 5 points 1 day ago Wake the fuck up, this isn't about \"liking\" or \"disliking\" Trump. *Trump is making MASSIVE MISTAKES which WILL result in Republicans losing the House and the Senate. **This will result in Trump getting impeached, and an END to Trump's agenda. The only way to prevent this catastrophe is for MAGA to collectively call out Trump's mistakes, and get Trump to correct them before the midterms. ***So stop clapping like a fucking idiot permalink parent award report block reply TakingCoatsWIN 2 points 1 day ago Nah, you just want to shit on Trump. Trump is killing it on all fronts. Imagine blaming Trump for a democrat, Cuomo losing to a Socialist in one of the bluest cities in America and acting like this is a defeat for trump, lmao. permalink parent award report block reply view 6 more comments... RINOssuck -2 points 1 day ago Fuck off, whiner. permalink parent award report block reply view 11 more comments... TrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nflopperdog 5 points 1 day ago Wake the fuck up, this isn't about \"liking\" or \"disliking\" Trump. *Trump is making MASSIVE MISTAKES which WILL result in Republicans losing the House and the Senate. **This will result in Trump getting impeached, and an END to Trump's agenda. The only way to prevent this catastrophe is for MAGA to collectively call out Trump's mistakes, and get Trump to correct them before the midterms. ***So stop clapping like a fucking idiot permalink parent award report block reply TakingCoatsWIN 2 points 1 day ago Nah, you just want to shit on Trump. Trump is killing it on all fronts. Imagine blaming Trump for a democrat, Cuomo losing to a Socialist in one of the bluest cities in America and acting like this is a defeat for trump, lmao. permalink parent award report block reply view 6 more comments... RINOssuck -2 points 1 day ago Fuck off, whiner. permalink parent award report block reply view 11 more comments...\nTakingCoatsWIN 2 points 1 day ago Nah, you just want to shit on Trump. Trump is killing it on all fronts. Imagine blaming Trump for a democrat, Cuomo losing to a Socialist in one of the bluest cities in America and acting like this is a defeat for trump, lmao. permalink parent award report block reply view 6 more comments...\nRINOssuck -2 points 1 day ago Fuck off, whiner. permalink parent award report block reply view 11 more comments...\nTrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nSCHULTZ 1 points 1 day ago Comment removed by community moderators. permalink award report block reply\nTrumpSaysNoMAGA4u 1 points 1 day ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T21:05:51.503981Z"
}