{
  "id": "1ARK9nQBYf",
  "url": "https://patriots.win/p/1ARK9nQBYf/trumps-response-to-the-h1b-50-ye/c",
  "content": "65 Trump's response to the H1-B 50 year mortgage backlash: Just kidding, it's time to talk about Epstein \"hoax\" again for the umpteenth time posted 3 hours ago by Thatunknownguy 7 comments award share report block Rapid Response 47 @RapidResponse47 • 4h\n7 comments Sort by Top Top New Worst Old Save ReleasetheList 17 points 3 hours ago Susie Wiles is insulating him from the backlash. He probably doesn't even know how badly he's fucked up this week. permalink award report block reply Zennbrown 1 points 3 hours ago 50 year morgage is a tool. Nobody would actually pay for 50 years. Unless retarded. permalink award report block reply The_Bloofy_Bullshark 2 points 2 hours ago You’d be surprised. Look at how many people buy shitty overpriced cars at high interest rates from scammy used car dealerships. Financial literacy is lacking when it comes to many individuals. There’s a local contracting company that preys on those types by offering these types of long term financing plans (with insane interest rates) to allow customers to fit the price in their budget. A lot of the individuals who take said financing just kick the can down the road. I foresee a lot of that here. permalink parent award report block reply king_cocoon 0 points 2 hours ago Get 50 year mortgage, pay the premium of a 30 year mortgage, pay off a would-be 30 year mortgage in ~25. permalink parent award report block reply king_cocoon -4 points 2 hours ago Deactivate your account if you're going to be a bitch. permalink award report block reply MastaJoda -3 points 2 hours ago Comment removed by community moderators. permalink parent award report block reply Porkbut 1 points 2 hours ago Self report. permalink parent award report block reply\nReleasetheList 17 points 3 hours ago Susie Wiles is insulating him from the backlash. He probably doesn't even know how badly he's fucked up this week. permalink award report block reply\nZennbrown 1 points 3 hours ago 50 year morgage is a tool. Nobody would actually pay for 50 years. Unless retarded. permalink award report block reply The_Bloofy_Bullshark 2 points 2 hours ago You’d be surprised. Look at how many people buy shitty overpriced cars at high interest rates from scammy used car dealerships. Financial literacy is lacking when it comes to many individuals. There’s a local contracting company that preys on those types by offering these types of long term financing plans (with insane interest rates) to allow customers to fit the price in their budget. A lot of the individuals who take said financing just kick the can down the road. I foresee a lot of that here. permalink parent award report block reply king_cocoon 0 points 2 hours ago Get 50 year mortgage, pay the premium of a 30 year mortgage, pay off a would-be 30 year mortgage in ~25. permalink parent award report block reply\nThe_Bloofy_Bullshark 2 points 2 hours ago You’d be surprised. Look at how many people buy shitty overpriced cars at high interest rates from scammy used car dealerships. Financial literacy is lacking when it comes to many individuals. There’s a local contracting company that preys on those types by offering these types of long term financing plans (with insane interest rates) to allow customers to fit the price in their budget. A lot of the individuals who take said financing just kick the can down the road. I foresee a lot of that here. permalink parent award report block reply\nking_cocoon 0 points 2 hours ago Get 50 year mortgage, pay the premium of a 30 year mortgage, pay off a would-be 30 year mortgage in ~25. permalink parent award report block reply\nking_cocoon -4 points 2 hours ago Deactivate your account if you're going to be a bitch. permalink award report block reply MastaJoda -3 points 2 hours ago Comment removed by community moderators. permalink parent award report block reply Porkbut 1 points 2 hours ago Self report. permalink parent award report block reply\nMastaJoda -3 points 2 hours ago Comment removed by community moderators. permalink parent award report block reply Porkbut 1 points 2 hours ago Self report. permalink parent award report block reply\nPorkbut 1 points 2 hours ago Self report. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:09:30.715101Z"
}