{
  "id": "1ARK9iqwz7",
  "url": "https://patriots.win/p/1ARK9iqwz7/tds-20/c",
  "content": "1614 TDS 2.0 🛑  Corrupt Commies  🛑 posted 2 days ago by UrbanCommando 28 comments award share download report block\n28 comments Sort by Top Top New Worst Old Save kippo_hard 55 points 2 days ago Consistently inconsistent permalink award report block reply HumblePepe 18 points 2 days ago If it helps Trump or America, it's intrinsically bad to their values. permalink parent award report block reply MSG1000 8 points 2 days ago No, they’re consistently anti-Trump because they’re pro-globalist. But the pro-globalist needs change a lot because they’re factionated and their plans never work perfectly when they aren’t blowing up in their face. permalink parent award report block reply Aambrick 3 points 2 days ago I am always wondering why they are idiots to be honest. I mean if the globalists truly wanted their government they would have pushed for space colonization because that gives them one avenue that they can trick the bigger idiots to be their workforce while implementing what they want. They get their own little kingdom in space that they can then leave the solar system without anybody stopping them. It really does boggle the mind they can't even figure that out, and that is using their logic. permalink parent award report block reply MSG1000 1 points 2 days ago It would undermine their control with current technology the same way overseas colonies did. And the innovations would solve problems they want to continue to exploit. permalink parent award report block reply Aambrick 2 points 2 days ago I mean they could easily make themselves be viewed as champion of the people, but then again we are talking about people that hate the common people. Either way your right about them. permalink parent award report block reply ChrisSuperDude 25 points 2 days ago “Don’t reopen the government” Your terms are acceptable on that too. permalink award report block reply ColonelKlink 13 points 2 days ago It's possible to be both evil and stupid at the same time. permalink award report block reply invalid_data 10 points 2 days ago TDS 2.0?! These leftist drones are on like TDS 1378.7 now. permalink award report block reply new_meta 6 points 2 days ago Àckshually that kind of chip has to be soldered to the board permalink award report block reply nathanrzehringer 6 points 2 days ago This might be version 9002.2 permalink award report block reply ClownWorldYeeHaw 5 points 2 days ago Agreed. Version 25.10.6.6.6 permalink parent award report block reply TheUnicornDinosaur 4 points 2 days ago this meme is one of the greatest. honestly that week back in the 2016 election cycle where everyone created an NPC account on Twitter and started rambling DNC talking points... that shit was genuinely hilarious permalink award report block reply DustyGoose 2 points 2 days ago When Trump wins America wins. And commies lose. permalink award report block reply billybaldwin2 2 points 2 days ago I can see this mutating into a December vote that gets used in the midterms. Who voted for it and who voted against it. Not shuffled into some omnibus budget. Anyway... now we get to do this dance in January or whatever. permalink award report block reply SimaYi 2 points 2 days ago Shut it down permanently. permalink award report block reply SimaYi 2 points 2 days ago \"No Kings!\" Dissolves congress permalink award report block reply KennyKetchem 1 points 2 days ago I seriously think they were always like this. permalink award report block reply MegoThor 1 points 2 days ago Don’t reopen the government! permalink award report block reply MEME-SUPREME 1 points 2 days ago Classic. permalink award report block reply knnbccb 1 points 2 days ago Trump is already a winner without doing anything, because TDS demons are born losers. permalink award report block reply 10MeV 1 points 1 day ago Well, of course their \"open the government\" was code for GOP losing to the Dems spendthrift plans. Trump winning?  Was not on their bingo cards. permalink award report block reply Wexit-Delecto 0 points 2 days ago I mean, this place is also suddenly pro opening up the government... permalink award report block reply MikePlacid 8 points 2 days ago Actually this place is against paying benefits to illegals. permalink parent award report block reply goldkeyboardwarrior 5 points 2 days ago Most of this place was against giving health benefits to illegals which would have been the case if the GOP caved to Cuck Schumer’s demands. A few people may have been fine if the government never opened no matter what but logically that wouldn’t have worked forever Especially since even if you don’t care about anything else, it would still mean ICE agents, Border Patrol, and the Secret Service protecting Trump wouldn’t get paid. permalink parent award report block reply anotherthing 2 points 1 day ago Not to mention pro-Biden Era levels of spending. Last year, everyone was bitching about Biden Era levels of spending and calling out Mike Johnson for being a bitch for caving to Biden with so much spending. This is just voting for more of that. That level of spending was the GOP's starting position with both the Big Bloated Bill and this one too. We've only codified $9 billion in DOGE cuts, which is a tenth of a percent of Federal spending. permalink parent award report block reply TrumpsBigBalls 0 points 2 days ago Don't think you fully understand the scenario here man. permalink parent award report block reply\nkippo_hard 55 points 2 days ago Consistently inconsistent permalink award report block reply HumblePepe 18 points 2 days ago If it helps Trump or America, it's intrinsically bad to their values. permalink parent award report block reply MSG1000 8 points 2 days ago No, they’re consistently anti-Trump because they’re pro-globalist. But the pro-globalist needs change a lot because they’re factionated and their plans never work perfectly when they aren’t blowing up in their face. permalink parent award report block reply Aambrick 3 points 2 days ago I am always wondering why they are idiots to be honest. I mean if the globalists truly wanted their government they would have pushed for space colonization because that gives them one avenue that they can trick the bigger idiots to be their workforce while implementing what they want. They get their own little kingdom in space that they can then leave the solar system without anybody stopping them. It really does boggle the mind they can't even figure that out, and that is using their logic. permalink parent award report block reply MSG1000 1 points 2 days ago It would undermine their control with current technology the same way overseas colonies did. And the innovations would solve problems they want to continue to exploit. permalink parent award report block reply Aambrick 2 points 2 days ago I mean they could easily make themselves be viewed as champion of the people, but then again we are talking about people that hate the common people. Either way your right about them. permalink parent award report block reply\nHumblePepe 18 points 2 days ago If it helps Trump or America, it's intrinsically bad to their values. permalink parent award report block reply\nMSG1000 8 points 2 days ago No, they’re consistently anti-Trump because they’re pro-globalist. But the pro-globalist needs change a lot because they’re factionated and their plans never work perfectly when they aren’t blowing up in their face. permalink parent award report block reply Aambrick 3 points 2 days ago I am always wondering why they are idiots to be honest. I mean if the globalists truly wanted their government they would have pushed for space colonization because that gives them one avenue that they can trick the bigger idiots to be their workforce while implementing what they want. They get their own little kingdom in space that they can then leave the solar system without anybody stopping them. It really does boggle the mind they can't even figure that out, and that is using their logic. permalink parent award report block reply MSG1000 1 points 2 days ago It would undermine their control with current technology the same way overseas colonies did. And the innovations would solve problems they want to continue to exploit. permalink parent award report block reply Aambrick 2 points 2 days ago I mean they could easily make themselves be viewed as champion of the people, but then again we are talking about people that hate the common people. Either way your right about them. permalink parent award report block reply\nAambrick 3 points 2 days ago I am always wondering why they are idiots to be honest. I mean if the globalists truly wanted their government they would have pushed for space colonization because that gives them one avenue that they can trick the bigger idiots to be their workforce while implementing what they want. They get their own little kingdom in space that they can then leave the solar system without anybody stopping them. It really does boggle the mind they can't even figure that out, and that is using their logic. permalink parent award report block reply MSG1000 1 points 2 days ago It would undermine their control with current technology the same way overseas colonies did. And the innovations would solve problems they want to continue to exploit. permalink parent award report block reply Aambrick 2 points 2 days ago I mean they could easily make themselves be viewed as champion of the people, but then again we are talking about people that hate the common people. Either way your right about them. permalink parent award report block reply\nMSG1000 1 points 2 days ago It would undermine their control with current technology the same way overseas colonies did. And the innovations would solve problems they want to continue to exploit. permalink parent award report block reply Aambrick 2 points 2 days ago I mean they could easily make themselves be viewed as champion of the people, but then again we are talking about people that hate the common people. Either way your right about them. permalink parent award report block reply\nAambrick 2 points 2 days ago I mean they could easily make themselves be viewed as champion of the people, but then again we are talking about people that hate the common people. Either way your right about them. permalink parent award report block reply\nChrisSuperDude 25 points 2 days ago “Don’t reopen the government” Your terms are acceptable on that too. permalink award report block reply\nColonelKlink 13 points 2 days ago It's possible to be both evil and stupid at the same time. permalink award report block reply\ninvalid_data 10 points 2 days ago TDS 2.0?! These leftist drones are on like TDS 1378.7 now. permalink award report block reply\nnew_meta 6 points 2 days ago Àckshually that kind of chip has to be soldered to the board permalink award report block reply\nnathanrzehringer 6 points 2 days ago This might be version 9002.2 permalink award report block reply ClownWorldYeeHaw 5 points 2 days ago Agreed. Version 25.10.6.6.6 permalink parent award report block reply\nClownWorldYeeHaw 5 points 2 days ago Agreed. Version 25.10.6.6.6 permalink parent award report block reply\nTheUnicornDinosaur 4 points 2 days ago this meme is one of the greatest. honestly that week back in the 2016 election cycle where everyone created an NPC account on Twitter and started rambling DNC talking points... that shit was genuinely hilarious permalink award report block reply\nDustyGoose 2 points 2 days ago When Trump wins America wins. And commies lose. permalink award report block reply\nbillybaldwin2 2 points 2 days ago I can see this mutating into a December vote that gets used in the midterms. Who voted for it and who voted against it. Not shuffled into some omnibus budget. Anyway... now we get to do this dance in January or whatever. permalink award report block reply\nSimaYi 2 points 2 days ago Shut it down permanently. permalink award report block reply\nSimaYi 2 points 2 days ago \"No Kings!\" Dissolves congress permalink award report block reply\nKennyKetchem 1 points 2 days ago I seriously think they were always like this. permalink award report block reply\nMegoThor 1 points 2 days ago Don’t reopen the government! permalink award report block reply\nMEME-SUPREME 1 points 2 days ago Classic. permalink award report block reply\nknnbccb 1 points 2 days ago Trump is already a winner without doing anything, because TDS demons are born losers. permalink award report block reply\n10MeV 1 points 1 day ago Well, of course their \"open the government\" was code for GOP losing to the Dems spendthrift plans. Trump winning?  Was not on their bingo cards. permalink award report block reply\nWexit-Delecto 0 points 2 days ago I mean, this place is also suddenly pro opening up the government... permalink award report block reply MikePlacid 8 points 2 days ago Actually this place is against paying benefits to illegals. permalink parent award report block reply goldkeyboardwarrior 5 points 2 days ago Most of this place was against giving health benefits to illegals which would have been the case if the GOP caved to Cuck Schumer’s demands. A few people may have been fine if the government never opened no matter what but logically that wouldn’t have worked forever Especially since even if you don’t care about anything else, it would still mean ICE agents, Border Patrol, and the Secret Service protecting Trump wouldn’t get paid. permalink parent award report block reply anotherthing 2 points 1 day ago Not to mention pro-Biden Era levels of spending. Last year, everyone was bitching about Biden Era levels of spending and calling out Mike Johnson for being a bitch for caving to Biden with so much spending. This is just voting for more of that. That level of spending was the GOP's starting position with both the Big Bloated Bill and this one too. We've only codified $9 billion in DOGE cuts, which is a tenth of a percent of Federal spending. permalink parent award report block reply TrumpsBigBalls 0 points 2 days ago Don't think you fully understand the scenario here man. permalink parent award report block reply\nMikePlacid 8 points 2 days ago Actually this place is against paying benefits to illegals. permalink parent award report block reply\ngoldkeyboardwarrior 5 points 2 days ago Most of this place was against giving health benefits to illegals which would have been the case if the GOP caved to Cuck Schumer’s demands. A few people may have been fine if the government never opened no matter what but logically that wouldn’t have worked forever Especially since even if you don’t care about anything else, it would still mean ICE agents, Border Patrol, and the Secret Service protecting Trump wouldn’t get paid. permalink parent award report block reply\nanotherthing 2 points 1 day ago Not to mention pro-Biden Era levels of spending. Last year, everyone was bitching about Biden Era levels of spending and calling out Mike Johnson for being a bitch for caving to Biden with so much spending. This is just voting for more of that. That level of spending was the GOP's starting position with both the Big Bloated Bill and this one too. We've only codified $9 billion in DOGE cuts, which is a tenth of a percent of Federal spending. permalink parent award report block reply\nTrumpsBigBalls 0 points 2 days ago Don't think you fully understand the scenario here man. permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:48:35.620217Z"
}