{
  "id": "8185133",
  "title": "99Love this guy, and so thankful we have him!posted5 hours agobywst429 commentsawardsharedownloadrep",
  "url": "https://patriots.win/p/1ARK9nNypn/love-this-guy-and-so-thankful-we/c",
  "content": "99 Love this guy, and so thankful we have him! posted 5 hours ago by wst4 29 comments award share download report block\n29 comments Sort by Top Top New Worst Old Save PeteJeffrey 9 points 5 hours ago He currently is NOT working for the American people if he is promoting 50 year mortgages, covering up Epstein and saying Americans aren’t talented so we need Indian H1B. The is working for big corporations and special interests. permalink award report block reply Marina 2 points 5 hours ago I’m not willing to support the RATS because President Trump thinks we need H1B but definitely need to have a debate and research the actual need . permalink parent award report block reply PeteJeffrey 6 points 5 hours ago Not asking anyone to support the left just trying to get people to pay the fuck attention to this administration going off the rails. I think Trump just has bad people around him. permalink parent award report block reply redditadminssuckit -3 points 5 hours ago The man is doing a million great things... he's not perfect.  You're a fucking ungrateful faggot. permalink parent award report block reply imnotdeadyet -2 points 4 hours ago I was thinking the same thing.  This is the RINO \"Republican's pounce\" moment.  Everytime Trump says or does something someone doesn't like, they start Trashing Trump and screaming MAGA is doomed.  Trump is not going to be perfect and he is going to do some things we may not like, but consider what has done and how no one in Congress is helping him.  Not to mention the mess Biden left him to cleanup. permalink parent award report block reply view 1 more comments... redditadminssuckit -7 points 5 hours ago Go fuck yourself,  you stupid ignorant dumbass permalink parent award report block reply shaaarbucks 5 points 5 hours ago Edit: Didnt realize i was typing to a bot.\nLol.  You must not be paying attention.   The affordability crisis should be no1. so we dont have these socialists being elected.   Then tackle these stupid fucking Indians.  Then tell China to suck it and send your kids to your own universities. permalink parent award report block reply redditadminssuckit -3 points 4 hours ago Dumb fuck,  yes,  you. 50 year mortgages won't impact affordability... nobody will use them,  dumbass. When the pajeets get exposed for being AI using frauds,  they'll be done. And China is next on the list to get fucked. Our enemy is the liberal female voter,  you stupid ass. permalink parent award report block reply T471 4 points 4 hours ago you're delusional, they will have to use them. A person will get 30 years in, default one payment and the banks win. permalink parent award report block reply shaaarbucks 1 points 2 hours ago Bot permalink parent award report block reply Maganifice7 2 points 4 hours ago You are a fucking moron. You are just as fucking stupid as the leftists retards. permalink parent award report block reply redditadminssuckit -1 points 4 hours ago You have no business in this forum you imbecile permalink parent award report block reply T471 6 points 5 hours ago yet, his family wealth has increased by billions and the average person is more in debt than ever.  Don't even get me started on the idea that denying 600k Chinese into the country would tank the do nothing worthless colleges. permalink award report block reply redditadminssuckit -7 points 5 hours ago What the actual fuck is wrong with you? permalink parent award report block reply Maganifice7 7 points 4 hours ago Haveing a functional brain means something is wrong with you? permalink parent award report block reply redditadminssuckit -3 points 4 hours ago I'm not saying he doesn't deserve criticism,  but you fuckers are turning on him.  So fuck you permalink parent award report block reply T471 4 points 4 hours ago cool down, no need to lose you mind. Criticism is critical. permalink parent award report block reply YouEssAye 2 points 4 hours ago We're NOT turning on him, he's turning on us. I will happily support him if and when he decides to put America and the forgotten man that voted for him first. permalink parent award report block reply T471 5 points 4 hours ago Which part hurts you? permalink parent award report block reply redditadminssuckit -4 points 4 hours ago It doesn't hurt me that you're obviously turning on GEOTUS and insinuating he's corrupt. Get the fuck off this forum permalink parent award report block reply T471 3 points 4 hours ago The reversal of key voting points is in fact a major issue, those policy shifts deserve criticism. permalink parent award report block reply Bullet3250 3 points 5 hours ago We need MORE MAGA LEADERS... American Patriots - who will FIGHT/LEAD - and CAN NOT BE BOUGHT. A rare combination. permalink award report block reply MocksFordComma 3 points 5 hours ago We need 10,000 Trumps, not one. permalink parent award report block reply Maganifice7 3 points 4 hours ago Imagine all the h1bs and Chinese students we would have. permalink parent award report block reply starjello 2 points 4 hours ago LOL  they down voted your comment but it was funny and probably very accurate. A lot of asses are being chaffed here and I imagine the morons at the gay awakening are going to sign up for assisted suicide. permalink parent award report block reply Maganifice7 1 points 4 hours ago He's not freeing us. He is becoming a complete clown and failure right in front of our eyes. permalink award report block reply BusterHyman99 1 points 2 hours ago And now he has to watch as most of MAGA stab him in the back over recent comments smh permalink award report block reply RudeFrog 1 points 3 hours ago I love the guy, best president ever, we would probably be dead by now if not for him stepping up. Starting to feel like we have grown past him now. permalink award report block reply redditadminssuckit 0 points 5 hours ago Just came here to agree and admire that smoking hot Melania too permalink award report block reply\nPeteJeffrey 9 points 5 hours ago He currently is NOT working for the American people if he is promoting 50 year mortgages, covering up Epstein and saying Americans aren’t talented so we need Indian H1B. The is working for big corporations and special interests. permalink award report block reply Marina 2 points 5 hours ago I’m not willing to support the RATS because President Trump thinks we need H1B but definitely need to have a debate and research the actual need . permalink parent award report block reply PeteJeffrey 6 points 5 hours ago Not asking anyone to support the left just trying to get people to pay the fuck attention to this administration going off the rails. I think Trump just has bad people around him. permalink parent award report block reply redditadminssuckit -3 points 5 hours ago The man is doing a million great things... he's not perfect.  You're a fucking ungrateful faggot. permalink parent award report block reply imnotdeadyet -2 points 4 hours ago I was thinking the same thing.  This is the RINO \"Republican's pounce\" moment.  Everytime Trump says or does something someone doesn't like, they start Trashing Trump and screaming MAGA is doomed.  Trump is not going to be perfect and he is going to do some things we may not like, but consider what has done and how no one in Congress is helping him.  Not to mention the mess Biden left him to cleanup. permalink parent award report block reply view 1 more comments... redditadminssuckit -7 points 5 hours ago Go fuck yourself,  you stupid ignorant dumbass permalink parent award report block reply shaaarbucks 5 points 5 hours ago Edit: Didnt realize i was typing to a bot.\nLol.  You must not be paying attention.   The affordability crisis should be no1. so we dont have these socialists being elected.   Then tackle these stupid fucking Indians.  Then tell China to suck it and send your kids to your own universities. permalink parent award report block reply redditadminssuckit -3 points 4 hours ago Dumb fuck,  yes,  you. 50 year mortgages won't impact affordability... nobody will use them,  dumbass. When the pajeets get exposed for being AI using frauds,  they'll be done. And China is next on the list to get fucked. Our enemy is the liberal female voter,  you stupid ass. permalink parent award report block reply T471 4 points 4 hours ago you're delusional, they will have to use them. A person will get 30 years in, default one payment and the banks win. permalink parent award report block reply shaaarbucks 1 points 2 hours ago Bot permalink parent award report block reply Maganifice7 2 points 4 hours ago You are a fucking moron. You are just as fucking stupid as the leftists retards. permalink parent award report block reply redditadminssuckit -1 points 4 hours ago You have no business in this forum you imbecile permalink parent award report block reply\nMarina 2 points 5 hours ago I’m not willing to support the RATS because President Trump thinks we need H1B but definitely need to have a debate and research the actual need . permalink parent award report block reply PeteJeffrey 6 points 5 hours ago Not asking anyone to support the left just trying to get people to pay the fuck attention to this administration going off the rails. I think Trump just has bad people around him. permalink parent award report block reply redditadminssuckit -3 points 5 hours ago The man is doing a million great things... he's not perfect.  You're a fucking ungrateful faggot. permalink parent award report block reply imnotdeadyet -2 points 4 hours ago I was thinking the same thing.  This is the RINO \"Republican's pounce\" moment.  Everytime Trump says or does something someone doesn't like, they start Trashing Trump and screaming MAGA is doomed.  Trump is not going to be perfect and he is going to do some things we may not like, but consider what has done and how no one in Congress is helping him.  Not to mention the mess Biden left him to cleanup. permalink parent award report block reply view 1 more comments...\nPeteJeffrey 6 points 5 hours ago Not asking anyone to support the left just trying to get people to pay the fuck attention to this administration going off the rails. I think Trump just has bad people around him. permalink parent award report block reply redditadminssuckit -3 points 5 hours ago The man is doing a million great things... he's not perfect.  You're a fucking ungrateful faggot. permalink parent award report block reply imnotdeadyet -2 points 4 hours ago I was thinking the same thing.  This is the RINO \"Republican's pounce\" moment.  Everytime Trump says or does something someone doesn't like, they start Trashing Trump and screaming MAGA is doomed.  Trump is not going to be perfect and he is going to do some things we may not like, but consider what has done and how no one in Congress is helping him.  Not to mention the mess Biden left him to cleanup. permalink parent award report block reply view 1 more comments...\nredditadminssuckit -3 points 5 hours ago The man is doing a million great things... he's not perfect.  You're a fucking ungrateful faggot. permalink parent award report block reply imnotdeadyet -2 points 4 hours ago I was thinking the same thing.  This is the RINO \"Republican's pounce\" moment.  Everytime Trump says or does something someone doesn't like, they start Trashing Trump and screaming MAGA is doomed.  Trump is not going to be perfect and he is going to do some things we may not like, but consider what has done and how no one in Congress is helping him.  Not to mention the mess Biden left him to cleanup. permalink parent award report block reply view 1 more comments...\nimnotdeadyet -2 points 4 hours ago I was thinking the same thing.  This is the RINO \"Republican's pounce\" moment.  Everytime Trump says or does something someone doesn't like, they start Trashing Trump and screaming MAGA is doomed.  Trump is not going to be perfect and he is going to do some things we may not like, but consider what has done and how no one in Congress is helping him.  Not to mention the mess Biden left him to cleanup. permalink parent award report block reply view 1 more comments...\nredditadminssuckit -7 points 5 hours ago Go fuck yourself,  you stupid ignorant dumbass permalink parent award report block reply shaaarbucks 5 points 5 hours ago Edit: Didnt realize i was typing to a bot.\nLol.  You must not be paying attention.   The affordability crisis should be no1. so we dont have these socialists being elected.   Then tackle these stupid fucking Indians.  Then tell China to suck it and send your kids to your own universities. permalink parent award report block reply redditadminssuckit -3 points 4 hours ago Dumb fuck,  yes,  you. 50 year mortgages won't impact affordability... nobody will use them,  dumbass. When the pajeets get exposed for being AI using frauds,  they'll be done. And China is next on the list to get fucked. Our enemy is the liberal female voter,  you stupid ass. permalink parent award report block reply T471 4 points 4 hours ago you're delusional, they will have to use them. A person will get 30 years in, default one payment and the banks win. permalink parent award report block reply shaaarbucks 1 points 2 hours ago Bot permalink parent award report block reply Maganifice7 2 points 4 hours ago You are a fucking moron. You are just as fucking stupid as the leftists retards. permalink parent award report block reply redditadminssuckit -1 points 4 hours ago You have no business in this forum you imbecile permalink parent award report block reply\nshaaarbucks 5 points 5 hours ago Edit: Didnt realize i was typing to a bot.\nLol.  You must not be paying attention.   The affordability crisis should be no1. so we dont have these socialists being elected.   Then tackle these stupid fucking Indians.  Then tell China to suck it and send your kids to your own universities. permalink parent award report block reply redditadminssuckit -3 points 4 hours ago Dumb fuck,  yes,  you. 50 year mortgages won't impact affordability... nobody will use them,  dumbass. When the pajeets get exposed for being AI using frauds,  they'll be done. And China is next on the list to get fucked. Our enemy is the liberal female voter,  you stupid ass. permalink parent award report block reply T471 4 points 4 hours ago you're delusional, they will have to use them. A person will get 30 years in, default one payment and the banks win. permalink parent award report block reply shaaarbucks 1 points 2 hours ago Bot permalink parent award report block reply\nredditadminssuckit -3 points 4 hours ago Dumb fuck,  yes,  you. 50 year mortgages won't impact affordability... nobody will use them,  dumbass. When the pajeets get exposed for being AI using frauds,  they'll be done. And China is next on the list to get fucked. Our enemy is the liberal female voter,  you stupid ass. permalink parent award report block reply T471 4 points 4 hours ago you're delusional, they will have to use them. A person will get 30 years in, default one payment and the banks win. permalink parent award report block reply shaaarbucks 1 points 2 hours ago Bot permalink parent award report block reply\nT471 4 points 4 hours ago you're delusional, they will have to use them. A person will get 30 years in, default one payment and the banks win. permalink parent award report block reply\nshaaarbucks 1 points 2 hours ago Bot permalink parent award report block reply\nMaganifice7 2 points 4 hours ago You are a fucking moron. You are just as fucking stupid as the leftists retards. permalink parent award report block reply redditadminssuckit -1 points 4 hours ago You have no business in this forum you imbecile permalink parent award report block reply\nredditadminssuckit -1 points 4 hours ago You have no business in this forum you imbecile permalink parent award report block reply\nT471 6 points 5 hours ago yet, his family wealth has increased by billions and the average person is more in debt than ever.  Don't even get me started on the idea that denying 600k Chinese into the country would tank the do nothing worthless colleges. permalink award report block reply redditadminssuckit -7 points 5 hours ago What the actual fuck is wrong with you? permalink parent award report block reply Maganifice7 7 points 4 hours ago Haveing a functional brain means something is wrong with you? permalink parent award report block reply redditadminssuckit -3 points 4 hours ago I'm not saying he doesn't deserve criticism,  but you fuckers are turning on him.  So fuck you permalink parent award report block reply T471 4 points 4 hours ago cool down, no need to lose you mind. Criticism is critical. permalink parent award report block reply YouEssAye 2 points 4 hours ago We're NOT turning on him, he's turning on us. I will happily support him if and when he decides to put America and the forgotten man that voted for him first. permalink parent award report block reply T471 5 points 4 hours ago Which part hurts you? permalink parent award report block reply redditadminssuckit -4 points 4 hours ago It doesn't hurt me that you're obviously turning on GEOTUS and insinuating he's corrupt. Get the fuck off this forum permalink parent award report block reply T471 3 points 4 hours ago The reversal of key voting points is in fact a major issue, those policy shifts deserve criticism. permalink parent award report block reply\nredditadminssuckit -7 points 5 hours ago What the actual fuck is wrong with you? permalink parent award report block reply Maganifice7 7 points 4 hours ago Haveing a functional brain means something is wrong with you? permalink parent award report block reply redditadminssuckit -3 points 4 hours ago I'm not saying he doesn't deserve criticism,  but you fuckers are turning on him.  So fuck you permalink parent award report block reply T471 4 points 4 hours ago cool down, no need to lose you mind. Criticism is critical. permalink parent award report block reply YouEssAye 2 points 4 hours ago We're NOT turning on him, he's turning on us. I will happily support him if and when he decides to put America and the forgotten man that voted for him first. permalink parent award report block reply T471 5 points 4 hours ago Which part hurts you? permalink parent award report block reply redditadminssuckit -4 points 4 hours ago It doesn't hurt me that you're obviously turning on GEOTUS and insinuating he's corrupt. Get the fuck off this forum permalink parent award report block reply T471 3 points 4 hours ago The reversal of key voting points is in fact a major issue, those policy shifts deserve criticism. permalink parent award report block reply\nMaganifice7 7 points 4 hours ago Haveing a functional brain means something is wrong with you? permalink parent award report block reply redditadminssuckit -3 points 4 hours ago I'm not saying he doesn't deserve criticism,  but you fuckers are turning on him.  So fuck you permalink parent award report block reply T471 4 points 4 hours ago cool down, no need to lose you mind. Criticism is critical. permalink parent award report block reply YouEssAye 2 points 4 hours ago We're NOT turning on him, he's turning on us. I will happily support him if and when he decides to put America and the forgotten man that voted for him first. permalink parent award report block reply\nredditadminssuckit -3 points 4 hours ago I'm not saying he doesn't deserve criticism,  but you fuckers are turning on him.  So fuck you permalink parent award report block reply T471 4 points 4 hours ago cool down, no need to lose you mind. Criticism is critical. permalink parent award report block reply YouEssAye 2 points 4 hours ago We're NOT turning on him, he's turning on us. I will happily support him if and when he decides to put America and the forgotten man that voted for him first. permalink parent award report block reply\nT471 4 points 4 hours ago cool down, no need to lose you mind. Criticism is critical. permalink parent award report block reply\nYouEssAye 2 points 4 hours ago We're NOT turning on him, he's turning on us. I will happily support him if and when he decides to put America and the forgotten man that voted for him first. permalink parent award report block reply\nT471 5 points 4 hours ago Which part hurts you? permalink parent award report block reply redditadminssuckit -4 points 4 hours ago It doesn't hurt me that you're obviously turning on GEOTUS and insinuating he's corrupt. Get the fuck off this forum permalink parent award report block reply T471 3 points 4 hours ago The reversal of key voting points is in fact a major issue, those policy shifts deserve criticism. permalink parent award report block reply\nredditadminssuckit -4 points 4 hours ago It doesn't hurt me that you're obviously turning on GEOTUS and insinuating he's corrupt. Get the fuck off this forum permalink parent award report block reply T471 3 points 4 hours ago The reversal of key voting points is in fact a major issue, those policy shifts deserve criticism. permalink parent award report block reply\nT471 3 points 4 hours ago The reversal of key voting points is in fact a major issue, those policy shifts deserve criticism. permalink parent award report block reply\nBullet3250 3 points 5 hours ago We need MORE MAGA LEADERS... American Patriots - who will FIGHT/LEAD - and CAN NOT BE BOUGHT. A rare combination. permalink award report block reply MocksFordComma 3 points 5 hours ago We need 10,000 Trumps, not one. permalink parent award report block reply Maganifice7 3 points 4 hours ago Imagine all the h1bs and Chinese students we would have. permalink parent award report block reply starjello 2 points 4 hours ago LOL  they down voted your comment but it was funny and probably very accurate. A lot of asses are being chaffed here and I imagine the morons at the gay awakening are going to sign up for assisted suicide. permalink parent award report block reply\nMocksFordComma 3 points 5 hours ago We need 10,000 Trumps, not one. permalink parent award report block reply Maganifice7 3 points 4 hours ago Imagine all the h1bs and Chinese students we would have. permalink parent award report block reply starjello 2 points 4 hours ago LOL  they down voted your comment but it was funny and probably very accurate. A lot of asses are being chaffed here and I imagine the morons at the gay awakening are going to sign up for assisted suicide. permalink parent award report block reply\nMaganifice7 3 points 4 hours ago Imagine all the h1bs and Chinese students we would have. permalink parent award report block reply starjello 2 points 4 hours ago LOL  they down voted your comment but it was funny and probably very accurate. A lot of asses are being chaffed here and I imagine the morons at the gay awakening are going to sign up for assisted suicide. permalink parent award report block reply\nstarjello 2 points 4 hours ago LOL  they down voted your comment but it was funny and probably very accurate. A lot of asses are being chaffed here and I imagine the morons at the gay awakening are going to sign up for assisted suicide. permalink parent award report block reply\nMaganifice7 1 points 4 hours ago He's not freeing us. He is becoming a complete clown and failure right in front of our eyes. permalink award report block reply\nBusterHyman99 1 points 2 hours ago And now he has to watch as most of MAGA stab him in the back over recent comments smh permalink award report block reply\nRudeFrog 1 points 3 hours ago I love the guy, best president ever, we would probably be dead by now if not for him stepping up. Starting to feel like we have grown past him now. permalink award report block reply\nredditadminssuckit 0 points 5 hours ago Just came here to agree and admire that smoking hot Melania too permalink award report block reply",
  "fetched_at": "2025-11-12T19:25:27.427325Z"
}