{
  "id": "1ARK9hiH5B",
  "url": "https://patriots.win/p/1ARK9hiH5B/want-to-know-why-white-people-ca/c",
  "content": "885 Want to know why White people can't get jobs?  It's intentional. | Coke caught denying White guy with 20 years exp over same resume with 5 years and the name \"DeShawn\" DIDN'T  EARN  IT posted 2 days ago by PillarOfWisdom 44 comments award share report block Libs of TikTok @libsoftiktok • 3d EXCLUSIVE ALLEGED DISCRIMINATORY HIRING PRACTICES AT COCA-COLA AGAINST WHITE PEOPLE An individual named \"David\" sent in a job application to @CocaCola, citing 20 YEARS of experience in the industry. His application was REJECTED the next day. He then sent in another\n44 comments Sort by Top Top New Worst Old Save loosemoose 60 points 2 days ago Millions of white men have been denied education and work just for being white. permalink award report block reply posedgeclk 10 points 2 days ago By a bot named Fizz. How humiliating. permalink parent award report block reply booblitchutz 4 points 2 days ago the bot code: if Applicant.Race == \"White\" {\n    exit(1)\n} permalink parent award report block reply Choppermagic 3 points 2 days ago and east asians from ivy league school for having grades that are too good permalink parent award report block reply Moebius 38 points 2 days ago Well...they did say to \"Try to be less White...\" I've not bought a single Coca Cola product since... permalink award report block reply TheDevilMonkey 3 points 2 days ago Same. permalink parent award report block reply 2FBIAgents1Cup 3 points 2 days ago Ditto permalink parent award report block reply PeteButtplug 32 points 2 days ago I work in IT. The black manager over help desk only seems to want to hire black dudes to work for her. Maybe black dudes are the only people who know how to fix laptops and get your printer to work, or maybe she's racist! permalink award report block reply lostremote- 8 points 2 days ago Hey cool it! You damn well know only white people are the only ones that are rayciss! permalink parent award report block reply joggin_noggin 4 points 2 days ago Has she started firing the remaining white employees yet, or are you still in the early stages? permalink parent award report block reply PeteButtplug 3 points 2 days ago Fortunately she only oversees 6 people, and I'm not one of them. I do worry for her remaining white male employee. My boss is American Chinese and he seems pretty legit. permalink parent award report block reply Impotent_Weasel 31 points 2 days ago Walks into coca-cola wearing blackface, “ay  yo what up my fellow noggers?” permalink award report block reply NotYourMan 29 points 2 days ago Its not just white men.  My neighbors daughter (blond, green eyes, 26 years old) has an undergrad in physics from a big school and a master in AI but she can't get a job in silicon valley.  She has been trying for one year and a half.  She gets invited to these HR \"parties\" where they interview college grads.  She says she is the only American in the room, all the other people are from India. permalink award report block reply joggin_noggin 8 points 2 days ago If they were smart, they'd hire her for simp-bait, if nothing else. permalink parent award report block reply PillarOfWisdom OP 3 points 2 days ago That's so sad.  Both parties are to blame.  Repubes are hooked at the hip with H1Bs and the marxists facilitate the hordes of illegals.  Combined, we have 100 million non citizens stealing our God-given birthright to a civilized society. permalink parent award report block reply keeptherepublic1776 21 points 2 days ago I think they use the demographic questions as well to discriminate. Say you are white out. Decline to answer out permalink award report block reply Whoopies_tds 14 points 2 days ago This 👆 The so called \"demographic data\" was was part of the government's OFCCP regulation changes about 20 years ago with the stated goal of being to have government contractors prove they were hiring a proportional number of people by race and gender compared to those who applied. I have seen first hand how companies force a DEI hire by telling their HR people that only a woman or non-white male will be considered for the position. permalink parent award report block reply RedStoneDeepState 8 points 2 days ago My grandmother's German birth certificate says she was born in Cuba to parents that were in the German Army in 1942. Due to this I claim I am a Hispanic. permalink parent award report block reply ChickNorris 8 points 2 days ago I started checking \"other\" when I was applying for jobs years ago. I had submitted 200 applications (I kept count) and after no responses on the first 180 or so I started checking other on that demographics questionnaire. I finally started getting calls for interviews at that point. This was back in 2013 btw. This has been going on for over 15 years now. permalink parent award report block reply Oodles 18 points 2 days ago SNAP funds this anti-White racism The worst part of SNAP is not the deadbeats directly spending your money to get diabetes, but all of the corrupt anti-White companies that rely on this money to try to eliminate you and your family from this country permalink award report block reply Luvs_2_Bop 8 points 2 days ago Needs to be said more often permalink parent award report block reply NewJigger504 12 points 2 days ago companies HATE people with experience it's no secret. they want coachable people they can pay LESS permalink award report block reply trumpORbust 13 points 2 days ago While true - not the whole story these days permalink parent award report block reply toobaditworks 5 points 2 days ago They also have an endless supply of people to go through.  At one job I had the company hired temps from a temp agency and told them all they'd be hired fulltime but it was a trick to get them to work overtime. When the week or two weeks was up they fired the temps and claimed they were not able to find anyone fit for the job. Then they hired h1b's and remote's from india. permalink parent award report block reply Spike 8 points 2 days ago Likely it is ageism as well. 20 years xp says they will have to spend more on salary. permalink award report block reply Keep_on_winning_kag 2 points 2 days ago And it puts you over 40 so they age discriminate anyways. permalink parent award report block reply assblast 7 points 2 days ago Dumb to change more than one variable in each submission permalink award report block reply Maga_Gator 5 points 2 days ago I worked in Coke inside sales years ago,  they are super racists.  Every product is/was pushed by demographic.  Grape Fanta was pushed hard for ghetto area buyers,  and Cherry Coke and Mello Yellow/Surge for white burbs permalink award report block reply couranto 5 points 2 days ago I’ve done this. It’s true. I get interview every time w my factual resume but pretend to be a black. permalink award report block reply Keep_on_winning_kag 4 points 2 days ago I can't get hired at kraft foods in beaver dam wisconsin. Been applying for a few years when i get laid off in the winter. permalink award report block reply DJTXLV 3 points 2 days ago Someone write a bot that floods cow cola with fake black resumes. permalink award report block reply Itspepesilva 3 points 2 days ago Remember \"be less white\" ? We already knew this about woke-a-cola permalink award report block reply YodaBannon 3 points 2 days ago Fizz permalink award report block reply jhewish 3 points 2 days ago The best part is them landing on black for the race based on the retarded black name. permalink award report block reply CharlesWilliams 3 points 2 days ago Time to legally change name to Seaniqua? permalink award report block reply rastren 3 points 2 days ago First, No one should be drinking the goyslop. Besides that, Lots of other organizations are still doing this. Is it a Blackrock esg thing? Does it entail tax breaks for the company? Whatever they, we need to figure out why and end any benefits they may be getting. Otherwise it will just get worse over time permalink award report block reply USAisAOKay 2 points 2 days ago Always put other on your job application. Maybe even toss in a hispanic. permalink award report block reply ImportantPerson -1 points 2 days ago As a hiring manager, there is a very good chance that I won't call the person back with 20 years experience simply because you are going to pay for that experience and it might be over the budget that I want to spend. It would be interesting to know what the job listing actually said.  I have absolutely denied applicants that have significant experience that would apply to the role that I'm hiring simply because I know I won't afford them for the budget I have. I don't know why they didn't just use the same resume.  It really screws up anything they were trying to prove. permalink award report block reply toobaditworks 2 points 2 days ago How does it make sense to not hire someone who is there in an interview for a job where you say \"we pay this amount of money in the job listing\" and they agree on that amount of money but then you're saying 'it's out of your budget to hire them because they have experience and you'd have to pay them more'. If the job they apply to pays a certain amount you tell the person \"THIS JOB PAYS X AMOUNT OF MONEY\".  If the person being interviewed thinks it's not enough for them they won't take the job.  But if you're advertising a job it usually says in the job listing this job pays between this amount and that amount of money. Nobody applies for a job they don't want to take unless they are on SNAP or getting free money where applying for jobs is the job. And if you have job listings that state the lowest paid amount of money to the highest paid amount of money  but then throw out anyone you would need to pay the higher amount to then you're lying on the job listing if you already know you won't pay the high amount. Everything about your comment says you should not be in charge of hiring anyone ever. permalink parent award report block reply ImportantPerson -1 points 2 days ago Let me explain so that you actually understand this and don't make this mistake again. If I have someone who is overqualified for a job and I know that I'm underpaying them based on their experience, then I know they won't be a long term employee.  Applying for a job significantly below your experience level is going to be a temporary solution until you find a job that fits your experience level. Hiring this person is not a good investment for me because there is signifcant costs in hiring and training new employees.  I want to invest that money into an employee that is going to last longer than a few months or already has a foot out the door already. It's always amazing how people like you with clearly ZERO experience with hiring acts like you have a clue what you are talking about.  You could have just asked WHY someone would avoid hiring the more experienced person but instead, you ignorantly claimed I shouldn't be in charge of hiring anyone.  Next time, be the idiot you are and just ask the question instead of pretending you know better.  M'kay pumpkin.  Now, get offended. permalink parent award report block reply toobaditworks 0 points 1 day ago How much experience do YOU have?  I bet you have YEARS of experience at your job.  Don't you? How long have you been at this job of yours? I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience.  They'd find out they're paying you too much and let you go. BYE! Have fun trying to find a job with all that experience you have. And don't give me that \"I want a longer lasting employee'.   If you have job openings then clearly your logic isn't working out or you wouldn't be hiring.  You'd have long lasting employee's with little experience in their job.... which brings us to the next flaw in your logic. How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience?  Right when that person gets enough of your 'experience' that they can't take it anymore  you'll fire those people and bring in another victim who hasn't had to endure your experience. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. And first you said: there is a very good chance that I won't call the person back with 20 years experience simply because you are going to pay for that experience and it might be over the budget that I want to spend I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. So going OVER budget is not reality. Then you ignored that and changed it to: Hiring this person is not a good investment for me because there is signifcant costs in hiring and training new employees. I want to invest that money into an employee that is going to last longer than a few months or already has a foot out the door already. When you hire a person with experience you don't have to train as much because guess what?  That is what EXPERIENCE is.  It means they already know the job.  They have 'experience' doing the same thing at another company or whatever. Everything you state is an excuse to just hire someone for cheap slave labor. YOU ARE THE PROBLEM.  And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. permalink parent award report block reply ImportantPerson 0 points 1 day ago How much experience do YOU have? I bet you have YEARS of experience at your job. Don't you? Yes.  And I'm well paid for that experience because that experience is used to evaluate who I want to hire for my team and how I can get the most out of my investments. How long have you been at this job of yours? 20+ years of experience, give or take. I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. If I interviewed myself for my current job, then I would hire myself because I'm hiring for a job that expects 20 years of management experience leading multifaceted local and international teams. If I was interviewing myself for the job I had 20 years ago, I wouldn't hire myself because of exactly what I said earlier.  It would be a bad investment.  I wouldn't even want that job I had 20 years ago now because it's below my pay grade and what my experience level is.  Basically, I'd have to be desperate to take that job now and I would be gone the second I found something better... just like I said. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience. I realize that you are desperate and you want this to be true, but unfortunately this is the real world and not some fantasy world that cowards like you pretend is real. When you get jobs like mine, your compensation is tied to the revenue of the company.  Why would I hire people who are bad for the business or would slow business down when that would directly reduce my income?  You really didn't think this through at all but that's not surprising. And don't give me that \"I want a longer lasting employee'. I am going to give that because it's reality.  I don't care if you don't like it.  You have no experience with this so where are you getting this belief that somehow a person getting drastically underpaid for their current experience level is going to somehow be a long term employee? How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience? I'm going to take some time here to educate you on how the real world works.  Go ahead, get offended, get upset, be the teenager with no experience who thinks they know everything.  I don't care.  Learn from this or don't and you'll learn from it later in life. The original example was an employee with FIVE years of experience, not zero.  Details matter even if your childish rage forgets them. If I hire someone that is wrong for the position, whether that's a skill level issue or it's a compensation issue, that person will not last.  These people will last 6-12 months and will jump to a different company as soon as a more appropriate position becomes available.  Hiring and training that person has probably cost me anywhere from 5k-10k in overhead costs plus whatever I paid them in salary during that time.  I don't get a return on my investment. Conversely, if I hire someone right for the job that I'm hiring for, that person will, on average, stay for 2-3 years minimum.  After 2-3 years, it's usually a turning point for each person.  Most people will seek a promotion or seek out other jobs because the last 2-3 years of experience puts them into new opportunities. My departments are set up to promote from within.  Employee > Senior Employee > Manager > Senior Manager > Department Head > Global Head.  This structure is set up across multiple different departments that I manage.  It creates and rewards loyalty and provides me a very strong return on investment.  The average length of time a person works for me is 6 years. Right when that person gets enough of your 'experience' that they can't take it anymore you'll fire those people and bring in another victim who hasn't had to endure your experience. More made up stories because you need to be the victim. I don't fire people who are doing their job.  Pay structures are based on the job a person is doing.  If you are working as a cashier at a grocery store, your pay is never going to be great no matter how long you work.  It's a limitation of the job compensation.  If someone has 20 years of cashier experience, I'm still not going to pay them more than the job is worth. People who get fired for \"making too much money\" are a result of poor planning and poor company structures. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. Why?  Because I actually hire people for the right job and compensate them correctly? Honestly, have you ever worked in a professional environment at all? I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. Yes, and I held your hand through how those costs can exceed the budget.  Sorry, let me dumb this down for you because my comment went over your head.  A person who is vastly overqualified for a position is going to expect more money to retain them.  Like I pointed out, they will not last.  You can absolutely hire them at whatever your current budget is, but you will either be paying them more in the long run or they will be jumping ship. When you hire a person with experience you don't have to train as much because guess what? That is what EXPERIENCE is. You've never worked a real world job in your life.  You just made it absolutely 100% clear that you should not even be in this conversation. For your statement to be true, every single company in the industry needs to function exactly the same and have zero differences in processes, capabilities, resources and structure.   Anyone with a day of experience working in a professional industry knows that's not true. It would be like being a professional basketball player, getting traded to a different team and then expecting that the offense is run exactly the same on the new team.  This is retarded to believe but that's exactly what you are saying. Everything you state is an excuse to just hire someone for cheap slave labor. I'm consistenly compensating 20% higher than the market average for all of my positions which is why my departments have some of the best retention in my company.  Sorry, your fantasy is just wrong again. YOU ARE THE PROBLEM. And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. I don't hire illegals.  I don't hire H1B's.  I hire Americans.  I hire people who are right for the job.  I don't hire people who are going to jump ship the second a better offer gets tossed on the table.  I want a return on my investment because I'm a business and not a fucking charity case. My guess is that you are a lazy fucking worthless person who can't find a job and rather than do ANYTHING to make yourself more valuable, you just blame everyone else.  You are nothing but coward.  I'm betting that you were so offended and upset that you didn't even read this far and you are going to run away crying like a little bitchs. Experience is important.  It's why you are fucking clueless. permalink parent award report block reply Deplora -2 points 2 days ago \"Alleged\", so it could be just fabricated clickbait.  I'll pay attention when the lawsuit is filed. permalink award report block reply\nloosemoose 60 points 2 days ago Millions of white men have been denied education and work just for being white. permalink award report block reply posedgeclk 10 points 2 days ago By a bot named Fizz. How humiliating. permalink parent award report block reply booblitchutz 4 points 2 days ago the bot code: if Applicant.Race == \"White\" {\n    exit(1)\n} permalink parent award report block reply Choppermagic 3 points 2 days ago and east asians from ivy league school for having grades that are too good permalink parent award report block reply\nposedgeclk 10 points 2 days ago By a bot named Fizz. How humiliating. permalink parent award report block reply booblitchutz 4 points 2 days ago the bot code: if Applicant.Race == \"White\" {\n    exit(1)\n} permalink parent award report block reply\nbooblitchutz 4 points 2 days ago the bot code: if Applicant.Race == \"White\" {\n    exit(1)\n} permalink parent award report block reply\nChoppermagic 3 points 2 days ago and east asians from ivy league school for having grades that are too good permalink parent award report block reply\nMoebius 38 points 2 days ago Well...they did say to \"Try to be less White...\" I've not bought a single Coca Cola product since... permalink award report block reply TheDevilMonkey 3 points 2 days ago Same. permalink parent award report block reply 2FBIAgents1Cup 3 points 2 days ago Ditto permalink parent award report block reply\nTheDevilMonkey 3 points 2 days ago Same. permalink parent award report block reply 2FBIAgents1Cup 3 points 2 days ago Ditto permalink parent award report block reply\n2FBIAgents1Cup 3 points 2 days ago Ditto permalink parent award report block reply\nPeteButtplug 32 points 2 days ago I work in IT. The black manager over help desk only seems to want to hire black dudes to work for her. Maybe black dudes are the only people who know how to fix laptops and get your printer to work, or maybe she's racist! permalink award report block reply lostremote- 8 points 2 days ago Hey cool it! You damn well know only white people are the only ones that are rayciss! permalink parent award report block reply joggin_noggin 4 points 2 days ago Has she started firing the remaining white employees yet, or are you still in the early stages? permalink parent award report block reply PeteButtplug 3 points 2 days ago Fortunately she only oversees 6 people, and I'm not one of them. I do worry for her remaining white male employee. My boss is American Chinese and he seems pretty legit. permalink parent award report block reply\nlostremote- 8 points 2 days ago Hey cool it! You damn well know only white people are the only ones that are rayciss! permalink parent award report block reply\njoggin_noggin 4 points 2 days ago Has she started firing the remaining white employees yet, or are you still in the early stages? permalink parent award report block reply PeteButtplug 3 points 2 days ago Fortunately she only oversees 6 people, and I'm not one of them. I do worry for her remaining white male employee. My boss is American Chinese and he seems pretty legit. permalink parent award report block reply\nPeteButtplug 3 points 2 days ago Fortunately she only oversees 6 people, and I'm not one of them. I do worry for her remaining white male employee. My boss is American Chinese and he seems pretty legit. permalink parent award report block reply\nImpotent_Weasel 31 points 2 days ago Walks into coca-cola wearing blackface, “ay  yo what up my fellow noggers?” permalink award report block reply\nNotYourMan 29 points 2 days ago Its not just white men.  My neighbors daughter (blond, green eyes, 26 years old) has an undergrad in physics from a big school and a master in AI but she can't get a job in silicon valley.  She has been trying for one year and a half.  She gets invited to these HR \"parties\" where they interview college grads.  She says she is the only American in the room, all the other people are from India. permalink award report block reply joggin_noggin 8 points 2 days ago If they were smart, they'd hire her for simp-bait, if nothing else. permalink parent award report block reply PillarOfWisdom OP 3 points 2 days ago That's so sad.  Both parties are to blame.  Repubes are hooked at the hip with H1Bs and the marxists facilitate the hordes of illegals.  Combined, we have 100 million non citizens stealing our God-given birthright to a civilized society. permalink parent award report block reply\njoggin_noggin 8 points 2 days ago If they were smart, they'd hire her for simp-bait, if nothing else. permalink parent award report block reply\nPillarOfWisdom OP 3 points 2 days ago That's so sad.  Both parties are to blame.  Repubes are hooked at the hip with H1Bs and the marxists facilitate the hordes of illegals.  Combined, we have 100 million non citizens stealing our God-given birthright to a civilized society. permalink parent award report block reply\nkeeptherepublic1776 21 points 2 days ago I think they use the demographic questions as well to discriminate. Say you are white out. Decline to answer out permalink award report block reply Whoopies_tds 14 points 2 days ago This 👆 The so called \"demographic data\" was was part of the government's OFCCP regulation changes about 20 years ago with the stated goal of being to have government contractors prove they were hiring a proportional number of people by race and gender compared to those who applied. I have seen first hand how companies force a DEI hire by telling their HR people that only a woman or non-white male will be considered for the position. permalink parent award report block reply RedStoneDeepState 8 points 2 days ago My grandmother's German birth certificate says she was born in Cuba to parents that were in the German Army in 1942. Due to this I claim I am a Hispanic. permalink parent award report block reply ChickNorris 8 points 2 days ago I started checking \"other\" when I was applying for jobs years ago. I had submitted 200 applications (I kept count) and after no responses on the first 180 or so I started checking other on that demographics questionnaire. I finally started getting calls for interviews at that point. This was back in 2013 btw. This has been going on for over 15 years now. permalink parent award report block reply\nWhoopies_tds 14 points 2 days ago This 👆 The so called \"demographic data\" was was part of the government's OFCCP regulation changes about 20 years ago with the stated goal of being to have government contractors prove they were hiring a proportional number of people by race and gender compared to those who applied. I have seen first hand how companies force a DEI hire by telling their HR people that only a woman or non-white male will be considered for the position. permalink parent award report block reply RedStoneDeepState 8 points 2 days ago My grandmother's German birth certificate says she was born in Cuba to parents that were in the German Army in 1942. Due to this I claim I am a Hispanic. permalink parent award report block reply\nRedStoneDeepState 8 points 2 days ago My grandmother's German birth certificate says she was born in Cuba to parents that were in the German Army in 1942. Due to this I claim I am a Hispanic. permalink parent award report block reply\nChickNorris 8 points 2 days ago I started checking \"other\" when I was applying for jobs years ago. I had submitted 200 applications (I kept count) and after no responses on the first 180 or so I started checking other on that demographics questionnaire. I finally started getting calls for interviews at that point. This was back in 2013 btw. This has been going on for over 15 years now. permalink parent award report block reply\nOodles 18 points 2 days ago SNAP funds this anti-White racism The worst part of SNAP is not the deadbeats directly spending your money to get diabetes, but all of the corrupt anti-White companies that rely on this money to try to eliminate you and your family from this country permalink award report block reply Luvs_2_Bop 8 points 2 days ago Needs to be said more often permalink parent award report block reply\nLuvs_2_Bop 8 points 2 days ago Needs to be said more often permalink parent award report block reply\nNewJigger504 12 points 2 days ago companies HATE people with experience it's no secret. they want coachable people they can pay LESS permalink award report block reply trumpORbust 13 points 2 days ago While true - not the whole story these days permalink parent award report block reply toobaditworks 5 points 2 days ago They also have an endless supply of people to go through.  At one job I had the company hired temps from a temp agency and told them all they'd be hired fulltime but it was a trick to get them to work overtime. When the week or two weeks was up they fired the temps and claimed they were not able to find anyone fit for the job. Then they hired h1b's and remote's from india. permalink parent award report block reply\ntrumpORbust 13 points 2 days ago While true - not the whole story these days permalink parent award report block reply\ntoobaditworks 5 points 2 days ago They also have an endless supply of people to go through.  At one job I had the company hired temps from a temp agency and told them all they'd be hired fulltime but it was a trick to get them to work overtime. When the week or two weeks was up they fired the temps and claimed they were not able to find anyone fit for the job. Then they hired h1b's and remote's from india. permalink parent award report block reply\nSpike 8 points 2 days ago Likely it is ageism as well. 20 years xp says they will have to spend more on salary. permalink award report block reply Keep_on_winning_kag 2 points 2 days ago And it puts you over 40 so they age discriminate anyways. permalink parent award report block reply\nKeep_on_winning_kag 2 points 2 days ago And it puts you over 40 so they age discriminate anyways. permalink parent award report block reply\nassblast 7 points 2 days ago Dumb to change more than one variable in each submission permalink award report block reply\nMaga_Gator 5 points 2 days ago I worked in Coke inside sales years ago,  they are super racists.  Every product is/was pushed by demographic.  Grape Fanta was pushed hard for ghetto area buyers,  and Cherry Coke and Mello Yellow/Surge for white burbs permalink award report block reply\ncouranto 5 points 2 days ago I’ve done this. It’s true. I get interview every time w my factual resume but pretend to be a black. permalink award report block reply\nKeep_on_winning_kag 4 points 2 days ago I can't get hired at kraft foods in beaver dam wisconsin. Been applying for a few years when i get laid off in the winter. permalink award report block reply\nDJTXLV 3 points 2 days ago Someone write a bot that floods cow cola with fake black resumes. permalink award report block reply\nItspepesilva 3 points 2 days ago Remember \"be less white\" ? We already knew this about woke-a-cola permalink award report block reply\nYodaBannon 3 points 2 days ago Fizz permalink award report block reply\njhewish 3 points 2 days ago The best part is them landing on black for the race based on the retarded black name. permalink award report block reply\nCharlesWilliams 3 points 2 days ago Time to legally change name to Seaniqua? permalink award report block reply\nrastren 3 points 2 days ago First, No one should be drinking the goyslop. Besides that, Lots of other organizations are still doing this. Is it a Blackrock esg thing? Does it entail tax breaks for the company? Whatever they, we need to figure out why and end any benefits they may be getting. Otherwise it will just get worse over time permalink award report block reply\nUSAisAOKay 2 points 2 days ago Always put other on your job application. Maybe even toss in a hispanic. permalink award report block reply\nImportantPerson -1 points 2 days ago As a hiring manager, there is a very good chance that I won't call the person back with 20 years experience simply because you are going to pay for that experience and it might be over the budget that I want to spend. It would be interesting to know what the job listing actually said.  I have absolutely denied applicants that have significant experience that would apply to the role that I'm hiring simply because I know I won't afford them for the budget I have. I don't know why they didn't just use the same resume.  It really screws up anything they were trying to prove. permalink award report block reply toobaditworks 2 points 2 days ago How does it make sense to not hire someone who is there in an interview for a job where you say \"we pay this amount of money in the job listing\" and they agree on that amount of money but then you're saying 'it's out of your budget to hire them because they have experience and you'd have to pay them more'. If the job they apply to pays a certain amount you tell the person \"THIS JOB PAYS X AMOUNT OF MONEY\".  If the person being interviewed thinks it's not enough for them they won't take the job.  But if you're advertising a job it usually says in the job listing this job pays between this amount and that amount of money. Nobody applies for a job they don't want to take unless they are on SNAP or getting free money where applying for jobs is the job. And if you have job listings that state the lowest paid amount of money to the highest paid amount of money  but then throw out anyone you would need to pay the higher amount to then you're lying on the job listing if you already know you won't pay the high amount. Everything about your comment says you should not be in charge of hiring anyone ever. permalink parent award report block reply ImportantPerson -1 points 2 days ago Let me explain so that you actually understand this and don't make this mistake again. If I have someone who is overqualified for a job and I know that I'm underpaying them based on their experience, then I know they won't be a long term employee.  Applying for a job significantly below your experience level is going to be a temporary solution until you find a job that fits your experience level. Hiring this person is not a good investment for me because there is signifcant costs in hiring and training new employees.  I want to invest that money into an employee that is going to last longer than a few months or already has a foot out the door already. It's always amazing how people like you with clearly ZERO experience with hiring acts like you have a clue what you are talking about.  You could have just asked WHY someone would avoid hiring the more experienced person but instead, you ignorantly claimed I shouldn't be in charge of hiring anyone.  Next time, be the idiot you are and just ask the question instead of pretending you know better.  M'kay pumpkin.  Now, get offended. permalink parent award report block reply toobaditworks 0 points 1 day ago How much experience do YOU have?  I bet you have YEARS of experience at your job.  Don't you? How long have you been at this job of yours? I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience.  They'd find out they're paying you too much and let you go. BYE! Have fun trying to find a job with all that experience you have. And don't give me that \"I want a longer lasting employee'.   If you have job openings then clearly your logic isn't working out or you wouldn't be hiring.  You'd have long lasting employee's with little experience in their job.... which brings us to the next flaw in your logic. How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience?  Right when that person gets enough of your 'experience' that they can't take it anymore  you'll fire those people and bring in another victim who hasn't had to endure your experience. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. And first you said: there is a very good chance that I won't call the person back with 20 years experience simply because you are going to pay for that experience and it might be over the budget that I want to spend I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. So going OVER budget is not reality. Then you ignored that and changed it to: Hiring this person is not a good investment for me because there is signifcant costs in hiring and training new employees. I want to invest that money into an employee that is going to last longer than a few months or already has a foot out the door already. When you hire a person with experience you don't have to train as much because guess what?  That is what EXPERIENCE is.  It means they already know the job.  They have 'experience' doing the same thing at another company or whatever. Everything you state is an excuse to just hire someone for cheap slave labor. YOU ARE THE PROBLEM.  And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. permalink parent award report block reply ImportantPerson 0 points 1 day ago How much experience do YOU have? I bet you have YEARS of experience at your job. Don't you? Yes.  And I'm well paid for that experience because that experience is used to evaluate who I want to hire for my team and how I can get the most out of my investments. How long have you been at this job of yours? 20+ years of experience, give or take. I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. If I interviewed myself for my current job, then I would hire myself because I'm hiring for a job that expects 20 years of management experience leading multifaceted local and international teams. If I was interviewing myself for the job I had 20 years ago, I wouldn't hire myself because of exactly what I said earlier.  It would be a bad investment.  I wouldn't even want that job I had 20 years ago now because it's below my pay grade and what my experience level is.  Basically, I'd have to be desperate to take that job now and I would be gone the second I found something better... just like I said. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience. I realize that you are desperate and you want this to be true, but unfortunately this is the real world and not some fantasy world that cowards like you pretend is real. When you get jobs like mine, your compensation is tied to the revenue of the company.  Why would I hire people who are bad for the business or would slow business down when that would directly reduce my income?  You really didn't think this through at all but that's not surprising. And don't give me that \"I want a longer lasting employee'. I am going to give that because it's reality.  I don't care if you don't like it.  You have no experience with this so where are you getting this belief that somehow a person getting drastically underpaid for their current experience level is going to somehow be a long term employee? How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience? I'm going to take some time here to educate you on how the real world works.  Go ahead, get offended, get upset, be the teenager with no experience who thinks they know everything.  I don't care.  Learn from this or don't and you'll learn from it later in life. The original example was an employee with FIVE years of experience, not zero.  Details matter even if your childish rage forgets them. If I hire someone that is wrong for the position, whether that's a skill level issue or it's a compensation issue, that person will not last.  These people will last 6-12 months and will jump to a different company as soon as a more appropriate position becomes available.  Hiring and training that person has probably cost me anywhere from 5k-10k in overhead costs plus whatever I paid them in salary during that time.  I don't get a return on my investment. Conversely, if I hire someone right for the job that I'm hiring for, that person will, on average, stay for 2-3 years minimum.  After 2-3 years, it's usually a turning point for each person.  Most people will seek a promotion or seek out other jobs because the last 2-3 years of experience puts them into new opportunities. My departments are set up to promote from within.  Employee > Senior Employee > Manager > Senior Manager > Department Head > Global Head.  This structure is set up across multiple different departments that I manage.  It creates and rewards loyalty and provides me a very strong return on investment.  The average length of time a person works for me is 6 years. Right when that person gets enough of your 'experience' that they can't take it anymore you'll fire those people and bring in another victim who hasn't had to endure your experience. More made up stories because you need to be the victim. I don't fire people who are doing their job.  Pay structures are based on the job a person is doing.  If you are working as a cashier at a grocery store, your pay is never going to be great no matter how long you work.  It's a limitation of the job compensation.  If someone has 20 years of cashier experience, I'm still not going to pay them more than the job is worth. People who get fired for \"making too much money\" are a result of poor planning and poor company structures. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. Why?  Because I actually hire people for the right job and compensate them correctly? Honestly, have you ever worked in a professional environment at all? I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. Yes, and I held your hand through how those costs can exceed the budget.  Sorry, let me dumb this down for you because my comment went over your head.  A person who is vastly overqualified for a position is going to expect more money to retain them.  Like I pointed out, they will not last.  You can absolutely hire them at whatever your current budget is, but you will either be paying them more in the long run or they will be jumping ship. When you hire a person with experience you don't have to train as much because guess what? That is what EXPERIENCE is. You've never worked a real world job in your life.  You just made it absolutely 100% clear that you should not even be in this conversation. For your statement to be true, every single company in the industry needs to function exactly the same and have zero differences in processes, capabilities, resources and structure.   Anyone with a day of experience working in a professional industry knows that's not true. It would be like being a professional basketball player, getting traded to a different team and then expecting that the offense is run exactly the same on the new team.  This is retarded to believe but that's exactly what you are saying. Everything you state is an excuse to just hire someone for cheap slave labor. I'm consistenly compensating 20% higher than the market average for all of my positions which is why my departments have some of the best retention in my company.  Sorry, your fantasy is just wrong again. YOU ARE THE PROBLEM. And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. I don't hire illegals.  I don't hire H1B's.  I hire Americans.  I hire people who are right for the job.  I don't hire people who are going to jump ship the second a better offer gets tossed on the table.  I want a return on my investment because I'm a business and not a fucking charity case. My guess is that you are a lazy fucking worthless person who can't find a job and rather than do ANYTHING to make yourself more valuable, you just blame everyone else.  You are nothing but coward.  I'm betting that you were so offended and upset that you didn't even read this far and you are going to run away crying like a little bitchs. Experience is important.  It's why you are fucking clueless. permalink parent award report block reply\ntoobaditworks 2 points 2 days ago How does it make sense to not hire someone who is there in an interview for a job where you say \"we pay this amount of money in the job listing\" and they agree on that amount of money but then you're saying 'it's out of your budget to hire them because they have experience and you'd have to pay them more'. If the job they apply to pays a certain amount you tell the person \"THIS JOB PAYS X AMOUNT OF MONEY\".  If the person being interviewed thinks it's not enough for them they won't take the job.  But if you're advertising a job it usually says in the job listing this job pays between this amount and that amount of money. Nobody applies for a job they don't want to take unless they are on SNAP or getting free money where applying for jobs is the job. And if you have job listings that state the lowest paid amount of money to the highest paid amount of money  but then throw out anyone you would need to pay the higher amount to then you're lying on the job listing if you already know you won't pay the high amount. Everything about your comment says you should not be in charge of hiring anyone ever. permalink parent award report block reply ImportantPerson -1 points 2 days ago Let me explain so that you actually understand this and don't make this mistake again. If I have someone who is overqualified for a job and I know that I'm underpaying them based on their experience, then I know they won't be a long term employee.  Applying for a job significantly below your experience level is going to be a temporary solution until you find a job that fits your experience level. Hiring this person is not a good investment for me because there is signifcant costs in hiring and training new employees.  I want to invest that money into an employee that is going to last longer than a few months or already has a foot out the door already. It's always amazing how people like you with clearly ZERO experience with hiring acts like you have a clue what you are talking about.  You could have just asked WHY someone would avoid hiring the more experienced person but instead, you ignorantly claimed I shouldn't be in charge of hiring anyone.  Next time, be the idiot you are and just ask the question instead of pretending you know better.  M'kay pumpkin.  Now, get offended. permalink parent award report block reply toobaditworks 0 points 1 day ago How much experience do YOU have?  I bet you have YEARS of experience at your job.  Don't you? How long have you been at this job of yours? I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience.  They'd find out they're paying you too much and let you go. BYE! Have fun trying to find a job with all that experience you have. And don't give me that \"I want a longer lasting employee'.   If you have job openings then clearly your logic isn't working out or you wouldn't be hiring.  You'd have long lasting employee's with little experience in their job.... which brings us to the next flaw in your logic. How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience?  Right when that person gets enough of your 'experience' that they can't take it anymore  you'll fire those people and bring in another victim who hasn't had to endure your experience. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. And first you said: there is a very good chance that I won't call the person back with 20 years experience simply because you are going to pay for that experience and it might be over the budget that I want to spend I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. So going OVER budget is not reality. Then you ignored that and changed it to: Hiring this person is not a good investment for me because there is signifcant costs in hiring and training new employees. I want to invest that money into an employee that is going to last longer than a few months or already has a foot out the door already. When you hire a person with experience you don't have to train as much because guess what?  That is what EXPERIENCE is.  It means they already know the job.  They have 'experience' doing the same thing at another company or whatever. Everything you state is an excuse to just hire someone for cheap slave labor. YOU ARE THE PROBLEM.  And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. permalink parent award report block reply ImportantPerson 0 points 1 day ago How much experience do YOU have? I bet you have YEARS of experience at your job. Don't you? Yes.  And I'm well paid for that experience because that experience is used to evaluate who I want to hire for my team and how I can get the most out of my investments. How long have you been at this job of yours? 20+ years of experience, give or take. I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. If I interviewed myself for my current job, then I would hire myself because I'm hiring for a job that expects 20 years of management experience leading multifaceted local and international teams. If I was interviewing myself for the job I had 20 years ago, I wouldn't hire myself because of exactly what I said earlier.  It would be a bad investment.  I wouldn't even want that job I had 20 years ago now because it's below my pay grade and what my experience level is.  Basically, I'd have to be desperate to take that job now and I would be gone the second I found something better... just like I said. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience. I realize that you are desperate and you want this to be true, but unfortunately this is the real world and not some fantasy world that cowards like you pretend is real. When you get jobs like mine, your compensation is tied to the revenue of the company.  Why would I hire people who are bad for the business or would slow business down when that would directly reduce my income?  You really didn't think this through at all but that's not surprising. And don't give me that \"I want a longer lasting employee'. I am going to give that because it's reality.  I don't care if you don't like it.  You have no experience with this so where are you getting this belief that somehow a person getting drastically underpaid for their current experience level is going to somehow be a long term employee? How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience? I'm going to take some time here to educate you on how the real world works.  Go ahead, get offended, get upset, be the teenager with no experience who thinks they know everything.  I don't care.  Learn from this or don't and you'll learn from it later in life. The original example was an employee with FIVE years of experience, not zero.  Details matter even if your childish rage forgets them. If I hire someone that is wrong for the position, whether that's a skill level issue or it's a compensation issue, that person will not last.  These people will last 6-12 months and will jump to a different company as soon as a more appropriate position becomes available.  Hiring and training that person has probably cost me anywhere from 5k-10k in overhead costs plus whatever I paid them in salary during that time.  I don't get a return on my investment. Conversely, if I hire someone right for the job that I'm hiring for, that person will, on average, stay for 2-3 years minimum.  After 2-3 years, it's usually a turning point for each person.  Most people will seek a promotion or seek out other jobs because the last 2-3 years of experience puts them into new opportunities. My departments are set up to promote from within.  Employee > Senior Employee > Manager > Senior Manager > Department Head > Global Head.  This structure is set up across multiple different departments that I manage.  It creates and rewards loyalty and provides me a very strong return on investment.  The average length of time a person works for me is 6 years. Right when that person gets enough of your 'experience' that they can't take it anymore you'll fire those people and bring in another victim who hasn't had to endure your experience. More made up stories because you need to be the victim. I don't fire people who are doing their job.  Pay structures are based on the job a person is doing.  If you are working as a cashier at a grocery store, your pay is never going to be great no matter how long you work.  It's a limitation of the job compensation.  If someone has 20 years of cashier experience, I'm still not going to pay them more than the job is worth. People who get fired for \"making too much money\" are a result of poor planning and poor company structures. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. Why?  Because I actually hire people for the right job and compensate them correctly? Honestly, have you ever worked in a professional environment at all? I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. Yes, and I held your hand through how those costs can exceed the budget.  Sorry, let me dumb this down for you because my comment went over your head.  A person who is vastly overqualified for a position is going to expect more money to retain them.  Like I pointed out, they will not last.  You can absolutely hire them at whatever your current budget is, but you will either be paying them more in the long run or they will be jumping ship. When you hire a person with experience you don't have to train as much because guess what? That is what EXPERIENCE is. You've never worked a real world job in your life.  You just made it absolutely 100% clear that you should not even be in this conversation. For your statement to be true, every single company in the industry needs to function exactly the same and have zero differences in processes, capabilities, resources and structure.   Anyone with a day of experience working in a professional industry knows that's not true. It would be like being a professional basketball player, getting traded to a different team and then expecting that the offense is run exactly the same on the new team.  This is retarded to believe but that's exactly what you are saying. Everything you state is an excuse to just hire someone for cheap slave labor. I'm consistenly compensating 20% higher than the market average for all of my positions which is why my departments have some of the best retention in my company.  Sorry, your fantasy is just wrong again. YOU ARE THE PROBLEM. And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. I don't hire illegals.  I don't hire H1B's.  I hire Americans.  I hire people who are right for the job.  I don't hire people who are going to jump ship the second a better offer gets tossed on the table.  I want a return on my investment because I'm a business and not a fucking charity case. My guess is that you are a lazy fucking worthless person who can't find a job and rather than do ANYTHING to make yourself more valuable, you just blame everyone else.  You are nothing but coward.  I'm betting that you were so offended and upset that you didn't even read this far and you are going to run away crying like a little bitchs. Experience is important.  It's why you are fucking clueless. permalink parent award report block reply\nImportantPerson -1 points 2 days ago Let me explain so that you actually understand this and don't make this mistake again. If I have someone who is overqualified for a job and I know that I'm underpaying them based on their experience, then I know they won't be a long term employee.  Applying for a job significantly below your experience level is going to be a temporary solution until you find a job that fits your experience level. Hiring this person is not a good investment for me because there is signifcant costs in hiring and training new employees.  I want to invest that money into an employee that is going to last longer than a few months or already has a foot out the door already. It's always amazing how people like you with clearly ZERO experience with hiring acts like you have a clue what you are talking about.  You could have just asked WHY someone would avoid hiring the more experienced person but instead, you ignorantly claimed I shouldn't be in charge of hiring anyone.  Next time, be the idiot you are and just ask the question instead of pretending you know better.  M'kay pumpkin.  Now, get offended. permalink parent award report block reply toobaditworks 0 points 1 day ago How much experience do YOU have?  I bet you have YEARS of experience at your job.  Don't you? How long have you been at this job of yours? I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience.  They'd find out they're paying you too much and let you go. BYE! Have fun trying to find a job with all that experience you have. And don't give me that \"I want a longer lasting employee'.   If you have job openings then clearly your logic isn't working out or you wouldn't be hiring.  You'd have long lasting employee's with little experience in their job.... which brings us to the next flaw in your logic. How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience?  Right when that person gets enough of your 'experience' that they can't take it anymore  you'll fire those people and bring in another victim who hasn't had to endure your experience. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. And first you said: there is a very good chance that I won't call the person back with 20 years experience simply because you are going to pay for that experience and it might be over the budget that I want to spend I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. So going OVER budget is not reality. Then you ignored that and changed it to: Hiring this person is not a good investment for me because there is signifcant costs in hiring and training new employees. I want to invest that money into an employee that is going to last longer than a few months or already has a foot out the door already. When you hire a person with experience you don't have to train as much because guess what?  That is what EXPERIENCE is.  It means they already know the job.  They have 'experience' doing the same thing at another company or whatever. Everything you state is an excuse to just hire someone for cheap slave labor. YOU ARE THE PROBLEM.  And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. permalink parent award report block reply ImportantPerson 0 points 1 day ago How much experience do YOU have? I bet you have YEARS of experience at your job. Don't you? Yes.  And I'm well paid for that experience because that experience is used to evaluate who I want to hire for my team and how I can get the most out of my investments. How long have you been at this job of yours? 20+ years of experience, give or take. I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. If I interviewed myself for my current job, then I would hire myself because I'm hiring for a job that expects 20 years of management experience leading multifaceted local and international teams. If I was interviewing myself for the job I had 20 years ago, I wouldn't hire myself because of exactly what I said earlier.  It would be a bad investment.  I wouldn't even want that job I had 20 years ago now because it's below my pay grade and what my experience level is.  Basically, I'd have to be desperate to take that job now and I would be gone the second I found something better... just like I said. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience. I realize that you are desperate and you want this to be true, but unfortunately this is the real world and not some fantasy world that cowards like you pretend is real. When you get jobs like mine, your compensation is tied to the revenue of the company.  Why would I hire people who are bad for the business or would slow business down when that would directly reduce my income?  You really didn't think this through at all but that's not surprising. And don't give me that \"I want a longer lasting employee'. I am going to give that because it's reality.  I don't care if you don't like it.  You have no experience with this so where are you getting this belief that somehow a person getting drastically underpaid for their current experience level is going to somehow be a long term employee? How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience? I'm going to take some time here to educate you on how the real world works.  Go ahead, get offended, get upset, be the teenager with no experience who thinks they know everything.  I don't care.  Learn from this or don't and you'll learn from it later in life. The original example was an employee with FIVE years of experience, not zero.  Details matter even if your childish rage forgets them. If I hire someone that is wrong for the position, whether that's a skill level issue or it's a compensation issue, that person will not last.  These people will last 6-12 months and will jump to a different company as soon as a more appropriate position becomes available.  Hiring and training that person has probably cost me anywhere from 5k-10k in overhead costs plus whatever I paid them in salary during that time.  I don't get a return on my investment. Conversely, if I hire someone right for the job that I'm hiring for, that person will, on average, stay for 2-3 years minimum.  After 2-3 years, it's usually a turning point for each person.  Most people will seek a promotion or seek out other jobs because the last 2-3 years of experience puts them into new opportunities. My departments are set up to promote from within.  Employee > Senior Employee > Manager > Senior Manager > Department Head > Global Head.  This structure is set up across multiple different departments that I manage.  It creates and rewards loyalty and provides me a very strong return on investment.  The average length of time a person works for me is 6 years. Right when that person gets enough of your 'experience' that they can't take it anymore you'll fire those people and bring in another victim who hasn't had to endure your experience. More made up stories because you need to be the victim. I don't fire people who are doing their job.  Pay structures are based on the job a person is doing.  If you are working as a cashier at a grocery store, your pay is never going to be great no matter how long you work.  It's a limitation of the job compensation.  If someone has 20 years of cashier experience, I'm still not going to pay them more than the job is worth. People who get fired for \"making too much money\" are a result of poor planning and poor company structures. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. Why?  Because I actually hire people for the right job and compensate them correctly? Honestly, have you ever worked in a professional environment at all? I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. Yes, and I held your hand through how those costs can exceed the budget.  Sorry, let me dumb this down for you because my comment went over your head.  A person who is vastly overqualified for a position is going to expect more money to retain them.  Like I pointed out, they will not last.  You can absolutely hire them at whatever your current budget is, but you will either be paying them more in the long run or they will be jumping ship. When you hire a person with experience you don't have to train as much because guess what? That is what EXPERIENCE is. You've never worked a real world job in your life.  You just made it absolutely 100% clear that you should not even be in this conversation. For your statement to be true, every single company in the industry needs to function exactly the same and have zero differences in processes, capabilities, resources and structure.   Anyone with a day of experience working in a professional industry knows that's not true. It would be like being a professional basketball player, getting traded to a different team and then expecting that the offense is run exactly the same on the new team.  This is retarded to believe but that's exactly what you are saying. Everything you state is an excuse to just hire someone for cheap slave labor. I'm consistenly compensating 20% higher than the market average for all of my positions which is why my departments have some of the best retention in my company.  Sorry, your fantasy is just wrong again. YOU ARE THE PROBLEM. And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. I don't hire illegals.  I don't hire H1B's.  I hire Americans.  I hire people who are right for the job.  I don't hire people who are going to jump ship the second a better offer gets tossed on the table.  I want a return on my investment because I'm a business and not a fucking charity case. My guess is that you are a lazy fucking worthless person who can't find a job and rather than do ANYTHING to make yourself more valuable, you just blame everyone else.  You are nothing but coward.  I'm betting that you were so offended and upset that you didn't even read this far and you are going to run away crying like a little bitchs. Experience is important.  It's why you are fucking clueless. permalink parent award report block reply\ntoobaditworks 0 points 1 day ago How much experience do YOU have?  I bet you have YEARS of experience at your job.  Don't you? How long have you been at this job of yours? I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience.  They'd find out they're paying you too much and let you go. BYE! Have fun trying to find a job with all that experience you have. And don't give me that \"I want a longer lasting employee'.   If you have job openings then clearly your logic isn't working out or you wouldn't be hiring.  You'd have long lasting employee's with little experience in their job.... which brings us to the next flaw in your logic. How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience?  Right when that person gets enough of your 'experience' that they can't take it anymore  you'll fire those people and bring in another victim who hasn't had to endure your experience. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. And first you said: there is a very good chance that I won't call the person back with 20 years experience simply because you are going to pay for that experience and it might be over the budget that I want to spend I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. So going OVER budget is not reality. Then you ignored that and changed it to: Hiring this person is not a good investment for me because there is signifcant costs in hiring and training new employees. I want to invest that money into an employee that is going to last longer than a few months or already has a foot out the door already. When you hire a person with experience you don't have to train as much because guess what?  That is what EXPERIENCE is.  It means they already know the job.  They have 'experience' doing the same thing at another company or whatever. Everything you state is an excuse to just hire someone for cheap slave labor. YOU ARE THE PROBLEM.  And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. permalink parent award report block reply ImportantPerson 0 points 1 day ago How much experience do YOU have? I bet you have YEARS of experience at your job. Don't you? Yes.  And I'm well paid for that experience because that experience is used to evaluate who I want to hire for my team and how I can get the most out of my investments. How long have you been at this job of yours? 20+ years of experience, give or take. I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. If I interviewed myself for my current job, then I would hire myself because I'm hiring for a job that expects 20 years of management experience leading multifaceted local and international teams. If I was interviewing myself for the job I had 20 years ago, I wouldn't hire myself because of exactly what I said earlier.  It would be a bad investment.  I wouldn't even want that job I had 20 years ago now because it's below my pay grade and what my experience level is.  Basically, I'd have to be desperate to take that job now and I would be gone the second I found something better... just like I said. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience. I realize that you are desperate and you want this to be true, but unfortunately this is the real world and not some fantasy world that cowards like you pretend is real. When you get jobs like mine, your compensation is tied to the revenue of the company.  Why would I hire people who are bad for the business or would slow business down when that would directly reduce my income?  You really didn't think this through at all but that's not surprising. And don't give me that \"I want a longer lasting employee'. I am going to give that because it's reality.  I don't care if you don't like it.  You have no experience with this so where are you getting this belief that somehow a person getting drastically underpaid for their current experience level is going to somehow be a long term employee? How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience? I'm going to take some time here to educate you on how the real world works.  Go ahead, get offended, get upset, be the teenager with no experience who thinks they know everything.  I don't care.  Learn from this or don't and you'll learn from it later in life. The original example was an employee with FIVE years of experience, not zero.  Details matter even if your childish rage forgets them. If I hire someone that is wrong for the position, whether that's a skill level issue or it's a compensation issue, that person will not last.  These people will last 6-12 months and will jump to a different company as soon as a more appropriate position becomes available.  Hiring and training that person has probably cost me anywhere from 5k-10k in overhead costs plus whatever I paid them in salary during that time.  I don't get a return on my investment. Conversely, if I hire someone right for the job that I'm hiring for, that person will, on average, stay for 2-3 years minimum.  After 2-3 years, it's usually a turning point for each person.  Most people will seek a promotion or seek out other jobs because the last 2-3 years of experience puts them into new opportunities. My departments are set up to promote from within.  Employee > Senior Employee > Manager > Senior Manager > Department Head > Global Head.  This structure is set up across multiple different departments that I manage.  It creates and rewards loyalty and provides me a very strong return on investment.  The average length of time a person works for me is 6 years. Right when that person gets enough of your 'experience' that they can't take it anymore you'll fire those people and bring in another victim who hasn't had to endure your experience. More made up stories because you need to be the victim. I don't fire people who are doing their job.  Pay structures are based on the job a person is doing.  If you are working as a cashier at a grocery store, your pay is never going to be great no matter how long you work.  It's a limitation of the job compensation.  If someone has 20 years of cashier experience, I'm still not going to pay them more than the job is worth. People who get fired for \"making too much money\" are a result of poor planning and poor company structures. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. Why?  Because I actually hire people for the right job and compensate them correctly? Honestly, have you ever worked in a professional environment at all? I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. Yes, and I held your hand through how those costs can exceed the budget.  Sorry, let me dumb this down for you because my comment went over your head.  A person who is vastly overqualified for a position is going to expect more money to retain them.  Like I pointed out, they will not last.  You can absolutely hire them at whatever your current budget is, but you will either be paying them more in the long run or they will be jumping ship. When you hire a person with experience you don't have to train as much because guess what? That is what EXPERIENCE is. You've never worked a real world job in your life.  You just made it absolutely 100% clear that you should not even be in this conversation. For your statement to be true, every single company in the industry needs to function exactly the same and have zero differences in processes, capabilities, resources and structure.   Anyone with a day of experience working in a professional industry knows that's not true. It would be like being a professional basketball player, getting traded to a different team and then expecting that the offense is run exactly the same on the new team.  This is retarded to believe but that's exactly what you are saying. Everything you state is an excuse to just hire someone for cheap slave labor. I'm consistenly compensating 20% higher than the market average for all of my positions which is why my departments have some of the best retention in my company.  Sorry, your fantasy is just wrong again. YOU ARE THE PROBLEM. And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. I don't hire illegals.  I don't hire H1B's.  I hire Americans.  I hire people who are right for the job.  I don't hire people who are going to jump ship the second a better offer gets tossed on the table.  I want a return on my investment because I'm a business and not a fucking charity case. My guess is that you are a lazy fucking worthless person who can't find a job and rather than do ANYTHING to make yourself more valuable, you just blame everyone else.  You are nothing but coward.  I'm betting that you were so offended and upset that you didn't even read this far and you are going to run away crying like a little bitchs. Experience is important.  It's why you are fucking clueless. permalink parent award report block reply\nImportantPerson 0 points 1 day ago How much experience do YOU have? I bet you have YEARS of experience at your job. Don't you? Yes.  And I'm well paid for that experience because that experience is used to evaluate who I want to hire for my team and how I can get the most out of my investments. How long have you been at this job of yours? 20+ years of experience, give or take. I bet if YOU were to interview yourself you'd have to throw your own resume in the trash like you do with everyone else's. If I interviewed myself for my current job, then I would hire myself because I'm hiring for a job that expects 20 years of management experience leading multifaceted local and international teams. If I was interviewing myself for the job I had 20 years ago, I wouldn't hire myself because of exactly what I said earlier.  It would be a bad investment.  I wouldn't even want that job I had 20 years ago now because it's below my pay grade and what my experience level is.  Basically, I'd have to be desperate to take that job now and I would be gone the second I found something better... just like I said. You don't allow other experienced people to work at your job because then people would find out how bad you really are at your job with all YOUR experience. I realize that you are desperate and you want this to be true, but unfortunately this is the real world and not some fantasy world that cowards like you pretend is real. When you get jobs like mine, your compensation is tied to the revenue of the company.  Why would I hire people who are bad for the business or would slow business down when that would directly reduce my income?  You really didn't think this through at all but that's not surprising. And don't give me that \"I want a longer lasting employee'. I am going to give that because it's reality.  I don't care if you don't like it.  You have no experience with this so where are you getting this belief that somehow a person getting drastically underpaid for their current experience level is going to somehow be a long term employee? How do you get LONG LASTING EMPLOYEES with no experience? How does someone stay at a job for years and still have no experience? I'm going to take some time here to educate you on how the real world works.  Go ahead, get offended, get upset, be the teenager with no experience who thinks they know everything.  I don't care.  Learn from this or don't and you'll learn from it later in life. The original example was an employee with FIVE years of experience, not zero.  Details matter even if your childish rage forgets them. If I hire someone that is wrong for the position, whether that's a skill level issue or it's a compensation issue, that person will not last.  These people will last 6-12 months and will jump to a different company as soon as a more appropriate position becomes available.  Hiring and training that person has probably cost me anywhere from 5k-10k in overhead costs plus whatever I paid them in salary during that time.  I don't get a return on my investment. Conversely, if I hire someone right for the job that I'm hiring for, that person will, on average, stay for 2-3 years minimum.  After 2-3 years, it's usually a turning point for each person.  Most people will seek a promotion or seek out other jobs because the last 2-3 years of experience puts them into new opportunities. My departments are set up to promote from within.  Employee > Senior Employee > Manager > Senior Manager > Department Head > Global Head.  This structure is set up across multiple different departments that I manage.  It creates and rewards loyalty and provides me a very strong return on investment.  The average length of time a person works for me is 6 years. Right when that person gets enough of your 'experience' that they can't take it anymore you'll fire those people and bring in another victim who hasn't had to endure your experience. More made up stories because you need to be the victim. I don't fire people who are doing their job.  Pay structures are based on the job a person is doing.  If you are working as a cashier at a grocery store, your pay is never going to be great no matter how long you work.  It's a limitation of the job compensation.  If someone has 20 years of cashier experience, I'm still not going to pay them more than the job is worth. People who get fired for \"making too much money\" are a result of poor planning and poor company structures. Again.. you shouldn't be in charge of anyone. I bet you're abusive as hell to your employees. Why?  Because I actually hire people for the right job and compensate them correctly? Honestly, have you ever worked in a professional environment at all? I proved that wrong by stating how companies state how they are willing to pay someone in the job listing. Yes, and I held your hand through how those costs can exceed the budget.  Sorry, let me dumb this down for you because my comment went over your head.  A person who is vastly overqualified for a position is going to expect more money to retain them.  Like I pointed out, they will not last.  You can absolutely hire them at whatever your current budget is, but you will either be paying them more in the long run or they will be jumping ship. When you hire a person with experience you don't have to train as much because guess what? That is what EXPERIENCE is. You've never worked a real world job in your life.  You just made it absolutely 100% clear that you should not even be in this conversation. For your statement to be true, every single company in the industry needs to function exactly the same and have zero differences in processes, capabilities, resources and structure.   Anyone with a day of experience working in a professional industry knows that's not true. It would be like being a professional basketball player, getting traded to a different team and then expecting that the offense is run exactly the same on the new team.  This is retarded to believe but that's exactly what you are saying. Everything you state is an excuse to just hire someone for cheap slave labor. I'm consistenly compensating 20% higher than the market average for all of my positions which is why my departments have some of the best retention in my company.  Sorry, your fantasy is just wrong again. YOU ARE THE PROBLEM. And people like you use the same excuses to hire illegals all the time and to use H1b or any other form of cheap labor. I don't hire illegals.  I don't hire H1B's.  I hire Americans.  I hire people who are right for the job.  I don't hire people who are going to jump ship the second a better offer gets tossed on the table.  I want a return on my investment because I'm a business and not a fucking charity case. My guess is that you are a lazy fucking worthless person who can't find a job and rather than do ANYTHING to make yourself more valuable, you just blame everyone else.  You are nothing but coward.  I'm betting that you were so offended and upset that you didn't even read this far and you are going to run away crying like a little bitchs. Experience is important.  It's why you are fucking clueless. permalink parent award report block reply\nDeplora -2 points 2 days ago \"Alleged\", so it could be just fabricated clickbait.  I'll pay attention when the lawsuit is filed. permalink award report block reply",
  "fetched_at": "2025-11-12T23:14:40.056300Z"
}