{
  "id": "1ARK9jzLhl",
  "url": "https://patriots.win/p/1ARK9jzLhl/its-1776-miles-to-maga-we-got-a-/c",
  "content": "1059 It's 1776 miles to MAGA we got a full tank of gas, half a pack of cigarettes, Rino's are crying and we're wearing sunglasses. posted 2 days ago by OG_BACONndEGGs 69 comments award share download report block\n69 comments Sort by Top Top New Worst Old Save BidenSniffsLittleKid 36 points 2 days ago Mark Levin should be deported permalink award report block reply deleted 20 points 2 days ago anotherthing 25 points 2 days ago Ted Cruz needs a good, healthy primarying after saying that he ran for Senate to be in Israel's pocket. I don't see that as any different than Omar saying she ran for the House for Somalia. permalink parent award report block reply Constitution_1788 2 points 1 day ago This, and this only, is all ya need… permalink parent award report block reply OG_BACONndEGGs OP 13 points 2 days ago I am well aware that Ted is a snow Mexican. Deport!! permalink parent award report block reply MastaJoda 7 points 1 day ago Comment removed for not being kosher permalink parent award report block reply Judenfrei 0 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Judenfrei 0 points 2 days ago Comment removed by community moderators. permalink parent award report block reply Judenfrei 0 points 2 days ago Comment removed by community moderators. permalink parent award report block reply Brother_Bill 26 points 1 day ago hit it permalink award report block reply EvJohn 8 points 1 day ago The only appropriate response. permalink parent award report block reply Floridacus 8 points 1 day ago Found the Soul Man permalink parent award report block reply FreshMemes 7 points 1 day ago We’re on a mission from God. permalink parent award report block reply Neonentity 4 points 1 day ago Fact permalink parent award report block reply MayorMcSixaplix 6 points 1 day ago You want I should scrape the dead bugs off your windshield? permalink parent award report block reply Neonentity 4 points 1 day ago I hate Illinois nazis….especially Prickster. permalink parent award report block reply new_meta 8 points 1 day ago HIT IT! permalink award report block reply blitzstrasse 8 points 1 day ago We're on a mission from God. permalink award report block reply TheLesserBambino 7 points 1 day ago Hit it! permalink award report block reply n3IVI0 7 points 1 day ago HIT IT! permalink award report block reply Calumet57 6 points 2 days ago Many patriots long dead have found themselves with just a half pack of smokes. Having a smoke has helped to settle many a moment. It's hard to defend smoking but it's still a free country kinda. permalink award report block reply OG_BACONndEGGs OP 12 points 2 days ago I'm 10 years cigarette free and 2 months in sober no alcohol. And I wasn't even a bad drinker just socially. But people need to kick their vices now and get right. We don't need you in the fox hole withdrawing from nicotine and getting the shakes from not drinking. Gym, Range, stack storable food and ammo. And ask yourself if my next meal is 2 miles away can I get their on foot with 50 pounds of gear. If the answer is no you better get your ass to a gym. permalink parent award report block reply Calumet57 12 points 2 days ago Fully agree.  But having a smoke at the end of the day is still a freedom to choose. permalink parent award report block reply OG_BACONndEGGs OP 6 points 2 days ago I agree I'd never tell someone not too. permalink parent award report block reply Calumet57 6 points 2 days ago I still smoke but hope to quit again anew.  The longest I've ever gone is 573 days about 20 years ago. Every failure came from my work exposure in east Asia where work hard play hard alcohol and cigarettes are a thing.  I'm distanced from that now. IMHO quitting booze is easier than tobacco.  I'm on/off with beer but it's easy to quit when you are in times of having your mind right. My greatest health achievements came from carnivore keto low-carb diet.  I fall off the wagon with this often too.. permalink parent award report block reply view 5 more comments... OnceADroplet 1 points 1 day ago 😎 permalink parent award report block reply MastaJoda 1 points 1 day ago Fox holes wont save folks from the impending CIA created nuclear war. https://www.newsweek.com/us-gets-serious-about-drone-threat-after-russias-pearl-harbor-11026452 permalink parent award report block reply CzechForTrump 6 points 1 day ago \"We had two bags of grass, seventy-five pellets of mescaline, five sheets of high powered blotter acid, a salt shaker half full of cocaine, and a whole galaxy of multi-colored uppers, downers, screamers, laughers... and also a quart of tequila, a quart of rum, a case of Budweiser, a pint of raw ether and two dozen amyls.\nNot that we needed all that for the trip, but once you get locked into a serious drug collection, the tendency is to push it as far as you can.\" permalink award report block reply MayorMcSixaplix 3 points 1 day ago Soon enough, you’ll see the bats. permalink parent award report block reply Neonentity 1 points 1 day ago Watch out for the ones with blue and purple hair. permalink parent award report block reply SoyLatte 6 points 1 day ago Our Lady of Blessed Acceleration don’t fail me now! permalink award report block reply Frenchie619 6 points 1 day ago Hit it! permalink award report block reply Wolfebane84 4 points 1 day ago Now this should be stickied.... permalink award report block reply Duster_340 4 points 1 day ago MAGA and became MIGA, good look. lol. permalink award report block reply FrankDuncan 4 points 1 day ago HIT IT!!! permalink award report block reply Duce30 3 points 1 day ago Deus Vult. Let's kick the muzzies out while taking it back. permalink award report block reply ConRep1818 2 points 1 day ago We're on a mission, from Gaadd... permalink award report block reply PearlyGaits57 2 points 1 day ago The \"PENGUIN\" is happy. permalink award report block reply Bonusjohn28 2 points 1 day ago Playing freebird permalink award report block reply CandyBarr 2 points 1 day ago I approve this message permalink award report block reply Constitution_1788 2 points 1 day ago I like this. permalink award report block reply Constitution_1788 2 points 1 day ago I like this, Fren. We all need a little bump!!! permalink award report block reply iamherefortheluls 2 points 1 day ago It was never going to be quick or smooth. Will take generations - every setback on the way is just that. And anyone doubting that, only needs to look at the odds that so many other movements overcame before. permalink award report block reply rumplestiltzkin2 1 points 1 day ago first we gotta get through the nazi rally led by a little jew permalink award report block reply 24NoMoreBullshit 1 points 1 day ago I got no issues rolling up the RINOs and smoking 'em. permalink award report block reply Covfefe_And_Justice 1 points 1 day ago It's cool, I got enough dip for everybody. Long cut wintergreen! permalink award report block reply NonbinaryPotatohead 1 points 1 day ago What do you mean Rinos are crying? They are laughing right now. permalink award report block reply Losferwords 1 points 1 day ago \"We're on a mission from Bob!\" permalink award report block reply PepePinochet 1 points 1 day ago Rolling out to the gym to get swol rn permalink award report block reply Pongpagongbatibot 0 points 1 day ago Fuck the groypers. They hijack every post. Notice that you can't cheer anymore for Trump because the groypers will downvote anything supportive of Trump and MAGA. groypers only advance Iran and Islam's interest. permalink award report block reply OG_BACONndEGGs OP 0 points 1 day ago You can cheer Trump this whole page does. You just want to cheer Trump and Bibi. Fag permalink parent award report block reply SteelDriver -3 points 1 day ago Wait, we hate Mark Levin now?  I haven't heard from him in a while (obviously, I missed something :D), but the last time I did, he was a pretty hard core Trump guy. permalink award report block reply OG_BACONndEGGs OP 10 points 1 day ago He's an israel shill now. Just youtube his speech at the RJC. Faggot wants to cancel Tucker Carlson and anyone else who dares to be America 1st. permalink parent award report block reply PearlyGaits57 3 points 1 day ago Then why \"cancel\" tucker? permalink parent award report block reply ParadigmShift2070 3 points 1 day ago he's always been an Israeli shill, he just doesn't pretend to care about anything else now permalink parent award report block reply Pongpagongbatibot -3 points 1 day ago Carlson ain't america first. He is Iran first permalink parent award report block reply OG_BACONndEGGs OP 2 points 1 day ago Nice tel aviv talking points you got there faggot permalink parent award report block reply NonbinaryPotatohead 7 points 1 day ago He's melting down about Israel support dropping among MAGA base because of obvious reasons but doesn't want to go live there. I dunno. permalink parent award report block reply Pongpagongbatibot 0 points 1 day ago Anything that is pro-trump, the Iranian groypers will turn into an anti-jooos thread. This board has been hijacked by Iranian and Muslim trolls. You can't cheer for Trump and MAGA  anymore without Groypers griping about the \"jooos and Israel\" Post something negative about Islam, the groypers will suddenly attack with \"but Israel and the joos are the real problem. Fuck groypers. Fuck Iran. Fuck Islam!! I love Israel for piling up more dead terrorist Muslim bodies permalink parent award report block reply no_public_id -1 points 2 days ago Comment removed by community moderators. permalink award report block reply Pedrohk -1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nBidenSniffsLittleKid 36 points 2 days ago Mark Levin should be deported permalink award report block reply deleted 20 points 2 days ago anotherthing 25 points 2 days ago Ted Cruz needs a good, healthy primarying after saying that he ran for Senate to be in Israel's pocket. I don't see that as any different than Omar saying she ran for the House for Somalia. permalink parent award report block reply Constitution_1788 2 points 1 day ago This, and this only, is all ya need… permalink parent award report block reply OG_BACONndEGGs OP 13 points 2 days ago I am well aware that Ted is a snow Mexican. Deport!! permalink parent award report block reply MastaJoda 7 points 1 day ago Comment removed for not being kosher permalink parent award report block reply Judenfrei 0 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Judenfrei 0 points 2 days ago Comment removed by community moderators. permalink parent award report block reply Judenfrei 0 points 2 days ago Comment removed by community moderators. permalink parent award report block reply\ndeleted 20 points 2 days ago anotherthing 25 points 2 days ago Ted Cruz needs a good, healthy primarying after saying that he ran for Senate to be in Israel's pocket. I don't see that as any different than Omar saying she ran for the House for Somalia. permalink parent award report block reply Constitution_1788 2 points 1 day ago This, and this only, is all ya need… permalink parent award report block reply OG_BACONndEGGs OP 13 points 2 days ago I am well aware that Ted is a snow Mexican. Deport!! permalink parent award report block reply\nanotherthing 25 points 2 days ago Ted Cruz needs a good, healthy primarying after saying that he ran for Senate to be in Israel's pocket. I don't see that as any different than Omar saying she ran for the House for Somalia. permalink parent award report block reply Constitution_1788 2 points 1 day ago This, and this only, is all ya need… permalink parent award report block reply\nConstitution_1788 2 points 1 day ago This, and this only, is all ya need… permalink parent award report block reply\nOG_BACONndEGGs OP 13 points 2 days ago I am well aware that Ted is a snow Mexican. Deport!! permalink parent award report block reply\nMastaJoda 7 points 1 day ago Comment removed for not being kosher permalink parent award report block reply\nJudenfrei 0 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nJudenfrei 0 points 2 days ago Comment removed by community moderators. permalink parent award report block reply\nJudenfrei 0 points 2 days ago Comment removed by community moderators. permalink parent award report block reply\nBrother_Bill 26 points 1 day ago hit it permalink award report block reply EvJohn 8 points 1 day ago The only appropriate response. permalink parent award report block reply Floridacus 8 points 1 day ago Found the Soul Man permalink parent award report block reply FreshMemes 7 points 1 day ago We’re on a mission from God. permalink parent award report block reply Neonentity 4 points 1 day ago Fact permalink parent award report block reply MayorMcSixaplix 6 points 1 day ago You want I should scrape the dead bugs off your windshield? permalink parent award report block reply Neonentity 4 points 1 day ago I hate Illinois nazis….especially Prickster. permalink parent award report block reply\nEvJohn 8 points 1 day ago The only appropriate response. permalink parent award report block reply\nFloridacus 8 points 1 day ago Found the Soul Man permalink parent award report block reply\nFreshMemes 7 points 1 day ago We’re on a mission from God. permalink parent award report block reply Neonentity 4 points 1 day ago Fact permalink parent award report block reply\nNeonentity 4 points 1 day ago Fact permalink parent award report block reply\nMayorMcSixaplix 6 points 1 day ago You want I should scrape the dead bugs off your windshield? permalink parent award report block reply\nNeonentity 4 points 1 day ago I hate Illinois nazis….especially Prickster. permalink parent award report block reply\nnew_meta 8 points 1 day ago HIT IT! permalink award report block reply\nblitzstrasse 8 points 1 day ago We're on a mission from God. permalink award report block reply\nTheLesserBambino 7 points 1 day ago Hit it! permalink award report block reply\nn3IVI0 7 points 1 day ago HIT IT! permalink award report block reply\nCalumet57 6 points 2 days ago Many patriots long dead have found themselves with just a half pack of smokes. Having a smoke has helped to settle many a moment. It's hard to defend smoking but it's still a free country kinda. permalink award report block reply OG_BACONndEGGs OP 12 points 2 days ago I'm 10 years cigarette free and 2 months in sober no alcohol. And I wasn't even a bad drinker just socially. But people need to kick their vices now and get right. We don't need you in the fox hole withdrawing from nicotine and getting the shakes from not drinking. Gym, Range, stack storable food and ammo. And ask yourself if my next meal is 2 miles away can I get their on foot with 50 pounds of gear. If the answer is no you better get your ass to a gym. permalink parent award report block reply Calumet57 12 points 2 days ago Fully agree.  But having a smoke at the end of the day is still a freedom to choose. permalink parent award report block reply OG_BACONndEGGs OP 6 points 2 days ago I agree I'd never tell someone not too. permalink parent award report block reply Calumet57 6 points 2 days ago I still smoke but hope to quit again anew.  The longest I've ever gone is 573 days about 20 years ago. Every failure came from my work exposure in east Asia where work hard play hard alcohol and cigarettes are a thing.  I'm distanced from that now. IMHO quitting booze is easier than tobacco.  I'm on/off with beer but it's easy to quit when you are in times of having your mind right. My greatest health achievements came from carnivore keto low-carb diet.  I fall off the wagon with this often too.. permalink parent award report block reply view 5 more comments... OnceADroplet 1 points 1 day ago 😎 permalink parent award report block reply MastaJoda 1 points 1 day ago Fox holes wont save folks from the impending CIA created nuclear war. https://www.newsweek.com/us-gets-serious-about-drone-threat-after-russias-pearl-harbor-11026452 permalink parent award report block reply\nOG_BACONndEGGs OP 12 points 2 days ago I'm 10 years cigarette free and 2 months in sober no alcohol. And I wasn't even a bad drinker just socially. But people need to kick their vices now and get right. We don't need you in the fox hole withdrawing from nicotine and getting the shakes from not drinking. Gym, Range, stack storable food and ammo. And ask yourself if my next meal is 2 miles away can I get their on foot with 50 pounds of gear. If the answer is no you better get your ass to a gym. permalink parent award report block reply Calumet57 12 points 2 days ago Fully agree.  But having a smoke at the end of the day is still a freedom to choose. permalink parent award report block reply OG_BACONndEGGs OP 6 points 2 days ago I agree I'd never tell someone not too. permalink parent award report block reply Calumet57 6 points 2 days ago I still smoke but hope to quit again anew.  The longest I've ever gone is 573 days about 20 years ago. Every failure came from my work exposure in east Asia where work hard play hard alcohol and cigarettes are a thing.  I'm distanced from that now. IMHO quitting booze is easier than tobacco.  I'm on/off with beer but it's easy to quit when you are in times of having your mind right. My greatest health achievements came from carnivore keto low-carb diet.  I fall off the wagon with this often too.. permalink parent award report block reply view 5 more comments... OnceADroplet 1 points 1 day ago 😎 permalink parent award report block reply MastaJoda 1 points 1 day ago Fox holes wont save folks from the impending CIA created nuclear war. https://www.newsweek.com/us-gets-serious-about-drone-threat-after-russias-pearl-harbor-11026452 permalink parent award report block reply\nCalumet57 12 points 2 days ago Fully agree.  But having a smoke at the end of the day is still a freedom to choose. permalink parent award report block reply OG_BACONndEGGs OP 6 points 2 days ago I agree I'd never tell someone not too. permalink parent award report block reply Calumet57 6 points 2 days ago I still smoke but hope to quit again anew.  The longest I've ever gone is 573 days about 20 years ago. Every failure came from my work exposure in east Asia where work hard play hard alcohol and cigarettes are a thing.  I'm distanced from that now. IMHO quitting booze is easier than tobacco.  I'm on/off with beer but it's easy to quit when you are in times of having your mind right. My greatest health achievements came from carnivore keto low-carb diet.  I fall off the wagon with this often too.. permalink parent award report block reply view 5 more comments...\nOG_BACONndEGGs OP 6 points 2 days ago I agree I'd never tell someone not too. permalink parent award report block reply Calumet57 6 points 2 days ago I still smoke but hope to quit again anew.  The longest I've ever gone is 573 days about 20 years ago. Every failure came from my work exposure in east Asia where work hard play hard alcohol and cigarettes are a thing.  I'm distanced from that now. IMHO quitting booze is easier than tobacco.  I'm on/off with beer but it's easy to quit when you are in times of having your mind right. My greatest health achievements came from carnivore keto low-carb diet.  I fall off the wagon with this often too.. permalink parent award report block reply view 5 more comments...\nCalumet57 6 points 2 days ago I still smoke but hope to quit again anew.  The longest I've ever gone is 573 days about 20 years ago. Every failure came from my work exposure in east Asia where work hard play hard alcohol and cigarettes are a thing.  I'm distanced from that now. IMHO quitting booze is easier than tobacco.  I'm on/off with beer but it's easy to quit when you are in times of having your mind right. My greatest health achievements came from carnivore keto low-carb diet.  I fall off the wagon with this often too.. permalink parent award report block reply view 5 more comments...\nOnceADroplet 1 points 1 day ago 😎 permalink parent award report block reply\nMastaJoda 1 points 1 day ago Fox holes wont save folks from the impending CIA created nuclear war. https://www.newsweek.com/us-gets-serious-about-drone-threat-after-russias-pearl-harbor-11026452 permalink parent award report block reply\nCzechForTrump 6 points 1 day ago \"We had two bags of grass, seventy-five pellets of mescaline, five sheets of high powered blotter acid, a salt shaker half full of cocaine, and a whole galaxy of multi-colored uppers, downers, screamers, laughers... and also a quart of tequila, a quart of rum, a case of Budweiser, a pint of raw ether and two dozen amyls.\nNot that we needed all that for the trip, but once you get locked into a serious drug collection, the tendency is to push it as far as you can.\" permalink award report block reply MayorMcSixaplix 3 points 1 day ago Soon enough, you’ll see the bats. permalink parent award report block reply Neonentity 1 points 1 day ago Watch out for the ones with blue and purple hair. permalink parent award report block reply\nMayorMcSixaplix 3 points 1 day ago Soon enough, you’ll see the bats. permalink parent award report block reply Neonentity 1 points 1 day ago Watch out for the ones with blue and purple hair. permalink parent award report block reply\nNeonentity 1 points 1 day ago Watch out for the ones with blue and purple hair. permalink parent award report block reply\nSoyLatte 6 points 1 day ago Our Lady of Blessed Acceleration don’t fail me now! permalink award report block reply\nFrenchie619 6 points 1 day ago Hit it! permalink award report block reply\nWolfebane84 4 points 1 day ago Now this should be stickied.... permalink award report block reply\nDuster_340 4 points 1 day ago MAGA and became MIGA, good look. lol. permalink award report block reply\nFrankDuncan 4 points 1 day ago HIT IT!!! permalink award report block reply\nDuce30 3 points 1 day ago Deus Vult. Let's kick the muzzies out while taking it back. permalink award report block reply\nConRep1818 2 points 1 day ago We're on a mission, from Gaadd... permalink award report block reply\nPearlyGaits57 2 points 1 day ago The \"PENGUIN\" is happy. permalink award report block reply\nBonusjohn28 2 points 1 day ago Playing freebird permalink award report block reply\nCandyBarr 2 points 1 day ago I approve this message permalink award report block reply\nConstitution_1788 2 points 1 day ago I like this. permalink award report block reply\nConstitution_1788 2 points 1 day ago I like this, Fren. We all need a little bump!!! permalink award report block reply\niamherefortheluls 2 points 1 day ago It was never going to be quick or smooth. Will take generations - every setback on the way is just that. And anyone doubting that, only needs to look at the odds that so many other movements overcame before. permalink award report block reply\nrumplestiltzkin2 1 points 1 day ago first we gotta get through the nazi rally led by a little jew permalink award report block reply\n24NoMoreBullshit 1 points 1 day ago I got no issues rolling up the RINOs and smoking 'em. permalink award report block reply\nCovfefe_And_Justice 1 points 1 day ago It's cool, I got enough dip for everybody. Long cut wintergreen! permalink award report block reply\nNonbinaryPotatohead 1 points 1 day ago What do you mean Rinos are crying? They are laughing right now. permalink award report block reply\nLosferwords 1 points 1 day ago \"We're on a mission from Bob!\" permalink award report block reply\nPepePinochet 1 points 1 day ago Rolling out to the gym to get swol rn permalink award report block reply\nPongpagongbatibot 0 points 1 day ago Fuck the groypers. They hijack every post. Notice that you can't cheer anymore for Trump because the groypers will downvote anything supportive of Trump and MAGA. groypers only advance Iran and Islam's interest. permalink award report block reply OG_BACONndEGGs OP 0 points 1 day ago You can cheer Trump this whole page does. You just want to cheer Trump and Bibi. Fag permalink parent award report block reply\nOG_BACONndEGGs OP 0 points 1 day ago You can cheer Trump this whole page does. You just want to cheer Trump and Bibi. Fag permalink parent award report block reply\nSteelDriver -3 points 1 day ago Wait, we hate Mark Levin now?  I haven't heard from him in a while (obviously, I missed something :D), but the last time I did, he was a pretty hard core Trump guy. permalink award report block reply OG_BACONndEGGs OP 10 points 1 day ago He's an israel shill now. Just youtube his speech at the RJC. Faggot wants to cancel Tucker Carlson and anyone else who dares to be America 1st. permalink parent award report block reply PearlyGaits57 3 points 1 day ago Then why \"cancel\" tucker? permalink parent award report block reply ParadigmShift2070 3 points 1 day ago he's always been an Israeli shill, he just doesn't pretend to care about anything else now permalink parent award report block reply Pongpagongbatibot -3 points 1 day ago Carlson ain't america first. He is Iran first permalink parent award report block reply OG_BACONndEGGs OP 2 points 1 day ago Nice tel aviv talking points you got there faggot permalink parent award report block reply NonbinaryPotatohead 7 points 1 day ago He's melting down about Israel support dropping among MAGA base because of obvious reasons but doesn't want to go live there. I dunno. permalink parent award report block reply Pongpagongbatibot 0 points 1 day ago Anything that is pro-trump, the Iranian groypers will turn into an anti-jooos thread. This board has been hijacked by Iranian and Muslim trolls. You can't cheer for Trump and MAGA  anymore without Groypers griping about the \"jooos and Israel\" Post something negative about Islam, the groypers will suddenly attack with \"but Israel and the joos are the real problem. Fuck groypers. Fuck Iran. Fuck Islam!! I love Israel for piling up more dead terrorist Muslim bodies permalink parent award report block reply\nOG_BACONndEGGs OP 10 points 1 day ago He's an israel shill now. Just youtube his speech at the RJC. Faggot wants to cancel Tucker Carlson and anyone else who dares to be America 1st. permalink parent award report block reply PearlyGaits57 3 points 1 day ago Then why \"cancel\" tucker? permalink parent award report block reply ParadigmShift2070 3 points 1 day ago he's always been an Israeli shill, he just doesn't pretend to care about anything else now permalink parent award report block reply Pongpagongbatibot -3 points 1 day ago Carlson ain't america first. He is Iran first permalink parent award report block reply OG_BACONndEGGs OP 2 points 1 day ago Nice tel aviv talking points you got there faggot permalink parent award report block reply\nPearlyGaits57 3 points 1 day ago Then why \"cancel\" tucker? permalink parent award report block reply\nParadigmShift2070 3 points 1 day ago he's always been an Israeli shill, he just doesn't pretend to care about anything else now permalink parent award report block reply\nPongpagongbatibot -3 points 1 day ago Carlson ain't america first. He is Iran first permalink parent award report block reply OG_BACONndEGGs OP 2 points 1 day ago Nice tel aviv talking points you got there faggot permalink parent award report block reply\nOG_BACONndEGGs OP 2 points 1 day ago Nice tel aviv talking points you got there faggot permalink parent award report block reply\nNonbinaryPotatohead 7 points 1 day ago He's melting down about Israel support dropping among MAGA base because of obvious reasons but doesn't want to go live there. I dunno. permalink parent award report block reply\nPongpagongbatibot 0 points 1 day ago Anything that is pro-trump, the Iranian groypers will turn into an anti-jooos thread. This board has been hijacked by Iranian and Muslim trolls. You can't cheer for Trump and MAGA  anymore without Groypers griping about the \"jooos and Israel\" Post something negative about Islam, the groypers will suddenly attack with \"but Israel and the joos are the real problem. Fuck groypers. Fuck Iran. Fuck Islam!! I love Israel for piling up more dead terrorist Muslim bodies permalink parent award report block reply\nno_public_id -1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nPedrohk -1 points 2 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:03:32.143106Z"
}