{
  "id": "8185497",
  "title": "414JFK’s Anti-Trump Grandson Launches Campaign to Replace Democrat Jerry Nadler(slaynews.com)posted3",
  "url": "https://patriots.win/p/1ARK9nOoNj/jfks-antitrump-grandson-launches/c",
  "content": "418 JFK’s Anti-Trump Grandson Launches Campaign to Replace Democrat Jerry Nadler (slaynews.com) posted 3 hours ago by Sea_Still 48 comments award share report block JFK's Anti-Trump Grandson Launches Campaign to Replace Democrat Jerry Nadler - Slay News John F. Kennedy’s grandson, Jack Schlossberg, announced Tuesday that he is running for Congress to replace longtime Democrat Rep. Jerry Nadler (D-NY) in the House of Representatives. slaynews.com\n48 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style UsernameChexOut 50 points 2 hours ago Schlossberg... wow, you can't make this shit up permalink award report block reply BurtMcGirt 28 points 2 hours ago I'm going to have to ask you to please refrain from noticing. Thank you for your attention to this matter. /s permalink parent award report block reply thisaintitchief76 2 points 35 minutes ago Everyberg. Singlestein. Timeowitz. permalink parent award report block reply Pnw4gotpwd 36 points 2 hours ago His grand dad would bitch slap him. Jfk was anti communist and pro America permalink award report block reply rebuildingMyself 23 points 2 hours ago And they killed him for it permalink parent award report block reply MythArcana 17 points 2 hours ago In his campaign announcement, Schlossberg took direct aim at President Donald Trump, accusing him of corruption and claiming the nation faces a “constitutional crisis.” “It’s cronyism, not capitalism,” he continued. Any words about nepotism at all? permalink award report block reply KernalMustard 8 points 2 hours ago The DNC is run like a mafia operation. Pot calling the kettle black. permalink parent award report block reply Awan-CIA-Car-Lot 5 points 2 hours ago That's exactly why they can't be infiltrated by Republicans pretending to be Dems. You're joining organized crime and you don't get out unless you die. permalink parent award report block reply ParticleCannon 14 points 2 hours ago Pretty big pants to fill permalink award report block reply DontTreadOnLego 8 points 2 hours ago and a big nose to fill permalink parent award report block reply Awan-CIA-Car-Lot 4 points 2 hours ago He'll win, though.  Just because he's good looking and Nadler looks like shit. He'll get that young women's vote for sure. permalink parent award report block reply Mamapedia 3 points 2 hours ago Yuge! permalink parent award report block reply PhantomShield72 2 points 1 hour ago Only the circumference is big. permalink parent award report block reply Aluminoti 9 points 2 hours ago Nadler crapped his pants in response permalink award report block reply BigMikesSwingingCock 5 points 2 hours ago The shitpantsed shuffle. permalink parent award report block reply SavingPrivateGrace 8 points 2 hours ago A product of selective grooming raised by NYC.  He won before his  campaign began. permalink award report block reply Goozmania 7 points 2 hours ago Do women find that face attractive? It looks like a block with 50 deep folds in it. permalink award report block reply Bazhosh 6 points 2 hours ago Depends on the net worth of that face... permalink parent award report block reply Goozmania 1 points 42 minutes ago lol permalink parent award report block reply BadBrainsBuzzcocks 5 points 2 hours ago Leftist scum is automatically repulsive thank you. permalink parent award report block reply SavingPrivateGrace 5 points 2 hours ago No, he looks like a tranny drag Maria Shiver. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 1 hour ago I think they will, compared to Nadler. permalink parent award report block reply DJT_MFers1 7 points 2 hours ago I swear. These democrats are like gremlins that get wet. permalink award report block reply djpat 6 points 2 hours ago What a quintessential Irish name permalink award report block reply Antenna 5 points 2 hours ago That guy is a nut caes. Some Kennedys become great men. Others get lobotomized. permalink award report block reply sixfingerdildo 4 points 2 hours ago have you seen the family photo? wtf... permalink parent award report block reply KernalMustard 5 points 2 hours ago Hapsburg 2.0 permalink parent award report block reply Awan-CIA-Car-Lot 5 points 1 hour ago Isn't it funny how everyone in that family looks the same? permalink parent award report block reply Whoopies_tds 5 points 1 hour ago What happened to no kings? permalink parent award report block reply view 1 more comments... Nearlydearly2 4 points 2 hours ago Schlossberg...EST permalink award report block reply RememberCharlieKirk 4 points 2 hours ago The Democrat strategy for campaigning in the last decade: Do not campaign on improving your state (New York). Instead, campaign on your obsessive, baseless dislike for one specific person. After President Trump leaves office, how will the Democrats campaign? Can JD Vance even elicit such a foaming-in-mouth response? permalink award report block reply kfunny91 4 points 2 hours ago can this kid even form a sentence? permalink award report block reply FuzzAldrin 4 points 2 hours ago \"Ask not what your country can do for you, but rather what you can do for the Kennedys!\" permalink award report block reply mlp67 4 points 2 hours ago He is a certifiable crazy person. NY will definitely vote for him. permalink award report block reply IvIA6A 3 points 2 hours ago He's doesn't have the stomach for the job permalink award report block reply Side_o_beef_curtains 3 points 2 hours ago Replacing Nadler: because these pants won't shit themselves. permalink award report block reply barwhack 3 points 2 hours ago Does he ALSO poop his pants live on-air? permalink award report block reply aqua27 1 points 1 hour ago Another crazy liberal running they hate JFK working to make us healthy yey they will love this pussy who never worked a day in his life. permalink award report block reply ReturnOfSmarm 1 points 1 hour ago Would've loved to have been a fly on the wall at the Kennedy reunions listening to him and Schwarzeneggar in a conversation permalink award report block reply Redpilled2Depression 1 points 1 hour ago Imagine being so cucked that you’re running for public office to stop the one guy trying to dismantle the corrupt government that blew the brains out of your grandfather in broad daylight. permalink award report block reply Retard_Strength 1 points 2 hours ago just what we need. more fucking Kennedys permalink award report block reply Citizen_Bob 1 points 2 hours ago their party mutilated little kids. remember that when engaging with them. permalink award report block reply Eddie_LeBec 1 points 2 hours ago He should run on training untalented Americans permalink award report block reply Mikeyy5000 1 points 1 hour ago I noticed.  Lock me up... permalink award report block reply\nUsernameChexOut 50 points 2 hours ago Schlossberg... wow, you can't make this shit up permalink award report block reply BurtMcGirt 28 points 2 hours ago I'm going to have to ask you to please refrain from noticing. Thank you for your attention to this matter. /s permalink parent award report block reply thisaintitchief76 2 points 35 minutes ago Everyberg. Singlestein. Timeowitz. permalink parent award report block reply\nBurtMcGirt 28 points 2 hours ago I'm going to have to ask you to please refrain from noticing. Thank you for your attention to this matter. /s permalink parent award report block reply\nthisaintitchief76 2 points 35 minutes ago Everyberg. Singlestein. Timeowitz. permalink parent award report block reply\nPnw4gotpwd 36 points 2 hours ago His grand dad would bitch slap him. Jfk was anti communist and pro America permalink award report block reply rebuildingMyself 23 points 2 hours ago And they killed him for it permalink parent award report block reply\nrebuildingMyself 23 points 2 hours ago And they killed him for it permalink parent award report block reply\nMythArcana 17 points 2 hours ago In his campaign announcement, Schlossberg took direct aim at President Donald Trump, accusing him of corruption and claiming the nation faces a “constitutional crisis.” “It’s cronyism, not capitalism,” he continued. Any words about nepotism at all? permalink award report block reply KernalMustard 8 points 2 hours ago The DNC is run like a mafia operation. Pot calling the kettle black. permalink parent award report block reply Awan-CIA-Car-Lot 5 points 2 hours ago That's exactly why they can't be infiltrated by Republicans pretending to be Dems. You're joining organized crime and you don't get out unless you die. permalink parent award report block reply\nKernalMustard 8 points 2 hours ago The DNC is run like a mafia operation. Pot calling the kettle black. permalink parent award report block reply Awan-CIA-Car-Lot 5 points 2 hours ago That's exactly why they can't be infiltrated by Republicans pretending to be Dems. You're joining organized crime and you don't get out unless you die. permalink parent award report block reply\nAwan-CIA-Car-Lot 5 points 2 hours ago That's exactly why they can't be infiltrated by Republicans pretending to be Dems. You're joining organized crime and you don't get out unless you die. permalink parent award report block reply\nParticleCannon 14 points 2 hours ago Pretty big pants to fill permalink award report block reply DontTreadOnLego 8 points 2 hours ago and a big nose to fill permalink parent award report block reply Awan-CIA-Car-Lot 4 points 2 hours ago He'll win, though.  Just because he's good looking and Nadler looks like shit. He'll get that young women's vote for sure. permalink parent award report block reply Mamapedia 3 points 2 hours ago Yuge! permalink parent award report block reply PhantomShield72 2 points 1 hour ago Only the circumference is big. permalink parent award report block reply\nDontTreadOnLego 8 points 2 hours ago and a big nose to fill permalink parent award report block reply Awan-CIA-Car-Lot 4 points 2 hours ago He'll win, though.  Just because he's good looking and Nadler looks like shit. He'll get that young women's vote for sure. permalink parent award report block reply\nAwan-CIA-Car-Lot 4 points 2 hours ago He'll win, though.  Just because he's good looking and Nadler looks like shit. He'll get that young women's vote for sure. permalink parent award report block reply\nMamapedia 3 points 2 hours ago Yuge! permalink parent award report block reply\nPhantomShield72 2 points 1 hour ago Only the circumference is big. permalink parent award report block reply\nAluminoti 9 points 2 hours ago Nadler crapped his pants in response permalink award report block reply BigMikesSwingingCock 5 points 2 hours ago The shitpantsed shuffle. permalink parent award report block reply\nBigMikesSwingingCock 5 points 2 hours ago The shitpantsed shuffle. permalink parent award report block reply\nSavingPrivateGrace 8 points 2 hours ago A product of selective grooming raised by NYC.  He won before his  campaign began. permalink award report block reply\nGoozmania 7 points 2 hours ago Do women find that face attractive? It looks like a block with 50 deep folds in it. permalink award report block reply Bazhosh 6 points 2 hours ago Depends on the net worth of that face... permalink parent award report block reply Goozmania 1 points 42 minutes ago lol permalink parent award report block reply BadBrainsBuzzcocks 5 points 2 hours ago Leftist scum is automatically repulsive thank you. permalink parent award report block reply SavingPrivateGrace 5 points 2 hours ago No, he looks like a tranny drag Maria Shiver. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 1 hour ago I think they will, compared to Nadler. permalink parent award report block reply\nBazhosh 6 points 2 hours ago Depends on the net worth of that face... permalink parent award report block reply Goozmania 1 points 42 minutes ago lol permalink parent award report block reply\nGoozmania 1 points 42 minutes ago lol permalink parent award report block reply\nBadBrainsBuzzcocks 5 points 2 hours ago Leftist scum is automatically repulsive thank you. permalink parent award report block reply\nSavingPrivateGrace 5 points 2 hours ago No, he looks like a tranny drag Maria Shiver. permalink parent award report block reply\nAwan-CIA-Car-Lot 3 points 1 hour ago I think they will, compared to Nadler. permalink parent award report block reply\nDJT_MFers1 7 points 2 hours ago I swear. These democrats are like gremlins that get wet. permalink award report block reply\ndjpat 6 points 2 hours ago What a quintessential Irish name permalink award report block reply\nAntenna 5 points 2 hours ago That guy is a nut caes. Some Kennedys become great men. Others get lobotomized. permalink award report block reply sixfingerdildo 4 points 2 hours ago have you seen the family photo? wtf... permalink parent award report block reply KernalMustard 5 points 2 hours ago Hapsburg 2.0 permalink parent award report block reply Awan-CIA-Car-Lot 5 points 1 hour ago Isn't it funny how everyone in that family looks the same? permalink parent award report block reply Whoopies_tds 5 points 1 hour ago What happened to no kings? permalink parent award report block reply view 1 more comments...\nsixfingerdildo 4 points 2 hours ago have you seen the family photo? wtf... permalink parent award report block reply KernalMustard 5 points 2 hours ago Hapsburg 2.0 permalink parent award report block reply Awan-CIA-Car-Lot 5 points 1 hour ago Isn't it funny how everyone in that family looks the same? permalink parent award report block reply Whoopies_tds 5 points 1 hour ago What happened to no kings? permalink parent award report block reply view 1 more comments...\nKernalMustard 5 points 2 hours ago Hapsburg 2.0 permalink parent award report block reply Awan-CIA-Car-Lot 5 points 1 hour ago Isn't it funny how everyone in that family looks the same? permalink parent award report block reply Whoopies_tds 5 points 1 hour ago What happened to no kings? permalink parent award report block reply view 1 more comments...\nAwan-CIA-Car-Lot 5 points 1 hour ago Isn't it funny how everyone in that family looks the same? permalink parent award report block reply Whoopies_tds 5 points 1 hour ago What happened to no kings? permalink parent award report block reply view 1 more comments...\nWhoopies_tds 5 points 1 hour ago What happened to no kings? permalink parent award report block reply view 1 more comments...\nNearlydearly2 4 points 2 hours ago Schlossberg...EST permalink award report block reply\nRememberCharlieKirk 4 points 2 hours ago The Democrat strategy for campaigning in the last decade: Do not campaign on improving your state (New York). Instead, campaign on your obsessive, baseless dislike for one specific person. After President Trump leaves office, how will the Democrats campaign? Can JD Vance even elicit such a foaming-in-mouth response? permalink award report block reply\nkfunny91 4 points 2 hours ago can this kid even form a sentence? permalink award report block reply\nFuzzAldrin 4 points 2 hours ago \"Ask not what your country can do for you, but rather what you can do for the Kennedys!\" permalink award report block reply\nmlp67 4 points 2 hours ago He is a certifiable crazy person. NY will definitely vote for him. permalink award report block reply\nIvIA6A 3 points 2 hours ago He's doesn't have the stomach for the job permalink award report block reply\nSide_o_beef_curtains 3 points 2 hours ago Replacing Nadler: because these pants won't shit themselves. permalink award report block reply\nbarwhack 3 points 2 hours ago Does he ALSO poop his pants live on-air? permalink award report block reply\naqua27 1 points 1 hour ago Another crazy liberal running they hate JFK working to make us healthy yey they will love this pussy who never worked a day in his life. permalink award report block reply\nReturnOfSmarm 1 points 1 hour ago Would've loved to have been a fly on the wall at the Kennedy reunions listening to him and Schwarzeneggar in a conversation permalink award report block reply\nRedpilled2Depression 1 points 1 hour ago Imagine being so cucked that you’re running for public office to stop the one guy trying to dismantle the corrupt government that blew the brains out of your grandfather in broad daylight. permalink award report block reply\nRetard_Strength 1 points 2 hours ago just what we need. more fucking Kennedys permalink award report block reply\nCitizen_Bob 1 points 2 hours ago their party mutilated little kids. remember that when engaging with them. permalink award report block reply\nEddie_LeBec 1 points 2 hours ago He should run on training untalented Americans permalink award report block reply\nMikeyy5000 1 points 1 hour ago I noticed.  Lock me up... permalink award report block reply"
}