{
  "id": "1ARK9oWNgg",
  "url": "https://patriots.win/p/1ARK9oWNgg/-just-in-pete-hegseth-declares-w/c",
  "content": "81 🚨 JUST IN: Pete Hegseth declares woke is officially DEAD at the Pentagon posted 2 hours ago by LightBeacons 7 comments award share report block Nick Sortor @nicksortor • 6h 🚨 JUST IN: Pete Hegseth declares woke is officially DEAD at the Pentagon “No more social justice. No more political correctness. No more toxic ideological garbage that infected the department. No more identity months. No more DEl offices. No more dudes in dresses. No more\n7 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow SHILL_DETECTOR 2 points 2 hours ago wow same thing over and over permalink award report block reply imnotdeadyet 2 points 44 minutes ago That is called consistency and sending a consistent message to the troops and leadership. permalink parent award report block reply PatriotSkorzeny 1 points 36 minutes ago No. Everytime he says it it nessecarily reminds everyone that “the woke officer class is still in place.” Nobody thinks about woke until someone says woke. He keeps bringing it up. “Not one unlawful order giver…” permalink parent award report block reply SpeekFreely 2 points 2 hours ago Again..or is this a repost ? permalink award report block reply PatriotSkorzeny 1 points 2 hours ago Haha there it is. 🤣🤣 Ground Zero, NYC is occupied by the Moslem. permalink award report block reply Sivispacem 1 points 1 hour ago Put a banner behind him. Have it say something like, I don't know, \"Mission Accomplished\". permalink award report block reply Deep_Croak 1 points 2 hours ago As a former Sgt, I agree! permalink award report block reply\nSHILL_DETECTOR 2 points 2 hours ago wow same thing over and over permalink award report block reply imnotdeadyet 2 points 44 minutes ago That is called consistency and sending a consistent message to the troops and leadership. permalink parent award report block reply PatriotSkorzeny 1 points 36 minutes ago No. Everytime he says it it nessecarily reminds everyone that “the woke officer class is still in place.” Nobody thinks about woke until someone says woke. He keeps bringing it up. “Not one unlawful order giver…” permalink parent award report block reply\nimnotdeadyet 2 points 44 minutes ago That is called consistency and sending a consistent message to the troops and leadership. permalink parent award report block reply PatriotSkorzeny 1 points 36 minutes ago No. Everytime he says it it nessecarily reminds everyone that “the woke officer class is still in place.” Nobody thinks about woke until someone says woke. He keeps bringing it up. “Not one unlawful order giver…” permalink parent award report block reply\nPatriotSkorzeny 1 points 36 minutes ago No. Everytime he says it it nessecarily reminds everyone that “the woke officer class is still in place.” Nobody thinks about woke until someone says woke. He keeps bringing it up. “Not one unlawful order giver…” permalink parent award report block reply\nSpeekFreely 2 points 2 hours ago Again..or is this a repost ? permalink award report block reply\nPatriotSkorzeny 1 points 2 hours ago Haha there it is. 🤣🤣 Ground Zero, NYC is occupied by the Moslem. permalink award report block reply\nSivispacem 1 points 1 hour ago Put a banner behind him. Have it say something like, I don't know, \"Mission Accomplished\". permalink award report block reply\nDeep_Croak 1 points 2 hours ago As a former Sgt, I agree! permalink award report block reply",
  "fetched_at": "2025-11-12T23:26:29.538173Z"
}