{
  "id": "1ARK9oXChd",
  "url": "https://patriots.win/p/1ARK9oXChd/the-faggot-is-back-the-going-rat/c",
  "content": "11 The faggot is back. The going rate for pro-H1-B posts is $3,000 - $5,000 posted 17 minutes ago by Antenna 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save Around the Web Salt Lake City's Hair Growth Method Breaks All Records! HaloGrow Antenna OP 5 points 15 minutes ago For people confused as to why Bill won’t shut up with the fake pro-H1B talking points: https://x.com/Will_Panic/status/1988676599303270490?s=20 permalink award report block reply patrioticwinning3 3 points 13 minutes ago Wow 3-5k per post! permalink parent award report block reply patrioticwinning3 4 points 14 minutes ago AI is the new, \"Fight them over there so we don't have to fight them over here!\" permalink award report block reply lostmyoldpassword 3 points 14 minutes ago How much are the people posting here getting?  I'm fucking serious. permalink award report block reply FuckJBiden 1 points 1 minute ago They’re retarded and doing it for free permalink parent award report block reply breadbaker 1 points 54 seconds ago They have no AI in India. They have no large language model at any Indian Institute of Technology, the top tier university level for tech. To get into these schools, they cheat, Massively. The same college exams given in the US are believed to be compromised, identity control is non-existent when you can bribe people, exam security are known to have been broached. They are completely unprepared. In US classes, Indians pass study materials to each other and when the profs are indian what do you get, permalink award report block reply\nAntenna OP 5 points 15 minutes ago For people confused as to why Bill won’t shut up with the fake pro-H1B talking points: https://x.com/Will_Panic/status/1988676599303270490?s=20 permalink award report block reply patrioticwinning3 3 points 13 minutes ago Wow 3-5k per post! permalink parent award report block reply\npatrioticwinning3 3 points 13 minutes ago Wow 3-5k per post! permalink parent award report block reply\npatrioticwinning3 4 points 14 minutes ago AI is the new, \"Fight them over there so we don't have to fight them over here!\" permalink award report block reply\nlostmyoldpassword 3 points 14 minutes ago How much are the people posting here getting?  I'm fucking serious. permalink award report block reply FuckJBiden 1 points 1 minute ago They’re retarded and doing it for free permalink parent award report block reply\nFuckJBiden 1 points 1 minute ago They’re retarded and doing it for free permalink parent award report block reply\nbreadbaker 1 points 54 seconds ago They have no AI in India. They have no large language model at any Indian Institute of Technology, the top tier university level for tech. To get into these schools, they cheat, Massively. The same college exams given in the US are believed to be compromised, identity control is non-existent when you can bribe people, exam security are known to have been broached. They are completely unprepared. In US classes, Indians pass study materials to each other and when the profs are indian what do you get, permalink award report block reply",
  "fetched_at": "2025-11-12T23:26:57.188300Z"
}