{
  "id": "8185547",
  "title": "51Rep. MTG plans to read the names of powerful people on the Epstein list in Congress under immunity",
  "url": "https://patriots.win/p/1ARK9nP567/rep-mtg-plans-to-read-the-names-/c",
  "content": "51 Rep. MTG plans to read the names of powerful people on the Epstein list in Congress under immunity once the government reopens. 🤣🤡 posted 2 hours ago by Eruditio 7 comments award share report block PoliticsVideoChannel @politvidchannel • 24h BREAKING: Rep. MTG plans to read the names of powerful people on the Epstein list in Congress under immunity once the government reopens.\n7 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style ramennov 8 points 2 hours ago No she won't permalink award report block reply edxzxz 3 points 1 hour ago I was told there was no Epstein list? permalink award report block reply Franklymydear 1 points 2 hours ago Oh no !!! Anyways….. permalink award report block reply YaharaRiver 1 points 2 hours ago There will be surprises! permalink award report block reply Watermelons 1 points 1 hour ago Theater. Just fucking do it.  You don't announce you're gonna do something.  If you do, it's all for show. permalink award report block reply MastaJoda 1 points 1 hour ago aaaand she committed suicide. permalink award report block reply MeMargie 1 points 2 hours ago Barry Soetoro permalink award report block reply\nramennov 8 points 2 hours ago No she won't permalink award report block reply\nedxzxz 3 points 1 hour ago I was told there was no Epstein list? permalink award report block reply\nFranklymydear 1 points 2 hours ago Oh no !!! Anyways….. permalink award report block reply\nYaharaRiver 1 points 2 hours ago There will be surprises! permalink award report block reply\nWatermelons 1 points 1 hour ago Theater. Just fucking do it.  You don't announce you're gonna do something.  If you do, it's all for show. permalink award report block reply\nMastaJoda 1 points 1 hour ago aaaand she committed suicide. permalink award report block reply\nMeMargie 1 points 2 hours ago Barry Soetoro permalink award report block reply"
}