{
  "id": "1ARK9hhjaG",
  "url": "https://patriots.win/p/1ARK9hhjaG/the-usual-suspects-attack-a-musi/c",
  "content": "350 The usual suspects attack a musician because Allah doesn't like music, but he defends himself like a lion and doesn't back down an inch posted 3 days ago by PiratePatriotParrot 15 comments award share report block RadioGenoa @RadioGenoa • 3d The usual suspects attack a musician because Allah doesn't like music, but he defends himself like a lion and doesn't back down an inch.\n15 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MAG-n-KAG 10 points 2 days ago dude was like, \"Lets rock\". permalink award report block reply Wupta PRO 8 points 2 days ago 2A permalink award report block reply Kraken 6 points 2 days ago Dude was pretty good for a musician. permalink award report block reply JesusisLordofAll777 5 points 2 days ago He was the ayatollah of rock and rolla permalink award report block reply NomadicKrow2 5 points 2 days ago That's a crazy soundtrack to get your ass beat to lmao permalink award report block reply Easzq8 5 points 2 days ago I suggest the Guile theme. permalink parent award report block reply NecturusMaculosus 4 points 2 days ago Starts with 3 on 1. Little muslim fanatic slaps the musician first. Musician steps forward and lands a punch. Musician keeps stepping forward and lands more punches. Muslim tries a kick and gets put down on the ground. Musician gets support from another fellow as big as all three muslims put together. Fight is over. Biggest of three muslims never threw a punch. Pussies. permalink award report block reply Smurfection 4 points 2 days ago Yep, as soon as a nieghborhood gets about 20-30% Islamic, street attacks start happening.  Not just musicians though, women who aren't \"covered\" in a garbage bag they call hijab, grocery stores stop selling bacon and pork, women start feeling unsafe to be out without a man accompanying them. Dang, I remember when feminists in the west were pushing National Night Out and marching for women's rights to go out and walk the streets safely. permalink award report block reply Rock9Head 3 points 2 days ago A civil war would do them good. permalink award report block reply Jaqen 3 points 2 days ago Them? Unless you’re in Poland or Japan, this problem is already at your doorstep. permalink parent award report block reply YaharaRiver 4 points 2 days ago And so is the Solution. permalink parent award report block reply NomadicKrow2 2 points 2 days ago The solution is at my doorstep? Come on, I can't get guns mailed directly to me anymore. Or... Did you mean the FINAL solution? permalink parent award report block reply greatpumpkin 3 points 2 days ago They're still standing. Obviously he didn't hit them hard enough. permalink award report block reply ConductProbation 2 points 2 days ago Where? permalink award report block reply GhostOfMyFormerSelf 2 points 2 days ago This is the way. permalink award report block reply Mikespenis123 2 points 2 days ago I wouldn't get too far away from that Strat if I were him... permalink award report block reply\nMAG-n-KAG 10 points 2 days ago dude was like, \"Lets rock\". permalink award report block reply\nWupta PRO 8 points 2 days ago 2A permalink award report block reply\nKraken 6 points 2 days ago Dude was pretty good for a musician. permalink award report block reply\nJesusisLordofAll777 5 points 2 days ago He was the ayatollah of rock and rolla permalink award report block reply\nNomadicKrow2 5 points 2 days ago That's a crazy soundtrack to get your ass beat to lmao permalink award report block reply Easzq8 5 points 2 days ago I suggest the Guile theme. permalink parent award report block reply\nEaszq8 5 points 2 days ago I suggest the Guile theme. permalink parent award report block reply\nNecturusMaculosus 4 points 2 days ago Starts with 3 on 1. Little muslim fanatic slaps the musician first. Musician steps forward and lands a punch. Musician keeps stepping forward and lands more punches. Muslim tries a kick and gets put down on the ground. Musician gets support from another fellow as big as all three muslims put together. Fight is over. Biggest of three muslims never threw a punch. Pussies. permalink award report block reply\nSmurfection 4 points 2 days ago Yep, as soon as a nieghborhood gets about 20-30% Islamic, street attacks start happening.  Not just musicians though, women who aren't \"covered\" in a garbage bag they call hijab, grocery stores stop selling bacon and pork, women start feeling unsafe to be out without a man accompanying them. Dang, I remember when feminists in the west were pushing National Night Out and marching for women's rights to go out and walk the streets safely. permalink award report block reply\nRock9Head 3 points 2 days ago A civil war would do them good. permalink award report block reply Jaqen 3 points 2 days ago Them? Unless you’re in Poland or Japan, this problem is already at your doorstep. permalink parent award report block reply YaharaRiver 4 points 2 days ago And so is the Solution. permalink parent award report block reply NomadicKrow2 2 points 2 days ago The solution is at my doorstep? Come on, I can't get guns mailed directly to me anymore. Or... Did you mean the FINAL solution? permalink parent award report block reply\nJaqen 3 points 2 days ago Them? Unless you’re in Poland or Japan, this problem is already at your doorstep. permalink parent award report block reply YaharaRiver 4 points 2 days ago And so is the Solution. permalink parent award report block reply NomadicKrow2 2 points 2 days ago The solution is at my doorstep? Come on, I can't get guns mailed directly to me anymore. Or... Did you mean the FINAL solution? permalink parent award report block reply\nYaharaRiver 4 points 2 days ago And so is the Solution. permalink parent award report block reply NomadicKrow2 2 points 2 days ago The solution is at my doorstep? Come on, I can't get guns mailed directly to me anymore. Or... Did you mean the FINAL solution? permalink parent award report block reply\nNomadicKrow2 2 points 2 days ago The solution is at my doorstep? Come on, I can't get guns mailed directly to me anymore. Or... Did you mean the FINAL solution? permalink parent award report block reply\ngreatpumpkin 3 points 2 days ago They're still standing. Obviously he didn't hit them hard enough. permalink award report block reply\nConductProbation 2 points 2 days ago Where? permalink award report block reply\nGhostOfMyFormerSelf 2 points 2 days ago This is the way. permalink award report block reply\nMikespenis123 2 points 2 days ago I wouldn't get too far away from that Strat if I were him... permalink award report block reply",
  "fetched_at": "2025-11-12T23:00:52.991759Z"
}