{
  "id": "1ARK9oWvNz",
  "url": "https://patriots.win/p/1ARK9oWvNz/that-moment-you-realize-the-shre/c",
  "content": "13 That moment you realize the Shredder was actually the good guy. Underground Reptilians eating Cheese Pizza... posted 58 minutes ago by Zerocool777 9 comments award share report block mrredpillz jokaqarmy @JOKAQARMY1 • 5h The teenage mutant ninja turtles conspiracy 🤔.\n9 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Zerocool777 OP 4 points 57 minutes ago I think we know who the underground reptilians are X_X Food for a thought... permalink award report block reply Patriot4TN 4 points 55 minutes ago Jews? permalink parent award report block reply Zerocool777 OP 4 points 52 minutes ago 𝘛𝘩𝘪𝘴 𝘤𝘰𝘮𝘮𝘦𝘯𝘵 𝘸𝘢𝘴 𝘳𝘦𝘮𝘰𝘷𝘦𝘥 𝘣𝘺 𝘵𝘩𝘦 𝘱𝘰𝘸𝘦𝘳𝘴 𝘵𝘩𝘢𝘵 𝘣𝘦. permalink parent award report block reply Patriot4TN 0 points 46 minutes ago Damn brother, you got the down vote bot patrol after you! It's not much, but let me help you out. permalink parent award report block reply Zerocool777 OP 4 points 43 minutes ago Appreciate it.  cheers permalink parent award report block reply Mulletgunning 2 points 36 minutes ago Bingo! Ha ha ha ha. MAGA AF permalink parent award report block reply twentytwentyfourr 4 points 53 minutes ago he was only encouraging youths to drop out of school and become foot soldiers because the education system is corrupt and gay! permalink award report block reply Zerocool777 OP 3 points 51 minutes ago Oh shi.... this is true! permalink parent award report block reply Build_Back_Bankrupt 1 points 52 seconds ago Yep, and you know they must've gotten busted doing something because they came out with this PSA commercial: https://www.youtube.com/watch?v=f95wWN7aO9s permalink award report block reply\nZerocool777 OP 4 points 57 minutes ago I think we know who the underground reptilians are X_X Food for a thought... permalink award report block reply Patriot4TN 4 points 55 minutes ago Jews? permalink parent award report block reply Zerocool777 OP 4 points 52 minutes ago 𝘛𝘩𝘪𝘴 𝘤𝘰𝘮𝘮𝘦𝘯𝘵 𝘸𝘢𝘴 𝘳𝘦𝘮𝘰𝘷𝘦𝘥 𝘣𝘺 𝘵𝘩𝘦 𝘱𝘰𝘸𝘦𝘳𝘴 𝘵𝘩𝘢𝘵 𝘣𝘦. permalink parent award report block reply Patriot4TN 0 points 46 minutes ago Damn brother, you got the down vote bot patrol after you! It's not much, but let me help you out. permalink parent award report block reply Zerocool777 OP 4 points 43 minutes ago Appreciate it.  cheers permalink parent award report block reply Mulletgunning 2 points 36 minutes ago Bingo! Ha ha ha ha. MAGA AF permalink parent award report block reply\nPatriot4TN 4 points 55 minutes ago Jews? permalink parent award report block reply Zerocool777 OP 4 points 52 minutes ago 𝘛𝘩𝘪𝘴 𝘤𝘰𝘮𝘮𝘦𝘯𝘵 𝘸𝘢𝘴 𝘳𝘦𝘮𝘰𝘷𝘦𝘥 𝘣𝘺 𝘵𝘩𝘦 𝘱𝘰𝘸𝘦𝘳𝘴 𝘵𝘩𝘢𝘵 𝘣𝘦. permalink parent award report block reply Patriot4TN 0 points 46 minutes ago Damn brother, you got the down vote bot patrol after you! It's not much, but let me help you out. permalink parent award report block reply Zerocool777 OP 4 points 43 minutes ago Appreciate it.  cheers permalink parent award report block reply Mulletgunning 2 points 36 minutes ago Bingo! Ha ha ha ha. MAGA AF permalink parent award report block reply\nZerocool777 OP 4 points 52 minutes ago 𝘛𝘩𝘪𝘴 𝘤𝘰𝘮𝘮𝘦𝘯𝘵 𝘸𝘢𝘴 𝘳𝘦𝘮𝘰𝘷𝘦𝘥 𝘣𝘺 𝘵𝘩𝘦 𝘱𝘰𝘸𝘦𝘳𝘴 𝘵𝘩𝘢𝘵 𝘣𝘦. permalink parent award report block reply Patriot4TN 0 points 46 minutes ago Damn brother, you got the down vote bot patrol after you! It's not much, but let me help you out. permalink parent award report block reply Zerocool777 OP 4 points 43 minutes ago Appreciate it.  cheers permalink parent award report block reply\nPatriot4TN 0 points 46 minutes ago Damn brother, you got the down vote bot patrol after you! It's not much, but let me help you out. permalink parent award report block reply Zerocool777 OP 4 points 43 minutes ago Appreciate it.  cheers permalink parent award report block reply\nZerocool777 OP 4 points 43 minutes ago Appreciate it.  cheers permalink parent award report block reply\nMulletgunning 2 points 36 minutes ago Bingo! Ha ha ha ha. MAGA AF permalink parent award report block reply\ntwentytwentyfourr 4 points 53 minutes ago he was only encouraging youths to drop out of school and become foot soldiers because the education system is corrupt and gay! permalink award report block reply Zerocool777 OP 3 points 51 minutes ago Oh shi.... this is true! permalink parent award report block reply\nZerocool777 OP 3 points 51 minutes ago Oh shi.... this is true! permalink parent award report block reply\nBuild_Back_Bankrupt 1 points 52 seconds ago Yep, and you know they must've gotten busted doing something because they came out with this PSA commercial: https://www.youtube.com/watch?v=f95wWN7aO9s permalink award report block reply",
  "fetched_at": "2025-11-12T23:25:32.401708Z"
}