{
  "id": "1ARK514xMf",
  "url": "https://patriots.win/p/1ARK514xMf/breaking-university-of-iowa-stud/c",
  "content": "638 BREAKING: University of Iowa student Justin Pham Calhoon, who flipped over a TPUSA table has been ARRESTED. FAFO. posted 6 days ago by Mr_Rightside 44 comments award share report block Libs of TikTok @libsoftiktok • 6d BREAKING: University of Iowa student who flipped over a TPUSA table has been ARRESTED FAFO Libs of TikTok @libsoftiktok • 7d BREAKING: Leftist student just FLIPPED OVER a TPUSA table at University of Iowa. @uiowa must charge and expel her MAKE HER FAMOUS\n44 comments Sort by Top Top New Worst Old Save Around the Web Briben 35 points 6 days ago Him. permalink award report block reply Deplora 17 points 6 days ago Hard to tell.  Either it's doing an exceptionally lousy job at \"transitioning\" or its parents messed up badly when naming it. permalink parent award report block reply asdrubael_was_right 10 points 6 days ago The baggy clothes on a warm fall day says ashamed of her body. That’s a chick thing. M2F show off their bolt on tits. permalink parent award report block reply KungPaoMcChicken 4 points 6 days ago Name looks semi Vietnamese. Possible the parents were going for Justine but can't spell correctly. permalink parent award report block reply Deplora 3 points 6 days ago This 2012 obituary for his grandmother lists him as one of her \"three grandsons\". So unless he was already playing the transgender game when he was around 6 years old, he's actually a \"he\" whose parents named him Justin. https://www.legacy.com/us/obituaries/desmoinesregister/name/retha-calhoon-obituary?id=8804690 If he's pretending to be a \"she\" now, he may just not have gotten around to changing his name legally (or maybe parents threatened to pull financial support if he changed it), and the official arrest announcement is using his legal name. permalink parent award report block reply KungPaoMcChicken 3 points 6 days ago Fair enough. I just didn't wish to make assumptions. permalink parent award report block reply view 7 more comments... NomadicKrow2 2 points 6 days ago Mr. and Mrs. Pham? What did you want to name your bundle of joy? \"Justaguy Pham.\" permalink parent award report block reply CruzControl 1 points 6 days ago Iowa corn does that to people. permalink parent award report block reply Patrick_Bateman 2 points 6 days ago Excuse me, but I think the correct pronouns are in/mate. permalink parent award report block reply EndTheFedEndTheSlvry 1 points 6 days ago It. permalink parent award report block reply Beelzy 18 points 6 days ago That's a Man, Baby! permalink award report block reply STONKATRUCK 8 points 6 days ago It's a woman trying to be him. So no it's a woman permalink parent award report block reply FrankDuncan 1 points 6 days ago A woMAN. permalink parent award report block reply thelastlast 9 points 6 days ago oohhhh it was a tranny.  ok that makes sense. permalink award report block reply CanadianMeathead 8 points 6 days ago Him permalink award report block reply maga_espada 6 points 6 days ago People don’t seem to get arrests mean nothing. Convictions is what is needed. Actual prison time or financial restitutions. An arrest without convictions just bolsters his rep with the crazies. permalink award report block reply Spiritof2015 3 points 6 days ago Good way to get kicked out of school though. permalink parent award report block reply ColonelKlink 5 points 6 days ago Deport the creature. permalink award report block reply deleted 4 points 6 days ago ianpatrick1966 4 points 6 days ago Iowa is not a castle doctrine state, you will get arrested for self defense, trust me -- I have twice. I'm not saying to not do it, just saying, be ready.  I've defended myself many more than 2 times, but the rest of those times I was masked and in all black. permalink parent award report block reply sixfingerdildo 2 points 6 days ago until The State is liberated from the leftists... these tabling efforts are cute, but conversation is over and The State is the real enemy. permalink parent award report block reply ForceMultiplier 4 points 6 days ago 19-year-old Justin Pham Calhoon was originally charged in connection with the Nov. 5 incident, but records now show an earlier case from Oct. 27, 2025, also filed by the University of Iowa Department of Public Safety. permalink award report block reply FrankDuncan 1 points 6 days ago They call it a he.. so it's probably not permalink parent award report block reply auntjemima 3 points 6 days ago wtf is that thing? permalink award report block reply KiekhaeferSoldier 3 points 6 days ago Benny Johnson's alma mater...  Univ of Iowa, Iowa City, Johnson County.  The ONLY county in Iowa that voted Nicki Haley in the 2023 GOP Presidential primary because leftist lunatics like that girl? were able to change parties for a day and go vote 'against Donald Trump' and they did it enmasse. permalink award report block reply me-no-likely3 3 points 6 days ago Omg, another delusional and violent TRANNY RETARD. permalink award report block reply PatPede1 3 points 6 days ago Deserves academic punishment.  Perhaps a semester banned from campus, community service helping students set up their tables in the commons, complete an anger management class, and submit a handwritten essay of no less than 5,000 words on the topic of free speech and the first amendment. permalink award report block reply Nothinberder 2 points 6 days ago Made him Phamous! permalink award report block reply DarthEP 1 points 6 days ago \"Her/She Has Offended The Phamily, And The Shaolin Temple.\" permalink parent award report block reply FrankDuncan 1 points 6 days ago Why you no let me go? permalink award report block reply MAG-n-KAG 1 points 6 days ago these fucking freaks have long outstayed their welcome. permalink award report block reply y_do_i_need_to_hide 1 points 6 days ago Cool. I still expect verifiable tabulation permalink award report block reply JoeMcCarthyWasRight 1 points 6 days ago This isn’t about “spewing hate” or whatever gay shit these freaks go on about. It’s about ending their little pedo party. You’re not celebrated anymore. America is done with you. Go back into the closet or we’re bringing gay bashing back. permalink award report block reply UncleTrumpsBand 1 points 6 days ago Get triggered lol permalink award report block reply Counterwhat 1 points 6 days ago Kick him out of the school. Stop any grants or scholarships. permalink award report block reply lifeisahologram 1 points 6 days ago Honestly we should all start doing these events, not even with the primary focus of providing information to interested people, but rather the primary focus should be making such triggering tables that we can “entrap” these retards to cause damage to get them all arrested 🤣 permalink award report block reply The_RedWolf 1 points 6 days ago Screenshot of his TWO arrest records in under 10 days: https://ibb.co/hx3xHHQ2 If you search his name, youll find 3 cases, but the other is just a 'Failure to yield' traffic ticket from 2024. source: https://www.iowacourts.state.ia.us/ESAWebApp/TrialSimpFrame permalink award report block reply\nBriben 35 points 6 days ago Him. permalink award report block reply Deplora 17 points 6 days ago Hard to tell.  Either it's doing an exceptionally lousy job at \"transitioning\" or its parents messed up badly when naming it. permalink parent award report block reply asdrubael_was_right 10 points 6 days ago The baggy clothes on a warm fall day says ashamed of her body. That’s a chick thing. M2F show off their bolt on tits. permalink parent award report block reply KungPaoMcChicken 4 points 6 days ago Name looks semi Vietnamese. Possible the parents were going for Justine but can't spell correctly. permalink parent award report block reply Deplora 3 points 6 days ago This 2012 obituary for his grandmother lists him as one of her \"three grandsons\". So unless he was already playing the transgender game when he was around 6 years old, he's actually a \"he\" whose parents named him Justin. https://www.legacy.com/us/obituaries/desmoinesregister/name/retha-calhoon-obituary?id=8804690 If he's pretending to be a \"she\" now, he may just not have gotten around to changing his name legally (or maybe parents threatened to pull financial support if he changed it), and the official arrest announcement is using his legal name. permalink parent award report block reply KungPaoMcChicken 3 points 6 days ago Fair enough. I just didn't wish to make assumptions. permalink parent award report block reply view 7 more comments... NomadicKrow2 2 points 6 days ago Mr. and Mrs. Pham? What did you want to name your bundle of joy? \"Justaguy Pham.\" permalink parent award report block reply CruzControl 1 points 6 days ago Iowa corn does that to people. permalink parent award report block reply Patrick_Bateman 2 points 6 days ago Excuse me, but I think the correct pronouns are in/mate. permalink parent award report block reply EndTheFedEndTheSlvry 1 points 6 days ago It. permalink parent award report block reply\nDeplora 17 points 6 days ago Hard to tell.  Either it's doing an exceptionally lousy job at \"transitioning\" or its parents messed up badly when naming it. permalink parent award report block reply asdrubael_was_right 10 points 6 days ago The baggy clothes on a warm fall day says ashamed of her body. That’s a chick thing. M2F show off their bolt on tits. permalink parent award report block reply KungPaoMcChicken 4 points 6 days ago Name looks semi Vietnamese. Possible the parents were going for Justine but can't spell correctly. permalink parent award report block reply Deplora 3 points 6 days ago This 2012 obituary for his grandmother lists him as one of her \"three grandsons\". So unless he was already playing the transgender game when he was around 6 years old, he's actually a \"he\" whose parents named him Justin. https://www.legacy.com/us/obituaries/desmoinesregister/name/retha-calhoon-obituary?id=8804690 If he's pretending to be a \"she\" now, he may just not have gotten around to changing his name legally (or maybe parents threatened to pull financial support if he changed it), and the official arrest announcement is using his legal name. permalink parent award report block reply KungPaoMcChicken 3 points 6 days ago Fair enough. I just didn't wish to make assumptions. permalink parent award report block reply view 7 more comments... NomadicKrow2 2 points 6 days ago Mr. and Mrs. Pham? What did you want to name your bundle of joy? \"Justaguy Pham.\" permalink parent award report block reply CruzControl 1 points 6 days ago Iowa corn does that to people. permalink parent award report block reply\nasdrubael_was_right 10 points 6 days ago The baggy clothes on a warm fall day says ashamed of her body. That’s a chick thing. M2F show off their bolt on tits. permalink parent award report block reply\nKungPaoMcChicken 4 points 6 days ago Name looks semi Vietnamese. Possible the parents were going for Justine but can't spell correctly. permalink parent award report block reply Deplora 3 points 6 days ago This 2012 obituary for his grandmother lists him as one of her \"three grandsons\". So unless he was already playing the transgender game when he was around 6 years old, he's actually a \"he\" whose parents named him Justin. https://www.legacy.com/us/obituaries/desmoinesregister/name/retha-calhoon-obituary?id=8804690 If he's pretending to be a \"she\" now, he may just not have gotten around to changing his name legally (or maybe parents threatened to pull financial support if he changed it), and the official arrest announcement is using his legal name. permalink parent award report block reply KungPaoMcChicken 3 points 6 days ago Fair enough. I just didn't wish to make assumptions. permalink parent award report block reply view 7 more comments...\nDeplora 3 points 6 days ago This 2012 obituary for his grandmother lists him as one of her \"three grandsons\". So unless he was already playing the transgender game when he was around 6 years old, he's actually a \"he\" whose parents named him Justin. https://www.legacy.com/us/obituaries/desmoinesregister/name/retha-calhoon-obituary?id=8804690 If he's pretending to be a \"she\" now, he may just not have gotten around to changing his name legally (or maybe parents threatened to pull financial support if he changed it), and the official arrest announcement is using his legal name. permalink parent award report block reply KungPaoMcChicken 3 points 6 days ago Fair enough. I just didn't wish to make assumptions. permalink parent award report block reply view 7 more comments...\nKungPaoMcChicken 3 points 6 days ago Fair enough. I just didn't wish to make assumptions. permalink parent award report block reply view 7 more comments...\nNomadicKrow2 2 points 6 days ago Mr. and Mrs. Pham? What did you want to name your bundle of joy? \"Justaguy Pham.\" permalink parent award report block reply\nCruzControl 1 points 6 days ago Iowa corn does that to people. permalink parent award report block reply\nPatrick_Bateman 2 points 6 days ago Excuse me, but I think the correct pronouns are in/mate. permalink parent award report block reply\nEndTheFedEndTheSlvry 1 points 6 days ago It. permalink parent award report block reply\nBeelzy 18 points 6 days ago That's a Man, Baby! permalink award report block reply STONKATRUCK 8 points 6 days ago It's a woman trying to be him. So no it's a woman permalink parent award report block reply FrankDuncan 1 points 6 days ago A woMAN. permalink parent award report block reply\nSTONKATRUCK 8 points 6 days ago It's a woman trying to be him. So no it's a woman permalink parent award report block reply FrankDuncan 1 points 6 days ago A woMAN. permalink parent award report block reply\nFrankDuncan 1 points 6 days ago A woMAN. permalink parent award report block reply\nthelastlast 9 points 6 days ago oohhhh it was a tranny.  ok that makes sense. permalink award report block reply\nCanadianMeathead 8 points 6 days ago Him permalink award report block reply\nmaga_espada 6 points 6 days ago People don’t seem to get arrests mean nothing. Convictions is what is needed. Actual prison time or financial restitutions. An arrest without convictions just bolsters his rep with the crazies. permalink award report block reply Spiritof2015 3 points 6 days ago Good way to get kicked out of school though. permalink parent award report block reply\nSpiritof2015 3 points 6 days ago Good way to get kicked out of school though. permalink parent award report block reply\nColonelKlink 5 points 6 days ago Deport the creature. permalink award report block reply\ndeleted 4 points 6 days ago ianpatrick1966 4 points 6 days ago Iowa is not a castle doctrine state, you will get arrested for self defense, trust me -- I have twice. I'm not saying to not do it, just saying, be ready.  I've defended myself many more than 2 times, but the rest of those times I was masked and in all black. permalink parent award report block reply sixfingerdildo 2 points 6 days ago until The State is liberated from the leftists... these tabling efforts are cute, but conversation is over and The State is the real enemy. permalink parent award report block reply\nianpatrick1966 4 points 6 days ago Iowa is not a castle doctrine state, you will get arrested for self defense, trust me -- I have twice. I'm not saying to not do it, just saying, be ready.  I've defended myself many more than 2 times, but the rest of those times I was masked and in all black. permalink parent award report block reply\nsixfingerdildo 2 points 6 days ago until The State is liberated from the leftists... these tabling efforts are cute, but conversation is over and The State is the real enemy. permalink parent award report block reply\nForceMultiplier 4 points 6 days ago 19-year-old Justin Pham Calhoon was originally charged in connection with the Nov. 5 incident, but records now show an earlier case from Oct. 27, 2025, also filed by the University of Iowa Department of Public Safety. permalink award report block reply FrankDuncan 1 points 6 days ago They call it a he.. so it's probably not permalink parent award report block reply\nFrankDuncan 1 points 6 days ago They call it a he.. so it's probably not permalink parent award report block reply\nauntjemima 3 points 6 days ago wtf is that thing? permalink award report block reply\nKiekhaeferSoldier 3 points 6 days ago Benny Johnson's alma mater...  Univ of Iowa, Iowa City, Johnson County.  The ONLY county in Iowa that voted Nicki Haley in the 2023 GOP Presidential primary because leftist lunatics like that girl? were able to change parties for a day and go vote 'against Donald Trump' and they did it enmasse. permalink award report block reply\nme-no-likely3 3 points 6 days ago Omg, another delusional and violent TRANNY RETARD. permalink award report block reply\nPatPede1 3 points 6 days ago Deserves academic punishment.  Perhaps a semester banned from campus, community service helping students set up their tables in the commons, complete an anger management class, and submit a handwritten essay of no less than 5,000 words on the topic of free speech and the first amendment. permalink award report block reply\nNothinberder 2 points 6 days ago Made him Phamous! permalink award report block reply DarthEP 1 points 6 days ago \"Her/She Has Offended The Phamily, And The Shaolin Temple.\" permalink parent award report block reply\nDarthEP 1 points 6 days ago \"Her/She Has Offended The Phamily, And The Shaolin Temple.\" permalink parent award report block reply\nFrankDuncan 1 points 6 days ago Why you no let me go? permalink award report block reply\nMAG-n-KAG 1 points 6 days ago these fucking freaks have long outstayed their welcome. permalink award report block reply\ny_do_i_need_to_hide 1 points 6 days ago Cool. I still expect verifiable tabulation permalink award report block reply\nJoeMcCarthyWasRight 1 points 6 days ago This isn’t about “spewing hate” or whatever gay shit these freaks go on about. It’s about ending their little pedo party. You’re not celebrated anymore. America is done with you. Go back into the closet or we’re bringing gay bashing back. permalink award report block reply\nUncleTrumpsBand 1 points 6 days ago Get triggered lol permalink award report block reply\nCounterwhat 1 points 6 days ago Kick him out of the school. Stop any grants or scholarships. permalink award report block reply\nlifeisahologram 1 points 6 days ago Honestly we should all start doing these events, not even with the primary focus of providing information to interested people, but rather the primary focus should be making such triggering tables that we can “entrap” these retards to cause damage to get them all arrested 🤣 permalink award report block reply\nThe_RedWolf 1 points 6 days ago Screenshot of his TWO arrest records in under 10 days: https://ibb.co/hx3xHHQ2 If you search his name, youll find 3 cases, but the other is just a 'Failure to yield' traffic ticket from 2024. source: https://www.iowacourts.state.ia.us/ESAWebApp/TrialSimpFrame permalink award report block reply",
  "fetched_at": "2025-11-12T23:15:43.898658Z"
}