{
  "id": "1ARK9irmGO",
  "url": "https://patriots.win/p/1ARK9irmGO/sit-this-one-out/c",
  "content": "395 Sit this one out. posted 2 days ago by Spacemonkey 11 comments award share download report block\n11 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style ColonelKlink 8 points 2 days ago She had no chance as the one surviving child of hillary clinton. Bunch of criminals. permalink award report block reply TEXinLA 7 points 2 days ago Don't forget the Haitian money stolen to fund her wedding. permalink award report block reply Spacemonkey OP 6 points 2 days ago Nor all the underage Haitian girls stolen by the clinton foundation to be sold to the highest bidder. permalink parent award report block reply TEXinLA 1 points 1 day ago BINGO permalink parent award report block reply Trooph-Hurts 4 points 2 days ago I so hope she goes to jail for stealing funds from the govt permalink award report block reply npc_1234 3 points 2 days ago \"W\" What are statements not possible to type in the White House in January of 2001 for $500, Alex! permalink award report block reply Greenhills 3 points 2 days ago She picks the worst topics to comment on. permalink award report block reply schiff_for_brains 3 points 2 days ago They also tried to steal the chy-na permalink award report block reply bill_in_texas 2 points 2 days ago Maybe now you regret tearing down our statues, Chelsea?  How does it feel to have something you liked torn down?  I hope it was personal for you. permalink award report block reply brassmule 1 points 1 day ago Bill was banging Walter Mondale's daughter at the same time, too. permalink award report block reply TrumpMagaNoBama 1 points 2 days ago STFU Grifting Commie Bitch! permalink award report block reply\nColonelKlink 8 points 2 days ago She had no chance as the one surviving child of hillary clinton. Bunch of criminals. permalink award report block reply\nTEXinLA 7 points 2 days ago Don't forget the Haitian money stolen to fund her wedding. permalink award report block reply Spacemonkey OP 6 points 2 days ago Nor all the underage Haitian girls stolen by the clinton foundation to be sold to the highest bidder. permalink parent award report block reply TEXinLA 1 points 1 day ago BINGO permalink parent award report block reply\nSpacemonkey OP 6 points 2 days ago Nor all the underage Haitian girls stolen by the clinton foundation to be sold to the highest bidder. permalink parent award report block reply TEXinLA 1 points 1 day ago BINGO permalink parent award report block reply\nTEXinLA 1 points 1 day ago BINGO permalink parent award report block reply\nTrooph-Hurts 4 points 2 days ago I so hope she goes to jail for stealing funds from the govt permalink award report block reply\nnpc_1234 3 points 2 days ago \"W\" What are statements not possible to type in the White House in January of 2001 for $500, Alex! permalink award report block reply\nGreenhills 3 points 2 days ago She picks the worst topics to comment on. permalink award report block reply\nschiff_for_brains 3 points 2 days ago They also tried to steal the chy-na permalink award report block reply\nbill_in_texas 2 points 2 days ago Maybe now you regret tearing down our statues, Chelsea?  How does it feel to have something you liked torn down?  I hope it was personal for you. permalink award report block reply\nbrassmule 1 points 1 day ago Bill was banging Walter Mondale's daughter at the same time, too. permalink award report block reply\nTrumpMagaNoBama 1 points 2 days ago STFU Grifting Commie Bitch! permalink award report block reply",
  "fetched_at": "2025-11-12T22:47:45.528543Z"
}