{
  "id": "1ARK55cGGI",
  "url": "https://patriots.win/p/1ARK55cGGI/the-united-states-senate-should-/c",
  "content": "266 The United States Senate should not leave town until they have a Deal to end the Democrat Shutdown. If they can’t reach a Deal, the Republicans should terminate the Filibuster, IMMEDIATELY, and take care of our Great American Workers! TRUMP  TRUTH posted 5 days ago by I-am-Orlando PRO 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save Counterwhat 8 points 5 days ago Bingo. Don't give in. Open the government yourselves. Pass the MAGA agenda. Pass the MAGA budget. End the bullshit. They hate us anyways. They want us dead anyway. They want your kids raped and your wife to watch your kids die in their arms (Jay Jones). permalink award report block reply presticus 7 points 5 days ago Filibuster is likely not going anywhere. If it went away Republicans would actually have to do thier job without the excuse of \"we cant get any Democrats to agree.\" permalink award report block reply _Sully_ 5 points 5 days ago They wouldn’t be Republicans if that’s what they want to do. Too many sweats to actually work for the American people. permalink parent award report block reply Ronaldus 3 points 5 days ago Dirty little secret: No one  is filibustering. A filibuster means that someone is standing up and talking and won't stop talking. There is no actual filibuster. The problem we have is that a filibuster doesn't require a filibuster anymore. And how did that happen? Because WE ARE STUPID and fall for it. There is no filibuster to end. But both sides don't want to admit that they don't require one another to actually filibuster to filibuster anymore. permalink award report block reply IncredibleMrE1 3 points 5 days ago Somehow if they try to leave, their flights won't be canceled. permalink award report block reply I-am-Orlando OP PRO 3 points 5 days ago Link https://truthsocial.com/@realDonaldTrump/115510485436664476 permalink award report block reply Idontevenknow 3 points 5 days ago Terminate the DoE, ATF, and EPA. See how quickly they vote to open. permalink award report block reply\nCounterwhat 8 points 5 days ago Bingo. Don't give in. Open the government yourselves. Pass the MAGA agenda. Pass the MAGA budget. End the bullshit. They hate us anyways. They want us dead anyway. They want your kids raped and your wife to watch your kids die in their arms (Jay Jones). permalink award report block reply\npresticus 7 points 5 days ago Filibuster is likely not going anywhere. If it went away Republicans would actually have to do thier job without the excuse of \"we cant get any Democrats to agree.\" permalink award report block reply _Sully_ 5 points 5 days ago They wouldn’t be Republicans if that’s what they want to do. Too many sweats to actually work for the American people. permalink parent award report block reply\n_Sully_ 5 points 5 days ago They wouldn’t be Republicans if that’s what they want to do. Too many sweats to actually work for the American people. permalink parent award report block reply\nRonaldus 3 points 5 days ago Dirty little secret: No one  is filibustering. A filibuster means that someone is standing up and talking and won't stop talking. There is no actual filibuster. The problem we have is that a filibuster doesn't require a filibuster anymore. And how did that happen? Because WE ARE STUPID and fall for it. There is no filibuster to end. But both sides don't want to admit that they don't require one another to actually filibuster to filibuster anymore. permalink award report block reply\nIncredibleMrE1 3 points 5 days ago Somehow if they try to leave, their flights won't be canceled. permalink award report block reply\nI-am-Orlando OP PRO 3 points 5 days ago Link https://truthsocial.com/@realDonaldTrump/115510485436664476 permalink award report block reply\nIdontevenknow 3 points 5 days ago Terminate the DoE, ATF, and EPA. See how quickly they vote to open. permalink award report block reply",
  "fetched_at": "2025-11-12T21:03:47.962624Z"
}