{
  "id": "8169202",
  "title": "1525DRIVE-BY MEDIA: Why isn't the media playing Zohran Mamdani's Nazi salute on repeat as they did w",
  "url": "https://patriots.win/p/1ARK0UbLNK/driveby-media-why-isnt-the-media/c",
  "content": "1525 DRIVE-BY MEDIA: Why isn't the media playing Zohran Mamdani's Nazi salute on repeat as they did with Elon Musk? Why the double standard? posted 7 days ago by SweetBeef 79 comments award share report block @amuse @amuse • 7d DRIVE-BY MEDIA: Why isn't the media playing Zohran Mamdani's Nazi salute on repeat as they did with Elon Musk? Why the double standard? h/t @AB84\n79 comments Sort by Top Top New Worst Old Save ElectronicSlurm69 75 points 7 days ago Because if they didn't have double standards they'd have no standards at all. permalink award report block reply BlackPilledMAGA 13 points 7 days ago Why don't we treat them the same way. Take the gloves off and throw out the rule book. A communist Muslim was just elected Mayor of NY by a bunch of third world freeloaders who want to use democracy to enslave the working class to pay their way forever. It's time to put away all shame, there is no high road left to take. permalink parent award report block reply guywholikesDjtof2024 4 points 7 days ago a leftist transgender shot the high road full of holes, and a blm rioter burnt it. permalink parent award report block reply Hanging_Chad 2 points 7 days ago which is worse? permalink parent award report block reply sully 1 points 7 days ago Double standards is like twice as many standards you xenobigot permalink parent award report block reply chargebeck23 -8 points 7 days ago If you have to cut the video at under two seconds to make it look like he's actually doing it then this isn't a terribly effective point. Also the roman salute kinda hits harder when it's from a white south african guy with an obsessive love of far right politics rather than a brown skinned muslim commie permalink parent award report block reply Wtf_socialismreally 8 points 7 days ago So, the same thing you did with Elon? And no, it absolutely does not hit harder than an Islamist when Islamists explicitly want to kill Jews today . You poor stupid bastard, your brain went in backwards when you were born. permalink parent award report block reply chargebeck23 -7 points 7 days ago Well yeah except when you watch the clip of Elon doing it there is absolutely no doubt as to what he's doing. You can even see his gayass little grin that he gets when he thinks he's doing something really edgy permalink parent award report block reply Wtf_socialismreally 4 points 7 days ago Oh, \"my heart goes out to you\" doesn't give you doubt to your retarded biases? Of course not, because you're FUCKING STUPID . You are literally braindead, you should actually kill yourself and save the world from your idiocy. Like I'm sorry mods, but this leftist Redditor really should run along and 41% himself. He has nothing to offer the planet. permalink parent award report block reply view 1 more comments... keeman 2 points 7 days ago The Roman salute requires a symbol of state for your arm to be pointed at.  So Musk and Mamdani version are both fake and ghey. permalink parent award report block reply AnonymousFrog 0 points 7 days ago YeH, he’s just waving here. Elon was trying to be an edgelord, but just came off as a sperg. permalink parent award report block reply Tookens 27 points 7 days ago Because they are presstitutes? permalink award report block reply drmrboy 19 points 7 days ago Why isn't the media asking why young Soros was funding him?  🤓 permalink award report block reply seattlerunner 13 points 7 days ago It’s (D)ifferent! permalink award report block reply Krat 11 points 7 days ago 0 arrests still permalink award report block reply Aggrieved03 3 points 7 days ago Why it continues. permalink parent award report block reply jiminycricket1941 11 points 7 days ago War is the only way out of this. It was never going to be fixed by voting. But it’ll never happen so best to learn Arabic. Only silver lining is we’ll be able to beat women for being whorish cunts. permalink award report block reply FrankDuncan 5 points 7 days ago WRONG!!! We also get to throw faggots off tall buildings!! permalink parent award report block reply goldkeyboardwarrior 10 points 7 days ago Because the media knows Elon wasn’t doing a Nazi salute. But they knew a bunch of stupid people who each get a vote would believe them when they said he was. Take “Romney didn’t win, did he?” and replace Romney with any other GOP candidate when Dems justify lying to win. permalink award report block reply Remember_the_Alamo -2 points 7 days ago What was he doing? permalink parent award report block reply tralbolh 2 points 6 days ago Saying \"my heart goes out to you\" and reaching to the crowd. permalink parent award report block reply chargebeck23 -4 points 7 days ago If he wasn't doing a nazi salute then it was a pretty dumb idea to do something that looks exactly like a nazi salute. Twice. permalink parent award report block reply rebuildingMyself 2 points 6 days ago It wasn't a nazi salute and if you have any doubt about that then the brainwashing is working on you permalink parent award report block reply Ligersrule1 9 points 7 days ago This is (d)ifferent permalink award report block reply SweetBeef OP 8 points 7 days ago https://x.com/amuse/status/1986211435236544700 permalink award report block reply LegendFang 8 points 7 days ago Gee, I wonder. permalink award report block reply Lady_MaGa 7 points 7 days ago He's brown.  Not white. permalink award report block reply LibertyStillMatters 7 points 7 days ago A yes, pointing out media hypocrisy.  Is there anything more masturbatory? They don’t care.  They literally just elected an AG that’s wants people who don’t vote like him/conservatives dead.  Just read his text messages permalink award report block reply JBlaze056 5 points 7 days ago If people are still asking why the media is biased then we still have a long way to go until we get a proper system in place. permalink award report block reply Trump454748 5 points 7 days ago The same media that accused Elon of being a Nazi looks the other way when a Democrat running for Senate has a Schutzstaffel Death’s Head tattoo on his chest. permalink award report block reply TheRPatriot 4 points 7 days ago Omg….. WHO FUCKING CARES. Enough with the identity politics bull shit. Enough of the “SEE! It’s actually them!!”” Bull shit. We are LOSING, and people are becoming demoralized. Focus on the shit that actually matters permalink award report block reply GravityBounce1976 6 points 7 days ago It's so childish.  While Marxists are out winning elections, we're whining about the media and making memes. permalink parent award report block reply Kingofkek 4 points 7 days ago This doesn’t even look like it. Elons looked like it, but when you watch the whole clip you can tell he’s just a weird guy. permalink award report block reply Trump454748 1 points 7 days ago Wait, so Elon lS a Nazi? It’s hard for me to keep up on current events. permalink parent award report block reply TrumpsBigBalls 2 points 7 days ago No but his body movement resembled that of a Nazi solute because Elon was so rigid when he did it. Rigidity does not make him a Nazi it makes him weird. permalink parent award report block reply Trump454748 3 points 7 days ago Okay, so NOT a Nazi. Thank you for the clarification. permalink parent award report block reply modded 4 points 7 days ago We are at war and one side just posts snarky messages on twitter. permalink award report block reply learntocode 3 points 7 days ago In 1996 congress passed, and Bill Clinton signed, the Telecommunications Actof 1996. The law repealed all sorts of ownership restrictions on media companies - and we have seen the results ever since. The cable internet corporation owns the cell phone, the newspapers, the magazines, the book publishing, the radio station, the TV station, the movie studios, the video game company - literally everything is owned by corporations, that are themselves owned by corporations, that are themselves owned by large pools of hedge fund and retirement fund money - very very important companies in the public life of a nation, controlled by very few people. The deregulation that happened in 1996 with the Telecommuncations Act really set the stage for the horrific trash we call \"media\" these days. Add on top of that the disastrous repeal of Glass-Steagall (restrictions on commercial banks getting involved in retail bakning) - and you have Money Power just laying waste to this country. Why, it is almost like it was done on purpose! permalink award report block reply MR__K 2 points 6 days ago This is the puzzle piece i feel most people are missing. We have all these Monopolys now and we used to destroy Monopolys permalink parent award report block reply TPMJB 3 points 7 days ago Because Republicans actually care about optics. That's why one would go on the air, after her husband was murdered in broad daylight, and talk about how she \"forgave\" the murderer. Suicidal empathy. Democrats don't give a shit about optics. We shouldn't either. Let the RINOs live out the rest of their lifespans with their shitty ideals. It's our turn now. permalink award report block reply guywholikesDjtof2024 1 points 7 days ago demos don't care about Then how did Trump win? permalink parent award report block reply knnbccb 3 points 7 days ago Because they are not journalists, and he's the same team as them. permalink award report block reply ragnarokrobo 3 points 7 days ago Who cares permalink award report block reply MakeAmericaVapeAgain 2 points 7 days ago i know a few idiots who believed the elon nazi salute shit, like wholeheartedly believed it. i showed them this and they called it a cherry picked moment. so weird how they selectively believe things and deny others permalink award report block reply 2016TrumpMAGA 2 points 7 days ago To every pro-immigration jew in NY:  You just got what you deserve. permalink award report block reply redditadminssuckit 2 points 7 days ago Oy have nose idea why.  Do joo? permalink award report block reply SomecatsareMAGA 2 points 7 days ago Because they are the democrat party press corps. permalink award report block reply ParticleCannon 2 points 7 days ago Isn't that a cleansing gesture?  They do it when shaking hands with an infidel.  What sin did he just commit? permalink award report block reply Thatunknownguy 2 points 7 days ago Have you imagined if the roles were reversed yet? permalink award report block reply HankScorpio 2 points 7 days ago The hand extended is a nationalist salute used long before the nazis even existed. The counter to the nationalist salute is the closed fist internationalist salute (BLM). There is no such thing as \"the nazi salute\". permalink award report block reply Than0sIII 2 points 7 days ago Because they don't actually care.  They just wanted enough people to think Elon was a Nazi to hurt X.  Which is why you have subreddits that banned X links and \"journalist\" sites that only use bluesky whenever possible. permalink award report block reply Emanresu99 2 points 7 days ago Because they are not affraid that they'll ever suffer any consequences what so ever. Either professionally, or personally. permalink award report block reply FlushFive 2 points 7 days ago Because Elons was way better. permalink award report block reply DITTOPatriot 2 points 7 days ago I've never seen the zionist this mad. permalink award report block reply WeaponizedSmirk 1 points 7 days ago Because they don't fucking care. Stop acting like there's some 3rd partyu observer that's gonna step in and say, \"Yeah, the democrats are hypocrites and liars\" like that will convince their supporters. They don't fucking care. permalink award report block reply LORDFALCONE 1 points 7 days ago Elon had better form permalink award report block reply learntocode 1 points 7 days ago They play what their owners want. permalink award report block reply TheironToaster 1 points 7 days ago Its \"D\"ifferent permalink award report block reply Mhmm2MoreWeeks 1 points 6 days ago Because the media is a CIA/CHINESE/GLOBALIST operation. And if you are still asking, the answer won't matter at this time as you are to slow to keep up with the last 10 years+. permalink award report block reply donkeyKang 1 points 7 days ago They just answered their own question. permalink award report block reply JoeBidensDementia1 1 points 7 days ago We know why. permalink award report block reply medicpatriot 1 points 7 days ago Who cares? permalink award report block reply Overtaxed 1 points 7 days ago The left doesn't care about \"gotcha\". permalink award report block reply bejeavis 1 points 7 days ago Stop asking stupid questions. permalink award report block reply RizzlieDoodad 1 points 7 days ago No one cared when Elon did it. The media was outraged. But if you talked to regular people, they didn't care permalink award report block reply Carbum 1 points 7 days ago Cuz he was put there by jews, not nazis permalink award report block reply BOLTS4U 1 points 7 days ago Elon literally did the salute violently he meant to do it lol cmon now. even if it was a troll he knew what he was doing permalink award report block reply Psarg 1 points 7 days ago Why pretend they're being sincere? permalink award report block reply Rydanovich 1 points 7 days ago You know why. permalink award report block reply ColonelKlink 1 points 7 days ago The media is the propaganda arm of the communist democrat party. That's why. permalink award report block reply MAGASquatch 1 points 7 days ago It's (D)ifferent.\" - every Libtard permalink award report block reply Agent_Orange 1 points 7 days ago Cuomo has to feel like shit (as well he should) for being beaten by a guy who just became a citizen 7 years ago. How much do you have to screw up your political career to let that happen? permalink award report block reply BeBest 0 points 7 days ago Because MAGA calls Elon’s gesture a Nazi salute, duh permalink award report block reply FrankDuncan 0 points 7 days ago Are you kidding?  They'll fellate him and eat his ass for the next three years permalink award report block reply KungPaoMcChicken 0 points 7 days ago Elon did it cos he's autistic... permalink award report block reply Shinydenim -1 points 6 days ago What? This is gay. This is the most benign wave to he crowd. Doesn’t even resemble a salute. Don’t be this gay. It makes you guys look like homos permalink award report block reply infinitysupreme -1 points 7 days ago Muslims love Nazis.   Mein Kampf is a perennial best seller in some Islamic lands permalink award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nElectronicSlurm69 75 points 7 days ago Because if they didn't have double standards they'd have no standards at all. permalink award report block reply BlackPilledMAGA 13 points 7 days ago Why don't we treat them the same way. Take the gloves off and throw out the rule book. A communist Muslim was just elected Mayor of NY by a bunch of third world freeloaders who want to use democracy to enslave the working class to pay their way forever. It's time to put away all shame, there is no high road left to take. permalink parent award report block reply guywholikesDjtof2024 4 points 7 days ago a leftist transgender shot the high road full of holes, and a blm rioter burnt it. permalink parent award report block reply Hanging_Chad 2 points 7 days ago which is worse? permalink parent award report block reply sully 1 points 7 days ago Double standards is like twice as many standards you xenobigot permalink parent award report block reply chargebeck23 -8 points 7 days ago If you have to cut the video at under two seconds to make it look like he's actually doing it then this isn't a terribly effective point. Also the roman salute kinda hits harder when it's from a white south african guy with an obsessive love of far right politics rather than a brown skinned muslim commie permalink parent award report block reply Wtf_socialismreally 8 points 7 days ago So, the same thing you did with Elon? And no, it absolutely does not hit harder than an Islamist when Islamists explicitly want to kill Jews today . You poor stupid bastard, your brain went in backwards when you were born. permalink parent award report block reply chargebeck23 -7 points 7 days ago Well yeah except when you watch the clip of Elon doing it there is absolutely no doubt as to what he's doing. You can even see his gayass little grin that he gets when he thinks he's doing something really edgy permalink parent award report block reply Wtf_socialismreally 4 points 7 days ago Oh, \"my heart goes out to you\" doesn't give you doubt to your retarded biases? Of course not, because you're FUCKING STUPID . You are literally braindead, you should actually kill yourself and save the world from your idiocy. Like I'm sorry mods, but this leftist Redditor really should run along and 41% himself. He has nothing to offer the planet. permalink parent award report block reply view 1 more comments... keeman 2 points 7 days ago The Roman salute requires a symbol of state for your arm to be pointed at.  So Musk and Mamdani version are both fake and ghey. permalink parent award report block reply AnonymousFrog 0 points 7 days ago YeH, he’s just waving here. Elon was trying to be an edgelord, but just came off as a sperg. permalink parent award report block reply\nBlackPilledMAGA 13 points 7 days ago Why don't we treat them the same way. Take the gloves off and throw out the rule book. A communist Muslim was just elected Mayor of NY by a bunch of third world freeloaders who want to use democracy to enslave the working class to pay their way forever. It's time to put away all shame, there is no high road left to take. permalink parent award report block reply guywholikesDjtof2024 4 points 7 days ago a leftist transgender shot the high road full of holes, and a blm rioter burnt it. permalink parent award report block reply\nguywholikesDjtof2024 4 points 7 days ago a leftist transgender shot the high road full of holes, and a blm rioter burnt it. permalink parent award report block reply\nHanging_Chad 2 points 7 days ago which is worse? permalink parent award report block reply\nsully 1 points 7 days ago Double standards is like twice as many standards you xenobigot permalink parent award report block reply\nchargebeck23 -8 points 7 days ago If you have to cut the video at under two seconds to make it look like he's actually doing it then this isn't a terribly effective point. Also the roman salute kinda hits harder when it's from a white south african guy with an obsessive love of far right politics rather than a brown skinned muslim commie permalink parent award report block reply Wtf_socialismreally 8 points 7 days ago So, the same thing you did with Elon? And no, it absolutely does not hit harder than an Islamist when Islamists explicitly want to kill Jews today . You poor stupid bastard, your brain went in backwards when you were born. permalink parent award report block reply chargebeck23 -7 points 7 days ago Well yeah except when you watch the clip of Elon doing it there is absolutely no doubt as to what he's doing. You can even see his gayass little grin that he gets when he thinks he's doing something really edgy permalink parent award report block reply Wtf_socialismreally 4 points 7 days ago Oh, \"my heart goes out to you\" doesn't give you doubt to your retarded biases? Of course not, because you're FUCKING STUPID . You are literally braindead, you should actually kill yourself and save the world from your idiocy. Like I'm sorry mods, but this leftist Redditor really should run along and 41% himself. He has nothing to offer the planet. permalink parent award report block reply view 1 more comments... keeman 2 points 7 days ago The Roman salute requires a symbol of state for your arm to be pointed at.  So Musk and Mamdani version are both fake and ghey. permalink parent award report block reply AnonymousFrog 0 points 7 days ago YeH, he’s just waving here. Elon was trying to be an edgelord, but just came off as a sperg. permalink parent award report block reply\nWtf_socialismreally 8 points 7 days ago So, the same thing you did with Elon? And no, it absolutely does not hit harder than an Islamist when Islamists explicitly want to kill Jews today . You poor stupid bastard, your brain went in backwards when you were born. permalink parent award report block reply chargebeck23 -7 points 7 days ago Well yeah except when you watch the clip of Elon doing it there is absolutely no doubt as to what he's doing. You can even see his gayass little grin that he gets when he thinks he's doing something really edgy permalink parent award report block reply Wtf_socialismreally 4 points 7 days ago Oh, \"my heart goes out to you\" doesn't give you doubt to your retarded biases? Of course not, because you're FUCKING STUPID . You are literally braindead, you should actually kill yourself and save the world from your idiocy. Like I'm sorry mods, but this leftist Redditor really should run along and 41% himself. He has nothing to offer the planet. permalink parent award report block reply view 1 more comments...\nchargebeck23 -7 points 7 days ago Well yeah except when you watch the clip of Elon doing it there is absolutely no doubt as to what he's doing. You can even see his gayass little grin that he gets when he thinks he's doing something really edgy permalink parent award report block reply Wtf_socialismreally 4 points 7 days ago Oh, \"my heart goes out to you\" doesn't give you doubt to your retarded biases? Of course not, because you're FUCKING STUPID . You are literally braindead, you should actually kill yourself and save the world from your idiocy. Like I'm sorry mods, but this leftist Redditor really should run along and 41% himself. He has nothing to offer the planet. permalink parent award report block reply view 1 more comments...\nWtf_socialismreally 4 points 7 days ago Oh, \"my heart goes out to you\" doesn't give you doubt to your retarded biases? Of course not, because you're FUCKING STUPID . You are literally braindead, you should actually kill yourself and save the world from your idiocy. Like I'm sorry mods, but this leftist Redditor really should run along and 41% himself. He has nothing to offer the planet. permalink parent award report block reply view 1 more comments...\nkeeman 2 points 7 days ago The Roman salute requires a symbol of state for your arm to be pointed at.  So Musk and Mamdani version are both fake and ghey. permalink parent award report block reply\nAnonymousFrog 0 points 7 days ago YeH, he’s just waving here. Elon was trying to be an edgelord, but just came off as a sperg. permalink parent award report block reply\nTookens 27 points 7 days ago Because they are presstitutes? permalink award report block reply\ndrmrboy 19 points 7 days ago Why isn't the media asking why young Soros was funding him?  🤓 permalink award report block reply\nseattlerunner 13 points 7 days ago It’s (D)ifferent! permalink award report block reply\nKrat 11 points 7 days ago 0 arrests still permalink award report block reply Aggrieved03 3 points 7 days ago Why it continues. permalink parent award report block reply\nAggrieved03 3 points 7 days ago Why it continues. permalink parent award report block reply\njiminycricket1941 11 points 7 days ago War is the only way out of this. It was never going to be fixed by voting. But it’ll never happen so best to learn Arabic. Only silver lining is we’ll be able to beat women for being whorish cunts. permalink award report block reply FrankDuncan 5 points 7 days ago WRONG!!! We also get to throw faggots off tall buildings!! permalink parent award report block reply\nFrankDuncan 5 points 7 days ago WRONG!!! We also get to throw faggots off tall buildings!! permalink parent award report block reply\ngoldkeyboardwarrior 10 points 7 days ago Because the media knows Elon wasn’t doing a Nazi salute. But they knew a bunch of stupid people who each get a vote would believe them when they said he was. Take “Romney didn’t win, did he?” and replace Romney with any other GOP candidate when Dems justify lying to win. permalink award report block reply Remember_the_Alamo -2 points 7 days ago What was he doing? permalink parent award report block reply tralbolh 2 points 6 days ago Saying \"my heart goes out to you\" and reaching to the crowd. permalink parent award report block reply chargebeck23 -4 points 7 days ago If he wasn't doing a nazi salute then it was a pretty dumb idea to do something that looks exactly like a nazi salute. Twice. permalink parent award report block reply rebuildingMyself 2 points 6 days ago It wasn't a nazi salute and if you have any doubt about that then the brainwashing is working on you permalink parent award report block reply\nRemember_the_Alamo -2 points 7 days ago What was he doing? permalink parent award report block reply tralbolh 2 points 6 days ago Saying \"my heart goes out to you\" and reaching to the crowd. permalink parent award report block reply\ntralbolh 2 points 6 days ago Saying \"my heart goes out to you\" and reaching to the crowd. permalink parent award report block reply\nchargebeck23 -4 points 7 days ago If he wasn't doing a nazi salute then it was a pretty dumb idea to do something that looks exactly like a nazi salute. Twice. permalink parent award report block reply rebuildingMyself 2 points 6 days ago It wasn't a nazi salute and if you have any doubt about that then the brainwashing is working on you permalink parent award report block reply\nrebuildingMyself 2 points 6 days ago It wasn't a nazi salute and if you have any doubt about that then the brainwashing is working on you permalink parent award report block reply\nLigersrule1 9 points 7 days ago This is (d)ifferent permalink award report block reply\nSweetBeef OP 8 points 7 days ago https://x.com/amuse/status/1986211435236544700 permalink award report block reply\nLegendFang 8 points 7 days ago Gee, I wonder. permalink award report block reply\nLady_MaGa 7 points 7 days ago He's brown.  Not white. permalink award report block reply\nLibertyStillMatters 7 points 7 days ago A yes, pointing out media hypocrisy.  Is there anything more masturbatory? They don’t care.  They literally just elected an AG that’s wants people who don’t vote like him/conservatives dead.  Just read his text messages permalink award report block reply\nJBlaze056 5 points 7 days ago If people are still asking why the media is biased then we still have a long way to go until we get a proper system in place. permalink award report block reply\nTrump454748 5 points 7 days ago The same media that accused Elon of being a Nazi looks the other way when a Democrat running for Senate has a Schutzstaffel Death’s Head tattoo on his chest. permalink award report block reply\nTheRPatriot 4 points 7 days ago Omg….. WHO FUCKING CARES. Enough with the identity politics bull shit. Enough of the “SEE! It’s actually them!!”” Bull shit. We are LOSING, and people are becoming demoralized. Focus on the shit that actually matters permalink award report block reply GravityBounce1976 6 points 7 days ago It's so childish.  While Marxists are out winning elections, we're whining about the media and making memes. permalink parent award report block reply\nGravityBounce1976 6 points 7 days ago It's so childish.  While Marxists are out winning elections, we're whining about the media and making memes. permalink parent award report block reply\nKingofkek 4 points 7 days ago This doesn’t even look like it. Elons looked like it, but when you watch the whole clip you can tell he’s just a weird guy. permalink award report block reply Trump454748 1 points 7 days ago Wait, so Elon lS a Nazi? It’s hard for me to keep up on current events. permalink parent award report block reply TrumpsBigBalls 2 points 7 days ago No but his body movement resembled that of a Nazi solute because Elon was so rigid when he did it. Rigidity does not make him a Nazi it makes him weird. permalink parent award report block reply Trump454748 3 points 7 days ago Okay, so NOT a Nazi. Thank you for the clarification. permalink parent award report block reply\nTrump454748 1 points 7 days ago Wait, so Elon lS a Nazi? It’s hard for me to keep up on current events. permalink parent award report block reply TrumpsBigBalls 2 points 7 days ago No but his body movement resembled that of a Nazi solute because Elon was so rigid when he did it. Rigidity does not make him a Nazi it makes him weird. permalink parent award report block reply Trump454748 3 points 7 days ago Okay, so NOT a Nazi. Thank you for the clarification. permalink parent award report block reply\nTrumpsBigBalls 2 points 7 days ago No but his body movement resembled that of a Nazi solute because Elon was so rigid when he did it. Rigidity does not make him a Nazi it makes him weird. permalink parent award report block reply Trump454748 3 points 7 days ago Okay, so NOT a Nazi. Thank you for the clarification. permalink parent award report block reply\nTrump454748 3 points 7 days ago Okay, so NOT a Nazi. Thank you for the clarification. permalink parent award report block reply\nmodded 4 points 7 days ago We are at war and one side just posts snarky messages on twitter. permalink award report block reply\nlearntocode 3 points 7 days ago In 1996 congress passed, and Bill Clinton signed, the Telecommunications Actof 1996. The law repealed all sorts of ownership restrictions on media companies - and we have seen the results ever since. The cable internet corporation owns the cell phone, the newspapers, the magazines, the book publishing, the radio station, the TV station, the movie studios, the video game company - literally everything is owned by corporations, that are themselves owned by corporations, that are themselves owned by large pools of hedge fund and retirement fund money - very very important companies in the public life of a nation, controlled by very few people. The deregulation that happened in 1996 with the Telecommuncations Act really set the stage for the horrific trash we call \"media\" these days. Add on top of that the disastrous repeal of Glass-Steagall (restrictions on commercial banks getting involved in retail bakning) - and you have Money Power just laying waste to this country. Why, it is almost like it was done on purpose! permalink award report block reply MR__K 2 points 6 days ago This is the puzzle piece i feel most people are missing. We have all these Monopolys now and we used to destroy Monopolys permalink parent award report block reply\nMR__K 2 points 6 days ago This is the puzzle piece i feel most people are missing. We have all these Monopolys now and we used to destroy Monopolys permalink parent award report block reply\nTPMJB 3 points 7 days ago Because Republicans actually care about optics. That's why one would go on the air, after her husband was murdered in broad daylight, and talk about how she \"forgave\" the murderer. Suicidal empathy. Democrats don't give a shit about optics. We shouldn't either. Let the RINOs live out the rest of their lifespans with their shitty ideals. It's our turn now. permalink award report block reply guywholikesDjtof2024 1 points 7 days ago demos don't care about Then how did Trump win? permalink parent award report block reply\nguywholikesDjtof2024 1 points 7 days ago demos don't care about Then how did Trump win? permalink parent award report block reply\nknnbccb 3 points 7 days ago Because they are not journalists, and he's the same team as them. permalink award report block reply\nragnarokrobo 3 points 7 days ago Who cares permalink award report block reply\nMakeAmericaVapeAgain 2 points 7 days ago i know a few idiots who believed the elon nazi salute shit, like wholeheartedly believed it. i showed them this and they called it a cherry picked moment. so weird how they selectively believe things and deny others permalink award report block reply\n2016TrumpMAGA 2 points 7 days ago To every pro-immigration jew in NY:  You just got what you deserve. permalink award report block reply\nredditadminssuckit 2 points 7 days ago Oy have nose idea why.  Do joo? permalink award report block reply\nSomecatsareMAGA 2 points 7 days ago Because they are the democrat party press corps. permalink award report block reply\nParticleCannon 2 points 7 days ago Isn't that a cleansing gesture?  They do it when shaking hands with an infidel.  What sin did he just commit? permalink award report block reply\nThatunknownguy 2 points 7 days ago Have you imagined if the roles were reversed yet? permalink award report block reply\nHankScorpio 2 points 7 days ago The hand extended is a nationalist salute used long before the nazis even existed. The counter to the nationalist salute is the closed fist internationalist salute (BLM). There is no such thing as \"the nazi salute\". permalink award report block reply\nThan0sIII 2 points 7 days ago Because they don't actually care.  They just wanted enough people to think Elon was a Nazi to hurt X.  Which is why you have subreddits that banned X links and \"journalist\" sites that only use bluesky whenever possible. permalink award report block reply\nEmanresu99 2 points 7 days ago Because they are not affraid that they'll ever suffer any consequences what so ever. Either professionally, or personally. permalink award report block reply\nFlushFive 2 points 7 days ago Because Elons was way better. permalink award report block reply\nDITTOPatriot 2 points 7 days ago I've never seen the zionist this mad. permalink award report block reply\nWeaponizedSmirk 1 points 7 days ago Because they don't fucking care. Stop acting like there's some 3rd partyu observer that's gonna step in and say, \"Yeah, the democrats are hypocrites and liars\" like that will convince their supporters. They don't fucking care. permalink award report block reply\nLORDFALCONE 1 points 7 days ago Elon had better form permalink award report block reply\nlearntocode 1 points 7 days ago They play what their owners want. permalink award report block reply\nTheironToaster 1 points 7 days ago Its \"D\"ifferent permalink award report block reply\nMhmm2MoreWeeks 1 points 6 days ago Because the media is a CIA/CHINESE/GLOBALIST operation. And if you are still asking, the answer won't matter at this time as you are to slow to keep up with the last 10 years+. permalink award report block reply\ndonkeyKang 1 points 7 days ago They just answered their own question. permalink award report block reply\nJoeBidensDementia1 1 points 7 days ago We know why. permalink award report block reply\nmedicpatriot 1 points 7 days ago Who cares? permalink award report block reply\nOvertaxed 1 points 7 days ago The left doesn't care about \"gotcha\". permalink award report block reply\nbejeavis 1 points 7 days ago Stop asking stupid questions. permalink award report block reply\nRizzlieDoodad 1 points 7 days ago No one cared when Elon did it. The media was outraged. But if you talked to regular people, they didn't care permalink award report block reply\nCarbum 1 points 7 days ago Cuz he was put there by jews, not nazis permalink award report block reply\nBOLTS4U 1 points 7 days ago Elon literally did the salute violently he meant to do it lol cmon now. even if it was a troll he knew what he was doing permalink award report block reply\nPsarg 1 points 7 days ago Why pretend they're being sincere? permalink award report block reply\nRydanovich 1 points 7 days ago You know why. permalink award report block reply\nColonelKlink 1 points 7 days ago The media is the propaganda arm of the communist democrat party. That's why. permalink award report block reply\nMAGASquatch 1 points 7 days ago It's (D)ifferent.\" - every Libtard permalink award report block reply\nAgent_Orange 1 points 7 days ago Cuomo has to feel like shit (as well he should) for being beaten by a guy who just became a citizen 7 years ago. How much do you have to screw up your political career to let that happen? permalink award report block reply\nBeBest 0 points 7 days ago Because MAGA calls Elon’s gesture a Nazi salute, duh permalink award report block reply\nFrankDuncan 0 points 7 days ago Are you kidding?  They'll fellate him and eat his ass for the next three years permalink award report block reply\nKungPaoMcChicken 0 points 7 days ago Elon did it cos he's autistic... permalink award report block reply\nShinydenim -1 points 6 days ago What? This is gay. This is the most benign wave to he crowd. Doesn’t even resemble a salute. Don’t be this gay. It makes you guys look like homos permalink award report block reply\ninfinitysupreme -1 points 7 days ago Muslims love Nazis.   Mein Kampf is a perennial best seller in some Islamic lands permalink award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply"
}