{
  "id": "1ARK52BQwR",
  "url": "https://patriots.win/p/1ARK52BQwR/this-is-absolutely-psychotic-rep/c",
  "content": "420 \"This is absolutely psychotic. Republicans had a 7-4 majority now it’s 8-3 for Dems [in Pennsylvania]. What the fuck is happening.\" posted 6 days ago by bleeje 50 comments award share report block VinnyTheBozo @BozoVinny • 8d This is absolutely psychotic. Republicans had a 7-4 majority now it’s 8-3 for Dems. What the fuck is happening. J.J. Abbott @jjabbott • 8d ANOTHER PENNSYLVANIA FLIP: Democrats will control Luzerne County Council, a Trump stronghold\n50 comments Sort by Top Top New Worst Old Save Awakened 53 points 6 days ago This is what happens when you don't fix fraud at home and spend your time trying to save the world. Also, people are pissed. Groceries, rent, home prices, Epstein.  You ain't gonna get people to turn out in this environment and we only beat fraud with massive turnout. permalink award report block reply _Sully_ 3 points 6 days ago Yes, be pissed and show it by voting for the people that put you there. Amazing work. permalink parent award report block reply Awakened 11 points 6 days ago The buck stops here, is a very old phrase and it use to be on a Presidents desk. Forget which one. True or not, that's who gets blamed. People ain't happy. permalink parent award report block reply _Sully_ -3 points 6 days ago Yeah, I don't care. Blame the right people or you'll be even more unhappy. permalink parent award report block reply Awakened 2 points 6 days ago Don't worry. People are going to be more unhappy until they've elected enough commies to finish this country. permalink parent award report block reply view 1 more comments... MoreGuns 40 points 6 days ago Fraud and stolen elections. It would be best for TRUMP to overturn this election and redo it with real patriotic  oversight permalink award report block reply perma-maga 32 points 6 days ago Has anything been done about election integrity? No? Well then don't be surprised. permalink award report block reply ChyNahAzzWhole1 29 points 6 days ago CHECK THE MACHINES. permalink award report block reply greatpumpkin 22 points 6 days ago The word you're looking for is ... 'cheating'. The real question now is ... what are you going to do about it? permalink award report block reply questionmarks 6 points 6 days ago me? what the fuck is THE PRESIDENT going to do about it? permalink parent award report block reply MemeWarsVet 12 points 6 days ago Nothing. permalink parent award report block reply greatpumpkin 4 points 6 days ago Exactly. permalink parent award report block reply Sea_Still 22 points 6 days ago Fraud permalink award report block reply SpaceWizard 18 points 6 days ago Israel first, and Bondi and Kash dropping the ball. permalink award report block reply UsedOnlyThrice 0 points 6 days ago Kristi Noem, stupid ass doomer. Election integrity is under DHS since 2017. Tell your superiors to upgrade your doom programming so you can name drop the correct people. permalink parent award report block reply _Sully_ -11 points 6 days ago I'd like you to imagine what exactly you think can be done about those things and provide a detailed plan and the people you want who can execute it. Be very explicit and make sure you know exactly how it all works down to the paperwork you need to file to undo a literal coup, plain as day political persecution, a planned worldwide pandemic, pushing people to suicide, secure a massive media machine that makes sure you're as uninformed as possible and that tells you you're the reason why the world is suffering, intelligence agencies who purposely disenfranchise you, people who built a massive human trafficking scheme to flood your home with people who hate you so they can subvert your sovereignty in the hopes they can make sure you own nothing. I don't know, maybe people don't actually know what's at stake. I'd understand you better if it was 2027 but seeing how we have less than a year under our belt it's truly baffling. I'm not saying they haven't dropped the ball or that the Israel shit isn't enraging but keep your eye on the ball for Christ sake you already know what the alternative is and it's fucking way worse. permalink parent award report block reply Floridacus 0 points 6 days ago Didn't even read it, just downvoted. permalink parent award report block reply _Sully_ -1 points 6 days ago Right because being a humongous whinny faggot is something to strive for. Maybe you should've read it. I gurantee you almost no one read it. Why? Because that's what this place has turned into. Oh you're upset about Israel First. Ok faggot get in line. Literally no one wants that here. But what will being so focused on it actually achieve at this stage. Absolutely nothing. You aren't principled. We literally had a once in a life time coalition with an ounce of power you will not see for decades and you'd rather trash it then swallow your pride and understand that we have much bigger fish to fry. Fucking grow up and open your eyes. permalink parent award report block reply Floridacus 0 points 5 days ago That's 2 permalink parent award report block reply view 1 more comments... Bearing51 16 points 6 days ago Not just fraud, the republicans absolutely turned their backs on the American people. permalink award report block reply cupocovfefe 6 points 6 days ago Wtb more 90s blue dog dems permalink parent award report block reply YOLOSwag_McFartnut 15 points 6 days ago Republicans got power and did absolutely fuck all with it, as usual. permalink award report block reply Frociaggine 11 points 6 days ago Republicans politicians ain’t doing shit like usual. permalink award report block reply Shih_Tabed 7 points 6 days ago If nothing is being done to stop them why would they stop? permalink award report block reply friarfox 6 points 6 days ago The GOP took their goalie out of nets at the end of the first period. They have no plans at putting him back at the beginning of the second and for intermission they are all at the aloa snackbar. permalink award report block reply keeptherepublic1776 5 points 6 days ago Pain is coming. permalink award report block reply ImYourHuckleberry24 -1 points 6 days ago LMFAO No it's not permalink parent award report block reply keeptherepublic1776 6 points 6 days ago It is already here permalink parent award report block reply ImYourHuckleberry24 0 points 6 days ago Really? Tell me all about the \"pain\" the criminal cheaters and traitors are feeling. I'll wait... permalink parent award report block reply keeptherepublic1776 7 points 6 days ago We the fucking people are feeling the pain permalink parent award report block reply view 1 more comments... patrioticwinning3 5 points 6 days ago Zero riggers arrested = zero incentive not to rig. permalink award report block reply Reddit2016 4 points 6 days ago Cheating is allowed in blue states. permalink award report block reply CleanUpPhillyTrump24 4 points 6 days ago It's called vote fraud. There has to be an FBI and DOJ that finally prosecutes it. permalink award report block reply MemoryHoleyeO 4 points 6 days ago GOP did absolutely 0 ground work permalink award report block reply 19American62Woman 3 points 6 days ago Both sides profit when democrats win permalink award report block reply Cville123 3 points 6 days ago R voters did not turn out. permalink award report block reply Pede 2 points 6 days ago The average politician of a certain age is perpetually 10 years behind with their assessment of the pulse of the country. Trump is better but it still takes him 3 years to catch up to reality. permalink award report block reply RedPillosopher1776 2 points 6 days ago The traitors who overthrew the legitimate government in 2020 have never been held accountable for any of it. permalink award report block reply JimmyRussler 2 points 6 days ago When your top priority is every other countries problems not much attention gets paid to your own. Top that off with the rest of the employees doing fuck all at home because they're just waiting out the clock you're left with the situation we have now. The Rs have no intention of doing anything constructive because most are Rinos in hiding. permalink award report block reply preludelinux 2 points 6 days ago systematic destruction , stolen election have consequences if you look at it like a war it all comes together clearly ... notice the shutdown taking the snap away ... most illegals are here on benefits including snap its not suppose to happen but then why shutdown the government trying to force its funding ? of course its happening! permalink award report block reply OZJRant 2 points 6 days ago Legal voting should been the first thing on Trumps agenda nothing else until it is fixed !\nFor example…\nIf only citizens could vote then immigration could be resolved after? Non citizens have all voted now and republicans all lost power ..\nlook at nYC results he got in on immigrant/illegals vote? permalink award report block reply Valiazaner 1 points 6 days ago It's called election rigging. permalink award report block reply keeptherepublic1776 1 points 6 days ago It's not cheating. Gop voters are retarded. permalink award report block reply Tacitus1963 1 points 6 days ago Republicans never like to be ahead.\nThey prefer to lead from behind.\nRINOs have controlled the party for a long time.\nThey are purposely trying to sabotage Trump's agenda and throw the midterms to the Demtards. permalink award report block reply AgnesDomini 1 points 6 days ago Voter fraud. permalink award report block reply Gtrfan 1 points 6 days ago It's easier for Dems to cheat in off general election years. permalink award report block reply OprahsCankle 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nAwakened 53 points 6 days ago This is what happens when you don't fix fraud at home and spend your time trying to save the world. Also, people are pissed. Groceries, rent, home prices, Epstein.  You ain't gonna get people to turn out in this environment and we only beat fraud with massive turnout. permalink award report block reply _Sully_ 3 points 6 days ago Yes, be pissed and show it by voting for the people that put you there. Amazing work. permalink parent award report block reply Awakened 11 points 6 days ago The buck stops here, is a very old phrase and it use to be on a Presidents desk. Forget which one. True or not, that's who gets blamed. People ain't happy. permalink parent award report block reply _Sully_ -3 points 6 days ago Yeah, I don't care. Blame the right people or you'll be even more unhappy. permalink parent award report block reply Awakened 2 points 6 days ago Don't worry. People are going to be more unhappy until they've elected enough commies to finish this country. permalink parent award report block reply view 1 more comments...\n_Sully_ 3 points 6 days ago Yes, be pissed and show it by voting for the people that put you there. Amazing work. permalink parent award report block reply Awakened 11 points 6 days ago The buck stops here, is a very old phrase and it use to be on a Presidents desk. Forget which one. True or not, that's who gets blamed. People ain't happy. permalink parent award report block reply _Sully_ -3 points 6 days ago Yeah, I don't care. Blame the right people or you'll be even more unhappy. permalink parent award report block reply Awakened 2 points 6 days ago Don't worry. People are going to be more unhappy until they've elected enough commies to finish this country. permalink parent award report block reply view 1 more comments...\nAwakened 11 points 6 days ago The buck stops here, is a very old phrase and it use to be on a Presidents desk. Forget which one. True or not, that's who gets blamed. People ain't happy. permalink parent award report block reply _Sully_ -3 points 6 days ago Yeah, I don't care. Blame the right people or you'll be even more unhappy. permalink parent award report block reply Awakened 2 points 6 days ago Don't worry. People are going to be more unhappy until they've elected enough commies to finish this country. permalink parent award report block reply view 1 more comments...\n_Sully_ -3 points 6 days ago Yeah, I don't care. Blame the right people or you'll be even more unhappy. permalink parent award report block reply Awakened 2 points 6 days ago Don't worry. People are going to be more unhappy until they've elected enough commies to finish this country. permalink parent award report block reply view 1 more comments...\nAwakened 2 points 6 days ago Don't worry. People are going to be more unhappy until they've elected enough commies to finish this country. permalink parent award report block reply view 1 more comments...\nMoreGuns 40 points 6 days ago Fraud and stolen elections. It would be best for TRUMP to overturn this election and redo it with real patriotic  oversight permalink award report block reply\nperma-maga 32 points 6 days ago Has anything been done about election integrity? No? Well then don't be surprised. permalink award report block reply\nChyNahAzzWhole1 29 points 6 days ago CHECK THE MACHINES. permalink award report block reply\ngreatpumpkin 22 points 6 days ago The word you're looking for is ... 'cheating'. The real question now is ... what are you going to do about it? permalink award report block reply questionmarks 6 points 6 days ago me? what the fuck is THE PRESIDENT going to do about it? permalink parent award report block reply MemeWarsVet 12 points 6 days ago Nothing. permalink parent award report block reply greatpumpkin 4 points 6 days ago Exactly. permalink parent award report block reply\nquestionmarks 6 points 6 days ago me? what the fuck is THE PRESIDENT going to do about it? permalink parent award report block reply MemeWarsVet 12 points 6 days ago Nothing. permalink parent award report block reply greatpumpkin 4 points 6 days ago Exactly. permalink parent award report block reply\nMemeWarsVet 12 points 6 days ago Nothing. permalink parent award report block reply greatpumpkin 4 points 6 days ago Exactly. permalink parent award report block reply\ngreatpumpkin 4 points 6 days ago Exactly. permalink parent award report block reply\nSea_Still 22 points 6 days ago Fraud permalink award report block reply\nSpaceWizard 18 points 6 days ago Israel first, and Bondi and Kash dropping the ball. permalink award report block reply UsedOnlyThrice 0 points 6 days ago Kristi Noem, stupid ass doomer. Election integrity is under DHS since 2017. Tell your superiors to upgrade your doom programming so you can name drop the correct people. permalink parent award report block reply _Sully_ -11 points 6 days ago I'd like you to imagine what exactly you think can be done about those things and provide a detailed plan and the people you want who can execute it. Be very explicit and make sure you know exactly how it all works down to the paperwork you need to file to undo a literal coup, plain as day political persecution, a planned worldwide pandemic, pushing people to suicide, secure a massive media machine that makes sure you're as uninformed as possible and that tells you you're the reason why the world is suffering, intelligence agencies who purposely disenfranchise you, people who built a massive human trafficking scheme to flood your home with people who hate you so they can subvert your sovereignty in the hopes they can make sure you own nothing. I don't know, maybe people don't actually know what's at stake. I'd understand you better if it was 2027 but seeing how we have less than a year under our belt it's truly baffling. I'm not saying they haven't dropped the ball or that the Israel shit isn't enraging but keep your eye on the ball for Christ sake you already know what the alternative is and it's fucking way worse. permalink parent award report block reply Floridacus 0 points 6 days ago Didn't even read it, just downvoted. permalink parent award report block reply _Sully_ -1 points 6 days ago Right because being a humongous whinny faggot is something to strive for. Maybe you should've read it. I gurantee you almost no one read it. Why? Because that's what this place has turned into. Oh you're upset about Israel First. Ok faggot get in line. Literally no one wants that here. But what will being so focused on it actually achieve at this stage. Absolutely nothing. You aren't principled. We literally had a once in a life time coalition with an ounce of power you will not see for decades and you'd rather trash it then swallow your pride and understand that we have much bigger fish to fry. Fucking grow up and open your eyes. permalink parent award report block reply Floridacus 0 points 5 days ago That's 2 permalink parent award report block reply view 1 more comments...\nUsedOnlyThrice 0 points 6 days ago Kristi Noem, stupid ass doomer. Election integrity is under DHS since 2017. Tell your superiors to upgrade your doom programming so you can name drop the correct people. permalink parent award report block reply\n_Sully_ -11 points 6 days ago I'd like you to imagine what exactly you think can be done about those things and provide a detailed plan and the people you want who can execute it. Be very explicit and make sure you know exactly how it all works down to the paperwork you need to file to undo a literal coup, plain as day political persecution, a planned worldwide pandemic, pushing people to suicide, secure a massive media machine that makes sure you're as uninformed as possible and that tells you you're the reason why the world is suffering, intelligence agencies who purposely disenfranchise you, people who built a massive human trafficking scheme to flood your home with people who hate you so they can subvert your sovereignty in the hopes they can make sure you own nothing. I don't know, maybe people don't actually know what's at stake. I'd understand you better if it was 2027 but seeing how we have less than a year under our belt it's truly baffling. I'm not saying they haven't dropped the ball or that the Israel shit isn't enraging but keep your eye on the ball for Christ sake you already know what the alternative is and it's fucking way worse. permalink parent award report block reply Floridacus 0 points 6 days ago Didn't even read it, just downvoted. permalink parent award report block reply _Sully_ -1 points 6 days ago Right because being a humongous whinny faggot is something to strive for. Maybe you should've read it. I gurantee you almost no one read it. Why? Because that's what this place has turned into. Oh you're upset about Israel First. Ok faggot get in line. Literally no one wants that here. But what will being so focused on it actually achieve at this stage. Absolutely nothing. You aren't principled. We literally had a once in a life time coalition with an ounce of power you will not see for decades and you'd rather trash it then swallow your pride and understand that we have much bigger fish to fry. Fucking grow up and open your eyes. permalink parent award report block reply Floridacus 0 points 5 days ago That's 2 permalink parent award report block reply view 1 more comments...\nFloridacus 0 points 6 days ago Didn't even read it, just downvoted. permalink parent award report block reply _Sully_ -1 points 6 days ago Right because being a humongous whinny faggot is something to strive for. Maybe you should've read it. I gurantee you almost no one read it. Why? Because that's what this place has turned into. Oh you're upset about Israel First. Ok faggot get in line. Literally no one wants that here. But what will being so focused on it actually achieve at this stage. Absolutely nothing. You aren't principled. We literally had a once in a life time coalition with an ounce of power you will not see for decades and you'd rather trash it then swallow your pride and understand that we have much bigger fish to fry. Fucking grow up and open your eyes. permalink parent award report block reply Floridacus 0 points 5 days ago That's 2 permalink parent award report block reply view 1 more comments...\n_Sully_ -1 points 6 days ago Right because being a humongous whinny faggot is something to strive for. Maybe you should've read it. I gurantee you almost no one read it. Why? Because that's what this place has turned into. Oh you're upset about Israel First. Ok faggot get in line. Literally no one wants that here. But what will being so focused on it actually achieve at this stage. Absolutely nothing. You aren't principled. We literally had a once in a life time coalition with an ounce of power you will not see for decades and you'd rather trash it then swallow your pride and understand that we have much bigger fish to fry. Fucking grow up and open your eyes. permalink parent award report block reply Floridacus 0 points 5 days ago That's 2 permalink parent award report block reply view 1 more comments...\nFloridacus 0 points 5 days ago That's 2 permalink parent award report block reply view 1 more comments...\nBearing51 16 points 6 days ago Not just fraud, the republicans absolutely turned their backs on the American people. permalink award report block reply cupocovfefe 6 points 6 days ago Wtb more 90s blue dog dems permalink parent award report block reply\ncupocovfefe 6 points 6 days ago Wtb more 90s blue dog dems permalink parent award report block reply\nYOLOSwag_McFartnut 15 points 6 days ago Republicans got power and did absolutely fuck all with it, as usual. permalink award report block reply\nFrociaggine 11 points 6 days ago Republicans politicians ain’t doing shit like usual. permalink award report block reply\nShih_Tabed 7 points 6 days ago If nothing is being done to stop them why would they stop? permalink award report block reply\nfriarfox 6 points 6 days ago The GOP took their goalie out of nets at the end of the first period. They have no plans at putting him back at the beginning of the second and for intermission they are all at the aloa snackbar. permalink award report block reply\nkeeptherepublic1776 5 points 6 days ago Pain is coming. permalink award report block reply ImYourHuckleberry24 -1 points 6 days ago LMFAO No it's not permalink parent award report block reply keeptherepublic1776 6 points 6 days ago It is already here permalink parent award report block reply ImYourHuckleberry24 0 points 6 days ago Really? Tell me all about the \"pain\" the criminal cheaters and traitors are feeling. I'll wait... permalink parent award report block reply keeptherepublic1776 7 points 6 days ago We the fucking people are feeling the pain permalink parent award report block reply view 1 more comments...\nImYourHuckleberry24 -1 points 6 days ago LMFAO No it's not permalink parent award report block reply keeptherepublic1776 6 points 6 days ago It is already here permalink parent award report block reply ImYourHuckleberry24 0 points 6 days ago Really? Tell me all about the \"pain\" the criminal cheaters and traitors are feeling. I'll wait... permalink parent award report block reply keeptherepublic1776 7 points 6 days ago We the fucking people are feeling the pain permalink parent award report block reply view 1 more comments...\nkeeptherepublic1776 6 points 6 days ago It is already here permalink parent award report block reply ImYourHuckleberry24 0 points 6 days ago Really? Tell me all about the \"pain\" the criminal cheaters and traitors are feeling. I'll wait... permalink parent award report block reply keeptherepublic1776 7 points 6 days ago We the fucking people are feeling the pain permalink parent award report block reply view 1 more comments...\nImYourHuckleberry24 0 points 6 days ago Really? Tell me all about the \"pain\" the criminal cheaters and traitors are feeling. I'll wait... permalink parent award report block reply keeptherepublic1776 7 points 6 days ago We the fucking people are feeling the pain permalink parent award report block reply view 1 more comments...\nkeeptherepublic1776 7 points 6 days ago We the fucking people are feeling the pain permalink parent award report block reply view 1 more comments...\npatrioticwinning3 5 points 6 days ago Zero riggers arrested = zero incentive not to rig. permalink award report block reply\nReddit2016 4 points 6 days ago Cheating is allowed in blue states. permalink award report block reply\nCleanUpPhillyTrump24 4 points 6 days ago It's called vote fraud. There has to be an FBI and DOJ that finally prosecutes it. permalink award report block reply\nMemoryHoleyeO 4 points 6 days ago GOP did absolutely 0 ground work permalink award report block reply\n19American62Woman 3 points 6 days ago Both sides profit when democrats win permalink award report block reply\nCville123 3 points 6 days ago R voters did not turn out. permalink award report block reply\nPede 2 points 6 days ago The average politician of a certain age is perpetually 10 years behind with their assessment of the pulse of the country. Trump is better but it still takes him 3 years to catch up to reality. permalink award report block reply\nRedPillosopher1776 2 points 6 days ago The traitors who overthrew the legitimate government in 2020 have never been held accountable for any of it. permalink award report block reply\nJimmyRussler 2 points 6 days ago When your top priority is every other countries problems not much attention gets paid to your own. Top that off with the rest of the employees doing fuck all at home because they're just waiting out the clock you're left with the situation we have now. The Rs have no intention of doing anything constructive because most are Rinos in hiding. permalink award report block reply\npreludelinux 2 points 6 days ago systematic destruction , stolen election have consequences if you look at it like a war it all comes together clearly ... notice the shutdown taking the snap away ... most illegals are here on benefits including snap its not suppose to happen but then why shutdown the government trying to force its funding ? of course its happening! permalink award report block reply\nOZJRant 2 points 6 days ago Legal voting should been the first thing on Trumps agenda nothing else until it is fixed !\nFor example…\nIf only citizens could vote then immigration could be resolved after? Non citizens have all voted now and republicans all lost power ..\nlook at nYC results he got in on immigrant/illegals vote? permalink award report block reply\nValiazaner 1 points 6 days ago It's called election rigging. permalink award report block reply\nkeeptherepublic1776 1 points 6 days ago It's not cheating. Gop voters are retarded. permalink award report block reply\nTacitus1963 1 points 6 days ago Republicans never like to be ahead.\nThey prefer to lead from behind.\nRINOs have controlled the party for a long time.\nThey are purposely trying to sabotage Trump's agenda and throw the midterms to the Demtards. permalink award report block reply\nAgnesDomini 1 points 6 days ago Voter fraud. permalink award report block reply\nGtrfan 1 points 6 days ago It's easier for Dems to cheat in off general election years. permalink award report block reply\nOprahsCankle 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:01:57.445518Z"
}