{
  "id": "8185669",
  "title": "44Get this fucking Trump admin shill the fuck off of PDW. His “He’s the best😍!” post of Trump sprayi",
  "url": "https://patriots.win/p/1ARK9nPMHR/get-this-fucking-trump-admin-shi/c",
  "content": "49 Get this fucking Trump admin shill the fuck off of PDW. His “He’s the best😍!” post of Trump spraying cologne on a Muslim is the top sticky less than 24 hours after he called us no talent? Fuck you. posted 2 hours ago by JoeMcCarthyWasRight 10 comments award share download report block\n10 comments Sort by Top Top New Worst Old Save TrumpWonByALandslide 10 points 1 hour ago He's an influencer who gets paid the more he posts. That's it. permalink award report block reply Crucible 7 points 1 hour ago He's influencing me to stop supporting Trump. permalink parent award report block reply Crucible 5 points 2 hours ago NEW RULE: Any Eric Daugherty posts get an automatic downvote. I can't stand this phony faggot. permalink award report block reply JoeMcCarthyWasRight OP 4 points 1 hour ago Nerdy fuck was right shilling for the soda companies months ago and we all just let it slide. He’s a fucking plant. permalink parent award report block reply Crucible 1 points 1 hour ago The sugar instead of high fructose corn syrup campaign was to appeal to the Kosherites and for no other reason. permalink parent award report block reply LordCommissarYarrick 3 points 1 hour ago Not just any muslim. A dyed in the wool terrorist with a large body count subservient to the founder of Al-Nursra. permalink award report block reply couranto 2 points 6 minutes ago We are officially Reddit retarded: pro Trump content must be banned. This site has lost the plot. permalink award report block reply TGNX 1 points 14 seconds ago Is he cutting into the tendie budget? permalink award report block reply RudeFrog 0 points 1 hour ago I don't know what that is but I agree with ole boy permalink award report block reply AFferalAF 0 points 58 minutes ago I was only aware of one actual administration shill. Thanks for the heads up. permalink award report block reply\nTrumpWonByALandslide 10 points 1 hour ago He's an influencer who gets paid the more he posts. That's it. permalink award report block reply Crucible 7 points 1 hour ago He's influencing me to stop supporting Trump. permalink parent award report block reply\nCrucible 7 points 1 hour ago He's influencing me to stop supporting Trump. permalink parent award report block reply\nCrucible 5 points 2 hours ago NEW RULE: Any Eric Daugherty posts get an automatic downvote. I can't stand this phony faggot. permalink award report block reply JoeMcCarthyWasRight OP 4 points 1 hour ago Nerdy fuck was right shilling for the soda companies months ago and we all just let it slide. He’s a fucking plant. permalink parent award report block reply Crucible 1 points 1 hour ago The sugar instead of high fructose corn syrup campaign was to appeal to the Kosherites and for no other reason. permalink parent award report block reply\nJoeMcCarthyWasRight OP 4 points 1 hour ago Nerdy fuck was right shilling for the soda companies months ago and we all just let it slide. He’s a fucking plant. permalink parent award report block reply Crucible 1 points 1 hour ago The sugar instead of high fructose corn syrup campaign was to appeal to the Kosherites and for no other reason. permalink parent award report block reply\nCrucible 1 points 1 hour ago The sugar instead of high fructose corn syrup campaign was to appeal to the Kosherites and for no other reason. permalink parent award report block reply\nLordCommissarYarrick 3 points 1 hour ago Not just any muslim. A dyed in the wool terrorist with a large body count subservient to the founder of Al-Nursra. permalink award report block reply\ncouranto 2 points 6 minutes ago We are officially Reddit retarded: pro Trump content must be banned. This site has lost the plot. permalink award report block reply\nTGNX 1 points 14 seconds ago Is he cutting into the tendie budget? permalink award report block reply\nRudeFrog 0 points 1 hour ago I don't know what that is but I agree with ole boy permalink award report block reply\nAFferalAF 0 points 58 minutes ago I was only aware of one actual administration shill. Thanks for the heads up. permalink award report block reply",
  "fetched_at": "2025-11-12T19:33:01.875651Z"
}