{
  "id": "8185599",
  "title": "119\"A bunch of veteran, well-qualified FedEx workers were laid off and replaced with H1B visa hires.",
  "url": "https://patriots.win/p/1ARK9nP5Qn/a-bunch-of-veteran-wellqualified/c",
  "content": "238 \"A bunch of veteran, well-qualified FedEx workers were laid off and replaced with H1B visa hires. What does the administration have to say about that?\" posted 6 hours ago by bleeje 24 comments award share report block toddstarnes @toddstarnes • 11h A bunch of veteran, well-qualified FedEx workers were laid off and replaced with H1B visa hires. What does the administration have to say about that?\n24 comments Sort by Top Top New Worst Old Save MastaJoda 17 points 5 hours ago \"Americans are not smart enough to deliver packages.'' -DJT permalink award report block reply GatoradeJeb 7 points 5 hours ago DJT: \"I hate Whites and will replace White man with browns and make sure White woman racemix with the browns!\" permalink parent award report block reply RedStoneDeepState 3 points 5 hours ago It's FedEx corporate not FedEx drivers. permalink parent award report block reply SpellingContable 1 points 4 hours ago Your package has been redeemed, by a porch pirate. permalink parent award report block reply GoldenEarz 0 points 5 hours ago \"Its good for their economy ... oops I meant: the economy\" permalink parent award report block reply AccelerateAlready 5 points 5 hours ago \"50 year mortgage?\" permalink award report block reply 1DontTreadOnMe1 5 points 5 hours ago Boycott FedEx. permalink award report block reply DingDongDitch 5 points 5 hours ago FedEx sucked and now it will suck worse. Notice the difference between their drivers. Our FedEx drivers are barely functional to begin with vs UPS drivers who are like soldiers. permalink award report block reply RedStoneDeepState 2 points 5 hours ago This is corporate, not drivers. I dislike FedEx but their specialty is overnight shipping while UPS is about cost. permalink parent award report block reply keeptherepublic1776 2 points 5 hours ago They are good with it because he's a phoney fuck permalink award report block reply RedStoneDeepState -1 points 6 hours ago White people don't want to work in Memphis. FedEx legitimately has hiring problems due to that. The solution shouldn't be H1B but they have hiring problems regardless. permalink award report block reply Elencher 3 points 5 hours ago The solution to our brown problem isn't more fuckign browns. permalink parent award report block reply RedStoneDeepState 1 points 5 hours ago Memphis was founded by Jackson and Jackson could fix Memphis. permalink parent award report block reply NadlersNads 3 points 6 hours ago There are fedexs in every city, dork permalink parent award report block reply RedStoneDeepState -1 points 6 hours ago https://youtu.be/0xEczrGIy08?si=czM58A3PUT0osRgK It isn't local stores hiring H1Bs, it's the corporate headquarters to manage this, you fucking moron. permalink parent award report block reply GatoradeJeb 1 points 5 hours ago The solution is banning racemixing and deproting all browns permalink parent award report block reply RedStoneDeepState -1 points 5 hours ago Fuck you, I like Asians permalink parent award report block reply GatoradeJeb 1 points 5 hours ago Then fuck off to india and take your pajeets and slant eyes who vote 90% democrat with you neocon filth permalink parent award report block reply negative_entropy 1 points 6 hours ago just move the corp hq lol permalink parent award report block reply RedStoneDeepState 0 points 6 hours ago The corporate headquarters is based on seaport access, extensive rail access and being at the geographic center of the US population. Where can they move to that has seaport access and is nearly at the geographic center of the US population? https://youtu.be/0xEczrGIy08?si=czM58A3PUT0osRgK This is how overnight shipping works. It goes to Memphis and leaves Memphis. It is the ideal location for it. It would be easier to burn Memphis to the ground and rebuild than move the corporate headquarters. permalink parent award report block reply keeptherepublic1776 -1 points 5 hours ago Holy fuck. You are worse than the Left. You are brainwashed and retarded permalink parent award report block reply RedStoneDeepState 1 points 5 hours ago Do white people want to move to Memphis? permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Retarded. Then fucking hire American brown people you fucking dipshot permalink parent award report block reply RedStoneDeepState 0 points 5 hours ago The American brown people are too retarded to handle the logistics of overnight air freight. permalink parent award report block reply\nMastaJoda 17 points 5 hours ago \"Americans are not smart enough to deliver packages.'' -DJT permalink award report block reply GatoradeJeb 7 points 5 hours ago DJT: \"I hate Whites and will replace White man with browns and make sure White woman racemix with the browns!\" permalink parent award report block reply RedStoneDeepState 3 points 5 hours ago It's FedEx corporate not FedEx drivers. permalink parent award report block reply SpellingContable 1 points 4 hours ago Your package has been redeemed, by a porch pirate. permalink parent award report block reply GoldenEarz 0 points 5 hours ago \"Its good for their economy ... oops I meant: the economy\" permalink parent award report block reply\nGatoradeJeb 7 points 5 hours ago DJT: \"I hate Whites and will replace White man with browns and make sure White woman racemix with the browns!\" permalink parent award report block reply\nRedStoneDeepState 3 points 5 hours ago It's FedEx corporate not FedEx drivers. permalink parent award report block reply\nSpellingContable 1 points 4 hours ago Your package has been redeemed, by a porch pirate. permalink parent award report block reply\nGoldenEarz 0 points 5 hours ago \"Its good for their economy ... oops I meant: the economy\" permalink parent award report block reply\nAccelerateAlready 5 points 5 hours ago \"50 year mortgage?\" permalink award report block reply\n1DontTreadOnMe1 5 points 5 hours ago Boycott FedEx. permalink award report block reply\nDingDongDitch 5 points 5 hours ago FedEx sucked and now it will suck worse. Notice the difference between their drivers. Our FedEx drivers are barely functional to begin with vs UPS drivers who are like soldiers. permalink award report block reply RedStoneDeepState 2 points 5 hours ago This is corporate, not drivers. I dislike FedEx but their specialty is overnight shipping while UPS is about cost. permalink parent award report block reply\nRedStoneDeepState 2 points 5 hours ago This is corporate, not drivers. I dislike FedEx but their specialty is overnight shipping while UPS is about cost. permalink parent award report block reply\nkeeptherepublic1776 2 points 5 hours ago They are good with it because he's a phoney fuck permalink award report block reply\nRedStoneDeepState -1 points 6 hours ago White people don't want to work in Memphis. FedEx legitimately has hiring problems due to that. The solution shouldn't be H1B but they have hiring problems regardless. permalink award report block reply Elencher 3 points 5 hours ago The solution to our brown problem isn't more fuckign browns. permalink parent award report block reply RedStoneDeepState 1 points 5 hours ago Memphis was founded by Jackson and Jackson could fix Memphis. permalink parent award report block reply NadlersNads 3 points 6 hours ago There are fedexs in every city, dork permalink parent award report block reply RedStoneDeepState -1 points 6 hours ago https://youtu.be/0xEczrGIy08?si=czM58A3PUT0osRgK It isn't local stores hiring H1Bs, it's the corporate headquarters to manage this, you fucking moron. permalink parent award report block reply GatoradeJeb 1 points 5 hours ago The solution is banning racemixing and deproting all browns permalink parent award report block reply RedStoneDeepState -1 points 5 hours ago Fuck you, I like Asians permalink parent award report block reply GatoradeJeb 1 points 5 hours ago Then fuck off to india and take your pajeets and slant eyes who vote 90% democrat with you neocon filth permalink parent award report block reply negative_entropy 1 points 6 hours ago just move the corp hq lol permalink parent award report block reply RedStoneDeepState 0 points 6 hours ago The corporate headquarters is based on seaport access, extensive rail access and being at the geographic center of the US population. Where can they move to that has seaport access and is nearly at the geographic center of the US population? https://youtu.be/0xEczrGIy08?si=czM58A3PUT0osRgK This is how overnight shipping works. It goes to Memphis and leaves Memphis. It is the ideal location for it. It would be easier to burn Memphis to the ground and rebuild than move the corporate headquarters. permalink parent award report block reply keeptherepublic1776 -1 points 5 hours ago Holy fuck. You are worse than the Left. You are brainwashed and retarded permalink parent award report block reply RedStoneDeepState 1 points 5 hours ago Do white people want to move to Memphis? permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Retarded. Then fucking hire American brown people you fucking dipshot permalink parent award report block reply RedStoneDeepState 0 points 5 hours ago The American brown people are too retarded to handle the logistics of overnight air freight. permalink parent award report block reply\nElencher 3 points 5 hours ago The solution to our brown problem isn't more fuckign browns. permalink parent award report block reply RedStoneDeepState 1 points 5 hours ago Memphis was founded by Jackson and Jackson could fix Memphis. permalink parent award report block reply\nRedStoneDeepState 1 points 5 hours ago Memphis was founded by Jackson and Jackson could fix Memphis. permalink parent award report block reply\nNadlersNads 3 points 6 hours ago There are fedexs in every city, dork permalink parent award report block reply RedStoneDeepState -1 points 6 hours ago https://youtu.be/0xEczrGIy08?si=czM58A3PUT0osRgK It isn't local stores hiring H1Bs, it's the corporate headquarters to manage this, you fucking moron. permalink parent award report block reply\nRedStoneDeepState -1 points 6 hours ago https://youtu.be/0xEczrGIy08?si=czM58A3PUT0osRgK It isn't local stores hiring H1Bs, it's the corporate headquarters to manage this, you fucking moron. permalink parent award report block reply\nGatoradeJeb 1 points 5 hours ago The solution is banning racemixing and deproting all browns permalink parent award report block reply RedStoneDeepState -1 points 5 hours ago Fuck you, I like Asians permalink parent award report block reply GatoradeJeb 1 points 5 hours ago Then fuck off to india and take your pajeets and slant eyes who vote 90% democrat with you neocon filth permalink parent award report block reply\nRedStoneDeepState -1 points 5 hours ago Fuck you, I like Asians permalink parent award report block reply GatoradeJeb 1 points 5 hours ago Then fuck off to india and take your pajeets and slant eyes who vote 90% democrat with you neocon filth permalink parent award report block reply\nGatoradeJeb 1 points 5 hours ago Then fuck off to india and take your pajeets and slant eyes who vote 90% democrat with you neocon filth permalink parent award report block reply\nnegative_entropy 1 points 6 hours ago just move the corp hq lol permalink parent award report block reply RedStoneDeepState 0 points 6 hours ago The corporate headquarters is based on seaport access, extensive rail access and being at the geographic center of the US population. Where can they move to that has seaport access and is nearly at the geographic center of the US population? https://youtu.be/0xEczrGIy08?si=czM58A3PUT0osRgK This is how overnight shipping works. It goes to Memphis and leaves Memphis. It is the ideal location for it. It would be easier to burn Memphis to the ground and rebuild than move the corporate headquarters. permalink parent award report block reply\nRedStoneDeepState 0 points 6 hours ago The corporate headquarters is based on seaport access, extensive rail access and being at the geographic center of the US population. Where can they move to that has seaport access and is nearly at the geographic center of the US population? https://youtu.be/0xEczrGIy08?si=czM58A3PUT0osRgK This is how overnight shipping works. It goes to Memphis and leaves Memphis. It is the ideal location for it. It would be easier to burn Memphis to the ground and rebuild than move the corporate headquarters. permalink parent award report block reply\nkeeptherepublic1776 -1 points 5 hours ago Holy fuck. You are worse than the Left. You are brainwashed and retarded permalink parent award report block reply RedStoneDeepState 1 points 5 hours ago Do white people want to move to Memphis? permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Retarded. Then fucking hire American brown people you fucking dipshot permalink parent award report block reply RedStoneDeepState 0 points 5 hours ago The American brown people are too retarded to handle the logistics of overnight air freight. permalink parent award report block reply\nRedStoneDeepState 1 points 5 hours ago Do white people want to move to Memphis? permalink parent award report block reply keeptherepublic1776 1 points 5 hours ago Retarded. Then fucking hire American brown people you fucking dipshot permalink parent award report block reply RedStoneDeepState 0 points 5 hours ago The American brown people are too retarded to handle the logistics of overnight air freight. permalink parent award report block reply\nkeeptherepublic1776 1 points 5 hours ago Retarded. Then fucking hire American brown people you fucking dipshot permalink parent award report block reply RedStoneDeepState 0 points 5 hours ago The American brown people are too retarded to handle the logistics of overnight air freight. permalink parent award report block reply\nRedStoneDeepState 0 points 5 hours ago The American brown people are too retarded to handle the logistics of overnight air freight. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:43:06.867553Z"
}