{
  "id": "1ARK9irmKc",
  "url": "https://patriots.win/p/1ARK9irmKc/another-limousine-socialist-who-/c",
  "content": "594 Another limousine Socialist who still gets an allowance from her parents is poised to win the Seattle Mayoral race - yes, they are STILL COUNTING ballots in Seattle after last Tuesday's vote. posted 2 days ago by schism 68 comments award share download report block\n68 comments Sort by Top Top New Worst Old Save ColonelKlink 50 points 2 days ago Voter fraud has to be stopped. permalink award report block reply EgregiousPhilbin 19 points 2 days ago I'm not so sure it's fraud - these blue cities are populated by women, illegals and communists. New York wasn't fraud. They want us dead, and in return I want them to suffer under their own choices. permalink parent award report block reply npc_1234 23 points 2 days ago If it wasn't fraud they would have known the winner on election night. With the exception of 2000, how frequently did you hear about races flipping a week or more after election day before Trump? permalink parent award report block reply UCantStumpTheTrump 11 points 2 days ago And they never flip Republican (except GWB but that was UniParty anyways) permalink parent award report block reply TerdBergler 2 points 2 days ago Yeah, we need to differentiate between MAGA and GOP. Republicans aren't good by default, despite so many people believing what they're fed online. It's not that there are RINOs, it's that people don't want to actually pay attention to the republicans. They get mad when they don't act like their idealized version of them that they built through media manipulation and social media circle jerking. Nothing ever manages to \"accidentally\" go towards anything MAGA, the failiure is ALWAYS more government and more control permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in. Ballots postmarked by 8pm election day are counted. there is no in-person voting. you have to wait for the ballots to come in. permalink parent award report block reply Filo76 9 points 2 days ago There is a growing rift between left and right in this country.  You simply cannot be a moderate anymore. The left has gone so far left in recent years, it would make Marx shudder.  So blue cities that would normally elect run-of-the-mill dems are now electing socialists. permalink parent award report block reply UCantStumpTheTrump 5 points 2 days ago Precisely. Trump is a regular NYC centrist businessman from the 80s, which is now considered \"fascist\" or extreme right permalink parent award report block reply Tele_Plus 5 points 2 days ago Oh they’ll suffer, and then they’ll blame everyone and everything else for it. permalink parent award report block reply PatriotForTN 1 points 2 days ago Lol! permalink parent award report block reply Doritalos 2 points 2 days ago Correct, half the country is braindead (female and shitskin) permalink parent award report block reply Metal4Freedom 5 points 2 days ago Don't forget the 1/3rd of White males who vote commie. They are the worst traitors. permalink parent award report block reply tpactionchasethevote 2 points 2 days ago Why do the wealthy like socialism? permalink parent award report block reply ToxicAvengerOhio 14 points 2 days ago Trump: \"How about $2000 and 50 year mortgage??\" permalink parent award report block reply Owmyballz 9 points 2 days ago All he's doing is adding to the poors which will ultimately go communist.  If the right doesn't addressing housing and jobs, the US is going to go into a real civil war before 2030. permalink parent award report block reply UCantStumpTheTrump 6 points 2 days ago Real estate prices have to go down... its one of many bubbles that has to be popped permalink parent award report block reply PeterThielAntiChrist 0 points 2 days ago there's not going to be a civil war. it will just tip socialist. you can't have a civil war if 95% of people benefit from a radical change. its called revolution. permalink parent award report block reply Owmyballz 1 points 1 day ago Nah its ok anarcho, we'll make sure to make you go easily into the night. permalink parent award report block reply view 3 more comments... BigMikesSwingingCock 11 points 2 days ago What do you MEAN fraud! It's perfectly normal to not have Election Day, but instead, to have Election month! That way, they can \"find\" all the ballots needed to win. All 100% of the \"found\" ballots just so happen to be straight democrat. They're not frauds, just clumsy, and \"lose\" things during all the election excitement! permalink parent award report block reply USDMaga 2 points 2 days ago Its also Oregon where I don't think they have any in person voting the day of the election to count.  Its all mail in ballots, and still can't count a week after. permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago Oregon went 100% mail-in voting and went permanently blue ever since. It's way easier to cheat, they'll even accept late ballots without postmarks, it's insane permalink parent award report block reply PeterThielAntiChrist 1 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago The odds of ALL of these extended-counting parties resulting in Democrat wins are ZERO. It always favors these cheating scumbags permalink parent award report block reply stargunner 4 points 2 days ago you ever been to seattle bro? this is the city that hosted CHAZ. they want this shit. permalink parent award report block reply tpactionchasethevote 3 points 2 days ago Why do the wealthy like socialism? permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply load 2 more comments... Scatter-Shot 19 points 2 days ago Seems like vote counting is slow when things are not going the establishment Democrat's way. permalink award report block reply Luvs_2_Bop 7 points 2 days ago Yup. And they’re already setting the stage for it to be “oh so close!” so no one questions it. The math doesn’t lie I suppose, it’s just rayciss sometimes lmao permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply Scumbag-reddit 19 points 2 days ago the socialist takeover gameplan: Destroy the ever living fuck out of the economy  and when the opposition gets in, blame him for the terrible costs and run on lowering the costs you elevated. permalink award report block reply FatigueIsReal 8 points 2 days ago That sounds like the Democrat and Republican playbook since the 50s. permalink parent award report block reply possibletower 10 points 2 days ago Since the 1910s. People keep forgetting about libshit Woodrow Wilson and his precious IRS and Federal Reserve permalink parent award report block reply Seatacjoe 15 points 2 days ago The bar is so low in Seattle.   We had a kid fucker (literally) who ran Seattle and the kid he fucked was a street kid who just happened to overdose before his lawsuit against that john wayne gacey looking fuck.  Our political class who are installed like toilets is such a fuckin joke permalink award report block reply Tokens_Worth 14 points 2 days ago WA elections.\nThe outcome is always predetermined. I had dinner with a friend and the WA GOP advisor.\nThis guy was a giant faggot. Im not kidding. Made claims \"better the GOP loses, cuz it helps fundraising\" TLDR: I left WA 3 years ago permalink award report block reply alex_p_keaton_III 7 points 2 days ago I've never donated to them and I never will.  This is exactly why. permalink parent award report block reply Mindcrym 2 points 2 days ago I'm embarrassed to say I am from Seattle. permalink parent award report block reply schism OP 8 points 2 days ago SAUCE: https://www.dailymail.co.uk/news/article-15277339/Seattle-Mayor-Election-Katie-Wilson.html permalink award report block reply TheRPatriot 7 points 2 days ago Utter INSANITY. They literally don’t stop “counting” until they win. Never in my life since 2020 have I seen such debauchery occur. The counting MUST STOP AT MIDNIGHT ELECTION DAY permalink award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. washington went mail-in in the 90s. arizona was the first mail in state. permalink parent award report block reply nolefthandshakes 2 points 2 days ago why wouldn’t it though? NOTHING IS DONE ABOUT IT permalink parent award report block reply Hanging_Chad 6 points 2 days ago how hard is it to count? permalink award report block reply OG_BACONndEGGs 10 points 2 days ago Very hard for dems when you don't like the outcome. permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply MediaBro 3 points 2 days ago The article implies that this is a bad thing. You have to understand, it's so bad for so many people, that her plight is actually understandable and probably is the reason why they voted for her. There are more people between 20 and 40 now being supported by their parents because of how many jobs are being lost and how bad the economy is getting. Don't get mad that people are voting for Socialists. They don't have much of a choice otherwise. permalink award report block reply Snek_Plissken 3 points 2 days ago Washington is done for and nothing is going to change that. There might be a few changes if removing minority districting can be challenged. They basically took Seattle votes to cut from the extreme north and south. Cutting huge swathes from anyone that would potentially vote anything but the left. There isn't even a racial gerrymander there. It's just eliminate anything that isn't left. I don't know who is even voting for the fentanyl army, but hopefully they have good handwriting. permalink award report block reply Galahad175 3 points 2 days ago Wait til they figure out chief Seattle was a slave owner permalink award report block reply Easzq8 3 points 2 days ago “We count the votes until we get the correct outcome.” permalink award report block reply hey_spike 2 points 2 days ago There have been socialists on the city council, so this is no surprise. permalink award report block reply DanIsSwell 2 points 2 days ago Annoying that the article never mentions her first name, keeps calling her “Wilson”. permalink award report block reply KennyKetchem 1 points 2 days ago https://ballotpedia.org/Mayoral_election_in_Seattle , Washington (2025) Katie Wilson permalink parent award report block reply Porkchop-express 2 points 2 days ago I really feel like teaching communist and socialist classes in college is really hurting America permalink award report block reply SALTYinSeattle 2 points 2 days ago by an incredibly slim margin of 65 votes LMAO WUT?! 🤣 permalink award report block reply thp2034 2 points 2 days ago In Seattle it may well be fraud. The Democrats have a very well oiled election machine in Washington and it hinges on all mail-in voting & the I-5 corridor from Vancouver in the south to Bellingham in the north. The Dems control the corridor and hence control the entire State. it sucks.... permalink award report block reply starjello 1 points 2 days ago Democrats got all major elections last Tuesday. Down vote away retards. You can't handle the truth so you'll never fix this country permalink award report block reply mav7579 1 points 2 days ago Mariner's Manager Damn Wilson should have used his influence in Seattle to sway the vote. permalink award report block reply tired-of-crap 1 points 2 days ago If the supreme court says no counting ballots that arrive after election day, their advantage will be GONE. permalink award report block reply knnbccb 1 points 2 days ago As far as I'm concerned, if you are a socialist you should be shot, long before you are presented as a viable candidate for any election. Consider doing this to every single registered member of the DSA. permalink award report block reply TerdBergler 1 points 2 days ago If only the right would be active instead of demanding the government, that serves the communist revolution, fix itself. I did see some stuff for people talking about getting into election monitoring and the like, but we've got to be more active. When the left and the government are working together against us, we can only rely on our side doing something. permalink award report block reply RockFlagAndEagle2020 1 points 1 day ago Boomers - don't get your panties all twisted. If your unwilling to come down on the price you think your homes & 401k are worth don't start crying when communists take over. permalink award report block reply SaxonRealm 1 points 2 days ago Seattle voters are retarded. Wtf is wrong with white people in Washington and Oregon? permalink award report block reply ChickenStrips 1 points 2 days ago Boeing should move the hell out of that city. permalink award report block reply PatriotForTN 1 points 2 days ago They have had \"democratic socialist\" mayors for quite some time. Daily Mail is a stupid, fake tabloid. permalink award report block reply\nColonelKlink 50 points 2 days ago Voter fraud has to be stopped. permalink award report block reply EgregiousPhilbin 19 points 2 days ago I'm not so sure it's fraud - these blue cities are populated by women, illegals and communists. New York wasn't fraud. They want us dead, and in return I want them to suffer under their own choices. permalink parent award report block reply npc_1234 23 points 2 days ago If it wasn't fraud they would have known the winner on election night. With the exception of 2000, how frequently did you hear about races flipping a week or more after election day before Trump? permalink parent award report block reply UCantStumpTheTrump 11 points 2 days ago And they never flip Republican (except GWB but that was UniParty anyways) permalink parent award report block reply TerdBergler 2 points 2 days ago Yeah, we need to differentiate between MAGA and GOP. Republicans aren't good by default, despite so many people believing what they're fed online. It's not that there are RINOs, it's that people don't want to actually pay attention to the republicans. They get mad when they don't act like their idealized version of them that they built through media manipulation and social media circle jerking. Nothing ever manages to \"accidentally\" go towards anything MAGA, the failiure is ALWAYS more government and more control permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in. Ballots postmarked by 8pm election day are counted. there is no in-person voting. you have to wait for the ballots to come in. permalink parent award report block reply Filo76 9 points 2 days ago There is a growing rift between left and right in this country.  You simply cannot be a moderate anymore. The left has gone so far left in recent years, it would make Marx shudder.  So blue cities that would normally elect run-of-the-mill dems are now electing socialists. permalink parent award report block reply UCantStumpTheTrump 5 points 2 days ago Precisely. Trump is a regular NYC centrist businessman from the 80s, which is now considered \"fascist\" or extreme right permalink parent award report block reply Tele_Plus 5 points 2 days ago Oh they’ll suffer, and then they’ll blame everyone and everything else for it. permalink parent award report block reply PatriotForTN 1 points 2 days ago Lol! permalink parent award report block reply Doritalos 2 points 2 days ago Correct, half the country is braindead (female and shitskin) permalink parent award report block reply Metal4Freedom 5 points 2 days ago Don't forget the 1/3rd of White males who vote commie. They are the worst traitors. permalink parent award report block reply tpactionchasethevote 2 points 2 days ago Why do the wealthy like socialism? permalink parent award report block reply ToxicAvengerOhio 14 points 2 days ago Trump: \"How about $2000 and 50 year mortgage??\" permalink parent award report block reply Owmyballz 9 points 2 days ago All he's doing is adding to the poors which will ultimately go communist.  If the right doesn't addressing housing and jobs, the US is going to go into a real civil war before 2030. permalink parent award report block reply UCantStumpTheTrump 6 points 2 days ago Real estate prices have to go down... its one of many bubbles that has to be popped permalink parent award report block reply PeterThielAntiChrist 0 points 2 days ago there's not going to be a civil war. it will just tip socialist. you can't have a civil war if 95% of people benefit from a radical change. its called revolution. permalink parent award report block reply Owmyballz 1 points 1 day ago Nah its ok anarcho, we'll make sure to make you go easily into the night. permalink parent award report block reply view 3 more comments... BigMikesSwingingCock 11 points 2 days ago What do you MEAN fraud! It's perfectly normal to not have Election Day, but instead, to have Election month! That way, they can \"find\" all the ballots needed to win. All 100% of the \"found\" ballots just so happen to be straight democrat. They're not frauds, just clumsy, and \"lose\" things during all the election excitement! permalink parent award report block reply USDMaga 2 points 2 days ago Its also Oregon where I don't think they have any in person voting the day of the election to count.  Its all mail in ballots, and still can't count a week after. permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago Oregon went 100% mail-in voting and went permanently blue ever since. It's way easier to cheat, they'll even accept late ballots without postmarks, it's insane permalink parent award report block reply PeterThielAntiChrist 1 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago The odds of ALL of these extended-counting parties resulting in Democrat wins are ZERO. It always favors these cheating scumbags permalink parent award report block reply stargunner 4 points 2 days ago you ever been to seattle bro? this is the city that hosted CHAZ. they want this shit. permalink parent award report block reply tpactionchasethevote 3 points 2 days ago Why do the wealthy like socialism? permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply load 2 more comments...\nEgregiousPhilbin 19 points 2 days ago I'm not so sure it's fraud - these blue cities are populated by women, illegals and communists. New York wasn't fraud. They want us dead, and in return I want them to suffer under their own choices. permalink parent award report block reply npc_1234 23 points 2 days ago If it wasn't fraud they would have known the winner on election night. With the exception of 2000, how frequently did you hear about races flipping a week or more after election day before Trump? permalink parent award report block reply UCantStumpTheTrump 11 points 2 days ago And they never flip Republican (except GWB but that was UniParty anyways) permalink parent award report block reply TerdBergler 2 points 2 days ago Yeah, we need to differentiate between MAGA and GOP. Republicans aren't good by default, despite so many people believing what they're fed online. It's not that there are RINOs, it's that people don't want to actually pay attention to the republicans. They get mad when they don't act like their idealized version of them that they built through media manipulation and social media circle jerking. Nothing ever manages to \"accidentally\" go towards anything MAGA, the failiure is ALWAYS more government and more control permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in. Ballots postmarked by 8pm election day are counted. there is no in-person voting. you have to wait for the ballots to come in. permalink parent award report block reply Filo76 9 points 2 days ago There is a growing rift between left and right in this country.  You simply cannot be a moderate anymore. The left has gone so far left in recent years, it would make Marx shudder.  So blue cities that would normally elect run-of-the-mill dems are now electing socialists. permalink parent award report block reply UCantStumpTheTrump 5 points 2 days ago Precisely. Trump is a regular NYC centrist businessman from the 80s, which is now considered \"fascist\" or extreme right permalink parent award report block reply Tele_Plus 5 points 2 days ago Oh they’ll suffer, and then they’ll blame everyone and everything else for it. permalink parent award report block reply PatriotForTN 1 points 2 days ago Lol! permalink parent award report block reply Doritalos 2 points 2 days ago Correct, half the country is braindead (female and shitskin) permalink parent award report block reply Metal4Freedom 5 points 2 days ago Don't forget the 1/3rd of White males who vote commie. They are the worst traitors. permalink parent award report block reply tpactionchasethevote 2 points 2 days ago Why do the wealthy like socialism? permalink parent award report block reply\nnpc_1234 23 points 2 days ago If it wasn't fraud they would have known the winner on election night. With the exception of 2000, how frequently did you hear about races flipping a week or more after election day before Trump? permalink parent award report block reply UCantStumpTheTrump 11 points 2 days ago And they never flip Republican (except GWB but that was UniParty anyways) permalink parent award report block reply TerdBergler 2 points 2 days ago Yeah, we need to differentiate between MAGA and GOP. Republicans aren't good by default, despite so many people believing what they're fed online. It's not that there are RINOs, it's that people don't want to actually pay attention to the republicans. They get mad when they don't act like their idealized version of them that they built through media manipulation and social media circle jerking. Nothing ever manages to \"accidentally\" go towards anything MAGA, the failiure is ALWAYS more government and more control permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in. Ballots postmarked by 8pm election day are counted. there is no in-person voting. you have to wait for the ballots to come in. permalink parent award report block reply\nUCantStumpTheTrump 11 points 2 days ago And they never flip Republican (except GWB but that was UniParty anyways) permalink parent award report block reply TerdBergler 2 points 2 days ago Yeah, we need to differentiate between MAGA and GOP. Republicans aren't good by default, despite so many people believing what they're fed online. It's not that there are RINOs, it's that people don't want to actually pay attention to the republicans. They get mad when they don't act like their idealized version of them that they built through media manipulation and social media circle jerking. Nothing ever manages to \"accidentally\" go towards anything MAGA, the failiure is ALWAYS more government and more control permalink parent award report block reply\nTerdBergler 2 points 2 days ago Yeah, we need to differentiate between MAGA and GOP. Republicans aren't good by default, despite so many people believing what they're fed online. It's not that there are RINOs, it's that people don't want to actually pay attention to the republicans. They get mad when they don't act like their idealized version of them that they built through media manipulation and social media circle jerking. Nothing ever manages to \"accidentally\" go towards anything MAGA, the failiure is ALWAYS more government and more control permalink parent award report block reply\nPeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in. Ballots postmarked by 8pm election day are counted. there is no in-person voting. you have to wait for the ballots to come in. permalink parent award report block reply\nFilo76 9 points 2 days ago There is a growing rift between left and right in this country.  You simply cannot be a moderate anymore. The left has gone so far left in recent years, it would make Marx shudder.  So blue cities that would normally elect run-of-the-mill dems are now electing socialists. permalink parent award report block reply UCantStumpTheTrump 5 points 2 days ago Precisely. Trump is a regular NYC centrist businessman from the 80s, which is now considered \"fascist\" or extreme right permalink parent award report block reply\nUCantStumpTheTrump 5 points 2 days ago Precisely. Trump is a regular NYC centrist businessman from the 80s, which is now considered \"fascist\" or extreme right permalink parent award report block reply\nTele_Plus 5 points 2 days ago Oh they’ll suffer, and then they’ll blame everyone and everything else for it. permalink parent award report block reply PatriotForTN 1 points 2 days ago Lol! permalink parent award report block reply\nPatriotForTN 1 points 2 days ago Lol! permalink parent award report block reply\nDoritalos 2 points 2 days ago Correct, half the country is braindead (female and shitskin) permalink parent award report block reply Metal4Freedom 5 points 2 days ago Don't forget the 1/3rd of White males who vote commie. They are the worst traitors. permalink parent award report block reply\nMetal4Freedom 5 points 2 days ago Don't forget the 1/3rd of White males who vote commie. They are the worst traitors. permalink parent award report block reply\ntpactionchasethevote 2 points 2 days ago Why do the wealthy like socialism? permalink parent award report block reply\nToxicAvengerOhio 14 points 2 days ago Trump: \"How about $2000 and 50 year mortgage??\" permalink parent award report block reply Owmyballz 9 points 2 days ago All he's doing is adding to the poors which will ultimately go communist.  If the right doesn't addressing housing and jobs, the US is going to go into a real civil war before 2030. permalink parent award report block reply UCantStumpTheTrump 6 points 2 days ago Real estate prices have to go down... its one of many bubbles that has to be popped permalink parent award report block reply PeterThielAntiChrist 0 points 2 days ago there's not going to be a civil war. it will just tip socialist. you can't have a civil war if 95% of people benefit from a radical change. its called revolution. permalink parent award report block reply Owmyballz 1 points 1 day ago Nah its ok anarcho, we'll make sure to make you go easily into the night. permalink parent award report block reply view 3 more comments...\nOwmyballz 9 points 2 days ago All he's doing is adding to the poors which will ultimately go communist.  If the right doesn't addressing housing and jobs, the US is going to go into a real civil war before 2030. permalink parent award report block reply UCantStumpTheTrump 6 points 2 days ago Real estate prices have to go down... its one of many bubbles that has to be popped permalink parent award report block reply PeterThielAntiChrist 0 points 2 days ago there's not going to be a civil war. it will just tip socialist. you can't have a civil war if 95% of people benefit from a radical change. its called revolution. permalink parent award report block reply Owmyballz 1 points 1 day ago Nah its ok anarcho, we'll make sure to make you go easily into the night. permalink parent award report block reply view 3 more comments...\nUCantStumpTheTrump 6 points 2 days ago Real estate prices have to go down... its one of many bubbles that has to be popped permalink parent award report block reply\nPeterThielAntiChrist 0 points 2 days ago there's not going to be a civil war. it will just tip socialist. you can't have a civil war if 95% of people benefit from a radical change. its called revolution. permalink parent award report block reply Owmyballz 1 points 1 day ago Nah its ok anarcho, we'll make sure to make you go easily into the night. permalink parent award report block reply view 3 more comments...\nOwmyballz 1 points 1 day ago Nah its ok anarcho, we'll make sure to make you go easily into the night. permalink parent award report block reply view 3 more comments...\nBigMikesSwingingCock 11 points 2 days ago What do you MEAN fraud! It's perfectly normal to not have Election Day, but instead, to have Election month! That way, they can \"find\" all the ballots needed to win. All 100% of the \"found\" ballots just so happen to be straight democrat. They're not frauds, just clumsy, and \"lose\" things during all the election excitement! permalink parent award report block reply USDMaga 2 points 2 days ago Its also Oregon where I don't think they have any in person voting the day of the election to count.  Its all mail in ballots, and still can't count a week after. permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago Oregon went 100% mail-in voting and went permanently blue ever since. It's way easier to cheat, they'll even accept late ballots without postmarks, it's insane permalink parent award report block reply PeterThielAntiChrist 1 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago The odds of ALL of these extended-counting parties resulting in Democrat wins are ZERO. It always favors these cheating scumbags permalink parent award report block reply\nUSDMaga 2 points 2 days ago Its also Oregon where I don't think they have any in person voting the day of the election to count.  Its all mail in ballots, and still can't count a week after. permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago Oregon went 100% mail-in voting and went permanently blue ever since. It's way easier to cheat, they'll even accept late ballots without postmarks, it's insane permalink parent award report block reply\nUCantStumpTheTrump 4 points 2 days ago Oregon went 100% mail-in voting and went permanently blue ever since. It's way easier to cheat, they'll even accept late ballots without postmarks, it's insane permalink parent award report block reply\nPeterThielAntiChrist 1 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply\nUCantStumpTheTrump 1 points 2 days ago The odds of ALL of these extended-counting parties resulting in Democrat wins are ZERO. It always favors these cheating scumbags permalink parent award report block reply\nstargunner 4 points 2 days ago you ever been to seattle bro? this is the city that hosted CHAZ. they want this shit. permalink parent award report block reply\ntpactionchasethevote 3 points 2 days ago Why do the wealthy like socialism? permalink parent award report block reply UCantStumpTheTrump 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply\nUCantStumpTheTrump 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply\nScatter-Shot 19 points 2 days ago Seems like vote counting is slow when things are not going the establishment Democrat's way. permalink award report block reply Luvs_2_Bop 7 points 2 days ago Yup. And they’re already setting the stage for it to be “oh so close!” so no one questions it. The math doesn’t lie I suppose, it’s just rayciss sometimes lmao permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply\nLuvs_2_Bop 7 points 2 days ago Yup. And they’re already setting the stage for it to be “oh so close!” so no one questions it. The math doesn’t lie I suppose, it’s just rayciss sometimes lmao permalink parent award report block reply\nPeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply\nScumbag-reddit 19 points 2 days ago the socialist takeover gameplan: Destroy the ever living fuck out of the economy  and when the opposition gets in, blame him for the terrible costs and run on lowering the costs you elevated. permalink award report block reply FatigueIsReal 8 points 2 days ago That sounds like the Democrat and Republican playbook since the 50s. permalink parent award report block reply possibletower 10 points 2 days ago Since the 1910s. People keep forgetting about libshit Woodrow Wilson and his precious IRS and Federal Reserve permalink parent award report block reply\nFatigueIsReal 8 points 2 days ago That sounds like the Democrat and Republican playbook since the 50s. permalink parent award report block reply possibletower 10 points 2 days ago Since the 1910s. People keep forgetting about libshit Woodrow Wilson and his precious IRS and Federal Reserve permalink parent award report block reply\npossibletower 10 points 2 days ago Since the 1910s. People keep forgetting about libshit Woodrow Wilson and his precious IRS and Federal Reserve permalink parent award report block reply\nSeatacjoe 15 points 2 days ago The bar is so low in Seattle.   We had a kid fucker (literally) who ran Seattle and the kid he fucked was a street kid who just happened to overdose before his lawsuit against that john wayne gacey looking fuck.  Our political class who are installed like toilets is such a fuckin joke permalink award report block reply\nTokens_Worth 14 points 2 days ago WA elections.\nThe outcome is always predetermined. I had dinner with a friend and the WA GOP advisor.\nThis guy was a giant faggot. Im not kidding. Made claims \"better the GOP loses, cuz it helps fundraising\" TLDR: I left WA 3 years ago permalink award report block reply alex_p_keaton_III 7 points 2 days ago I've never donated to them and I never will.  This is exactly why. permalink parent award report block reply Mindcrym 2 points 2 days ago I'm embarrassed to say I am from Seattle. permalink parent award report block reply\nalex_p_keaton_III 7 points 2 days ago I've never donated to them and I never will.  This is exactly why. permalink parent award report block reply\nMindcrym 2 points 2 days ago I'm embarrassed to say I am from Seattle. permalink parent award report block reply\nschism OP 8 points 2 days ago SAUCE: https://www.dailymail.co.uk/news/article-15277339/Seattle-Mayor-Election-Katie-Wilson.html permalink award report block reply\nTheRPatriot 7 points 2 days ago Utter INSANITY. They literally don’t stop “counting” until they win. Never in my life since 2020 have I seen such debauchery occur. The counting MUST STOP AT MIDNIGHT ELECTION DAY permalink award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. washington went mail-in in the 90s. arizona was the first mail in state. permalink parent award report block reply nolefthandshakes 2 points 2 days ago why wouldn’t it though? NOTHING IS DONE ABOUT IT permalink parent award report block reply\nPeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. washington went mail-in in the 90s. arizona was the first mail in state. permalink parent award report block reply\nnolefthandshakes 2 points 2 days ago why wouldn’t it though? NOTHING IS DONE ABOUT IT permalink parent award report block reply\nHanging_Chad 6 points 2 days ago how hard is it to count? permalink award report block reply OG_BACONndEGGs 10 points 2 days ago Very hard for dems when you don't like the outcome. permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply\nOG_BACONndEGGs 10 points 2 days ago Very hard for dems when you don't like the outcome. permalink parent award report block reply\nPeterThielAntiChrist 2 points 2 days ago Washington is 100% mail in.  there is no in-person voting. Ballots postmarked by 8pm election day are counted. you have to wait for the ballots to come in. permalink parent award report block reply\nMediaBro 3 points 2 days ago The article implies that this is a bad thing. You have to understand, it's so bad for so many people, that her plight is actually understandable and probably is the reason why they voted for her. There are more people between 20 and 40 now being supported by their parents because of how many jobs are being lost and how bad the economy is getting. Don't get mad that people are voting for Socialists. They don't have much of a choice otherwise. permalink award report block reply\nSnek_Plissken 3 points 2 days ago Washington is done for and nothing is going to change that. There might be a few changes if removing minority districting can be challenged. They basically took Seattle votes to cut from the extreme north and south. Cutting huge swathes from anyone that would potentially vote anything but the left. There isn't even a racial gerrymander there. It's just eliminate anything that isn't left. I don't know who is even voting for the fentanyl army, but hopefully they have good handwriting. permalink award report block reply\nGalahad175 3 points 2 days ago Wait til they figure out chief Seattle was a slave owner permalink award report block reply\nEaszq8 3 points 2 days ago “We count the votes until we get the correct outcome.” permalink award report block reply\nhey_spike 2 points 2 days ago There have been socialists on the city council, so this is no surprise. permalink award report block reply\nDanIsSwell 2 points 2 days ago Annoying that the article never mentions her first name, keeps calling her “Wilson”. permalink award report block reply KennyKetchem 1 points 2 days ago https://ballotpedia.org/Mayoral_election_in_Seattle , Washington (2025) Katie Wilson permalink parent award report block reply\nKennyKetchem 1 points 2 days ago https://ballotpedia.org/Mayoral_election_in_Seattle , Washington (2025) Katie Wilson permalink parent award report block reply\nPorkchop-express 2 points 2 days ago I really feel like teaching communist and socialist classes in college is really hurting America permalink award report block reply\nSALTYinSeattle 2 points 2 days ago by an incredibly slim margin of 65 votes LMAO WUT?! 🤣 permalink award report block reply\nthp2034 2 points 2 days ago In Seattle it may well be fraud. The Democrats have a very well oiled election machine in Washington and it hinges on all mail-in voting & the I-5 corridor from Vancouver in the south to Bellingham in the north. The Dems control the corridor and hence control the entire State. it sucks.... permalink award report block reply\nstarjello 1 points 2 days ago Democrats got all major elections last Tuesday. Down vote away retards. You can't handle the truth so you'll never fix this country permalink award report block reply\nmav7579 1 points 2 days ago Mariner's Manager Damn Wilson should have used his influence in Seattle to sway the vote. permalink award report block reply\ntired-of-crap 1 points 2 days ago If the supreme court says no counting ballots that arrive after election day, their advantage will be GONE. permalink award report block reply\nknnbccb 1 points 2 days ago As far as I'm concerned, if you are a socialist you should be shot, long before you are presented as a viable candidate for any election. Consider doing this to every single registered member of the DSA. permalink award report block reply\nTerdBergler 1 points 2 days ago If only the right would be active instead of demanding the government, that serves the communist revolution, fix itself. I did see some stuff for people talking about getting into election monitoring and the like, but we've got to be more active. When the left and the government are working together against us, we can only rely on our side doing something. permalink award report block reply\nRockFlagAndEagle2020 1 points 1 day ago Boomers - don't get your panties all twisted. If your unwilling to come down on the price you think your homes & 401k are worth don't start crying when communists take over. permalink award report block reply\nSaxonRealm 1 points 2 days ago Seattle voters are retarded. Wtf is wrong with white people in Washington and Oregon? permalink award report block reply\nChickenStrips 1 points 2 days ago Boeing should move the hell out of that city. permalink award report block reply\nPatriotForTN 1 points 2 days ago They have had \"democratic socialist\" mayors for quite some time. Daily Mail is a stupid, fake tabloid. permalink award report block reply",
  "fetched_at": "2025-11-12T23:01:52.879347Z"
}