{
  "id": "1ARK9nQBE3",
  "url": "https://patriots.win/p/1ARK9nQBE3/is-it-high-time-for-another-trum/c",
  "content": "74 Is it High Time for Another TRUMP RALLY?\nTo let him hear the true feelings and concerns of MAGA? posted 3 hours ago by frenacrossthepond 11 comments award share download report block\n11 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MrMcGreenGenes 5 points 3 hours ago We need to make a big beautiful chart showing what caused Americans to lose all their talents, and jobs. permalink award report block reply TrailLover1536 2 points 2 hours ago Very much needed for sure 💯💯💯 permalink award report block reply SupFrens 2 points 2 hours ago NO MORE FUCKING JEETS OR MUZZIES!!!!!!!!!!!!!! DEPORT THEM ALL!!!!!!!!!!!!!! permalink award report block reply TrumpWonByALandslide 1 points 2 hours ago Yes, and I hope the entire crowd boos him so he gets the message. So tired of this shit. He is completely out-of-touch with the base, doesn't he listen to J.D. at all? permalink award report block reply shogun5000 1 points 2 hours ago He doesn't give a fuck about a rally anymore for you stupid, incapable white Americans. permalink award report block reply frenacrossthepond OP 0 points 3 hours ago I'm gonna say YES. permalink award report block reply MemphisMontoya71 7 points 3 hours ago Waste of time, Trump isn't listening to his base anymore. permalink parent award report block reply frenacrossthepond OP 1 points 3 hours ago Just giving up like that after 9 months, when there are more than 3 years left is exactly what the dem party would want. Let's see if he really has become tone deaf by giving him a chance to explain himself at a rally. permalink parent award report block reply MemeWarsVet 4 points 3 hours ago 1 year left FIFY since, at this rate, he'll lose all of congress and deservedly so. permalink parent award report block reply frenacrossthepond OP 1 points 3 hours ago Yeah but afaik this happens to pretty much every administration since like forever. permalink parent award report block reply drmrboy -1 points 3 hours ago ☝️☝️☝️☝️☝️☝️☝️ permalink parent award report block reply Crappydatum -3 points 2 hours ago So it's easier to shoot him? permalink award report block reply\nMrMcGreenGenes 5 points 3 hours ago We need to make a big beautiful chart showing what caused Americans to lose all their talents, and jobs. permalink award report block reply\nTrailLover1536 2 points 2 hours ago Very much needed for sure 💯💯💯 permalink award report block reply\nSupFrens 2 points 2 hours ago NO MORE FUCKING JEETS OR MUZZIES!!!!!!!!!!!!!! DEPORT THEM ALL!!!!!!!!!!!!!! permalink award report block reply\nTrumpWonByALandslide 1 points 2 hours ago Yes, and I hope the entire crowd boos him so he gets the message. So tired of this shit. He is completely out-of-touch with the base, doesn't he listen to J.D. at all? permalink award report block reply\nshogun5000 1 points 2 hours ago He doesn't give a fuck about a rally anymore for you stupid, incapable white Americans. permalink award report block reply\nfrenacrossthepond OP 0 points 3 hours ago I'm gonna say YES. permalink award report block reply MemphisMontoya71 7 points 3 hours ago Waste of time, Trump isn't listening to his base anymore. permalink parent award report block reply frenacrossthepond OP 1 points 3 hours ago Just giving up like that after 9 months, when there are more than 3 years left is exactly what the dem party would want. Let's see if he really has become tone deaf by giving him a chance to explain himself at a rally. permalink parent award report block reply MemeWarsVet 4 points 3 hours ago 1 year left FIFY since, at this rate, he'll lose all of congress and deservedly so. permalink parent award report block reply frenacrossthepond OP 1 points 3 hours ago Yeah but afaik this happens to pretty much every administration since like forever. permalink parent award report block reply drmrboy -1 points 3 hours ago ☝️☝️☝️☝️☝️☝️☝️ permalink parent award report block reply\nMemphisMontoya71 7 points 3 hours ago Waste of time, Trump isn't listening to his base anymore. permalink parent award report block reply frenacrossthepond OP 1 points 3 hours ago Just giving up like that after 9 months, when there are more than 3 years left is exactly what the dem party would want. Let's see if he really has become tone deaf by giving him a chance to explain himself at a rally. permalink parent award report block reply MemeWarsVet 4 points 3 hours ago 1 year left FIFY since, at this rate, he'll lose all of congress and deservedly so. permalink parent award report block reply frenacrossthepond OP 1 points 3 hours ago Yeah but afaik this happens to pretty much every administration since like forever. permalink parent award report block reply drmrboy -1 points 3 hours ago ☝️☝️☝️☝️☝️☝️☝️ permalink parent award report block reply\nfrenacrossthepond OP 1 points 3 hours ago Just giving up like that after 9 months, when there are more than 3 years left is exactly what the dem party would want. Let's see if he really has become tone deaf by giving him a chance to explain himself at a rally. permalink parent award report block reply MemeWarsVet 4 points 3 hours ago 1 year left FIFY since, at this rate, he'll lose all of congress and deservedly so. permalink parent award report block reply frenacrossthepond OP 1 points 3 hours ago Yeah but afaik this happens to pretty much every administration since like forever. permalink parent award report block reply\nMemeWarsVet 4 points 3 hours ago 1 year left FIFY since, at this rate, he'll lose all of congress and deservedly so. permalink parent award report block reply frenacrossthepond OP 1 points 3 hours ago Yeah but afaik this happens to pretty much every administration since like forever. permalink parent award report block reply\nfrenacrossthepond OP 1 points 3 hours ago Yeah but afaik this happens to pretty much every administration since like forever. permalink parent award report block reply\ndrmrboy -1 points 3 hours ago ☝️☝️☝️☝️☝️☝️☝️ permalink parent award report block reply\nCrappydatum -3 points 2 hours ago So it's easier to shoot him? permalink award report block reply",
  "fetched_at": "2025-11-12T22:58:43.270413Z"
}