{
  "id": "1ARK513JCc",
  "url": "https://patriots.win/p/1ARK513JCc/fuck-allah-/c",
  "content": "546 Fuck Allah posted 6 days ago by wst4 48 comments award share report block Juanita Broaddrick @atensnut • 7d THIS IS REAL!!   Not AI.  God help us! Mr. Star Spangled MAGA @4thOfJuly365 • 7d Allah is NOT the God of Jesus and Moses. There is only one King of Kings, Lord of Lords, the Alpha and the Omega... Jesus Christ of Nazareth.\n48 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Trooph-Hurts 37 points 6 days ago These people have nothing to offer other than this kind of bullshit…. And what he means by entering everybody’s home, they’re gonna go in your home and kill you if you don’t permalink award report block reply TearsAficionado 9 points 6 days ago Yes, that's exactly what he means. permalink parent award report block reply NomadicKrow2 1 points 6 days ago Here's where it crosses out of the realm of \"Religious freedom\" and enters ideology territory. It makes it legal to ban it. Yeah, you'll have some court dates and all that shit, as with anything Trump tries, but I think focusing on the evil message of Islam, having apostates testify to the harrowing ordeals they face, having Christians from Muslims nations testify, etc, could swing any judge but a Muslim judge. permalink parent award report block reply fskfsk 1 points 6 days ago Islam doesn't teach \"We just want to live our lives.\"  Islam teaches \"All non-Muslims must be converted, forcibly subjugated, or killed.\" Unfortunately, there is no ability to ban Islam at this point.  Too many cucks in Congress, and too many cuck/commie judges. permalink parent award report block reply MAGABOND 5 points 6 days ago Ugliest language known to man. permalink parent award report block reply Trooph-Hurts 2 points 6 days ago Armpit of the world permalink parent award report block reply Duce30 24 points 6 days ago Religion of pedos and pedo worshippers. permalink award report block reply CommonSenseAmerican 16 points 6 days ago and bestiality. Baphomet has a goats head, seems appropriate in a way. permalink parent award report block reply DeportThemAllForever 10 points 6 days ago They are very aggressive people.  This is why we can’t allow this migration to continue, we will get replaced.  Culture incompatibility. Freedom of religion was meant for Christians, not Muslims or Indians (dots and feathers)… permalink parent award report block reply Psalm-118_24 15 points 6 days ago islam is not compatible with US Constitution. Everyone of these pigs should be arrested for treason and deported to an islamic country. permalink award report block reply IAmRetard 13 points 6 days ago I can think of a couple of ways it stops. permalink award report block reply 1True-translation 11 points 6 days ago They don't realize that the enemy they need to conquer hasn't even begun to fight. permalink parent award report block reply imnotdeadyet 2 points 6 days ago It should be interesting. permalink parent award report block reply DickweedDewine 1 points 6 days ago I don’t think it matters when the enemy their trying to conquer doesn’t even attempt to fight back.. see Dearborn, Minnesota, now NYC… slowly but surely taking over while the rest just sit and watch thinking “oh that won’t happen here..” permalink parent award report block reply TwoArizonaPedes 4 points 6 days ago I don’t think it matters when the enemy their trying to conquer doesn’t even attempt to fight back We are fighting. Why aren't you? permalink parent award report block reply fskfsk 1 points 6 days ago And also all of Europe.  Everyone is just rolling over and taking it, sold out by their leaders.  Even the right-wing politicians are still saying \"Vote harder and we can solve this problem!\"  Nope, too late for that. In the US, the big moment will be when they flip Texas.  There's a real push for Muslims to colonize Texas.  If Texas flips Democrat, Republicans are permafucked. permalink parent award report block reply TwoArizonaPedes 12 points 6 days ago That's Muslim bravado. Ignore it and FIGHT. Pick a name or organization below and get involved. At the very least, subscribe to the Youtube channels of Dr. David Wood , Ridvan Aydemir the Apostate Prophet , and Sam Shamoun and start learning. Asmirandah, Ayaan Hirsi Ali, Mina Ahadi, Ridvan Aydemir, Gavin Boby, Matthew Bracken, Ashley Bumgarner, Joyce Chernick, Pat Condell, Nonie Darwish, Turan Dursun, Kacem El Ghazzali, Zineb El Rhazoui, Omar Farooq, Brigitte Gabriel, Stephen Gash, Pamela Geller, Valentina Gomez, Keith Graves, John Guandolo, Kenza Haddock, Sarah Haider, Raymond Ibrahim, Victoria Jackson, Sabatina James, James Jesser, Dr. Ahmed Joktan, Zara Kay, Cliff Kincaid, Massin Kevin Labidi, Marine Le Pen, Ezra Levant, Derya Little, Stephen Miller, Yasmine Mohammed, Douglas Murray, Maryam Namazie, Armin Navabi, Anders Gravers Pedersen, Christian Prince, Michelle Qureshi, Dr. Nabeel Qureshi, Sarah Wajd Qureshi, Abdul Rahman, Tommy Robinson, Salman Rushdie, Aliyah Saleem, Abdullah Sameer, Sam Shamoun, Imtiaz Shams, Ali Sina, Dr. Jay Smith, Robert Spencer, Harris Sultan, Wafa Sultan, Hatun Tash, Theo van Gogh, Eva Vlaardingerbroek, Dr. Bill Warner, Geert Wilders, Dr. David Wood, David Yerushalmi, Mosab Hassan Yousef, Iman Xmuslim, and more. North America: Act For America America First Legal American Freedom Law Center Answering Muslims Apologetics Roadshow Bradley Foundation Center for the Study of Political Islam (CSPI) Christian Warrior Training Ex-Muslims of North America (EXMNA) Former Muslims United (U.S.) Gates of Vienna Jihad Watch RAIR Foundation USA (Rise Align Ignite Reclaim) Souls & Liberty Stop Islamization of America (SIOA) The Religion of Peace (TROP) Young Apostates (U.S.) Europe: Alliance of Former Muslims (Ireland) Alternative for Germany (AfD) Association of Ex-Muslims of Switzerland Britain First Central Committee for Ex-Muslims of Scandinavia Central Council of Ex-Muslims (ZdE) (Germany) Council of Ex-Muslims of Britain (CEMB) (UK) Council of Ex-Muslims of France (CEMF) Defend Christ Critique Islam (DCCI) Ex-Muslims Initiative (Austria) Ex-Muslims North Meetup Group (UK) Ex-Muslims of Scotland Ex-Muslims of Norway Ex-Muslims of the Netherlands Ex-musulmani d'Italia (Italy) Faith to Faithless (UK) Hyde Park Christian Fellowship Movement of Ex-Muslims (Belgium) Platform New Freethinkers (Netherlands) Stop Islamization of Denmark Stop Islamization of Europe (SIOE) Elsewhere: Association of Atheism (Turkey) Atheist & Agnostic Alliance (Pakistan) Atheist Alliance of the Middle East and North Africa Atheist Republic (Iran) Council of Ex-Muslims of Jordan Council of Ex-Muslims of Morocco (CEMM) Council of Ex-Muslims of New Zealand Council of Ex-Muslims of Singapore Council of Ex-Muslims of Sri Lanka Ex-Muslims of Kerala (India) Ex-Muslims of South Africa National Sovereign Action (South Korea) Faithless Hijabi (Australia) Iranian Atheists & Agnostics Iranian Humanist Atheists & Agnostics Q Society of Australia Stop Islamization of Nations (SION) permalink award report block reply Bullet3250 12 points 6 days ago This video needs to go out to the Muslim world in in the West. Can Muslims Explain the Weirdest Story About Muhammad Ever. https://www.youtube.com/watch?v=OtqFzOjclL8 permalink award report block reply TwoArizonaPedes 4 points 6 days ago Yes. Keep spreading this far and wide. permalink parent award report block reply MAG-n-KAG 3 points 6 days ago tldw allah went into the desert to get gangbanged all night long by a group of black dudes.  his disciple witnessed the whole thing.  then allah limped back home in pain. no shit, thats literally the story. permalink parent award report block reply nakedjay 2 points 6 days ago On top of Mohammed dying exactly the way he described how false prophets would die. Most Muslims haven't read the Quran or the ones that have read it in Arabic and don't understand because it's not their native language. permalink parent award report block reply Bullet3250 2 points 6 days ago It's also almost impossible to understand because it was rearranged early on.. and other scholars have stated that 'many parts must be missing' permalink parent award report block reply michealr24 7 points 6 days ago lets hypothetically strike first. lets stop being pussies on the internet and go do shit. permalink award report block reply TwoArizonaPedes 5 points 6 days ago Yes! We are fighting. Join us! permalink parent award report block reply Firespawn 6 points 6 days ago We're going to have to eradicate these goatfucking inbreds ourselves it seems. They will come like locusts. permalink award report block reply BillGateCanSuckIt 5 points 6 days ago And for no reason the killing started permalink award report block reply yummy_yumm_yumms 1 points 6 days ago Sign me up when it all goes down. permalink parent award report block reply PhantomShield72 4 points 6 days ago After careful consideration, I've decided to become more extreme in my religious beliefs... permalink award report block reply Choomguy 4 points 6 days ago ….cleans weapons…. permalink award report block reply GreyKnight 3 points 6 days ago The holy war on our soil is going to be lit…or probably just gay like it has been since Obama…immigration, not enough deportations, little action… …wonder what the libs will do this time…? Leave or side with the Muslims like they already are…or both I suppose. permalink award report block reply TearsAficionado 3 points 6 days ago Without a shot fired. Our founding fathers are probably rolling over in their graves with this shit. permalink award report block reply PhantomShield72 3 points 6 days ago They would utterly disown us if they could... permalink parent award report block reply FearGodTheAlmighty 3 points 6 days ago CHRIST is King👑 permalink award report block reply yummy_yumm_yumms 2 points 6 days ago Goat raping faggots, all of them. Inbred as fuck. permalink award report block reply hillaryforprison 2 points 6 days ago Not even 24 hours pass after the fake election and they're already starting this in the streets. Can the feds not stop it? If Christians take over a street leftards would lose it, but somehow they allow a terrorist hate cult? permalink award report block reply HeatherSwanson 1 points 6 days ago But only Sunii Islam. If you are Muslim but Shia or Sufi or anything else, you will die a horrible death! permalink award report block reply TwoArizonaPedes 3 points 6 days ago They all follow the same Quran. permalink parent award report block reply Moose_Antlers 1 points 6 days ago Honestly, the world needs to see this. There are far too many people who still believe the multicultist fairy tale about a Religion of Peace(tm). They need to see what this is. The collective west right now is being systematically dismantled by people exploiting rich, pampered white women who buy into the rainbows and unicorns Santa Claus promises. These women vote for this crap and think it's a moral good, but never learn any better because they don't have to deal with the consequences. They are protected by a masculine shield and their own privilege, so they never appreciate the danger. Remigration now, or Reconquista. That's what it's going to take. Pick one of those, or submit to being their slave. Either way, the damage is done. They're already here. Our once-free country is gone. It's decision time. permalink award report block reply thisaintitchief76 1 points 6 days ago I will defend my home when evil knocks. I will not shed tears or even give a thought to those who voted themselves into the muslim hoard. I will not defend them, nor attack them. Just watch, as their worlds are torn to pieces. permalink award report block reply glow-operator-2-0 1 points 6 days ago Muhammed Sex Simulator 2015. permalink award report block reply Seatacjoe 1 points 6 days ago Fuck ISLAM permalink award report block reply CSIS_CIA_pure-evil 1 points 6 days ago Most excellent. I hope they quickly overplay their hand so that the majority awakens to the danger this evil cult poses to our civilization. permalink award report block reply 1True-translation 1 points 6 days ago All those woke atheists who supported this invasion are going to be so disappointed lol. Retards permalink award report block reply parkchunghee 1 points 6 days ago It is if you happen to speak Arabic. permalink award report block reply SaxonRealm 1 points 6 days ago It is all middle eastern nonsense. Get back to your roots. permalink award report block reply BeefFarmerForTrump 0 points 6 days ago Religion is always the problem. I've made it 38yrs without any and I just dont see why the need for it. permalink award report block reply Dev404 0 points 6 days ago Religion is used to bring people together, for good and bad. Religion is used to pass down values. It has it's place. What the actual problem is comes down to human nature. We all have our biases and willingness to do evil shit for our own gain, regardless of whatever religion. For people looking to do evil shit in the name of some religion, religion is just a tool, they don't even necessarily believe in it, but can manipulate who do. Ideally, religion can provide guidance for people to not live just for themselves and \"fuck everyone who's not me or my family.\" Religion is at least as valuable as books, good for passing down lessons, values, and information, but can be used for nefarious purposes by bad people. permalink parent award report block reply TheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nTrooph-Hurts 37 points 6 days ago These people have nothing to offer other than this kind of bullshit…. And what he means by entering everybody’s home, they’re gonna go in your home and kill you if you don’t permalink award report block reply TearsAficionado 9 points 6 days ago Yes, that's exactly what he means. permalink parent award report block reply NomadicKrow2 1 points 6 days ago Here's where it crosses out of the realm of \"Religious freedom\" and enters ideology territory. It makes it legal to ban it. Yeah, you'll have some court dates and all that shit, as with anything Trump tries, but I think focusing on the evil message of Islam, having apostates testify to the harrowing ordeals they face, having Christians from Muslims nations testify, etc, could swing any judge but a Muslim judge. permalink parent award report block reply fskfsk 1 points 6 days ago Islam doesn't teach \"We just want to live our lives.\"  Islam teaches \"All non-Muslims must be converted, forcibly subjugated, or killed.\" Unfortunately, there is no ability to ban Islam at this point.  Too many cucks in Congress, and too many cuck/commie judges. permalink parent award report block reply MAGABOND 5 points 6 days ago Ugliest language known to man. permalink parent award report block reply Trooph-Hurts 2 points 6 days ago Armpit of the world permalink parent award report block reply\nTearsAficionado 9 points 6 days ago Yes, that's exactly what he means. permalink parent award report block reply NomadicKrow2 1 points 6 days ago Here's where it crosses out of the realm of \"Religious freedom\" and enters ideology territory. It makes it legal to ban it. Yeah, you'll have some court dates and all that shit, as with anything Trump tries, but I think focusing on the evil message of Islam, having apostates testify to the harrowing ordeals they face, having Christians from Muslims nations testify, etc, could swing any judge but a Muslim judge. permalink parent award report block reply fskfsk 1 points 6 days ago Islam doesn't teach \"We just want to live our lives.\"  Islam teaches \"All non-Muslims must be converted, forcibly subjugated, or killed.\" Unfortunately, there is no ability to ban Islam at this point.  Too many cucks in Congress, and too many cuck/commie judges. permalink parent award report block reply\nNomadicKrow2 1 points 6 days ago Here's where it crosses out of the realm of \"Religious freedom\" and enters ideology territory. It makes it legal to ban it. Yeah, you'll have some court dates and all that shit, as with anything Trump tries, but I think focusing on the evil message of Islam, having apostates testify to the harrowing ordeals they face, having Christians from Muslims nations testify, etc, could swing any judge but a Muslim judge. permalink parent award report block reply fskfsk 1 points 6 days ago Islam doesn't teach \"We just want to live our lives.\"  Islam teaches \"All non-Muslims must be converted, forcibly subjugated, or killed.\" Unfortunately, there is no ability to ban Islam at this point.  Too many cucks in Congress, and too many cuck/commie judges. permalink parent award report block reply\nfskfsk 1 points 6 days ago Islam doesn't teach \"We just want to live our lives.\"  Islam teaches \"All non-Muslims must be converted, forcibly subjugated, or killed.\" Unfortunately, there is no ability to ban Islam at this point.  Too many cucks in Congress, and too many cuck/commie judges. permalink parent award report block reply\nMAGABOND 5 points 6 days ago Ugliest language known to man. permalink parent award report block reply Trooph-Hurts 2 points 6 days ago Armpit of the world permalink parent award report block reply\nTrooph-Hurts 2 points 6 days ago Armpit of the world permalink parent award report block reply\nDuce30 24 points 6 days ago Religion of pedos and pedo worshippers. permalink award report block reply CommonSenseAmerican 16 points 6 days ago and bestiality. Baphomet has a goats head, seems appropriate in a way. permalink parent award report block reply DeportThemAllForever 10 points 6 days ago They are very aggressive people.  This is why we can’t allow this migration to continue, we will get replaced.  Culture incompatibility. Freedom of religion was meant for Christians, not Muslims or Indians (dots and feathers)… permalink parent award report block reply\nCommonSenseAmerican 16 points 6 days ago and bestiality. Baphomet has a goats head, seems appropriate in a way. permalink parent award report block reply\nDeportThemAllForever 10 points 6 days ago They are very aggressive people.  This is why we can’t allow this migration to continue, we will get replaced.  Culture incompatibility. Freedom of religion was meant for Christians, not Muslims or Indians (dots and feathers)… permalink parent award report block reply\nPsalm-118_24 15 points 6 days ago islam is not compatible with US Constitution. Everyone of these pigs should be arrested for treason and deported to an islamic country. permalink award report block reply\nIAmRetard 13 points 6 days ago I can think of a couple of ways it stops. permalink award report block reply 1True-translation 11 points 6 days ago They don't realize that the enemy they need to conquer hasn't even begun to fight. permalink parent award report block reply imnotdeadyet 2 points 6 days ago It should be interesting. permalink parent award report block reply DickweedDewine 1 points 6 days ago I don’t think it matters when the enemy their trying to conquer doesn’t even attempt to fight back.. see Dearborn, Minnesota, now NYC… slowly but surely taking over while the rest just sit and watch thinking “oh that won’t happen here..” permalink parent award report block reply TwoArizonaPedes 4 points 6 days ago I don’t think it matters when the enemy their trying to conquer doesn’t even attempt to fight back We are fighting. Why aren't you? permalink parent award report block reply fskfsk 1 points 6 days ago And also all of Europe.  Everyone is just rolling over and taking it, sold out by their leaders.  Even the right-wing politicians are still saying \"Vote harder and we can solve this problem!\"  Nope, too late for that. In the US, the big moment will be when they flip Texas.  There's a real push for Muslims to colonize Texas.  If Texas flips Democrat, Republicans are permafucked. permalink parent award report block reply\n1True-translation 11 points 6 days ago They don't realize that the enemy they need to conquer hasn't even begun to fight. permalink parent award report block reply imnotdeadyet 2 points 6 days ago It should be interesting. permalink parent award report block reply DickweedDewine 1 points 6 days ago I don’t think it matters when the enemy their trying to conquer doesn’t even attempt to fight back.. see Dearborn, Minnesota, now NYC… slowly but surely taking over while the rest just sit and watch thinking “oh that won’t happen here..” permalink parent award report block reply TwoArizonaPedes 4 points 6 days ago I don’t think it matters when the enemy their trying to conquer doesn’t even attempt to fight back We are fighting. Why aren't you? permalink parent award report block reply fskfsk 1 points 6 days ago And also all of Europe.  Everyone is just rolling over and taking it, sold out by their leaders.  Even the right-wing politicians are still saying \"Vote harder and we can solve this problem!\"  Nope, too late for that. In the US, the big moment will be when they flip Texas.  There's a real push for Muslims to colonize Texas.  If Texas flips Democrat, Republicans are permafucked. permalink parent award report block reply\nimnotdeadyet 2 points 6 days ago It should be interesting. permalink parent award report block reply\nDickweedDewine 1 points 6 days ago I don’t think it matters when the enemy their trying to conquer doesn’t even attempt to fight back.. see Dearborn, Minnesota, now NYC… slowly but surely taking over while the rest just sit and watch thinking “oh that won’t happen here..” permalink parent award report block reply TwoArizonaPedes 4 points 6 days ago I don’t think it matters when the enemy their trying to conquer doesn’t even attempt to fight back We are fighting. Why aren't you? permalink parent award report block reply fskfsk 1 points 6 days ago And also all of Europe.  Everyone is just rolling over and taking it, sold out by their leaders.  Even the right-wing politicians are still saying \"Vote harder and we can solve this problem!\"  Nope, too late for that. In the US, the big moment will be when they flip Texas.  There's a real push for Muslims to colonize Texas.  If Texas flips Democrat, Republicans are permafucked. permalink parent award report block reply\nTwoArizonaPedes 4 points 6 days ago I don’t think it matters when the enemy their trying to conquer doesn’t even attempt to fight back We are fighting. Why aren't you? permalink parent award report block reply\nfskfsk 1 points 6 days ago And also all of Europe.  Everyone is just rolling over and taking it, sold out by their leaders.  Even the right-wing politicians are still saying \"Vote harder and we can solve this problem!\"  Nope, too late for that. In the US, the big moment will be when they flip Texas.  There's a real push for Muslims to colonize Texas.  If Texas flips Democrat, Republicans are permafucked. permalink parent award report block reply\nTwoArizonaPedes 12 points 6 days ago That's Muslim bravado. Ignore it and FIGHT. Pick a name or organization below and get involved. At the very least, subscribe to the Youtube channels of Dr. David Wood , Ridvan Aydemir the Apostate Prophet , and Sam Shamoun and start learning. Asmirandah, Ayaan Hirsi Ali, Mina Ahadi, Ridvan Aydemir, Gavin Boby, Matthew Bracken, Ashley Bumgarner, Joyce Chernick, Pat Condell, Nonie Darwish, Turan Dursun, Kacem El Ghazzali, Zineb El Rhazoui, Omar Farooq, Brigitte Gabriel, Stephen Gash, Pamela Geller, Valentina Gomez, Keith Graves, John Guandolo, Kenza Haddock, Sarah Haider, Raymond Ibrahim, Victoria Jackson, Sabatina James, James Jesser, Dr. Ahmed Joktan, Zara Kay, Cliff Kincaid, Massin Kevin Labidi, Marine Le Pen, Ezra Levant, Derya Little, Stephen Miller, Yasmine Mohammed, Douglas Murray, Maryam Namazie, Armin Navabi, Anders Gravers Pedersen, Christian Prince, Michelle Qureshi, Dr. Nabeel Qureshi, Sarah Wajd Qureshi, Abdul Rahman, Tommy Robinson, Salman Rushdie, Aliyah Saleem, Abdullah Sameer, Sam Shamoun, Imtiaz Shams, Ali Sina, Dr. Jay Smith, Robert Spencer, Harris Sultan, Wafa Sultan, Hatun Tash, Theo van Gogh, Eva Vlaardingerbroek, Dr. Bill Warner, Geert Wilders, Dr. David Wood, David Yerushalmi, Mosab Hassan Yousef, Iman Xmuslim, and more. North America: Act For America America First Legal American Freedom Law Center Answering Muslims Apologetics Roadshow Bradley Foundation Center for the Study of Political Islam (CSPI) Christian Warrior Training Ex-Muslims of North America (EXMNA) Former Muslims United (U.S.) Gates of Vienna Jihad Watch RAIR Foundation USA (Rise Align Ignite Reclaim) Souls & Liberty Stop Islamization of America (SIOA) The Religion of Peace (TROP) Young Apostates (U.S.) Europe: Alliance of Former Muslims (Ireland) Alternative for Germany (AfD) Association of Ex-Muslims of Switzerland Britain First Central Committee for Ex-Muslims of Scandinavia Central Council of Ex-Muslims (ZdE) (Germany) Council of Ex-Muslims of Britain (CEMB) (UK) Council of Ex-Muslims of France (CEMF) Defend Christ Critique Islam (DCCI) Ex-Muslims Initiative (Austria) Ex-Muslims North Meetup Group (UK) Ex-Muslims of Scotland Ex-Muslims of Norway Ex-Muslims of the Netherlands Ex-musulmani d'Italia (Italy) Faith to Faithless (UK) Hyde Park Christian Fellowship Movement of Ex-Muslims (Belgium) Platform New Freethinkers (Netherlands) Stop Islamization of Denmark Stop Islamization of Europe (SIOE) Elsewhere: Association of Atheism (Turkey) Atheist & Agnostic Alliance (Pakistan) Atheist Alliance of the Middle East and North Africa Atheist Republic (Iran) Council of Ex-Muslims of Jordan Council of Ex-Muslims of Morocco (CEMM) Council of Ex-Muslims of New Zealand Council of Ex-Muslims of Singapore Council of Ex-Muslims of Sri Lanka Ex-Muslims of Kerala (India) Ex-Muslims of South Africa National Sovereign Action (South Korea) Faithless Hijabi (Australia) Iranian Atheists & Agnostics Iranian Humanist Atheists & Agnostics Q Society of Australia Stop Islamization of Nations (SION) permalink award report block reply\nBullet3250 12 points 6 days ago This video needs to go out to the Muslim world in in the West. Can Muslims Explain the Weirdest Story About Muhammad Ever. https://www.youtube.com/watch?v=OtqFzOjclL8 permalink award report block reply TwoArizonaPedes 4 points 6 days ago Yes. Keep spreading this far and wide. permalink parent award report block reply MAG-n-KAG 3 points 6 days ago tldw allah went into the desert to get gangbanged all night long by a group of black dudes.  his disciple witnessed the whole thing.  then allah limped back home in pain. no shit, thats literally the story. permalink parent award report block reply nakedjay 2 points 6 days ago On top of Mohammed dying exactly the way he described how false prophets would die. Most Muslims haven't read the Quran or the ones that have read it in Arabic and don't understand because it's not their native language. permalink parent award report block reply Bullet3250 2 points 6 days ago It's also almost impossible to understand because it was rearranged early on.. and other scholars have stated that 'many parts must be missing' permalink parent award report block reply\nTwoArizonaPedes 4 points 6 days ago Yes. Keep spreading this far and wide. permalink parent award report block reply\nMAG-n-KAG 3 points 6 days ago tldw allah went into the desert to get gangbanged all night long by a group of black dudes.  his disciple witnessed the whole thing.  then allah limped back home in pain. no shit, thats literally the story. permalink parent award report block reply\nnakedjay 2 points 6 days ago On top of Mohammed dying exactly the way he described how false prophets would die. Most Muslims haven't read the Quran or the ones that have read it in Arabic and don't understand because it's not their native language. permalink parent award report block reply Bullet3250 2 points 6 days ago It's also almost impossible to understand because it was rearranged early on.. and other scholars have stated that 'many parts must be missing' permalink parent award report block reply\nBullet3250 2 points 6 days ago It's also almost impossible to understand because it was rearranged early on.. and other scholars have stated that 'many parts must be missing' permalink parent award report block reply\nmichealr24 7 points 6 days ago lets hypothetically strike first. lets stop being pussies on the internet and go do shit. permalink award report block reply TwoArizonaPedes 5 points 6 days ago Yes! We are fighting. Join us! permalink parent award report block reply\nTwoArizonaPedes 5 points 6 days ago Yes! We are fighting. Join us! permalink parent award report block reply\nFirespawn 6 points 6 days ago We're going to have to eradicate these goatfucking inbreds ourselves it seems. They will come like locusts. permalink award report block reply\nBillGateCanSuckIt 5 points 6 days ago And for no reason the killing started permalink award report block reply yummy_yumm_yumms 1 points 6 days ago Sign me up when it all goes down. permalink parent award report block reply\nyummy_yumm_yumms 1 points 6 days ago Sign me up when it all goes down. permalink parent award report block reply\nPhantomShield72 4 points 6 days ago After careful consideration, I've decided to become more extreme in my religious beliefs... permalink award report block reply\nChoomguy 4 points 6 days ago ….cleans weapons…. permalink award report block reply\nGreyKnight 3 points 6 days ago The holy war on our soil is going to be lit…or probably just gay like it has been since Obama…immigration, not enough deportations, little action… …wonder what the libs will do this time…? Leave or side with the Muslims like they already are…or both I suppose. permalink award report block reply\nTearsAficionado 3 points 6 days ago Without a shot fired. Our founding fathers are probably rolling over in their graves with this shit. permalink award report block reply PhantomShield72 3 points 6 days ago They would utterly disown us if they could... permalink parent award report block reply\nPhantomShield72 3 points 6 days ago They would utterly disown us if they could... permalink parent award report block reply\nFearGodTheAlmighty 3 points 6 days ago CHRIST is King👑 permalink award report block reply\nyummy_yumm_yumms 2 points 6 days ago Goat raping faggots, all of them. Inbred as fuck. permalink award report block reply\nhillaryforprison 2 points 6 days ago Not even 24 hours pass after the fake election and they're already starting this in the streets. Can the feds not stop it? If Christians take over a street leftards would lose it, but somehow they allow a terrorist hate cult? permalink award report block reply\nHeatherSwanson 1 points 6 days ago But only Sunii Islam. If you are Muslim but Shia or Sufi or anything else, you will die a horrible death! permalink award report block reply TwoArizonaPedes 3 points 6 days ago They all follow the same Quran. permalink parent award report block reply\nTwoArizonaPedes 3 points 6 days ago They all follow the same Quran. permalink parent award report block reply\nMoose_Antlers 1 points 6 days ago Honestly, the world needs to see this. There are far too many people who still believe the multicultist fairy tale about a Religion of Peace(tm). They need to see what this is. The collective west right now is being systematically dismantled by people exploiting rich, pampered white women who buy into the rainbows and unicorns Santa Claus promises. These women vote for this crap and think it's a moral good, but never learn any better because they don't have to deal with the consequences. They are protected by a masculine shield and their own privilege, so they never appreciate the danger. Remigration now, or Reconquista. That's what it's going to take. Pick one of those, or submit to being their slave. Either way, the damage is done. They're already here. Our once-free country is gone. It's decision time. permalink award report block reply\nthisaintitchief76 1 points 6 days ago I will defend my home when evil knocks. I will not shed tears or even give a thought to those who voted themselves into the muslim hoard. I will not defend them, nor attack them. Just watch, as their worlds are torn to pieces. permalink award report block reply\nglow-operator-2-0 1 points 6 days ago Muhammed Sex Simulator 2015. permalink award report block reply\nSeatacjoe 1 points 6 days ago Fuck ISLAM permalink award report block reply\nCSIS_CIA_pure-evil 1 points 6 days ago Most excellent. I hope they quickly overplay their hand so that the majority awakens to the danger this evil cult poses to our civilization. permalink award report block reply\n1True-translation 1 points 6 days ago All those woke atheists who supported this invasion are going to be so disappointed lol. Retards permalink award report block reply\nparkchunghee 1 points 6 days ago It is if you happen to speak Arabic. permalink award report block reply\nSaxonRealm 1 points 6 days ago It is all middle eastern nonsense. Get back to your roots. permalink award report block reply\nBeefFarmerForTrump 0 points 6 days ago Religion is always the problem. I've made it 38yrs without any and I just dont see why the need for it. permalink award report block reply Dev404 0 points 6 days ago Religion is used to bring people together, for good and bad. Religion is used to pass down values. It has it's place. What the actual problem is comes down to human nature. We all have our biases and willingness to do evil shit for our own gain, regardless of whatever religion. For people looking to do evil shit in the name of some religion, religion is just a tool, they don't even necessarily believe in it, but can manipulate who do. Ideally, religion can provide guidance for people to not live just for themselves and \"fuck everyone who's not me or my family.\" Religion is at least as valuable as books, good for passing down lessons, values, and information, but can be used for nefarious purposes by bad people. permalink parent award report block reply\nDev404 0 points 6 days ago Religion is used to bring people together, for good and bad. Religion is used to pass down values. It has it's place. What the actual problem is comes down to human nature. We all have our biases and willingness to do evil shit for our own gain, regardless of whatever religion. For people looking to do evil shit in the name of some religion, religion is just a tool, they don't even necessarily believe in it, but can manipulate who do. Ideally, religion can provide guidance for people to not live just for themselves and \"fuck everyone who's not me or my family.\" Religion is at least as valuable as books, good for passing down lessons, values, and information, but can be used for nefarious purposes by bad people. permalink parent award report block reply\nTheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:02:00.715061Z"
}