{
  "id": "1ARK9iqwzA",
  "url": "https://patriots.win/p/1ARK9iqwzA/liberal-logic/c",
  "content": "1471 Liberal logic posted 2 days ago by HappyFunBall 24 comments award share download report block\n24 comments Sort by Top Top New Worst Old Save MedicallyReddit 49 points 2 days ago At this point, leftism is literally a form of brain damage. permalink award report block reply HappyFunBall OP 29 points 2 days ago Notice how John Fetterman gets more reasonable as he recovers from a stroke. Proof that liberalism is a mental disorder. permalink parent award report block reply realPhantomFuck 15 points 2 days ago It is quite telling when the lone voice of reason coming from the Dems is a literal stroke survivor permalink parent award report block reply DT170x 4 points 2 days ago So the Clot Shot got a chance to make a person smarter, thus leaving the Democratic Party. Every Rino and Democrats need to get boosted again. permalink parent award report block reply PeterThielAntiChrist 1 points 2 days ago he became conservative after the stroke. he's not recovering. he's driving around parking lots for hours. permalink parent award report block reply Bramage 1 points 2 days ago Always was.  And TREASON to the Republic. permalink parent award report block reply Deportthemall23 5 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply midgetpornrocks 4 points 2 days ago After all, we wuz kangz an sheit! permalink parent award report block reply ravonaf 12 points 2 days ago The left: \"No Kings!!!!!!\" Also the left: \"Trump should break the law and go outside of Congress to fund government programs! Reeeee!!!!!\" permalink award report block reply HoganT -8 points 2 days ago Us, the right: \"The constitution!!!!\" Also us, the right: \"We should completely abandon any part of the constitution that holds us back, we must maintain power even if it means abandoning all constitutional principles!\" permalink parent award report block reply Appeal2Heaven98 6 points 2 days ago Have you been paying attention to the GOP? They always play by the rules of the Constitution. That's why we lose. I'm sorry that we, as the MAGA base, don't want to follow the Constitution 100% of the time, especially when the other side believes it's an old, irrelevant document. Oh, and they also want us dead. permalink parent award report block reply PeterThielAntiChrist -1 points 2 days ago no one in the coastal cities wants you dead. no one here thinks about you. ever. the assumption is you're killing yourself with fast food and opiates. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago \"Us\" No, you're not \"us\". You're a leftist. permalink parent award report block reply UnderHisWings 5 points 2 days ago Liberals don't possess any logic. permalink award report block reply kyle6969 3 points 2 days ago When has Trump done that though? permalink award report block reply stevethefish76 2 points 2 days ago The irony is that having the government involved with every aspect of life is exactly what fascism was all about, yet they claim to be \"anti-fascist.\" permalink award report block reply Rucktoe 2 points 2 days ago Liberal logic dipshit lib:  You are a racist! Maga:  No I'm not, why do you say that? dipshit lib:  I'm not interested in telling you why, you won't argue in good faith! permalink award report block reply Deport_O_Matic 1 points 2 days ago They don't want a King, they want a Chancellor or a Fuhrer. permalink award report block reply HoganT -2 points 2 days ago stickied within 36 seconds. That's not a post that's chosen, that's a post made specifically for a sticky, showing the inorganic nature of what's promoted. permalink award report block reply HappyFunBall OP 6 points 2 days ago I promised the mods sexual favors if they stickied my post. permalink parent award report block reply Ostia 4 points 2 days ago Nah, you're just someone with mod privilege's alt. permalink parent award report block reply Appeal2Heaven98 5 points 2 days ago Why do you even care? permalink parent award report block reply TrumpShillsAintMAGA 0 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply HoganT -3 points 2 days ago You're shadowbanned. permalink parent award report block reply BaguettesOfRudysSUB 2 points 2 days ago Quit replying to yourself and go back to sucking the shit out of your superior party member's asshole. permalink parent award report block reply HoganT -4 points 2 days ago What the fuck are you talking about? permalink parent award report block reply\nMedicallyReddit 49 points 2 days ago At this point, leftism is literally a form of brain damage. permalink award report block reply HappyFunBall OP 29 points 2 days ago Notice how John Fetterman gets more reasonable as he recovers from a stroke. Proof that liberalism is a mental disorder. permalink parent award report block reply realPhantomFuck 15 points 2 days ago It is quite telling when the lone voice of reason coming from the Dems is a literal stroke survivor permalink parent award report block reply DT170x 4 points 2 days ago So the Clot Shot got a chance to make a person smarter, thus leaving the Democratic Party. Every Rino and Democrats need to get boosted again. permalink parent award report block reply PeterThielAntiChrist 1 points 2 days ago he became conservative after the stroke. he's not recovering. he's driving around parking lots for hours. permalink parent award report block reply Bramage 1 points 2 days ago Always was.  And TREASON to the Republic. permalink parent award report block reply Deportthemall23 5 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply midgetpornrocks 4 points 2 days ago After all, we wuz kangz an sheit! permalink parent award report block reply\nHappyFunBall OP 29 points 2 days ago Notice how John Fetterman gets more reasonable as he recovers from a stroke. Proof that liberalism is a mental disorder. permalink parent award report block reply realPhantomFuck 15 points 2 days ago It is quite telling when the lone voice of reason coming from the Dems is a literal stroke survivor permalink parent award report block reply DT170x 4 points 2 days ago So the Clot Shot got a chance to make a person smarter, thus leaving the Democratic Party. Every Rino and Democrats need to get boosted again. permalink parent award report block reply PeterThielAntiChrist 1 points 2 days ago he became conservative after the stroke. he's not recovering. he's driving around parking lots for hours. permalink parent award report block reply\nrealPhantomFuck 15 points 2 days ago It is quite telling when the lone voice of reason coming from the Dems is a literal stroke survivor permalink parent award report block reply\nDT170x 4 points 2 days ago So the Clot Shot got a chance to make a person smarter, thus leaving the Democratic Party. Every Rino and Democrats need to get boosted again. permalink parent award report block reply\nPeterThielAntiChrist 1 points 2 days ago he became conservative after the stroke. he's not recovering. he's driving around parking lots for hours. permalink parent award report block reply\nBramage 1 points 2 days ago Always was.  And TREASON to the Republic. permalink parent award report block reply\nDeportthemall23 5 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply midgetpornrocks 4 points 2 days ago After all, we wuz kangz an sheit! permalink parent award report block reply\nmidgetpornrocks 4 points 2 days ago After all, we wuz kangz an sheit! permalink parent award report block reply\nravonaf 12 points 2 days ago The left: \"No Kings!!!!!!\" Also the left: \"Trump should break the law and go outside of Congress to fund government programs! Reeeee!!!!!\" permalink award report block reply HoganT -8 points 2 days ago Us, the right: \"The constitution!!!!\" Also us, the right: \"We should completely abandon any part of the constitution that holds us back, we must maintain power even if it means abandoning all constitutional principles!\" permalink parent award report block reply Appeal2Heaven98 6 points 2 days ago Have you been paying attention to the GOP? They always play by the rules of the Constitution. That's why we lose. I'm sorry that we, as the MAGA base, don't want to follow the Constitution 100% of the time, especially when the other side believes it's an old, irrelevant document. Oh, and they also want us dead. permalink parent award report block reply PeterThielAntiChrist -1 points 2 days ago no one in the coastal cities wants you dead. no one here thinks about you. ever. the assumption is you're killing yourself with fast food and opiates. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago \"Us\" No, you're not \"us\". You're a leftist. permalink parent award report block reply\nHoganT -8 points 2 days ago Us, the right: \"The constitution!!!!\" Also us, the right: \"We should completely abandon any part of the constitution that holds us back, we must maintain power even if it means abandoning all constitutional principles!\" permalink parent award report block reply Appeal2Heaven98 6 points 2 days ago Have you been paying attention to the GOP? They always play by the rules of the Constitution. That's why we lose. I'm sorry that we, as the MAGA base, don't want to follow the Constitution 100% of the time, especially when the other side believes it's an old, irrelevant document. Oh, and they also want us dead. permalink parent award report block reply PeterThielAntiChrist -1 points 2 days ago no one in the coastal cities wants you dead. no one here thinks about you. ever. the assumption is you're killing yourself with fast food and opiates. permalink parent award report block reply Wtf_socialismreally 2 points 2 days ago \"Us\" No, you're not \"us\". You're a leftist. permalink parent award report block reply\nAppeal2Heaven98 6 points 2 days ago Have you been paying attention to the GOP? They always play by the rules of the Constitution. That's why we lose. I'm sorry that we, as the MAGA base, don't want to follow the Constitution 100% of the time, especially when the other side believes it's an old, irrelevant document. Oh, and they also want us dead. permalink parent award report block reply PeterThielAntiChrist -1 points 2 days ago no one in the coastal cities wants you dead. no one here thinks about you. ever. the assumption is you're killing yourself with fast food and opiates. permalink parent award report block reply\nPeterThielAntiChrist -1 points 2 days ago no one in the coastal cities wants you dead. no one here thinks about you. ever. the assumption is you're killing yourself with fast food and opiates. permalink parent award report block reply\nWtf_socialismreally 2 points 2 days ago \"Us\" No, you're not \"us\". You're a leftist. permalink parent award report block reply\nUnderHisWings 5 points 2 days ago Liberals don't possess any logic. permalink award report block reply\nkyle6969 3 points 2 days ago When has Trump done that though? permalink award report block reply\nstevethefish76 2 points 2 days ago The irony is that having the government involved with every aspect of life is exactly what fascism was all about, yet they claim to be \"anti-fascist.\" permalink award report block reply\nRucktoe 2 points 2 days ago Liberal logic dipshit lib:  You are a racist! Maga:  No I'm not, why do you say that? dipshit lib:  I'm not interested in telling you why, you won't argue in good faith! permalink award report block reply\nDeport_O_Matic 1 points 2 days ago They don't want a King, they want a Chancellor or a Fuhrer. permalink award report block reply\nHoganT -2 points 2 days ago stickied within 36 seconds. That's not a post that's chosen, that's a post made specifically for a sticky, showing the inorganic nature of what's promoted. permalink award report block reply HappyFunBall OP 6 points 2 days ago I promised the mods sexual favors if they stickied my post. permalink parent award report block reply Ostia 4 points 2 days ago Nah, you're just someone with mod privilege's alt. permalink parent award report block reply Appeal2Heaven98 5 points 2 days ago Why do you even care? permalink parent award report block reply TrumpShillsAintMAGA 0 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply HoganT -3 points 2 days ago You're shadowbanned. permalink parent award report block reply BaguettesOfRudysSUB 2 points 2 days ago Quit replying to yourself and go back to sucking the shit out of your superior party member's asshole. permalink parent award report block reply HoganT -4 points 2 days ago What the fuck are you talking about? permalink parent award report block reply\nHappyFunBall OP 6 points 2 days ago I promised the mods sexual favors if they stickied my post. permalink parent award report block reply Ostia 4 points 2 days ago Nah, you're just someone with mod privilege's alt. permalink parent award report block reply\nOstia 4 points 2 days ago Nah, you're just someone with mod privilege's alt. permalink parent award report block reply\nAppeal2Heaven98 5 points 2 days ago Why do you even care? permalink parent award report block reply\nTrumpShillsAintMAGA 0 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply HoganT -3 points 2 days ago You're shadowbanned. permalink parent award report block reply BaguettesOfRudysSUB 2 points 2 days ago Quit replying to yourself and go back to sucking the shit out of your superior party member's asshole. permalink parent award report block reply HoganT -4 points 2 days ago What the fuck are you talking about? permalink parent award report block reply\nHoganT -3 points 2 days ago You're shadowbanned. permalink parent award report block reply BaguettesOfRudysSUB 2 points 2 days ago Quit replying to yourself and go back to sucking the shit out of your superior party member's asshole. permalink parent award report block reply HoganT -4 points 2 days ago What the fuck are you talking about? permalink parent award report block reply\nBaguettesOfRudysSUB 2 points 2 days ago Quit replying to yourself and go back to sucking the shit out of your superior party member's asshole. permalink parent award report block reply HoganT -4 points 2 days ago What the fuck are you talking about? permalink parent award report block reply\nHoganT -4 points 2 days ago What the fuck are you talking about? permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:49:55.288823Z"
}