{
  "id": "1ARK590M5w",
  "url": "https://patriots.win/p/1ARK590M5w/uk-judge-rules-that-criticism-of/c",
  "content": "260 UK Judge rules that criticism of goatfuckers is allowed. posted 4 days ago by _Liberty_Prime_ 5 comments award share report block Bernie @Artemisfornow • 4d 🚨 Well now … A UK judge has ruled that “Islam-critical” beliefs ARE protected under the Equality Act 2010 Previous claimants had been told such views were not “worthy of respect in a democracy”. The governments definition of Islamaphobia will be a bit tricky now.\n5 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style MinnieWhittaker 12 points 4 days ago Bless this guy. It's a little bright spot in the very dark situation in England. permalink award report block reply MastaJoda 6 points 4 days ago I hope those imprisoned for their opinions get freed. The UK is flat out insane right now. permalink parent award report block reply Mungo 2 points 4 days ago Well said permalink parent award report block reply jdemarco2014 2 points 4 days ago Meanwhile scam blondi and republicans are trying to toss us in jail for criticizing the kosher permalink award report block reply mailinvoter 1 points 4 days ago I guess that judge is going to prison for a long time for hate speech and terrorism. permalink award report block reply\nMinnieWhittaker 12 points 4 days ago Bless this guy. It's a little bright spot in the very dark situation in England. permalink award report block reply MastaJoda 6 points 4 days ago I hope those imprisoned for their opinions get freed. The UK is flat out insane right now. permalink parent award report block reply Mungo 2 points 4 days ago Well said permalink parent award report block reply\nMastaJoda 6 points 4 days ago I hope those imprisoned for their opinions get freed. The UK is flat out insane right now. permalink parent award report block reply\nMungo 2 points 4 days ago Well said permalink parent award report block reply\njdemarco2014 2 points 4 days ago Meanwhile scam blondi and republicans are trying to toss us in jail for criticizing the kosher permalink award report block reply\nmailinvoter 1 points 4 days ago I guess that judge is going to prison for a long time for hate speech and terrorism. permalink award report block reply",
  "fetched_at": "2025-11-12T21:01:22.205347Z"
}