{
  "id": "1ARK9k0ikV",
  "url": "https://patriots.win/p/1ARK9k0ikV/great-tribute/c",
  "content": "279 Great Tribute posted 1 day ago by RandoBudster 19 comments award share download report block\n19 comments Sort by Top Top New Worst Old Save TEXinLA 12 points 1 day ago God Bless Our Veterans. permalink award report block reply bananafone 7 points 1 day ago Yes — this monument is real. It's called the Anthem Veterans Memorial , located in Anthem, Arizona (just north of Phoenix). The memorial was completed and dedicated on November 11, 2011 (11/11/11) and was intentionally engineered so that once per year the sun lines up perfectly. How it Works The memorial has five pillars , one for each branch of the U.S. Armed Forces. Each pillar has a precisely cut elliptical opening. At 11:11 AM on November 11 (Veterans Day), the sun is at the exact angle needed for its rays to pass through all five openings. The light lands on the Great Seal of the United States on the ground in front. Important Detail The alignment depends on local time and daylight savings .\nWhen Arizona is not observing DST (which it usually doesn’t), the effect happens very close to 11:11 AM . Some years it appears slightly earlier or later depending on the sun’s exact position. So yes: ✅ The monument is real\n✅ The alignment effect is intentional\n✅ It does happen annually on Veterans Day\n✅ It creates the illuminated seal just like the picture shows This is one of those viral images that seems too perfect to be real — but this one is actually true. permalink award report block reply BobbyTables18c 2 points 1 day ago I had questions. You answered them. Then you answered the questions that came from that, without asking. Well done mister phone. permalink parent award report block reply Live_free_or_die_55 5 points 1 day ago Thank you for your service and your sacrifice!!! permalink award report block reply YaharaRiver 4 points 1 day ago That’s pretty cool 👍 It’s cloudy and frigid here today, we got snow again last night.  It probably wouldn’t show up as nicely where I am, but I love it all the same and like that it was designed and built. permalink award report block reply keeman 2 points 1 day ago A better tribute would be to stay out of all the damned wars and stop making more veterans.  Let's try being a republic instead of an empire for a few generations. permalink award report block reply IBentMyWookie 2 points 1 day ago I’m just shocked a leftist hasn’t destroyed it declaring time rAyCiSt. permalink award report block reply you_know_GOAT 2 points 1 day ago Someone Mathed up. permalink award report block reply TheWoodsman 2 points 1 day ago They need to make another pillar for Spaceforce permalink award report block reply Psarg 1 points 1 day ago Look at the crowd permalink award report block reply edxzxz 1 points 1 day ago How is this possible given leap year monkeying up the calendar? permalink award report block reply DatabaseCentrals 3 points 1 day ago How does a leap year monkey up a calendar when it's made to make sure each day is right. Every actual year is 365.25 days permalink parent award report block reply edxzxz 2 points 1 day ago Because you can't have a monument that supposedly does something on November 11th every year if November 11th moves because of leap year once every 4 years.  Unless the monument moves every 4 years to account for that. Or unless I'm missing something here. permalink parent award report block reply Butttoucha9k 1 points 1 day ago It was built in 2011. So theres what... 3? 4? So far? The calculations would be in microshifts for this. In 100 years you are right it wouldn't be EXACT but it would stoll only be a minute maybe permalink parent award report block reply chewsoap 1 points 1 day ago It's not going to monkey it up a noticeable amount. permalink parent award report block reply Thefrogeatsfree -1 points 1 day ago We can so reliably build things like this and navigate for centuries by star patterns but are still expected to beleive we are chasing the sun in a corkscrew pattern hurtling through space... permalink award report block reply chewsoap 5 points 1 day ago Why should those things be mutually exclusive? permalink parent award report block reply Thefrogeatsfree -1 points 1 day ago IDK man, I'm just some guy. It just seems too convenient permalink parent award report block reply GabeC1997 0 points 1 day ago lol, if you think that is bad, then you’ve obviously never considered the oddity of every galaxy appearing like a spiral. For that image to form as it does, it would require the light from one edge of the galaxy to arrive at the exact same instant as light from the opposite edge, despite the supposed difference in countless light years. They’re either faked by astronomers, faked by God painting them on a wall far closer to Earth than they are portrayed, or speed of light doesn’t exist outside of a galaxy’s gravity well allowing photons to traverse Dark Space instantly. Personally, I think the 2nd option is most likely, as the Voyager Probes smashed themselves against a rather literal Wall of Fire a while ago. permalink parent award report block reply\nTEXinLA 12 points 1 day ago God Bless Our Veterans. permalink award report block reply\nbananafone 7 points 1 day ago Yes — this monument is real. It's called the Anthem Veterans Memorial , located in Anthem, Arizona (just north of Phoenix). The memorial was completed and dedicated on November 11, 2011 (11/11/11) and was intentionally engineered so that once per year the sun lines up perfectly. How it Works The memorial has five pillars , one for each branch of the U.S. Armed Forces. Each pillar has a precisely cut elliptical opening. At 11:11 AM on November 11 (Veterans Day), the sun is at the exact angle needed for its rays to pass through all five openings. The light lands on the Great Seal of the United States on the ground in front. Important Detail The alignment depends on local time and daylight savings .\nWhen Arizona is not observing DST (which it usually doesn’t), the effect happens very close to 11:11 AM . Some years it appears slightly earlier or later depending on the sun’s exact position. So yes: ✅ The monument is real\n✅ The alignment effect is intentional\n✅ It does happen annually on Veterans Day\n✅ It creates the illuminated seal just like the picture shows This is one of those viral images that seems too perfect to be real — but this one is actually true. permalink award report block reply BobbyTables18c 2 points 1 day ago I had questions. You answered them. Then you answered the questions that came from that, without asking. Well done mister phone. permalink parent award report block reply\nBobbyTables18c 2 points 1 day ago I had questions. You answered them. Then you answered the questions that came from that, without asking. Well done mister phone. permalink parent award report block reply\nLive_free_or_die_55 5 points 1 day ago Thank you for your service and your sacrifice!!! permalink award report block reply\nYaharaRiver 4 points 1 day ago That’s pretty cool 👍 It’s cloudy and frigid here today, we got snow again last night.  It probably wouldn’t show up as nicely where I am, but I love it all the same and like that it was designed and built. permalink award report block reply\nkeeman 2 points 1 day ago A better tribute would be to stay out of all the damned wars and stop making more veterans.  Let's try being a republic instead of an empire for a few generations. permalink award report block reply\nIBentMyWookie 2 points 1 day ago I’m just shocked a leftist hasn’t destroyed it declaring time rAyCiSt. permalink award report block reply\nyou_know_GOAT 2 points 1 day ago Someone Mathed up. permalink award report block reply\nTheWoodsman 2 points 1 day ago They need to make another pillar for Spaceforce permalink award report block reply\nPsarg 1 points 1 day ago Look at the crowd permalink award report block reply\nedxzxz 1 points 1 day ago How is this possible given leap year monkeying up the calendar? permalink award report block reply DatabaseCentrals 3 points 1 day ago How does a leap year monkey up a calendar when it's made to make sure each day is right. Every actual year is 365.25 days permalink parent award report block reply edxzxz 2 points 1 day ago Because you can't have a monument that supposedly does something on November 11th every year if November 11th moves because of leap year once every 4 years.  Unless the monument moves every 4 years to account for that. Or unless I'm missing something here. permalink parent award report block reply Butttoucha9k 1 points 1 day ago It was built in 2011. So theres what... 3? 4? So far? The calculations would be in microshifts for this. In 100 years you are right it wouldn't be EXACT but it would stoll only be a minute maybe permalink parent award report block reply chewsoap 1 points 1 day ago It's not going to monkey it up a noticeable amount. permalink parent award report block reply\nDatabaseCentrals 3 points 1 day ago How does a leap year monkey up a calendar when it's made to make sure each day is right. Every actual year is 365.25 days permalink parent award report block reply edxzxz 2 points 1 day ago Because you can't have a monument that supposedly does something on November 11th every year if November 11th moves because of leap year once every 4 years.  Unless the monument moves every 4 years to account for that. Or unless I'm missing something here. permalink parent award report block reply Butttoucha9k 1 points 1 day ago It was built in 2011. So theres what... 3? 4? So far? The calculations would be in microshifts for this. In 100 years you are right it wouldn't be EXACT but it would stoll only be a minute maybe permalink parent award report block reply\nedxzxz 2 points 1 day ago Because you can't have a monument that supposedly does something on November 11th every year if November 11th moves because of leap year once every 4 years.  Unless the monument moves every 4 years to account for that. Or unless I'm missing something here. permalink parent award report block reply Butttoucha9k 1 points 1 day ago It was built in 2011. So theres what... 3? 4? So far? The calculations would be in microshifts for this. In 100 years you are right it wouldn't be EXACT but it would stoll only be a minute maybe permalink parent award report block reply\nButttoucha9k 1 points 1 day ago It was built in 2011. So theres what... 3? 4? So far? The calculations would be in microshifts for this. In 100 years you are right it wouldn't be EXACT but it would stoll only be a minute maybe permalink parent award report block reply\nchewsoap 1 points 1 day ago It's not going to monkey it up a noticeable amount. permalink parent award report block reply\nThefrogeatsfree -1 points 1 day ago We can so reliably build things like this and navigate for centuries by star patterns but are still expected to beleive we are chasing the sun in a corkscrew pattern hurtling through space... permalink award report block reply chewsoap 5 points 1 day ago Why should those things be mutually exclusive? permalink parent award report block reply Thefrogeatsfree -1 points 1 day ago IDK man, I'm just some guy. It just seems too convenient permalink parent award report block reply GabeC1997 0 points 1 day ago lol, if you think that is bad, then you’ve obviously never considered the oddity of every galaxy appearing like a spiral. For that image to form as it does, it would require the light from one edge of the galaxy to arrive at the exact same instant as light from the opposite edge, despite the supposed difference in countless light years. They’re either faked by astronomers, faked by God painting them on a wall far closer to Earth than they are portrayed, or speed of light doesn’t exist outside of a galaxy’s gravity well allowing photons to traverse Dark Space instantly. Personally, I think the 2nd option is most likely, as the Voyager Probes smashed themselves against a rather literal Wall of Fire a while ago. permalink parent award report block reply\nchewsoap 5 points 1 day ago Why should those things be mutually exclusive? permalink parent award report block reply Thefrogeatsfree -1 points 1 day ago IDK man, I'm just some guy. It just seems too convenient permalink parent award report block reply\nThefrogeatsfree -1 points 1 day ago IDK man, I'm just some guy. It just seems too convenient permalink parent award report block reply\nGabeC1997 0 points 1 day ago lol, if you think that is bad, then you’ve obviously never considered the oddity of every galaxy appearing like a spiral. For that image to form as it does, it would require the light from one edge of the galaxy to arrive at the exact same instant as light from the opposite edge, despite the supposed difference in countless light years. They’re either faked by astronomers, faked by God painting them on a wall far closer to Earth than they are portrayed, or speed of light doesn’t exist outside of a galaxy’s gravity well allowing photons to traverse Dark Space instantly. Personally, I think the 2nd option is most likely, as the Voyager Probes smashed themselves against a rather literal Wall of Fire a while ago. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:04:46.139046Z"
}