{
  "id": "1ARK57sVfe",
  "url": "https://patriots.win/p/1ARK57sVfe/is-this-true-/c",
  "content": "531 Is this true? posted 4 days ago by Patriotrealm 40 comments award share download report block\n40 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style 0illuminated1 36 points 4 days ago The fact that law is selectively enforced should be all the proof you need that it's fake and gay. Politics is the entertainment division of the military industrial complex. - Frank Zappa As in....   it's like fake wrestling but for low iq adults. Vote harder. permalink award report block reply HeavyMetalPatriot 8 points 4 days ago That's a good, scary and deeply based quote from Zappa. Thank you. permalink parent award report block reply 0illuminated1 8 points 4 days ago Among a group of friends, people don’t play political games with each other. The minute someone does, you know they’re no longer really a friend. Good people don’t want to exert control over others, so by that logic, politicians, by definition, aren’t good people. The only thing they are good at is making and bending rules to suit their own interests... and also being full of shit. When I was a kid, everyone knew politicians were completely fake and gay.  It seems that through the facade of elections they can bring people back into thinking It's real.. ...Somehow they keep people believing it's real... The easiest ones to fool are the ones who desperately want to believe..  its too much for most people to accept It's all fake and gay...that they are little more than cattle...  So they happily buy what is being sold to them... permalink parent award report block reply NomadicKrow2 1 points 4 days ago Actually, a lot of the provisions have been stripped from it. It has no teeth. permalink parent award report block reply Zskills 21 points 4 days ago Everywhere but Arizona, it remains enforceable.  Their federal court struck it down on 1A grounds.  It would likely have the same fate at SCOTUS if anyone tried to enforce it elsewhere. All that being said, yes it is technically on the books and valid law. permalink award report block reply spinometer2 2 points 4 days ago it does directly violate 1A in a rather obvious way permalink parent award report block reply ubit 5 points 4 days ago 1A doesn't cover all forms of speech. Marx never even bothered to define Communism, he just wanted the violent revolution part. permalink parent award report block reply spinometer2 3 points 4 days ago It's the freedom to associate, which isn't in the text but scotus has ruled flows from the speech and assembly freedoms. That decision would need to be undone. permalink parent award report block reply TGNX 1 points 4 days ago Are people free to associate with terrorists, or is there a punitive cost to do so? permalink parent award report block reply view 2 more comments... vongregormench 2 points 4 days ago It pretty much covers all forms of speech but we’ve taken the liberty of defining it further so that directly inciting violence is still part of the act of violence. permalink parent award report block reply pby1000 7 points 4 days ago Yes!  I have been posting this everywhere for years. permalink award report block reply Repentnow -1 points 4 days ago Well then, I guess you've been wrong for years. The Naturalization Act does not say, \"if a new citizen pushes communist revolution within 5 years -- that's proof they LIED to get in. Their citizenship can be revoked.\" permalink parent award report block reply okboomer59 4 points 4 days ago U.S. immigration law explicitly disqualifies individuals from naturalization if they have advocated or taught, or been affiliated with any organization that advocates or teaches, the overthrow of the U.S. government by force, violence, or other unconstitutional means. This disqualification applies to conduct occurring within the 10 years preceding the naturalization application and continues until the oath of allegiance is taken. permalink parent award report block reply Repentnow 3 points 4 days ago Yes, that's lookback before naturalization. OP is saying 5 years after naturalization, and that's not true. permalink parent award report block reply RealmanPwns 7 points 4 days ago I think this is the only possible account he has (not the one you posted) https://x.com/BARRONTRUMP It's followed by the REAL Melanie Trump permalink award report block reply _Sully_ 6 points 4 days ago I saw a video recently of this fucking priest of all things calling for acts of violence because ICE in plain clothes (oh no!! that's bad for reasons I can't describe :/) arrested a muslim woman who was on a student visa. Can you believe it?! They did it in such a mean way not allowing her to flee!! Well who was this bitch? She had her visa revoked and she didn't respond to summons. The reason is she was legitimately calling for communist revolution (really she's just an islamist terrorist using that language to fool leftist retards). She openly supported Hamas and showed she provided material support for them as well. But to this \"priest\" what she is and what she does is righteous. As in, he is bonafide traitor. This is who we are up against. They don't care what the constitution says. They don't care if something is a law or not. They want everything you have and they want you dead. permalink award report block reply okboomer59 3 points 4 days ago It ain't John Paul II's church anymore. permalink parent award report block reply MAGA9428 4 points 4 days ago We should declare the Democrat party to be a communist organization, denaturalize, and deport every single person who’s arrived here that votes Democrat. permalink award report block reply Bohemyth_2 3 points 4 days ago No one is above the law permalink award report block reply Patriotrealm OP 3 points 4 days ago There seem to be a few that would disagree. Very few have faced justice. yet. permalink parent award report block reply Ronaldus 4 points 4 days ago By very few you mean zero, right? permalink parent award report block reply Cuttinmuffins 3 points 4 days ago That is funny! Imagine actually enforcing laws that were on the books! Haha. WTF is wrong with this country? permalink award report block reply SonOfThunder 3 points 4 days ago Immigration law is already on the books but Trump won't enforce it because some jerkoff judge says so. permalink award report block reply Repentnow 1 points 4 days ago Which immigration law is Trump not enforcing because of a judicial action? permalink parent award report block reply UltraFrogMan 2 points 4 days ago Yes permalink award report block reply josiborg 2 points 4 days ago Is this actual Barron Trump account? permalink award report block reply nmipede 8 points 4 days ago No. It's a \"fan\" account called Barron Trump News. I've seen it before. OP didn't post a link, that's a big clue its not his words. permalink parent award report block reply Patriotrealm OP 0 points 4 days ago No idea these days. permalink parent award report block reply CleanUpPhillyTrump24 2 points 4 days ago Fortunately we do not have to wait for the DOJ and FBI in all cases because SecState Rubio is having Landau at the State Dept strip people of their documents, including if naturalized, if there is any anti-government or revolutionary overthrow chatter that the foreign born and/or illegal is involved in. permalink award report block reply Agent_86 2 points 4 days ago This means his dad knows. Sweet! permalink award report block reply Repentnow 1 points 4 days ago Is this true? No. permalink award report block reply Aggrieved03 1 points 4 days ago I’m sure Bondi will get right on that. permalink award report block reply Patriotrealm OP 1 points 4 days ago In two weeks? permalink parent award report block reply Aggrieved03 1 points 4 days ago Probably more like 336 hours. permalink parent award report block reply Tao_Pai 1 points 4 days ago This is why they will freely admit to being a socialist but dance around being called communist - even though they are by all definitions. permalink award report block reply Kilroy 1 points 4 days ago It is true. Congressmen are also supposed to swear an oath to uphold the Constitution. So, anyone implementing  race based policy or anything else unconstitutional could and should be impeached. permalink award report block reply vongregormench 1 points 4 days ago I don’t think having moronic policies while running for elective office counts as trying to start a communist revolution. permalink award report block reply schnazzmizzle 1 points 3 days ago FGM laws are still on the books as well but they still chop up kids. permalink award report block reply BillGateCanSuckIt 1 points 4 days ago Time traveler confirmed permalink award report block reply CleanUpPhillyTrump24 0 points 4 days ago Of course it is true. Tell the RINOs and Dems in the uniparty though. They all take money from the same dark sluice - the socialists, the Dems, the communist party members and organizers, and the RINOs. So the DOJ and FBI need to get on it. permalink award report block reply etcetera 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\n0illuminated1 36 points 4 days ago The fact that law is selectively enforced should be all the proof you need that it's fake and gay. Politics is the entertainment division of the military industrial complex. - Frank Zappa As in....   it's like fake wrestling but for low iq adults. Vote harder. permalink award report block reply HeavyMetalPatriot 8 points 4 days ago That's a good, scary and deeply based quote from Zappa. Thank you. permalink parent award report block reply 0illuminated1 8 points 4 days ago Among a group of friends, people don’t play political games with each other. The minute someone does, you know they’re no longer really a friend. Good people don’t want to exert control over others, so by that logic, politicians, by definition, aren’t good people. The only thing they are good at is making and bending rules to suit their own interests... and also being full of shit. When I was a kid, everyone knew politicians were completely fake and gay.  It seems that through the facade of elections they can bring people back into thinking It's real.. ...Somehow they keep people believing it's real... The easiest ones to fool are the ones who desperately want to believe..  its too much for most people to accept It's all fake and gay...that they are little more than cattle...  So they happily buy what is being sold to them... permalink parent award report block reply NomadicKrow2 1 points 4 days ago Actually, a lot of the provisions have been stripped from it. It has no teeth. permalink parent award report block reply\nHeavyMetalPatriot 8 points 4 days ago That's a good, scary and deeply based quote from Zappa. Thank you. permalink parent award report block reply 0illuminated1 8 points 4 days ago Among a group of friends, people don’t play political games with each other. The minute someone does, you know they’re no longer really a friend. Good people don’t want to exert control over others, so by that logic, politicians, by definition, aren’t good people. The only thing they are good at is making and bending rules to suit their own interests... and also being full of shit. When I was a kid, everyone knew politicians were completely fake and gay.  It seems that through the facade of elections they can bring people back into thinking It's real.. ...Somehow they keep people believing it's real... The easiest ones to fool are the ones who desperately want to believe..  its too much for most people to accept It's all fake and gay...that they are little more than cattle...  So they happily buy what is being sold to them... permalink parent award report block reply\n0illuminated1 8 points 4 days ago Among a group of friends, people don’t play political games with each other. The minute someone does, you know they’re no longer really a friend. Good people don’t want to exert control over others, so by that logic, politicians, by definition, aren’t good people. The only thing they are good at is making and bending rules to suit their own interests... and also being full of shit. When I was a kid, everyone knew politicians were completely fake and gay.  It seems that through the facade of elections they can bring people back into thinking It's real.. ...Somehow they keep people believing it's real... The easiest ones to fool are the ones who desperately want to believe..  its too much for most people to accept It's all fake and gay...that they are little more than cattle...  So they happily buy what is being sold to them... permalink parent award report block reply\nNomadicKrow2 1 points 4 days ago Actually, a lot of the provisions have been stripped from it. It has no teeth. permalink parent award report block reply\nZskills 21 points 4 days ago Everywhere but Arizona, it remains enforceable.  Their federal court struck it down on 1A grounds.  It would likely have the same fate at SCOTUS if anyone tried to enforce it elsewhere. All that being said, yes it is technically on the books and valid law. permalink award report block reply spinometer2 2 points 4 days ago it does directly violate 1A in a rather obvious way permalink parent award report block reply ubit 5 points 4 days ago 1A doesn't cover all forms of speech. Marx never even bothered to define Communism, he just wanted the violent revolution part. permalink parent award report block reply spinometer2 3 points 4 days ago It's the freedom to associate, which isn't in the text but scotus has ruled flows from the speech and assembly freedoms. That decision would need to be undone. permalink parent award report block reply TGNX 1 points 4 days ago Are people free to associate with terrorists, or is there a punitive cost to do so? permalink parent award report block reply view 2 more comments... vongregormench 2 points 4 days ago It pretty much covers all forms of speech but we’ve taken the liberty of defining it further so that directly inciting violence is still part of the act of violence. permalink parent award report block reply\nspinometer2 2 points 4 days ago it does directly violate 1A in a rather obvious way permalink parent award report block reply ubit 5 points 4 days ago 1A doesn't cover all forms of speech. Marx never even bothered to define Communism, he just wanted the violent revolution part. permalink parent award report block reply spinometer2 3 points 4 days ago It's the freedom to associate, which isn't in the text but scotus has ruled flows from the speech and assembly freedoms. That decision would need to be undone. permalink parent award report block reply TGNX 1 points 4 days ago Are people free to associate with terrorists, or is there a punitive cost to do so? permalink parent award report block reply view 2 more comments... vongregormench 2 points 4 days ago It pretty much covers all forms of speech but we’ve taken the liberty of defining it further so that directly inciting violence is still part of the act of violence. permalink parent award report block reply\nubit 5 points 4 days ago 1A doesn't cover all forms of speech. Marx never even bothered to define Communism, he just wanted the violent revolution part. permalink parent award report block reply spinometer2 3 points 4 days ago It's the freedom to associate, which isn't in the text but scotus has ruled flows from the speech and assembly freedoms. That decision would need to be undone. permalink parent award report block reply TGNX 1 points 4 days ago Are people free to associate with terrorists, or is there a punitive cost to do so? permalink parent award report block reply view 2 more comments... vongregormench 2 points 4 days ago It pretty much covers all forms of speech but we’ve taken the liberty of defining it further so that directly inciting violence is still part of the act of violence. permalink parent award report block reply\nspinometer2 3 points 4 days ago It's the freedom to associate, which isn't in the text but scotus has ruled flows from the speech and assembly freedoms. That decision would need to be undone. permalink parent award report block reply TGNX 1 points 4 days ago Are people free to associate with terrorists, or is there a punitive cost to do so? permalink parent award report block reply view 2 more comments...\nTGNX 1 points 4 days ago Are people free to associate with terrorists, or is there a punitive cost to do so? permalink parent award report block reply view 2 more comments...\nvongregormench 2 points 4 days ago It pretty much covers all forms of speech but we’ve taken the liberty of defining it further so that directly inciting violence is still part of the act of violence. permalink parent award report block reply\npby1000 7 points 4 days ago Yes!  I have been posting this everywhere for years. permalink award report block reply Repentnow -1 points 4 days ago Well then, I guess you've been wrong for years. The Naturalization Act does not say, \"if a new citizen pushes communist revolution within 5 years -- that's proof they LIED to get in. Their citizenship can be revoked.\" permalink parent award report block reply okboomer59 4 points 4 days ago U.S. immigration law explicitly disqualifies individuals from naturalization if they have advocated or taught, or been affiliated with any organization that advocates or teaches, the overthrow of the U.S. government by force, violence, or other unconstitutional means. This disqualification applies to conduct occurring within the 10 years preceding the naturalization application and continues until the oath of allegiance is taken. permalink parent award report block reply Repentnow 3 points 4 days ago Yes, that's lookback before naturalization. OP is saying 5 years after naturalization, and that's not true. permalink parent award report block reply\nRepentnow -1 points 4 days ago Well then, I guess you've been wrong for years. The Naturalization Act does not say, \"if a new citizen pushes communist revolution within 5 years -- that's proof they LIED to get in. Their citizenship can be revoked.\" permalink parent award report block reply okboomer59 4 points 4 days ago U.S. immigration law explicitly disqualifies individuals from naturalization if they have advocated or taught, or been affiliated with any organization that advocates or teaches, the overthrow of the U.S. government by force, violence, or other unconstitutional means. This disqualification applies to conduct occurring within the 10 years preceding the naturalization application and continues until the oath of allegiance is taken. permalink parent award report block reply Repentnow 3 points 4 days ago Yes, that's lookback before naturalization. OP is saying 5 years after naturalization, and that's not true. permalink parent award report block reply\nokboomer59 4 points 4 days ago U.S. immigration law explicitly disqualifies individuals from naturalization if they have advocated or taught, or been affiliated with any organization that advocates or teaches, the overthrow of the U.S. government by force, violence, or other unconstitutional means. This disqualification applies to conduct occurring within the 10 years preceding the naturalization application and continues until the oath of allegiance is taken. permalink parent award report block reply Repentnow 3 points 4 days ago Yes, that's lookback before naturalization. OP is saying 5 years after naturalization, and that's not true. permalink parent award report block reply\nRepentnow 3 points 4 days ago Yes, that's lookback before naturalization. OP is saying 5 years after naturalization, and that's not true. permalink parent award report block reply\nRealmanPwns 7 points 4 days ago I think this is the only possible account he has (not the one you posted) https://x.com/BARRONTRUMP It's followed by the REAL Melanie Trump permalink award report block reply\n_Sully_ 6 points 4 days ago I saw a video recently of this fucking priest of all things calling for acts of violence because ICE in plain clothes (oh no!! that's bad for reasons I can't describe :/) arrested a muslim woman who was on a student visa. Can you believe it?! They did it in such a mean way not allowing her to flee!! Well who was this bitch? She had her visa revoked and she didn't respond to summons. The reason is she was legitimately calling for communist revolution (really she's just an islamist terrorist using that language to fool leftist retards). She openly supported Hamas and showed she provided material support for them as well. But to this \"priest\" what she is and what she does is righteous. As in, he is bonafide traitor. This is who we are up against. They don't care what the constitution says. They don't care if something is a law or not. They want everything you have and they want you dead. permalink award report block reply okboomer59 3 points 4 days ago It ain't John Paul II's church anymore. permalink parent award report block reply\nokboomer59 3 points 4 days ago It ain't John Paul II's church anymore. permalink parent award report block reply\nMAGA9428 4 points 4 days ago We should declare the Democrat party to be a communist organization, denaturalize, and deport every single person who’s arrived here that votes Democrat. permalink award report block reply\nBohemyth_2 3 points 4 days ago No one is above the law permalink award report block reply Patriotrealm OP 3 points 4 days ago There seem to be a few that would disagree. Very few have faced justice. yet. permalink parent award report block reply Ronaldus 4 points 4 days ago By very few you mean zero, right? permalink parent award report block reply\nPatriotrealm OP 3 points 4 days ago There seem to be a few that would disagree. Very few have faced justice. yet. permalink parent award report block reply Ronaldus 4 points 4 days ago By very few you mean zero, right? permalink parent award report block reply\nRonaldus 4 points 4 days ago By very few you mean zero, right? permalink parent award report block reply\nCuttinmuffins 3 points 4 days ago That is funny! Imagine actually enforcing laws that were on the books! Haha. WTF is wrong with this country? permalink award report block reply\nSonOfThunder 3 points 4 days ago Immigration law is already on the books but Trump won't enforce it because some jerkoff judge says so. permalink award report block reply Repentnow 1 points 4 days ago Which immigration law is Trump not enforcing because of a judicial action? permalink parent award report block reply\nRepentnow 1 points 4 days ago Which immigration law is Trump not enforcing because of a judicial action? permalink parent award report block reply\nUltraFrogMan 2 points 4 days ago Yes permalink award report block reply\njosiborg 2 points 4 days ago Is this actual Barron Trump account? permalink award report block reply nmipede 8 points 4 days ago No. It's a \"fan\" account called Barron Trump News. I've seen it before. OP didn't post a link, that's a big clue its not his words. permalink parent award report block reply Patriotrealm OP 0 points 4 days ago No idea these days. permalink parent award report block reply\nnmipede 8 points 4 days ago No. It's a \"fan\" account called Barron Trump News. I've seen it before. OP didn't post a link, that's a big clue its not his words. permalink parent award report block reply\nPatriotrealm OP 0 points 4 days ago No idea these days. permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 4 days ago Fortunately we do not have to wait for the DOJ and FBI in all cases because SecState Rubio is having Landau at the State Dept strip people of their documents, including if naturalized, if there is any anti-government or revolutionary overthrow chatter that the foreign born and/or illegal is involved in. permalink award report block reply\nAgent_86 2 points 4 days ago This means his dad knows. Sweet! permalink award report block reply\nRepentnow 1 points 4 days ago Is this true? No. permalink award report block reply\nAggrieved03 1 points 4 days ago I’m sure Bondi will get right on that. permalink award report block reply Patriotrealm OP 1 points 4 days ago In two weeks? permalink parent award report block reply Aggrieved03 1 points 4 days ago Probably more like 336 hours. permalink parent award report block reply\nPatriotrealm OP 1 points 4 days ago In two weeks? permalink parent award report block reply Aggrieved03 1 points 4 days ago Probably more like 336 hours. permalink parent award report block reply\nAggrieved03 1 points 4 days ago Probably more like 336 hours. permalink parent award report block reply\nTao_Pai 1 points 4 days ago This is why they will freely admit to being a socialist but dance around being called communist - even though they are by all definitions. permalink award report block reply\nKilroy 1 points 4 days ago It is true. Congressmen are also supposed to swear an oath to uphold the Constitution. So, anyone implementing  race based policy or anything else unconstitutional could and should be impeached. permalink award report block reply\nvongregormench 1 points 4 days ago I don’t think having moronic policies while running for elective office counts as trying to start a communist revolution. permalink award report block reply\nschnazzmizzle 1 points 3 days ago FGM laws are still on the books as well but they still chop up kids. permalink award report block reply\nBillGateCanSuckIt 1 points 4 days ago Time traveler confirmed permalink award report block reply\nCleanUpPhillyTrump24 0 points 4 days ago Of course it is true. Tell the RINOs and Dems in the uniparty though. They all take money from the same dark sluice - the socialists, the Dems, the communist party members and organizers, and the RINOs. So the DOJ and FBI need to get on it. permalink award report block reply\netcetera 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:07:54.030181Z"
}