{
  "id": "8185494",
  "title": "181Natalie Winters: Not sure what is worse: this actually happening or the admin thinking this is a ",
  "url": "https://patriots.win/p/1ARK9nOoNg/natalie-winters-not-sure-what-is/c",
  "content": "182 Natalie Winters: Not sure what is worse: this actually happening or the admin thinking this is a “win”. posted 3 hours ago by Bazhosh 36 comments award share report block Natalie Winters @nataliegwinters • 5h Not sure what is worse: this actually happening or the admin thinking this is a “win”. Disclose.tv @disclosetv • 6h NOW - DHS Secretary Noem on H-1Bs: \"Under the Trump admin, we've sped up our process and added integrity to the visa programs, to green cards, to all of that, but also more people are becoming naturalized under this admin than ever before. More people are becoming citizens.\"\n36 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back I No Matter How Severe The Baldness is HaloGrow drmrboy 33 points 3 hours ago We're being lied to by the Trump administration.  Either they are compromised ... or this was their plan all along (MAGA was just a cover).  They're are no other explanations.  🤓 permalink award report block reply YaharaRiver 8 points 2 hours ago The part amusing to me is how it’s all perfectly LEGAL ever since the GAY muslim Kenyan fucked with our Smith-Mundt Act. obama and his ☪️ult, say yer prayerz!! permalink parent award report block reply MastaJoda 4 points 1 hour ago the RINO Party helped pass that. Obama just approved it. Never forget that. permalink parent award report block reply gunteh 4 points 1 hour ago We expected a Crossing of the Rubicon, and instead got a Trojan Horse. We toasted with hearty cheers but the drink was poisoned before we even took a sip. permalink parent award report block reply TheThreeSeashells -2 points 2 hours ago It boils down to President Trump being a businessman, so he's going to side with business every time.  If business wants illiterate foreign workers where it takes 5 of them to do the job of one American citizen, then business is going to get that from this administration. This is the same thing as them talking about amnesty of farm/hospitality workers a few months back because those businesses were bitching about losing their slave labor. permalink parent award report block reply ReleasetheList 5 points 1 hour ago Those businessmen he's trying to placate aren't going to do shit but celebrate when he's impeached and imprisoned. And Trump's a fool if they think they will stop with him. All of his sons will follow. permalink parent award report block reply MastaJoda 7 points 1 hour ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply TheTelltaleFly 25 points 2 hours ago Good thing Trump worked so hard to bring all that capital investment back to America to create American jobs so we can import enough foreigners to fill them. Yay. permalink award report block reply Region 13 points 2 hours ago WTAF? This is straight up globalism and antithetical to the speech he gave at the UN in 2019. permalink parent award report block reply TheThreeSeashells 6 points 1 hour ago Antithetical to the speech?  How about to MAGA itself.  If this shit is what he wants to do, he needs to take off the MAGA hat. permalink parent award report block reply FKH2 17 points 3 hours ago Find a way to stop this train, I want off, now permalink award report block reply farfiman 3 points 3 hours ago Jump. permalink parent award report block reply FKH2 7 points 2 hours ago I might permalink parent award report block reply Standingoak 2 points 2 hours ago Wait , volunteer for Mars. permalink parent award report block reply y_do_i_need_to_hide 2 points 2 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply y_do_i_need_to_hide -1 points 2 hours ago You guys know we are all on Truth, now, right? :) permalink parent award report block reply 62jawbill 16 points 2 hours ago Susie Wiles is the one making these decisions. Trump is not worried about what us peasants think. He had me fooled for 10 years. Trump is Q. permalink award report block reply South_Florida_Guy 8 points 2 hours ago Is she the one that says she like Israel better than the US? permalink parent award report block reply 62jawbill 6 points 2 hours ago Head of his administration. permalink parent award report block reply Standingoak 3 points 2 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply someguy7738 3 points 1 hour ago the one There are a lot more than one of them. permalink parent award report block reply BigMikesBallz 15 points 2 hours ago “We’ve actually sped up replacing American citizens with foreigners that hate you.”  Thanks assholes. permalink award report block reply TD_Covfefe_Crusader 1 points 20 minutes ago If they want to naturalize more citizens, they need to start revoking the citizenship of naturalized criminals, communists, and terrorists first. Free up some space by removing trash before adding more. permalink parent award report block reply Throwingway22 14 points 2 hours ago It's worse that they think it's a win. Completely out of touch. permalink award report block reply South_Florida_Guy 13 points 2 hours ago This is literally the opposite of what I voted for permalink award report block reply IroWide 12 points 2 hours ago I actually don't care if our economy takes a big hit if it means I don't have to live near beaners or jeets anymore. permalink award report block reply GoldenEarz 9 points 2 hours ago When they say “foreigners are good for the economy”, they mean good for their economy not your economy. permalink parent award report block reply friarfox 6 points 2 hours ago But you get a Piggly Wiggly cart and a tent as the Jeets take your picket fence house. permalink parent award report block reply someguy7738 2 points 1 hour ago That's what they mean literally any time they claim something is good for \"America\". They mean the corporations and ruling class. Us lowly peasants can get fucked. I guess Jon \"Stuart\" Leibowitz was right \"this isn't your country, goyim!\" permalink parent award report block reply NoahGav 1 points 2 hours ago What about blax? permalink parent award report block reply IroWide 1 points 1 hour ago I have given up on ever getting rid of them. permalink parent award report block reply MastaJoda 1 points 1 hour ago whoa!!! THIS GUY HATES WALL STREET BILLIONAIRES! He's not MAGA permalink parent award report block reply RandoBudster 6 points 2 hours ago HOORAY! I'm an American citizen!...Now.. Death to America! permalink award report block reply blitzkrieg1 -1 points 1 hour ago This may help you with your uneducated post. https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply Be_The_Change 4 points 3 hours ago Comment removed by community moderators. permalink award report block reply SCHULTZ 2 points 1 hour ago Comment removed by community moderators. permalink award report block reply\ndrmrboy 33 points 3 hours ago We're being lied to by the Trump administration.  Either they are compromised ... or this was their plan all along (MAGA was just a cover).  They're are no other explanations.  🤓 permalink award report block reply YaharaRiver 8 points 2 hours ago The part amusing to me is how it’s all perfectly LEGAL ever since the GAY muslim Kenyan fucked with our Smith-Mundt Act. obama and his ☪️ult, say yer prayerz!! permalink parent award report block reply MastaJoda 4 points 1 hour ago the RINO Party helped pass that. Obama just approved it. Never forget that. permalink parent award report block reply gunteh 4 points 1 hour ago We expected a Crossing of the Rubicon, and instead got a Trojan Horse. We toasted with hearty cheers but the drink was poisoned before we even took a sip. permalink parent award report block reply TheThreeSeashells -2 points 2 hours ago It boils down to President Trump being a businessman, so he's going to side with business every time.  If business wants illiterate foreign workers where it takes 5 of them to do the job of one American citizen, then business is going to get that from this administration. This is the same thing as them talking about amnesty of farm/hospitality workers a few months back because those businesses were bitching about losing their slave labor. permalink parent award report block reply ReleasetheList 5 points 1 hour ago Those businessmen he's trying to placate aren't going to do shit but celebrate when he's impeached and imprisoned. And Trump's a fool if they think they will stop with him. All of his sons will follow. permalink parent award report block reply MastaJoda 7 points 1 hour ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply\nYaharaRiver 8 points 2 hours ago The part amusing to me is how it’s all perfectly LEGAL ever since the GAY muslim Kenyan fucked with our Smith-Mundt Act. obama and his ☪️ult, say yer prayerz!! permalink parent award report block reply MastaJoda 4 points 1 hour ago the RINO Party helped pass that. Obama just approved it. Never forget that. permalink parent award report block reply\nMastaJoda 4 points 1 hour ago the RINO Party helped pass that. Obama just approved it. Never forget that. permalink parent award report block reply\ngunteh 4 points 1 hour ago We expected a Crossing of the Rubicon, and instead got a Trojan Horse. We toasted with hearty cheers but the drink was poisoned before we even took a sip. permalink parent award report block reply\nTheThreeSeashells -2 points 2 hours ago It boils down to President Trump being a businessman, so he's going to side with business every time.  If business wants illiterate foreign workers where it takes 5 of them to do the job of one American citizen, then business is going to get that from this administration. This is the same thing as them talking about amnesty of farm/hospitality workers a few months back because those businesses were bitching about losing their slave labor. permalink parent award report block reply ReleasetheList 5 points 1 hour ago Those businessmen he's trying to placate aren't going to do shit but celebrate when he's impeached and imprisoned. And Trump's a fool if they think they will stop with him. All of his sons will follow. permalink parent award report block reply MastaJoda 7 points 1 hour ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply\nReleasetheList 5 points 1 hour ago Those businessmen he's trying to placate aren't going to do shit but celebrate when he's impeached and imprisoned. And Trump's a fool if they think they will stop with him. All of his sons will follow. permalink parent award report block reply MastaJoda 7 points 1 hour ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply\nMastaJoda 7 points 1 hour ago Trump's H1Bs and naturalized army of 3rd worlders will also vote against the American way of life for free gibs and communism. See NYC. permalink parent award report block reply\nTheTelltaleFly 25 points 2 hours ago Good thing Trump worked so hard to bring all that capital investment back to America to create American jobs so we can import enough foreigners to fill them. Yay. permalink award report block reply Region 13 points 2 hours ago WTAF? This is straight up globalism and antithetical to the speech he gave at the UN in 2019. permalink parent award report block reply TheThreeSeashells 6 points 1 hour ago Antithetical to the speech?  How about to MAGA itself.  If this shit is what he wants to do, he needs to take off the MAGA hat. permalink parent award report block reply\nRegion 13 points 2 hours ago WTAF? This is straight up globalism and antithetical to the speech he gave at the UN in 2019. permalink parent award report block reply TheThreeSeashells 6 points 1 hour ago Antithetical to the speech?  How about to MAGA itself.  If this shit is what he wants to do, he needs to take off the MAGA hat. permalink parent award report block reply\nTheThreeSeashells 6 points 1 hour ago Antithetical to the speech?  How about to MAGA itself.  If this shit is what he wants to do, he needs to take off the MAGA hat. permalink parent award report block reply\nFKH2 17 points 3 hours ago Find a way to stop this train, I want off, now permalink award report block reply farfiman 3 points 3 hours ago Jump. permalink parent award report block reply FKH2 7 points 2 hours ago I might permalink parent award report block reply Standingoak 2 points 2 hours ago Wait , volunteer for Mars. permalink parent award report block reply y_do_i_need_to_hide 2 points 2 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply y_do_i_need_to_hide -1 points 2 hours ago You guys know we are all on Truth, now, right? :) permalink parent award report block reply\nfarfiman 3 points 3 hours ago Jump. permalink parent award report block reply FKH2 7 points 2 hours ago I might permalink parent award report block reply Standingoak 2 points 2 hours ago Wait , volunteer for Mars. permalink parent award report block reply y_do_i_need_to_hide 2 points 2 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply\nFKH2 7 points 2 hours ago I might permalink parent award report block reply Standingoak 2 points 2 hours ago Wait , volunteer for Mars. permalink parent award report block reply y_do_i_need_to_hide 2 points 2 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply\nStandingoak 2 points 2 hours ago Wait , volunteer for Mars. permalink parent award report block reply\ny_do_i_need_to_hide 2 points 2 hours ago OH NO, TRUMP MAY LOSE 2024. permalink parent award report block reply\ny_do_i_need_to_hide -1 points 2 hours ago You guys know we are all on Truth, now, right? :) permalink parent award report block reply\n62jawbill 16 points 2 hours ago Susie Wiles is the one making these decisions. Trump is not worried about what us peasants think. He had me fooled for 10 years. Trump is Q. permalink award report block reply South_Florida_Guy 8 points 2 hours ago Is she the one that says she like Israel better than the US? permalink parent award report block reply 62jawbill 6 points 2 hours ago Head of his administration. permalink parent award report block reply Standingoak 3 points 2 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply someguy7738 3 points 1 hour ago the one There are a lot more than one of them. permalink parent award report block reply\nSouth_Florida_Guy 8 points 2 hours ago Is she the one that says she like Israel better than the US? permalink parent award report block reply 62jawbill 6 points 2 hours ago Head of his administration. permalink parent award report block reply Standingoak 3 points 2 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply someguy7738 3 points 1 hour ago the one There are a lot more than one of them. permalink parent award report block reply\n62jawbill 6 points 2 hours ago Head of his administration. permalink parent award report block reply Standingoak 3 points 2 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply\nStandingoak 3 points 2 hours ago Well, at least the one with ALL the insider swamp connections. permalink parent award report block reply\nsomeguy7738 3 points 1 hour ago the one There are a lot more than one of them. permalink parent award report block reply\nBigMikesBallz 15 points 2 hours ago “We’ve actually sped up replacing American citizens with foreigners that hate you.”  Thanks assholes. permalink award report block reply TD_Covfefe_Crusader 1 points 20 minutes ago If they want to naturalize more citizens, they need to start revoking the citizenship of naturalized criminals, communists, and terrorists first. Free up some space by removing trash before adding more. permalink parent award report block reply\nTD_Covfefe_Crusader 1 points 20 minutes ago If they want to naturalize more citizens, they need to start revoking the citizenship of naturalized criminals, communists, and terrorists first. Free up some space by removing trash before adding more. permalink parent award report block reply\nThrowingway22 14 points 2 hours ago It's worse that they think it's a win. Completely out of touch. permalink award report block reply\nSouth_Florida_Guy 13 points 2 hours ago This is literally the opposite of what I voted for permalink award report block reply\nIroWide 12 points 2 hours ago I actually don't care if our economy takes a big hit if it means I don't have to live near beaners or jeets anymore. permalink award report block reply GoldenEarz 9 points 2 hours ago When they say “foreigners are good for the economy”, they mean good for their economy not your economy. permalink parent award report block reply friarfox 6 points 2 hours ago But you get a Piggly Wiggly cart and a tent as the Jeets take your picket fence house. permalink parent award report block reply someguy7738 2 points 1 hour ago That's what they mean literally any time they claim something is good for \"America\". They mean the corporations and ruling class. Us lowly peasants can get fucked. I guess Jon \"Stuart\" Leibowitz was right \"this isn't your country, goyim!\" permalink parent award report block reply NoahGav 1 points 2 hours ago What about blax? permalink parent award report block reply IroWide 1 points 1 hour ago I have given up on ever getting rid of them. permalink parent award report block reply MastaJoda 1 points 1 hour ago whoa!!! THIS GUY HATES WALL STREET BILLIONAIRES! He's not MAGA permalink parent award report block reply\nGoldenEarz 9 points 2 hours ago When they say “foreigners are good for the economy”, they mean good for their economy not your economy. permalink parent award report block reply friarfox 6 points 2 hours ago But you get a Piggly Wiggly cart and a tent as the Jeets take your picket fence house. permalink parent award report block reply someguy7738 2 points 1 hour ago That's what they mean literally any time they claim something is good for \"America\". They mean the corporations and ruling class. Us lowly peasants can get fucked. I guess Jon \"Stuart\" Leibowitz was right \"this isn't your country, goyim!\" permalink parent award report block reply\nfriarfox 6 points 2 hours ago But you get a Piggly Wiggly cart and a tent as the Jeets take your picket fence house. permalink parent award report block reply\nsomeguy7738 2 points 1 hour ago That's what they mean literally any time they claim something is good for \"America\". They mean the corporations and ruling class. Us lowly peasants can get fucked. I guess Jon \"Stuart\" Leibowitz was right \"this isn't your country, goyim!\" permalink parent award report block reply\nNoahGav 1 points 2 hours ago What about blax? permalink parent award report block reply IroWide 1 points 1 hour ago I have given up on ever getting rid of them. permalink parent award report block reply\nIroWide 1 points 1 hour ago I have given up on ever getting rid of them. permalink parent award report block reply\nMastaJoda 1 points 1 hour ago whoa!!! THIS GUY HATES WALL STREET BILLIONAIRES! He's not MAGA permalink parent award report block reply\nRandoBudster 6 points 2 hours ago HOORAY! I'm an American citizen!...Now.. Death to America! permalink award report block reply\nblitzkrieg1 -1 points 1 hour ago This may help you with your uneducated post. https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply\nBe_The_Change 4 points 3 hours ago Comment removed by community moderators. permalink award report block reply\nSCHULTZ 2 points 1 hour ago Comment removed by community moderators. permalink award report block reply"
}