{
  "id": "1ARK590Lh5",
  "url": "https://patriots.win/p/1ARK590Lh5/a-50yr-mortgage-is-not-what-gen-/c",
  "content": "573 \"A 50yr mortgage is not what Gen Z wants. Deport 20M illegals aliens, end H-1B and OPT, and home prices will come down. \n\nHousing crisis resolved. America saved.\" posted 4 days ago by bleeje 51 comments award share report block Barefoot Student @BarefootStudent • 4d A 50yr mortgage is not what Gen Z wants. Deport 20M illegals aliens, end H-1B and OPT, and home prices will come down. Housing crisis resolved. America saved.\n51 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Bazhosh 26 points 4 days ago I don't want a 50 year mortgage, I want 50 million deportations. permalink award report block reply Maskurbator 3 points 3 days ago Agreed. But maybe we can dig deeper and find 70 million to deport? permalink parent award report block reply patrioticwinning3 15 points 4 days ago Op GETS IT!  But make it 50+ illegals, don't forget the anchor babies :p permalink award report block reply EastTexasMadLad 5 points 3 days ago They were NEVER actual citizens! permalink parent award report block reply Smurfection 12 points 4 days ago Also, zoning laws need to enacted to restrict corporations that are over a certain net worth from buying residential homes in single family home neighborhoods and turning them into section 8 or rental properties. permalink award report block reply Repentnow -2 points 4 days ago Yea, more government, more laws, more regulations — that's surely the best answer to fix America. permalink parent award report block reply Rakkasan91b 10 points 4 days ago Wrong, deport 40 million illegals and their anchor babies as well. permalink award report block reply SnakePlisken1776 9 points 4 days ago 20 million, they have been saying we had 11 million for 25 years and 10 million came in under Biden. We have 100 million that need to go. permalink award report block reply Mrpepelovesall2 8 points 4 days ago 50 year mortgages will actually cause home prices to go up. permalink award report block reply keeman 4 points 3 days ago That is why the people holding the leashes of the congresscritters want it. permalink parent award report block reply breadbaker 6 points 4 days ago A 50yr mortgage is not what Gen Z wants. Deport 20M illegals aliens, end H-1B and OPT, and home prices will come down.\nHousing crisis resolved. America saved. Also healthcare. permalink award report block reply Lovethatorangeman 6 points 4 days ago Some people might be like, \"will I even be alive in 50 years?\" permalink award report block reply starjello 5 points 4 days ago Exactly and an idiot down voted you. permalink parent award report block reply anotherthing 1 points 3 days ago Remember when \"a lifetime of debt\" was considered a bad thing? That's spending your entire life knowing that your house could wind up in the hands of the bank any time the economy takes a dive. permalink parent award report block reply keeman 0 points 3 days ago A good man is one who plants a tree who he will never see fully grown, for the benefit of those who follow. permalink parent award report block reply taytaytay 6 points 4 days ago lenders are salivating at the thought of longer mortgages. Fucking A, a 50 year will have you paying for the same real estate 3 times over permalink award report block reply Buildtheadytum 1 points 3 days ago Is there legislation preventing them from already offering this loan term? permalink parent award report block reply GreyKnight 5 points 4 days ago Crazy how these rich boomers and hedge funds can sit on the houses and control how many are released onto the auction market to inflate the prices, plus just rent everything for crazy high amounts… permalink award report block reply GeneticsGuy 4 points 4 days ago A 50 year mortgage is so dumb. I mean between 40 to 50 years the difference in monthly payments would be like $50, except you'd pay another half a million on the loan. A 50 year loan means you take out a $500,000 mortgage and end up paying like 4 million+. All this would do is make our country even more indebted to the banks than they already are and it'd take you 20 years before you saw any real equity gains on your home. Even a 35 year mortgage is bad. The solution isn't just longer loans. The solution is higher wages and more demand in our country. You know what would REALLY help drive prices of housing down a bit though? If the rental market wasn't so strong because we were importing 10 million people a year that needed to be housed. Imagine if the US kicked out 30 million illegal aliens from our country and all that housing opened up. Maybe then there wouldn't be so much pressure on housing. permalink award report block reply starjello -5 points 4 days ago The electoral asskicking last Tuesday is making Trump start to look desperate. Down vote away cultist zombies.\nNovember 7, 2025\nElection Results Show The Left Getting Away With Murder\nBy Jared Kardon There are many conclusions to be drawn from resounding Democrat victories in Tuesday’s elections, but perhaps none is sadder than this: the left suffered little blowback from the assassination of Charlie Kirk. In the aftermath of Kirk’s killing, there was a sense that it could be a momentous event in U.S. history, and a wake-up call for the right and the country as a whole. Not only had extreme anti-conservative rhetoric culminated in the murder of arguably the GOP’s brightest young star, but platforms like Bluesky and Reddit showcased the left immediately reveling in the gruesome shooting of an innocent man. permalink parent award report block reply GeneticsGuy 5 points 4 days ago Uh, you mean the Democrat  strongholds that 95% of the time vote Democrat? Try harder Fed. permalink parent award report block reply starjello -3 points 4 days ago Another dumb fuck who hates the truth. You and the other fag forgot about Virginia. Get lost cultist asshole.Go polish turds with your fag buddy. Wait till mid terms and you won't even be here. permalink parent award report block reply GeneticsGuy 3 points 3 days ago Lmfao, take his coat! Go back to mommy! permalink parent award report block reply keeman 3 points 3 days ago You mean the obviously cheated elections in Dem territory?  Nah. permalink parent award report block reply starjello 1 points 3 days ago They cheat everywhere. People here are in for a rude awakening next midterm. permalink parent award report block reply Tonz 4 points 4 days ago Women need to stop sabotaging their families, making families require two residences per household. permalink award report block reply ACActual 3 points 4 days ago Common sense.  Trump needs to step on the gas.  We voted for Mass Deportations not this permalink award report block reply keeman 5 points 3 days ago We voted for draining a swamp.  Giving Fannie and Freddie more powers is increasing the swamp. permalink parent award report block reply keeman 3 points 3 days ago I want the government out of the mortgage business.  And also to deport by whatever force necessary all the illegals.  End socialism AND the invasion. permalink award report block reply Shitsbrokeyo 2 points 3 days ago Deflation will occur permalink award report block reply Maskurbator 2 points 3 days ago Let's get the US population back to 1980 levels. permalink award report block reply Aggrieved03 2 points 4 days ago 50 million permalink award report block reply nomoreprinkles 2 points 3 days ago A 50 year mortgage...you may as well laugh and smear your own feces in our faces. The economy is so bad that boomers will outlive zillenials. The expected lifespan has gone DOWN. permalink award report block reply that1guy1981 2 points 4 days ago Zoning laws, even if we deport 20M illegals we kick the can down 1 generation. permalink award report block reply booblitchutz 1 points 3 days ago And PERM. Please Saar do not forget about PERM. permalink award report block reply starjello 1 points 3 days ago For the down voting idiots denying reality about last Tuesday elections. Democrats lost nothing and actually made gains. https://ballotpedia.org/State_legislative_elections,_2025 permalink award report block reply JerryNadlerBeltFund 1 points 3 days ago mortgage payment @ 5%, per $100,000 borrowed: 15-year: $790 -  total payments = $142k (42k interest paid) 30-year: $536 - total payments = $193k (93k interest paid) 50-year: $484 - total payments = $272k (172k interest paid) So with a 50-year , you pay 16% less per year, but pay for 67% longer. permalink award report block reply Atruckdriver 1 points 3 days ago Clearly most of you have no idea how finances work. Deflation will give the economy a stroke. That’s not a good thing. permalink award report block reply Silentbutdeadly 1 points 3 days ago That’s a shit load more interest that the banks can get with a 50 year mortgage-all backed by collateral.  Who are they really helping? permalink award report block reply booblitchutz 1 points 3 days ago These loans are not for people who intend to stay in their homes for 50 years permalink parent award report block reply Desensitized 1 points 4 days ago The 50 year mortgage is for me, when house prices go down and the government refuses to reduce the valuation of my home.  A fourplex seemed like a great investment at the time. permalink award report block reply starjello -4 points 4 days ago The electoral asskicking last Tuesday is making Trump start to look desperate. Down vote away cultist zombies. permalink award report block reply Repentnow 6 points 4 days ago Blue states won blue races.  There was no ass kicking. permalink parent award report block reply starjello -5 points 4 days ago Shut the fuck up you dumb shit..You are a broken record. Tuesday was a disaster. You are now blocked moron. Reality and you are total opposites. Bye cultist clown permalink parent award report block reply Repentnow 4 points 4 days ago Name the races that Dems won this week that were in an election region that Trump won last year. You can't.  All of the big blue wins were in areas that Trump lost last year. permalink parent award report block reply starjello -2 points 4 days ago Democrats did not lose a fuckin thing you dumb shit and made gains.This fucking thing makes me sign out before your block goes into effect. Bye retard signing out to put your block on. permalink parent award report block reply view 4 more comments... julianReyes -5 points 4 days ago \"ok, 2.5 million illegals have been deported and there are ongoing efforts to deprecate the visa programs\" \"yeah, but that doesn't match up with my tea leaves reading, nuh uh you are lame-o do-nothing, buh bye\" permalink award report block reply\nBazhosh 26 points 4 days ago I don't want a 50 year mortgage, I want 50 million deportations. permalink award report block reply Maskurbator 3 points 3 days ago Agreed. But maybe we can dig deeper and find 70 million to deport? permalink parent award report block reply\nMaskurbator 3 points 3 days ago Agreed. But maybe we can dig deeper and find 70 million to deport? permalink parent award report block reply\npatrioticwinning3 15 points 4 days ago Op GETS IT!  But make it 50+ illegals, don't forget the anchor babies :p permalink award report block reply EastTexasMadLad 5 points 3 days ago They were NEVER actual citizens! permalink parent award report block reply\nEastTexasMadLad 5 points 3 days ago They were NEVER actual citizens! permalink parent award report block reply\nSmurfection 12 points 4 days ago Also, zoning laws need to enacted to restrict corporations that are over a certain net worth from buying residential homes in single family home neighborhoods and turning them into section 8 or rental properties. permalink award report block reply Repentnow -2 points 4 days ago Yea, more government, more laws, more regulations — that's surely the best answer to fix America. permalink parent award report block reply\nRepentnow -2 points 4 days ago Yea, more government, more laws, more regulations — that's surely the best answer to fix America. permalink parent award report block reply\nRakkasan91b 10 points 4 days ago Wrong, deport 40 million illegals and their anchor babies as well. permalink award report block reply\nSnakePlisken1776 9 points 4 days ago 20 million, they have been saying we had 11 million for 25 years and 10 million came in under Biden. We have 100 million that need to go. permalink award report block reply\nMrpepelovesall2 8 points 4 days ago 50 year mortgages will actually cause home prices to go up. permalink award report block reply keeman 4 points 3 days ago That is why the people holding the leashes of the congresscritters want it. permalink parent award report block reply\nkeeman 4 points 3 days ago That is why the people holding the leashes of the congresscritters want it. permalink parent award report block reply\nbreadbaker 6 points 4 days ago A 50yr mortgage is not what Gen Z wants. Deport 20M illegals aliens, end H-1B and OPT, and home prices will come down.\nHousing crisis resolved. America saved. Also healthcare. permalink award report block reply\nLovethatorangeman 6 points 4 days ago Some people might be like, \"will I even be alive in 50 years?\" permalink award report block reply starjello 5 points 4 days ago Exactly and an idiot down voted you. permalink parent award report block reply anotherthing 1 points 3 days ago Remember when \"a lifetime of debt\" was considered a bad thing? That's spending your entire life knowing that your house could wind up in the hands of the bank any time the economy takes a dive. permalink parent award report block reply keeman 0 points 3 days ago A good man is one who plants a tree who he will never see fully grown, for the benefit of those who follow. permalink parent award report block reply\nstarjello 5 points 4 days ago Exactly and an idiot down voted you. permalink parent award report block reply\nanotherthing 1 points 3 days ago Remember when \"a lifetime of debt\" was considered a bad thing? That's spending your entire life knowing that your house could wind up in the hands of the bank any time the economy takes a dive. permalink parent award report block reply\nkeeman 0 points 3 days ago A good man is one who plants a tree who he will never see fully grown, for the benefit of those who follow. permalink parent award report block reply\ntaytaytay 6 points 4 days ago lenders are salivating at the thought of longer mortgages. Fucking A, a 50 year will have you paying for the same real estate 3 times over permalink award report block reply Buildtheadytum 1 points 3 days ago Is there legislation preventing them from already offering this loan term? permalink parent award report block reply\nBuildtheadytum 1 points 3 days ago Is there legislation preventing them from already offering this loan term? permalink parent award report block reply\nGreyKnight 5 points 4 days ago Crazy how these rich boomers and hedge funds can sit on the houses and control how many are released onto the auction market to inflate the prices, plus just rent everything for crazy high amounts… permalink award report block reply\nGeneticsGuy 4 points 4 days ago A 50 year mortgage is so dumb. I mean between 40 to 50 years the difference in monthly payments would be like $50, except you'd pay another half a million on the loan. A 50 year loan means you take out a $500,000 mortgage and end up paying like 4 million+. All this would do is make our country even more indebted to the banks than they already are and it'd take you 20 years before you saw any real equity gains on your home. Even a 35 year mortgage is bad. The solution isn't just longer loans. The solution is higher wages and more demand in our country. You know what would REALLY help drive prices of housing down a bit though? If the rental market wasn't so strong because we were importing 10 million people a year that needed to be housed. Imagine if the US kicked out 30 million illegal aliens from our country and all that housing opened up. Maybe then there wouldn't be so much pressure on housing. permalink award report block reply starjello -5 points 4 days ago The electoral asskicking last Tuesday is making Trump start to look desperate. Down vote away cultist zombies.\nNovember 7, 2025\nElection Results Show The Left Getting Away With Murder\nBy Jared Kardon There are many conclusions to be drawn from resounding Democrat victories in Tuesday’s elections, but perhaps none is sadder than this: the left suffered little blowback from the assassination of Charlie Kirk. In the aftermath of Kirk’s killing, there was a sense that it could be a momentous event in U.S. history, and a wake-up call for the right and the country as a whole. Not only had extreme anti-conservative rhetoric culminated in the murder of arguably the GOP’s brightest young star, but platforms like Bluesky and Reddit showcased the left immediately reveling in the gruesome shooting of an innocent man. permalink parent award report block reply GeneticsGuy 5 points 4 days ago Uh, you mean the Democrat  strongholds that 95% of the time vote Democrat? Try harder Fed. permalink parent award report block reply starjello -3 points 4 days ago Another dumb fuck who hates the truth. You and the other fag forgot about Virginia. Get lost cultist asshole.Go polish turds with your fag buddy. Wait till mid terms and you won't even be here. permalink parent award report block reply GeneticsGuy 3 points 3 days ago Lmfao, take his coat! Go back to mommy! permalink parent award report block reply keeman 3 points 3 days ago You mean the obviously cheated elections in Dem territory?  Nah. permalink parent award report block reply starjello 1 points 3 days ago They cheat everywhere. People here are in for a rude awakening next midterm. permalink parent award report block reply\nstarjello -5 points 4 days ago The electoral asskicking last Tuesday is making Trump start to look desperate. Down vote away cultist zombies.\nNovember 7, 2025\nElection Results Show The Left Getting Away With Murder\nBy Jared Kardon There are many conclusions to be drawn from resounding Democrat victories in Tuesday’s elections, but perhaps none is sadder than this: the left suffered little blowback from the assassination of Charlie Kirk. In the aftermath of Kirk’s killing, there was a sense that it could be a momentous event in U.S. history, and a wake-up call for the right and the country as a whole. Not only had extreme anti-conservative rhetoric culminated in the murder of arguably the GOP’s brightest young star, but platforms like Bluesky and Reddit showcased the left immediately reveling in the gruesome shooting of an innocent man. permalink parent award report block reply GeneticsGuy 5 points 4 days ago Uh, you mean the Democrat  strongholds that 95% of the time vote Democrat? Try harder Fed. permalink parent award report block reply starjello -3 points 4 days ago Another dumb fuck who hates the truth. You and the other fag forgot about Virginia. Get lost cultist asshole.Go polish turds with your fag buddy. Wait till mid terms and you won't even be here. permalink parent award report block reply GeneticsGuy 3 points 3 days ago Lmfao, take his coat! Go back to mommy! permalink parent award report block reply keeman 3 points 3 days ago You mean the obviously cheated elections in Dem territory?  Nah. permalink parent award report block reply starjello 1 points 3 days ago They cheat everywhere. People here are in for a rude awakening next midterm. permalink parent award report block reply\nGeneticsGuy 5 points 4 days ago Uh, you mean the Democrat  strongholds that 95% of the time vote Democrat? Try harder Fed. permalink parent award report block reply starjello -3 points 4 days ago Another dumb fuck who hates the truth. You and the other fag forgot about Virginia. Get lost cultist asshole.Go polish turds with your fag buddy. Wait till mid terms and you won't even be here. permalink parent award report block reply GeneticsGuy 3 points 3 days ago Lmfao, take his coat! Go back to mommy! permalink parent award report block reply\nstarjello -3 points 4 days ago Another dumb fuck who hates the truth. You and the other fag forgot about Virginia. Get lost cultist asshole.Go polish turds with your fag buddy. Wait till mid terms and you won't even be here. permalink parent award report block reply GeneticsGuy 3 points 3 days ago Lmfao, take his coat! Go back to mommy! permalink parent award report block reply\nGeneticsGuy 3 points 3 days ago Lmfao, take his coat! Go back to mommy! permalink parent award report block reply\nkeeman 3 points 3 days ago You mean the obviously cheated elections in Dem territory?  Nah. permalink parent award report block reply starjello 1 points 3 days ago They cheat everywhere. People here are in for a rude awakening next midterm. permalink parent award report block reply\nstarjello 1 points 3 days ago They cheat everywhere. People here are in for a rude awakening next midterm. permalink parent award report block reply\nTonz 4 points 4 days ago Women need to stop sabotaging their families, making families require two residences per household. permalink award report block reply\nACActual 3 points 4 days ago Common sense.  Trump needs to step on the gas.  We voted for Mass Deportations not this permalink award report block reply keeman 5 points 3 days ago We voted for draining a swamp.  Giving Fannie and Freddie more powers is increasing the swamp. permalink parent award report block reply\nkeeman 5 points 3 days ago We voted for draining a swamp.  Giving Fannie and Freddie more powers is increasing the swamp. permalink parent award report block reply\nkeeman 3 points 3 days ago I want the government out of the mortgage business.  And also to deport by whatever force necessary all the illegals.  End socialism AND the invasion. permalink award report block reply\nShitsbrokeyo 2 points 3 days ago Deflation will occur permalink award report block reply\nMaskurbator 2 points 3 days ago Let's get the US population back to 1980 levels. permalink award report block reply\nAggrieved03 2 points 4 days ago 50 million permalink award report block reply\nnomoreprinkles 2 points 3 days ago A 50 year mortgage...you may as well laugh and smear your own feces in our faces. The economy is so bad that boomers will outlive zillenials. The expected lifespan has gone DOWN. permalink award report block reply\nthat1guy1981 2 points 4 days ago Zoning laws, even if we deport 20M illegals we kick the can down 1 generation. permalink award report block reply\nbooblitchutz 1 points 3 days ago And PERM. Please Saar do not forget about PERM. permalink award report block reply\nstarjello 1 points 3 days ago For the down voting idiots denying reality about last Tuesday elections. Democrats lost nothing and actually made gains. https://ballotpedia.org/State_legislative_elections,_2025 permalink award report block reply\nJerryNadlerBeltFund 1 points 3 days ago mortgage payment @ 5%, per $100,000 borrowed: 15-year: $790 -  total payments = $142k (42k interest paid) 30-year: $536 - total payments = $193k (93k interest paid) 50-year: $484 - total payments = $272k (172k interest paid) So with a 50-year , you pay 16% less per year, but pay for 67% longer. permalink award report block reply\nAtruckdriver 1 points 3 days ago Clearly most of you have no idea how finances work. Deflation will give the economy a stroke. That’s not a good thing. permalink award report block reply\nSilentbutdeadly 1 points 3 days ago That’s a shit load more interest that the banks can get with a 50 year mortgage-all backed by collateral.  Who are they really helping? permalink award report block reply booblitchutz 1 points 3 days ago These loans are not for people who intend to stay in their homes for 50 years permalink parent award report block reply\nbooblitchutz 1 points 3 days ago These loans are not for people who intend to stay in their homes for 50 years permalink parent award report block reply\nDesensitized 1 points 4 days ago The 50 year mortgage is for me, when house prices go down and the government refuses to reduce the valuation of my home.  A fourplex seemed like a great investment at the time. permalink award report block reply\nstarjello -4 points 4 days ago The electoral asskicking last Tuesday is making Trump start to look desperate. Down vote away cultist zombies. permalink award report block reply Repentnow 6 points 4 days ago Blue states won blue races.  There was no ass kicking. permalink parent award report block reply starjello -5 points 4 days ago Shut the fuck up you dumb shit..You are a broken record. Tuesday was a disaster. You are now blocked moron. Reality and you are total opposites. Bye cultist clown permalink parent award report block reply Repentnow 4 points 4 days ago Name the races that Dems won this week that were in an election region that Trump won last year. You can't.  All of the big blue wins were in areas that Trump lost last year. permalink parent award report block reply starjello -2 points 4 days ago Democrats did not lose a fuckin thing you dumb shit and made gains.This fucking thing makes me sign out before your block goes into effect. Bye retard signing out to put your block on. permalink parent award report block reply view 4 more comments...\nRepentnow 6 points 4 days ago Blue states won blue races.  There was no ass kicking. permalink parent award report block reply starjello -5 points 4 days ago Shut the fuck up you dumb shit..You are a broken record. Tuesday was a disaster. You are now blocked moron. Reality and you are total opposites. Bye cultist clown permalink parent award report block reply Repentnow 4 points 4 days ago Name the races that Dems won this week that were in an election region that Trump won last year. You can't.  All of the big blue wins were in areas that Trump lost last year. permalink parent award report block reply starjello -2 points 4 days ago Democrats did not lose a fuckin thing you dumb shit and made gains.This fucking thing makes me sign out before your block goes into effect. Bye retard signing out to put your block on. permalink parent award report block reply view 4 more comments...\nstarjello -5 points 4 days ago Shut the fuck up you dumb shit..You are a broken record. Tuesday was a disaster. You are now blocked moron. Reality and you are total opposites. Bye cultist clown permalink parent award report block reply Repentnow 4 points 4 days ago Name the races that Dems won this week that were in an election region that Trump won last year. You can't.  All of the big blue wins were in areas that Trump lost last year. permalink parent award report block reply starjello -2 points 4 days ago Democrats did not lose a fuckin thing you dumb shit and made gains.This fucking thing makes me sign out before your block goes into effect. Bye retard signing out to put your block on. permalink parent award report block reply view 4 more comments...\nRepentnow 4 points 4 days ago Name the races that Dems won this week that were in an election region that Trump won last year. You can't.  All of the big blue wins were in areas that Trump lost last year. permalink parent award report block reply starjello -2 points 4 days ago Democrats did not lose a fuckin thing you dumb shit and made gains.This fucking thing makes me sign out before your block goes into effect. Bye retard signing out to put your block on. permalink parent award report block reply view 4 more comments...\nstarjello -2 points 4 days ago Democrats did not lose a fuckin thing you dumb shit and made gains.This fucking thing makes me sign out before your block goes into effect. Bye retard signing out to put your block on. permalink parent award report block reply view 4 more comments...\njulianReyes -5 points 4 days ago \"ok, 2.5 million illegals have been deported and there are ongoing efforts to deprecate the visa programs\" \"yeah, but that doesn't match up with my tea leaves reading, nuh uh you are lame-o do-nothing, buh bye\" permalink award report block reply"
}