{
  "id": "1ARK9iqOcW",
  "url": "https://patriots.win/p/1ARK9iqOcW/benjamin-netanyahu-is-now-being-/c",
  "content": "294 Benjamin Netanyahu is now being accused of bearing responsibility for the October 7th terrorist attack in Israel and for allegedly funding Hamas. posted 2 days ago by CatalystForChange 35 comments award share report block Shadow of Ezra @ShadowofEzra • 2d Benjamin Netanyahu is now being accused of bearing responsibility for the October 7th terrorist attack in Israel and for allegedly funding Hamas. Israeli Knesset member Naama Lazimi claims Netanyahu issued a stand-down order and ignored key security protocols before the attack.\n35 comments Sort by Top Top New Worst Old Save BerettaStroker 30 points 2 days ago Thought this was well known at this point? permalink award report block reply Taqiyya_Mockingbird 22 points 2 days ago A country the size of New Jersey, the most significant intelligence agency on Earth, capable of blowing people up with boobytrapped pagers, and they didn’t know this attack was coming, couldn’t scramble their response for 6 hours? These people are willing to sacrifice a few of their own to endow their status as victims of a problem they created. This wouldn’t be the first time in history they have done that either. permalink parent award report block reply LordCommissarYarrick 22 points 2 days ago It should be. There's articles and stuff going back years how Netanyahu and the Israeli Government deliberately fostered Hamas as a tool to be used against the Palestinian cause and undermine Abbas. permalink parent award report block reply JackRile 13 points 2 days ago The military taking 8-hrs to respond to an attack 30-minutes away should have been everyones first clue that something wasn't quiet right permalink parent award report block reply HillarysBeaverMunch 2 points 2 days ago Yeah: What was that all about? Was anyone held accountable? I find this factoid difficult to just let go. permalink parent award report block reply y_do_i_need_to_hide 13 points 2 days ago Known and talked about are not the same thing. I mean, I know 2020 was stolen. I am hoping we will talk about it. :) permalink parent award report block reply DickTick PRO 1 points 2 days ago Yeah but should we really be parroting and championing what everybody over there calls the Israeli AOC? permalink parent award report block reply Region 5 points 2 days ago Is it the truth or is it a lie? That should be the only question. Ignoring the truth because of who says it does not put one on the side of good. permalink parent award report block reply Brownwaterboys 12 points 2 days ago Half the words in their language starts with \"hauck\" permalink award report block reply sordfysh PRO 4 points 2 days ago Yiddish is not the same as Hebrew. Yiddish is not even a semitic language. permalink parent award report block reply mty_green_go 5 points 2 days ago who gives a jewfuck permalink parent award report block reply HillarysBeaverMunch 3 points 2 days ago Isn't Yiddish derived from German or Russian? permalink parent award report block reply sordfysh PRO 1 points 1 day ago Yes. permalink parent award report block reply TenchuStealthAss 8 points 2 days ago People were already accusing him of this. I knew it was bullshit when they said they relocated a music concert there like a day before it happened. permalink award report block reply TrumpAndGodWin 2 points 2 days ago They even went around disarming local jews ahead of it. permalink parent award report block reply Crappydatum 8 points 2 days ago No noticing permalink award report block reply Awakened 7 points 2 days ago Well it's the fucking truth. Cheney did the same thing during 9/11 and completely got away with it. permalink award report block reply snoopy3210 4 points 2 days ago Go on c-span.org Look up Joe Biden speech on September 12, 2001. permalink parent award report block reply learntocode 1 points 2 days ago All I can see is a Sept. 10 2001 press conference. What a waste of time. permalink parent award report block reply Luvs_2_Bop 6 points 2 days ago I think they mean we funded Hamas…they have no money to fund anything without us… permalink award report block reply PhantomShield72 4 points 2 days ago Ugly ass language... Even more guttural and in the back of the throat than German. permalink award report block reply HillarysBeaverMunch 5 points 2 days ago Pretty sure their ancestral language was \"Khazar \". permalink parent award report block reply nod32 4 points 2 days ago lol hes polish of course he doesnt give a shit about the people in the region permalink award report block reply MinneMAGA 2 points 2 days ago https://imgflip.com/i/abqcck permalink award report block reply learntocode 2 points 2 days ago Bro, he signed papers for the Qatari money sent to them. Israelis were screaming six years ago about all the cement going to the tunnel network. permalink award report block reply GhostOfMyFormerSelf 2 points 2 days ago Don't care. Not the US, so don't care. permalink award report block reply ActNow 3 points 2 days ago How much American money is being sent to Israel? You should care. permalink parent award report block reply Briben 1 points 1 day ago Leftists gonna leftist.  If any of this were true the population there would shred him with their hands permalink award report block reply HillarysBeaverMunch 1 points 2 days ago I miss Fatah. Are they still around?  They were referenced in the movie Navy Seals with Charlie Sheen. Pretty good movie,  BTW. permalink award report block reply nautilus 0 points 2 days ago Kibbutz Re'im is THE most progressive politician in Israel, and she is blaming Netanyahu so she doesn't have to blame her precious Muslim friends. She spends far more energy fighting for a Palestinian State than she does her own country. Stop falling for hysterical progressive females - this is about as accurate as our Left claiming Trump is a 34 time felon. permalink award report block reply CyanScales -5 points 2 days ago Even Israel has AOC types permalink award report block reply YaharaRiver -14 points 2 days ago Don’t feel too bad, Prime Minister, New York City just got saddled with a muslim communist.  This “opposite” shit is happening worldwide. permalink award report block reply curiousorganelle 17 points 2 days ago He must actually be your prime minister. Haha what a faggot! permalink parent award report block reply Vorgar 1 points 2 days ago Comment removed by community filter, pending further review. permalink award report block reply\nBerettaStroker 30 points 2 days ago Thought this was well known at this point? permalink award report block reply Taqiyya_Mockingbird 22 points 2 days ago A country the size of New Jersey, the most significant intelligence agency on Earth, capable of blowing people up with boobytrapped pagers, and they didn’t know this attack was coming, couldn’t scramble their response for 6 hours? These people are willing to sacrifice a few of their own to endow their status as victims of a problem they created. This wouldn’t be the first time in history they have done that either. permalink parent award report block reply LordCommissarYarrick 22 points 2 days ago It should be. There's articles and stuff going back years how Netanyahu and the Israeli Government deliberately fostered Hamas as a tool to be used against the Palestinian cause and undermine Abbas. permalink parent award report block reply JackRile 13 points 2 days ago The military taking 8-hrs to respond to an attack 30-minutes away should have been everyones first clue that something wasn't quiet right permalink parent award report block reply HillarysBeaverMunch 2 points 2 days ago Yeah: What was that all about? Was anyone held accountable? I find this factoid difficult to just let go. permalink parent award report block reply y_do_i_need_to_hide 13 points 2 days ago Known and talked about are not the same thing. I mean, I know 2020 was stolen. I am hoping we will talk about it. :) permalink parent award report block reply DickTick PRO 1 points 2 days ago Yeah but should we really be parroting and championing what everybody over there calls the Israeli AOC? permalink parent award report block reply Region 5 points 2 days ago Is it the truth or is it a lie? That should be the only question. Ignoring the truth because of who says it does not put one on the side of good. permalink parent award report block reply\nTaqiyya_Mockingbird 22 points 2 days ago A country the size of New Jersey, the most significant intelligence agency on Earth, capable of blowing people up with boobytrapped pagers, and they didn’t know this attack was coming, couldn’t scramble their response for 6 hours? These people are willing to sacrifice a few of their own to endow their status as victims of a problem they created. This wouldn’t be the first time in history they have done that either. permalink parent award report block reply\nLordCommissarYarrick 22 points 2 days ago It should be. There's articles and stuff going back years how Netanyahu and the Israeli Government deliberately fostered Hamas as a tool to be used against the Palestinian cause and undermine Abbas. permalink parent award report block reply JackRile 13 points 2 days ago The military taking 8-hrs to respond to an attack 30-minutes away should have been everyones first clue that something wasn't quiet right permalink parent award report block reply HillarysBeaverMunch 2 points 2 days ago Yeah: What was that all about? Was anyone held accountable? I find this factoid difficult to just let go. permalink parent award report block reply\nJackRile 13 points 2 days ago The military taking 8-hrs to respond to an attack 30-minutes away should have been everyones first clue that something wasn't quiet right permalink parent award report block reply HillarysBeaverMunch 2 points 2 days ago Yeah: What was that all about? Was anyone held accountable? I find this factoid difficult to just let go. permalink parent award report block reply\nHillarysBeaverMunch 2 points 2 days ago Yeah: What was that all about? Was anyone held accountable? I find this factoid difficult to just let go. permalink parent award report block reply\ny_do_i_need_to_hide 13 points 2 days ago Known and talked about are not the same thing. I mean, I know 2020 was stolen. I am hoping we will talk about it. :) permalink parent award report block reply\nDickTick PRO 1 points 2 days ago Yeah but should we really be parroting and championing what everybody over there calls the Israeli AOC? permalink parent award report block reply Region 5 points 2 days ago Is it the truth or is it a lie? That should be the only question. Ignoring the truth because of who says it does not put one on the side of good. permalink parent award report block reply\nRegion 5 points 2 days ago Is it the truth or is it a lie? That should be the only question. Ignoring the truth because of who says it does not put one on the side of good. permalink parent award report block reply\nBrownwaterboys 12 points 2 days ago Half the words in their language starts with \"hauck\" permalink award report block reply sordfysh PRO 4 points 2 days ago Yiddish is not the same as Hebrew. Yiddish is not even a semitic language. permalink parent award report block reply mty_green_go 5 points 2 days ago who gives a jewfuck permalink parent award report block reply HillarysBeaverMunch 3 points 2 days ago Isn't Yiddish derived from German or Russian? permalink parent award report block reply sordfysh PRO 1 points 1 day ago Yes. permalink parent award report block reply\nsordfysh PRO 4 points 2 days ago Yiddish is not the same as Hebrew. Yiddish is not even a semitic language. permalink parent award report block reply mty_green_go 5 points 2 days ago who gives a jewfuck permalink parent award report block reply HillarysBeaverMunch 3 points 2 days ago Isn't Yiddish derived from German or Russian? permalink parent award report block reply sordfysh PRO 1 points 1 day ago Yes. permalink parent award report block reply\nmty_green_go 5 points 2 days ago who gives a jewfuck permalink parent award report block reply\nHillarysBeaverMunch 3 points 2 days ago Isn't Yiddish derived from German or Russian? permalink parent award report block reply sordfysh PRO 1 points 1 day ago Yes. permalink parent award report block reply\nsordfysh PRO 1 points 1 day ago Yes. permalink parent award report block reply\nTenchuStealthAss 8 points 2 days ago People were already accusing him of this. I knew it was bullshit when they said they relocated a music concert there like a day before it happened. permalink award report block reply TrumpAndGodWin 2 points 2 days ago They even went around disarming local jews ahead of it. permalink parent award report block reply\nTrumpAndGodWin 2 points 2 days ago They even went around disarming local jews ahead of it. permalink parent award report block reply\nCrappydatum 8 points 2 days ago No noticing permalink award report block reply\nAwakened 7 points 2 days ago Well it's the fucking truth. Cheney did the same thing during 9/11 and completely got away with it. permalink award report block reply snoopy3210 4 points 2 days ago Go on c-span.org Look up Joe Biden speech on September 12, 2001. permalink parent award report block reply learntocode 1 points 2 days ago All I can see is a Sept. 10 2001 press conference. What a waste of time. permalink parent award report block reply\nsnoopy3210 4 points 2 days ago Go on c-span.org Look up Joe Biden speech on September 12, 2001. permalink parent award report block reply learntocode 1 points 2 days ago All I can see is a Sept. 10 2001 press conference. What a waste of time. permalink parent award report block reply\nlearntocode 1 points 2 days ago All I can see is a Sept. 10 2001 press conference. What a waste of time. permalink parent award report block reply\nLuvs_2_Bop 6 points 2 days ago I think they mean we funded Hamas…they have no money to fund anything without us… permalink award report block reply\nPhantomShield72 4 points 2 days ago Ugly ass language... Even more guttural and in the back of the throat than German. permalink award report block reply HillarysBeaverMunch 5 points 2 days ago Pretty sure their ancestral language was \"Khazar \". permalink parent award report block reply\nHillarysBeaverMunch 5 points 2 days ago Pretty sure their ancestral language was \"Khazar \". permalink parent award report block reply\nnod32 4 points 2 days ago lol hes polish of course he doesnt give a shit about the people in the region permalink award report block reply\nMinneMAGA 2 points 2 days ago https://imgflip.com/i/abqcck permalink award report block reply\nlearntocode 2 points 2 days ago Bro, he signed papers for the Qatari money sent to them. Israelis were screaming six years ago about all the cement going to the tunnel network. permalink award report block reply\nGhostOfMyFormerSelf 2 points 2 days ago Don't care. Not the US, so don't care. permalink award report block reply ActNow 3 points 2 days ago How much American money is being sent to Israel? You should care. permalink parent award report block reply\nActNow 3 points 2 days ago How much American money is being sent to Israel? You should care. permalink parent award report block reply\nBriben 1 points 1 day ago Leftists gonna leftist.  If any of this were true the population there would shred him with their hands permalink award report block reply\nHillarysBeaverMunch 1 points 2 days ago I miss Fatah. Are they still around?  They were referenced in the movie Navy Seals with Charlie Sheen. Pretty good movie,  BTW. permalink award report block reply\nnautilus 0 points 2 days ago Kibbutz Re'im is THE most progressive politician in Israel, and she is blaming Netanyahu so she doesn't have to blame her precious Muslim friends. She spends far more energy fighting for a Palestinian State than she does her own country. Stop falling for hysterical progressive females - this is about as accurate as our Left claiming Trump is a 34 time felon. permalink award report block reply\nCyanScales -5 points 2 days ago Even Israel has AOC types permalink award report block reply\nYaharaRiver -14 points 2 days ago Don’t feel too bad, Prime Minister, New York City just got saddled with a muslim communist.  This “opposite” shit is happening worldwide. permalink award report block reply curiousorganelle 17 points 2 days ago He must actually be your prime minister. Haha what a faggot! permalink parent award report block reply\ncuriousorganelle 17 points 2 days ago He must actually be your prime minister. Haha what a faggot! permalink parent award report block reply\nVorgar 1 points 2 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T21:07:51.622629Z"
}