{
  "id": "1ARK9irE6G",
  "url": "https://patriots.win/p/1ARK9irE6G/president-trump-asks-the-us-supr/c",
  "content": "298 President Trump asks the U.S. Supreme Court to REVERSE the ruling that found him liable for “sexually abusing” E. Jean Carroll posted 2 days ago by I-am-Orlando PRO 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style KarenLukasik 8 points 2 days ago We saw the effect of the Trump curse on Stormy-does EG want the same horrible fate? She better recant and apologize to the President,it still might be not too late. permalink award report block reply CyanScales 2 points 1 day ago have you seen what EG has always looked like? She already succumbed to that fate. She looks terrible. permalink parent award report block reply I-am-Orlando OP PRO 6 points 2 days ago Link https://x.com/EricLDaugh/status/1988017938109264305?s=20 permalink award report block reply voidposter 6 points 2 days ago Correct me if I'm wrong, but I thought he wasn't found guilty of \"assaulting\", just \"defaming\" her, or some shit, by saying he didn't assault her / defending himself. permalink award report block reply ColonelKlink 5 points 2 days ago She needs to be in prison for lying. The psychopath is obsessed with rape and thinks it's sexy. permalink award report block reply zooty 4 points 2 days ago I mean, it was bullshit but what's the legal theory here? permalink award report block reply Harvestsmiles 4 points 2 days ago Just show them the video of the Carrol/Anderson Cooper interview. permalink award report block reply lifeisahologram 3 points 2 days ago How can you be held liable for denying a rape happened when you literally were not found guilty of it in the first place? Because I’m pretty sure he was never found guilty of any rape, his only charge is in relation to claiming her claims were fake and that was slander or some shit, which is crazy considering she’s the one asserting the unfounded and unproven claim and not him. permalink award report block reply Blackmore 2 points 2 days ago Liar liar, you made up the assault, time to come clean. permalink award report block reply\nKarenLukasik 8 points 2 days ago We saw the effect of the Trump curse on Stormy-does EG want the same horrible fate? She better recant and apologize to the President,it still might be not too late. permalink award report block reply CyanScales 2 points 1 day ago have you seen what EG has always looked like? She already succumbed to that fate. She looks terrible. permalink parent award report block reply\nCyanScales 2 points 1 day ago have you seen what EG has always looked like? She already succumbed to that fate. She looks terrible. permalink parent award report block reply\nI-am-Orlando OP PRO 6 points 2 days ago Link https://x.com/EricLDaugh/status/1988017938109264305?s=20 permalink award report block reply\nvoidposter 6 points 2 days ago Correct me if I'm wrong, but I thought he wasn't found guilty of \"assaulting\", just \"defaming\" her, or some shit, by saying he didn't assault her / defending himself. permalink award report block reply\nColonelKlink 5 points 2 days ago She needs to be in prison for lying. The psychopath is obsessed with rape and thinks it's sexy. permalink award report block reply\nzooty 4 points 2 days ago I mean, it was bullshit but what's the legal theory here? permalink award report block reply\nHarvestsmiles 4 points 2 days ago Just show them the video of the Carrol/Anderson Cooper interview. permalink award report block reply\nlifeisahologram 3 points 2 days ago How can you be held liable for denying a rape happened when you literally were not found guilty of it in the first place? Because I’m pretty sure he was never found guilty of any rape, his only charge is in relation to claiming her claims were fake and that was slander or some shit, which is crazy considering she’s the one asserting the unfounded and unproven claim and not him. permalink award report block reply\nBlackmore 2 points 2 days ago Liar liar, you made up the assault, time to come clean. permalink award report block reply",
  "fetched_at": "2025-11-12T23:16:07.330887Z"
}