{
  "id": "1ARK56jHjs",
  "url": "https://patriots.win/p/1ARK56jHjs/walmart-is-safe-again/c",
  "content": "274 Walmart is safe again posted 5 days ago by PiratePatriotParrot 14 comments award share report block David Santa Carla 🦇 @TheOnlyDSC • 5d All we had to do to shop in peace without blacks ruining everything was cut their EBT.\n14 comments Sort by Top Top New Worst Old Save SanityGumby 15 points 5 days ago We can all live that way if we fulfill Lincoln's dream of sending them back. I mean, I live that way anyway because my area is well north of 90% white. But if we got rid of SNAP it would be even better because there wouldn't be any obese white women with 10 kids either. permalink award report block reply HeavenlyTrumpets 5 points 5 days ago hmm.  for a whole bunch of reasons, i haven't gone to walmart in a long time.  i might have to stop buy and get some random thing just to see what it's like right now. permalink award report block reply NomadicKrow2 4 points 5 days ago Mine has still been crowded. A lot less people of a certain race, but still crowded. permalink parent award report block reply DeplorableNeandertal 2 points 4 days ago Same here permalink parent award report block reply Zskills 5 points 5 days ago Why doesn't he just move?  Is that his small child?  Living in places with nonsense is irresponsible. permalink award report block reply ColonelKlink 9 points 5 days ago Yeah, I don't understand. We made sure to make a home nowhere near feral animals. permalink parent award report block reply Dreddhead13 2 points 4 days ago Exactly.... When my kid hit school.... We hit the countryside. permalink parent award report block reply SomecatsareMAGA 3 points 5 days ago LOL that dude is funny and it's awesome. permalink award report block reply Zskills 2 points 5 days ago He needs to get his family the heck away from that place.  What is he even doing?  Does he not love them?  Why would he subject them to living there? I saw nothing funny, my heart was breaking for that little girl of his. permalink parent award report block reply YaharaRiver 2 points 4 days ago They can also stop building vast supercenters with 14’ wide aisles when there’s not a feral crowd. What a waste of real estate to accommodate! I suppose it’s good exercise to walk a full mile to buy 12 items, but the parks will also be more peaceful, so go there instead. Smaller stores is how beloved Aldi’s built an empire. My store has 1000 feet or more of shelving devoted to “ethnic foods”.  This is 100% nonsense! WTF is tamarind?! Who even cares?  Get rid of that shit!  (I will buy Pocky if I see it though, lol.) permalink award report block reply redinmn 2 points 4 days ago When the rot isn't present, the US is actually a very nice place to live and work. permalink award report block reply cbonez416 2 points 4 days ago Everything is fake including ALL numbers given to us by criminals. There are more then 42 million on welfare!! It's more like 60 million including illegals. permalink award report block reply Psalm-118_24 1 points 4 days ago And with all the supposed \"chaos\" at airports there are no brawls.  I can't imagine why. permalink award report block reply UpvoteBot 1 points 4 days ago This is 7:30pm, EBT Americans tend to shop mid-day when their tax slaves are at work… permalink award report block reply\nSanityGumby 15 points 5 days ago We can all live that way if we fulfill Lincoln's dream of sending them back. I mean, I live that way anyway because my area is well north of 90% white. But if we got rid of SNAP it would be even better because there wouldn't be any obese white women with 10 kids either. permalink award report block reply\nHeavenlyTrumpets 5 points 5 days ago hmm.  for a whole bunch of reasons, i haven't gone to walmart in a long time.  i might have to stop buy and get some random thing just to see what it's like right now. permalink award report block reply NomadicKrow2 4 points 5 days ago Mine has still been crowded. A lot less people of a certain race, but still crowded. permalink parent award report block reply DeplorableNeandertal 2 points 4 days ago Same here permalink parent award report block reply\nNomadicKrow2 4 points 5 days ago Mine has still been crowded. A lot less people of a certain race, but still crowded. permalink parent award report block reply DeplorableNeandertal 2 points 4 days ago Same here permalink parent award report block reply\nDeplorableNeandertal 2 points 4 days ago Same here permalink parent award report block reply\nZskills 5 points 5 days ago Why doesn't he just move?  Is that his small child?  Living in places with nonsense is irresponsible. permalink award report block reply ColonelKlink 9 points 5 days ago Yeah, I don't understand. We made sure to make a home nowhere near feral animals. permalink parent award report block reply Dreddhead13 2 points 4 days ago Exactly.... When my kid hit school.... We hit the countryside. permalink parent award report block reply\nColonelKlink 9 points 5 days ago Yeah, I don't understand. We made sure to make a home nowhere near feral animals. permalink parent award report block reply Dreddhead13 2 points 4 days ago Exactly.... When my kid hit school.... We hit the countryside. permalink parent award report block reply\nDreddhead13 2 points 4 days ago Exactly.... When my kid hit school.... We hit the countryside. permalink parent award report block reply\nSomecatsareMAGA 3 points 5 days ago LOL that dude is funny and it's awesome. permalink award report block reply Zskills 2 points 5 days ago He needs to get his family the heck away from that place.  What is he even doing?  Does he not love them?  Why would he subject them to living there? I saw nothing funny, my heart was breaking for that little girl of his. permalink parent award report block reply\nZskills 2 points 5 days ago He needs to get his family the heck away from that place.  What is he even doing?  Does he not love them?  Why would he subject them to living there? I saw nothing funny, my heart was breaking for that little girl of his. permalink parent award report block reply\nYaharaRiver 2 points 4 days ago They can also stop building vast supercenters with 14’ wide aisles when there’s not a feral crowd. What a waste of real estate to accommodate! I suppose it’s good exercise to walk a full mile to buy 12 items, but the parks will also be more peaceful, so go there instead. Smaller stores is how beloved Aldi’s built an empire. My store has 1000 feet or more of shelving devoted to “ethnic foods”.  This is 100% nonsense! WTF is tamarind?! Who even cares?  Get rid of that shit!  (I will buy Pocky if I see it though, lol.) permalink award report block reply\nredinmn 2 points 4 days ago When the rot isn't present, the US is actually a very nice place to live and work. permalink award report block reply\ncbonez416 2 points 4 days ago Everything is fake including ALL numbers given to us by criminals. There are more then 42 million on welfare!! It's more like 60 million including illegals. permalink award report block reply\nPsalm-118_24 1 points 4 days ago And with all the supposed \"chaos\" at airports there are no brawls.  I can't imagine why. permalink award report block reply\nUpvoteBot 1 points 4 days ago This is 7:30pm, EBT Americans tend to shop mid-day when their tax slaves are at work… permalink award report block reply",
  "fetched_at": "2025-11-12T21:02:37.569530Z"
}