{
  "id": "1ARK54Ts4m",
  "url": "https://patriots.win/p/1ARK54Ts4m/israel-is-dumping-hundreds-of-mi/c",
  "content": "342 Israel is dumping hundreds of millions into US influence efforts, targeting Evangelicals in churches with the \"largest US geofencing operation\" in history. posted 5 days ago by ALT26 45 comments award share report block AF Post @AFpost • 5d Israel is dumping hundreds of millions into US influence efforts, targeting Evangelicals in churches with the \"largest US geofencing operation\" in history. The project aims to influence Google search results and AI responses from ChatGPT and Claude, targeting younger Americans\n45 comments Sort by Top Top New Worst Old Save FKH2 38 points 5 days ago We pay Israel billions so they can progagandize us with our own money that we are forced to pay permalink award report block reply Deplorable_Yankee 23 points 5 days ago And when you even remotely talk anything bad about them they deny it while spending millions on propaganda to convince us they are the good guys. I feel like you don’t have to use propaganda if you are the good guys. They are just proving people right by pushing so hard. permalink parent award report block reply Taylor3006 21 points 5 days ago I am old and one lesson I have learned over the years is that if someone has to pay you to be their friend, if someone has to keep telling you they are your friend, if that person always expects you to pick up the tab, and if that person gets into a bar fight and they expect you to do the fighting for them, then they are not your friend. permalink parent award report block reply schnazzmizzle 1 points 5 days ago Ezekiel 16:30-34\n30 “How degenerate is your heart!” says the Lord God, “seeing you do all these things, the deeds of a brazen harlot.\n31 You erected your shrine at the head of every road, and built your high place in every street. Yet you were not like a harlot, because you scorned payment.\n32 You are an adulterous wife, who takes strangers instead of her husband.\n33 Men make payment to all harlots, but you made your payments to all your lovers, and hired them to come to you from all around for your harlotry.\n34 You are the opposite of other women in your harlotry, because no one solicited you to be a harlot. In that you gave payment but no payment was given you, therefore you are the opposite.” permalink parent award report block reply YaharaRiver -6 points 5 days ago I learned that in third grade. permalink parent award report block reply LiteraIIyHitIer 4 points 5 days ago You got into bar fights in the third grade? permalink parent award report block reply view 1 more comments... hilboggins 11 points 5 days ago Then they also start fights expecting you to fight it. Then promote immigration of all their enemies from their backyard to yours. Then laugh as they take your money and sent their enemies to rule over you as they build a paradise on all the newly vacant land. permalink parent award report block reply someguy7738 12 points 5 days ago And whenever \"republicans\" are in power they squander it pushing stupid shit in service of Israel. permalink parent award report block reply FKH2 14 points 5 days ago Service to Israel is the number one reason Republican Ted Cruz ran for the senate by his own words permalink parent award report block reply ReleasetheList 5 points 5 days ago The worst part is, you only have to pay most of these fuckers 800K to 2 Million to betray the country. They are cheap as fuck. permalink parent award report block reply Krat 7 points 5 days ago Thats what 0 arrests does permalink parent award report block reply NoticesBugleOWO 0 points 5 days ago We give Israel billions in credit so they can buy our weapons. permalink parent award report block reply TheGoyimWhisperer 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply Lol_Garrus 11 points 5 days ago Right now, leftist youth hate Israel Right wing youth are apathetic. This will do nothing but drive the apathetic right wing youth towards resentment. Then you'll have two sides who can't stand Israel. It is against Israel's interest to keep pushing. permalink award report block reply staroframphansbhole 9 points 5 days ago Then you'll have two sides who can't stand Israel. Based, we've been looking for a way to unite and I think we've found it! permalink parent award report block reply VoiceInTheLight 5 points 5 days ago Yup. Now, let's shift the national conversation back to class warfare via Tea Party and Occupy Wallstreet. Thats what scared them. When we did start finding that common ground. permalink parent award report block reply CPT88 2 points 5 days ago We had the Epstein files and that didn't work. That was some serious common ground and it's still Keyser Soze permalink parent award report block reply Lurkmoore -1 points 5 days ago Read Revelation, and let me know how well it goes for those nations that will be united in hatred of Israel. permalink parent award report block reply 45ichooseu 4 points 5 days ago Revelation already happened. permalink parent award report block reply staroframphansbhole 1 points 4 days ago References to Israel in the New Testament refer to the true Israel which is the body of Christ, try reading the Bible and comprehending it for yourself instead of parroting Scofield bullshit! Fuck Pissfake! permalink parent award report block reply Formerlurker92 9 points 5 days ago You paid for this psyop citizens permalink award report block reply tt777 8 points 5 days ago There's definitely a full court press from Israel supporters in conservative circles past few weeks. permalink award report block reply Taqiyya_Mockingbird 8 points 5 days ago They’re here pushing and begging to get their posts stickied. And they’re easy to spot too because they are obnoxiously single-topic. Literally everything they post and comment have one central theme at the core. And it’s not working. permalink parent award report block reply Greenhills 7 points 5 days ago Qualifier, Israel is dumping tons of US foreign aid, into US PR campaigns permalink award report block reply Zskills 6 points 5 days ago Dispensationalism is heresy.  Evangelicals should repent of this lie permalink award report block reply Iremembermypassword 4 points 5 days ago It is a bit too late for that. permalink award report block reply Taylor3006 3 points 5 days ago Hey to get that kind of \"friendship\" it costs a lot of money. It is why high priced hookers cost what they do. It is all about the girlfriend experience and not just the sex. Israel buys the friendship of powerful people who have influence on the rest of us peasants and we are the ones stuck with the bill of cash and the blood of our children while we do the bidding of a foreign country. It is all so fucking gross but the average American is waking up to this shit. permalink award report block reply Awakened 3 points 5 days ago A lot have people have returned or started going to church over the last few years. This will lead them running for the doors. As well they should. permalink award report block reply Taylor3006 10 points 5 days ago I left my church (Southern Baptist) in the 90s when they started this evil crap that bordered on worship of Israel. It was really disgusting and what put me over the edge was the convention discussion about not evangelizing Jews any more. The Bible is clear, there is only one path and that is thru Jesus. It applies to all people of all faiths and without Jesus, there is no way of getting to Heaven. Pointing out that one fact to these retarded assholes made them red in the face mad so I left. permalink parent award report block reply Awakened 3 points 5 days ago Once you accept that it is an entertainment business and the 'pastors' are there to increase their business, it makes a lot more sense. When I attend church I drop in money in the basket to cover my family as if we are going to a movie. They have the chutzpah to ask for tithes now. I laugh. It's the only part of the Old Covenant they expect people to keep. They'll eat bacon of course. They know they would lose 90% of their congregation if they preached different. But they'll still say God wants ten percent of your money before taxes. I just want a wholesome family event, but they make it an ordeal. I just don't feel it anymore. People are looking for something to believe in, but they won't find it at the social club calling itself a church. It's best to keep your relationship with your Creator private and personal. permalink parent award report block reply ACActual 2 points 5 days ago Learned about this from Benz when the email went out.   Watch how many of our Christian countrymen fall to this Psyop. Psyop them first.   Tell them the truth permalink award report block reply Lurkmoore 1 points 5 days ago Gonna take much more than that to match the $1.4 trillion arabs have committed this year. permalink award report block reply onesummerdream 1 points 4 days ago Take your pick: https://duckduckgo.com/?q=Israel+is+dumping+hundreds+of+millions+into+US+influence+efforts%2C+targeting+Evangelicals+in+churches+with+the+largest+US+geofencing+operation+in+history.&t=ipad&ia=web permalink award report block reply ZelenskysHighHeels -1 points 5 days ago anyone have any sauce for this... or just another retardo groyper narrative that comes from thin air permalink award report block reply itsallascam6 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply OrangeElvis -2 points 5 days ago TurningPoint USA have an app?  I wonder who built it... and what it tracks... permalink award report block reply EaglesFanInPhx -3 points 5 days ago Good.  There is WAY more doing the opposite, and the opposite is based literally on terrorist propaganda and irrational hatred. permalink award report block reply itsallascam6 5 points 5 days ago Pointing out the truth is \"terrorist propaganda\" and \"irrational hatred\" now? Fucking retard. permalink parent award report block reply EaglesFanInPhx -1 points 5 days ago You wouldn't know the truth if it was right in front of your eyes.  You LITERALLY believe what Hamas says and think it is truth.  Look at your own heart. permalink parent award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply TheGoyimWhisperer 0 points 5 days ago Comment removed upon the user being banned. permalink award report block reply TheGoyimWhisperer -2 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nFKH2 38 points 5 days ago We pay Israel billions so they can progagandize us with our own money that we are forced to pay permalink award report block reply Deplorable_Yankee 23 points 5 days ago And when you even remotely talk anything bad about them they deny it while spending millions on propaganda to convince us they are the good guys. I feel like you don’t have to use propaganda if you are the good guys. They are just proving people right by pushing so hard. permalink parent award report block reply Taylor3006 21 points 5 days ago I am old and one lesson I have learned over the years is that if someone has to pay you to be their friend, if someone has to keep telling you they are your friend, if that person always expects you to pick up the tab, and if that person gets into a bar fight and they expect you to do the fighting for them, then they are not your friend. permalink parent award report block reply schnazzmizzle 1 points 5 days ago Ezekiel 16:30-34\n30 “How degenerate is your heart!” says the Lord God, “seeing you do all these things, the deeds of a brazen harlot.\n31 You erected your shrine at the head of every road, and built your high place in every street. Yet you were not like a harlot, because you scorned payment.\n32 You are an adulterous wife, who takes strangers instead of her husband.\n33 Men make payment to all harlots, but you made your payments to all your lovers, and hired them to come to you from all around for your harlotry.\n34 You are the opposite of other women in your harlotry, because no one solicited you to be a harlot. In that you gave payment but no payment was given you, therefore you are the opposite.” permalink parent award report block reply YaharaRiver -6 points 5 days ago I learned that in third grade. permalink parent award report block reply LiteraIIyHitIer 4 points 5 days ago You got into bar fights in the third grade? permalink parent award report block reply view 1 more comments... hilboggins 11 points 5 days ago Then they also start fights expecting you to fight it. Then promote immigration of all their enemies from their backyard to yours. Then laugh as they take your money and sent their enemies to rule over you as they build a paradise on all the newly vacant land. permalink parent award report block reply someguy7738 12 points 5 days ago And whenever \"republicans\" are in power they squander it pushing stupid shit in service of Israel. permalink parent award report block reply FKH2 14 points 5 days ago Service to Israel is the number one reason Republican Ted Cruz ran for the senate by his own words permalink parent award report block reply ReleasetheList 5 points 5 days ago The worst part is, you only have to pay most of these fuckers 800K to 2 Million to betray the country. They are cheap as fuck. permalink parent award report block reply Krat 7 points 5 days ago Thats what 0 arrests does permalink parent award report block reply NoticesBugleOWO 0 points 5 days ago We give Israel billions in credit so they can buy our weapons. permalink parent award report block reply TheGoyimWhisperer 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nDeplorable_Yankee 23 points 5 days ago And when you even remotely talk anything bad about them they deny it while spending millions on propaganda to convince us they are the good guys. I feel like you don’t have to use propaganda if you are the good guys. They are just proving people right by pushing so hard. permalink parent award report block reply Taylor3006 21 points 5 days ago I am old and one lesson I have learned over the years is that if someone has to pay you to be their friend, if someone has to keep telling you they are your friend, if that person always expects you to pick up the tab, and if that person gets into a bar fight and they expect you to do the fighting for them, then they are not your friend. permalink parent award report block reply schnazzmizzle 1 points 5 days ago Ezekiel 16:30-34\n30 “How degenerate is your heart!” says the Lord God, “seeing you do all these things, the deeds of a brazen harlot.\n31 You erected your shrine at the head of every road, and built your high place in every street. Yet you were not like a harlot, because you scorned payment.\n32 You are an adulterous wife, who takes strangers instead of her husband.\n33 Men make payment to all harlots, but you made your payments to all your lovers, and hired them to come to you from all around for your harlotry.\n34 You are the opposite of other women in your harlotry, because no one solicited you to be a harlot. In that you gave payment but no payment was given you, therefore you are the opposite.” permalink parent award report block reply YaharaRiver -6 points 5 days ago I learned that in third grade. permalink parent award report block reply LiteraIIyHitIer 4 points 5 days ago You got into bar fights in the third grade? permalink parent award report block reply view 1 more comments... hilboggins 11 points 5 days ago Then they also start fights expecting you to fight it. Then promote immigration of all their enemies from their backyard to yours. Then laugh as they take your money and sent their enemies to rule over you as they build a paradise on all the newly vacant land. permalink parent award report block reply\nTaylor3006 21 points 5 days ago I am old and one lesson I have learned over the years is that if someone has to pay you to be their friend, if someone has to keep telling you they are your friend, if that person always expects you to pick up the tab, and if that person gets into a bar fight and they expect you to do the fighting for them, then they are not your friend. permalink parent award report block reply schnazzmizzle 1 points 5 days ago Ezekiel 16:30-34\n30 “How degenerate is your heart!” says the Lord God, “seeing you do all these things, the deeds of a brazen harlot.\n31 You erected your shrine at the head of every road, and built your high place in every street. Yet you were not like a harlot, because you scorned payment.\n32 You are an adulterous wife, who takes strangers instead of her husband.\n33 Men make payment to all harlots, but you made your payments to all your lovers, and hired them to come to you from all around for your harlotry.\n34 You are the opposite of other women in your harlotry, because no one solicited you to be a harlot. In that you gave payment but no payment was given you, therefore you are the opposite.” permalink parent award report block reply YaharaRiver -6 points 5 days ago I learned that in third grade. permalink parent award report block reply LiteraIIyHitIer 4 points 5 days ago You got into bar fights in the third grade? permalink parent award report block reply view 1 more comments...\nschnazzmizzle 1 points 5 days ago Ezekiel 16:30-34\n30 “How degenerate is your heart!” says the Lord God, “seeing you do all these things, the deeds of a brazen harlot.\n31 You erected your shrine at the head of every road, and built your high place in every street. Yet you were not like a harlot, because you scorned payment.\n32 You are an adulterous wife, who takes strangers instead of her husband.\n33 Men make payment to all harlots, but you made your payments to all your lovers, and hired them to come to you from all around for your harlotry.\n34 You are the opposite of other women in your harlotry, because no one solicited you to be a harlot. In that you gave payment but no payment was given you, therefore you are the opposite.” permalink parent award report block reply\nYaharaRiver -6 points 5 days ago I learned that in third grade. permalink parent award report block reply LiteraIIyHitIer 4 points 5 days ago You got into bar fights in the third grade? permalink parent award report block reply view 1 more comments...\nLiteraIIyHitIer 4 points 5 days ago You got into bar fights in the third grade? permalink parent award report block reply view 1 more comments...\nhilboggins 11 points 5 days ago Then they also start fights expecting you to fight it. Then promote immigration of all their enemies from their backyard to yours. Then laugh as they take your money and sent their enemies to rule over you as they build a paradise on all the newly vacant land. permalink parent award report block reply\nsomeguy7738 12 points 5 days ago And whenever \"republicans\" are in power they squander it pushing stupid shit in service of Israel. permalink parent award report block reply FKH2 14 points 5 days ago Service to Israel is the number one reason Republican Ted Cruz ran for the senate by his own words permalink parent award report block reply ReleasetheList 5 points 5 days ago The worst part is, you only have to pay most of these fuckers 800K to 2 Million to betray the country. They are cheap as fuck. permalink parent award report block reply\nFKH2 14 points 5 days ago Service to Israel is the number one reason Republican Ted Cruz ran for the senate by his own words permalink parent award report block reply ReleasetheList 5 points 5 days ago The worst part is, you only have to pay most of these fuckers 800K to 2 Million to betray the country. They are cheap as fuck. permalink parent award report block reply\nReleasetheList 5 points 5 days ago The worst part is, you only have to pay most of these fuckers 800K to 2 Million to betray the country. They are cheap as fuck. permalink parent award report block reply\nKrat 7 points 5 days ago Thats what 0 arrests does permalink parent award report block reply\nNoticesBugleOWO 0 points 5 days ago We give Israel billions in credit so they can buy our weapons. permalink parent award report block reply\nTheGoyimWhisperer 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nLol_Garrus 11 points 5 days ago Right now, leftist youth hate Israel Right wing youth are apathetic. This will do nothing but drive the apathetic right wing youth towards resentment. Then you'll have two sides who can't stand Israel. It is against Israel's interest to keep pushing. permalink award report block reply staroframphansbhole 9 points 5 days ago Then you'll have two sides who can't stand Israel. Based, we've been looking for a way to unite and I think we've found it! permalink parent award report block reply VoiceInTheLight 5 points 5 days ago Yup. Now, let's shift the national conversation back to class warfare via Tea Party and Occupy Wallstreet. Thats what scared them. When we did start finding that common ground. permalink parent award report block reply CPT88 2 points 5 days ago We had the Epstein files and that didn't work. That was some serious common ground and it's still Keyser Soze permalink parent award report block reply Lurkmoore -1 points 5 days ago Read Revelation, and let me know how well it goes for those nations that will be united in hatred of Israel. permalink parent award report block reply 45ichooseu 4 points 5 days ago Revelation already happened. permalink parent award report block reply staroframphansbhole 1 points 4 days ago References to Israel in the New Testament refer to the true Israel which is the body of Christ, try reading the Bible and comprehending it for yourself instead of parroting Scofield bullshit! Fuck Pissfake! permalink parent award report block reply\nstaroframphansbhole 9 points 5 days ago Then you'll have two sides who can't stand Israel. Based, we've been looking for a way to unite and I think we've found it! permalink parent award report block reply VoiceInTheLight 5 points 5 days ago Yup. Now, let's shift the national conversation back to class warfare via Tea Party and Occupy Wallstreet. Thats what scared them. When we did start finding that common ground. permalink parent award report block reply CPT88 2 points 5 days ago We had the Epstein files and that didn't work. That was some serious common ground and it's still Keyser Soze permalink parent award report block reply Lurkmoore -1 points 5 days ago Read Revelation, and let me know how well it goes for those nations that will be united in hatred of Israel. permalink parent award report block reply 45ichooseu 4 points 5 days ago Revelation already happened. permalink parent award report block reply staroframphansbhole 1 points 4 days ago References to Israel in the New Testament refer to the true Israel which is the body of Christ, try reading the Bible and comprehending it for yourself instead of parroting Scofield bullshit! Fuck Pissfake! permalink parent award report block reply\nVoiceInTheLight 5 points 5 days ago Yup. Now, let's shift the national conversation back to class warfare via Tea Party and Occupy Wallstreet. Thats what scared them. When we did start finding that common ground. permalink parent award report block reply\nCPT88 2 points 5 days ago We had the Epstein files and that didn't work. That was some serious common ground and it's still Keyser Soze permalink parent award report block reply\nLurkmoore -1 points 5 days ago Read Revelation, and let me know how well it goes for those nations that will be united in hatred of Israel. permalink parent award report block reply 45ichooseu 4 points 5 days ago Revelation already happened. permalink parent award report block reply staroframphansbhole 1 points 4 days ago References to Israel in the New Testament refer to the true Israel which is the body of Christ, try reading the Bible and comprehending it for yourself instead of parroting Scofield bullshit! Fuck Pissfake! permalink parent award report block reply\n45ichooseu 4 points 5 days ago Revelation already happened. permalink parent award report block reply\nstaroframphansbhole 1 points 4 days ago References to Israel in the New Testament refer to the true Israel which is the body of Christ, try reading the Bible and comprehending it for yourself instead of parroting Scofield bullshit! Fuck Pissfake! permalink parent award report block reply\nFormerlurker92 9 points 5 days ago You paid for this psyop citizens permalink award report block reply\ntt777 8 points 5 days ago There's definitely a full court press from Israel supporters in conservative circles past few weeks. permalink award report block reply Taqiyya_Mockingbird 8 points 5 days ago They’re here pushing and begging to get their posts stickied. And they’re easy to spot too because they are obnoxiously single-topic. Literally everything they post and comment have one central theme at the core. And it’s not working. permalink parent award report block reply\nTaqiyya_Mockingbird 8 points 5 days ago They’re here pushing and begging to get their posts stickied. And they’re easy to spot too because they are obnoxiously single-topic. Literally everything they post and comment have one central theme at the core. And it’s not working. permalink parent award report block reply\nGreenhills 7 points 5 days ago Qualifier, Israel is dumping tons of US foreign aid, into US PR campaigns permalink award report block reply\nZskills 6 points 5 days ago Dispensationalism is heresy.  Evangelicals should repent of this lie permalink award report block reply\nIremembermypassword 4 points 5 days ago It is a bit too late for that. permalink award report block reply\nTaylor3006 3 points 5 days ago Hey to get that kind of \"friendship\" it costs a lot of money. It is why high priced hookers cost what they do. It is all about the girlfriend experience and not just the sex. Israel buys the friendship of powerful people who have influence on the rest of us peasants and we are the ones stuck with the bill of cash and the blood of our children while we do the bidding of a foreign country. It is all so fucking gross but the average American is waking up to this shit. permalink award report block reply\nAwakened 3 points 5 days ago A lot have people have returned or started going to church over the last few years. This will lead them running for the doors. As well they should. permalink award report block reply Taylor3006 10 points 5 days ago I left my church (Southern Baptist) in the 90s when they started this evil crap that bordered on worship of Israel. It was really disgusting and what put me over the edge was the convention discussion about not evangelizing Jews any more. The Bible is clear, there is only one path and that is thru Jesus. It applies to all people of all faiths and without Jesus, there is no way of getting to Heaven. Pointing out that one fact to these retarded assholes made them red in the face mad so I left. permalink parent award report block reply Awakened 3 points 5 days ago Once you accept that it is an entertainment business and the 'pastors' are there to increase their business, it makes a lot more sense. When I attend church I drop in money in the basket to cover my family as if we are going to a movie. They have the chutzpah to ask for tithes now. I laugh. It's the only part of the Old Covenant they expect people to keep. They'll eat bacon of course. They know they would lose 90% of their congregation if they preached different. But they'll still say God wants ten percent of your money before taxes. I just want a wholesome family event, but they make it an ordeal. I just don't feel it anymore. People are looking for something to believe in, but they won't find it at the social club calling itself a church. It's best to keep your relationship with your Creator private and personal. permalink parent award report block reply\nTaylor3006 10 points 5 days ago I left my church (Southern Baptist) in the 90s when they started this evil crap that bordered on worship of Israel. It was really disgusting and what put me over the edge was the convention discussion about not evangelizing Jews any more. The Bible is clear, there is only one path and that is thru Jesus. It applies to all people of all faiths and without Jesus, there is no way of getting to Heaven. Pointing out that one fact to these retarded assholes made them red in the face mad so I left. permalink parent award report block reply Awakened 3 points 5 days ago Once you accept that it is an entertainment business and the 'pastors' are there to increase their business, it makes a lot more sense. When I attend church I drop in money in the basket to cover my family as if we are going to a movie. They have the chutzpah to ask for tithes now. I laugh. It's the only part of the Old Covenant they expect people to keep. They'll eat bacon of course. They know they would lose 90% of their congregation if they preached different. But they'll still say God wants ten percent of your money before taxes. I just want a wholesome family event, but they make it an ordeal. I just don't feel it anymore. People are looking for something to believe in, but they won't find it at the social club calling itself a church. It's best to keep your relationship with your Creator private and personal. permalink parent award report block reply\nAwakened 3 points 5 days ago Once you accept that it is an entertainment business and the 'pastors' are there to increase their business, it makes a lot more sense. When I attend church I drop in money in the basket to cover my family as if we are going to a movie. They have the chutzpah to ask for tithes now. I laugh. It's the only part of the Old Covenant they expect people to keep. They'll eat bacon of course. They know they would lose 90% of their congregation if they preached different. But they'll still say God wants ten percent of your money before taxes. I just want a wholesome family event, but they make it an ordeal. I just don't feel it anymore. People are looking for something to believe in, but they won't find it at the social club calling itself a church. It's best to keep your relationship with your Creator private and personal. permalink parent award report block reply\nACActual 2 points 5 days ago Learned about this from Benz when the email went out.   Watch how many of our Christian countrymen fall to this Psyop. Psyop them first.   Tell them the truth permalink award report block reply\nLurkmoore 1 points 5 days ago Gonna take much more than that to match the $1.4 trillion arabs have committed this year. permalink award report block reply\nonesummerdream 1 points 4 days ago Take your pick: https://duckduckgo.com/?q=Israel+is+dumping+hundreds+of+millions+into+US+influence+efforts%2C+targeting+Evangelicals+in+churches+with+the+largest+US+geofencing+operation+in+history.&t=ipad&ia=web permalink award report block reply\nZelenskysHighHeels -1 points 5 days ago anyone have any sauce for this... or just another retardo groyper narrative that comes from thin air permalink award report block reply itsallascam6 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nitsallascam6 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nOrangeElvis -2 points 5 days ago TurningPoint USA have an app?  I wonder who built it... and what it tracks... permalink award report block reply\nEaglesFanInPhx -3 points 5 days ago Good.  There is WAY more doing the opposite, and the opposite is based literally on terrorist propaganda and irrational hatred. permalink award report block reply itsallascam6 5 points 5 days ago Pointing out the truth is \"terrorist propaganda\" and \"irrational hatred\" now? Fucking retard. permalink parent award report block reply EaglesFanInPhx -1 points 5 days ago You wouldn't know the truth if it was right in front of your eyes.  You LITERALLY believe what Hamas says and think it is truth.  Look at your own heart. permalink parent award report block reply\nitsallascam6 5 points 5 days ago Pointing out the truth is \"terrorist propaganda\" and \"irrational hatred\" now? Fucking retard. permalink parent award report block reply EaglesFanInPhx -1 points 5 days ago You wouldn't know the truth if it was right in front of your eyes.  You LITERALLY believe what Hamas says and think it is truth.  Look at your own heart. permalink parent award report block reply\nEaglesFanInPhx -1 points 5 days ago You wouldn't know the truth if it was right in front of your eyes.  You LITERALLY believe what Hamas says and think it is truth.  Look at your own heart. permalink parent award report block reply\nHoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nTheGoyimWhisperer 0 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nTheGoyimWhisperer -2 points 5 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T20:58:47.181458Z"
}