{
  "id": "8175928",
  "title": "1342Man's Best Friendposted4 days agobyArthurJ50 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK56kvxw/mans-best-friend/c",
  "content": "1342 Man's Best Friend posted 4 days ago by ArthurJ 50 comments award share download report block\n50 comments Sort by Top Top New Worst Old Save Pederella 39 points 4 days ago Good boy. permalink award report block reply coinneach007 9 points 4 days ago Man's best friend indeed. permalink parent award report block reply Standingoak 1 points 4 days ago Is this what that boy did to Justice Scalia and the \"hunting ranch\" ? permalink parent award report block reply Patriot5TN 4 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply MrCuriousGuy513 17 points 4 days ago I hate that I laughed at this but it’s survival of the fittest. permalink award report block reply MegoThor 10 points 4 days ago I love how the dog’s ears perked up at “eating their pets.” permalink parent award report block reply 123breadman -4 points 4 days ago Survival of the fittest has to do with breeding. The dog on the bed isn't trying to breed with the guy. permalink parent award report block reply STC_A 4 points 4 days ago No, it has to do with having the optimal traits for your environment, which then happens to be more likely to breed and pass on those traits. Smart doggo lives, smart doggo is more likely to have smart puppers. Dumb doggo votes commie, dumb doggo doesn't live to have puppers :( permalink parent award report block reply DiamondDroid 2 points 4 days ago Your need to correct indicated he did breed your mother. permalink parent award report block reply MrCuriousGuy513 1 points 4 days ago That dog is trying to survive incase the worst case situation occurs.\nYou first have to acknowledge the danger to survive, then breed.\nOr do you want to eat your pets? 🤔 permalink parent award report block reply KekistanPM 11 points 4 days ago Yeah, I know that Socialism has killed over a 100 million people I've never seen a socialist admit that. permalink award report block reply NerdRage 5 points 4 days ago The socialists I've argued with said that it was remaining \"capitalist\" parts of that socialist society that killed them. These people are insufferable and the mental gymnastics they make to justify stealing your money is straight up insane. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply lilbuffkitty1 2 points 4 days ago they never will, they just say its communism and somehow through some mental gymnastics socialism and communism aren't the same exact thing permalink parent award report block reply Stolen 2 points 4 days ago Or that Religion caused most wars. They do not believe communism is a religion. permalink parent award report block reply MrCuriousGuy513 3 points 4 days ago That’s the worst joke of it all. They do not believe communism is a religion But they treat government, of any type, as The Supreme Being that will not ever let them down. Despite being ran by them with their “Genius Minds and Foolproof Plans.” smh permalink parent award report block reply newdaynewname9 0 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply lilbuffkitty1 1 points 4 days ago \"As long as it has a different name its not the same thing even though its the same thing\" permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply Bullet3250 7 points 4 days ago 'Zoo animals are tasty!' permalink award report block reply jaeger 3 points 4 days ago They will eat our zoo animals for us before we have the chance. Giraffe burgers are probably out. permalink parent award report block reply RuprechtThaMonkeyBoy 5 points 4 days ago Is Giraffe Halal? permalink parent award report block reply TallestSkill 6 points 4 days ago Only if you’ve got a ladder, a sword, and the giraffe’s facing Mecca. Thus decrees the Grand Imam of Kekistan ☪️ 🕌 ☪️ permalink parent award report block reply jaeger 2 points 4 days ago No idea, I don't durka durka. 🦒 permalink parent award report block reply Smashley 6 points 4 days ago Real capitalism has never been tried either but at least when they try it lifts people from poverty and enriches the world as we get closer. Socialism's end is communism according to the inventor of the concept. It cannot sustain for longer than a few generations. It was said to only be 100 years before it becomes a failed state and ushers in a complete state solution. The point of communism is to break capitalism's spirit. permalink award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply PissJuggernaut 6 points 4 days ago Good dog permalink award report block reply Agent_86 4 points 4 days ago T shirt time lol permalink award report block reply DustyGoose 4 points 4 days ago Instead of people being like \"SNAP is socialism and the government has the power to starve me, I should be more self reliant,\" they decide they need more socialism. permalink award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply CosmoKramer 4 points 4 days ago I don't get the floating eyes permalink award report block reply SPEDMan64 4 points 4 days ago Modern art is gay. permalink parent award report block reply Live_free_or_die_55 3 points 4 days ago Well trained. permalink award report block reply RudeFrog 3 points 4 days ago The Epstein files are still being suppressed and Tyler Robinson didn't kill Charlie Kirk permalink award report block reply guywholikesDjtof2024 2 points 4 days ago \"\"b but he had a gun in his leg. that means he did it, now swallow the FBI approved shallow story that holds little weight!!\" permalink parent award report block reply makersmarx 1 points 4 days ago Luigi also wasnt the trigger man. Are we noticing a pattern yet? Why are these two very smart young men at the top of their class with perfect test scores taking the blame?  They also both had aspirations to join the cia. Luigus family is very wealthy and has connections to the Pelosi family. The Utah University where Charlie died has many cia officers as professors and is a well known recruitment hub 🤔 permalink parent award report block reply DiamondDroid 2 points 4 days ago Good dog. And remember, dog spelled backwards is God. permalink award report block reply Ice_Joker 2 points 4 days ago Just change \"socialism\" to \"black women.\" permalink award report block reply behemoth887 2 points 4 days ago you've heard of lenin? stalin? mao? morons. i a middle aged lib with literally 0 accomplishments whatsoever? i have the key on how to do it the right way. CHAZ? no that wasn't real communism...i mean socialism either, even though that was literally me and my peers, with the full support of the local government and we still failed. this time it will be for realsies. don't i worship those 3 guys i called morons as gods? well yes but you see....uhhh....wtf ur hitler! permalink award report block reply kwakkles 2 points 4 days ago Dogs are smarter than democrats. permalink award report block reply GoldwaterVoter 2 points 4 days ago Clever. Funny AND to the point. permalink award report block reply Another_rando 1 points 4 days ago The dicodomy is that we have choose between capitalism and socialism.  Both are stupid and allow for these shitheads to take advantage.  There is a third and forth option, but they will never, ever be available to us while the shitheads control the narrative and nations. Give you a hint.  It involves using boycotts effectively on a whole new level, and AI to manage supply and demand at micro, individual level. permalink award report block reply Nomad899 1 points 4 days ago I have had “smart” people at work say it to me…muh real socialism…. They need a sign permalink award report block reply TDAF 1 points 4 days ago KEK permalink award report block reply ApplyingForce 1 points 4 days ago Individual Americans OWN their own private estate separately and their public estate jointly. Individual socialists own zero, not even themselves permalink award report block reply tuaris 1 points 4 days ago I see that people around here still believe everything the fake news media tells them. \"people in Venezuela are eating their pets\", LOL permalink award report block reply sordfysh PRO 1 points 4 days ago Wait what? So the US must save the Venezuelans from their own government? Why not save the Cubans and Mexicans and Canadians, too? permalink award report block reply Mellop 2 points 4 days ago Cubans and Mexicans don't have oil. Canada, though... permalink parent award report block reply solo25 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nPederella 39 points 4 days ago Good boy. permalink award report block reply coinneach007 9 points 4 days ago Man's best friend indeed. permalink parent award report block reply Standingoak 1 points 4 days ago Is this what that boy did to Justice Scalia and the \"hunting ranch\" ? permalink parent award report block reply Patriot5TN 4 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\ncoinneach007 9 points 4 days ago Man's best friend indeed. permalink parent award report block reply\nStandingoak 1 points 4 days ago Is this what that boy did to Justice Scalia and the \"hunting ranch\" ? permalink parent award report block reply\nPatriot5TN 4 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nMrCuriousGuy513 17 points 4 days ago I hate that I laughed at this but it’s survival of the fittest. permalink award report block reply MegoThor 10 points 4 days ago I love how the dog’s ears perked up at “eating their pets.” permalink parent award report block reply 123breadman -4 points 4 days ago Survival of the fittest has to do with breeding. The dog on the bed isn't trying to breed with the guy. permalink parent award report block reply STC_A 4 points 4 days ago No, it has to do with having the optimal traits for your environment, which then happens to be more likely to breed and pass on those traits. Smart doggo lives, smart doggo is more likely to have smart puppers. Dumb doggo votes commie, dumb doggo doesn't live to have puppers :( permalink parent award report block reply DiamondDroid 2 points 4 days ago Your need to correct indicated he did breed your mother. permalink parent award report block reply MrCuriousGuy513 1 points 4 days ago That dog is trying to survive incase the worst case situation occurs.\nYou first have to acknowledge the danger to survive, then breed.\nOr do you want to eat your pets? 🤔 permalink parent award report block reply\nMegoThor 10 points 4 days ago I love how the dog’s ears perked up at “eating their pets.” permalink parent award report block reply\n123breadman -4 points 4 days ago Survival of the fittest has to do with breeding. The dog on the bed isn't trying to breed with the guy. permalink parent award report block reply STC_A 4 points 4 days ago No, it has to do with having the optimal traits for your environment, which then happens to be more likely to breed and pass on those traits. Smart doggo lives, smart doggo is more likely to have smart puppers. Dumb doggo votes commie, dumb doggo doesn't live to have puppers :( permalink parent award report block reply DiamondDroid 2 points 4 days ago Your need to correct indicated he did breed your mother. permalink parent award report block reply MrCuriousGuy513 1 points 4 days ago That dog is trying to survive incase the worst case situation occurs.\nYou first have to acknowledge the danger to survive, then breed.\nOr do you want to eat your pets? 🤔 permalink parent award report block reply\nSTC_A 4 points 4 days ago No, it has to do with having the optimal traits for your environment, which then happens to be more likely to breed and pass on those traits. Smart doggo lives, smart doggo is more likely to have smart puppers. Dumb doggo votes commie, dumb doggo doesn't live to have puppers :( permalink parent award report block reply\nDiamondDroid 2 points 4 days ago Your need to correct indicated he did breed your mother. permalink parent award report block reply\nMrCuriousGuy513 1 points 4 days ago That dog is trying to survive incase the worst case situation occurs.\nYou first have to acknowledge the danger to survive, then breed.\nOr do you want to eat your pets? 🤔 permalink parent award report block reply\nKekistanPM 11 points 4 days ago Yeah, I know that Socialism has killed over a 100 million people I've never seen a socialist admit that. permalink award report block reply NerdRage 5 points 4 days ago The socialists I've argued with said that it was remaining \"capitalist\" parts of that socialist society that killed them. These people are insufferable and the mental gymnastics they make to justify stealing your money is straight up insane. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply lilbuffkitty1 2 points 4 days ago they never will, they just say its communism and somehow through some mental gymnastics socialism and communism aren't the same exact thing permalink parent award report block reply Stolen 2 points 4 days ago Or that Religion caused most wars. They do not believe communism is a religion. permalink parent award report block reply MrCuriousGuy513 3 points 4 days ago That’s the worst joke of it all. They do not believe communism is a religion But they treat government, of any type, as The Supreme Being that will not ever let them down. Despite being ran by them with their “Genius Minds and Foolproof Plans.” smh permalink parent award report block reply newdaynewname9 0 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply lilbuffkitty1 1 points 4 days ago \"As long as it has a different name its not the same thing even though its the same thing\" permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNerdRage 5 points 4 days ago The socialists I've argued with said that it was remaining \"capitalist\" parts of that socialist society that killed them. These people are insufferable and the mental gymnastics they make to justify stealing your money is straight up insane. permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nlilbuffkitty1 2 points 4 days ago they never will, they just say its communism and somehow through some mental gymnastics socialism and communism aren't the same exact thing permalink parent award report block reply Stolen 2 points 4 days ago Or that Religion caused most wars. They do not believe communism is a religion. permalink parent award report block reply MrCuriousGuy513 3 points 4 days ago That’s the worst joke of it all. They do not believe communism is a religion But they treat government, of any type, as The Supreme Being that will not ever let them down. Despite being ran by them with their “Genius Minds and Foolproof Plans.” smh permalink parent award report block reply newdaynewname9 0 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply lilbuffkitty1 1 points 4 days ago \"As long as it has a different name its not the same thing even though its the same thing\" permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nStolen 2 points 4 days ago Or that Religion caused most wars. They do not believe communism is a religion. permalink parent award report block reply MrCuriousGuy513 3 points 4 days ago That’s the worst joke of it all. They do not believe communism is a religion But they treat government, of any type, as The Supreme Being that will not ever let them down. Despite being ran by them with their “Genius Minds and Foolproof Plans.” smh permalink parent award report block reply\nMrCuriousGuy513 3 points 4 days ago That’s the worst joke of it all. They do not believe communism is a religion But they treat government, of any type, as The Supreme Being that will not ever let them down. Despite being ran by them with their “Genius Minds and Foolproof Plans.” smh permalink parent award report block reply\nnewdaynewname9 0 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply lilbuffkitty1 1 points 4 days ago \"As long as it has a different name its not the same thing even though its the same thing\" permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nlilbuffkitty1 1 points 4 days ago \"As long as it has a different name its not the same thing even though its the same thing\" permalink parent award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBullet3250 7 points 4 days ago 'Zoo animals are tasty!' permalink award report block reply jaeger 3 points 4 days ago They will eat our zoo animals for us before we have the chance. Giraffe burgers are probably out. permalink parent award report block reply RuprechtThaMonkeyBoy 5 points 4 days ago Is Giraffe Halal? permalink parent award report block reply TallestSkill 6 points 4 days ago Only if you’ve got a ladder, a sword, and the giraffe’s facing Mecca. Thus decrees the Grand Imam of Kekistan ☪️ 🕌 ☪️ permalink parent award report block reply jaeger 2 points 4 days ago No idea, I don't durka durka. 🦒 permalink parent award report block reply\njaeger 3 points 4 days ago They will eat our zoo animals for us before we have the chance. Giraffe burgers are probably out. permalink parent award report block reply RuprechtThaMonkeyBoy 5 points 4 days ago Is Giraffe Halal? permalink parent award report block reply TallestSkill 6 points 4 days ago Only if you’ve got a ladder, a sword, and the giraffe’s facing Mecca. Thus decrees the Grand Imam of Kekistan ☪️ 🕌 ☪️ permalink parent award report block reply jaeger 2 points 4 days ago No idea, I don't durka durka. 🦒 permalink parent award report block reply\nRuprechtThaMonkeyBoy 5 points 4 days ago Is Giraffe Halal? permalink parent award report block reply TallestSkill 6 points 4 days ago Only if you’ve got a ladder, a sword, and the giraffe’s facing Mecca. Thus decrees the Grand Imam of Kekistan ☪️ 🕌 ☪️ permalink parent award report block reply jaeger 2 points 4 days ago No idea, I don't durka durka. 🦒 permalink parent award report block reply\nTallestSkill 6 points 4 days ago Only if you’ve got a ladder, a sword, and the giraffe’s facing Mecca. Thus decrees the Grand Imam of Kekistan ☪️ 🕌 ☪️ permalink parent award report block reply\njaeger 2 points 4 days ago No idea, I don't durka durka. 🦒 permalink parent award report block reply\nSmashley 6 points 4 days ago Real capitalism has never been tried either but at least when they try it lifts people from poverty and enriches the world as we get closer. Socialism's end is communism according to the inventor of the concept. It cannot sustain for longer than a few generations. It was said to only be 100 years before it becomes a failed state and ushers in a complete state solution. The point of communism is to break capitalism's spirit. permalink award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nPissJuggernaut 6 points 4 days ago Good dog permalink award report block reply\nAgent_86 4 points 4 days ago T shirt time lol permalink award report block reply\nDustyGoose 4 points 4 days ago Instead of people being like \"SNAP is socialism and the government has the power to starve me, I should be more self reliant,\" they decide they need more socialism. permalink award report block reply newdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nCosmoKramer 4 points 4 days ago I don't get the floating eyes permalink award report block reply SPEDMan64 4 points 4 days ago Modern art is gay. permalink parent award report block reply\nSPEDMan64 4 points 4 days ago Modern art is gay. permalink parent award report block reply\nLive_free_or_die_55 3 points 4 days ago Well trained. permalink award report block reply\nRudeFrog 3 points 4 days ago The Epstein files are still being suppressed and Tyler Robinson didn't kill Charlie Kirk permalink award report block reply guywholikesDjtof2024 2 points 4 days ago \"\"b but he had a gun in his leg. that means he did it, now swallow the FBI approved shallow story that holds little weight!!\" permalink parent award report block reply makersmarx 1 points 4 days ago Luigi also wasnt the trigger man. Are we noticing a pattern yet? Why are these two very smart young men at the top of their class with perfect test scores taking the blame?  They also both had aspirations to join the cia. Luigus family is very wealthy and has connections to the Pelosi family. The Utah University where Charlie died has many cia officers as professors and is a well known recruitment hub 🤔 permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago \"\"b but he had a gun in his leg. that means he did it, now swallow the FBI approved shallow story that holds little weight!!\" permalink parent award report block reply makersmarx 1 points 4 days ago Luigi also wasnt the trigger man. Are we noticing a pattern yet? Why are these two very smart young men at the top of their class with perfect test scores taking the blame?  They also both had aspirations to join the cia. Luigus family is very wealthy and has connections to the Pelosi family. The Utah University where Charlie died has many cia officers as professors and is a well known recruitment hub 🤔 permalink parent award report block reply\nmakersmarx 1 points 4 days ago Luigi also wasnt the trigger man. Are we noticing a pattern yet? Why are these two very smart young men at the top of their class with perfect test scores taking the blame?  They also both had aspirations to join the cia. Luigus family is very wealthy and has connections to the Pelosi family. The Utah University where Charlie died has many cia officers as professors and is a well known recruitment hub 🤔 permalink parent award report block reply\nDiamondDroid 2 points 4 days ago Good dog. And remember, dog spelled backwards is God. permalink award report block reply\nIce_Joker 2 points 4 days ago Just change \"socialism\" to \"black women.\" permalink award report block reply\nbehemoth887 2 points 4 days ago you've heard of lenin? stalin? mao? morons. i a middle aged lib with literally 0 accomplishments whatsoever? i have the key on how to do it the right way. CHAZ? no that wasn't real communism...i mean socialism either, even though that was literally me and my peers, with the full support of the local government and we still failed. this time it will be for realsies. don't i worship those 3 guys i called morons as gods? well yes but you see....uhhh....wtf ur hitler! permalink award report block reply\nkwakkles 2 points 4 days ago Dogs are smarter than democrats. permalink award report block reply\nGoldwaterVoter 2 points 4 days ago Clever. Funny AND to the point. permalink award report block reply\nAnother_rando 1 points 4 days ago The dicodomy is that we have choose between capitalism and socialism.  Both are stupid and allow for these shitheads to take advantage.  There is a third and forth option, but they will never, ever be available to us while the shitheads control the narrative and nations. Give you a hint.  It involves using boycotts effectively on a whole new level, and AI to manage supply and demand at micro, individual level. permalink award report block reply\nNomad899 1 points 4 days ago I have had “smart” people at work say it to me…muh real socialism…. They need a sign permalink award report block reply\nTDAF 1 points 4 days ago KEK permalink award report block reply\nApplyingForce 1 points 4 days ago Individual Americans OWN their own private estate separately and their public estate jointly. Individual socialists own zero, not even themselves permalink award report block reply\ntuaris 1 points 4 days ago I see that people around here still believe everything the fake news media tells them. \"people in Venezuela are eating their pets\", LOL permalink award report block reply\nsordfysh PRO 1 points 4 days ago Wait what? So the US must save the Venezuelans from their own government? Why not save the Cubans and Mexicans and Canadians, too? permalink award report block reply Mellop 2 points 4 days ago Cubans and Mexicans don't have oil. Canada, though... permalink parent award report block reply\nMellop 2 points 4 days ago Cubans and Mexicans don't have oil. Canada, though... permalink parent award report block reply\nsolo25 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply"
}