{
  "id": "1ARK52AsNT",
  "url": "https://patriots.win/p/1ARK52AsNT/im-done-with-america-first/c",
  "content": "368 I’m done with “America First” posted 6 days ago by Antiluminati 18 comments award share report block How about, AMERICA ONLY!!!\n18 comments Sort by Top Top New Worst Old Save Magma_Biscuit 30 points 6 days ago Amen 🙏 I would like to add Americans Only as well 👍🏼 permalink award report block reply AmarilloArmadillo 2 points 6 days ago Americans only in America and America only permalink parent award report block reply Female 19 points 6 days ago 'Jesus Only' - for when you need that peak polarizing division flavor permalink award report block reply BerettaStroker 15 points 6 days ago 🔥💯🔥💯🔥💯🔥 permalink award report block reply USDMaga 13 points 6 days ago It appears Congress ONLY acts if it affects them. Make the problems affect their lives and you will see action.  Otherwise it is never America there. permalink award report block reply Magma_Biscuit 13 points 6 days ago Yep, expecting Government to fix a problem they created is like pissing against the wind in a hurricane permalink parent award report block reply medicpatriot 10 points 6 days ago Oy vey but what about Israel? permalink award report block reply StayoutOfit 1 points 6 days ago Dumpster it where it belongs. permalink parent award report block reply Hammond 9 points 6 days ago AFAO permalink award report block reply M-m-m-my-corona 6 points 6 days ago Sounds antisemitic.  You know Trump supports the death penalty for anti-semites, right? permalink award report block reply entERmyMAtrix 6 points 6 days ago That’s what I’m talkin about. permalink award report block reply inspir3dgenius 4 points 6 days ago Had me in the first half! permalink award report block reply Albertepstein32 4 points 6 days ago Amen permalink award report block reply TGNX 3 points 6 days ago Sadly, there's an entire world of people out there who believe in magic dirt and \"equality.\" permalink award report block reply C0drus 2 points 6 days ago Been saying this since Trump was elected the first time permalink award report block reply f_bastiat 2 points 6 days ago Thats the end goal permalink award report block reply LBTrumplican2 0 points 6 days ago If you are on fire, you could just put out the fire and call it a day, but the rest of the house is still on fire. No matter how many times you stop yourself from burning,  you will eventually be consumed. permalink award report block reply YaharaRiver 0 points 6 days ago Sorry you’re getting shit on, this is a great comment. But allegory is too confusing for the low-IQ to grasp and of course it needs more anus to interest them. permalink parent award report block reply\nMagma_Biscuit 30 points 6 days ago Amen 🙏 I would like to add Americans Only as well 👍🏼 permalink award report block reply AmarilloArmadillo 2 points 6 days ago Americans only in America and America only permalink parent award report block reply\nAmarilloArmadillo 2 points 6 days ago Americans only in America and America only permalink parent award report block reply\nFemale 19 points 6 days ago 'Jesus Only' - for when you need that peak polarizing division flavor permalink award report block reply\nBerettaStroker 15 points 6 days ago 🔥💯🔥💯🔥💯🔥 permalink award report block reply\nUSDMaga 13 points 6 days ago It appears Congress ONLY acts if it affects them. Make the problems affect their lives and you will see action.  Otherwise it is never America there. permalink award report block reply Magma_Biscuit 13 points 6 days ago Yep, expecting Government to fix a problem they created is like pissing against the wind in a hurricane permalink parent award report block reply\nMagma_Biscuit 13 points 6 days ago Yep, expecting Government to fix a problem they created is like pissing against the wind in a hurricane permalink parent award report block reply\nmedicpatriot 10 points 6 days ago Oy vey but what about Israel? permalink award report block reply StayoutOfit 1 points 6 days ago Dumpster it where it belongs. permalink parent award report block reply\nStayoutOfit 1 points 6 days ago Dumpster it where it belongs. permalink parent award report block reply\nHammond 9 points 6 days ago AFAO permalink award report block reply\nM-m-m-my-corona 6 points 6 days ago Sounds antisemitic.  You know Trump supports the death penalty for anti-semites, right? permalink award report block reply\nentERmyMAtrix 6 points 6 days ago That’s what I’m talkin about. permalink award report block reply\ninspir3dgenius 4 points 6 days ago Had me in the first half! permalink award report block reply\nAlbertepstein32 4 points 6 days ago Amen permalink award report block reply\nTGNX 3 points 6 days ago Sadly, there's an entire world of people out there who believe in magic dirt and \"equality.\" permalink award report block reply\nC0drus 2 points 6 days ago Been saying this since Trump was elected the first time permalink award report block reply\nf_bastiat 2 points 6 days ago Thats the end goal permalink award report block reply\nLBTrumplican2 0 points 6 days ago If you are on fire, you could just put out the fire and call it a day, but the rest of the house is still on fire. No matter how many times you stop yourself from burning,  you will eventually be consumed. permalink award report block reply YaharaRiver 0 points 6 days ago Sorry you’re getting shit on, this is a great comment. But allegory is too confusing for the low-IQ to grasp and of course it needs more anus to interest them. permalink parent award report block reply\nYaharaRiver 0 points 6 days ago Sorry you’re getting shit on, this is a great comment. But allegory is too confusing for the low-IQ to grasp and of course it needs more anus to interest them. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:48:48.928725Z"
}