{
  "id": "1ARK591is8",
  "url": "https://patriots.win/p/1ARK591is8/yup/c",
  "content": "391 Yup posted 3 days ago by Looniz74 PRO 11 comments award share report block Queen of Wrongthink 🇺🇸 @sherree_r • 4d @EricLDaugh\n11 comments Sort by Top Top New Worst Old Save KuzoKevin 4 points 3 days ago It is not a binary choice.  Both can happen at the same time. permalink award report block reply BibleProphecyFulfill 2 points 3 days ago One is a fing stupid idea and anyone who suggests it is an idiot, including Trump. permalink parent award report block reply CleanUpPhillyTrump24 2 points 3 days ago Having options is like having tools: some people will always scream and cry that you have too many. Then the time comes when you need the tool, and where are the screechers then? They go awfully quiet. Even my own gen contractor who I hire all the time says that I have too many tools, not an easy feat in a small if historic Philly row house. Then what does he do? When he has a job in town and can't stand going to Lowe's or Home Depot, he calls me in a fury asking if I can bring such-and-such tool over to the job site. You really cannot have too many tools. Just organizing every thing is the issue. permalink parent award report block reply Bullet3250 1 points 3 days ago The one thing a 50 year mortgage will do - is get real estate appreciation on to the balance sheet of far more Americans. While they will never pay  off the mortgage... those homes STILL APPRECIATE... year after year - and while you don't pay down the principle at all - the  increase in home value does FALL TO THE OWNER... so for example that $300,000 home after 5 or 10 years, is now maybe $400,000....  and that 100k is a new down payment on the next home.  Also- fewer and fewer people are even paying off a 30 year - people move after 7 years on average anyways. permalink parent award report block reply Dem_slayer 4 points 3 days ago Generational debt.... permalink parent award report block reply Looniz74 OP PRO 3 points 3 days ago https://x.com/sherree_r/status/1987267180686155798?s=20 permalink award report block reply bigdickhangsright 1 points 3 days ago How can Trump, a real estate developer, get this so wrong? I'm not attacking him, I am genuinely curious. permalink award report block reply Bullet3250 2 points 3 days ago Owning a home gets the owner all the appreciation. Whether you buy the home all cash - or get the worst 50 year deal out there - IF that home goes from $500,000 to $600,000 in some number of years - that appreciation all falls to the homeowner.  Interest rates, term, down payment, etc  doesn't matter. And real estate is 'normally' a pretty good deal in and around 'growing communities.. but if the town is dying, if the population is falling - those homes rarely appreciate so it is not a guarantee. permalink parent award report block reply Zhongda 1 points 3 days ago You know why.  And if you truly do not, then you're not paying attention.  Do try to keep up, please. permalink parent award report block reply CleanUpPhillyTrump24 0 points 3 days ago He's not wrong. It's just a temporary fix so people can re-fi. Does no shill here re-fi for better terms ever? permalink parent award report block reply CleanUpPhillyTrump24 0 points 3 days ago IMHO the 50 year mortgage will just get people out of renting and into owning, and as the Trump economy takes hold and rips off in about one more year, they can re-fi. And people can pay it off in chunks. That's always what I do. I don't always have enough to do the 15 year every month, but I make money in chunks or cash things in, and can pay off portions. It's just another tool in the toolbox to put families in homes they own. permalink award report block reply\nKuzoKevin 4 points 3 days ago It is not a binary choice.  Both can happen at the same time. permalink award report block reply BibleProphecyFulfill 2 points 3 days ago One is a fing stupid idea and anyone who suggests it is an idiot, including Trump. permalink parent award report block reply CleanUpPhillyTrump24 2 points 3 days ago Having options is like having tools: some people will always scream and cry that you have too many. Then the time comes when you need the tool, and where are the screechers then? They go awfully quiet. Even my own gen contractor who I hire all the time says that I have too many tools, not an easy feat in a small if historic Philly row house. Then what does he do? When he has a job in town and can't stand going to Lowe's or Home Depot, he calls me in a fury asking if I can bring such-and-such tool over to the job site. You really cannot have too many tools. Just organizing every thing is the issue. permalink parent award report block reply Bullet3250 1 points 3 days ago The one thing a 50 year mortgage will do - is get real estate appreciation on to the balance sheet of far more Americans. While they will never pay  off the mortgage... those homes STILL APPRECIATE... year after year - and while you don't pay down the principle at all - the  increase in home value does FALL TO THE OWNER... so for example that $300,000 home after 5 or 10 years, is now maybe $400,000....  and that 100k is a new down payment on the next home.  Also- fewer and fewer people are even paying off a 30 year - people move after 7 years on average anyways. permalink parent award report block reply Dem_slayer 4 points 3 days ago Generational debt.... permalink parent award report block reply\nBibleProphecyFulfill 2 points 3 days ago One is a fing stupid idea and anyone who suggests it is an idiot, including Trump. permalink parent award report block reply CleanUpPhillyTrump24 2 points 3 days ago Having options is like having tools: some people will always scream and cry that you have too many. Then the time comes when you need the tool, and where are the screechers then? They go awfully quiet. Even my own gen contractor who I hire all the time says that I have too many tools, not an easy feat in a small if historic Philly row house. Then what does he do? When he has a job in town and can't stand going to Lowe's or Home Depot, he calls me in a fury asking if I can bring such-and-such tool over to the job site. You really cannot have too many tools. Just organizing every thing is the issue. permalink parent award report block reply Bullet3250 1 points 3 days ago The one thing a 50 year mortgage will do - is get real estate appreciation on to the balance sheet of far more Americans. While they will never pay  off the mortgage... those homes STILL APPRECIATE... year after year - and while you don't pay down the principle at all - the  increase in home value does FALL TO THE OWNER... so for example that $300,000 home after 5 or 10 years, is now maybe $400,000....  and that 100k is a new down payment on the next home.  Also- fewer and fewer people are even paying off a 30 year - people move after 7 years on average anyways. permalink parent award report block reply Dem_slayer 4 points 3 days ago Generational debt.... permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 3 days ago Having options is like having tools: some people will always scream and cry that you have too many. Then the time comes when you need the tool, and where are the screechers then? They go awfully quiet. Even my own gen contractor who I hire all the time says that I have too many tools, not an easy feat in a small if historic Philly row house. Then what does he do? When he has a job in town and can't stand going to Lowe's or Home Depot, he calls me in a fury asking if I can bring such-and-such tool over to the job site. You really cannot have too many tools. Just organizing every thing is the issue. permalink parent award report block reply\nBullet3250 1 points 3 days ago The one thing a 50 year mortgage will do - is get real estate appreciation on to the balance sheet of far more Americans. While they will never pay  off the mortgage... those homes STILL APPRECIATE... year after year - and while you don't pay down the principle at all - the  increase in home value does FALL TO THE OWNER... so for example that $300,000 home after 5 or 10 years, is now maybe $400,000....  and that 100k is a new down payment on the next home.  Also- fewer and fewer people are even paying off a 30 year - people move after 7 years on average anyways. permalink parent award report block reply Dem_slayer 4 points 3 days ago Generational debt.... permalink parent award report block reply\nDem_slayer 4 points 3 days ago Generational debt.... permalink parent award report block reply\nLooniz74 OP PRO 3 points 3 days ago https://x.com/sherree_r/status/1987267180686155798?s=20 permalink award report block reply\nbigdickhangsright 1 points 3 days ago How can Trump, a real estate developer, get this so wrong? I'm not attacking him, I am genuinely curious. permalink award report block reply Bullet3250 2 points 3 days ago Owning a home gets the owner all the appreciation. Whether you buy the home all cash - or get the worst 50 year deal out there - IF that home goes from $500,000 to $600,000 in some number of years - that appreciation all falls to the homeowner.  Interest rates, term, down payment, etc  doesn't matter. And real estate is 'normally' a pretty good deal in and around 'growing communities.. but if the town is dying, if the population is falling - those homes rarely appreciate so it is not a guarantee. permalink parent award report block reply Zhongda 1 points 3 days ago You know why.  And if you truly do not, then you're not paying attention.  Do try to keep up, please. permalink parent award report block reply CleanUpPhillyTrump24 0 points 3 days ago He's not wrong. It's just a temporary fix so people can re-fi. Does no shill here re-fi for better terms ever? permalink parent award report block reply\nBullet3250 2 points 3 days ago Owning a home gets the owner all the appreciation. Whether you buy the home all cash - or get the worst 50 year deal out there - IF that home goes from $500,000 to $600,000 in some number of years - that appreciation all falls to the homeowner.  Interest rates, term, down payment, etc  doesn't matter. And real estate is 'normally' a pretty good deal in and around 'growing communities.. but if the town is dying, if the population is falling - those homes rarely appreciate so it is not a guarantee. permalink parent award report block reply\nZhongda 1 points 3 days ago You know why.  And if you truly do not, then you're not paying attention.  Do try to keep up, please. permalink parent award report block reply\nCleanUpPhillyTrump24 0 points 3 days ago He's not wrong. It's just a temporary fix so people can re-fi. Does no shill here re-fi for better terms ever? permalink parent award report block reply\nCleanUpPhillyTrump24 0 points 3 days ago IMHO the 50 year mortgage will just get people out of renting and into owning, and as the Trump economy takes hold and rips off in about one more year, they can re-fi. And people can pay it off in chunks. That's always what I do. I don't always have enough to do the 15 year every month, but I make money in chunks or cash things in, and can pay off portions. It's just another tool in the toolbox to put families in homes they own. permalink award report block reply"
}