{
  "id": "1ARK9l9O3N",
  "url": "https://patriots.win/p/1ARK9l9O3N/1-billion-a-year-of-our-tax-doll/c",
  "content": "601 $1 billion a year of our tax dollars go to UC Berkeley.\n\nThis is the return on investment. posted 23 hours ago by I-am-Orlando PRO 36 comments award share download report block\n36 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil MajorClark 43 points 23 hours ago Why is the govt. subsidizing Universities?   The students should be paying for it, not the tax payers.  End this shit now. permalink award report block reply ThorsonTT 17 points 23 hours ago The students DO pay for it... with their government grants and by taking out huge government backed loans. permalink parent award report block reply LogicCircuits 7 points 22 hours ago As someone who went to school for accounting, I would have never been able to afford it if I didn't have government assistance. My family was not as affluent as many, and I didn't have much monetary support from anyone else. I qualified for the full Pell grant amount, and additionally after my father retired from the military, got to use his GI/DEA benefits to pay for graduate school (which is required to become a CPA). The end result is coming out of a 5 year program with zero debt. Maybe I used tax dollars to get through school, but I know that I will more than make up for it in taxes that I owe in the future. Don't like that fact? Hate the game, not the player. I don't like the fact tax money is being used to send people to school for dumbass programs like gender studies, but I didn't let that stop me from declining my own benefits, that's just stupid. Colleges are mostly a waste of time, depending on what you go for (your mileage may vary). So many electives and shit you are forced to take, if we cut those out it would cut the cost of attendance in half. But also, schools are just greedy in general. My school would force you to pay something like nearly $3000/semester for a meal plan. $4000/semester for a dorm (luckily I only had to spend one semester on campus). permalink parent award report block reply Aquamine-Amarine 4 points 22 hours ago I received Pell grants when I went to college too. My tax dollars go into that program, damn straight I'm going to use it to get my money back. Americans fund it, only Americans should get to use it. Ideally of course I'd rather they didn't exist at all. permalink parent award report block reply Modern_Times 3 points 22 hours ago I don't think Berkley is giving students a break on the cost of tuition dur to the Federal Government giving them $1,000,000,000.00 a year. They should be made to account for where it all goes. permalink parent award report block reply ThorsonTT 1 points 21 hours ago The Government assistance is why college is so expensive.  When the government is handing out money and 'backing' loans, the Universities are taking every dime they can get their hands on. It's all money laundering and grift. Every time the government offers financial assistance, prices go up.  SNAP/EBT drives up food prices.  Section 8 drives up rent.  Student aid drives up the cost of education.  Government subsidized health insurance drives up what doctors and hospitals charge. permalink parent award report block reply LWGII 1 points 22 hours ago ...and then not paying them back. permalink parent award report block reply ThorsonTT 1 points 21 hours ago The college doesn't care.  They still got paid, and the debt is on the borrower.  It ought to be illegal. permalink parent award report block reply Deplorable556 13 points 23 hours ago 👆 this! i dropped out of high school, got a ged, never went to college, never even owned a credit card worked a trade job for over ten years to get everything i have. why am i funding this shit with my tax dollars? permalink parent award report block reply Pied-Trumper -1 points 22 hours ago You don't even have a credit card. There's more financial incentive for both sides of the political isle, bankers, etc. to see you drop dead so they can replace you with someone much cheaper who'll eternally pay into the system, outside of taxation. You're acting like it's 1945 or earlier. permalink parent award report block reply Modern_Times 1 points 22 hours ago Credit cards didn't become mainstream until the late 70s. permalink parent award report block reply Pied-Trumper 1 points 21 hours ago Is that also when note having a GED, thinking you don't need a credit card, and that the government cares about someone who owns their shit, cares about traditional American values, and dislikes usury became mainstream? The entire system wants people like that dead, and they've killed a few who did it a little too well. permalink parent award report block reply view 1 more comments... Pied-Trumper 3 points 22 hours ago Well, the Communists can't get paid $100k per year and have tons of political power unless we let 400k Chinese students and 500k Indians displace American citizens by paying a premium. We'll be sure to put another Jewish international in charge of this school to combat antisemitism, while not mentioning a word about the blatant White discrimination and genocide that's been ongoing for decades. After all, a majority White Christian nation is a threat to all non-white / non-Christian peoples, and this is their nation now, as they're the most profitable and controllable. As Vivek (a foreigner) would say, American children need to spend less time horsing around. They should pay a premium and lived stacked 10 fucks high, to compete with international slave labor receiving all your benefits. Americans must disregard American values. You'll need to pay a premium for that schooling to compete with foreign caste systems and Communist nations. If that's not enough profit, we'll simply displace you via migration, and taxes intended to benefit you as an American citizen. We prefer to use that tax money to line elite pockets instead, cause we are elites. Now get back in your $400k starter home, with your 50-year mortgage, $1 million in interest, and buy a modern shitbox eco-friendly vehicle on a 15-year, 7% interest loan. Ensure you sign your children up for the draft, cause we need those cogs to go die in foreign wars, benefiting our foreign backers. We'll do our best to throw you in jail for criticizing anything about this \"deal\". That's our way of prioritizing Americans, by completely fucking you in every way possible and wiping our asses with the Constitution. permalink parent award report block reply BloodElfSupporter 3 points 23 hours ago I had Pell grants and some scholarships when I attended UCLA almost 20 years ago, but I still had to pay for tuitions as loans. I think that’s why student loans are a big issue for many young people especially today. permalink parent award report block reply load 1 more comments... BOHICA2021 13 points 23 hours ago I DEMAND REPARATIONS !!! permalink award report block reply GA_Logic 9 points 23 hours ago Stop sending money to people that hate the USA. permalink award report block reply America_No_1 8 points 23 hours ago How do they get any money at all when they have endowments in the billions? permalink award report block reply EggsBennydict 6 points 22 hours ago Why do any universities get money while continuing to increase tuition each year while the value of a degree has plummeted? If anything, tax dollars should’ve required universities to lower their tuition.  I went to a state university, dropped out after my student loans hit $96k.. I couldn’t transfer because my “credits” didn’t transfer.  I couldn’t get an associates degree because the university didn’t do associate degrees. I have 9% interest on my loans because I get penalized for not finishing. I’ve never missed a payment, but boy do universities give a lasting fuck you. Tuition went up a minimum of 8% each of the 4 years I was enrolled. If they can get away with that, they should not get any type of tax dollars. I got lucky, but I’d imagine there are younger people with significantly more student debt that also dropped out (or got a useless degree)  that can’t even make a full payment let alone rent. permalink parent award report block reply Aambrick 1 points 21 hours ago I would give them an ultimatum: Either lower the costs down to $20k or $30k per year or receive no funding and be fined for falsifying taxes. permalink parent award report block reply MAGAguitar 4 points 23 hours ago This is how Berkeley leftists give their life meaning - eating up our tax dollars to feed their sense of self importance. permalink award report block reply I-am-Orlando OP PRO 3 points 23 hours ago Link https://x.com/C_3C_3/status/1988372346789609770?s=20 permalink award report block reply schnazzmizzle 3 points 23 hours ago \"ThEy WoUlD cOlApSe WiThOuT ChYnA\" permalink award report block reply ColonelKlink 2 points 22 hours ago Don't give them another cent. Let them survive on their own. permalink award report block reply DiamondDroid 2 points 22 hours ago Stop ALL subsidies to Commie Colleges and Universities. permalink award report block reply JtBlaze 2 points 23 hours ago Death to ANTIFA. permalink award report block reply POTUS_DonnieJ 2 points 22 hours ago Cut every penny going to every university. All these schools have multi million dollar endowments (and many, including the UC system have billions). None of them need a penny of our money. permalink award report block reply SCP0073 2 points 23 hours ago They’ve always done this. The spoiled, provided for class that works for nothing and thinks having an opinion is effort. permalink award report block reply Formerlurker92 1 points 22 hours ago Instead we're gonna give them indirect welfare of 600k Chinese students who will encourage this shit permalink award report block reply MySidesGoUp 1 points 22 hours ago The other billions are poured in by foreign parents of students.  They’ve curated the universities as such. No wonder they’re so un-American. permalink award report block reply zerk0021 1 points 22 hours ago Those are California Highway Patrol, which in California since 1995 have been  the State Police, the largest state police force in the USA. permalink award report block reply Grond999 1 points 22 hours ago too Neo-Marxism permalink award report block reply Plsdontfireme 1 points 22 hours ago $1b permalink award report block reply ACActual 1 points 22 hours ago Whoa.  Chill out.   It'll get better with 600,000 Chinese students permalink award report block reply Retardloserimsogay 1 points 21 hours ago They added EBT to their little sign there. Total 🤡🌎 permalink award report block reply Rock9Head 1 points 23 hours ago And not a nickel of good comes out of it. permalink award report block reply\nMajorClark 43 points 23 hours ago Why is the govt. subsidizing Universities?   The students should be paying for it, not the tax payers.  End this shit now. permalink award report block reply ThorsonTT 17 points 23 hours ago The students DO pay for it... with their government grants and by taking out huge government backed loans. permalink parent award report block reply LogicCircuits 7 points 22 hours ago As someone who went to school for accounting, I would have never been able to afford it if I didn't have government assistance. My family was not as affluent as many, and I didn't have much monetary support from anyone else. I qualified for the full Pell grant amount, and additionally after my father retired from the military, got to use his GI/DEA benefits to pay for graduate school (which is required to become a CPA). The end result is coming out of a 5 year program with zero debt. Maybe I used tax dollars to get through school, but I know that I will more than make up for it in taxes that I owe in the future. Don't like that fact? Hate the game, not the player. I don't like the fact tax money is being used to send people to school for dumbass programs like gender studies, but I didn't let that stop me from declining my own benefits, that's just stupid. Colleges are mostly a waste of time, depending on what you go for (your mileage may vary). So many electives and shit you are forced to take, if we cut those out it would cut the cost of attendance in half. But also, schools are just greedy in general. My school would force you to pay something like nearly $3000/semester for a meal plan. $4000/semester for a dorm (luckily I only had to spend one semester on campus). permalink parent award report block reply Aquamine-Amarine 4 points 22 hours ago I received Pell grants when I went to college too. My tax dollars go into that program, damn straight I'm going to use it to get my money back. Americans fund it, only Americans should get to use it. Ideally of course I'd rather they didn't exist at all. permalink parent award report block reply Modern_Times 3 points 22 hours ago I don't think Berkley is giving students a break on the cost of tuition dur to the Federal Government giving them $1,000,000,000.00 a year. They should be made to account for where it all goes. permalink parent award report block reply ThorsonTT 1 points 21 hours ago The Government assistance is why college is so expensive.  When the government is handing out money and 'backing' loans, the Universities are taking every dime they can get their hands on. It's all money laundering and grift. Every time the government offers financial assistance, prices go up.  SNAP/EBT drives up food prices.  Section 8 drives up rent.  Student aid drives up the cost of education.  Government subsidized health insurance drives up what doctors and hospitals charge. permalink parent award report block reply LWGII 1 points 22 hours ago ...and then not paying them back. permalink parent award report block reply ThorsonTT 1 points 21 hours ago The college doesn't care.  They still got paid, and the debt is on the borrower.  It ought to be illegal. permalink parent award report block reply Deplorable556 13 points 23 hours ago 👆 this! i dropped out of high school, got a ged, never went to college, never even owned a credit card worked a trade job for over ten years to get everything i have. why am i funding this shit with my tax dollars? permalink parent award report block reply Pied-Trumper -1 points 22 hours ago You don't even have a credit card. There's more financial incentive for both sides of the political isle, bankers, etc. to see you drop dead so they can replace you with someone much cheaper who'll eternally pay into the system, outside of taxation. You're acting like it's 1945 or earlier. permalink parent award report block reply Modern_Times 1 points 22 hours ago Credit cards didn't become mainstream until the late 70s. permalink parent award report block reply Pied-Trumper 1 points 21 hours ago Is that also when note having a GED, thinking you don't need a credit card, and that the government cares about someone who owns their shit, cares about traditional American values, and dislikes usury became mainstream? The entire system wants people like that dead, and they've killed a few who did it a little too well. permalink parent award report block reply view 1 more comments... Pied-Trumper 3 points 22 hours ago Well, the Communists can't get paid $100k per year and have tons of political power unless we let 400k Chinese students and 500k Indians displace American citizens by paying a premium. We'll be sure to put another Jewish international in charge of this school to combat antisemitism, while not mentioning a word about the blatant White discrimination and genocide that's been ongoing for decades. After all, a majority White Christian nation is a threat to all non-white / non-Christian peoples, and this is their nation now, as they're the most profitable and controllable. As Vivek (a foreigner) would say, American children need to spend less time horsing around. They should pay a premium and lived stacked 10 fucks high, to compete with international slave labor receiving all your benefits. Americans must disregard American values. You'll need to pay a premium for that schooling to compete with foreign caste systems and Communist nations. If that's not enough profit, we'll simply displace you via migration, and taxes intended to benefit you as an American citizen. We prefer to use that tax money to line elite pockets instead, cause we are elites. Now get back in your $400k starter home, with your 50-year mortgage, $1 million in interest, and buy a modern shitbox eco-friendly vehicle on a 15-year, 7% interest loan. Ensure you sign your children up for the draft, cause we need those cogs to go die in foreign wars, benefiting our foreign backers. We'll do our best to throw you in jail for criticizing anything about this \"deal\". That's our way of prioritizing Americans, by completely fucking you in every way possible and wiping our asses with the Constitution. permalink parent award report block reply BloodElfSupporter 3 points 23 hours ago I had Pell grants and some scholarships when I attended UCLA almost 20 years ago, but I still had to pay for tuitions as loans. I think that’s why student loans are a big issue for many young people especially today. permalink parent award report block reply load 1 more comments...\nThorsonTT 17 points 23 hours ago The students DO pay for it... with their government grants and by taking out huge government backed loans. permalink parent award report block reply LogicCircuits 7 points 22 hours ago As someone who went to school for accounting, I would have never been able to afford it if I didn't have government assistance. My family was not as affluent as many, and I didn't have much monetary support from anyone else. I qualified for the full Pell grant amount, and additionally after my father retired from the military, got to use his GI/DEA benefits to pay for graduate school (which is required to become a CPA). The end result is coming out of a 5 year program with zero debt. Maybe I used tax dollars to get through school, but I know that I will more than make up for it in taxes that I owe in the future. Don't like that fact? Hate the game, not the player. I don't like the fact tax money is being used to send people to school for dumbass programs like gender studies, but I didn't let that stop me from declining my own benefits, that's just stupid. Colleges are mostly a waste of time, depending on what you go for (your mileage may vary). So many electives and shit you are forced to take, if we cut those out it would cut the cost of attendance in half. But also, schools are just greedy in general. My school would force you to pay something like nearly $3000/semester for a meal plan. $4000/semester for a dorm (luckily I only had to spend one semester on campus). permalink parent award report block reply Aquamine-Amarine 4 points 22 hours ago I received Pell grants when I went to college too. My tax dollars go into that program, damn straight I'm going to use it to get my money back. Americans fund it, only Americans should get to use it. Ideally of course I'd rather they didn't exist at all. permalink parent award report block reply Modern_Times 3 points 22 hours ago I don't think Berkley is giving students a break on the cost of tuition dur to the Federal Government giving them $1,000,000,000.00 a year. They should be made to account for where it all goes. permalink parent award report block reply ThorsonTT 1 points 21 hours ago The Government assistance is why college is so expensive.  When the government is handing out money and 'backing' loans, the Universities are taking every dime they can get their hands on. It's all money laundering and grift. Every time the government offers financial assistance, prices go up.  SNAP/EBT drives up food prices.  Section 8 drives up rent.  Student aid drives up the cost of education.  Government subsidized health insurance drives up what doctors and hospitals charge. permalink parent award report block reply LWGII 1 points 22 hours ago ...and then not paying them back. permalink parent award report block reply ThorsonTT 1 points 21 hours ago The college doesn't care.  They still got paid, and the debt is on the borrower.  It ought to be illegal. permalink parent award report block reply\nLogicCircuits 7 points 22 hours ago As someone who went to school for accounting, I would have never been able to afford it if I didn't have government assistance. My family was not as affluent as many, and I didn't have much monetary support from anyone else. I qualified for the full Pell grant amount, and additionally after my father retired from the military, got to use his GI/DEA benefits to pay for graduate school (which is required to become a CPA). The end result is coming out of a 5 year program with zero debt. Maybe I used tax dollars to get through school, but I know that I will more than make up for it in taxes that I owe in the future. Don't like that fact? Hate the game, not the player. I don't like the fact tax money is being used to send people to school for dumbass programs like gender studies, but I didn't let that stop me from declining my own benefits, that's just stupid. Colleges are mostly a waste of time, depending on what you go for (your mileage may vary). So many electives and shit you are forced to take, if we cut those out it would cut the cost of attendance in half. But also, schools are just greedy in general. My school would force you to pay something like nearly $3000/semester for a meal plan. $4000/semester for a dorm (luckily I only had to spend one semester on campus). permalink parent award report block reply Aquamine-Amarine 4 points 22 hours ago I received Pell grants when I went to college too. My tax dollars go into that program, damn straight I'm going to use it to get my money back. Americans fund it, only Americans should get to use it. Ideally of course I'd rather they didn't exist at all. permalink parent award report block reply Modern_Times 3 points 22 hours ago I don't think Berkley is giving students a break on the cost of tuition dur to the Federal Government giving them $1,000,000,000.00 a year. They should be made to account for where it all goes. permalink parent award report block reply ThorsonTT 1 points 21 hours ago The Government assistance is why college is so expensive.  When the government is handing out money and 'backing' loans, the Universities are taking every dime they can get their hands on. It's all money laundering and grift. Every time the government offers financial assistance, prices go up.  SNAP/EBT drives up food prices.  Section 8 drives up rent.  Student aid drives up the cost of education.  Government subsidized health insurance drives up what doctors and hospitals charge. permalink parent award report block reply\nAquamine-Amarine 4 points 22 hours ago I received Pell grants when I went to college too. My tax dollars go into that program, damn straight I'm going to use it to get my money back. Americans fund it, only Americans should get to use it. Ideally of course I'd rather they didn't exist at all. permalink parent award report block reply\nModern_Times 3 points 22 hours ago I don't think Berkley is giving students a break on the cost of tuition dur to the Federal Government giving them $1,000,000,000.00 a year. They should be made to account for where it all goes. permalink parent award report block reply\nThorsonTT 1 points 21 hours ago The Government assistance is why college is so expensive.  When the government is handing out money and 'backing' loans, the Universities are taking every dime they can get their hands on. It's all money laundering and grift. Every time the government offers financial assistance, prices go up.  SNAP/EBT drives up food prices.  Section 8 drives up rent.  Student aid drives up the cost of education.  Government subsidized health insurance drives up what doctors and hospitals charge. permalink parent award report block reply\nLWGII 1 points 22 hours ago ...and then not paying them back. permalink parent award report block reply ThorsonTT 1 points 21 hours ago The college doesn't care.  They still got paid, and the debt is on the borrower.  It ought to be illegal. permalink parent award report block reply\nThorsonTT 1 points 21 hours ago The college doesn't care.  They still got paid, and the debt is on the borrower.  It ought to be illegal. permalink parent award report block reply\nDeplorable556 13 points 23 hours ago 👆 this! i dropped out of high school, got a ged, never went to college, never even owned a credit card worked a trade job for over ten years to get everything i have. why am i funding this shit with my tax dollars? permalink parent award report block reply Pied-Trumper -1 points 22 hours ago You don't even have a credit card. There's more financial incentive for both sides of the political isle, bankers, etc. to see you drop dead so they can replace you with someone much cheaper who'll eternally pay into the system, outside of taxation. You're acting like it's 1945 or earlier. permalink parent award report block reply Modern_Times 1 points 22 hours ago Credit cards didn't become mainstream until the late 70s. permalink parent award report block reply Pied-Trumper 1 points 21 hours ago Is that also when note having a GED, thinking you don't need a credit card, and that the government cares about someone who owns their shit, cares about traditional American values, and dislikes usury became mainstream? The entire system wants people like that dead, and they've killed a few who did it a little too well. permalink parent award report block reply view 1 more comments...\nPied-Trumper -1 points 22 hours ago You don't even have a credit card. There's more financial incentive for both sides of the political isle, bankers, etc. to see you drop dead so they can replace you with someone much cheaper who'll eternally pay into the system, outside of taxation. You're acting like it's 1945 or earlier. permalink parent award report block reply Modern_Times 1 points 22 hours ago Credit cards didn't become mainstream until the late 70s. permalink parent award report block reply Pied-Trumper 1 points 21 hours ago Is that also when note having a GED, thinking you don't need a credit card, and that the government cares about someone who owns their shit, cares about traditional American values, and dislikes usury became mainstream? The entire system wants people like that dead, and they've killed a few who did it a little too well. permalink parent award report block reply view 1 more comments...\nModern_Times 1 points 22 hours ago Credit cards didn't become mainstream until the late 70s. permalink parent award report block reply Pied-Trumper 1 points 21 hours ago Is that also when note having a GED, thinking you don't need a credit card, and that the government cares about someone who owns their shit, cares about traditional American values, and dislikes usury became mainstream? The entire system wants people like that dead, and they've killed a few who did it a little too well. permalink parent award report block reply view 1 more comments...\nPied-Trumper 1 points 21 hours ago Is that also when note having a GED, thinking you don't need a credit card, and that the government cares about someone who owns their shit, cares about traditional American values, and dislikes usury became mainstream? The entire system wants people like that dead, and they've killed a few who did it a little too well. permalink parent award report block reply view 1 more comments...\nPied-Trumper 3 points 22 hours ago Well, the Communists can't get paid $100k per year and have tons of political power unless we let 400k Chinese students and 500k Indians displace American citizens by paying a premium. We'll be sure to put another Jewish international in charge of this school to combat antisemitism, while not mentioning a word about the blatant White discrimination and genocide that's been ongoing for decades. After all, a majority White Christian nation is a threat to all non-white / non-Christian peoples, and this is their nation now, as they're the most profitable and controllable. As Vivek (a foreigner) would say, American children need to spend less time horsing around. They should pay a premium and lived stacked 10 fucks high, to compete with international slave labor receiving all your benefits. Americans must disregard American values. You'll need to pay a premium for that schooling to compete with foreign caste systems and Communist nations. If that's not enough profit, we'll simply displace you via migration, and taxes intended to benefit you as an American citizen. We prefer to use that tax money to line elite pockets instead, cause we are elites. Now get back in your $400k starter home, with your 50-year mortgage, $1 million in interest, and buy a modern shitbox eco-friendly vehicle on a 15-year, 7% interest loan. Ensure you sign your children up for the draft, cause we need those cogs to go die in foreign wars, benefiting our foreign backers. We'll do our best to throw you in jail for criticizing anything about this \"deal\". That's our way of prioritizing Americans, by completely fucking you in every way possible and wiping our asses with the Constitution. permalink parent award report block reply\nBloodElfSupporter 3 points 23 hours ago I had Pell grants and some scholarships when I attended UCLA almost 20 years ago, but I still had to pay for tuitions as loans. I think that’s why student loans are a big issue for many young people especially today. permalink parent award report block reply\nBOHICA2021 13 points 23 hours ago I DEMAND REPARATIONS !!! permalink award report block reply\nGA_Logic 9 points 23 hours ago Stop sending money to people that hate the USA. permalink award report block reply\nAmerica_No_1 8 points 23 hours ago How do they get any money at all when they have endowments in the billions? permalink award report block reply EggsBennydict 6 points 22 hours ago Why do any universities get money while continuing to increase tuition each year while the value of a degree has plummeted? If anything, tax dollars should’ve required universities to lower their tuition.  I went to a state university, dropped out after my student loans hit $96k.. I couldn’t transfer because my “credits” didn’t transfer.  I couldn’t get an associates degree because the university didn’t do associate degrees. I have 9% interest on my loans because I get penalized for not finishing. I’ve never missed a payment, but boy do universities give a lasting fuck you. Tuition went up a minimum of 8% each of the 4 years I was enrolled. If they can get away with that, they should not get any type of tax dollars. I got lucky, but I’d imagine there are younger people with significantly more student debt that also dropped out (or got a useless degree)  that can’t even make a full payment let alone rent. permalink parent award report block reply Aambrick 1 points 21 hours ago I would give them an ultimatum: Either lower the costs down to $20k or $30k per year or receive no funding and be fined for falsifying taxes. permalink parent award report block reply\nEggsBennydict 6 points 22 hours ago Why do any universities get money while continuing to increase tuition each year while the value of a degree has plummeted? If anything, tax dollars should’ve required universities to lower their tuition.  I went to a state university, dropped out after my student loans hit $96k.. I couldn’t transfer because my “credits” didn’t transfer.  I couldn’t get an associates degree because the university didn’t do associate degrees. I have 9% interest on my loans because I get penalized for not finishing. I’ve never missed a payment, but boy do universities give a lasting fuck you. Tuition went up a minimum of 8% each of the 4 years I was enrolled. If they can get away with that, they should not get any type of tax dollars. I got lucky, but I’d imagine there are younger people with significantly more student debt that also dropped out (or got a useless degree)  that can’t even make a full payment let alone rent. permalink parent award report block reply Aambrick 1 points 21 hours ago I would give them an ultimatum: Either lower the costs down to $20k or $30k per year or receive no funding and be fined for falsifying taxes. permalink parent award report block reply\nAambrick 1 points 21 hours ago I would give them an ultimatum: Either lower the costs down to $20k or $30k per year or receive no funding and be fined for falsifying taxes. permalink parent award report block reply\nMAGAguitar 4 points 23 hours ago This is how Berkeley leftists give their life meaning - eating up our tax dollars to feed their sense of self importance. permalink award report block reply\nI-am-Orlando OP PRO 3 points 23 hours ago Link https://x.com/C_3C_3/status/1988372346789609770?s=20 permalink award report block reply\nschnazzmizzle 3 points 23 hours ago \"ThEy WoUlD cOlApSe WiThOuT ChYnA\" permalink award report block reply\nColonelKlink 2 points 22 hours ago Don't give them another cent. Let them survive on their own. permalink award report block reply\nDiamondDroid 2 points 22 hours ago Stop ALL subsidies to Commie Colleges and Universities. permalink award report block reply\nJtBlaze 2 points 23 hours ago Death to ANTIFA. permalink award report block reply\nPOTUS_DonnieJ 2 points 22 hours ago Cut every penny going to every university. All these schools have multi million dollar endowments (and many, including the UC system have billions). None of them need a penny of our money. permalink award report block reply\nSCP0073 2 points 23 hours ago They’ve always done this. The spoiled, provided for class that works for nothing and thinks having an opinion is effort. permalink award report block reply\nFormerlurker92 1 points 22 hours ago Instead we're gonna give them indirect welfare of 600k Chinese students who will encourage this shit permalink award report block reply\nMySidesGoUp 1 points 22 hours ago The other billions are poured in by foreign parents of students.  They’ve curated the universities as such. No wonder they’re so un-American. permalink award report block reply\nzerk0021 1 points 22 hours ago Those are California Highway Patrol, which in California since 1995 have been  the State Police, the largest state police force in the USA. permalink award report block reply\nGrond999 1 points 22 hours ago too Neo-Marxism permalink award report block reply\nPlsdontfireme 1 points 22 hours ago $1b permalink award report block reply\nACActual 1 points 22 hours ago Whoa.  Chill out.   It'll get better with 600,000 Chinese students permalink award report block reply\nRetardloserimsogay 1 points 21 hours ago They added EBT to their little sign there. Total 🤡🌎 permalink award report block reply\nRock9Head 1 points 23 hours ago And not a nickel of good comes out of it. permalink award report block reply",
  "fetched_at": "2025-11-12T23:04:24.456373Z"
}