{
  "id": "1ARK56kf7B",
  "url": "https://patriots.win/p/1ARK56kf7B/alex-jones-global-exclusive-the-/c",
  "content": "460 ALEX JONES: Global Exclusive: The January 6th Pipe Bomber’s Identity Has Been Discovered, and She is a Female Federal Capitol Police Officer Caught Red-Handed as Part of a Larger Deep State False Flag Operation to Frame President Trump and His Constituents\nTop FBI whistleblower Kyle Seraphin, who s posted 4 days ago by Sunnybats2 14 comments award share report block Alex Jones @RealAlexJones • 5d Global Exclusive: The January 6th Pipe Bomber’s Identity Has Been Discovered, and She is a Female Federal Capitol Police Officer Caught Red-Handed as Part of a Larger Deep State False Flag Operation to Frame President Trump and His Constituents Top FBI whistleblower Kyle\n14 comments Sort by Top Top New Worst Old Save OlivaireBandaloo 11 points 4 days ago Good.  Now put her ass in jail, bankrupt her, destroy her familys life, just like they did the J6ers. permalink award report block reply MAG_n_KAG 11 points 4 days ago \"Best I can do is put her case on my desk and leave it there until it loses relevance.\" - Pam permalink parent award report block reply SBOJ_JOBS 8 points 4 days ago Had to be a woman or man-cunt like Strzok. permalink award report block reply Carterslvrpilz 6 points 4 days ago Butch looking lezzie. Maybe trans permalink award report block reply twentytwentyfourr 6 points 4 days ago knew it was female lol, her sassy walk gave it away permalink award report block reply ThunderGatti 6 points 4 days ago Really starting to feel like Kash and Dan Bongino are fucking traitors. They told Trump to believe the official story of Butler (that should have been his red flag to fire them), and they haven't conducted a single major Deep State arrest. Its been a fucking year. There are hundreds of traitors that need to be arrested. There's no excuse that nobody has been permalink award report block reply Sunnybats2 OP 1 points 4 days ago IKR WTF permalink parent award report block reply Ch3f4554551n 4 points 4 days ago C'mon bro, she was a lone wolf, bro. Please bro, believe me. She wasn't under orders from the Dems capture of the Intel gang, bro. You gotta believe me. Kash and Bondi cracked the case and it's over, bro. Close the file. permalink award report block reply Melchizedek18 3 points 4 days ago Some pundit recently stated that the Capitol Police were floating the idea of telling everyone that it was an ill-timed training exercise, in order to cover up her doing dirty work for them. If it was an exercise, they would have clearwd that up in the media, one would think, over the last few years. Not wait until you got busted. permalink parent award report block reply Ch3f4554551n 2 points 4 days ago It's always a training exercise. 9/11, sandy hook... permalink parent award report block reply YearninNation 0 points 4 days ago We know and don't need alex (fed) to tell us. permalink award report block reply Sunnybats2 OP 0 points 4 days ago Ok joo permalink parent award report block reply YearninNation 1 points 4 days ago That's a good one! permalink parent award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nOlivaireBandaloo 11 points 4 days ago Good.  Now put her ass in jail, bankrupt her, destroy her familys life, just like they did the J6ers. permalink award report block reply MAG_n_KAG 11 points 4 days ago \"Best I can do is put her case on my desk and leave it there until it loses relevance.\" - Pam permalink parent award report block reply\nMAG_n_KAG 11 points 4 days ago \"Best I can do is put her case on my desk and leave it there until it loses relevance.\" - Pam permalink parent award report block reply\nSBOJ_JOBS 8 points 4 days ago Had to be a woman or man-cunt like Strzok. permalink award report block reply\nCarterslvrpilz 6 points 4 days ago Butch looking lezzie. Maybe trans permalink award report block reply\ntwentytwentyfourr 6 points 4 days ago knew it was female lol, her sassy walk gave it away permalink award report block reply\nThunderGatti 6 points 4 days ago Really starting to feel like Kash and Dan Bongino are fucking traitors. They told Trump to believe the official story of Butler (that should have been his red flag to fire them), and they haven't conducted a single major Deep State arrest. Its been a fucking year. There are hundreds of traitors that need to be arrested. There's no excuse that nobody has been permalink award report block reply Sunnybats2 OP 1 points 4 days ago IKR WTF permalink parent award report block reply\nSunnybats2 OP 1 points 4 days ago IKR WTF permalink parent award report block reply\nCh3f4554551n 4 points 4 days ago C'mon bro, she was a lone wolf, bro. Please bro, believe me. She wasn't under orders from the Dems capture of the Intel gang, bro. You gotta believe me. Kash and Bondi cracked the case and it's over, bro. Close the file. permalink award report block reply Melchizedek18 3 points 4 days ago Some pundit recently stated that the Capitol Police were floating the idea of telling everyone that it was an ill-timed training exercise, in order to cover up her doing dirty work for them. If it was an exercise, they would have clearwd that up in the media, one would think, over the last few years. Not wait until you got busted. permalink parent award report block reply Ch3f4554551n 2 points 4 days ago It's always a training exercise. 9/11, sandy hook... permalink parent award report block reply\nMelchizedek18 3 points 4 days ago Some pundit recently stated that the Capitol Police were floating the idea of telling everyone that it was an ill-timed training exercise, in order to cover up her doing dirty work for them. If it was an exercise, they would have clearwd that up in the media, one would think, over the last few years. Not wait until you got busted. permalink parent award report block reply Ch3f4554551n 2 points 4 days ago It's always a training exercise. 9/11, sandy hook... permalink parent award report block reply\nCh3f4554551n 2 points 4 days ago It's always a training exercise. 9/11, sandy hook... permalink parent award report block reply\nYearninNation 0 points 4 days ago We know and don't need alex (fed) to tell us. permalink award report block reply Sunnybats2 OP 0 points 4 days ago Ok joo permalink parent award report block reply YearninNation 1 points 4 days ago That's a good one! permalink parent award report block reply\nSunnybats2 OP 0 points 4 days ago Ok joo permalink parent award report block reply YearninNation 1 points 4 days ago That's a good one! permalink parent award report block reply\nYearninNation 1 points 4 days ago That's a good one! permalink parent award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T21:08:36.239064Z"
}