{
  "id": "1ARK9iq7dd",
  "url": "https://patriots.win/p/1ARK9iq7dd/sunday-two-more-ntvessels-destro/c",
  "content": "1056 Sunday, Two More NT-Vessels Destroyed. Each had 3 crew who were killed in the attack in International waters. posted 2 days ago by LightBeacons 88 comments award share report block Secretary of War Pete Hegseth @SecWar • 2d Yesterday, at the direction of President Trump, two lethal kinetic strikes were conducted on two vessels operated by Designated Terrorist Organizations. These vessels were known by our intelligence to be associated with illicit narcotics smuggling, were carrying narcotics, and\n88 comments Sort by Top Top New Worst Old Save Around the Web BoatingAccident 59 points 2 days ago Innocent fishermen transporting meals for hungry kids!!!   Reeee!!!! permalink award report block reply IncredibleMrE1 24 points 2 days ago Meals on Drug Deals permalink parent award report block reply Kraken_V_Algorithm 19 points 2 days ago Raves on waves permalink parent award report block reply ReturnOfSmarm 7 points 2 days ago Potions from the oceans. permalink parent award report block reply LibertarianXian 3 points 2 days ago Pharmakeia from Latin Ameerika permalink parent award report block reply Choppermagic 6 points 2 days ago obviously. those barrels of fentanyl are just for buoyancy! permalink parent award report block reply MoldyLocksNesMonste 3 points 2 days ago Pain medicine for the orphans. permalink parent award report block reply DeportThemAllForever 4 points 2 days ago Hunter Biden is one hungry kid permalink parent award report block reply FatigueIsReal 2 points 2 days ago Name checks out. permalink parent award report block reply Grindelwald 36 points 2 days ago I wonder how many are getting through. permalink award report block reply RuprechtThaMonkeyBoy 19 points 2 days ago I’ll do a quick poll of degenerate lefties to see if the price of their nose clams has increased. permalink parent award report block reply booblitchutz 17 points 2 days ago You'll know when drugs get more expensive because there will be fewer \"homeless\". There will also be a reduction in Antifa activity. permalink parent award report block reply schnazzmizzle 12 points 2 days ago Not many are going to get past the radars on our destroyers. permalink parent award report block reply TruthyBrat 6 points 2 days ago More like the radars on our E2C's and P-8's. Destroyers likely stay in EMCON mode. I know a guy who did some E2C ride-alongs a couple decades ago, chasing cigarette drug boats in the Caribbean. This has been going on a long time to little effect. Until now. permalink parent award report block reply schnazzmizzle 2 points 2 days ago Why would they stay in EMCON, that defeats the purpose of being on station, you don't just float around like cork.  I spent a lot of time in combat as surface warfare coordinator on a Destroyer.  Our Aegis and other radar systems integrate with airborne platforms. permalink parent award report block reply booblitchutz 9 points 2 days ago I think they build in loss to their business model. permalink parent award report block reply PROCIsAsshoe 11 points 2 days ago I think it's more about the fact that narco-traffickers now have to fear death instead of just being arrested. absolutely has a demoralizing impact on morale to think you might be going on a suicide mission. permalink parent award report block reply ActNow 3 points 2 days ago I gotta wonder if the cartels are finding some schlubs in debt to them and forcing these guys to make delivery runs. Maybe, maybe not. permalink parent award report block reply PROCIsAsshoe 2 points 2 days ago oh man, that resonates. I bet you're spot on. permalink parent award report block reply booblitchutz -1 points 2 days ago The cartels can easily afford to up the salary for the next 3 years. They can make the price high enough that these scumbags will gladly risk their essentially worthless lives. Just a handfull of pesos more. They know that maintaining the high supply in the US is worth eating a lot of profits. If people in the US start sobering up, they lose long term. But come on, we know the next democrat (which is coming probably sooner than we think) will throw open that gate again. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 days ago I'm not sure those runners really have too much choice in the matter. Refuse and you likely get offed. It's essentially a suicide mission. And if you survive, you get to do it again, or get offed. permalink parent award report block reply PROCIsAsshoe 1 points 2 days ago you act as if the likelihood of being killed doesn't have a chilling effect, it does! you're helpless to stop an aerial strike if you choose to drive that boat, do you really want to be the one making the trip? there are going to be fewer people willing to work for the narco community and the point here is to wither their forces and cashflow. idk why everybody around here is constantly trying to needle the Admin's tactics as if they don't know what they're doing. I'd imagine the totality of intel on TdA leads to a motivating situation for this choice of tactic. permalink parent award report block reply Choppermagic 5 points 2 days ago thats why the US should start hitting them directly and their facilities permalink parent award report block reply ActNow 2 points 2 days ago Best we can do is strikes in international waters. permalink parent award report block reply wololo 2 points 2 days ago Good question. It's got to be enough to make it still 'worth it' for these cartel leaders to sacrifice their people (not that they care about their grunts) and their product because surely there have been enough of these publicly announced strikes that I would've thought the cartels would be thinking twice by now. Guess not. Makes you wonder. permalink parent award report block reply ciaramella_is_gay 2 points 2 days ago Enough for us to not notice with these distractions from the SecWar permalink parent award report block reply load 4 more comments... TruculentGoose 34 points 2 days ago Bye bye faggots say hi to the fishies permalink award report block reply Nick-Kerr 9 points 2 days ago Those fish are getting cranked up! permalink parent award report block reply PhantomShield72 16 points 2 days ago The fact that they keep sending these boats despite the very public vaporizations of them is a clear indication of just how bad this situation really is. They are motivated well beyond the concern over physical or monetary casualties. This is actually crazy to consider.  Even under the threat of assured death, they are not stopping. permalink award report block reply YaharaRiver 5 points 2 days ago Famous last words, “Just watch ME do it!” permalink parent award report block reply RustySheckelford 4 points 2 days ago It's also fucked how many Americans want their fucking drugs... permalink parent award report block reply Watermelons 3 points 2 days ago I wonder how many of the mules are coerced into this.   If they keep doing it, it would behoove them to use expendables and modify their tactics. permalink parent award report block reply ActNow 3 points 2 days ago Cartels are death cults. permalink parent award report block reply Whatyougotson 2 points 2 days ago The invisible gun that may or may not blast them is less scary than the one pointed at them back at the shore and their families. A lot of boats are getting through or they wouldnt try though. permalink parent award report block reply IncredibleMrE1 15 points 2 days ago Still hasn't read To Kill A Mockingbird smh permalink award report block reply henri_derelicte 14 points 2 days ago I heard a rumor that at least one of those boats was destroyed by an AC-130, possibly the one spotted in El Salvador permalink award report block reply SteveRogers42 5 points 2 days ago Puff The Magic Dragon permalink parent award report block reply blue5707 11 points 2 days ago They were innocent, buy my book. -Rand Paul permalink award report block reply ImYourHuckleberry24 10 points 2 days ago Loving these 'feel good' videos. permalink award report block reply Unboosted 7 points 2 days ago I love seeing the people antifa supports bombed permalink award report block reply Speedgraphic69 7 points 2 days ago Live target practice.  Thanks for your attention permalink award report block reply nje1540 7 points 2 days ago Should we be concerned about all the drugs we are dumping into the ocean? How many fish are getting stoned because of drug traffickers? permalink award report block reply YesImWhite 6 points 2 days ago no lol the LD50 for marine life isnt going to come anywhere close to reaching the concentration. The ocean is massive brother permalink parent award report block reply FatigueIsReal 5 points 2 days ago Would be nice if they would stop using boats to traffick drugs. permalink parent award report block reply Whatyougotson 4 points 2 days ago SolutIon to polutIon is dilution. Unless drugs are radioactive or a foreverchemal in massive quantities its fine. Ocean is almost incomprehensibly large in terms of diluting strength permalink parent award report block reply Mddet 6 points 2 days ago Good job, one thing i would change tho, stop putting all the accountability on Trump. permalink award report block reply Oldman1234 6 points 2 days ago Democrat donors take another hit to their revenue stream. permalink award report block reply SSJ3NAPPA 6 points 2 days ago I love that they keep posting the kill shot footage permalink award report block reply redditadminssuckit 4 points 2 days ago Ok... anyway .... permalink award report block reply HumanSomewhere 4 points 2 days ago I'm fine with the notion  that this is about narcotics but I think the discerning geopolitical viewer will realize this is dual-purpose...narco enforcement AND a counter to China.  I suspect the latter being the real purpose....Having a large force sitting in the Caribbean is also very centrally located, they can go through the canal to break out into the pacific if China goes for it, or cross the atlantic either to the baltic if Russia goes for it, or the med if needs be for middle-east.  it's the most central place to set a carrier strike group permalink award report block reply YesImWhite 4 points 2 days ago its for Venezuela. China is FAR as fuck brother, we have a pacific fleet already. Moving the atlantic fleet would be a major kick off. What we are doing in venezuela is a deterrent to China and Russia in terms of minerals theyre getting in Africa permalink parent award report block reply FatigueIsReal 4 points 2 days ago This guy geopolitics. permalink parent award report block reply ingrowntoenail 3 points 2 days ago They need to make sure there are no survivors that can be used by the media as ragebait again. permalink award report block reply Bazhosh 1 points 2 days ago There were two some days ago. The Navy picked them up and returned them home. No charges of drug trafficking, nothing! permalink parent award report block reply YaharaRiver 1 points 2 days ago possible tracker chip implanted. https://patriots.win/p/12hR2rGI0U/nano-means-onebillionth/c permalink parent award report block reply GhostOfMyFormerSelf 3 points 2 days ago No Juan could have survived that! Wow! permalink award report block reply ActNow 3 points 2 days ago They picked the wrong day to traffick drugs. permalink award report block reply paramour 2 points 2 days ago Big bada Boom! Lolz permalink award report block reply tarballs 2 points 2 days ago And pessimists are still insisting that Trump returning to the presidency has made no differences and that he's not doing anything. This is about as big a difference as it gets! permalink award report block reply throttlejohnson 2 points 2 days ago they got to be running out of boats by now... permalink award report block reply Nick-Kerr 2 points 2 days ago They just go and steal more permalink parent award report block reply GallowsTime 2 points 2 days ago We need some \"lethal kinetic\" in Portland and Chicago! permalink award report block reply Ligersrule1 2 points 2 days ago Austere maritime sailors! permalink award report block reply HillarysBeaverMunch 2 points 2 days ago If we are able kill low-level boat drivers why can't we also assassinate the bosses? Pretty sure I've seen several movies on this exact subject, thus it is feasible. permalink award report block reply heavyD 2 points 2 days ago The sad part, what if these poor souls are being forced to do this by the cartel holding their families hostage. Just a thought that I feel sure is happening.  I don't want the crap to make it here either, what ever it takes but sad in a way. permalink award report block reply KarenLukasik 1 points 2 days ago So at this point it’s suicidal “volunteers” getting blown up? Do the drugrunners even know what’s happening? I would think they would by now permalink award report block reply kornesque 1 points 2 days ago I voted for this and didn't even know it. AWESOME! permalink award report block reply LibertarianXian 1 points 2 days ago Good, now maybe Abbott, Patrick and Paxton will drop their nuts and do something about where those blue barrels get stashed when they hit our country's shores. permalink award report block reply Easzq8 1 points 2 days ago Oh, darn. permalink award report block reply Jmricht 1 points 2 days ago Get em’! permalink award report block reply njb425 1 points 2 days ago wouldnt kinetic strikes mean . no explosive on it? so are they are using a rail gun? permalink award report block reply Oldman1234 3 points 2 days ago It differentiates from cyber warfare where no weapons are fired. permalink parent award report block reply Hangmhigh 1 points 2 days ago This is what every boat of invaders should look like across the western world. permalink award report block reply Kaputtmacher 1 points 2 days ago Quite sad knowing these people never knew what hit them. permalink award report block reply dburt2 1 points 2 days ago I'm sure that the drugs dissipate quickly in seawater but I wonder if some of the sea life gets high? permalink award report block reply doodaddy 1 points 2 days ago The rate seems to be increasing, so I guess it's not a deterrent.  Oh well.* I'm assuming these are actual baddies, which I feel 90% they are. permalink award report block reply PatriotSkorzeny 1 points 2 days ago Liberate NYC on the USMC’s 250th Birthday. 9/11. permalink award report block reply Prandogolio 1 points 2 days ago You'd think they would stop, but I guess the jungle beaners aren't very smart. permalink award report block reply FatigueIsReal 1 points 2 days ago Either die and probably have your family killed by refusing the cartel or take your chances on the open ocean. I'd take the boat out too. permalink parent award report block reply Remember_the_Alamo 1 points 2 days ago Has any evidence washed up? permalink award report block reply 1True-translation 1 points 2 days ago I just caught a sae bsss that was so fuckin ready.... permalink parent award report block reply CaptainWinston 1 points 2 days ago How long before Pedro says No? permalink award report block reply Johanes 1 points 2 days ago Poor high speed fishermen 🤣 permalink award report block reply\nBoatingAccident 59 points 2 days ago Innocent fishermen transporting meals for hungry kids!!!   Reeee!!!! permalink award report block reply IncredibleMrE1 24 points 2 days ago Meals on Drug Deals permalink parent award report block reply Kraken_V_Algorithm 19 points 2 days ago Raves on waves permalink parent award report block reply ReturnOfSmarm 7 points 2 days ago Potions from the oceans. permalink parent award report block reply LibertarianXian 3 points 2 days ago Pharmakeia from Latin Ameerika permalink parent award report block reply Choppermagic 6 points 2 days ago obviously. those barrels of fentanyl are just for buoyancy! permalink parent award report block reply MoldyLocksNesMonste 3 points 2 days ago Pain medicine for the orphans. permalink parent award report block reply DeportThemAllForever 4 points 2 days ago Hunter Biden is one hungry kid permalink parent award report block reply FatigueIsReal 2 points 2 days ago Name checks out. permalink parent award report block reply\nIncredibleMrE1 24 points 2 days ago Meals on Drug Deals permalink parent award report block reply Kraken_V_Algorithm 19 points 2 days ago Raves on waves permalink parent award report block reply ReturnOfSmarm 7 points 2 days ago Potions from the oceans. permalink parent award report block reply LibertarianXian 3 points 2 days ago Pharmakeia from Latin Ameerika permalink parent award report block reply\nKraken_V_Algorithm 19 points 2 days ago Raves on waves permalink parent award report block reply ReturnOfSmarm 7 points 2 days ago Potions from the oceans. permalink parent award report block reply LibertarianXian 3 points 2 days ago Pharmakeia from Latin Ameerika permalink parent award report block reply\nReturnOfSmarm 7 points 2 days ago Potions from the oceans. permalink parent award report block reply LibertarianXian 3 points 2 days ago Pharmakeia from Latin Ameerika permalink parent award report block reply\nLibertarianXian 3 points 2 days ago Pharmakeia from Latin Ameerika permalink parent award report block reply\nChoppermagic 6 points 2 days ago obviously. those barrels of fentanyl are just for buoyancy! permalink parent award report block reply MoldyLocksNesMonste 3 points 2 days ago Pain medicine for the orphans. permalink parent award report block reply\nMoldyLocksNesMonste 3 points 2 days ago Pain medicine for the orphans. permalink parent award report block reply\nDeportThemAllForever 4 points 2 days ago Hunter Biden is one hungry kid permalink parent award report block reply\nFatigueIsReal 2 points 2 days ago Name checks out. permalink parent award report block reply\nGrindelwald 36 points 2 days ago I wonder how many are getting through. permalink award report block reply RuprechtThaMonkeyBoy 19 points 2 days ago I’ll do a quick poll of degenerate lefties to see if the price of their nose clams has increased. permalink parent award report block reply booblitchutz 17 points 2 days ago You'll know when drugs get more expensive because there will be fewer \"homeless\". There will also be a reduction in Antifa activity. permalink parent award report block reply schnazzmizzle 12 points 2 days ago Not many are going to get past the radars on our destroyers. permalink parent award report block reply TruthyBrat 6 points 2 days ago More like the radars on our E2C's and P-8's. Destroyers likely stay in EMCON mode. I know a guy who did some E2C ride-alongs a couple decades ago, chasing cigarette drug boats in the Caribbean. This has been going on a long time to little effect. Until now. permalink parent award report block reply schnazzmizzle 2 points 2 days ago Why would they stay in EMCON, that defeats the purpose of being on station, you don't just float around like cork.  I spent a lot of time in combat as surface warfare coordinator on a Destroyer.  Our Aegis and other radar systems integrate with airborne platforms. permalink parent award report block reply booblitchutz 9 points 2 days ago I think they build in loss to their business model. permalink parent award report block reply PROCIsAsshoe 11 points 2 days ago I think it's more about the fact that narco-traffickers now have to fear death instead of just being arrested. absolutely has a demoralizing impact on morale to think you might be going on a suicide mission. permalink parent award report block reply ActNow 3 points 2 days ago I gotta wonder if the cartels are finding some schlubs in debt to them and forcing these guys to make delivery runs. Maybe, maybe not. permalink parent award report block reply PROCIsAsshoe 2 points 2 days ago oh man, that resonates. I bet you're spot on. permalink parent award report block reply booblitchutz -1 points 2 days ago The cartels can easily afford to up the salary for the next 3 years. They can make the price high enough that these scumbags will gladly risk their essentially worthless lives. Just a handfull of pesos more. They know that maintaining the high supply in the US is worth eating a lot of profits. If people in the US start sobering up, they lose long term. But come on, we know the next democrat (which is coming probably sooner than we think) will throw open that gate again. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 days ago I'm not sure those runners really have too much choice in the matter. Refuse and you likely get offed. It's essentially a suicide mission. And if you survive, you get to do it again, or get offed. permalink parent award report block reply PROCIsAsshoe 1 points 2 days ago you act as if the likelihood of being killed doesn't have a chilling effect, it does! you're helpless to stop an aerial strike if you choose to drive that boat, do you really want to be the one making the trip? there are going to be fewer people willing to work for the narco community and the point here is to wither their forces and cashflow. idk why everybody around here is constantly trying to needle the Admin's tactics as if they don't know what they're doing. I'd imagine the totality of intel on TdA leads to a motivating situation for this choice of tactic. permalink parent award report block reply Choppermagic 5 points 2 days ago thats why the US should start hitting them directly and their facilities permalink parent award report block reply ActNow 2 points 2 days ago Best we can do is strikes in international waters. permalink parent award report block reply wololo 2 points 2 days ago Good question. It's got to be enough to make it still 'worth it' for these cartel leaders to sacrifice their people (not that they care about their grunts) and their product because surely there have been enough of these publicly announced strikes that I would've thought the cartels would be thinking twice by now. Guess not. Makes you wonder. permalink parent award report block reply ciaramella_is_gay 2 points 2 days ago Enough for us to not notice with these distractions from the SecWar permalink parent award report block reply load 4 more comments...\nRuprechtThaMonkeyBoy 19 points 2 days ago I’ll do a quick poll of degenerate lefties to see if the price of their nose clams has increased. permalink parent award report block reply booblitchutz 17 points 2 days ago You'll know when drugs get more expensive because there will be fewer \"homeless\". There will also be a reduction in Antifa activity. permalink parent award report block reply\nbooblitchutz 17 points 2 days ago You'll know when drugs get more expensive because there will be fewer \"homeless\". There will also be a reduction in Antifa activity. permalink parent award report block reply\nschnazzmizzle 12 points 2 days ago Not many are going to get past the radars on our destroyers. permalink parent award report block reply TruthyBrat 6 points 2 days ago More like the radars on our E2C's and P-8's. Destroyers likely stay in EMCON mode. I know a guy who did some E2C ride-alongs a couple decades ago, chasing cigarette drug boats in the Caribbean. This has been going on a long time to little effect. Until now. permalink parent award report block reply schnazzmizzle 2 points 2 days ago Why would they stay in EMCON, that defeats the purpose of being on station, you don't just float around like cork.  I spent a lot of time in combat as surface warfare coordinator on a Destroyer.  Our Aegis and other radar systems integrate with airborne platforms. permalink parent award report block reply\nTruthyBrat 6 points 2 days ago More like the radars on our E2C's and P-8's. Destroyers likely stay in EMCON mode. I know a guy who did some E2C ride-alongs a couple decades ago, chasing cigarette drug boats in the Caribbean. This has been going on a long time to little effect. Until now. permalink parent award report block reply schnazzmizzle 2 points 2 days ago Why would they stay in EMCON, that defeats the purpose of being on station, you don't just float around like cork.  I spent a lot of time in combat as surface warfare coordinator on a Destroyer.  Our Aegis and other radar systems integrate with airborne platforms. permalink parent award report block reply\nschnazzmizzle 2 points 2 days ago Why would they stay in EMCON, that defeats the purpose of being on station, you don't just float around like cork.  I spent a lot of time in combat as surface warfare coordinator on a Destroyer.  Our Aegis and other radar systems integrate with airborne platforms. permalink parent award report block reply\nbooblitchutz 9 points 2 days ago I think they build in loss to their business model. permalink parent award report block reply PROCIsAsshoe 11 points 2 days ago I think it's more about the fact that narco-traffickers now have to fear death instead of just being arrested. absolutely has a demoralizing impact on morale to think you might be going on a suicide mission. permalink parent award report block reply ActNow 3 points 2 days ago I gotta wonder if the cartels are finding some schlubs in debt to them and forcing these guys to make delivery runs. Maybe, maybe not. permalink parent award report block reply PROCIsAsshoe 2 points 2 days ago oh man, that resonates. I bet you're spot on. permalink parent award report block reply booblitchutz -1 points 2 days ago The cartels can easily afford to up the salary for the next 3 years. They can make the price high enough that these scumbags will gladly risk their essentially worthless lives. Just a handfull of pesos more. They know that maintaining the high supply in the US is worth eating a lot of profits. If people in the US start sobering up, they lose long term. But come on, we know the next democrat (which is coming probably sooner than we think) will throw open that gate again. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 days ago I'm not sure those runners really have too much choice in the matter. Refuse and you likely get offed. It's essentially a suicide mission. And if you survive, you get to do it again, or get offed. permalink parent award report block reply PROCIsAsshoe 1 points 2 days ago you act as if the likelihood of being killed doesn't have a chilling effect, it does! you're helpless to stop an aerial strike if you choose to drive that boat, do you really want to be the one making the trip? there are going to be fewer people willing to work for the narco community and the point here is to wither their forces and cashflow. idk why everybody around here is constantly trying to needle the Admin's tactics as if they don't know what they're doing. I'd imagine the totality of intel on TdA leads to a motivating situation for this choice of tactic. permalink parent award report block reply Choppermagic 5 points 2 days ago thats why the US should start hitting them directly and their facilities permalink parent award report block reply ActNow 2 points 2 days ago Best we can do is strikes in international waters. permalink parent award report block reply\nPROCIsAsshoe 11 points 2 days ago I think it's more about the fact that narco-traffickers now have to fear death instead of just being arrested. absolutely has a demoralizing impact on morale to think you might be going on a suicide mission. permalink parent award report block reply ActNow 3 points 2 days ago I gotta wonder if the cartels are finding some schlubs in debt to them and forcing these guys to make delivery runs. Maybe, maybe not. permalink parent award report block reply PROCIsAsshoe 2 points 2 days ago oh man, that resonates. I bet you're spot on. permalink parent award report block reply booblitchutz -1 points 2 days ago The cartels can easily afford to up the salary for the next 3 years. They can make the price high enough that these scumbags will gladly risk their essentially worthless lives. Just a handfull of pesos more. They know that maintaining the high supply in the US is worth eating a lot of profits. If people in the US start sobering up, they lose long term. But come on, we know the next democrat (which is coming probably sooner than we think) will throw open that gate again. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 days ago I'm not sure those runners really have too much choice in the matter. Refuse and you likely get offed. It's essentially a suicide mission. And if you survive, you get to do it again, or get offed. permalink parent award report block reply PROCIsAsshoe 1 points 2 days ago you act as if the likelihood of being killed doesn't have a chilling effect, it does! you're helpless to stop an aerial strike if you choose to drive that boat, do you really want to be the one making the trip? there are going to be fewer people willing to work for the narco community and the point here is to wither their forces and cashflow. idk why everybody around here is constantly trying to needle the Admin's tactics as if they don't know what they're doing. I'd imagine the totality of intel on TdA leads to a motivating situation for this choice of tactic. permalink parent award report block reply\nActNow 3 points 2 days ago I gotta wonder if the cartels are finding some schlubs in debt to them and forcing these guys to make delivery runs. Maybe, maybe not. permalink parent award report block reply PROCIsAsshoe 2 points 2 days ago oh man, that resonates. I bet you're spot on. permalink parent award report block reply\nPROCIsAsshoe 2 points 2 days ago oh man, that resonates. I bet you're spot on. permalink parent award report block reply\nbooblitchutz -1 points 2 days ago The cartels can easily afford to up the salary for the next 3 years. They can make the price high enough that these scumbags will gladly risk their essentially worthless lives. Just a handfull of pesos more. They know that maintaining the high supply in the US is worth eating a lot of profits. If people in the US start sobering up, they lose long term. But come on, we know the next democrat (which is coming probably sooner than we think) will throw open that gate again. permalink parent award report block reply MoldyLocksNesMonste 2 points 2 days ago I'm not sure those runners really have too much choice in the matter. Refuse and you likely get offed. It's essentially a suicide mission. And if you survive, you get to do it again, or get offed. permalink parent award report block reply PROCIsAsshoe 1 points 2 days ago you act as if the likelihood of being killed doesn't have a chilling effect, it does! you're helpless to stop an aerial strike if you choose to drive that boat, do you really want to be the one making the trip? there are going to be fewer people willing to work for the narco community and the point here is to wither their forces and cashflow. idk why everybody around here is constantly trying to needle the Admin's tactics as if they don't know what they're doing. I'd imagine the totality of intel on TdA leads to a motivating situation for this choice of tactic. permalink parent award report block reply\nMoldyLocksNesMonste 2 points 2 days ago I'm not sure those runners really have too much choice in the matter. Refuse and you likely get offed. It's essentially a suicide mission. And if you survive, you get to do it again, or get offed. permalink parent award report block reply\nPROCIsAsshoe 1 points 2 days ago you act as if the likelihood of being killed doesn't have a chilling effect, it does! you're helpless to stop an aerial strike if you choose to drive that boat, do you really want to be the one making the trip? there are going to be fewer people willing to work for the narco community and the point here is to wither their forces and cashflow. idk why everybody around here is constantly trying to needle the Admin's tactics as if they don't know what they're doing. I'd imagine the totality of intel on TdA leads to a motivating situation for this choice of tactic. permalink parent award report block reply\nChoppermagic 5 points 2 days ago thats why the US should start hitting them directly and their facilities permalink parent award report block reply ActNow 2 points 2 days ago Best we can do is strikes in international waters. permalink parent award report block reply\nActNow 2 points 2 days ago Best we can do is strikes in international waters. permalink parent award report block reply\nwololo 2 points 2 days ago Good question. It's got to be enough to make it still 'worth it' for these cartel leaders to sacrifice their people (not that they care about their grunts) and their product because surely there have been enough of these publicly announced strikes that I would've thought the cartels would be thinking twice by now. Guess not. Makes you wonder. permalink parent award report block reply\nciaramella_is_gay 2 points 2 days ago Enough for us to not notice with these distractions from the SecWar permalink parent award report block reply\nTruculentGoose 34 points 2 days ago Bye bye faggots say hi to the fishies permalink award report block reply Nick-Kerr 9 points 2 days ago Those fish are getting cranked up! permalink parent award report block reply\nNick-Kerr 9 points 2 days ago Those fish are getting cranked up! permalink parent award report block reply\nPhantomShield72 16 points 2 days ago The fact that they keep sending these boats despite the very public vaporizations of them is a clear indication of just how bad this situation really is. They are motivated well beyond the concern over physical or monetary casualties. This is actually crazy to consider.  Even under the threat of assured death, they are not stopping. permalink award report block reply YaharaRiver 5 points 2 days ago Famous last words, “Just watch ME do it!” permalink parent award report block reply RustySheckelford 4 points 2 days ago It's also fucked how many Americans want their fucking drugs... permalink parent award report block reply Watermelons 3 points 2 days ago I wonder how many of the mules are coerced into this.   If they keep doing it, it would behoove them to use expendables and modify their tactics. permalink parent award report block reply ActNow 3 points 2 days ago Cartels are death cults. permalink parent award report block reply Whatyougotson 2 points 2 days ago The invisible gun that may or may not blast them is less scary than the one pointed at them back at the shore and their families. A lot of boats are getting through or they wouldnt try though. permalink parent award report block reply\nYaharaRiver 5 points 2 days ago Famous last words, “Just watch ME do it!” permalink parent award report block reply\nRustySheckelford 4 points 2 days ago It's also fucked how many Americans want their fucking drugs... permalink parent award report block reply\nWatermelons 3 points 2 days ago I wonder how many of the mules are coerced into this.   If they keep doing it, it would behoove them to use expendables and modify their tactics. permalink parent award report block reply\nActNow 3 points 2 days ago Cartels are death cults. permalink parent award report block reply\nWhatyougotson 2 points 2 days ago The invisible gun that may or may not blast them is less scary than the one pointed at them back at the shore and their families. A lot of boats are getting through or they wouldnt try though. permalink parent award report block reply\nIncredibleMrE1 15 points 2 days ago Still hasn't read To Kill A Mockingbird smh permalink award report block reply\nhenri_derelicte 14 points 2 days ago I heard a rumor that at least one of those boats was destroyed by an AC-130, possibly the one spotted in El Salvador permalink award report block reply SteveRogers42 5 points 2 days ago Puff The Magic Dragon permalink parent award report block reply\nSteveRogers42 5 points 2 days ago Puff The Magic Dragon permalink parent award report block reply\nblue5707 11 points 2 days ago They were innocent, buy my book. -Rand Paul permalink award report block reply\nImYourHuckleberry24 10 points 2 days ago Loving these 'feel good' videos. permalink award report block reply\nUnboosted 7 points 2 days ago I love seeing the people antifa supports bombed permalink award report block reply\nSpeedgraphic69 7 points 2 days ago Live target practice.  Thanks for your attention permalink award report block reply\nnje1540 7 points 2 days ago Should we be concerned about all the drugs we are dumping into the ocean? How many fish are getting stoned because of drug traffickers? permalink award report block reply YesImWhite 6 points 2 days ago no lol the LD50 for marine life isnt going to come anywhere close to reaching the concentration. The ocean is massive brother permalink parent award report block reply FatigueIsReal 5 points 2 days ago Would be nice if they would stop using boats to traffick drugs. permalink parent award report block reply Whatyougotson 4 points 2 days ago SolutIon to polutIon is dilution. Unless drugs are radioactive or a foreverchemal in massive quantities its fine. Ocean is almost incomprehensibly large in terms of diluting strength permalink parent award report block reply\nYesImWhite 6 points 2 days ago no lol the LD50 for marine life isnt going to come anywhere close to reaching the concentration. The ocean is massive brother permalink parent award report block reply\nFatigueIsReal 5 points 2 days ago Would be nice if they would stop using boats to traffick drugs. permalink parent award report block reply\nWhatyougotson 4 points 2 days ago SolutIon to polutIon is dilution. Unless drugs are radioactive or a foreverchemal in massive quantities its fine. Ocean is almost incomprehensibly large in terms of diluting strength permalink parent award report block reply\nMddet 6 points 2 days ago Good job, one thing i would change tho, stop putting all the accountability on Trump. permalink award report block reply\nOldman1234 6 points 2 days ago Democrat donors take another hit to their revenue stream. permalink award report block reply\nSSJ3NAPPA 6 points 2 days ago I love that they keep posting the kill shot footage permalink award report block reply\nredditadminssuckit 4 points 2 days ago Ok... anyway .... permalink award report block reply\nHumanSomewhere 4 points 2 days ago I'm fine with the notion  that this is about narcotics but I think the discerning geopolitical viewer will realize this is dual-purpose...narco enforcement AND a counter to China.  I suspect the latter being the real purpose....Having a large force sitting in the Caribbean is also very centrally located, they can go through the canal to break out into the pacific if China goes for it, or cross the atlantic either to the baltic if Russia goes for it, or the med if needs be for middle-east.  it's the most central place to set a carrier strike group permalink award report block reply YesImWhite 4 points 2 days ago its for Venezuela. China is FAR as fuck brother, we have a pacific fleet already. Moving the atlantic fleet would be a major kick off. What we are doing in venezuela is a deterrent to China and Russia in terms of minerals theyre getting in Africa permalink parent award report block reply FatigueIsReal 4 points 2 days ago This guy geopolitics. permalink parent award report block reply\nYesImWhite 4 points 2 days ago its for Venezuela. China is FAR as fuck brother, we have a pacific fleet already. Moving the atlantic fleet would be a major kick off. What we are doing in venezuela is a deterrent to China and Russia in terms of minerals theyre getting in Africa permalink parent award report block reply\nFatigueIsReal 4 points 2 days ago This guy geopolitics. permalink parent award report block reply\ningrowntoenail 3 points 2 days ago They need to make sure there are no survivors that can be used by the media as ragebait again. permalink award report block reply Bazhosh 1 points 2 days ago There were two some days ago. The Navy picked them up and returned them home. No charges of drug trafficking, nothing! permalink parent award report block reply YaharaRiver 1 points 2 days ago possible tracker chip implanted. https://patriots.win/p/12hR2rGI0U/nano-means-onebillionth/c permalink parent award report block reply\nBazhosh 1 points 2 days ago There were two some days ago. The Navy picked them up and returned them home. No charges of drug trafficking, nothing! permalink parent award report block reply YaharaRiver 1 points 2 days ago possible tracker chip implanted. https://patriots.win/p/12hR2rGI0U/nano-means-onebillionth/c permalink parent award report block reply\nYaharaRiver 1 points 2 days ago possible tracker chip implanted. https://patriots.win/p/12hR2rGI0U/nano-means-onebillionth/c permalink parent award report block reply\nGhostOfMyFormerSelf 3 points 2 days ago No Juan could have survived that! Wow! permalink award report block reply\nActNow 3 points 2 days ago They picked the wrong day to traffick drugs. permalink award report block reply\nparamour 2 points 2 days ago Big bada Boom! Lolz permalink award report block reply\ntarballs 2 points 2 days ago And pessimists are still insisting that Trump returning to the presidency has made no differences and that he's not doing anything. This is about as big a difference as it gets! permalink award report block reply\nthrottlejohnson 2 points 2 days ago they got to be running out of boats by now... permalink award report block reply Nick-Kerr 2 points 2 days ago They just go and steal more permalink parent award report block reply\nNick-Kerr 2 points 2 days ago They just go and steal more permalink parent award report block reply\nGallowsTime 2 points 2 days ago We need some \"lethal kinetic\" in Portland and Chicago! permalink award report block reply\nLigersrule1 2 points 2 days ago Austere maritime sailors! permalink award report block reply\nHillarysBeaverMunch 2 points 2 days ago If we are able kill low-level boat drivers why can't we also assassinate the bosses? Pretty sure I've seen several movies on this exact subject, thus it is feasible. permalink award report block reply\nheavyD 2 points 2 days ago The sad part, what if these poor souls are being forced to do this by the cartel holding their families hostage. Just a thought that I feel sure is happening.  I don't want the crap to make it here either, what ever it takes but sad in a way. permalink award report block reply\nKarenLukasik 1 points 2 days ago So at this point it’s suicidal “volunteers” getting blown up? Do the drugrunners even know what’s happening? I would think they would by now permalink award report block reply\nkornesque 1 points 2 days ago I voted for this and didn't even know it. AWESOME! permalink award report block reply\nLibertarianXian 1 points 2 days ago Good, now maybe Abbott, Patrick and Paxton will drop their nuts and do something about where those blue barrels get stashed when they hit our country's shores. permalink award report block reply\nEaszq8 1 points 2 days ago Oh, darn. permalink award report block reply\nJmricht 1 points 2 days ago Get em’! permalink award report block reply\nnjb425 1 points 2 days ago wouldnt kinetic strikes mean . no explosive on it? so are they are using a rail gun? permalink award report block reply Oldman1234 3 points 2 days ago It differentiates from cyber warfare where no weapons are fired. permalink parent award report block reply\nOldman1234 3 points 2 days ago It differentiates from cyber warfare where no weapons are fired. permalink parent award report block reply\nHangmhigh 1 points 2 days ago This is what every boat of invaders should look like across the western world. permalink award report block reply\nKaputtmacher 1 points 2 days ago Quite sad knowing these people never knew what hit them. permalink award report block reply\ndburt2 1 points 2 days ago I'm sure that the drugs dissipate quickly in seawater but I wonder if some of the sea life gets high? permalink award report block reply\ndoodaddy 1 points 2 days ago The rate seems to be increasing, so I guess it's not a deterrent.  Oh well.* I'm assuming these are actual baddies, which I feel 90% they are. permalink award report block reply\nPatriotSkorzeny 1 points 2 days ago Liberate NYC on the USMC’s 250th Birthday. 9/11. permalink award report block reply\nPrandogolio 1 points 2 days ago You'd think they would stop, but I guess the jungle beaners aren't very smart. permalink award report block reply FatigueIsReal 1 points 2 days ago Either die and probably have your family killed by refusing the cartel or take your chances on the open ocean. I'd take the boat out too. permalink parent award report block reply\nFatigueIsReal 1 points 2 days ago Either die and probably have your family killed by refusing the cartel or take your chances on the open ocean. I'd take the boat out too. permalink parent award report block reply\nRemember_the_Alamo 1 points 2 days ago Has any evidence washed up? permalink award report block reply 1True-translation 1 points 2 days ago I just caught a sae bsss that was so fuckin ready.... permalink parent award report block reply\n1True-translation 1 points 2 days ago I just caught a sae bsss that was so fuckin ready.... permalink parent award report block reply\nCaptainWinston 1 points 2 days ago How long before Pedro says No? permalink award report block reply\nJohanes 1 points 2 days ago Poor high speed fishermen 🤣 permalink award report block reply",
  "fetched_at": "2025-11-12T22:58:21.347664Z"
}