{
  "id": "1ARK58zWwr",
  "url": "https://patriots.win/p/1ARK58zWwr/ilhan-omar-says-she-doesnt-care-/c",
  "content": "285 Ilhan Omar says she doesn't care if she gets deported: \"I am grown, I can live wherever\" posted 4 days ago by hocuspocusfocusjeep 20 comments award share report block End Wokeness @EndWokeness • 4d Ilhan Omar says she doesn't care if she gets deported: \"I am grown, I can live wherever\"\n20 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MeMargie 15 points 4 days ago Freeze bank accounts of American tax dollars. permalink award report block reply equiv222 10 points 4 days ago GOOD RESPONSE. WHY DON'T YOU JUST GO AND BRING ...SAY.. A  MILLION OTHER SOMALI AMERICA HATERS WITH YOU! YESTERDAY ISN'T TOO SOON! permalink award report block reply Beelzy 10 points 4 days ago Bye Felicia. permalink award report block reply Greenhills 8 points 4 days ago You’ll know just how loyal she is to Somalia when she goes to Canada. permalink award report block reply Zadok 5 points 4 days ago She can run for office back in her homeland. permalink award report block reply RedFoxOnFire 7 points 4 days ago Her family was kicked out of Somalia because her father is a war criminal. permalink parent award report block reply TheJakeFroggy 5 points 4 days ago Haha, she thinks she's scoring gotcha points by making it seem like it wouldn't be a win to deport her because she doesn't care. Uh, no. Still fucking deport her anyways. permalink award report block reply MinnieWhittaker 5 points 4 days ago Look at that - we can agree on something! I also don't mind if she gets deported. permalink award report block reply Female 4 points 4 days ago super. feliz navidad or whatever permalink award report block reply Female 5 points 4 days ago Take your lice filled rancid head scarf with you permalink parent award report block reply UNfreeNewZealand 3 points 4 days ago I’m sure her white American husband will love living in Somalia.🤣🤣🤣 permalink award report block reply RagnarD 1 points 4 days ago Wait, she divorced her brother? permalink parent award report block reply BartzFFV 2 points 4 days ago Typical Black behavior no concept of long term consequences. permalink award report block reply Aggrieved03 2 points 4 days ago She's stolen millions and no one cares. permalink award report block reply SimaYi 2 points 4 days ago GO HOME. permalink award report block reply dres3 2 points 4 days ago Antarctica it is then. permalink award report block reply A_Colostomy_Bag 1 points 3 days ago She says that because she knows she won't be deported... unfortunately. permalink award report block reply keeman 1 points 4 days ago So that is one problem solved. permalink award report block reply benjovikenobi 1 points 4 days ago Either \"quality of life\" means nothing to these people (and they don't belong in America), or their IQ is too low to understand consequences (and they don't belong in civilized society). DEPORT. permalink award report block reply cannonfodder 1 points 4 days ago Good!  Leave please.  At once.  NOW!  Immediately! permalink award report block reply\nMeMargie 15 points 4 days ago Freeze bank accounts of American tax dollars. permalink award report block reply\nequiv222 10 points 4 days ago GOOD RESPONSE. WHY DON'T YOU JUST GO AND BRING ...SAY.. A  MILLION OTHER SOMALI AMERICA HATERS WITH YOU! YESTERDAY ISN'T TOO SOON! permalink award report block reply\nBeelzy 10 points 4 days ago Bye Felicia. permalink award report block reply\nGreenhills 8 points 4 days ago You’ll know just how loyal she is to Somalia when she goes to Canada. permalink award report block reply\nZadok 5 points 4 days ago She can run for office back in her homeland. permalink award report block reply RedFoxOnFire 7 points 4 days ago Her family was kicked out of Somalia because her father is a war criminal. permalink parent award report block reply\nRedFoxOnFire 7 points 4 days ago Her family was kicked out of Somalia because her father is a war criminal. permalink parent award report block reply\nTheJakeFroggy 5 points 4 days ago Haha, she thinks she's scoring gotcha points by making it seem like it wouldn't be a win to deport her because she doesn't care. Uh, no. Still fucking deport her anyways. permalink award report block reply\nMinnieWhittaker 5 points 4 days ago Look at that - we can agree on something! I also don't mind if she gets deported. permalink award report block reply\nFemale 4 points 4 days ago super. feliz navidad or whatever permalink award report block reply Female 5 points 4 days ago Take your lice filled rancid head scarf with you permalink parent award report block reply\nFemale 5 points 4 days ago Take your lice filled rancid head scarf with you permalink parent award report block reply\nUNfreeNewZealand 3 points 4 days ago I’m sure her white American husband will love living in Somalia.🤣🤣🤣 permalink award report block reply RagnarD 1 points 4 days ago Wait, she divorced her brother? permalink parent award report block reply\nRagnarD 1 points 4 days ago Wait, she divorced her brother? permalink parent award report block reply\nBartzFFV 2 points 4 days ago Typical Black behavior no concept of long term consequences. permalink award report block reply\nAggrieved03 2 points 4 days ago She's stolen millions and no one cares. permalink award report block reply\nSimaYi 2 points 4 days ago GO HOME. permalink award report block reply\ndres3 2 points 4 days ago Antarctica it is then. permalink award report block reply\nA_Colostomy_Bag 1 points 3 days ago She says that because she knows she won't be deported... unfortunately. permalink award report block reply\nkeeman 1 points 4 days ago So that is one problem solved. permalink award report block reply\nbenjovikenobi 1 points 4 days ago Either \"quality of life\" means nothing to these people (and they don't belong in America), or their IQ is too low to understand consequences (and they don't belong in civilized society). DEPORT. permalink award report block reply\ncannonfodder 1 points 4 days ago Good!  Leave please.  At once.  NOW!  Immediately! permalink award report block reply",
  "fetched_at": "2025-11-12T23:15:59.231053Z"
}