{
  "id": "1ARK9l8IBn",
  "url": "https://patriots.win/p/1ARK9l8IBn/there-was-an-entire-left-wing-te/c",
  "content": "355 \"There was an entire left wing terror cell operating in Berkley, California last night, but this kid gets arrested and kicked out of college for saying rude and offensive words to Dave Portnoy.\" posted 23 hours ago by bleeje 12 comments award share report block Owen Shroyer @OwenShroyer1776 • 1d There was an entire left wing terror cell operating in Berkley, California last night, but this kid gets arrested and kicked out of college for saying rude and offensive words to Dave Portnoy.\n12 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow Maganifice7 22 points 22 hours ago These are the colleges Trump is trying to save by allowing Chinese spies in the country. permalink award report block reply Moose_Antlers 2 points 13 hours ago Maybe we could save Congress by importing a few more Israeli operatives too? permalink parent award report block reply mlp67 16 points 23 hours ago What the fuck? Could you say \"Fuck White people \"? Would you still get arrested?? permalink award report block reply Pepe_longcockings 17 points 22 hours ago ‘Fuck white people’ is the only demographic you could possibly say that about without repercussion permalink parent award report block reply South_Florida_Guy 12 points 22 hours ago Sounds like a problem in need of fixing permalink parent award report block reply FusionBlack 13 points 23 hours ago What happened to the 1st ? permalink award report block reply ConfusedAngryArmed 2 points 15 hours ago It was subverted to protect certain people permalink parent award report block reply Harvestsmiles 12 points 22 hours ago Now if he took Dave's hat and punched him a few times before yelling \"You're bleeding white boy!\" dude probably would have gotten a pass... At least thats how it works for Antifa. Weird. permalink award report block reply BlackJack1776 11 points 21 hours ago Kid echoed the meme, \"Fuck the Jews\", which is specific to Portnoy. That's a news article by itself, so I'm not typing all that out. IYKYK. But, since it was derogatory towards Jews, of course he was arrested on the spot. The only surprising thing is that Pam Bondi didn't arrest him herself. permalink award report block reply Aggrieved03 11 points 22 hours ago Can't criticize that group, ever! permalink award report block reply South_Florida_Guy 10 points 22 hours ago Apparently there's a law in Mississippi that bans free speech, who knew? permalink award report block reply Porkchop-express 7 points 22 hours ago Did Dave pick up the coins? permalink award report block reply\nMaganifice7 22 points 22 hours ago These are the colleges Trump is trying to save by allowing Chinese spies in the country. permalink award report block reply Moose_Antlers 2 points 13 hours ago Maybe we could save Congress by importing a few more Israeli operatives too? permalink parent award report block reply\nMoose_Antlers 2 points 13 hours ago Maybe we could save Congress by importing a few more Israeli operatives too? permalink parent award report block reply\nmlp67 16 points 23 hours ago What the fuck? Could you say \"Fuck White people \"? Would you still get arrested?? permalink award report block reply Pepe_longcockings 17 points 22 hours ago ‘Fuck white people’ is the only demographic you could possibly say that about without repercussion permalink parent award report block reply South_Florida_Guy 12 points 22 hours ago Sounds like a problem in need of fixing permalink parent award report block reply\nPepe_longcockings 17 points 22 hours ago ‘Fuck white people’ is the only demographic you could possibly say that about without repercussion permalink parent award report block reply South_Florida_Guy 12 points 22 hours ago Sounds like a problem in need of fixing permalink parent award report block reply\nSouth_Florida_Guy 12 points 22 hours ago Sounds like a problem in need of fixing permalink parent award report block reply\nFusionBlack 13 points 23 hours ago What happened to the 1st ? permalink award report block reply ConfusedAngryArmed 2 points 15 hours ago It was subverted to protect certain people permalink parent award report block reply\nConfusedAngryArmed 2 points 15 hours ago It was subverted to protect certain people permalink parent award report block reply\nHarvestsmiles 12 points 22 hours ago Now if he took Dave's hat and punched him a few times before yelling \"You're bleeding white boy!\" dude probably would have gotten a pass... At least thats how it works for Antifa. Weird. permalink award report block reply\nBlackJack1776 11 points 21 hours ago Kid echoed the meme, \"Fuck the Jews\", which is specific to Portnoy. That's a news article by itself, so I'm not typing all that out. IYKYK. But, since it was derogatory towards Jews, of course he was arrested on the spot. The only surprising thing is that Pam Bondi didn't arrest him herself. permalink award report block reply\nAggrieved03 11 points 22 hours ago Can't criticize that group, ever! permalink award report block reply\nSouth_Florida_Guy 10 points 22 hours ago Apparently there's a law in Mississippi that bans free speech, who knew? permalink award report block reply\nPorkchop-express 7 points 22 hours ago Did Dave pick up the coins? permalink award report block reply",
  "fetched_at": "2025-11-12T20:40:30.990567Z"
}