{
  "id": "1ARK57rg7l",
  "url": "https://patriots.win/p/1ARK57rg7l/theintelscif-for-the-first-time-/c",
  "content": "319 @TheIntelSCIF: For the FIRST time, the DOJ has enough evidence to see this as ONE continuous operation and NOT isolated scandals.\n\nAll of the attacks on Trump were planned, coordinated, and executed by a network of criminals from WITHIN our own government. 🔥🏛️ MURDEROUS LEFT 🏛️🔥 posted 4 days ago by blue5707 13 comments award share report block The SCIF @TheIntelSCIF • 5d For the first time, the DOJ has enough evidence to see this as one continuous operation and NOT isolated scandals. All of the attacks on Trump were planned, coordinated, and executed by a network of criminals from WITHIN our own government.\n13 comments Sort by Top Top New Worst Old Save Shitsbrokeyo 6 points 4 days ago Let's not forget all the illegals and migrants. It's all part of the package. They imported an army to overwhelm the system, breed, fomment chaos and bankrupt America.  Being mostly men perhaps have other more military centric purposes. That's all there is to it. No different than Europe. permalink award report block reply RuleoVicus 3 points 4 days ago The 'War on Terror' was to upend the Middle East to flood Euro- centric counties with Muslims. We destabilize a country, then import their retards because \"muh refugees\" and if you complain you are 'Islamophobic'. Soetoro ramped it up for Europe itself with the astroturfed Twitter-CIA led 'Arab Spring' back in 2011 (a clever operation that helped cover up, well,  the Bengahzi operation). permalink parent award report block reply RuleoVicus 3 points 4 days ago \"for the first time\" No. This is 7 years after everything was already fully scoped out. Anyone reading TheConservativeTreehouse already, fucking, knew, everything, and, everyone. That's why I shit on anyone saying Blondie is taking time to \"build a case\". THE FUCKING CASE WAS BUILT SEVEN YEARS AGO! permalink award report block reply MrMcGreenGenes 3 points 4 days ago RICO the rat bastards! permalink award report block reply RuleoVicus 3 points 4 days ago Trump's AGs do nothing except protect the Deep State. You'll never see a RICO case. I'm just being brutally honest. permalink parent award report block reply BrewSwillis 1 points 4 days ago All of the attacks on Trump were planned, coordinated, and executed by a network of criminals from WITHIN our own government. Yeah, it's just called \"the government\". They are all in on it. You expect them to punish themselves?? It won't happen. Who punishes the people in charge, who won't punish themselves? permalink award report block reply Ryunnsun 1 points 4 days ago TWO MORE WEEKS? permalink award report block reply Comanche_Moon 1 points 4 days ago And no one has gone to jail yet. permalink award report block reply CleanUpPhillyTrump24 1 points 4 days ago So let's roll out the arrests and perp walks. permalink award report block reply LolitaExpressPilot 1 points 4 days ago Ok. So what are you gonna do about it? permalink award report block reply Nellie_the_Beaut 1 points 4 days ago This is why that crusty old demon Nancy Pelosi just suddenly announced she’s retiring and not seeking reelection next year.  She needs to leave NOW.  Either way, all her time in DC from now on needs to be taken up with interviews, depositions, answering subpoenas, court appearances, and giving statements to law enforcement and special investigators.  Let her spend all her ill-gotten stock money on lawyers and trying to stay out of prison.  Bring her daughter in and threaten to throw her in jail for 10 years as a co-conspirator - just like they did to General Flynn and Don and Eric Trump.  The Republicans need to start playing by the Democrat rules:  THE PROCESS IS THE PUNISHMENT. permalink award report block reply vfr2imc 1 points 4 days ago “First time”? Jesus they’re slow. Sundance laid this all out as it unfolded in term 1 permalink award report block reply\nShitsbrokeyo 6 points 4 days ago Let's not forget all the illegals and migrants. It's all part of the package. They imported an army to overwhelm the system, breed, fomment chaos and bankrupt America.  Being mostly men perhaps have other more military centric purposes. That's all there is to it. No different than Europe. permalink award report block reply RuleoVicus 3 points 4 days ago The 'War on Terror' was to upend the Middle East to flood Euro- centric counties with Muslims. We destabilize a country, then import their retards because \"muh refugees\" and if you complain you are 'Islamophobic'. Soetoro ramped it up for Europe itself with the astroturfed Twitter-CIA led 'Arab Spring' back in 2011 (a clever operation that helped cover up, well,  the Bengahzi operation). permalink parent award report block reply\nRuleoVicus 3 points 4 days ago The 'War on Terror' was to upend the Middle East to flood Euro- centric counties with Muslims. We destabilize a country, then import their retards because \"muh refugees\" and if you complain you are 'Islamophobic'. Soetoro ramped it up for Europe itself with the astroturfed Twitter-CIA led 'Arab Spring' back in 2011 (a clever operation that helped cover up, well,  the Bengahzi operation). permalink parent award report block reply\nRuleoVicus 3 points 4 days ago \"for the first time\" No. This is 7 years after everything was already fully scoped out. Anyone reading TheConservativeTreehouse already, fucking, knew, everything, and, everyone. That's why I shit on anyone saying Blondie is taking time to \"build a case\". THE FUCKING CASE WAS BUILT SEVEN YEARS AGO! permalink award report block reply\nMrMcGreenGenes 3 points 4 days ago RICO the rat bastards! permalink award report block reply RuleoVicus 3 points 4 days ago Trump's AGs do nothing except protect the Deep State. You'll never see a RICO case. I'm just being brutally honest. permalink parent award report block reply\nRuleoVicus 3 points 4 days ago Trump's AGs do nothing except protect the Deep State. You'll never see a RICO case. I'm just being brutally honest. permalink parent award report block reply\nBrewSwillis 1 points 4 days ago All of the attacks on Trump were planned, coordinated, and executed by a network of criminals from WITHIN our own government. Yeah, it's just called \"the government\". They are all in on it. You expect them to punish themselves?? It won't happen. Who punishes the people in charge, who won't punish themselves? permalink award report block reply\nRyunnsun 1 points 4 days ago TWO MORE WEEKS? permalink award report block reply\nComanche_Moon 1 points 4 days ago And no one has gone to jail yet. permalink award report block reply\nCleanUpPhillyTrump24 1 points 4 days ago So let's roll out the arrests and perp walks. permalink award report block reply\nLolitaExpressPilot 1 points 4 days ago Ok. So what are you gonna do about it? permalink award report block reply\nNellie_the_Beaut 1 points 4 days ago This is why that crusty old demon Nancy Pelosi just suddenly announced she’s retiring and not seeking reelection next year.  She needs to leave NOW.  Either way, all her time in DC from now on needs to be taken up with interviews, depositions, answering subpoenas, court appearances, and giving statements to law enforcement and special investigators.  Let her spend all her ill-gotten stock money on lawyers and trying to stay out of prison.  Bring her daughter in and threaten to throw her in jail for 10 years as a co-conspirator - just like they did to General Flynn and Don and Eric Trump.  The Republicans need to start playing by the Democrat rules:  THE PROCESS IS THE PUNISHMENT. permalink award report block reply\nvfr2imc 1 points 4 days ago “First time”? Jesus they’re slow. Sundance laid this all out as it unfolded in term 1 permalink award report block reply",
  "fetched_at": "2025-11-12T21:08:03.302563Z"
}