{
  "id": "8183029",
  "title": "14495,000,000 homeschoolers (and counting...)posted1 day agobybasedboston174 commentsawardsharerepor",
  "url": "https://patriots.win/p/1ARK9l6ugD/5000000-homeschoolers-and-counti/c",
  "content": "1449 5,000,000 homeschoolers (and counting...) posted 1 day ago by basedboston 174 comments award share report block Red Pill Dispenser @redpilldispensr • 1d \"In the 1970s, there were about 13,000 homeschoolers.\" \"In the 80s, there were 200,000 homeschoolers. The 90s, 850,000.\" \"And so far, four or five years into the 2020s, there's over 5 million homeschoolers.\" \"And that number is rising.\"\n174 comments Sort by Top Top New Worst Old Save wartooth6 82 points 1 day ago I'm doing my part! permalink award report block reply MAGAPlenty 27 points 1 day ago (Would you like to know more?) YES I DO permalink parent award report block reply lothrop_evola 27 points 1 day ago Not OP, but I live in Toronto with 3 kids and my wife homeschools because she enjoys it ( when they're in a good mood, which isn't always). I support it 100% because our local schools are run by literal faggots who once put a picture of a pregnant man to indoctrinate the kids. permalink parent award report block reply imnotdeadyet 18 points 24 hours ago The funny thing is, you talk to people that home school and they only need to teach for an hour or two to cover the material the school system needs 6 or 7 hours to teach.  That gives the kids more free time to read or two other creative things. permalink parent award report block reply lothrop_evola 9 points 23 hours ago Absolutely. My wife is usually finished teaching by lunchtime and the afternoon is free to do other things permalink parent award report block reply view 1 more comments... Constantin2024 9 points 22 hours ago The reason why the schools take so long to teach anything is because they spend upwards of 80% of their time dealing with discipline problems from disruptive future criminals. And at the end of the day, when kids haven't learned anything, the teachers send all the work home with them so their parents can do it anyway. permalink parent award report block reply view 5 more comments... borisborscht 4 points 21 hours ago But then you might realize the school was wasting the kids time year after year reteaching the same material with a few more levels.  And they were wasting time teaching irrelevant material and skipping things that are important. permalink parent award report block reply MAGABOND 1 points 16 hours ago Not only do they take fucking 7 to 8 hours, but they also send your kid home with homework. Like, you utter incompetent faggots can’t do your job well enough at your indoctrination factory in the time allotted that you have to dip into my family time? You want me to do your job anyway? What’s the fucking point? permalink parent award report block reply view 1 more comments... Remember_the_Alamo 1 points 18 hours ago How so? permalink parent award report block reply FusionBlack 1 points 17 hours ago Good for you. God bless you and your family. permalink parent award report block reply Scumbag-reddit 4 points 24 hours ago +2 here as well permalink parent award report block reply BeauHD 3 points 1 day ago How many kids? What's your location? So excited for you, man! permalink parent award report block reply barwhack 12 points 1 day ago Would YOU answer this doxxy question? permalink parent award report block reply Deportthemall23 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply barwhack 8 points 1 day ago Raising your kids as your kids , is the point. Even against society, if needs be. That's what Principles are: they are First, before all else. permalink parent award report block reply view 1 more comments... wartooth6 5 points 1 day ago 15 in Greenland?... Lol those are some oddly specific questions permalink parent award report block reply BeauHD 1 points 21 hours ago What part? permalink parent award report block reply MAGABOND 2 points 16 hours ago I’m doing my part. My kid is far happier, and far less anxious than I was at his age. permalink parent award report block reply kornesque 2 points 22 hours ago Best decision we ever made. permalink parent award report block reply gorilla_grip 54 points 1 day ago I was homeschooled in the 1980’s for a couple years. The state of Washington fought us tooth and nail they hated homeschooling.  Less government indoctrination. Homeschooling shows how easy school is for the most part, that one could do all the required work in 9 weeks or less, not 9 months. permalink award report block reply Bidensmellslikepiss 72 points 1 day ago If you send your kids to public school, they'll move at the same pace as the most retarded kid in the room - which is the teacher 90% of the time. Edit: which is a shame. Elementary school teachers used to be grade A wife material. permalink parent award report block reply 24601 34 points 1 day ago Elementary school teachers used to be grade A wife material. That's because they were wives, and mothers, before they were teachers. permalink parent award report block reply TheSwampThang 25 points 1 day ago Because being a good mother is  inherently being a good teacher permalink parent award report block reply Jack_NC 14 points 1 day ago inversely, it's also why so many \"early childhood education/development specialists\" are full of stupid ideas -- they are childless unmarried women with no experience, just repeating what they have read in books written by other barren women. permalink parent award report block reply view 4 more comments... basedboston OP 6 points 1 day ago You should have to be a mother to be a teacher. Ideally, kids grown up and out of the house. (Same with fathers as teachers). permalink parent award report block reply view 1 more comments... covok48 7 points 1 day ago Used to be. Now they are pedo retards. permalink parent award report block reply gorilla_grip 5 points 1 day ago I remember having small crushes on a couple elementary school teachers and they both got married while I was a kid. They were 100% wife material.  Now they have blue hair and septum piercings and go to no kings protests and probably have only fans pages permalink parent award report block reply LogicCircuits 4 points 1 day ago lolwut, all my elementary teachers were old biddies, except my 2nd grade teacher permalink parent award report block reply bejeavis 2 points 1 day ago which is the teacher 90% of the time based and accurate permalink parent award report block reply load 1 more comments... 2008RonPaul2012 39 points 1 day ago 4 kids in elementary and younger, in rural north GA. Numbers are exploding, frens. If you give your children to Caesar, don't be surprised when they come back as Romans. permalink award report block reply Perseverant 25 points 1 day ago \"I came, I saw, I dyed my hair blue and I'm trans now and don't misgender me.\" ~ Julius Caexir permalink parent award report block reply AccipiterQ 1 points 23 hours ago KEK<---- this one.\nKEK\nKEK\nKEK permalink parent award report block reply HeavyMetalPatriot 2 points 23 hours ago Patriots MUST homeschool permalink parent award report block reply CanadianMeathead 30 points 1 day ago Canadian home schooler here. My kids are kick ass smart too. permalink award report block reply covok48 20 points 1 day ago Surprised they haven’t made that illegal yet. permalink parent award report block reply CanadianMeathead 19 points 1 day ago They are trying. permalink parent award report block reply Caine 23 points 1 day ago I should have homeschooled all three of mine. Even in a red state in a deep red county, the leftist influence in education is too pervasive. permalink award report block reply Brookes 20 points 1 day ago Our grandkids are all homeschooled.  Our oldest son originally had them in public school then saw what they were not learning and pulled them out.  The kids are light years ahead of other kids in the same grade levels. Just after one year of homeschool. Our daughter in law takes them on field trips every week to some cool places that are educational along with being fun for all of them. I’m so impressed with the job she does with them.  She follows a curriculum that is very advanced.  Since we moved to Arizona I’m bummed that nana here can’t go with them.  They live in Utah. But the entire herd of kids and grandchildren are coming here for Christmas! Happy old lady pede will be cooking non stop!  We are taking the kids to the Desert Museum for a field trip! permalink award report block reply TwoArizonaPedes 8 points 1 day ago Woohoo! permalink parent award report block reply Michalusmichalus 5 points 1 day ago The state of MD traps kids in public school intentionally. They do not have kids at grade level, but by law as soon as parents disenroll their kids from public school if the child is not at grade level the parent goes to jail. There is no time given to get the kids to grade level. Even if the parent wants to disenroll the child for this reason. I learned this when my son who was in 8th grade at the time was diagnosed with dyslexia. This is why you see school districts like Baltimore where none of the kids are passing, but the parents still send them to school. Unless the child is sent to private school, or moves out of the state of MD the parent is held accountable immediately for the child's educational deficiency. permalink parent award report block reply ChinchillaCapitalism 6 points 20 hours ago Government schools can make it so your child is functionally illiterate while taxing you into poverty to pay for the privilege. Meanwhile, you'll go to jail for not meeting the same arbitrary standard they've never met themselves. Anarcho-tyranny. permalink parent award report block reply Brookes 2 points 23 hours ago That’s insane, but everything the left does is freaking insane. permalink parent award report block reply AccipiterQ 1 points 23 hours ago leave the state. permalink parent award report block reply Michalusmichalus 1 points 18 hours ago So many people want to, trust me. permalink parent award report block reply Aquamine-Amarine 4 points 1 day ago That sounds lovely. I would do something similiar, take them on field trips to museums, aquariums, local parks, etc. Is she teaching them any languages? Best time to start is when they're young, their brains are sponges! I told my brother to teach my niece our native language and he made some dumb excuse saying he didn't want to confuse her since she was lagging behind in other areas. She started school this year. Very worried about the poison teachers will try putting into her head. permalink parent award report block reply Brookes 2 points 1 day ago Yes they are learning Italian lol! Our huge ass family is obviously Italian and we visit family in Italy frequently.  The little stinkers already speak it better than most adults in our family. permalink parent award report block reply Quixotic -11 points 1 day ago You shouldn’t have moved away from your grandkids. Shame on you. permalink parent award report block reply Brookes 1 points 1 day ago Dude, we moved out of California!  The kids had already left California for Utah, Texas and Arizona. The ones in Arizona are three hours from us.  We see them all the time. We’re retired and hop in the RV and visit them all the time.  Or they come to us for long visits. We actually see them more now than when we lived in California! We are a very close family.  There’s zero shame here.  Who are you to judge? permalink parent award report block reply Quixotic -2 points 22 hours ago You should move to Utah near them and actually support them with your presence instead of just when it’s fun for you, boomer. permalink parent award report block reply Brookes 1 points 22 hours ago What about the ones in Texas and Arizona? Should we live 3 months in each state? We have always been there for our kids and their kids. You have zero clue what you’re talking about. You have no right to judge us.  Our family is healthy and happy.  You have been awfully judgmental about someone’s life you know nothing about.  Perhaps mind your own family kid before you make ridiculous comments about mine. permalink parent award report block reply MoreGuns 17 points 1 day ago I hope most kids end up homeschooled and public education completely collapses. The liberal tears when thousands of Communist DEI trans antifa indoctrination centers close and these \"teachers\" are left with nothing will be glorious permalink award report block reply fskfsk 16 points 1 day ago That is impressive.  The hard part is having one parent stay home to supervise the kid. permalink award report block reply MasterChief08 20 points 1 day ago There's homeschooling groups nowadays. You take turns with groups of families that can range from 3 to 20. You can also find retired engineers, nurses, etc. who will help out once the kids get into their teens and need more advanced STEM. permalink parent award report block reply TwoArizonaPedes 17 points 1 day ago A friend of mine teaches math and science to homeschooling pods and makes a killing just doing that part time. permalink parent award report block reply fskfsk 3 points 1 day ago How much can you make?  I can teach Math + CS well enough, but would it pay as much as my regular job? permalink parent award report block reply TwoArizonaPedes 7 points 1 day ago I think it would depend on the group size. He teaches small groups of up to 8 kids high school math & science and he has a bachelor's degree in math (a real degree, not one of today's \"degrees\"). I don't know the specific amount he charges but I know he only works 10-15 hours a week and he's making money hand over fist. He teaches on site but he's also done Zoom in the past, I think for one-on-one tutoring. He's not a guy to sit behind a desk all day so he loves the variety and working only part time. permalink parent award report block reply CommanderOfCheese 3 points 1 day ago This highlights everything wrong with our education system. None of our credentials teachers actually know anything. How can you expect them to be able to teach jack shit when they don't actually know anything? Meanwhile the people who actually do know something don't get to teach within the system. permalink parent award report block reply Madnote1984 18 points 1 day ago This is the struggle for my wife and I. We homeschool 4. Essentially, I am working poor. I have very low debt, a very low mortgage and our newest car is 10 years old. We get zero government assistance even though I carry 6 people in my household. I also still manage to make enough to pay taxes. No boat, no vacations. I had a leak in the guest bathroom last winter that went on for quite a while. Had to rip out the vanity and a ton of the drywall. Still haven't fixed it, because too broke...and I have another bathroom. That said, my wife has taught all of my kids to read early. I've got one that just turned 7 who reads on an 8th grade level and will be completing first and second grade by spring. So, those kinds of things make it worth every penny of lost income. I'm kind of resigned to being poor at this point, (at least until 401k time) but hopefully my kids will have a chance to do better than me. Unless the commies collapse the country. permalink parent award report block reply AccipiterQ 3 points 23 hours ago Absolutely agree, what you are doing is the proper way.  It's about your kids and their wellbeing. You're rich in that regard. permalink parent award report block reply ChinchillaCapitalism 2 points 20 hours ago You're richer in ways that most \"well-off\" families can't imagine. You get to see your kids grow up and be a part of it as opposed to seeing them for a few hours between daycare and bedtime. You'll never have to worry about them being assaulted, drugged, or brainwashed and gender mutilated at a government school. You'll get to have experiences that matter and know your actions have an eternal impact, that your values will be passed on. That's worth a lot more than any shiny toys/worldly distractions that money can buy. permalink parent award report block reply Madnote1984 3 points 20 hours ago Absolutely my fren. Thanks for the encouragement. permalink parent award report block reply electricboogaloo 13 points 1 day ago My wife stays home with our soon to be 3 kids. What I recommend to young men trying to find a path to their (future) wife staying home with the kids: Resist common vices as early as possible: video games, porn, gambling, drugs, drinking, etc Marry a woman who cooks/cleans/works hard/is frugal, and doesn’t need an Instagram-worthy life to be happy. Don’t “fall” in love with just anyone, intentionally find the right person. Work hard/smart to maximize income early. Don’t waste your 20s coasting/vacationing. Don’t take out massive student loans. College may not even be necessary. Teach yourself everything possible. Live way below your means even when you’re way ahead. Never hold a credit card balance, buy used cars, don’t buy too much house, be frugal. Buy 2nd hand, do research, and price shop. Save money to create financial flexibility. Pay for practical, long-term value. Let go of ego. Get rich slowly. Embrace hard work, pain, and discipline. permalink parent award report block reply exarch 6 points 1 day ago That’s great advice for a young man, but I fear there are very few women who are marriage-worthy these days. What we need is some way to reach them and influence them to live right. Because as soon as they start “dating” (read: engaging in promiscuity) they are on a path that they can’t come back from. permalink parent award report block reply MediaBro 2 points 22 hours ago I did some of these things but Covid destroyed it all. I'm trying on rebuilding now but the economy sucks donkeys arse currently. permalink parent award report block reply electricboogaloo 3 points 18 hours ago I don’t have a college degree and I battle a lifelong terminal illness. I manage a client-facing, technical team of 20 people. I interview people frequently. Many guys I interview or pass over for promotions fail in 3 areas: They fail to relate to people. The bar is so low here that it makes you stand out in dating and at work if you can relate to people. Smile, take an interest in what makes a person tick, stop caring about what anyone thinks, and just talk. It’s not a chess game, it’s just a conversation. Many men avoid this skill, but it will take you very far. They fail at the mundane stuff. Show up on time, prepared, and with a good attitude. Go the extra mile to do the job the right way every time even if it’s painful. Reply to an email on time without anyone telling you. Apply basic common sense to a problem. Don’t bitch about a problem, find a solution. Own your tasks and don’t make excuses. If you can own the mundane things then you will earn trust and be given more responsibility. There’s a very serious leadership vacuum in this world, but nobody will make you a leader if they can’t 100% trust you. They give up when they encounter roadblocks. It’s very rare there isn’t a way around. You don’t need to be smart, strong, talented, or well connected to do these things. These are universal skillsets that are scarce in today’s world, particularly post-COVID. Persist and you can work your way up anywhere, in any economy. permalink parent award report block reply MediaBro 1 points 15 hours ago Dayum, that's definitely inspiring. permalink parent award report block reply Geocav 15 points 1 day ago That's how we did it, it's the best investment that you can make. permalink award report block reply FLpalmtrees 2 points 22 hours ago Same here, and I completely agree! permalink parent award report block reply learntocode 14 points 1 day ago If I could go back and do it again, homeschool all the way. permalink award report block reply FloridaGirl 13 points 1 day ago Got two in my home. The homeschool homecoming my high schooler attended last week had a max capacity of 330 students. There was a waitlist for tickets. But tell me again how they are \"unsocialized.\" permalink award report block reply Michalusmichalus 2 points 1 day ago My kids went on field trips with home school pods. I was the only adult they allowed their kids to be supervised by. permalink parent award report block reply covok48 13 points 1 day ago Elementary schools are shutting down in the DFW area because all the White kids are being pulled out and being homeschooled. It is glorious. permalink award report block reply bejeavis 5 points 1 day ago We need social distancing muh COVID! Wait, not like that! permalink parent award report block reply Jack_NC 12 points 1 day ago In the 70s, it was against the law in most places -- \"homeschooling\" your children was risking arrest and having your children taken away by The State. Bravo to those who went before us. Same to those who follow. The greatest thing about Homeschooling is the unspoken lesson to the children that they own their own lives. NO ONE gets to compel you to wake at a specific hour, obey a teacher, ask for permission to use a toilet or speak, etc. permalink award report block reply Quixotic -5 points 1 day ago That might be the dumbest list of “benefits.” You think everyone should just open their mouth and start speaking whenever they feel like it? You don’t think that social group settings should have norms/order? permalink parent award report block reply Jack_NC 5 points 1 day ago That's the foundation to adopting the mindset of a slave -- surrendering authority over your life to someone who doesn't have your best interests at heart. I'll put you down as \"disagree.\" edit: the other side of this is that the family owns it's time. The family doesn't have to postpone that trip to grandma's house because the school \"doesn't allow it\". We don't have to hurry through a holiday, or ask permission to study a subject more deeply, or spontaneously spend a day with a blacksmith or glass blower or cabinetmaker so the kids can learn to make something useful. (three activities my kids actually did and enjoyed immensely). They also were able to learn subjects that are useful. History and geography, not \"social studies.\" Mathematics books from the 1950s where every page isn't full of rainbow math, cartoons and stories. Literature and Grammar, not \"language arts\". And real literature, not a bunch of queer-biased propaganda and frankly, lies, from teachers with agendas. They could learn, and play, on their schedule. We also covered lessons in how to start and run a business (which they did), invest, banking, home and auto repair, etc. Practical real-life skills that are no longer taught in a school. But most importantly, the greatest value is seeing them aspire to be adults, learn the skills they need to be self-sufficient. permalink parent award report block reply AccipiterQ 2 points 23 hours ago What math books from the 50s? We may be following down your path... permalink parent award report block reply Jack_NC 1 points 20 hours ago We bought a set off ebay way back when -- it's been 30 years so they are long gone and I don't recall the specifics but if we had to do it again today, Saxon Math would be the choice. permalink parent award report block reply view 1 more comments... Quixotic 0 points 22 hours ago I’m all for homeschooling - but not lazy, go-out-in-public-in-your-pajamas homeschooling. Society requires order. When you’re teaching your kids at home, do you let them all ask you questions simultaneously? Do you pause the lessons and make everyone wait while they go to the bathroom? Or do you impose a structure so that they learn how to behave like productive citizens? permalink parent award report block reply Jack_NC 2 points 20 hours ago Of course etiquette and manners are part of daily life. Why would it be otherwise? And yes, if my child said \"excuse me, I need to use the restroom\" of course we would pause. That is called courtesy and respect . I know you're trying to imagine a chaotic free-for-all situation where no-one learns a thing and the parents are lazy; and indeed there may be some homeschool arrangements like that. But we were responsible and dedicated a lot of energy into ensuring our kids were learning whether in a classroom type setting or hands-on, or taking instruction from others such as a blacksmith or glass blower or cabinetmaker. We made it work for us, and every family has the freedom to adopt an arrangement that works for their specific needs. permalink parent award report block reply Repentnow 4 points 1 day ago You don’t think that social group settings should have norms/order? Spoken as a closet authoritarian. Believe It or not, people can actually regulate themselves without an authority figure standing over them. permalink parent award report block reply Michalusmichalus 3 points 1 day ago Did you know the reason high school kids go to school before middle schoolers, and elementary school kids is specifically so they get home first to be able to babysit younger siblings? Even though the teenage brain would do better waking up later. permalink parent award report block reply Quixotic 0 points 22 hours ago Just because you make up a reason doesn’t make it true. The reason is actually because of bus schedules. permalink parent award report block reply Michalusmichalus 1 points 18 hours ago You're an idiot. The same buses can just reverse the age order. It has been a known issue, look up when high school kids should be sleeping, and the answers are in the studies. It was a big deal when I was in hs. permalink parent award report block reply view 2 more comments... t-bone 11 points 1 day ago Insert rookie numbers meme here permalink award report block reply KnoxHarrington 10 points 1 day ago Got me a whole brood of homeschoolers back on the homefront.  Smarter and more well-adjusted than 90% of public schoolers. My nearly 8 year old may not know anything about Taylor Swift or Kpop Demon Hunters, but she knows who Diocletian, Frederick the Great, and the Apostles are. permalink award report block reply GA_Logic 10 points 1 day ago 5 million home schooled children is a big deal.  It means that a good percentage of the population is resistant to mass media psy ops programming if we look into the near future. permalink award report block reply IllIllIll 9 points 1 day ago And yet my property taxes go up by record amounts every year! permalink award report block reply Get_Off_Big_Tech 12 points 1 day ago Gotta babysit all those illegals and grown women with useless degrees. permalink parent award report block reply Repentnow 3 points 1 day ago Over 25% of the Texas state-wide school system is ESL. Some districts are near 100% ESL. SCOTUS has said that every illegal child must be accepted into public school. permalink parent award report block reply ElectionMeddler 8 points 1 day ago I hope it keeps growing!  Homeschool curriculum is easy to get these days and there is a great community of parents to help.  Teaching your kids with your morals and protecting them from predators is a true gift.  Public schools are dumbing down the nation and you risk losing your kids to the liberal disease. It's still a sacrifice to be an effective home schooling family but it's well worth it! permalink award report block reply TrustYourself 7 points 1 day ago I was homeschooled in the late 90s and it was seen as weird then.  I put myself through college so i didn't have time to be brainwashed, after and retired at 42/ semi.     I never forget what a bullet I dodged. permalink award report block reply MasterChief08 6 points 1 day ago 12% go to private school and 5% are homeschooling. Unfortunately that still leaves 83% getting leftwing indoctrination where they're taught Nelson Mandela was a hero and Joseph McCarthy was a villain. permalink award report block reply Froynlavenfroynlaven 3 points 1 day ago At least 83%.  Many private schools are trash also. permalink parent award report block reply lawlady1776 6 points 1 day ago Homeschooling 4 grandchildren. With 3 more in the pipe! permalink award report block reply Smurfection 6 points 1 day ago This is the best option.  Raising kids at home teaching them your religion, your values and real skills along with all the knowledge the world has to offer which mostly the best of western civilization.  Not a single groomer to twist their minds.  Not a mythical horror scenario to scare them about Climate change.  .  No bullies.  No social stigma. No fads and \"everyone is doing it\" pressure. Here's my observations of homeschooled kids: They get along with all people of all generations.  I never seen a homeschool treat a younger kid like a pariah.  I've never seen a homeschool kids act \"awkward\" teenager around adults. Homeschoolers take their role in the family seriously.  They help out when needed and take responsibility for the whole family according to their development level. I dunno isn't a reply a homeschooler makes when asked a question, neither is nothin'.  Their curiosity, love of learning and wonder of the world isn't beaten out of them by lecturing teachers, factory style schools and concern for social status among peers. They are self motivated.  They are more focused.  They don't need constant validation.  A job well done a new skill acquired and mastered is reward enough. permalink award report block reply Dev404 4 points 1 day ago Your kids aren't learning much in school beyond feminist propaganda which is mostly fuck white people, fuck men, fuck America, God is for imbeciles, Allah is okay because the oppressed muslims like him, and be gay - like really, really gay and as degenerate as possible, and don't tell your parents. That's the public school curriculum from kindergarten to high school. Then from college, it's be a whore, kill your baby, demand welfare, obey the government, and don't ask questions. That's our entire \"education\" system that's funded by the government who steals that money from us. permalink award report block reply Repentnow 2 points 1 day ago Who downvoted you? permalink parent award report block reply Eyer0ll 4 points 1 day ago Finally some good news this week permalink award report block reply Mikehayes43 4 points 1 day ago Started our son two weeks ago.  Do not regret a minute of it permalink award report block reply jonzor82 4 points 24 hours ago Maybe if we could get affordability back and not rely on a two-person income for a domestic life. permalink award report block reply Constantin2024 4 points 22 hours ago I will be homeschooling my two (so far) grandchildren as soon as they get old enough. I am their full time caregiver while their parents work. We live in a multi-generational home and are returning to more traditional family values and living. permalink award report block reply PastorCharles 3 points 1 day ago Just, please, if you're going to do it, DO IT WELL. Take it seriously. Plan. Borrow good ideas from a curriculum. No, your child shouldn't lead everything. No, they shouldn't decide what they're going to learn. That's what you are here for. They don't know what's important enough to know and what can be safely ignored. Home school is awesome. I'm doing it now. The \"unschool\" movement, though, is awful. It's moms giving themselves an excuse to not teach anything in the name of independence. permalink award report block reply ForgottenUsername 3 points 22 hours ago And all 5 million of them are getting screwed on taxes for a product they aren't using.   The best way to kill public school would be to remove tax liability from home schoolers and people using private school, or maybe even people without children. Which seems more fair, but I don't really want to further discourage birthrate permalink award report block reply Yz450f 3 points 1 day ago My experience with my child’s public school is the teachers never teach, but send the child home with ridiculous amounts of homework. Since they never teach, the parents must do it anyway. Then the teacher is off work at least 25% of the time with a random substitute teacher. Then there are the ridiculous amounts of half days and days off. The parents that can’t teach their children or donate want to will just get their children diagnosed with a learning disability. Once a child has a diagnosed learning disability the school gives up on that child. They get an automatic passing grade and they don’t have to do anything. Those children don’t affect the school’s ratings. If you plan to have children, just expect to homeschool. You are going to teach them anyway because the teachers won’t. permalink award report block reply Itaintall 3 points 22 hours ago We homeschooled all of our kids; best decision we ever made. permalink award report block reply Unboosted 3 points 1 day ago Can we get a tax break yet? permalink award report block reply Jack_NC 1 points 20 hours ago Pfffft. No way. Someone's gotta pay for the government daycare (aka \"public school\"). permalink parent award report block reply TrumpOrTreason 3 points 23 hours ago There should be absolutley ZERO money going to public schools for students who are homeschooled. Any money that a public school is getting for student's in their district who don't attend public schools, should be paid directly to the parents doing the home schooling. We need to CUT OFF the left's funding. I will be writing expose reports for California documenting who and how much money is going from Calpers, Teachers Unions and other govt. entities directly to Democrat candidates, campaigns and committees. permalink award report block reply CastrosLittleBastard 3 points 1 day ago My kids thanked me for homeschooling them.  I would do it again, and if I live long enough to enjoy grandkids, I would homeschool them too! permalink award report block reply Snek_Plissken 2 points 1 day ago I wonder why? Could it be the education system has been ruined? permalink award report block reply AccipiterQ 2 points 23 hours ago We moved to new hampshire, from MA. If we had stayed in MA we'd be home schooling.  There is a based charter school in our town that we are probably going to go with.  One of the teachers actually got fired from another district for being \"too conservative\".  Anyway, what we found interesting is that since moving here, we have found TONS of home school families in our daughter's play groups.  Not like one or two, but over a dozen. permalink award report block reply Shitsbrokeyo 2 points 1 day ago Good. We need strong leadership. Public school is skipping 30% of the kids permalink award report block reply NonbinaryPotatohead 2 points 1 day ago You NEVER get the time nor the chance to raise your kids again. Remember that! permalink award report block reply DCYR66 2 points 1 day ago Can’t blame them. Government schools are indoctrinating kids. permalink award report block reply Rango 2 points 20 hours ago Does any of your tax go to pay for education? Does it go down proportionally due to opting out for homeschooling? permalink award report block reply ncswicn 2 points 1 day ago 🎉 Wonderful! One of the best decisions I ever made was to homeschool. Go Parents!  🎉 permalink award report block reply Babyfaceposey 2 points 22 hours ago Wife and I were just discussing this for our soon to be grandson. permalink award report block reply Jesse3000 1 points 19 hours ago Don't have any kids left to home school but I can say \"thank God\". permalink award report block reply pepewarrior0102 1 points 1 day ago We shouldn't have to retreat though. Take back the schools. permalink award report block reply Repentnow 3 points 1 day ago Public education is a historical anomaly. It's unnatural. It's a complete abdication of parenting.  It doesn't need \"taken back\", it needs dismantled. permalink parent award report block reply Grond999 1 points 21 hours ago Homeschool vs Tiktok. Tiktok (social media) leftist feminist algorithms will win in many cases...sadly. permalink award report block reply Spicy_cat 1 points 19 hours ago Always vote against funding government schools permalink award report block reply True_Curmudgeon 1 points 18 hours ago Homeschooled in the 90s checking in permalink award report block reply RFwolf5 1 points 1 day ago And they still collect your property tax for eduction and they dont care. permalink award report block reply Dr_Phil 1 points 17 hours ago OP was homeschooled 🤣😂🫵 permalink award report block reply carpetxparmesan 1 points 19 hours ago That's nice, now let's see Paul Allen's 1890s stats. permalink award report block reply borisborscht 1 points 21 hours ago I bet the kids today will all homeschool when they realize what they could have had permalink award report block reply DEPORT50M 1 points 4 hours ago Yeah but wait till you find out how many are Muslims that shouldn't be in this country permalink award report block reply cardinaldrones 1 points 14 hours ago It’s not because of parents of willingness to homeschool.   It’s because the public schools and most areas have gotten so black and Hispanic that there’s nowhere else to go.   That’s why school choice in the south is becoming a more popular thing and there’s charters popping up everywhere.   no amount of money will fix public schools after their past the racial tipping point.  So Florida realized that and decided to give parents vouchers for stage spending on education and pick whatever school they want to go to.  You can put it towards a private school and end up paying a lot less.   or you could put it into a charter school where they have work requirements or donation requirements from the parents that most black parents wouldn’t touch with a 10 foot pole. permalink award report block reply Remember_the_Alamo 1 points 18 hours ago Finally some good news! permalink award report block reply hillaryforprison 1 points 1 day ago yet we still have to pay the same or more in taxes to fund these cult indoctrination camps. Shut them down! permalink award report block reply NoSteppyonmyPepe 1 points 22 hours ago Good! These days,  everyone should homeschool.  Leaving your most precious possessions with strangers in a field full of predators and indoctrination is just crazy. permalink award report block reply Bob_sacamanao 1 points 13 hours ago Pedophiles and pro fag-atry employees  have infested the public school system and public colleges! permalink award report block reply TooBright 1 points 1 day ago Should be mental asylum numbers like that. permalink award report block reply bluewhiteandred 1 points 24 hours ago homeschool is cool but like... if homeschoolers could join together with like homeschool co-ops, this is like private schooling with extra steps (homeschooling as a form of home private school) We need privatized public schooling and a ban on government public schooling permalink award report block reply Billbuttlickerr 1 points 23 hours ago In CT homeschooling is drawing criticism because some ghetto bitch signed her child up to be homeschooled then murdered her and hid her body in a bin. The mom used homeschooling tactically to not report the child’s whereabouts to certain agencies if I remember correctly. permalink award report block reply PeterThielAntiChrist 0 points 16 hours ago Homeschooled girls are more fucked up and suck better dick than catholic school girls. Its wild. Thanks homschool parents: i can't get hard with women my age anyway. permalink award report block reply 0illuminated1 0 points 24 hours ago People who trust their children with strangers don't have love for their children. permalink award report block reply Dr_Phil 0 points 17 hours ago You're retarded if you genuinely believe homeschooling is a good idea. permalink award report block reply bumpman -6 points 1 day ago Homeschooling is not based or even political, it just isn’t. Also, while there are bad Apple teachers I think school is overall a right place for kids, & is beneficial for learning and socializing permalink award report block reply Repentnow 3 points 1 day ago If your children are in public school, you are merely a legal custodian, not a parent. permalink parent award report block reply bumpman 0 points 21 hours ago If your children are homeschooled, you might be their parent, teacher, mentor and maybe their only friend. It could be a rude awakening for them and you when becomes time to go out into the real world when they grown up permalink parent award report block reply Repentnow 2 points 21 hours ago You simply don't understand the dynamic of homeschooling and a close family. permalink parent award report block reply Nate_Higgersalot -37 points 1 day ago Why is it the parents of homeschooled kids don’t recognize that their kids are socially retarded? permalink award report block reply Mungo 26 points 1 day ago Seems you’re the retard. permalink parent award report block reply GuerillaYourDreams 14 points 1 day ago Many districts have arrangements where the kids meet together part of the week. We have it here; therefore there is no “socially retarded”. Unlike some people on social media. permalink parent award report block reply ElectionMeddler 14 points 1 day ago Public schools passed the weird creepy kid stage a decade ago.  Unless you like having your 8 year old tell you how they are trans now.  Doesn't help that CA will charge you criminally if you resist their brainwashing. permalink parent award report block reply IncredibleMrE1 14 points 1 day ago Socially retarded, like the public schooled kids who have all been transmogrified? permalink parent award report block reply learntocode 13 points 1 day ago I have had the opposite personal experience. permalink parent award report block reply load 10 more comments...\nwartooth6 82 points 1 day ago I'm doing my part! permalink award report block reply MAGAPlenty 27 points 1 day ago (Would you like to know more?) YES I DO permalink parent award report block reply lothrop_evola 27 points 1 day ago Not OP, but I live in Toronto with 3 kids and my wife homeschools because she enjoys it ( when they're in a good mood, which isn't always). I support it 100% because our local schools are run by literal faggots who once put a picture of a pregnant man to indoctrinate the kids. permalink parent award report block reply imnotdeadyet 18 points 24 hours ago The funny thing is, you talk to people that home school and they only need to teach for an hour or two to cover the material the school system needs 6 or 7 hours to teach.  That gives the kids more free time to read or two other creative things. permalink parent award report block reply lothrop_evola 9 points 23 hours ago Absolutely. My wife is usually finished teaching by lunchtime and the afternoon is free to do other things permalink parent award report block reply view 1 more comments... Constantin2024 9 points 22 hours ago The reason why the schools take so long to teach anything is because they spend upwards of 80% of their time dealing with discipline problems from disruptive future criminals. And at the end of the day, when kids haven't learned anything, the teachers send all the work home with them so their parents can do it anyway. permalink parent award report block reply view 5 more comments... borisborscht 4 points 21 hours ago But then you might realize the school was wasting the kids time year after year reteaching the same material with a few more levels.  And they were wasting time teaching irrelevant material and skipping things that are important. permalink parent award report block reply MAGABOND 1 points 16 hours ago Not only do they take fucking 7 to 8 hours, but they also send your kid home with homework. Like, you utter incompetent faggots can’t do your job well enough at your indoctrination factory in the time allotted that you have to dip into my family time? You want me to do your job anyway? What’s the fucking point? permalink parent award report block reply view 1 more comments... Remember_the_Alamo 1 points 18 hours ago How so? permalink parent award report block reply FusionBlack 1 points 17 hours ago Good for you. God bless you and your family. permalink parent award report block reply Scumbag-reddit 4 points 24 hours ago +2 here as well permalink parent award report block reply BeauHD 3 points 1 day ago How many kids? What's your location? So excited for you, man! permalink parent award report block reply barwhack 12 points 1 day ago Would YOU answer this doxxy question? permalink parent award report block reply Deportthemall23 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply barwhack 8 points 1 day ago Raising your kids as your kids , is the point. Even against society, if needs be. That's what Principles are: they are First, before all else. permalink parent award report block reply view 1 more comments... wartooth6 5 points 1 day ago 15 in Greenland?... Lol those are some oddly specific questions permalink parent award report block reply BeauHD 1 points 21 hours ago What part? permalink parent award report block reply MAGABOND 2 points 16 hours ago I’m doing my part. My kid is far happier, and far less anxious than I was at his age. permalink parent award report block reply kornesque 2 points 22 hours ago Best decision we ever made. permalink parent award report block reply\nMAGAPlenty 27 points 1 day ago (Would you like to know more?) YES I DO permalink parent award report block reply lothrop_evola 27 points 1 day ago Not OP, but I live in Toronto with 3 kids and my wife homeschools because she enjoys it ( when they're in a good mood, which isn't always). I support it 100% because our local schools are run by literal faggots who once put a picture of a pregnant man to indoctrinate the kids. permalink parent award report block reply imnotdeadyet 18 points 24 hours ago The funny thing is, you talk to people that home school and they only need to teach for an hour or two to cover the material the school system needs 6 or 7 hours to teach.  That gives the kids more free time to read or two other creative things. permalink parent award report block reply lothrop_evola 9 points 23 hours ago Absolutely. My wife is usually finished teaching by lunchtime and the afternoon is free to do other things permalink parent award report block reply view 1 more comments... Constantin2024 9 points 22 hours ago The reason why the schools take so long to teach anything is because they spend upwards of 80% of their time dealing with discipline problems from disruptive future criminals. And at the end of the day, when kids haven't learned anything, the teachers send all the work home with them so their parents can do it anyway. permalink parent award report block reply view 5 more comments... borisborscht 4 points 21 hours ago But then you might realize the school was wasting the kids time year after year reteaching the same material with a few more levels.  And they were wasting time teaching irrelevant material and skipping things that are important. permalink parent award report block reply MAGABOND 1 points 16 hours ago Not only do they take fucking 7 to 8 hours, but they also send your kid home with homework. Like, you utter incompetent faggots can’t do your job well enough at your indoctrination factory in the time allotted that you have to dip into my family time? You want me to do your job anyway? What’s the fucking point? permalink parent award report block reply view 1 more comments... Remember_the_Alamo 1 points 18 hours ago How so? permalink parent award report block reply FusionBlack 1 points 17 hours ago Good for you. God bless you and your family. permalink parent award report block reply\nlothrop_evola 27 points 1 day ago Not OP, but I live in Toronto with 3 kids and my wife homeschools because she enjoys it ( when they're in a good mood, which isn't always). I support it 100% because our local schools are run by literal faggots who once put a picture of a pregnant man to indoctrinate the kids. permalink parent award report block reply imnotdeadyet 18 points 24 hours ago The funny thing is, you talk to people that home school and they only need to teach for an hour or two to cover the material the school system needs 6 or 7 hours to teach.  That gives the kids more free time to read or two other creative things. permalink parent award report block reply lothrop_evola 9 points 23 hours ago Absolutely. My wife is usually finished teaching by lunchtime and the afternoon is free to do other things permalink parent award report block reply view 1 more comments... Constantin2024 9 points 22 hours ago The reason why the schools take so long to teach anything is because they spend upwards of 80% of their time dealing with discipline problems from disruptive future criminals. And at the end of the day, when kids haven't learned anything, the teachers send all the work home with them so their parents can do it anyway. permalink parent award report block reply view 5 more comments... borisborscht 4 points 21 hours ago But then you might realize the school was wasting the kids time year after year reteaching the same material with a few more levels.  And they were wasting time teaching irrelevant material and skipping things that are important. permalink parent award report block reply MAGABOND 1 points 16 hours ago Not only do they take fucking 7 to 8 hours, but they also send your kid home with homework. Like, you utter incompetent faggots can’t do your job well enough at your indoctrination factory in the time allotted that you have to dip into my family time? You want me to do your job anyway? What’s the fucking point? permalink parent award report block reply view 1 more comments... Remember_the_Alamo 1 points 18 hours ago How so? permalink parent award report block reply FusionBlack 1 points 17 hours ago Good for you. God bless you and your family. permalink parent award report block reply\nimnotdeadyet 18 points 24 hours ago The funny thing is, you talk to people that home school and they only need to teach for an hour or two to cover the material the school system needs 6 or 7 hours to teach.  That gives the kids more free time to read or two other creative things. permalink parent award report block reply lothrop_evola 9 points 23 hours ago Absolutely. My wife is usually finished teaching by lunchtime and the afternoon is free to do other things permalink parent award report block reply view 1 more comments... Constantin2024 9 points 22 hours ago The reason why the schools take so long to teach anything is because they spend upwards of 80% of their time dealing with discipline problems from disruptive future criminals. And at the end of the day, when kids haven't learned anything, the teachers send all the work home with them so their parents can do it anyway. permalink parent award report block reply view 5 more comments... borisborscht 4 points 21 hours ago But then you might realize the school was wasting the kids time year after year reteaching the same material with a few more levels.  And they were wasting time teaching irrelevant material and skipping things that are important. permalink parent award report block reply MAGABOND 1 points 16 hours ago Not only do they take fucking 7 to 8 hours, but they also send your kid home with homework. Like, you utter incompetent faggots can’t do your job well enough at your indoctrination factory in the time allotted that you have to dip into my family time? You want me to do your job anyway? What’s the fucking point? permalink parent award report block reply view 1 more comments... Remember_the_Alamo 1 points 18 hours ago How so? permalink parent award report block reply\nlothrop_evola 9 points 23 hours ago Absolutely. My wife is usually finished teaching by lunchtime and the afternoon is free to do other things permalink parent award report block reply view 1 more comments...\nConstantin2024 9 points 22 hours ago The reason why the schools take so long to teach anything is because they spend upwards of 80% of their time dealing with discipline problems from disruptive future criminals. And at the end of the day, when kids haven't learned anything, the teachers send all the work home with them so their parents can do it anyway. permalink parent award report block reply view 5 more comments...\nborisborscht 4 points 21 hours ago But then you might realize the school was wasting the kids time year after year reteaching the same material with a few more levels.  And they were wasting time teaching irrelevant material and skipping things that are important. permalink parent award report block reply\nMAGABOND 1 points 16 hours ago Not only do they take fucking 7 to 8 hours, but they also send your kid home with homework. Like, you utter incompetent faggots can’t do your job well enough at your indoctrination factory in the time allotted that you have to dip into my family time? You want me to do your job anyway? What’s the fucking point? permalink parent award report block reply view 1 more comments...\nRemember_the_Alamo 1 points 18 hours ago How so? permalink parent award report block reply\nFusionBlack 1 points 17 hours ago Good for you. God bless you and your family. permalink parent award report block reply\nScumbag-reddit 4 points 24 hours ago +2 here as well permalink parent award report block reply\nBeauHD 3 points 1 day ago How many kids? What's your location? So excited for you, man! permalink parent award report block reply barwhack 12 points 1 day ago Would YOU answer this doxxy question? permalink parent award report block reply Deportthemall23 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply barwhack 8 points 1 day ago Raising your kids as your kids , is the point. Even against society, if needs be. That's what Principles are: they are First, before all else. permalink parent award report block reply view 1 more comments... wartooth6 5 points 1 day ago 15 in Greenland?... Lol those are some oddly specific questions permalink parent award report block reply BeauHD 1 points 21 hours ago What part? permalink parent award report block reply\nbarwhack 12 points 1 day ago Would YOU answer this doxxy question? permalink parent award report block reply Deportthemall23 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply barwhack 8 points 1 day ago Raising your kids as your kids , is the point. Even against society, if needs be. That's what Principles are: they are First, before all else. permalink parent award report block reply view 1 more comments...\nDeportthemall23 1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply barwhack 8 points 1 day ago Raising your kids as your kids , is the point. Even against society, if needs be. That's what Principles are: they are First, before all else. permalink parent award report block reply view 1 more comments...\nbarwhack 8 points 1 day ago Raising your kids as your kids , is the point. Even against society, if needs be. That's what Principles are: they are First, before all else. permalink parent award report block reply view 1 more comments...\nwartooth6 5 points 1 day ago 15 in Greenland?... Lol those are some oddly specific questions permalink parent award report block reply BeauHD 1 points 21 hours ago What part? permalink parent award report block reply\nBeauHD 1 points 21 hours ago What part? permalink parent award report block reply\nMAGABOND 2 points 16 hours ago I’m doing my part. My kid is far happier, and far less anxious than I was at his age. permalink parent award report block reply\nkornesque 2 points 22 hours ago Best decision we ever made. permalink parent award report block reply\ngorilla_grip 54 points 1 day ago I was homeschooled in the 1980’s for a couple years. The state of Washington fought us tooth and nail they hated homeschooling.  Less government indoctrination. Homeschooling shows how easy school is for the most part, that one could do all the required work in 9 weeks or less, not 9 months. permalink award report block reply Bidensmellslikepiss 72 points 1 day ago If you send your kids to public school, they'll move at the same pace as the most retarded kid in the room - which is the teacher 90% of the time. Edit: which is a shame. Elementary school teachers used to be grade A wife material. permalink parent award report block reply 24601 34 points 1 day ago Elementary school teachers used to be grade A wife material. That's because they were wives, and mothers, before they were teachers. permalink parent award report block reply TheSwampThang 25 points 1 day ago Because being a good mother is  inherently being a good teacher permalink parent award report block reply Jack_NC 14 points 1 day ago inversely, it's also why so many \"early childhood education/development specialists\" are full of stupid ideas -- they are childless unmarried women with no experience, just repeating what they have read in books written by other barren women. permalink parent award report block reply view 4 more comments... basedboston OP 6 points 1 day ago You should have to be a mother to be a teacher. Ideally, kids grown up and out of the house. (Same with fathers as teachers). permalink parent award report block reply view 1 more comments... covok48 7 points 1 day ago Used to be. Now they are pedo retards. permalink parent award report block reply gorilla_grip 5 points 1 day ago I remember having small crushes on a couple elementary school teachers and they both got married while I was a kid. They were 100% wife material.  Now they have blue hair and septum piercings and go to no kings protests and probably have only fans pages permalink parent award report block reply LogicCircuits 4 points 1 day ago lolwut, all my elementary teachers were old biddies, except my 2nd grade teacher permalink parent award report block reply bejeavis 2 points 1 day ago which is the teacher 90% of the time based and accurate permalink parent award report block reply load 1 more comments...\nBidensmellslikepiss 72 points 1 day ago If you send your kids to public school, they'll move at the same pace as the most retarded kid in the room - which is the teacher 90% of the time. Edit: which is a shame. Elementary school teachers used to be grade A wife material. permalink parent award report block reply 24601 34 points 1 day ago Elementary school teachers used to be grade A wife material. That's because they were wives, and mothers, before they were teachers. permalink parent award report block reply TheSwampThang 25 points 1 day ago Because being a good mother is  inherently being a good teacher permalink parent award report block reply Jack_NC 14 points 1 day ago inversely, it's also why so many \"early childhood education/development specialists\" are full of stupid ideas -- they are childless unmarried women with no experience, just repeating what they have read in books written by other barren women. permalink parent award report block reply view 4 more comments... basedboston OP 6 points 1 day ago You should have to be a mother to be a teacher. Ideally, kids grown up and out of the house. (Same with fathers as teachers). permalink parent award report block reply view 1 more comments... covok48 7 points 1 day ago Used to be. Now they are pedo retards. permalink parent award report block reply gorilla_grip 5 points 1 day ago I remember having small crushes on a couple elementary school teachers and they both got married while I was a kid. They were 100% wife material.  Now they have blue hair and septum piercings and go to no kings protests and probably have only fans pages permalink parent award report block reply LogicCircuits 4 points 1 day ago lolwut, all my elementary teachers were old biddies, except my 2nd grade teacher permalink parent award report block reply bejeavis 2 points 1 day ago which is the teacher 90% of the time based and accurate permalink parent award report block reply load 1 more comments...\n24601 34 points 1 day ago Elementary school teachers used to be grade A wife material. That's because they were wives, and mothers, before they were teachers. permalink parent award report block reply TheSwampThang 25 points 1 day ago Because being a good mother is  inherently being a good teacher permalink parent award report block reply Jack_NC 14 points 1 day ago inversely, it's also why so many \"early childhood education/development specialists\" are full of stupid ideas -- they are childless unmarried women with no experience, just repeating what they have read in books written by other barren women. permalink parent award report block reply view 4 more comments... basedboston OP 6 points 1 day ago You should have to be a mother to be a teacher. Ideally, kids grown up and out of the house. (Same with fathers as teachers). permalink parent award report block reply view 1 more comments...\nTheSwampThang 25 points 1 day ago Because being a good mother is  inherently being a good teacher permalink parent award report block reply Jack_NC 14 points 1 day ago inversely, it's also why so many \"early childhood education/development specialists\" are full of stupid ideas -- they are childless unmarried women with no experience, just repeating what they have read in books written by other barren women. permalink parent award report block reply view 4 more comments... basedboston OP 6 points 1 day ago You should have to be a mother to be a teacher. Ideally, kids grown up and out of the house. (Same with fathers as teachers). permalink parent award report block reply view 1 more comments...\nJack_NC 14 points 1 day ago inversely, it's also why so many \"early childhood education/development specialists\" are full of stupid ideas -- they are childless unmarried women with no experience, just repeating what they have read in books written by other barren women. permalink parent award report block reply view 4 more comments...\nbasedboston OP 6 points 1 day ago You should have to be a mother to be a teacher. Ideally, kids grown up and out of the house. (Same with fathers as teachers). permalink parent award report block reply view 1 more comments...\ncovok48 7 points 1 day ago Used to be. Now they are pedo retards. permalink parent award report block reply\ngorilla_grip 5 points 1 day ago I remember having small crushes on a couple elementary school teachers and they both got married while I was a kid. They were 100% wife material.  Now they have blue hair and septum piercings and go to no kings protests and probably have only fans pages permalink parent award report block reply\nLogicCircuits 4 points 1 day ago lolwut, all my elementary teachers were old biddies, except my 2nd grade teacher permalink parent award report block reply\nbejeavis 2 points 1 day ago which is the teacher 90% of the time based and accurate permalink parent award report block reply\n2008RonPaul2012 39 points 1 day ago 4 kids in elementary and younger, in rural north GA. Numbers are exploding, frens. If you give your children to Caesar, don't be surprised when they come back as Romans. permalink award report block reply Perseverant 25 points 1 day ago \"I came, I saw, I dyed my hair blue and I'm trans now and don't misgender me.\" ~ Julius Caexir permalink parent award report block reply AccipiterQ 1 points 23 hours ago KEK<---- this one.\nKEK\nKEK\nKEK permalink parent award report block reply HeavyMetalPatriot 2 points 23 hours ago Patriots MUST homeschool permalink parent award report block reply\nPerseverant 25 points 1 day ago \"I came, I saw, I dyed my hair blue and I'm trans now and don't misgender me.\" ~ Julius Caexir permalink parent award report block reply AccipiterQ 1 points 23 hours ago KEK<---- this one.\nKEK\nKEK\nKEK permalink parent award report block reply\nAccipiterQ 1 points 23 hours ago KEK<---- this one.\nKEK\nKEK\nKEK permalink parent award report block reply\nHeavyMetalPatriot 2 points 23 hours ago Patriots MUST homeschool permalink parent award report block reply\nCanadianMeathead 30 points 1 day ago Canadian home schooler here. My kids are kick ass smart too. permalink award report block reply covok48 20 points 1 day ago Surprised they haven’t made that illegal yet. permalink parent award report block reply CanadianMeathead 19 points 1 day ago They are trying. permalink parent award report block reply\ncovok48 20 points 1 day ago Surprised they haven’t made that illegal yet. permalink parent award report block reply CanadianMeathead 19 points 1 day ago They are trying. permalink parent award report block reply\nCanadianMeathead 19 points 1 day ago They are trying. permalink parent award report block reply\nCaine 23 points 1 day ago I should have homeschooled all three of mine. Even in a red state in a deep red county, the leftist influence in education is too pervasive. permalink award report block reply\nBrookes 20 points 1 day ago Our grandkids are all homeschooled.  Our oldest son originally had them in public school then saw what they were not learning and pulled them out.  The kids are light years ahead of other kids in the same grade levels. Just after one year of homeschool. Our daughter in law takes them on field trips every week to some cool places that are educational along with being fun for all of them. I’m so impressed with the job she does with them.  She follows a curriculum that is very advanced.  Since we moved to Arizona I’m bummed that nana here can’t go with them.  They live in Utah. But the entire herd of kids and grandchildren are coming here for Christmas! Happy old lady pede will be cooking non stop!  We are taking the kids to the Desert Museum for a field trip! permalink award report block reply TwoArizonaPedes 8 points 1 day ago Woohoo! permalink parent award report block reply Michalusmichalus 5 points 1 day ago The state of MD traps kids in public school intentionally. They do not have kids at grade level, but by law as soon as parents disenroll their kids from public school if the child is not at grade level the parent goes to jail. There is no time given to get the kids to grade level. Even if the parent wants to disenroll the child for this reason. I learned this when my son who was in 8th grade at the time was diagnosed with dyslexia. This is why you see school districts like Baltimore where none of the kids are passing, but the parents still send them to school. Unless the child is sent to private school, or moves out of the state of MD the parent is held accountable immediately for the child's educational deficiency. permalink parent award report block reply ChinchillaCapitalism 6 points 20 hours ago Government schools can make it so your child is functionally illiterate while taxing you into poverty to pay for the privilege. Meanwhile, you'll go to jail for not meeting the same arbitrary standard they've never met themselves. Anarcho-tyranny. permalink parent award report block reply Brookes 2 points 23 hours ago That’s insane, but everything the left does is freaking insane. permalink parent award report block reply AccipiterQ 1 points 23 hours ago leave the state. permalink parent award report block reply Michalusmichalus 1 points 18 hours ago So many people want to, trust me. permalink parent award report block reply Aquamine-Amarine 4 points 1 day ago That sounds lovely. I would do something similiar, take them on field trips to museums, aquariums, local parks, etc. Is she teaching them any languages? Best time to start is when they're young, their brains are sponges! I told my brother to teach my niece our native language and he made some dumb excuse saying he didn't want to confuse her since she was lagging behind in other areas. She started school this year. Very worried about the poison teachers will try putting into her head. permalink parent award report block reply Brookes 2 points 1 day ago Yes they are learning Italian lol! Our huge ass family is obviously Italian and we visit family in Italy frequently.  The little stinkers already speak it better than most adults in our family. permalink parent award report block reply Quixotic -11 points 1 day ago You shouldn’t have moved away from your grandkids. Shame on you. permalink parent award report block reply Brookes 1 points 1 day ago Dude, we moved out of California!  The kids had already left California for Utah, Texas and Arizona. The ones in Arizona are three hours from us.  We see them all the time. We’re retired and hop in the RV and visit them all the time.  Or they come to us for long visits. We actually see them more now than when we lived in California! We are a very close family.  There’s zero shame here.  Who are you to judge? permalink parent award report block reply Quixotic -2 points 22 hours ago You should move to Utah near them and actually support them with your presence instead of just when it’s fun for you, boomer. permalink parent award report block reply Brookes 1 points 22 hours ago What about the ones in Texas and Arizona? Should we live 3 months in each state? We have always been there for our kids and their kids. You have zero clue what you’re talking about. You have no right to judge us.  Our family is healthy and happy.  You have been awfully judgmental about someone’s life you know nothing about.  Perhaps mind your own family kid before you make ridiculous comments about mine. permalink parent award report block reply\nTwoArizonaPedes 8 points 1 day ago Woohoo! permalink parent award report block reply\nMichalusmichalus 5 points 1 day ago The state of MD traps kids in public school intentionally. They do not have kids at grade level, but by law as soon as parents disenroll their kids from public school if the child is not at grade level the parent goes to jail. There is no time given to get the kids to grade level. Even if the parent wants to disenroll the child for this reason. I learned this when my son who was in 8th grade at the time was diagnosed with dyslexia. This is why you see school districts like Baltimore where none of the kids are passing, but the parents still send them to school. Unless the child is sent to private school, or moves out of the state of MD the parent is held accountable immediately for the child's educational deficiency. permalink parent award report block reply ChinchillaCapitalism 6 points 20 hours ago Government schools can make it so your child is functionally illiterate while taxing you into poverty to pay for the privilege. Meanwhile, you'll go to jail for not meeting the same arbitrary standard they've never met themselves. Anarcho-tyranny. permalink parent award report block reply Brookes 2 points 23 hours ago That’s insane, but everything the left does is freaking insane. permalink parent award report block reply AccipiterQ 1 points 23 hours ago leave the state. permalink parent award report block reply Michalusmichalus 1 points 18 hours ago So many people want to, trust me. permalink parent award report block reply\nChinchillaCapitalism 6 points 20 hours ago Government schools can make it so your child is functionally illiterate while taxing you into poverty to pay for the privilege. Meanwhile, you'll go to jail for not meeting the same arbitrary standard they've never met themselves. Anarcho-tyranny. permalink parent award report block reply\nBrookes 2 points 23 hours ago That’s insane, but everything the left does is freaking insane. permalink parent award report block reply\nAccipiterQ 1 points 23 hours ago leave the state. permalink parent award report block reply Michalusmichalus 1 points 18 hours ago So many people want to, trust me. permalink parent award report block reply\nMichalusmichalus 1 points 18 hours ago So many people want to, trust me. permalink parent award report block reply\nAquamine-Amarine 4 points 1 day ago That sounds lovely. I would do something similiar, take them on field trips to museums, aquariums, local parks, etc. Is she teaching them any languages? Best time to start is when they're young, their brains are sponges! I told my brother to teach my niece our native language and he made some dumb excuse saying he didn't want to confuse her since she was lagging behind in other areas. She started school this year. Very worried about the poison teachers will try putting into her head. permalink parent award report block reply Brookes 2 points 1 day ago Yes they are learning Italian lol! Our huge ass family is obviously Italian and we visit family in Italy frequently.  The little stinkers already speak it better than most adults in our family. permalink parent award report block reply\nBrookes 2 points 1 day ago Yes they are learning Italian lol! Our huge ass family is obviously Italian and we visit family in Italy frequently.  The little stinkers already speak it better than most adults in our family. permalink parent award report block reply\nQuixotic -11 points 1 day ago You shouldn’t have moved away from your grandkids. Shame on you. permalink parent award report block reply Brookes 1 points 1 day ago Dude, we moved out of California!  The kids had already left California for Utah, Texas and Arizona. The ones in Arizona are three hours from us.  We see them all the time. We’re retired and hop in the RV and visit them all the time.  Or they come to us for long visits. We actually see them more now than when we lived in California! We are a very close family.  There’s zero shame here.  Who are you to judge? permalink parent award report block reply Quixotic -2 points 22 hours ago You should move to Utah near them and actually support them with your presence instead of just when it’s fun for you, boomer. permalink parent award report block reply Brookes 1 points 22 hours ago What about the ones in Texas and Arizona? Should we live 3 months in each state? We have always been there for our kids and their kids. You have zero clue what you’re talking about. You have no right to judge us.  Our family is healthy and happy.  You have been awfully judgmental about someone’s life you know nothing about.  Perhaps mind your own family kid before you make ridiculous comments about mine. permalink parent award report block reply\nBrookes 1 points 1 day ago Dude, we moved out of California!  The kids had already left California for Utah, Texas and Arizona. The ones in Arizona are three hours from us.  We see them all the time. We’re retired and hop in the RV and visit them all the time.  Or they come to us for long visits. We actually see them more now than when we lived in California! We are a very close family.  There’s zero shame here.  Who are you to judge? permalink parent award report block reply Quixotic -2 points 22 hours ago You should move to Utah near them and actually support them with your presence instead of just when it’s fun for you, boomer. permalink parent award report block reply Brookes 1 points 22 hours ago What about the ones in Texas and Arizona? Should we live 3 months in each state? We have always been there for our kids and their kids. You have zero clue what you’re talking about. You have no right to judge us.  Our family is healthy and happy.  You have been awfully judgmental about someone’s life you know nothing about.  Perhaps mind your own family kid before you make ridiculous comments about mine. permalink parent award report block reply\nQuixotic -2 points 22 hours ago You should move to Utah near them and actually support them with your presence instead of just when it’s fun for you, boomer. permalink parent award report block reply Brookes 1 points 22 hours ago What about the ones in Texas and Arizona? Should we live 3 months in each state? We have always been there for our kids and their kids. You have zero clue what you’re talking about. You have no right to judge us.  Our family is healthy and happy.  You have been awfully judgmental about someone’s life you know nothing about.  Perhaps mind your own family kid before you make ridiculous comments about mine. permalink parent award report block reply\nBrookes 1 points 22 hours ago What about the ones in Texas and Arizona? Should we live 3 months in each state? We have always been there for our kids and their kids. You have zero clue what you’re talking about. You have no right to judge us.  Our family is healthy and happy.  You have been awfully judgmental about someone’s life you know nothing about.  Perhaps mind your own family kid before you make ridiculous comments about mine. permalink parent award report block reply\nMoreGuns 17 points 1 day ago I hope most kids end up homeschooled and public education completely collapses. The liberal tears when thousands of Communist DEI trans antifa indoctrination centers close and these \"teachers\" are left with nothing will be glorious permalink award report block reply\nfskfsk 16 points 1 day ago That is impressive.  The hard part is having one parent stay home to supervise the kid. permalink award report block reply MasterChief08 20 points 1 day ago There's homeschooling groups nowadays. You take turns with groups of families that can range from 3 to 20. You can also find retired engineers, nurses, etc. who will help out once the kids get into their teens and need more advanced STEM. permalink parent award report block reply TwoArizonaPedes 17 points 1 day ago A friend of mine teaches math and science to homeschooling pods and makes a killing just doing that part time. permalink parent award report block reply fskfsk 3 points 1 day ago How much can you make?  I can teach Math + CS well enough, but would it pay as much as my regular job? permalink parent award report block reply TwoArizonaPedes 7 points 1 day ago I think it would depend on the group size. He teaches small groups of up to 8 kids high school math & science and he has a bachelor's degree in math (a real degree, not one of today's \"degrees\"). I don't know the specific amount he charges but I know he only works 10-15 hours a week and he's making money hand over fist. He teaches on site but he's also done Zoom in the past, I think for one-on-one tutoring. He's not a guy to sit behind a desk all day so he loves the variety and working only part time. permalink parent award report block reply CommanderOfCheese 3 points 1 day ago This highlights everything wrong with our education system. None of our credentials teachers actually know anything. How can you expect them to be able to teach jack shit when they don't actually know anything? Meanwhile the people who actually do know something don't get to teach within the system. permalink parent award report block reply Madnote1984 18 points 1 day ago This is the struggle for my wife and I. We homeschool 4. Essentially, I am working poor. I have very low debt, a very low mortgage and our newest car is 10 years old. We get zero government assistance even though I carry 6 people in my household. I also still manage to make enough to pay taxes. No boat, no vacations. I had a leak in the guest bathroom last winter that went on for quite a while. Had to rip out the vanity and a ton of the drywall. Still haven't fixed it, because too broke...and I have another bathroom. That said, my wife has taught all of my kids to read early. I've got one that just turned 7 who reads on an 8th grade level and will be completing first and second grade by spring. So, those kinds of things make it worth every penny of lost income. I'm kind of resigned to being poor at this point, (at least until 401k time) but hopefully my kids will have a chance to do better than me. Unless the commies collapse the country. permalink parent award report block reply AccipiterQ 3 points 23 hours ago Absolutely agree, what you are doing is the proper way.  It's about your kids and their wellbeing. You're rich in that regard. permalink parent award report block reply ChinchillaCapitalism 2 points 20 hours ago You're richer in ways that most \"well-off\" families can't imagine. You get to see your kids grow up and be a part of it as opposed to seeing them for a few hours between daycare and bedtime. You'll never have to worry about them being assaulted, drugged, or brainwashed and gender mutilated at a government school. You'll get to have experiences that matter and know your actions have an eternal impact, that your values will be passed on. That's worth a lot more than any shiny toys/worldly distractions that money can buy. permalink parent award report block reply Madnote1984 3 points 20 hours ago Absolutely my fren. Thanks for the encouragement. permalink parent award report block reply electricboogaloo 13 points 1 day ago My wife stays home with our soon to be 3 kids. What I recommend to young men trying to find a path to their (future) wife staying home with the kids: Resist common vices as early as possible: video games, porn, gambling, drugs, drinking, etc Marry a woman who cooks/cleans/works hard/is frugal, and doesn’t need an Instagram-worthy life to be happy. Don’t “fall” in love with just anyone, intentionally find the right person. Work hard/smart to maximize income early. Don’t waste your 20s coasting/vacationing. Don’t take out massive student loans. College may not even be necessary. Teach yourself everything possible. Live way below your means even when you’re way ahead. Never hold a credit card balance, buy used cars, don’t buy too much house, be frugal. Buy 2nd hand, do research, and price shop. Save money to create financial flexibility. Pay for practical, long-term value. Let go of ego. Get rich slowly. Embrace hard work, pain, and discipline. permalink parent award report block reply exarch 6 points 1 day ago That’s great advice for a young man, but I fear there are very few women who are marriage-worthy these days. What we need is some way to reach them and influence them to live right. Because as soon as they start “dating” (read: engaging in promiscuity) they are on a path that they can’t come back from. permalink parent award report block reply MediaBro 2 points 22 hours ago I did some of these things but Covid destroyed it all. I'm trying on rebuilding now but the economy sucks donkeys arse currently. permalink parent award report block reply electricboogaloo 3 points 18 hours ago I don’t have a college degree and I battle a lifelong terminal illness. I manage a client-facing, technical team of 20 people. I interview people frequently. Many guys I interview or pass over for promotions fail in 3 areas: They fail to relate to people. The bar is so low here that it makes you stand out in dating and at work if you can relate to people. Smile, take an interest in what makes a person tick, stop caring about what anyone thinks, and just talk. It’s not a chess game, it’s just a conversation. Many men avoid this skill, but it will take you very far. They fail at the mundane stuff. Show up on time, prepared, and with a good attitude. Go the extra mile to do the job the right way every time even if it’s painful. Reply to an email on time without anyone telling you. Apply basic common sense to a problem. Don’t bitch about a problem, find a solution. Own your tasks and don’t make excuses. If you can own the mundane things then you will earn trust and be given more responsibility. There’s a very serious leadership vacuum in this world, but nobody will make you a leader if they can’t 100% trust you. They give up when they encounter roadblocks. It’s very rare there isn’t a way around. You don’t need to be smart, strong, talented, or well connected to do these things. These are universal skillsets that are scarce in today’s world, particularly post-COVID. Persist and you can work your way up anywhere, in any economy. permalink parent award report block reply MediaBro 1 points 15 hours ago Dayum, that's definitely inspiring. permalink parent award report block reply\nMasterChief08 20 points 1 day ago There's homeschooling groups nowadays. You take turns with groups of families that can range from 3 to 20. You can also find retired engineers, nurses, etc. who will help out once the kids get into their teens and need more advanced STEM. permalink parent award report block reply TwoArizonaPedes 17 points 1 day ago A friend of mine teaches math and science to homeschooling pods and makes a killing just doing that part time. permalink parent award report block reply fskfsk 3 points 1 day ago How much can you make?  I can teach Math + CS well enough, but would it pay as much as my regular job? permalink parent award report block reply TwoArizonaPedes 7 points 1 day ago I think it would depend on the group size. He teaches small groups of up to 8 kids high school math & science and he has a bachelor's degree in math (a real degree, not one of today's \"degrees\"). I don't know the specific amount he charges but I know he only works 10-15 hours a week and he's making money hand over fist. He teaches on site but he's also done Zoom in the past, I think for one-on-one tutoring. He's not a guy to sit behind a desk all day so he loves the variety and working only part time. permalink parent award report block reply CommanderOfCheese 3 points 1 day ago This highlights everything wrong with our education system. None of our credentials teachers actually know anything. How can you expect them to be able to teach jack shit when they don't actually know anything? Meanwhile the people who actually do know something don't get to teach within the system. permalink parent award report block reply\nTwoArizonaPedes 17 points 1 day ago A friend of mine teaches math and science to homeschooling pods and makes a killing just doing that part time. permalink parent award report block reply fskfsk 3 points 1 day ago How much can you make?  I can teach Math + CS well enough, but would it pay as much as my regular job? permalink parent award report block reply TwoArizonaPedes 7 points 1 day ago I think it would depend on the group size. He teaches small groups of up to 8 kids high school math & science and he has a bachelor's degree in math (a real degree, not one of today's \"degrees\"). I don't know the specific amount he charges but I know he only works 10-15 hours a week and he's making money hand over fist. He teaches on site but he's also done Zoom in the past, I think for one-on-one tutoring. He's not a guy to sit behind a desk all day so he loves the variety and working only part time. permalink parent award report block reply\nfskfsk 3 points 1 day ago How much can you make?  I can teach Math + CS well enough, but would it pay as much as my regular job? permalink parent award report block reply TwoArizonaPedes 7 points 1 day ago I think it would depend on the group size. He teaches small groups of up to 8 kids high school math & science and he has a bachelor's degree in math (a real degree, not one of today's \"degrees\"). I don't know the specific amount he charges but I know he only works 10-15 hours a week and he's making money hand over fist. He teaches on site but he's also done Zoom in the past, I think for one-on-one tutoring. He's not a guy to sit behind a desk all day so he loves the variety and working only part time. permalink parent award report block reply\nTwoArizonaPedes 7 points 1 day ago I think it would depend on the group size. He teaches small groups of up to 8 kids high school math & science and he has a bachelor's degree in math (a real degree, not one of today's \"degrees\"). I don't know the specific amount he charges but I know he only works 10-15 hours a week and he's making money hand over fist. He teaches on site but he's also done Zoom in the past, I think for one-on-one tutoring. He's not a guy to sit behind a desk all day so he loves the variety and working only part time. permalink parent award report block reply\nCommanderOfCheese 3 points 1 day ago This highlights everything wrong with our education system. None of our credentials teachers actually know anything. How can you expect them to be able to teach jack shit when they don't actually know anything? Meanwhile the people who actually do know something don't get to teach within the system. permalink parent award report block reply\nMadnote1984 18 points 1 day ago This is the struggle for my wife and I. We homeschool 4. Essentially, I am working poor. I have very low debt, a very low mortgage and our newest car is 10 years old. We get zero government assistance even though I carry 6 people in my household. I also still manage to make enough to pay taxes. No boat, no vacations. I had a leak in the guest bathroom last winter that went on for quite a while. Had to rip out the vanity and a ton of the drywall. Still haven't fixed it, because too broke...and I have another bathroom. That said, my wife has taught all of my kids to read early. I've got one that just turned 7 who reads on an 8th grade level and will be completing first and second grade by spring. So, those kinds of things make it worth every penny of lost income. I'm kind of resigned to being poor at this point, (at least until 401k time) but hopefully my kids will have a chance to do better than me. Unless the commies collapse the country. permalink parent award report block reply AccipiterQ 3 points 23 hours ago Absolutely agree, what you are doing is the proper way.  It's about your kids and their wellbeing. You're rich in that regard. permalink parent award report block reply ChinchillaCapitalism 2 points 20 hours ago You're richer in ways that most \"well-off\" families can't imagine. You get to see your kids grow up and be a part of it as opposed to seeing them for a few hours between daycare and bedtime. You'll never have to worry about them being assaulted, drugged, or brainwashed and gender mutilated at a government school. You'll get to have experiences that matter and know your actions have an eternal impact, that your values will be passed on. That's worth a lot more than any shiny toys/worldly distractions that money can buy. permalink parent award report block reply Madnote1984 3 points 20 hours ago Absolutely my fren. Thanks for the encouragement. permalink parent award report block reply\nAccipiterQ 3 points 23 hours ago Absolutely agree, what you are doing is the proper way.  It's about your kids and their wellbeing. You're rich in that regard. permalink parent award report block reply\nChinchillaCapitalism 2 points 20 hours ago You're richer in ways that most \"well-off\" families can't imagine. You get to see your kids grow up and be a part of it as opposed to seeing them for a few hours between daycare and bedtime. You'll never have to worry about them being assaulted, drugged, or brainwashed and gender mutilated at a government school. You'll get to have experiences that matter and know your actions have an eternal impact, that your values will be passed on. That's worth a lot more than any shiny toys/worldly distractions that money can buy. permalink parent award report block reply Madnote1984 3 points 20 hours ago Absolutely my fren. Thanks for the encouragement. permalink parent award report block reply\nMadnote1984 3 points 20 hours ago Absolutely my fren. Thanks for the encouragement. permalink parent award report block reply\nelectricboogaloo 13 points 1 day ago My wife stays home with our soon to be 3 kids. What I recommend to young men trying to find a path to their (future) wife staying home with the kids: Resist common vices as early as possible: video games, porn, gambling, drugs, drinking, etc Marry a woman who cooks/cleans/works hard/is frugal, and doesn’t need an Instagram-worthy life to be happy. Don’t “fall” in love with just anyone, intentionally find the right person. Work hard/smart to maximize income early. Don’t waste your 20s coasting/vacationing. Don’t take out massive student loans. College may not even be necessary. Teach yourself everything possible. Live way below your means even when you’re way ahead. Never hold a credit card balance, buy used cars, don’t buy too much house, be frugal. Buy 2nd hand, do research, and price shop. Save money to create financial flexibility. Pay for practical, long-term value. Let go of ego. Get rich slowly. Embrace hard work, pain, and discipline. permalink parent award report block reply exarch 6 points 1 day ago That’s great advice for a young man, but I fear there are very few women who are marriage-worthy these days. What we need is some way to reach them and influence them to live right. Because as soon as they start “dating” (read: engaging in promiscuity) they are on a path that they can’t come back from. permalink parent award report block reply MediaBro 2 points 22 hours ago I did some of these things but Covid destroyed it all. I'm trying on rebuilding now but the economy sucks donkeys arse currently. permalink parent award report block reply electricboogaloo 3 points 18 hours ago I don’t have a college degree and I battle a lifelong terminal illness. I manage a client-facing, technical team of 20 people. I interview people frequently. Many guys I interview or pass over for promotions fail in 3 areas: They fail to relate to people. The bar is so low here that it makes you stand out in dating and at work if you can relate to people. Smile, take an interest in what makes a person tick, stop caring about what anyone thinks, and just talk. It’s not a chess game, it’s just a conversation. Many men avoid this skill, but it will take you very far. They fail at the mundane stuff. Show up on time, prepared, and with a good attitude. Go the extra mile to do the job the right way every time even if it’s painful. Reply to an email on time without anyone telling you. Apply basic common sense to a problem. Don’t bitch about a problem, find a solution. Own your tasks and don’t make excuses. If you can own the mundane things then you will earn trust and be given more responsibility. There’s a very serious leadership vacuum in this world, but nobody will make you a leader if they can’t 100% trust you. They give up when they encounter roadblocks. It’s very rare there isn’t a way around. You don’t need to be smart, strong, talented, or well connected to do these things. These are universal skillsets that are scarce in today’s world, particularly post-COVID. Persist and you can work your way up anywhere, in any economy. permalink parent award report block reply MediaBro 1 points 15 hours ago Dayum, that's definitely inspiring. permalink parent award report block reply\nexarch 6 points 1 day ago That’s great advice for a young man, but I fear there are very few women who are marriage-worthy these days. What we need is some way to reach them and influence them to live right. Because as soon as they start “dating” (read: engaging in promiscuity) they are on a path that they can’t come back from. permalink parent award report block reply\nMediaBro 2 points 22 hours ago I did some of these things but Covid destroyed it all. I'm trying on rebuilding now but the economy sucks donkeys arse currently. permalink parent award report block reply electricboogaloo 3 points 18 hours ago I don’t have a college degree and I battle a lifelong terminal illness. I manage a client-facing, technical team of 20 people. I interview people frequently. Many guys I interview or pass over for promotions fail in 3 areas: They fail to relate to people. The bar is so low here that it makes you stand out in dating and at work if you can relate to people. Smile, take an interest in what makes a person tick, stop caring about what anyone thinks, and just talk. It’s not a chess game, it’s just a conversation. Many men avoid this skill, but it will take you very far. They fail at the mundane stuff. Show up on time, prepared, and with a good attitude. Go the extra mile to do the job the right way every time even if it’s painful. Reply to an email on time without anyone telling you. Apply basic common sense to a problem. Don’t bitch about a problem, find a solution. Own your tasks and don’t make excuses. If you can own the mundane things then you will earn trust and be given more responsibility. There’s a very serious leadership vacuum in this world, but nobody will make you a leader if they can’t 100% trust you. They give up when they encounter roadblocks. It’s very rare there isn’t a way around. You don’t need to be smart, strong, talented, or well connected to do these things. These are universal skillsets that are scarce in today’s world, particularly post-COVID. Persist and you can work your way up anywhere, in any economy. permalink parent award report block reply MediaBro 1 points 15 hours ago Dayum, that's definitely inspiring. permalink parent award report block reply\nelectricboogaloo 3 points 18 hours ago I don’t have a college degree and I battle a lifelong terminal illness. I manage a client-facing, technical team of 20 people. I interview people frequently. Many guys I interview or pass over for promotions fail in 3 areas: They fail to relate to people. The bar is so low here that it makes you stand out in dating and at work if you can relate to people. Smile, take an interest in what makes a person tick, stop caring about what anyone thinks, and just talk. It’s not a chess game, it’s just a conversation. Many men avoid this skill, but it will take you very far. They fail at the mundane stuff. Show up on time, prepared, and with a good attitude. Go the extra mile to do the job the right way every time even if it’s painful. Reply to an email on time without anyone telling you. Apply basic common sense to a problem. Don’t bitch about a problem, find a solution. Own your tasks and don’t make excuses. If you can own the mundane things then you will earn trust and be given more responsibility. There’s a very serious leadership vacuum in this world, but nobody will make you a leader if they can’t 100% trust you. They give up when they encounter roadblocks. It’s very rare there isn’t a way around. You don’t need to be smart, strong, talented, or well connected to do these things. These are universal skillsets that are scarce in today’s world, particularly post-COVID. Persist and you can work your way up anywhere, in any economy. permalink parent award report block reply MediaBro 1 points 15 hours ago Dayum, that's definitely inspiring. permalink parent award report block reply\nMediaBro 1 points 15 hours ago Dayum, that's definitely inspiring. permalink parent award report block reply\nGeocav 15 points 1 day ago That's how we did it, it's the best investment that you can make. permalink award report block reply FLpalmtrees 2 points 22 hours ago Same here, and I completely agree! permalink parent award report block reply\nFLpalmtrees 2 points 22 hours ago Same here, and I completely agree! permalink parent award report block reply\nlearntocode 14 points 1 day ago If I could go back and do it again, homeschool all the way. permalink award report block reply\nFloridaGirl 13 points 1 day ago Got two in my home. The homeschool homecoming my high schooler attended last week had a max capacity of 330 students. There was a waitlist for tickets. But tell me again how they are \"unsocialized.\" permalink award report block reply Michalusmichalus 2 points 1 day ago My kids went on field trips with home school pods. I was the only adult they allowed their kids to be supervised by. permalink parent award report block reply\nMichalusmichalus 2 points 1 day ago My kids went on field trips with home school pods. I was the only adult they allowed their kids to be supervised by. permalink parent award report block reply\ncovok48 13 points 1 day ago Elementary schools are shutting down in the DFW area because all the White kids are being pulled out and being homeschooled. It is glorious. permalink award report block reply bejeavis 5 points 1 day ago We need social distancing muh COVID! Wait, not like that! permalink parent award report block reply\nbejeavis 5 points 1 day ago We need social distancing muh COVID! Wait, not like that! permalink parent award report block reply\nJack_NC 12 points 1 day ago In the 70s, it was against the law in most places -- \"homeschooling\" your children was risking arrest and having your children taken away by The State. Bravo to those who went before us. Same to those who follow. The greatest thing about Homeschooling is the unspoken lesson to the children that they own their own lives. NO ONE gets to compel you to wake at a specific hour, obey a teacher, ask for permission to use a toilet or speak, etc. permalink award report block reply Quixotic -5 points 1 day ago That might be the dumbest list of “benefits.” You think everyone should just open their mouth and start speaking whenever they feel like it? You don’t think that social group settings should have norms/order? permalink parent award report block reply Jack_NC 5 points 1 day ago That's the foundation to adopting the mindset of a slave -- surrendering authority over your life to someone who doesn't have your best interests at heart. I'll put you down as \"disagree.\" edit: the other side of this is that the family owns it's time. The family doesn't have to postpone that trip to grandma's house because the school \"doesn't allow it\". We don't have to hurry through a holiday, or ask permission to study a subject more deeply, or spontaneously spend a day with a blacksmith or glass blower or cabinetmaker so the kids can learn to make something useful. (three activities my kids actually did and enjoyed immensely). They also were able to learn subjects that are useful. History and geography, not \"social studies.\" Mathematics books from the 1950s where every page isn't full of rainbow math, cartoons and stories. Literature and Grammar, not \"language arts\". And real literature, not a bunch of queer-biased propaganda and frankly, lies, from teachers with agendas. They could learn, and play, on their schedule. We also covered lessons in how to start and run a business (which they did), invest, banking, home and auto repair, etc. Practical real-life skills that are no longer taught in a school. But most importantly, the greatest value is seeing them aspire to be adults, learn the skills they need to be self-sufficient. permalink parent award report block reply AccipiterQ 2 points 23 hours ago What math books from the 50s? We may be following down your path... permalink parent award report block reply Jack_NC 1 points 20 hours ago We bought a set off ebay way back when -- it's been 30 years so they are long gone and I don't recall the specifics but if we had to do it again today, Saxon Math would be the choice. permalink parent award report block reply view 1 more comments... Quixotic 0 points 22 hours ago I’m all for homeschooling - but not lazy, go-out-in-public-in-your-pajamas homeschooling. Society requires order. When you’re teaching your kids at home, do you let them all ask you questions simultaneously? Do you pause the lessons and make everyone wait while they go to the bathroom? Or do you impose a structure so that they learn how to behave like productive citizens? permalink parent award report block reply Jack_NC 2 points 20 hours ago Of course etiquette and manners are part of daily life. Why would it be otherwise? And yes, if my child said \"excuse me, I need to use the restroom\" of course we would pause. That is called courtesy and respect . I know you're trying to imagine a chaotic free-for-all situation where no-one learns a thing and the parents are lazy; and indeed there may be some homeschool arrangements like that. But we were responsible and dedicated a lot of energy into ensuring our kids were learning whether in a classroom type setting or hands-on, or taking instruction from others such as a blacksmith or glass blower or cabinetmaker. We made it work for us, and every family has the freedom to adopt an arrangement that works for their specific needs. permalink parent award report block reply Repentnow 4 points 1 day ago You don’t think that social group settings should have norms/order? Spoken as a closet authoritarian. Believe It or not, people can actually regulate themselves without an authority figure standing over them. permalink parent award report block reply Michalusmichalus 3 points 1 day ago Did you know the reason high school kids go to school before middle schoolers, and elementary school kids is specifically so they get home first to be able to babysit younger siblings? Even though the teenage brain would do better waking up later. permalink parent award report block reply Quixotic 0 points 22 hours ago Just because you make up a reason doesn’t make it true. The reason is actually because of bus schedules. permalink parent award report block reply Michalusmichalus 1 points 18 hours ago You're an idiot. The same buses can just reverse the age order. It has been a known issue, look up when high school kids should be sleeping, and the answers are in the studies. It was a big deal when I was in hs. permalink parent award report block reply view 2 more comments...\nQuixotic -5 points 1 day ago That might be the dumbest list of “benefits.” You think everyone should just open their mouth and start speaking whenever they feel like it? You don’t think that social group settings should have norms/order? permalink parent award report block reply Jack_NC 5 points 1 day ago That's the foundation to adopting the mindset of a slave -- surrendering authority over your life to someone who doesn't have your best interests at heart. I'll put you down as \"disagree.\" edit: the other side of this is that the family owns it's time. The family doesn't have to postpone that trip to grandma's house because the school \"doesn't allow it\". We don't have to hurry through a holiday, or ask permission to study a subject more deeply, or spontaneously spend a day with a blacksmith or glass blower or cabinetmaker so the kids can learn to make something useful. (three activities my kids actually did and enjoyed immensely). They also were able to learn subjects that are useful. History and geography, not \"social studies.\" Mathematics books from the 1950s where every page isn't full of rainbow math, cartoons and stories. Literature and Grammar, not \"language arts\". And real literature, not a bunch of queer-biased propaganda and frankly, lies, from teachers with agendas. They could learn, and play, on their schedule. We also covered lessons in how to start and run a business (which they did), invest, banking, home and auto repair, etc. Practical real-life skills that are no longer taught in a school. But most importantly, the greatest value is seeing them aspire to be adults, learn the skills they need to be self-sufficient. permalink parent award report block reply AccipiterQ 2 points 23 hours ago What math books from the 50s? We may be following down your path... permalink parent award report block reply Jack_NC 1 points 20 hours ago We bought a set off ebay way back when -- it's been 30 years so they are long gone and I don't recall the specifics but if we had to do it again today, Saxon Math would be the choice. permalink parent award report block reply view 1 more comments... Quixotic 0 points 22 hours ago I’m all for homeschooling - but not lazy, go-out-in-public-in-your-pajamas homeschooling. Society requires order. When you’re teaching your kids at home, do you let them all ask you questions simultaneously? Do you pause the lessons and make everyone wait while they go to the bathroom? Or do you impose a structure so that they learn how to behave like productive citizens? permalink parent award report block reply Jack_NC 2 points 20 hours ago Of course etiquette and manners are part of daily life. Why would it be otherwise? And yes, if my child said \"excuse me, I need to use the restroom\" of course we would pause. That is called courtesy and respect . I know you're trying to imagine a chaotic free-for-all situation where no-one learns a thing and the parents are lazy; and indeed there may be some homeschool arrangements like that. But we were responsible and dedicated a lot of energy into ensuring our kids were learning whether in a classroom type setting or hands-on, or taking instruction from others such as a blacksmith or glass blower or cabinetmaker. We made it work for us, and every family has the freedom to adopt an arrangement that works for their specific needs. permalink parent award report block reply Repentnow 4 points 1 day ago You don’t think that social group settings should have norms/order? Spoken as a closet authoritarian. Believe It or not, people can actually regulate themselves without an authority figure standing over them. permalink parent award report block reply Michalusmichalus 3 points 1 day ago Did you know the reason high school kids go to school before middle schoolers, and elementary school kids is specifically so they get home first to be able to babysit younger siblings? Even though the teenage brain would do better waking up later. permalink parent award report block reply Quixotic 0 points 22 hours ago Just because you make up a reason doesn’t make it true. The reason is actually because of bus schedules. permalink parent award report block reply Michalusmichalus 1 points 18 hours ago You're an idiot. The same buses can just reverse the age order. It has been a known issue, look up when high school kids should be sleeping, and the answers are in the studies. It was a big deal when I was in hs. permalink parent award report block reply view 2 more comments...\nJack_NC 5 points 1 day ago That's the foundation to adopting the mindset of a slave -- surrendering authority over your life to someone who doesn't have your best interests at heart. I'll put you down as \"disagree.\" edit: the other side of this is that the family owns it's time. The family doesn't have to postpone that trip to grandma's house because the school \"doesn't allow it\". We don't have to hurry through a holiday, or ask permission to study a subject more deeply, or spontaneously spend a day with a blacksmith or glass blower or cabinetmaker so the kids can learn to make something useful. (three activities my kids actually did and enjoyed immensely). They also were able to learn subjects that are useful. History and geography, not \"social studies.\" Mathematics books from the 1950s where every page isn't full of rainbow math, cartoons and stories. Literature and Grammar, not \"language arts\". And real literature, not a bunch of queer-biased propaganda and frankly, lies, from teachers with agendas. They could learn, and play, on their schedule. We also covered lessons in how to start and run a business (which they did), invest, banking, home and auto repair, etc. Practical real-life skills that are no longer taught in a school. But most importantly, the greatest value is seeing them aspire to be adults, learn the skills they need to be self-sufficient. permalink parent award report block reply AccipiterQ 2 points 23 hours ago What math books from the 50s? We may be following down your path... permalink parent award report block reply Jack_NC 1 points 20 hours ago We bought a set off ebay way back when -- it's been 30 years so they are long gone and I don't recall the specifics but if we had to do it again today, Saxon Math would be the choice. permalink parent award report block reply view 1 more comments... Quixotic 0 points 22 hours ago I’m all for homeschooling - but not lazy, go-out-in-public-in-your-pajamas homeschooling. Society requires order. When you’re teaching your kids at home, do you let them all ask you questions simultaneously? Do you pause the lessons and make everyone wait while they go to the bathroom? Or do you impose a structure so that they learn how to behave like productive citizens? permalink parent award report block reply Jack_NC 2 points 20 hours ago Of course etiquette and manners are part of daily life. Why would it be otherwise? And yes, if my child said \"excuse me, I need to use the restroom\" of course we would pause. That is called courtesy and respect . I know you're trying to imagine a chaotic free-for-all situation where no-one learns a thing and the parents are lazy; and indeed there may be some homeschool arrangements like that. But we were responsible and dedicated a lot of energy into ensuring our kids were learning whether in a classroom type setting or hands-on, or taking instruction from others such as a blacksmith or glass blower or cabinetmaker. We made it work for us, and every family has the freedom to adopt an arrangement that works for their specific needs. permalink parent award report block reply\nAccipiterQ 2 points 23 hours ago What math books from the 50s? We may be following down your path... permalink parent award report block reply Jack_NC 1 points 20 hours ago We bought a set off ebay way back when -- it's been 30 years so they are long gone and I don't recall the specifics but if we had to do it again today, Saxon Math would be the choice. permalink parent award report block reply view 1 more comments...\nJack_NC 1 points 20 hours ago We bought a set off ebay way back when -- it's been 30 years so they are long gone and I don't recall the specifics but if we had to do it again today, Saxon Math would be the choice. permalink parent award report block reply view 1 more comments...\nQuixotic 0 points 22 hours ago I’m all for homeschooling - but not lazy, go-out-in-public-in-your-pajamas homeschooling. Society requires order. When you’re teaching your kids at home, do you let them all ask you questions simultaneously? Do you pause the lessons and make everyone wait while they go to the bathroom? Or do you impose a structure so that they learn how to behave like productive citizens? permalink parent award report block reply Jack_NC 2 points 20 hours ago Of course etiquette and manners are part of daily life. Why would it be otherwise? And yes, if my child said \"excuse me, I need to use the restroom\" of course we would pause. That is called courtesy and respect . I know you're trying to imagine a chaotic free-for-all situation where no-one learns a thing and the parents are lazy; and indeed there may be some homeschool arrangements like that. But we were responsible and dedicated a lot of energy into ensuring our kids were learning whether in a classroom type setting or hands-on, or taking instruction from others such as a blacksmith or glass blower or cabinetmaker. We made it work for us, and every family has the freedom to adopt an arrangement that works for their specific needs. permalink parent award report block reply\nJack_NC 2 points 20 hours ago Of course etiquette and manners are part of daily life. Why would it be otherwise? And yes, if my child said \"excuse me, I need to use the restroom\" of course we would pause. That is called courtesy and respect . I know you're trying to imagine a chaotic free-for-all situation where no-one learns a thing and the parents are lazy; and indeed there may be some homeschool arrangements like that. But we were responsible and dedicated a lot of energy into ensuring our kids were learning whether in a classroom type setting or hands-on, or taking instruction from others such as a blacksmith or glass blower or cabinetmaker. We made it work for us, and every family has the freedom to adopt an arrangement that works for their specific needs. permalink parent award report block reply\nRepentnow 4 points 1 day ago You don’t think that social group settings should have norms/order? Spoken as a closet authoritarian. Believe It or not, people can actually regulate themselves without an authority figure standing over them. permalink parent award report block reply\nMichalusmichalus 3 points 1 day ago Did you know the reason high school kids go to school before middle schoolers, and elementary school kids is specifically so they get home first to be able to babysit younger siblings? Even though the teenage brain would do better waking up later. permalink parent award report block reply Quixotic 0 points 22 hours ago Just because you make up a reason doesn’t make it true. The reason is actually because of bus schedules. permalink parent award report block reply Michalusmichalus 1 points 18 hours ago You're an idiot. The same buses can just reverse the age order. It has been a known issue, look up when high school kids should be sleeping, and the answers are in the studies. It was a big deal when I was in hs. permalink parent award report block reply view 2 more comments...\nQuixotic 0 points 22 hours ago Just because you make up a reason doesn’t make it true. The reason is actually because of bus schedules. permalink parent award report block reply Michalusmichalus 1 points 18 hours ago You're an idiot. The same buses can just reverse the age order. It has been a known issue, look up when high school kids should be sleeping, and the answers are in the studies. It was a big deal when I was in hs. permalink parent award report block reply view 2 more comments...\nMichalusmichalus 1 points 18 hours ago You're an idiot. The same buses can just reverse the age order. It has been a known issue, look up when high school kids should be sleeping, and the answers are in the studies. It was a big deal when I was in hs. permalink parent award report block reply view 2 more comments...\nt-bone 11 points 1 day ago Insert rookie numbers meme here permalink award report block reply\nKnoxHarrington 10 points 1 day ago Got me a whole brood of homeschoolers back on the homefront.  Smarter and more well-adjusted than 90% of public schoolers. My nearly 8 year old may not know anything about Taylor Swift or Kpop Demon Hunters, but she knows who Diocletian, Frederick the Great, and the Apostles are. permalink award report block reply\nGA_Logic 10 points 1 day ago 5 million home schooled children is a big deal.  It means that a good percentage of the population is resistant to mass media psy ops programming if we look into the near future. permalink award report block reply\nIllIllIll 9 points 1 day ago And yet my property taxes go up by record amounts every year! permalink award report block reply Get_Off_Big_Tech 12 points 1 day ago Gotta babysit all those illegals and grown women with useless degrees. permalink parent award report block reply Repentnow 3 points 1 day ago Over 25% of the Texas state-wide school system is ESL. Some districts are near 100% ESL. SCOTUS has said that every illegal child must be accepted into public school. permalink parent award report block reply\nGet_Off_Big_Tech 12 points 1 day ago Gotta babysit all those illegals and grown women with useless degrees. permalink parent award report block reply\nRepentnow 3 points 1 day ago Over 25% of the Texas state-wide school system is ESL. Some districts are near 100% ESL. SCOTUS has said that every illegal child must be accepted into public school. permalink parent award report block reply\nElectionMeddler 8 points 1 day ago I hope it keeps growing!  Homeschool curriculum is easy to get these days and there is a great community of parents to help.  Teaching your kids with your morals and protecting them from predators is a true gift.  Public schools are dumbing down the nation and you risk losing your kids to the liberal disease. It's still a sacrifice to be an effective home schooling family but it's well worth it! permalink award report block reply\nTrustYourself 7 points 1 day ago I was homeschooled in the late 90s and it was seen as weird then.  I put myself through college so i didn't have time to be brainwashed, after and retired at 42/ semi.     I never forget what a bullet I dodged. permalink award report block reply\nMasterChief08 6 points 1 day ago 12% go to private school and 5% are homeschooling. Unfortunately that still leaves 83% getting leftwing indoctrination where they're taught Nelson Mandela was a hero and Joseph McCarthy was a villain. permalink award report block reply Froynlavenfroynlaven 3 points 1 day ago At least 83%.  Many private schools are trash also. permalink parent award report block reply\nFroynlavenfroynlaven 3 points 1 day ago At least 83%.  Many private schools are trash also. permalink parent award report block reply\nlawlady1776 6 points 1 day ago Homeschooling 4 grandchildren. With 3 more in the pipe! permalink award report block reply\nSmurfection 6 points 1 day ago This is the best option.  Raising kids at home teaching them your religion, your values and real skills along with all the knowledge the world has to offer which mostly the best of western civilization.  Not a single groomer to twist their minds.  Not a mythical horror scenario to scare them about Climate change.  .  No bullies.  No social stigma. No fads and \"everyone is doing it\" pressure. Here's my observations of homeschooled kids: They get along with all people of all generations.  I never seen a homeschool treat a younger kid like a pariah.  I've never seen a homeschool kids act \"awkward\" teenager around adults. Homeschoolers take their role in the family seriously.  They help out when needed and take responsibility for the whole family according to their development level. I dunno isn't a reply a homeschooler makes when asked a question, neither is nothin'.  Their curiosity, love of learning and wonder of the world isn't beaten out of them by lecturing teachers, factory style schools and concern for social status among peers. They are self motivated.  They are more focused.  They don't need constant validation.  A job well done a new skill acquired and mastered is reward enough. permalink award report block reply\nDev404 4 points 1 day ago Your kids aren't learning much in school beyond feminist propaganda which is mostly fuck white people, fuck men, fuck America, God is for imbeciles, Allah is okay because the oppressed muslims like him, and be gay - like really, really gay and as degenerate as possible, and don't tell your parents. That's the public school curriculum from kindergarten to high school. Then from college, it's be a whore, kill your baby, demand welfare, obey the government, and don't ask questions. That's our entire \"education\" system that's funded by the government who steals that money from us. permalink award report block reply Repentnow 2 points 1 day ago Who downvoted you? permalink parent award report block reply\nRepentnow 2 points 1 day ago Who downvoted you? permalink parent award report block reply\nEyer0ll 4 points 1 day ago Finally some good news this week permalink award report block reply\nMikehayes43 4 points 1 day ago Started our son two weeks ago.  Do not regret a minute of it permalink award report block reply\njonzor82 4 points 24 hours ago Maybe if we could get affordability back and not rely on a two-person income for a domestic life. permalink award report block reply\nConstantin2024 4 points 22 hours ago I will be homeschooling my two (so far) grandchildren as soon as they get old enough. I am their full time caregiver while their parents work. We live in a multi-generational home and are returning to more traditional family values and living. permalink award report block reply\nPastorCharles 3 points 1 day ago Just, please, if you're going to do it, DO IT WELL. Take it seriously. Plan. Borrow good ideas from a curriculum. No, your child shouldn't lead everything. No, they shouldn't decide what they're going to learn. That's what you are here for. They don't know what's important enough to know and what can be safely ignored. Home school is awesome. I'm doing it now. The \"unschool\" movement, though, is awful. It's moms giving themselves an excuse to not teach anything in the name of independence. permalink award report block reply\nForgottenUsername 3 points 22 hours ago And all 5 million of them are getting screwed on taxes for a product they aren't using.   The best way to kill public school would be to remove tax liability from home schoolers and people using private school, or maybe even people without children. Which seems more fair, but I don't really want to further discourage birthrate permalink award report block reply\nYz450f 3 points 1 day ago My experience with my child’s public school is the teachers never teach, but send the child home with ridiculous amounts of homework. Since they never teach, the parents must do it anyway. Then the teacher is off work at least 25% of the time with a random substitute teacher. Then there are the ridiculous amounts of half days and days off. The parents that can’t teach their children or donate want to will just get their children diagnosed with a learning disability. Once a child has a diagnosed learning disability the school gives up on that child. They get an automatic passing grade and they don’t have to do anything. Those children don’t affect the school’s ratings. If you plan to have children, just expect to homeschool. You are going to teach them anyway because the teachers won’t. permalink award report block reply\nItaintall 3 points 22 hours ago We homeschooled all of our kids; best decision we ever made. permalink award report block reply\nUnboosted 3 points 1 day ago Can we get a tax break yet? permalink award report block reply Jack_NC 1 points 20 hours ago Pfffft. No way. Someone's gotta pay for the government daycare (aka \"public school\"). permalink parent award report block reply\nJack_NC 1 points 20 hours ago Pfffft. No way. Someone's gotta pay for the government daycare (aka \"public school\"). permalink parent award report block reply\nTrumpOrTreason 3 points 23 hours ago There should be absolutley ZERO money going to public schools for students who are homeschooled. Any money that a public school is getting for student's in their district who don't attend public schools, should be paid directly to the parents doing the home schooling. We need to CUT OFF the left's funding. I will be writing expose reports for California documenting who and how much money is going from Calpers, Teachers Unions and other govt. entities directly to Democrat candidates, campaigns and committees. permalink award report block reply\nCastrosLittleBastard 3 points 1 day ago My kids thanked me for homeschooling them.  I would do it again, and if I live long enough to enjoy grandkids, I would homeschool them too! permalink award report block reply\nSnek_Plissken 2 points 1 day ago I wonder why? Could it be the education system has been ruined? permalink award report block reply\nAccipiterQ 2 points 23 hours ago We moved to new hampshire, from MA. If we had stayed in MA we'd be home schooling.  There is a based charter school in our town that we are probably going to go with.  One of the teachers actually got fired from another district for being \"too conservative\".  Anyway, what we found interesting is that since moving here, we have found TONS of home school families in our daughter's play groups.  Not like one or two, but over a dozen. permalink award report block reply\nShitsbrokeyo 2 points 1 day ago Good. We need strong leadership. Public school is skipping 30% of the kids permalink award report block reply\nNonbinaryPotatohead 2 points 1 day ago You NEVER get the time nor the chance to raise your kids again. Remember that! permalink award report block reply\nDCYR66 2 points 1 day ago Can’t blame them. Government schools are indoctrinating kids. permalink award report block reply\nRango 2 points 20 hours ago Does any of your tax go to pay for education? Does it go down proportionally due to opting out for homeschooling? permalink award report block reply\nncswicn 2 points 1 day ago 🎉 Wonderful! One of the best decisions I ever made was to homeschool. Go Parents!  🎉 permalink award report block reply\nBabyfaceposey 2 points 22 hours ago Wife and I were just discussing this for our soon to be grandson. permalink award report block reply\nJesse3000 1 points 19 hours ago Don't have any kids left to home school but I can say \"thank God\". permalink award report block reply\npepewarrior0102 1 points 1 day ago We shouldn't have to retreat though. Take back the schools. permalink award report block reply Repentnow 3 points 1 day ago Public education is a historical anomaly. It's unnatural. It's a complete abdication of parenting.  It doesn't need \"taken back\", it needs dismantled. permalink parent award report block reply\nRepentnow 3 points 1 day ago Public education is a historical anomaly. It's unnatural. It's a complete abdication of parenting.  It doesn't need \"taken back\", it needs dismantled. permalink parent award report block reply\nGrond999 1 points 21 hours ago Homeschool vs Tiktok. Tiktok (social media) leftist feminist algorithms will win in many cases...sadly. permalink award report block reply\nSpicy_cat 1 points 19 hours ago Always vote against funding government schools permalink award report block reply\nTrue_Curmudgeon 1 points 18 hours ago Homeschooled in the 90s checking in permalink award report block reply\nRFwolf5 1 points 1 day ago And they still collect your property tax for eduction and they dont care. permalink award report block reply\nDr_Phil 1 points 17 hours ago OP was homeschooled 🤣😂🫵 permalink award report block reply\ncarpetxparmesan 1 points 19 hours ago That's nice, now let's see Paul Allen's 1890s stats. permalink award report block reply\nborisborscht 1 points 21 hours ago I bet the kids today will all homeschool when they realize what they could have had permalink award report block reply\nDEPORT50M 1 points 4 hours ago Yeah but wait till you find out how many are Muslims that shouldn't be in this country permalink award report block reply\ncardinaldrones 1 points 14 hours ago It’s not because of parents of willingness to homeschool.   It’s because the public schools and most areas have gotten so black and Hispanic that there’s nowhere else to go.   That’s why school choice in the south is becoming a more popular thing and there’s charters popping up everywhere.   no amount of money will fix public schools after their past the racial tipping point.  So Florida realized that and decided to give parents vouchers for stage spending on education and pick whatever school they want to go to.  You can put it towards a private school and end up paying a lot less.   or you could put it into a charter school where they have work requirements or donation requirements from the parents that most black parents wouldn’t touch with a 10 foot pole. permalink award report block reply\nRemember_the_Alamo 1 points 18 hours ago Finally some good news! permalink award report block reply\nhillaryforprison 1 points 1 day ago yet we still have to pay the same or more in taxes to fund these cult indoctrination camps. Shut them down! permalink award report block reply\nNoSteppyonmyPepe 1 points 22 hours ago Good! These days,  everyone should homeschool.  Leaving your most precious possessions with strangers in a field full of predators and indoctrination is just crazy. permalink award report block reply\nBob_sacamanao 1 points 13 hours ago Pedophiles and pro fag-atry employees  have infested the public school system and public colleges! permalink award report block reply\nTooBright 1 points 1 day ago Should be mental asylum numbers like that. permalink award report block reply\nbluewhiteandred 1 points 24 hours ago homeschool is cool but like... if homeschoolers could join together with like homeschool co-ops, this is like private schooling with extra steps (homeschooling as a form of home private school) We need privatized public schooling and a ban on government public schooling permalink award report block reply\nBillbuttlickerr 1 points 23 hours ago In CT homeschooling is drawing criticism because some ghetto bitch signed her child up to be homeschooled then murdered her and hid her body in a bin. The mom used homeschooling tactically to not report the child’s whereabouts to certain agencies if I remember correctly. permalink award report block reply\nPeterThielAntiChrist 0 points 16 hours ago Homeschooled girls are more fucked up and suck better dick than catholic school girls. Its wild. Thanks homschool parents: i can't get hard with women my age anyway. permalink award report block reply\n0illuminated1 0 points 24 hours ago People who trust their children with strangers don't have love for their children. permalink award report block reply\nDr_Phil 0 points 17 hours ago You're retarded if you genuinely believe homeschooling is a good idea. permalink award report block reply\nbumpman -6 points 1 day ago Homeschooling is not based or even political, it just isn’t. Also, while there are bad Apple teachers I think school is overall a right place for kids, & is beneficial for learning and socializing permalink award report block reply Repentnow 3 points 1 day ago If your children are in public school, you are merely a legal custodian, not a parent. permalink parent award report block reply bumpman 0 points 21 hours ago If your children are homeschooled, you might be their parent, teacher, mentor and maybe their only friend. It could be a rude awakening for them and you when becomes time to go out into the real world when they grown up permalink parent award report block reply Repentnow 2 points 21 hours ago You simply don't understand the dynamic of homeschooling and a close family. permalink parent award report block reply\nRepentnow 3 points 1 day ago If your children are in public school, you are merely a legal custodian, not a parent. permalink parent award report block reply bumpman 0 points 21 hours ago If your children are homeschooled, you might be their parent, teacher, mentor and maybe their only friend. It could be a rude awakening for them and you when becomes time to go out into the real world when they grown up permalink parent award report block reply Repentnow 2 points 21 hours ago You simply don't understand the dynamic of homeschooling and a close family. permalink parent award report block reply\nbumpman 0 points 21 hours ago If your children are homeschooled, you might be their parent, teacher, mentor and maybe their only friend. It could be a rude awakening for them and you when becomes time to go out into the real world when they grown up permalink parent award report block reply Repentnow 2 points 21 hours ago You simply don't understand the dynamic of homeschooling and a close family. permalink parent award report block reply\nRepentnow 2 points 21 hours ago You simply don't understand the dynamic of homeschooling and a close family. permalink parent award report block reply\nNate_Higgersalot -37 points 1 day ago Why is it the parents of homeschooled kids don’t recognize that their kids are socially retarded? permalink award report block reply Mungo 26 points 1 day ago Seems you’re the retard. permalink parent award report block reply GuerillaYourDreams 14 points 1 day ago Many districts have arrangements where the kids meet together part of the week. We have it here; therefore there is no “socially retarded”. Unlike some people on social media. permalink parent award report block reply ElectionMeddler 14 points 1 day ago Public schools passed the weird creepy kid stage a decade ago.  Unless you like having your 8 year old tell you how they are trans now.  Doesn't help that CA will charge you criminally if you resist their brainwashing. permalink parent award report block reply IncredibleMrE1 14 points 1 day ago Socially retarded, like the public schooled kids who have all been transmogrified? permalink parent award report block reply learntocode 13 points 1 day ago I have had the opposite personal experience. permalink parent award report block reply load 10 more comments...\nMungo 26 points 1 day ago Seems you’re the retard. permalink parent award report block reply\nGuerillaYourDreams 14 points 1 day ago Many districts have arrangements where the kids meet together part of the week. We have it here; therefore there is no “socially retarded”. Unlike some people on social media. permalink parent award report block reply\nElectionMeddler 14 points 1 day ago Public schools passed the weird creepy kid stage a decade ago.  Unless you like having your 8 year old tell you how they are trans now.  Doesn't help that CA will charge you criminally if you resist their brainwashing. permalink parent award report block reply\nIncredibleMrE1 14 points 1 day ago Socially retarded, like the public schooled kids who have all been transmogrified? permalink parent award report block reply\nlearntocode 13 points 1 day ago I have had the opposite personal experience. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:04:31.492060Z"
}