{
  "id": "8181041",
  "title": "1270Stunning admission on the Senate floor as Sen. Dick Durbin (D) announces Democrats privately KNE",
  "url": "https://patriots.win/p/1ARK9iq7lp/stunning-admission-on-the-senate/c",
  "content": "1270 Stunning admission on the Senate floor as Sen. Dick Durbin (D) announces Democrats privately KNEW they were about to starve children and cause even more harm to Americans by shutting down the government. posted 2 days ago by kek_saved_the_world 89 comments award share report block Eric Daugherty @EricLDaugh • 2d 🚨 JUST NOW: Stunning admission on the Senate floor as Sen. Dick Durbin (D) announces Democrats privately KNEW they were about to starve children and cause even more harm to Americans by shutting down the government. Wow. They are cooked. https://t.co/e8s0kwGuim \"[I] cannot\n89 comments Sort by Top Top New Worst Old Save redditadminssuckit 68 points 2 days ago I think the bigger headline is that literally said shutting down the government was all about protesting Trump. permalink award report block reply EgregiousPhilbin 27 points 2 days ago And if people starve, so be it. They probably weren't anti Trump enough anyway. These people are insane. But wait, there's more. The people who were left to starve, they'll keep voting for their starvers. permalink parent award report block reply anotherthing 13 points 2 days ago They burned their own cities down in 2020 to rig an election. Party of the Little Guy, am I right? permalink parent award report block reply The_Return_of_User_x 4 points 2 days ago Dick Turban permalink parent award report block reply Trump454748 2 points 2 days ago Just remember, Dick Durban before he dicks you permalink parent award report block reply view 1 more comments... DeportThemAllForever -3 points 2 days ago They undid all Trumps firings too.  Saddened by that. permalink parent award report block reply Yawnz13 3 points 2 days ago Still has to pass the House and Trump.  Nothing's happened to the firings yet and it doesn't affect anyone who took the offer to quit in exchange for whatever. https://www.appropriations.senate.gov/imo/media/doc/continuing_appropriations_act_2026_bill_text.pdf permalink parent award report block reply Modern_Times 2 points 2 days ago They can pass whatever they like but President Trump has to sign it for it to be enacted. permalink parent award report block reply The_Return_of_User_x 3 points 2 days ago Or... Or. As Pelosi said... \"You gotta sign it before you can read it.\" permalink parent award report block reply josiborg 41 points 2 days ago REPEAL OBAMACARE!! NOTHING LESS permalink award report block reply LaVaughnRobinson 17 points 2 days ago Nuke HealthCare, entire system neeeds to be fucking gutted including Pharma. permalink parent award report block reply austford 35 points 2 days ago Not sure if they are 'cooked'... Dems still voted for Jay Jones after he fantasized about murdering children... starving children is a walk in the park for the left. permalink award report block reply bill_in_texas 10 points 2 days ago That's a feature, not a bug.  VA voters have the same hate in their hearts Jones has, apparently. permalink parent award report block reply AlaskanCentipede 11 points 2 days ago Especially Northern Virginia, the home of many deep staters and other federal employees who work in DC but don't want to live near blacks permalink parent award report block reply bill_in_texas 2 points 2 days ago The black federal employees live in College Park, Maryland, I'm guessing? permalink parent award report block reply 2scoops2peachmints 1 points 2 days ago Bowie permalink parent award report block reply 2scoops2peachmints 1 points 2 days ago All Dem voters have this feature permalink parent award report block reply LibtardBusterMAGA 6 points 2 days ago Dems eat kids, can care less about starving them permalink parent award report block reply genericamerican69 1 points 2 days ago The same people screaming about children being killed in war or children being \"stripped\" from their families for immigration enforcement, etc.. permalink parent award report block reply vegaspatriot1776 1 points 2 days ago Jones was losing bigly until 800pm in VA. Then, a massive vote dump surged him into the lead. Just like 2020! permalink parent award report block reply KOMMISSARofMAGA 23 points 2 days ago They’re not cooked. Liberals would still vote for them if they nailed babies to trees and posted it on the internet. permalink award report block reply anotherthing 4 points 2 days ago They had a Free Abortion and Sterilization Bus at their convention. The only thing missing are the trees and pictures. permalink parent award report block reply Uncommon 17 points 2 days ago They only caved bc they’re scared we might actually blow up the filibuster. If we don’t end the filibuster, nothing else matters. permalink award report block reply EgregiousPhilbin 5 points 2 days ago The problem with killing the filibuster is the RINOs wouldnt do anything with the opportunity. No bold moves, no agenda push, nothing. And then power switches because who the fuck would vote for them any more after that? Wait, sorry. You faggots would. permalink parent award report block reply Appeal2Heaven98 1 points 2 days ago Not voting is Doomer shit, though, according to some people on this site. And if we all show up and try to primary the RINOs, and said RINO is still in place, it's still somehow our fault for not being energized enough to go out and vote. permalink parent award report block reply EgregiousPhilbin 1 points 2 days ago My stance is simple. Earn my vote and represent my interests. If you refuse to do that, I refuse to vote for you. So simple. permalink parent award report block reply DieHeretic 1 points 2 days ago What's your gauge? 80/20 your way? 65/35? Or are you a purist, 100% of what you want from a candidate or you stay home? permalink parent award report block reply Snek_Plissken 0 points 2 days ago They almost lost their leverage. They will be taking that one away when they get any power. permalink parent award report block reply Klaus73 3 points 2 days ago I mean tactically they are regrouping. Thing is - theres enough pain that folks will be talking about this during thanksgiving; as the republicans are \"in charge\" they will get more blame most likely. If the shutdown persisted through christmas you can be damn sure that dems would be getting shit. If the republicans don't cede on the ACA then the democrats are going to tell the public that everyone is getting increased healthcare costs for christmas! Furthermore at the end of January they will demand it be put into law regardless; if the republicans refuse then your back into a shutdown as midterms will draw closer and closer everyday and really all the democrats will do is repeat \"ACA\" and how the mid december vote arguments against it were in bad faith...or hell; if Thune doesn't keep his word then the republicans are basically fucked. permalink parent award report block reply Toohershat 8 points 2 days ago Durbin has aged like Biden. permalink award report block reply Insatiable 8 points 2 days ago Did he say 29 years? GTFO bro permalink award report block reply MeMargie 2 points 2 days ago He needs an Audit. permalink parent award report block reply deleted 7 points 2 days ago TiggerLovingPooh 3 points 2 days ago Is that what's happening? If so, that is indeed colossally fucking gay. permalink parent award report block reply AdmrlNelson 4 points 2 days ago He mentions it as a concession to end the shutdown permalink parent award report block reply joggin_noggin 3 points 2 days ago Might be the temporary layoffs - after 60 days of shutdown they can legally become permanent, but if the government is funded by day 59 then they can return. I'm speculating here because I haven't gone out to read the relevant sections of the US Code but it would appear that the Dems were concerned that we'd actually get to day 60 if they didn't agree to let the CR pass the Senate, and Donald Trump would have carte blanche to shutter entire agencies at that point, with no more than an agency head and a few trusted deputies left for the next three years. I wanted that outcome. It would've been glorious to reduce the federal payrolls by millions and deal real, permanent damage to the administrative state. permalink parent award report block reply AdmrlNelson 3 points 2 days ago You're not missing anything. Republicans fucked us over yet again. Feckless, worthless, losers. permalink parent award report block reply yarg 3 points 2 days ago Nobody starved. If anything they were just more embarrassed getting their handouts, as they should be. permalink award report block reply sun_wolf 3 points 2 days ago The rhetoric is so hysterical. A couple people might have had to pay for their Cheetos with a credit card. That’s the modern definition of “starving”. permalink parent award report block reply Dev404 3 points 2 days ago As if either party in Congress cares about any of us beyond collecting our taxes for them to spend on their luxurious lifestyles. If they could replace us all with machines and starve us all to death while collecting the money made from the machines, they'd do it. However, that pesky 2nd amendment makes them nervous so they'll never stop trying to take it away. permalink award report block reply Scot 3 points 2 days ago President Trump had over a month to fire more leftist traitors. He should not have threatened it if he had no plan on ever following through. permalink award report block reply TiggerLovingPooh 3 points 2 days ago Why does CSPAN have some faggot ass \"government shutdown\" clock on the screen. It's like the COVID deathtoll shit. Fuck ALL media. permalink award report block reply Squentin 2 points 2 days ago People starving didn't motivate anyone.  Being slightly inconvenienced in traveling by air and they all ran to pass something. permalink award report block reply Michalusmichalus 1 points 2 days ago The air traffic problem leaked into other countries. permalink parent award report block reply KernalMustard 2 points 2 days ago You believe this known liar? permalink award report block reply 2scoops2peachmints 2 points 2 days ago How are they cooked, they’re followers literally don’t give a flying fuck about the children and are more pissed that the dems caved to Trump. Mid terms are gonna be fucking ugly for us. permalink award report block reply Trunks 2 points 2 days ago Am I the only one pissed about the rehiring with backpay? permalink award report block reply tlorsung 2 points 2 days ago I'll never vote for a Democrat; Democrat burn the bridge to my vote!  If they take Democrat's Money from their own pocket, and rebuild the Bridge We can Talk, but I need to see their wealthy Life style decrease before getting my vote!   To Earn my vote Public service should NEVER become wealthier to serve!   RINO are included also.   Trump and Kennedy are the only ones not becoming wealthier in service! permalink award report block reply Fren20 2 points 2 days ago I don't want illegals getting rent assistance or food stamps...send the leeches  home..the mother and fathers and all the kids home,now they are not Americans they will Schills dummies into believing these are Americans off of foods stamps because they are on America  read between the lines.no  illegals on health care or rental assistance or food ebt 💯💯💯💯💯💯💯💯 permalink award report block reply mass55th 2 points 2 days ago Yeah, like RATS worry about starving children, when they want to  abort them up to, and including birth. Fucking liars. permalink award report block reply hillaryforprison 2 points 2 days ago What does he mean reverse the mass firings? Is he lying? permalink award report block reply Markosis17 2 points 2 days ago I was just starting to get used to this beautiful blue sky…….. it was nice while it lasted. permalink award report block reply Bubbahax 1 points 2 days ago That ancient fuck didnt admit anything and tried to take credit for saving jobs. permalink award report block reply y_do_i_need_to_hide 1 points 2 days ago Thanks, I hate it. permalink award report block reply gaijin_ronin 1 points 2 days ago Why the hell would you promise these pieces of crap anything?  In other words, we'll get screwed over come January. permalink award report block reply Middleagedpatriot 1 points 2 days ago Doesn't matter - the vibe has been shifting. My X account gives me nothing but anti trump and this populist left bullshit. This black pill is going in on both ends at this point. permalink award report block reply genericamerican69 1 points 2 days ago Even though I understand the arguments about gay marriage I am never the less glad to see the scotus refuse to hear it again. It would have given so much ammunition and motivation to the globos, similar to the abortion BS that happened in '22 and I oppose abortion as well permalink award report block reply MatterThatMetals 1 points 2 days ago Dirty dogs. Diseased even. They should be put down. permalink award report block reply MatterThatMetals 1 points 2 days ago Just wait til the retards find out these people do horrible things to children. permalink award report block reply keeptherepublic1776 1 points 2 days ago Who do you think will see this? No one will permalink award report block reply Klaus73 1 points 2 days ago Errr that video doesn't support that claim. It does admit the democrats were protesting administration policy. God damn I hate clickbait shit. permalink award report block reply Rusty_Bungus 1 points 2 days ago They aren't stupid...they're evil. permalink award report block reply Constitution_1788 1 points 2 days ago They got absolutely steamrolled. It’s glorious. permalink award report block reply Induceddrag 1 points 2 days ago What I don’t understand is that people actually believe these 8 senators suddenly switched sides on this bill.  I fully believe that Schumer and his inner circle decided they were losing and assembled a group of senators to pass the CR. This is all political theater and many of the pundits from both sides seem a bit daft taking the votes on their face value.  Neither side wanted any of the blame for widespread airline chaos over the Thanksgiving holidays. permalink award report block reply Belleoffreedom 1 points 2 days ago Durbin was not his usual self as he read that statement.  I wonder what happened to him. permalink award report block reply DieHeretic 1 points 2 days ago He's 80 years old and in rapid physical decline.\nDurbin has already announced his retirement and will not seek a sixth term in the midterms.\nHis current term will end in January 2027. I'd give odds he won't make it, he looks like cancer is eating on him. permalink parent award report block reply TheDevilMonkey 1 points 2 days ago Only thing \"cooked\" is 3/4 of the brains around here... permalink award report block reply booblitchutz 3 points 2 days ago Wasn't Eric Daugherty one of the accounts that was busted taking bribes from soda companies? permalink parent award report block reply henri_derelicte 1 points 2 days ago He gets stickied a lot for some reason… permalink parent award report block reply booblitchutz 1 points 2 days ago There's not a very big ecosystem of \"MAGA influencers\". Even the ones that are disgraced like him still have a shit ton of followers on X. permalink parent award report block reply TheDevilMonkey 1 points 2 days ago I think he was. permalink parent award report block reply booblitchutz 2 points 2 days ago I just looked it up, he was, along with Ian Miles Cheong, Clown World and a few others.  Apparently Riley Gaines told them to fuck off. permalink parent award report block reply TheDevilMonkey 1 points 2 days ago Lmfao. permalink parent award report block reply DieHeretic 1 points 2 days ago I know it won't happen as Thune is a gutless wonder, but as soon as the vote is taken on the continuing resolution Thune should fuck the democrats right in the ass with red-hot poker and renege on any other part of the deal. permalink award report block reply Gonzotron5000 1 points 2 days ago When I was you g in the 90s the Democrats claimed the Republicans wanted to starve children because they wanted to cut school lumch programs. Then they roasted school lunches for being horrible. Now they (the democrats) are actually starving children. permalink award report block reply 74lampshades 1 points 2 days ago \"Starve children\". Yeah, I don't buy that. No kid is going to die of hunger. permalink award report block reply sun_wolf 1 points 2 days ago I doubt anyone even lost 5 pounds. permalink parent award report block reply Its_Time 0 points 2 days ago So both parties deprived children of food to score poltical points.  All of them despicable. permalink award report block reply DieHeretic 1 points 2 days ago Not one child was deprived of food by the government, their parents refusing to get a job did that. permalink parent award report block reply Rudy_DankMemer 0 points 2 days ago Starvation I'm still waiting for photographic evidence of one single American becoming emaciated during the last 30 days. Fuck this farce. permalink award report block reply HoganT 0 points 2 days ago Oh, so we support SNAP now and were trying to defend it? Such disingenuous bullshit going around here. permalink award report block reply ModernKnight 4 points 2 days ago Agreed.  None of these kids are starving, they're fat.  We need to get rid of all gibs. permalink parent award report block reply berserkerbarrage 2 points 2 days ago The Democrats shut down the government and deliberately defunded SNAP so that they could falsely blame Trump and the Republicans. Whether or not I personally support SNAP is irrelevant to the conversation. permalink parent award report block reply HoganT 0 points 2 days ago From the overwhelming consensus here the past few weeks, they did us a huge favor then and did something we desperately want done but would never have to balls to do. permalink parent award report block reply conservativefrank -2 points 2 days ago Meanwhile, Newsome is the next President. permalink award report block reply\nredditadminssuckit 68 points 2 days ago I think the bigger headline is that literally said shutting down the government was all about protesting Trump. permalink award report block reply EgregiousPhilbin 27 points 2 days ago And if people starve, so be it. They probably weren't anti Trump enough anyway. These people are insane. But wait, there's more. The people who were left to starve, they'll keep voting for their starvers. permalink parent award report block reply anotherthing 13 points 2 days ago They burned their own cities down in 2020 to rig an election. Party of the Little Guy, am I right? permalink parent award report block reply The_Return_of_User_x 4 points 2 days ago Dick Turban permalink parent award report block reply Trump454748 2 points 2 days ago Just remember, Dick Durban before he dicks you permalink parent award report block reply view 1 more comments... DeportThemAllForever -3 points 2 days ago They undid all Trumps firings too.  Saddened by that. permalink parent award report block reply Yawnz13 3 points 2 days ago Still has to pass the House and Trump.  Nothing's happened to the firings yet and it doesn't affect anyone who took the offer to quit in exchange for whatever. https://www.appropriations.senate.gov/imo/media/doc/continuing_appropriations_act_2026_bill_text.pdf permalink parent award report block reply Modern_Times 2 points 2 days ago They can pass whatever they like but President Trump has to sign it for it to be enacted. permalink parent award report block reply The_Return_of_User_x 3 points 2 days ago Or... Or. As Pelosi said... \"You gotta sign it before you can read it.\" permalink parent award report block reply\nEgregiousPhilbin 27 points 2 days ago And if people starve, so be it. They probably weren't anti Trump enough anyway. These people are insane. But wait, there's more. The people who were left to starve, they'll keep voting for their starvers. permalink parent award report block reply anotherthing 13 points 2 days ago They burned their own cities down in 2020 to rig an election. Party of the Little Guy, am I right? permalink parent award report block reply The_Return_of_User_x 4 points 2 days ago Dick Turban permalink parent award report block reply Trump454748 2 points 2 days ago Just remember, Dick Durban before he dicks you permalink parent award report block reply view 1 more comments...\nanotherthing 13 points 2 days ago They burned their own cities down in 2020 to rig an election. Party of the Little Guy, am I right? permalink parent award report block reply The_Return_of_User_x 4 points 2 days ago Dick Turban permalink parent award report block reply Trump454748 2 points 2 days ago Just remember, Dick Durban before he dicks you permalink parent award report block reply view 1 more comments...\nThe_Return_of_User_x 4 points 2 days ago Dick Turban permalink parent award report block reply Trump454748 2 points 2 days ago Just remember, Dick Durban before he dicks you permalink parent award report block reply view 1 more comments...\nTrump454748 2 points 2 days ago Just remember, Dick Durban before he dicks you permalink parent award report block reply view 1 more comments...\nDeportThemAllForever -3 points 2 days ago They undid all Trumps firings too.  Saddened by that. permalink parent award report block reply Yawnz13 3 points 2 days ago Still has to pass the House and Trump.  Nothing's happened to the firings yet and it doesn't affect anyone who took the offer to quit in exchange for whatever. https://www.appropriations.senate.gov/imo/media/doc/continuing_appropriations_act_2026_bill_text.pdf permalink parent award report block reply Modern_Times 2 points 2 days ago They can pass whatever they like but President Trump has to sign it for it to be enacted. permalink parent award report block reply The_Return_of_User_x 3 points 2 days ago Or... Or. As Pelosi said... \"You gotta sign it before you can read it.\" permalink parent award report block reply\nYawnz13 3 points 2 days ago Still has to pass the House and Trump.  Nothing's happened to the firings yet and it doesn't affect anyone who took the offer to quit in exchange for whatever. https://www.appropriations.senate.gov/imo/media/doc/continuing_appropriations_act_2026_bill_text.pdf permalink parent award report block reply\nModern_Times 2 points 2 days ago They can pass whatever they like but President Trump has to sign it for it to be enacted. permalink parent award report block reply The_Return_of_User_x 3 points 2 days ago Or... Or. As Pelosi said... \"You gotta sign it before you can read it.\" permalink parent award report block reply\nThe_Return_of_User_x 3 points 2 days ago Or... Or. As Pelosi said... \"You gotta sign it before you can read it.\" permalink parent award report block reply\njosiborg 41 points 2 days ago REPEAL OBAMACARE!! NOTHING LESS permalink award report block reply LaVaughnRobinson 17 points 2 days ago Nuke HealthCare, entire system neeeds to be fucking gutted including Pharma. permalink parent award report block reply\nLaVaughnRobinson 17 points 2 days ago Nuke HealthCare, entire system neeeds to be fucking gutted including Pharma. permalink parent award report block reply\naustford 35 points 2 days ago Not sure if they are 'cooked'... Dems still voted for Jay Jones after he fantasized about murdering children... starving children is a walk in the park for the left. permalink award report block reply bill_in_texas 10 points 2 days ago That's a feature, not a bug.  VA voters have the same hate in their hearts Jones has, apparently. permalink parent award report block reply AlaskanCentipede 11 points 2 days ago Especially Northern Virginia, the home of many deep staters and other federal employees who work in DC but don't want to live near blacks permalink parent award report block reply bill_in_texas 2 points 2 days ago The black federal employees live in College Park, Maryland, I'm guessing? permalink parent award report block reply 2scoops2peachmints 1 points 2 days ago Bowie permalink parent award report block reply 2scoops2peachmints 1 points 2 days ago All Dem voters have this feature permalink parent award report block reply LibtardBusterMAGA 6 points 2 days ago Dems eat kids, can care less about starving them permalink parent award report block reply genericamerican69 1 points 2 days ago The same people screaming about children being killed in war or children being \"stripped\" from their families for immigration enforcement, etc.. permalink parent award report block reply vegaspatriot1776 1 points 2 days ago Jones was losing bigly until 800pm in VA. Then, a massive vote dump surged him into the lead. Just like 2020! permalink parent award report block reply\nbill_in_texas 10 points 2 days ago That's a feature, not a bug.  VA voters have the same hate in their hearts Jones has, apparently. permalink parent award report block reply AlaskanCentipede 11 points 2 days ago Especially Northern Virginia, the home of many deep staters and other federal employees who work in DC but don't want to live near blacks permalink parent award report block reply bill_in_texas 2 points 2 days ago The black federal employees live in College Park, Maryland, I'm guessing? permalink parent award report block reply 2scoops2peachmints 1 points 2 days ago Bowie permalink parent award report block reply 2scoops2peachmints 1 points 2 days ago All Dem voters have this feature permalink parent award report block reply\nAlaskanCentipede 11 points 2 days ago Especially Northern Virginia, the home of many deep staters and other federal employees who work in DC but don't want to live near blacks permalink parent award report block reply bill_in_texas 2 points 2 days ago The black federal employees live in College Park, Maryland, I'm guessing? permalink parent award report block reply 2scoops2peachmints 1 points 2 days ago Bowie permalink parent award report block reply\nbill_in_texas 2 points 2 days ago The black federal employees live in College Park, Maryland, I'm guessing? permalink parent award report block reply 2scoops2peachmints 1 points 2 days ago Bowie permalink parent award report block reply\n2scoops2peachmints 1 points 2 days ago Bowie permalink parent award report block reply\n2scoops2peachmints 1 points 2 days ago All Dem voters have this feature permalink parent award report block reply\nLibtardBusterMAGA 6 points 2 days ago Dems eat kids, can care less about starving them permalink parent award report block reply\ngenericamerican69 1 points 2 days ago The same people screaming about children being killed in war or children being \"stripped\" from their families for immigration enforcement, etc.. permalink parent award report block reply\nvegaspatriot1776 1 points 2 days ago Jones was losing bigly until 800pm in VA. Then, a massive vote dump surged him into the lead. Just like 2020! permalink parent award report block reply\nKOMMISSARofMAGA 23 points 2 days ago They’re not cooked. Liberals would still vote for them if they nailed babies to trees and posted it on the internet. permalink award report block reply anotherthing 4 points 2 days ago They had a Free Abortion and Sterilization Bus at their convention. The only thing missing are the trees and pictures. permalink parent award report block reply\nanotherthing 4 points 2 days ago They had a Free Abortion and Sterilization Bus at their convention. The only thing missing are the trees and pictures. permalink parent award report block reply\nUncommon 17 points 2 days ago They only caved bc they’re scared we might actually blow up the filibuster. If we don’t end the filibuster, nothing else matters. permalink award report block reply EgregiousPhilbin 5 points 2 days ago The problem with killing the filibuster is the RINOs wouldnt do anything with the opportunity. No bold moves, no agenda push, nothing. And then power switches because who the fuck would vote for them any more after that? Wait, sorry. You faggots would. permalink parent award report block reply Appeal2Heaven98 1 points 2 days ago Not voting is Doomer shit, though, according to some people on this site. And if we all show up and try to primary the RINOs, and said RINO is still in place, it's still somehow our fault for not being energized enough to go out and vote. permalink parent award report block reply EgregiousPhilbin 1 points 2 days ago My stance is simple. Earn my vote and represent my interests. If you refuse to do that, I refuse to vote for you. So simple. permalink parent award report block reply DieHeretic 1 points 2 days ago What's your gauge? 80/20 your way? 65/35? Or are you a purist, 100% of what you want from a candidate or you stay home? permalink parent award report block reply Snek_Plissken 0 points 2 days ago They almost lost their leverage. They will be taking that one away when they get any power. permalink parent award report block reply Klaus73 3 points 2 days ago I mean tactically they are regrouping. Thing is - theres enough pain that folks will be talking about this during thanksgiving; as the republicans are \"in charge\" they will get more blame most likely. If the shutdown persisted through christmas you can be damn sure that dems would be getting shit. If the republicans don't cede on the ACA then the democrats are going to tell the public that everyone is getting increased healthcare costs for christmas! Furthermore at the end of January they will demand it be put into law regardless; if the republicans refuse then your back into a shutdown as midterms will draw closer and closer everyday and really all the democrats will do is repeat \"ACA\" and how the mid december vote arguments against it were in bad faith...or hell; if Thune doesn't keep his word then the republicans are basically fucked. permalink parent award report block reply\nEgregiousPhilbin 5 points 2 days ago The problem with killing the filibuster is the RINOs wouldnt do anything with the opportunity. No bold moves, no agenda push, nothing. And then power switches because who the fuck would vote for them any more after that? Wait, sorry. You faggots would. permalink parent award report block reply Appeal2Heaven98 1 points 2 days ago Not voting is Doomer shit, though, according to some people on this site. And if we all show up and try to primary the RINOs, and said RINO is still in place, it's still somehow our fault for not being energized enough to go out and vote. permalink parent award report block reply EgregiousPhilbin 1 points 2 days ago My stance is simple. Earn my vote and represent my interests. If you refuse to do that, I refuse to vote for you. So simple. permalink parent award report block reply DieHeretic 1 points 2 days ago What's your gauge? 80/20 your way? 65/35? Or are you a purist, 100% of what you want from a candidate or you stay home? permalink parent award report block reply\nAppeal2Heaven98 1 points 2 days ago Not voting is Doomer shit, though, according to some people on this site. And if we all show up and try to primary the RINOs, and said RINO is still in place, it's still somehow our fault for not being energized enough to go out and vote. permalink parent award report block reply EgregiousPhilbin 1 points 2 days ago My stance is simple. Earn my vote and represent my interests. If you refuse to do that, I refuse to vote for you. So simple. permalink parent award report block reply DieHeretic 1 points 2 days ago What's your gauge? 80/20 your way? 65/35? Or are you a purist, 100% of what you want from a candidate or you stay home? permalink parent award report block reply\nEgregiousPhilbin 1 points 2 days ago My stance is simple. Earn my vote and represent my interests. If you refuse to do that, I refuse to vote for you. So simple. permalink parent award report block reply DieHeretic 1 points 2 days ago What's your gauge? 80/20 your way? 65/35? Or are you a purist, 100% of what you want from a candidate or you stay home? permalink parent award report block reply\nDieHeretic 1 points 2 days ago What's your gauge? 80/20 your way? 65/35? Or are you a purist, 100% of what you want from a candidate or you stay home? permalink parent award report block reply\nSnek_Plissken 0 points 2 days ago They almost lost their leverage. They will be taking that one away when they get any power. permalink parent award report block reply Klaus73 3 points 2 days ago I mean tactically they are regrouping. Thing is - theres enough pain that folks will be talking about this during thanksgiving; as the republicans are \"in charge\" they will get more blame most likely. If the shutdown persisted through christmas you can be damn sure that dems would be getting shit. If the republicans don't cede on the ACA then the democrats are going to tell the public that everyone is getting increased healthcare costs for christmas! Furthermore at the end of January they will demand it be put into law regardless; if the republicans refuse then your back into a shutdown as midterms will draw closer and closer everyday and really all the democrats will do is repeat \"ACA\" and how the mid december vote arguments against it were in bad faith...or hell; if Thune doesn't keep his word then the republicans are basically fucked. permalink parent award report block reply\nKlaus73 3 points 2 days ago I mean tactically they are regrouping. Thing is - theres enough pain that folks will be talking about this during thanksgiving; as the republicans are \"in charge\" they will get more blame most likely. If the shutdown persisted through christmas you can be damn sure that dems would be getting shit. If the republicans don't cede on the ACA then the democrats are going to tell the public that everyone is getting increased healthcare costs for christmas! Furthermore at the end of January they will demand it be put into law regardless; if the republicans refuse then your back into a shutdown as midterms will draw closer and closer everyday and really all the democrats will do is repeat \"ACA\" and how the mid december vote arguments against it were in bad faith...or hell; if Thune doesn't keep his word then the republicans are basically fucked. permalink parent award report block reply\nToohershat 8 points 2 days ago Durbin has aged like Biden. permalink award report block reply\nInsatiable 8 points 2 days ago Did he say 29 years? GTFO bro permalink award report block reply MeMargie 2 points 2 days ago He needs an Audit. permalink parent award report block reply\nMeMargie 2 points 2 days ago He needs an Audit. permalink parent award report block reply\ndeleted 7 points 2 days ago TiggerLovingPooh 3 points 2 days ago Is that what's happening? If so, that is indeed colossally fucking gay. permalink parent award report block reply AdmrlNelson 4 points 2 days ago He mentions it as a concession to end the shutdown permalink parent award report block reply joggin_noggin 3 points 2 days ago Might be the temporary layoffs - after 60 days of shutdown they can legally become permanent, but if the government is funded by day 59 then they can return. I'm speculating here because I haven't gone out to read the relevant sections of the US Code but it would appear that the Dems were concerned that we'd actually get to day 60 if they didn't agree to let the CR pass the Senate, and Donald Trump would have carte blanche to shutter entire agencies at that point, with no more than an agency head and a few trusted deputies left for the next three years. I wanted that outcome. It would've been glorious to reduce the federal payrolls by millions and deal real, permanent damage to the administrative state. permalink parent award report block reply AdmrlNelson 3 points 2 days ago You're not missing anything. Republicans fucked us over yet again. Feckless, worthless, losers. permalink parent award report block reply\nTiggerLovingPooh 3 points 2 days ago Is that what's happening? If so, that is indeed colossally fucking gay. permalink parent award report block reply AdmrlNelson 4 points 2 days ago He mentions it as a concession to end the shutdown permalink parent award report block reply\nAdmrlNelson 4 points 2 days ago He mentions it as a concession to end the shutdown permalink parent award report block reply\njoggin_noggin 3 points 2 days ago Might be the temporary layoffs - after 60 days of shutdown they can legally become permanent, but if the government is funded by day 59 then they can return. I'm speculating here because I haven't gone out to read the relevant sections of the US Code but it would appear that the Dems were concerned that we'd actually get to day 60 if they didn't agree to let the CR pass the Senate, and Donald Trump would have carte blanche to shutter entire agencies at that point, with no more than an agency head and a few trusted deputies left for the next three years. I wanted that outcome. It would've been glorious to reduce the federal payrolls by millions and deal real, permanent damage to the administrative state. permalink parent award report block reply\nAdmrlNelson 3 points 2 days ago You're not missing anything. Republicans fucked us over yet again. Feckless, worthless, losers. permalink parent award report block reply\nyarg 3 points 2 days ago Nobody starved. If anything they were just more embarrassed getting their handouts, as they should be. permalink award report block reply sun_wolf 3 points 2 days ago The rhetoric is so hysterical. A couple people might have had to pay for their Cheetos with a credit card. That’s the modern definition of “starving”. permalink parent award report block reply\nsun_wolf 3 points 2 days ago The rhetoric is so hysterical. A couple people might have had to pay for their Cheetos with a credit card. That’s the modern definition of “starving”. permalink parent award report block reply\nDev404 3 points 2 days ago As if either party in Congress cares about any of us beyond collecting our taxes for them to spend on their luxurious lifestyles. If they could replace us all with machines and starve us all to death while collecting the money made from the machines, they'd do it. However, that pesky 2nd amendment makes them nervous so they'll never stop trying to take it away. permalink award report block reply\nScot 3 points 2 days ago President Trump had over a month to fire more leftist traitors. He should not have threatened it if he had no plan on ever following through. permalink award report block reply\nTiggerLovingPooh 3 points 2 days ago Why does CSPAN have some faggot ass \"government shutdown\" clock on the screen. It's like the COVID deathtoll shit. Fuck ALL media. permalink award report block reply\nSquentin 2 points 2 days ago People starving didn't motivate anyone.  Being slightly inconvenienced in traveling by air and they all ran to pass something. permalink award report block reply Michalusmichalus 1 points 2 days ago The air traffic problem leaked into other countries. permalink parent award report block reply\nMichalusmichalus 1 points 2 days ago The air traffic problem leaked into other countries. permalink parent award report block reply\nKernalMustard 2 points 2 days ago You believe this known liar? permalink award report block reply\n2scoops2peachmints 2 points 2 days ago How are they cooked, they’re followers literally don’t give a flying fuck about the children and are more pissed that the dems caved to Trump. Mid terms are gonna be fucking ugly for us. permalink award report block reply\nTrunks 2 points 2 days ago Am I the only one pissed about the rehiring with backpay? permalink award report block reply\ntlorsung 2 points 2 days ago I'll never vote for a Democrat; Democrat burn the bridge to my vote!  If they take Democrat's Money from their own pocket, and rebuild the Bridge We can Talk, but I need to see their wealthy Life style decrease before getting my vote!   To Earn my vote Public service should NEVER become wealthier to serve!   RINO are included also.   Trump and Kennedy are the only ones not becoming wealthier in service! permalink award report block reply\nFren20 2 points 2 days ago I don't want illegals getting rent assistance or food stamps...send the leeches  home..the mother and fathers and all the kids home,now they are not Americans they will Schills dummies into believing these are Americans off of foods stamps because they are on America  read between the lines.no  illegals on health care or rental assistance or food ebt 💯💯💯💯💯💯💯💯 permalink award report block reply\nmass55th 2 points 2 days ago Yeah, like RATS worry about starving children, when they want to  abort them up to, and including birth. Fucking liars. permalink award report block reply\nhillaryforprison 2 points 2 days ago What does he mean reverse the mass firings? Is he lying? permalink award report block reply\nMarkosis17 2 points 2 days ago I was just starting to get used to this beautiful blue sky…….. it was nice while it lasted. permalink award report block reply\nBubbahax 1 points 2 days ago That ancient fuck didnt admit anything and tried to take credit for saving jobs. permalink award report block reply\ny_do_i_need_to_hide 1 points 2 days ago Thanks, I hate it. permalink award report block reply\ngaijin_ronin 1 points 2 days ago Why the hell would you promise these pieces of crap anything?  In other words, we'll get screwed over come January. permalink award report block reply\nMiddleagedpatriot 1 points 2 days ago Doesn't matter - the vibe has been shifting. My X account gives me nothing but anti trump and this populist left bullshit. This black pill is going in on both ends at this point. permalink award report block reply\ngenericamerican69 1 points 2 days ago Even though I understand the arguments about gay marriage I am never the less glad to see the scotus refuse to hear it again. It would have given so much ammunition and motivation to the globos, similar to the abortion BS that happened in '22 and I oppose abortion as well permalink award report block reply\nMatterThatMetals 1 points 2 days ago Dirty dogs. Diseased even. They should be put down. permalink award report block reply\nMatterThatMetals 1 points 2 days ago Just wait til the retards find out these people do horrible things to children. permalink award report block reply\nkeeptherepublic1776 1 points 2 days ago Who do you think will see this? No one will permalink award report block reply\nKlaus73 1 points 2 days ago Errr that video doesn't support that claim. It does admit the democrats were protesting administration policy. God damn I hate clickbait shit. permalink award report block reply\nRusty_Bungus 1 points 2 days ago They aren't stupid...they're evil. permalink award report block reply\nConstitution_1788 1 points 2 days ago They got absolutely steamrolled. It’s glorious. permalink award report block reply\nInduceddrag 1 points 2 days ago What I don’t understand is that people actually believe these 8 senators suddenly switched sides on this bill.  I fully believe that Schumer and his inner circle decided they were losing and assembled a group of senators to pass the CR. This is all political theater and many of the pundits from both sides seem a bit daft taking the votes on their face value.  Neither side wanted any of the blame for widespread airline chaos over the Thanksgiving holidays. permalink award report block reply\nBelleoffreedom 1 points 2 days ago Durbin was not his usual self as he read that statement.  I wonder what happened to him. permalink award report block reply DieHeretic 1 points 2 days ago He's 80 years old and in rapid physical decline.\nDurbin has already announced his retirement and will not seek a sixth term in the midterms.\nHis current term will end in January 2027. I'd give odds he won't make it, he looks like cancer is eating on him. permalink parent award report block reply\nDieHeretic 1 points 2 days ago He's 80 years old and in rapid physical decline.\nDurbin has already announced his retirement and will not seek a sixth term in the midterms.\nHis current term will end in January 2027. I'd give odds he won't make it, he looks like cancer is eating on him. permalink parent award report block reply\nTheDevilMonkey 1 points 2 days ago Only thing \"cooked\" is 3/4 of the brains around here... permalink award report block reply booblitchutz 3 points 2 days ago Wasn't Eric Daugherty one of the accounts that was busted taking bribes from soda companies? permalink parent award report block reply henri_derelicte 1 points 2 days ago He gets stickied a lot for some reason… permalink parent award report block reply booblitchutz 1 points 2 days ago There's not a very big ecosystem of \"MAGA influencers\". Even the ones that are disgraced like him still have a shit ton of followers on X. permalink parent award report block reply TheDevilMonkey 1 points 2 days ago I think he was. permalink parent award report block reply booblitchutz 2 points 2 days ago I just looked it up, he was, along with Ian Miles Cheong, Clown World and a few others.  Apparently Riley Gaines told them to fuck off. permalink parent award report block reply TheDevilMonkey 1 points 2 days ago Lmfao. permalink parent award report block reply\nbooblitchutz 3 points 2 days ago Wasn't Eric Daugherty one of the accounts that was busted taking bribes from soda companies? permalink parent award report block reply henri_derelicte 1 points 2 days ago He gets stickied a lot for some reason… permalink parent award report block reply booblitchutz 1 points 2 days ago There's not a very big ecosystem of \"MAGA influencers\". Even the ones that are disgraced like him still have a shit ton of followers on X. permalink parent award report block reply TheDevilMonkey 1 points 2 days ago I think he was. permalink parent award report block reply booblitchutz 2 points 2 days ago I just looked it up, he was, along with Ian Miles Cheong, Clown World and a few others.  Apparently Riley Gaines told them to fuck off. permalink parent award report block reply TheDevilMonkey 1 points 2 days ago Lmfao. permalink parent award report block reply\nhenri_derelicte 1 points 2 days ago He gets stickied a lot for some reason… permalink parent award report block reply booblitchutz 1 points 2 days ago There's not a very big ecosystem of \"MAGA influencers\". Even the ones that are disgraced like him still have a shit ton of followers on X. permalink parent award report block reply\nbooblitchutz 1 points 2 days ago There's not a very big ecosystem of \"MAGA influencers\". Even the ones that are disgraced like him still have a shit ton of followers on X. permalink parent award report block reply\nTheDevilMonkey 1 points 2 days ago I think he was. permalink parent award report block reply booblitchutz 2 points 2 days ago I just looked it up, he was, along with Ian Miles Cheong, Clown World and a few others.  Apparently Riley Gaines told them to fuck off. permalink parent award report block reply TheDevilMonkey 1 points 2 days ago Lmfao. permalink parent award report block reply\nbooblitchutz 2 points 2 days ago I just looked it up, he was, along with Ian Miles Cheong, Clown World and a few others.  Apparently Riley Gaines told them to fuck off. permalink parent award report block reply TheDevilMonkey 1 points 2 days ago Lmfao. permalink parent award report block reply\nTheDevilMonkey 1 points 2 days ago Lmfao. permalink parent award report block reply\nDieHeretic 1 points 2 days ago I know it won't happen as Thune is a gutless wonder, but as soon as the vote is taken on the continuing resolution Thune should fuck the democrats right in the ass with red-hot poker and renege on any other part of the deal. permalink award report block reply\nGonzotron5000 1 points 2 days ago When I was you g in the 90s the Democrats claimed the Republicans wanted to starve children because they wanted to cut school lumch programs. Then they roasted school lunches for being horrible. Now they (the democrats) are actually starving children. permalink award report block reply\n74lampshades 1 points 2 days ago \"Starve children\". Yeah, I don't buy that. No kid is going to die of hunger. permalink award report block reply sun_wolf 1 points 2 days ago I doubt anyone even lost 5 pounds. permalink parent award report block reply\nsun_wolf 1 points 2 days ago I doubt anyone even lost 5 pounds. permalink parent award report block reply\nIts_Time 0 points 2 days ago So both parties deprived children of food to score poltical points.  All of them despicable. permalink award report block reply DieHeretic 1 points 2 days ago Not one child was deprived of food by the government, their parents refusing to get a job did that. permalink parent award report block reply\nDieHeretic 1 points 2 days ago Not one child was deprived of food by the government, their parents refusing to get a job did that. permalink parent award report block reply\nRudy_DankMemer 0 points 2 days ago Starvation I'm still waiting for photographic evidence of one single American becoming emaciated during the last 30 days. Fuck this farce. permalink award report block reply\nHoganT 0 points 2 days ago Oh, so we support SNAP now and were trying to defend it? Such disingenuous bullshit going around here. permalink award report block reply ModernKnight 4 points 2 days ago Agreed.  None of these kids are starving, they're fat.  We need to get rid of all gibs. permalink parent award report block reply berserkerbarrage 2 points 2 days ago The Democrats shut down the government and deliberately defunded SNAP so that they could falsely blame Trump and the Republicans. Whether or not I personally support SNAP is irrelevant to the conversation. permalink parent award report block reply HoganT 0 points 2 days ago From the overwhelming consensus here the past few weeks, they did us a huge favor then and did something we desperately want done but would never have to balls to do. permalink parent award report block reply\nModernKnight 4 points 2 days ago Agreed.  None of these kids are starving, they're fat.  We need to get rid of all gibs. permalink parent award report block reply\nberserkerbarrage 2 points 2 days ago The Democrats shut down the government and deliberately defunded SNAP so that they could falsely blame Trump and the Republicans. Whether or not I personally support SNAP is irrelevant to the conversation. permalink parent award report block reply HoganT 0 points 2 days ago From the overwhelming consensus here the past few weeks, they did us a huge favor then and did something we desperately want done but would never have to balls to do. permalink parent award report block reply\nHoganT 0 points 2 days ago From the overwhelming consensus here the past few weeks, they did us a huge favor then and did something we desperately want done but would never have to balls to do. permalink parent award report block reply\nconservativefrank -2 points 2 days ago Meanwhile, Newsome is the next President. permalink award report block reply",
  "fetched_at": "2025-11-12T20:11:55.974760Z"
}